[
    {
        "year": "2021",
        "name": "9th 3DV 2021",
        "info": "London, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2021",
                "sub_name": "International Conference on 3D Vision, 3DV 2021, London, United Kingdom, December 1-3, 2021.",
                "count": 141,
                "papers": [
                    "Learning To Disambiguate Strongly Interacting Hands via Probabilistic Per-Pixel Part Segmentation.",
                    "A Skeleton-Driven Neural Occupancy Representation for Articulated Hands.",
                    "RealisticHands: A Hybrid Model for 3D Hand Reconstruction.",
                    "EgoGlass: Egocentric-View Human Pose Estimation From an Eyeglass Frame.",
                    "Exemplar Fine-Tuning for 3D Human Model Fitting Towards In-the-Wild 3D Human Pose Estimation.",
                    "Body Size and Depth Disambiguation in Multi-Person Reconstruction from Single Images.",
                    "GenIcoNet: Generative Icosahedral Mesh Convolutional Network.",
                    "PoseContrast: Class-Agnostic Object Viewpoint Estimation in the Wild with Pose-Aware Contrastive Learning.",
                    "3D Reconstruction of Novel Object Shapes from Single Images.",
                    "DiffSDFSim: Differentiable Rigid-Body Dynamics With Implicit Shapes.",
                    "SceneFormer: Indoor Scene Generation with Transformers.",
                    "Mix3D: Out-of-Context Data Augmentation for 3D Scenes.",
                    "Algebraic Constraint for Preserving Convexity of Planar Homography.",
                    "MaCal - Macro Lens Calibration and the Focus Stack Camera Model.",
                    "Visual Camera Re-Localization Using Graph Neural Networks and Relative Pose Supervision.",
                    "Practical Pose Trajectory Splines With Explicit Regularization.",
                    "Deep Regression on Manifolds: A 3D Rotation Case Study.",
                    "DPFM: Deep Partial Functional Maps.",
                    "Non-Linear Anisotropic Diffusion for Memory-Efficient Computed Tomography Super-Resolution Reconstruction.",
                    "Spectral Reconstruction and Disparity from Spatio-Spectrally Coded Light Fields via Multi-Task Deep Learning.",
                    "E-RAFT: Dense Optical Flow from Event Cameras.",
                    "Neural Disparity Refinement for Arbitrary Resolution Stereo.",
                    "RAFT-Stereo: Multilevel Recurrent Field Transforms for Stereo Matching.",
                    "Monocular Depth Estimation Primed by Salient Point Detection and Normalized Hessian Loss.",
                    "Wild ToFu: Improving Range and Quality of Indirect Time-of-Flight Depth with RGB Fusion in Challenging Environments.",
                    "Globally Optimal Multi-Scale Monocular Hand-Eye Calibration Using Dual Quaternions.",
                    "HumanGAN: A Generative Model of Human Images.",
                    "Dance In the Wild: Monocular Human Animation with Neural Dynamic Appearance Synthesis.",
                    "LatentHuman: Shape-and-Pose Disentangled Latent Representation for Human Bodies.",
                    "Dual Mesh Convolutional Networks for Human Shape Correspondence.",
                    "Multi-scale Space-time Registration of Growing Plants.",
                    "VoRTX: Volumetric 3D Reconstruction With Transformers for Voxelwise View Selection and Fusion.",
                    "RefRec: Pseudo-labels Refinement via Shape Reconstruction for Unsupervised 3D Domain Adaptation.",
                    "DeepBBS: Deep Best Buddies for Point Cloud Registration.",
                    "Scalable Cluster-Consistency Statistics for Robust Multi-Object Matching.",
                    "Learning 3D Semantic Segmentation with only 2D Image Supervision.",
                    "Deep Physics-aware Inference of Cloth Deformation for Monocular Human Performance Capture.",
                    "Event Guided Depth Sensing.",
                    "Leveraging Spatial and Photometric Context for Calibrated Non-Lambertian Photometric Stereo.",
                    "Investigating Attention Mechanism in 3D Point Cloud Object Detection.",
                    "Semi-supervised 3D Object Detection via Temporal Graph Neural Networks.",
                    "3D Lip Event Detection via Interframe Motion Divergence at Multiple Temporal Resolutions.",
                    "Monocular 3D Reconstruction of Interacting Hands via Collision-Aware Factorized Refinements.",
                    "L2D2: Learnable Line Detector and Descriptor.",
                    "Synergy between 3DMM and 3D Landmarks for Accurate 3D Facial Geometry.",
                    "Channel-Wise Attention-Based Network for Self-Supervised Monocular Depth Estimation.",
                    "SVMAC: Unsupervised 3D Human Pose Estimation from a Single Image with Single-view-multi-angle Consistency.",
                    "Deep Multi-View Stereo Gone Wild.",
                    "Data-Driven 3D Reconstruction of Dressed Humans From Sparse Views.",
                    "Joint 3D Human Shape Recovery and Pose Estimation from a Single Image with Bilayer Graph.",
                    "Modality-Guided Subnetwork for Salient Object Detection.",
                    "Curiosity-driven 3D Object Detection Without Labels.",
                    "MP-Mono: Monocular 3D Detection Using Multiple Priors for Autonomous Driving.",
                    "Neural Human Deformation Transfer.",
                    "Learning Local Recurrent Models for Human Mesh Recovery.",
                    "A Spatio-temporal Transformer for 3D Human Motion Prediction.",
                    "Conflicts between Likelihood and Knowledge Distillation in Task Incremental Learning for 3D Object Detection.",
                    "Leveraging MoCap Data for Human Mesh Recovery.",
                    "Intention-based Long-Term Human Motion Anticipation.",
                    "Exploring Versatile Prior for Human Motion via Motion Frequency Guidance.",
                    "Fusing Posture and Position Representations for Point Cloud-Based Hand Gesture Recognition.",
                    "Self-Supervised Monocular Scene Decomposition and Depth Estimation.",
                    "Variational Monocular Depth Estimation for Reliability Prediction.",
                    "PanoDepth: A Two-Stage Approach for Monocular Omnidirectional Depth Estimation.",
                    "Towards Unconstrained Joint Hand-Object Reconstruction From RGB Videos.",
                    "Spatio-Temporal Human Shape Completion With Implicit Function Networks.",
                    "SAFA: Structure Aware Face Animation.",
                    "KAMA: 3D Keypoint Aware Body Mesh Articulation.",
                    "3DVNet: Multi-View Depth Prediction and Volumetric Refinement.",
                    "Dynamic Multi-Person Mesh Recovery From Uncalibrated Multi-View Cameras.",
                    "Direct Dense Pose Estimation.",
                    "Self-Supervised Light Field Depth Estimation Using Epipolar Plane Images.",
                    "PLNet: Plane and Line Priors for Unsupervised Indoor Depth Estimation.",
                    "R4Dyn: Exploring Radar for Self-Supervised Monocular Depth Estimation of Dynamic Scenes.",
                    "Parameterization of Ambiguity in Monocular Depth Prediction.",
                    "Task-Generic Hierarchical Human Motion Prior using VAEs.",
                    "Occlusion Guided Self-supervised Scene Flow Estimation on 3D Point Clouds.",
                    "Collaborative Regression of Expressive Bodies using Moderation.",
                    "HyNet: 3D Segmentation Using Hybrid Graph Networks.",
                    "SIDER: Single-Image Neural Optimization for Facial Geometric Detail Recovery.",
                    "Unsupervised Monocular Depth Reconstruction of Non-Rigid Scenes.",
                    "Attention meets Geometry: Geometry Guided Spatial-Temporal Attention for Consistent Self-Supervised Monocular Depth Estimation.",
                    "NVS-MonoDepth: Improving Monocular Depth Prediction with Novel View Synthesis.",
                    "Residual Geometric Feature Transform Network for 3D Surface Super-Resolution.",
                    "Open-set 3D Object Detection.",
                    "PhysXNet: A Customizable Approach for Learning Cloth Dynamics on Dressed People.",
                    "Human Performance Capture from Monocular Video in the Wild.",
                    "SUPPLE: Extracting Hand Skeleton with Spherical Unwrapping Profiles.",
                    "NeuralDiff: Segmenting 3D objects that move in egocentric videos.",
                    "Learning Scale-Adaptive Representations for Point-Level LiDAR Semantic Segmentation.",
                    "4D Human Body Capture from Egocentric Video via 3D Scene Grounding.",
                    "NeeDrop: Self-supervised Shape Representation from Sparse Point Clouds using Needle Dropping.",
                    "CAMPARI: Camera-Aware Decomposed Generative Neural Radiance Fields.",
                    "FiG-NeRF: Figure-Ground Neural Radiance Fields for 3D Object Category Modelling.",
                    "Stochastic Neural Radiance Fields: Quantifying Uncertainty in Implicit 3D Representations.",
                    "3D-MetaConNet: Meta-learning for 3D Shape Classification and Segmentation.",
                    "Generative Zero-Shot Learning for Semantic Segmentation of 3D Point Clouds.",
                    "Fine-Grained VR Sketching: Dataset and Insights.",
                    "PolyNet: Polynomial Neural Network for 3D Shape Recognition with PolyShape Representation.",
                    "Point2FFD: Learning Shape Representations of Simulation-Ready 3D Models for Engineering Design Optimization.",
                    "Projective Urban Texturing.",
                    "Representing Shape Collections With Alignment-Aware Linear Models.",
                    "AIR-Nets: An Attention-Based Framework for Locally Conditioned Implicit Representations.",
                    "Softmesh: Learning Probabilistic Mesh Connectivity via Image Supervision.",
                    "Recovering Real-World Reflectance Properties and Shading From HDR Imagery.",
                    "NVSS: High-quality Novel View Selfie Synthesis.",
                    "RGBD-Net: Predicting Color and Depth Images for Novel Views Synthesis.",
                    "TermiNeRF: Ray Termination Prediction for Efficient Neural Rendering.",
                    "Attacking Image Classifiers To Generate 3D Textures.",
                    "Ray Tracing-Guided Design of Plenoptic Cameras.",
                    "It Is All In The Weights: Robust Rotation Averaging Revisited.",
                    "Digging Into Self-Supervised Learning of Feature Descriptors.",
                    "GCSR: Gray Code Super-Resolution 3D Scanning.",
                    "ESL: Event-based Structured Light.",
                    "Direct-PoseNet: Absolute Pose Regression with Photometric Consistency.",
                    "Shortest Paths in Graphs with Matrix-Valued Edges: Concepts, Algorithm and Application to 3D Multi-Shape Analysis.",
                    "Geometric Adversarial Attacks and Defenses on 3D Point Clouds.",
                    "Learning Iterative Robust Transformation Synchronization.",
                    "Convex Joint Graph Matching and Clustering via Semidefinite Relaxations.",
                    "DurLAR: A High-Fidelity 128-Channel LiDAR Dataset with Panoramic Ambient and Reflectivity Imagery for Multi-Modal Autonomous Driving Applications.",
                    "Learning Residue-Aware Correlation Filters and Refining Scale Estimates with the GrabCut for Real-Time UAV Tracking.",
                    "Go with the Flows: Mixtures of Normalizing Flows for Point Cloud Generation and Reconstruction.",
                    "Neighborhood-based Neural Implicit Reconstruction from Point Clouds.",
                    "GASCN: Graph Attention Shape Completion Network.",
                    "NeuralBlox: Real-Time Neural Representation Fusion for Robust Volumetric Mapping.",
                    "MeshMVS: Multi-View Stereo Guided Mesh Reconstruction.",
                    "High Fidelity 3D Reconstructions with Limited Physical Views.",
                    "Mesh-Based Reconstruction of Dynamic Foam Images Using X-Ray CT.",
                    "Multi-Category Mesh Reconstruction From Image Collections.",
                    "A Dataset-Dispersion Perspective on Reconstruction Versus Recognition in Single-View 3D Reconstruction Networks.",
                    "Dual Geometric Graph Network (DG2N) Iterative Network for Deformable Shape Alignment.",
                    "3D Point Cloud Registration with Multi-Scale Architecture and Unsupervised Transfer Learning.",
                    "DSP-SLAM: Object Oriented SLAM with Deep Shape Priors.",
                    "Object SLAM-Based Active Mapping and Robotic Grasping.",
                    "Image Stitching with Locally Shared Rotation Axis.",
                    "Robust Fitting with Truncated Least Squares: A Bilevel Optimization Approach.",
                    "Lifted Semantic Graph Embedding for Omnidirectional Place Recognition.",
                    "3D reconstruction of insects: an improved multifocus stacking and an evaluation of learning-based MVS approaches.",
                    "FLYBO: A Unified Benchmark Environment for Autonomous Flying Robots.",
                    "Efficiently Distributed Watertight Surface Reconstruction.",
                    "DPC: Unsupervised Deep Point Correspondence via Cross and Self Construction."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "8th 3DV 2020",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2020",
                "sub_name": "8th International Conference on 3D Vision, 3DV 2020, Virtual Event, Japan, November 25-28, 2020.",
                "count": 124,
                "papers": [
                    "Message from the 3DV 2020 Program Chairs.",
                    "Neural Ray Surfaces for Self-Supervised Learning of Depth and Ego-motion.",
                    "Deep NRSfM++: Towards Unsupervised 2D-3D Lifting in the Wild.",
                    "Nighttime Stereo Depth Estimation using Joint Translation-Stereo Learning: Light Effects and Uninformative Regions.",
                    "Underwater Scene Recovery Using Wavelength-Dependent Refraction of Light.",
                    "Improving Structure from Motion with Reliable Resectioning.",
                    "Reducing Drift in Structure From Motion Using Extended Features.",
                    "COALESCE: Component Assembly by Learning to Synthesize Connections.",
                    "Improved Modeling of 3D Shapes with Multi-view Depth Maps.",
                    "Towards 3D VR-Sketch to 3D Shape Retrieval.",
                    "Fast Simultaneous Gravitational Alignment of Multiple Point Sets.",
                    "KAPLAN: A 3D Point Descriptor for Shape Completion.",
                    "LMSCNet: Lightweight Multiscale 3D Semantic Completion.",
                    "Instant recovery of shape from spectrum via latent space connections.",
                    "Differential Photometric Consistency.",
                    "Distributed Photometric Bundle Adjustment.",
                    "Self-Supervised Learning of Non-Rigid Residual Flow and Ego-Motion.",
                    "A Divide et Impera Approach for 3D Shape Reconstruction from Multiple Views.",
                    "Time Shifted IMU Preintegration for Temporal Calibration in Incremental Visual-Inertial Initialization.",
                    "RANP: Resource Aware Neuron Pruning at Initialization for 3D CNNs.",
                    "Torch-Points3D: A Modular Multi-Task Framework for Reproducible Deep Learning on 3D Point Clouds.",
                    "Learning Rotation-Invariant Representations of Point Clouds Using Aligned Edge Convolutional Neural Networks.",
                    "Global Context Aware Convolutions for 3D Point Cloud Understanding.",
                    "Screen-space Regularization on Differentiable Rasterization.",
                    "Cycle-Consistent Generative Rendering for 2D-3D Modality Translation.",
                    "Graphite: Graph-Induced Feature Extraction for Point Cloud Registration.",
                    "Simulated Annealing for 3D Shape Correspondence.",
                    "Scene Flow from Point Clouds with or without Learning.",
                    "Two-Stage Relation Constraint for Semantic Segmentation of Point Clouds.",
                    "3D-Aware Ellipse Prediction for Object-Based Camera Pose Estimation.",
                    "Introducing Pose Consistency and Warp-Alignment for Self-Supervised 6D Object Pose Estimation in Color Images.",
                    "SMPLy Benchmarking 3D Human Pose Estimation in the Wild.",
                    "PoseNet3D: Learning Temporally Consistent 3D Human Pose via Knowledge Distillation.",
                    "MonoClothCap: Towards Temporally Coherent Clothing Capture from Monocular RGB Video.",
                    "Grasping Field: Learning Implicit Representations for Human Grasps.",
                    "Semantic Deep Face Models.",
                    "High-Dynamic-Range Lighting Estimation From Face Portraits.",
                    "Matching-space Stereo Networks for Cross-domain Generalization.",
                    "Do End-to-end Stereo Algorithms Under-utilize Information?",
                    "Refractive Multi-view Stereo.",
                    "BP-MVSNet: Belief-Propagation-Layers for Multi-View-Stereo.",
                    "DeepC-MVS: Deep Confidence Prediction for Multi-View Stereo Reconstruction.",
                    "RocNet: Recursive Octree Network for Efficient 3D Deep Representation.",
                    "Semantic Implicit Neural Scene Representations With Semi-Supervised Training.",
                    "Learning to Infer Semantic Parameters for 3D Shape Editing.",
                    "Recalibration of Neural Networks for Point Cloud Analysis.",
                    "Learning Implicit Surface Light Fields.",
                    "KeystoneDepth: History in 3D.",
                    "Learning Wasserstein Isometric Embedding for Point Clouds.",
                    "Benchmarking Image Retrieval for Visual Localization.",
                    "Class-unbalanced domain adaptation for object detection via dynamic weighting mechanism.",
                    "Rotation-Invariant Point Convolution With Multiple Equivariant Alignments.",
                    "DynOcc: Learning Single-View Depth from Dynamic Occlusion Cues.",
                    "Deep Depth Estimation on 360° Images with a Double Quaternion Loss.",
                    "Learning Monocular Dense Depth from Events.",
                    "Deep Sketch-Based Modeling: Tips and Tricks.",
                    "VIPNet: A Fast and Accurate Single-View Volumetric Reconstruction by Learning Sparse Implicit Point Guidance.",
                    "Registration Loss Learning for Deep Probabilistic Point Set Registration.",
                    "Unsupervised Dense Shape Correspondence using Heat Kernels.",
                    "Adiabatic Quantum Graph Matching with Permutation Matrix Constraints.",
                    "Better Patch Stitching for Parametric Surface Reconstruction.",
                    "Correspondence Matrices are Underrated.",
                    "Motion Annotation Programs: A Scalable Approach to Annotating Kinematic Articulations in Large 3D Shape Collections.",
                    "A Transformer-Based Network for Dynamic Hand Gesture Recognition.",
                    "Depthwise Separable Temporal Convolutional Network for Action Segmentation.",
                    "PLACE: Proximity Learning of Articulation and Contact in 3D Environments.",
                    "RidgeSfM: Structure from Motion via Robust Pairwise Matching Under Depth Uncertainty.",
                    "Visualizing Spectral Bundle Adjustment Uncertainty.",
                    "A Linear Approach to Absolute Pose Estimation for Light Fields.",
                    "Joint Unsupervised Learning of Optical Flow and Egomotion with Bi-Level optimization.",
                    "Intrinsic Dynamic Shape Prior for Dense Non-Rigid Structure from Motion.",
                    "GAMesh: Guided and Augmented Meshing for Deep Point Networks.",
                    "A Progressive Conditional Generative Adversarial Network for Generating Dense and Colored 3D Point Clouds.",
                    "Depth Completion Using a View-constrained Deep Prior.",
                    "Compression and Completion of Animated Point Clouds using Topological Properties of the Manifold.",
                    "Self-supervised Depth Denoising Using Lower- and Higher-quality RGB-D sensors.",
                    "PanoNet3D: Combining Semantic and Geometric Understanding for LiDAR Point Cloud Detection.",
                    "Dense Point Diffusion for 3D Object Detection.",
                    "SF-UDA3D: Source-Free Unsupervised Domain Adaptation for LiDAR-Based 3D Object Detection.",
                    "LiDAR-based Recurrent 3D Semantic Segmentation with Temporal Memory Alignment.",
                    "Rethinking PointNet Embedding for Faster and Compact Model.",
                    "SCFusion: Real-time Incremental Scene Reconstruction with Semantic Completion.",
                    "Smart Time-Multiplexing of Quads Solves the Multicamera Interference Problem.",
                    "Restoration of Motion Blur in Time-of-Flight Depth Image Using Data Alignment.",
                    "Temporal LiDAR Frame Prediction for Autonomous Driving.",
                    "Deep LiDAR localization using optical flow sensor-map correspondences.",
                    "Learning Distribution Independent Latent Representation for 3D Face Disentanglement.",
                    "Learning 3D Faces from Photo-Realistic Facial Synthesis.",
                    "GIF: Generative Interpretable Faces.",
                    "PeeledHuman: Robust Shape Representation for Textured 3D Human Body Reconstruction.",
                    "Do We Need Depth in State-Of-The-Art Face Authentication?",
                    "Error Bounds of Projection Models in Weakly Supervised 3D Human Pose Estimation.",
                    "LCD - Line Clustering and Description for Place Recognition.",
                    "Convolutional Autoencoders for Human Motion Infilling.",
                    "3D Deep Learning for Biological Function Prediction from Physical Fields.",
                    "Using Image Sequences for Long-Term Visual Localization.",
                    "NodeSLAM: Neural Object Descriptors for Multi-View Shape Reconstruction.",
                    "FC-vSLAM: Integrating Feature Credibility in Visual SLAM.",
                    "LM-Reloc: Levenberg-Marquardt Based Direct Visual Relocalization.",
                    "HyperSLAM: A Generic and Modular Approach to Sensor Fusion and Simultaneous Localization And Mapping in Continuous-Time.",
                    "RotPredictor: Unsupervised Canonical Viewpoint Learning for Point Cloud Classification.",
                    "Scalable Point Cloud-based Reconstruction with Local Implicit Functions.",
                    "Efficient Scene Compression for Visual-based Localization.",
                    "Self-Supervised Learning of Point Clouds via Orientation Estimation.",
                    "MaskNet: A Fully-Convolutional Network to Estimate Inlier Points.",
                    "Self-Supervised 2D Image to 3D Shape Translation with Disentangled Representations.",
                    "Adversarial Self-Supervised Scene Flow Estimation.",
                    "Localising In Complex Scenes Using Balanced Adversarial Adaptation.",
                    "Spatial Attention Improves Iterative 6D Object Pose Estimation.",
                    "A New Distributional Ranking Loss With Uncertainty: Illustrated in Relative Depth Estimation.",
                    "Style Transfer for Keypoint Matching Under Adverse Conditions.",
                    "Saliency Guided Subdivision for Single-View Mesh Reconstruction.",
                    "Fast Discontinuity-Aware Subpixel Correspondence in Structured Light.",
                    "Generalized Pose-and-Scale Estimation using 4-Point Congruence Constraints.",
                    "Learning to Guide Local Feature Matches.",
                    "Towards Geometry Guided Neural Relighting with Flash Photography.",
                    "Precomputed Radiance Transfer for Reflectance and Lighting Estimation.",
                    "Deep SVBRDF Estimation on Real Materials.",
                    "TRANSPR: Transparency Ray-Accumulating Neural 3D Scene Point Renderer.",
                    "Intrinsic Autoencoders for Joint Deferred Neural Rendering and Intrinsic Image Decomposition.",
                    "Shape from Tracing: Towards Reconstructing 3D Object Geometry and SVBRDF Material from Images via Differentiable Path Tracing.",
                    "Deep Learning Based Single-Photon 3D Imaging with Multiple Returns.",
                    "A Novel Depth from Defocus Framework Based on a Thick Lens Camera Model.",
                    "Towards a MEMS-based Adaptive LIDAR."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "7th 3DV 2019",
        "info": "Québec City, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2019",
                "sub_name": "2019 International Conference on 3D Vision, 3DV 2019, Québec City, QC, Canada, September 16-19, 2019.",
                "count": 79,
                "papers": [
                    "MVS2: Deep Unsupervised Multi-View Stereo with Multi-View Symmetry.",
                    "Fast Stereo Disparity Maps Refinement By Fusion of Data-Based And Model-Based Estimations.",
                    "Structured Coupled Generative Adversarial Networks for Unsupervised Monocular Depth Estimation.",
                    "DispVoxNets: Non-Rigid Point Set Alignment with Supervised Learning Proxies.",
                    "Correspondence-Free Region Localization for Partial Shape Similarity via Hamiltonian Spectrum Alignment.",
                    "Effective Rotation-Invariant Point CNN with Spherical Harmonics Kernels.",
                    "Structured Domain Adaptation for 3D Keypoint Estimation.",
                    "Learning Point Embeddings from Shape Repositories for Few-Shot Segmentation.",
                    "Pano Popups: Indoor 3D Reconstruction with a Plane-Aware Network.",
                    "IoU Loss for 2D/3D Object Detection.",
                    "Pixel-Accurate Depth Evaluation in Realistic Driving Scenarios.",
                    "SyDPose: Object Detection and Pose Estimation in Cluttered Real-World Depth Images Trained using Only Synthetic Data.",
                    "NoVA: Learning to See in Novel Viewpoints and Domains.",
                    "Learning Depth from Endoscopic Images.",
                    "Pairwise Attention Encoding for Point Cloud Feature Learning.",
                    "PC-Net: Unsupervised Point Correspondence Learning with Neural Networks.",
                    "A Unified Point-Based Framework for 3D Segmentation.",
                    "Optimising for Scale in Globally Multiply-Linked Gravitational Point Set Registration Leads to Singularities.",
                    "3D Neighborhood Convolution: Learning Depth-Aware Features for RGB-D and RGB Semantic Segmentation.",
                    "To Complete or to Estimate, That is the Question: A Multi-Task Approach to Depth Completion and Monocular Depth Estimation.",
                    "Frequency Shift Triangulation: A Robust Fringe Projection Technique for 3D Shape Acquisition in the Presence of Strong Interreflections.",
                    "Rotation Invariant Convolutions for 3D Point Clouds Deep Learning.",
                    "Accurate and Real-Time Object Detection Based on Bird's Eye View on 3D Point Clouds.",
                    "Photometric Segmentation: Simultaneous Photometric Stereo and Masking.",
                    "High-Resolution Augmentation for Automatic Template-Based Matching of Human Models.",
                    "V-NAS: Neural Architecture Search for Volumetric Medical Image Segmentation.",
                    "Learning to Think Outside the Box: Wide-Baseline Light Field Depth Estimation with EPI-Shift.",
                    "360° Surface Regression with a Hyper-Sphere Loss.",
                    "Asynchronous Multi-Hypothesis Tracking of Features with Event Cameras.",
                    "Towards Accurate 3D Human Body Reconstruction from Silhouettes.",
                    "Progression Modelling for Online and Early Gesture Detection.",
                    "Predicting Animation Skeletons for 3D Articulated Models via Volumetric Nets.",
                    "Motion Capture from Pan-Tilt Cameras with Unknown Orientation.",
                    "Convex Optimisation for Inverse Kinematics.",
                    "Revisiting Depth Image Fusion with Variational Message Passing.",
                    "Distributed Surface Reconstruction from Point Cloud for City-Scale Scenes.",
                    "Web Stereo Video Supervision for Depth Prediction from Dynamic Scenes.",
                    "Learning to Refine 3D Human Pose Sequences.",
                    "Reconstruction of As-is Semantic 3D Models of Unorganised Storehouses.",
                    "Dynamic Surface Animation using Generative Networks.",
                    "Decoupled Hybrid 360° Panoramic Stereo Video.",
                    "Unsupervised Feature Learning for Point Cloud Understanding by Contrasting and Clustering Using Graph Convolutional Neural Networks.",
                    "Multi-Person 3D Human Pose Estimation from Monocular Images.",
                    "Optimal, Non-Rigid Alignment for Feature-Preserving Mesh Denoising.",
                    "Enhancing Self-Supervised Monocular Depth Estimation with Traditional Visual Odometry.",
                    "Creating Realistic Ground Truth Data for the Evaluation of Calibration Methods for Plenoptic and Conventional Cameras.",
                    "Multi-Spectral Visual Odometry without Explicit Stereo Matching.",
                    "Simultaneous Shape Registration and Active Stereo Shape Reconstruction using Modified Bundle Adjustment.",
                    "Semantic Segmentation of Sparsely Annotated 3D Point Clouds by Pseudo-Labelling.",
                    "SIR-Net: Scene-Independent End-to-End Trainable Visual Relocalizer.",
                    "Light Field Compression using Eigen Textures.",
                    "Res3ATN - Deep 3D Residual Attention Network for Hand Gesture Recognition in Videos.",
                    "Physics-Aware 3D Mesh Synthesis.",
                    "Sparse-to-Dense Hypercolumn Matching for Long-Term Visual Localization.",
                    "Unified Underwater Structure-from-Motion.",
                    "Learned Multi-View Texture Super-Resolution.",
                    "Online Stability Improvement of Gröbner Basis Solvers using Deep Learning.",
                    "Surface Reconstruction from 3D Line Segments.",
                    "Let's Take This Online: Adapting Scene Coordinate Regression Network Predictions for Online RGB-D Camera Relocalisation.",
                    "Mobile Photometric Stereo with Keypoint-Based SLAM for Dense 3D Reconstruction.",
                    "Location Field Descriptors: Single Image 3D Model Retrieval in the Wild.",
                    "On the Redundancy Detection in Keyframe-Based SLAM.",
                    "SIPs: Succinct Interest Points from Unsupervised Inlierness Probability Learning.",
                    "On Object Symmetries and 6D Pose Estimation from Images.",
                    "AlignNet-3D: Fast Point Cloud Registration of Partially Observed Objects.",
                    "UnDispNet: Unsupervised Learning for Multi-Stage Monocular Depth Prediction.",
                    "360-Degree Textures of People in Clothing from a Single Image.",
                    "Adaptive-Resolution Octree-Based Volumetric SLAM.",
                    "Multimodal 3D Human Pose Estimation from a Single Image.",
                    "Effective Convolutional Neural Network Layers in Flow Estimation for Omni-Directional Images.",
                    "Learning to Translate Between Real World and Simulated 3D Sensors While Transferring Task Models.",
                    "Spherical View Synthesis for Self-Supervised 360° Depth Estimation.",
                    "Adaptive Mesh Texture for Multi-View Appearance Modeling.",
                    "Real-Time Multi-Material Reflectance Reconstruction for Large-Scale Scenes Under Uncontrolled Illumination from RGB-D Image Sequences.",
                    "Language2Pose: Natural Language Grounded Pose Forecasting.",
                    "Synthesizing Diverse Lung Nodules Wherever Massively: 3D Multi-Conditional GAN-Based CT Image Augmentation for Object Detection.",
                    "Multiple Point Light Estimation from Low-Quality 3D Reconstructions.",
                    "Fast Non-Convex Hull Computation.",
                    "Incorporating 3D Information Into Visual Question Answering."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "6th 3DV 2018",
        "info": "Verona, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2018",
                "sub_name": "2018 International Conference on 3D Vision, 3DV 2018, Verona, Italy, September 5-8, 2018.",
                "count": 81,
                "papers": [
                    "Keep it Unreal: Bridging the Realism Gap for 2.5D Recognition with Geometry Priors Only.",
                    "Surface Light Field Fusion.",
                    "Joint Material and Illumination Estimation from Photo Sets in the Wild.",
                    "Fusion++: Volumetric Object-Level SLAM.",
                    "Patch-Based Non-rigid 3D Reconstruction from a Single Depth Stream.",
                    "Sparse and Dense Data with CNNs: Depth Completion and Semantic Segmentation.",
                    "Multi-scale CNN Stereo and Pattern Removal Technique for Underwater Active Stereo System.",
                    "A Multi-resolution Approach for Color Correction of Textured Meshes.",
                    "Progressive Large-Scale Structure-from-Motion with Orthogonal MSTs.",
                    "Multi-scale Direct Sparse Visual Odometry for Large-Scale Natural Environment.",
                    "Detailed Human Avatars from Monocular Video.",
                    "DeepHPS: End-to-end Estimation of 3D Hand Pose and Shape by Learning from Synthetic Depth.",
                    "Single-Shot Multi-person 3D Pose Estimation from Monocular RGB.",
                    "Reconstruction of Interior Walls from Point Cloud Data with Min-Hashed J-Linkage.",
                    "Structure-Aware Shape Synthesis.",
                    "Learning Material-Aware Local Descriptors for 3D Shapes.",
                    "Joint Representation of Primitive and Non-primitive Objects for 3D Vision.",
                    "Joint Alignment of Multiple Generalized Point Sets with Anisotropic Positional Uncertainty Based on Expectation Maximization.",
                    "Iterative Global Similarity Points: A Robust Coarse-to-Fine Integration Solution for Pairwise 3D Point Cloud Registration.",
                    "SegmentedFusion: 3D Human Body Reconstruction Using Stitched Bounding Boxes.",
                    "Learning to Estimate Indoor Lighting from 3D Objects.",
                    "Camera Orientation Estimation in Natural Scenes Using Semantic Cues.",
                    "Four- and Seven-Point Relative Camera Pose from Oriented Features.",
                    "UnrealStereo: Controlling Hazardous Factors to Analyze Stereo Vision.",
                    "RecResNet: A Recurrent Residual CNN Architecture for Disparity Map Enhancement.",
                    "MVDepthNet: Real-Time Multiview Depth Estimation Neural Network.",
                    "Cross-Domain Image-Based 3D Shape Retrieval by View Sequence Learning.",
                    "SeeThrough: Finding Objects in Heavily Occluded Indoor Scene Images.",
                    "Robust Fitting of Subdivision Surfaces for Smooth Shape Analysis.",
                    "Calibrating Light-Field Cameras Using Plenoptic Disc Features.",
                    "Unsupervised Depth Estimation from Light Field Using a Convolutional Neural Network.",
                    "Detail Preserving Depth Estimation from a Single Image Using Attention Guided Networks.",
                    "Structured Adversarial Training for Unsupervised Monocular Depth Estimation.",
                    "Learning Monocular Depth Estimation with Unsupervised Trinocular Assumptions.",
                    "Human-Centric Scene Understanding from Single View 360 Video.",
                    "Constant Velocity 3D Convolution.",
                    "FEATS: Synthetic Feature Tracks for Structure from Motion Evaluation.",
                    "An Image-Based Approach for 3D Reconstruction of Urban Scenes Using Architectural Symmetries.",
                    "Spatiotemporal Modeling for Efficient Registration of Dynamic 3D Faces.",
                    "Survey of Higher Order Rigid Body Motion Interpolation Methods for Keyframe Animation and Continuous-Time Trajectory Estimation.",
                    "Semantic Classification of 3D Point Clouds with Multiscale Spherical Neighborhoods.",
                    "Efficient Convolutions for Real-Time Semantic Segmentation of 3D Point Clouds.",
                    "Logistic Regression of Point Matches for Accurate Transformation Estimation.",
                    "Analyzing Body Fat from Depth Images.",
                    "Adversarial Semantic Scene Completion from a Single Depth Image.",
                    "3DTNet: Learning Local Features Using 2D and 3D Cues.",
                    "Structured Low-Rank Matrix Factorization for Point-Cloud Denoising.",
                    "Generative Adversarial Frontal View to Bird View Synthesis.",
                    "Multi-view Inpainting for RGB-D Sequence.",
                    "Rethinking Pose in 3D: Multi-stage Refinement and Recovery for Markerless Motion Capture.",
                    "Neural Body Fitting: Unifying Deep Learning and Model Based Human Pose and Shape Estimation.",
                    "3DBodyTex: Textured 3D Body Dataset.",
                    "3D Head Pose Estimation Using Tensor Decomposition and Non-linear Manifold Modeling.",
                    "Hybrid Skeleton Driven Surface Registration for Temporally Consistent Volumetric Video.",
                    "Fine-Level Semantic Labeling of Large-Scale 3D Model by Active Learning.",
                    "Plane-Based Optimization of Geometry and Texture for RGB-D Reconstruction of Indoor Scenes.",
                    "Learning a Hierarchical Latent-Variable Model of 3D Shapes.",
                    "The Double Sphere Camera Model.",
                    "DSR: Direct Self-Rectification for Uncalibrated Dual-Lens Cameras.",
                    "Monocular Depth Estimation via Deep Structured Models with Ordinal Constraints.",
                    "ESPReSSo: Efficient Slanted PatchMatch for Real-Time Spacetime Stereo.",
                    "Unsupervised Adversarial Depth Estimation Using Cycled Generative Networks.",
                    "TwinFusion: High Framerate Non-rigid Fusion through Fast Correspondence Tracking.",
                    "Learning to Reconstruct Texture-Less Deformable Surfaces from a Single View.",
                    "Multi-planar Monocular Reconstruction of Manhattan Indoor Scenes.",
                    "Novel Single View Constraints for Manhattan 3D Line Reconstruction.",
                    "Learning to Generate Facial Depth Maps.",
                    "Accurate Sparse Feature Regression Forest Learning for Real-Time Camera Relocalization.",
                    "ACE: An Efficient Asynchronous Corner Tracker for Event Cameras.",
                    "A Data-Driven Prior on Facet Orientation for Semantic Mesh Labeling.",
                    "Parsing Geometry Using Structure-Aware Shape Templates.",
                    "A 3D Coarse-to-Fine Framework for Volumetric Medical Image Segmentation.",
                    "Deep Learning Parametrization for B-Spline Curve Approximation.",
                    "Learning to Align Images Using Weak Geometric Supervision.",
                    "Self Functional Maps.",
                    "Residual MeshNet: Learning to Deform Meshes for Single-View 3D Reconstruction.",
                    "PCN: Point Completion Network.",
                    "Weakly Supervised Learning of Indoor Geometry by Dual Warping.",
                    "EOE: Expected Overlap Estimation over Unstructured Point Cloud Data.",
                    "NRGA: Gravitational Approach for Non-rigid Point Set Registration.",
                    "DUGMA: Dynamic Uncertainty-Based Gaussian Mixture Alignment."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "5th 3DV 2017",
        "info": "Qingdao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2017",
                "sub_name": "2017 International Conference on 3D Vision, 3DV 2017, Qingdao, China, October 10-12, 2017.",
                "count": 73,
                "papers": [
                    "DepthSynth: Real-Time Realistic Synthetic Data Generation from CAD Models for 2.5D Recognition.",
                    "Sparsity Invariant CNNs.",
                    "A Novel Self-Calibration Method for a Stereo-ToF System Using a Kinect V2 and Two 4K GoPro Cameras.",
                    "4D Temporally Coherent Light-Field Video.",
                    "Dynamic High Resolution Deformable Articulated Tracking.",
                    "High Dynamic Range SLAM with Map-Aware Exposure Time Control.",
                    "OctNetFusion: Learning Depth Fusion from Data.",
                    "3D Shape Reconstruction from Sketches via Multi-view Convolutional Networks.",
                    "Scalable Dense Monocular Surface Reconstruction.",
                    "Compact Model Representation for 3D Reconstruction.",
                    "Tracking Radioactive Sources through Sensor Fusion of Omnidirectional LIDAR and Isotropic Rad-Detectors.",
                    "Best Viewpoint Tracking for Camera Mounted on Robotic Arm with Dynamic Obstacles.",
                    "Continuous Signed Distance Functions for 3D Vision.",
                    "Interactive 3D Modeling with a Generative Adversarial Network.",
                    "How to Refine 3D Hand Pose Estimation from Unlabelled Depth Data?",
                    "Adversarially Parameterized Optimization for 3D Human Pose Estimation.",
                    "GSLAM: Initialization-Robust Monocular Visual SLAM via Global Structure-from-Motion.",
                    "GraphMatch: Efficient Large-Scale Graph Construction for Structure from Motion.",
                    "Fast Incremental Bundle Adjustment with Covariance Recovery.",
                    "Relative Camera Refinement for Accurate Dense Reconstruction.",
                    "Line-Based Robust SfM with Little Image Overlap.",
                    "Batched Incremental Structure-from-Motion.",
                    "Semi-global Stereo Matching with Surface Orientation Priors.",
                    "Cascaded Scene Flow Prediction Using Semantic Segmentation.",
                    "Static and Dynamic Objects Analysis as a 3D Vector Field.",
                    "Generalized Pose Estimation from Line Correspondences with Known Vertical Direction.",
                    "The Two Lines Light Source (TLLS).",
                    "Weakly Supervised 3D Reconstruction with Adversarial Constraint.",
                    "Multiframe Scene Flow with Piecewise Rigid Motion.",
                    "Camera Uncertainty Computation in Large 3D Reconstruction.",
                    "Probabilistic Object Reconstruction with Online Global Model Correction.",
                    "Multi-label Point Cloud Annotation by Selection of Sparse Control Points.",
                    "Controllable Variation Synthesis for Surface Motion Capture.",
                    "Variational Building Modeling from Urban MVS Meshes.",
                    "High Dimensional Space Model for Dense Monocular Surface Recovery.",
                    "Fast and Efficient Depth Map Estimation from Light Fields.",
                    "Direct Multichannel Tracking.",
                    "Loop-Closure Detection in Urban Scenes for Autonomous Robot Navigation.",
                    "Fast and Accurate Satellite Multi-view Stereo Using Edge-Aware Interpolation.",
                    "Registration of 3D Point Clouds Using Mean Shift Clustering on Rotations and Translations.",
                    "Learning Quadrangulated Patches for 3D Shape Parameterization and Completion.",
                    "Symmetry-Aware Façade Parsing with Occlusions.",
                    "3D Shape Induction from 2D Views of Multiple Objects.",
                    "Hierarchical Surface Prediction for 3D Object Reconstruction.",
                    "Towards Accurate Marker-Less Human Shape and Pose Estimation over Time.",
                    "3D Object Discovery and Modeling Using Single RGB-D Images Containing Multiple Object Instances.",
                    "Reconstructing 3D Human Poses from Keyword Based Image Database Query.",
                    "Real-Time Full-Body Motion Capture from Video and IMUs.",
                    "Learning Human Motion Models for Long-Term Predictions.",
                    "Performance Evaluation of 3D Correspondence Grouping Algorithms.",
                    "Spatial Maps: From Low Rank Spectral to Sparse Spatial Functional Representations.",
                    "Efficient Model-Free Anthropometry from Depth Data.",
                    "Robust 3D Human Motion Reconstruction via Dynamic Template Construction.",
                    "Monocular 3D Human Pose Estimation in the Wild Using Improved CNN Supervision.",
                    "Efficient Deformable Shape Correspondence via Kernel Matching.",
                    "Using Learning of Speed to Stabilize Scale in Monocular Localization and Mapping.",
                    "SEGCloud: Semantic Segmentation of 3D Point Clouds.",
                    "Fast Multiview 3D Scan Registration Using Planar Structures.",
                    "Simultaneous Hand Pose and Skeleton Bone-Lengths Estimation from a Single Depth Image.",
                    "3D Object Classification via Spherical Projections.",
                    "Monocular Depth from Small Motion Video Accelerated.",
                    "Line Association and Vanishing Point Estimation with Binary Quadratic Programming.",
                    "Scene Semantic Reconstruction from Egocentric RGB-D-Thermal Videos.",
                    "Single View Parametric Building Reconstruction from Satellite Imagery.",
                    "Accurate Calibration of Multiple Pan-Tilt Cameras for Live Broadcasts.",
                    "3D Room Geometry Reconstruction Using Audio-Visual Sensors.",
                    "Barcode: Global Binary Patterns for Fast Visual Inference.",
                    "Cross-Modal Attribute Transfer for Rescaling 3D Models.",
                    "Point Cloud Registration with Virtual Interest Points from Implicit Quadric Surface Intersections.",
                    "Motion Compensation for Phase-Shift Structured-Light Systems Based on a Total-Variation Framework.",
                    "Matterport3D: Learning from RGB-D Data in Indoor Environments.",
                    "Joint 3D Reconstruction of a Static Scene and Moving Objects.",
                    "Fuzzy Correspondences for Robust Shape Registration."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "4th 3DV 2016",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2016",
                "sub_name": "Fourth International Conference on 3D Vision, 3DV 2016, Stanford, CA, USA, October 25-28, 2016.",
                "count": 75,
                "papers": [
                    "Matching Deformable Objects in Clutter.",
                    "Progressive 3D Modeling All the Way.",
                    "A Hybrid Structure/Trajectory Constraint for Visual SLAM.",
                    "Real-Time Surface of Revolution Reconstruction on Dense SLAM.",
                    "Monocular, Real-Time Surface Reconstruction Using Dynamic Level of Detail.",
                    "Energy-Based Global Ternary Image for Action Recognition Using Sole Depth Sequences.",
                    "Robust Recovery of Heavily Degraded Depth Measurements.",
                    "Fast Obstacle Detection Using Sparse Edge-Based Disparity Maps.",
                    "A Large-Scale 3D Object Recognition Dataset.",
                    "Robust Feature-Preserving Denoising of 3D Point Clouds.",
                    "SceneNN: A Scene Meshes Dataset with aNNotations.",
                    "Registration of Point Clouds Based on the Ratio of Bidirectional Distances.",
                    "HS-Nets: Estimating Human Body Shape from Silhouettes with Convolutional Neural Networks.",
                    "Point Cloud Noise and Outlier Removal for Image-Based 3D Reconstruction.",
                    "3D Data Acquisition and Registration Using Two Opposing Kinects.",
                    "Deep Stereo Fusion: Combining Multiple Disparity Hypotheses with Deep-Learning.",
                    "Multi-Body Non-Rigid Structure-from-Motion.",
                    "Rapid Hand Shape Reconstruction with Chebyshev Phase Shifting.",
                    "Model-Based Outdoor Performance Capture.",
                    "A Depth Restoration Occlusionless Temporal Dataset.",
                    "Computing Temporal Alignments of Human Motion Sequences in Wide Clothing Using Geodesic Patches.",
                    "Proceduralization for Editing 3D Architectural Models.",
                    "Exemplar-Based 3D Shape Segmentation in Point Clouds.",
                    "Optical Flow for Rigid Multi-Motion Scenes.",
                    "Absolute Pose and Structure from Motion for Surfaces of Revolution: Minimal Problems Using Apparent Contours.",
                    "Large Scale SfM with the Distributed Camera Model.",
                    "Deeper Depth Prediction with Fully Convolutional Residual Networks.",
                    "Depth from Gradients in Dense Light Fields for Object Reconstruction.",
                    "Single-Image RGB Photometric Stereo with Spatially-Varying Albedo.",
                    "3D Saliency for Finding Landmark Buildings.",
                    "Dense Wide-Baseline Scene Flow from Two Handheld Video Cameras.",
                    "Automatic 3D Car Model Alignment for Mixed Image-Based Rendering.",
                    "Structure from Category: A Generic and Prior-Less Approach.",
                    "Radiometric Scene Decomposition: Scene Reflectance, Illumination, and Geometry from RGB-D Images.",
                    "HDRFusion: HDR SLAM Using a Low-Cost Auto-Exposure RGB-D Sensor.",
                    "Learning to Navigate the Energy Landscape.",
                    "Tracking Deformable Surfaces That Undergo Topological Changes Using an RGB-D Camera.",
                    "A Single-Shot Multi-Path Interference Resolution for Mirror-Based Full 3D Shape Measurement with a Correlation-Based ToF Camera.",
                    "Multi-View Inpainting for Image-Based Scene Editing and Rendering.",
                    "Cotemporal Multi-View Video Segmentation.",
                    "Video Depth-from-Defocus.",
                    "A Closed-Form Bayesian Fusion Equation Using Occupancy Probabilities.",
                    "Robust Tracking in Low Light and Sudden Illumination Changes.",
                    "Coupled Functional Maps.",
                    "Single View 3D Reconstruction under an Uncalibrated Camera and an Unknown Mirror Sphere.",
                    "CNN-Based Object Segmentation in Urban LIDAR with Missing Points.",
                    "Multiview RGB-D Dataset for Object Instance Detection.",
                    "Consistent Discretization and Minimization of the L1 Norm on Manifolds.",
                    "Robust Real-Time 3D Face Tracking from RGBD Videos under Extreme Pose, Depth, and Expression Variation.",
                    "Real-Time Halfway Domain Reconstruction of Motion and Geometry.",
                    "3D Face Reconstruction by Learning from Synthetic Data.",
                    "Shape Analysis with Anisotropic Windowed Fourier Transform.",
                    "Synthesizing Training Images for Boosting Human 3D Pose Estimation.",
                    "Face Reconstruction on Mobile Devices Using a Height Map Shape Model and Fast Regularization.",
                    "SpectroMeter: Amortized Sublinear Spectral Approximation of Distance on Graphs.",
                    "Learning a General-Purpose Confidence Measure Based on O(1) Features and a Smarter Aggregation Strategy for Semi Global Matching.",
                    "Room Layout Estimation with Object and Material Attributes Information Using a Spherical Camera.",
                    "Regularized 3D Modeling from Noisy Building Reconstructions.",
                    "Detecting and Correcting Shadows in Urban Point Clouds and Image Collections.",
                    "Camera Motion from Group Synchronization.",
                    "X-Tag: A Fiducial Tag for Flexible and Accurate Bundle Adjustment.",
                    "V-Net: Fully Convolutional Neural Networks for Volumetric Medical Image Segmentation.",
                    "Will It Last? Learning Stable Features for Long-Term Visual Localization.",
                    "3D Human Pose Estimation via Deep Learning from 2D Annotations.",
                    "Discriminative Filters for Depth from Defocus.",
                    "Multi-Label Semantic 3D Reconstruction Using Voxel Blocks.",
                    "Joint Semantic Segmentation and Depth Estimation with Deep Convolutional Networks.",
                    "A 3D Reconstruction with High Density and Accuracy Using Laser Profiler and Camera Fusion System on a Rover.",
                    "Quaternionic Upsampling: Hyperspherical Techniques for 6 DoF Pose Tracking.",
                    "Synthetic Prior Design for Real-Time Face Tracking.",
                    "Comparison of Radial and Tangential Geometries for Cylindrical Panorama.",
                    "Robust Plane-Based Calibration of Multiple Non-Overlapping Cameras.",
                    "Single-Shot Time-of-Flight Phase Unwrapping Using Two Modulation Frequencies.",
                    "Fast Single Shot Detection and Pose Estimation.",
                    "Learning Camera Viewpoint Using CNN to Improve 3D Body Pose Estimation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "3rd 3DV 2015",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2015",
                "sub_name": "2015 International Conference on 3D Vision, 3DV 2015, Lyon, France, October 19-22, 2015.",
                "count": 74,
                "papers": [
                    "Depth Fields: Extending Light Field Techniques to Time-of-Flight Imaging.",
                    "Towards Probabilistic Volumetric Reconstruction Using Ray Potentials.",
                    "Multi-view Reconstruction of Highly Specular Surfaces in Uncontrolled Environments.",
                    "x-Hour Outdoor Photometric Stereo.",
                    "Automatic Recovery of Networks of Thin Structures.",
                    "Global Mesh Denoising with Fairness.",
                    "Graph Edit Distance Based on Triangle-Stars Decomposition for Deformable 3D Objects Recognition.",
                    "Motion Cooperation: Smooth Piece-wise Rigid Scene Flow from RGB-D Images.",
                    "Ensemble Classifier for Combining Stereo Matching Algorithms.",
                    "RGB-D Visual Search with Compact Binary Codes.",
                    "Establishing a Probabilistic Depth Map from Focused Plenoptic Cameras.",
                    "A 3D Scene Analysis Framework and Descriptors for Risk Evaluation.",
                    "Segmentation of 3D Lidar Points Using Extruded Surface of Cross Section.",
                    "A Multi-view Structured-Light System for Highly Accurate 3D Modeling.",
                    "Dense Depth and Albedo from a Single-Shot Structured Light.",
                    "Convolutional Fisher Kernels for RGB-D Object Recognition.",
                    "Consistent 3D Background Model Estimation from Multi-viewpoint Videos.",
                    "Interference-Free Epipole-Centered Structured Light Pattern for Mirror-Based Multi-view Active Stereo.",
                    "Continuous Symmetric Stereo with Adaptive Outlier Handling.",
                    "Fast and Robust Multi-view 3D Object Recognition in Point Clouds.",
                    "Confidence Estimation for Superpixel-Based Stereo Matching.",
                    "Accurate and Practical 3D Measurement for Translucent Objects by Dashed Lines and Complementary Gray Code Projection.",
                    "Low-Cost Depth and Radiological Sensor Fusion to Detect Moving Sources.",
                    "Domain Adaptation for Structure Recognition in Different Building Styles.",
                    "Half-Occluded Regions and Detection of Pseudoscopy.",
                    "Census-Based Cost on Gradients for Matching under Illumination Differences.",
                    "Efficient Large-Scale Point Cloud Registration Using Loop Closures.",
                    "MLMD: Maximum Likelihood Mixture Decoupling for Fast and Accurate Point Cloud Registration.",
                    "Procrustean Point-Line Registration and the NPnP Problem.",
                    "Accurate Isosurface Interpolation with Hermite Data.",
                    "3D Surface Reconstruction from Point-and-Line Cloud.",
                    "Learning Hierarchical Semantic Segmentations of LIDAR Data.",
                    "Segmentation Based Features for Wide-Baseline Multi-view Reconstruction.",
                    "3D Modeling on the Go: Interactive 3D Reconstruction of Large-Scale Scenes on Mobile Devices.",
                    "On Computing the Translations Norm in the Epipolar Graph.",
                    "Multi-label Object Categorization Using Histograms of Global Relations.",
                    "Live Scan3D: A Fast and Inexpensive 3D Data Acquisition System for Multiple Kinect v2 Sensors.",
                    "Optimal Camera Parameters for Depth from Defocus.",
                    "Light-Field Microscopy with a Consumer Light-Field Camera.",
                    "Non-parametric Spectral Model for Shape Retrieval.",
                    "Matchability Prediction for Full-Search Template Matching Algorithms.",
                    "Automatic Indoor 3D Surface Reconstruction with Segmented Building and Object Elements.",
                    "Repeatable Local Coordinate Frames for 3D Human Motion Tracking: From Rigid to Non-rigid.",
                    "Online Classification in 3D Urban Datasets Based on Hierarchical Detection.",
                    "Cultural Heritage Acquisition: Geometry-Based Radiometry in the Wild.",
                    "Local Hough Transform for 3D Primitive Detection.",
                    "Multiscale Retinex Aggregation to Enable Robust Dense Stereo Correspondence.",
                    "Accelerated Relative Camera Pose from Oriented Features.",
                    "Approximate 3D Partial Symmetry Detection Using Co-occurrence Analysis.",
                    "Synchronization and Self-Calibration for Helmet-Held Consumer Cameras, Applications to Immersive 3D Modeling and 360 Video.",
                    "3-d Tessellation of Plant Tissue - A Dual Optimization Approach to Cell-Level Meristem Reconstruction from Microscopy Images.",
                    "Planes Detection for Robust Localization and Mapping in RGB-D SLAM Systems.",
                    "Shadow Detection and Sun Direction in Photo Collections.",
                    "A Bayesian Approach for Selective Image-Based Rendering Using Superpixels.",
                    "Video Based Animation Synthesis with the Essential Graph.",
                    "The Geometry of Colorful, Lenticular Fiducial Markers.",
                    "A Combined Generalized and Subject-Specific 3D Head Pose Estimation.",
                    "Dictionary Learning Based 3D Morphable Model Construction for Face Recognition with Varying Expression and Pose.",
                    "Monocular 3D Human Pose Estimation with a Semi-supervised Graph-Based Method.",
                    "Point Pair Features Based Object Detection and Pose Estimation Revisited.",
                    "Super-resolution Keyframe Fusion for 3D Modeling with High-Quality Textures.",
                    "Towards Skeleton Based Reconstruction: From Projective Skeletonization to Canal Surface Estimation.",
                    "Estimation of Branch Angle from 3D Point Cloud of Plants.",
                    "Unsupervised Temporal Segmentation of Repetitive Human Actions Based on Kinematic Modeling and Frequency Analysis.",
                    "On Preserving Structure in Stereo Seam Carving.",
                    "Depth Estimation Based on an Infrared Projector and an Infrared Color Stereo Camera by Using Cross-Based Dynamic Programming with Cost Volume Filter.",
                    "Audio Visual Synchronization of Rhythm.",
                    "Super Generalized 4PCS for 3D Registration.",
                    "Reconstructing Street-Scenes in Real-Time from a Driving Car.",
                    "Ground Segmentation Based on Loopy Belief Propagation for Sparse 3D Point Clouds.",
                    "A New Flying Range Sensor: Aerial Scan in Omni-Directions.",
                    "Tracking Fractures of Deformable Objects in Real-Time with an RGB-D Sensor.",
                    "Estimating Surface Normals with Depth Image Gradients for Fast and Accurate Registration.",
                    "Reconstruction of 3D Pose for Surfaces of Revolution from Range Data."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "2nd 3DV 2014",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2014",
                "sub_name": "2nd International Conference on 3D Vision, 3DV 2014, Tokyo, Japan, December 8-11, 2014, Volume 1.",
                "count": 87,
                "papers": [
                    "Efficient Multi-view Performance Capture of Fine-Scale Surface Detail.",
                    "Structure from Motion with Line Segments under Relaxed Endpoint Constraints.",
                    "Direct Optimization of T-Splines Based on Multiview Stereo.",
                    "3D Face Hallucination from a Single Depth Frame.",
                    "Towards Illumination-Invariant 3D Reconstruction Using ToF RGB-D Cameras.",
                    "3D Tracking of Multiple Objects with Identical Appearance Using RGB-D Input.",
                    "Real-Time Direct Dense Matching on Fisheye Images Using Plane-Sweeping Stereo.",
                    "A TV Prior for High-Quality Local Multi-view Stereo Reconstruction.",
                    "Memory Efficient Stereoscopy from Light Fields.",
                    "Generalized 4-Points Congruent Sets for 3D Registration.",
                    "Multiple Hypothesis for Object Class Disambiguation from Multiple Observations.",
                    "Piecewise Planar and Non-Planar Segmentation of Large Complex 3D Urban Models.",
                    "GASP: Geometric Association with Surface Patches.",
                    "Close-Range Photometric Stereo with Point Light Sources.",
                    "Two Cameras and a Screen: How to Calibrate Mobile Devices?",
                    "Lighting Estimation in Outdoor Image Collections.",
                    "Detailed 3D Model Driven Single View Scene Understanding.",
                    "Classification of Vehicle Parts in Unstructured 3D Point Clouds.",
                    "Line Matching and Pose Estimation for Unconstrained Model-to-Image Alignment.",
                    "A Scalable 3D HOG Model for Fast Object Detection and Viewpoint Estimation.",
                    "A Layered Model of Human Body and Garment Deformation.",
                    "Fast 3D Object Alignment from Depth Image with 3D Fourier Moment Matching on GPU.",
                    "Calibration of 3D Sensors Using a Spherical Target.",
                    "Piecewise Planar Decomposition of 3D Point Clouds Obtained from Multiple Static RGB-D Cameras.",
                    "Influence of Colour and Feature Geometry on Multi-modal 3D Point Clouds Data Registration.",
                    "A Structure from Motion Approach for the Analysis of Adhesions in Rotating Vessels.",
                    "Estimating Depth of Layered Structure Based on Multispectral Speckle Correlation.",
                    "A Decision-Theoretic Formulation for Sparse Stereo Correspondence Problems.",
                    "Rapid SVBRDF Measurement by Algebraic Solution Based on Adaptive Illumination.",
                    "Reconstruction of Inextensible Surfaces on a Budget via Bootstrapping.",
                    "Colour Helmholtz Stereopsis for Reconstruction of Complex Dynamic Scenes.",
                    "Multi-view Photometric Stereo by Example.",
                    "Tackling Shapes and BRDFs Head-On.",
                    "A Data-Driven Regularization Model for Stereo and Flow.",
                    "aTGV-SF: Dense Variational Scene Flow through Projective Warping and Higher Order Regularization.",
                    "Gradient-Based Differential Approach for 3-D Motion Compensation in Interventional 2-D/3-D Image Fusion.",
                    "Placeless Place-Recognition.",
                    "Learning 3D Part Detection from Sparsely Labeled Data.",
                    "Real-Time Hand Tracking Using a Sum of Anisotropic Gaussians Model.",
                    "High-Quality Depth Recovery via Interactive Multi-view Stereo.",
                    "High Resolution Projector for 3D Imaging.",
                    "Multimodal Calibration of Portable X-Ray Capture Systems for 3D Reconstruction.",
                    "3D Model Retargeting Using Offset Statistics.",
                    "Photometric Stereo Using Internet Images.",
                    "Real-Time Face Reconstruction from a Single Depth Image.",
                    "Recovering Correct Reconstructions from Indistinguishable Geometry.",
                    "Least MSE Regression for View Synthesis.",
                    "Efficient Multiview Stereo by Random-Search and Propagation.",
                    "A Structured Light Scanner for Hyper Flexible Industrial Automation.",
                    "Hierarchical Co-Segmentation of Building Facades.",
                    "Multistage SFM: Revisiting Incremental Structure from Motion.",
                    "A General Framework to Generate Sizing Systems from 3D Motion Data Applied to Face Mask Design.",
                    "Vision-Based Differential GPS: Improving VSLAM / GPS Fusion in Urban Environment with 3D Building Models.",
                    "Merge2-3D: Combining Multiple Normal Maps with 3D Surfaces.",
                    "Cavlectometry: Towards Holistic Reconstruction of Large Mirror Objects.",
                    "Proceduralization of Buildings at City Scale.",
                    "An Integer Linear Programming Model for View Selection on Overlapping Camera Clusters.",
                    "Matching Features Correctly through Semantic Understanding.",
                    "Solving for Relative Pose with a Partially Known Rotation is a Quadratic Eigenvalue Problem.",
                    "Robust Absolute Rotation Estimation via Low-Rank and Sparse Matrix Decomposition.",
                    "Iterative Closest Spectral Kernel Maps.",
                    "Calibration of Non-overlapping Cameras Using an External SLAM System.",
                    "LETHA: Learning from High Quality Inputs for 3D Pose Estimation in Low Quality Images.",
                    "Accurate Geo-Registration by Ground-to-Aerial Image Matching.",
                    "Improving Sparse 3D Models for Man-Made Environments Using Line-Based 3D Reconstruction.",
                    "Hashing Cross-Modal Manifold for Scalable Sketch-Based 3D Model Retrieval.",
                    "MCOV: A Covariance Descriptor for Fusion of Texture and Shape Features in 3D Point Clouds.",
                    "Estimating Camera Pose Using Trajectories Generated by Pan-Tilt Motion.",
                    "Height Gradient Histogram (HIGH) for 3D Scene Labeling.",
                    "Probabilistic Phase Unwrapping for Single-Frequency Time-of-Flight Range Cameras.",
                    "World-Base Calibration by Global Polynomial Optimization.",
                    "Variational Regularization and Fusion of Surface Normal Maps.",
                    "DT-SLAM: Deferred Triangulation for Robust SLAM.",
                    "Non-rigid Registration with Reliable Distance Field for Dynamic Shape Completion.",
                    "Structured Representation of Non-Rigid Surfaces from Single View 3D Point Tracks.",
                    "A 3D Shape Descriptor for Segmentation of Unstructured Meshes into Segment-Wise Coherent Mesh Series.",
                    "Real Time Head Model Creation and Head Pose Estimation on Consumer Depth Cameras.",
                    "Distortion Driven Variational Multi-view Reconstruction.",
                    "4DCov: A Nested Covariance Descriptor of Spatio-Temporal Features for Gesture Recognition in Depth Sequences.",
                    "A Real-Time View-Dependent Shape Optimization for High Quality Free-Viewpoint Rendering of 3D Video.",
                    "Automatic Extraction of Moving Objects from Image and LIDAR Sequences.",
                    "Reconstructing Fukushima: A Case Study.",
                    "Efficient Colorization of Large-Scale Point Cloud Using Multi-pass Z-Ordering.",
                    "On Reliable Estimation of Curvatures of Implicit Surfaces.",
                    "Match Box: Indoor Image Matching via Box-Like Scene Estimation.",
                    "Improved Techniques for Multi-view Registration with Motion Averaging.",
                    "Learning Similarities for Rigid and Non-rigid Object Detection."
                ]
            },
            {
                "sub_name_abbr": "conf/3dim/2014-2",
                "sub_name": "2nd International Conference on 3D Vision, 3DV 2014, Tokyo, Japan, December 8-11, 2014, Volume 2.",
                "count": 18,
                "papers": [
                    "Kinect Deform: Enhanced 3D Reconstruction of Non-rigidly Deforming Objects.",
                    "4D Capture Using Visibility Information of Multiple Projector Camera System.",
                    "Quantized Census for Stereoscopic Image Matching.",
                    "Querying 3D Mesh Sequences for Human Action Retrieval.",
                    "Semantic Parametric Reshaping of Human Body Models.",
                    "Temporal Octrees for Compressing Dynamic Point Cloud Streams.",
                    "A 3D Segmentation and Visualization Scheme for Solid and Non-solid Lung Lesions Based on Gaussian Filtering Regularized Level Set.",
                    "3D Liver Vessel Reconstruction from CT Images.",
                    "Surface Detection Using Round Cut.",
                    "Furnished Interiors Modeling with Laser Scanners and RFID.",
                    "Interactive Mapping of Indoor Building Structures through Mobile Devices.",
                    "Automated gbXML-Based Building Model Creation for Thermal Building Simulation.",
                    "Building Modeling through Enclosure Reasoning.",
                    "Detecting Ambiguity in Localization Problems Using Depth Sensors.",
                    "A Methodology for Creating Large Scale Reference Models with Known Uncertainty for Evaluating Imaging Solution.",
                    "Toward Automated Spatial Change Analysis of MEP Components Using 3D Point Clouds and As-Designed BIM Models.",
                    "Matching Many Identical Features of Planar Urban Facades Using Global Regularity.",
                    "Non-rigid Registration Meets Surface Reconstruction."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "1st 3DV 2013",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2013",
                "sub_name": "2013 International Conference on 3D Vision, 3DV 2013, Seattle, Washington, USA, June 29 - July 1, 2013.",
                "count": 56,
                "papers": [
                    "Real-Time 3D Reconstruction in Dynamic Scenes Using Point-Based Fusion.",
                    "Stereo+Kinect for High Resolution Stereo Correspondences.",
                    "A Learned Joint Depth and Intensity Prior Using Markov Random Fields.",
                    "The Visual Turing Test for Scene Reconstruction.",
                    "Accurate Georegistration of Point Clouds Using Geographic Data.",
                    "Watertight Planar Surface Meshing of Indoor Point-Clouds with Voxel Carving.",
                    "Online Building Segmentation from Ground-Based LiDAR Data in Urban Scenes.",
                    "SIFT-Realistic Rendering.",
                    "Omnistereo Video Textures without Ghosting.",
                    "High-Quality Stereo Video Matching via User Interaction and Space-Time Propagation.",
                    "Automatic Registration of Smooth Object Image to 3D CAD Model for Industrial Inspection Applications.",
                    "Training-Based Object Recognition in Cluttered 3D Point Clouds.",
                    "Deriving Motion Constraints in Finger Joints of Individualized Hand Model for Manipulation by Data Glove.",
                    "Statistical Analysis of 3D Faces in Motion.",
                    "Depth and Intensity Based Edge Detection in Time-of-Flight Images.",
                    "Evaluation of 3D Feature Descriptors for Multi-modal Data Registration.",
                    "Towards Linear-Time Incremental Structure from Motion.",
                    "Optimized Aperture for Estimating Depth from Projector's Defocus.",
                    "Minimal Solution for Uncalibrated Absolute Pose Problem with a Known Vanishing Point.",
                    "On-Line Reconstruction of CAD Geometry.",
                    "Learning Part-Based Models for Animation from Surface Motion Capture.",
                    "Synchronized Submanifold Embedding for Robust and Real-Time Capable Head Pose Detection Based on Range Images.",
                    "Detecting Objects in Scene Point Cloud: A Combinational Approach.",
                    "Shape and Reflectance from Scattering in Participating Media.",
                    "Non-rigid Shape Registration Using Similarity-Invariant Differential Coordinates.",
                    "3D Object Recognition by Surface Registration of Interest Segments.",
                    "A Study of Point Cloud Registration with Probability Product Kernel Functions.",
                    "Automatic Procedural Modeling of Tree Structures in Point Clouds Using Wavelets.",
                    "Balloon Shapes: Reconstructing and Deforming Objects with Volume from Images.",
                    "X-Ray and 3D Data Fusion for 3D Reconstruction of Closed Receptacle Contents.",
                    "Single View Reconstruction of Piecewise Swept Surfaces.",
                    "Robust and Accurate One-Shot 3D Reconstruction by 2C1P System with Wave Grid Pattern.",
                    "3D Semantic Parameterization for Human Shape Modeling: Application to 3D Animation.",
                    "Interactive Depth-Aware Effects for Stereo Image Editing.",
                    "Multi-task Forest for Human Pose Estimation in Depth Images.",
                    "Personalization and Evaluation of a Real-Time Depth-Based Full Body Tracker.",
                    "Robust Human Body Shape and Pose Tracking.",
                    "3D Face Template Registration Using Normal Maps.",
                    "Automatic Rail Extraction in Terrestrial and Airborne LiDAR Data.",
                    "Measurement of Individual Changes in the Performance of Human Stereoscopic Vision for Disparities at the Limits of the Zone of Comfortable Viewing.",
                    "Assisted Multi-view Stereo Reconstruction.",
                    "Fast and Stable Algebraic Solution to L2 Three-View Triangulation.",
                    "Shape and Pose Space Deformation for Subject Specific Animation.",
                    "Fast and Accurate Calibration of a Kinect Sensor.",
                    "Object Class Recognition in Mobile Urban Lidar Data Using Global Shape Descriptors.",
                    "Space-Time Parameterized Variety Manifolds: A Novel Approach for Arbitrary Multi-perspective 3D View Generation.",
                    "3D Implicit Shape Models Using Ray Based Hough Voting for Furniture Recognition.",
                    "Geometric and Color Calibration of Multiview Panoramic Cameras for Life-Size 3D Immersive Video.",
                    "Direct Shape Recovery from Photometric Stereo with Shadows.",
                    "Evaluation of Methods for Optical 3-D Scanning of Human Pinnas.",
                    "Patch Volumes: Segmentation-Based Consistent Mapping with RGB-D Cameras.",
                    "An Iterative Method for Improving Feature Matches.",
                    "Augmented Motion History Volume for Spatiotemporal Editing of 3D Video in Multi-party Interaction Scenes.",
                    "CrowdCam: Instantaneous Navigation of Crowd Images Using Angled Graph.",
                    "Model-Based Vehicle Pose Estimation and Tracking in Videos Using Random Forests.",
                    "Sparse Point Cloud Densification by Combining Multiple Segmentation Methods."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "2nd 3DIMPVT 2012",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2012",
                "sub_name": "2012 Second International Conference on 3D Imaging, Modeling, Processing, Visualization & Transmission, Zurich, Switzerland, October 13-15, 2012.",
                "count": 75,
                "papers": [
                    "Tracking Complete Deformable Objects with Finite Elements.",
                    "3D Object Detection and Localization Using Multimodal Point Pair Features.",
                    "High-Detail 3D Capture and Non-sequential Alignment of Facial Performance.",
                    "High Resolution Surface Reconstruction from Multi-view Aerial Imagery.",
                    "Robust Simultaneous 3D Registration via Rank Minimization.",
                    "Rapid Skin: Estimating the 3D Human Pose and Shape in Real-Time.",
                    "Fast and Stable Color Balancing for Images and Augmented Reality.",
                    "Photo Tours.",
                    "Dynamic Mosaics.",
                    "Accurate and Automatic Alignment of Range Surfaces.",
                    "Global Motion Estimation from Point Matches.",
                    "Boosting the Computational Performance of Feature-Based Multiple 3D Scan Alignment by iat-k-means Clustering.",
                    "3D Human Motion Analysis to Detect Abnormal Events on Stairs.",
                    "Polarization-Based Surface Normal Estimation of Black Specular Objects from Multiple Viewpoints.",
                    "Handling Occlusions for Accurate 3D Urban Cartography: A New Approach Based on Characterization and Multiple Passages.",
                    "Efficient Multi-scale Stereo of High-Resolution Planar and Spherical Images.",
                    "High-Level Bottom-Up Cues for Top-Down Parsing of Facade Images.",
                    "Exploiting Physical Inconsistencies for 3D Scene Understanding.",
                    "HyperSfM.",
                    "3D Facial Surface and Texture Synthesis Using 2D Landmarks from a Single Face Sketch.",
                    "Sampling-Based Multiview Reconstruction without Correspondences for 3D Edges.",
                    "A Robust Multi-camera 3D Ellipse Fitting for Contactless Measurements.",
                    "Toward Compressed 3D Descriptors.",
                    "Online Gaze Disparity via Bioncular Eye Tracking on Stereoscopic Displays.",
                    "Markerless Motion Capture of Human Body Using PSO with Single Depth Camera.",
                    "Classification and Pose Estimation of Vehicles in Videos by 3D Modeling within Discrete-Continuous Optimization.",
                    "Cage-Based Motion Recovery Using Manifold Learning.",
                    "Generating Dense Point Correspondence Ground-Truth across Multiple Views.",
                    "Optimising Light Source Positions to Minimise Illumination Variation for 3D Vision.",
                    "Semi-dense Piecewise Planar Stereo Reconstruction Using SymStereo and PEARL.",
                    "3D City Modeling from Street-Level Data for Augmented Reality Applications.",
                    "Increasing the Efficiency of Local Stereo by Leveraging Smoothness Constraints.",
                    "Pinhole-to-Projection Pyramid Subtraction for Reconstructing Non-rigid Objects from Range Images.",
                    "Solving the PnP Problem with Anisotropic Orthogonal Procrustes Analysis.",
                    "Uncalibrated View Synthesis with Homography Interpolation.",
                    "Visual Landmark-Based Localization for MAVs Using Incremental Feature Updates.",
                    "Automatic Calibration of a Range Sensor and Camera System.",
                    "Incremental Reconstruction of Manifold Surface from Sparse Visual Mapping.",
                    "Extension of Tamura Texture Features for 3D Fluorescence Microscopy.",
                    "Calibrating an Optical See-Through Rig with Two Non-overlapping Cameras: The Virtual Camera Framework.",
                    "Watertight As-Built Architectural Floor Plans Generated from Laser Range Data.",
                    "Non Local Point Set Surfaces.",
                    "Online Algorithms for Classification of Urban Objects in 3D Point Clouds.",
                    "Real-Time Reshaping of Humans.",
                    "Towards Bundle Adjustment with GIS Constraints for Online Geo-Localization of a Vehicle in Urban Center.",
                    "High-Resolution Performance Capture by Zoom-in Pan-Tilt Cameras.",
                    "Grid-Based Active Stereo with Single-Colored Wave Pattern for Dense One-shot 3D Scan.",
                    "An Adaptive Hierarchical Approach to the Extraction of High Resolution Medial Surfaces.",
                    "Structure from Motion Using Augmented Lagrangian Robust Factorization.",
                    "An Evaluation Method for Multiview Surface Reconstruction Algorithms.",
                    "Through-the-Lens Multi-camera Synchronisation and Frame-Drop Detection for 3D Reconstruction.",
                    "A Repeatable and Efficient Canonical Reference for Surface Matching.",
                    "Texture Generation from a Large Set of Registered Images Using Markov Random Fields.",
                    "Incremental Large Scale 3D Reconstruction.",
                    "On the Affinity between 3D Detectors and Descriptors.",
                    "Accurate Full Body Scanning from a Single Fixed 3D Camera.",
                    "Space-Time Joint Multi-layer Segmentation and Depth Estimation.",
                    "Interactive Disparity Map Post-processing.",
                    "Sparse Modeling of Shape from Structured Light.",
                    "Simple, Accurate, and Robust Projector-Camera Calibration.",
                    "Sensor Fusion for Depth Estimation, including TOF and Thermal Sensors.",
                    "Registration of Spherical Panoramic Images with Cadastral 3D Models.",
                    "Leveraging Topographic Maps for Image to Terrain Alignment.",
                    "Complex Terrain Mapping with Multi-camera Visual Odometry and Realtime Drift Correction.",
                    "Difference of Normals as a Multi-scale Operator in Unorganized Point Clouds.",
                    "Dense Non-rigid Structure from Motion.",
                    "An Error Correcting 3D Scanning Technique Using Dual Pseudorandom Arrays.",
                    "Modeling Kinect Sensor Noise for Improved 3D Reconstruction and Tracking.",
                    "Least Commitment, Viewpoint-Based, Multi-view Stereo.",
                    "Robust Probabilistic Occupancy Grid Estimation from Positive and Negative Distance Fields.",
                    "Multi-view Photometric Stereo Using Semi-isometric Mappings.",
                    "PatchMatch-Based Content Completion of Stereo Image Pairs.",
                    "A Patch Prior for Dense 3D Reconstruction in Man-Made Environments.",
                    "Analysis-by-Synthesis Texture Reconstruction.",
                    "Multiple View Stereo by Reflectance Modeling."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "1st 3DIMPVT 2011",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2011",
                "sub_name": "International Conference on 3D Imaging, Modeling, Processing, Visualization and Transmission, 3DIMPVT 2011, Hangzhou, China, 16-19 May 2011.",
                "count": 54,
                "papers": [
                    "Cutting-Plane Training of Non-associative Markov Network for 3D Point Cloud Segmentation.",
                    "Toward Automatic 3D Generic Object Modeling from One Single Image.",
                    "Dynamic Shape Capture via Periodical-Illumination Optical Flow Estimation and Multi-view Photometric Stereo.",
                    "Surface Reconstruction in Photometric Stereo with Calibration Error.",
                    "3D Reconstruction of Urban Areas.",
                    "Pseudo-Immersive Real-Time Display of 3D Scenes on Mobile Devices.",
                    "A System for Capturing Textured 3D Shapes Based on One-Shot Grid Pattern with Multi-band Camera and Infrared Projector.",
                    "Scene Segmentation Assisted by Stereo Vision.",
                    "Scalable Object Classification Using Range Images.",
                    "Real-Time Accurate Stereo Matching Using Modified Two-Pass Aggregation and Winner-Take-All Guided Dynamic Programming.",
                    "Robust ICP Registration Using Biunique Correspondence.",
                    "Efficient Generation of Multi-perspective Panoramas.",
                    "Multi-target Tracking and Segmentation via Discriminative Appearance Model.",
                    "Speeding up Cloth Simulation by Linearizing the Bending Function of the Physical Mass-Spring Model.",
                    "Fast and Accurate 3D Scanning Using Coded Phase Shifting and High Speed Pattern Projection.",
                    "A Feature-Preserved Canonical Form for Non-rigid 3D Meshes.",
                    "Lightweight 3D Modeling of Urban Buildings from Range Data.",
                    "Stereo Matching with Reliable Disparity Propagation.",
                    "Reconstruction and Accurate Alignment of Feature Maps for Augmented Reality.",
                    "6DoF Registration of 2D Laser Scans.",
                    "Higher Order CRF for Surface Reconstruction from Multi-view Data Sets.",
                    "Visual Hull from Imprecise Polyhedral Scene.",
                    "Hierarchical Shape Matching for Temporally Consistent 3D Video.",
                    "Scene Cut: Class-Specific Object Detection and Segmentation in 3D Scenes.",
                    "An Approach for Shape from Surface Normals with Local Discontinuity Detection.",
                    "Human Body Shape Prediction and Analysis Using Predictive Clustering Tree.",
                    "Automatic Keypoint Detection on 3D Faces Using a Dictionary of Local Shapes.",
                    "3D Data Segmentation by Local Classification and Markov Random Fields.",
                    "Real Time Detection of Repeated Structures in Point Clouds of Urban Scenes.",
                    "Multiscale 3D Feature Extraction and Matching.",
                    "A Performance Evaluation of 3D Keypoint Detectors.",
                    "Space-Time Body Pose Estimation in Uncontrolled Environments.",
                    "A Non-cooperative Game for 3D Object Recognition in Cluttered Scenes.",
                    "Calibration of Nodal and Free-Moving Cameras in Dynamic Scenes for Post-Production.",
                    "Fast Stereo Matching of Feature Links.",
                    "3D Reconstruction of Interior Wall Surfaces under Occlusion and Clutter.",
                    "An Evaluation of Volumetric Interest Points.",
                    "Sampling Relevant Points for Surface Registration.",
                    "Electric Appliance Parts Classification Using a Measure Combining the Whole Shape and Local Shape Distribution Similarities.",
                    "Procedural 3D Building Reconstruction Using Shape Grammars and Detectors.",
                    "Accurate Estimation of Gaussian and Mean Curvature in Volumetric Images.",
                    "Finding the Best Feature Detector-Descriptor Combination.",
                    "Visual Words for 3D Reconstruction and Pose Computation.",
                    "A Best-Next-View-Selection Algorithm for Multi-view Rendering.",
                    "3D Human Action Recognition for Multi-view Camera Systems.",
                    "An Enhanced 'Optimization-on-a-Manifold' Framework for Global Registration of 3D Range Data.",
                    "Façade Segmentation in a Multi-view Scenario.",
                    "Stereo Reconstruction of Building Interiors with a Vertical Structure Prior.",
                    "Pose Alignment for 3D Models and Single View Stereo Point Clouds Based on Stable Planes.",
                    "Image-Space Marker Detection and Recognition Using Projective Invariants.",
                    "Temporally-Consistent Phase Unwrapping for a Stereo-Assisted Structured Light System.",
                    "A Multi-camera, Multi-projector Super-Resolution Framework for Structured Light.",
                    "Integrating LIDAR into Stereo for Fast and Improved Disparity Computation.",
                    "Skull Assembly and Completion Using Template-Based Surface Matching."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "6th 3DIM 2007",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2007",
                "sub_name": "Sixth International Conference on 3-D Digital Imaging and Modeling, 3DIM 2007, 21-23 August 2007, Montreal, Quebec, Canada.",
                "count": 53,
                "papers": [
                    "A Tensor Algebraic Approach to Image Synthesis, Analysis and Recognition.",
                    "Surface Reconstruction from Point Clouds by Transforming the Medial Scaffold.",
                    "Automated Reverse Engineering of Free Form Objects Using Morse Theory.",
                    "A Comparative Analysis of Depth-Discontinuity and Mixed-Pixel Detection Algorithms.",
                    "Data-Driven Feature-Based 3D Face Synthesis.",
                    "A Sampling Criterion for Optimizing a Surface Light Field.",
                    "Super-Resolution Stereo- and Multi-View Synthesis from Monocular Video Sequences.",
                    "Deformable Registration of Textured Range Images by Using Texture and Shape Features.",
                    "Predetermination of ICP Registration Errors And Its Application to View Planning.",
                    "Automatic Pose Estimation for Range Images on the GPU.",
                    "3D laser measurement system for large scale architectures using multiple mobile robots.",
                    "Interactive Scanning of Haptic Textures and Surface Compliance.",
                    "Surround Structured Lighting for Full Object Scanning.",
                    "Scaling up multiprojector immersive displays: the LightTwist project.",
                    "3D Challenges and a Non-In-Depth Overview of Recent Progress.",
                    "Light stripe triangulation for multiple of moving rigid objects.",
                    "Dense Depth and Color Acquisition of Repetitive Motions.",
                    "Dense 3D Reconstruction method using Coplanarities and Metric Constraints for Line Laser Scanning.",
                    "Estimating the Location of a Camera with Respect to a 3D Model.",
                    "A Bayesian Framework for Simultaneous Matting and 3D Reconstruction.",
                    "Dual-Mode Deformable Models for Free-Viewpoint Video of Sports Events.",
                    "Range Image Segmentation for Modeling and Object Detection in Urban Scenes.",
                    "Self-organizing Deformable Model for Mapping 3D Object Model onto Arbitrary Target Surface.",
                    "Joint Reconstruction and Registration of a Deformable Planar Surface Observed by a 3D Sensor.",
                    "Discrete Delaunay: Boundary extraction from voxel objects.",
                    "Fast Omnidirectional 3D Scene Acquisition with an Array of Stereo Cameras.",
                    "Silhouette Extraction with Random Pattern Backgrounds for the Volume Intersection Method.",
                    "Orientation of Image Sequences in a Point-based Environment Model.",
                    "Three-dimensional reconstruction using the perpendicularity constraint.",
                    "Construction of Feature Landmark Database Using Omnidirectional Videos and GPS Positions.",
                    "Tracking of Human Body Parts using the Multiocular Contracting Curve Density Algorithm.",
                    "Automatic Registration for Model Building using Variable Dimensional Local Shape Descriptors.",
                    "Robust 2D-3D alignment based on geometrical consistency.",
                    "Online Registration of Multi-view Range Images using Geometric and Photometric Feature Tracking.",
                    "Shape-merging and interpolation using class estimation for unseen voxels with a GPU-based efficient implementation.",
                    "Pose Determination By PotentialWell Space Embedding.",
                    "Image-based Model Completion.",
                    "Surface Modelling of Plants from Stereo Images.",
                    "Modeling and Calibration of Coupled Fish-Eye CCD Camera and Laser Range Scanner for Outdoor Environment Reconstruction.",
                    "Stratified Self-calibration and Metric Reconstruction of a Trinocular Structured Light Vision System.",
                    "Light Transport Analysis for 3D Photography.",
                    "Multi-View Edge-based Stereo by Incorporating Spatial Coherence.",
                    "Examplar-based Shape from Shading.",
                    "Two-frame frequency-based estimation of local motion parallax direction in 3D cluttered scenes.",
                    "A Cable-driven Parallel Mechanism for Capturing Object Appearance from Multiple Viewpoints.",
                    "A Sensor for Simultaneously Capturing Texture and Shape by Projecting Structured Infrared Light.",
                    "Real-time full-field 3-D surface-shape measurement using off-the-shelf components and a single processor.",
                    "Hybrid Scene Reconstruction by Integrating Scan Data and Stereo Image Pairs.",
                    "Generalized MPU Implicits Using Belief Propagation.",
                    "A Study of Shape Similarity for Temporal Surface Sequences of People.",
                    "Cached k-d tree search for ICP algorithms.",
                    "Outlier Robust ICP for Minimizing Fractional RMSD.",
                    "Aerial Lidar Data Classification using AdaBoost."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5th 3DIM 2005",
        "info": "Ottawa, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2005",
                "sub_name": "Fifth International Conference on 3D Digital Imaging and Modeling (3DIM 2005), 13-16 June 2005, Ottawa, Ontario, Canada.",
                "count": 77,
                "papers": [
                    "Foreword.",
                    "Program Committee.",
                    "Additional Reviewers.",
                    "Further Improving Geometric Fitting.",
                    "A Light Modulation/Demodulation Method for Real-Time 3D Imaging.",
                    "A MRF Formulation for Coded Structured Light.",
                    "Partial Surface Integration Based on Variational Implicit Functions and Surfaces for 3D Model Building.",
                    "Multiresolution Interactive Modeling with Efficient Visualization.",
                    "Multisensor Fusion for Volumetric Reconstruction of Large Outdoor Areas.",
                    "Unsupervised 3D Object Recognition and Reconstruction in Unordered Datasets.",
                    "Automatic Class Selection and Prototyping for 3-D Object Classification.",
                    "3-D Vision Technology for Occupant Detection and Classification.",
                    "Digitizing Archaeological Excavations from Multiple Views.",
                    "An Improved Calibration Technique for Coupled Single-Row Telemeter and CCD Camera.",
                    "Incremental Catmull-Clark Subdivision.",
                    "Fitting of 3D Circles and Ellipses Using a Parameter Decomposition Approach.",
                    "An Efficient Scattered Data Approximation Using Multilevel B-Splines Based on Quasi-Interpolants.",
                    "Coordination of Appearance and Motion Data for Virtual View Generation of Traditional Dances.",
                    "A Mechanism for Range Image Integration without Image Registration.",
                    "Virtual Clay Modeling System Using Multi-Viewpoint Images.",
                    "Spatio-Temporal Fusion of Multiple View Video Rate 3D Surfaces.",
                    "3D Models from Extended Uncalibrated Video Sequences: Addressing Key-Frame Selection and Projective Drift.",
                    "Detecting Cylinders in 3D Range Data Using Model Selection Criteria.",
                    "Fast Alignment of 3D Geometrical Models and 2D Color Images Using 2D Distance Maps.",
                    "Evaluating Collinearity Constraint for Automatic Range Image Registration.",
                    "Registration of Multiple Range Scans as a Location Recognition Problem: Hypothesis Generation, Refinement and Verification.",
                    "Transform-Based Methods for Indexing and Retrieval of 3D Objects.",
                    "A Flexible 3D Modeling System Based on Combining Shape-from-Silhouette with Light-Sectioning Algorithm.",
                    "A Complete U-V-Disparity Study for Stereovision Based 3D Driving Environment Analysis.",
                    "Automatic Burr Detection on Surfaces of Revolution Based on Adaptive 3D Scanning.",
                    "Real-Time Image Based Rendering from Uncalibrated Images.",
                    "Correction of Color Information of a 3D Model Using a Range Intensity Image.",
                    "Hierarchical Coarse to Fine Depth Estimation for Realistic View Interpolation.",
                    "Relighting Acquired Models of Outdoor Scenes.",
                    "Semi-Automatic Range to Range Registration: A Feature-Based Method.",
                    "3D Registration by Textured Spin-Images.",
                    "A Robust Image-Based Method for 3D Registration.",
                    "Hierarchical Segmentation of Range Images with Contour Constraints.",
                    "Scale Selection for Classification of Point-Sampled 3-D Surfaces.",
                    "Accurate Principal Directions Estimation in Discrete Surfaces.",
                    "Uncalibrated Multiple Image Stereo System with Arbitrarily Movable Camera and Projector for Wide Range Scanning.",
                    "Accuracy of 3D Scanning Technologies in a Face Scanning Scenario.",
                    "Capturing 2½D Depth and Texture of Time-Varying Scenes Using Structured Infrared Light.",
                    "Efficient Photometric Stereo Technique for Three-Dimensional Surfaces with Unknown BRDF.",
                    "Extracting Main Modes of Human Body Shape Variation from 3-D Anthropometric Data.",
                    "From Range Data to Animated Anatomy-Based Faces: A Model Adaptation Method.",
                    "Euclidean Reconstruction from Translational Motion Using Multiple Cameras.",
                    "Contour Point Tracking by Enforcement of Rigidity Constraints.",
                    "Simultaneous Determination of Registration and Deformation Parameters among 3D Range Images.",
                    "Globally Convergent Range Image Registration by Graph Kernel Algorithm.",
                    "Robust and Accurate Partial Surface Registration Based on Variational Implicit Surfaces for Automatic 3D Model Building.",
                    "Bayesian Modelling of Camera Calibration and Reconstruction.",
                    "Toward a Near Optimal Quad/Triangle Subdivision Surface Fitting.",
                    "Identifying the Interface between Two Sand Materials.",
                    "A Contour-Based Approach to 3D Text Labeling on Triangulated Surfaces.",
                    "Shape Reconstruction of Human Foot from Multi-Camera Images Based on PCA of Human Shape Database.",
                    "Realistic Human Head Modeling with Multi-View Hairstyle Reconstruction.",
                    "Determining Characteristic Views of a 3D Object by Visual Hulls and Hausdorff Distance.",
                    "3D Modeling of Outdoor Environments by Integrating Omnidirectional Range and Color Images.",
                    "Acquisition of View-Based 3-D Object Models Using Supervised, Unstructured Data.",
                    "The Planar: A Mobile VR Tool with Pragmatic Pose Estimation for Generation and Manipulation of 3D Data in Industrial Environments.",
                    "Automatic Registration of Range Images Based on Correspondence of Complete Plane Patches.",
                    "Fast Simultaneous Alignment of Multiple Range Images Using Index Images.",
                    "Projection-Based Registration Using a Multi-View Camera for Indoor Scene Reconstruction.",
                    "Efficient Discovery Service for a Digital Library of 3D Models.",
                    "Micro-Stereoscopic Vision System for the Determination of Air Bubbles and Aqueous Droplets Content within Oil Drops in Simulated Processes of Multiphase Fermentations.",
                    "Stereo by Multiperspective Imaging under 6 DOF Camera Motion.",
                    "Bootstrapped Real-Time Ego Motion Estimation and Scene Modeling.",
                    "Discrete Pose Space Estimation to Improve ICP-Based Tracking.",
                    "Projective Surface Matching of Colored 3D Scans.",
                    "Fast Multiple-Baseline Stereo with Occlusion.",
                    "Image-Gradient-Guided Real-Time Stereo on Graphics Hardware.",
                    "Gaussian Scale-Space Dense Disparity Estimation with Anisotropic Disparity-Field Diffusion.",
                    "3D Digitization of a Large Model of Imperial Rome.",
                    "Non-Parametric 3D Surface Completion.",
                    "Multi-Resolution Modeling and Locally Refined Collision Detection for Haptic Interaction.",
                    "An Adaptive Dandelion Model for Reconstructing Spherical Terrain-Like Visual Hull Surfaces."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th 3DIM 2003",
        "info": "Banff, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2003",
                "sub_name": "4th International Conference on 3D Digital Imaging and Modeling (3DIM 2003), 6-10 October 2003, Banff, Canada.",
                "count": 61,
                "papers": [
                    "Automatic Modeling of Animatable Virtual Humans - A Survey.",
                    "Deformable Model with Adaptive Mesh and Automated Topology Changes.",
                    "Image-Based Object Editing.",
                    "Optimized Position Sensors for Flying-Spot Active Triangulation Systems.",
                    "Accuracy of 3D Range Scanners by Measurement of the Slanted Edge Modulation Transfer Function.",
                    "Silhouette and Stereo Fusion for 3D Object Modeling.",
                    "Efficient Surface Reconstruction from Range Curves.",
                    "Next View Planning for a Combination of Passive and Active Acquisition Techniques.",
                    "Cramer-Rao Bounds for Nonparametric Surface Reconstruction from Range Data.",
                    "Effective Nearest Neighbor Search for Aligning and Merging Range Images.",
                    "Active Balloon Model Based On 3D Skeleton Extraction By Competitive Learning.",
                    "Using k-d Trees for Robust 3D Point Pattern Matching.",
                    "3D Animation Of Cerebral Activity Using Both Spatial And Temporal fMRI Information.",
                    "3D optical scanning diagnostics for Leonardo Da Vinci's \"Adorazione dei Magi\" conservation.",
                    "Human Figure Reconstruction and Modeling from Single Image or Monocular Video Sequence.",
                    "Segmentation and Modeling of Approximately Rotationally Symmetric Objects in 3D Ultrasound.",
                    "Automatic 3D modeling of palatal plaster casts.",
                    "Colour Texture Fusion of Multiple Range Images.",
                    "A Range Image Refinement Technique for Multi-view 3D Model Reconstruction.",
                    "3-D Motion and Shape from Multiple Image Sequences.",
                    "Free-Form Surface Reconstruction from Multiple Images .",
                    "Reliable and Rapidly-Converging ICP Algorithm Using Multiresolution Smoothing.",
                    "Combining texture and shape for automatic crude patch registration.",
                    "Evaluating Structural Constraints for Accurate Range Image Registration.",
                    "Parallel Alignment of a Large Number of Range Images.",
                    "Adaptive Enhancement of 3D Scenes using Hierarchical Registration of Texture-Mapped 3D models.",
                    "3D Head Pose Estimation with Optical Flow and Depth Constraints.",
                    "Multi-projectors for arbitrary surfaces without explicit calibration nor reconstructio.",
                    "Calibration of a Zooming Camera using the Normalized Image of the Absolute Conic.",
                    "Image-Based Techniques for Digitizing Environments and Artifacts.",
                    "Exploiting Mirrors for Laser Stripe 3D Scanning.",
                    "Recursive Model Optimization Using ICP and Free Moving 3D Data Acquisition.",
                    "Geometrically Stable Sampling for the ICP Algorithm.",
                    "Enhanced, Robust Genetic Algorithms for Multiview Range Image Registration.",
                    "A Fast Point-to-Tangent Plane Technique for Multi-view Registration.",
                    "The ModelCamera: a Hand-Held Device for Interactive Modeling.",
                    "Real-time Range Scanning of Deformable Surfaces by Adaptively Coded Structured Light.",
                    "Effective 3D Modeling Of Heritage Sites.",
                    "Scanning and Processing 3D Objects for Web Display.",
                    "Virtual Reconstruction of broken and unbroken Pottery.",
                    "Digital Preservation of Ancient Cuneiform Tablets Using 3D-Scanning.",
                    "Accuracy Verification and Enhancement in 3D Modeling: Application to Donatello's Maddalena.",
                    "Solving architectural modelling problems using knowledge.",
                    "Anisotropic diffusion of surface normals for feature preserving surface reconstruction.",
                    "Surface Curvature Estimation from the Signed Distance Field.",
                    "Three-Dimensional Reconstruction of the Bony Structures involved in the Articular Complex of the Human Shoulder Using Shape-Based Interpolation and Contour-Based Extrapolation.",
                    "A Discrete Reeb Graph Approach for the Segmentation of Human Body Scans .",
                    "Human Identification from Body Shape.",
                    "Automatic Model Refinement for 3D Reconstruction with Mobile Robots.",
                    "Efficient Reconstruction of Indoor Scenes with Color.",
                    "Taking Consensus of Signed Distance Field for Complementing Unobservable Surface.",
                    "Registration and Fusion of Intensity and Range Data for 3D Modelling of Real World Scenes.",
                    "A Multi-Resolution ICP with Heuristic Closest Point Search for Fast and Robust 3D Registration of Range Images.",
                    "A Hierarchical Method for Aligning Warped Meshes.",
                    "Approximate K-D Tree Search for Efficient ICP.",
                    "Stable Real-Time Interaction Between Virtual Humans And Real Scenes .",
                    "Weighted Cone-Curvature: Applications for 3D Shapes Similarity.",
                    "Streaming Transmission of Point-Sampled Geometry Based on View-Dependent Level-of-Detail.",
                    "Surflet-Pair-Relation Histograms: A Statistical 3D-Shape Representation for Rapid Classification.",
                    "A Point-and-Shoot Color 3D Camera.",
                    "Interactive Shape Acquisition using Marker Attached Laser Projecto."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3rd 3DIM 2001",
        "info": "Quebec City, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/2001",
                "sub_name": "3rd International Conference on 3D Digital Imaging and Modeling (3DIM 2001), 28 May - 1 June 2001, Quebec City, Canada.",
                "count": 49,
                "papers": [
                    "A Self-Referenced Hand-Held Range Sensor.",
                    "Calibration-Free Approach to 3D Reconstruction Using Light Stripe Projections on a Cube Frame.",
                    "Approaches to a Color Scannerless Range Imaging System.",
                    "Compact and Portable 3D Camera for Space Applications.",
                    "In Process 3D-Sensing for Laser Material Processing.",
                    "Extract and Display Moving Object in All Direction by Using Stereo Omnidirectional System(SOS).",
                    "3D Modeling of Archaeological Vessels Using Shape from Silhouette.",
                    "Stroboscopic Stereo Rangefinder.",
                    "Dual-Beam Structured-Light Scanning for 3-D Object Modeling.",
                    "Compact 3D Profilometer with Grazing Incidence Diffraction Optics.",
                    "Structure and Motion from Two Uncalibrated Views Using Points on Planes.",
                    "A Laser Range Scanner Designed for Minimum Calibration Complexity.",
                    "Combining Off- and On-Line Calibration of a Digital Camera.",
                    "A 3D Laser Micro-sensor Integrating Control and Data Processing in an FPGA-Based Calculator.",
                    "Modeling from Reality.",
                    "View Planning with a Registration Constraint.",
                    "Computing Camera Positions from a Multi-camera Head.",
                    "Efficient Variants of the ICP Algorithm.",
                    "Automatic 3D Modeling Using Range Images Obtained from Unknown Viewpoints.",
                    "A Nearest Neighbor Method for Efficient ICP.",
                    "Robust Recognition and Pose Determination of 3-D Objects Using Range Images in Eigenspace.",
                    "A Method for the Registration of Attributed Range Images.",
                    "Reconstruction of Complex Environments by Robust Pre-aligned ICP.",
                    "The Parallel Iterative Closest Point Algorithm.",
                    "Real-Time Geometrical Tracking and Pose Estimation Using Laser Triangulation and Photogrammetry.",
                    "Affine Transformations of 3D Objects Represented with Neural Networks.",
                    "Reliable 3D Surface Acquisition, Registration and Validation Using Statistical Error Models.",
                    "Reconstruction of Surfaces behind Occlusions in Range Images.",
                    "Planar Patch Extraction with Noisy Depth Data.",
                    "Range Image Registration: A Software Platform and Empirical Evaluation.",
                    "Generation of Geometric Model by Registration and Integration of Multiple Range Images.",
                    "Three-Dimensional Shape Modeling with Extended Hyperquadrics.",
                    "Refining Triangle Meshes by Non-linear Subdivision.",
                    "How Much 3D-Information Can We Acquire? Optical Range Sensors at the Physical Limit, and Where to Apply Them.",
                    "Comparison of HK and SC Curvature Description Methods.",
                    "Fast Range Image Segmentation by an Edge Detection Strategy.",
                    "Shape Recovery and Analysis of Large Screw Threads.",
                    "3D Reconstruction from Two Orthogonal Views Using Simulated Annealing Approach.",
                    "Processing Range Data for Reverse Engineering and Virtual Reality.",
                    "A Method of Style Discrimination of Oil Painting Based on 3D Range Data.",
                    "Estimation of Elastic Constants from 3D Range-Flow.",
                    "Tolerance Control with High Resolution 3D Measurement.",
                    "Reconstructing Urban 3D Model Using Vehicle-Borne Laser Range Scanners.",
                    "AVENUE: Automated Site Modeling in Urban Environments.",
                    "Acquisition of Three-Dimensional Information in a Real Environment by Using the Stereo Omni-directional System (SOS).",
                    "3D Capture for Computer Graphics.",
                    "3D Modeling System of Human Face and Full 3D Facial Caricaturing.",
                    "3-D Landmark Detection and Identification in the CAESAR Project.",
                    "A Physically-Based Model for Real-Time Facial Expression Animation."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2nd 3DIM 1999",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/1999",
                "sub_name": "2nd International Conference on 3D Digital Imaging and Modeling (3DIM '99), 4-8 October 1999, Ottawa, Canada.",
                "count": 58,
                "papers": [
                    "The Digital Michelangelo Project.",
                    "Hand-Held Acquisition of 3D Models with a Video Camera.",
                    "A Low-Cost Range Finder Using a Visually Located, Structured Light Source.",
                    "Digital 3D Imaging System for Rapid Response on Remote Sites.",
                    "Advances in the Cooperation of Shape from Shading and Stereo Vision.",
                    "Moving Objects Detection from Time-Varied Background: An Application of Camera 3D Motion Analysis.",
                    "Locking onto 3D-Structure by a Combined Vergence and Fusion System.",
                    "3D Shape Recovery and Registration based on the Projection of Non Coherent Structured Light.",
                    "Curve and Surface Models to Drive 3D Reconstruction Using Stereo and Shading.",
                    "Calibration of a Laser Stripe Profiler.",
                    "Computing Consistent Normals and Colors from Photometric Data.",
                    "Bayesian Estimation of Distance and Surface Normal with a Time-of-Flight Laser Rangefinder.",
                    "Model-Based Scanning Path Generation for Inspection.",
                    "Virtual Environments for Critical Intervention Support: Modeling, Design and Implementation Issues.",
                    "CAD-Based Range Sensor Placement for Optimum 3D Data Acquisitio.",
                    "Computations on a Spherical View Space for Efficient Planning of Viewpoints in 3-D Object Modeling.",
                    "An Automation System for Industrial 3-D Laser Digitizing.",
                    "Multiview Registration for Large Data Sets.",
                    "Robust Surface Matching for Registration.",
                    "Self-Calibration of a Light Striping System by Matching Multiple 3-D Profile Maps.",
                    "Registering Two Overlapping Range Images.",
                    "Fast and Robust Registration of 3D Surfaces Using Low Curvature Patche.",
                    "Experimental Analysis of Harmonic Shape Images.",
                    "Estimating Pose Through Local Geometry.",
                    "Efficient and Reliable Template Set Matching for 3D Object Recognition.",
                    "Joined Segmentation of Cortical Surface and Brain Volume in MRI Using a Homotopic Deformable Cellular Model.",
                    "Extraction and Tracking of Surfaces in Range Image Sequences.",
                    "A Geometric Approach to the Segmentation of Range Images.",
                    "OSCAR: Object Segmentation Using Correspondence and Relaxation.",
                    "Faithful Recovering of Quadric Surfaces from 3D Range Data.",
                    "Progressive Multilevel Meshes from Octree Particles.",
                    "Generating Smooth Surfaces with Bicubic Splines over Triangular Meshes: Toward Automatic Model Building from Unorganized 3D Points.",
                    "Constructing NURBS Surface Model from Scattered and Unorganized Range Data.",
                    "Dynamic Gaze-Controlled Levels of Detail of Polygonal Objects in 3-D Environment Modeling.",
                    "The Mapping of Texture on VR Polygonal Models.",
                    "Modeling Structured Environments by a Single Moving Camera.",
                    "Indoor Scene Reconstruction from Sets of Noisy Range Images.",
                    "Large Data Sets and Confusing Scenes in 3-D Surface Matching and Recognition.",
                    "Edge-Based Approach to Mesh Simplification.",
                    "The Caesar Project: A 3-D Surface Anthropometry Survey.",
                    "Building Symbolic Information for 3D Human Body Modeling from Range Data.",
                    "Building 3D Facial Models and Detecting Face Pose in 3D Space.",
                    "Automatic Body Measurement for Mass Customization of Garments.",
                    "3D Statistical Shape Models for Medical Image Segmentation.",
                    "Hand Posture Estimation from 2D Monocular Image.",
                    "On-Line Hand-Eye Calibration.",
                    "Virtual Environment Modeling by Integrated Optical and Acoustic Sensing.",
                    "Is Appearance-Based Structure from Motion Viable?",
                    "On Estimating the Position of Fragments on Rotational Symmetric Pottery.",
                    "Automatic Feature Correspondence for Scene Reconstruction from Multiple Views.",
                    "PALM: Portable Sensor-Augmented Vision System for Large-Scene Modeling.",
                    "Dense Disparity Estimation Using Gabor Filters and Image Derivatives.",
                    "On the Detection of Feature Points of 3D Facial Image and its Application to 3D Facial Caricature.",
                    "Three-Dimensional Modelling and Rendering of the Human Skeletal Trunk from 2D Radiographic Images.",
                    "A 3D Scanning System Based on Low-Occlusion Approach.",
                    "Appearance-Based Virtual View Generation of Temporally-Varying Events from Multi-Camera Images in the 3D Room.",
                    "Recovery of Shape and Surface Reflectance of Specular Object from Rotation of Light Source.",
                    "Curvature Estimation for Segmentation of Triangulated Surfaces."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st 3DIM 1997",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/3dim/1997",
                "sub_name": "International Conference on Recent Advances in 3-D Digital Imaging and Modeling (3DIM '97), May 12-15, 1997, Ottawa, Ontario, Canada.",
                "count": 45,
                "papers": [
                    "Data Acquisition and Representation of Mechanical Parts and Interfaces to Manufacturing Devices.",
                    "Design Considerations for a Range Image Sensor Containing a PSD-array and An On-chip Multiplexer.",
                    "3-D Imager for Dimensional Gauging of Industrial Workpieces: State-of-the-Art of the Development of a Robust and Versatile System.",
                    "Toward Optimal Structured Light Patterns.",
                    "Rangefinder using Time Correlated Single Photon Counting.",
                    "Shape Measurement of Discontinuous Objects using Projected Fringes and Temporal Phase Unwrapping.",
                    "A Fast and Accurate 3-D Rangefinder using the Biris Technology: The TRID Sensor.",
                    "Automatic 3 -- D Digitization using a Laser Rangefinder with a Small Field of View.",
                    "Active Modeling of 3-D Objects: Planning on the Next Best Pose (NBP) for Acquiring Range Images.",
                    "3-D Modeling from Range Imagery: An Incremental Method with a Planning Component.",
                    "A Registration Aid.",
                    "Registration of 3-D Partial Surface Models using Luminance and Depth Information.",
                    "Geometric Matching of 3-D Objects: Assessing the Range of Successful Initial Configurations.",
                    "Frequency Domain Estimation of 3-D Rigid Motion Based on Range and Intensity Data.",
                    "Fast Global Registration of 3D Sampled Surfaces using a Multi-Z-Buffer Technique.",
                    "Surface Registration by Matching Oriented Points.",
                    "Estimation of 3-D Pose and Shape from a Monocular Image Sequence and Realtime Human Tracking.",
                    "Generalized Cylinders Extraction in a Range Image.",
                    "Extracting Surface Patches from Complete Range Descriptions.",
                    "Segmentation of Range Images into Planar Regions.",
                    "Constructing Models of Articulating Objects: Range Data Partitioning.",
                    "Automatic Reconstruction of 3D Objects using a Mobile Monoscopic Camera.",
                    "Multi-Resolution Geometric Fusion.",
                    "Physics-Based Models for Image Analysis/Synthesis and Geometric Design.",
                    "A Portable Three-Dimensional Digitizer.",
                    "Robust Meshes from Multiple Range Maps.",
                    "A System for Semi-Automatic Modeling of Complex Environments.",
                    "A Scene Analysis System for the Generation of 3-D Models.",
                    "Automatic CAD Modeling of Industrial Pipes from Range Images.",
                    "Registration and Integration of Textured 3-D Data.",
                    "Building 3-D City Models from Multiple Unregistered Profile Maps.",
                    "CAD and Vision in Rangefinder-based Dimensional Metrology.",
                    "Reducing Movement Artifacts in Whole Body Scanning.",
                    "Optimal Postures and Positioning for Human Body Scanning.",
                    "3-D Modeling of Human Hand with Motion Constraints.",
                    "From Coarse to Fine Correspondence of 3-D Facial Images and its Application to Facial Caricaturing.",
                    "Locating Landmarks on Human Body Scan Data.",
                    "Automatic Editing and Curve-fitting of 3-D Surface Scan Data of the Human Body.",
                    "Road Surface Inspection using Laser Scanners Adapted for the High Precision Measurements of Large Flat Surfaces.",
                    "Automated Pavement Distress Collection and Analysis: A 3-D Approach.",
                    "Using PCA to Model Shape for Process Control.",
                    "Object Model Creation from Multiple Range Images: Acquisition, Calibration, Model Building and Verification.",
                    "Industrial Painting Inspection using Specular Sharpness.",
                    "Fusing and Guiding Range Measurements with Colour Video Images.",
                    "Nefertiti: A Query by Content Software for Three-Dimensional Models Databases Management."
                ]
            }
        ]
    }
]