[
    {
        "year": "2021",
        "name": "27th VRST 2021",
        "info": "Virtual Event / Osaka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2021",
                "sub_name": "VRST '21: 27th ACM Symposium on Virtual Reality Software and Technology, Virtual Event / Osaka, Japan, December 8 - 10, 2021.",
                "count": 109,
                "papers": [
                    "Avatar Tracking Control with Generations of Physically Natural Responses on Contact to Reduce Performers' Loads.",
                    "Fusing Semantic Segmentation and Object Detection for Visual SLAM in Dynamic Scenes.",
                    "Impostor-based Rendering Acceleration for Virtual, Augmented, and Mixed Reality.",
                    "Inside-Out Instrument Tracking for Surgical Navigation in Augmented Reality.",
                    "Non-isomorphic Interaction Techniques for Controlling Avatar Facial Expressions in VR.",
                    "Ubiq: A System to Build Flexible Social Virtual Reality Experiences.",
                    "Investigating the Effect of Sensor Data Visualization Variances in Virtual Reality.",
                    "Spatial Augmented Reality Visibility and Line-of-Sight Cues for Building Design.",
                    "ImNDT: Immersive Workspace for the Analysis of Multidimensional Material Data From Non-Destructive Testing.",
                    "Effects of Image Realism on the Stress Response in Virtual Reality.",
                    "opticARe - Augmented Reality Mobile Patient Monitoring in Intensive Care Units.",
                    "The Influence of in-VR Questionnaire Design on the User Experience.",
                    "Towards Context-aware Automatic Haptic Effect Generation for Home Theatre Environments.",
                    "The Effect of Increased Body Motion in Virtual Reality on a Placement-Retrieval Task.",
                    "VRGaitAnalytics: Visualizing Dual Task Cost for VR Gait Assessment.",
                    "Investigating the Effects of Virtual Patients' Nonsensical Responses on Users' Facial Expressions in Mental Health Training Scenarios.",
                    "Catching Jellies in Immersive Virtual Reality: A Comparative Teleoperation Study of ROVs in Underwater Capture Tasks.",
                    "BreachMob: Detecting Vulnerabilities in Physical Environments Using Virtual Reality.",
                    "EntangleVR: A Visual Programming Interface for Virtual Reality Interactive Scene Generation.",
                    "Image-Based Texture Styling for Motion Effect Rendering.",
                    "Virtual Rotations for Maneuvering in Immersive Virtual Environments.",
                    "Using Gaze Behavior and Head Orientation for Implicit Identification in Virtual Reality.",
                    "InteractML: Making machine learning accessible for creative practitioners working with movement interaction in immersive media.",
                    "Research and Practice Recommendations for Mixed Reality Design - Different Perspectives from the Community.",
                    "Qualitative Dimensions of Technology-Mediated Reflective Learning: The Case of VR Experience of Psychosis.",
                    "RotoWrist: Continuous Infrared Wrist Angle Tracking using a Wristband.",
                    "PAIR: Phone as an Augmented Immersive Reality Controller.",
                    "Mid-Air Thermo-Tactile Feedback using Ultrasound Haptic Display.",
                    "TangibleData: Interactive Data Visualization with Mid-Air Haptics.",
                    "PneuMod: A Modular Haptic Device with Localized Pressure and Thermal Feedback.",
                    "Ellipses Ring Marker for High-speed Finger Tracking.",
                    "Enabling Robot-assisted Motion Capture with Human Scale Tracking Optimization.",
                    "Presenting Sense of Loud Vocalization Using Vibratory Stimuli to the Larynx and Auditory Stimuli.",
                    "Absolute and Differential Thresholds of Motion Effects in Cardinal Directions.",
                    "Analysis of Detection Thresholds for Hand Redirection during Mid-Air Interactions in Virtual Reality.",
                    "Virtual Reality platform for functional magnetic resonance imaging in ecologically valid conditions.",
                    "Enhancing In-game Immersion Using BCI-controlled Mechanics.",
                    "Perceived Realism of Pedestrian Crowds Trajectories in VR.",
                    "Pressing a Button You Cannot See: Evaluating Visual Designs to Assist Persons with Low Vision through Augmented Reality.",
                    "Flyables: Haptic Input Devices for Virtual Realityusing Quadcopters.",
                    "Object Manipulations in VR Show Task- and Object-Dependent Modulation of Motor Patterns.",
                    "Modeling Pointing for 3D Target Selection in VR.",
                    "Virtual Object Categorisation Methods: Towards a Richer Understanding of Object Grasping for Virtual Reality.",
                    "Actions, not gestures: contextualising embodied controller interactions in immersive virtual reality.",
                    "3D Printing an Accessory Dock for XR Controllers and its Exemplary Use as XR Stylus.",
                    "A Compact and Low-cost VR Tooth Drill Training System using Mobile HMD and Stylus Smartphone.",
                    "A Hat-shaped Pressure-Sensitive Multi-Touch Interface for Virtual Reality.",
                    "A Perceptual Evaluation of the Ground Inclination with a Simple VR Walking Platform.",
                    "A Pilot Study Examining the Unexpected Vection Hypothesis of Cybersickness.",
                    "A sharing system for the annoyance of menstrual symptoms using electrical muscle stimulation and thermal stimulations.",
                    "A System for Practicing Ball/Strike Judgment in VR Environment.",
                    "A Tangible Haptic Feedback Box for Mixed Reality Billiard in Tight Spaces.",
                    "ALiSE: Non-wearable AR display through the looking glass, and what looks solid there.",
                    "An Evaluation of Methods for Manipulating Virtual Objects at Different Scales.",
                    "An Infant-Like Device that Reproduces Hugging Sensation with Multi-Channel Haptic Feedback.",
                    "An Interactive Flight Operation with 2-DOF Motion Platform.",
                    "CAVE applications: from craft manufacturing to product line engineering.",
                    "Conference Talk Training With a Virtual Audience System.",
                    "Content-rich and Expansive Virtual Environments Using Passive Props As World Anchors.",
                    "Dealing with a Panic Attack: a Virtual Reality Training Module for Postgraduate Psychology Students.",
                    "Designing Obstacle Reminder for Safe AR Navigation.",
                    "Double-Layered Cup-Shaped Device to Amplify Taste Sensation of Carbonation by the Electrical Stimulation on the Human Tongue.",
                    "Effect of Visual Feedback on Understanding Timbre with Shapes Based on Crossmodal Correspondences.",
                    "Effects of User's Gaze on the Unintended Positional Drift in Walk-in-Place.",
                    "Efficient Mapping Technique under Various Spatial Changes for SLAM-based AR Services.",
                    "Emotional Virtual Reality Stroop Task: Pilot Design.",
                    "Estimate the Difference Threshold for Curvature Gain of Redirected Walking.",
                    "Evaluating the influence of interaction technology on procedural learning using Virtual Reality.",
                    "Exploring Emotion Brushes for a Virtual Reality Painting Tool.",
                    "Fishtank Sandbox: A Software Framework for Collaborative Usability Testing of Fish Tank Virtual Reality Interaction Techniques.",
                    "Fluid3DGuides: A Technique for Structured 3D Drawing in VR.",
                    "Force-Based Foot Gesture Navigation in Virtual Reality.",
                    "Freehand Interaction in Virtual Reality: Bimanual Gestures for Cross-Workspace Interaction.",
                    "GazeMOOC: A Gaze Data Driven Visual Analytics System for MOOC with XR Content.",
                    "HapticPanel: An Open System to Render Haptic Interfaces in Virtual Reality for Manufacturing Industry.",
                    "HoloKeys: Interactive Piano Education Using Augmented Reality and IoT.",
                    "IMAGEimate - An End-to-End Pipeline to Create Realistic Animatable 3D Avatars from a Single Image Using Neural Networks.",
                    "Immersive Analytics: A User-Centered Perspective.",
                    "Immersive Furnishing - Randomized Big Five Personality Traits Based Interior Layouts.",
                    "Immersive Visual Interaction with Autonomous Multi-Vehicle Systems.",
                    "Incorporating Human Behavior in VR Compartmental Simulation Models.",
                    "Interactive Visualization of Deep Learning Models in an Immersive Environment.",
                    "Managing a Crisis in Virtual Reality - Tackling a Wildfire.",
                    "Miniature AR: Multi-view 6DOF Virtual Object Visualization for a Miniature Diorama.",
                    "Multi-Componential Analysis of Emotions Using Virtual Reality.",
                    "Multi-View AR Streams for Interactive 3D Remote Teaching.",
                    "Natural walking speed prediction in Virtual Reality while using target selection-based locomotion.",
                    "Of Leaders and Directors: A visual model to describe and analyse persistent visual cues directing to single out-of view targets.",
                    "Preliminary analysis of visual cognition estimation in VR toward effective assistance timing for iterative visual search tasks.",
                    "Preservation and Reproduction of Real Soundscapes in Virtual Space for the \"100 Best Soundscapes in Japan\".",
                    "ProMVR - Protein Multiplayer Virtual Reality Tool.",
                    "Recreating a Medieval Mill as a Virtual Learning Environment.",
                    "Remote Visual Line-of-Sight: A Remote Platform for the Visualisation and Control of an Indoor Drone using Virtual Reality.",
                    "Safety First: A Study of Users' Perception of VR Adoption in Vehicles.",
                    "SpArc: A VR Animating Tool at Your Fingertips.",
                    "Study of Heart Rate Visualizations on a Virtual Smartwatch.",
                    "Swaying Locomotion: A VR-based Locomotion System through Head Movements.",
                    "Table-Based Interactive System for Augmenting Japanese Food Culture Experience.",
                    "Technical Factors Affecting Augmented Reality User Experiences in Sports Spectating.",
                    "The Application of Virtual Reality in Student Recruitment.",
                    "The Effect of 2D Stylized Visualization of the Real World for Obstacle Avoidance and Safety in Virtual Reality System Usage.",
                    "UGRA in VR: A Virtual Reality Simulation for Training Anaesthetists.",
                    "Using Hand Tracking and Voice Commands to Physically Align Virtual Surfaces in AR for Handwriting and Sketching with HoloLens 2.",
                    "Validating Social Distancing through Deep Learning and VR-Based Digital Twins.",
                    "Visual Transition of Avatars Improving Speech Comprehension in Noisy VR Environments.",
                    "Visualisation methods for patient monitoring in anaesthetic procedures using augmented reality.",
                    "VR Rehearse & Perform - A platform for rehearsing in Virtual Reality.",
                    "VRBT: A Non-pharmacological VR approach towards hypertension.",
                    "XRSpectator: Immersive, Augmented Sports Spectating."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th VRST 2020",
        "info": "Virtual Event, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2020",
                "sub_name": "VRST '20: 26th ACM Symposium on Virtual Reality Software and Technology, Virtual Event, Canada, November 1-4, 2020.",
                "count": 78,
                "papers": [
                    "DualVib: Simulating Haptic Sensation of Dynamic Mass by Combining Pseudo-Force and Texture Feedback.",
                    "Docking Haptics: Extending the Reach of Haptics by Dynamic Combinations of Grounded and Worn Devices.",
                    "VRSketchPen: Unconstrained Haptic Assistance for Sketching in Virtual 3D Environments.",
                    "The Impact of Missing Fingers in Virtual Reality.",
                    "Moving Virtual Reality out of its Comfort Zone and Into the African Kalahari Desert Field: Experiences From Technological Co-Exploration With an Indigenous San Community in Namibia.",
                    "Investigating Immersive Virtual Reality as an Educational Tool for Quantum Computing.",
                    "Characterizing In-Air Eyes-Free Typing Movements in VR.",
                    "Virtual Reality in Computer Science Education: A Systematic Review.",
                    "Virtual Navigation considering User Workspace: Automatic and Manual Positioning before Teleportation.",
                    "Towards Physically Interactive Virtual Environments: Reactive Alignment with Redirected Walking.",
                    "Evaluating Automatic Parameter Control Methods for Locomotion in Multiscale Virtual Environments.",
                    "Effects of Synchronized Leg Motion in Walk-in-Place Utilizing Deep Neural Networks for Enhanced Body Ownership and Sense of Presence in VR.",
                    "Virtual Projection Planes for the Visual Comparison of Photogrammetric 3D Reconstructions with Photo Footage.",
                    "Body LayARs: A Toolkit for Body-Based Augmented Reality.",
                    "CorFix: Virtual Reality Cardiac Surgical Planning System for Designing Patient Specific Vascular Grafts.",
                    "A Call for Auditable Virtual, Augmented and Mixed Reality.",
                    "Effect of Cognitive Load on Curvature Redirected Walking Thresholds.",
                    "The Effects of Visual Realism on Spatial Memory and Exploration Patterns in Virtual Reality.",
                    "Eye-Hand Coordination Training for Sports with Mid-air VR.",
                    "Empirical Evaluation of Gaze-enhanced Menus in Virtual Reality.",
                    "Temporal Consistent Motion Parallax for Omnidirectional Stereo Panorama Video.",
                    "Capture to Rendering Pipeline for Generating Dynamically Relightable Virtual Objects with Handheld RGB-D Cameras.",
                    "Investigating Effects and User Preferences of Extra- and Intradiegetic Virtual Reality Questionnaires.",
                    "Effects of Immersive Virtual Reality Content Type to Mindfulness and Physiological Parameters.",
                    "Anonymity vs. Familiarity: Self-Disclosure and Privacy in Social Virtual Reality.",
                    "A Quest for Co-Located Mixed Reality: Aligning and Assessing SLAM Tracking for Same-Space Multi-User Experiences.",
                    "The Effects of Self- and External Perception of Avatars on Cognitive Task Performance in Virtual Reality.",
                    "The Effects of Full-Body Avatar Movement Predictions in Virtual Reality using Neural Networks.",
                    "Realistic Virtual Humans from Smartphone Videos.",
                    "The Experience of Social Touch in Multi-User Virtual Reality.",
                    "Virtual Humans in AR: Evaluation of Presentation Concepts in an Industrial Assistance Use Case.",
                    "Don't Bother Me: How to Handle Content-Irrelevant Objects in Handheld Augmented Reality.",
                    "Multiplex Vision: Understanding Information Transfer and F-Formation With Extended 2-Way FOV.",
                    "Bacterial Load of Virtual Reality Headsets.",
                    "Dynamic Projection Mapping of Deformable Stretchable Materials.",
                    "AffectivelyVR: Towards VR Personalized Emotion Recognition.",
                    "An Adaptive Low-cost Approach to Display Different Scenes to Multi-users for the Light Field Display.",
                    "An Examination of Effects of Fear Using VR Content on Time Estimation.",
                    "An Examination of Influence on Weight Perception by Visual Change of the Own Arm.",
                    "An Immersive Decision Support System for Disaster Response.",
                    "An Open Framework for Infinite Walking With Saccadic Redirection.",
                    "Analyzing the Trade-off between Selection and Navigation in VR.",
                    "ARLS: An asymmetrical remote learning system for sharing anatomy between an HMD and a light field display.",
                    "ARtist: Interactive Augmented Reality for Curating Children's Artworks.",
                    "Assessing the Suitability and Effectiveness of Mixed Reality Interfaces for Accurate Robot Teleoperation.",
                    "ATOM: HMD-VR Interface to Learn Atomic Structure, Bonding and Historical Research Experiments.",
                    "Augmented Reality World Editor.",
                    "CasualVRVideos: VR videos from casual stationary videos.",
                    "Computing Object Selection Difficulty in VR using Run-time Contextual Analysis.",
                    "Creating a Smart Virtual-Reality based Contextual Diary for People with Persistent Postural-Perceptual Dizziness to Facilitate Habituation.",
                    "Creating AR Applications for the IOT : a New Pipeline.",
                    "Dual Phone AR: Exploring the use of Phones as Controllers for Mobile Augmented Reality.",
                    "Evaluation of Headset-based Viewing and Desktop-based Viewing of Remote Lectures in a Social VR Platform.",
                    "Haptic Selfies: Bold and Beautiful Living for the Blind and Visually Impaired.",
                    "HexTouch: Affective Robot Touch for Complementary Interactions to Companion Agents in Virtual Reality.",
                    "HMDPose: A large-scale trinocular IR Augmented Reality Glasses Pose Dataset.",
                    "Human Following Behavior In Virtual Reality.",
                    "Immersive Analysis of Crystallographic Diffraction Data.",
                    "Impact of Social Distancing to Mitigate the Spread of COVID-19 in a Virtual Environment.",
                    "Inconsistencies of Presence Questionnaires in Virtual Reality.",
                    "Introduction to AR-Bot, an AR system for robot navigation.",
                    "Life-size Sequential Photography in a Mixed Reality Environment.",
                    "Mediated-Timescale Learning: Manipulating Timescales in Virtual Reality to Improve Real-World Tennis Forehand Volley.",
                    "Metachron: A framework for time perception research in VR.",
                    "Molecular MR Multiplayer: a cross-platform collaborative interactive game for scientists.",
                    "On the Interplay of Foveated Rendering and Video Encoding.",
                    "Physicalizing Virtual Objects with Affordances to Support Tangible Interactions in AR.",
                    "Portals With a Twist: Cable Twist-Free Natural Walking in Room-Scaled Virtual Reality.",
                    "Ray-Casting-based 3D pointing and Dragging Interface for Naked-Eye Stereoscopic Displays.",
                    "RoadVR: Mitigating the Effect of Vection and Sickness by Distortion of Pathways for In-Car Virtual Reality.",
                    "Smart Thermo-Haptic Bracelet for VR Environment.",
                    "Teaching Scrum with a Virtual Sprint Simulation: Initial Design and Considerations.",
                    "Text Input Methods in Virtual Reality using Radial Layouts.",
                    "The Digital Docent: XR storytelling for a Living History Museum.",
                    "Using Multiple Perspective Projections to Guide Visual Attention in Glyph-based Data Visualisations in VR.",
                    "Viewing Style of Augmented Reality/Virtual Reality Broadcast Contents while Sharing a Virtual Experience.",
                    "Volumetric capture for narrative films.",
                    "VR Training for Warehouse Management."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th VRST 2019",
        "info": "Parramatta, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2019",
                "sub_name": "25th ACM Symposium on Virtual Reality Software and Technology, VRST 2019, Parramatta, NSW, Australia, November 12-15, 2019.",
                "count": 118,
                "papers": [
                    "Out-of-body Locomotion: Vectionless Navigation with a Continuous Avatar Representation.",
                    "Obstacle Detection and Alert System for Smartphone AR Users.",
                    "Sensitivity to Rate of Change in Gains Applied by Redirected Walking.",
                    "Lower body control of a semi-autonomous avatar in Virtual Reality: Balance and Locomotion of a 3D Bipedal Model.",
                    "Technologies for Social Augmentations in User-Embodied Virtual Reality.",
                    "Avatar Type Affects Performance of Cognitive Tasks in Virtual Reality.",
                    "Being More Focused and Engaged in Firefighting Training: Applying User-Centered Design to VR System Development.",
                    "Fearing Disengagement from the Real World.",
                    "Immersive Insights: A Hybrid Analytics System forCollaborative Exploratory Data Analysis.",
                    "Adventures in Hologram Space: Exploring the Design Space of Eye-to-eye Volumetric Telepresence.",
                    "Exploring the Use of a Robust Depth-sensor-based Avatar Control System and its Effects on Communication Behaviors.",
                    "Investigating the Detection of Bimanual Haptic Retargeting in Virtual Reality.",
                    "ElectroCutscenes: Realistic Haptic Feedback in Cutscenes of Virtual Reality Games Using Electric Muscle Stimulation.",
                    "A Hybrid Method for Powdered Materials Modeling.",
                    "Measurement-based Hyper-elastic Material Identification and Real-time FEM Simulation for Haptic Rendering.",
                    "CompRate: Power Efficient Heart Rate and Heart Rate Variability Monitoring on Smart Wearables.",
                    "Bilateral Motion Display: Strategy to Provide Multiple Visual Perception Using Afterimage Effects for Specific Motion.",
                    "Signifier-Based Immersive and Interactive 3D Modeling.",
                    "Virtual Reality Forge: Pattern-Oriented Authoring of Virtual Reality Nuggets.",
                    "POL360: A Universal Mobile VR Motion Controller using Polarized Light.",
                    "HawKEY: Efficient and Versatile Text Entry for Virtual Reality.",
                    "DexController : Designing a VR Controller with Grasp-Recognition for Enriching Natural Game Experience.",
                    "A Technique for Mixed Reality Remote Collaboration using 360 Panoramas in 3D Reconstructed Scenes.",
                    "Single RGB-D Fitting: Total Human Modeling with an RGB-D Shot.",
                    "Floating-point Precision and Deformation Awareness for Scalable and Robust 3D Face Alignment.",
                    "Depth Perception in Projective Augmented Reality: An Evaluation of Advanced Visualization Techniques.",
                    "Portable Mid-air Imaging Optical System on Glossy Surface.",
                    "The Stroop Room: A Virtual Reality-Enhanced Stroop Test.",
                    "Underwater Virtual Reality System for Neutral Buoyancy Training: Development and Evaluation.",
                    "Hitting the Wall: Mid-Air Interaction for Eye-Hand Coordination.",
                    "Juggling in VR: Advantages of Immersive Virtual Reality in Juggling Learning.",
                    "Investigating a Physical Dial as a Measurement Tool for Cybersickness in Virtual Reality.",
                    "In AI We Trust: Investigating the Relationship between Biosignals, Trust and Cognitive Load in VR.",
                    "Share My Space: A Novel Redirected Walking Method for Shared Indoor Spaces in Virtual Reality.",
                    "Is the Pen Mightier than the Controller? A Comparison of Input Devices for Selection in Virtual and Augmented Reality.",
                    "Augmented Reality for Children in a Confirmation Task: Time, Fatigue, and Usability.",
                    "Smart3DGuides: Making Unconstrained Immersive 3D Drawing More Accurate.",
                    "Extended Sliding in Virtual Reality.",
                    "SlingDrone: Mixed Reality System for Pointing and Interaction Using a Single Drone.",
                    "2D/3D Mixed Interface for Furniture Placement in Smartphone-based Mobile Augmented Reality.",
                    "A Comparison of Human and Machine-Generated Voice.",
                    "A Comparative Study of Planar Surface and Spherical Surface for 3D Pointing Using Direct Touch.",
                    "A Content-Aware Approach for Analysing Eye Movement Patterns in Virtual Reality.",
                    "A Framework for Virtual Reality Training to Improve Public Speaking.",
                    "A Glyph-based Multimodal Presentation of Multivariate Data.",
                    "A Haptic-enhanced New Approach to Laryngoscopy.",
                    "A Mobile Augmented Reality Interface for Teaching Folk Dances.",
                    "A Scalability Benchmark for a Virtual Audience Perception Model in Virtual Reality.",
                    "A Virtual Reality Simulator for Training Gaze Control of Wheeled Tele-Robots.",
                    "A Web-based Augmented Reality Plat-form using Pictorial QR Code for Educational Purposes and Beyond.",
                    "An Evaluation of Head-Mounted Virtual Reality for Special Education from the Teachers' Perspective.",
                    "Action Units: Directing User Attention in 360-degree Video based VR.",
                    "AHMED: Toolset for Ad-Hoc Mixed-reality Exhibition Design.",
                    "Analysis of VR Sickness and Gait Parameters During Non-Isometric Virtual Walking with Large Translational Gain.",
                    "Augmented Reality Approach For Position-based Service using Handheld Smartphone.",
                    "Augmented Reality Visualisation Concepts to Support Intraoperative Distance Estimation.",
                    "Blind Navigation of Web Pages through Vibro-tactile Feedbacks.",
                    "Can We Predict Susceptibility to Cybersickness?",
                    "Cinévoqué: Development of a Passively Responsive Framework for Seamless Evolution of Experiences in Immersive Live-Action Movies.",
                    "Comfortable Locomotion in VR: Teleportation is Not a Complete Solution.",
                    "Design and Realization of Sustainable Rural Housing Using Immersive Virtual Reality Platform.",
                    "Design of Portable Thermal Sensor Device for VR.",
                    "Drone-Steering: A Novel VR Traveling Technique.",
                    "Effects of Age and Motivation for Visiting on AR Museum Experiences.",
                    "Effects of Latency in Visual Feedback on Human Performance of Path-Steering Tasks.",
                    "Effects of Tactile Perception on Emotion and Immersion to Film Viewing in a Virtual Environment.",
                    "Enhancement of Pointing Towards Non-Haptic Augmented Reality Interfaces by Increasing the Arm Position Sense.",
                    "Evaluation of Navigation Operations in Immersive Microscopic Visualization.",
                    "Experiencing Waiting Time in Virtual Reality.",
                    "Exploring Experiences of Virtual Reality among Young and Older Adults in a Subway Fire Scenario: a Pilot Study.",
                    "Exploring Immersive Technologies to Simulate Fear of Crime.",
                    "Impact of Gamified Interaction with Virtual Nature on Sustained Attention and Self-Reported Restoration - A Pilot Study.",
                    "Indian Virtual reality affective database with self-report measures and EDA.",
                    "Interactive Indirect Illumination Using Mipmap-based Ray Marching and Local Means Replaced Denoising.",
                    "Interactive Virtual-Reality Fire Extinguisher with Haptic Feedback.",
                    "Interactive Visualization of Painting Data with Augmented Reality.",
                    "IRIS: Inter-Reality Interactive Surface.",
                    "Learning-based Estimation of 6-DoF Camera Poses from Partial Observation of Large Objects for Mobile AR.",
                    "LINACVR: VR Simulation for Radiation Therapy Education.",
                    "Mixed Reality Speaker Identification as an Accessibility Tool for Deaf and Hard of Hearing Users.",
                    "Monocular Viewing Protects Against Cybersickness Produced by Head Movements in the Oculus Rift.",
                    "Optical-Reflection Type 3D Augmented Reality Mirrors.",
                    "PanoFlex: Adaptive Panoramic Vision to Accommodate 360° Field-of-View for Humans.",
                    "Predicting the Torso Direction from HMD Movements for Walk-in-Place Navigation through Deep Learning.",
                    "Preliminary Evaluation of the Usability of a Virtual Reality Game for Mudslide Education for Children.",
                    "Proposing a Hand-Tracking Device using a Tangential Force Mechanical Sensor.",
                    "Real-time Monitoring Method for Cybersickness using Physiological Signals.",
                    "RecyGlide : A Forearm-worn Multi-modal Haptic Display aimed to Improve User VR Immersion Submission.",
                    "Scalebridge VR: Immersive Proportional Reasoning Game for Children with Brain-Computer Interface for Difficulty Scaling.",
                    "Soap film flow and thickness for soap bubble rendering.",
                    "SolarVR for inter-cognitive and intra-cognitive communication.",
                    "The Impact of Stereo Rendering on the Perception of Normal Mapped Geometry in Virtual Reality.",
                    "Toward Effective Virtual Reality Intervention Development Planning for People with Persistent Postural-Perceptual Dizziness.",
                    "Towards Dynamic Positioning of Text Content on a Windshield Display for Automated Driving.",
                    "TTT: Time Synchronization Method by Time Distortion for VR Training including Rapidly Moving Objects.",
                    "Understanding Enjoyment in VR Games with GameFlow.",
                    "UniVResity: Face-to-Face Class Participation for Remote Students using Virtual Reality.",
                    "Vertical Locomotion in VR Using Full Body Gestures.",
                    "Virtual Immersive Educational Systems: The case of 360° video and co-learning design.",
                    "Visualizing Convolutional Neural Networks with Virtual Reality.",
                    "Where to Place the Camera.",
                    "WiredSwarm: High Resolution Haptic Feedback Provided by a Swarm of Drones to the User's Fingers for VR interaction.",
                    "ALS-SimVR: Advanced Life Support Virtual Reality Training Application.",
                    "AssessAR: An Augmented Reality Based Environmental Impact Assessment Framework.",
                    "Development of MirrorShape: High Fidelity Large-Scale Shape Rendering Framework for Virtual Reality.",
                    "DexController : Hand-Held Controller Recognizing Grasp-Pose and Grasp-Force in Virtual Reality Defense Game.",
                    "Dynamic Virtual Proteins: Visualization, Interaction and Collaboration in Virtual Reality.",
                    "Emotion Evoking Art Exhibition in VR.",
                    "Extended Reality for Chronic Pain Relief.",
                    "Interactive Visualization of Painting Data with Augmented Reality.",
                    "Layered Horizons: a Geospatial Humanities Research Platform.",
                    "OORT: An Air-flow based Cooling System for Long-term Virtual Reality Sessions.",
                    "PillowVR: Virtual Reality in Bed.",
                    "Real Time Point Cloud Self-Avatar With A Single RGB-D Camera.",
                    "Spatially Accurate Generative Music with AR Drawing.",
                    "Text Entry Method for Immersive Virtual Environments Using Curved Keyboard.",
                    "Virtual environment for processing medial axis representations of 3D nanoscale reconstructions of brain cellular structures.",
                    "VR Minecraft for Art."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th VRST 2018",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2018",
                "sub_name": "Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology, VRST 2018, Tokyo, Japan, November 28 - December 01, 2018.",
                "count": 136,
                "papers": [
                    "Sublime: a hands-free virtual reality menu navigation system using a high-frequency SSVEP-based brain-computer interface.",
                    "Audio-tactile proximity feedback for enhancing 3D manipulation.",
                    "Tactile hand motion and pose guidance for 3D interaction.",
                    "Standards-compliant HTTP adaptive streaming of static light fields.",
                    "Design and implementation of a multi-person fish-tank virtual reality display.",
                    "VR safari park: a concept-based world building interface using blocks and world tree.",
                    "Balloonygen: extended tabletop display embedded with balloon-like deformable spherical screen.",
                    "Comparison of the usability of a car infotainment system in a mixed reality environment and in a real car.",
                    "Camera time warp: compensating latency in video see-through head-mounted-displays for reduced cybersickness effects.",
                    "Performer vs. observer: whose comfort level should we consider when examining the social acceptability of input modalities for head-worn display?",
                    "Merging environments for shared spaces in mixed reality.",
                    "Perceived weight of a rod under augmented and diminished reality visual effects.",
                    "Tracking projection mosaicing by synchronized high-speed optical axis control.",
                    "Gaze navigation in the real world by changing visual appearance of objects using projector-camera system.",
                    "Eyestrain impacts on learning job interview with a serious game in virtual reality: a randomized double-blinded study.",
                    "Keep my head on my shoulders!: why third-person is bad for navigation in VR.",
                    "MR video fusion: interactive 3D modeling and stitching on wide-baseline videos.",
                    "Dynamic HDR environment capture for mixed reality.",
                    "An evaluation of pupillary light response models for 2D screens and VR HMDs.",
                    "Occlusion handling using semantic segmentation and visibility-based rendering for mixed reality.",
                    "Co-presence and proxemics in shared walkable virtual environments with mixed colocation.",
                    "A longitudinal study of small group interaction in social virtual reality.",
                    "Human upper-body inverse kinematics for increased embodiment in consumer-grade virtual reality.",
                    "Immersion and coherence in a stressful virtual environment.",
                    "The physical-virtual table: exploring the effects of a virtual human's physical influence on social interaction.",
                    "With a little help from a holographic friend: the OpenIMPRESS mixed reality telepresence toolkit for remote collaboration systems.",
                    "Training in IVR: investigating the effect of instructor design on social presence and performance of the VR user.",
                    "Am I in the theater?: usability study of live performance based virtual reality.",
                    "Discrete scene rotation during blinks and its effect on redirected walking algorithms.",
                    "The effect of chair type on users' viewing experience for 360-degree video.",
                    "Data-driven modeling of group entitativity in virtual environments.",
                    "Hybrid orbiting-to-photos in 3D reconstructed visual reality.",
                    "Automatic transfer of musical mood into virtual environments.",
                    "Step aside: an initial exploration of gestural input for lateral movement during walking-in-place locomotion.",
                    "Haptic around: multiple tactile sensations for immersive environment and interaction in virtual reality.",
                    "Can we perceive changes in our moving speed: a comparison between directly and indirectly powering the locomotion in virtual environments.",
                    "HFX studio: haptic editor for full-body immersive experiences.",
                    "The impact of fear of the sea on working memory performance: a research based on virtual reality.",
                    "Investigating the reason for increased postural instability in virtual reality for persons with balance impairments.",
                    "In-pulse: inducing fear and pain in virtual experiences.",
                    "Investigating different modalities of directional cues for multi-task visual-searching scenario in virtual reality.",
                    "Effects of haptic texture rendering modalities on realism.",
                    "A lightweight and efficient system for tracking handheld objects in virtual reality.",
                    "A low-cost motion platform with balance board.",
                    "A low-cost omni-directional VR walking platform by thigh supporting and motion estimation.",
                    "AR DeepCalorieCam V2: food calorie estimation with CNN and AR-based actual size estimation.",
                    "Automatic 3D modeling of artwork and visualizing audio in an augmented reality environment.",
                    "Design-led 3D visualization of nanomedicines in virtual reality.",
                    "EXG wearable human-machine interface for natural multimodal interaction in VR environment.",
                    "Future-mine VR as narrative decision making tool.",
                    "GravityCup: a liquid-based haptics for simulating dynamic weight in virtual reality.",
                    "Hand motion prediction for just-in-time thermo-haptic feedback.",
                    "Immersive auditory display system 'sound cask': three-dimensional sound field reproduction system based on the boundary surface control principle.",
                    "Indoor AR navigation using tilesets.",
                    "Interactive virtual exhibition: creating custom virtual art galleries using web technologies.",
                    "Real-time virtual brain aneurysm clipping surgery.",
                    "Tap-tap menu: body touching for virtual interactive menus.",
                    "TransFork: using olfactory device for augmented tasting experience with video see-through head-mounted display.",
                    "Using mixed reality for promoting brand perception.",
                    "Virtual reality environment to support activity in the real world: a case of working environment using microscope.",
                    "VirtualHaus: a collaborative mixed reality application with tangible interface.",
                    "Visualizing and exploring OSGi-based software architectures in augmented reality.",
                    "VRTe do: the way of the virtual hand.",
                    "3D model augmentation using depth information in an AR environment.",
                    "A binocular stereo effect parameter calculator towards visual comfort.",
                    "A real-time golf-swing training system using sonification and sound image localization.",
                    "Acquiring short range 4D light transport with synchronized projector camera system.",
                    "An AR system for artistic creativity education.",
                    "An evaluation of smartphone-based interaction in AR for constrained object manipulation.",
                    "Analysis of the R-V dynamics illusion behavior in terms of auditory stimulation.",
                    "AR navigation solution using vector tiles.",
                    "Automatic 3D modeling of artwork and visualizing audio in an augmented reality environment.",
                    "Being them: presence of using non-human avatars in immersive virtual environment.",
                    "BoatAR: a multi-user augmented-reality platform for boat.",
                    "Chest compression simulator that presents vibrations at the moment of rib fracture: transition of learning effect of compression position over a month.",
                    "Deep face rotation in the wild.",
                    "Designing dynamic aware interiors.",
                    "Does automatic game difficulty level adjustment improve acrophobia therapy?: differences from baseline.",
                    "Dual-MR: interaction with mixed reality using smartphones.",
                    "Effect of accompanying onomatopoeia to interaction sound for altering user perception in virtual reality.",
                    "Effect of accompanying onomatopoeia with sound feedback toward presence and user experience in virtual reality.",
                    "Effect of change of head angle on visual horizontal plane.",
                    "Effects of head-display lag on presence in the oculus rift.",
                    "Effects of low video latency between visual information and physical sensation in immersive environments.",
                    "Estimation of distance between thumb and forefinger from hand dorsal image using deep learning.",
                    "Evaluating ray casting and two gaze-based pointing techniques for object selection in virtual reality.",
                    "EXController: enhancing interaction capability for VR handheld controllers using real-time vision sensing.",
                    "Experience the dougong construction in virtual reality.",
                    "Experimenting novel virtual-reality immersion strategy to alleviate cybersickness.",
                    "Extending recreational environments with a landscape-superimposed display using mixed reality.",
                    "Gaze and body capture system under VR experiences.",
                    "Gigapixel virtual reality employing live superzoom cameras.",
                    "Hamlet: directing virtual actors in computational live theater.",
                    "Hands-free vibrotactile feedback for object selection tasks in virtual reality.",
                    "High color-fidelity display using a modified projector.",
                    "Illumination for 360 degree cameras.",
                    "Image compensation and stabilization for immersive 360-degree videos from capsule endoscopy.",
                    "Impression estimation model and pattern search system based on style features and Kansei metric.",
                    "Interactive virtual exhibition: creating custom virtual art galleries using web technologies.",
                    "Investigation on the cutaneous/proprioceptive contribution to the force sensation induced by electrical stimulation above tendon.",
                    "JamGesture: an improvisation support system based on physical gesture observed with smartphone.",
                    "Learning-based word segmentation for reliable text document retrieval and augmentation.",
                    "Let's guide a smart interface for VR HMD and leap motion.",
                    "Low-cost VR collaborative system equipped with haptic feedback.",
                    "Mathematical model for pop-up effect of ChromaDepth.",
                    "Measuring physical exertion in virtual reality exercise games.",
                    "Motion recognition for automatic control of a block machine.",
                    "Multi-view augmented reality with a drone.",
                    "Perceptual model optimized efficient foveated rendering.",
                    "PeriTextAR: utilizing peripheral vision for reading text on augmented reality smart glasses.",
                    "Phantazuma: the stage machinery enabling the audience members to watch different contents depending on their position by vision control film and pepper's ghost.",
                    "plARy: sound augmented reality system using video game background music.",
                    "Preliminary study on angular properties of spatial awareness of human in virtual space.",
                    "Prototyping impossible objects with VR.",
                    "Ramen spoon eraser: CNN-based photo transformation for improving attractiveness of ramen photos.",
                    "Random-forest-based initializer for solving inverse problem in 3D motion tracking systems.",
                    "Realistic simulation of progressive vision diseases in virtual reality.",
                    "Real-time human motion forecasting using a RGB camera.",
                    "Resolving occlusion for 3D object manipulation with hands in mixed reality.",
                    "Simultaneous independent information display at multiple depths using multiple projectors and patterns created by epipolar constraint and homography transformation.",
                    "Study on VR-based wheelchair simulator using vection-inducing movies and limited-motion patterns.",
                    "System of delivering virtual object to user in remote place by handing gestures.",
                    "Texture synthesis for stable planar tracking.",
                    "The impact of camera height in cinematic virtual reality.",
                    "Towards first person gamer modeling and the problem with game classification in user studies.",
                    "Towards unobtrusive obstacle detection and notification for VR.",
                    "User-centric classification of virtual reality locomotion.",
                    "Using deep-neural-network to extend videos for head-mounted display experiences.",
                    "\"Virtual ability simulation\" to boost rehabilitation exercise performance and confidence for people with disability.",
                    "Virtual gaze: exploring use of gaze as rich interaction method with virtual agent in interactive virtual reality content.",
                    "Virtual reality interactivity in a museum environment.",
                    "Visualization of neural networks in virtual reality using Unreal Engine.",
                    "Visualization of software components and dependency graphs in virtual reality.",
                    "VR sickness measurement with EEG using DNN algorithm.",
                    "Walking into ancient paintings with virtual candles.",
                    "XRCreator: interactive construction of immersive data-driven stories."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd VRST 2017",
        "info": "Gothenburg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2017",
                "sub_name": "Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology, VRST 2017, Gothenburg, Sweden, November 8-10, 2017.",
                "count": 91,
                "papers": [
                    "Beyond cute: exploring user types and design opportunities of virtual reality pet games.",
                    "The matrix has you: realizing slow motion in full-body virtual reality.",
                    "JackIn Airsoft: localization and view sharing for strategic sports.",
                    "Can you cut it?: an exploration of the effects of editing in cinematic virtual reality.",
                    "Edible retroreflector.",
                    "A comparison of head-mounted displays vs. large-screen displays for an interactive pedestrian simulator.",
                    "Outside-in monocular IR camera based HMD pose estimation via geometric optimization.",
                    "A tile based colour picture with hidden QR code for augmented reality and beyond.",
                    "Virtual reality studies outside the laboratory.",
                    "Agent: automatic generation of experimental protocol runtime.",
                    "Accurate real-time occlusion for mixed reality.",
                    "Fast generation of realistic virtual humans.",
                    "Design and exploration of braiding swarms in VR.",
                    "A hybrid CRF framework for semantic 3D reconstruction.",
                    "Collaborators awareness for user cohabitation in co-located collaborative virtual environments.",
                    "Immersive environment for distributed creative collaboration.",
                    "Towards seamless interaction between physical and virtual locations for asymmetric collaboration.",
                    "Legomotion: scalable walking-based virtual locomotion.",
                    "CheekInput: turning your cheek into an input surface by embedded optical sensors on a head-mounted display.",
                    "Gain compensation in redirected walking.",
                    "Spontaneous alternation behavior in humans.",
                    "Evaluating snapping-to-photos virtual travel interfaces for 3D reconstructed visual reality.",
                    "A unified model for interaction in 3D environment.",
                    "A study on improving performance in gesture training through visual guidance based on learners' errors.",
                    "Automated interior design using a genetic algorithm.",
                    "Auris: creating affective virtual spaces from music.",
                    "Using custom transformation axes for mid-air manipulation of 3D virtual objects.",
                    "Computational design of hand-held VR controllers using haptic shape illusion.",
                    "Real-world occlusion in optical see-through AR displays.",
                    "Occlusion in outdoor augmented reality using geospatial building data.",
                    "Exploring the effects of observed physicality conflicts on real-virtual human interaction in augmented reality.",
                    "PanoTrace: interactive 3D modeling of surround-view panoramic images in virtual reality.",
                    "Case-based planning for large virtual agent societies.",
                    "Pulse and vital sign measurement in mixed reality using a HoloLens.",
                    "Virtual reality navigation system for prostate biopsy.",
                    "Measurement of exceptional motion in VR video contents for VR sickness assessment using deep convolutional autoencoder.",
                    "Information recall in a virtual reality disability simulation.",
                    "Presence and immersion of \"easy\" mobile VR with open flip-on lenses.",
                    "The effect of avatar realism in immersive social virtual realities.",
                    "Effects of virtual arm representations on interaction in virtual environments.",
                    "Dual task based cognitive stress induction and its influence on path integration.",
                    "A comparative study of 2D and 3D mobile keypad user interaction preferences in virtual reality graphic user interfaces.",
                    "A multiple-view geometric model of specularities on non-uniformly curved surfaces.",
                    "A virtual reality based internet-of-things (IoT) framework for micro devices assembly.",
                    "Acoustical manipulation for redirected walking.",
                    "Adaptive method for 2.5D scattered point approximation.",
                    "Analysis of the user experience in a 3D gesture-based supported mobile VR game.",
                    "Augmented invaders: a mixed reality multiplayer outdoor game.",
                    "Augmented reality system with collision response simulation using measured coefficient of restitution of real objects.",
                    "Building a hybrid virtual agent for testing user empathy and arousal in response to avatar (micro-)expressions.",
                    "Capturing aboriginal heritage in virtual reality.",
                    "Color consistency of specular highlights in consumer cameras.",
                    "Data visualization versus data perception.",
                    "Diegetic cues for guiding the viewer in cinematic virtual reality.",
                    "Direct retinal signals for virtual environments.",
                    "Do you feel what you see?: multimodal perception in virtual reality.",
                    "\"Drop the beat\": virtual reality based mindfulness and cognitive behavioral therapy for panic disorder - a pilot study.",
                    "Emotionally mediated spatial experience with AR.",
                    "Enjoyable carving with ChiselDevice in mixed reality space.",
                    "Eyeexpression: exploring the use of eye expressions as hands-free input for virtual and augmented reality devices.",
                    "GalVR: a novel collaboration interface using GVS.",
                    "Hand-free natural user interface for VR HMD with IR based facial gesture tracking sensor.",
                    "Immercity: communicating about virtual and augmented realities.",
                    "Immersive VR for numerical engagement.",
                    "In situ editing (EiS) for fulldomes.",
                    "Integrating performer into a real-time augmented reality performance spatially by using a multi-sensory prop.",
                    "Multi-device mixed reality TV: a collaborative experience with joint use of a tablet and a headset.",
                    "Multi-view VR system for co-located multidisciplinary collaboration and its application in ergonomic design.",
                    "PeriText+: utilizing peripheral vision for reading text on augmented reality smart glasses.",
                    "ProjectDR: augmented reality system for displaying medical images directly onto a patient.",
                    "Real-time avatar animation synthesis from coarse motion input.",
                    "Real-time wall outline extraction for redirected walking.",
                    "ScatAR: a mobile augmented reality application that uses scattering delay networks for room acoustic synthesis.",
                    "Score-based recommendation for efficiently selecting individual virtual agents in multi-agent systems.",
                    "Searching and exploring software repositories in virtual reality.",
                    "The game of flow - cellular automaton-based fluid simulation for realtime interaction.",
                    "The impact of avatar-owner visual similarity on body ownership in immersive virtual reality.",
                    "Towards multimodal interactions: robot jogging in mixed reality.",
                    "Using virtual reality for scaffolding computer programming learning.",
                    "VR wildfire prevention: teaching campfire safety in a gamified immersive environment.",
                    "Which ranges of intensities are more perceptible for non-visual vibro-tactile navigation on touch-screen devices.",
                    "A gaze-preserving group video conference system using screen-embedded cameras.",
                    "A playback tool for reviewing VR experiences.",
                    "Cubely: virtual reality block-based programming environment.",
                    "Gaze- and qoe-aware video streaming solutions for mobile VR.",
                    "LabDesignAR: configuring multi-camera motion capture systems in augmented reality.",
                    "Solving Poisson's equation on the Microsoft HoloLens.",
                    "The interactive soundscape renderer for loudspeaker- and headphone-based spatial sound presentation.",
                    "The smart pin: a novel object manipulation technique for immersive virtual environments.",
                    "VEAAR: virtual environment for archaeological artefacts restoration.",
                    "Walkable self-overlapping virtual reality maze and map visualization demo: public virtual reality setup for asymmetric collaboration."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd VRST 2016",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2016",
                "sub_name": "Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology, VRST 2016, Munich, Germany, 2-4 November, 2016.",
                "count": 77,
                "papers": [
                    "Localized color correction for optical see-through displays via weighted linear regression.",
                    "Perceptual enhancement for stereoscopic videos based on horopter consistency.",
                    "Eye gaze tracking with google cardboard using purkinje images.",
                    "Acoustic selfies for extraction of external ear features in mobile audio augmented reality.",
                    "The impact of latency on perceptual judgments and motor performance in closed-loop interaction in virtual reality.",
                    "The asynchronous time warp for virtual reality on consumer hardware.",
                    "Towards comparable evaluation methods and measures for timing behavior of virtual reality systems.",
                    "The effects of cybersickness on persons with multiple sclerosis.",
                    "Investigating the process of emotion recognition in immersive and non-immersive virtual technological setups.",
                    "Take-over control paradigms in collaborative virtual environments for training.",
                    "Provision of automated step-by-step procedural guidance in virtual reality surgery simulation.",
                    "FakeMi: a fake mirror system for avatar embodiment studies.",
                    "Head turn scaling below the threshold of perception in immersive virtual environments.",
                    "Noise-cancelling, steps and soundscapes: the effect of auditory stimulation on presence in virtual realities while walking.",
                    "PedVR: simulating gaze-based interactions between a real user and virtual crowds.",
                    "Animating agents based on radial view in crowd simulation.",
                    "A real-time x-ray mobile application using augmented reality and google street view.",
                    "A study on improving close and distant device movement pose manipulation for hand-held augmented reality.",
                    "Multi-view gesture annotations in image-based 3D reconstructed scenes.",
                    "Robot gardens: an augmented reality prototype for plant-robot biohybrid systems.",
                    "A novel magnetic levitation haptic device for augmentation of tissue stiffness perception.",
                    "A platform for bimanual virtual assembly training with haptic feedback in large multi-object environments.",
                    "A fast and robust Six-DoF god object heuristic for haptic rendering of complex models with friction.",
                    "A hybrid constraint-penalty proxy method for six degree-of-freedom haptic display of deforming objects.",
                    "VR360HD: a VR360° player with enhanced haptic feedback.",
                    "3D reconstruction of indoor building environments with new generation of tablets.",
                    "Procedurally generated virtual reality from 3D reconstructed physical space.",
                    "Large scale cut plane: an occlusion management technique for immersive dense 3D reconstructions.",
                    "6-DOF computation and marker design for magnetic 3D dexterous motion-tracking system.",
                    "Interactive motion effects design for a moving object in 4D films.",
                    "Missing the point: an exploration of how to guide users' attention during cinematic virtual reality.",
                    "Depth information from binocular disparity and familiar size is combined when reaching towards virtual objects.",
                    "Perceiving depth: optical versus video see-through.",
                    "Visual blur in immersive virtual environments: does depth of field or motion blur affect distance and speed estimation?",
                    "Vista widgets: a framework for designing 3D user interfaces from reusable interaction building blocks.",
                    "The benefits of DOF separation in mid-air 3D object manipulation.",
                    "GiAnt: stereoscopic-compliant multi-scale navigation in VEs.",
                    "Improving freehand placement for grasping virtual objects via dual view visual feedback in mixed reality.",
                    "Combining bimanual interaction and teleportation for 3D manipulation on multi-touch wall-sized displays.",
                    "A compact, wide-FOV optical design for head-mounted displays.",
                    "A hologram based tele-existence platform for emotional exchange among a group of users in both real and virtual environments.",
                    "A low-cost, variable, interactive surface for mixed-reality tabletop games.",
                    "A motion based setup for peri-personal space estimation with virtual auditory displays.",
                    "A VR serious game for fire evacuation drill with synchronized tele-collaboration among users.",
                    "Accelerated viewpoint panning with rotational gain in 360 degree videos.",
                    "AR interaction paradigm for closed reduction of long-bone fractures via external fixation.",
                    "Are age differences missing in relative and absolute distance perception of stereoscopically presented virtual objects?",
                    "Audio feedback and illusion of virtual body ownership in mixed reality.",
                    "Augmented reality based remote coaching system.",
                    "Augmented reasoning in the mirror world.",
                    "Avatar anthropomorphism and acrophobia.",
                    "Breaking bad behavior: immersive training of class room management.",
                    "Comparison of gesture, gamepad, and gaze-based locomotion for VR worlds.",
                    "Concept for content-aware, automatic shifting for spherical panoramas.",
                    "Concept for using eye tracking in a head-mounted display to adapt rendering to the user's current visual field.",
                    "Cyber sick but still having fun.",
                    "Effects of speed and transitions on target-based travel techniques.",
                    "Estimation of individual redirected walking thresholds using standard perception tests.",
                    "Exploring floating stereoscopic driver-car interfaces with wide field-of-view in a mixed reality simulation.",
                    "HoVR-type: smartphone as a typing interface in VR using hovering.",
                    "Hybrid team interaction in the mixed reality continuum.",
                    "Immersive remote grasping: realtime gripper control by a heterogenous robot control system.",
                    "Inception: a creative coding environment for virtual reality, in virtual reality.",
                    "Industrial maintenance with augmented reality: two case studies.",
                    "Interactive gamified 3D-training of affine transformations.",
                    "Interference measurement of kinect for xbox one.",
                    "Maintainable management and access of lexical knowledge for multimodal virtual reality interfaces.",
                    "Medical imaging VR: can immersive 3D aid in diagnosis?",
                    "Postural stability analysis in virtual reality using the HTC vive.",
                    "Real time 3D geometry correction for folding screens or projectors with distorting lenses.",
                    "Shop 'til you hear it drop: influence of interactive auditory feedback in a virtual reality supermarket.",
                    "SIAMC: a socially immersive avatar mediated communication platform.",
                    "Temporal antialiasing for head mounted displays in virtual reality.",
                    "Texture analysis and repacking for improved storage efficiency.",
                    "TickTockRay: smartwatch-based 3D pointing for smartphone-based virtual reality.",
                    "Virtual viewpoint synthesis using CUDA acceleration.",
                    "Webizing human interface devices for virtual reality."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st VRST 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2015",
                "sub_name": "Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology, VRST 2015, Beijing, China, November 13-15, 2015.",
                "count": 44,
                "papers": [
                    "Indoor skydiving in immersive virtual reality with embedded storytelling.",
                    "Walking on foot to explore a virtual environment with uneven terrain.",
                    "Efficient intrinsic image decomposition for RGBD images.",
                    "Vector solid texture synthesis using two-scale shaping model.",
                    "Direct lighting on meso-structured surfaces with area light sources.",
                    "GPU ray-traced collision detection for cloth simulation.",
                    "Head-mounted display with mid-air tactile feedback.",
                    "TouchSketch: a touch-based interface for 3D object manipulation and editing.",
                    "Virtual reality based laparoscopic surgery simulation.",
                    "Interactive virtual percussion instruments on mobile devices.",
                    "High quality compatible triangulations for 2D shape morphing.",
                    "Procedural techniques for simulating the growth of plant leaves and adapting venation patterns.",
                    "A novel integrated analysis-and-simulation approach for detail enhancement in FLIP fluid interaction.",
                    "Adaptive level set for fluid surface tracking.",
                    "VR system for rehabilitation based on hand gestural and olfactory interaction.",
                    "A real time haptic simulator of spine surgeries.",
                    "Embodied interaction using non-planar projections in immersive virtual reality.",
                    "Optimal camera placement for motion capture systems in the presence of dynamic occlusion.",
                    "Realizing a low-latency virtual reality environment for motor learning.",
                    "Dynamic projection mapping onto a deformable object with occlusion based on high-speed tracking of dot marker array.",
                    "Simulating high-DOF human-like agents using hierarchical feedback planner.",
                    "Adding sociality to virtual pedestrian groups.",
                    "Collaborative navigation in virtual worlds: how gender and game experience influence user behavior.",
                    "Video driven pedestrian visualization with characteristic appearances.",
                    "Modeling spatial relations of human body parts for indexing and retrieving close character interactions.",
                    "Evaluating the effects of competition vs collaboration on user engagement in an immersive game using natural interaction.",
                    "A streaming framework for instant 3D rendering and interaction.",
                    "Contributing to VRPN with a new server for haptic devices.",
                    "The effect of vibration and low-frequency audio on full-body haptic sensations.",
                    "Augmented reality for collision warning and path guide in a vehicle.",
                    "Local context based recognition + internet of things: complementary infrastructures for future generic mixed reality space.",
                    "Tele-augmentation for remote AR coaching.",
                    "Resolving view difference between eye and camera for proprioceptive pointing and selection in augmented reality applications.",
                    "Real-time adjustment of contrast saliency for improved information visibility in mobile augmented reality.",
                    "An imitation-based approach to represent common ground in a virtual basketball agent team mate.",
                    "Robust image/video super-resolution display.",
                    "Interactive volumetric segmentation through least-squares optimization of local hessian-constrained implicits.",
                    "Color correspondence of image warping using plane constraints.",
                    "Flexible point handles metaphor for character deformation.",
                    "Evaluating warped projection cameras.",
                    "Evaluation of factors affecting distance perception in architectural project review in immersive virtual environments.",
                    "JackIn head: immersive visual telepresence system with omnidirectional wearable camera for remote collaboration.",
                    "Distortion score based pose selection for 3D tele-immersion.",
                    "Augmented reality-aided tele-presence system for robot manipulation in industrial manufacturing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th VRST 2014",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2014",
                "sub_name": "Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology, VRST 2014, Edinburgh, United Kingdom, November 11-13, 2014.",
                "count": 44,
                "papers": [
                    "DigiTap: an eyes-free VR/AR symbolic input device.",
                    "Robust 6-DOF immersive navigation using commodity hardware.",
                    "Navigating immersive virtual environments through a foot controller.",
                    "AnyHaptics: a haptic plug-in for existing interactive 3D graphics applications.",
                    "Multiphase surface tracking with explicit contouring.",
                    "Model topology change with correspondence using electrostatics.",
                    "Robust random dot markers: towards augmented unprepared maps with pure geographic features.",
                    "Third person view and guidance for more natural motor behaviour in immersive basketball playing.",
                    "A hand posture recognition system utilizing frequency difference of infrared light.",
                    "Illumination independent marker tracking using cross-ratio invariance.",
                    "I'm in VR!: using your own hands in a fully immersive MR system.",
                    "Accelerating vision-based 3D indoor localization by distributing image processing over space and time.",
                    "User-perspective augmented reality magic lens from gradients.",
                    "A multi-resolution approach for adapting close character interaction.",
                    "Data-driven sequential goal selection model for multi-agent simulation.",
                    "Posture reconstruction using Kinect with a probabilistic model.",
                    "Towards real-time credible and scalable agent-based simulations of autonomous pedestrians navigation.",
                    "Simulator sickness and presence using HMDs: comparing use of a game controller and a position estimation system.",
                    "Desktop virtual reality for emergency preparedness: user evaluation of an aircraft ditching experience under different fear arousal conditions.",
                    "Profiling and benchmarking event- and message-passing-based asynchronous realtime interactive systems.",
                    "Performance improvement using data tags for handheld spatial augmented reality.",
                    "A usability scale for handheld augmented reality.",
                    "Threefolded motion perception during immersive walkthroughs.",
                    "The influence of step frequency on the range of perceptually natural visual walking speeds during walking-in-place and treadmill locomotion.",
                    "Displaying shapes with various types of surfaces using visuo-haptic interaction.",
                    "In touch with the remote world: remote collaboration with augmented reality drawings and virtual navigation.",
                    "A perspective geometry approach to user-perspective rendering in hand-held video see-through augmented reality.",
                    "A portable interface for tangible exploration of volumetric data.",
                    "A projection-based mixed-reality display for exterior and interior of a building diorama.",
                    "A view from the hill: where cross reality meets virtual worlds.",
                    "Braiding hair by braid theory.",
                    "Cost based estimation of intended locomotion targets using human locomotion models.",
                    "Dissection of hybrid soft tissue models using position-based dynamics.",
                    "Dual sensor filtering for robust tracking of head-mounted displays.",
                    "ExpanD: a stereoscopic expanding technique for compound graphs.",
                    "FingerOscillation: clutch-free techniques for 3D object translation, rotation and scale.",
                    "FishEyA: live broadcasting around 360 degrees.",
                    "Natural 7DoF navigation & interaction in 3D geovisualisations.",
                    "On the benefits of stereo graphics in virtual obstacle avoidance tasks.",
                    "Optimum design of haptic seat for driving simulator.",
                    "Poxels: polygonal voxel environment rendering.",
                    "Synchronized AR environment for multiple users using animation markers.",
                    "The collaborative design platform protocol: a protocol for a mixed reality installation for improved incorporation of laypeople in architecture.",
                    "Virtualized welding: a new paradigm for tele-operated welding."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th VRST 2013",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2013",
                "sub_name": "The 19th ACM Symposium on Virtual Reality Software and Technology, VRST'13, Singapore, October 6-9, 2013.",
                "count": 40,
                "papers": [
                    "Pattern-based real-time feedback for a temporal bone simulator.",
                    "Towards hand-eye coordination training in virtual knee arthroscopy.",
                    "Robust and high-fidelity guidewire simulation with applications in percutaneous coronary intervention system.",
                    "Emotion-enabled haptic-based serious game for post stroke rehabilitation.",
                    "A two-arm coordination model for phantom limb pain rehabilitation.",
                    "A methodology to assess the acceptability of human-robot collaboration using virtual reality.",
                    "Usability benchmarks for motion tracking systems.",
                    "The effects of VEs on mobility impaired users: presence, gait, and physiological response.",
                    "Can we use a brain-computer interface and manipulate a mouse at the same time?",
                    "Impact of graphical fidelity on physiological responses in virtual environments.",
                    "Facetons: face primitives with adaptive bounds for building 3D architectural models in virtual environment.",
                    "Interacting with danger in an immersive environment: issues on cognitive load and risk perception.",
                    "ShoeSoleSense: proof of concept for a wearable foot interface for virtual and real environments.",
                    "Bubble bee, an alternative to arrow for pointing out directions.",
                    "Scalable optical tracking for navigating large virtual environments using spatially encoded markers.",
                    "6DoF navigation in virtual worlds: comparison of joystick-based and head-controlled paradigms.",
                    "Tangible windows for a free exploration of wide 3D virtual environment.",
                    "Robust prediction of auditory step feedback for forward walking.",
                    "Persuading people in a remote destination to sing by beaming there.",
                    "Human-virtual human interaction by upper body gesture understanding.",
                    "AMITIES: avatar-mediated interactive training and individualized experience system.",
                    "Multi-party interaction with a virtual character and a human-like robot.",
                    "A multimodal person-following system for telepresence applications.",
                    "Supporting interoperability and presence awareness in collaborative mixed reality environments.",
                    "Real time whole body motion mapping for avatars and robots.",
                    "A pattern-based modeling framework for simulating human-like pedestrian steering behaviors.",
                    "Parallel cities.",
                    "Refurbish a single user 3D application into a multi-user distributed service: a case study.",
                    "Perceptual radiometric compensation for inter-reflection in immersive projection environment.",
                    "Distorted shadow mapping.",
                    "New iterative ray-traced collision detection algorithm for GPU architectures.",
                    "Video inlays: a system for user-friendly matchmove.",
                    "Drilling into complex 3D models with gimlenses.",
                    "Color correction for optical see-through displays using display color profiles.",
                    "The impact of display bezels on stereoscopic vision for tiled displays.",
                    "Seamless stitching of stereo images for generating infinite panoramas.",
                    "Improved pre-warping for wide angle, head mounted displays.",
                    "Intercept tags: enhancing intercept-based systems.",
                    "Are virtual patients effective to train diagnostic skills?: a study with bulimia nervosa virtual patients.",
                    "Cue-elicited craving for food in virtual reality."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th VRST 2012",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2012",
                "sub_name": "The 18th ACM Symposium on Virtual Reality Software and Technology, VRST 2012, Toronto, ON, Canada - December 10-12, 2012.",
                "count": 40,
                "papers": [
                    "Generating diverse ethnic groups with genetic algorithms.",
                    "Bridging the gap between visual exploration and agent-based pedestrian simulation in a virtual environment.",
                    "Real-time physical modelling of character movements with microsoft kinect.",
                    "OmniKinect: real-time dense volumetric data acquisition and applications.",
                    "iAR: an exploratory augmented reality system for mobile devices.",
                    "FlyVIZ: a novel display device to provide humans with 360° vision by coupling catadioptric camera with hmd.",
                    "Online real-time presentation of virtual experiences forexternal viewers.",
                    "Dense depth maps from sparse models and image coherence for augmented reality.",
                    "Achieving robust alignment for outdoor mixed reality using 3D range data.",
                    "HapSeat: producing motion sensation with multiple force-feedback devices embedded in a seat.",
                    "Simulation of deformable solids in interactive virtual reality applications.",
                    "Real-time simulation of long thin flexible objects in interactivevirtual environments.",
                    "Modifying an identified position of edged shapes using pseudo-haptic effects.",
                    "CrOS: a touch screen interaction technique for cursor manipulation on 2-manifolds.",
                    "Starfish: a selection technique for dense virtual environments.",
                    "Efficient selection of multiple objects on a large scale.",
                    "Brain computer interface vs walking interface in VR: the impact of motor activity on spatial transfer.",
                    "Leaning-based travel interfaces revisited: frontal versus sidewise stances for flying in 3D virtual spaces.",
                    "Evaluation of remote collaborative manipulation for scientific data analysis.",
                    "CaveUDK: a VR game engine middleware.",
                    "VINS: shared memory space for definition of interactive techniques.",
                    "Evaluating scala, actors, & ontologies for intelligent realtime interactive systems.",
                    "Tracking of manufacturing tools with cylindrical markers.",
                    "Random model variation for universal feature tracking.",
                    "Static pose reconstruction with an instrumented bouldering wall.",
                    "Pinch-n-paste: direct texture transfer interaction in augmented reality.",
                    "Underwater augmented reality game using the DOLPHYN.",
                    "Multimodal virtual environment subserving the design of electronic orientation aids for the blind.",
                    "Elastic connections: separating and observation methods for complex virtual objects.",
                    "Supporting data collection in virtual worlds.",
                    "Optical illusion in augmented reality.",
                    "Falling water with key particle and envelope surface for virtual liquid manipulation model.",
                    "Are immerrsive FPS games enjoyable?",
                    "A semantic reasoning engine for context-awareness: detection and enhancement of 3D interaction interests.",
                    "Gaze and gesture based object manipulation in virtual worlds.",
                    "Collaborative approach for dynamic adjustment of selection areas in polygonal modelling.",
                    "Spatial augmented reality based tangible CAD system.",
                    "A system for evaluating 3D pointing techniques.",
                    "Exploration of fused multi-volume images using user-defined binary masks.",
                    "Gesture-based interaction with 3D visualizations of document collections for exploration and search."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "VRST 2011",
        "info": "",
        "venues": []
    },
    {
        "year": "2010",
        "name": "17th VRST 2010",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2010",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2010, Hong Kong, China, November 22-24, 2010.",
                "count": 43,
                "papers": [
                    "Augmentation techniques for efficient exploration in head-mounted display environments.",
                    "Making first steps in VR: monitoring user progress in virtual travel.",
                    "Shake-your-head: revisiting walking-in-place for desktop virtual reality.",
                    "An adaptive training-free feature tracker for mobile phones.",
                    "Dynamic eye convergence for head-mounted displays.",
                    "A first person avatar system with haptic feedback.",
                    "Image-based 3D telecopier: a system for sharing a 3D object by multiple groups of people at remote locations.",
                    "Robust continuous collision detection for deformable objects.",
                    "A benchmarking suite for 6-DOF real time collision response algorithms.",
                    "Automatic generation of head models and facial animations considering personal characteristics.",
                    "Reduced deforming filter culling for fast continuous collision detection.",
                    "Physically-based animation for realistic interactions between tree branches and raindrops.",
                    "Can we distinguish biological motions of virtual humans?: perceptual study with captured motions of weight lifting.",
                    "Modeling spatially-varying reflectance based on Kernel Nyström.",
                    "Efficient deformable geometry image-maps.",
                    "Locating human hands for real-time pose estimation from monocular video.",
                    "Augmented reality haptics system for dental surgical skills training.",
                    "Real-time CSG rendering using fragment sort.",
                    "Multi-resolution screen-space ambient occlusion.",
                    "Exploring the usability of immersive interactive storytelling.",
                    "The effect of DOF separation in 3D manipulation tasks with multi-touch displays.",
                    "Industrial-strength painting with a virtual bristle brush.",
                    "A creative try: composing weaving patterns by playing on a multi-input device.",
                    "Dynamic decomposition and integration of degrees of freedom for 3-D positioning.",
                    "BioMetal glove.",
                    "Influence of auditory and visual feedback for perceiving walking over bumps and holes in desktop VR.",
                    "Region-of-interest volumetric visual hull refinement.",
                    "Footprint-profile sweep surface: a flexible method for realtime generation and rendering of massive urban buildings.",
                    "Automatic registration of multiple projectors on swept surfaces.",
                    "On-line visualization of underground structures using context features.",
                    "A multi-viewer tiled autostereoscopic virtual reality display.",
                    "A content-aware image resizing method with prominent object size adjusted.",
                    "Implicit restricted quadtree based visualization of large scale terrain.",
                    "Evaluating virtual weights for haptically enabled online shopping.",
                    "Closely coupled collaboration for search tasks.",
                    "Simulating the local behaviour of small pedestrian groups.",
                    "A real-time visual attention model for predicting gaze point during first-person exploration of virtual environments.",
                    "Perceiving motion transitions in pedestrian crowds.",
                    "Heat diffusion based dynamic load balancing for distributed virtual environments.",
                    "Evaluating depth perception of photorealistic mixed reality visualizations for occluded objects in outdoor environments.",
                    "Ensuring semantic spatial constraints in virtual environments using UML/OCL.",
                    "Reconfigurable tangible devices for 3D virtual object manipulation by single or multiple users.",
                    "Parallelizing continuum crowds."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16th VRST 2009",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2009",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2009, Kyoto, Japan, November 18-20, 2009.",
                "count": 63,
                "papers": [
                    "Light control and 3D video: building blocks for telepresence of the future.",
                    "Dive into the movie: an instant casting and immersive experience in the story.",
                    "A taxonomy of (real and virtual world) display and control interactions.",
                    "Wearable imaging system for capturing omnidirectional movies from a first-person perspective.",
                    "A wide-view parallax-free eye-mark recorder with a hyperboloidal half-silvered mirror.",
                    "Study on design of controllable particle display using water drops suitable for light environment.",
                    "Tearable: haptic display that presents a sense of tearing real paper.",
                    "Camera-based OBDP locomotion system.",
                    "Judgment of natural perspective projections in head-mounted display environments.",
                    "Gaze behavior and visual attention model when turning in virtual environments.",
                    "Influence of degrees of freedom's manipulation on performances during orientation tasks in virtual reality environments.",
                    "Analyzing the effect of a virtual avatar's geometric and motion fidelity on ego-centric spatial perception in immersive virtual environments.",
                    "Multi-modal exploration of small artifacts: an exhibition at the Gold Museum in Bogota.",
                    "Haptic interaction with one-dimensional structures.",
                    "Profiling the behaviour of 3D selection tasks on movement time when using natural haptic pointing gestures.",
                    "Haptic augmented reality interface using the real force response of an object.",
                    "Improving perceived hardness of haptic rendering via stiffness shifting: an initial study.",
                    "Virtual bone drilling for dental implant surgery training.",
                    "A generic real-time rendering approach for structural colors.",
                    "GPU acceleration of stereoscopic and multi-view rendering for virtual reality applications.",
                    "A particle-based method for viscoelastic fluids animation.",
                    "The virtual magic lantern: an interaction metaphor for enhanced medical data inspection.",
                    "Sizing avatars from skin weights.",
                    "Relocalization using virtual keyframes for online environment map construction.",
                    "SparseSPOT: using a priori 3-D tracking for real-time multi-person voxel reconstruction.",
                    "Standalone edge-based markerless tracking of fully 3-dimensional objects for handheld augmented reality.",
                    "Freeze-Set-Go interaction method for handheld mobile augmented reality environments.",
                    "Robustness enhancement of a localization system using interior decoration with coded pattern.",
                    "Evaluating the effects of tracker reliability and field of view on a target following task in augmented reality.",
                    "The magic barrier tape: a novel metaphor for infinite navigation in virtual worlds with a restricted walking workspace.",
                    "Visual feedback techniques for virtual pointing on stereoscopic displays.",
                    "3D object arrangement for novice users: the effectiveness of combining a first-person and a map view.",
                    "D3: an immersive aided design deformation method.",
                    "Facilitating system control in ray-based interaction tasks.",
                    "Crafting memorable VR experiences using experiential fidelity.",
                    "A semantic environment model for crowd simulation in multilayered complex environment.",
                    "A saliency-based method of simulating visual attention in virtual scenes.",
                    "Indexing and retrieval of human motion data by a hierarchical tree.",
                    "A location aware P2P voice communication protocol for networked virtual environments.",
                    "Searching for the metaverse.",
                    "3D positioning techniques for multi-touch displays.",
                    "Compression of massive models by efficiently exploiting repeated patterns.",
                    "Crime scene robot and sensor simulation.",
                    "Doppler effects without equations.",
                    "Dynamic light amplification for head mounted displays.",
                    "Estimation of thinking states in cyberspace using multiple physiological parameters.",
                    "Event-related de-synchronization and synchronization (ERD/ERS) of EEG for controlling a brain-computer-interface driving simulator.",
                    "Experiments for developing touchable online shopping system.",
                    "HardBorders: a new haptic approach for selection tasks in 3D menus.",
                    "High resolution insets for stereocopic immersive displays: a method for 3D content dependent inset boundaries.",
                    "Importance masks for revealing occluded objects in augmented reality.",
                    "Influence of event-based haptic on the manipulation of rigid objects in degraded virtual environments.",
                    "Interactive high dynamic range rendering for virtual reality applications.",
                    "Physically based grasping and manipulation method using pre-contact grasping quality measure.",
                    "Realization of a vibro-tactile glove type mouse.",
                    "Reconstructing chat history for avatar agents using spatio-temporal features of virtual space.",
                    "A study of multimodal feedback to support collaborative manipulation tasks in virtual worlds.",
                    "Thermal display for scientific haptization of numerical simulations.",
                    "Toolkit-independent interaction specification for VR-based visualization.",
                    "User-centered design of a maxillo-facial surgery training platform.",
                    "A virtual performance system and its application on a Noh stage.",
                    "Visualization of virtual weld beads.",
                    "Weathering fur simulation."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15th VRST 2008",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2008",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2008, Bordeaux, France, October 27-29, 2008.",
                "count": 75,
                "papers": [
                    "In quest of realism and interactivity for virtual environments.",
                    "Cognitive strategies for spatial memory of navigation: studies combining virtual reality and brain imaging.",
                    "Semantic modelling for virtual worlds a novel paradigm for realtime interactive systems?",
                    "Advantages of velocity-based scaling for distant 3D manipulation.",
                    "Video agent: interactive autonomous agents generated from real-world creatures.",
                    "ACTIF: an interactor centric interaction framework.",
                    "Overcoming eye-hand visibility mismatch in 3D pointing selection.",
                    "Navidget for immersive virtual environments.",
                    "HandNavigator: hands-on interaction for desktop virtual reality.",
                    "Digital foam interaction techniques for 3D modeling.",
                    "CubTile: a multi-touch cubic interface.",
                    "A rigid-body target design methodology for optical pose-tracking systems.",
                    "GPU techniques for creating visually diverse crowds in real-time.",
                    "Haptic simulations based on non-smooth dynamics for rigid-bodies.",
                    "A VR framework for interacting with molecular simulations.",
                    "SAILOR: a 3-D medical simulator of loco-regional anaesthesia based on desktop virtual reality and pseudo-haptic feedback.",
                    "A VR simulator for training and prototyping of telemanipulation of nanotubes.",
                    "A real-time simulator for interventional radiology.",
                    "Scenario sharing in a collaborative virtual environment for training.",
                    "An image-warping VR-architecture: design, implementation and applications.",
                    "A simple method for estimating the latency of interactive, real-time graphics simulations.",
                    "Radiometric compensation for a low-cost immersive projection system.",
                    "Using laser projectors for augmented reality.",
                    "User boresight calibration precision for large-format head-up displays.",
                    "Analyses of human sensitivity to redirected walking.",
                    "A psychophysically calibrated controller for navigating through large environments in a limited free-walking space.",
                    "The effect of self-embodiment on distance perception in immersive virtual environments.",
                    "Use of auditory cues for wayfinding assistance in virtual environment: music aids route decision.",
                    "Use of virtual reality for spatial knowledge transfer: effects of passive/active exploration mode in simple and complex routes for three different recall tasks.",
                    "Virtual reality as a tool for assessing episodic memory.",
                    "Image-based texture replacement using multiview images.",
                    "VirtualizeMe: interactive model reconstruction from stereo video streams.",
                    "Feature points based facial animation retargeting.",
                    "A novel method based on color information for scanned data alignment.",
                    "Segmented gesture recognition for controlling character animation.",
                    "Opportunistic controls: leveraging natural affordances as tangible user interfaces for augmented reality.",
                    "Detection of moving objects and cast shadows using a spherical vision camera for outdoor mixed reality.",
                    "Napkin sketch: handheld mixed reality 3D sketching.",
                    "Mutual occlusions on table-top displays in mixed reality applications.",
                    "Watercolor inspired non-photorealistic rendering for augmented reality.",
                    "A framework for scalable virtual worlds using spatially organized P2P networks.",
                    "Gesture recognition in flow based on PCA and using multiagent system.",
                    "Clutter-aware adaptive projection inside a dynamic environment.",
                    "A hybrid approach towards fully automatic 3D marker tracking.",
                    "Development and evaluation of a virtual reality simulator for training of thyroid gland nodules needle biopsy.",
                    "Software platform for real-time room acoustic visualization.",
                    "On the hybrid aid-localization for outdoor augmented reality applications.",
                    "FlowVR-VRPN: first experiments of a VRPN/FlowVR coupling.",
                    "MRPipeline: a module based architecture for self adaptive mixed reality applications.",
                    "Hand's 3D movement detection with one handheld camera.",
                    "Wind turbines' landscape: using virtual reality for the assessment of multisensory perception in motion.",
                    "Multimodal prop-based interaction with virtual mock-up: CAD model integration and human performance evaluation.",
                    "VRPN and Qwerk: fast MR device prototyping and testing.",
                    "Multi-touch gestural interaction in X3D using hidden Markov models.",
                    "Identification judgment of self-viewpoint movie.",
                    "Size estimation in product visualization using augmented reality.",
                    "SqueezeOrb: a low-cost pressure-sensitive user input device.",
                    "Compared distortion effects between real and virtual ophthalmic lenses with a simulator.",
                    "Real-time rendering of solvent-accessible surfaces for molecular models.",
                    "A movable-screen immersive projection display.",
                    "An attempt of real-time CG control with multi-touch devices.",
                    "AVACHAT: a new comic-based chat system for virtual avatars.",
                    "Cross-modal information display to improve driving performance.",
                    "Force model for CAD selection.",
                    "Comparing disparity based label segregation in augmented and virtual reality.",
                    "A surround interface using the Wii controller with multiple sensor bars.",
                    "Using the Wii Balance Board™ as a low-cost VR interaction device.",
                    "Alternative online extrinsic calibration techniques for minimally invasive surgery.",
                    "VR spray painting for training and design.",
                    "Localization system for large indoor environments using invisible markers.",
                    "Grimage: 3D modeling for remote collaboration and telepresence.",
                    "Parallel LOD for static and dynamic generic geo-referenced data.",
                    "Collaborative exploration of 3D scientific data.",
                    "Wired gloves for every one.",
                    "ArcheoTUI - tangible interaction with foot pedal declutching for the virtual reassembly of fractured archeological objects."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14th VRST 2007",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2007",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2007, Newport Beach, California, USA, November 5-7, 2007.",
                "count": 53,
                "papers": [
                    "Implicit 3D modeling and tracking for anywhere augmentation.",
                    "Real-time tracking of visually attended objects in interactive virtual environments.",
                    "Simultaneous 4 gestures 6 DOF real-time two-hand tracking without any markers.",
                    "A semi-automatic realtime calibration technique for a handheld projector.",
                    "Handheld AR indoor guidance system using vision technique.",
                    "Supporting the creation of dynamic, interactive virtual environments.",
                    "Stable and efficient miscible liquid-liquid interactions.",
                    "Simulating competitive interactions using singly captured motions.",
                    "State-annotated motion graphs.",
                    "Interactive control of physically-valid aerial motion: application to VR training system for gymnasts.",
                    "Anticipation from example.",
                    "A robust method for real-time thread simulation.",
                    "Accurate on-line avatar control with collision anticipation.",
                    "Real-time navigation of independent agents using adaptive roadmaps.",
                    "Interactive control of real-time crowd navigation in virtual environment.",
                    "CrowdViewer: from simple script to large-scale virtual crowds.",
                    "Officer Garcia: a virtual human for mediating eyewitness identification.",
                    "The benefits of immersion for spatial understanding of complex underground cave systems.",
                    "Consistent interactive augmentation of live camera images with correct near-field illumination.",
                    "Interactive rendering of optical effects in wet hair.",
                    "Building high performance DVR via HLA, scene graph and parallel rendering.",
                    "Real-time global illumination in the CAVE.",
                    "Incremental wavelet importance sampling for direct illumination.",
                    "The design and implementation of a VR-architecture for smooth motion.",
                    "Gesture-based interaction for a magic crystal ball.",
                    "Using an event-based approach to improve the multimodal rendering of 6DOF virtual contact.",
                    "A classification scheme for multi-sensory augmented reality.",
                    "Real-time auditory-visual distance rendering for a virtual reaching task.",
                    "Enhancing VR-based visualization with a 2D vibrotactile array.",
                    "Towards a system for reusable 3D interaction techniques.",
                    "An immaterial depth-fused 3D display.",
                    "Active guideline: spatiotemporal history as a motion technique and navigation aid for virtual environments.",
                    "Depth-of-field blur effects for first-person navigation in virtual environments.",
                    "Tour generation for exploration of 3D virtual environments.",
                    "Dynamic landmark placement as a navigation aid in virtual worlds.",
                    "AR façade: an augmented reality interactve drama.",
                    "Bimanual task division preferences for volume selection.",
                    "Design flexibility in seamless coded pattern for localization.",
                    "Development of MR application families: an InTml-based approach.",
                    "Evaluating a haptic-based virtual environment for venepuncture training.",
                    "Eye tracking and gaze vector calculation within immersive virtual environments.",
                    "Chloe@University: an indoor, mobile mixed reality guidance system.",
                    "Hybrid traveling in fully-immersive large-scale geographic environments.",
                    "Interactive smart character in a shooting game.",
                    "Mixed reality for enhancing business communications using virtual worlds.",
                    "Motion picture production facility with liquid cooled 512 processor mobile super computing vehicle and virtual reality environment.",
                    "Multi-agent systems applied to virtual environments: a case study.",
                    "Shakespearean karaoke.",
                    "Stride scheduling for time-critical collision detection.",
                    "Usability of multiple degree-of-freedom input devices and virtual reality displays for interactive visual data analysis.",
                    "View-dependent mesh streaming using multi-chart geometry images.",
                    "Virtual vision: visual sensor networks in virtual reality.",
                    "VR-based visual analytics of LIDAR data for cliff erosion assessment."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13th VRST 2006",
        "info": "Limassol, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2006",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2006, Limassol, Cyprus, November 1-3, 2006.",
                "count": 65,
                "papers": [
                    "Scientific challenges ingame technology.",
                    "Real images for virtual reality.",
                    "Perceptual sensitivity to visual/kinesthetic discrepancy in hand speed, and why we might care.",
                    "Evaluating the effectiveness of occlusion reduction techniques for 3D virtual environments.",
                    "Evaluating the effects of real world distraction on user performance in virtual environments.",
                    "The benefits of third-person perspective in virtual and augmented reality?",
                    "Mixed reality: are two hands better than one?",
                    "Development of a tracking method for augmented reality applied to NPP maintenance work and its experimental evaluation.",
                    "Sceptre: an infrared laser tracking system for virtual environments.",
                    "Spatial input device structure and bimanual object manipulation in virtual environments.",
                    "Interactive modelling and tracking for mixed and augmented reality.",
                    "Traversal fields for ray tracing dynamic scenes.",
                    "Pyramidal displacement mapping: a GPU based artifacts-free ray tracing through an image pyramid.",
                    "Novel view generation for a real-time captured video object.",
                    "Hardware-accelerated jaggy-free visual hulls with silhouette maps.",
                    "A fluid resistance map method for real-time haptic interaction with fluids.",
                    "Interaction techniques in large display environments using hand-held devices.",
                    "Simple user-generated motion cueing can enhance self-motion perception (Vection) in virtual reality.",
                    "Separating the effects of level of immersion and 3D interaction techniques.",
                    "Limpid desk: see-through access to disorderly desktop in projection-based mixed reality.",
                    "Usability evaluation of the EPOCH multimodal user interface: designing 3D tangible interactions.",
                    "Entertainment virtual reality system for simulation of spaceflights over the surface of the planet Mars.",
                    "A versatile large-scale multimodal VR system for cultural heritage visualization.",
                    "System and infrastructure considerations for the successful introduction of augmented reality guides in cultural heritage sites.",
                    "From motion capture to action capture: a review of imitation learning techniques and their application to VR-based character animation.",
                    "Real-time generation of populated virtual cities.",
                    "From motion capture data to character animation.",
                    "Learning system for human motion characters of traditional arts.",
                    "Utilizing jump flooding in image-based soft shadows.",
                    "Layered probability maps: basic framework and prototype system.",
                    "Dynamic load-balanced rendering for a CAVE system.",
                    "Dynamic aspects of real-time face-rendering.",
                    "Interactive editing of segmented volumetric datasets in a hybrid 2D/3D virtual environment.",
                    "Robust line tracking using a particle filter for camera pose estimation.",
                    "A reprocessing tool for quantitative data analysis in a virtual environment.",
                    "The development of glove-based interfaces with the TRES-D methodology.",
                    "Supporting guided navigation in mobile virtual environments.",
                    "Navigation aids for multi-floor virtual buildings: a comparative evaluation of two approaches.",
                    "Z-Goto for efficient navigation in 3D environments from discrete inputs.",
                    "3D visualization technologies for teleguided robots.",
                    "The illusionhole with polarization filters.",
                    "Extending the scene graph with a dataflow visualization system.",
                    "Media productions for a dome display system.",
                    "Analytical compensation of inter-reflection for pattern projection.",
                    "P2P Network for very large virtual environment.",
                    "Dynamic interactive VR network services for education.",
                    "Are two heads better than one?: object-focused work in physical and in virtual environments.",
                    "A differential method for the haptic rendering of deformable objects.",
                    "A framework for bounded-time collision detection in haptic interactions.",
                    "Tactylus, a pen-input device exploring audiotactile sensory binding.",
                    "Using neuromuscular electrical stimulation for pseudo-haptic feedback.",
                    "A haptic toolkit for the development of immersive and web-enabled games.",
                    "PNORMS: platonic derived normals for error bound compression.",
                    "Intuitively specifying object dynamics in virtual environments using VR-WISE.",
                    "A robust method for analyzing the physical correctness of motion capture data.",
                    "Developing a 3D simulated bio-terror crises communication training module.",
                    "Simplified animation circuit for metadata-based behavior model query and retrieval.",
                    "Control of eye-movement to decrease VE-sickness.",
                    "Hand-held virtual reality: a feasibility study.",
                    "Presence in response to dynamic visual realism: a preliminary report of an experiment study.",
                    "The impact of immersive virtual reality displays on the understanding of data visualization.",
                    "Effects of physical display size and amplitude of oscillation on visually induced motion sickness.",
                    "Variations in physiological responses of participants during different stages of an immersive virtual environment experiment.",
                    "Building a complete virtual reality application.",
                    "Virtual reality systems and applications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12th VRST 2005",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2005",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2005, Monterey, CA, USA, November 7-9, 2005.",
                "count": 43,
                "papers": [
                    "Art and technology in interface devices.",
                    "AMMP-Vis: a collaborative virtual environment for molecular modeling.",
                    "A 2D-3D integrated environment for cooperative work.",
                    "First-person experience and usability of co-located interaction in a projection-based virtual environment.",
                    "Human performance in space telerobotic manipulation.",
                    "Mixed-dimension interaction in virtual environments.",
                    "Effects of information layout, screen size, and field of view on user performance in information-rich virtual environments.",
                    "A novel framework for athlete training based on interactive motion editing and silhouette analysis.",
                    "An integrated system: virtual reality, haptics and modern sensing technique (VHS) for post-stroke rehabilitation.",
                    "Telepresence support for synchronous distance.",
                    "Myriad: scalable VR via peer-to-peer connectivity, PC clustering, and transient inconsistency.",
                    "Quantifying the benefits of immersion for collaboration in virtual environments.",
                    "Scalable interest management for multidimensional routing space.",
                    "Towards keyboard independent touch typing in VR.",
                    "A layout framework for 3D user interfaces.",
                    "A practical system for laser pointer interaction on large displays.",
                    "A 6-DOF user interface for grasping in VR-based computer aided styling and design.",
                    "A swarm algorithm for wayfinding in dynamic virtual worlds.",
                    "Cognitive comparison of 3D interaction in front of large vs. small displays.",
                    "A low cost and accurate guidance system for laparoscopic surgery: validation on an abdominal phantom.",
                    "BalloonProbe: reducing occlusion in 3D using interactive space distortion.",
                    "Projective slice for a dynamic steering task.",
                    "Graphics: from a 100x data expansion to a 100x compression function.",
                    "Rapid part-based 3D modeling.",
                    "Rapid scene modelling, registration and specification for mixed reality systems.",
                    "Modeling landscapes with ridges and rivers.",
                    "Artistic reality: fast brush stroke stylization for augmented reality.",
                    "DiReC: distributing the render cache to PC-clusters for interactive environments.",
                    "Computing inverse kinematics with linear programming.",
                    "Dynamic creation of interactive mixed reality presentations.",
                    "Integrated levels of detail.",
                    "Generating enhanced natural environments and terrain for interactive combat simulations (GENETICS).",
                    "Real time tracking of high speed movements in the context of a table tennis application.",
                    "A general method for comparing the expected performance of tracking and motion capture systems.",
                    "Object deformation and force feedback for virtual chopsticks.",
                    "Search and transitioning for motion captured sequences.",
                    "Laser scanning for the interactive walk-through fogScreen.",
                    "POLAR: portable, optical see-through, low-cost augmented reality.",
                    "Experiences in driving a cave with IBM scalable graphics engine-3 (SGE-3) prototypes.",
                    "Efficient compression and delivery of stored motion data for avatar animation in resource constrained devices.",
                    "Simulating virtual crowds in emergency situations.",
                    "Motion normalization: the preprocess of motion data.",
                    "Automatic generation of personalized human avatars from multi-view video."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11th VRST 2004",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2004",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2004, Hong Kong, November 10-12, 2004.",
                "count": 35,
                "papers": [
                    "Recent advances in visibility determination for large and complex virtual environments.",
                    "Fast and reliable collision culling using graphics hardware.",
                    "Interactive collision detection for complex and deformable models using programmable graphics hardware.",
                    "The Grappl 3D interaction technique library.",
                    "Multi-layered deformable surfaces for virtual clothing.",
                    "Animating reactive motions for biped locomotion.",
                    "Animating complex hairstyles in real-time.",
                    "A lightweight algorithm for real-time motion synthesis.",
                    "Marker-free kinematic skeleton estimation from sequences of volume data.",
                    "Scalable pedestrian simulation for virtual cities.",
                    "Observing effects of attention on presence with fMRI.",
                    "Supporting social human communication between distributed walk-in displays.",
                    "Using a vibro-tactile display for enhanced collision perception and presence.",
                    "FreeWalk/Q: social interaction platform in virtual space.",
                    "Turning VR inside out: thoughts about where we are heading.",
                    "Scanning and rendering scene tunnels for virtual city traversing.",
                    "Modeling and rendering of walkthrough environments with panoramic images.",
                    "Design and evaluation of a wind display for virtual reality.",
                    "GameOD: an internet based game-on-demand framework.",
                    "A CAVE system for interactive modeling of global illumination in car interior.",
                    "Towards full-body haptic feedback: the design and deployment of a spatialized vibrotactile feedback system.",
                    "An efficient representation of complex materials for real-time rendering.",
                    "Huge texture mapping for real-time visualization of large-scale terrain.",
                    "A voxel based multiresolution technique for soft tissue deformation.",
                    "A framework for 3D visualisation and manipulation in an immersive space using an untethered bimanual gestural interface.",
                    "The MORGAN framework: enabling dynamic multi-user AR and VR projects.",
                    "Fast model tracking with multiple cameras for augmented reality.",
                    "Occlusion handling for medical augmented reality using a volumetric phantom model.",
                    "NOYO: 6DOF elastic rate control for virtual environments.",
                    "Tailor tools for interactive design of clothing in virtual environments.",
                    "Reality-augmented virtuality: modeling dynamic events from nature.",
                    "Transpost: all-around display system for 3D solid image.",
                    "Telerehabilitation: controlling haptic virtual environments through handheld interfaces.",
                    "Multi-resolution haptic interaction of hybrid virtual environments.",
                    "Electrostatic tactile display with thin film slider and its application to tactile tele-presentation systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10th VRST 2003",
        "info": "Osaka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2003",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2003, Osaka, Japan, October 1-3, 2003.",
                "count": 30,
                "papers": [
                    "Perceptive agents and systems in virtual reality.",
                    "Virtual unreality: storytelling in virtual environments.",
                    "Partitioning crowded virtual environments.",
                    "Significant facet retrieval for real-time 3D sound rendering in complex virtual environments.",
                    "Time-critical collision detection using an average-case approach.",
                    "Real-time reflection on moving vehicles in urban environments.",
                    "Real-time rendering of woven clothes.",
                    "Incremental rendering of deformable trimmed NURBS surfaces.",
                    "A real-time shadow approach for an augmented reality application using shadow volumes.",
                    "Interactive modeling of trees by using growth simulation.",
                    "A comparative study on user performance in the Virtual Dressmaker application.",
                    "Information-rich virtual environments: theory, tools, and research agenda.",
                    "The ANIMUS project: a framework for the creation of interactive creatures in immersed environments.",
                    "Alternative reality: a new platform for virtual reality art.",
                    "Tele-sports and tele-dance: full-body network interaction.",
                    "Towards virtual environment authoring tools for content developers.",
                    "A novel method for supporting collaborative interaction management in Web-based CVE.",
                    "Mimicking video: real-time morphable 3D model fitting.",
                    "The role of structural reflection in distributed Virtual Reality.",
                    "Deployment issues of a VoIP conferencing system in a Virtual Conferencing Environment.",
                    "A scalable dynamic load distribution scheme for multi-server distributed virtual environment systems with highly-skewed user distribution.",
                    "Super wide viewer using catadioptrical optics.",
                    "Performance evaluation of programmable graphics hardware for image filtering and stereo matching.",
                    "The optical tweezers: multiple-point interaction technique.",
                    "A haptic feedback device based on an active mesh.",
                    "Novel actuators for haptic displays based on electroactive polymers.",
                    "The CAT for efficient 2D and 3D interaction as an alternative to mouse adaptations.",
                    "Visual attention based information culling for Distributed Virtual Environments.",
                    "A model of dynamic interest management: interaction analysis in collaborative virtual environment.",
                    "Design and evaluation of team work in distributed collaborative virtual environments."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th VRST 2002",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2002",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2002, Hong Kong, China, November 11-13, 2002.",
                "count": 26,
                "papers": [
                    "Time-critical rendering of discrete and continuous levels of detail.",
                    "Light field duality: concept and applications.",
                    "Selective quality rendering by exploiting human inattentional blindness: looking but not seeing.",
                    "Rendering of virtual environments based on polygonal & point-based models.",
                    "Template-based generation of road networks for virtual city modeling.",
                    "Modeling virtual object behavior within virtual environment.",
                    "Complex deformable objects in virtual reality.",
                    "Application and taxonomy of through-the-lens techniques.",
                    "Spatialized audio rendering for immersive virtual environments.",
                    "Tour into the video: image-based navigation scheme for video sequences of dynamic scenes.",
                    "Real-time haptic sculpting in virtual volume space.",
                    "Implementing flexible rules of interaction for object manipulation in cluttered virtual environments.",
                    "DEMIS: a dynamic event model for interactive systems.",
                    "Towards intuitive exploration tools for data visualization in VR.",
                    "LARGE a collision detection framework for deformable objects.",
                    "Minimal hierarchical collision detection.",
                    "Hardware-assisted self-collision for deformable surfaces.",
                    "The randomized sample tree: a data structure for interactive walkthroughs in externally stored virtual environments.",
                    "LAM: luminance attenuation map for photometric uniformity in projection based displays.",
                    "The global occlusion map: a new occlusion culling approach.",
                    "A multi-server architecture for distributed virtual walkthrough.",
                    "Cooperative object manipulation in immersive virtual environments: framework and techniques.",
                    "Deployment issues for multi-user audio support in CVEs.",
                    "Placing three-dimensional models in an uncalibrated single image of an architectural scene.",
                    "Real space-based virtual studio seamless synthesis of a real set image with a virtual set image.",
                    "A manipulation environment of virtual and real objects using a magnetic metaphor."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th VRST 2001",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2001",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2001, Banff, Alberta, Canada, November 15-17, 2001.",
                "count": 26,
                "papers": [
                    "Binocular eye tracking in VR for visual inspection training.",
                    "Inertial and magnetic posture tracking for inserting humans into networked virtual environments.",
                    "Tracking based structure and motion recovery for augmented video productions.",
                    "SmartCU3D: a collaborative virtual environment system with behavior based interaction management.",
                    "An abstraction for awareness management in collaborative virtual environments.",
                    "Audience interaction for virtual reality theater and its implementation.",
                    "An open software architecture for virtual reality interaction.",
                    "VRPN: a device-independent, network-transparent VR peripheral system.",
                    "Exploring the past: a toolset for visualization of historical events in virtual environments.",
                    "A fast implicit integration method for solving dynamic equations of movement.",
                    "Temporal and spatial level of details for dynamic meshes.",
                    "Real-time shadows for animated crowds in virtual cities.",
                    "Life-sized projector-based dioramas.",
                    "Balance NAVE: a virtual reality facility for research and rehabilitation of balance disorders.",
                    "Stereoscopic video system with embedded high spatial resolution images using two channels for transmission.",
                    "Virtual reality and public spaces.",
                    "Surround aesthetics: VR as an art form.",
                    "Scalable data management using user-based caching and prefetching in distributed virtual environments.",
                    "Prediction-based concurrency control for a large scale networked virtual environment supporting various navigation speeds.",
                    "A hybrid motion prediction method for caching and prefetching in distributed virtual environments.",
                    "Situational visualization.",
                    "Visualization of particle traces in virtual environments.",
                    "Is semitransparency useful for navigating virtual environments?.",
                    "FreeDrawer: a free-form sketching system on the responsive workbench.",
                    "VRID: a design model and methodology for developing virtual reality interfaces.",
                    "Interactive content for presentations in virtual reality."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th VRST 2000",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/2000",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 2000, Seoul, South Korea, October 22-25, 2000.",
                "count": 30,
                "papers": [
                    "Interaction, imagination and immersion some research needs.",
                    "CAVERNsoft G2: a toolkit for high performance tele-immersive collaboration.",
                    "Choosing and using a driving problem for CVE technology development.",
                    "Advanced real-time collaboration over the internet.",
                    "DEVA3: architecture for a large-scale distributed virtual reality system.",
                    "Interactive reconstruction of virtual environments from photographs, with application to scene-of-crime analysis.",
                    "Interactive 3D modeling using only one image.",
                    "A hybrid method of image synthesis in IBR for novel viewpoints.",
                    "A framework for rapid evaluation of prototypes with augmented reality.",
                    "An immersive modeling system for 3D free-form design using implicit surfaces.",
                    "A framework for the structured design of VR/AR content.",
                    "Conceptual free-form styling on the responsive workbench.",
                    "Multi-resolution spatial model for large-scale virtual environment.",
                    "Message caching for local and global resource optimization in shared virtual environments.",
                    "Scalable interest management using interest group based filtering for large networked virtual environments.",
                    "Scalable predictive concurrency control for large distributed virtual environments with densely populated objects.",
                    "Conservative visibility preprocessing for walkthroughs of complex urban scenes.",
                    "Fast perception-based depth of field rendering.",
                    "A new BSP tree framework incorporating dynamic LoD models.",
                    "Developing an efficient technique of selection and manipulation in immersive V.E..",
                    "Immersive graph navigation using direct manipulation and gestures.",
                    "VR user interface: closed world interaction.",
                    "Virtual reality for education?",
                    "Animated deformations with radial basis functions.",
                    "A simplified deformation for real-time 3D character animation.",
                    "Web-based 3D media information system.",
                    "Direct haptic rendering of isosurface by intermediate representation.",
                    "Dual projection-based VR system for the light weight motion-based driving simulator.",
                    "Development of tension based haptic interface and possibility of its application to virtual reality.",
                    "Incorporating co-presence in distributed virtual music environment."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6th VRST 1999",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/1999",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 1999, London, UK, December 20-22, 1999.",
                "count": 34,
                "papers": [
                    "The HiBall Tracker: high-performance wide-area tracking for virtual and augmented environments.",
                    "Reality portals.",
                    "A video-based virtual reality system.",
                    "Testbed evaluation of virtual environment interaction techniques.",
                    "Patterns of network and user activity in an inhabited television event.",
                    "Coping with inconsistency due to network delays in collaborative virtual environments.",
                    "The London Travel Demonstrator.",
                    "The DiveBone - an application-level network architecture for Internet-based CVEs.",
                    "GNU/MAVERIK: a micro-kernel for large-scale virtual environments.",
                    "Distributed Open Inventor: a practical approach to distributed 3D graphics.",
                    "Navigating through sparse views.",
                    "A method for progressive and selective transmission of multi-resolution models.",
                    "A market model for level of detail control.",
                    "Levels of detail (LOD) engineering of VR objects.",
                    "Visual speech analysis and synthesis with application to Mandarin speech training.",
                    "A method for sharing interactive deformations in collaborative 3D modeling.",
                    "Direct 3D interaction with smart objects.",
                    "Real-time rendering of deformable parametric free-form surfaces.",
                    "Modeling and animation of botanical trees for interactive virtual environments.",
                    "Software architecture for a constraint-based virtual environment.",
                    "Sketching a virtual environment: modeling using line-drawing interpretation.",
                    "Formations: explicit group support in collaborative virtual environments.",
                    "Meetings for real - experiences from a series of VR-based project meetings.",
                    "Fast calibration for augmented reality.",
                    "The Kahun project: CVE technology development based on real world application and user needs.",
                    "Subjectivity and the relaxing of synchronization in networked virtual environments.",
                    "Interactive virtual studio and immersive televiewer environment.",
                    "Interactive task planning in virtual assembly.",
                    "Components for distributed virtual environments.",
                    "A real-time generation algorithm for progressive meshes in dynamic environments.",
                    "Calculation of contact forces.",
                    "Rudiments for a 3D freehand sketch based human-computer interface for immersive virtual enviroments.",
                    "Using virtual reality for network management: automated construction of dynamic 3D metaphoric worlds.",
                    "Visualising logic programs in virtual worlds."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th VRST 1998",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/1998",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 1998, Taipei, Taiwan, November 2-5, 1998.",
                "count": 26,
                "papers": [
                    "Integrating virtual objects into real images for augmented reality.",
                    "Disparity-based view morphing - a new technique for image-based rendering.",
                    "Reconstruction of 3D virtual buildings from 2D architectural floor plans.",
                    "Multi-resolution model transmission in distributed virtual environments.",
                    "Producing identity in collaborative virtual environments.",
                    "Virtual playground: architectures for a shared virtual world.",
                    "3D object modeling using spatial and pictographic gestures.",
                    "The control of avatar motion using hand gesture.",
                    "Intuitive control of \"bird's eye\" overview images for navigation in an enormous virtual environment.",
                    "Realtime shadow feedback for interactive radiosity scenes using shaded multipoints.",
                    "A new image morphing technique for smooth vista transitions in panoramic image-based virtual environment.",
                    "View synthesis by edge transfer with application to the generation of immersive video objects.",
                    "Image-based object representation by layered impostors.",
                    "Building distributed virtual environments to support collaborative work.",
                    "Crowd modelling in collaborative virtual environments.",
                    "Three-tiered interest management for large-scale virtual environments.",
                    "Software engineering of virtual worlds.",
                    "Incremental 3D collision detection with hierarchical data structures.",
                    "Hardware-assisted virtual collisions.",
                    "A constraint-based approach to rigid body dynamics for virtual reality applications.",
                    "A multiresolution control method using view directional feature.",
                    "A representation for composition of virtual indoor environment.",
                    "Virtual world modeler.",
                    "Application of virtual reality in the interpretation of geoscience data.",
                    "Collaborative gaming in augmented reality.",
                    "Virtual meeting in cyberstage."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th VRST 1997",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/1997",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 1997, Lausanne, Switzerland, September 15-17, 1997.",
                "count": 31,
                "papers": [
                    "Interactive two-handed gesture interface in 3D virtual environments.",
                    "Horseback riding therapy simulator with VR technology.",
                    "Head motion and latency compensation on localization of 3D sound in virtual reality.",
                    "A framework and testbed for studying manipulation techniques for immersive VR.",
                    "Access control in virtual environments.",
                    "Virtual body language: providing appropriate user interfaces in collaborative virtual environments.",
                    "A versatile navigation interface for virtual humans in collaborative virtual environments.",
                    "A framework for performance evaluation of real-time rendering algorithms in virtual reality.",
                    "Managing level of detail through head-tracked peripheral degradation: a model and resulting design principles.",
                    "zLayer: simulating depth with extended parallax scrolling.",
                    "View volume culling using a probabilistic caching scheme.",
                    "Dynamic implicit surface tesselation.",
                    "Real-time vision-based camera tracking for augmented reality applications.",
                    "Reading between the lines - a method for extracting dynamic 3D with texture.",
                    "Image-based view synthesis by combining trilinear tensors and learning techniques.",
                    "Integration of motion control techniques for virtual human and avatar real-time animation.",
                    "An efficient collision detection algorithm using range data for walk-through systems.",
                    "Fast dynamic simulation of flexible and rigid bodies with kinematic constraints.",
                    "Consolidated manipulation of virtual and real objects.",
                    "Using subjective views to enhance 3D applications.",
                    "PanoVR SDK - a software development kit for integrating photo-realistic panoramic images and 3-D graphical objects into virtual worlds.",
                    "3D palette: a virtual reality content creation tool.",
                    "NetEffect: a network architecture for large-scale multi-user virtual worlds.",
                    "The process agent model and message passing in a distributed processing VR system.",
                    "Efficient navigation around complex virtual environments.",
                    "A study of interactive 3D point location in a computer simulated virtual environment.",
                    "Surface deformation using the sensor glove.",
                    "Virtual clay modeling system.",
                    "Online radiosity in interactive virtual reality applications.",
                    "Modeling and rendering of outdoor scenes for distributed virtual environments.",
                    "Output-senstitive rendering and communication in dynamic virtual environments."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3rd VRST 1996",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/vrst/1996",
                "sub_name": "Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST 1996, Hong Kong, July 01-04, 1996.",
                "count": 29,
                "papers": [
                    "Close encounters with VR: 100, 000 experiences.",
                    "A framework for real-time rendering in virtual reality.",
                    "Real-time multi-resolution modeling for complex virtual environments.",
                    "Distributed LoD algorithm for complex virtual environments.",
                    "VLEGO: a simple two-handed modeling environment based on toy blocks.",
                    "Geometric modeling in CAVE.",
                    "A 3D virtual environment for creating new fireworks.",
                    "Recognition of space-time hand-gestures using hidden Markov model.",
                    "A sign language recognition system using hidden markov model and context sensitive search.",
                    "Multi-finger manipulation of virtual objects.",
                    "Grasp an object with tactile and force feedback: grasping mouse.",
                    "Modelling virtual space in architecture.",
                    "Building virtual cities: applying urban planning principles to the design of virtual environments.",
                    "Virtual reality applications in civil engineering.",
                    "Camera based beacon tracking: accuracy and applications.",
                    "A self-tracking augmented reality system.",
                    "Development of an effective motion capture system based on data fusion and minimal use of sensors.",
                    "Quick collision detection of polytopes in virtual environments.",
                    "Exploiting the frame coherence in visibility for walk/fly-through.",
                    "System support for scalable distributed virtual worlds.",
                    "A language for describing behavior of and interaction with virtual worlds.",
                    "Two computational models for animation of the deformable objects.",
                    "The laboratory for human interaction in the virtual environment.",
                    "A look behind the scenes of virtual reality applications.",
                    "Immersion, presence and performance in virtual environments: an experiment with tri-dimensional chess.",
                    "Virtual object manipulation using dynamically selected constraints with real-time collision detection.",
                    "Hands-free image-based VR system for the masses: virtual museum.",
                    "Three dimensional input function using nonverbal voice interface.",
                    "The brain bench planner and trainer for minimal access surgery."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "2nd VRST 1995",
        "info": "Japan",
        "venues": []
    },
    {
        "year": "1994",
        "name": "1st VRST 1994",
        "info": "Singapore",
        "venues": []
    }
]