[
    {
        "year": "2015",
        "name": "14. CAD/Graphics 2015",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2015",
                "sub_name": "14th International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2015, Xi'an, China, August 26-28, 2015.",
                "count": 47,
                "papers": [
                    "A Simple Filtering Algorithm for Continuous Collision Detection Using Taylor Models.",
                    "An Adaptive Spherical Collision Detection and Resolution Method for Deformable Object Simulation.",
                    "Automatic Hierarchical Mid-surface Abstraction of Thin-Walled Models Based on Rib Decomposition.",
                    "Generation of Hierarchical Multi-resolution Medial Axis for CAD Models.",
                    "Hierarchical Mesh Segmentation Based on Quadric Surface Fitting.",
                    "Parameter Estimation of Point Projection on NURBS Curves and Surfaces.",
                    "Efficient Depth Restoration from 2D Line Drawings with Line Segments and Curves.",
                    "A Piecewise Cubic Polynomial Interpolation Algorithm for Approximating Elementary Function.",
                    "CSRBF-Based Quasi-interpolation for Accurate and Fast Data Fitting.",
                    "Hierarchical Box Splines.",
                    "Construction of m-ary Symmetric Interpolatory Subdivision Scheme by m-ary Orthonormal Refinable Function.",
                    "CAD Parts-Based Assembly Modeling by Probabilistic Reasoning.",
                    "Generate Accurate Soft Shadows Using Complete Occluder Buffer.",
                    "Novel, Robust, and Efficient Guidewire Modeling for PCI Surgery Simulator Based on Heterogeneous and Integrated Chain-Mails.",
                    "Step Into Micro-World: Dynamic Simulation of the Coffee-Ring Effect.",
                    "A Visualization System for Weather Forecast Analogs.",
                    "Feature-Based Streamline Selection Method for 2D Flow Fields.",
                    "Random-Accessible Volume Data Compression with Regression Function.",
                    "A More Effective Method for Image Representation: Topic Model Based on Latent Dirichlet Allocation.",
                    "An Integrated De-noise and Enhancement Method for Ancient Chinese Tablet Images.",
                    "Real Time Learning Evaluation Based on Gaze Tracking.",
                    "Boundary-Conformed Tool Path Generation Based on Global Reparametrization.",
                    "A Survey of Hardware Trojan Detection, Diagnosis and Prevention.",
                    "Fault Secure Encoder and Decoder Designs for Matrix Codes.",
                    "Hardware IP Protection through Gate-Level Obfuscation.",
                    "Reliable and Anti-cloning PUFs Based on Configurable Ring Oscillators.",
                    "Degree Reduction of Classic Disk Rational Bézier Curves in L2 Norm.",
                    "Shape Matching Based on Non-rigid Spectral Transformation.",
                    "View-Dependent Projective Atlases.",
                    "The SOD Modeling Method in CAD System for Hydraulic Fracturing PSS Dseign.",
                    "A New Surface Tension Formulation for SPH.",
                    "A Robust Method for Musical Note Recognition.",
                    "A Scores Based Rendering for Yunnan Out-of-Print Woodcut.",
                    "An Improved Retinal Vessel Segmentation Method Based on Supervised Learning.",
                    "Automatic Design for 3D Tread Patterns Based on Semantic.",
                    "Automatic Human Animation for Non-Humanoid 3D Characters.",
                    "Facade Layout Symmetrization.",
                    "Fast Multi-band Blending Using Run-Length Encoding.",
                    "Importance-Driven Controllable Texture Compaction.",
                    "Modeling Virtual Chinese Brush Using Camshaft Curve and Stochastic Process.",
                    "A Recovery Method for Kinect-Like Depth Map Based on Color Image Segmentation.",
                    "Grouping of Multiple Overtraced Strokes in Interactive Freehand Sketches.",
                    "A Fast and Simple Block-Based Approach for Common Path Pessimism Removal in Static Timing Analysis.",
                    "Efficient Off-Chip Memory Protection Mechanism for Embedded Computing Systems Using AES-GCM.",
                    "Hardware Design and Verification Techniques for Supply Chain Risk Mitigation.",
                    "HW/SW Partitioning Algorithm Targeting MPSOC with Dynamic Partial Reconfigurable Fabric.",
                    "PGMOR: An Efficient Model Order Reduction Method for Power Grids."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13. CAD/Graphics 2013",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2013",
                "sub_name": "2013 International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2013, Guangzhou, China, November 16-18, 2013.",
                "count": 88,
                "papers": [
                    "Time and Space Coherent Occlusion Culling for Tileable Extended 3D Worlds.",
                    "Simulation of Wave Effects Based on Ray Tracing.",
                    "3D Shapes Co-segmentation by Combining Fuzzy C-Means with Random Walks.",
                    "Polar Embedded Catmull-Clark Subdivision Surface.",
                    "A Data-Driven Approach to Efficient Character Articulation.",
                    "Robust Surface Consolidation of Scanned Thick Point Clouds.",
                    "TV-L1 Optimization for B-Spline Surface Reconstruction with Sharp Features.",
                    "Robust Reconstruction of Interior Building Structures with Multiple Rooms under Clutter and Occlusions.",
                    "Fitting Multiple Curves to Point Clouds with Complicated Topological Structures.",
                    "A New Level-Set-Based Inverse Lithography Algorithm for Process Robustness Improvement with Attenuated Phase Shift Mask.",
                    "Bridging the Gap between Global Routing and Detailed Routing: A Practical Congestion Model.",
                    "Thermal Analysis with Considering Interactions among Temperature/Power/Heat Conductance and Its Fast Precondition-Solving Algorithm FPSCG.",
                    "Voltage Drop Aware Power Pad Assignment and Floorplanning for Multi-voltage SoC Designs.",
                    "An Efficient Zero-Aliasing Space Compactor Based on Elementary Gates Combined with XOR Gates.",
                    "Equivalence Checking between SLM and TLM Using Coverage Directed Simulation.",
                    "Design and Implementation of a Delay-Based PUF for FPGA IP Protection.",
                    "Logic Minimization Based on Dual Logic.",
                    "P-RPF: Pixel-Based Random Parameter Filtering for Monte Carlo Rendering.",
                    "Real-Time Multi-scale Refraction under All-Frequency Environmental Lighting.",
                    "Screen-Space Ambient Occlusion Using A-Buffer Techniques.",
                    "Multi-resolution Shadow Mapping Using CUDA Rasterizer.",
                    "An Adapted Parameterization for Smooth Geometry Images.",
                    "GBI-SA: GBI Feature with Subtle Adjustment for Robust Non-rigid 3D Shape Retrieval.",
                    "Retrieving 3D Model Using Compound-Eye Visual Representation.",
                    "ECDS: An Effective Shape Signature Using Electrical Charge Distribution on the Shape.",
                    "Dynamic Human Surface Reconstruction Using a Single Kinect.",
                    "High Quality Binocular Facial Performance Capture from Partially Blurred Image Sequence.",
                    "Markerless 3D Hand Posture Estimation from Monocular Video by Two-Level Searching.",
                    "Visual Saliency Guided Global and Local Resizing for 3D Models.",
                    "Semantic Cage Generation for FE Mesh Editing.",
                    "Inversion Free and Topology Compatible Tetrahedral Mesh Warping Driven by Boundary Surface Deformation.",
                    "Stego-Marbling-Texture.",
                    "A Simple Method to Animate Vegetation in Images Using Simulation-Guided Grid-Based Warping.",
                    "Synthesizing Solid-Induced Turbulence for Particle-Based Fluids.",
                    "Accelerated Viscous Fluid Simulation Using Position-Based Constraints.",
                    "Physical Modeling and Configuration Simulation for Constrained Cables of Electromechanical Products.",
                    "Isogeometric Analysis Based on a Set of Truncated Interpolatory Basis Functions.",
                    "Visitpedia: Wiki Article Visit Log Visualization for Event Exploration.",
                    "Network-Based Clustering and Embedding for High-Dimensional Data Visualization.",
                    "Volume Upscaling Using Local Self-Examples for High Quality Volume Visualization.",
                    "Gradient Octrees: A New Scheme for Remote Interactive Exploration of Volume Models.",
                    "CAVIAR-Based Vortex Core Region Detection.",
                    "AIMtechKinect: A Kinect Based Interaction-Oriented Gesture Recognition System Designed for Students with Severe Intellectual Disabilities.",
                    "CAD-Centered Integration and Efficient Visualization of Multidisciplinary Simulation Data.",
                    "Real-Time Label Visualization in Massive CAD Models.",
                    "Interactive Rendering for Large-Scale Mesh Based on MapReduce.",
                    "Interactive Tensor Field Design Based on Line Singularities.",
                    "Computation of Voronoi Diagram of Planar Freeform Closed Convex Curves Using Touching Discs.",
                    "G2-Continuity Blending of Ball B-Spline Curve Using Extension.",
                    "3D Ear Matching Using Local Salient Shape Feature.",
                    "A Binary Descriptor Structured on More Spatial Information.",
                    "A Fast Normal-Based Subdivision Scheme for Curve and Surface Design.",
                    "A feature-based approach for detecting global symmetries in CAD models with free-form surfaces.",
                    "A New Design Rationale Knowledge Evaluation Method.",
                    "Automatic Matting of Identification Photos.",
                    "Automatic Motion Capture Data Denoising via Filtered Local Subspace Affinity and Low Rank Approximation.",
                    "Coherent Stylized Lines for Mesh Surfaces by Contour Triangles.",
                    "Composite Rigid Body Construction for Fast and Compact Dynamic Data Compression.",
                    "Counter-Deformed Design of Ship Structural Parts Using Geometric Shape Deformation Based on Welding Distortion Estimation.",
                    "Creating Texture Exemplars from Unconstrained Images.",
                    "Depth-of-Field Rendering with Saliency-Based Bilateral Filtering.",
                    "Direct Extraction of Feature Curves from Volume Image for Illustration and Vectorization Based on 2D/3D Curve Mapping.",
                    "Efficient 3D Reconstruction of Vessels from Multi-views of X-Ray Angiography.",
                    "Energy-Based Dissolution Simulation.",
                    "Exposing Blur Kernel from Retouch Image.",
                    "Face Image Illumination Transfer through Eye-Relit 3D Basis.",
                    "Feature Extraction and Analysis for Scientific Understanding of Visual Art.",
                    "G2-Continuity Extension Algorithm for Disk B-Spline Curve.",
                    "Human Motion Retrieval Based on Sparse Coding and Touchless Interactions.",
                    "Illusory Motions on Surfaces.",
                    "Indoor Structure Understanding from Single 360 Cylindrical Panoramic Image.",
                    "InSide: Interactive Sketching for Image Database Exploration.",
                    "iSarProjection: A KinectFusion Based Handheld Dynamic Spatial Augmented Reality System.",
                    "Multi-degree reduction of Bezier curves with higher approximation order.",
                    "Multi-level Structuralized MBD Model for Manufacturing Reuse of Mechanical Parts.",
                    "Paint Desirable Subjects with Interactive Video Feedback.",
                    "Polynomial Minimal Surfaces of Arbitrary Degree with Isothermal Parameter.",
                    "Projector-Screen Matching Image Generation Technology for Spatial Augmented Reality.",
                    "Real-Time Appearance Modification of Textured Object Using Superimposed Projection.",
                    "Real-Time Auto Stylized Sand Art Drawing.",
                    "Real-Time High Resolution Fusion of Depth Maps on GPU.",
                    "Resolving Cloth Penetrations with Discrete Collision Detection.",
                    "ROI-Emphasized Volume Visualization Guided by Anisotropic Structure Tensor.",
                    "Saliency-Aware Volume Data Resizing by Surface Carving.",
                    "Scalable Mesh Deformation with Controllable Stiffness.",
                    "Speeding Up SIFT Algorithm by Multi-core Processor Supporting SIMD Instruction Sets.",
                    "The Study and Application of the Product Image Survey and Retrieval System Based on Kansei Engineering.",
                    "Using Local Complexity to Accelerate Screen Space Ambient Occlusion."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12. CAD/Graphics 2011",
        "info": "Jinan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2011",
                "sub_name": "12th International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2011, Jinan, China, September 15-17, 2011.",
                "count": 76,
                "papers": [
                    "A \"Change 'n Play\" Software Architecture Integrating CAD, CAE and Immersive Real-Time Environments.",
                    "Detecting Ambiguities in 3D Polygons with Self-Intersecting Projections.",
                    "Automatic Generation of Canonical Views for CAD Models.",
                    "Direct Rendering of Solid CAD Models on the GPU.",
                    "An Example-Driven Symbol Recognition Approach Based on Key Features in Engineering Drawings.",
                    "Knowledge Management for Product Development: A Review.",
                    "DMML: A Design Thinking Process Modeling Language.",
                    "Niche Improved Particle Swarm Optimization on Geometric Constraint Solving.",
                    "Finite Element Mesh Editing through CAD Operations.",
                    "An Accurate and Practical Camera Lens Model for Rendering Realistic Lens Effects.",
                    "Real-Time Volume Caustics with Image-Based Photon Tracing.",
                    "Importance-Driven Composition of Multiple Rendering Styles.",
                    "SIMD Friendly Ray Tracing on GPU.",
                    "Fast Point Based Global Illumination.",
                    "A New Foveation Ray Casting Approach for Real-Time Rendering of 3D Scenes.",
                    "Multi-GPU Compositeless Parallel Rendering Algorithm.",
                    "Spherical Projective Displacement Mesh.",
                    "The Spherical Images of Triangular Mesh Surfaces.",
                    "Structure Preserving Mesh Parameterization.",
                    "Tetrahedral Mesh Editing with Local Feature Manipulations.",
                    "Real-Time Image Smoothing Based on True Edges.",
                    "A 2D-3D Hybrid Approach to Video Stabilization.",
                    "Color-Mood-Aware Clothing Re-texturing.",
                    "Image Mosaics with Irregular Tiling.",
                    "Automatic Segmentation of Head-and-Shoulder Images by Combining Edge Feature and Shape Prior.",
                    "Creating Cylindrical Panoramic Mosaic from a Pipeline Video.",
                    "iFrames: A Multi-level Keyframe Extraction and Navigation Tool for Videos.",
                    "Automatic Compositing Soccer Video Highlights with Core-Around Event Model.",
                    "Fast Patch-Based Image Hybrids Synthesis.",
                    "Detection Geometric Object in the Conformal Geometric Algebra Framework.",
                    "Scale Adaptation of Mean Shift Based on Graph Cuts Theory.",
                    "A Unified Framework for Alpha Matting.",
                    "Constructing an Interpolatory Subdivision Scheme from Doo-Sabin Subdivision.",
                    "Variational Harmonic Method for Parameterization of Computational Domain in 2D Isogeometric Analysis.",
                    "Convergence of Geometric Interpolation Using Uniform B-splines.",
                    "Injectivity of 2D Toric Bézier Patches.",
                    "The PIA Property of Low Degree Non-uniform Triangular B-B Patches.",
                    "CurveNetSurf: Creating Surfaces from Curve Networks.",
                    "Multi-resolution Mesh Fitting by B-spline Surfaces for Reverse Engineering.",
                    "Variational Progressive-iterative Approximation for Fairing Curve and Surface Generation.",
                    "A Hierarchical Approach to 3D Scattered Data Interpolation with Radial Basis Functions.",
                    "A Tangent Vector Based Nonlinear Subdivision Scheme without Self-Intersection for Curve Design.",
                    "A Local Behavior Model for Small Pedestrian Groups.",
                    "Human Motion Synthesis Using Window-Based Local Principal Component Analysis.",
                    "Parallel Spatial Hashing for Collision Detection of Deformable Surfaces.",
                    "Controlling Simulated Explosions by Optimization and Prediction.",
                    "Robust Deformation Transfer via Dual Domain.",
                    "Lattice-Based Skinning and Deformation for Real-Time Skeleton-Driven Animation.",
                    "A Rapid Method of 3D Character Models' Diversity Used Micro-deformation.",
                    "An Efficient Adaptive Vortex Particle Method for Real-Time Smoke Simulation.",
                    "Orthognathic Soft-Tissue Prediction Based on Three-Dimensional Graphics Model Recovery.",
                    "Realistic Fire Simulation: A Survey.",
                    "An Improved Cellular Genetic Algorithm with Evolutionary Rules for 3D Animation Modeling Design.",
                    "Anisotropic Kernels for Meshless Elastic Solids.",
                    "MCA-Based Animation of Fracturing Heterogeneous Objects.",
                    "IdiotPencil: An Interactive System for Generating Pencil Drawings from 3D Polygonal Models.",
                    "Application of Pen-Based Planar Haptic Interface in Physics Education.",
                    "Depth-Based Feature Enhancement for Volume Visualization.",
                    "2.5D Focus+Context Map Visualization.",
                    "Feature-Preserving Quantization for 3D Seismic Visualization.",
                    "Interactive Expressive Illustration of 3D City Scenes.",
                    "An Optimal Color Mapping Strategy Based on Energy Minimization for Time-Varying Data.",
                    "Opacity Volume Based Halo Generation for Enhancing Depth Perception.",
                    "A Kind of Shape-Color Moment Invariants.",
                    "The Multi-layer Spherical Helix Curve-Based 3-D Fourier Feature.",
                    "On-line Illumination Estimation of Outdoor Scenes Based on Area Selection for Augmented Reality.",
                    "An Interactive 3D Preoperative Planning and Training System for Minimally Invasive Vascular Surgery.",
                    "Single Image Based Illumination Estimation for Lighting Virtual Object in Real Scene.",
                    "Behavior-Based Simulation of Real-Time Crowd Evacuation.",
                    "Tree-Based Partitioning Approach for Network-on-Chip Synthesis.",
                    "A Fast Retiming Algorithm Integrated with Rewiring for Flip-Flop Reductions.",
                    "Row-Based Analysis of Structure Power/Ground Grids with General Purpose GPU.",
                    "A Residential Building Reconstruction Method and Its Evaluation.",
                    "Delaunay/Voronoi Dual Representation of Smooth 2-Manifolds.",
                    "Modeling Expressions of Peking Opera Facial Make-Ups.",
                    "Implicit Surface Reconstruction Based on Adaptive Clustering."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11. CAD/Graphics 2009",
        "info": "Huangshan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2009",
                "sub_name": "11th International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2009, Huangshan, China, August 19-21, 2009.",
                "count": 125,
                "papers": [
                    "Nucleus: Towards a unified dynamics solver for computer graphics.",
                    "Physical behavior of deformable hair and clothes: What is common?",
                    "Interactive sound rendering.",
                    "Surface reconstruction techniques for imperfect raw-data.",
                    "Hierarchical and wavelet-based multilinear models for multi-dimensional visual data approximation.",
                    "Simulation of various natural phenomena based on computational fluid dynamics.",
                    "Visualizing networks using adjacency matrices: Progresses and challenges.",
                    "Prospective analysis for CAD-FEM integration and other product views.",
                    "Nanomanufacturing: Challenges and opportunities from design to fabrication.",
                    "BioCAD in tissue science and engineering.",
                    "A new adaptive model for real-time fluid simulation with complex boundaries.",
                    "Efficient collision detection for soft tissue simulation in a surgical planning system.",
                    "Crowds flow in complex environment.",
                    "An improved method for generating multiresolution animation models.",
                    "Physics and example based skin deformations for character animation.",
                    "Direct manipulation of RDMS free form deformation.",
                    "3D clothing fitting based on the geometric feature matching.",
                    "Evaluating simplified air force models for cloth simulation.",
                    "Bubble creation and multi-fluids interaction.",
                    "C1 bicubic splines over general T-meshes.",
                    "Multi-level tree branch modeling and animation.",
                    "Physically based simulation of tidal bore.",
                    "Multi-attributes controlled point-based rendering architecture for mobile devices.",
                    "Real-time rendering of translucent objects with variable sizes.",
                    "Practical hybrid pre-filtering shadow maps.",
                    "Tool-based hairstyling metaphors.",
                    "HLD: A robust descriptor for line matching.",
                    "Approximating solid objects by ellipsoid-tree.",
                    "Real-time photo style transfer.",
                    "Interactive local color transfer based on Coupled Map Lattices.",
                    "Solid texture synthesis using Position Histogram Matching.",
                    "Multie-scale joint bilateral image and video texture upsampling.",
                    "Bilateral filtering using fuzzy-median for image manipulations.",
                    "Linear independent moment invariant sets.",
                    "Fitting to image by piecewise bi-cubic surface.",
                    "The application of V-system in visualization of multidimensional data.",
                    "Entertaining video warping.",
                    "Fast gradient-domain video compositing using hierarchical data structure.",
                    "Registration of blurred images for image mosaic.",
                    "Fast placement for large-scale hierarchical FPGAs.",
                    "Detail-preserving sculpting deformation.",
                    "An evaluation method of subdivision surfaces based on moment invariants.",
                    "Submesh splines over hierarchical T-meshes.",
                    "A feature-preserving simplification based on integral invariant clustering.",
                    "A nonparametric approach for noisy point data preprocessing.",
                    "Segmenting deformable soft-body meshes based on statistical variation information for piecewise Active Shape Model.",
                    "Accurate stitching for polygonal surfaces.",
                    "Prop-cut: A mesh cutting method based on Tikhonov regularization.",
                    "Boundary smoothing for mesh segmentation.",
                    "Surface matching and registration using symmetric conformal mapping.",
                    "Blending circular quadrics with parametric patches.",
                    "A note to \"Dimensions of spline spaces over unconstricted triangulations\" [J. Computational Applied Mathematics 192: 320-327, 2006].",
                    "Constructing G1 quadratic Bézier curves with arbitrary endpoint tangent vectors.",
                    "Dynamic flame simulation of ceramic roller kiln based on particle system.",
                    "On interpolation and approximation by bivariate quintic splines with boundary conditions.",
                    "A geometric non-linear interpolatory subdivision scheme via approximation scheme.",
                    "Exact and approximate representations of trimmed surfaces with NURBS and Bézier surfaces.",
                    "Unified subdivision generalizing 2- and 4-direction box splines.",
                    "Geometric modeling with quasi-Hermite curves and surfaces.",
                    "Surface modeling with boundary constraints and partial differential equations.",
                    "Algorithm for approximate NURBS surface skinning and its application.",
                    "Hand tracking and animation.",
                    "Markerless tracking for augmented reality applied in reconstruction of Yuanmingyuan archaeological site.",
                    "The UI issues for the search engine.",
                    "An efficient region suppression algorithm for B-rep model.",
                    "FEA-mesh editing with feature constrained.",
                    "Development of reinforcement design system for lining structures based on OpenGL.",
                    "A 3D geometric constraint solver for direct manipulation of B-rep model.",
                    "Mobile 3D graphics compression for progressive transmission over wireless network.",
                    "Common design structure discovery from CAD models.",
                    "Narrow-deep feature recognition in mould.",
                    "Researches on mold-based feature extraction and retrieval technology of 3D models.",
                    "Identifying features in reconstructing 3D solids from sectional views.",
                    "A semantic feature language for concurrent engineering.",
                    "Global density smoothing technique for analytical placement algorithm.",
                    "To correspond topological entities in non-quiescent context of replicated collaborative modeling system.",
                    "On the performance of maximal intersection of spherical polygons by arcs.",
                    "A study on autonomous animated robots: Anibots.",
                    "CAD/CAE integration framework with layered software architecture.",
                    "A representation of context in design thinking process modeling.",
                    "Domain knowledge driving in intelligent design of series mechanical product.",
                    "FODA: Fast open-defect analysis method for power/ground networks.",
                    "Arbitrary shape reconstruction from NC sectional data and applications in space cutter compensation and interference detection.",
                    "CAE software of twin-tubes shock absorber outer-characteristic.",
                    "One-sided object cutout using principal-channels.",
                    "Multi-layer depth peeling via fragment sort.",
                    "A new quantization method for 3-D seismic visualization.",
                    "3D model feature extraction method based on the projection of principle plane.",
                    "Volume rendering using grid computing for large-scale volume data.",
                    "An task scheduling algorithm of real-time leakage power and temperature optimization for MPSoC.",
                    "Automatic Reconfigurable System-on-Chip design with run-time hardware/software partitioning.",
                    "An approach to synthesis delay semantics in VHDL.",
                    "A thermal-driven force-directed floorplanning algorithm for 3D ICs.",
                    "Rate-equation-based VCSEL model and simulation.",
                    "ASIG: An all-solution SAT solver for CNF formulas.",
                    "Parallelized generation of photon texture and real-time rendering on GPU.",
                    "Realistic rendering of fire scene.",
                    "CAD software development of throttle valves parameters of telescopic shock absorber based on speed characteristic.",
                    "Balanced hierarchical face clustering algorithm on triangle meshes.",
                    "Machining process language understanding in 3D process modeling.",
                    "GPU-based direct volume rendering with advanced illumination and Deep Attenuation Shadows.",
                    "Automatic 3D segmentation of CT images based on active contour models.",
                    "Description logic representation for semantic concepts of feature.",
                    "Parametric garment modeling from sections.",
                    "A novel systematic approach for product variant design using One-Step quality function deployment.",
                    "Sharetouch: a multi-touch social platform for the elderly.",
                    "Ant colony optimization for symmetrical FPGA placement.",
                    "Design of a Human-Robot interaction system for offshore monitoring.",
                    "A Collaborative Design Frame based on Virtual Prototypes and virtual Manufacturing.",
                    "Efficient and robust reconstruction of botanical branching structure from laser scanned points.",
                    "Semi-similarity design of motorcycle-hydraulic-disk brake: strategy and application.",
                    "A new representation of Chinese chess board.",
                    "Texture analyse based on coefficients' relationship co-occurrence histogram.",
                    "Approximation methods for the Plateau-Bézier problem.",
                    "Curve representing and matching based on feature points and minimal area threshold.",
                    "Using OPTFR-multiwavelet to improve the fusion of infrared and visible images.",
                    "Craniofacial model reconstruction from skull data based on feature points.",
                    "EMD based fairing algorithm for mesh surface.",
                    "A fuzzy background model for moving object detection.",
                    "A method for generating the trimming PDE surface.",
                    "Study on precision irrigation technology of large scale irrigator.",
                    "An improved rotation-based self-calibration.",
                    "Visualizing 3-D symmetric tensor fields using a type of surface icons.",
                    "Parallel adaptive simplification of massive meshes.",
                    "Visualizing networks using adjacency matrices: Progresses and challenges."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10. CAD/Graphics 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2007",
                "sub_name": "10th International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2007, Beijing, China, 15-18 October, 2007.",
                "count": 128,
                "papers": [
                    "Graphical Modeling and Calligraphic Interfaces.",
                    "CAD System for Human-Centered Design.",
                    "Physically Based Simulation of Fluid Mixtures.",
                    "Efficient Methods for Global/Environment Illumination.",
                    "From Measured Fabric to the Simulation of Cloth.",
                    "Improved Error Estimate for Extraordinary Catmull-Clark Subdivision Surface Patches.",
                    "3D Shape Metamorphosis Based on T-spline Level Sets.",
                    "Registration of CAD Mesh Models with CT Volumetric Model of Assembly of Machine Parts.",
                    "A Robust Hole-Filling Algorithm for Triangular Mesh.",
                    "Dynamic Delaunay Tetrahedralisation of a Deforming Surface.",
                    "Surface Modeling with Polynomial Splines over Hierarchical T-meshes.",
                    "Computing Shortest Cycles Using Universal Covering Space.",
                    "Proper Reparametrization of Rational Ruled Surface.",
                    "Smooth Surface Constructions via a Higher-Order Level-Set Method.",
                    "Implicit Surface Modeling Suitable for Inside/Outside Tests with Radial Basis Functions.",
                    "A Feature Preserving and Volume Shrinking Prevented Mesh Smoothing Algorithm.",
                    "A Robust and Fast Non-local Means Algorithm for Image Denoising.",
                    "Stylized Liquid Animation with Temporal Coherence.",
                    "Spherical Parameterization of Genus-Zero Meshes Using the Lagrange-Newton Method.",
                    "Rapid Evaluation of Regular Quad-mesh Interpolatory Subdivision Surfaces Based on Parametric Decomposition.",
                    "Smooth Schedule of Large-scale Terrain Visualization from External Memory.",
                    "Applications of Complete Orthogonal V-system with Multiresolution Property.",
                    "A Sketch-Based Cooperative Diagramming Tool for Conceptual Design.",
                    "Sketch-based Modeling and Animation of Floral Blossom.",
                    "ω-Bezier.",
                    "Intersection Testing between an Ellipsoid and an Algebraic Surface.",
                    "Skeleton Based Parametric Solid Models: Ball B-Spline Surfaces.",
                    "Parametric Cubic Rational Interpolation with GC1 Continuity.",
                    "B-spline Surfaces of Clustered Point Sets with Normal Maps.",
                    "An Adaptive Subdivision Method Based on Limit Surface Normal.",
                    "Constructing G1 Triangular Interpolation Surface with Normal Control.",
                    "A Novel Pointcloud-based Isosurface Extraction.",
                    "Parallel RBF-based Reconstruction from Contour Dataset.",
                    "Common Substructure Extraction of Proteins by Geometric Invariants.",
                    "Recognizing Planar Curve Based on NRLCTI and Match Sub-curve.",
                    "Objects Similarity Measurement Based on Skeleton Tree Descriptor Matching.",
                    "Constructive MA Generation for 2D Models.",
                    "The Feature Extraction of Macromolecular Field Based on Level Set Method.",
                    "OFS: A Feature Selection Method for Shape-based 3D Model Retrieval.",
                    "A Region-Growing Based Iso-Surface Extraction Algorithm.",
                    "Multi-mode Solid Model Retrieval Based on Partial Matching.",
                    "Parallel Global Optimal Approach of Feedback for 3D CAD Model Retrieval.",
                    "A New Canonical Model of Virtual Human Head.",
                    "Texture Advection Based Simulation of Dynamic Cloud Scene.",
                    "Modeling and Visualization of Flower Color Patterns.",
                    "An Efficient Approach to Real-Time Sky Simulation.",
                    "Unified Volumes for Light Shaft and Shadow with Scattering.",
                    "High-quality Texture-based Flow Visualization on Surfaces.",
                    "Research on Unified Object Model Supporting HLA-based Simulation and Parallel Rendering.",
                    "An Improved Study of Physically Based Fluid Simulation on GPU.",
                    "An Efficient Approach for Generating Pencil Filter and Its Implementation on GPU.",
                    "A New Adaptive Sampling Technique for Monte Carlo Global Illumination.",
                    "A New Image Matching Algorithm Based on the Relative Position of Intensity.",
                    "Fast Detection of Vehicles Based-on the Moving Region.",
                    "A Geometric Method for Subpixel Boundary.",
                    "Stereo Matching for Monotone Texture of Mechanical Parts.",
                    "A Novel Method for Vectorizing Historical Documents of Chinese Calligraphy.",
                    "Multi-Focus Image Fusion Algorithm Based on Rational Spline.",
                    "Robust Algorithm for Detecting the Maximum Inscribed Circle.",
                    "Image Segmentation and Reconstruction Using Graph Cuts and Texton Mask.",
                    "Effective Re-texturing with Interactive Object Extracting.",
                    "Using CAD Geometric Variation Approach for Lettering Complicated Letter on 3D Free-Form Surface by a 3-DOF Parallel Machine Tool.",
                    "CAD-directed Inspection Planning for Laser Guided Measurement Robot.",
                    "Research on the Model and Application of Feature-based Automobile Styling.",
                    "3D CAD Modeling Using Automatically Reconstructable Assemblies.",
                    "Surface Remeshing on Triangular Domain for CAD Applications.",
                    "Variable Code-Mode Based Connectivity Compression for Triangular Meshes.",
                    "A Quasi-Laplacian Smoothing Approach on Arbitrary Triangular Meshes.",
                    "A Meaningful Mesh Segmentation Based on Local Self-similarity Analysis.",
                    "A Novel 3D Mesh Blind Watermarking Algorithm Based on Nielson Affine Invariant Norm.",
                    "Interactive Model Decomposition.",
                    "DAC Circuit with Multi-threshold Voltage for TFT-LCD Driver IC.",
                    "SN-SOR: Single-Node SOR Method for Statistic Analysis of Power/Ground Networks.",
                    "Transistor Level Timing Analysis Considering Multiple Inputs Simultaneous Switching.",
                    "Coverage Driven Test Generation Framework for RTL Functional Verification.",
                    "A New ILP Based Approach to Schedule and Bind Simultaneously.",
                    "Simultaneous Switching Noise Consideration for Power/Ground Network Optimization.",
                    "Thermal Effects with Leakage Power Considered in 2D/3D Floorplanning.",
                    "Power-driven Real-time System Design with Energy Efficiency via ISA Customization.",
                    "VPH: Versatile Routability-Driven Place Algorithm for Hierarchical FPGAs Based on VPR.",
                    "Intelligent Robotic Peg-in-Hole Insertion Learning Based on Haptic Virtual Environment.",
                    "Virtual Reality Platform Based on Open Sourced Graphics Toolkit OpenSceneGraph.",
                    "A Plane-based Calibration for Multi-camera Systems.",
                    "An adaptable sketch-based modeling system.",
                    "Study on an Indoor Tracking System Based on Primary and Assistant Infrared Markers.",
                    "On Video Game: Heaven or Hell.",
                    "Optimization of Tool Motion Trajectories for Pocket Milling Using a Chaos Ant Colony Algorithm.",
                    "Articulated Skeleton Fitting.",
                    "Process Modeling of Top-down Collaborative Assembly Design Based on Petri Net.",
                    "Research on Concurrent Assembly in Virtual Environment.",
                    "Quadratic Trigonometric Spline Curves with Multiple Shape Parameters.",
                    "Approximation of Circular Arcs by C2 Cubic Polynomial B-splines.",
                    "Skeleton Based Parametric Solid Models: Ball B-Spline Curves.",
                    "G1 Continuity between Two Patches of Adjacent Cubic NURBS Surface.",
                    "Reconstructing Line Drawings Based on Constraints among Edges and Vertices.",
                    "A Method for Polyhedron Object Rapid Prototyping Based on Its Digital Images.",
                    "Shape Analysis of Volume Models by Euclidean Distance Transform and Moment Invariants.",
                    "High Resolution Medical Models and Geometric Reasoning starting from CT/MR Images.",
                    "3D Face Animation Based on Raw Scanned Data of Real Individuals.",
                    "3D Model Deformation via Conformal Mapping.",
                    "Mesh Deformation under Skeleton-based Detail-preservation.",
                    "Target Recognition Based on Mathematical Morphology.",
                    "Color Transfer Based on Combining Subtractive Clustering with FCM Clustering.",
                    "Low-Level Vision Based Super-Resolution Image Reconstruction.",
                    "Best Fit Decreasing for Fully Automatic Compact Texture Atlas Generation.",
                    "Feature Analysis and Texture Synthesis.",
                    "Transparent Direct3D9 Application-level Parallel Rendering System.",
                    "A Method for Terrain Rendering without Seams Based on Image.",
                    "A Volumetric Bounding Volume Hierarchy for Collision Detection.",
                    "An Artistic Rendering Method for 3D Fractals.",
                    "A Computational Topology Approach to Automatic Partition and Visualization of Oceanic Water Masses.",
                    "Max/Min Path Visual Coverage Problems in Raster Terrain.",
                    "Artistic Fractal Images for Complex Mapping F(z) and T(z).",
                    "Automatic and Real-Time Video Stylization.",
                    "Comparison and Analysis of Novel Architectures for Media Compression.",
                    "Based on Motion Characteristics to Calculate the Adaptive Embedding Tolerance for Imperceptible Video Watermarking.",
                    "A Tracking Model with Occlusion Handling Based on Information Fusion.",
                    "A Dual Optimization Model of Fixture Design for the Thin-walled Workpiece.",
                    "Research on the Algorithm of Tool Path Rapid Generation for NC Machining of Molar Prosthesis.",
                    "Free-Form Feature Surface Design Based on Wavelet Multiresolution Analysis.",
                    "Modeling and Movement Simulation of a Manipulator of 6-DOF Based on Stewart Platform with Pro/E.",
                    "Geometric Modeling and Simulation on Toroidal Drive.",
                    "Generalized Dynamic Constraint Satisfaction Based on Extension Particle Swarm Optimization Algorithm for Collaborative Simulation.",
                    "Assembly Planning and Assembly Sequences Combination Using Assembly Feature Interference.",
                    "Key Problems on Network-on-Chip.",
                    "A Novel High Level Synthesis Approach.",
                    "Mapping Applications on Coarse-Grained Reconfigurable Systems Using Architecture Template Modeling.",
                    "Verification of Circuits Including Black Box Based on TED."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "9. CAD/Graphics 2005",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cadgraphics/2005",
                "sub_name": "9th International Conference on Computer-Aided Design and Computer Graphics, CAD/Graphics 2005, Hong Kong, China, 7-10 December, 2005.",
                "count": 82,
                "papers": [
                    "The tangency problem of variable radius circle to lines, circles and ellipses.",
                    "What order Taylor model is sufficient for subdivision based implicit curve plotting.",
                    "C1 continuous rational re-parameterization using monotonic parametric speed partition.",
                    "A robust iterative method devoted to pole curve fitting.",
                    "Recent advances in shape preserving representations.",
                    "A method for constructing G1 continuous splines via matrix decomposition.",
                    "Evolution of 3D curves under strict spatial constraints.",
                    "A fitting approach with dynamic algebraic spline curves.",
                    "Regular Bezier curve: some geometric conditions and a necessary and sufficient condition.",
                    "Constructing geometric Hermite curve with minimum curvature variation.",
                    "A method of generating smooth surface using C-curves.",
                    "Construction of cubic triangular patches with C1 continuity around a corner.",
                    "Determination of free parameters in algebraic surface blending.",
                    "Surface blending with curvature continuity.",
                    "The constraint elevation for parametric continuity order of NURBS curve and surface.",
                    "G1-connection between rectangular Bezier patches and multisided Bezier patch.",
                    "Interpolating meshes of curves by Catmull-Clark subdivision surfaces with a shape parameter.",
                    "Subdivision surfaces based on point-based splines.",
                    "Adaptive refinement scheme for subdivision surfaces based on triangular meshes.",
                    "Adaptive rendering of Catmull-Clark subdivision surfaces.",
                    "High quality triangulation of implicit surfaces.",
                    "Implicit fitting and smoothing using radial basis functions with partition of unity.",
                    "Fast mesh-free deformations.",
                    "3D model retrieval based on orthogonal projections.",
                    "The curve-structure invariant moments for shape analysis and recognition.",
                    "A similarity computing algorithm for proteins.",
                    "Rod-like trabeculae extraction from cancellous bone microstructure using topological analysis.",
                    "Interactive procedural computer-aided design.",
                    "Design and applications of a parameterized language for modeling architecture components.",
                    "Development of pants slopers with automatic drafting functions and human body measurement for use in apparel CAD education.",
                    "Computer-aided molecular design (CAMD) with force-torque feedback.",
                    "Watermarking of two-dimensional engineering graph based on the orthogonal complete U-system.",
                    "An efficient algorithm to fixed-outline floorplanning based on instance augmentation.",
                    "Reverse engineering of a bamboo-net handicraft.",
                    "Determination of optimal build orientation based on satisfactory degree theory for RPT.",
                    "Intelligent feature based process planning for five-axis lathe.",
                    "Five-axis flank machining of ruled surfaces with developable surface approximation.",
                    "A method for information protection in collaborative assembly design.",
                    "Replicated collaborative solid modeling and naming problems.",
                    "A persistent naming of shells.",
                    "A global Laplacian smoothing approach with feature preservation.",
                    "Feature-preserving mesh denoising via bilateral normal filtering.",
                    "A new bilateral mesh smoothing method by recognizing features.",
                    "Meshing skin surfaces with certified topology.",
                    "Length-preserved natural boundary for intrinsic parameterization.",
                    "A new approach of progressive spherical parameterization.",
                    "Mesh parameterization for an open connected surface without partition.",
                    "Geometric property estimation from 3D range data points aided by local quadric surface fitting.",
                    "Surface extraction from multi-material CT data.",
                    "3D terrain reconstruction based on contours.",
                    "A new method for low polygonal modeling of colored object.",
                    "Mesh simplification and adaptive LOD for finite element mesh generation.",
                    "Rapidly generate lumbar spine volume mesh.",
                    "Real-time tetrahedral volume editing accounting for discontinuities.",
                    "Dual graph of a mesh partition for interactive analysis of huge digital mockups.",
                    "Cluster based real-time rendering system for large terrain dataset.",
                    "Distributed volume rendering on a visualization cluster.",
                    "High-performance navigation and rendering of very-large scale landscape and seascape.",
                    "Detecting and visualizing local bifurcations in 2D time-dependent vector fields.",
                    "Imaging vector field using SMP images.",
                    "Dynamic labeling management in virtual and augmented environments.",
                    "An interactive system for visualizing 3D human organ models.",
                    "A realistic force rendering algorithm for CyberGrasp.",
                    "Voxel-based representation, display and thickness analysis of intricate shapes.",
                    "The architecture of a J2ME-based OpenGL ES 3D library.",
                    "GPU-based real-time simulation and rendering of unbounded ocean surface.",
                    "Acceleration of regular grid traversals using extended chessboard distance transformation on GPU.",
                    "The GPU on irregular computing: performance issues and contributions.",
                    "A swarm intelligence approach to path synthesis of mechanism.",
                    "Motion retargeting and transition in different articulated figures.",
                    "Mocap data editing via movement notations.",
                    "Real-time rain simulation in cartoon style.",
                    "Surface reconstruction for animation of ocean waves.",
                    "Efficient and simple cloth animation.",
                    "Scattering-based interactive hair rendering.",
                    "A hybrid scheme of texture synthesis for capturing macro & micro structures.",
                    "Optimal sample patches selection for tile-based texture synthesis.",
                    "Foreground-distortion method for image synthesis.",
                    "Illumination morphing: smooth transition of luminance distributions between two images.",
                    "Refractive index and transmission coefficient recovery algorithm of crystal-like objects.",
                    "An image inpainting method.",
                    "Stylized glass paintings for non-photorealistic rendered scenes."
                ]
            }
        ]
    }
]