[
    {
        "name": "CAGD",
        "year": "2022",
        "info": "2022: Volumes\n92,",
        "count": 6,
        "papers": [
            "Approximation by polynomial splines on curved triangulations.",
            "A constructive approach to implicitizing rational surfaces with LCI base points by moving planes and moving quadrics.",
            "Geometric approximation of the sphere by triangular polynomial spline patches.",
            "Implicit surface reconstruction based on a new interpolation/approximation radial basis function.",
            "Construction of C1 polygonal splines over quadrilateral partitions.",
            "Data approximation by L1 spline fits with free knots."
        ]
    },
    {
        "name": "CAGD",
        "year": "2021",
        "info": "2021: Volumes\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91",
        "count": 52,
        "papers": [
            "A sampling type discernment approach towards reconstruction of a point set in R2.",
            "Curvature computations for the intersection curves of hypersurfaces in Euclidean n-space.",
            "Special issue on 14th International Conference on Geometric Modeling and Processing (GMP2020).",
            "A visibility-based surface reconstruction method on the GPU.",
            "Inversion, degree, reparametrization and implicitization of improperly parametrized planar curves using μ-basis.",
            "SCN: Dilated silhouette convolutional network for video action recognition.",
            "Representing planar domains by polar parameterizations with parabolic parameter lines.",
            "Constructing quadratic birational maps via their complex rational representation.",
            "Single-sized spheres on surfaces (S4).",
            "Binary segmentation of medical images using implicit spline representations and deep learning.",
            "27 variants of Tutte's theorem for plane near-triangulations and an application to periodic spline surface fitting.",
            "An annihilator-based strategy for the automatic detection of exponential polynomial spaces in subdivision.",
            "Parameterization for polynomial curve approximation via residual deep neural networks.",
            "Tubular parametric volume objects: Thickening a piecewise smooth 3D stick figure.",
            "Multi-derivative physical and geometric convolutional embedding networks for skeleton-based action recognition.",
            "Precise Hausdorff distance computation for freeform surfaces based on computations with osculating toroidal patches.",
            "Computing planar and volumetric B-spline parameterizations for IGA by robust mapping fitting.",
            "Heterogeneous parametric trivariate fillets.",
            "Local Delaunay-based high fidelity surface reconstruction from 3D point sets.",
            "Multi-sided completion of C2 bi-3 and C1 bi-2 splines: A unifying approach.",
            "Self-intersection computation for freeform surfaces based on a regional representation scheme for miter points.",
            "GMP2021 - 15th International Conference on Geometric Modeling and Processing.",
            "Special issue on the SIAM Conference on Computational Geometric Design (GD 19).",
            "Enforcing convergence of derivatives for L∞ approximation of a regular curve.",
            "A property of parametric polynomial approximants of half circles.",
            "A sufficient condition for 3D typical curves.",
            "Cd Hermite interpolations with spatial Pythagorean hodograph B-splines.",
            "Morphing of spherical closed curves.",
            "Isogeometric collocation method with intuitive derivative constraints for PDE-based analysis-suitable parameterizations.",
            "Geometric interpolation of ER frames with G2 Pythagorean-hodograph curves of degree 7.",
            "A simple and complete discrete exterior calculus on general polygonal meshes.",
            "New shape control tools for rational Bézier curve design.",
            "Multiscale persistent topological descriptor for porous structure retrieval.",
            "Streaming Hermite interpolation using cubic splinelets.",
            "Spatial quintic Pythagorean-hodograph interpolants to first-order Hermite data and Frenet frames.",
            "Multi-sided B-spline surfaces over curved, multi-connected domains.",
            "Automatic pose and wrinkle transfer for aesthetic garment display.",
            "Planar class A Bézier curves: The case of real eigenvalues.",
            "Note on planar Pythagorean hodograph curves of Tschirnhaus type.",
            "Geometric modeling of complex knitting stitches using a bicontinuous surface and its offsets.",
            "A phase-field approach to variational hierarchical surface segmentation.",
            "A dynamic sampling approach towards computing Voronoi diagram of a set of circles.",
            "Self-attention implicit function networks for 3D dental data completion.",
            "Tegula - exploring a galaxy of two-dimensional periodic tilings.",
            "Surfaces containing two isotropic circles through each point.",
            "Curve approximation by G1 arc splines with a limited number of types of curvature and length.",
            "Computational design methods for cylindrical and axisymmetric waterbomb tessellations.",
            "Multi-resolution 3D CNN for learning multi-scale spatial features in CAD models.",
            "Affine invariant triangulations.",
            "Editorial - Special issue of the SIAM Conference on Computational Geometric Design (GD 2021).",
            "Computing projective equivalences of planar curves birationally equivalent to elliptic and hyperelliptic curves.",
            "Planar projections of spatial Pythagorean-hodograph curves."
        ]
    },
    {
        "name": "CAGD",
        "year": "2020",
        "info": "2020: Volumes\n76,\n77,\n78,\n79,\n80,\n81,\n82,\n83",
        "count": 93,
        "papers": [
            "Multi-degree B-splines: Algorithmic computation and properties.",
            "Rational motions with generic trajectories of low degree.",
            "Approximate symmetries of planar algebraic curves with inexact input.",
            "An h-adaptive meshfree-enriched finite element method based on convex approximations for the three-dimensional ductile crack propagation simulation.",
            "Construction of periodic adapted orthonormal frames on closed space curves.",
            "Linear dependence of bivariate Minimal Support and Locally Refined B-splines over LR-meshes.",
            "Polyhedral finite elements for nonlinear solid mechanics using tetrahedral subdivisions and dual-cell aggregation.",
            "On the application of polygonal finite element method for Stokes flow - A comparison between equal order and different order approximation.",
            "Another map from P7 to the Study quadric.",
            "Implicit progressive-iterative approximation for curve and surface reconstruction.",
            "Special issue on \"Generalized Barycentric Coordinates\".",
            "Geometric optimization using nonlinear rotation-invariant coordinates.",
            "Surface reconstruction via cooperative evolutions.",
            "Conversion of B-rep CAD models into globally G1 triangular splines.",
            "Geometrically smooth spline bases for data fitting and simulation.",
            "An approach to construct a three-dimensional isogeometric model from μ-CT scan data with an application to the bridge of a violin.",
            "How to make impossible objects possible: Anamorphic deformation of textured NURBS.",
            "A new selection scheme for spatial Pythagorean hodograph quintic Hermite interpolants.",
            "Multi-sided Bézier surfaces over curved, multi-connected domains.",
            "Computing the topology of a plane or space hyperelliptic curve.",
            "Mapping rational rotation-minimizing frames from polynomial curves on to rational curves.",
            "Argyris type quasi-interpolation of optimal approximation order.",
            "CSIOR: Circle-Surface Intersection Ordered Resampling.",
            "Interpolation of G1 Hermite data by C1 cubic-like sparse Pythagorean hodograph splines.",
            "Spline surfaces with C1 quintic PH isoparametric curves.",
            "Isogeometric analysis for trimmed CAD surfaces using multi-sided toric surface patches.",
            "Robustly computing restricted Voronoi diagrams (RVD) on thin-plate models.",
            "h-Bernstein basis functions over a triangular domain.",
            "Ambiguous tiling.",
            "Simultaneous interior and boundary optimization of volumetric domain parameterizations for IGA.",
            "Robust atlas generation via angle-based segmentation.",
            "Pose to Seat: Automated design of body-supporting surfaces.",
            "Structure-aware shape correspondence network for 3D shape synthesis.",
            "Numerical roadmap of smooth bounded real algebraic surface.",
            "LRC-Net: Learning discriminative features on point clouds by encoding local region contexts.",
            "Iterative coordinates.",
            "As-developable-as-possible B-spline surface interpolation to B-spline curves.",
            "Laplacian-optimized diffusion for semi-supervised learning.",
            "Four-bar linkages, elliptic functions, and flexible polyhedra.",
            "Persistent manifolds of the special Euclidean group SE(3): A review.",
            "Algebraic and geometric characterizations of a class of planar quartic curves with rational offsets.",
            "Euclidean offset and bisector approximations of curves over freeform surfaces.",
            "Controlling extremal Pythagorean hodograph curves by Gauss-Legendre polygons.",
            "Skeletonization via dual of shape segmentation.",
            "Example-driven modeling of portrait bas-relief.",
            "EasyMesh: An efficient method to reconstruct 3D mesh from a single image.",
            "Local (T)HB-spline projectors via restricted hierarchical spline fitting.",
            "Classification of planar Pythagorean hodograph curves.",
            "Interpolatory Catmull-Clark volumetric subdivision over unstructured hexahedral meshes for modeling and simulation applications.",
            "Spatial Pythagorean-Hodograph B-Spline curves and 3D point data interpolation.",
            "NLIGA: A MATLAB framework for nonlinear isogeometric analysis.",
            "Spherical interpolatory geometric subdivision schemes.",
            "P2MAT-NET: Learning medial axis transform from sparse point clouds.",
            "Variational shape approximation of point set surfaces.",
            "Reverse engineering of CAD models via clustering and approximate implicitization.",
            "Refinable tri-variate C1 splines for box-complexes including irregular points and irregular edges.",
            "Construction of Minkowski Pythagorean hodograph B-spline curves.",
            "An input-independent single pass algorithm for reconstruction from dot patterns and boundary samples.",
            "Dimension of polynomial splines of mixed smoothness on T-meshes.",
            "Isogeometric shape optimization of an acoustic horn using the teaching-learning-based optimization (TLBO) algorithm.",
            "An optimized yarn-level geometric model for Finite Element Analysis of weft-knitted fabrics.",
            "Optimal parametric interpolants of circular arcs.",
            "A trivariate T-spline based framework for modeling heterogeneous solids.",
            "Consistent dynamic map labeling with fairness and importance.",
            "Quasi-elastic cubic splines in Rd.",
            "Evaluation and subdivision algorithms for general classes of totally positive rational bases.",
            "3D grasp saliency analysis via deep shape correspondence.",
            "Osculating conic biarcs.",
            "Recognizing algebraic affine rotation surfaces.",
            "Adaptive IGAFEM with optimal convergence rates: T-splines.",
            "Local computation of homology variations over a construction process.",
            "Smooth polar caps for locally quad-dominant meshes.",
            "Tetrahedral mesh deformation with positional constraints.",
            "Non-rigid 3D shape retrieval based on multi-scale graphical image and joint Bayesian.",
            "Fitting a planar quadratic slerp motion.",
            "From theoretical to applied geometry - recent developments.",
            "Dynamic spline bas-relief modeling with isogeometric collocation method.",
            "An efficient method to integrate polynomials over polytopes and curved solids.",
            "Shape analysis of planar PH curves with the Gauss-Legendre control polygons.",
            "Multi-stage point completion network with critical set supervision.",
            "Extending Ball B-spline by B-spline.",
            "The distance function from a real algebraic variety.",
            "SP-Flow: Self-supervised optical flow correspondence point prediction for real-time SLAM.",
            "Visibility-driven skeleton extraction from unstructured points.",
            "Singular cases of planar and spatial C1 Hermite interpolation problems based on quintic Pythagorean-hodograph curves.",
            "On a progressive and iterative approximation method with memory for least square fitting.",
            "Inflection points on 3D curves.",
            "A few conjectures on a four-point interpolatory subdivision scheme.",
            "Low degree splines for locally quad-dominant meshes.",
            "Handling heterogeneous structures and materials using blending schemes in V-reps.",
            "Real-World Textured Things: A repository of textured models generated with modern photo-reconstruction tools.",
            "Characterizing envelopes of moving rotational cones and applications in CNC machining.",
            "Kinematic interpretation of Darboux cyclides."
        ]
    },
    {
        "name": "CAGD",
        "year": "2019",
        "info": "2019: Volumes\n68,\n69,\n70,\n71,\n72,\n73,\n74,\n75",
        "count": 65,
        "papers": [
            "A geometric view of optimal transportation and generative model.",
            "An in depth analysis, via resultants, of the singularities of a parametric curve.",
            "On Lototsky-Bernstein operators and Lototsky-Bernstein bases.",
            "A note on spectral properties of Hermite subdivision operators.",
            "μ-Bases for rational canal surfaces.",
            "A merged tuning of binary and ternary Loop's subdivision.",
            "C1 analysis of some 2D subdivision schemes refining point-normal pairs with the circle average.",
            "An isogeometric C1 subspace on unstructured multi-patch planar domains.",
            "Implicitizing rational surfaces without base points by moving planes and moving quadrics.",
            "The space of C1-smooth isogeometric spline functions on trilinearly parameterized volumetric two-patch domains.",
            "Consistent segment-wise matching with multi-layer graphs.",
            "A fast numerical solver for local barycentric coordinates.",
            "Volumetric untrimming: Precise decomposition of trimmed trivariates into tensor products.",
            "Q-MAT+: An error-controllable and feature-sensitive simplification algorithm for medial axis transform.",
            "On initialization of milling paths for 5-axis flank CNC machining of free-form surfaces with general milling tools.",
            "Surface reconstruction by parallel and unified particle-based resampling from point clouds.",
            "Quantitative and flexible 3D shape dataset augmentation via latent space embedding and deformation learning.",
            "A bivariate C1 subdivision scheme based on cubic half-box splines.",
            "Numerical polynomial reparametrization of rational curves.",
            "Arc fibrations of planar domains.",
            "High order smoothness of non-linear Lane-Riesenfeld algorithms in the functional setting.",
            "Consistently fitting orthopedic casts.",
            "Non-rigid registration under anisotropic deformations.",
            "Point cloud surface segmentation based on volumetric eigenfunctions of the Laplace-Beltrami operator.",
            "A new area-based convexity measure with distance weighted area integration for planar shapes.",
            "A novel anisotropic second order regularization for mesh denoising.",
            "Solving higher order PDEs with isogeometric analysis on implicit domains using weighted extended THB-splines.",
            "Hierarchical fragmented image reassembly using a bundle-of-superpixel representation.",
            "Human body shape reconstruction from binary silhouette images.",
            "Localized G-splines for quad & T-gon meshes.",
            "Label transfer between images and 3D shapes via local correspondence encoding.",
            "A NURBS-based finite cell method for structural topology optimization under geometric constraints.",
            "EdgeNet: Deep metric learning for 3D shapes.",
            "Classification of the relative positions between a small ellipsoid and an elliptic paraboloid.",
            "Discrete Lie flow: A measure controllable parameterization method.",
            "Second order spiral splines.",
            "Preventing self-intersection with cycle regularization in neural networks for mesh reconstruction from a single RGB image.",
            "Circle reproduction with interpolatory curves at local maximal curvature points.",
            "Learning diffusion on global graph: A PDE-directed approach for feature detection on geometric shapes.",
            "Holes and dependences in an ordered complex.",
            "Deformation of spatial septic Pythagorean hodograph curves using Gauss-Legendre polygon.",
            "Special Issue of the 13th International Conference on Geometric Modeling and Processing (GMP 2019).",
            "Modified PHT-splines.",
            "Knot calculation for spline fitting based on the unimodality property.",
            "Adaptive representation of dynamic 3D meshes for low-latency applications.",
            "Implicit representations of high-codimension varieties.",
            "Offset hypersurfaces and persistent homology of algebraic varieties.",
            "Representing rational curve segments and surface patches using semi-algebraic sets.",
            "Gauss-Lobatto polygon of Pythagorean hodograph curves.",
            "Colour interpolants for polygonal gradient meshes.",
            "Deep learning-based 3D local feature descriptor from Mercator projections.",
            "Stochastic isogeometric analysis method for plate structures with random uncertainty.",
            "Positive and smooth Gordon-Wixom coordinates.",
            "Construction of rational curves with rational arc lengths by direct integration.",
            "Enumerating the morphologies of non-degenerate Darboux cyclides.",
            "Coarse-to-fine segmentation for indoor scenes with progressive supervision.",
            "Polynomial splines of non-uniform degree on triangulations: Combinatorial bounds on the dimension.",
            "A Cox-de Boor-type recurrence relation for C1 multi-degree splines.",
            "Control of lines of curvature for plate forming in shipbuilding.",
            "Mixed honeycomb pushing refinement.",
            "Fault and gradient fault detection and reconstruction from scattered data.",
            "The cubic de Casteljau construction and Riemannian cubics.",
            "Efficient L0 resampling of point sets.",
            "Optimization for statistical tolerance allocation.",
            "A 2-norm condition number for Bézier curve intersection."
        ]
    },
    {
        "name": "CAGD",
        "year": "2018",
        "info": "2018: Volumes\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67",
        "count": 76,
        "papers": [
            "Feature-preserving, mesh-free empirical mode decomposition for point clouds and its applications.",
            "Numerically robust computation of circular visibility.",
            "Curvature based sampling of curves and surfaces.",
            "Robust generation of constrained B-spline curves based on automatic differentiation and fairness optimization.",
            "Symmetries of canal surfaces and Dupin cyclides.",
            "Design and motion analysis of axisymmetric 3D origami with generic six-crease bases.",
            "Implicitizing ruled translational surfaces.",
            "Cissoid constructions of augmented rational ruled surfaces.",
            "Symmetric four-directional bivariate pseudo-spline symbols.",
            "Hermite mean value interpolation on polygons.",
            "Log-aesthetic curves as similarity geometric analogue of Euler's elasticae.",
            "Counter examples of \"Class A Bézier curves\".",
            "Auxetic deformations and elliptic curves.",
            "Improvement on constrained multi-degree reduction of Bézier surfaces using Jacobi polynomials.",
            "Special Issue on the 12th International Conference on Geometric Modeling and Processing (GMP 2018).",
            "Quadrangulation of non-rigid objects using deformation metrics.",
            "Rolling normal filtering for point clouds.",
            "Computing IGA-suitable planar parameterizations by PolySquare-enhanced domain partition.",
            "Simploidal sets: A data structure for handling simploidal Bézier spaces.",
            "Generating hybrid interior structure for 3D printing.",
            "Advancing mesh completion for digital modeling and manufacturing.",
            "Fast and robust Hausdorff distance computation from triangle mesh to quad mesh in near-zero cases.",
            "Learnt knot placement in B-spline curve approximation using support vector machines.",
            "P-Bézier and P-Bspline curves - new representations with proximity control.",
            "Accelerated robust Boolean operations based on hybrid representations.",
            "Exact conversion from Bézier tetrahedra to Bézier hexahedra.",
            "Multisided generalisations of Gregory patches.",
            "Designing interactively with elastic splines.",
            "Jointly learning shape descriptors and their correspondence via deep triplet CNNs.",
            "Accurate geometry modeling of vasculatures using implicit fitting with 2D radial basis functions.",
            "Crossing knot lines in composition of freeform B-spline geometry.",
            "Folding cartons: Interactive manipulation of cartons from 2D layouts.",
            "Adaptive fitting with THB-splines: Error analysis and industrial applications.",
            "Orientation field guided line abstraction for 3D printing.",
            "Learning localized features in 3D CAD models for manufacturability analysis of drilled holes.",
            "Function representation based slicer for 3D printing.",
            "Isogeometric analysis with strong multipatch C1-coupling.",
            "Low-rank parameterization of planar domains for isogeometric analysis.",
            "Stress-aware large-scale mesh editing using a domain-decomposed multigrid solver.",
            "High order approximation to non-smooth multivariate functions.",
            "Interpolation of circular arcs by parametric polynomials of maximal geometric smoothness.",
            "C2 continuous time-dependent feedrate scheduling with configurable kinematic constraints.",
            "Conformal mesh parameterization using discrete Calabi flow.",
            "Support function at inflection points of planar curves.",
            "Operation mode analysis of 3-RPS parallel manipulators based on their design parameters.",
            "Bézier motions with end-constraints on speed.",
            "Functional data approximation on bounded domains using polygonal finite elements.",
            "Rational offsets of regular quadrics revisited.",
            "Kinematic generation of Darboux cyclides.",
            "Reconstructing non-rigid object with large movement using a single depth camera.",
            "A new variant of Lane-Riesenfeld algorithm with two tension parameters.",
            "Spline surface fitting using normal data and norm-like functions.",
            "Rational fractal surface interpolating scheme with variable parameters.",
            "Directional density measure to intrinsically estimate and counteract non-uniformity in point clouds.",
            "New algorithm to find isoptic surfaces of polyhedral meshes.",
            "Contour curves and isophotes on rational ruled surfaces.",
            "Topology-driven shape chartification.",
            "New progress in geometry for applications.",
            "Laplacian spectral basis functions.",
            "Elliptic grid generation techniques in the framework of isogeometric analysis applications.",
            "Simplex-splines on the Clough-Tocher element.",
            "C1 and C2 interpolation of orientation data along spatial Pythagorean-hodograph curves using rational adapted spline frames.",
            "Convergence and smoothness of tensor-product of two non-uniform linear subdivision schemes.",
            "The Fuss formulas in the Poncelet porism.",
            "Analysis and construction of rational curve parametrizations with non-ordinary singularities.",
            "Path planning with divergence-based distance functions.",
            "A note on zeros of univariate scalar Bernstein polynomials.",
            "In memoriam Wolfgang Boehm.",
            "p-Laplace diffusion for distance function estimation, optimal transport approximation, and image enhancement.",
            "G1 motion interpolation using cubic PH biarcs with prescribed length.",
            "Video despeckling using Shearlet tensor-based anisotropic diffusion.",
            "Three recipes for quasi-interpolation with cubic Powell-Sabin splines.",
            "Constraints for geodesic network interpolation at a vertex.",
            "G1 Bézier surface interpolation with T-junctions at a 3-valent singular vertex.",
            "Special issue on \"Heat Diffusion Equation and Optimal Transport in Geometry Processing and Computer Graphics\".",
            "Practical shape analysis and segmentation methods for point cloud models."
        ]
    },
    {
        "name": "CAGD",
        "year": "2017",
        "info": "2017: Volumes\n50,\n51,\n52-53,\n54,\n55,\n56,\n57,\n58",
        "count": 50,
        "papers": [
            "Robust 3D face modeling and reconstruction from frontal and side images.",
            "Surface reconstruction using simplex splines on feature-sensitive configurations.",
            "The monotonicity of a family of barycentric coordinates for quadrilaterals.",
            "Diagrammatic approach for constructing multiresolution of primal subdivisions.",
            "Hermite interpolation by piecewise polynomial surfaces with polynomial area element.",
            "Towards optimal advection using stretch-maximizing stream surfaces.",
            "Dense packing of congruent circles in free-form non-convex containers.",
            "An algebraic framework for computing the topology of offsets to rational curves.",
            "Algorithms for computing strong μ-bases for rational tensor product surfaces.",
            "Optimal base complexes for quadrilateral meshes.",
            "Dimension and basis construction for analysis-suitable G1 two-patch parameterizations.",
            "Adaptive scattered data fitting by extension of local approximations to hierarchical splines.",
            "G1-smooth splines on quad meshes with 4-split macro-patch elements.",
            "Discretizing Wachspress kernels is safe.",
            "Implicit surface reconstruction with total variation regularization.",
            "Phase-field guided surface reconstruction based on implicit hierarchical B-splines.",
            "Convergence rates for solving elliptic boundary value problems with singular parameterizations in isogeometric analysis.",
            "Rapid B-rep model preprocessing for immersogeometric analysis using analytic surfaces.",
            "Blended barycentric coordinates.",
            "Rapid blending of closed curves based on curvature flow.",
            "A primitive-based 3D segmentation algorithm for mechanical CAD models.",
            "Sliver-suppressing tetrahedral mesh optimization with gradient-based shape matching energy.",
            "Discrete geodesic graph (DGG) for computing geodesic distances on polyhedral surfaces.",
            "By example synthesis of three-dimensional porous materials.",
            "Compressed vibration modes of elastic bodies.",
            "Smooth interpolation of key frames in a Riemannian shell space.",
            "Rectifying control polygon for planar Pythagorean hodograph curves.",
            "Canal surfaces as Bézier curves using mass points.",
            "New algebraic conditions for the identification of the relative position of two coplanar ellipses.",
            "Robust mesh denoising via vertex pre-filtering and L1-median normal filtering.",
            "Refinable G1 functions on G1 free-form surfaces.",
            "Algebraic and algorithmic aspects of radical parametrizations.",
            "Bézier developable surfaces.",
            "Semialgebraic splines.",
            "Low rank interpolation of boundary spline curves.",
            "Enhancement of a multi-sided Bézier surface representation.",
            "Sparse Pythagorean hodograph curves.",
            "Cubic spline approximation of a circle with maximal smoothness and accuracy.",
            "Helical polynomial curves interpolating G1 data with prescribed axes and pitch angles.",
            "Interpolation with spatial rational Pythagorean-hodograph curves of class 4.",
            "Visualization and analysis of regions of monotonic curvature for interpolating segments of extended sectrices of Maclaurin.",
            "Piecewise rational approximation of square-root parameterizable curves using the Weierstrass form.",
            "Hermite parametric surface interpolation based on Argyris element.",
            "Construction and analysis of cubic Powell-Sabin B-splines.",
            "Mesh-based and meshless design and approximation of scalar functions.",
            "Affine geometry of equal-volume polygons in 3-space.",
            "Planar Pythagorean-Hodograph B-Spline curves.",
            "Extraction of tori from minimal point sets.",
            "On multi-degree splines.",
            "A discrete surface theory."
        ]
    },
    {
        "name": "CAGD",
        "year": "2016",
        "info": "2016: Volumes\n41,\n42,\n43,\n44,\n45,\n46,\n47,\n48,\n49",
        "count": 79,
        "papers": [
            "The rational motion of minimal dual quaternion degree with prescribed trajectory.",
            "Minimal bi-6 G2 completion of bicubic spline surfaces.",
            "Surface inpainting with sparsity constraints.",
            "Uniform approximation of a circle by a parametric polynomial curve.",
            "Characterization of bivariate hierarchical quartic box splines on a three-directional grid.",
            "Explicit μ-bases for conic sections and planar rational cubic curves.",
            "On the dimension of spline spaces over T-meshes with smoothing cofactor-conformality method.",
            "Pyramid algorithms for barycentric rational interpolation.",
            "G1 interpolation by rational cubic PH curves in R3.",
            "Constrained multi-degree reduction with respect to Jacobi norms.",
            "Two additional advantages of complex μ-bases for non-ruled real quadric surfaces.",
            "On the monotonicity of generalized barycentric coordinates on convex polygons.",
            "Matrix weighted rational curves and surfaces.",
            "Preface.",
            "Surface fitting with cyclide splines.",
            "Revisiting the problem of zeros of univariate scalar Béziers.",
            "Biomechanics simulations using cubic Hermite meshes with extraordinary nodes for isogeometric cardiac modeling.",
            "Unsupervised 3D shape segmentation and co-segmentation via deep learning.",
            "Coupling time-varying modal analysis and FEM for real-time cutting simulation of objects with multi-material sub-domains.",
            "Kernel-based adaptive sampling for image reconstruction and meshing.",
            "Cluttered indoor scene modeling via functional part-guided graph matching.",
            "Novel and efficient computation of Hilbert-Huang transform on surfaces.",
            "On constructing RAGS via homogeneous splines.",
            "Refinable C1 spline elements for irregular quad layout.",
            "Efficient Voronoi diagram construction for planar freeform spiral curves.",
            "Direct immersogeometric fluid flow analysis using B-rep CAD models.",
            "Volumetric shape contexts for mesh co-segmentation.",
            "Subdividing barycentric coordinates.",
            "Tetrahedral meshing via maximal Poisson-disk sampling.",
            "Convergence of barycentric coordinates to barycentric kernels.",
            "Low-latency compression of mocap data using learned spatial decorrelation transform.",
            "Make it swing: Fabricating personalized roly-poly toys.",
            "Birational 2D Free-Form Deformation of degree 1 × n.",
            "Repeated local operations for m-ary 2N-point Dubuc-Deslauriers subdivision schemes.",
            "On pseudo-harmonic barycentric coordinates.",
            "Smooth bivariate shape-preserving cubic spline approximation.",
            "Multivariate Splines and Algebraic Geometry.",
            "Multivariate splines and the Bernstein-Bézier form of a polynomial.",
            "Algebraic methods in approximation theory.",
            "Splines in geometry and topology.",
            "Polynomial finite element method for domains enclosed by piecewise conics.",
            "Interpolation properties of C1 quadratic splines on hexagonal cells.",
            "On recursive refinement of convex polygons.",
            "Completeness of generating systems for quadratic splines on adaptively refined criss-cross triangulations.",
            "Dimension and bases for geometrically continuous splines on surfaces of arbitrary topology.",
            "On regularity of generalized Hermite interpolation.",
            "Dimension of trivariate C1 splines on bipyramid cells.",
            "On the dimension of Tchebycheffian spline spaces over planar T-meshes.",
            "Reconstruction of helices from their orthogonal projection.",
            "On degree elevation of T-splines.",
            "Anamorphic Free-Form Deformation.",
            "On a generalization of Bernstein polynomials and Bézier curves based on umbral calculus (III): Blossoming.",
            "Construction of G1 planar Hermite interpolants with prescribed arc lengths.",
            "Area-preserving mesh parameterization for poly-annulus surfaces based on optimal mass transportation.",
            "Medial axis transforms yielding rational envelopes.",
            "High quality local interpolation by composite parametric surfaces.",
            "Computing μ-bases from algebraic ruled surfaces.",
            "New Developments in Geometry - Theory and Applications.",
            "Design with Quasi Extended Chebyshev piecewise spaces.",
            "Generalized quantum splines.",
            "Isoptic surfaces of polyhedra.",
            "Unstructured spline spaces for isogeometric analysis based on spline manifolds.",
            "Complexity of hierarchical refinement for a class of admissible mesh configurations.",
            "Analysis-suitable G1 multi-patch parametrizations for C1 isogeometric spaces.",
            "Efficient computation of dual space and directional multiplicity of an isolated point.",
            "Algorithms for detecting dependencies and rigid subsystems for CAD.",
            "Quaternionic approach to equiform kinematics and line-elements of Euclidean 4-space and 3-space.",
            "Closed form inverse kinematics solution for a redundant anthropomorphic robot arm.",
            "A quaternion approach to polynomial PN surfaces.",
            "Algebro-geometric analysis of bisectors of two algebraic plane curves.",
            "A line/trimmed NURBS surface intersection algorithm using matrix representations.",
            "Converting a CAD model into a non-uniform subdivision surface.",
            "A weighted binary average of point-normal pairs with application to subdivision schemes.",
            "Sparse RBF surface representations.",
            "Greville abscissae of totally positive bases.",
            "Smooth surface interpolation using patches with rational offsets.",
            "Quartic splines on Powell-Sabin triangulations.",
            "Curvature sensitive analysis of axially compressed cylindrical tubes with corrugated surface using isogeometric analysis and experiment.",
            "Automatic extraction of generic focal features on 3D shapes via random forest regression analysis of geodesics-in-heat."
        ]
    },
    {
        "name": "CAGD",
        "year": "2015",
        "info": "2015: Volumes:\n32,\n33,\n34,\n35-36,\n37,\n38,\n39,\n40",
        "count": 59,
        "papers": [
            "Birational quadrilateral maps.",
            "Subdivision surface fitting to a dense mesh using ridges and umbilics.",
            "A Chaikin-based variant of Lane-Riesenfeld algorithm and its non-tensor product extension.",
            "Strata of rational space curves.",
            "On the maximum angle condition for the conforming longest-edge n-section algorithm for large values of n.",
            "Rational swept surface constructions based on differential and integral sweep curve properties.",
            "Biquintic G2 surfaces via functionals.",
            "Reconstruction of free-form space curves using NURBS-snakes and a quadratic programming approach.",
            "The inverse of a rational bilinear mapping.",
            "Symmetry detection of rational space curves from their curvature and torsion.",
            "Constructing B-spline representation of quadratic Sibson-Thomson splines.",
            "Arc lengths of rational Pythagorean-hodograph curves.",
            "A normalized basis for condensed C1 Powell-Sabin-12 splines.",
            "Identification and \"reverse engineering\" of Pythagorean-hodograph curves.",
            "Scattered data interpolation with nonnegative preservation using bivariate splines and its application.",
            "Analysis-suitable adaptive T-mesh refinement with linear complexity.",
            "Matched Gk-constructions always yield Ck-continuous isogeometric elements.",
            "Geometric modeling and processing 2015.",
            "Denoising point sets via L0 minimization.",
            "Efficient Sparse ICP.",
            "Low-order reconstruction operators on polyhedral meshes: application to compatible discrete operator schemes.",
            "Poisson-driven seamless completion of triangular meshes.",
            "HIRM: A handle-independent reduced model for incremental mesh editing.",
            "GPU-based smooth free-form deformation with sharp feature awareness.",
            "Spectral pose transfer.",
            "Planar domain parameterization with THB-splines.",
            "Constructing B-spline solids from tetrahedral meshes for isogeometric analysis.",
            "Nitsche method for isogeometric analysis of Reissner-Mindlin plate with non-conforming multi-patches.",
            "Printing 3D objects with interlocking parts.",
            "Medial axis tree - an internal supporting structure for 3D printing.",
            "Agile structural analysis for fabrication-aware shape editing.",
            "Hybrid volume completion with higher-order Bézier elements.",
            "Iterative 3D shape classification by online metric learning.",
            "Multi-scale mesh saliency based on low-rank and sparse analysis in shape feature space.",
            "High-quality topological structure extraction of volumetric data on C2-continuous framework.",
            "On extraordinary rules of quad-based interpolatory subdivision schemes.",
            "Smooth bijective maps between arbitrary planar polygons.",
            "G1 continuity between toric surface patches.",
            "Convergence of univariate non-stationary subdivision schemes via asymptotic similarity.",
            "A hierarchical construction of LR meshes in 2D.",
            "Watertight conversion of trimmed CAD surfaces to Clough-Tocher splines.",
            "A new B-spline representation for cubic splines over Powell-Sabin triangulations.",
            "Complex μ-bases for real quadric surfaces.",
            "Reduced curvature formulae for surfaces, offset surfaces, curves on a surface and surface intersections.",
            "Univariate subdivision schemes for noisy data with geometric applications.",
            "Bicubic hierarchical B-splines: Dimensions, completeness, and bases.",
            "A geometric method for computation of geodesic on parametric surfaces.",
            "The limit of a family of barycentric coordinates for quadrilaterals.",
            "A rational cubic clipping method for computing real roots of a polynomial.",
            "Sphere intersection 3D shape descriptor (SID).",
            "On a generalization of Bernstein polynomials and Bézier curves based on umbral calculus (II): de Casteljau algorithm.",
            "Characterization of analysis-suitable T-splines.",
            "A 3D shape descriptor based on spectral analysis of medial axis.",
            "Localized discrete Laplace-Beltrami operator over triangular mesh.",
            "Optimal decomposition and recombination of isostatic geometric constraint systems for designing layered materials.",
            "Curve network interpolation by C1 quadratic B-spline surfaces.",
            "Control point based exact description of curves and surfaces, in extended Chebyshev spaces.",
            "On shape-preserving capability of cubic L1 spline fits.",
            "Detection of critical points of multivariate piecewise polynomial systems."
        ]
    },
    {
        "name": "CAGD",
        "year": "2014",
        "info": "Volume 31, 2014",
        "count": 54,
        "papers": [
            "Smooth surfaces from rational bilinear patches.",
            "Inverse kinematics for optimal tool orientation control in 5-axis CNC machining.",
            "Rotation-minimizing osculating frames.",
            "Dual representation of spatial rational Pythagorean-hodograph curves.",
            "A new four-point shape-preserving C3 subdivision scheme.",
            "Construction of several second- and fourth-order geometric partial differential equations for space curves.",
            "Asymptotes and perfect curves.",
            "RAGS: Rational geometric splines for surfaces of arbitrary topology.",
            "Spline-based meshfree method with extended basis.",
            "Construction of G2 rounded corners with Pythagorean-hodograph curves.",
            "Refinability of splines derived from regular tessellations.",
            "A basis for the implicit representation of planar rational cubic Bézier curves.",
            "Role of moving planes and moving spheres following Dupin cyclides.",
            "Bounding and estimating the Hausdorff distance between real space algebraic curves.",
            "Detecting symmetries of rational plane and space curves.",
            "Optimal arc spline approximation.",
            "On a generalization of Bernstein polynomials and Bézier curves based on umbral calculus.",
            "Optimizing at the end-points the Akima's interpolation method of smooth curve fitting.",
            "C-shaped G2 Hermite interpolation by rational cubic Bézier curve with conic precision.",
            "An improvement on the upper bounds of the magnitudes of derivatives of rational triangular Bézier surfaces.",
            "Corrigendum to Example 4 in \"μ-Bases for complex rational curves\" [Computer Aided Geometric Design 30 (2013), 623-635].",
            "Reducing complexity in polygonal meshes with view-based saliency.",
            "Local and global analysis of parametric solid sweeps.",
            "A structure-preserving matrix method for the deconvolution of two Bernstein basis polynomials.",
            "Recent trends in theoretical and applied geometry.",
            "Affine arc length polylines and curvature continuous uniform B-splines.",
            "Asymptotic behavior of an implicit algebraic plane curve.",
            "Identifying and approximating monotonous segments of algebraic curves using support function representation.",
            "Classical curve theory in normed planes.",
            "A fully data-dependent criterion for free angles selection in spatial PH cubic biarc Hermite interpolation.",
            "C2 Hermite interpolation by Pythagorean-hodograph quintic triarcs.",
            "C1 interpolation by rational biarcs with rational rotation minimizing directed frames.",
            "Transition to canonical principal parameters on minimal surfaces.",
            "Surfaces with Pythagorean normals along rational curves.",
            "A Hermite interpolatory subdivision scheme for C2-quintics on the Powell-Sabin 12-split.",
            "General triangular midpoint subdivision.",
            "Conversion of trimmed NURBS surfaces to Catmull-Clark subdivision surfaces.",
            "KSpheres - an efficient algorithm for joining skinning surfaces.",
            "Approximation with diversified B-splines.",
            "Spline multiresolution and wavelet-like decompositions.",
            "TDHB-splines: The truncated decoupled basis of hierarchical tensor-product splines.",
            "Adaptively refined multilevel spline spaces from generating systems.",
            "Derivatives of isogeometric functions on n-dimensional rational patches in Rd.",
            "On Stewart Gough manipulators with multidimensional self-motions.",
            "Overconstrained mechanisms based on planar four-bar-mechanisms.",
            "Guaranteed collision detection with toleranced motions.",
            "Ribbon-based transfinite surfaces.",
            "Using moving planes to implicitize rational surfaces generated from a planar curve and a space curve.",
            "Isotopic equivalence by Bézier curve subdivision for application to high performance computing.",
            "A biarc based subdivision scheme for space curve interpolation.",
            "Bivariate S-λ bases and S-λ surface patches.",
            "Planar C1 Hermite interpolation with PH cuts of degree (1, 3) of Laurent series.",
            "Geometric Hermite interpolation by logarithmic arc splines.",
            "Differential geometry of non-transversal intersection curves of three parametric hypersurfaces in Euclidean 4-space."
        ]
    },
    {
        "name": "CAGD",
        "year": "2013",
        "info": "Volume 30, 2013",
        "count": 59,
        "papers": [
            "Recent advances in applied geometry.",
            "Multivariate normalized Powell-Sabin B-splines and quasi-interpolants.",
            "Dimension of spline spaces with highest order smoothness over hierarchical T-meshes.",
            "Conchoid surfaces of spheres.",
            "Cubic subdivision schemes with double knots.",
            "Planar C1 Hermite interpolation with uniform and non-uniform TC-biarcs.",
            "Isoptics of Bézier curves.",
            "A class of generalized B-spline curves.",
            "Using implicit equations of parametric curves and surfaces without computing them: Polynomial algebra by values.",
            "Reducibility of offsets to algebraic curves.",
            "On the approximation order of a space data-dependent PH quintic Hermite interpolation scheme.",
            "C1 rational interpolation of spherical motions with rational rotation-minimizing directed frames.",
            "A new bound on the magnitude of the derivative of rational Bézier curve.",
            "Topological classification of non-degenerate intersections of two ring tori.",
            "Gelfond-Bézier curves.",
            "Optimal tool orientation control for 5-axis CNC milling with ball-end cutters.",
            "A Müntz type theorem for a family of corner cutting schemes.",
            "On derivative bounds for the rational quadratic Bézier paths.",
            "Most Cited Paper Award.",
            "Splines on spherical triangulations with hanging vertices.",
            "wFEM heat kernel: Discretization and applications to shape analysis and retrieval.",
            "Rational splines for Hermite interpolation with shape constraints.",
            "Biarcs and bilens.",
            "Polynomial splines over locally refined box-partitions.",
            "Non-uniform non-tensor product local interpolatory subdivision surfaces.",
            "First steps towards radical parametrization of algebraic surfaces.",
            "An explicit formula for the control points of periodic uniform spline interpolants and its application.",
            "Generalized Lane-Riesenfeld algorithms.",
            "Resultant matrices and the computation of the degree of an approximate greatest common divisor of two inexact Bernstein basis polynomials.",
            "Practical distribution-sensitive point location in triangulations.",
            "Extremum problems for eigenvalues of discrete Laplace operators.",
            "Constructive G1 connection of multiple freeform pipes in arbitrary poses.",
            "Smooth surfaces from bilinear patches: Discrete affine minimal surfaces.",
            "Floating tangents for approximating spatial curves with G1 piecewise helices.",
            "Interactive comparison of multifield scalar data based on largest contours.",
            "Morse connection graphs for piecewise constant vector fields on surfaces.",
            "Accurate analysis of angiograms based on 3D vector field topology.",
            "Morse-Smale decomposition of multivariate transfer function space for separably-sampled volume rendering.",
            "Topology analysis of time-dependent multi-fluid data using the Reeb graph.",
            "Topological flow volume extraction from time-surface maps.",
            "Robust computation of Morse-Smale complexes of bilinear functions.",
            "Multi-region Delaunay complex segmentation.",
            "Ridge-Valley graphs: Combinatorial ridge detection using Jacobi sets.",
            "Critical sets in discrete Morse theories: Relating Forman and piecewise-linear approaches.",
            "μ-Bases for complex rational curves.",
            "Improving angular speed uniformity by reparameterization.",
            "Rotation-minimizing Euler-Rodrigues rigid-body motion interpolants.",
            "On the norms of the Dubuc-Deslauriers subdivision schemes.",
            "Computing the topology of a real algebraic plane curve whose defining equations are available only \"by values\".",
            "Curve design with more general planar Pythagorean-hodograph quintic spiral segments.",
            "De Casteljau's algorithm on manifolds.",
            "Splines and unsorted knot sequences.",
            "A partial solution to the problem of proper reparametrization for rational surfaces.",
            "Exact Voronoi diagram of smooth convex pseudo-circles: General predicates, and implementation for ellipses.",
            "Some properties of LR-splines.",
            "A second order geometric method for ray/parametric surface intersection.",
            "Geometric multiscale decompositions of dynamic low-rank matrices.",
            "Modified T-splines.",
            "Uniform interpolation curves and surfaces based on a family of symmetric splines."
        ]
    },
    {
        "name": "CAGD",
        "year": "2012",
        "info": "Volume 29, 2012",
        "count": 55,
        "papers": [
            "Editorial message.",
            "Feature-based 3D morphing based on geometrically constrained spherical parameterization.",
            "Polytope-based computation of polynomial ranges.",
            "Constraint-based LN curves.",
            "Extending and correcting some research results on minimal and harmonic surfaces.",
            "Bernstein Bezoutians and application to intersection problems.",
            "On linear independence of T-spline blending functions.",
            "Darboux cyclides and webs from circles.",
            "Intersection curves of hypersurfaces in R4.",
            "Exponential splines and minimal-support bases for curve representation.",
            "Analytic parametric equations of log-aesthetic curves in terms of incomplete gamma functions.",
            "Least eccentric ellipses for geometric Hermite interpolation.",
            "L-system specification of knot-insertion rules for non-uniform B-spline subdivision.",
            "Affine-invariant curvature estimators for implicit surfaces.",
            "Most Cited Paper Award.",
            "Lagrange geometric interpolation by rational spatial cubic Bézier curves.",
            "Formulas for second curvature, third curvature, normal curvature, first geodesic curvature and first geodesic torsion of implicit curve in n-dimensions.",
            "Geometric Modeling and Processing 2010.",
            "Modal shape analysis beyond Laplacian.",
            "Curve networks compatible with G2 surfacing.",
            "Curves and surfaces with rational chord length parameterization.",
            "Efficient point-projection to freeform curves and surfaces.",
            "Distance computation for canal surfaces using cone-sphere bounding volumes.",
            "Global solutions of well-constrained transcendental systems using expression trees and a single solution test.",
            "Medial axis transform of a planar domain with infinite curvature boundary points.",
            "Using Smith normal forms and μ-bases to compute all the singularities of rational planar curves.",
            "Computing the shapes arising in a family of space rational curves depending on one parameter.",
            "Geometric conditions for tangent continuity of interpolatory planar subdivision curves.",
            "Implicitizing rational surfaces of revolution using μ-bases.",
            "Matching admissible G2 Hermite data by a biarc-based subdivision scheme.",
            "The Bernstein polynomial basis: A centennial retrospective.",
            "Geometric Modeling and Processing 2012.",
            "Topologically robust B-spline surface reconstruction from point clouds using level set methods and iterative geometric fitting algorithms.",
            "Quasi-interpolation for surface reconstruction from scattered data with radial basis function.",
            "Fast B-spline curve fitting by L-BFGS.",
            "Adaptive data fitting by the progressive-iterative approximation.",
            "An alternative method for constructing interpolatory subdivision from approximating subdivision.",
            "THB-splines: The truncated basis for hierarchical splines.",
            "Hierarchical bases of spline spaces with highest order smoothness over hierarchical T-subdivisions.",
            "Family of superspirals with completely monotonic curvature given in terms of Gauss hypergeometric function.",
            "Isogeometric simulation of turbine blades for aircraft engines.",
            "Volumetric Boolean sum.",
            "Using μ-bases to implicitize rational surfaces with a pair of orthogonal directrices.",
            "Efficient offset trimming for planar rational curves using biarc trees.",
            "Least squares quasi-developable mesh approximation.",
            "The surface/surface intersection problem by means of matrix based representations.",
            "Approximation power of polynomial splines on T-meshes.",
            "Homeomorphic approximation of the intersection curve of two rational surfaces.",
            "An isoperimetric type problem for primitive Pythagorean hodograph curves.",
            "Certified approximation of parametric space curves with cubic B-spline curves.",
            "On the shape of curves that are rational in polar coordinates.",
            "Exploring hypersurfaces with offset-like convolutions.",
            "Rational fixed radius rolling ball blends between natural quadrics.",
            "Quality tetrahedral mesh smoothing via boundary-optimized Delaunay triangulation.",
            "Interpolatory blending net subdivision schemes of Dubuc-Deslauriers type."
        ]
    },
    {
        "name": "CAGD",
        "year": "2011",
        "info": "Volume 28, 2011",
        "count": 44,
        "papers": [
            "Manifold-based surfaces with boundaries.",
            "On the one-parameter dual spherical motions.",
            "Regularization of B-spline objects.",
            "Feature-preserving mesh denoising based on vertices classification.",
            "Fast L1kCk polynomial spline interpolation algorithm with shape-preserving properties.",
            "Rational Pythagorean-hodograph space curves.",
            "On trivariate blending sums of univariate and bivariate quadratic spline quasi-interpolants on bounded domains.",
            "Proper real reparametrization of rational ruled surfaces.",
            "Collision and intersection detection of two ruled surfaces using bracket method.",
            "Spherical quadratic Bézier triangles with chord length parameterization and tripolar coordinates in space.",
            "On transfinite interpolations with respect to convex domains.",
            "A class of general quartic spline curves with shape parameters.",
            "An algebraic approach to continuous collision detection for ellipsoids.",
            "Artifact analysis on B-splines, box-splines and other surfaces defined by quadrilateral polyhedra.",
            "Artifact analysis on triangular box-splines and subdivision surfaces defined by triangular polyhedra.",
            "Unknots with highly knotted control polygons.",
            "Ridge extraction of a smooth 2-manifold surface based on vector field.",
            "Curvature of singular Bézier curves and surfaces.",
            "Preserving detailed features in digital bas-relief making.",
            "Four-arc approximation to ellipses: The best in general.",
            "Convexity preserving splines over triangulations.",
            "Scalar multivariate subdivision schemes and box splines.",
            "Adaptive skin meshes coarsening for biomolecular simulation.",
            "Generalized shape operators on polyhedral surfaces.",
            "Simple determination via complex arithmetic of geometric characteristics of Bézier conics.",
            "Embedding a triangular graph within a given boundary.",
            "Approximate convolution with pairs of cubic Bézier LN curves.",
            "E.G2 B-spline surface interpolation.",
            "Explicit polynomial solutions of fourth order linear elliptic Partial Differential Equations for boundary based smooth surface generation.",
            "Cubic helical splines with Frenet-frame continuity.",
            "Analyzing midpoint subdivision.",
            "On the instability in the dimension of splines spaces over T-meshes.",
            "Conchoid surfaces of rational ruled surfaces.",
            "Equivalence of distinct characterizations for rational rotation-minimizing frames on quintic space curves.",
            "Guest Editorsʼ Introduction to Special Issue: Selected Papers from Solid and Physical Modeling 2010.",
            "Anisotropic quadrangulation.",
            "Parallel and adaptive surface reconstruction based on implicit PHT-splines.",
            "Centroidal Voronoi tessellation in universal covering space of manifold surfaces.",
            "Non-commutative morphology: Shapes, filters, and convolutions.",
            "On the progressive iteration approximation property and alternative iterations.",
            "A surface modeling method based on the envelope template.",
            "Obtuse triangle suppression in anisotropic meshes.",
            "h-Blossoming: A new approach to algorithms and identities for h-Bernstein bases and h-Bézier curves.",
            "Computing intersection and self-intersection loci of parametrized surfaces using regular systems and Gröbner bases."
        ]
    },
    {
        "name": "CAGD",
        "year": "2010",
        "info": "Volume 27, 2010",
        "count": 58,
        "papers": [
            "Topological mesh operators.",
            "A basis of multi-degree splines.",
            "A circle-preserving C2 Hermite interpolatory subdivision scheme with tension control.",
            "Incenter subdivision scheme for curve interpolation.",
            "Surface fitting and registration of point clouds using approximations of the unsigned distance function.",
            "Variations on the four-point subdivision scheme.",
            "On the complexity of smooth spline surfaces from quad meshes.",
            "Geodesic-like curves on parametric surfaces.",
            "On the intersection curve of three parametric hypersurfaces.",
            "Weighted progressive iteration approximation and convergence analysis.",
            "Solvability of G1 Hermite interpolation by spatial Pythagorean-hodograph cubics and its selection scheme.",
            "An intuitive explanation of third-order surface behavior.",
            "On the different shapes arising in a family of plane rational curves depending on a parameter.",
            "Control point based exact description of a class of closed curves and surfaces.",
            "A refinement of the variation diminishing property of Bézier curves.",
            "Approximate parametrization of plane algebraic curves by linear systems of curves.",
            "Polyhedral vertex blending with setbacks using rational S-patches.",
            "Nonnegativity preserving macro-element interpolation of scattered data.",
            "Applying inversion to construct planar, rational spirals that satisfy two-point G2 Hermite data.",
            "Tracking topological changes in parametric models.",
            "A spectral characterization of the Delaunay triangulation.",
            "Construction and smoothing of triangular Coons patches with geodesic boundary curves.",
            "An isoperimetric type problem for Bézier curves of degree n.",
            "Local progressive-iterative approximation format for blending curves and patches.",
            "Blending based corner cutting subdivision scheme for nets of curves.",
            "Construction of rational surface patches bounded by lines of curvature.",
            "Convergence of irregular Hermite subdivision schemes.",
            "Consolidated sharp bounds for Bézier curve approximation with cutdown polygon and corner cutting polygon.",
            "Optimization approach for 3D model watermarking by linear binary programming.",
            "Hermite interpolation by hypocycloids and epicycloids with rational offsets.",
            "The conditions of convexity for Bernstein-Bézier surfaces over triangles.",
            "A kinematic approach to Kokotsakis meshes.",
            "A normalized basis for quintic Powell-Sabin splines.",
            "The eccentricity of conic sections formulated as rational Bézier quadratics.",
            "Minimal generators of the defining ideal of the Rees Algebra associated to monoid parameterizations.",
            "Two-point G2 Hermite interpolation with spirals by inversion of hyperbola.",
            "Topology of 2D and 3D rational curves.",
            "A remarkable set of Schönflies-singular planar Stewart Gough platforms.",
            "On rational Minkowski Pythagorean hodograph curves.",
            "Complex Bézier curves and the geometry of polygons.",
            "Error term in pointwise approximation of the curvature of a curve.",
            "Corner cutting and augmentation: An area-preserving method for smoothing polygons and polylines.",
            "Quality improvement method for graded hexahedral element meshes.",
            "Advances in Applied Geometry.",
            "Precise Hausdorff distance computation between polygonal meshes.",
            "Polynomial cubic splines with tension properties.",
            "Skinning of circles and spheres.",
            "G1 Hermite interpolation by PH cubics revisited.",
            "C2 Hermite interpolation by Minkowski Pythagorean hodograph curves and medial axis transform approximation.",
            "ISOGAT: A 2D tutorial MATLAB code for Isogeometric Analysis.",
            "Quasi-interpolation in isogeometric analysis based on generalized B-splines.",
            "Parallel manipulators and Borel-Bricard problem.",
            "Matrix-based implicit representations of rational algebraic curves and applications.",
            "A normalized basis for reduced Clough-Tocher splines.",
            "Geometric Hermite interpolation by monotone helical quintics.",
            "A generalized curve subdivision scheme of arbitrary order with a tension parameter.",
            "Simplicial diffeomorphisms.",
            "Minimizing the maximal ratio of weights of rational Bézier curves and surfaces."
        ]
    },
    {
        "name": "CAGD",
        "year": "2009",
        "info": "Volume 26, 2009",
        "count": 74,
        "papers": [
            "Shape-preserving univariate cubic and higher-degree L1 splines with function-value-based and multistep minimization principles.",
            "Equivolumetric offset surfaces.",
            "Integral invariants for robust geometry processing.",
            "Bézier clipping is quadratically convergent.",
            "Non-uniform subdivision for B-splines of arbitrary degree.",
            "Recursive representation and application of transformation matrices of B-spline bases.",
            "A symmetric, non-uniform, refine and smooth subdivision algorithm for general degree B-splines.",
            "Guided spline surfaces.",
            "Transfinite mean value interpolation.",
            "Equivolumetric tubular solids for volume-preserving bend of cylinders.",
            "Two C1-methods to generate Bézier surfaces from the boundary.",
            "Quasi-hierarchical Powell-Sabin B-splines.",
            "Fitting curves and surfaces to point clouds in the presence of obstacles.",
            "Stable, linear spline wavelets on nonuniform knots with vanishing moments.",
            "mu-bases for polynomial systems in one variable.",
            "On the smoothness of real-valued functions generated by subdivision schemes using nonlinear binary averaging.",
            "Classification and resolution of critical cases in Grandine and Klein's topology determination using a perturbation method.",
            "Constrained multi-degree reduction of Bézier surfaces using Jacobi polynomials.",
            "Salkowski curves revisited: A family of curves with constant curvature and non-constant torsion.",
            "Four-point curve subdivision based on iterated chordal and centripetal parameterizations.",
            "Computing self-intersection curves of rational ruled surfaces.",
            "Axial moving planes and singularities of rational space curves.",
            "Using signature sequences to classify intersection curves of two quadrics.",
            "A simple and efficient approximation of a Bézier piece by its cutdown polygon.",
            "Curves with chord length parameterization.",
            "Computing intersections of planar spline curves using knot insertion.",
            "Geometric Modeling and Processing.",
            "Shifting planes always implicitize a surface of revolution.",
            "Mixed finite element methods for geometric modeling using general fourth order geometric flows.",
            "Controlling torsion sign.",
            "Convergence of geodesics on triangulations.",
            "Generalized penetration depth computation based on kinematical geometry.",
            "Computation of medial axis and offset curves of curved boundaries in planar domains based on the Cesaro's approach.",
            "Differential geometry of intersection curves in R4 of three implicit surfaces.",
            "Selective knot insertion for symmetric, non-uniform refine and smooth B-spline subdivision.",
            "Biorthogonal nonuniform B-spline wavelets based on a discrete norm.",
            "Geometric constraint modelling: Boundary planar B-spline curves and control polyhedra for 5-axes response surface graph.",
            "An analysis and comparison of parameterization-based computation of differential quantities for discrete surfaces.",
            "A cyclic basis for closed curve and surface modeling.",
            "Fast approach for computing roots of polynomials using cubic clipping.",
            "Convexity preservation of the interpolating four-point C2 ternary stationary subdivision scheme.",
            "Multi-degree reduction of Bézier curves with constraints, using dual Bernstein basis polynomials.",
            "Quintic space curves with rational rotation-minimizing frames.",
            "A torus patch approximation approach for point projection on surfaces.",
            "Existence conditions for Coons patches interpolating geodesic boundary curves.",
            "Preface.",
            "Efficient mesh deformation using tetrahedron control mesh.",
            "A generic and flexible framework for the geometrical and topological analysis of (algebraic) surfaces.",
            "Volumetric parameterization and trivariate B-spline fitting using harmonic functions.",
            "Rapid and effective segmentation of 3D models using random walks.",
            "Interactive physically-based shape editing.",
            "Computing the Voronoi cells of planes, spheres and cylinders in R2.",
            "Direct sampling on surfaces for high quality remeshing.",
            "Optimal parameterization of rational quadratic curves.",
            "An involute spiral that matches G2 Hermite data in the plane.",
            "Matrix representations for toric parametrizations.",
            "On NURBS algorithms using tangent cones.",
            "Convexity preserving scattered data interpolation using Powell-Sabin elements.",
            "Matrix-valued 4-point spline and 3-point non-spline interpolatory curve subdivision schemes.",
            "An approximating C2 non-stationary subdivision scheme.",
            "Quasi-interpolation by quadratic C1-splines on truncated octahedral partitions.",
            "A remark on parameterizing nonsingular cubic surfaces.",
            "On converting sets of tetrahedra to combinatorial and PL manifolds.",
            "Complex rational Bézier curves.",
            "Invariant-geometry conditions for the rational bi-quadratic Bézier surfaces.",
            "Shape preserving approximation by spatial cubic splines.",
            "Interpolatory quad/triangle subdivision schemes for surface design.",
            "Computing lines of curvature for implicit surfaces.",
            "Solving the implicitization, inversion and reparametrization problems for rational curves through subresultants.",
            "Adjustable speed surface subdivision.",
            "µ-Bases and singularities of rational planar curves.",
            "Periodic Bézier curves.",
            "On control polygons of quartic Pythagorean-hodograph curves.",
            "Dimension elevation formula for Chebyshevian blossoms."
        ]
    },
    {
        "name": "CAGD",
        "year": "2008",
        "info": "Volume 25, 2008",
        "count": 67,
        "papers": [
            "An explicit quasi-interpolation scheme based on C1 quartic splines on type-1 triangulations.",
            "A continuum theory for unstructured mesh generation in two dimensions.",
            "A family of subdivision schemes with cubic precision.",
            "Intersection and self-intersection of surfaces by means of Bezoutian matrices.",
            "On the curvature of guided surfaces.",
            "On the approximation order of tangent estimators.",
            "From extension of Loop's approximation scheme to interpolatory subdivisions.",
            "Convolution surfaces of quadratic triangular Bézier surfaces.",
            "Symmetry of shape charts.",
            "Local energy-optimizing subdivision algorithms.",
            "On the deviation of a parametric cubic spline interpolant from its data polygon.",
            "All triangulations are reachable via sequences of edge-flips: an elementary proof.",
            "Nonlinear subdivision through nonlinear averaging.",
            "A general framework for surface modeling using geometric partial differential equations.",
            "Pythagorean-hodograph curves and related topics.",
            "Curves with rational chord-length parametrization.",
            "C1 Hermite interpolation with simple planar PH curves by speed reparametrization.",
            "Absolute hodograph winding number and planar PH quintic splines.",
            "Transition between concentric or tangent circles with a single segment of G2 PH quintic curve.",
            "Pythagorean-hodograph ovals of constant width.",
            "Identification of spatial PH quintic Hermite interpolants with near-optimal shape measures.",
            "Nonexistence of rational rotation-minimizing frames on cubic curves.",
            "Weierstrass-type approximation theorems with Pythagorean hodograph curves.",
            "On rationally supported surfaces.",
            "Branching blend of natural quadrics based on surfaces with rational offsets.",
            "On quadratic two-parameter families of spheres and their envelopes.",
            "Piecewise algebraic surface computation and smoothing from a discrete model.",
            "On geometric Lagrange interpolation by quadratic parametric patches.",
            "Bézier surfaces with linear isoparametric lines.",
            "Equivolumetric offsets for 2D machining with constant material removal rate.",
            "Topological criterion for selection of quintic Pythagorean-hodograph Hermite interpolants.",
            "Solid and Physical Modeling.",
            "Random walks for feature-preserving mesh denoising.",
            "A bound on the approximation of a Catmull-Clark subdivision surface by its limit mesh.",
            "Shape sensitivity of constructively represented geometric models.",
            "Efficient distance computation in configuration space.",
            "Approximate convex decomposition of polyhedra and its applications.",
            "A note on Class A Bézier curves.",
            "A unified approach to resultant matrices for Bernstein basis polynomials.",
            "Preface.",
            "Fast, robust, and faithful methods for detecting crest lines on meshes.",
            "Toward an efficient triangle-based spherical harmonics representation of 3D objects.",
            "Paper-craft from 3D polygonal models using generalized cylinders.",
            "A genus oblivious approach to cross parameterization.",
            "Exact evaluation of limits and tangents for non-polynomial subdivision schemes.",
            "Pairs of bi-cubic surface constructions supporting polar connectivity.",
            "Topology and arrangement computation of semi-algebraic planar curves.",
            "Covering Minkowski sum boundary using points with applications.",
            "Blossoming and curvatures of surface patches.",
            "Detail preserving deformation of B-spline surfaces with volume constraint.",
            "A simple method for approximating rational Bézier curve using Bézier curves.",
            "A note on the paper \"Normal based subdivision scheme for curve design\" by Xunnian Yang.",
            "Classical Techniques for Applied Geometry.",
            "Rotations, translations and symmetry detection for complexified curves.",
            "Geometric Lagrange interpolation by planar cubic Pythagorean-hodograph curves.",
            "Approximation of meander-like regions by paths of lemniscatic sectors and the computation of orthogonal meshes.",
            "Application of B-spline techniques to the modeling of airplane wings and numerical grid generation.",
            "A new construction of curves of constant width.",
            "Uniqueness results for minimal enclosing ellipsoids.",
            "PN surfaces and their convolutions with rational surfaces.",
            "Self-motions of Stewart-Gough platforms.",
            "Geometry and kinematics of the Mecanum wheel.",
            "The geometry of the Moineau pump.",
            "A construction of rational manifold surfaces of arbitrary topology and smoothness from triangular meshes.",
            "Biorthogonal wavelets based on gradual subdivision of quadrilateral meshes.",
            "A local fitting algorithm for converting planar curves to B-splines.",
            "Division algorithms for Bernstein polynomials."
        ]
    },
    {
        "name": "CAGD",
        "year": "2007",
        "info": "Volume 24, 2007",
        "count": 43,
        "papers": [
            "A non-stationary uniform tension controlled interpolating 4-point scheme reproducing conics.",
            "Progressive iterative approximation and bases with the fastest convergence rates.",
            "A geometric diagram and hybrid scheme for triangle subdivision.",
            "A control polygon scheme for design of planar C2 PH quintic spline curves.",
            "A multi-level filtering approach for fairing planar cubic B-spline curves.",
            "Geometric interpolation by planar cubic polynomial curves.",
            "Modeling sphere-like manifolds with spherical Powell-Sabin B-splines.",
            "On the degree elevation of B-spline curves and corner cutting.",
            "Concentric tessellation maps and curvature continuous guided surfaces.",
            "Normals of subdivision surfaces and their control polyhedra.",
            "Curvature computations for n-manifolds in Rn+m and solution to an open problem proposed by R. Goldman.",
            "Computing roots of polynomials by quadratic clipping.",
            "Offset-rational sinusoidal spirals in Bézier form.",
            "Path splines with circle envelopes.",
            "A general geometric construction of coordinates in a convex simplicial polytope.",
            "Weight control for modelling with NURPS surfaces.",
            "B-spline control nets for developable surfaces.",
            "Axial moving lines and singularities of rational planar curves.",
            "An interpolating 4-point C2 ternary non-stationary subdivision scheme with tension control.",
            "A geometric product formulation for spatial Pythagorean hodograph curves with applications to Hermite interpolation.",
            "Rational space curves are not \"unit speed\".",
            "On geometric interpolation of circle-like curves.",
            "G2 Pythagorean hodograph quintic transition between two circles with shape control.",
            "G2 curve design with a pair of Pythagorean Hodograph quintic spiral segments.",
            "Point-normal interpolation schemes reproducing spheres, cylinders and cones.",
            "A counterexample on point inversion and projection for NURBS curve.",
            "Are rational Bézier surfaces monotonicity preserving?",
            "Erratum to \"Concentric tessellation maps and curvature continuous guided surfaces\" by K. Karciauskas and J. Peters [Computer Aided Geometric Design 24 (2) (2007) 99-111].",
            "Geometric Modeling and Processing 2006.",
            "Evolution-based least-squares fitting using Pythagorean hodograph spline curves.",
            "Geometric accuracy analysis for discrete surface approximation.",
            "Composite sqrt(2) subdivision surfaces.",
            "Ternary subdivision for quadrilateral meshes.",
            "C1 and C2-continuous polynomial parametric Lp splines (p>=1).",
            "Lines of curvature and umbilical points for implicit surfaces.",
            "Rational hypersurfaces with rational convolutions.",
            "Discrete Differential Geometry.",
            "Principal curvatures from the integral invariant viewpoint.",
            "Exact and interpolatory quadratures for curvature tensor estimation.",
            "Cycle bases of graphs and sampled manifolds.",
            "A unified, integral construction for coordinates over closed curves.",
            "Note on curve and surface energies.",
            "Discrete quadratic curvature energies."
        ]
    },
    {
        "name": "CAGD",
        "year": "2006",
        "info": "Volume 23, 2006",
        "count": 45,
        "papers": [
            "Sharp bounds on the approximation of a Bézier polynomial by its quasi-control polygon.",
            "Constructive implicit fitting.",
            "Interpolatory ternary subdivision surfaces.",
            "Discrete one-forms on meshes and applications to 3D mesh parameterization.",
            "Composition of parametrizations, using the paired algebras of forms and sites.",
            "Discrete surface modelling using partial differential equations.",
            "On the singularity of a class of parametric curves.",
            "C2 subdivision over triangulations with one extraordinary point.",
            "Rational surfaces with linear normals and their convolutions with rational surfaces.",
            "Convergence analysis of a discretization scheme for Gaussian curvature over triangular surfaces.",
            "A general 4th-order PDE method to generate Bézier surfaces from the boundary.",
            "Optimal properties of the uniform algebraic trigonometric B-splines.",
            "Normal based subdivision scheme for curve design.",
            "C2 spherical Bézier splines.",
            "Shape-preserving, first-derivative-based parametric and nonparametric cubic L1 spline curves.",
            "A new proof of an identity of Jetter and Stöckler for multivariate Bernstein polynomials.",
            "On the problem of proper reparametrization for rational curves and surfaces.",
            "A new approach to characterizing the relative position of two ellipses depending on one parameter.",
            "Stationary subdivision schemes reproducing polynomials.",
            "Jet subdivision schemes on the k-regular complex.",
            "G1 Hermite interpolation by Minkowski Pythagorean hodograph cubics.",
            "Matrix-valued subdivision schemes for generating surfaces with extraordinary vertices.",
            "Improved algorithms for the projection of points on NURBS curves and surfaces.",
            "Local subdivision of Powell-Sabin splines.",
            "Paths of C-Bézier and C-B-spline curves.",
            "Guest Editors' Introduction.",
            "Geometric modeling applications in rational drug design: a survey.",
            "Segmenting molecular surfaces.",
            "Quality meshing of implicit solvation models of biomolecular structures.",
            "Geometric filtering of pairwise atomic interactions applied to the design of efficient statistical potentials.",
            "Geometry-guided computation of 3D electrostatics for large biomolecules.",
            "Some improvements on the derivative bounds of rational Bézier curves and surfaces.",
            "Class A Bézier curves.",
            "The implicit structure of ridges of a smooth parametric surface.",
            "Conditions for use of a non-selfintersection conjecture.",
            "On the existence of biharmonic tensor-product Bézier surface patches.",
            "High order approximation of rational curves by polynomial curves.",
            "Inherently improper surface parametric supports.",
            "An octahedral C2 macro-element.",
            "On parametric smoothness of generalised B-spline curves.",
            "Optimal multi-degree reduction of Bézier curves with G2-continuity.",
            "Block-balanced meshes in iterative uniform refinement.",
            "The bound on derivatives of rational Bézier curves.",
            "Local hybrid approximation for scattered data fitting with bivariate splines.",
            "Rational quadratic circles are parametrized by chord length."
        ]
    },
    {
        "name": "CAGD",
        "year": "2005",
        "info": "Volume 22, 2005",
        "count": 47,
        "papers": [
            "Approximate swept volumes of NURBS surfaces or solids.",
            "Smooth surface extension with curvature bound.",
            "Curve modeling with constrained B-spline wavelets.",
            "Multi-sided macro-element spaces based on Clough-Tocher triangle splits with applications to hole filling.",
            "Corner cutting systems.",
            "s-power series: an alternative to Poisson expansions for representing analytic functions.",
            "Estimating differential quantities using polynomial fitting of osculating jets.",
            "Parametrization of approximate algebraic surfaces by lines .",
            "Fast degree elevation and knot insertion for B-spline curves.",
            "An analytic pseudo-spectral method to generate a regular 4-sided PDE surface patch .",
            "Quasi-interpolation by quadratic piecewise polynomials in three variables.",
            "A second order algorithm for orthogonal projection onto curves and surfaces.",
            "Matrix representation for multi-degree reduction of Be'zier curves.",
            "Minimizing the maximal ratio of weights of a rational Bézier curve.",
            "G1 continuity conditions of adjacent NURBS surfaces.",
            "Hermite interpolation of space curves using the symmetric algebra.",
            "New bounds on the magnitude of the derivative of rational Bézier curves and surfaces.",
            "Simple local interpolation of surfaces using normal vectors.",
            "Area preserving deformation of multiresolution curves.",
            "Editorial.",
            "A sharpness dependent filter for mesh smoothing.",
            "Harmonic functions for quadrilateral remeshing of arbitrary manifolds.",
            "Truly selective polygonal mesh hierarchies with error control.",
            "Mesh scissoring with minima rule and part salience.",
            "An efficient bit allocation for compressing normal meshes with an error-driven quantization.",
            "A complete and non-overlapping tracing algorithm for closed loops.",
            "A robust algorithm for finding the real intersections of three quadric surfaces.",
            "Constrained space curve interpolation with constraint planes.",
            "Helix approximations with conic and quadratic Bézier curves.",
            "Guest Editors' Note.",
            "Geometric Hermite Interpolation - : In memoriam Josef Hoschek.",
            "Convergence and C1 analysis of subdivision schemes on manifolds by proximity.",
            "Mean value coordinates in 3D.",
            "Curvature formulas for implicit curves and surfaces.",
            "Designing composite triangular subdivision schemes.",
            "Anisotropic smoothing of point sets, .",
            "A variational approach to spline curves on surfaces.",
            "A C2 trivariate macro-element based on the Clough-Tocher-split of a tetrahedron.",
            "Dyadic C2 Hermite interpolation on a square mesh.",
            "Euclidean and Minkowski Pythagorean hodograph curves over planar cubics.",
            "Surface mesh segmentation and smooth surface extraction through region growing.",
            "Shape-preserving interpolation by fair discrete G3 space curves.",
            "A note on the paper in CAGD (2004, 21 (2), 181-191).",
            "Shape-preserving interpolation of irregular data by bivariate curvature-based cubic L1 splines in spherical coordinates.",
            "On geometric interpolation of parametric surfaces.",
            "Single-knot wavelets for non-uniform B-splines.",
            "Unifying C-curves and H-curves by extending the calculation to complex numbers."
        ]
    },
    {
        "name": "CAGD",
        "year": "2004",
        "info": "Volume 21, 2004",
        "count": 53,
        "papers": [
            "A conjecture on tangent intersections of surface patches.",
            "Gliding spline motions and applications.",
            "Single equation without inequalities to represent a composite curve.",
            "Shape-preserving approximation of multiscale univariate data by cubic L1 spline fits.",
            "Exact computation of the medial axis of a polyhedron.",
            "A generative classification of mesh refinement rules with lattice transformations.",
            "Geometric recipes for constructing Bézier conics of given centre or focus.",
            "Bézier surfaces of minimal area: The Dirichlet approach.",
            "Constructing fair curves and surfaces with a Sobolev gradient method.",
            "A unified matrix representation for degree reduction of Bézier curves.",
            "Interpolation with cubic spirals.",
            "Constrained polynomial degree reduction in the L2-norm equals best weighted Euclidean approximation of Bézier coefficients.",
            "NUAT B-spline curves.",
            "Inflection points and singularities on C-curves.",
            "Heterogeneous material modeling with distance fields.",
            "Multisided arrays of control points for multisided Bezier patches.",
            "Degree reduction of disk Be'zier curves.",
            "Geometric Hermite curves with minimum strain energy.",
            "Linear perturbation methods for topologically consistent representations of free-form surface intersections.",
            "Corrigendum to: 'Linear perturbation methods for topologically consistent representations of free-form surface intersections': Computer Aided Geometric Design 21 (2004) 303-319.",
            "Clifford algebra, Lorentzian geometry, and rational parametrization of canal surfaces.",
            "Interpolatory rank-1 vector subdivision schemes.",
            "Mesh quality improvement and other properties in the four-triangles longest-edge partition.",
            "Revisiting variable radius circles in constructive geometric constraint solving.",
            "Interval implicitization of rational curves.",
            "Gaussian and mean curvatures of rational maps.",
            "A finite element method for surface restoration with smooth boundary conditions.",
            "Estimating normal vectors and curvatures by centroid weights.",
            "Topologically consistent trimmed surface approximations based on triangular patches.",
            "An error-bounded approximate method for representing planar curves in B-splines.",
            "Target curvature driven fairing algorithm for planar cubic B-spline curves.",
            "Designing fair curves using monotone curvature pieces.",
            "Cubic trigonometric polynomial curves with a shape parameter.",
            "The conversion matrix between uniform B-spline and Be'zier representations.",
            "Subdivision scheme tuning around extraordinary vertices.",
            "Shape characterization of subdivision surfaces--basic principles.",
            "Shape characterization of subdivision surfaces--case studies.",
            "SLEVEs for planar spline curves.",
            "Exploiting curvatures to compute the medial axis for domains with smooth boundary.",
            "Degree elevation and developable Be'zier surfaces.",
            "Automatic construction of control triangles for subdivided Powell-Sabin splines.",
            "Recursive de Casteljau bisection and rounding errors.",
            "On harmonic and biharmonic Bézier surfaces.",
            "Special issue on geometric modeling and processing.",
            "Axioms and variational problems in surface parameterization .",
            "Lifting curve parameterization methods to isosurfaces.",
            "Discrete Laplace-Beltrami operators and their convergence.",
            "Developable surface fitting to point clouds.",
            "Rational quadratic approximation to real algebraic curves.",
            "Efficient Groebner walk conversion for implicitization of geometric objects.",
            "Almost rotation-minimizing rational parametrization of canal surfaces.",
            "Existence of set-interpolating and energy-minimizing curves.",
            "Reconstruction of convergent G1 smooth B-spline surfaces."
        ]
    },
    {
        "name": "CAGD",
        "year": "2003",
        "info": "Volume 20, 2003",
        "count": 40,
        "papers": [
            "A shape preserving representation with an evaluation algorithm of linear complexity.",
            "Reparametrization of a rational ruled surface using the -basis.",
            "Mean value coordinates.",
            "A class of Bézier-like curves.",
            "Polynomial generation and quasi-interpolation in stationary non-uniform subdivision.",
            "A non-stationary subdivision scheme for generalizing trigonometric spline surfaces to arbitrary meshes.",
            "Point inversion and projection for NURBS curve and surface: Control polygon approach.",
            "Computing real inflection points of cubic algebraic curves.",
            "Geodesic curve computations on surfaces.",
            "Composite primal/dual -subdivision schemes.",
            "Non-linear subdivision using local spherical coordinates.",
            "Almost universal parametrizations for cubic surfaces.",
            "Construction of orthogonal bases for polynomials in Bernstein form on triangular and simplex domains.",
            "Updating the topology of the dynamic Voronoi diagram for spheres in Euclidean d-dimensional space.",
            "Modifying a knot of B-spline curves.",
            "Specifying useful error bounds for geometry tools: an intersector exemplar.",
            "Constrained interpolation with rational cubics.",
            "Nonuniform web-splines.",
            "Corrigendum to: 'Composite primal/dual -subdivision schemes': [COMAID 20 (2003) 135-164].",
            "Gaussian and mean curvatures of rational Bézier patches.",
            "High accuracy approximation of helices by quintic curves.",
            "On the angular defect of triangulations and the pointwise approximation of curvatures.",
            "A concept for parametric surface fitting which avoids the parametrization problem.",
            "Sampling points on regular parametric curves with control of their distribution.",
            "Shape control of Bézier surfaces with iso-parametric monotone curvature constraints.",
            "A simple subdivision formula for quadrilateral Wachspress patches.",
            "Enhancing Levin's method for computing quadric-surface intersections.",
            "Using Jacobi polynomials for degree reduction of Bezier curves with Ck-constraints.",
            "Rational approximation schemes for rotation-minimizing frames on Pythagorean-hodograph curves.",
            "Knot intervals and multi-degree splines.",
            "C1 Hermite interpolation using MPH quartic.",
            "In memoriam Josef Hoschek.",
            "Representing circles with five control points.",
            "An improved Hoschek intrinsic parametrization.",
            "Geometric design of motions constrained by a contacting surface pair.",
            "On the local shape effect of a moving control point.",
            "An identity for multivariate Bernstein polynomials.",
            "Geometric construction of spline curves with tension properties.",
            "A simple algorithm for designing developable Bézier surfaces.",
            "The shape of spherical quartics."
        ]
    },
    {
        "name": "CAGD",
        "year": "2002",
        "info": "Volume 19, 2002",
        "count": 46,
        "papers": [
            "An interpolating 4-point C2 ternary stationary subdivision scheme.",
            "Advanced surface fitting techniques.",
            "Optimal slicing of free-form surfaces.",
            "Degree elevation for generalized Poisson functions.",
            "A subdivision algorithm for trigonometric spline curves.",
            "Hierarchical multiresolution reconstruction of shell surfaces.",
            "C2 free-form surfaces of degree (3, 5).",
            "Regular triangulations of dynamic sets of points.",
            "A new implicit representation of a planar rational curve with high order singularity.",
            "Refinement operators for triangle meshes.",
            "Constrained fitting in reverse engineering.",
            "On C1-continuity of Wachspress quadrilateral patches.",
            "Polynomial parametrization of curves without affine singularities.",
            "The refinability of the four point scheme.",
            "Shape preserving F3 curve interpolation.",
            "Shape-preserving, multiscale interpolation by univariate curvature-based cubic L1 splines in Cartesian and polar coordinates.",
            "Total least squares fitting of Bézier and B-spline curves to ordered data.",
            "A basis of C-Bézier splines with optimal properties.",
            "A rational quartic Bézier representation for conics.",
            "Lagrange interpolation on conics and cubics.",
            "Implicitization of rational surfaces by means of polynomial interpolation.",
            "Planar C2 cubic spline interpolation under geometric boundary conditions.",
            "Optimal multi-degree reduction of Bézier curves with constraints of endpoints continuity.",
            "Uniform hyperbolic polynomial B-spline curves.",
            "Structural invariance of spatial Pythagorean hodographs.",
            "Explicit matrix representation for NURBS curves and surfaces.",
            "Minimizing blossoms under symmetric linear constraints.",
            "Using duality to implicitize and find cusps and inflection points of Bézier curves.",
            "p-Bézier curves, spirals, and sectrix curves.",
            "Universal parametrization in constructing smoothly-connected B-spline surfaces.",
            "Universal parametrization and interpolation on cubic surfaces.",
            "Quadratic trigonometric polynomial curves with a shape parameter.",
            "Constructive modeling of G1 bifurcation.",
            "Experimental results on quadrangulations of sets of fixed points.",
            "Comparison of interval methods for plotting algebraic curves.",
            "Adjusting control points to achieve continuity.",
            "Euler-Rodrigues frames on spatial Pythagorean-hodograph curves.",
            "The affine invariant analytic blossom.",
            "Tensor product Bézier surfaces on triangle Bézier surfaces.",
            "Triangular patch modeling using combination method.",
            "Convex subdivision of a Bézier curve.",
            "Corrigendum to: \"Polynomial parametrization of curves without affine singularities\": [Computer Aided Geometric Design 19(3) (2002) 223-234].",
            "A cascadic geometric filtering approach to subdivision.",
            "Self-intersection avoidance and integral properties of generalized cylinders.",
            "Application of Legendre-Bernstein basis transformations to degree elevation and degree reduction.",
            "Efficient topology determination of implicitly defined algebraic plane curves."
        ]
    },
    {
        "name": "CAGD",
        "year": "2001",
        "info": "Volume 18, 2001",
        "count": 53,
        "papers": [
            "Optimising the four-arc approximation to ellipses.",
            "On the minors of the implicitization Bézout matrix for a rational plane curve.",
            "Shape preserving alternatives to the rational Bézier model.",
            "The mu-basis of a rational ruled surface.",
            "Erratum to: \"A closed algebraic interpolation curve\", Computer Aided Geometric Design 17 (7) (2000) 631-642.",
            "Meshless parameterization and surface reconstruction.",
            "Construction and shape analysis of PH quintic Hermite interpolants.",
            "Degree reduction of B-spline curves.",
            "The n-sided control point surfaces without twist constraints.",
            "Degree elevation for n-sided surfaces.",
            "Regular algebraic curve segments (III) - applications in interactive design and data fitting.",
            "A rectangular Gm-continuous filling surface patch and some improvements at corners.",
            "Transfinite interpolation over implicitly defined sets.",
            "C1 modeling with A-patches from rational trivariate functions.",
            "Performance analysis of CNC interpolators for time-dependent feedrates along PH curves.",
            "Implicit Gn-blending of vertices.",
            "Quasi-Chebyshev splines with connection matrices: application to variable degree polynomial splines.",
            "Cubic algebraic curves based on geometric constraints.",
            "Using polynomial interpolation for implicitizing algebraic curves.",
            "Shape-preserving, multiscale interpolation by bi- and multivariate cubic L1 splines.",
            "Quasi 4-8 subdivision.",
            "Geometric fairing of irregular meshes for free-form surface design.",
            "On subdivision schemes generalizing uniform B-spline surfaces of arbitrary degree.",
            "4-8 Subdivision.",
            "A unified framework for primal/dual quadrilateral subdivision schemes.",
            "Computing curvature bounds for bounded curvature subdivision.",
            "Trimming for subdivision surfaces.",
            "A subdivision scheme for surfaces of revolution.",
            "A simple look at polar forms.",
            "Algorithms on cone spline surfaces and spatial osculating arc splines.",
            "An algebraic condition for the separation of two ellipsoids.",
            "Voronoi diagram of a circle set from Voronoi diagram of a point set: I. Topology.",
            "Voronoi diagram of a circle set from Voronoi diagram of a point set: II. Geometry.",
            "Inversion approximations for functions via s-power series.",
            "Pierre Bézier: An engineer, a mathematician.",
            "A process for surface fairing in irregular meshes.",
            "Real-time CNC interpolators for Bézier conics.",
            "On the smooth convergence of subdivision and degree elevation for Bézier curves.",
            "Conversion between triangular and rectangular Bézier patches.",
            "A subdivision algorithm for generalized Bernstein-Bézier curves.",
            "Computing normal vector Bézier patches.",
            "Are isophotes and reflection lines the same?",
            "Implicitization and parametrization of nonsingular cubic surfaces.",
            "Osculatory interpolation.",
            "Gn-continuous connections between normal ringed surfaces.",
            "Tracing index of rational curve parametrizations.",
            "A geometric Newton-Raphson strategy.",
            "Singularities of rational Bézier curves.",
            "Geometric Hermite interpolation for space curves.",
            "Gauss map computation for free-form surfaces.",
            "Optimized refinable enclosures of multivariate polynomial pieces.",
            "Blended Hermite interpolants.",
            "Computation of optimal composite re-parameterizations."
        ]
    },
    {
        "name": "CAGD",
        "year": "2000",
        "info": "Volume 17, 2000",
        "count": 46,
        "papers": [
            "Modelling surfaces from planar irregular meshes.",
            "Algorithms for shape preserving local approximation with automatic selection of tension parameters.",
            "Unit quaternion integral curve: A new type of fair free-form curves.",
            "Volume morphing and rendering - An integrated approach.",
            "Multi-point tool positioning strategy for 5-axis mashining of sculptured surfaces.",
            "Studying cyclides with Laguerre geometry.",
            "Methods to recover constant radius rolling ball blends in reverse engineering.",
            "Curve reconstruction from unorganized points.",
            "Convergent inversion approximations for polynomials in Bernstein form.",
            "Generating curves and swept surfaces by blended circles.",
            "Decreasing isosurface complexity via discrete fitting.",
            "Improved method generating a free-form surface using integral equations.",
            "Efficient algorithms for Bézier curves.",
            "Numerical parameterization of curves and surfaces.",
            "Weighted radial displacement: A geometric look at Bézier conics and quadrics.",
            "Filling polygonal holes using C1 cubic triangular spline patches.",
            "On higher order derivatives of blending functions.",
            "Univariate cubic Lp splines and shape-preserving, multiscale interpolation by univariate cubic L1 splines.",
            "Physical constraints on feedrates, feed accelerations along curved tool paths.",
            "Hermite interpolation by piecewise polynomial surfaces with rational offsets.",
            "On finding p-th nearest neighbours of scattered points in two dimensions for small p.",
            "The sweep-envelope differential equation algorithm for general deformed swept volumes.",
            "Curve and surface construction using variable degree polynomial splines.",
            "Stability of the B-spline basis via knot insertion.",
            "Designing Bézier conic segments with monotone curvature.",
            "Regular algebraic curve segments (I) - Definitions and characteristics.",
            "Regular algebraic curve segments (II) - Interpolation and approximation.",
            "On surface normal and Gaussian curvature approximations given data sampled from a smooth surface.",
            "Optimal development of doubly curved surfaces.",
            "Best bounds on the approximation of polynomials and splines by their control structure.",
            "Recursive subdivision of polygonal complexes and its applications in computer-aided geometric design.",
            "Estimation of the principle curvatures of approximated surfaces.",
            "A closed algebraic interpolation curve.",
            "Modeling surfaces from meshes of arbitrary topology.",
            "Topological obstructions to blending algorithms.",
            "The n -sided toric patches and A -resultants.",
            "Shape-preserving, multiscale fitting of univariate data by cubic L1 smoothing splines.",
            "Triangular G1 interpolation by 4-splitting domain triangles.",
            "On blending of several quadratic algebraic surfaces.",
            "Piecewise optimal triangulation for the approximation of scattered data in the plane.",
            "On the relationship between parametrisation and invariance for curve functions.",
            "A subdivision scheme for Poisson curves and surfaces.",
            "Minkowski isoperimetric-hodograph curves.",
            "Efficient evaluation of triangular B-spline surfaces.",
            "On Wachspress quadrilateral patches.",
            "Do blending and offsetting commute for Dupin cyclides?"
        ]
    },
    {
        "name": "CAGD",
        "year": "1999",
        "info": "Volume 16, 1999",
        "count": 54,
        "papers": [
            "Local bases of G2 continuous G-splines.",
            "Rational interpolation on a hypersphere.",
            "Energy formulations of A-splines.",
            "Contour machining of free-form surfaces with real-time PH curve CNC interpolators.",
            "Current experience with transfinite interpolation.",
            "Cubic precision Clough-Tocher interpolation.",
            "Swap conditions for dynamic Voronoi diagrams for circles and line segments.",
            "Directional adaptive surface triangulation.",
            "Convexity preserving interpolation.",
            "Inflection points and singularities on planar rational cubic curve segments.",
            "On the derivatives of second and third degree rational Bézier curves.",
            "The Zheng-Ball construction without twist constraints.",
            "Least squares surface approximation using multiquadrics and parametric domain distortion.",
            "Continuity between Gregory-like patches.",
            "On the local existence of the quadratic geometric Hermite interpolant.",
            "Edge and vertex insertion for a class of C1 subdivision surfaces.",
            "Marching along a regular surface/surface intersection with circular steps.",
            "A survey and comparison of traditional piecewise circular approximations to the ellipse.",
            "Subharmonicity and convexity properties of Bernstein polynomials and Bézier nets on triangles.",
            "Subdivision of uniform Powell-Sabin splines.",
            "Polynomial Chebyshev splines.",
            "Combined subdivision schemes for the design of surfaces satisfying boundary conditions.",
            "On the curvature of curves and surfaces defined by normalforms.",
            "Weight-based shape modification of NURBS curves.",
            "A local shape-preserving interpolation scheme for scattered data.",
            "A universal parametrization in B-spline curve and surface interpolation.",
            "Irregular C2 surface construction using bi-polynomial rectangular patches.",
            "Quadric splines.",
            "On a relationship between the moving line and moving conic coefficient matrices.",
            "A geometric criterion for the convexity of Powell-Sabin interpolants and its multivariate generalization.",
            "Approximation algorithms for developable surfaces.",
            "A-splines: local interpolation and approximation using Gk-continuous piecewise real algebraic curves.",
            "Preface.",
            "De Casteljau's autobiography: My time at Citroën.",
            "On de Casteljau's algorithm.",
            "Polynomial degree reduction in the L2-norm equals best Euclidean approximation of Bézier coefficients.",
            "Sharp, quantitative bounds on the distance between a polynomial piece and its Bézier control polygon.",
            "Circles of curvature for curves in space.",
            "The types of rational (2, 1)-Bézier surfaces.",
            "Chebyshev-Bernstein bases.",
            "Blossoming with cancellation.",
            "Discrete Coons patches.",
            "The rational Bernstein bases and the multirational blossoms.",
            "Minkowski Pythagorean hodographs.",
            "G3 approximation of conic sections by quintic polynomial curves.",
            "Differential geometry of intersection curves of two surfaces.",
            "Convexity preservation of the four-point interpolatory subdivision scheme.",
            "Constructing a family of conics by curvature-dependent offsetting from a given conic.",
            "Using Farin points for rational Bézier surfaces.",
            "A geometric interpretation of the diagonal of a tensor-product Bézier volume.",
            "Efficient and accurate B-rep generation of low degree sculptured solids using exact arithmetic: I - representations.",
            "Efficient and accurate B-rep generation of low degree sculptured solids using exact arithmetic: II - computation.",
            "Corner cutting algorithms associated with optimal shape preserving representations.",
            "Geometrical criteria on the higher order smoothness of composite surfaces."
        ]
    },
    {
        "name": "CAGD",
        "year": "1998",
        "info": "Volume 15, 1998",
        "count": 51,
        "papers": [
            "Shape preserving interpolation by space curves.",
            "The geometric meaning of Nielson's affine invariant norm.",
            "Linear convexity conditions for rectangular and triangular Bernstein-Bézier surfaces.",
            "A new family of convex splines for data interpolation.",
            "On calculating normalized Powell-Sabin B-splines.",
            "Curves with rational Frenet-Serret motion.",
            "Planar spirals that match G2 Hermite data.",
            "Results on nonsingular, cyclide transition surfaces.",
            "Proof of the nonintersection conjecture of Hoffmann and Peters.",
            "Applications of Laguerre geometry in CAGD.",
            "On integrating lines of curvature.",
            "Automatic triangular mesh generation of trimmed parametric surfaces for finite element analysis.",
            "A Laguerre geometric approach to rational offsets.",
            "Modified four-point scheme and its application.",
            "Geometric control of G2-cubic A-splines.",
            "Geometric continuity of ruled surfaces.",
            "Degree elevation for p-Bézier curves.",
            "Conformal maps defined about polynomial curves.",
            "IGB-offset for plane curves - loop removal by scanning of interval sequences.",
            "Numerical implicitization for intersection and Gn-continuous blending of surfaces.",
            "A method for determining knots in parametric curve interpolation.",
            "Recent methods for surface shape optimization.",
            "Analysis and applications of pipe surfaces.",
            "The 42 equivalence classes of quadratic surfaces in affine n-space.",
            "Grid-distortion on nonrectangular grids.",
            "Asymptotically optimum recovery of smooth contours by Bézier curve.",
            "Selfintersection of composite curves and surfaces.",
            "On the smoothness of offset surfaces.",
            "G2 curves composed of planar cubic and Pythagorean hodograph quintic spirals.",
            "Intersection approach to multi-point machining of sculptured surfaces.",
            "Differential geometry of G1 variable radius rolling ball blend surfaces.",
            "Degenerate point/curve and curve/curve bisectors arising in medial axis computations for planar domains with curved boundaries.",
            "Basis conversion among Bézier, Tchebyshev and Legendre.",
            "Blending two cones with Dupin cyclides.",
            "Determination and classification of triangular quadric patches.",
            "General cyclides.",
            "Curve offsetting based on Legendre series.",
            "Disk Bézier curves.",
            "Approximating spheres and sphere patches.",
            "Determination of end conditions for NURB surface interpolation.",
            "Geometric interpretation of continuity over triangular domains.",
            "Planar G1 Hermite interpolation with spirals.",
            "The moving line ideal basis of planar rational curves.",
            "A class of multivariate de Boor-Fix formulae.",
            "Circular arc approximation by quintic polynomial curves.",
            "A note on convexity-preserving interpolation subdivision.",
            "Global reparametrization for curve approximation.",
            "A shape controled fitting method for Bézier curves.",
            "Global convexity of curves and polygons.",
            "Harmonic rational Bézier curves, p-Bézier curves and trigonometric polynomials.",
            "Computing the derivative of NURBS with respect to a knot."
        ]
    },
    {
        "name": "CAGD",
        "year": "1997",
        "info": "Volume 14, 1997",
        "count": 60,
        "papers": [
            "A note about: on normal curvature discontinuity between tangent plane continuous patches.",
            "Shape preserving representations for trigonometric polynomial curves.",
            "Curve interpolation in recursively generated B-spline surfaces over arbitrary topology.",
            "Two different forms of C-B-splines.",
            "Geometry dependence of the dimension of spaces of piecewise polynomials on rectilinear partitions.",
            "Cyclides in pure blending I.",
            "Cyclides in pure blending II.",
            "A recurrence relation for rational B-splines.",
            "A new approach to the surface intersection problem.",
            "An O(h2n) Hermite approximation for conic sections.",
            "Optimal parameterizations.",
            "Curvature continuous interpolation of curve meshes.",
            "Geometric interpretation of smoothness conditions of triangular polynomial patches.",
            "Freeform splines.",
            "Interpolation on quadric surfaces with rational quadratic spline curves.",
            "Parametrization and smooth approximation of surface triangulations.",
            "Low-harmonic rational Bézier curves for trajectory generation of high-speed machinery.",
            "A univariate method for plane elastic curves.",
            "Inflections of planar surface curves.",
            "Visualization of curvature plots and evaluation of fairness: an analysis of the effect of 'scaling'.",
            "The circle as a smoothly joined BR-curve on [0, 1].",
            "Triangular NURBS and their dynamic generalizations.",
            "Construction of Bézier rectangles and triangles on the symmetric Dupin horn cyclide by means of inversion.",
            "Partial derivatives of rational Bézier surfaces.",
            "A counterexample to a theorem about the convexity of Powell-Sabin elements.",
            "Bilinear precision of rational Bézier surfaces.",
            "Trigonometric Bézier and Stancu polynomials over intervals and triangles.",
            "Generalizing rational degree elevation.",
            "Rational blending surfaces between quadrics.",
            "A geometric look at corner cutting.",
            "Corner cutting curves and a new characterization of Bézier and B-spline curves.",
            "Approximating a helix segment with a rational Bézier curve.",
            "Identification of inflection points and cusps on rational curves.",
            "Geometric curve approximation.",
            "Approximation of logarithmic spirals.",
            "Asymptotically optimal disposition of tangent points for approximation of smooth convex surfaces by polygonal functions.",
            "Systems of coordinates associated with points scattered in the plane.",
            "Concise parallel Dixon determinant.",
            "The dual basis functions for the generalized Ball basis of odd degree.",
            "Direct highlight line modification on nurbs surfaces.",
            "The hybrid quintic Bézier tetrahedron.",
            "Hermite interpolation with Tschirnhausen cubic spirals.",
            "Supercyclides and blending.",
            "On convexity of planar curves and its application in CAGD.",
            "Quartic supercyclides I: Basic theory.",
            "A simple, efficient degree raising algorithm for B-spline curves.",
            "Shaping and fairing of tubular B-spline surfaces.",
            "Fitting helices to data by total least squares.",
            "Geometric conditions for G3 continuity of surfaces.",
            "Shape preserving least-squares approximation by polynomial parametric spline curves.",
            "Degenerate Bézier patches with continuous curvature.",
            "Characterizing and efficiently computing quadrangulations of planar point sets.",
            "Improved surface bounds based on derivatives.",
            "Three-dimensional Bézier interpolation in solid modeling and grid generation.",
            "Control point surfaces over non-four-sided areas.",
            "Algebraic pruning: a fast technique for curve and surface intersection.",
            "Bivariate hermite subdivision.",
            "The uniqueness of Bézier control points.",
            "Interpolating G1-splines with rational offsets.",
            "A vegetarian approach to optimal parameterizations."
        ]
    },
    {
        "name": "CAGD",
        "year": "1996",
        "info": "Volume 13, 1996",
        "count": 51,
        "papers": [
            "Prescribing the length of parametric curves.",
            "Prescribing the length of rational Bézier curves.",
            "Minimal energy surfaces using parametric splines.",
            "Scattered data interpolation and approximation using bivariate C1 piecewise cubic polynomials.",
            "A note on surface inflections.",
            "On normal curvature discontinuity between tangent plane continuous patches.",
            "Curvature continuous spline surfaces over irregular meshes.",
            "Umbilics and lines of curvature for shape interrogation.",
            "Tessellation of trimmed NURB surfaces.",
            "Generalized convexity preserving transformations.",
            "C-curves: An extension of cubic curves.",
            "Conversion of a tringular Bézier patch into three rectangular Bézier patches.",
            "The elastic bending energy of Pythagorean-hodograph curves.",
            "Surface deformation with differential geometric structures.",
            "The algebra and geometry of Steiner and other quadratically parametrizable surfaces.",
            "Marsden's identity.",
            "A bicubic shape-preserving blending scheme.",
            "Bernstein-Bézier polynomials on spheres and sphere-like surfaces.",
            "Interactive surface correction based on a local approximation scheme.",
            "Elliptic grid generation using NURBS surfaces.",
            "Arbitrarily high degree elevation of Bézier representations.",
            "Coils.",
            "Pseudo-tensor product interpolation and blending with families of univariate schemes.",
            "Mean normal vector to a surface bounded by Bézier curves.",
            "Intersection of offsets of parametric surfaces.",
            "Monotonicity-preserving interpolation of nongridded data.",
            "Topologically reliable approximation of composite Bézier curves.",
            "Geometric continuity between adjacent Bézier patches and their constructions.",
            "The Gaussian and mean curvature criteria for curvature continuity between surfaces.",
            "Potential applications of Weingarten surfaces in CAGD, Part I: Weingarten surfaces and surface shape investigation.",
            "Real-time CNC interpolators for Pythagorean-hodograph curves.",
            "Sectional-curvature preserving skinning surfaces.",
            "Pipe surfaces with rational spine curve are rational.",
            "Improving Clough-Tocher interpolants.",
            "Planar osculating arc splines.",
            "Interpolation of curve data by blended generalized circles.",
            "Geometric Hermite interpolation with maximal orderand smoothness.",
            "A new insight into the Gn continuity of polynomial surfaces.",
            "Conditions for geometric continuity between polynomial and rational surface patches.",
            "A variational approach to subdivision.",
            "Nonuniform corner cutting.",
            "The geometry of optimal degree reduction of Bézier curves.",
            "In memory of John A. Gregory - Preface.",
            "Gregory-type patches bounded by low degree intergral curves for G2 continuity.",
            "A modification to the rational boundary Gregory patch.",
            "An approach of designing and controlling free-form surfaces by using NURBS boundary Gregory patches.",
            "Shape-preserving knot removal.",
            "G2 interpolation of free form curve networks by biquintic Gregory patches.",
            "Surface design using triangular patches.",
            "Theories of contact specified by connection matrices.",
            "Ensuring compatibility of G2-continuous surface patches around a nodepoint."
        ]
    },
    {
        "name": "CAGD",
        "year": "1995",
        "info": "Volume 12, 1995",
        "count": 55,
        "papers": [
            "Convexity-preserving interpolatory parametric splines of non-uniform polynomial degree.",
            "Boundary surface recovery from skeleton curves and surfaces.",
            "Bézier nets, convexity and subdivision on higher-dimensional simplices.",
            "Rational cubic curves as BR-curves.",
            "High order approximation method for curves.",
            "Point and tangent computation of tensor product rational Bézier surfaces.",
            "Computing values and derivatives of Bézier and B-spline tensor products.",
            "GCn continuity conditions for adjacent rational parametric surfaces.",
            "Cyclides in computer aided geometric design II.",
            "A unified approach to subdivision algorithms near extraordinary vertices.",
            "Rational curves and surfaces with rational offsets.",
            "Biquadratic G-spline surfaces.",
            "Filling gaps in the boundary of a polyhedron.",
            "Smoothing of free-form surfaces with Bézier patches.",
            "An implicitization algorithm with fewer variables.",
            "Knot removal for B-spline curves.",
            "Constructions of G1 continuous joins of rational Bézier patches.",
            "Tangent, normal, and visibility cones on Bézier surfaces.",
            "Detection of degenerate normal vectors on parametric surfaces: Tangent cone approach.",
            "A characterization of certain C2 discrete triangular interpolants.",
            "Implementation of a randomized algorithm for Delaunay and regular triangulations in three dimensions.",
            "De Casteljau's algorithm is an extrapolation method.",
            "The smoothing properties of variational schemes for surface design.",
            "A new approach towards free-form surfaces control.",
            "Hodographs and normals of rational curves and surfaces.",
            "Linear precision of rational Bézier curves.",
            "Linear precision of BR-curves.",
            "Recursive Gk transformations between adjacent Bézier surfaces.",
            "Convergence, error estimation and some properties of four-point interpolation subdivision scheme.",
            "The geometric interpretation of inversion formulae for rational plane curves.",
            "Axially parallel subsimplices and convexity.",
            "A note on Farin points for rational triangular Bézier patches.",
            "Developable rational Bézier and B-spline surfaces.",
            "Interactive design of constrained variational curves.",
            "A note on degenerate triangular Bézier patches.",
            "Rational parametric representation of parabolic cyclide: Formulation and applications.",
            "Geometric Hermite interpolation.",
            "Extending B-spline tools and algorithms to geometrically continuous splines: A study of similarities and differences.",
            "Offset-rational parametric plane curves.",
            "High-order approximation of conic sections by quadratic splines.",
            "Analysis of the offset to a parabola.",
            "Grid generation, finite elements, and geometric design.",
            "The legacy of automatic mesh generation from solid modeling.",
            "NURBS-based surface grid redistribution and remapping algorithms.",
            "Automatic generation of hexahedral finite element meshes.",
            "Aerospace applications of solution adaptive finite element analysis.",
            "Chain models and finite element analysis: An executable formulation of plane stress.",
            "An incremental algorithm for Betti numbers of simplicial complexes on the 3-sphere.",
            "Polyhedral perturbations that preserve topological form.",
            "Change of basis algorithms for surfaces in CAGD.",
            "Blending an implicit with a parametric surface.",
            "Smoothing rational B-spline curves using the weights in an optimization procedure.",
            "A note on a local twist estimator.",
            "A counterexample to a corollary of Kim et al..",
            "A note on degenerate normal vectors."
        ]
    },
    {
        "name": "CAGD",
        "year": "1994",
        "info": "Volume 11, 1994",
        "count": 39,
        "papers": [
            "Fairing composite polynomial curves with constraints.",
            "Convexity-preserving interpolatory subdivision.",
            "Surface intersection using parallelism.",
            "Virtual knot technique for curve fitting of rapidly varying data.",
            "The invariance of weak convexity conditions of B-nets with respect to subdivision.",
            "Remarks on an identity related to degree elevation.",
            "Nonnegative quadratic Bézier triangular patches.",
            "The bisector of a point and a plane parametric curve.",
            "Real functions for representation of rigid solids.",
            "Geometric contact for curves and surfaces.",
            "A data reduction scheme for triangulated surfaces.",
            "Approximation order from bivariate C1-cubics on a four-directional mesh is full.",
            "A simple verification of the implicitization formulae for Bézier curves.",
            "A fast algorithm to raise the degree of spline curves : Computer aided geometric design 8 (4) (October 1991) 253-265.",
            "Béézier representation of conics of contact in the projective plane.",
            "Parametric approximation of data using ODR splines.",
            "Thin plate spline surface approximation using Coons' patches.",
            "Data point selection for piecewise linear curve approximation.",
            "A G1 triangular spline surface of arbitrary topological type.",
            "Best approximations of symmetric surfaces by biquadratic Bézier surfaces.",
            "Reparameterization of rational triangular Bézier surfaces.",
            "The conformal map z -> z2 of the hodograph plane.",
            "Filling polygonal holes with bicubic patches.",
            "Using general polar values as control points for polynomial curves.",
            "Curvature-sign-type boundary conditions in parametric cubic-spline interpolation.",
            "Degenerate polynomial patches of degree 4 and 5 used for geometrically smooth interpolation in 3.",
            "Canal surfaces versus normal ringed surfaces.",
            "Data point selection for piecewise trilinear approximation.",
            "Single-valued surfaces in spherical coordinates.",
            "Curves with quadric boundary precision.",
            "Minimization, constraints and composite Bézier curves.",
            "Single-valued tubular patches.",
            "On Degen's conjecture.",
            "Computing a chain of blossoms, with application to products of splines.",
            "Curvature approximation of 3D manifolds in 4D space.",
            "Totally positive bases for shape preserving curve design and optimality of B-splines.",
            "Curvature analysis and visualization for functions defined on Euclidean spaces or surfaces.",
            "Construction of a VC1 interpolant over triangles via edge deletion.",
            "Curve implicitization using moving lines."
        ]
    },
    {
        "name": "CAGD",
        "year": "1993",
        "info": "Volume 10, 1993",
        "count": 37,
        "papers": [
            "A new intersection algorithm for cyclides and swept surfaces using circle decomposition.",
            "Specifying the arc length of Bézier curves.",
            "Error estimates for approximations from control nets.",
            "Approximating constrained tetrahedrizations.",
            "Cubicoids: modeling and visualization.",
            "A geometrical approach to curvature continuous joints of rational curves.",
            "Tighter convex hulls for rational Bézier curves.",
            "On the convexity of functional splines.",
            "Surface fitting to scattered data by a sum of Gaussians.",
            "Visually smooth composite surfaces for an unevenly spaced 3D data array.",
            "Free-form curves and free-form surfaces.",
            "An affine representation of de Casteljau's and de Boor's rational algorithms.",
            "The geometry of Tchebycheffian splines.",
            "An algebraic approach to curves and surfaces on the sphere and on other quadrics.",
            "Some remarks on quadrics.",
            "Degree reduction of Bézier curves.",
            "Enhancement of Gordon-Coons interpolations by \"bubble functions\".",
            "An implementation of triangular B-spline surfaces over arbitrary triangulations.",
            "A parallel multistage method for surface/surface intersection.",
            "High accurate rational approximation of parametric curves.",
            "Multiperiodic functions for surface design.",
            "Computing optimal triangulations using simulated annealing.",
            "Smooth free-form surfaces over irregular meshes generalizing quadratic splines.",
            "On rational parametric curve approximation.",
            "Computation of the solutions of nonlinear polynomial systems.",
            "Computation of singularities and intersections of offsets of planar curves.",
            "Surfaces with prescribed curvature I.",
            "Using graphs of bivariate functions to locally represent and modify surfaces.",
            "Rational linear reparametrization of NURBS and the blossoming principle.",
            "Adding flexibility to piecewise quadratic curves and surfaces.",
            "Dual bases of a Bernstein polynomial basis on simplices.",
            "Hermite interpolation with a pair of spirals.",
            "A new quadratic and biquadratic algorithm for curve and surface estimation.",
            "The convexity of parametric Bézier triangular patches of degree 2.",
            "Transforming triangulations in polygonal domains.",
            "Computer-aided geometric design and panel generation for hull forms based on rational cubic Bézier curves.",
            "Algebraically rectifiable parametric curves."
        ]
    },
    {
        "name": "CAGD",
        "year": "1992",
        "info": "Volume 9, 1992",
        "count": 38,
        "papers": [
            "Detecting cusps and inflection points in curves.",
            "Algorithm for implicitizing rational parametric surfaces.",
            "Interpolation on surfaces using minimum norm networks.",
            "A short proof of an algorithm by Boehm.",
            "Blossoming Marsden's identity.",
            "Controlling the curvature of a quadratic Bézier curve.",
            "Degree, multiplicity, and inversion formulas for rational surfaces using u-resultants.",
            "On a tolerance problem of parametric curves and surfaces.",
            "Is there a geometric variation diminishing property for B-spline or Bézier surfaces?",
            "An analysis of symmetry for plane curves and plane curve algorithms.",
            "Some remarks on geometric continuity of rational surface patches.",
            "Derivatives of rational Bézier curves.",
            "Another knot insertion algorithm for B-spline curves.",
            "Fillet and surface intersections defined by rolling balls.",
            "Nonnegativity of bivariate quadratic functions on a triangle.",
            "Optimised biarc curves with tension.",
            "Surface compression.",
            "Curvature computations for degenerate surface patches.",
            "Note on the RGB-patch concept.",
            "Convexity preserving interpolation and Powell-Sabin elements.",
            "Developable (1, n) - Bézier surfaces.",
            "Envelopes of moving quadric surfaces.",
            "Monotone linear rational spline interpolation.",
            "Curvature continuity between adjacent rational Bézier patches.",
            "Interpolating scattered multivariate data as a function of time.",
            "Systematic derivation of spline bases.",
            "Fat surfaces: a trivariate approach to triangle-based interpolation on surfaces.",
            "A C2-quintic spline interpolation scheme on triangulation.",
            "Joining smooth patches around a vertex to form a Ck surface.",
            "The neutral case for the min-max angle criterion: a generalized concept.",
            "Behavior of the beta-splines with values of the parameters beta2 negative.",
            "Calculations of curvature continuous cubic splines.",
            "Dual Bézier curves and convexity preserving interpolation.",
            "The rational cubic Bézier representation of conics.",
            "Delaunay triangulations in three dimensions with finite precision arithmetic.",
            "Irreducible decomposition of algebraic varieties via characteristics sets and Gröbner bases.",
            "Marching along surfacesurface intersection curves with an adaptive step length.",
            "Minimal roughness property of the Delaunay triangulation: a shorter approach."
        ]
    },
    {
        "name": "CAGD",
        "year": "1991",
        "info": "Volume 8, 1991",
        "count": 41,
        "papers": [
            "The convexity of quadratic parametic triangular Bernstein-Bézier surfaces.",
            "Overlap patches: a new scheme for interpolating curve networks with n-sided regions.",
            "On the stability of transformations between power and Bernstein polynomial forms.",
            "Inflections on curves in two and three dimensions.",
            "Geometric continuity.",
            "Approximation and geometric modeling with simplex B-splines associated with irregular triangles.",
            "Surface interpolation on irregular networks with normal conditions.",
            "Geometric hermite approximation of surface patch intersection curves.",
            "Shape preserving properties of the generalised ball basis.",
            "Construction of three-dimensional Delaunay triangulations using local transformations.",
            "Four point parabolic interpolation.",
            "Real rational curves are not 'unit speed'.",
            "General b-spline hermite interpolation.",
            "A guided clothoid spline.",
            "Convexity of Bézier nets on triangulations.",
            "Detecting the intersection of convex objects in the plane.",
            "The singularity of Morgan-Scott triangulation.",
            "Convexity of Bézier nets on sub-triangles.",
            "Möbius reparametrizations of rational B-splines.",
            "Local surface interpolation with Bézier patches: errata and improvements.",
            "A note on control polygons and derivatives.",
            "Approximation of circular arcs by cubic polynomials.",
            "Vertex based data dependent triangulations.",
            "A fast algorithm to raise the degree of spline curves.",
            "Parameter optimization in approximating curves and surfaces to measurement data.",
            "An efficient algorithm for subdividing linear Coons surfaces.",
            "Simplicial pivoting for mesh generation of implicity defined surfaces.",
            "A robust method for calculating the simplicity and orientation of planar polygons.",
            "A new method of evaluating compact geometric bounds for use in subdivision algorithms.",
            "Practical curves and surfaces for a geometric modeler.",
            "A local scheme for bivariate co-monotone interpolation.",
            "Variational design of smooth rational Bézier curves.",
            "On determining start points for a surface/surface intersection algorithm.",
            "Interpolation with developable Bézier patches.",
            "Delaunay triangulation of arbitrarily shaped planar domains.",
            "On Hermite interpolation with B-splines.",
            "Joining rational curves smoothly.",
            "Multivariate Bernstein polynomials and convexity.",
            "Algorithms for generating B-nets and graphically displaying spline surfaces on three- and four-directional meshes.",
            "High-order implicit blending surfaces of low degree.",
            "A characterization theorem of multivariate splines in blossoming form."
        ]
    },
    {
        "name": "CAGD",
        "year": "1990",
        "info": "Volume 7, 1990",
        "count": 40,
        "papers": [
            "A rational cubic spline with tension.",
            "Constructing piecewise rational curves with Frenet frame continuity.",
            "Good approximation of circles by curvature-continuous Bézier curves.",
            "Fairing Bézier curves with constraints.",
            "Symmetric triangular algorithms for curves.",
            "Blossoming and knot insertion algorithms for B-spline curves.",
            "Analytic properties of plane offset curves.",
            "Algebraic properties of plane offset curves.",
            "Using parameters to increase smoothness of curves and surfaces generated by subdivision.",
            "Finite quadric segments with four conic boundary curves.",
            "GC1 continuity conditions between two adjacent rational Bézier surface patches.",
            "Necessary and sufficient conditions for tangent plane continuity of Bézier surfaces.",
            "Explicit continuity conditions for adjacent Bézier surface patches.",
            "Local smooth surface interpolation: a classification.",
            "G-splines.",
            "Gn∗-functional splines for interpolation and approximation of curves, surfaces and solids.",
            "Cyclides in computer aided geometric design.",
            "On cyclides in geometric modeling.",
            "A marching method for parametric surface/surface intersection.",
            "Surfaces over Dirichlet tessellations.",
            "Cubic spline fitting using data dependent triangulations.",
            "Interpolation of scattered data on closed surfaces.",
            "Modified multiquadric methods for scattered data interpolation over a sphere.",
            "Surfaces defined on surfaces.",
            "Contouring a bivariate quadratic polynomial over a triangle.",
            "Visibility of surfaces via differential geometry.",
            "Local surface interpolation with shape parameters between adjoining Gregory patches.",
            "Local corner cutting and the smoothness of the limiting curve.",
            "Modelling rolling ball blends for computer aided geometric design.",
            "Convergence of a surface/surface intersection algorithm.",
            "de Boor - fix functionals and polar forms.",
            "The neutral case for the min-max triangulation.",
            "Smooth interpolation to scattered data by bivariate piecewise polynomials of odd degree.",
            "On the convexity of parametric Bézier triangular surfaces.",
            "Optimal twist vectors as a tool for interpolating a network of curves with a minimum energy surface.",
            "The intersection of a bicubic Bézier patch and a plane.",
            "Minimal roughness property of the Delaunay triangulation.",
            "Local cubic and bicubic C1 surface interpolation with linearly varying boundary normal.",
            "A dimensionality paradigm for surface interrogations.",
            "The singular cases for -spline interpolation."
        ]
    },
    {
        "name": "CAGD",
        "year": "1989",
        "info": "Volume 6, 1989",
        "count": 32,
        "papers": [
            "Polynomial bases for quadratic and cubic polynomials which yield control points with small convex hulls.",
            "Bézier patches on cubic grid curves - An application to the preliminary design of a yacht hull surface.",
            "A new multiaffine approach to B-splines.",
            "Piecewise parametric approximations for algebraic curves.",
            "Geometric continuous patch complexes.",
            "A C2 polygonal surface patch.",
            "Computing frames along a trajectory.",
            "Representations for parametric cubic splines.",
            "Yet another proof of knot insertion.",
            "Letter to the editor.",
            "Surface lofting and smoothing with skeletal-lines.",
            "Surface interpolation with tension controls using cardinal bases.",
            "Design of an n-sided surface patch from Hermite boundary data.",
            "The numerical problem of using Bézier curves and surfaces in the power basis.",
            "Computing zeroes of spline functions.",
            "On computing the intersection of a pair of algebraic surfaces.",
            "Approximate conversion of rational splines.",
            "Errata: G1 interpolation of generally unrestricted cubic Bézier curves.",
            "A Greville-like formula for -spline functions.",
            "Hermite interpolation with B-splines.",
            "On convexity of piecewise polynomial functions on triangulations.",
            "Approximate conversion of rational B-spline patches.",
            "Fat arcs: A bounding region with cubic convergence.",
            "Interpolation with piecewise quadratic visually C2 Bézier polynomials.",
            "A set operation algorithm for sculptured solids modeled with trimmed patches.",
            "Decomposing algebraic sets using Gröbner bases.",
            "An analysis of invariant curves.",
            "Generating the Bézier points of a -spline curve.",
            "Optimal approximate conversion of spline surfaces.",
            "Projectively invariant classes of geometric continuity for CAGD.",
            "Blossoms are polar forms.",
            "A note on blossoming."
        ]
    },
    {
        "name": "CAGD",
        "year": "1988",
        "info": "Volume 5, 1988",
        "count": 28,
        "papers": [
            "Algorithms for polynomials in Bernstein form.",
            "Intrinsic parametrization for approximation.",
            "Spline approximation of offset curves.",
            "Including shape handles in recursive subdivision surfaces.",
            "Finding the composite outer boundary and holes of a set of closed curves.",
            "Bézier curves of positive curvature.",
            "On de Boor-like algorithms and blossoming.",
            "Knot insertion from a blossoming point of view.",
            "Surface shape control using constrained optimization on the B-spline representation.",
            "A shape preserving interpolant with tension controls.",
            "Dual bases of multivariate Bernstein-Bézier polynomials.",
            "An algorithm for constructing convexity and monotonicity-preserving splines in tension.",
            "Parametric cubics as algebraic curves.",
            "Loop detection in surface patch intersections.",
            "A recursive proof of a B-spline identity for degree elevation.",
            "A trivariate Powell-Sabin interpolant.",
            "Realistic computer graphics and free form surfaces.",
            "Chebyshev economization for parametric surfaces.",
            "Conditions for avoiding loss of geometric continuity on spline curves.",
            "On the numerical condition of algebraic curves and surfaces 1. Implicit equations.",
            "Genus of the intersection curve of two rational surface patches.",
            "Some remarks on Bézier curves.",
            "An improved condition for the convexity and positivity of Bernstein-Bézier surfaces over triangles.",
            "Dual bases for spline spaces on cells.",
            "Tracing surface intersections.",
            "Automatic parameterization of rational curves and surfaces III: Algebraic plane curves.",
            "Shape preserving interpolation by curvature continuous parametric curves.",
            "Polygonization of implicit surfaces."
        ]
    },
    {
        "name": "CAGD",
        "year": "1987",
        "info": "Volume 4, 1987",
        "count": 30,
        "papers": [
            "Preface.",
            "Surface/surface intersection.",
            "Bézier presentation of airfoils.",
            "G1 interpolation of generally unrestricted cubic Bézier curves.",
            "Interpolation over a sphere based upon a minimum norm network.",
            "Approximate conversion of spline curves.",
            "Rational geometric splines.",
            "Geometric continuity and convex combination patches.",
            "Fairing cubic B-spline curves.",
            "Minimally supported bases for spaces of bivariate piecewise polynomials of smoothness r and degree d 4r + 1.",
            "Cutting corners always works.",
            "Computing curves invariant under halving.",
            "Extended octtree representation of free form surfaces.",
            "On the use of infinite control points in CAGD.",
            "Honoring Pierre Bézier.",
            "Piecewise quadric blending of implicitly defined surfaces.",
            "On the numerical condition of polynomials in Bernstein form.",
            "Knot removal for parametric B-spline curves and surfaces.",
            "Automatic smoothing with geometric surface patches.",
            "C1 trivariate polynomial interpolation.",
            "Rates of convergence of Bézier net over triangles.",
            "An example of bivariate interpolation with translates of C0-quadratic box-splines on a three direction mesh.",
            "A 4-point interpolatory subdivision scheme for curve design.",
            "High accuracy geometric Hermite interpolation.",
            "Local surface interpolation with Bézier patches.",
            "Interpolating curves with gradual changes in curvature.",
            "An iterative method for computing multivariate C1 piecewise polynomial interpolants.",
            "Computing surfaces invariant under subdivision.",
            "The octant of a sphere as a non-degenerate triangular Bézier patch.",
            "Rational hodographs."
        ]
    },
    {
        "name": "CAGD",
        "year": "1986",
        "info": "Volume 3, 1986",
        "count": 23,
        "papers": [
            "Bicubic patches for approximating non-rectangular control-point meshes.",
            "The approximation of non-degenerate offset surfaces.",
            "The sphere as a rational Bézier surface.",
            "A representation of a C2 interpolant over triangles.",
            "Improperly parametrized rational curves.",
            "Letter to the editor.",
            "Letter to the editor.",
            "Triangular Bernstein-Bézier patches.",
            "Offsetting operations in solid modelling.",
            "Efficient evaluation of multivariate polynomials.",
            "The Wilson-Fowler spline is a v-spline.",
            "Scattered data interpolation and approximation with error bounds.",
            "Geometric surface patches without twist constraints.",
            "On the piecewise structure of discrete box splines.",
            "On invariant curve forms.",
            "Error analysis for piecewise quadratic curve fitting algorithms.",
            "Two moving coordinate frames for sweeping along a 3D trajectory.",
            "Properties of n-dimensional triangulations.",
            "Recursive subdivision without the convex hull property.",
            "Computing area filling contours for surfaces defined by piecewise polynomials.",
            "Local control of interval tension using weighted splines.",
            "Surface algorithms using bounds on derivatives.",
            "Cardinal interpolation: A bivariate polynomial example."
        ]
    },
    {
        "name": "CAGD",
        "year": "1985",
        "info": "Volume 2, 1985",
        "count": 36,
        "papers": [
            "Surfaces in computer aided geometric design: a survey with new results.",
            "A modified Clough-Tocher interpolant.",
            "Bernstein-Bézier methods for the construction of bivariate spline approximants.",
            "Families of adjoint patches for a Bézier triangular surface.",
            "Interpolation to boundary data on the simplex.",
            "Piecewise algebraic surface patches.",
            "Triangular spline algorithms.",
            "Generalized subdivision and convergence.",
            "Line average algorithm: A method for the computer generation of smooth surfaces.",
            "Thin plate splines with tension.",
            "Smoothing of curves and surfaces.",
            "C2 interpolation over hypercubes.",
            "Monotonicity preserving bicubic interpolation: A progress report.",
            "Approximate conversion of surface representations with polynomial bases.",
            "Knot line refinement algorithms for tensor product B-spline surfaces.",
            "On the efficiency of knot insertion algorithms.",
            "Bernstein-Bézier representation of volumes.",
            "Representation of quadric primitives by rational polynomials.",
            "Increasing the smoothness of bicubic spline surfaces.",
            "Smooth parametric surface approximations to discrete data.",
            "Implementation of a divide-and-conquer method for intersection of parametric surfaces.",
            "A multidimensional surface problem: pressure on a wing.",
            "Finding intersections of B-spline represented geometries using recursive subdivision techniques.",
            "An area-oriented analytical visibility method for displaying parametrically defined tensor-product surfaces.",
            "Integrating patch models for hydrostatics.",
            "Geometry cells and surface definition by finite elements.",
            "Geometric spline curves.",
            "Rates of convergence of control polygons.",
            "The method of resolvents: A technique for the implicitization, inversion, and intersection of non-planar, parametric, rational cubic curves.",
            "Exact offset procedures for simple solids.",
            "Derivative generation from multivariate scattered data by functional minimization.",
            "Smooth closed surfaces with discrete triangular interpolants.",
            "Some remarks concerning B-splines.",
            "Curvature continuous curves and surfaces.",
            "Some remarks on V2-splines.",
            "Letter to the editor."
        ]
    },
    {
        "name": "CAGD",
        "year": "1984",
        "info": "Volume 1, 1984",
        "count": 28,
        "papers": [
            "Preface.",
            "A survey of curve and surface methods in CAGD.",
            "Adaptive contouring of three-dimensional surfaces.",
            "Non-four-sided patch expressions with control points.",
            "A pentagonal surface patch for computer aided geometric design.",
            "A short proof of the Oslo algorithm.",
            "Uccello's chalice.",
            "Smooth interpolation over hypercubes.",
            "Subdivision algorithms for the generation of box spline surfaces.",
            "Discrete box splines and refinement algorithms.",
            "Calculating with box splines.",
            "Detecting surface irregularities using isophotes.",
            "A trivariate clough-tocher scheme for tetrahedral data.",
            "Detecting regions with undesirable curvature.",
            "Degree elevation of B-spline curves.",
            "A locally controllable spline with tension for interactive curve design.",
            "Design techniques for the definition of solid objects with free-form geometry.",
            "Efficient editing of solid models by exploiting structural and spatial locality.",
            "Planar piecewise algebraic curves.",
            "A bivariate C2 Clough-Tocher scheme.",
            "Linear subdivision is strictly a polynomial phenomenon.",
            "An improved condition for the convexity of Bernstein-Bézier surfaces over triangles.",
            "A geometric interpretation of convexity conditions for surfaces.",
            "Curves under tension.",
            "Degenerate parametric curves.",
            "The Cayley method in computer aided geometric design.",
            "Vector elimination: A technique for the implicitization, inversion, and intersection of planar parametric rational polynomial curves.",
            "A modified C2 Coons' patch."
        ]
    }
]