[
    {
        "name": "CGTA",
        "year": "2022",
        "info": "2022: Volumes\n100,\n101,\n102,\n103,\n104,",
        "count": 29,
        "papers": [
            "Distinct distances with ℓp metrics.",
            "Improved algorithms for the bichromatic two-center problem for pairs of points.",
            "δ-Greedy t-spanner.",
            "Sparse hop spanners for unit disk graphs.",
            "A linear optimization oracle for zonotope computation.",
            "Closest-pair queries and minimum-weight queries are equivalent for squares.",
            "Between shapes, using the Hausdorff distance.",
            "On the plane angle-monotone graphs.",
            "Linear-size planar Manhattan network for convex point sets.",
            "Minimum rectilinear polygons for given angle sequences.",
            "Preface.",
            "Persistent homology in ℓ∞ metric.",
            "Corrigendum to \"Approximating the minimum closest pair distance and nearest neighbor distances of linearly moving points\" [Comput. Geom. 60 (2017) 2-7].",
            "Terrain-like graphs: PTASs for guarding weakly-visible polygons and terrains.",
            "Fréchet distance between two point sets.",
            "Inserting an edge into a geometric embedding.",
            "Extremal convex polygons inscribed in a given convex polygon.",
            "Computing maximum independent set on outerstring graphs and their relatives.",
            "The prefix Fréchet similarity.",
            "Planar rectilinear drawings of outerplanar graphs in linear time.",
            "Isometric and affine copies of a set in volumetric Helly results.",
            "Expected size of random Tukey layers and convex layers.",
            "Ununfoldable polyhedra with 6 vertices or 6 faces.",
            "Minimum-link shortest paths for polygons amidst rectilinear obstacles.",
            "Edge guards for polyhedra in three-space.",
            "Efficient segment folding is hard.",
            "The maximum exposure problem.",
            "Routing by matching on convex pieces of grid graphs.",
            "A note on the minimum number of red lines needed to pierce the intersections of blue lines."
        ]
    },
    {
        "name": "CGTA",
        "year": "2021",
        "info": "2021: Volumes\n92,\n93,\n94,\n95,\n96,\n97,\n98,\n99",
        "count": 56,
        "papers": [
            "Two theorems on point-flat incidences.",
            "An improved construction for spanners of disks.",
            "Soft subdivision motion planning for complex planar robots.",
            "Improved PTASs for convex barrier coverage.",
            "Rectilinear link diameter and radius in a rectilinear polygonal domain.",
            "Smallest universal covers for families of triangles.",
            "On pseudo-disk hypergraphs.",
            "Tilings of the regular N-gon with triangles of angles π/N, π/N, (N - 2)π/N for N = 5, 8, 10 and 12.",
            "On the minimum-area rectangular and square annulus problem.",
            "I/O-efficient 2-d orthogonal range skyline and attrition priority queues.",
            "Computation of spatial skyline points.",
            "Dynamic layers of maxima with applications to dominating queries.",
            "Folding polyominoes with holes into a cube.",
            "On the approximation of shortest escape paths.",
            "Maximum-area and maximum-perimeter rectangles in polygons.",
            "Angle-monotonicity of Delaunay triangulation.",
            "Minimum ply covering of points with disks and squares.",
            "Minimum cuts in geometric intersection graphs.",
            "Geometric firefighting in the half-plane.",
            "Flipping in spirals.",
            "On the number of order types in integer grids of small size.",
            "Empty rainbow triangles in k-colored point sets.",
            "Guarantees on nearest-neighbor condensation heuristics.",
            "An algorithm for the construction of the tight span of finite subsets of the Manhattan plane.",
            "Largest and smallest area triangles on imprecise points.",
            "Distance measures for embedded graphs.",
            "Euclidean minimum spanning trees with independent and dependent geometric uncertainties.",
            "Coloring Delaunay-edges and their generalizations.",
            "Influence-based Voronoi diagrams of clusters.",
            "Maximum-width empty square and rectangular annulus.",
            "Attraction-convexity and normal visibility.",
            "Characterization and computation of feasible trajectories for an articulated probe with a variable-length end segment.",
            "A note on empty balanced tetrahedra in two-colored point sets in R3.",
            "A linear-time algorithm for radius-optimally augmenting paths in a metric space.",
            "Implementing straight skeletons with exact arithmetic: Challenges and experiences.",
            "An efficient three-dimensional face recognition system based random forest and geodesic curves.",
            "Efficient planar two-center algorithms.",
            "On the upper bound on the average distance from the Fermat-Weber center of a convex body.",
            "Faradžev Read-type enumeration of non-isomorphic CC systems.",
            "The minimum area spanning tree problem: Formulations, Benders decomposition and branch-and-cut algorithms.",
            "A 2D advancing-front Delaunay mesh refinement algorithm.",
            "Continuous flattening of all polyhedral manifolds using countably infinite creases.",
            "Piercing pairwise intersecting geodesic disks.",
            "Bisecting three classes of lines.",
            "Snipperclips: Cutting tools into desired polygons using themselves.",
            "Impartial achievement games on convex geometries.",
            "Sparse convex hull coverage.",
            "Simultaneous visibility representations of undirected pairs of graphs.",
            "Grid drawings of graphs with constant edge-vertex resolution.",
            "Concatenation arguments and their applications to polyominoes and polycubes.",
            "Labeling nonograms: Boundary labeling for curve arrangements.",
            "Largest triangles in a polygon.",
            "Unfolding polycube trees with constant refinement.",
            "Solving the minimum convex partition of point sets with integer programming.",
            "Structured discrete shape approximation: Theoretical complexity and practical algorithm.",
            "Shortest rectilinear path queries to rectangles in a rectangular domain."
        ]
    },
    {
        "name": "CGTA",
        "year": "2020",
        "info": "2020: Volumes\n86,\n87,\n88,\n89,\n90,\n91",
        "count": 51,
        "papers": [
            "Introducing article numbering to Computational Geometry: Theory and Applications.",
            "Balanced line separators of unit disk graphs.",
            "Optimally guarding 2-reflex orthogonal polyhedra by reflex edge guards.",
            "k-Sets and rectilinear crossings in complete uniform hypergraphs.",
            "On compact packings of the plane with circles of three radii.",
            "Special Issue on the 33rd European Workshop on Computational Geometry, Guest Editors' Foreword.",
            "Routing in polygonal domains.",
            "K-dominance in multidimensional data: Theory and applications.",
            "Self-approaching paths in simple polygons.",
            "How to play hot and cold.",
            "Topological inference of manifolds with boundary.",
            "Optimal Art Gallery Localization is NP-hard.",
            "Special issue on the 29th Canadian Conference on Computational Geometry, Guest Editors' foreword.",
            "The most-likely skyline problem for stochastic points.",
            "Packing boundary-anchored rectangles and squares.",
            "Problems on track runners.",
            "On the shortest separating cycle.",
            "Progressive simplification of polygonal curves.",
            "Approximation algorithms for geometric conflict free covering problems.",
            "Colored anchored visibility representations in 2D and 3D space.",
            "Middle curves based on discrete Fréchet distance.",
            "Plane hop spanners for unit disk graphs: Simpler and better.",
            "Computing multiparameter persistent homology through a discrete Morse-based approach.",
            "Evacuating equilateral triangles and squares in the face-to-face model.",
            "Shortest paths and convex hulls in 2D complexes with non-positive curvature.",
            "Hamiltonicity for convex shape Delaunay and Gabriel graphs.",
            "Fast and compact planar embeddings.",
            "Minimizing the continuous diameter when augmenting a geometric tree with a shortcut.",
            "Preface.",
            "Universal hinge patterns for folding strips efficiently into any grid polyhedron.",
            "Extending Erdős-Beck's theorem to higher dimensions.",
            "Gathering by repulsion.",
            "1-bend upward planar slope number of SP-digraphs.",
            "Symmetric assembly puzzles are hard, beyond a few pieces.",
            "An application of the universality theorem for Tverberg partitions to data depth and hitting convex sets.",
            "Improved approximation bounds for the minimum constraint removal problem.",
            "Parallel computation of alpha complexes for biomolecules.",
            "Foreword.",
            "Packing plane spanning trees into a point set.",
            "Approximate range closest-pair queries.",
            "Trajectory planning for an articulated probe.",
            "Finding minimum witness sets in orthogonal polygons.",
            "Dihedral deformation and rigidity.",
            "Reconstructing embedded graphs from persistence diagrams.",
            "Output sensitive algorithms for approximate incidences and their applications.",
            "Combinatorics of beacon-based routing in three dimensions.",
            "Extending upward planar graph drawings.",
            "Range closest-pair search in higher dimensions.",
            "Two disjoint 5-holes in point sets.",
            "Preface.",
            "Covering the plane by a sequence of circular disks with a constraint."
        ]
    },
    {
        "name": "CGTA",
        "year": "2019",
        "info": "2019: Volumes\n76,\n77,\n78,\n79,\n80,\n81,\n82,\n83,\n84,\n85",
        "count": 45,
        "papers": [
            "Locally correct Fréchet matchings.",
            "Spectral concentration and greedy k-clustering.",
            "Computing a minimum-width square or rectangular annulus with outliers.",
            "Editorial: Special issue on the 26th Canadian Conference on Computational Geometry (CCCG).",
            "Computing the geodesic centers of a polygonal domain.",
            "Kinetic k-Semi-Yao graph and its applications.",
            "Drawing plane triangulations with few segments.",
            "The minimum convex container of two convex polytopes under translations.",
            "Cross-sections of line configurations in R3 and (d - 2)-flat configurations in Rd.",
            "The VC-dimension of visibility on the boundary of monotone polygons.",
            "FO model checking on geometric graphs.",
            "(Weakly) Self-approaching geometric graphs and spanners.",
            "New pruning rules for the Steiner tree problem and 2-connected Steiner network problem.",
            "Geometric clustering in normed planes.",
            "Dynamic conflict-free colorings in the plane.",
            "Covering segments with unit squares.",
            "Bounds on the cost of compatible refinement of simplex decomposition trees in arbitrary dimensions.",
            "Bottleneck detour tree of points on a path.",
            "Shortcuts for the circle.",
            "Minimizing the sum of distances to a server in a constraint network.",
            "A lower bound on opaque sets.",
            "Faster algorithms for growing prioritized disks and rectangles.",
            "Tight bounds for beacon-based coverage in simple rectilinear polygons.",
            "An improved upper bound on dilation of regular polygons.",
            "Finding axis-parallel rectangles of fixed perimeter or area containing the largest number of points.",
            "Flip distance to some plane configurations.",
            "Assigning weights to minimize the covering radius in the plane.",
            "Delaunay simplices in diagonally distorted lattices.",
            "Approximating the rectilinear crossing number.",
            "Packing plane spanning graphs with short edges in complete geometric graphs.",
            "On the expected diameter, width, and complexity of a stochastic convex hull.",
            "Approximating dominating set on intersection graphs of rectangles and L-frames.",
            "Computing a geodesic two-center of points in a simple polygon.",
            "Closest-pair queries in fat rectangles.",
            "Area bounds of rectilinear polygons realized by angle sequences.",
            "Special Issue on the 34th European Workshop on Computational Geometry, Guest Editors' Foreword.",
            "Partially walking a polygon.",
            "On Romeo and Juliet problems: Minimizing distance-to-sight.",
            "Altitude terrain guarding and guarding uni-monotone polygons.",
            "A new lower bound on the maximum number of plane graphs using production matrices.",
            "Compact drawings of 1-planar graphs with right-angle crossings and few bends.",
            "Convexity-increasing morphs of planar graphs.",
            "Finding pairwise intersections of rectangles in a query rectangle.",
            "On topological graphs with at most four crossings per edge.",
            "A product inequality for extreme distances."
        ]
    },
    {
        "name": "CGTA",
        "year": "2018",
        "info": "2018: Volumes\n67,\n68,\n69,\n70-71,\n72,\n73,\n74,\n75,",
        "count": 56,
        "papers": [
            "Acknowledgement of priority - A fractional Helly theorem for boxes.",
            "A note on interference in random networks.",
            "Homotopic 𝒞-oriented routing with few links and thick edges.",
            "On the number of touching pairs in a set of planar curves.",
            "Reversibility properties of the fire-fighting problem in graphs.",
            "Continuous Yao graphs.",
            "Editorial: Special issue in memory of Dr. Ferran Hurtado.",
            "Note on k-planar crossing numbers.",
            "Point sets with many non-crossing perfect matchings.",
            "Routing in a polygonal terrain with the shortest beacon watchtower.",
            "Cone-based spanners of constant degree.",
            "Connecting a set of circles with minimum sum of radii.",
            "Linear transformation distance for bichromatic matchings.",
            "Combinatorics and complexity of guarding polygons with edge and point 2-transmitters.",
            "Modem illumination of monotone polygons.",
            "Multiple covers with balls I: Inclusion-exclusion.",
            "Forest-like abstract Voronoi diagrams in linear time.",
            "On Hamiltonian alternating cycles and paths.",
            "The hamburger theorem.",
            "Table cartogram.",
            "Strong matching of points with geometric shapes.",
            "Arc diagrams, flip distances, and Hamiltonian triangulations.",
            "Pachinko.",
            "The dual diameter of triangulations.",
            "Minimum rectilinear Steiner tree of n points in the unit square.",
            "Colored spanning graphs for set visualization.",
            "On the 𝒪β of a planar point set.",
            "Colored ray configurations.",
            "Flipping edge-labelled triangulations.",
            "A fast algorithm for computing irreducible triangulations of closed surfaces in 𝔼d.",
            "Editor's note.",
            "Distinct distances between points and lines.",
            "T-shape visibility representations of 1-planar graphs.",
            "On triangle cover contact graphs.",
            "Two optimization problems for unit disks.",
            "Approximating the integral Fréchet distance.",
            "Thread-parallel mesh improvement using face and edge swapping and vertex insertion.",
            "γ-Soft packings of rectangles.",
            "Reconstruction of the path graph.",
            "On piercing numbers of families satisfying the (p, q)r property.",
            "Visibility representations of boxes in 2.5 dimensions.",
            "On the complexity of barrier resilience for fat regions and bounded ply.",
            "Editorial: EuroCG2015.",
            "Computing the similarity between moving curves.",
            "Parallelized ear clipping for the triangulation and constrained Delaunay triangulation of polygons.",
            "Tight bounds for conflict-free chromatic guarding of orthogonal art galleries.",
            "Time-space trade-offs for triangulations and Voronoi diagrams.",
            "Exact Minkowski sums of polygons with holes.",
            "Elastic geometric shape matching for translations under the Manhattan norm.",
            "On the separability of stochastic geometric objects, with applications.",
            "The geodesic 2-center problem in a simple polygon.",
            "Holes in 2-convex point sets.",
            "Constrained generalized Delaunay graphs are plane spanners.",
            "On a conjecture of Karasev.",
            "An improved algorithm for diameter-optimally augmenting paths in a metric space.",
            "Bumpy pyramid folding."
        ]
    },
    {
        "name": "CGTA",
        "year": "2017",
        "info": "2017: Volumes\n60,\n61,\n62,\n63,\n64,\n65,\n66",
        "count": 31,
        "papers": [
            "Guest Editor's foreword.",
            "Approximating the minimum closest pair distance and nearest neighbor distances of linearly moving points.",
            "Approximation algorithms for the unit disk cover problem in 2D and 3D.",
            "An algorithm for the maximum weight independent set problem on outerstring graphs.",
            "A streaming algorithm for 2-center with outliers in high dimensions.",
            "Dynamic data structures for approximate Hausdorff distance in the word RAM.",
            "Flips in edge-labelled pseudo-triangulations.",
            "Approximation algorithms for Max Morse Matching.",
            "Separability of imprecise points.",
            "On the rectilinear crossing number of complete uniform hypergraphs.",
            "Two-level rectilinear Steiner trees.",
            "Many disjoint edges in topological graphs.",
            "Improved bounds on the stretch factor of Y4.",
            "On the number of unit-area triangles spanned by convex grids in the plane.",
            "On orthogonally convex drawings of plane graphs.",
            "An optimal algorithm for plane matchings in multipartite geometric graphs.",
            "Drawing the Horton set in an integer grid of minimum size.",
            "Amortized analysis of smooth quadtrees in all dimensions.",
            "Orthogonal layout with optimal face complexity.",
            "The discrete Voronoi game in R2.",
            "Common developments of three incongruent boxes of area 30.",
            "A linearized circle packing algorithm.",
            "Reversibility and foldability of Conway tiles.",
            "Drawing the almost convex set in an integer grid of minimum size.",
            "Guarding orthogonal art galleries with sliding cameras.",
            "Faster bottleneck non-crossing matchings of points in convex position.",
            "Near equipartitions of colored point sets.",
            "C-planarity of embedded cyclic c-graphs.",
            "Visibility graphs, dismantlability, and the cops and robbers game.",
            "On the existence of ordinary triangles.",
            "Only distances are required to reconstruct submanifolds."
        ]
    },
    {
        "name": "CGTA",
        "year": "2016",
        "info": "2016: Volumes\n51,\n52,\n53,\n54,\n55,\n56,\n57,\n58,\n59",
        "count": 37,
        "papers": [
            "Bundling three convex polygons to minimize area or perimeter.",
            "On the edge crossing properties of Euclidean minimum weight Laman graphs.",
            "A polynomial-time approximation scheme for the geometric unique coverage problem on unit squares.",
            "Bottleneck partial-matching Voronoi diagrams and applications.",
            "Convex blocking and partial orders on the plane.",
            "Finding largest rectangles in convex polygons.",
            "On optimal disc covers and a new characterization of the Steiner center.",
            "On k-greedy routing algorithms.",
            "Edge routing with ordered bundles.",
            "An almost optimal algorithm for Voronoi diagrams of non-disjoint line segments.",
            "Optimal time-convex hull for a straight-line highway in Lp-metrics.",
            "A lower bound for computing geometric spanners.",
            "Tighter estimates for ϵ-nets for disks.",
            "Geometric permutations of non-overlapping unit balls revisited.",
            "Faster geometric algorithms via dynamic determinant computation.",
            "Distance-sensitive planar point location.",
            "Covering points with minimum/maximum area orthogonally convex polygons.",
            "Connectivity with directional antennas in the symmetric communication model.",
            "Orthogonal graph drawing with inflexible edges.",
            "Discrete Voronoi games and ϵ-nets, in two and three dimensions.",
            "Thickness and colorability of geometric graphs.",
            "A duality transform for constructing small grid embeddings of 3d polytopes.",
            "Analysis of farthest point sampling for approximating geodesics in a graph.",
            "Complexity of simplicial homology and independence complexes of chordal graphs.",
            "The non-pure version of the simplex and the boundary of the simplex.",
            "Plane geodesic spanning trees, Hamiltonian cycles, and perfect matchings in a simple polygon.",
            "Multivariate topology simplification.",
            "Drawing graphs with vertices and edges in convex position.",
            "Probing convex polygons with a wedge.",
            "Affine invariants of generalized polygons and matching under affine transformations.",
            "Efficient and robust persistent homology for measures.",
            "Polygon guarding with orientation.",
            "Optimal randomized incremental construction for guaranteed logarithmic planar point location.",
            "Alternating paths and cycles of minimum length.",
            "Metric embedding, hyperbolic space, and social networks.",
            "Partitioning orthogonal polygons into ≤ 8-vertex pieces, with application to an art gallery theorem.",
            "A randomized divide and conquer algorithm for higher-order abstract Voronoi diagrams."
        ]
    },
    {
        "name": "CGTA",
        "year": "2015",
        "info": "2015: Volumes\n48,\n49,\n50",
        "count": 65,
        "papers": [
            "Cubic plane graphs on a given point set.",
            "New results on stabbing segments with a polygon.",
            "Visibility and ray shooting queries in polygonal domains.",
            "Relaxing the constraints of clustered planarity.",
            "Conic nearest neighbor queries and approximate Voronoi diagrams.",
            "Seven mutually touching infinite cylinders.",
            "Bichromatic 2-center of pairs of points.",
            "The θ5-graph is a spanner.",
            "Weighted straight skeletons in the plane.",
            "Probabilistic bounds on the length of a longest edge in Delaunay graphs of random points in d-dimensions.",
            "A sensor-based framework for kinetic data compression.",
            "On balanced 4-holes in bichromatic point sets.",
            "Curvature based shape detection.",
            "Linear time algorithm for optimal feed-link placement.",
            "Capture bounds for visibility-based pursuit evasion.",
            "A fractional Helly theorem for boxes.",
            "Illumination complexes, Δ-zonotopes, and the polyhedral curtain theorem.",
            "Tight stretch factors for L1- and L∞-Delaunay triangulations.",
            "Spiderman graph: Visibility in urban regions.",
            "Drawing outerplanar graphs using three edge lengths.",
            "A straight-line order-preserving binary tree drawing algorithm with linear area and arbitrary aspect ratio.",
            "Saturated simple and k-simple topological graphs.",
            "Local, smooth, and consistent Jacobi set simplification.",
            "On the zone of the boundary of a convex body.",
            "A simple, faster method for kinetic proximity problems.",
            "Shortest paths in intersection graphs of unit disks.",
            "Guest editorial: Special issue on the 25th Canadian Conference on Computational Geometry (CCCG).",
            "Solving the natural wireless localization problem to optimality efficiently.",
            "Geometric red-blue set cover for unit squares and related problems.",
            "Counting triangulations and other crossing-free structures approximately.",
            "Reprint of: Bounding the locus of the center of mass for a part with shape variation.",
            "Reprint of: Theta-3 is connected.",
            "Reprint of: Face-guarding polyhedra.",
            "Reprint of: Weighted straight skeletons in the plane.",
            "Weak visibility queries of line segments in simple polygons.",
            "On full Steiner trees in unit disk graphs.",
            "Disconnectivity and relative positions in simultaneous embeddings.",
            "Fast algorithms for approximate Fréchet matching queries in geometric trees.",
            "Computing the L1 geodesic diameter and center of a simple polygon in linear time.",
            "Triangulations from topologically correct digital Voronoi diagrams.",
            "Remarks on Schur's conjecture.",
            "On k-gons and k-holes in point sets.",
            "On the complexity of higher order abstract Voronoi diagrams.",
            "Guest Editor's foreword.",
            "Fast segment insertion and incremental construction of constrained Delaunay triangulations.",
            "Graph induced complex on point data.",
            "On soft predicates in subdivision motion planning.",
            "Homological reconstruction and simplification in R3.",
            "Bichromatic compatible matchings.",
            "An improved data stream algorithm for clustering.",
            "Higher-order triangular-distance Delaunay graphs: Graph-theoretical properties.",
            "On the minimum number of mutually disjoint holes in planar point sets.",
            "Separating bichromatic point sets by L-shapes.",
            "Efficient transformations for Klee's measure problem in the streaming model.",
            "On the approximability of covering points by lines and related problems.",
            "Approximating the bottleneck plane perfect matching of a point set.",
            "Shortest path planning for a tethered robot.",
            "Reprint of: Approximating majority depth.",
            "Near-linear-time deterministic plane Steiner spanners for well-spaced point sets.",
            "Flip distance between two triangulations of a point set is NP-complete.",
            "Steiner reducing sets of minimum weight triangulations: Structure and topology.",
            "Computing the Fréchet distance between folded polygons.",
            "Survivable minimum bottleneck networks.",
            "New bounds on the maximum number of edges in k-quasi-planar graphs.",
            "Algorithms and bounds for drawing non-planar graphs with crossing-free subgraphs."
        ]
    },
    {
        "name": "CGTA",
        "year": "2014",
        "info": "2014: Volume 47",
        "count": 74,
        "papers": [
            "Entropy-bounded representation of point grids.",
            "Overlap of convex polytopes under rigid motion.",
            "Upward planar drawings on the standing and the rolling cylinders.",
            "The visible perimeter of an arrangement of disks.",
            "Packing polyominoes clumsily.",
            "A new upper bound for the VC-dimension of visibility regions.",
            "Automatic deduction in (dynamic) geometry: Loci computation.",
            "Minimum-area enclosing triangle with a fixed angle.",
            "Editorial.",
            "Exact algorithms and APX-hardness results for geometric packing and covering problems.",
            "Approximating geodesic distances on 2-manifolds in R3.",
            "Sequential dependency computation via geometric data structures.",
            "Development of curves on polyhedra via conical existence.",
            "A Fourier-theoretic approach for inferring symmetries.",
            "Enumerating topological (nk)-configurations.",
            "Making triangulations 4-connected using flips.",
            "Foreword.",
            "On the area requirements of Euclidean minimum spanning trees.",
            "Closest pair and the post office problem for stochastic points.",
            "Convex transversals.",
            "Streaming and dynamic algorithms for minimum enclosing balls in high dimensions.",
            "A (5/3 + ε)-approximation for strip packing.",
            "Space efficient data structures for dynamic orthogonal range counting.",
            "Orthogonal cartograms with at most 12 corners per face.",
            "Guest Editor's Introduction.",
            "Triangulating and guarding realistic polygons.",
            "Improved algorithms to network p-center location problems.",
            "Draining a polygon - or - rolling a ball out of a polygon.",
            "Data structures for range-aggregate extent queries.",
            "Approximating minimum bending energy path in a simple corridor.",
            "Longest convex lattice chains.",
            "An optimal algorithm for the Euclidean bottleneck full Steiner tree problem.",
            "On d-regular schematization of embedded paths.",
            "Offset polygon and annulus placement problems.",
            "α-Visibility.",
            "Bottleneck non-crossing matching in the plane.",
            "Special Issue on the 28th European Workshop on Computational Geometry, Guest Editors' Foreword.",
            "Bend-optimal orthogonal graph drawing in the general position model.",
            "Reprint of: Memory-constrained algorithms for simple polygons.",
            "Reprint of: Grid representations and the chromatic number.",
            "Reprint of: Upward planar embedding of an n-vertex oriented path on O(n2) points.",
            "Reprint of: Optimally solving a transportation problem using Voronoi diagrams.",
            "Reprint of: Refold rigidity of convex polyhedra.",
            "Reprint of: Extreme point and halving edge search in abstract order types.",
            "Watchman routes for lines and line segments.",
            "Guaranteed quality tetrahedral Delaunay meshing for medical images.",
            "Compatible spanning trees.",
            "Octants are cover-decomposable into many coverings.",
            "Flip distance between triangulations of a planar point set is APX-hard.",
            "Lower bounds for the number of small convex k-holes.",
            "Outerplanar graph drawings with few slopes.",
            "Similarity of polygonal curves in the presence of outliers.",
            "Editorial.",
            "4-Holes in point sets.",
            "Minimum-link paths revisited.",
            "A proof of the Oja depth conjecture in the plane.",
            "Design of solids for antigravity motion illusion.",
            "Treemaps with bounded aspect ratio.",
            "Quickest path queries on transportation network.",
            "On grids in topological graphs.",
            "A note on the unsolvability of the weighted region shortest path problem.",
            "Computing homotopic line simplification.",
            "Reprint of: Delaunay refinement algorithms for triangular mesh generation.",
            "Tight bound and improved algorithm for farthest-color Voronoi diagrams of line segments.",
            "Approximating geodesic distances on 2-manifolds in R3: The weighted case.",
            "On k-convex point sets.",
            "Face-guarding polyhedra.",
            "Bounding the locus of the center of mass for a part with shape variation.",
            "The Minkowski sum of simplices in 3-dimensional space: An analytical description.",
            "Formal specification and proofs for the topology and classification of combinatorial surfaces.",
            "Minimum enclosing circle of a set of fixed points and a mobile point.",
            "Small strong epsilon nets.",
            "Theta-3 is connected.",
            "Computing a visibility polygon using few variables."
        ]
    },
    {
        "name": "CGTA",
        "year": "2013",
        "info": "2013: Volume 46",
        "count": 87,
        "papers": [
            "A sufficient condition for the existence of plane spanning trees on geometric graphs.",
            "Normal art galleries: Wall in - all in.",
            "Maximizing maximal angles for plane straight-line graphs.",
            "On point-sets that support planar graphs.",
            "Shortest path problem in rectangular complexes of global nonpositive curvature.",
            "On the coarseness of bicolored point sets.",
            "Non-crossing matchings of points with geometric objects.",
            "On approximating the Riemannian 1-center.",
            "Advancing front circle packing to approximate conformal strips.",
            "Foreword.",
            "Stable Roommates Spanner.",
            "Some properties of k-Delaunay and k-Gabriel graphs.",
            "Oja centers and centers of gravity.",
            "Bounded-degree polyhedronization of point sets.",
            "Blocking Delaunay triangulations.",
            "Connected dominating sets on dynamic geometric graphs.",
            "On the variance of random polygons.",
            "Fast local searches and updates in bounded universes.",
            "On reconfiguration of disks in the plane and related problems.",
            "Covering a bichromatic point set with two disjoint monochromatic disks.",
            "Ice-creams and wedge graphs.",
            "Fast vertex guarding for polygons with and without holes.",
            "Software for exact integration of polynomials over polyhedra.",
            "Covering and piercing disks with two centers.",
            "Approximation of a closed polygon with a minimum number of circular arcs and line segments.",
            "Drawing planar 3-trees with given face areas.",
            "There are only two nonobtuse binary triangulations of the unit n-cube.",
            "How to cover a point set with a V-shape of minimum width.",
            "An in-place min-max priority search tree.",
            "Establishing strong connectivity using optimal radius half-disk antennas.",
            "Localized geometric query problems.",
            "Efficient external memory structures for range-aggregate queries.",
            "Space/query-time tradeoff for computing the visibility polygon.",
            "Families of polytopal digraphs that do not satisfy the shelling property.",
            "A note on multicovering with disks.",
            "Guest Editors' foreword.",
            "Stable snap rounding.",
            "Convex hull of points lying on lines in time after preprocessing.",
            "An output-sensitive algorithm for persistent homology.",
            "Vietoris-Rips complexes also provide topologically correct reconstructions of sampled shapes.",
            "A Kuratowski-type theorem for planarity of partially embedded graphs.",
            "Editorial.",
            "A modified Frank-Wolfe algorithm for computing minimum-area enclosing ellipsoidal cylinders: Theory and algorithms.",
            "Geometric conditions for Euclidean Steiner trees in ℜd.",
            "On the finite set of missing geometric configurations (n4).",
            "Computing the bounded subcomplex of an unbounded polyhedron.",
            "Maximum overlap of convex polytopes under translation.",
            "Absolute approximation of Tukey depth: Theory and experiments.",
            "The union of colorful simplices spanned by a colored point set.",
            "Shape matching under rigid motion.",
            "Approximate proximity drawings.",
            "Convex hulls of spheres and convex hulls of disjoint convex polytopes.",
            "On the power of the semi-separated pair decomposition.",
            "An optimal greedy routing algorithm for triangulated polygons.",
            "The cost of bounded curvature.",
            "An almost linear time algorithm for field splitting in radiation therapy.",
            "On numbers of pseudo-triangulations.",
            "Geometric and combinatorial properties of well-centered triangulations in three and higher dimensions.",
            "Large convex holes in random point sets.",
            "The 2-center problem in three dimensions.",
            "Fast Fréchet queries.",
            "Dynamic well-spaced point sets.",
            "On upward point set embeddability.",
            "On growing connected β-skeletons.",
            "Editorial.",
            "On plane geometric spanners: A survey and open problems.",
            "Constant time distance queries in planar unweighted graphs with subquadratic preprocessing time.",
            "Fixed-parameter tractability and lower bounds for stabbing problems.",
            "On inducing polygons and related problems.",
            "On the number of crossing-free partitions.",
            "Witness Gabriel graphs.",
            "Area requirement of graph drawings with few crossings per edge.",
            "Efficient reconfiguration of lattice-based modular robots.",
            "Orthogeodesic point-set embedding of trees.",
            "A tight bound for point guards in piecewise convex art galleries.",
            "Memory-constrained algorithms for simple polygons.",
            "Extreme point and halving edge search in abstract order types.",
            "Refold rigidity of convex polyhedra.",
            "Grid representations and the chromatic number.",
            "Upward planar embedding of an n-vertex oriented path on O(n2) points.",
            "Optimally solving a transportation problem using Voronoi diagrams.",
            "Symmetric connectivity with directional antennas.",
            "Coloring planar homothets and three-dimensional hypergraphs.",
            "Approximating hitting sets of axis-parallel rectangles intersecting a monotone curve.",
            "Realistic roofs over a rectilinear polygon.",
            "Separating families of convex sets.",
            "Approximating majority depth."
        ]
    },
    {
        "name": "CGTA",
        "year": "2012",
        "info": "2012: Volume 45",
        "count": 46,
        "papers": [
            "Reconstructing 3D compact sets.",
            "Tetrahedra passing through a triangular hole, and tetrahedra fixed by a planar frame.",
            "Reachability by paths of bounded curvature in a convex polygon.",
            "Maxima-finding algorithms for multidimensional samples: A two-phase approach.",
            "The MST of symmetric disk graphs is light.",
            "Local transformations of hexahedral meshes of lower valence.",
            "On k-convex polygons.",
            "Point-set embeddings of plane 3-trees.",
            "Routing multi-class traffic flows in the plane.",
            "3D Euler spirals for 3D curve completion.",
            "The ordinary line problem revisited.",
            "Tangencies between families of disjoint regions in the plane.",
            "CGTA-Awards 2011.",
            "On a class of O(n2) problems in computational geometry.",
            "Approximation algorithms for free-label maximization.",
            "Graphs that admit right angle crossing drawings.",
            "Memoryless routing in convex subdivisions: Random walks are optimal.",
            "Competing output-sensitive frame algorithms.",
            "Guest editorʼs foreword.",
            "New constructions of SSPDs and their applications.",
            "Algorithms for the edge-width of an embedded graph.",
            "An improved algorithm for Kleeʼs measure problem on fat boxes.",
            "Preserving geometric properties in reconstructing regions from internal and nearby points.",
            "An improved algorithm for reconstructing a simple polygon from its visibility angles.",
            "Minimal enclosing discs, circumcircles, and circumcenters in normed planes (Part I).",
            "A general rule for disk and hemisphere partition into equal-area cells.",
            "Querying two boundary points for shortest paths in a polygonal domain.",
            "The class cover problem with boxes.",
            "Compact and low delay routing labeling scheme for Unit Disk Graphs.",
            "Watchman tours for polygons with holes.",
            "Removing local extrema from imprecise terrains.",
            "Minimal enclosing discs, circumcircles, and circumcenters in normed planes (Part II).",
            "Going around in circles.",
            "Special issue on geometric constraints and reasoning.",
            "Body-and-cad geometric constraint systems.",
            "A case study in formalizing projective geometry in Coq: Desargues theorem.",
            "A generalized Malfatti problem.",
            "Designing and proving correct a convex hull algorithm with hypermaps in Coq.",
            "Classification of direct kinematics to planar generalized Stewart platforms.",
            "Editorial.",
            "Minimum-sum dipolar spanning tree in R3.",
            "Pointed drawings of planar graphs.",
            "Coloring half-planes and bottomless rectangles.",
            "Conflict-Free Coloring of points on a line with respect to a set of intervals.",
            "The medial axis of the union of inner Voronoi balls in the plane.",
            "Straight-line drawings of outerplanar graphs in O(dn log n) area."
        ]
    },
    {
        "name": "CGTA",
        "year": "2011",
        "info": "2011: Volume 44",
        "count": 45,
        "papers": [
            "A note on the perimeter of fat objects.",
            "Closed rectangle-of-influence drawings for irreducible triangulations.",
            "Guarding curvilinear art galleries with edge or mobile guards via 2-dominance of triangulation graphs.",
            "Efficient on-line algorithms for Euler diagram region computation.",
            "Guest Editor's foreword.",
            "Clarkson's algorithm for violator spaces.",
            "Integer point sets minimizing average pairwise L1 distance: What is the optimal shape of a town?",
            "On graph thickness, geometric thickness, and separator theorems.",
            "An inequality on the edge lengths of triangular meshes.",
            "On the stretch factor of Delaunay triangulations of points in convex position.",
            "Fréchet distance with speed limits.",
            "Almost all Delaunay triangulations have stretch factor greater than pi/2.",
            "On a cone covering problem.",
            "Fitting a two-joint orthogonal chain to a point set.",
            "Improved data structures for the orthogonal range successor problem.",
            "Perturbations for Delaunay and weighted Delaunay 3D triangulations.",
            "Vertex removal in two-dimensional Delaunay triangulation: Speed-up by low degrees optimization.",
            "Covering points by disjoint boxes with outliers.",
            "A kinetic triangulation scheme for moving points in the plane.",
            "Relay placement for fault tolerance in wireless networks in higher dimensions.",
            "On crossing numbers of geometric proximity graphs.",
            "Farthest-polygon Voronoi diagrams.",
            "Covering points with orthogonally convex polygons.",
            "Controlled Perturbation of sets of line segments in ℝ2 with smart processing order.",
            "Modelling gateway placement in wireless networks: Geometric k-centres of unit disc graphs.",
            "Stabbers of line segments in the plane.",
            "On a family of strong geometric spanners that admit local routing strategies.",
            "Witness (Delaunay) graphs.",
            "A computational approach to Conway's thrackle conjecture.",
            "Minimum vertex cover in rectangle graphs.",
            "Improved bounds for cops-and-robber pursuit.",
            "The snowblower problem.",
            "Characterizations of restricted pairs of planar graphs allowing simultaneous embedding with fixed edges.",
            "Efficient view point selection for silhouettes of convex polyhedra.",
            "Reconstructing orthogonal polyhedra from putative vertex sets.",
            "A polygon is determined by its angles.",
            "Non-manifold surface reconstruction from high-dimensional point cloud data.",
            "Link distance and shortest path problems in the plane.",
            "On packing squares into a rectangle.",
            "Finding long and similar parts of trajectories.",
            "Connectivity guarantees for wireless networks with directional antennas.",
            "A survey of geodesic paths on 3D surfaces.",
            "Bold graph drawings.",
            "A general approach to the analysis of controlled perturbation algorithms.",
            "Polynomial area bounds for MST embeddings of trees."
        ]
    },
    {
        "name": "CGTA",
        "year": "2010",
        "info": "2010: Volume 43",
        "count": 63,
        "papers": [
            "Editorial.",
            "Computational geometric aspects of rhythm, melody, and voice-leading.",
            "Floodlight illumination of infinite wedges.",
            "Pointed binary encompassing trees: Simple and optimal.",
            "Flexible isosurfaces: Simplifying and displaying scalar topology using the contour tree.",
            "Efficient approximation algorithms for clustering point-sets.",
            "Editorial.",
            "Computing the dilation of edge-augmented graphs in metric spaces.",
            "Decompositions and boundary coverings of non-convex fat polyhedra.",
            "Mixed volume techniques for embeddings of Laman graphs.",
            "Approximating the minimum weight spanning tree of a set of points in the Hausdorff metric.",
            "Probabilistic matching of planar regions.",
            "Highway hull revisited.",
            "Locality and bounding-box quality of two-dimensional space-filling curves.",
            "Polygon exploration with time-discrete vision.",
            "Measuring and computing natural generators for homology groups.",
            "Homogeneous 2-hop broadcast in 2D.",
            "An algorithm for constructing star-shaped drawings of plane graphs.",
            "Finding the Theta-guarded region.",
            "Upward straight-line embeddings of directed graphs into point sets.",
            "Foreword.",
            "Delaunay triangulation of imprecise points in linear time after preprocessing.",
            "A (slightly) faster algorithm for Klee's measure problem.",
            "A simple and efficient kinetic spanner.",
            "An efficient algorithm for the stratification and triangulation of an algebraic surface.",
            "Maximum thick paths in static and dynamic environments.",
            "Homotopic Fréchet distance between curves or, walking your dog in the woods in polynomial time.",
            "Optimizing active ranges for consistent dynamic map labeling.",
            "Editorial.",
            "The complexity of flow on fat terrains and its i/o-efficient computation.",
            "On Euclidean vehicle routing with allocation.",
            "Optimization for first order Delaunay triangulations.",
            "A near linear time approximation scheme for Steiner tree among obstacles in the plane.",
            "Computing the visibility map of fat objects.",
            "Largest bounding box, smallest diameter, and related problems on imprecise points.",
            "Approximate range searching: The absolute model.",
            "A dihedral acute triangulation of the cube.",
            "Exact join detection for convex polyhedra and other numerical abstractions.",
            "A robust segment/triangle intersection algorithm for interference tests. Efficiency study.",
            "Star-quadtrees and guard-quadtrees: I/O-efficient indexes for fat triangulations and low-density planar subdivisions.",
            "Covering a simple polygon by monotone directions.",
            "Embeddability of open-ended carbon nanotubes in hypercubes.",
            "Mathematical model and efficient algorithms for object packing problem.",
            "Editorial.",
            "Reprint of: A simple and fast incremental randomized algorithm for computing trapezoidal decompositions and for triangulating polygons.",
            "Reprint of: Weak epsilon-nets have basis of size O(1/epsilonlog(1/epsilon)) in any dimension.",
            "Approximation algorithm for the kinetic robust K-center problem.",
            "On a problem about quadrant-depth.",
            "Centerpoints and Tverberg's technique.",
            "Approximating the volume of unions and intersections of high-dimensional geometric objects.",
            "Matched drawability of graph pairs and of graph triples.",
            "Guest Editors' foreword.",
            "Optimal in-place and cache-oblivious algorithms for 3-d convex hulls and 2-d segment intersection.",
            "Approximate centerpoints with proofs.",
            "Randomly removing g handles at once.",
            "Parallel geometric algorithms for multi-core computers.",
            "Flattening single-vertex origami: The non-expansive case.",
            "Divide-and-conquer for Voronoi diagrams revisited.",
            "A general approach for cache-oblivious range reporting and approximate range counting.",
            "Distance k-sectors exist.",
            "Extension of one-dimensional proximity regions to higher dimensions.",
            "Bounds for cops and robber pursuit.",
            "Rectangular-radial drawings of cubic plane graphs."
        ]
    },
    {
        "name": "CGTA",
        "year": "2009",
        "info": "2009: Volume 42",
        "count": 80,
        "papers": [
            "Constrained CVT meshes and a comparison of triangular mesh generators.",
            "Adaptive spacetime meshing for discontinuous Galerkin methods.",
            "Optimal simplification of polygonal chains for subpixel-accurate rendering.",
            "Flips in planar graphs.",
            "Computing D-convex hulls in the plane.",
            "A note on a theorem of Perles concerning non-crossing paths in convex geometric graphs.",
            "Matching points with rectangles and squares.",
            "Off-centers: A new type of Steiner points for computing size-optimal quality-guaranteed Delaunay triangulations.",
            "Escaping offline searchers and isoperimetric theorems.",
            "Decomposition of multiple coverings into many parts.",
            "Geometric spanners with small chromatic number.",
            "An efficient local approach to convexity testing of piecewise-linear hypersurfaces.",
            "Simultaneous graph embedding with bends and circular arcs.",
            "Empty region graphs.",
            "Quality mesh generation for molecular skin surfaces using restricted union of balls.",
            "On the minimum total length of interval systems expressing all intervals, and range-restricted queries.",
            "Octagonal drawings of plane graphs with prescribed face areas.",
            "Region-restricted clustering for geographic data mining.",
            "Improved upper bounds on the reflexivity of point sets.",
            "Efficient c-oriented range searching with DOP-trees.",
            "Translational packing of arbitrary polytopes.",
            "A linear-space algorithm for distance preserving graph embedding.",
            "Orthogonal equipartitions.",
            "Geometric dilation of closed curves in normed planes.",
            "Towards a definition of higher order constrained Delaunay triangulations.",
            "Depth of segments and circles through points enclosing many points: a note.",
            "Orthogonal range searching in linear and almost-linear space.",
            "K-vertex guarding simple polygons.",
            "Editorial CCCG 2005.",
            "The projection median of a set of points.",
            "An O(n5/2logn) algorithm for the Rectilinear Minimum Link-Distance Problem in three dimensions.",
            "A vertex-face assignment for plane graphs.",
            "Morphing polyhedra with parallel faces: Counterexamples.",
            "Single facility collection depots location problem in the plane.",
            "Dynamic ham-sandwich cuts in the plane.",
            "The distance geometry of music.",
            "Small weak epsilon-nets.",
            "Editorial CCCG 2006.",
            "Shortest descending paths through given faces.",
            "Rotationally monotone polygons.",
            "On the degree of standard geometric predicates for line transversals in 3D.",
            "Local overlaps in special unfoldings of convex polyhedra.",
            "An optimal extension of the centerpoint theorem.",
            "Operations preserving the global rigidity of graphs and frameworks in the plane.",
            "Guarding curvilinear art galleries with vertex or point guards.",
            "Design of the CGAL 3D Spherical Kernel and application to arrangements of circles on a sphere.",
            "Computing the arrangement of circles on a sphere, with applications in structural biology.",
            "Normal cone approximation and offset shape isotopy.",
            "Not being (super)thin or solid is hard: A study of grid Hamiltonicity.",
            "Efficient algorithms for computing Reeb graphs.",
            "Compatible geometric matchings.",
            "On minimum weight pseudo-triangulations.",
            "Constrained minimum enclosing circle with center on a query line segment.",
            "Ascending and descending regions of a discrete Morse function.",
            "Linear reconfiguration of cube-style modular robots.",
            "Point-set embeddings of trees with given partial drawings.",
            "The equipartition of curves.",
            "Bounds for point recolouring in geometric graphs.",
            "Characterization of unlabeled level planar trees.",
            "Note on the paper \"K-vertex guarding simple polygons\" [Computational Geometry 42 (4) (May 2009) 352-361].",
            "Editorial.",
            "Transforming spanning trees: A lower bound.",
            "Smoothed analysis of probabilistic roadmaps.",
            "Wrapping spheres with flat paper.",
            "On the complexity of umbra and penumbra.",
            "Bounds on the quality of the PCA bounding boxes.",
            "Edges and switches, tunnels and bridges.",
            "Optimal higher order Delaunay triangulations of polygons.",
            "Algorithms for graphs of bounded treewidth via orthogonal range searching.",
            "Compressing spatio-temporal trajectories.",
            "Geometric representation of cubic graphs with four directions.",
            "Visibility queries in a polygonal region.",
            "Visibility representations of four-connected plane graphs with near optimal heights.",
            "Planar rectilinear shortest path computation using corridors.",
            "Abstract Voronoi diagrams revisited.",
            "Computing minimum-area rectilinear convex hull and L-shape.",
            "On triconnected and cubic plane graphs on given point sets.",
            "On the dilation spectrum of paths, cycles, and trees.",
            "Empty monochromatic triangles.",
            "On the minimum corridor connection problem and other generalized geometric problems."
        ]
    },
    {
        "name": "CGTA",
        "year": "2008",
        "info": "2008: Volumes\n39,\n40,\n41",
        "count": 57,
        "papers": [
            "Editorial.",
            "Algorithms for bivariate zonoid depth.",
            "Encompassing colored planar straight line graphs.",
            "Approximate range searching in higher dimension.",
            "Edge-unfolding nested polyhedral bands.",
            "On corners of objects built from parallelepiped bricks.",
            "Local properties of geometric graphs.",
            "On local transformations in plane geometric graphs embedded on small grids.",
            "Query point visibility computation in polygons with holes.",
            "Lower bounds for expected-case planar point location.",
            "Approximating polyhedral objects with deformable smooth surfaces.",
            "Matching point sets with respect to the Earth Mover's Distance.",
            "Matching edges and faces in polygonal partitions.",
            "Covering points with a polygon.",
            "Visibility maps of segments and triangles in 3D.",
            "The flow complex: A data structure for geometric modeling.",
            "Adaptive sampling for geometric problems over data streams.",
            "Polynomial-time approximation schemes for piercing and covering with applications in wireless networks.",
            "On guarding the vertices of rectilinear domains.",
            "An optimal randomized algorithm for d-variate zonoid depth.",
            "Steiner hull algorithm for the uniform orientation metrics.",
            "Optimal core-sets for balls.",
            "On the density of iterated line segment intersections.",
            "Efficient algorithms for the d-dimensional rigidity matroid of sparse graphs.",
            "A unified and efficient solution to the room search problem.",
            "Classroom examples of robustness problems in geometric computations.",
            "Triangulations without pointed spanning trees.",
            "Weak epsilon-nets have basis of size O(1/epsilonlog(1/epsilon)) in any dimension.",
            "Weighted skeletons and fixed-share decomposition.",
            "Unfolding Manhattan Towers.",
            "Recursive geometry of the flow complex and topology of the flow complex filtration.",
            "Drawing cubic graphs with at most five slopes.",
            "Equiprojective polyhedra.",
            "Smooth manifold reconstruction from noisy and non-uniform approximation with guarantees.",
            "Maximum overlap and minimum convex hull of two convex polyhedra under translations.",
            "Constructing minimum-interference networks.",
            "Covering point sets with two disjoint disks or squares.",
            "Sparse geometric graphs with small dilation.",
            "Augmenting the connectivity of geometric graphs.",
            "Iterated snap rounding with bounded drift.",
            "I/O-efficient algorithms for computing planar geometric spanners.",
            "Editorial.",
            "Computing the Fréchet distance between simple polygons.",
            "Decomposing a simple polygon into pseudo-triangles and convex polygons.",
            "Approximation of an open polygonal curve with a minimum number of circular arcs and biarcs.",
            "On realistic terrains.",
            "Ray shooting and intersection searching amidst fat convex polyhedra in 3-space.",
            "On the performance of the ICP algorithm.",
            "Splitting (complicated) surfaces is hard.",
            "Reporting flock patterns.",
            "Localized homology.",
            "Time-varying Reeb graphs for continuous space-time data.",
            "The BOXEL framework for 2.5D data with applications to virtual drivethroughs and ray tracing.",
            "Computing a minimum-dilation spanning tree is NP-hard.",
            "Improving the topology computation of an arrangement of cubics.",
            "Optimal location of transportation devices.",
            "Maximum upward planar subgraphs of embedded planar digraphs."
        ]
    },
    {
        "name": "CGTA",
        "year": "2007",
        "info": "2007: Volumes\n36,\n37,\n38",
        "count": 47,
        "papers": [
            "Editorial.",
            "Abstract order type extension and new results on the rectilinear crossing number.",
            "On the geometric dilation of closed curves, graphs, and point sets.",
            "How to get close to the median shape.",
            "Generating realistic terrains with higher-order Delaunay triangulations.",
            "The visibility-Voronoi complex and its applications.",
            "On the stabbing number of a random Delaunay triangulation.",
            "An incremental algorithm for reconstruction of surfaces of arbitrary codimension.",
            "On simultaneous planar graph embeddings.",
            "Delaunay triangulations approximate anchor hulls.",
            "Kinetic and dynamic data structures for convex hulls and upper envelopes.",
            "An intersection-sensitive algorithm for snap rounding.",
            "Meshing skin surfaces with certified topology.",
            "Distance-preserving approximations of polygonal paths.",
            "Geometric spanners with applications in wireless networks.",
            "Boundary labeling: Models and efficient algorithms for rectangular maps.",
            "Editorial.",
            "Maximizing the overlap of two planar convex sets under rigid motions.",
            "Kinetic sorting and kinetic convex hulls.",
            "Minimum dilation stars.",
            "Learning smooth shapes by probing.",
            "Cooperative mobile guards in grids.",
            "Complexity of the minimum-length corridor problem.",
            "Configurations with few crossings in topological graphs.",
            "Shortest monotone descent path problem in polyhedral terrain.",
            "Constrained paths in the flip-graph of regular triangulations.",
            "Editorial.",
            "Approximate distance oracles for graphs with dense clusters.",
            "A quadratic distance bound on sliding between crossing-free spanning trees.",
            "Computing the Fréchet distance between piecewise smooth curves.",
            "On rectangular cartograms.",
            "Geometric dilation of closed planar curves: New lower bounds.",
            "Space-efficient geometric divide-and-conquer algorithms.",
            "A decade of CGAL.",
            "Almost-Delaunay simplices: Robust neighbor relations for imprecise 3D points using CGAL.",
            "An adaptable and extensible geometry kernel.",
            "Advanced programming techniques applied to Cgal's arrangement package.",
            "Boolean operations on 3D selective Nef complexes: Data structure, algorithms, optimized implementation and experiments.",
            "A generic software design for Delaunay refinement meshing.",
            "A package for exact kinetic data structures and sweepline algorithms.",
            "On incremental rendering of silhouette maps of a polyhedral scene.",
            "Minimum weight pseudo-triangulations.",
            "On finding widest empty curved corridors.",
            "Maximizing the guarded boundary of an Art Gallery is APX-complete.",
            "Graph drawings with few slopes.",
            "Drawings of planar graphs with few slopes and segments.",
            "Line-segment intersection made in-place."
        ]
    },
    {
        "name": "CGTA",
        "year": "2006",
        "info": "2006: Volumes\n33, 34, 35",
        "count": 44,
        "papers": [
            "Special Issue on Robust Geometric Algorithms and their Implementations.",
            "Inner and outer rounding of Boolean operations on lattice polygonal regions.",
            "The predicates of the Apollonius diagram: Algorithmic analysis and implementation.",
            "Counterexamples to the uniformity conjecture.",
            "An exact and efficient approach for computing a cell in an arrangement of quadrics.",
            "Progress on maximum weight triangulation.",
            "A result about the density of iterated line intersections in the plane.",
            "Proximity problems on line segments spanned by points.",
            "On the sizes of Delaunay meshes.",
            "Approximate range searching using binary space partitions.",
            "Inscribing an axially symmetric polygon and other approximation algorithms for planar convex sets.",
            "A linear time algorithm to remove winding of a simple polygon.",
            "Farthest-point queries with geometric and combinatorial constraints.",
            "Editorial.",
            "Convex developments of a regular tetrahedron.",
            "Nearly equal distances and Szemerédi's regularity lemma.",
            "Equitable subdivisions within polygonal regions.",
            "A PTAS for minimum vertex dilation triangulation of a simple polygon with a constant number of sources of dilation.",
            "Moving coins.",
            "Finding minimum hidden guard sets in polygons - tight approximability results.",
            "A new 2D tessellation for angle problems: The polar diagram.",
            "Space-efficient algorithms for computing the convex hull of a simple polygonal line in linear time.",
            "Independent set of intersection graphs of convex objects in 2D.",
            "Preferred directions for resolving the non-uniqueness of Delaunay triangulations.",
            "Online searching with an autonomous robot.",
            "Partitions of complete geometric graphs into plane trees.",
            "A new algorithmic approach to the computation of Minkowski functionals of polyconvex sets.",
            "The minimum weight triangulation problem with few inner points.",
            "Cost prediction for ray shooting in octrees.",
            "Octrees with near optimal cost for ray-shooting.",
            "Compatible triangulations and point partitions by series-triangular graphs.",
            "Editorial.",
            "Deformable spanners and applications.",
            "Faster core-set constructions and data-stream algorithms in fixed dimensions.",
            "Exact, efficient, and complete arrangement computation for cubic curves.",
            "Intersecting quadrics: an efficient and exact implementation.",
            "Approximate convex decomposition of polygons.",
            "Provable surface reconstruction from noisy samples.",
            "Algorithms for the multiple label placement problem.",
            "Computing homotopic shortest paths efficiently.",
            "Algorithms for optimal area triangulations of a convex polygon.",
            "The minimum Manhattan network problem: Approximations and exact solutions.",
            "Three problems about simple polygons.",
            "The minimum-area spanning tree problem."
        ]
    },
    {
        "name": "CGTA",
        "year": "2005",
        "info": "2005: Volumes\n30, 31, 32",
        "count": 45,
        "papers": [
            "Curve-constrained drawings of planar graphs.",
            "Grid drawings of k-colourable graphs.",
            "Improved visibility representation of plane graphs.",
            "Polygonal chain approximation: a query based approach.",
            "Optimal spanners for axis-aligned rectangles.",
            "Foreword.",
            "The one-round Voronoi game replayed.",
            "Chips on wafers, or packing rectangles into grids.",
            "Approximately matching polygonal curves with respect to the Fre'chet distance.",
            "The affine representation theorem for abstract convex geometries.",
            "On the computation of an arrangement of quadrics in 3D.",
            "Simple and optimal output-sensitive construction of contour trees using monotone paths.",
            "Orthogonal segment stabbing.",
            "Enumerating pseudo-triangulations in the plane.",
            "Schematization of networks.",
            "Ray shooting and stone throwing with near-linear storage.",
            "Geometric permutations of disjoint unit spheres.",
            "Constrained higher order Delaunay triangulations.",
            "Editorial.",
            "Smooth kinetic maintenance of clusters.",
            "Planar minimally rigid graphs and pseudo-triangulations.",
            "Curve reconstruction from noisy samples.",
            "Local polyhedra and geometric graphs.",
            "Cost-driven octree construction schemes: an experimental study.",
            "Editorial.",
            "A simple linear algorithm for computing rectilinear 3-centers.",
            "Fast reconstruction of Delaunay triangulations.",
            "Structural filtering: a paradigm for efficient and exact geometric programs.",
            "Non-stretchable pseudo-visibility graphs.",
            "When can a net fold to a polyhedron?",
            "The Erdös-Nagy theorem and its ramifications .",
            "Hinged dissection of polyominoes and polyforms.",
            "Approximating the minimum triangulation of convex 3-polytopes with bounded degrees.",
            "On some monotone path problems in line arrangements.",
            "Computing straight-line 3D grid drawings of graphs in linear volume.",
            "On the chromatic number of some geometric type Kneser graphs.",
            "Orthogonal drawings of graphs with vertex and edge labels.",
            "One-dimensional layout optimization, with applications to graph drawing by axis separation.",
            "Hausdorff approximation of convex polygons.",
            "A linear time algorithm for approximate 2-means clustering.",
            "Polygonal path simplification with angle constraints.",
            "On the Fermat-Weber center of a convex object.",
            "Counting and representing intersections among triangles in three dimensions.",
            "Rigid realizations of graphs on small grids.",
            "Extremal point queries with lines and line segments and related problems."
        ]
    },
    {
        "name": "CGTA",
        "year": "2004",
        "info": "2004: Volumes\n27, 28, 29",
        "count": 48,
        "papers": [
            "Editorial.",
            "Testing congruence and symmetry for general 3-dimensional objects.",
            "The weighted farthest color Voronoi diagram on trees and graphs.",
            "Euclidean position in Euclidean 2-orbifolds.",
            "On simplifying dot maps.",
            "Speeding up the incremental construction of the union of geometric objects in practice.",
            "Facility location and the geometric minimum-diameter spanning tree.",
            "Efficient generation of triconnected plane triangulations.",
            "A fast algorithm for approximating the detour of a polygonal chain.",
            "Hierarchy of surface models and irreducible triangulations.",
            "Inner and outer approximations of polytopes using boxes.",
            "On the number of views of translates of a cube and related problems.",
            "Median problem in some plane triangulations and quadrangulations.",
            "Kinetic collision detection between two simple polygons.",
            "Tiling space and slabs with acute tetrahedra.",
            "A dense planar point set from iterated line intersections.",
            "Editorial.",
            "Convexity minimizes pseudo-triangulations.",
            "Ordered theta graphs.",
            "Exact and approximation algorithms for computing optimal fat decompositions.",
            "Proximate point searching.",
            "Constructing convex 3-polytopes from two triangulations of a polygon.",
            "The structure of optimal partitions of orthogonal polygons into fat rectangles.",
            "Editorial.",
            "Parametric search made practical.",
            "A local search approximation algorithm for k-means clustering.",
            "Box-trees for collision checking in industrial installations.",
            "Collision detection for deforming necklaces.",
            "A global approach to automatic solution of jigsaw puzzles.",
            "Visibility preserving terrain simplification-- an experimental study.",
            "Guaranteed-quality parallel Delaunay refinement for restricted polyhedral domains.",
            "Conforming Delaunay triangulations in 3D.",
            "Editorial.",
            "A multi-dimensional approach to force-directed layouts of large graphs.",
            "Expected asymptotically optimal planar point location.",
            "When can you fold a map?",
            "Geometric permutations of higher dimensional spheres.",
            "Expected time analysis for Delaunay point location.",
            "Proximity drawings in polynomial area and volume.",
            "How to draw the minimum cuts of a planar graph.",
            "A lower bound on the number of triangulations of planar point sets.",
            "I/O-efficient dynamic planar point location.",
            "Triangular range counting query in 2D and its application in finding k nearest neighbors of a line segment.",
            "Minimal enclosing parallelepiped in 3D.",
            "Linkless symmetric drawings of series parallel digraphs.",
            "An approximation algorithm for cutting out convex polygons.",
            "Approximating geometric bottleneck shortest paths.",
            "Rotationally optimal spanning and Steiner trees in uniform orientation metrics."
        ]
    },
    {
        "name": "CGTA",
        "year": "2003",
        "info": "2003: Volumes\n24, 25, 26",
        "count": 45,
        "papers": [
            "On the development of the intersection of a plane with a polytope.",
            "Efficient algorithms for the minimum diameter bridge problem.",
            "On finding maximum-cardinality symmetric subsets.",
            "The optimality of a certain purely recursive dissection for a sequentially n-divisible square.",
            "Sum of edge lengths of a multigraph drawn on a convex polygon.",
            "Ununfoldable polyhedra with convex faces.",
            "An O(nlogn) algorithm for the zoo-keeper's problem.",
            "Computing contour trees in all dimensions.",
            "Planarity-preserving clustering and embedding for large planar graphs.",
            "Approximate congruence in nearly linear time.",
            "Monotone paths in line arrangements.",
            "Fast approximations for sums of distances, clustering and the Fermat-Weber problem.",
            "Voronoi drawings of trees.",
            "On R-trees with low query complexity.",
            "Competitive on-line coverage of grid environments by a mobile robot.",
            "Tight degree bounds for pseudo-triangulations of points.",
            "On counting point-hyperplane incidences.",
            "Translating a regular grid over a point set.",
            "Optimal and suboptimal robust algorithms for proximity graphs.",
            "Guarding disjoint triangles and claws in the plane.",
            "Sets of lines and cutting out polyhedral objects.",
            "The Safari interface for visualizing time-dependent volume data using iso-surfaces and contour spectra.",
            "An algorithmic study of manufacturing paperclips and other folded structures.",
            "Building bridges between convex region.",
            "Long proteins with unique optimal foldings in the H-P model.",
            "Computational analysis of mesh simplification using global error.",
            "On the average complexity of 3D-Voronoi diagrams of random points on convex polytopes.",
            "A circle packing algorithm.",
            "The visibility graph of congruent discs is Hamiltonian.",
            "Geometric permutations of balls with bounded size disparity.",
            "Pushing blocks is hard.",
            "Interlocked open and closed linkages with few joints.",
            "Segment endpoint visibility graphs are Hamiltonian.",
            "Algorithms for bivariate medians and a Fermat-Torricelli problem for lines.",
            "Tutte's barycenter method applied to isotopies.",
            "Guarding scenes against invasive hypercubes.",
            "A (1+)-approximation algorithm for 2-line-center.",
            "Casting a polyhedron with directional uncertainty.",
            "On finding an empty staircase polygon of largest area (width) in a planar point-set.",
            "Area, perimeter and derivatives of a skin curve.",
            "Chromatic variants of the Erdsos-CSzekeres theorem on points in convex position.",
            "Worst-case-optimal algorithms for guarding planar graphs and polyhedral surfaces.",
            "Optimal discrete Morse functions for 2-manifolds.",
            "Preprocessing chains for fast dihedral rotations is hard or even impossible.",
            "Art gallery theorems for guarded guards."
        ]
    },
    {
        "name": "CGTA",
        "year": "2002",
        "info": "2002: Volumes\n21, 22, 23",
        "count": 46,
        "papers": [
            "Sixteenth European Workshop on Computational Geometry - Editorial.",
            "Sequences of spanning trees and a fixed tree theorem.",
            "Orienting polyhedral parts by pushing.",
            "Polygon decomposition for efficient construction of Minkowski sums.",
            "Surface reconstruction using umbrella filters.",
            "Computing Voronoi skeletons of a 3-D polyhedron by space subdivision.",
            "Rectangular drawings of plane graphs without designated corners.",
            "Inapproximability of finding maximum hidden sets on polygons and terrains.",
            "Two-variable linear programming in parallel.",
            "An elementary algorithm for reporting intersections of red/blue curve segments.",
            "A Helly-type theorem for higher-dimensional transversals.",
            "Art galleries with guards of uniform range of vision.",
            "Illumination in the presence of opaque line segments in the plane.",
            "Editorial.",
            "Triangulations in CGAL.",
            "Delaunay refinement algorithms for triangular mesh generation.",
            "Quadrilateral surface meshes without self-intersecting dual cycles for hexahedral mesh generation.",
            "LOOK: A Lazy Object-Oriented Kernel design for geometric computation.",
            "Algebraic methods and arithmetic filtering for exact predicates on circle arcs.",
            "Enumerating a subset of the integer points inside a Minkowski sum.",
            "Improving continuity of Voronoi-based interpolation over Delaunay spheres.",
            "Smooth surface reconstruction via natural neighbour interpolation of distance functions.",
            "Densest translational lattice packing of non-convex polygons.",
            "Optimally computing a shortest weakly visible line segment inside a simple polygon.",
            "Packing two disks in a polygon.",
            "Beta-skeletons have unbounded dilation.",
            "Models and motion planning.",
            "Orthogonal polygon reconstruction from stabbing information.",
            "Higher order Delaunay triangulations.",
            "Quadtree, ray shooting and approximate minimum weight Steiner triangulation.",
            "A decomposition-based approach to layered manufacturing.",
            "Optimizing area and aspect ration in straight-line orthogonal tree drawings.",
            "Optimal Steiner hull algorithm.",
            "An aperiodic tiles machine.",
            "Voronoi diagrams on the spher.",
            "Reporting intersecting pairs of convex polytopes in two and three dimensions.",
            "Iterated snap rounding.",
            "Combinatorial curve reconstruction in Hilbert spaces: A new sampling theory and an old result revisited.",
            "On-line coloring of geometric intersection graphs.",
            "Translating a convex polyhedron over monotone polyhedra.",
            "An efficient algorithm for enumeration of triangulations.",
            "Computing the face lattice of a polytope from its vertex-facet incidences.",
            "Linear time approximation of 3D convex polytopes.",
            "On embedding an outer-planar graph in a point set.",
            "Efficient visibility queries in simple polygons.",
            "On the approximation of a smooth surface with a triangulated mesh."
        ]
    },
    {
        "name": "CGTA",
        "year": "2001",
        "info": "2001: Volumes\n18, 19, 20",
        "count": 34,
        "papers": [
            "On the complexity of the Edge Label Placement problem.",
            "Characterizing LR-visibility polygons and related problems.",
            "Lower bounds in on-line geometric searching.",
            "Enumerating the k best plane spanning trees.",
            "Hamilton cycles in the path graph of a set of points in convex position.",
            "A unified scheme for detecting fundamental curves in binary edge images.",
            "VRONI: An engineering approach to the reliable and efficient computation of Voronoi diagrams of points and line segments.",
            "Parallel searching on m rays.",
            "Convexity recognition of the union of polyhedra.",
            "An efficient direct approach for computing shortest rectilinear paths among obstacles in a two-layer interconnection model.",
            "The DFS-heuristic for orthogonal graph drawing.",
            "Efficient randomized algorithms for robust estimation of circular arcs and aligned ellipses.",
            "A lower bound for beta-skeleton belonging to minimum weight triangulations.",
            "On the complexity of orthogonal compaction.",
            "Matching colored points in the plane: Some new results.",
            "Combinatorial Curves and Surfaces - Editorial.",
            "Reconstructing curves with sharp corners.",
            "Regular and non-regular point sets: Properties and reconstruction.",
            "The power crust, unions of balls, and the medial axis transform.",
            "Natural neighbor coordinates of points on a surface.",
            "Delaunay conforming iso-surface, skeleton extraction and noise removal.",
            "Shape space from deformation.",
            "Design and analysis of planar shape deformation.",
            "Selected papers from the 12th Annual Canadian Conference on Computational Geometry - Editorial.",
            "Enumerating triangulation paths.",
            "Extended convex hull.",
            "The medial axis of a union of balls.",
            "Spirale Reversi: Reverse decoding of the Edgebreaker encoding.",
            "An Edgebreaker-based efficient compression scheme for regular meshes.",
            "Polygons cuttable by a circular saw.",
            "Reconfiguring convex polygons.",
            "On the number of disjoint convex quadrilaterals for a planar point set.",
            "Polygonal chains cannot lock in 4D.",
            "The point in polygon problem for arbitrary polygons."
        ]
    },
    {
        "name": "CGTA",
        "year": "2000",
        "info": "2000: Volumes\n15, 16, 17",
        "count": 38,
        "papers": [
            "New eyes for building models from video.",
            "Progressive transmission of subdivision surfaces.",
            "Interactive texture mapping for polygonal models.",
            "A hierarchical method for real-time distance computation among moving convex bodies.",
            "Fast and accurate collision detection for haptic interaction using a three degree-of-freedom force-feedback device.",
            "Self-customized BSP trees for collision detection.",
            "Path finding for human motion in virtual environments.",
            "Skeleton-based three-dimensional geometric morphing.",
            "Integrating volume morphing and visualization.",
            "From virtual to physical reality with paper folding.",
            "Area-efficient algorithms for straight-line tree drawings.",
            "Discrete rectilinear 2-center problems.",
            "Dynamic data structures for fat objects and their applications.",
            "Curve reconstruction: Connecting dots with good reason.",
            "Editorial.",
            "Folding flat silhouettes and wrapping polyhedral packages: New results in computational origami.",
            "Queries with segments in Voronoi diagrams.",
            "Efficient algorithms for line and curve segment intersection using restricted predicates.",
            "Turn-regularity and optimal area drawings of orthogonal representations.",
            "A class of point-sets with few k-sets.",
            "Cylindrical static and kinetic binary space partitions.",
            "Functional specification and prototyping with oriented combinatorial maps.",
            "Densest lattice packings of 3-polytopes.",
            "Protecting critical facets in layered manufacturing.",
            "Lower bounds on the number of crossing-free subgraphs of KN.",
            "Computing simple paths among obstacles.",
            "Planar segment visibility graphs.",
            "Reporting curve segment intersections using restricted predicates.",
            "Editorial.",
            "Extending range queries and nearest neighbors.",
            "Approximation algorithms for lawn mowing and milling.",
            "LMT-skeleton heuristics for several new classes of optimal triangulations.",
            "A probabilistic result on multi-dimensional Delaunay triangulations, and its application to the 2D case.",
            "Chromatic nearest neighbor searching: A query sensitive approach.",
            "Art gallery problem with guards whose range of vision is 180.",
            "Approximate range searching.",
            "Union and split operations on dynamic trapezoidal maps.",
            "Drawing series parallel digraphs symmetrically."
        ]
    },
    {
        "name": "CGTA",
        "year": "1999",
        "info": "1999: Volumes\n12, 13, 14",
        "count": 45,
        "papers": [
            "Linear complexity hexahedral mesh generation.",
            "Combinatorial and experimental results for randomized point matching algorithms.",
            "On the bit complexity of minimum link paths: Superquadratic algorithms for problem solvable in linear time.",
            "Partial surface matching by using directed footprints.",
            "Fast randomized point location without preprocessing in two- and three-dimensional Delaunay triangulations.",
            "Checking geometric programs or verification of geometric structures.",
            "Temporally coherent conservative visibility.",
            "Visualizing geometric algorithms over the Web.",
            "Editorial.",
            "Multicolor Combination Lemma.",
            "The mixed volume optimization problem.",
            "On some geometric optimization problems in layered manufacturing.",
            "Minimizing support structures and trapped area in two-dimensional layered manufacturing.",
            "Editorial.",
            "Rotational polygon containment and minimum enclosure using only robust 2D constructions.",
            "Point labeling with sliding labels.",
            "Multiresolution banded refinement to accelerate surface reconstruction from polygons.",
            "Using generic programming for designing a data structure for polyhedral surfaces.",
            "Dynamic algorithms for geometric spanners of small diameter: Randomized solutions.",
            "Competitive searching in a generalized street.",
            "Exact arithmetic at low cost - A case study in linear programming.",
            "Further results on arithmetic filters for geometric predicates.",
            "Convex tours of bounded curvature.",
            "On representations of some thickness-two graphs.",
            "Partitioning point sets in space into disjoint convex polytopes.",
            "Graph of triangulations of a convex polygon and tree of triangulations.",
            "More planar two-center algorithms.",
            "Practical segment intersection with finite precision output.",
            "SOKOBAN and other motion planning problems.",
            "Computing a flattest, undercut-free parting line for a convex polyhedron, with application to mold design.",
            "Balanced partitions of two sets of points in the plane.",
            "Editorial - Multi-Resolution Modeling and 3D Geometry Compression.",
            "Multiresolution hierarchies on unstructured triangle meshes.",
            "Reducing the number of wavelet coefficients by geometric partitioning.",
            "Optimal triangulation and quadric-based surface simplification.",
            "Simplifying spline models.",
            "Optimal bit allocation in compressed 3D models.",
            "Wrap&Zip decompression of the connectivity of triangle meshes compressed with Edgebreaker.",
            "Efficient compression of non-manifold polygonal meshes.",
            "Single resolution compression of arbitrary triangular meshes with properties.",
            "A geometric proof of the combinatorial bounds for the number of optimal solutions for the Euclidean 2-center problem.",
            "The greedy triangulation can be computed from the Delaunay triangulation in linear time.",
            "Non-interactive geometric probing: Reconstructing non-convex polygons.",
            "On the union of k-curved objects.",
            "Wiring edge-disjoint layouts."
        ]
    },
    {
        "name": "CGTA",
        "year": "1998",
        "info": "1998: Volumes\n9, 10, 11",
        "count": 54,
        "papers": [
            "Unit disk graph recognition is NP-hard.",
            "Linear area upward drawings of AVL trees.",
            "New results on drawing angle graphs.",
            "Algorithms for area-efficient orthogonal drawings.",
            "Universal 3-dimensional visibility representations for graphs.",
            "Erased arrangements of lines and convex decompositions of polyhedra.",
            "A note on parallel algorithms for optimal h-v drawings of binary trees.",
            "A better heuristic for orthogonal graph drawings.",
            "Combinatorial complexity of translating a box in polyhedral 3-space.",
            "On fat partitioning, fat covering and the union size of polygons.",
            "Experiments on the practical I/O efficiency of geometric algorithms: Distribution sweep versus plane sweep.",
            "Recognizing polygonal parts from width measurements.",
            "On determining the congruence of point sets in d dimensions.",
            "Converting triangulations to quadrangulations.",
            "Combinatorial aspects of geometric graphs.",
            "The rectangle of influence drawability problem.",
            "Optimal slope selection via cuttings.",
            "Practical methods for approximating shortest paths on a convex polytope in R3.",
            "ote on an art gallery problem.",
            "Illumination by floodlights.",
            "A Tverberg-type result on multicolored simplices.",
            "Approximation of convex figures by pairs of rectangles.",
            "Finding constrained and weighted Voronoi diagrams in the plane.",
            "The vertex-edge visibility graph of a polygon.",
            "On circumscribing polygons for line segments.",
            "An output sensitive algorithm for discrete convex hulls.",
            "Intersections with random geometric objects.",
            "On triangulating three-dimensional polygons.",
            "Recognizing weakly convex visible polygons.",
            "Visibility with multiple diffuse reflections.",
            "Getting around a lower bound for the minimum Hausdorff distance.",
            "Rectangular grid drawings of plane graphs.",
            "Wall thickness control in layered manufacturing for surfaces with closed slices.",
            "r-regular shape reconstruction from unorganized points.",
            "Computing fence designs for orienting parts.",
            "RAPID: Randomized pharmacophore identification for drug design.",
            "A perturbation scheme for spherical arrangements with application to molecular modeling.",
            "A computational basis for higher-dimensional computational geometry and applications.",
            "Rotational polygon overlap minimization and compaction.",
            "Optimal placement of convex polygons to maximize point containment.",
            "On some geometric selection and optimization problems via sorted matrices.",
            "Minimum-width grid drawings of plane graphs.",
            "The largest k-ball in a d-dimensional box.",
            "The union of moving polygonal pseudodiscs - Combinatorial bounds and applications.",
            "Spheres, molecules, and hidden surface removal.",
            "The vertex set of a 0/1-polytope is strongly P-enumerable.",
            "Edge guards in rectilinear polygons.",
            "Offset-polygon annulus placement problems.",
            "Geometric applications of posets.",
            "Dynamic motion planning in low obstacle density environments.",
            "Cartographic line simplification and polygon CSG formulæ in O(nlog * n) time.",
            "Checking the convexity of polytopes and the planarity of subdivisions.",
            "Label placement by maximum independent set in rectangles.",
            "Variable resolution triangulations."
        ]
    },
    {
        "name": "CGTA",
        "year": "1997",
        "info": "1997: Volumes\n7, 8",
        "count": 46,
        "papers": [
            "Towards Exact Geometric Computation.",
            "Rational Orthogonal Approximations to Orthogonal Matrices.",
            "LR-visibility in Polygons.",
            "Geometric Orderings of Intersecting Translates and Their Applications.",
            "Near-quadratic Bounds for the L1Voronoi Diagram of Moving Points.",
            "Perfect Binary Space Partitions.",
            "Approximating the Maxmin-angle Covering Triangulation.",
            "Geometric Pattern Matching Under Euclidean Motion.",
            "Finding the Largest Area Axis-parallel Rectangle in a Polygon.",
            "Finding a Shortest Diagonal of a Simple Polygon in Linear Time.",
            "Visibility Graphs of Towers.",
            "Guarding Polyhedral Terrains.",
            "Sequential and Parallel Algorithms for Finding a Maximum Convex Polygon.",
            "Edge Guarding Polyhedral Terrains.",
            "Minimum Planar Sets with Maximum Equidistance Counts.",
            "Fast Randomized Parallel Methods for Planar Convex Hull Construction.",
            "On Intersecting a Point Set with Euclidean Balls.",
            "Characterization of Contour Elements That Generate Abstract Voronoi Diagrams.",
            "How Good Are Convex Hull Algorithms?.",
            "An Experimental Comparison of Four Graph Drawing Algorithms.",
            "Strategies for Polyhedral Surface Decomposition: an Experimental Study.",
            "A Combinatorial Approach to Cartograms.",
            "A Comparison of Sequential Delaunay Triangulation Algorithms.",
            "A Practical Map Labeling Algorithm.",
            "Analysis of Backtrack Algorithms for Listing All Vertices and All Faces of a Convex Polyhedron.",
            "Adaptive Subdivision and the Length and Energy of Bézier Curves.",
            "The Shortest Distance Among Points in General Position.",
            "Triangulating with High Connectivity.",
            "Intersection of Unit-balls and Diameter of a Point Set in 3.",
            "Fast Greedy Triangulation Algorithms.",
            "Three-clustering of Points in the Plane.",
            "Testing Simple Polygons.",
            "On the Difficulty of Range Searching.",
            "On the Complexity of Optimization Problems for 3-dimensional Convex Polyhedra and Decision Trees.",
            "The Common Exterior of Convex Polygons in the Plane.",
            "Optimal, Output-sensitive Algorithms for Constructing Planar Hulls in Parallel.",
            "Translating a Convex Polygon to Contain a Maximum Number of Points.",
            "Computing the Shortest Watchtower of a Polyhedral Terrain in O(n Log N) Time.",
            "Angle-Restricted Tours in the Plane.",
            "Voronoi Diagrams on Orbifolds.",
            "Faster Geometric K-point MST Approximation.",
            "Optimal On-line Algorithms for Walking with Minimum Number of Turns in Unknown Streets.",
            "On the Number of Simplicial Complexes in D.",
            "Randomized Incremental Construction of Simple Abstract Voronoi Diagrams in 3-space.",
            "3-D Vertical Ray Shooting and 2-D Point Enclosure, Range Searching, and Arc Shooting Amidst Convex Fat Objects.",
            "New Results on Binary Space Partitions in the Plane."
        ]
    },
    {
        "name": "CGTA",
        "year": "1996",
        "info": "Volume 6: 1996",
        "count": 24,
        "papers": [
            "Algorithms for Generalized Halfspace Range Searching and Other Intersection Searching Problems.",
            "Generalized Guarding and Partitioning for Rectilinear Polygons.",
            "Average Case Analysis of Dynamic Geometric Optimization.",
            "Computing Half-plane and Strip Discrepancy of Planar Point Sets.",
            "A Computationally Intractable Problem on Simplicial Complexes.",
            "Determining Bar-representability for Ordered Weighted Graphs.",
            "An Algorithm for Constructing the Convex Hull of a Set of Spheres in Dimension D.",
            "Point Location in Zones of K-flats in Arrangements.",
            "Computing Grasp Functions.",
            "An Optimal Algorithm for the Rectilinear Link Center of a Rectilinear Polygon.",
            "Erds Distance Problems in Normed Spaces.",
            "The Exact Fitting Problem in Higher Dimensions.",
            "Variants for the Hough Transform for Line Detection.",
            "A Deterministic Algorithm for the Three-dimensional Diameter Problem.",
            "Optimal Tetrahedralization of the 3D-region \"between\" a Convex Polyhedron and a Convex Polygon.",
            "Generating Random Polygons with Given Vertices.",
            "All Convex Polyhedra Can Be Clamped with Parallel Jaw Grippers.",
            "Minimal Tangent Visibility Graphs.",
            "Queries on Voronoi Diagrams of Moving Points.",
            "Hunting Voronoi Vertices.",
            "Triangulations, Visibility Graph and Reflex Vertices of a Simple Polygon.",
            "Fast Algorithms for Collision and Proximity Problems Involving Moving Geometric Objects.",
            "On the Area of the Intersection of Disks in the Plane.",
            "Space Reduction and an Extension for a Hidden Line Elimination Algorithm."
        ]
    },
    {
        "name": "CGTA",
        "year": "1995",
        "info": "Volume 5: 1995/1996",
        "count": 20,
        "papers": [
            "Tiling Figures of the Plane with Two Bars.",
            "Derandomizing an Output-sensitive Convex Hull Algorithm in Three Dimensions.",
            "Testing Orthogonal Shapes.",
            "Negative Results on Characterizing Visibility Graphs.",
            "Convex Polygons with Few Intervertex Distances.",
            "Separation and Approximation of Polyhedral Objects.",
            "The Upper Bound Theorem for Polytopes: an Easy Proof of Its Asymptotic Version.",
            "Parallel Algorithms on Circular-arc Graphs.",
            "Parallel Searching in the Plane.",
            "The Expected Size of the Sphere-of-influence Graph.",
            "On a Class of O(n2) Problems in Computational Geometry.",
            "Computing Depth Orders for Fat Objects and Related Problems.",
            "Combinatorial Complexity of Signed Discs.",
            "An Optimal Algorithm for Roundness Determination on Convex Polygons.",
            "Simplex Range Reporting on a Pointer Machine.",
            "Generalized Hidden Surface Removal.",
            "Algorithms for Proximity Problems in Higher Dimensions.",
            "On the Multisearching Problem for Hypercubes.",
            "On-line Construction of the Upper Envelope of Triangles and Surface Patches in Three Dimensions.",
            "Algorithms for Generalized Halfspace Range Searching and Other Intersection Searching Problems."
        ]
    },
    {
        "name": "CGTA",
        "year": "1994",
        "info": "Volume 4: 1994",
        "count": 19,
        "papers": [
            "On Optimal Guillotine Partitions Approximating Optimal D-box Partitions.",
            "Computing a Subgraph of the Minimum Weight Triangulation.",
            "Linear Approximation of Simple Objects.",
            "Point Location Among Hyperplanes and Unidirectional Ray-shooting.",
            "Computing Minimum Length Paths of a Given Homotopy Class.",
            "External Polygon Containment Problems.",
            "Computing the Smallest K-enclosing Circle and Related Problems.",
            "Approximate Decision Algorithms for Point Set Congruence.",
            "Testing Geometric Objects.",
            "On Stabbling Lines for Convex Polyhedra in 3D.",
            "Combinatorial Face Enumeration in Convex Polytopes.",
            "A Linear-time Construction of the Relative Neighborhood Graph From the Delaunay Triangulation.",
            "Two Segment Classes with Hamiltonian Visibility Graphs.",
            "Moldable and Castable Polygons.",
            "Algorithms for Drawing Graphs: an Annotated Bibliography.",
            "Computing Convex Hull in a Floating Point Arithmetic.",
            "Complexity of Projected Images of Convex Subdivisions.",
            "Counting Problems Relating to a Theorem of Dirichlet.",
            "Equivariant Mappings: a New Approach in Stochastic Simulations."
        ]
    },
    {
        "name": "CGTA",
        "year": "1993",
        "info": "Volume 3: 1993",
        "count": 21,
        "papers": [
            "Minimal Link Visibility Paths Inside a Simple Polygon.",
            "On Compatible Triangulations of Simple Polygons.",
            "An Optimal Parallel Algorithm Using Exclusive Read/writes for the Rectilinear Voronoi Diagram.",
            "Lower Bounds on Stabbing Lines in 3-space.",
            "A Convex Polygon Among Polygonal Obstacles: Placement and High-clearance Motion.",
            "Determining Maximum K-width-connectivity on Meshes.",
            "One Strike Against the Min-max Degree Triangulation Problem.",
            "Linear-time Algorithms for Weakly-monotone Polygons.",
            "A Competitive Analysis of Algorithms for Searching Unknown Scenes.",
            "Randomized Incremental Construction of Abstract Voronoi Diagrams.",
            "Four Results on Randomized Incremental Constructions.",
            "Characterizing and Recognizing Weak Visibility Polygons.",
            "Tail Estimates for the Efficiency of Randomized Incremental Algorithms for Line Segment Intersection.",
            "Polynomial-time Instances of the Minimum Weight Triangulation Problem.",
            "Maximal and Minimal Balls.",
            "On the Union of Fat Wedges and Separating a Collection of Segments By a Line.",
            "The Complexity of Finding Minimal Voronoi Covers with Applications to Machine Learning.",
            "On Parallel Rectilinear Obstacle- Avoiding Paths.",
            "On Counting Triangulations in D Dimensions.",
            "Representing Polyhedra: Faces Are Better Than Vertices.",
            "The Complexity of the Free Space for a Robot Moving Amidst Fat Obstacles."
        ]
    },
    {
        "name": "CGTA",
        "year": "1992",
        "info": "Volume 2: 1992/1993",
        "count": 24,
        "papers": [
            "Relative Neighborhood Graphs in Three Dimensions.",
            "Hamiltonian Triangulations and Circumscribing Polygons of Disjoint Line Segments.",
            "Detecting and Decomposing Self-overlapping Curves.",
            "On a Counterexample to a Conjecture of Mirzaian.",
            "Fully Dynamic Delaunay Triangulation in Logarithmic Expected Time Per Operation.",
            "Unit Distances Between Vertices of a Convex Polygon.",
            "Upper Envelope Onion Peeling.",
            "Minimizing the Sum of Diameters Efficiently.",
            "Dynamic Output-sensitive Hidden Surface Removal for C-oriented Polyhedra.",
            "Parallel Fractional Cascading on Hypercube Multiprocessors.",
            "Reporting Points in Halfspaces.",
            "A Note on Optimal Area Algorithms for Upward Drawings of Binary Trees.",
            "Stabbing Isothetic Boxes and Rectangles in O(n Log N) Time.",
            "Model-based Probing Strategies for Convex Polygons.",
            "Efficient Hidden Surface Removal for Objects with Small Union Size.",
            "Vector Summation within Minimal Angle.",
            "A Bound on the K-gonality of Facets of the Hypermetric Cone and Related Complexity Problems.",
            "Probing Polygons Minimally Is Hard.",
            "Constructing the Convex Hull of a Partially Sorted Set of Points.",
            "On Vertical Ray Shooting in Arrangements.",
            "On the Recognition of Digital Circles in Linear Time.",
            "Computing Rectangle Enclosures.",
            "Covering Grids and Orthogonal Polygons with Periscope Guards.",
            "How Many Maxima Can There Be?"
        ]
    },
    {
        "name": "CGTA",
        "year": "1991",
        "info": "Volume 1: 1991/1992",
        "count": 18,
        "papers": [
            "Distinct Distances Determined By Subsets of a Point Set in Space.",
            "On Rectilinear Link Distance.",
            "Merging Visibility Maps.",
            "A Simple and Fast Incremental Randomized Algorithm for Computing Trapezoidal Decompositions and for Triangulating Polygons.",
            "Off-line Dynamic Maintenance of the Width of a Planar Point Set.",
            "Parallel Rectilinear Shortest Paths with Rectangular Obstacles.",
            "Computing Bushy and Thin Triangulations.",
            "On the Distribution of Order Types.",
            "The Farthest Point Delaunay Triangulation Minimizes Angles.",
            "Watchman Routes Under Limited Visibility.",
            "A Convex Hull Algorithm for Discs, and Applications.",
            "Farthest Neighbors, Maximum Spanning Trees and Related Problems in Higher Dimensions.",
            "A Framework for 1-D Compaction with Forbidden Region Avoidance.",
            "The gamma-neighborhood Graph.",
            "Hidden Surface Removal for C-oriented Polyhedra.",
            "Improved Combinatorial Bounds and Efficient Techniques for Certain Motion Planning Problems with Three Degrees of Freedom.",
            "Counting and Cutting Cycles of Lines and Rods in Space.",
            "Walking an Unknown Street with Bounded Detour."
        ]
    }
]