[
    {
        "year": "2021",
        "name": "31st DCC 2021",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2021",
                "sub_name": "31st Data Compression Conference, DCC 2021, Snowbird, UT, USA, March 23-26, 2021.",
                "count": 82,
                "papers": [
                    "Fast Partitioning for VVC Intra-Picture Encoding with a CNN Minimizing the Rate-Distortion-Time Cost.",
                    "A Dual-Critic Reinforcement Learning Framework for Frame-Level Bit Allocation in HEVC/H.265.",
                    "Multi-Density Convolutional Neural Network for In-Loop Filter in Video Coding.",
                    "An Efficient QP Variable Convolutional Neural Network Based In-loop Filter for Intra Coding.",
                    "SLFC: Scalable Light Field Coding.",
                    "Lossy Compression for Integrating Event Cameras.",
                    "Compression of point cloud geometry through a single projection.",
                    "Multiscale Point Cloud Geometry Compression.",
                    "A grammar compressor for collections of reads with applications to the construction of the BWT.",
                    "Backward Weighted Coding.",
                    "ndzip: A High-Throughput Parallel Lossless Compressor for Scientific Data.",
                    "Compact Representation of Spatial Hierarchies and Topological Relationships.",
                    "Succinct representations of Intersection Graphs on a Circle.",
                    "Succinct Data Structures for Small Clique-Width Graphs.",
                    "Neural Networks Optimally Compress the Sawbridge.",
                    "DZip: improved general-purpose loss less compression based on novel neural network modeling.",
                    "End-to-End optimized image compression for machines, a study.",
                    "Super Resolution for Compressed Screen Content Video.",
                    "Compressive Sensing via Unfolded 𝓁1-constrained Convolutional Sparse Coding.",
                    "PHONI: Streamed Matching Statistics with Multi-Genome References.",
                    "Efficiently Merging r-indexes.",
                    "Smaller RLZ-Compressed Suffix Arrays.",
                    "On Elias-Fano for Rank Queries in FM-Indexes.",
                    "Low Rank Based End-to-End Deep Neural Network Compression.",
                    "Neural Network Compression via Additive Combination of Reshaped, Low-Rank Matrices.",
                    "Rate-Distortion Optimized Coding for Efficient CNN Compression.",
                    "Average Performance of Adaptive Streaming.",
                    "Low Delay Robust Audio Coding by Noise Shaping, Fractional Sampling, and Source Prediction.",
                    "Privacy-Preserving Compressed Sensing for Image Simultaneous Compression-Encryption Applications.",
                    "Fast and Compact Set Intersection through Recursive Universe Partitioning.",
                    "Tree-Structured Quantization on Grassmann and Stiefel Manifolds.",
                    "On Universal Codes for Integers: Wallace Tree, Elias Omega and Beyond.",
                    "Near-Lossless Compression for Sparse Source Using Convolutional Low Density Generator Matrix Codes.",
                    "Dynamic Point Cloud Texture Video Compression using the Edge Position Difference Oriented Motion Model.",
                    "The Twelvefold Way of Non-Sequential Lossless Compression.",
                    "Approximate Hashing for Bioinformatics.",
                    "Efficient algorithms for decode efficient prefix codes.",
                    "Guided Blocks WOM codes.",
                    "A Disk-Based Index for Trajectories with an In-Memory Compressed Cache.",
                    "Improving Run Length Encoding by Preprocessing.",
                    "A Viewport-Adaptive Rate Control Approach for Omnidirectional Video Coding.",
                    "Intra Block Partition Structure Prediction via Convolutional Neural Network.",
                    "JQF: Optimal JPEG Quantization Table Fusion by Simulated Annealing on Texture Images and Predicting Textures.",
                    "Quad-Treea Based Sample Refinement Filter for Video Coding.",
                    "Compact Polyominoes.",
                    "Video-Decoder Power Consumption on Android Devices: Power-Estimation Method, Dataset Creation, and Analysis Results.",
                    "Deep Scattering Network with Max-Pooling.",
                    "SRQ: Self-Reference quantization scheme for lightweight neural network.",
                    "Convolutional Neural Network-based Split Prediction for VVC Intra Speedup.",
                    "Modulated Variable-Rate Deep Video Compression.",
                    "Video Enhancement Network Based on Max-Pooling and Hierarchical Feature Fusion.",
                    "Lossless Compression for Video Streams with Frequency Prediction and Macro Block Merging.",
                    "The Rate-Distortion-Accuracy Tradeoff: JPEG Case Study.",
                    "Reducing Image Compression Artifacts for Deep Neural Networks.",
                    "An Empirical Analysis of Recurrent Learning Algorithms in Neural Lossy Image Compression Systems.",
                    "Low Complexity Video Compression for Fixed Focus Cameras.",
                    "Parallel Processing of Grammar Compression.",
                    "Optimized Adaptive Loop Filter in Versatile Video Coding.",
                    "Reducing latency and bandwidth for video streaming using keypoint extraction and digital puppetry.",
                    "Convolutional Neural Network for Image Compression with Application to JPEG Standard.",
                    "HH-CompWordNet: Holistic Handwritten Word Recognition in the Compressed Domain.",
                    "A Comparison of Classical and Deep Learning-based Techniques for Compressing Signals in a Union of Subspaces.",
                    "Domain-Specific Language Abstractions for Compression.",
                    "Regularized Semi-Nonnegative Matrix Factorization Using L2, 1-Norm for Data Compression.",
                    "On Random Editing in LZ-End.",
                    "Graph Based Transforms based on Graph Neural Networks for Predictive Transform Coding.",
                    "Parallel Implementations of Lambda Domain and R-Lambda Model Rate Control Schemes in a Practical HEVC Encoder.",
                    "Hybrid Intra-Prediction in Lossless Video Coding using Overfitted Neural Networks.",
                    "On the Choice of Sampling Rates in Multi-Rate Sampling.",
                    "Compressing Deep Networks Using Fisher Score of Feature Maps.",
                    "Accelerating Knuth-Morris-Pratt String Matching over LZ77 Compressed Text.",
                    "3D-CVQE: An Effective 3D-CNN Quality Enhancement for Compressed Video Using Limited Coding Information.",
                    "Bi-Prediction Enhancement with Deep Frame Prediction Network for Versatile Video Coding.",
                    "Flow-Grounded Dynamic Texture Synthesis for Video Compression.",
                    "Research on Knowledge Distillation of Generative Adversarial Networks.",
                    "Improved LZ77 Compression.",
                    "Short Video Performance Evaluation of AV1 Coding Tools.",
                    "Point AE-DCGAN: A deep learning model for 3D point cloud lossy geometry compression.",
                    "Invertible Resampling-Based Layered Image Compression.",
                    "Joint Asymmetric Convolution Block and Local/Global Context Optimization for Learned Image Compression.",
                    "Fast GLCM-based Intra Block Partition for VVC.",
                    "Deformable Convolution Network based Invertibility-Driven Interpolation Filter for HEVC."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "30th DCC 2020",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2020",
                "sub_name": "Data Compression Conference, DCC 2020, Snowbird, UT, USA, March 24-27, 2020.",
                "count": 89,
                "papers": [
                    "DRASIC: Distributed Recurrent Autoencoder for Scalable Image Compression.",
                    "Deep Learning-Based Image Compression with Trellis Coded Quantization.",
                    "The Sibling Neural Estimator: Improving Iterative Image Decoding with Gradient Communication.",
                    "Noise-to-Compression Variational Autoencoder for Efficient End-to-End Optimized Image Coding.",
                    "EPIC: Context Adaptive Lossless Light Field Compression using Epipolar Plane Images.",
                    "Super-Resolution in Compressive Coded Imaging Systems via l2 - l1 - l2 Minimization Under a Deep Learning Approach.",
                    "Gaussian Guided Inter Prediction for Focal Stack Images Compression.",
                    "Implicit Geometry Partition for Point Cloud Compression.",
                    "Residual Coding for Transform Skip Mode in Versatile Video Coding.",
                    "Advanced Geometric-Based Inter Prediction for Versatile Video Coding.",
                    "Gradient-Based Early Termination of CU Partition in VVC Intra Coding.",
                    "Semantrix: A Compressed Semantic Matrix.",
                    "Revisiting Compact RDF Stores Based on k2-Trees.",
                    "Bitvectors with Runs and the Successor/Predecessor Problem.",
                    "Decompressing Lempel-Ziv Compressed Text.",
                    "Approximating Optimal Bidirectional Macro Schemes.",
                    "State-Based Multi-parameter Probability Estimation for Context-Based Adaptive Binary Arithmetic Coding.",
                    "Reverse Multi-Delimiter Compression Codes.",
                    "Convolutional Neural Network-Based Coefficients Prediction for HEVC Intra-Predicted Residues.",
                    "Luma Mapping with Chroma Scaling in Versatile Video Coding.",
                    "Sub-Sampled Cross-Component Prediction for Chroma Component Coding.",
                    "On Dynamic Succinct Graph Representations.",
                    "Edge Minimization in de Bruijn Graphs.",
                    "Compact Representation of Graphs with Small Bandwidth and Treedepth.",
                    "c-Trie++: A Dynamic Trie Tailored for Fast Prefix Searches.",
                    "Spectral Video Compression Using Convolutional Sparse Coding.",
                    "Online Probability Model Estimation for Video Compression.",
                    "Revisiting Local Texture Correlation for Rate-Distortion Optimized Intra Coding.",
                    "Tensor Dictionary Learning with Representation Quantization for Remote Sensing Observation Compression.",
                    "A Stochastic Model of Block Segmentation Based on the Quadtree and the Bayes Code for It.",
                    "Denoising Deep Boltzmann Machines: Compression for Deep Learning.",
                    "Encryption Before Compression Coding Scheme for JPEG Image Compression Standard.",
                    "The Exponential Distribution in Rate Distortion Theory: The Case of Compression with Independent Encodings.",
                    "Functional Epsilon Entropy.",
                    "LFZip: Lossy Compression of Multivariate Floating-Point Time Series Data via Improved Prediction.",
                    "Compressing and Randomly Accessing Sequences (note).",
                    "Concise Fuzzy Representation of Big Graphs: A Dimensionality Reduction Approach.",
                    "Lossless Multi-component Image Compression Based on Integer Wavelet Coefficient Prediction using Convolutional Neural Networks.",
                    "Fast Multi-rate Encoding for Adaptive HTTP Streaming.",
                    "Compressive Classification via Deep Learning using Single-Pixel Measurements.",
                    "Decode-Efficient Prefix Codes for Hierarchical Memory Models.",
                    "Pattern Search in Grammar-Compressed Graphs.",
                    "Video Denoising for the Hierarchical Coding Structure in Video Coding.",
                    "Efficient Storage of Images onto DNA using Vector Quantization.",
                    "Image Compression Based on Neuroscience Models: Rate-Distortion Performance of the Neural Code.",
                    "On the Robustness of Causal Discovery with Additive Noise Models on Discrete Data.",
                    "Entropy Coders Based on the Splitting of Lexicographic Intervals.",
                    "Intra Prediction in the Emerging VVC Video Coding Standard.",
                    "Weighted Adaptive Huffman Coding.",
                    "Practical Repetition-Aware Grammar Compression.",
                    "Towards Better Compressed Representations.",
                    "Low Rate Compression of Video with Dynamic Backgrounds.",
                    "DZip: Improved General-Purpose Lossless Compression Based on Novel Neural Network Modeling.",
                    "Artificial Intelligence Based Region of Interest Enhanced Video Compression.",
                    "Machine-Learning-Based Method for Finding Optimal Video-Codec Configurations Using Physical Input-Video Features.",
                    "Perceptual Video Coding using Deep Neural Network Based JND Model.",
                    "Non-Binary Robust Universal Variable Length Codes.",
                    "Re-Pair in Small Space.",
                    "Video-Based Compression for Plenoptic Point Clouds.",
                    "Secondary Intra Prediction Scheme for HEVC.",
                    "Convolutional Neural Network Based Fast Intra Mode Prediction for H.266/FVC Video Coding.",
                    "Fast Depth Intra Coding Based on Layer-Classification and CNN for 3D-HEVC.",
                    "A Rate Control Scheme for HEVC Intra Coding Using Convolution Neural Network (CNN).",
                    "Compressed Quadratization of Higher Order Binary Optimization Problems.",
                    "Flow-Guided Temporal-Spatial Network for HEVC Compressed Video Quality Enhancement.",
                    "Statistical Modeling Based Fast Rate Distortion Estimation Algorithm for HEVC.",
                    "Grammar Compression with Probabilistic Context-Free Grammar.",
                    "Temporal Redundancy Reduction in Compressive Video Sensing by using Moving Detection and Inter-Coding.",
                    "Training Machine Learning on JPEG Compressed Images.",
                    "Segmentation of Text-Lines and Words from JPEG Compressed Printed Text Documents Using DCT Coefficients.",
                    "Scalable Trellis Quantization for JPEG XS.",
                    "SQUAREMIX: A Faster Pseudorandom Number Generator for Dynamic-Multithreading Platforms.",
                    "Model-Independent Rate Control for Intra-Coding Based on Piecewise Linear Approximations.",
                    "Depth-First Decoding of Distributed Arithmetic Codes for Uniform Binary Sources.",
                    "Higher-Order Count Sketch: Dimensionality Reduction that Retains Efficient Tensor Operations.",
                    "A High Efficient Cascade Coder with Predictor Blending Method for Lossless Audio Compression.",
                    "A QD&JND Compensation Based PVC Scheme for HEVC.",
                    "Light Field Image Compression Using Multi-branch Spatial Transformer Networks Based View Synthesis.",
                    "Densely Connected Unit Based Loop Filter for Short Video Coding.",
                    "Deep Clustering of Compressed Variational Embeddings.",
                    "Binary Representation and High Efficient Compression of 3D CNN Features for Action Recognition.",
                    "Improved Hard-Decision Quantization with Decision Tree for HEVC Video Compression.",
                    "Spatial-Temporal Fusion Convolutional Neural Network for Compressed Video Enhancement in HEVC.",
                    "Adaptive Stream-Based Entropy Coding.",
                    "An Adaptive Quantization Based PVC Scheme for HEVC.",
                    "Fast CU Size Decision Using Machine Learning for Depth Map Coding in 3D-HEVC.",
                    "Linear Model Based Geometry Coding for Lidar Acquired Point Clouds.",
                    "Wide and Deep Learning for Video Summarization via Attention Mechanism and Independently Recurrent Neural Network.",
                    "Fixed-Length Coding for Escape Samples in Palette Mode."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "29th DCC 2019",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2019",
                "sub_name": "Data Compression Conference, DCC 2019, Snowbird, UT, USA, March 26-29, 2019.",
                "count": 121,
                "papers": [
                    "Learned Neural Iterative Decoding for Lossy Image Compression Systems.",
                    "Lossy Source Coding via Deep Learning.",
                    "Lossy Image Compression with Filter Bank Based Convolutional Networks.",
                    "Near-Lossless ℓ∞-Constrained Image Decompression via Deep Neural Network.",
                    "History-Based Motion Vector Prediction in Versatile Video Coding.",
                    "Wide Angular Intra Prediction for Versatile Video Coding.",
                    "Fast Adaptive Multiple Transform for Versatile Video Coding.",
                    "Adaptive Wavelet Domain Filter for Versatile Video Coding (VVC).",
                    "Dv2v: A Dynamic Variable-to-Variable Compressor.",
                    "AliCo: A New Efficient Representation for SAM Files.",
                    "A Compact Representation of Raster Time Series.",
                    "Numerical Pattern Mining Through Compression.",
                    "Tunneling on Wheeler Graphs.",
                    "Space-Efficient Computation of the Burrows-Wheeler Transform.",
                    "BWT Tunnel Planning is Hard But Manageable.",
                    "Parameterized Text Indexing with One Wildcard.",
                    "CNN-Based Driving of Block Partitioning for Intra Slices Encoding.",
                    "Perceptually Optimized Bit-Allocation and Associated Distortion Measure for Block-Based Image or Video Coding.",
                    "Hybrid Video Coding with Trellis-Coded Quantization.",
                    "Deterministic Annealing Based Transform Domain Temporal Predictor Design for Adaptive Video Coding.",
                    "Practical Indexing of Repetitive Collections Using Relative Lempel-Ziv.",
                    "LZRR: LZ77 Parsing with Right Reference.",
                    "On Lempel-Ziv Decompression in Small Space.",
                    "Polynomial Time Algorithms for Constructing Optimal AIFV Codes.",
                    "Texture-Classification Accelerated CNN Scheme for Fast Intra CU Partition in HEVC.",
                    "Enhanced Compression beyond HEVC for Next Generation Content.",
                    "Recursive Partitioning Search Space Pruning Using Split Cost Prediction.",
                    "A DenseNet Based Approach for Multi-frame In-loop Filter in HEVC.",
                    "Highly Flexible Coding Structures for Next-Generation Video Compression Standard.",
                    "Improved Video Coding Techniques for Next Generation Video Coding Standard.",
                    "Extended Quad-Tree Partitioning for Future Video Coding.",
                    "New Video Codec for High-Quality Video Service and Emerging Applications.",
                    "Rate Allocation for Bayer-Pattern Image Compression with JPEG XS.",
                    "Graph-Based Transform with Weighted Self-Loops for Predictive Transform Coding Based on Template Matching.",
                    "Quantizers with Parameterized Distortion Measures.",
                    "Combating Packet Loss in Image Coding Using Oversampling, Irregular Interpolation and Noise Shaping.",
                    "Quantized and Regularized Optimization for Coding Images Using Steered Mixtures-of-Experts.",
                    "Super-Ray Based Low Rank Approximation for Light Field Compression.",
                    "Graph-Based Spatio-Angular Prediction for Quasi-Lossless Compression of Light Fields.",
                    "Integer Fresnel Transform for Lossless Hologram Compression.",
                    "Wave Atoms for Lossy Compression of Digital Holograms.",
                    "Lossless Compression of Light Fields Using Multi-reference Minimum Rate Predictors.",
                    "An Overview of the OMAF Standard for 360° Video.",
                    "The Bit Allocation Method Based on Inter-View Dependency for Multi-View Texture Video Coding.",
                    "Compact Representations of Dynamic Video Background Using Motion Sprites.",
                    "Intra Picture Prediction for Video Coding with Neural Networks.",
                    "A Multi-Pass Coding Mode Search Framework For AV1 Encoder Optimization.",
                    "Intra-Prediction Side-Information Reduction Based on Gradient Boundary.",
                    "Machine Foveation: An Application-Aware Compressive Sensing Framework.",
                    "M to 1 Joint Source-Channel Coding of Gaussian Sources via Dichotomy of the Input Space Based on Deep Learning.",
                    "Advanced 3D Motion Prediction for Video Based Point Cloud Attributes Compression.",
                    "MR-RePair: Grammar Compression Based on Maximal Repeats.",
                    "RePair in Compressed Space and Time.",
                    "Regular Expression Search on Compressed Text.",
                    "Constructing Antidictionaries in Output-Sensitive Space.",
                    "Clustering Regression Wavelet Analysis for Lossless Compression of Hyperspectral Imagery.",
                    "Fast Depth Decision in Light Field Compression.",
                    "Light Field Image Compression with Random Access.",
                    "RDO-Based Light Field Image Coding Using Convolutional Neural Networks and Linear Approximation.",
                    "Enhanced Context Sensitive Flash Codes.",
                    "Deep Frame Interpolation for Video Compression.",
                    "Speckle Reduction for Efficient Coding of Experimental Holograms.",
                    "Humans are Still the Best Lossy Image Compressors.",
                    "Multiple Reference Line Coding for Most Probable Modes in Intra Prediction.",
                    "Multi-view Multi-modality Priors Residual Network of Depth Video Enhancement for Bandwidth Limited Asymmetric Coding Framework.",
                    "Fast CU Size Decision Based on AQ-CNN for Depth Intra Coding in 3D-HEVC.",
                    "Compressive-Sensed Image Coding via Multi-layer Closed-Loop Prediction.",
                    "Accelerating Convolutional Neural Networks with Dynamic Channel Pruning.",
                    "Online Machine Learning for Fast Coding Unit Decisions in HEVC.",
                    "Perceptual Video Coding Based on Visual Saliency Modulated Just Noticeable Distortion.",
                    "A Hardware-Friendly Extension of Line-Based Intra Prediction for Video Coding.",
                    "Multidimensional Compression with Pattern Matching.",
                    "An Efficient Coding Method for Spike Camera Using Inter-Spike Intervals.",
                    "Hybrid Point Cloud Geometry Coding Using Planes and Octree Representation Models.",
                    "Fast PU Intra Mode Decision in Intra HEVC Coding.",
                    "Separable KLT for Intra Coding in Versatile Video Coding (VVC).",
                    "Spike Coding: Towards Lossy Compression for Dynamic Vision Sensor.",
                    "A New Distributed Source Coding Problem Related to the Classical-Quantum Slepian-Wolf Problem.",
                    "Dataflow-Based Joint Quantization for Deep Neural Networks.",
                    "DeepZip: Lossless Data Compression Using Recurrent Neural Networks.",
                    "Fast Early Termination of CU Partition and Mode Selection Algorithm for Virtual Reality Video in HEVC.",
                    "Boosting Backward Search Throughput for FM-Index Using a Compressed Encoding.",
                    "Evaluation of Prediction of Quality Metrics for IR Images for UAV Applications.",
                    "Deep Learning Based Angular Intra-Prediction for Lossless HEVC Video Coding.",
                    "Level-of-Detail Generation Using Binary-Tree for Lifting Scheme in LiDAR Point Cloud Attributes Coding.",
                    "On the Randomness of Compressed Data.",
                    "Better Than Optimal Huffman Coding?",
                    "Selective Dynamic Compression.",
                    "A New Technique for Lossless Compression of Color Images Based on Hierarchical Prediction, Inversion and Context Adaptive Coding.",
                    "Generalized Word Equations: A New Approach to Data Compresion.",
                    "Signal Reconstruction Performance Under Quantized Noisy Compressed Sensing.",
                    "Bi-Intra Prediction for Versatile Video Coding.",
                    "Adaptive Quantization Parameter Selection Leveraging the Inter-Frame Distortion Propagation for HEVC Video Coding.",
                    "An End-to-End Encrypted Neural Network for Gradient Updates Transmission in Federated Learning.",
                    "Incremental Deep Neural Network Pruning Based on Hessian Approximation.",
                    "Improving Cube-to-ERP Conversion Performance with Geometry Features of 360 Video Structure.",
                    "Perception-Optimized Encoding for Visually Lossy Image Compression.",
                    "Fast Intra Prediction Algorithm for Virtual Reality 360 Degree Video Based on Improved RMD.",
                    "A CU Split Early Termination Algorithm Based KNN for 360-Degree Video.",
                    "Fast Encoding Algorithms for SHVC Intra/Inter Coding.",
                    "Rice-Marlin Codes: Tiny and Efficient Variable-to-Fixed Codes.",
                    "Decoder-Side Intra Mode Derivation Based on a Histogram of Gradients in Versatile Video Coding.",
                    "Vectorizing Fast Compression.",
                    "A Measurement Coding System for Block-Based Compressive Sensing Images by Using Pixel-Domain Features.",
                    "Rate Control Algorithm in HEVC Based on Scene-Change Detection.",
                    "Dynamic Lists for Efficient Coding of Intra Prediction Modes in the Future Video Coding Standard.",
                    "Client-Driven Transmission of JPEG2000 Image Sequences Using Motion Compensated Conditional Replenishment.",
                    "Graph Filtering For Data Reduction and Reconstruction.",
                    "Median Binary-Connect Method and a Binary Convolutional Neural Network for Word Recognition.",
                    "FastIntra360: A Fast Intra-Prediction Technique for 360-Degrees Video Coding.",
                    "Hardware-Friendly Intra Region-Based Template Matching for VVC.",
                    "Hard-Decision Quantization Algorithm Based on Deep Learning in Intra Video Coding.",
                    "A Global Co-Saliency Guided Bit Allocation for Light Field Image Compression.",
                    "Efficient and Fast Coefficient Sign Inference for Video Coding.",
                    "DNQ: Dynamic Network Quantization.",
                    "Bank Select Method for Reducing Symbol Search Operations on Stream-Based Lossless Data Compression.",
                    "Event-Triggered Stochastic Control via Constrained Quantization.",
                    "Enhanced Intra Block Copy with Planar Perspective Transformation for Urban Building Scenes.",
                    "Fast PU Early Termination Algorithm Based on WMSE for ERP Video Intra Prediction.",
                    "Deep Multiple Description Coding by Learning Scalar Quantization.",
                    "ResGAN: A Low-Level Image Processing Network to Restore Original Quality of JPEG Compressed Images."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "28th DCC 2018",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2018",
                "sub_name": "2018 Data Compression Conference, DCC 2018, Snowbird, UT, USA, March 27-30, 2018.",
                "count": 82,
                "papers": [
                    "Film Grain Synthesis for AV1 Video Codec.",
                    "Co-located Reference Frame Interpolation Using Optical Flow Estimation for Video Compression.",
                    "Adaptive Interpolated Motion-Compensated Prediction with Variable Block Partitioning.",
                    "Constant Delay Traversal of Compressed Graphs.",
                    "A Grammar Compression Algorithm Based on Induced Suffix Sorting.",
                    "Engineering Compressed Static Functions.",
                    "Online Decomposition of Compressive Streaming Data Using n-l1 Cluster-Weighted Minimization.",
                    "Rate Allocation for Motion Compensated JPEG2000.",
                    "Guided Cross-Component Prediction for RGB Video Coding.",
                    "Entropy Coding and Entropy Coding Improvements of JPEG XS.",
                    "Compressed Image Restoration via External-Image Assisted Band Adaptive PCA Model Learning.",
                    "Convex Optimization Based Bit Allocation for Light Field Compression Under Weighting and Consistency Constraints.",
                    "Spike Coding for Dynamic Vision Sensors.",
                    "A Group Variational Transformation Neural Network for Fractional Interpolation of Video Coding.",
                    "Protecting JPEG Images Against Adversarial Attacks.",
                    "Joint Source-Channel Coding with Neural Networks for Analog Data Compression and Storage.",
                    "Graph-Based Transforms Based on Prediction Inaccuracy Modeling for Pathology Image Coding.",
                    "Lossy Compression of Quality Scores in Differential Gene Expression: A First Assessment and Impact Analysis.",
                    "The Bits Between Proteins.",
                    "A New HEVC In-Loop Filter Based on Multi-channel Long-Short-Term Dependency Residual Networks.",
                    "The Multi-Scale Deep Decoder for the Standard HEVC Bitstreams.",
                    "Fast H.264/AVC to HEVC Transcoding Based on Compressed Domain Information.",
                    "Practical Succinct Text Indexes in External Memory.",
                    "Two-Dimensional Block Trees.",
                    "Compact Representations of Event Sequences.",
                    "Generalized Probability Smoothing.",
                    "Fixed-Rate Zero-Delay Source Coding for Stationary Vector-Valued Gauss-Markov Sources.",
                    "Universal Compression of Piecewise i.i.d. Sources.",
                    "Gaussian Hierarchical Identification with Pre-processing.",
                    "A Dynamic Compressed Self-Index for Highly Repetitive Text Collections.",
                    "Compact Encoding for Galled-Trees and Its Applications.",
                    "Exploiting Computation-Friendly Graph Compression Methods for Adjacency-Matrix Multiplication.",
                    "Run Compressed Rank/Select for Large Alphabets.",
                    "Improving Marlin's Compression Ratio with Partially Overlapping Codewords.",
                    "SPDP: An Automatically Synthesized Lossless Compression Algorithm for Floating-Point Data.",
                    "Performance Analysis of Hardware-Based Numerical Data Compression on Various Data Formats.",
                    "Intra Block Copy for Screen Content in the Emerging AV1 Video Codec.",
                    "Efficient AV1 Video Coding Using a Multi-layer Framework.",
                    "Predicting Chroma from Luma in AV1.",
                    "A Bayesian Approach to Block Structure Inference in AV1-Based Multi-Rate Video Encoding.",
                    "Lossless Image Compression Using Reversible Integer Wavelet Transforms and Convolutional Neural Networks.",
                    "Shearlet Transform Based Prediction Scheme for Light Field Compression.",
                    "High Efficient Snake Order Pseudo-Sequence Based Light Field Image Compression.",
                    "Complexity Reduction for Optimal Entropy-Constrained Quantization.",
                    "Compressed Hierarchical Clustering.",
                    "Enhance the HEVC Fast Intra CU Mode Decision Based on Convolutional Neural Network by Corner Power Estimation.",
                    "OCT: A Novel Opportunistic Compression and Transmission Approach for Private Car Trajectory Data.",
                    "Fast and Efficient Compression of Next Generation Sequencing Data.",
                    "Filtering Invalid Off-Targets in CRISPR/Cas9 Design Tools.",
                    "Hybrid Cubemap Projection Format for 360-Degree Video Coding.",
                    "Optimal Single- and Multiple-Tree Almost Instantaneous Variable-to-Fixed Codes.",
                    "Rate-Distortion Performance of Sequential Massive Random Access to Gaussian Sources with Memory.",
                    "K-Means Algorithm Over Compressed Binary Data.",
                    "Compaction of Church Numerals for Higher-Order Compression.",
                    "Improved Depth Compression by Depth Downsampling Guided by Color Super-Pixel Refinement Segmentation.",
                    "Efficient Processing of top-K Vector-Raster Queries Over Compressed Data.",
                    "Low-Complexity Spatial Scalability Scheme Using HEVC for 4K and VR Videos.",
                    "Simulated Annealing for JPEG Quantization.",
                    "Enhanced Intra Prediction with Recurrent Neural Network in Video Coding.",
                    "Lossless dynamic point cloud geometry compression with inter compensation and traveling salesman prediction.",
                    "Fibonacci Based Compressed Suffix Array.",
                    "Hybrid Sensor Network Data Compression with Error Resiliency.",
                    "High Performance Video Codec with Error Concealment.",
                    "Objective Performance Evaluation of Several State-of-the-Art Audio Codecs.",
                    "Rate-Distortion-Complexity Optimized Coding Scheme for Kvazaar HEVC Intra Encoder.",
                    "A Double Background Based Coding Scheme for Surveillance Videos.",
                    "Simplified Depth Intra Coding Based on Texture Feature and Spatial Correlation in 3D-HEVC.",
                    "Optimal In-Place Suffix Sorting.",
                    "Task-Based JPEG 2000 Image Compression: An Information-Theoretic Approach.",
                    "A Visual Discrimination Model for JPEG2000 Compression.",
                    "Unequal Weight Planar Prediction and Weighted Angular Prediction.",
                    "Fast and Robust Image Upsampling by Local Adaptive Gradient Field Sharpening Transform.",
                    "Integer Nesting/Splitting for Golomb-Rice Coding of Generalized Gaussian Sources.",
                    "Delta-Huffman Coding of Unbounded Integers.",
                    "LZ77 Like Lossy Transformation of Quality Scores.",
                    "Detail-Aware Image Decomposition for an HEVC-Based Texture Synthesis Framework.",
                    "Locally Refined Motion Compensation for Future Video Coding.",
                    "Lapped Transforms Based Image Recovery for Block Compressed Sensing.",
                    "Component-Based Quadratic Similarity Identification for Multivariate Gaussian Sources.",
                    "Fast Algorithm for HEVC Intra Prediction Based on Adaptive Mode Decision and Early Termination of CU Partition.",
                    "A Hybrid Approach for Wind Tunnel Data Compression.",
                    "An Innovative Saliency Guided ROI Selection Model for Panoramic Images Compression."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "27th DCC 2017",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2017",
                "sub_name": "2017 Data Compression Conference, DCC 2017, Snowbird, UT, USA, April 4-7, 2017.",
                "count": 85,
                "papers": [
                    "Spatially Scalable HEVC for Layered Division Multiplexing in Broadcast.",
                    "Conversion and Coding Practices for HDR/WCG ICTCP 4: 2: 0 Video.",
                    "Effective Quadtree Plus Binary Tree Block Partition Decision for Future Video Coding.",
                    "Adaptive Clipping in JEM.",
                    "Measure and Prediction of HEVC Perceptually Lossy/Lossless Boundary QP Values.",
                    "Recover Subjective Quality Scores from Noisy Measurements.",
                    "Influence of Dead Zone Quantization Parameters in the R/D Performance of Wavelet-Based Image Encoders.",
                    "A Compact Index for Order-Preserving Pattern Matching.",
                    "Complementary Contextual Models with FM-Index for DNA Compression.",
                    "Improved Parallel Construction of Wavelet Trees and Rank/Select Structures.",
                    "Full Compressed Affix Tree Representations.",
                    "Low Complexity Prediction Model for Coding Remote-Sensing Data with Regression Wavelet Analysis.",
                    "Error Bounds for HDR Image Coding with JPEG XT.",
                    "Pseudo Sequence Based 2-D Hierarchical Coding Structure for Light-Field Image Compression.",
                    "Signal Recovery in Compressive Sensing via Multiple Sparsifying Bases.",
                    "Compressed Sensing Performance of Binary Matrices with Binary Column Correlations.",
                    "Marlin: A High Throughput Variable-to-Fixed Codec Using Plurally Parsable Dictionaries.",
                    "Space-Efficient Re-Pair Compression.",
                    "Improvements on Re-Pair Grammar Compressor.",
                    "Cluster Adapted Signalling for Intra Prediction in HEVC.",
                    "Fast Intra Coding Implementation for High Efficiency Video Coding (HEVC).",
                    "Intra Prediction Using Multiple Reference Lines for Video Coding.",
                    "Reduced Reference Image Quality Assessment Based on Entropy of Classified Primitives.",
                    "Revisiting Perceptual Distortion for Natural Images: Mean Discrete Structural Similarity Index.",
                    "Semantic Perceptual Image Compression Using Deep Convolution Networks.",
                    "Compressed Dynamic Range Majority Data Structures.",
                    "A Succinct Data Structure for Multidimensional Orthogonal Range Searching.",
                    "Stabbing Colors in One Dimension.",
                    "Streaming K-Mismatch with Error Correcting and Applications.",
                    "Compression of Deep Neural Networks for Image Instance Retrieval.",
                    "Universal Source Coding of Deep Neural Networks.",
                    "Improved Queryable Representations of Rasters.",
                    "GeneComp, a New Reference-Based Compressor for SAM Files.",
                    "Statistical Compression of Protein Folding Patterns for Inference of Recurrent Substructural Themes.",
                    "LZ-End Parsing in Compressed Space.",
                    "An Asymmetric Difference Multiple Description Gaussian Noise Channel.",
                    "An LP Upper Bound for Rate Distortion with Variable Side Information.",
                    "Globally Variance-Constrained Sparse Representation for Rate-Distortion Optimized Image Representation.",
                    "Frame Rate Up-Conversion Based Motion Vector Derivation for Hybrid Video Coding.",
                    "Temporal Prediction of Motion Parameters with Interchangeable Motion Models.",
                    "A Novel Deep Learning-Based Method of Improving Coding Efficiency from the Decoder-End for HEVC.",
                    "Compact Deep Invariant Descriptors for Video Retrieval.",
                    "Adaptive Transforms for Inter-Predicted Residuals in Post-HEVC Video Coding.",
                    "Optimization of Sample Adaptive Band Offset in HEVC.",
                    "Symmetry-Compressible Graphs.",
                    "Convolutional Neural Networks Based Intra Prediction for HEVC.",
                    "Spike Camera and Its Coding Methods.",
                    "Adaptive High Efficiency Video Coding Based on Camera Activity Classification.",
                    "Probabilistic Graphical Model Based Fast HEVC Inter Prediction.",
                    "Rate-Distortion Optimization for Video Coding under Given Computational Complexity.",
                    "Making Compression Algorithms for Unicode Text.",
                    "SATD Based Fast Intra Prediction for HEVC.",
                    "Geometry Padding for Motion Compensated Prediction in 360 Video Coding.",
                    "Differential Gene Expression with Lossy Compression of Quality Scores in RNA-Seq Data.",
                    "Expanding Statistical Similarity Based Data Reduction to Capture Diverse Patterns.",
                    "Optimize Genomics Data Compression with Hardware Accelerator.",
                    "Nonconvex Optimization with Alternating Direction Method of Multipliers for Tensor-Based Compressed Sensing with Group Sparsity.",
                    "Dual Error Bounded Trajectory Simplification.",
                    "Seismic Data Compression Using Online Double-Sparse Dictionary Learning Schemes.",
                    "Visibility Thresholds in Reversible JPEG2000 Compression.",
                    "Wireless Image SoftCast Using Compressive Gradient.",
                    "Band-Wise Adaptive Sparsity Regularization for Quantized Compressed Sensing Exploiting Nonlocal Similarity.",
                    "Optimization of LIS and LIP Encoding for SPIHT-Based Image Compression.",
                    "An Efficient Motion Estimation Method for QTBT Structure in JVET Future Video Coding.",
                    "Compressing Tabular Data via Pairwise Dependencies.",
                    "Cross-Color Channel Perceptually Adaptive Quantization for HEVC.",
                    "A Kirchhoff Migration of Seismic Data Represented by Orthogonal Matching Pursuit Coefficients.",
                    "Content Adaptive Embedded Compression.",
                    "Deep Blind Compressed Sensing.",
                    "How to Train Your Neural Network with Dictionary Learning.",
                    "Watching Videos with Certain and Constant Quality: PID-Based Quality Control Method.",
                    "Early-Split Based Fast HEVC Encoding.",
                    "An End-to-End Compression Framework Based on Convolutional Neural Networks.",
                    "Distributed Quantization of Correlated Images.",
                    "ISA-L Igzip: Improvements to a Fast Deflate.",
                    "Cruise UAV Video Compression Based on Long-Term Wide-Range Background.",
                    "Tree-Structured Vector Quantization for Similarity Queries.",
                    "An Optimally Scalable and Cost-Effective Algorithm for 1/8-Pixel Motion Estimation for HEVC.",
                    "Illumination Attributes Coding for Virtual Reality Broadcasting System.",
                    "A New All-Zero Block Detection Algorithm for High Efficiency Video Coding.",
                    "Visual Experience Analysis for Polygon Mesh on Different Display Devices.",
                    "Omnidirectional Video Quality Metrics and Evaluation Process.",
                    "Enhanced Block-Matching and 3D Filter for HEVC Screen Content Image Denoising.",
                    "Early CU Size Determination Based on Image Complexity in HEVC.",
                    "Abnormal Event Detection in Surveillance Video: A Compressed Domain Approach for HEVC."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "26th DCC 2016",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2016",
                "sub_name": "2016 Data Compression Conference, DCC 2016, Snowbird, UT, USA, March 30 - April 1, 2016.",
                "count": 118,
                "papers": [
                    "Lempel-Ziv Computation in Compressed Space (LZ-CICS).",
                    "Linear Time Succinct Indexable Dictionary Construction with Applications.",
                    "Computing LZ77 in Run-Compressed Space.",
                    "Parallel Lightweight Wavelet Tree, Suffix Array and FM-Index Construction.",
                    "Induced Suffix Sorting for String Collections.",
                    "Faster, Minuter.",
                    "A Space Efficient Direct Access Data Structure.",
                    "Enhanced Multiple Transform for Video Coding.",
                    "Bi-directional Pptical Flow for Future Video Codec.",
                    "Structure-driven Adaptive Non-local Filter for High Efficiency Video Coding (HEVC).",
                    "Adaptive Motion Vector Resolution Scheme for Enhanced Video Coding.",
                    "Intra Frame Flicker Reduction for Parallelized HEVC Encoding.",
                    "Regression Wavelet Analysis for Progressive-Lossy-to-Lossless Coding of Remote-Sensing Data.",
                    "Transform Optimization for the Lossy Coding of Pathology Whole-Slide Images.",
                    "Point Cloud Attribute Compression Using 3-D Intra Prediction and Shape-Adaptive Transforms.",
                    "On the Minimum Distortion of Quantizers with Heterogeneous Reproduction Points.",
                    "Nonconvex Lp Nuclear Norm based ADMM Framework for Compressed Sensing.",
                    "Compressive-Sensed Image Coding via Stripe-based DPCM.",
                    "Compressive Tensor Sampling with Structured Sparsity.",
                    "Bayesian Compressed Sensing with Heterogeneous Side Information.",
                    "A Reconstruction Algorithm with Multiple Side Information for Distributed Compression of Sparse Sources.",
                    "Burrows-Wheeler Transform for Terabases.",
                    "An Evaluation Framework for Lossy Compression of Genome Sequencing Quality Values.",
                    "Efficient Compression of Genomic Sequences.",
                    "Predictive Coding of Aligned Next-Generation Sequencing Data.",
                    "Denoising of Quality Scores for Boosted Inference and Reduced Storage.",
                    "A Cluster-Based Approach to Compression of Quality Scores.",
                    "CS2A: A Compressed Suffix Array-Based Method for Short Read Alignment.",
                    "Compression Efficiency Improvement over HEVC Main 10 Profile for HDR and WCG Content.",
                    "High Dynamic Range Video Coding with Backward Compatibility.",
                    "Optimal Bitrate Allocation for High Dynamic Range and Wide Color Gamut Services Deployment Using SHVC.",
                    "Backward Compatible HDR Video Compression System.",
                    "Luma Adjustment for High Dynamic Range Video.",
                    "Authorship Attribution Using Relative Compression.",
                    "Timeliness in Lossless Block Coding.",
                    "Online Grammar Transformation Based on Re-Pair Algorithm.",
                    "On Compression Techniques for Computing Convolutions.",
                    "A Simple and Efficient Approach for Adaptive Entropy Coding over Large Alphabets.",
                    "Interactive Function Compression with Asymmetric Priors.",
                    "Compressing Combinatorial Objects.",
                    "Tiny Descriptors for Image Retrieval with Unsupervised Triplet Hashing.",
                    "From Visual Search to Video Compression: A Compact Representation Framework for Video Feature Descriptors.",
                    "Locally-Weighted Template-Matching Based Prediction for Cloud-Based Image Compression.",
                    "Coding Scheme for the Transmission of Satellite Imagery.",
                    "Optimizing Subjective Quality in HEVC-MSP: An Approximate Closed-form Image Compression Approach.",
                    "Graph-Based Transform for 2D Piecewise Smooth Signals with Random Discontinuities.",
                    "On Perceptual Audio Compression with Side Information at the Decoder.",
                    "The Thor Video Codec.",
                    "Fast Algorithm for HDR Color Conversion.",
                    "General Synthesized View Distortion Estimation for Depth Map Compression of FTV.",
                    "A Framework of Complexity Optimally Scalable Algorithms for HEVC.",
                    "Improved Range Minimum Queries.",
                    "Self-Indexing RDF Archives.",
                    "Shortest DNA Cyclic Cover in Compressed Space.",
                    "Traversing Grammar-Compressed Trees with Constant Delay.",
                    "Practical Index Framework for Efficient Time-Travel Phrase Queries on Versioned Documents.",
                    "Compact Navigation Oracles for Graphs with Bounded Clique-Width.",
                    "Motion Hint Field with Content Adaptive Motion Model for High Efficiency Video Coding (HEVC).",
                    "Joint Framework for Signal Reconstruction Using Matched Wavelet Estimated from Compressively Sensed Data.",
                    "Lossy Compression of Unordered Rooted Trees.",
                    "Single-Loop Software Architecture for JPEG 2000.",
                    "Transforms for Motion-Compensated Residuals Based on Prediction Inaccuracy Modeling.",
                    "RKLT-Based Lossless Hyperspectral Image Compression Combined with Principal Components Selection.",
                    "Compression-Inspired Author Profiling.",
                    "Grammatical Ziv-Lempel Compression: Achieving PPM-Class Text Compression Ratios with LZ-Class Decompression Speed.",
                    "Quick Access to Compressed Data in Storage Systems.",
                    "A Fast Splitting Algorithm for an H.264/AVC to HEVC Intra Video Transcoder.",
                    "StarIso: Graph Isomorphism Through Lossy Compression.",
                    "Computational Architecture for Fast Seismic Data Transmission between CPU and FPGA by Using Data Compression.",
                    "Fast Cover Song Retrieval in Advanced Audio Coding Domain Based on Deep Learning Technique.",
                    "Delta Encoding of Virtual-Machine Memory in the Dynamic Analysis of Malware.",
                    "Network of Spiking Neurons Driven by Compression.",
                    "HEVC Fast CU Encoding Based Quadtree Prediction.",
                    "Realistic 3D Mesh Compression Based on Predicted Angle-Normal Images.",
                    "Compressed Forensic Source Image Using Source Pattern Map.",
                    "Fast Acquisition for Quantitative MRI Maps: Sparse Recovery from Non-Linear Measurements.",
                    "Connection between DCT and Discrete-Time Fractional Brownian motion.",
                    "Analysis and Synthesis Prior Greedy Algorithms for Non-linear Sparse Recovery.",
                    "Rate-Distortion Optimized Compression Algorithm for 3D Triangular Mesh Sequences.",
                    "When Less is More - Using Restricted Repetition Search in Fast Compressors.",
                    "Efficient Environmental Temperature Monitoring Using Compressed Sensing.",
                    "Engineering Wavelet Tree Implementations for Compressed Web Graph Representations.",
                    "Approximate String Matching for Self-Indexes.",
                    "Hardware Based Compression in Big Data.",
                    "Small Polygon Compression.",
                    "Opportunities for High-Level Parallelism in Multiview Video Coding.",
                    "Massively Efficient Motion Estimation by Exploiting Inter-Pixel Similarities.",
                    "Decision Zone-Based Parallel Fast Motion and Disparity Estimation Scheme for Multiview Coding.",
                    "Low-Latency Lossless Compression for Data Bus Using Multiple-Type Dictionaries.",
                    "Analysis of a Rewriting Compression System for Flash Memory.",
                    "Multi-mode Kernel-Based Minimum Mean Square Error Estimator for Accelerated Image Error Concealment.",
                    "A Performance Case-Study on Memristive Computing-in-Memory Versus Von Neumann Architecture.",
                    "Textural and Gradient Feature Extraction from JPEG2000 Codestream for Airfield Detection.",
                    "Accelerate Data Compression in File System.",
                    "A New Transform Video Coding Algorithm.",
                    "Deep Convolutional Neural Network for Decompressed Video Enhancement.",
                    "Content Adaptive Interpolation Filters for HEVC Framework.",
                    "Compression Ratio Design in Compressive Spectral Imaging.",
                    "Overview of the MPEG Activity on Point Cloud Compression.",
                    "Novel Algorithm for Stereoscopic Image Quality Assessment.",
                    "A Novel Development Infrastructure for Scalable Video Coding/Transcoding Applications.",
                    "A Context-Aware Taxonomy of Deduplication Metrics for Backup Strategies.",
                    "Globally Optimal Algorithms for Transform Selection in Multiple-Transform Signal Compression.",
                    "Leveraging CABAC for No-Reference Compression of Genomic Data with Random Access Support.",
                    "Adaptive Quantization Matrices for HD and UHD Resolutions in Scalable HEVC.",
                    "Positional Inverted Self-index.",
                    "Transform Coding for On-the-Fly Learning Based Block Transforms.",
                    "Just Noticeable Difference Based Fast Coding Unit Partition in 3D-HEVC Intra Coding.",
                    "Generalization of Efficient Implementation of Compression by Substring Enumeration.",
                    "Joint Design of Layered Coding Quantizers to Extract and Exploit Common Information.",
                    "Low-Complexity, Backward-Compatible Coding of High Dynamic Range Images and Video.",
                    "The Rate Loss in Binary Source Coding with Decoder Side Information.",
                    "Interactive Quantization for Extremum Computation in Collocated Networks.",
                    "Low Delay Complexity Constrained Encoding.",
                    "Low Complexity Pixel Domain Perceptual Image Compression via Adaptive Down-Sampling.",
                    "Quality and Error Robustness Assessment of Low-Latency Lightweight Intra-Frame Codecs.",
                    "Coefficient-wise Deadzone Hard-decision Quantizer with Adaptive Rounding Offset Model.",
                    "A Novel Algorithm to Decrease the Computational Complexity of HEVC Intra Coding."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "25th DCC 2015",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2015",
                "sub_name": "2015 Data Compression Conference, DCC 2015, Snowbird, UT, USA, April 7-9, 2015.",
                "count": 86,
                "papers": [
                    "Asymmetric 3D Lookup Table Based Color Gamut Scalability in SHVC.",
                    "HEVC-Compatible Extensions for Advanced Coding of 3D and Multiview Video.",
                    "Resampling Process of the Scalable High Efficiency Video Coding.",
                    "Global Coding of Multi-source Surveillance Video Data.",
                    "Fast HEVC Intra Mode Decision Based on Edge Detection and SATD Costs Classification.",
                    "R-(lambda) Model Based Improved Rate Control for HEVC with Pre-Encoding.",
                    "Parallel Wavelet Tree Construction.",
                    "Range Selection Queries in Data Aware Space and Time.",
                    "Queries on LZ-Bounded Encodings.",
                    "Faster Compressed Quadtrees.",
                    "Document Counting in Compressed Space.",
                    "Near-Optimal Compression for Compressed Sensing.",
                    "Augmented Bayesian Compressive Sensing.",
                    "Block-Based Compressive Sensing Coding of Natural Images by Local Structural Measurement Matrix.",
                    "Lossless Coding Extensions for JPEG.",
                    "Depth Map Compression Using Color-Driven Isotropic Segmentation and Regularised Reconstruction.",
                    "Strategy of Microscopic Parallelism for Bitplane Image Coding.",
                    "Predictive Principal Component Analysis as a Data Compression Core in a Simulation Data Management System.",
                    "On Probability Estimation via Relative Frequencies and Discount.",
                    "Improving PPM with Dynamic Parameter Updates.",
                    "Incremental Locality and Clustering-Based Compression.",
                    "Universal Compression of Memoryless Sources over Large Alphabets via Independent Component Analysis.",
                    "Compressing Yahoo Mail.",
                    "Adaptive Color-Space Transform for HEVC Screen Content Coding.",
                    "A Fast Algorithm for Adaptive Motion Compensation Precision in Screen Content Coding.",
                    "Palette-Based Coding in the Screen Content Coding Extension of the HEVC Standard.",
                    "2-D Index Map Coding for HEVC Screen Content Compression.",
                    "Block Vector Prediction for Intra Block Copying in HEVC Screen Content Coding.",
                    "On the Efficiency of View Synthesis Prediction for 3D Video Coding.",
                    "Coding and Enhancement in Wireless Acoustic Sensor Networks.",
                    "IoT Data Compression: Sensor-Agnostic Approach.",
                    "Depth Error Induced Virtual View Synthesis Distortion Estimation for 3D Video Coding.",
                    "Overview of the MPEG CDVS Standard.",
                    "Compact Global Descriptors for Visual Search.",
                    "Mobile Visual Search with Word-HOG Descriptors.",
                    "Rank Preserving Hashing for Rapid Image Search.",
                    "Serializing RDF in Compressed Space.",
                    "Efficient Set Operations over k2-Trees.",
                    "Variable-Order de Bruijn Graphs.",
                    "Data Compression Cost Optimization.",
                    "Smaller and Faster: Parallel Processing of Compressed Graphs with Ligra+.",
                    "Compression for Similarity Identification: Computing the Error Exponent.",
                    "Geometric Compression of Orientation Signals for Fast Gesture Analysis.",
                    "A Partial Hstry of Losy Compression.",
                    "It's Been 1, 000, 000 Years Since Huffman.",
                    "OnlineRePair: A Recompressor for XML Structures.",
                    "Kernel Machine Classification Using Universal Embeddings.",
                    "Compression-Aware Algorithms for Massive Datasets.",
                    "Bi-Directional Context Modeling with Combinatorial Structuring for Genome Sequence Compression.",
                    "Compound-Cognizant Feature Compression of Gas Chromatographic Data to Facilitate Environmental Forensics.",
                    "Perceptual-Based Distributed Compressed Video Sensing.",
                    "Exploiting Temporal Redundancy of Visual Structures for Video Compression.",
                    "Intra-/inter-View Correlation Based Multiple Description Coding for Multiview Transmission.",
                    "Enhanced Direct Access to Huffman Encoded Files.",
                    "Adaptive Quadrilateral-Shape Block Partitioning for Effective Bit-Reduced Intra-Prediction in Next-Step of H.265/HEVC.",
                    "A Data-Driven Probabilistic CTU Splitting Algorithm for Fast H.264/HEVC Video Transcoding.",
                    "Joint Weighted Sparse Representation Based Median Filter for Depth Video Coding.",
                    "Practical Compression with Model-Code Separation.",
                    "Lossless Data Compression via Substring Enumeration for k-th Order Markov Sources with a Finite Alphabet.",
                    "Quantized Perceptual Compressed Sensing for Audio Signal Compression.",
                    "Classification Using Residual Vector Quantization with Markov-Bayesian Structure.",
                    "Image Restoration Based on 3-D Autoregressive Model via Low-Rank Minimization.",
                    "Subspace Learning with Structured Sparsity for Compressive Video Sampling.",
                    "Energy Compaction on Graphs for Motion-Adaptive Transforms.",
                    "SVM-Based Fast Intra CU Depth Decision for HEVC.",
                    "Joint Geometric Verification and Ranking Using Multi-view Vocabulary Trees for Mobile 3D Visual Search.",
                    "On Probability Estimation by Exponential Smoothing.",
                    "On the Design of Optimal Sub-Pixel Motion Compensation Interpolation Filters for Video Compression.",
                    "A New Metric of Image Quality Assessment for Stereoscopic Content.",
                    "Variable-Length Lossy Compression Algorithms Based on Constrained Random Numbers.",
                    "Compression of Next Generation Sequencing Data.",
                    "Intra Block Copy for HEVC Screen Content Coding.",
                    "Hybrid Image Compression by Using Vector Quantization (VQ) and Vector-Embedded Karhunen-Loève Transform (VEKLT).",
                    "Compression Based on a Joint Task-Specific Information Metric.",
                    "A Parallelization Framework for High Throughput Entropy Coding.",
                    "Cuboid Coding of Depth Motion Vectors Using Binary Tree Based Decomposition.",
                    "Adaptive Submodular Dictionary Selection for Sparse Representation Modeling with Application to Image Super-Resolution.",
                    "Adaptive Prediction with Switched Models.",
                    "Progressive Dictionary Learning with Hierarchical Structure for Scalable Video Coding.",
                    "Clustered Multi-dictionary Code Compression for Embedded Systems.",
                    "Generalized Context Transformations - Enhanced Entropy Reduction.",
                    "Optimizing Binary Fisher Codes for Visual Search.",
                    "A Block-Based Background Model for Surveillance Video Coding.",
                    "Texture Characteristics Based Fast Coding Unit Partition in HEVC Intra Coding.",
                    "Multi-stage Hash Based Motion Estimation for HEVC.",
                    "Practical Considerations in Applying Compressed Sensing to Simulation Data."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "24th DCC 2014",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2014",
                "sub_name": "Data Compression Conference, DCC 2014, Snowbird, UT, USA, 26-28 March, 2014.",
                "count": 84,
                "papers": [
                    "Feature Matching Performance of Compact Descriptors for Visual Search.",
                    "AKULA - Adaptive Cluster Aggregation for Visual Search.",
                    "Hierarchically Structured Multi-view Features for Mobile Visual Search.",
                    "Interframe Coding of Global Image Signatures for Mobile Augmented Reality.",
                    "2-D Dictionary Based Video Coding for Screen Contents.",
                    "Motion-Adaptive Transforms Based on the Laplacian of Vertex-Weighted Graphs.",
                    "Union of Data-Driven Subspaces via Subspace Clustering for Compressive Video Sampling.",
                    "Theoretical Considerations Concerning Pixelwise Temporal Filtering.",
                    "Rate Allocation in a Two Quantizer Coding System.",
                    "Gaussian Process Regression Based Prediction for Lossless Image Coding.",
                    "Adaptive Edge Encoding Schemes for the Rate-Distortion Optimal Polygon-Based Shape Coding.",
                    "Binocular Perceptual Model for Symmetric and Asymmetric 3D Stereoscopic Image Compression.",
                    "Multiple Description Image Coding with Local Random Measurements.",
                    "G-CAST: Gradient Based Image SoftCast for Perception-Friendly Wireless Visual Communication.",
                    "Cell-Based 2-Step Scalar Deadzone Quantization for JPEG2000.",
                    "Lempel-Ziv Parsing in External Memory.",
                    "Space Efficient Linear Time Lempel-Ziv Factorization for Small Alphabets.",
                    "Fully Online Grammar Compression in Constant Space.",
                    "Alignment Free Sequence Similarity with Bounded Hamming Distance.",
                    "Boosting the Compression of Rewriting on Flash Memory.",
                    "Combining Deduplication and Delta Compression to Achieve Low-Overhead Data Reduction on Backup Datasets.",
                    "Compressing Semantic Information with Varying Priorities.",
                    "A Fast Implementation of Deflate.",
                    "On Optimal Coding of Hidden Markov Sources.",
                    "Primal-Dual Characterizations of Jointly Optimal Transmission Rate and Scheme for Distributed Sources.",
                    "Flexible Multiple Description Lattice Vector Quantizer with L ≥ 3 Descriptions.",
                    "Distributed Remote Vector Gaussian Source Coding for Wireless Acoustic Sensor Networks.",
                    "ALISP-Based Data Compression for Generic Audio Indexing.",
                    "Fast Fully-Compressed Suffix Trees.",
                    "A Practical Implementation of Compressed Suffix Arrays with Applications to Self-Indexing.",
                    "Hybrid Compression of Bitvectors for the FM-Index.",
                    "Compressing Similar Biological Sequences Using FM-Index.",
                    "LZ-Compressed String Dictionaries.",
                    "Compression Schemes for Similarity Queries.",
                    "Interleaved K2-Tree: Indexing and Navigating Ternary Relations.",
                    "Cache-Oblivious Peeling of Random Hypergraphs.",
                    "Enhanced Variable-Length Codes: Improved Compression with Efficient Random Access.",
                    "Better Compression through Better List Update Algorithms.",
                    "Multi-level Distributed Arithmetic Coding with Nested Lattice Quantization.",
                    "Universal Text Preprocessing and Postprocessing for PPM Using Alphabet Adjustment.",
                    "FPGA Implementation of a Huffman Decoder for High Speed Seismic Data Decompression.",
                    "Compression Limits of Wavelet-Based Image Coding.",
                    "Two-Stage Multiview Image Compression Using Interview SIFT Matching.",
                    "Improving Compression via Substring Enumeration by Explicit Phase Awareness.",
                    "Lossless Medical Image Compression in a Block-Based Storage System.",
                    "The FPSO for selecting number of components in Tucker3 decomposition for Hyperspectral image compression.",
                    "An Image Coder for the Presentation of Products with Multiple Color Choices.",
                    "Randomized Iterative Hard Thresholding for Sparse Approximations.",
                    "Comparison on Effects of SAR Data Compression in SQNR and Coherent Change Detection.",
                    "Relative Lempel-Ziv with Constant-Time Random Access.",
                    "Linear Rate Estimation Model for HEVC RDO Using Binary Classification Based Regression.",
                    "Effective Image Block Compressed Sensing with Quantized Measurement.",
                    "Nonlinear Adaptive Filtering with Dimension Reduction in the Wavelet Domain.",
                    "Compressed Bit Vectors Based on Variable-to-Fixed Encodings.",
                    "Direct Processing of Compressed SIFT Feature Vectors.",
                    "Lossless Compression of DNA Microarray Images with Inversion Coder.",
                    "Improved Inter-Layer Prediction for the Scalable Extensions of HEVC.",
                    "A 3D HEVC Fast Mode Decision Algorithm Based on the Depth Information Guided Maximum Coding Level.",
                    "Embedded Transform Coding Based Lossless Compression in Compressive Spectral Imaging with Coded Aperture.",
                    "Compressive Detection of Multiple Frequency-Hopping Spread Spectrum Signals.",
                    "K-Means Based Spatial Aggregation for Hyperspectral Compression.",
                    "Towards Markup-Aware Text Compression.",
                    "PHi-SET: Perceptual Quantization Using a Chromatic Induction Model.",
                    "Compression of Quality Factors in Next Generation Sequencing.",
                    "Information Profiles for DNA Pattern Discovery.",
                    "A Conditional Compression Distance that Unveils Insights of the Genomic Evolution.",
                    "Subband Decomposition for High-Resolution Color in HEVC and AVC 4: 2: 0 Video Coding Systems.",
                    "Improvements to HEVC Intra Coding for Lossless Medical Image Compression.",
                    "Improved Motion Vector Compression Using 3D-Warping.",
                    "Adaptive Dictionary Sharing Method for Re-Pair Algorithm.",
                    "Transform Coding of Self-Similar Processes based on the Wigner-Ville Distribution for Inference on Vehicular Accelerometer Data.",
                    "Compressing Sets and Multisets of Sequences.",
                    "Multiscale Online Dictionary Learning for Quality Scalable Video Coding.",
                    "Residue Coding Technique for Video Compression.",
                    "Bin Classification Using Temporal Gradient Estimation for Lossless Video Coding.",
                    "Entropy Reduction Using Context Transformations.",
                    "Improvement of Adaptive Fractal Image Coding Algorithm for GPGPU Systems Using Index Vectors.",
                    "Effective and Efficient Bitmaps for Access Control.",
                    "Efficient Algorithm and Coding for Higher-Order Compression.",
                    "An Efficient Lossless Image Compression Algorithm for External Memory Bandwidth Saving.",
                    "Direct Access to Variable-to-Fixed Length Codes with a Succinct Index.",
                    "SNR Scalable Extension for 3D-HEVC.",
                    "Fast Intra Prediction Based BCIM for Depth-Map in 3D-HEVC.",
                    "Multiscale Edge Coding and Adaptive Lifting for Depth Maps Coding in 3-D Video."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "23rd DCC 2013",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2013",
                "sub_name": "2013 Data Compression Conference, DCC 2013, Snowbird, UT, USA, March 20-22, 2013.",
                "count": 112,
                "papers": [
                    "Tunneling High-Resolution Color Content through 4: 2: 0 HEVC and AVC Video Coding Systems.",
                    "Fast Transforms for Intra-prediction-based Image and Video Coding.",
                    "Model Correction for Cross-Channel Chroma Prediction.",
                    "A Parametric Merge Candidate for High Efficiency Video Coding.",
                    "Coding Tree Depth Estimation for Complexity Reduction of HEVC.",
                    "Fast Coding Unit Depth Decision Algorithm for Interframe Coding in HEVC.",
                    "Highly Parallel Framework for HEVC Motion Estimation on Many-Core Platform.",
                    "Low Complexity Rate Distortion Optimization for HEVC.",
                    "Decoder-Side Super-Resolution and Frame Interpolation for Improved H.264 Video Coding.",
                    "Image Super-Resolution via Hierarchical and Collaborative Sparse Representation.",
                    "Progressive Image Restoration through Hybrid Graph Laplacian Regularization.",
                    "A Simple Online Competitive Adaptation of Lempel-Ziv Compression with Efficient Random Access Support.",
                    "Practical Parallel Lempel-Ziv Factorization.",
                    "Simpler and Faster Lempel Ziv Factorization.",
                    "From Run Length Encoding to LZ78 and Back Again.",
                    "Backwards Compatible Coding of High Dynamic Range Images with JPEG.",
                    "Visually Lossless JPEG 2000 Decoder.",
                    "A Distortion Metric for the Lossy Compression of DNA Microarray Images.",
                    "Motion-Adaptive Transforms Based on Vertex-Weighted Graphs.",
                    "Scalable Video Coding Extension for HEVC.",
                    "A Scalable Video Coding Extension of HEVC.",
                    "Color Gamut Scalable Video Coding.",
                    "Texture Compression.",
                    "Cross Segment Decoding for Improved Quality of Experience for Video Applications.",
                    "Ultra Fast H.264/AVC to HEVC Transcoder.",
                    "Efficient Coding of Signal Distances Using Universal Quantized Embeddings.",
                    "Very Low-Rate Variable-Length Channel Quantization for Minimum Outage Probability.",
                    "Low Complexity Embedded Quantization Scheme Compatible with Bitplane Image Coding.",
                    "Quantisation Invariants for Transform Parameter Estimation in Coding Chains.",
                    "Quantization Games on Networks.",
                    "Linear and Geometric Mixtures - Analysis.",
                    "Multiple Description Coding for Closed Loop Systems over Erasure Channels.",
                    "Partition Tree Weighting.",
                    "Structural Group Sparse Representation for Image Compressive Sensing Recovery.",
                    "Faster Compressed Top-k Document Retrieval.",
                    "Faster Compact Top-k Document Retrieval.",
                    "Context-Based Algorithms for the List-Update Problem under Alternative Cost Models.",
                    "An Adaptive Difference Distribution-Based Coding with Hierarchical Tree Structure for DNA Sequence Compression.",
                    "Compressing Huffman Models on Large Alphabets.",
                    "On the Relationships among Optimal Symmetric Fix-Free Codes.",
                    "Practical Coding Scheme for Universal Source Coding with Side Information at the Decoder.",
                    "Near in Place Linear Time Minimum Redundancy Coding.",
                    "The Rightmost Equal-Cost Position Problem.",
                    "Predictive Coding of Integers with Real-Valued Predictions.",
                    "Quadratic Similarity Queries on Compressed Data.",
                    "Computing Convolution on Grammar-Compressed Text.",
                    "Compressed Parameterized Pattern Matching.",
                    "Simplified HEVC FME Interpolation Unit Targeting a Low Cost and High Throughput Hardware Design.",
                    "Low Complexity Improvement for Hyperspectral Asymmetrical Data Compression.",
                    "Sample Adaptive Offset Design in HEVC.",
                    "A Method for Fast Rough Mode Decision in HEVC.",
                    "Compact Data Structures for Temporal Graphs.",
                    "Algorithms for Compressed Inputs.",
                    "Compression of Distributed Correlated Temperature Data in Sensor Networks.",
                    "Multiterminal Source Coding for Many Sensors with Entropy Coding and Gaussian Process Regression.",
                    "An Optimal Switched Adaptive Prediction Method for Lossless Video Coding.",
                    "Combining Geometry Simplification and Coordinate Approximation Techniques for Better Lossy Compression of GIS Data.",
                    "Random Extraction from Compressed Data - A Practical Study.",
                    "A DCT-Based Image Coder Tailored to Product Presentation.",
                    "A Compression Algorithm for Fluctuant Data in Smart Grid Database Systems.",
                    "Real-Time Compression of Intra-Cerebral EEG Using Eigendecomposition with Dynamic Dictionary.",
                    "Multi-Level Dictionary Used in Code Compression for Embedded Systems.",
                    "Efficient Quadtree Compression for Temporal Trajectory Filtering.",
                    "Low Bit-Rate Subpixel-Based Color Image Compression.",
                    "Visually Lossless Compression of Stereo Images.",
                    "A Realistic Distributed Storage System That Minimizes Data Storage and Repair Bandwidth.",
                    "High Compression Rate and Ratio Using Predefined Huffman Dictionaries.",
                    "Evaluation of Efficient Compression Properties of the Complete Oscillator Method, Part 1: Canonical Signals.",
                    "Frame-Compatible Stereo 3D Services Using H.264/AVC and HEVC.",
                    "Analog Joint Source Channel Coding over Non-Linear Channels.",
                    "Space-Efficient Construction Algorithm for the Circular Suffix Tree.",
                    "Robust Adaptive Image Coding for Frame Memory Reduction in LCD Overdrive.",
                    "A Binning Design for Wyner-Ziv Video Coding.",
                    "Differential Base Pattern Coding for Cache Line Data Compression.",
                    "Lossless Compression of Rotated Maskless Lithography Images.",
                    "Compression of Optimal Value Functions for Markov Decision Processes.",
                    "Efficient Parallelization of Different HEVC Decoding Stages.",
                    "Considerations and Algorithms for Compression of Sets.",
                    "Visually Lossless Compression of Windowed Images.",
                    "Angular Disparity Map: A Scalable Perceptual-Based Representation of Binocular Disparity.",
                    "VDH-Grid Search Algorithm for Fast Motion Estimation.",
                    "Single-Pass Dependent Bit Allocation in Temporal Scalability Video Coding.",
                    "3D Wavelet Encoder for Depth Map Data Compression.",
                    "Perceptual Intra Video Encoder for High-Quality High-Definition Content.",
                    "Domain-Specific XML Compression.",
                    "NRPSNR: No-Reference Peak Signal-to-Noise Ratio for JPEG2000.",
                    "pGBbBShift: Method for Introducing Perceptual Criteria to Region of Interest Coding.",
                    "Computed Tomography Image Coding through Air Filtering in the Wavelet Domain.",
                    "Natural Language Compression Optimized for Large Set of Files.",
                    "A High Throughput Multi Symbol CABAC Framework for Hybrid Video Codecs.",
                    "Image Blocking Artifacts Reduction via Patch Clustering and Low-Rank Minimization.",
                    "High Throughput Coding of Video Signals.",
                    "Variable-to-Fixed-Length Encoding for Large Texts Using Re-Pair Algorithm with Shared Dictionaries.",
                    "Subsampling Input Based Side Information Creation in Wyner-Ziv Video Coding.",
                    "Low-Complexity Global Motion for AVC and HEVC Coders.",
                    "Image Coding Using Nonlinear Evolutionary Transforms.",
                    "STOL: Spatio-Temporal Online Dictionary Learning for Low Bit-Rate Video Coding.",
                    "Context Lossless Coding of Audio Signals.",
                    "Improving the Efficiency of Video Coding by Using Perceptual Preprocessing Filter.",
                    "Genome Sequence Compression with Distributed Source Coding.",
                    "Online Learning Based Face Distortion Recovery for Conversational Video Coding.",
                    "Mode Duplication Based Multiview Multiple Description Video Coding.",
                    "Universal Numerical Encoder and Profiler Reduces Computing's Memory Wall with Software, FPGA, and SoC Implementations.",
                    "Diagnostically Lossless Compression of X-Ray Angiographic Images through Background Suppression.",
                    "Efficient Parallel Framework for HEVC Deblocking Filter on Many-Core Platform.",
                    "Evaluation of Efficient Compression Properties of the Complete Oscillator Method, Part 2: Speech Coding.",
                    "Effective Variable-Length-to-Fixed-Length Coding via a Re-Pair Algorithm.",
                    "Image Compression via Colorization Using Semi-Regular Color Samples.",
                    "Inter-view Reference Frame Selection in Multi-view Video Coding.",
                    "Hierarchical-and-Adaptive Bit-Allocation with Selective Background Prediction for High Efficiency Video Coding (HEVC).",
                    "LBP-Guided Depth Image Filter.",
                    "Lossless Compression of 3D Grid-Based Model Based on Octree."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "22nd DCC 2012",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2012",
                "sub_name": "2012 Data Compression Conference, Snowbird, UT, USA, April 10-12, 2012.",
                "count": 65,
                "papers": [
                    "Progressive-to-Lossless Compression of Color-Filter-Array Images Using Macropixel Spectral-Spatial Transformation.",
                    "Compressing JPEG 2000 JPIP Cache State Information.",
                    "Enhanced Transmission of JPEG2000 Imagery through JPIP Proxy and User-Navigation Model.",
                    "DNA Microarray Image Coding.",
                    "Highly Scalable Coding of Depth Maps with Arc Breakpoints.",
                    "Compressed Dynamic Binary Relations.",
                    "Compression of GPS Trajectories.",
                    "On Constrained Randomized Quantization.",
                    "Context Modeling and Correction of Quantization Errors in Prediction Loop.",
                    "Embedded Quantizer Design for Low Rate Lossy Image Coding.",
                    "Slashing the Time for BWT Inversion.",
                    "Gipfeli - High Speed Compression Algorithm.",
                    "A Parallel Adaptive Range Coding Compressor: Algorithm, FPGA Prototype, Evaluation.",
                    "Efficient Data Packet Compression for Cache Coherent Multiprocessor Systems.",
                    "Sparse Spatio-Temporal Representation with Adaptive Regularized Dictionaries for Super-Resolution Based Video Coding.",
                    "Scene-Aware Video Modeling and Compression.",
                    "Sequential Error Concealment for Video/Images by Weighted Template Matching.",
                    "Multi-scale Spatial Error Concealment via Hybrid Bayesian Regression.",
                    "Content Adaptive Subsampling for Stereo Interleaving Video Coding.",
                    "A Compact Stereoscopic Video Representation for 3D Video Generation and Coding.",
                    "Distributed Soft Video Broadcast (DCAST) with Explicit Motion.",
                    "EXIT Chart-Based Side Information Refinement for Wyner-Ziv Video Coding.",
                    "Progressive Side Information Refinement with Non-local Means Based Denoising Process for Wyner-Ziv Video Coding.",
                    "Low-Complexity Distributed Compression in Wireless Sensor Networks.",
                    "Rate-Adaptive BCH Coding for Slepian-Wolf Coding of Highly Correlated Sources.",
                    "Towards Optimality in Multiterminal Transform Coding.",
                    "A MILP Approach for Designing Robust Variable-Length Codes Based on Exact Free Distance Computation.",
                    "Prospicient Real-Time Coding of Markov Sources over Burst Erasure Channels: Lossless Case.",
                    "Optimum Distortion Exponent in Parallel Fading Channels by Using Analog Joint Source-Channel Coding Schemes.",
                    "Compressed Sensing Recovery via Collaborative Sparsity.",
                    "A Single Frame Super-Resolution Method Based on Matrix Completion.",
                    "Bayesian Network Structure Estimation Based on the Bayesian/MDL Criteria When Both Discrete and Continuous Variables Are Present.",
                    "Adaptive Context Tree Weighting.",
                    "Context Tree Switching.",
                    "Mixing Strategies in Data Compression.",
                    "A Cuckoo Hashing Variant with Improved Memory Utilization and Insertion Time.",
                    "Differentially Encoded Search Trees.",
                    "Indexing Sequences of IEEE 754 Double Precision Numbers.",
                    "A Machine Learning Perspective on Predictive Coding with PAQ8.",
                    "Multiple Description Video Coding Using Macro Block Level Correlation of Inter-/Intra-Descriptions.",
                    "Scalable Raid Storage Based on the Structure of Multimedia File.",
                    "MicroCT Image Coding Based on Air Filtering.",
                    "Memory-Assisted Universal Source Coding.",
                    "Fast Insertion and Deletion in Compressed Texts.",
                    "Packet Video Error Concealment Based on Compressed Sensing and Regularized Least Squares.",
                    "Rate-Distortion Analysis and Modeling of Dead-Zone Plus Uniform Threshold Scalar Quantization for Generalized Gaussian Random Variables.",
                    "Fast and Context-Free Lossless Image Compression Algorithm Based on JPEG-LS.",
                    "A New Preprocessing Stage for Compression of Ultraspectral Images.",
                    "Efficient Progressive Compression of 3D Points by Maximizing Tangent-Plane Continuity.",
                    "Coefficient Thresholding with Image Restoration.",
                    "Scalable Lossy Compression for Pixel-Value Encrypted Images.",
                    "A Modified Pseudo-distance Technique for Lossless Compression on Color-Mapped Images.",
                    "Improved View Synthesis with Depth Reliability Maps.",
                    "Compression of Search Range of VP-Tree for Multimedia Data Retrieval Applications.",
                    "Lagrangian Multiplier Optimization Using Markov Chain Based Rate and Piecewise Approximated Distortion Models.",
                    "Sparse Binary Matrices of LDPC Codes for Compressed Sensing.",
                    "P^2SNR: Perceptual Full-Reference Image Quality Assessment for JPEG2000.",
                    "Fast Construction of Nearly-Optimal Prefix Codes without Probability Sorting.",
                    "A New Wavelet Based Image Denoising Method.",
                    "On the Performance of Vector Quantization under Constraint of Complexity Functionals.",
                    "Adaptive Predictor Structures for Lossless Compression of Videos.",
                    "Energy and Cost Reduction in Localized Multisensory Systems through Application-Driven Compression.",
                    "Optimal Spatio-Temporal Projections with Holo-Kronecker Compressive Sensing of Video Acquisition.",
                    "Temporal Sampling Based Multiple Description Video Coding for Scenes Switching.",
                    "Phase Information Reserved Polarimetric SAR Raw Data Compression."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "21st DCC 2011",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2011",
                "sub_name": "2011 Data Compression Conference (DCC 2011), 29-31 March 2011, Snowbird, UT, USA.",
                "count": 89,
                "papers": [
                    "On Asymptotically Optimal Stationary Source Codes for IID Sources.",
                    "Advances in Optimal Structured Source Code Design.",
                    "Matching Dyadic Distributions to Channels.",
                    "Quasi-cyclic Minimum Storage Regenerating Codes for Distributed Data Compression.",
                    "Coding of Sets of Words.",
                    "The Dispersion of Lossy Source Coding.",
                    "Robust Learning of 2-D Separable Transforms for Next-Generation Video Coding.",
                    "Lifting Transforms on Graphs for Video Coding.",
                    "Lie Group Transformation Models for Predictive Video Coding.",
                    "Iterative Thresholding-Based Sparse Directional Representation for Efficient Low Bit-Rate Embedded Video Coding.",
                    "Hybrid Scalar/Vector Quantization of Mel-Frequency Cepstral Coefficients for Low Bit-Rate Coding of Speech.",
                    "Compressed Dictionary Matching with One Error.",
                    "Compressed Property Suffix Trees.",
                    "Compressed Index for Property Matching.",
                    "The String-to-Dictionary Matching Problem.",
                    "Image Compression by 2D Motif Basis.",
                    "Rate-Distortion Optimized Adaptive Scanning Order for Bitplane Image Coding Engines.",
                    "Transductive Regression with Local and Global Consistency for Image Super-Resolution.",
                    "Residual Reconstruction for Block-Based Compressed Sensing of Video.",
                    "Video Compressed Sensing with Multihypothesis.",
                    "A Compressive Sensing Reconstruction Algorithm for Trinary and Binary Sparse Signals Using Pre-mapping.",
                    "Formulating Binary Compressive Sensing Decoding with Asymmetrical Property.",
                    "Energy-Efficient Data Acquisition in Wireless Sensor Networks Using Compressed Sensing.",
                    "Progressive Quantization of Compressive Sensing Measurements.",
                    "Graph Entropy Characterization of Relay-Assisted Zero-Error Source Coding with Side Information.",
                    "The Two-Way Relay Network with Arbitrarily Correlated Sources and an Orthogonal MAC.",
                    "On the Rate Region of the Vector Gaussian One-Helper Distributed Source-Coding Problem.",
                    "On Natural Type Selection in Universal Multiple Description Coding.",
                    "Fast R-D Optimal Packetization of Embedded Bitstreams into Independent Source Packets.",
                    "Scalar Quantization for Relative Error.",
                    "Collaboration in Distributed Hypothesis Testing with Quantized Prior Probabilities.",
                    "Conflict in Distributed Hypothesis Testing with Quantized Prior Probabilities.",
                    "Distributed Quantization of Order Statistics with Applications to CSI Feedback.",
                    "An Algorithm for Quantization of Discrete Probability Distributions.",
                    "Sequence Similarity by Gapped LZW.",
                    "Tree Structure Compression with RePair.",
                    "Deplump for Streaming Data.",
                    "Compressed Context Modeling for Text Compression.",
                    "Improving Compressed Video Sign Language Conversations in the Presence of Data Loss.",
                    "Mixing Deduplication and Compression on Active Data Sets.",
                    "Search and Modification in Compressed Texts.",
                    "Influence of Noise Filtering in Coding Computed Tomography with JPEG2000.",
                    "Efficient JPEG2000 EBCOT Context Modeling for Massively Parallel Architectures.",
                    "High-Fidelity Image Compression for High-Throughput and Energy-Efficient Cameras.",
                    "Lossy Raid Storage Architecture for JPEG 2000 Images.",
                    "The Redundancy of Two-Part Codes for Finite-Length Parametric Sources.",
                    "Multi-resolution Analysis Using Symmetrized Odd and Even DCT Transforms.",
                    "Compressed Multi-view Imaging with Joint Reconstruction.",
                    "An Improved Temporal Frame Interpolation Algorithm for H.264 Video Compression.",
                    "Fast Vector Quantization Algorithm for Hyperspectral Image Compression.",
                    "An Improved Parametric Bit Rate Model for Frame-Level Rate Control in Video Coding.",
                    "A Novel Prediction Model for Lossless Video Compression.",
                    "Bitwise Structured Prediction Model for Lossless Image Coding.",
                    "On the Use of Stronger Synchronization to Boost Compression by Substring Enumeration.",
                    "Modified Efficient Fast Multiplication-Free Integer Transformation for the 2-D DCT H.265 Standard.",
                    "Sliding Window Update Using Suffix Arrays.",
                    "Lossless Data Compression Testbed: ExCom and Prague Corpus.",
                    "Color Image Compression Using a Learned Dictionary of Pairs of Orthonormal Bases.",
                    "Improving PPM Algorithm Using Dictionaries.",
                    "Pre-encoded JPEG2000 Video Transmission in a Video-on-Demand Scenario.",
                    "Quassi Lossless Motion Estimation Algorithm Using Fast Elimination of Checking Points.",
                    "Error Recovery Method for PPM Compressed Data.",
                    "Distributed Video Coding in Pixel Domain Using Spatial Correlation at the Decoder.",
                    "A Hybrid Admissible Distortion Checking Algorithm for the B-Spline-Based Operational Rate-Distortion Optimal Shape Coding.",
                    "Accurate Distortion Measurement Using Analytical Model for the B-Spline-Based Shape Coding.",
                    "Sparse Graph Codes for the Two-Way Relay Network with Correlated Sources.",
                    "Rendering Lossless Compression of Depth Image.",
                    "Joint Spatial-Temporal Layer Bit Allocation with S-Domain Dependent R-D Modeling.",
                    "Video Encoding without Integer-Pel Motion Estimation.",
                    "Image Coder Based on Hilbert Scanning of Embedded QuadTrees.",
                    "A Cloud Based Architecture for Improving Video Compression Time Efficiency: The Split & Merge Approach.",
                    "Block-Oriented Dense Compressor.",
                    "Variable-Length Source Compression Using Successive Refinement and Non-linear Graph-Based Codes.",
                    "Deadzone Based Rate Allocation for JPEG XR.",
                    "Set Reordering for Paletted Data.",
                    "An Efficient Distributed Video Coding with Parallelized Design for Concurrent Computing.",
                    "Controlled Recognition Bounds for Scaling and Occlusion Channels.",
                    "The Universal Measure for General Sources and Its Application to MDL/Bayesian Criteria.",
                    "Parallel Processing of DCT on GPU.",
                    "A Novel Computationally Efficient Motion Compensation Method Based on Pixel by Pixel Prediction.",
                    "Towards the Synergy between Compression and Content-Based Analysis: A Pattern-Driven Approach.",
                    "Adaptive Image Deblurring via Tanner Graph Representation and Belief Propagation.",
                    "Inferring BP Priority Order Using 5D Tensor Voting for Inpainting-Based Macroblock Prediction.",
                    "Adaptive Quantization in DCT Domain for Distributed Video Coding.",
                    "Explicit Network-Adaptive Robust Multiple Description Coding.",
                    "On Performance of Compressed Pattern Matching on VF Codes.",
                    "Efficient Video Coding Optimization Using a Novel Perceptual Distortion Model.",
                    "Bounding the Rate Region of the Two-Terminal Vector Gaussian CEO Problem.",
                    "Up-sampling Dependent Frame Rate Reduction for Low Bit-Rate Video Coding."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "20th DCC 2010",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2010",
                "sub_name": "2010 Data Compression Conference (DCC 2010), 24-26 March 2010, Snowbird, UT, USA.",
                "count": 95,
                "papers": [
                    "Stationary and Trellis Encoding for IID Sources and Simulation.",
                    "Bounding the Rate Region of Vector Gaussian Multiple Descriptions with Individual and Central Receivers.",
                    "Arbitrary Directional Edge Encoding Schemes for the Operational Rate-Distortion Optimal Shape Coding Framework.",
                    "Maximum Mutual Information Vector Quantization of Log-Likelihood Ratios for Memory Efficient HARQ Implementations.",
                    "An MCMC Approach to Lossy Compression of Continuous Sources.",
                    "Rate Distortion Bounds for Binary Erasure Source Using Sparse Graph Codes.",
                    "Local Average-Based Model of Probabilities for JPEG2000 Bitplane Coder.",
                    "On the Adaptive Coefficient Scanning of JPEG XR/HD Photo.",
                    "Spatial Constant Quantization in JPEG XR is Nearly Optimal.",
                    "Subsampling-Adaptive Directional Wavelet Transform for Image Coding.",
                    "Smart JPIP Proxy Server with Prefetching Strategies.",
                    "A Lossless Circuit Layout Image Compression Algorithm for Maskless Lithography Systems.",
                    "Estimation-Theoretic Delayed Decoding of Predictively Encoded Video Sequences.",
                    "Causal Transmission of Colored Source Frames over a Packet Erasure Channel.",
                    "Spatially Scalable Video Coding Based on Hybrid Epitomic Resizing.",
                    "Information Flows in Video Coding.",
                    "Optimized Analog Mappings for Distributed Source-Channel Coding.",
                    "A SAT-Based Scheme to Determine Optimal Fix-Free Codes.",
                    "Efficient Algorithms for Constructing Optimal Bi-directional Context Sets.",
                    "On Computation of Performance Bounds of Optimal Index Assignment.",
                    "A New Searchable Variable-to-Variable Compressor.",
                    "Neural Markovian Predictive Compression: An Algorithm for Online Lossless Data Compression.",
                    "An Efficient Algorithm for Almost Instantaneous VF Code Using Multiplexed Parse Tree.",
                    "Lossless Data Compression via Substring Enumeration.",
                    "LZ77-Like Compression with Fast Random Access.",
                    "Bidirectional Delta Files.",
                    "Bandwidth Expansion in a Simple Gaussian Sensor Network Using Feedback.",
                    "A Flexible Multiple Description Coding Scheme Based on Rateless Codes.",
                    "Fixed-Lag Smoothing for Low-Delay Predictive Coding with Noise Shaping for Lossy Networks.",
                    "Rate-Compatible Slepian-Wolf Coding with Short Non-Binary LDPC Codes.",
                    "A Systematic Distributed Quantizer Design Method with an Application to MIMO Broadcast Channels.",
                    "Scalar Quantizer Design for Noisy Channel with Decoder Side Information.",
                    "A Symbolic Dynamical System Approach to Lossy Source Coding with Feedforward.",
                    "When Huffman Meets Hamming: A Class of Optimal Variable-Length Error Correcting Codes.",
                    "Lossless Compression Based on the Sequence Memoizer.",
                    "A Similarity Measure Using Smallest Context-Free Grammars.",
                    "On the Systematic Measurement Matrix for Compressed Sensing in the Presence of Gross Errors.",
                    "Xampling: Analog Data Compression.",
                    "Tanner Graph Based Image Interpolation.",
                    "Lossless Reduced Cutset Coding of Markov Random Fields.",
                    "gFPC: A Self-Tuning Compression Algorithm.",
                    "Advantages of Shared Data Structures for Sequences of Balanced Parentheses.",
                    "Segment-Parallel Predictor for FPGA-Based Hardware Compressor and Decompressor of Floating-Point Data Streams to Enhance Memory I/O Bandwidth.",
                    "I/O-Efficient Compressed Text Indexes: From Theory to Practice.",
                    "Enhanced Adaptive Interpolation Filters for Video Coding.",
                    "Packet Dropping for Widely Varying Bit Reduction Rates Using a Network-Based Packet Loss Visibility Model.",
                    "Auto Regressive Model and Weighted Least Squares Based Packet Video Error Concealment.",
                    "A Hybrid Media Transmission Scheme for Wireless VoIP.",
                    "Low-Complexity PARCOR Coefficient Quantizer and Prediction Order Estimator for G.711.0 (Lossless Speech Coding).",
                    "Shape Recognition Using Vector Quantization.",
                    "Optimization of Overlapped Tiling for Efficient 3D Image Retrieval.",
                    "Depth Compression of 3D Object Represented by Layered Depth Image.",
                    "Modelling Parallel Texts for Boosting Compression.",
                    "Lossless Compression of Maps, Charts, and Graphs via Color Separation.",
                    "Local Modeling for WebGraph Compression.",
                    "Modeling the Quantization Staircase Function.",
                    "Dual Contribution of JPEG 2000 Images for Unidirectional Links.",
                    "Analysis of LDPC Codes for Compression of Nonuniform Sources with Side Information Using Density Evolution.",
                    "Multi-resolution Mean-Shift Algorithm for Vector Quantization.",
                    "A Pseudo-Random Number Generator Based on LZSS.",
                    "Inverted Index Compression for Scalable Image Matching.",
                    "A Novel Frame Error Concealment Algorithm Based on Dynamic Texture Synthesis.",
                    "Image Compression Using the DCT and Noiselets: A New Algorithm and Its Rate Distortion Performance.",
                    "The Non-existence of Length-5 Perfect Slepian-Wolf Codes of Three Sources.",
                    "Robust Detection and Lossless Compression of the Foreground in Magnetic Resonance Images.",
                    "Tree Structure Based Analyses on Compressive Sensing for Binary Sparse Sources.",
                    "Data Compression Based on a Dictionary Method Using Recursive Construction of T-Codes.",
                    "Lossless Compression of Mapped Domain Linear Prediction Residual for ITU-T Recommendation G.711.0.",
                    "A Fast Compact Prefix Encoding for Pattern Matching in Limited Resources Devices.",
                    "Compressed Indexes for Approximate Library Management.",
                    "Two-Step Coding for High Definition Video Compression.",
                    "Exploiting Wavelet-Domain Dependencies in Compressed Sensing.",
                    "Arbitrary ROI-Based Wavelet Video Coding.",
                    "Optimum String Match Choices in LZSS.",
                    "Error Resilient Dual Frame Motion Compensation with Uneven Quality Protection.",
                    "A New Approach to Time-Frequency Analysis.",
                    "An Integrated Algorithm for Fractional Pixel Interpolation and Motion Estimation of H.264.",
                    "A Matrix Completion Approach to Reduce Energy Consumption in Wireless Sensor Networks.",
                    "High-Order Text Compression on Hierarchical Edge-Guided.",
                    "TreeZip: A New Algorithm for Compressing Large Collections of Evolutionary Trees.",
                    "Lossy Audio Compression via Compressed Sensing.",
                    "Enhanced Lossless Coding Tools of LPC Residual for ITU-T G.711.0.",
                    "Block Compressed Sensing of Images Using Directional Transforms.",
                    "On the Overflow Probability of Fixed-to-Variable Length Codes with Side Information.",
                    "Data Compression Technology Dedicated to Distribution and Embedded Systems.",
                    "Analysis of Amplitude Quantization in ACELP Excitation Coding.",
                    "LDPC Codes for Information Embedding and Lossy Distributed Source Coding.",
                    "Horizontal Spatial Prediction for High Dimension Intra Coding.",
                    "Batch-Pipelining for H.264 Decoding on Multicore Systems.",
                    "Development of Optimum Lossless Compression Systems for Space Missions.",
                    "Region Based Rate-Distortion Analysis for 3D Video Coding.",
                    "Reconstruction of Sparse Binary Signals Using Compressive Sensing.",
                    "Fast Rate Distortion Optimized Quantization for H.264/AVC.",
                    "Theoretically Optimal Low-Density Parity-Check Code Ensemble for Gallager's Decoding Algorithm A.",
                    "File-Size Preserving LZ Encoding for Reversible Data Embedding."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "19th DCC 2009",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2009",
                "sub_name": "2009 Data Compression Conference (DCC 2009), 16-18 March 2009, Snowbird, UT, USA.",
                "count": 83,
                "papers": [
                    "On Minimum-Redundancy Fix-Free Codes.",
                    "Low-Memory Adaptive Prefix Coding.",
                    "High Performance Word-Codeword Mapping Algorithm on PPM.",
                    "Guaranteed Synchronization of Huffman Codes with Known Position of Decoder.",
                    "pFPC: A Parallel Compressor for Floating-Point Data.",
                    "Analysis of K-Channel Multiple Description Quantization.",
                    "Multi Level Multiple Descriptions.",
                    "Optimization of Correlated Source Coding for Event-Based Monitoring in Sensor Networks.",
                    "The Posterior Matching Feedback Scheme for Joint Source-Channel Coding with Bandwidth Expansion.",
                    "Joint Source-Channel Coding at the Application Layer.",
                    "Analog Joint Source Channel Coding Using Space-Filling Curves and MMSE Decoding.",
                    "Analysis on Rate-Distortion Performance of Compressive Sensing for Binary Sparse Source.",
                    "Model-Guided Adaptive Recovery of Compressive Sensing.",
                    "l1 Compression of Image Sequences Using the Structural Similarity Index Measure.",
                    "Tree Histogram Coding for Mobile Image Matching.",
                    "Compressed Kernel Perceptrons.",
                    "Overlapped Tiling for Fast Random Oblique Plane Access of 3D Object Datasets.",
                    "Probing the Randomness of Proteins by Their Subsequence Composition.",
                    "Source Coding Scheme for Multiple Sequence Alignments.",
                    "Linear Suffix Array Construction by Almost Pure Induced-Sorting.",
                    "Compressed Transitive Delta Encoding.",
                    "On Compression of Data Encrypted with Block Ciphers.",
                    "Compressive-Projection Principal Component Analysis and the First Eigenvector.",
                    "Clustered Reversible-KLT for Progressive Lossy-to-Lossless 3d Image Coding.",
                    "On Transform Coding with Dithered Quantizers.",
                    "Wavelet Image Two-Line Coder for Wireless Sensor Node with Extremely Little RAM.",
                    "An Adaptive Sub-sampling Method for In-memory Compression of Scientific Data.",
                    "Bits in Asymptotically Optimal Lossy Source Codes Are Asymptotically Bernoulli.",
                    "Communicating the Difference of Correlated Gaussian Sources over a MAC.",
                    "An Implementable Scheme for Universal Lossy Compression of Discrete Markov Sources.",
                    "Low Bit Rate Vector Quantization of Outlier Contaminated Data Based on Shells of Golay Codes.",
                    "Universal Refinable Trellis Coded Quantization.",
                    "Implementation of an Incremental MDL-Based Two Part Compression Algorithm for Model Inference.",
                    "Lossy to Lossless Spatially Scalable Depth Map Coding with Cellular Automata.",
                    "Algorithmic Cross-Complexity and Relative Complexity.",
                    "Compression-Induced Rendering Distortion Analysis for Texture/Depth Rate Allocation in 3D Video Compression.",
                    "Wireless Video Transmission: A Single Layer Distortion Optimal Approach.",
                    "H.264/MPEG-4 AVC Encoder Parameter Selection Algorithms for Complexity Distortion Tradeoff.",
                    "Low Complexity Spatio-Temporal Key Frame Encoding for Wyner-Ziv Video Coding.",
                    "Highly Accurate Distortion Estimation for JPEG2000 through PDF-Based Estimators.",
                    "A MS-SSIM Optimal JPEG 2000 Encoder.",
                    "Lossy Hyperspectral Images Coding with Exogenous Quasi Optimal Transforms.",
                    "Out-of-Core Progressive Lossless Compression and Selective Decompression of Large Triangle Meshes.",
                    "DCT Domain Message Embedding in Spread-Spectrum Steganography System.",
                    "A Zero Padding SVD Encoder to Compress Electrocardiogram.",
                    "Nonuniform Dithered Quantization.",
                    "LZB: Data Compression with Bounded References.",
                    "Optimized Source-Channel Coding of Video Signals in Packet Loss Environments.",
                    "Design of Punctured LDPC Codes for Rate-Compatible Asymmetric Slepian-Wolf Coding.",
                    "The Block LZSS Compression Algorithm.",
                    "Slepian-Wolf Coding of Binary Finite Memory Source Using Burrows-Wheeler Transform.",
                    "Practical Parallel Algorithms for Dictionary Data Compression.",
                    "Block Size Optimization in Deduplication Systems.",
                    "Modeling the Correlation Noise in Spatial Domain Distributed Video Coding.",
                    "On the Use of Suffix Arrays for Memory-Efficient Lempel-Ziv Data Compression.",
                    "Fast Data Reduction via KDE Approximation.",
                    "Decentralized Estimation Using Learning Vector Quantization.",
                    "A Comparative Study of Lossless Compression Algorithms on Multi-spectral Imager Data.",
                    "Adaptive Rate Allocation Algorithm for Transmission of Multiple Embedded Bit Streams over Time-Varying Noisy Channels.",
                    "Suffix Tree Based VF-Coding for Compressed Pattern Matching.",
                    "Fast Intra Prediction in the Transform Domain.",
                    "A Fast Partial Distortion Elimination Algorithm Using Dithering Matching Pattern.",
                    "Lossless Image Compression by PPM-Based Prediction Coding.",
                    "Perceptual Relevance Measure for Generic Shape Coding.",
                    "Joint Network-Source Video Coding Based on Lagrangian Rate Allocation.",
                    "Improving Inverse Wavelet Transform by Compressive Sensing Decoding with Deconvolution.",
                    "New Families and New Members of Integer Sequence Based Coding Methods.",
                    "Complex Wavelet Modulation Subbands for Speech Compression.",
                    "Dual-Direction Prediction Vector Quantization for Lossless Compression of LASIS Data.",
                    "On the Use of Word Alignments to Enhance Bitext Compression.",
                    "A Binary Image Scalable Coder Based on Reversible Cellular Automata Transform and Arithmetic Coding.",
                    "Entropy Coding via Parametric Source Model with Applications in Fast and Efficient Compression of Image and Video Data.",
                    "Performing Vector Quantization Using Reduced Data Representation.",
                    "Set Partitioning in Hierarchical Frequency Bands (SPHFB).",
                    "Policy Allocation for Transmissionof Embedded Bit Streams over Noisy Channels with Feedback.",
                    "Fast 15x15 Transform for Image and Video Coding Applications.",
                    "Affine Modeling for the Complexity of Vector Quantizers.",
                    "Binary Alpha-Plane Assisted Fast Motion Estimation of Video Objects in Wavelet Domain.",
                    "How Can Intra Correlation Be Exploited Better?",
                    "Invertible Integer Lie Group Transforms.",
                    "Iterative Decoding of Convolutionally Encoded Multiple Descriptions.",
                    "Flexible Predictions Selection for Multi-view Video Coding.",
                    "Low-Complexity Joint Source/Channel Turbo Decoding of Arithmetic Codes with Image Transmission Application."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "18th DCC 2008",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2008",
                "sub_name": "2008 Data Compression Conference (DCC 2008), 25-27 March 2008, Snowbird, UT, USA.",
                "count": 103,
                "papers": [
                    "Defect List Compression.",
                    "Table Compression by Record Intersections.",
                    "Compressed Index for Dictionary Matching.",
                    "An Approach to Graph and Netlist Compression.",
                    "Design and Implementation of a High-Performance Microprocessor Cache Compression Algorithm.",
                    "Rate-Distortion Functions for Nonstationary Gaussian Autoregressive Processes.",
                    "The Rate-Distortion Function of a Poisson Process with a Queueing Distortion Measure.",
                    "The Quadratic Gaussian Rate-Distortion Function for Source Uncorrelated Distortions.",
                    "Compressive-Projection Principal Component Analysis for the Compression of Hyperspectral Signatures.",
                    "Compression of Hyperspectral Images with LVQ-SPECK.",
                    "Hyperspectral Image Coding Using 3D Transform and the Recommendation CCSDS-122-B-1.",
                    "High-Resolution Functional Quantization.",
                    "Image Compression by Visual Pattern Vector Quantization (VPVQ).",
                    "Object-Based Regions of Interest for Image Compression.",
                    "Directional Lapped Transforms for Image Coding.",
                    "Coding Overcomplete Representations of Audio Using the MCLT.",
                    "Word-Based Statistical Compressors as Natural Language Compression Boosters.",
                    "On Non-sequential Context Modeling with Application to Executable Data Compression.",
                    "IPzip: A Stream-Aware IP Compression Algorithm.",
                    "Lossless Compression of Hexahedral Meshes.",
                    "Wireless Video Transmission: A Distortion-Optimal Approach.",
                    "Drift Characterization of Intra Prediction and Quantization in H.264.",
                    "An Estimation-Theoretic Interpretation of Video Rate Distortion Optimization with Lagrangian Formulation.",
                    "A Novel Partial Prediction Algorithm for Fast 4x4 Intra Prediction Mode Decision in H.264/AVC.",
                    "A Reliable Chunkless Peer-to-Peer Architecture for Multimedia Streaming.",
                    "Geometric Burrows-Wheeler Transform: Linking Range Searching and Text Indexing.",
                    "Shared Descriptions Fusion Coding for Storage and Selective Retrieval of Correlated Sources.",
                    "Practical Entropy-Bounded Schemes for O(1)-Range Minimum Queries.",
                    "Intra Prediction via Edge-Based Inpainting.",
                    "JPEG2000 Arbitrary ROI Coding through Rate-Distortion Optimization Techniques.",
                    "Can Lower Resolution Be Better?",
                    "Distributed Multi-stage Coding of Correlated Sources.",
                    "Distributed Compression of Correlated Signals Using Random Projections.",
                    "Dimension Reduction and Expansion: Distributed Source Coding in a Noisy Environment.",
                    "Sublinear Recovery of Sparse Wavelet Signals.",
                    "Rate Bounds on SSIM Index of Quantized Image DCT Coefficients.",
                    "Noise-Shaped Predictive Coding for Multiple Descriptions of a Colored Gaussian Source.",
                    "Server Placement in Multiple-Description-Based Media Streaming.",
                    "Speed-Up of Encoder Optimization Step in Multiple Description Scalar Quantizer Design.",
                    "Filter Banks for Prediction-Compensated Multiple Description Coding.",
                    "On the Symmetric Gaussian Multiple Description Rate-Distortion Function.",
                    "Asymmetric Multi-level Diversity Coding.",
                    "On Self-Indexing Images - Image Compression with Added Value.",
                    "VQ Based Image Retrieval Using Color and Position Features.",
                    "Lifting-Based View Compensated Compression of Volume Rendered Images for Efficient Remote Visualization.",
                    "Multiresolution Rotation-Invariant Texture Classification Using Feature Extraction in the Frequency Domain and Vector Quantization.",
                    "Guaranteed Synchronization of Huffman Codes.",
                    "Using Fibonacci Compression Codes as Alternatives to Dense Codes.",
                    "A Simple Algorithm for Computing the Lempel Ziv Factorization.",
                    "A Lower Bound on the Redundancy of Arithmetic-Type Delay Constrained Coding.",
                    "A Lossless Wavelet-Based Predictive Multispectral Image Compressor.",
                    "Suffix Sorting via Shannon-Fano-Elias Codes.",
                    "Interactive Distributed Source Coding in Asymmetric Communication Scenarios.",
                    "Priority Encoding Transmission Based Multiple Description Video Coding over Packet Loss Network.",
                    "Sequence of Hashes Compression in Data De-duplication.",
                    "Text Pre-processing for Lossless Compression.",
                    "Data Compression and Linear Modeling.",
                    "A New Object-Based System for Fractal Video Sequences Compression.",
                    "A Model Conditioned Data Compression Based Similarity Measure.",
                    "A Three Dimensional Combinative Lifting Algorithm for Wavelet Transform Using 9/7 Filter.",
                    "European and American Audio-Visual Speech Recognition, Using SVM in Portuguese Language.",
                    "List Update Algorithms for Data Compression.",
                    "All-Match LZ77 Bit Recycling.",
                    "Improved Multiple Description Framework Based on Successively Refinable Quantization and Uneven Erasure Protection.",
                    "A Novel Multiple Description Video Codec Based on Slepian-Wolf Coding.",
                    "DCA Using Suffix Arrays.",
                    "Distributed Source Coding Using Raptor Codes for Hidden Markov Sources.",
                    "Spectral Information Recovery for Compressed Image Restoration.",
                    "Adaptive Compression of Graph Structured Text.",
                    "Effective Compression of Monotone and Quasi-Monotone Sequences of Integers.",
                    "Trellis-Based Joint Huffman and Convolutional Soft-Decision Priority-First Decoding.",
                    "Simple Joint Source-Channel Coding Schemes for Colored Gaussian Sources.",
                    "Fast Partial Distortion Elimination Algorithm for Lossless and Lossy Motion Estimation Using Hadamard Transform and Probability Model.",
                    "A Theoretical Analysis of Data Reduction Using the Weber Quantizer.",
                    "Optimal Audio Transmission over Wireless Tandem Channels.",
                    "Huffman Coding with Non-sorted Frequencies.",
                    "Multistream Compression.",
                    "Multi-dimensional Compression Using JPEG2000.",
                    "A Peer-to-Peer Architecture Based on Scalable Video Coding.",
                    "Improved Wavelet-Based Embedded Image Coding Using a Dynamic Index Reordering Vector Quantizer.",
                    "Performance Analysis of Dual Frame Motion Compensation.",
                    "Composition of DCT and Wavelet Transform for Image Compression.",
                    "Maximally Robust Redundant System with Minimal Coherence.",
                    "Complexity Based Image Artifact Detection.",
                    "Maximum Likelihood Rate Estimation: With Applications in Image and Video Compression.",
                    "New Bidirectional Motion Estimation Using Mesh-Based Frame Interpolation for Videoconferencing Applications.",
                    "Re-pair Achieves High-Order Entropy.",
                    "Very Low Cost Algorithms for Predicting the File Size of JPEG Images Subject to Changes of Quality Factor and Scaling.",
                    "On Precision-Redundancy Relation in the Design of Source Coding Algorithms.",
                    "Effective Visual Masking Techniques in JPEG2000.",
                    "Subjective and Objective Assesment of Visual Image Quality Metrics and Still Image Codecs.",
                    "M-Channel Multiple Description Coding with Two-Rate Predictive Coding and Staggered Quantization.",
                    "Suffix Array for Large Alphabet.",
                    "Variable Length Coding for Fixed Rate, Low Latency, Low Complexity Compression Applications.",
                    "Improving HTML Compression.",
                    "Macroblock-Level Rate-Distortion Optimization with Perceptual Adjustment for Video Coding.",
                    "CoTe: A Software Tool for Compression Benchmarking.",
                    "On Performance Evaluation of Predictive Coding Using a Residue-Free Approach.",
                    "Color Constancy from Image Transformations in JPEG and JPEG2000.",
                    "A Parametric Proxy-Based Compression of Depth Movies.",
                    "Simultaneous Encryption/Compression of Images Using Alpha Rooting.",
                    "A Parametric Modeling Approach to Image Compression.",
                    "Fast and Space Efficient Linear Suffix Array Construction."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "17th DCC 2007",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2007",
                "sub_name": "2007 Data Compression Conference (DCC 2007), 27-29 March 2007, Snowbird, UT, USA.",
                "count": 73,
                "papers": [
                    "A Stochastic Model for Video and its Information Rates.",
                    "Half-Pel Accurate Motion-Compensated Orthogonal Video Transforms.",
                    "Spatial Sparsity Induced Temporal Prediction for Hybrid Video Compression.",
                    "Normalized maximum likelihood model of order-1 for the compression of DNA sequences.",
                    "A Simple Statistical Algorithm for Biological Sequence Compression.",
                    "Structure induction by lossless graph compression.",
                    "Multiple-Description Coding by Dithered Delta-Sigma Quantization.",
                    "Multiple Description Coding for Stationary and Ergodic Sources.",
                    "Lossless Transmission of Correlated Sources over a Multiple Access Channel with Side Information.",
                    "Distributed Functional Compression through Graph Coloring.",
                    "Differential Compression of Executable Code.",
                    "Compressed Delta Encoding for LZSS Encoded Files.",
                    "Simple Linear-Time Off-Line Text Compression by Longest-First Substitution.",
                    "Bounds on Redundancy in Constrained Delay Arithmetic Coding.",
                    "Distributed Grayscale Stereo Image Coding with Unsupervised Learning of Disparity.",
                    "Edge-Based Prediction for Lossless Compression of Hyperspectral Images.",
                    "Spectral Predictors.",
                    "On Compression of Encrypted Video.",
                    "A Parallel Decoder for Lossless Image Compression by Block Matching.",
                    "Image Coding on Quincunx Lattice with Adaptive Lifting and Interpolation.",
                    "Improved Resolution Scalability for Bi-Level Image Data in JPEG2000.",
                    "Memory-Efficient Image Codec Using Line-based Backward Coding of Wavelet Trees.",
                    "Nonuniform Compression in Databases with Haar Wavelet.",
                    "Four-Dimensional Wavelet Compression of 4-D Medical Images Using Scalable 4-D SBHP.",
                    "Bayesian Detection in Bounded Height Tree Networks.",
                    "On Multi-Stage Sequential Coding of Correlated Sources.",
                    "High-Rate Analysis of Systematic Lossy Error Protection of a Predictively Encoded Source.",
                    "Type-Based Compression of XML Data.",
                    "Algorithms and Hardware Structures for Unobtrusive Real-Time Compression of Instruction and Data Address Traces.",
                    "High Throughput Compression of Double-Precision Floating-Point Data.",
                    "Distortion-Complexity Optimization of the H.264/MPEG-4 AVC Encoder using the GBFOS Algorithm.",
                    "Bit Allocation Based on Motion Vector Analysis for H.264/AVC.",
                    "Lossless and Near-Lossless Audio Compression Using Integer-Reversible Modulated Lapped Transforms.",
                    "Exploiting Prior Knowledge in The Recovery of Signals from Noisy Random Projections.",
                    "Bounds to the Rate Distortion Tradeoff of the Binary Markov Source.",
                    "Transmission Over Slowly Fading Channels Using Unreliable Quantized Feedback.",
                    "Joint Optimization of Distributed Broadcast Quantization Systems for Classification.",
                    "Lossless Compression of Colour Video Sequence using Optimal Prediction Theory - Octopus.",
                    "A Distortion Optimal Rate Allocation Algorithm for Transmission of Embedded Bitstreams over Noisy Channels.",
                    "A Modified BISK Algorithm for 3D Dual-Tree Wavelet Transform Coding.",
                    "Quantization of Sparse Representations.",
                    "Bit Recycling with Prefix Codes.",
                    "Optimal Rate and Power Allocation for Layered Transmission with Superposition Coding.",
                    "VLR-Based Optimal Positioning of Resynchronization Markers.",
                    "The Model based Similarity Metric.",
                    "Optimal Source-Channel Decoder for Correlated Markov Sources over Additive Markov Channels.",
                    "Applying Tunstall Coding in the existing SEED format for Seismographic Data.",
                    "Power Preserving 2: 1 Bandwidth Reduction Mappings.",
                    "Compression for Low Power Consumption in Battery-powered Handsets.",
                    "A New Approach to Decoding of BCH and Reed-Solomon Codes Using Syzygy.",
                    "Fast Decoding of Fibonacci Encoded Texts.",
                    "Comparison of Text Models for BWT.",
                    "Compression of a Set of Strings.",
                    "Data Hiding based Compression Mechanism for 3D Models.",
                    "Texture Classification Using VQ with Feature Extraction based on Transforms Motivated by the Human Visual System.",
                    "New fast search algorithm for base layer of H.264 scalable video coding extension.",
                    "Guided Quaternary Reaching Method for Wavelet-based Image Compression.",
                    "Interference Multispectral Image Compression with Adaptive Distortion Control in Fourier Domain.",
                    "An Efficient Implementation of Adaptive Prefix Coding.",
                    "An Efficient Algorithm For The Inverse ST Problem.",
                    "Memory-Efficient Decoding of Variable Length Codes for Monotonic Sources.",
                    "Practical Binary Adaptive Block Coder.",
                    "Hyperspectral Image Compression with Optimization for Spectral Analysis.",
                    "Gaussian Golomb Codes.",
                    "Generalized Statistics Framework for Rate Distortion Theory.",
                    "Compression as Data Transformation.",
                    "Advanced Optimizations for VQ Compression on Parallel Systems.",
                    "The Wyner-Ziv Rate-Distortion Function of Multivariate Gaussian Sources and Its Application in Distributed Video Coding.",
                    "An Enhanced Robust Entropy Coder for Video Codecs Based on Context-Adaptive Reversible VLC.",
                    "Samplify: Real-time Compression for Electronic Measurements.",
                    "A Content-based Robust Mode Decision Scheme for Internet Videophone Applications.",
                    "A Fast Lossless Codec of Continuous-Tone Images for Thin Client Computing.",
                    "Dictionary-based English text compression using word endings."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "16th DCC 2006",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2006",
                "sub_name": "2006 Data Compression Conference (DCC 2006), 28-30 March 2006, Snowbird, UT, USA.",
                "count": 81,
                "papers": [
                    "Non-Asymptotic Design of Finite State Universal Predictors for Individual Sequences.",
                    "Toward a Source Coding Theory for Sets.",
                    "Adaptive Run-Length / Golomb-Rice Encoding of Quantized Generalized Gaussian Sources with Unknown Statistics.",
                    "Encoding the \\ell_p Ball from Limited Measurements.",
                    "New Lower and Upper Bounds on the Expected Length of Optimal One-to-One Codes.",
                    "Time-Sharing Vs. Source-Splitting in the Slepian-Wolf Problem: Error Exponents Analysis.",
                    "On Efficient Quantizer Design for Robust Distributed Source Coding.",
                    "Analysis of Multiple Antenna Systems with Finite-Rate Feedback Using High Resolution Quantization Theory.",
                    "Distributed Sampling and Compression of Scenes with Finite Rate of Innovation in Camera Sensor Networks.",
                    "A Practical Approach to Joint Network-Source Coding.",
                    "Joint Source-Channel Decoding of Multiple Description Quantized Markov Sequences.",
                    "Optimal Prefix Codes for Some Families of Two-Dimensional Geometric Distributions.",
                    "Low-Complexity Compression of Short Messages.",
                    "Fast Lossless Compression of Scientific Floating-Point Data.",
                    "State Machine Interpretation of Arithmetic Codes for Joint Source and Channel Coding.",
                    "Low Density Codes Achieve theRate-Distortion Bound.",
                    "High-Rate Analysis of Source Coding for Symmetric Error Channels.",
                    "On the Complexity of Optimal Grammar-Based Compression.",
                    "Compressed by the Suffix Tree.",
                    "Error-Resilient LZW Data Compression.",
                    "Data Compression with Restricted Parsings.",
                    "Compressed Data Structures: Dictionaries and Data-Aware Measures.",
                    "Quantization with Joint Entropy/Memory Constraints.",
                    "Vector Quantization with Model Selection.",
                    "Quantization on the Complex Projective Space.",
                    "Trellis Based Variable Rate Residual Image Coding over Noisy Channels.",
                    "Quantization of Transmission Parameters in Stereo Linear Predictive Systems.",
                    "Optimal Index Assignment for Multiple Description Lattice Vector Quantization.",
                    "Efficient Rate Control for JPEG2000 Coder and Decoder.",
                    "A Fast and Low Complexity Image Codec based on Backward Coding of Wavelet Trees.",
                    "Making the Correct Mistakes.",
                    "Distortion Control for Queues with Deadlines.",
                    "Gauss Mixture Model-Based Classification For Sensor Networks.",
                    "Compression and Machine Learning: A New Perspective on Feature Space Vectors.",
                    "Reduced Complexity Content-Based Image Retrieval Using Vector Quantization.",
                    "Analysis of Redundant-Wavelet Multihypothesis for Motion Compensation.",
                    "Practical Low Delay Broadcast of Compressed Variable Bit Rate Movies.",
                    "Dual Frame Video Coding with Pulsed Quality and a Lookahead Window.",
                    "Perceptually -Weighted Audio Coding that Scales to Extremely Low Bitrates.",
                    "Tradeoffs in XML Database Compression.",
                    "XML Syntax Conscious Compression.",
                    "Lossless Compression of Color Map Images by Context Tree Modeling.",
                    "On Compressibility of Protein Sequences.",
                    "On the Use of Words as Source Alphabet Symbols in PPM.",
                    "Optimal Coding Rate Selection for 3D Video using RCPC Codes.",
                    "Textual Compression by Collapsible Tries.",
                    "Nonlinear Transform Coding: Polar Coordinates Revisited.",
                    "Side Information Aware Coding Strategy in the Quadratic Gaussian CEO Problem.",
                    "Distributed Coding via Folding Functions.",
                    "Still Image Compression Through Exhaustive Two-Valued Shape-Adaptive Searches.",
                    "Compression of Multilingual Aligned Texts.",
                    "Lossless Image Compression by Block Matching on a Mesh of Trees.",
                    "Faster Algorithm for Designing Optimal Prefix-Free Codes with Unequal Letter Costs.",
                    "High-Rate Training of Gaussian Mixture Vector Quantizers.",
                    "Noise Immunity for 1: N and M: 1 Nonlinear Mappings for Source-Channel Coding.",
                    "Dynamic Asymmetric Communication.",
                    "A Unified Framework for Lossless Image Set Compression.",
                    "Combined Prediction and Residual Coding for Lossless Audio Compression.",
                    "Near-Lossless 3D-image Compression Using Hypergraphs.",
                    "On Mult-iResolution Coding and a Two-Hop Network.",
                    "Image Transmission Over Flat Fading Channels Using Joint Source Channel Coding.",
                    "Evaluating the Role of Context in Syntax Directed Compression of XML Documents.",
                    "Efficient Video Broadcast Over Wireless Channels Using Adaptive Playback.",
                    "Digitising the 2: 1 Shannon Mappings for Transport over Heterogeneous Networks.",
                    "The B-coder: An Improved Binary Arithmetic Coder and Probability Estimator.",
                    "Modeling Delta Encoding of Compressed Files.",
                    "Compression of Small Text Files using Syllables.",
                    "Web Graph Compression by Edge Elimination.",
                    "Compression of LC/MS Proteomic Data.",
                    "Crypto-Compression Prefix Coding.",
                    "Burrows-Wheeler Text Compression with Fountain Codes.",
                    "MST for Lossy Compression of Image Sets.",
                    "Unifying The Burrows-Wheeler and The Schindler Transforms.",
                    "Multi-modal, Multi-Fractal Boundary Encoding in Object-Based Image Compression.",
                    "Distortion of Matching Pursuit: Modeling and Optimization.",
                    "On-Board Compression Algorithm for Satellite Multispectral Images.",
                    "Quantized Indexing: Beyond Arithmetic Coding.",
                    "A Fast Algorithm for Lossless Compression of Data Tables by Reordering.",
                    "VQ Compression Algorithms on a Shared-Memory Multiprocessor.",
                    "Multiple Description Coding using Rotated Permutation Codes.",
                    "Error Resilient Transmission of H.264 Video over Wireless Network."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "15th DCC 2005",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2005",
                "sub_name": "2005 Data Compression Conference (DCC 2005), 29-31 March 2005, Snowbird, UT, USA.",
                "count": 92,
                "papers": [
                    "Near Tightness of the El Gamal and Cover Region for Two Descriptions.",
                    "Distributed Source Coding in Dense Sensor Networks.",
                    "A Generalization of the Rate-Distortion Function for Wyner-Ziv Coding of Noisy Sources in the Quadratic-Gaussian Case.",
                    "Towards Practical Minimum-Entropy Universal Decoding.",
                    "On Multiterminal Source Code Design.",
                    "On the Performance of Linear Slepian-Wolf Codes for Correlated Stationary Memoryless Sources.",
                    "Real, Tight Frames with Maximal Robustness to Erasures.",
                    "Adaptive Block-Based Image Coding with Pre-/Post-Filtering.",
                    "Optimized Prediction for Geometry Compression of Triangle Meshes.",
                    "TetStreamer: Compressed Back-to-Front Transmission of Delaunay Tetrahedra Meshes.",
                    "A Point-Set Compression Heuristic for Fiber-Based Certificates of Authenticity.",
                    "Performance Comparison of Path Matching Algorithms over Compressed Control Flow Traces.",
                    "Implementation Cost of the Huffman-Shannon-Fano Code.",
                    "Binary Codes for Non-Uniform Sources.",
                    "Fast Decoding of Prefix Encoded Texts.",
                    "Efficient String Matching Algorithms for Combinatorial Universal Denoising.",
                    "Generalizing the Kraft-McMillan Inequality to Restricted Languages.",
                    "Asymptotics of the Entropy Rate for a Hidden Markov Process.",
                    "Efficient Alphabet Partitioning Algorithms for Low-Complexity Entropy Coding.",
                    "Design of VQ-Based Hybrid Digital-Analog Joint Source-Channel Codes for Image Communication.",
                    "Hard Decision and Iterative Joint Source Channel Coding Using Arithmetic Codes.",
                    "Joint Source and Channel Coding using Trellis Coded CPM: Soft Decoding.",
                    "Using 2: 1 Shannon Mapping for Joint Source-Channel Coding.",
                    "On the Entropy Rate of Pattern Processes.",
                    "Optimal Quantizer Performance and the Wasserstein Distortion.",
                    "Short-Block Variable-Rate Trellis Quantization.",
                    "A Lagrangian formulation of fixed-rate quantization.",
                    "Optimal One-Bit Quantization.",
                    "Minimum Distortion Color Image Retrieval Based on Lloyd-Clustered Gauss Mixtures.",
                    "When is Bit Allocation for Predictive Video Coding Easy?",
                    "MINMAX Bit Allocation for Quantization-Based Video Coders.",
                    "Very Low Frame-Rate Video Streaming For Face-to-Face Teleconference.",
                    "Error Concealment for Dual Frame Video Coding with Uneven Quality.",
                    "JPEG2000 and Motion JPEG2000 Content Analysis Using Codestream Length Information.",
                    "Of Lempel-Ziv-Welch Parses with Refillable Gaps.",
                    "Lossless Data Compression Using Optimal Tree Machines.",
                    "The Performance of Linear Time Suffix Sorting Algorithms.",
                    "Quantization of Multiple Sources Using Integer Bit Allocation.",
                    "n-Channel Symmetric Multiple-Description Lattice Vector Quantization.",
                    "On Global Optimality of Gradient Descent Algorithms for Fixed-Rate Scalar Multiple Description Quantizer Design.",
                    "Staggered Lattices in Multiple Description Quantization.",
                    "Fast Precomputed VQ with Optimal Bit Allocation for Lossless Compression of Ultraspectral Sounder Data.",
                    "Lossless Hyperspectral Image Compression Using Context-Based Conditional Averages.",
                    "A Block-Based Inter-Band Lossless Hyperspectral Image Compressor.",
                    "Efficient Inter-Band Prediction and Wavelet Based Compression for Hyperspectral Imagery: A Distributed Source Coding Approach.",
                    "A Fast and Efficient Post BWT-Stage for the Burrows-Wheeler Compression Algorithm.",
                    "Off-Line Compression by Extensible Motifs.",
                    "An Improved Method for Lossless Data Compression.",
                    "The Use of Average Mutual Information Profile as a Species Signature.",
                    "Distributed Joint Source-Channel Decoding for Correlated Markov Sources.",
                    "The Markov Expert for Finding Episodes in Time Series.",
                    "Coding the Wavelet Spatial Orientation Tree with Low Computational Complexity.",
                    "Bounded Size Dictionary Compression: Relaxing the LRU Deletion Heuristic.",
                    "On the Block Size of Trellis Quantizers.",
                    "Real-Time Traversal in Grammar-Based Compressed Files.",
                    "QLFC - A Compression Algorithm Using the Burrows-Wheeler Transform.",
                    "Compression Algorithm for Infrared Hyperspectral Sounder Data.",
                    "Source Coding for a Multihop Network.",
                    "Segmenting for Wavelet Compression.",
                    "Bandwidth Adaptive Quality Smoothing for Unequal Error Protected Scalable Video Streaming.",
                    "Algorithms for Construction of Optimal and Almost-Optimal Length-Restricted Codes.",
                    "Parameter Analysis for the Generalized LZ Compression of Audio.",
                    "Compressed Pattern Matching in JPEG Images.",
                    "AXECHOP: A Grammar-based Compressor for XML.",
                    "Applying LVQ Techniques to Compress Historical Information in Sensor Networks.",
                    "An Extension of the Burrows Wheeler Transform to k Words.",
                    "An Instruction Set Architecture Based Code Compression Scheme for Embedded Processors.",
                    "Partially Decodable Compression with Static PPM.",
                    "Vector Quantization for Classification in a Simple Network.",
                    "A Fast Trellis-Based Rate-Allocation Algorithm for Robust Transmission of Progressively Coded Images over Noisy Channels.",
                    "Fast Index Assignment for Balanced N-Description Scalar Quantization.",
                    "Asymptotic Properties of Sample-Based Entropy, Information Divergence, and Related Metrics.",
                    "On the Inadequacy of Golomb-Rice Codes for Adaptive Coding.",
                    "Distributed Source Coding in Wireless Sensor Networks using LDPC Codes: A Non-Uniform Framework.",
                    "Recent Advances in Object-Based Image Compression.",
                    "Investigating Lossy Image Coding Using the PLHaar Transform.",
                    "Video Coding for a Time Varying Tandem Channel with Feedback.",
                    "Two-Level Directory based Compression.",
                    "Multiple-Pattern Matching In LZW Compressed Files Using Aho-Corasick Algorithm.",
                    "Progressive Low Bit Rate Coding of Simple 3D Objects with Matching Pursuit.",
                    "JPEG2000 Compliant Lossless Coding of Floating Point Data.",
                    "Accuracy-Optimized Quantization for High-Dimensional Data Fusion.",
                    "Parallelization of VQ Codebook Generation by Two Algorithms: Parallel LBG and Aggressive PNN.",
                    "BWT Based Universal Lossless Source Controlled Channel Decoding with Low Density Parity Check Codes.",
                    "Modelling Chinese For Text Compression.",
                    "Joint Source/Channel Coding for Multiple Video Sequences with JPEG2000.",
                    "Decoding of Non-Systematic Turbo Codes for Stationary Memoryless and Piecewise Stationary Memoryless Sequences.",
                    "Distributed Joint Source-Channel Coding of Video Using Raptor Codes.",
                    "A Compression-Boosting Transform for 2D Data.",
                    "A Flexible Compressed Text Retrieval System Using a Modified LZW Algorithm.",
                    "Prediction by Partial Approximate Matching for Lossless Image Compression.",
                    "A New Approach of DCA by using BWT."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "14th DCC 2004",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2004",
                "sub_name": "2004 Data Compression Conference (DCC 2004), 23-25 March 2004, Snowbird, UT, USA.",
                "count": 107,
                "papers": [
                    "Results and Conjectures on High Rate Quantization.",
                    "Classification of Features and Images using Gauss Mixtures with VQ Clustering.",
                    "Multi-resolution Source Coding Using Entropy Constrained Dithered Scalar Quantization.",
                    "Sequential Design of Multiple Description Scalar Quantizers.",
                    "Fast Algorithms for Optimal Two-description Scalar Quantizer Design.",
                    "Minimax Multiresolution Scalar Quantization.",
                    "Fast Compression with a Static Model in High-Order Entropy.",
                    "Motifs in Ziv-Lempel-Welch Clef.",
                    "In-Place Differential File Compression of Non-Aligned Files With Applications to File Distribution, Backups, and String Similarity.",
                    "Using Column Dependency to Compress Tables.",
                    "Compressed Index for Dynamic Text.",
                    "Lempel-Ziv Compression of Structured Text.",
                    "On Optimal Multiresolution Source-Channel Coding across Degraded Broadcast Channels.",
                    "Distortion-Optimal Transmission of Progressive Images over Channels with Random Bit Errors and Packet Erasures.",
                    "Packet Erasure Protection for Multicasting.",
                    "Integrated Rate Control and Entropy Coding for JPEG 2000.",
                    "Predicting Wavelet Coefficients Over Edges Using Estimates Based on Nonlinear Approximants.",
                    "Source Coding With Distortion Side Information At The Encoder.",
                    "Rate-Distortion Optimized Slicing, Packetization and Coding for Error Resilient Video Transmission.",
                    "On the Complexity of Rate-Distortion Optimal Streaming of Packetized Media.",
                    "Computing Rate-Distortion Optimized Policies for Streaming Media with Rich Acknowledgments.",
                    "Group Testing for Video Compression.",
                    "Global MINMAX Interframe Bit Allocation for Embedded Video Coding.",
                    "Efficient Bit Allocation for Dependent Video Coding.",
                    "Adaptive Rate Control Scheme for Video Streaming Over Wireless Channels.",
                    "Flicker Reduction in Intraframe Codecs.",
                    "Dual Frame Motion Compensation with Uneven Quality Assignment.",
                    "Joint Source-Channel Decoding of Quasi-Arithmetic Codes.",
                    "On Some New Approaches to Practical Slepian-Wolf Compression Inspired by Channel Coding.",
                    "Distributed Code Constructions for the Entire Slepian-Wolf Rate Region for Arbitrarily Correlated Sources.",
                    "Design of Slepian-Wolf Codes by Channel Code Partitioning.",
                    "Slepian-Wolf Coding for Nonuniform Sources Using Turbo Codes.",
                    "Slepian-Wolf Coded Nested Quantization (SWC-NQ) for Wyner-Ziv Coding: Performance Analysis and Code Design.",
                    "Optimal Finite State Universal Coding of Individual Sequences.",
                    "A \"Follow the Perturbed Leader\"-type Algorithm for Zero-Delay Quantization of Individual Sequence.",
                    "Discrete Universal Filtering Through Incremental Parsing.",
                    "On the Entropy of a Hidden Markov Process.",
                    "Linear Time Universal Coding of Tree Sources via FSM Closure.",
                    "Universal Coding of Function Spaces as a Model for Signal Compression.",
                    "Length-Limited Variable-to-Variable Length Codes For High-Performance Entropy Coding.",
                    "Context Based Coding of Binary Shapes by Object Boundary Straightness Analysis.",
                    "Variable-length contexts for PPM.",
                    "Sequential Universal Lossless Techniques for Compression of Patterns and Their Description Length.",
                    "An Efficient Algorithm for Lossless Compression of IEEE Float Audio.",
                    "MPEG-4 ALS: an Emerging Standard for Lossless Audio Coding.",
                    "JBEAM: Coding Lines and Curves via Digital Beamlets.",
                    "Iris Compression for Cryptographically Secure Person Identification.",
                    "Reduced Complexity Wavelet-Based Predictive Coding of Hyperspectral Images for FPGA Implementation.",
                    "High Performance Compression of Hyperspectral Imagery with Reduced Search Complexity in the Compressed Domain.",
                    "Coding for Fast Access to Image Regions Defined by Pixel Range.",
                    "A Foreground/Background Separation Algorithm for Image Compression.",
                    "Octree-based Animated Geometry Compression.",
                    "Record Preprocessing for Data Compression.",
                    "Merging Prediction by Partial Matching with Structural Contexts Model.",
                    "An Approximation to the Greedy Algorithm for Differential Compression of Very Large Files.",
                    "Predictive Image Compression Using Conditional Average.",
                    "Successive Approximation Source Coding and Image Enabled Data Mining.",
                    "Fast Searching over Compressed Text using A New Coding Technique: Tagged Sub-optimal Code (TSC).",
                    "Wavelet Compression of ECG Signals by JPEG2000.",
                    "The WebGraph Framework II: Codes For The World-Wide Web.",
                    "Efficient Rate Control for Motion JPEG2000.",
                    "Classification Oriented Embedded Image Coding.",
                    "Successive Refinement for the Wyner-Ziv Problem and Layered Code Design.",
                    "A-TDB: A Self Adaptive Block-Matching Algorithm for Varying Motion Content.",
                    "A Simple Lossless Compression Heuristic for RGB Images.",
                    "Efficient Run-Length Encoding of Binary Sources with Unknown Statistics.",
                    "Adapting the Knuth-Morris-Pratt Algorithm for Pattern Matching in Huffman Encoded Texts.",
                    "Implementing the Context Tree Weighting Method for Content Recognition.",
                    "New Methods for Trellis Source Coding at Rates Above and Below One.",
                    "Lossless and Lossy Compression of DNA Microarray Images.",
                    "Vector Permutation Encoding for the Uniform Sources.",
                    "Dynamic Shannon Coding.",
                    "Unequal Error Protection of SNR-Scalable DPCM-Coded Video.",
                    "On the Average Sequence Complexity.",
                    "Efficient Side-Information Context Description for Context-Based Adaptive Entropy Coders.",
                    "Semi-Lossless Text Compression.",
                    "Point Compression for Certificates of Authenticity.",
                    "MSE Optimal Bit Rate Allocation in the Application of JPEG2000 Part 2 to Meteorological Data.",
                    "Relation between Fractal Dimension and Performance of Vector Quantization.",
                    "Using Partial-Matching Approach with Sequitur for Context-Based Coding.",
                    "Slepian-Wolf Coding of Multiple M-ary Sources Using LDPC Codes.",
                    "Compressing a Directed Massive Graph using Small World Model.",
                    "Heuristic Search Based Soft-Input Soft-Output Decoding of Arithmetic Codes.",
                    "Shape Adaptive Integer Wavelet Transform Based Coding Scheme for 2-D/3-D MR Images.",
                    "Decaying Tree Lossless Coding for Image and Video.",
                    "Reduced Complexity VLC Sequence Decoder.",
                    "Online Suffix Trees with Counts.",
                    "Image Classification Using Adaptive-Boosting and Tree-Structured Discriminant Vector Quantization.",
                    "High Density Compression of Log Files.",
                    "Model Based Optimal Bit Allocation.",
                    "Code Compression Based on Operand-Factorization for VLIW Processor.",
                    "Adaptive Coding and Prediction of Sources with Large and Infinite Alphabet.",
                    "Fast Codes for Large Alphabet Sources and Its Application to Block Encoding.",
                    "Comparative Analysis of Arithmetic Coding Computational Complexity.",
                    "On Wavelet Compression of Self-Similar Processes.",
                    "Reversible n-Bit to n-Bit Integer Haar-Like Transforms.",
                    "Optimal Buffer-Constrained Bit Allocation using Marginal Analysis.",
                    "The Predictive-Substitutional Compression Scheme and its Effective Implementation.",
                    "Multiband Video Coding Using H.264/AVC, MPEG-4 Studio Profile and JPEG 2000.",
                    "LZW Based Compressed Pattern Matching.",
                    "An Improved Block Prediction Mode for H.264/AVC Intra-rame Prediction.",
                    "An Extended Delta Compression Algorithm and the Recovery of Failed Updating in Embedded Systems.",
                    "A Factor-Graph Approach to the Context-Tree Weighting Method.",
                    "Asymmetric Code Design for Remote Multiterminal Source Coding.",
                    "Hybrid Fractal Video Coding with Neighbourhood Vector Quantisation.",
                    "CSV Compaction to Improve Data-Processing Performance for Large XML Documents.",
                    "Fast Near-Lossless or Lossless Compression of Large 3D Neuro-Anatomical Images."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "13th DCC 2003",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2003",
                "sub_name": "2003 Data Compression Conference (DCC 2003), 25-27 March 2003, Snowbird, UT, USA.",
                "count": 87,
                "papers": [
                    "Low Complexity Code Design for Lossless and Near-Lossless Side Information Source Codes.",
                    "Design of Optimal Quantizers for Distributed Source Coding.",
                    "Extending Source Codes for Error Resilience.",
                    "Turbo and Trellis-Based Constructions for Source Coding with Side Information.",
                    "MAP Criterion Trellis Source Coding for Short Data Sequences.",
                    "Linear Programming Optimization for Video Coding under Multiple Constraints.",
                    "Video Compression with Intra/Inter Mode Switching and a Dual Frame Buffer.",
                    "Unequal Loss Protection for H.263 Compressed Video.",
                    "Improved Error Resilient Embedded Video Coding.",
                    "Wyner-Ziv Coding for Video: Applications to Compression and Error Resilience.",
                    "Robust Predictive Coding and the Wyner-Ziv Problem.",
                    "An Efficient Joint Source-Channel Rate Allocation Scheme For JPEG 2000 Codestreams.",
                    "Decompression Of Corrupt JPEG 2000 Codestreams.",
                    "Fast And Effcient Spatial Scalable Image Compression Using Wavelet Lower Trees.",
                    "Compression and the Wheel of Fortune.",
                    "On Compressing Interchange Classes of Events in a Concurrent System.",
                    "PPM Model Cleaning.",
                    "High Rate Mismatch in Entropy Constrained Quantization.",
                    "Universal Multiple Description Scalar Quantization: Analysis and Design.",
                    "Distributed Compression of Binary Sources Using Conventional Parallel and Serial Concatenated Convolutional Codes.",
                    "Rate-distortion Optimized Packet Scheduling and Routing for Media Streaming with Path Diversity.",
                    "Wyner-Ziv Encoded Predictive Multiple Descriptions.",
                    "Codelet Parsing: Quadratic-time, Sequential, Adaptive Algorithms for Lossy Compression.",
                    "Can the sample being transmitted be used to refine its own PDF estimate?",
                    "Realization Adaptive Strategies and a Comparison of Fourier Bandwidth, Shannon Bandwidth, and Campbell Bandwidth.",
                    "DNA sequence compression using the normalized maximum likelihood model for discrete regression .",
                    "In-Place Differential File Compression.",
                    "Joint Source-Channel LZ'77 Coding.",
                    "The Distributed, Partial, And Conditional Karhunen-Loève Transforms.",
                    "Suboptimality of the Karhuenen-Loève Transform for Transform Coding.",
                    "On the Suboptimality of Orthogonal Transforms for Single- or Multi-Stage Lossless Transform Coding.",
                    "Optimal Transform Coding of Gaussian Mixtures for Joint Classification/Reconstruction.",
                    "Optimal layer ordering in the compression of map images.",
                    "Compression of Hyperspectral Imagery.",
                    "Compression-Domain Editing of 3D Models.",
                    "Searchable Compressed Representations of Very Sparse Bitmaps (extended abstract).",
                    "Estimation-Quantization Geometry Coding Using Normal Meshes.",
                    "Optimal Alphabet Partitioning for Semi-Adaptive Coding of Sources of Unknown Sparse Distributions.",
                    "Code Compression Using Variable-to-fixed Coding Based on Arithmetic Coding.",
                    "Hybrid Prefix Codes for Practical Use.",
                    "Performance of universal codes over infinite alphabets.",
                    "On the Optimality of Embedded Deadzone Scalar-Quantizers for Wavelet-based L-infinite-constrained Image Coding.",
                    "Stack-Run Adaptive Wavelet Image Coding.",
                    "The Transport of Reversible and Unreversible Embedded Wavelets (TRUEW.",
                    "Estimating and Comparing Entropies Across Written Natural Languages Using PPM Compression.",
                    "An Error-Resilient Blocksorting Compression Algorithm.",
                    "A New Visual Masking Tool for JPEG2000.",
                    "Compression of RADARSAT Data with Block Adaptive Wavelets.",
                    "Binary Combinatorial Coding.",
                    "A Novel Ram Architecture For Bit-Plane Based Coding.",
                    "Almost Work-Optimal PRAM EREW Decoders of LZ Compressed Text.",
                    "Rate-Distortion Bound for Joint Compression and Classification.",
                    "Optimal Variable Rate Multiplexing of Scalable Code Streams.",
                    "Enhanced Sequitur for Finding Structure in Data.",
                    "IMAGE FOVEATION BASED ON VECTOR QUANTIZATION.",
                    "Network Source Coding Using Entropy Constrained Dithered Quantization.",
                    "Burrows Wheeler - Alternatives to Move to Front.",
                    "An Asymptotically Optimal Predictor for Stereo Lossless Audio Compression.",
                    "Recurrence Relations on Transfer Matrices Yield Good Lower and Upper Bounds on the Channel Capacity of Some 2-Dimensional Constrained Systems (Extended Abstract).",
                    "Recasting Of The Image Deblocking Problem Into The Domain Of Image Denoising.",
                    "Speeding up Arithmetic Coding using Greedy Re-normalization.",
                    "An Efficient Compression Scheme Supporting Partial Decoding.",
                    "Real-time preprocessing and video object segmentation for high compression and content-based MPEG-4 coding.",
                    "FaceCerts.",
                    "Arc-length compression.",
                    "Keyword Searching in Compressed Document Images.",
                    "A fast decoding method for prefix codes.",
                    "Experimental Study of a Binary Block Sorting Compression Scheme.",
                    "A New Delta Compression Algorithm Suitable for Program Updating in Embedded Systems.",
                    "Pattern Matching by means of Multi-Resolution Compression.",
                    "Volumetric Medical Image Compression and Reconstruction for Interactive Visualization in Surgical Planning.",
                    "Multiple description coding for noisy-varying channels.",
                    "A Simple and Fast Scheme for Code Compression for VLIW Processors.",
                    "Differentiation-based Multi-resolution Approach for Lossless Image Compression.",
                    "Associative Correction Of Compression Artefacts With A Self-Organizing Map Classifying The Image Content.",
                    "On the Average Redundancy Rate of Adaptive Block Codes under Mixed Sources.",
                    "A Dictionary-Based Multi-Corpora Text Compression System.",
                    "Comparison of 3D Set Partitioning Methods in Hyperspectral Image Compression Featuring an Improved 3D-SPIHT.",
                    "Compression of Correlated Sources Using LDPC Codes.",
                    "JPEG2000 Extensions for Bit Plane Coding of Floating Point Data.",
                    "Compressing High Dimensional Datasets by Fractals.",
                    "Dynamic Window Search and Probability Dominated Algorithm for Fast Vector Quantization Encoding.",
                    "An Efficient VQ Algorithm using Mean Value Predictive.",
                    "Soft-decoding Based Vector Quantization For Hidden-Markov Channels.",
                    "Phrase Elimination in Greedy Parsing Dictionary Coders with Deferred Innovation.",
                    "Image Classification using GMM with Context Information and with a Solution of Singular Covariance Problem.",
                    "Approximate Pattern Matching Using the Burrows-Wheeler Transform."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "12th DCC 2002",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2002",
                "sub_name": "2002 Data Compression Conference (DCC 2002), 2-4 April, 2002, Snowbird, UT, USA.",
                "count": 84,
                "papers": [
                    "Iterated Denoising for Image Recovery.",
                    "Multiple Description Coding of Predictively Encoded Sequences.",
                    "On-Line Adaptation in Image Coding with a 2-D Tarp Filter.",
                    "Low Bit Rate Image Coding in the Scale Space.",
                    "Image Compression using an Efficient Edge Cartoon + Texture Model.",
                    "Computing Rate-Distortion Optimized Policies for Streaming Media to Wireless Clients.",
                    "Rate-Based versus Distortion-Based Optimal Joint Source-Channel Coding.",
                    "Globally Optimal Uneven Error-Protected Packetization of Scalable Code Streams.",
                    "Combining FEC and Optimal Soft-Input Source Decoding for the Reliable Transmission of Correlated Variable-Length Encoded Signal.",
                    "Zero-Error Source Coding with Maximum Distortion Criterion.",
                    "Source Requantization: Successive Degradation and Bit Stealing.",
                    "Searching BWT Compressed Text with the Boyer-Moore Algorithm and Binary Search.",
                    "The Link Database: Fast Access to Graphs of the Web.",
                    "Path Matching in Compressed Control Flow Trace.",
                    "Searching in Compressed Dictionaries.",
                    "An Analysis of Perceptual Artifacts in MPEG Scalable Audio Coding.",
                    "Robust Video Transmission over Binary Symmetric Channels with Packet Erasures.",
                    "Improved Fine Granular Scalable Coding with Inter-Layer Prediction.",
                    "Incremental Calculation of Minimum-Redundancy Length-Restricted Codes.",
                    "PPMexe: PPM for Compressing Software.",
                    "PPM: One Step to Practicality.",
                    "Context Tree Compression of Multi-Component Map Images.",
                    "Precise Average Redundancy Of An Idealized Arithmetic Codin.",
                    "Quantized Frame Expansions In A Wireless Environment.",
                    "Data Compression of Correlated Non-Binary Sources Using Punctured Turbo Codes.",
                    "Compression with Side Information Using Turbo Codes.",
                    "n-Channel Multiple Descriptions: Theory and Constructions.",
                    "Progressive Image Communication over Binary Channels with Additive Bursty Noise.",
                    "Syndrome Decoding and Performance Analysis of DFT Codes with Bursty Erasures.",
                    "Quantizers with Uniform Encoders and Channel Optimized Decoders.",
                    "Quantization as Histogram Segmentation: Globally Optimal Scalar Quantizer Design in Network System.",
                    "Codecell Contiguity in Optimal Fixed-Rate and Entropy-Constrained Network Scalar Quantizers.",
                    "On Optimal Multi-resolution Scalar Quantization.",
                    "Fast Motion Detection for Thin Client Compression.",
                    "Index Compression through Document Reordering.",
                    "Bit Allocation in Sub-linear Time and the Multiple-Choice Knapsack Problem.",
                    "Progressive Coding of Palette Images and Digital Maps.",
                    "Improved Behaviour of Tries by the \"Symmetrization\" of the Source.",
                    "A Source Coding Approach to Classification by Vector Quantization and the Principle of Minimum Description Length.",
                    "Adaptive Parametric Vector Quantization by Natural Type Selection.",
                    "Reduced Complexity Quantization Under Classification Constraints.",
                    "Interpolation of Bandlimited Functions from Quantized Irregular Samples.",
                    "Omnidirectionally Balanced Multiwavelets for Vector Wavelet Transforms.",
                    "Joint Embedded Coding of Data and Grid Using First-Generation Wavelet Transforms.",
                    "Pattern Matching in BWT-Transformed Text.",
                    "Geometry Compression of 3-D Mesh Models Using a Joint Prediction.",
                    "Generalization of the BWT Transformation and Inversion Ranks.",
                    "Sequencing Multiple Descriptions.",
                    "LZAC Lossless Data Compression.",
                    "A Parallel Algorithm for Lossless Image Compression by Block Matching.",
                    "Fast Peak Autocorrelation Finding for Periodicity-Exploiting Compression Methods.",
                    "A Wavelet Based Low Complexity Embedded Block Coding Algorithm.",
                    "Image Coding with the MAP Criterion.",
                    "Diagnostically Lossless 3D Wavelet Compression for Digital Angiogram Video.",
                    "Overhead-Constrained Rate-Allocation for Scalable Video Transmission over Networks.",
                    "Extended Golomb Codes for Binary Markov Sources.",
                    "A Character Elimination Algorithm for Lossless Data Compression.",
                    "Rate Control Using Conditional Mean Estimator.",
                    "On Coding of Sources with Two-Sided Geometric Distribution Using Binary Decomposition.",
                    "Using Multiple Huffman Code Tables for Optimal Coding of DCT Blocks.",
                    "Low-Complexity Interpolation Coding for Server-Based Computing.",
                    "Embedded Coding of Palette Images in the Topological Space.",
                    "Perceptual Preprocessing Techniques Applied to Video Compression: Some Result Elements and Analysi.",
                    "Minimizing Distortion via Multiuser Resource Allocation.",
                    "Turbo Source Coding: A Noise-Robust Approach to Data Compression.",
                    "Compression Techniques for Active Video Content.",
                    "MPEG-7 Binary Format for XML Dat.",
                    "Compression of Image Block Means for Non-equal Size Partition Schemes Using Delaunay Triangulation and Prediction.",
                    "String Matching with Stopper Compression.",
                    "A Method for Compressing Lexicons.",
                    "Dictionary Design Algorithms for Vector Map Compression.",
                    "Optimized Edgebreaker Encoding for Large and Regular Triangle Meshes.",
                    "Diagnostically Lossless Compression of Pipeline Inspection Data.",
                    "Compression Performance, Absolutely!",
                    "Compression of 3D Objects with Multistage Color-Depth Panoramic Maps.",
                    "Improved Elastic Storage of Digital Still Images.",
                    "Low-Complexity Lossless and Fine-Granularity Scalable Near-Lossless Compression of Color Images.",
                    "Rate Scalable Video Compression Based on Flexible Block Wavelet Coding Technique.",
                    "Wavelet-Based Lossy Compression of Baratropic Turbulence Simulation Dat.",
                    "DWT-Based Error Concealment Techniques.",
                    "Less Redundant Codes for Variable Size Dictionaries.",
                    "New Techniques for Bounding the Channel Capacity of Read/Write Isolated Memor.",
                    "Computational Complexity Management of Motion Estimation in Video Encoders.",
                    "Semi-discrete Matrix Transforms (SDD) for Image and Video Compression."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "11th DCC 2001",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2001",
                "sub_name": "Data Compression Conference, DCC 2001, Snowbird, Utah, USA, March 27-29, 2001.",
                "count": 98,
                "papers": [
                    "On Zador's Entropy-Constrained Quantization Theorem.",
                    "Network Vector Quantization.",
                    "Design of Tree-Structured Multiple Description Vector Quantizers.",
                    "Robust Predictive Vector Quantizer Design.",
                    "Asymptotically Optimal Scalable Coding for Minimum Weighted Mean Square Error.",
                    "Lossless Image Data Sequence Compression Using Optimal Context Quantization.",
                    "Enhancing Analog Image Transmission Systems Using Digital Side Information: A New Wavelet-Based Image Coding Paradigm.",
                    "Group Testing for Wavelet Packet Image Compression.",
                    "Embedded Image Coding Using ZeroBlocks of Subband/Wavelet Coefficients and Context Modeling.",
                    "A Wavelet Coder for Masked Images.",
                    "Feature-Preserving Image Coding for Very Low Bit Rates.",
                    "Video Residual Coding Using SPIHT and Dependent Optimization.",
                    "Rate-Distortion Optimization for the SPHIT Encoder.",
                    "Length-Restricted Coding in Static and Dynamic Frameworks.",
                    "Optimal Prefix-Free Codes That End in a Specified Pattern and Similar Problems: The Uniform Probability Case.",
                    "Combining PPM Models Using a Text Mining Approach.",
                    "Compressing XML with Multiplexed Hierarchical PPM Models.",
                    "Quantized Oversampled Filter Banks with Erasures.",
                    "Semidefinite Programs for the Design of Codes for Delay-Constrained Communication in Networks.",
                    "Construction of Low Complexity Regular Quantizers for Overcomplete Expansions in RN.",
                    "Towards Compressing Web Graphs.",
                    "Compressing the Graph Structure of the Web.",
                    "Streaming Thin Client Compression.",
                    "Software Compression in the Client/Server Environment.",
                    "Tag Insertion Complexity.",
                    "Fast Adaptive Encoder for Bi-Level Images.",
                    "Optimal Code Design for Lossless and Near Lossless Source Coding in Multiple Access Networks.",
                    "On Variable Length Codes for Iterative Source/Channel Decoding.",
                    "Joint Source-Channel Decoding of Correlated Sources over Noisy Channels.",
                    "Successive Refinement on Trees: A Special Case of a New MD Coding Region.",
                    "Joint Source Channel Coding Using Arithmetic Codes and Trellis Coded Modulation.",
                    "Low Delay Perpetually Lossless Coding of Audio Signals.",
                    "Enhancing Image Coders by Using Spatial Noise Shaping (SNS).",
                    "Compression of the Layered Depth Image.",
                    "Multihypothesis Motion Estimation for Video Coding.",
                    "Managing Drift in DCT-Based Scalable Video Coding.",
                    "Design of Trellis Codes for Source Coding with Side Information at the Decoder.",
                    "Universal Lossless Compression of Piecewise Stationary Slowly Varying Sources.",
                    "The Coding-Optimal Transform.",
                    "An Adaptable Binary Entropy Coder.",
                    "Overlap in Adaptive Vector Quantization.",
                    "On the Hardness of Finding Optimal Multiple Preset Dictionaries.",
                    "Can We Do without Ranks in Burrows Wheeler Transform Compression?",
                    "Parsing Strategies for BWT Compression.",
                    "Space-Time Tradeoffs in the Inverse B-W Transform.",
                    "Pattern Matching in Huffman Encoded Texts.",
                    "Faster Approximate String Matching over Compressed Text.",
                    "Compressed Pattern Matching for SEQUITUR.",
                    "LIPT: A Reversible Lossless Text Transform to Improve Compression Performance.",
                    "Architecture for Efficient Implementation of the YK Lossless Data Compression Algorithm.",
                    "Lossless Compression for Satellite Packet Networks Using the YK Algorithm.",
                    "Noisy Image Compression: A Comparison of Wavelets, Multiwavelets, Wavelet Packets, and Multiwavelet Packets.",
                    "On Parent-Child Coding Gain in Zero-Tree Based Coders.",
                    "Improving Wavelet Compression with Neural Networks.",
                    "Error-Resilient Block Sorting.",
                    "FEC-Based Wireless Video Streaming with Pre-Interleaving.",
                    "An Efficient Data Embedding Algorithm for H.263 Compatible Video Coding.",
                    "Feature Difference Classification in Fractal Image Coding.",
                    "Fast Vertex Transformation for 3D Rendering through Predictive Vector Quantization.",
                    "LZ1 Compression of Binary Images Using a Simple Rectangle Greedy Matching Technique.",
                    "Video Coding for Streaming Media Delivery on the Internet.",
                    "The Qualitative Modeling and Compression of the Request Sequences in ARQ Protocols.",
                    "A Posteriori Quantized Matching Pursuit.",
                    "Real-Time Decompression of Streaming Video Using Mobile Code.",
                    "A Comparison between Two Error Detection Techniques Using Arithmetic Coding.",
                    "Edge-Based Artifact Mitigation in a Wavelet Transform Coding Framework.",
                    "Just-in-Time Browsing for Digital Images.",
                    "Lossless Fast Full Search Algorithm in Motion Estimation Using Various Matching Scans from Image Localization.",
                    "Improving Binary Coding for Prediction-Based Text Compression.",
                    "Compror: Compression with a Factor Oracle.",
                    "Glicbawls - Grey Level Image Compression by Adaptive Weighted Least Squares.",
                    "TMWLego - An Object Oriented Image Modelling Framework.",
                    "Application of Directional Wavelets to Image Compression.",
                    "Adaptive and Proadaptive Image Compression.",
                    "Delta Encoding of Related Web Pages.",
                    "Multiple Description Coding Using Exact Discrete Radon Transform.",
                    "An Optimizing Lossy Generalization of LZW.",
                    "Masked Wavelets: Applications to Image Compression.",
                    "Start/Stop Codes.",
                    "Unconstrained Vector Length in Fast Wavelet Transforms.",
                    "Lower Bounding the Optimal LZ78-Parsing.",
                    "JPEG Compressed Domain Image Retrieval by Colour and Texture.",
                    "Image Compression Using Blocksort.",
                    "Better Text Compression from Fewer Lexical n-Grams.",
                    "Adaptive Quantization for Lossy Image Compression Controlled by Noise Detection.",
                    "Source Coding with Minimal and Rate-Independent Search and Memory Complexity.",
                    "Complexity-Distortion Optimal Search Algorithm for Block Motion Estimation.",
                    "Deterministic Chaos and Information Theory.",
                    "Flexible Storage of Images for Digital Cameras.",
                    "Error Detection by Parity Checks for H.263 Compatible Video Coding.",
                    "Error Resilient Packet Video with Unequal Error Protection.",
                    "Mapping of Pruned Tree-Structured Scalar Quantizers to Companding: A Design Strategy.",
                    "Code Compression for VLIW Processors.",
                    "A New Lossless Compression Scheme for Medical Images by Hierarchical Segmentation.",
                    "Compression of Full Parallax Colour Integral 3D TV Image Data Based on Sub-Sampling of Chrominance Components.",
                    "Morphological Representation of DCT Data for Image Coding.",
                    "MSSBM and Its Application to Nature Image Coding.",
                    "Optimal Protection for Progressive Image Transmission over Noisy Channels: A General Approach."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "10th DCC 2000",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/2000",
                "sub_name": "Data Compression Conference, DCC 2000, Snowbird, Utah, USA, March 28-30, 2000.",
                "count": 92,
                "papers": [
                    "Group Testing for Image Compression.",
                    "A Novel Codec for Thin Client Computing.",
                    "Low-Complexity Scalable Image Compression.",
                    "Symbol Dictionary Design for the JBIG2 Standard.",
                    "The Skip-Innovation Model for Sparse Images.",
                    "Hard-Decision in COVQ over Waveform Channels.",
                    "Lossless and Lossy Broadcast System Source Codes: Theoretical Limits, Optimal Design, and Empirical Performance.",
                    "Joint Source/Channel Coding Using Arithmetic Codes.",
                    "Joint Source-Channel Soft Decoding of Huffman Codes with Turbo-Codes.",
                    "Iterative Source/Channel-Decoding Using Reversible Variable Length Codes.",
                    "Channel Decoding Using Inter- and Intra-Correlation of Source Encoded Frames.",
                    "Universal Finite Memory Machines for Coding Binary Sequences.",
                    "Implementing the Context Tree Weighting Method for Text Compression.",
                    "Text Compression Based on Variable-to-Fixed Codes for Markov Sources.",
                    "Compression of Biological Sequences by Greedy Off-Line Textual Substitution.",
                    "Prediction by Grammatical Match.",
                    "On-Line Decision Making for a Class of Loss Functions via Lempel-Ziv Parsing.",
                    "On the Performance of BWT Sorting Algorithms.",
                    "Switching between Two On-Line List Update Algorithms for Higher Compression of Burrows-Wheeler Transformed Data.",
                    "Move-to-Front and Inversion Coding.",
                    "PPM Performance with BWT Complexity: A New Method for Lossless Data Compression.",
                    "A New Method for Optimal Rate Allocation for Progressive Image Transmission over Noisy Channels.",
                    "Optimal Subtractive Dither for Near-Lossless Compression.",
                    "Content Layer Progressive Coding of Digital Maps.",
                    "Fast Progressive Image Coding without Wavelets.",
                    "Compression of Lumigraph with Multiple Reference Frame (MRF) Prediction and Just-in-Time Rendering.",
                    "Complexity-Scalable Transform Coding Using Variable Complexity Algorithms.",
                    "What's Your Sign? Efficient Sign Coding for Embedded Wavelet Image Coding.",
                    "Trees, Windows, and Tiles for Wavelet Image Compression.",
                    "Modifications of Uniform Quantization Applied in Wavelet Coder.",
                    "Multi-Resolution Adaptation of the SPIHT Algorithm for Multiple Description.",
                    "SPIHT-NC: Network-Conscious Zerotree Encoding.",
                    "Analysis of Optimal Filter Banks for Multiple Description Coding.",
                    "Rate Distortion Behavior of Threshold-Based Nonlinear Approximations.",
                    "Single-Bit Oversampled A/D Conversion with Exponential Accuracy in the Bit-Rate.",
                    "A Measure of Information.",
                    "Distributed Source Coding: Symmetric Rates and Applications to Sensor Networks.",
                    "On the Average Redundancy Rate of the Lempel-Ziv Code with K-Error Protocol.",
                    "Parallel Huffman Decoding.",
                    "Work-Optimal Parallel Decoders for LZ2 Data Compression.",
                    "A New Compression Method for Compressed Matching.",
                    "Piecewise Linear Image Coding Using Surface Triangulation and Geometric Compression.",
                    "Summary Structures for Frequency Queries on Large Transaction Sets.",
                    "Arithmetic Coding for Low Power Embedded System Design.",
                    "FEC and Pseudo-ARQ for Receiver-Driven Layered Multicast of Audio and Video.",
                    "Robust Video Coding for Packet Networks with Feedback.",
                    "Data Partitioning and Reversible Variable Length Codes for Robust Video Communications.",
                    "Improving Scene Cut Quality for Real-Time Video Decoding.",
                    "Multiple Description Lattice Vector Quantization: Variations and Extensions.",
                    "Design of Asymmetric Multiple Description Lattice Vector Quantizers.",
                    "Universal Lattice-Based Quantizers for Multiple Descriptions.",
                    "Lattice Quantization with Side Information.",
                    "An Overview of JPEG-2000.",
                    "Notes on Learning Probabilistic Automata.",
                    "Applications of YK Algorithm to the Internet Transmission of Web-Data: Implementation Issues and Modifications.",
                    "Product Code and Recurrent Alternative Decoding for Wireless Image Transmission.",
                    "Tree-Based Search for ECVQ.",
                    "Adaptive Post-Processing for Region-Based Fractal Image Compression.",
                    "Statistical Models for Term Compression.",
                    "Wavelet Coding of 3-D Shape Data Using Space-Frequency Quantization.",
                    "Seismic Data Compression Using GENLOT: Towards \"Optimality\"?",
                    "Some Notes on the Context Mapping Function in Lossless Data Compression.",
                    "QccPack: An Open-Source Software Library for Quantization, Compression, and Coding.",
                    "Text Categorization Using Compression Models.",
                    "PPM*-Style Context Sorting Compression Method Using a Prefix List.",
                    "A Modification to the Huffman Coding of JPEG's Baseline Compression Algorithm.",
                    "Bit Rate and Local Quality Control for On-Board Satellite Image Compression.",
                    "An Efficient Successive Elimination Algorithm for Block-Matching Motion Estimation.",
                    "An Efficient Low-Bit Rate Motion Compensation Technique Based on Quadtree.",
                    "Semantic Progressive Transmission for Deep Space Communications.",
                    "Protection of Regions of Interest against Data Loss in a Generalized Multiple Description Framework.",
                    "Distributed Internet-Adaptive Image Compression.",
                    "A Spatially Coherent Discrete Wavelet Transform - Accessing the Localization Property for Data Compression.",
                    "Data Compression with Truncated Suffix Trees.",
                    "Decoding of Canonical Huffman Codes with Look-Up Tables.",
                    "Coding of Image Residuals with Tailbiting Convolutional Codes and BCJR Decoding.",
                    "High Performance Lempel-Ziv Compression Using Optimized Longest String Parsing and Adaptive Huffman Window Size.",
                    "Wireless Image Transmission Using Multiple-Description Based Concatenated Codes.",
                    "Effect of Image Activity on Lossy and Lossless Coding Performance.",
                    "On Zonal Morphological Approach to Natural Language Texts Processing.",
                    "Compression of SMIL Documents.",
                    "Variable-to-Fixed Length Codes: A Geometrical Approach to Low-Complexity Source Codes.",
                    "Lossless Compression of High-Volume Numerical Data from Simulations.",
                    "Exploiting Interframe Redundancies in the Lossless Compression of 3D Medical Images.",
                    "RD-Optimization of Hierarchical Structured Adaptive Vector Quantization for Video Coding.",
                    "A Three-Layer, Two Description Image Coder.",
                    "Wavelet-Based Lossy Compression of Turbulence Data.",
                    "Compressed Domain Texture Classification from a Modified EZW Symbol Stream.",
                    "Optimal Packetization of Embedded Bitstreams.",
                    "Separate Source and Channel Rate Selection for Video over ATM.",
                    "Using Compression to Identify Acronyms in Text.",
                    "Image Compression Using Lossless Coding on VQ Indexes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "9th DCC 1999",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1999",
                "sub_name": "Data Compression Conference, DCC 1999, Snowbird, Utah, USA, March 29-31, 1999.",
                "count": 103,
                "papers": [
                    "Generalized Multiple Description Vector Quantization.",
                    "Multiple Description Lattice Vector Quantization.",
                    "Joint Image Compression and Classification with Vector Quantization and a Two Dimensional Hidden Markov Model.",
                    "Reduced Comparison Search for the Exact GLA.",
                    "\"Bit Rate on Demand\" Using Pruned Tree-Structured Hierarchical Lookup Vector Quantization.",
                    "Joint Source-Channel Coding for Progressive Transmission of Embedded Source Coders.",
                    "Embedded Post-Processing for Enhancement of Compressed Images.",
                    "Multiple Description Decoding of Overcomplete Expansions Using Projections onto Convex Sets.",
                    "Rate-Distortion Analysis of Spike Processes.",
                    "Graceful Degradation over Packet Erasure Channels through Forward Error Correction.",
                    "Context Quantization with Fisher Discriminant for Adaptive Embedded Wavelet Image Coding.",
                    "Low Complexity High-Order Context Modeling of Embedded Wavelet Bit Streams.",
                    "Software Synthesis of Variable-length Code Decoder Using a Mixture of Programmed Logic and Table Lookups.",
                    "Utilizing Soft Information in Decoding of Variable Length Codes.",
                    "Progressive Joint Source-Channel Coding in Feedback Channels.",
                    "Quadtree Classification and TCQ Image Coding.",
                    "Distributed Source Coding Using Syndromes (DISCUS): Design and Construction.",
                    "Linear Global Detectors of Redundant and Rare Substrings.",
                    "Universal Lossless Source Coding with the Burrows Wheeler Transform.",
                    "Modifications of the Burrows and Wheeler Data Compression Algorithm.",
                    "Text Mining: A New Frontier for Lossless Compression.",
                    "A Streaming Piecewise-Constant Model.",
                    "Memory Efficient Scalable Line-based Image Coding.",
                    "A Blending Model for Efficient Compression of Smooth Images.",
                    "The Effect of Flexible Parsing for Dynamic Dictionary Based Data Compression.",
                    "Single Resolution Compression of Arbitrary Triangular Meshes with Properties.",
                    "Protein is Incompressible.",
                    "Two Space-Economical Algorithms for Calculating Minimum Redundancy Prefix Codes.",
                    "A Work Efficient Parallel Algorithm for Constructing Huffman Codes.",
                    "Data Compression Using Long Common Strings.",
                    "Offline Dictionary-Based Compression.",
                    "Random Access Decompression Using Binary Arithmetic Coding.",
                    "Almost Optimal Fully LZW-Compressed Pattern Matching.",
                    "Quantized Frame Expansions as Source-Channel Codes for Erasure Channels.",
                    "Fast Progressive Wavelet Coding.",
                    "Source Coding with Quantized Redundant Expansions: Accuracy and Reconstruction.",
                    "Constrained Wavelet Packets for Tree-Structured Video Coding Algorithms.",
                    "Binary Pseudowavelets and Applications to Bilevel Image Processing.",
                    "Real-Time VBR Rate Control of MPEG Video Based upon Lexicographic Bit Allocation.",
                    "Decision Trees for Error Concealment in Video Decoding.",
                    "Complexity-Distortion Tradeoffs in Vector Matching Based on Probabilistic Partial Distance Techniques.",
                    "Three-Dimensional Wavelet Coding of Video with Global Motion Compensation.",
                    "A General Joint Source-Channel Matching Method for Wireless Video Transmission.",
                    "2D-Pattern Matching Image and Video Compression.",
                    "A Simple Technique for Bounding the Pointwise Redundancy of the 1978 Lempel-Ziv Algorithm.",
                    "Codes for Data Synchronization with Timing.",
                    "Variable-to-Fixed Length Codes and Plurally Parsable Dictionaries.",
                    "Iterative Decoding of Multiple Descriptions.",
                    "Performance of Quantizers on Noisy Channels Using Structured Families of Codes.",
                    "Edge Adaptive Prediction for Lossless Image Coding.",
                    "Adaptive Linear Prediction Lossless Image Coding.",
                    "SICLIC: A Simple Inter-Color Lossless Image Coder.",
                    "On Taking Advantage of Similarities between Parameters in Lossless Sequential Coding.",
                    "Performance Evaluation of Reversible Integer-to-Integer Wavelet Transforms for Image Compression.",
                    "Move-to-Front and Permutation Based Inversion Coding.",
                    "Lexical Attraction for Text Compression.",
                    "Comparison and Application Possibilities of JPEG and Fractal-based Image Compressing Methods in the Development of Multimedia Based Material.",
                    "Joint Design of Progressive Fixed-Rate Source-Channel Codes.",
                    "A General-Purpose Compression Scheme for Databases.",
                    "Design Consideration for Multi-lingual Cascading Text Compressors.",
                    "A Perceptual-Based Video Coder for Error Resilience.",
                    "An Open Interface for Probabilistic Models of Text.",
                    "Word-based Compression Methods for Large Text Documents.",
                    "Image Coding Using Markov Models with Hidden States.",
                    "Rate-Distortion Optimized Spatial Scalability for DCT-Based Video Coding.",
                    "On Entropy Constrained Residual Vector Quantization Design.",
                    "Sorted Sliding Window Compression.",
                    "Compression of Arbitrary Cutting Planes.",
                    "Resynchronizing Variable-Length Codes for Robust Image Transmission.",
                    "Finite Automata and Regularized Edge Preserving Wavelet Transform Scheme.",
                    "Motion Estimation Using Long Term Motion Vector Prediction.",
                    "Modified Viterbi Algorithm for Predictive TCQ.",
                    "Lossless Color Image Compression Using Chromatic Correlation.",
                    "Zerotree Coding of Wavelet Coefficients for Image Data on Arbitrarily Shaped Support.",
                    "A Fractional Chip Wavelet Zero Tree Codec (WZT) for Video Compression.",
                    "Improving Text Compression Ratios with the Burrows-Wheeler Transform.",
                    "Vector Quantization of Video with Two Codebooks.",
                    "Fast, Modified Z-Coding of Wavelet Pyramids.",
                    "Bounding the Compression Loss of the FGK Algorithm.",
                    "Resynchronization Properties of Arithmetic Coding.",
                    "Joint Optical Flow Motion Compensation and Video Compression Using Hybrid Vector Quantization.",
                    "Data Compression for the Next Generation Space Telescope.",
                    "Compressing ATM Streams On-Line.",
                    "Improved Joint Source-Channel Decoding for Variable-Length Encoded Data Using Soft Decisions and MMSE Estimation.",
                    "Fast Multi-Match Lempel-Ziv.",
                    "Experiments with Single-Pass Adaptive Vector Quantization.",
                    "Compression of SAR and Ultrasound Imagery Using Texture Models.",
                    "A Modified Burrows-Wheeler Transformation for Case-Insensitive Search with Application to Suffix Array Compression.",
                    "Encoding Time Reduction in Fractal Image Compression.",
                    "EigenWavelet: Hyperspectral Image Compression Algorithm.",
                    "An Asymptotically Optimal Data Compression Algorithm Based on an Inverted Index.",
                    "Parallel Memories in Video Encoding.",
                    "Lossless JBIG2 Coding Performance.",
                    "Towards a Calibrated Corpus for Compression Testing.",
                    "New Methods for Multiplication-Free Arithmetic Coding.",
                    "A Video Codec Based on R/D-Optimized Adaptive Vector Quantization.",
                    "A Novel Dual-Path Architecture for HDTV Video Decoding.",
                    "Image Compression Based on Low-Pass Wavelet Transform and Multi-Scale Edge Compensation, Part I: MSEC Model.",
                    "Image Compression Based on Low-Pass Wavelet Transform and Multi-Scale Edge Compensation, Part II: Evidence and Experiments.",
                    "Reversible Variable Length Codes (RVLC) for Robust Coding of 3D Topological Mesh Data.",
                    "Application of a Word-Based Text Compression Method to Japanese and Chinese Texts.",
                    "Modified SPIHT Encoding for SAR Image Data.",
                    "Extending DACLIC for Near Lossless Compression with Postprocessing of Greyscale Images."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "8th DCC 1998",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1998",
                "sub_name": "Data Compression Conference, DCC 1998, Snowbird, Utah, USA, March 30 - April 1, 1998.",
                "count": 116,
                "papers": [
                    "Piecewise Integer Mapping for Arithmetic Coding.",
                    "The Z-Coder Adaptive Binary Coder.",
                    "Compression of Sparse Matrices by Arithmetic Coding.",
                    "Fast Convergence with a Greedy Tag-Phrase Dictionary.",
                    "Tag Based Models of English Text.",
                    "Practical Multi-Resolution Source Coding: TSVQ Revisited.",
                    "Quantization, Classification, and Density Estimation for Kohonen's Gaussian Mixture.",
                    "On the Performance of Vector Quantizers Empirically Designed from Dependent Sources.",
                    "Successively Refinable Trellis Coded Quantization.",
                    "Embedded Trellis Coded Quantization.",
                    "Multiple Pattern Matching in LZW Compressed Text.",
                    "Pattern Matching in Text Compressed with the ID Heuristic.",
                    "Some Theory and Practice of Greedy Off-Line Textual Substitution.",
                    "A Fast Algorithms for Making Suffix Arrays and for Burrows-Wheeler Transformation.",
                    "Joint Source/Channel Coding for Variable Length Codes.",
                    "The Multiple Description Rate Region for High Resolution Source Coding.",
                    "Turbo Decoding of Hidden Markov Sources with Unknown Parameters.",
                    "Minimum Message Length Hidden Markov Modelling.",
                    "Phrase Hierarchy Inference and Compression in Bounded Space.",
                    "The Context Trees of Block Sorting Compression.",
                    "The Prevention of Error Propagation in Dictionary Compression with Update and Deletion.",
                    "Musical Image Compression.",
                    "On-Line Compression of High Precision Printer Images by Evolvable Hardware.",
                    "Efficient Algorithms for Optimal Video Transmission.",
                    "A Locally Optimal Design Algorithm for Block-Based Multi-Hypothesis Motion-Compensated Prediction.",
                    "Intensity Controlled Motion Compensation.",
                    "The H.263+ Video Coding Standard: Complexity and Performance.",
                    "Codeword Asigment for Fixed-Length Entropy Coded Video Streams.",
                    "Non-Uniform PPM and Context Tree Models.",
                    "Correcting English Text Using PPM Models.",
                    "Context Tables: A Tool for Describing Text Compression Algorithms.",
                    "Context Models for Palette Images.",
                    "Compression by Model Combination.",
                    "Bayesian State Combining for Context Models.",
                    "Image Transmission Using Arithmetic Coding Based Continuous Error Detection.",
                    "Transmission Error Robust Fractal Coding Using a Model-Residual Approach.",
                    "A Lossless 2-D Image Compression Technique for Synthetic Discrete-Tone Images.",
                    "Linear-Time Construction of Optimal Context Trees.",
                    "Lossless Interframe Image Compression via Context Modeling.",
                    "Optimal Multiple Description Transform Coding of Gaussian Vectors.",
                    "Line Based, Reduced Memory, Wavelet Image Compression.",
                    "A Low-Complexity Modeling Approach for Embedded Coding of Wavelet Coefficients.",
                    "Robust Wavelet Zerotree Image Compression with Fixed-Length Packetization.",
                    "Efficient Lossless Coding of Medical Image Volumes Using Reversible Integer Wavelet Transforms.",
                    "On Suboptimal Multidimensional Companding.",
                    "Accurate Subband Coding with Low Resolution Quantization.",
                    "Extending TMW for Near Lossless Compression of Greyscale Images.",
                    "Reversible Variable Length Codes for Efficient and Robust Image and Video Coding.",
                    "Variable to Fixed Length Codes for Predictable Sources.",
                    "Switching Between Two Universal Source Coding Algorithms.",
                    "Optimal Lossless Compression of a Class of Dynamic Sources.",
                    "Universal Data Compression and Linear Prediction.",
                    "Joint Source Channel Matching for a Wireless Communications Link.",
                    "Block Sorting Transformations.",
                    "PRECIS: A Method for Fast Compression of Periodic Halftones.",
                    "Hybrid Image Compression Scheme Based on Wavelet Transform and Adaptive Context Modeling.",
                    "Reversing the Error-Correction Scheme for a Fault-Tolerant Indexing.",
                    "Lossy Compression of Partially Masked Still Images.",
                    "Feature Preserving Lossy Image Compression Using Nonlinear PDE's.",
                    "A Joint Source-Channel Coding Scheme for Robust Image Transmission.",
                    "Empirical Channel Matched Quantizer Design and UEP for Robust Image Transmission.",
                    "Higher Compression from the Burrows-Wheeler Transform by Modified Sorting.",
                    "Study on Mult-lingual LZ77 and LZ78 Text Compression.",
                    "A Perceptual Preprocessor to Segment Video for Motion Estimation.",
                    "On Accelerating Fractal Compression.",
                    "Joint Source-Channel Coding Using Space-Filling Curves for Bandwidth Compression.",
                    "Adaptive Wavelet Transforms for Image Coding Using Lifting.",
                    "Simple Pre-Processors Significantly Improve LZ_1 Compression.",
                    "Successive Coefficient Refinement for Embedded Lossless Image Compression.",
                    "Fractal Color Compression in the L*a*b* Uniform Color Space.",
                    "Improved Lossless Halftone Image Coding Using a Fast Adaptive Context Template Selection Scheme.",
                    "A New Compression Scheme for Syntactically Structured Messages (Programs) and its Application to Java and the Internet.",
                    "Weighting of Double Exponential Distributed Data in Lossless Image Compression.",
                    "Compression via Guided Parsing.",
                    "Post-Processing for Low Bit-Rate Wavelet-Based Image Coding Using Multiscale Edge Characterization.",
                    "On-Line Sprite Encoding with Large Global Motion Estimation.",
                    "Compression of Unicode Files.",
                    "Video Coding Using Vector Zerotrees and Adaptive Vector Quantization.",
                    "Predictive Fractal Image Coding: Hybrid Algorithms and Compression of Residuals.",
                    "AudioPaK - An Integer Arithmetic Lossless Audio Codec.",
                    "Analysis of Trellis Quantization for Near-Lossless Image Coding.",
                    "Block Contex Modeling Approach for Binary Image Coding.",
                    "High-Speed Software Implementation of Huffman Coding.",
                    "Complexity of Preprocessor in MPM Data Compression System.",
                    "Adaptive-Rate Coding-Modulation System for Digital Image Transmission.",
                    "Preprocessing Text to Improve Compression Ratios.",
                    "Adjustments for JPEG De-quantization Coefficients.",
                    "Entrophy and Data Compression Performances.",
                    "A Multimode Context-Based Lossless Wavelet Image Coder.",
                    "Lossless Compression of Video Using Motion Compensation.",
                    "Post-Processing Enhancement of Decompressed Images Using Variable Order Bezier Polynomials and Distance Transform.",
                    "Low Bit-Rate Video Coding with Trellis Source Codes.",
                    "Fast Wavelet Packet Image Compression.",
                    "Japanese Text Compression Using Word-Based Coding.",
                    "Recovery from Dropout Errors in LZ77 Compressed Text.",
                    "Mail Servers with Embedded Data Compression Mechanisms.",
                    "A Fast Symbol Coding Scheme with Specific Application in Bulk Compression.",
                    "A Memory-Efficient Adaptive Huffman Coding Algorthm for Very Large Sets of Symbols.",
                    "LZRW1 Without Hashing.",
                    "On Optimality of Varients of the Block Sorting Compression.",
                    "Conditional Source Coding with Competitive Lists.",
                    "A Fast Renormalisation for Arithmetic Coding.",
                    "Optimal Decoding of Entrophy Coded Memoryless Sources over Binary Symmetric Channels.",
                    "Grouping Algorithm for Lossless Data Compression.",
                    "Breakpoint Skeletal Representation and Compression of Document Images.",
                    "Analysis of a Joint Video Coding System.",
                    "Color Image Compression by STACK-RUN-END Coding.",
                    "Lossless Compression of Pre-Press Images Using Linear Color Decorrelation.",
                    "Lossless Compression of Binary Audio Signals.",
                    "A Bayesian Framework for Content-Based Indexing and Retrieval.",
                    "A Scalable Entropy Code.",
                    "Control Structure Efficiency Enhancement for Predictive Video Coding.",
                    "Analysis and Comparison of Various Image Downsampling and Upsampling Methods.",
                    "Parallel Algorithms for Multi-Indexed Recurrence Relations with Applications to DPCM Image Compression.",
                    "Packed-TS Transform.",
                    "FACOLA - Face Coder Based on Location and Attention."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "7th DCC 1997",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1997",
                "sub_name": "Proceedings of the 7th Data Compression Conference (DCC '97), Snowbird, Utah, USA, March 25-27, 1997.",
                "count": 42,
                "papers": [
                    "Linear-time, Incremental Hierarchy Inference for Compression.",
                    "Models of English Text.",
                    "Towards Understanding and Improving Escape Probabilities in PPM.",
                    "A Percolating State Selector for Suffix-Tree Context Models.",
                    "An Executable Taxonomy of On-Line Modeling Algorithms.",
                    "An Analytical Treatment of Channel-Induced Distortion in Run Length Coded Image Subbands.",
                    "Capturing Global Redundancy to Improve Compression of Large Images.",
                    "Progressive Image Coding on Noisy Channels.",
                    "Multimode Image Coding for Noisy Channels.",
                    "Linfty-Constrained High-Fidelity Image Compression via Adaptive Context Modeling.",
                    "A Lexicographic Framework for MPEG Rate Control.",
                    "Content-Adaptive Postfiltering for Very Low Bit Rate Video.",
                    "Library-based Coding: a Representation for Efficient Video Compression and Retrieval.",
                    "On Adaptive Strategies for an Extended Family of Golomb-type Codes.",
                    "An Iterative Technique for Universal Lossy Compression of Individual Sequences.",
                    "Significantly Lower Entropy Estimates for Natural DNA Sequences.",
                    "Text Compression Via Alphabet Re-Representation.",
                    "Low-Cost Prevention of Error Propagation for Data Compression with Dynamic Dictionaries.",
                    "Block Sorting and Compression.",
                    "Redundancy of the Lempel-Ziv-Welch Code.",
                    "A Corpus for the Evaluation of Lossless Compression Algorithms.",
                    "Fast Weighted Universal Transform Coding: Toward Optimal, Low Complexity Bases for Image Compression.",
                    "Image Coding Based on Mixture Modeling of Wavelet Coefficients and a Fast Estimation-Quantization Framework.",
                    "Universal Transform Coding Based on Backward Adaptation.",
                    "Efficient Context-Based Entropy Coding Lossy Wavelet Image Compression.",
                    "An Embedded Wavelet Video Coder Using Three-Dimensional Set Partitioning in Hierarchical Trees (SPIHT).",
                    "Optimal Fractal Coding is NP-Hard.",
                    "Fast and Compact Volume Rendering in the Compressed Transform Domain.",
                    "Compression of Functions Defined on Surfaces of 3D Objects.",
                    "On Maximal Parsings.",
                    "A Codebook Generation Algorithm for Document Image Compression.",
                    "A Fixed-Rate Quantizer Using Block-Based Entropy-Constrained Quantization and Run-Length Coding.",
                    "Adaptive Vector Quantization Using Generalized Threshold Replenishment.",
                    "Quadtree Based Variable Rate Oriented Mean Shape-Gain Vector Quantization.",
                    "Entropy-Constrained Successively Refinable Scaler Quantization.",
                    "Conditional Entropy Coding of VQ Indexes for Image Compression.",
                    "Efficient Approximate Adaptive Coding.",
                    "An Overhead Reduction Technique For Mega-State Compression Schemes.",
                    "Text Compression by Context Tree Weighting.",
                    "Image Coding Using Optimized Significance Tree Quantization.",
                    "Fast Residue Coding for Lossless Textual Image Compression.",
                    "A Remapping Technique Based on Permutations for Lossless Compression of Multispectral Images."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "6th DCC 1996",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1996",
                "sub_name": "Proceedings of the 6th Data Compression Conference (DCC '96), Snowbird, Utah, USA, March 31 - April 3, 1996.",
                "count": 92,
                "papers": [
                    "Robust Quantization for Image Coding and Noisy Digital Transmission.",
                    "Symmetric Trellis Coded Vector Quantization.",
                    "Joint Image Classification and Compression using Hierarchical Table-Lookup Vector Quantization.",
                    "Designing Vector Quantizers in the Presence of Source Noise or Channel Noise.",
                    "Lossy Compression of Noisy Cardiac Image Sequences.",
                    "The Entropy of English Using PPM-based Models.",
                    "Compressing Semi-Structured Text using Hierarchical Phrase Identification.",
                    "Free Energy Coding.",
                    "Exploiting Clustering in Inverted File Compression.",
                    "On the Average Redundancy Rate of the Lempel-Ziv Code.",
                    "Efficient Cost Measures for Motion Compensation at Low Bit Rates (Extended Abstract).",
                    "Morphological Motion Field Representation for Region-Based Image Sequence Coding.",
                    "Rate-Distortion Based Temporal Filtering for Video Compression.",
                    "Lossless Compression of Grayscale Images via Context Tree Weighting.",
                    "Loco-I: A Low Complexity, Context-Based, Lossless Image Compression Algorithm.",
                    "An Algorithmic Study on Lossless Image Compression.",
                    "An Adaptive Data Compression Method Based on Context Sorting.",
                    "On the Implementation of Minimum-Redundancy Prefix Codes.",
                    "Parsing with Prefix and Suffix Dictionaries.",
                    "Extended Application of Suffix Trees to Data Compression.",
                    "Parallel Compression with Cooperative Dictionary Construction.",
                    "Lossless and Lossy Compression of Text Images by Soft Pattern Matching (Extended Abstract).",
                    "Constrained and Recursive Hierarchical Table-Lookup Vector Quantization.",
                    "Fast Reconstruction of Subband Decomposed Signals for Progressive Transmission.",
                    "Optimum Pre- and Post Filters for Robust Scalar Quantization.",
                    "Fixed-Rate Successively Refinable Scalar Quantizers.",
                    "Piecewise Linear Tree-Structured Models for Lossless Image Compression.",
                    "Bi-level Image Compression with Tree Coding.",
                    "Finite Automata Based Compression of Bi-level Images.",
                    "Lossless Image Compression Using Generalized LZ1-Type Methods.",
                    "Pattern-based Compression of Text Images.",
                    "Predictive Vector Quantization with Ridge Regression.",
                    "Lapped Orthogonal Vector Quantization.",
                    "Stochastic Vector Quantization, and Stochastic VQ with State Feedback Using Neural Networks.",
                    "Distortion-Limited Vector Quantization.",
                    "Optimal Bit Allocation Under Multiple Rate Constraints.",
                    "Refining Image Compression with Weighted Finite Automata.",
                    "Arbitrary Tilings of the Time-Frequency Plane Using Local Bases.",
                    "Extending RD-OPT with Global Thresholding for JPEG Optimization.",
                    "Optimal Bit Allocation for Biorthogonal Wavelet Coding.",
                    "Seismic Data Compression Using High-Dimensional Wavelet Transforms.",
                    "Quadtree-Guided Wavelet Image Coding.",
                    "Enhancing Lempel-Ziv Codes Using an On-Line Variable Length Binary Encoding.",
                    "Lossless Compression Using Inversions on Multiset Permutations (Abstract).",
                    "Pattern Matching Image Compression.",
                    "Combining Tree and Feature Classification in Fractal Encoding of Images.",
                    "Learning to Compress Ergodic Sources.",
                    "100 MBit per Second VLSI Implementation of Sliding Window Coding.",
                    "LZP: A New Data Compression Algorithm.",
                    "New Techniques in Context Modeling and Arithmetic Encoding.",
                    "Model-Based Motion Compensated Compression for Synthetic Animations.",
                    "Efficient Lossless Compression of Trees and Graphs.",
                    "Video Compression Using Fax Techniques.",
                    "Vector Quantizer Design Using Genetic Algorithms.",
                    "Hybrid Block-Based/Segment-Based Video Compression at very Low Bitrate.",
                    "Robust Image Coding Using the Embedded Zertotree Wavelet Algorithm.",
                    "A Low Complexity Wavelet Based Audio Compression Method.",
                    "Combination Coding: A New Entropy Coding Technique.",
                    "Elements of Adaptive Wavelet Image Compression.",
                    "Enhanced Wavelet-Based Zerotree Coding of Images.",
                    "Data Compression Using Encrypted Text.",
                    "Real-Time Implementation of Full-Search Vector Quantization on a Low Memory SIMD Architecture.",
                    "Low Complexity Finite-State Scalar Quantization of Image Subbands.",
                    "Device Selective Quantization for Reversible Wavelets.",
                    "Global and Local Distortion Inference During Embedded Zerotree Wavelet Decompression.",
                    "Bi-level Document Image Compression using Layout Information.",
                    "Image Compression with Iterated Function Systems, Finite Automate and Zerotrees: Grand Unification.",
                    "Stationary Entrophy Estimation via String Matching.",
                    "Audio Coding Using Variable-Depth Multistage Quantizers.",
                    "Compression of Aerial Ortho Images Based on Image Denoising.",
                    "A Codebook Design Technique for Better Image Quality in Vector Quantization.",
                    "A High Speed Motion Estimator Using 2-D Log Search Algorithm.",
                    "High-Speed Statistical Compression using Self-Organized Rules and Predetermined Code Tables.",
                    "Parallel Input/Output Impact on Sparse Matrix Compression.",
                    "Parameterized Markov Models for Efficient Compression of Grayscale Images.",
                    "Wavelet Coding for Remote Sensed Data.",
                    "A Guaranteed Compression Scheme for Repetitive DNA Sequences.",
                    "A CTW Scheme for Non-Tree Sources.",
                    "Efficient Chain-Code Encoding for Segmentation-Based Image Compression.",
                    "A Lossy Image Codec Based on Index Coding.",
                    "High Performance Wavelet Image Compression Optimized for MSE and HVS Metrics.",
                    "The Application of Wavelets to Lossless Compression and Progressive Transmission of Floating Point Data in 3-D Curvilinear Grids.",
                    "Image Operations using a Semi-compressed Contour Tree Image Definition.",
                    "Speech Data Compression for Embedded Systems.",
                    "Experimental Studies on a Compact Storage Scheme for Wavelet-Based Multiresolution Subregion Retrieval.",
                    "Telco Systems/IBM Compression Server (Abstract).",
                    "The Effects of Wavelet-based Data Compression on Flat Field Calibration for Remote Sensing Applications.",
                    "Wavelet-based Compression for Interactive Progressive Image Transmission.",
                    "The Effects of Transmission Errors on Wavelet Compressed Imagery.",
                    "Live Video Communication over Computer Networks.",
                    "Low Bitrate Compression With Downsampling and JPEG.",
                    "The Evaluation of Low Bit Rate and Multi-Component Image Compression Algorithms for Inclusion in the National Imagery Transmission Format Standard (NITFS)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th DCC 1995",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1995",
                "sub_name": "Proceedings of the IEEE Data Compression Conference, DCC 1995, Snowbird, Utah, USA, March 28-30, 1995.",
                "count": 42,
                "papers": [
                    "Hierarchical Vector Quantization of Perceptually Weighted Block Transforms.",
                    "Quantization of Overcomplete Expansions.",
                    "Constraining the Size of the Instantaneous Alphabet in Trellis Quantizers.",
                    "Tree-Structured Vector Quantization with Significance Map for Wavelet Image Coding.",
                    "Constrained-Storage Vector Quantization with a Universal Codebook.",
                    "Unbounded Length Contexts for PPM.",
                    "Context Models in the MDL Framework.",
                    "The Structure of DMC.",
                    "Universal Coding for Arbitrarily Varying Sources and for Hierarchies of Model Classes.",
                    "Coding with Partially Hidden Markov Models.",
                    "Quadtree Based JBIG Compression.",
                    "Lossy Compression of Clustered-Dot Halftones Using Sub-Cell Prediction.",
                    "Efficient Error Free Chain Coding of Binary Documents.",
                    "New Algorithms for Optimal Binary Vector Quantizer Design.",
                    "Finite State Methods for Compression and Manipulation of Images.",
                    "A Derailment-free Finite-State Vector Quantizer with Optimized State Codebooks.",
                    "Parallel Algorithms for the Static Dictionary Compression.",
                    "Near Optimal Compression with Respect to a Static Dictionary on a Practical Massively Parallel Architecture.",
                    "An Efficient Variable Length Coding Scheme for an IID Source.",
                    "Space-Efficient Construction of Optimal Prefix Codes.",
                    "Arithmetic Coding Revisited.",
                    "CREW: Compression with Reversible Embedded Wavelets.",
                    "Accelerating Fractal Image Compression by Multi-Dimensional Nearest Neighbor Search.",
                    "Self-Quantized Wavelet Subtrees: A Wavelet-Based Theory for Fractal Image Compression.",
                    "Convergence of Fractal Encoded Images.",
                    "Embedded Wavelet Zerotree Coding with Direct Sum Quantization Structures.",
                    "Generalized Lempel-Ziv Parsing Scheme and its Preliminary Analysis of the Average Profile.",
                    "Multiple-Dictionary Coding Using Partial Matching.",
                    "Fast Pattern Matching for Entropy Bounded Text.",
                    "An Improved Hierarchical Lossless Text Compression Algorithm.",
                    "The Effect of Non-Greedy Parsing in Ziv-Lempel Compression Methods.",
                    "A Comparison of the Z, E8, and Leech Lattices for Image Subband Quantization.",
                    "Compression of Hyperspectral Imagery Using Hybrid DPCM/DCT and Entropy-Constrained Trellis Coded Quantization.",
                    "RD-OPT: An Efficient Algorithm for Optimizing DCT Quantization Tables.",
                    "JPEG Optimization Entropy-Constrained Quantization Framework.",
                    "Multiplication-Free Subband Coding of Color Images.",
                    "An Automatic System for Model-Based Coding of Faces.",
                    "A New Model of Perceptual Threshold Functions of Application in Image Compression Systems.",
                    "A New Approach to Scalable Video Coding.",
                    "New Relationships in Operator-Based Backward Motion Compensation.",
                    "Optimal Representation of Motion Fields for Video Compression.",
                    "Matching Pursuit Video Coding at Very Low Bit Rates."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "4th DCC 1994",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1994",
                "sub_name": "Proceedings of the IEEE Data Compression Conference, DCC 1994, Snowbird, Utah, USA, March 29-31, 1994.",
                "count": 46,
                "papers": [
                    "Variable Dimension Weighted Universal Vector Quantization and Noiseless Coding.",
                    "Entropy-Constrained Tree-Structured Vector Quantizer Design by the Minimum Cross Entropy Principle.",
                    "A Subjective Distortion Measure for Vector Quantization.",
                    "Multidimensional Rotations for Quantization.",
                    "A New Multiple Path Search Technique for Residual Vector Quantizers.",
                    "The Minimax Redundancy is a Lower Bound for Most Sources.",
                    "Differential State Quantization of High Order Gauss Markov Process.",
                    "Data Compression Techniques for Stock Market Prediction.",
                    "Huffman-Type Codes for Infinite Source Distributions.",
                    "On the Redundancy of Optimum Fixed-to-Variable Length Codes.",
                    "Adaptive Variable-to-Variable Length Codes.",
                    "Compression-Based Template Matching.",
                    "Markov Models for Clusters in Concordance Compression.",
                    "Static Compression for Dynamic Texts.",
                    "Parsing Algorithms for Dictionary Compression on the PRAM.",
                    "Syntax-Constrained Encoder Optimization Using Adaptive Quantization Thresholding for JPEG/MPEG Coders.",
                    "Customized JPEG Compression for Grayscale Printing.",
                    "Lossless Image Compression with Lossy Image Using Adaptive Prediction and Arithmetic Coding.",
                    "Explicit Bit Minimization for Motion-Compensated Video Coding.",
                    "Online Compression of Video Sequences Using Adaptive VQ Codebooks.",
                    "Compression of HDTV Signals for Low Bit-Rate Transmission Using Motion Compensated Subband Transform Coding and a Self-Organization Neural Network.",
                    "Differential Vector Quantization of Real-Time Video.",
                    "The MVP: A Highly-Integrated Video Compression Chip.",
                    "A Hybrid Approach to Text Compression.",
                    "Highly Efficient Universal Coding with Classifying to Subdictionaries for Text Compression.",
                    "Compression By Induction of Hierarchical Grammars.",
                    "Architectural Advances in the VLSI Implementation of Arithmetic Coding for Binary Image Compression.",
                    "Multiplication and Division Free Adaptive Arithmetic Coding Techniques for Bi-Level Images.",
                    "Bayes Risk Weighted Tree-Structured Vector Quantization with Posterior Estimation.",
                    "Fast Bintree-Structured Image Coder for High Subjective Quality.",
                    "A High Performance Fixed Rate Compression Scheme for Still Image Transmission.",
                    "A Nonlinear VQ-Based Predictive Lossless Image Coder.",
                    "Band Ordering in Lossless Compression of Multispectral Images.",
                    "Enhancement of Block Transform Coded Images Using Residual Spectra Adaptive Postfiltering.",
                    "Self-Similarity of the Multiresolutional Image/Video Decomposition: Smart Expansion as Compression of Still and Moving Pictures.",
                    "An Investigation of Wavelet-Based Image Coding Using an Entropy-Constrained Quantization Framework.",
                    "Filter Evaluation and Selection in Wavelet Image Compression.",
                    "Visibility of DCT Basis Functions: Effects of Contrast Masking.",
                    "Visibility of DCT Basis Functions: Effects of Display Resolution.",
                    "On Lattice Quantization Noise.",
                    "Vector Quantization of Contextual Information for Lossless Image Compression.",
                    "Bayes Risk Weighted VQ and Learning VQ.",
                    "Improved Techniques for Single-Pass Adaptive VQ.",
                    "Variable Dimension Vector Quantization of Speech Spectra for Low Rate Vocoders.",
                    "A Rapidly Adaptive Lossless Compression Algorithm for High Fidelity Audio Coding.",
                    "Sharper Bounds on Occam Filters with Application to Digital Video."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "3rd DCC 1993",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1993",
                "sub_name": "Proceedings of the IEEE Data Compression Conference, DCC 1993, Snowbird, Utah, USA, March 30 - April 1, 1993.",
                "count": 44,
                "papers": [
                    "Combining Image Classification and Image Compression Using Vector Quantization.",
                    "An Improved Sequential Search Multistage Vector Quantizer.",
                    "Globally Optimal Bit Allocation.",
                    "On-Line Adaptive Vector Quantization with Variable Size Codebook Entries.",
                    "Joint Codebook Design for Summation Product-Code Vector Quantizers.",
                    "Codes with Monotonic Codeword Lengths.",
                    "Filtering Random Noise via Data Compression.",
                    "Can Random Fluctuation Be Exploited in Data Compression.",
                    "Divergence and the Construction of Variable-to-Variable-Length Lossless Codes by Source-Word Extensions.",
                    "Universality and Rates of Convergence in Lossy Source Coding.",
                    "Design and Analysis of Fast Text Compression Based on Quasi-Arithmetic Coding.",
                    "An Empirical Evaluation of Coding Techniques for Multi-Symbol Alphabets.",
                    "Minimizing Error and VLSI Complexity in the Multiplication-Free Approximation of Arithmetic Coding.",
                    "Multialphabet Arithmetic Coding at 16 MBytes/sec.",
                    "Ziv-Lempel Encoding with Multi-Bit Flags.",
                    "On Approximate String Matching.",
                    "Coding Theory and Regularization.",
                    "Optimal Piecewise-Linear Compression of Images.",
                    "Visually Optimal DCT Quantization Matrices for Individual Images.",
                    "Optimum DCT Quantization.",
                    "Full-Frame Compression of Tomographic Images Using the Discrete Fourier Transform.",
                    "A High Performance Adaptive Image Compression System Using a Generative Neural Network: Dynamic Neural Network II (DANN II).",
                    "An Embedded Hierarchical Image Coder using Zerotrees of Wavelet Coefficients.",
                    "Wavelet Transform-Vector Quantization Compression of Supercomputer Ocean Models.",
                    "Efficient Compression of Wavelet Coefficients for Smooth and Fractal-like Data.",
                    "Fractal Based Image Compression with Affine Transformations.",
                    "Generalized Fractal Transforms: Complexity Issues.",
                    "Segmentation-Based Progressive Image Coding.",
                    "Classified Variable Rate Residual Vector Quantization Applied to Image Subband Coding.",
                    "Adaptive Channel Optimization of Vector Quantized Data.",
                    "Design and Performance of Tree-Structured Vector Quantizers.",
                    "A Mean-Removed Variation of Weighted Universal Vector Quantization for Image Coding.",
                    "Application of AVL Trees to the Adaptive Compression of Numerical Data.",
                    "Tree Compacting Transformations.",
                    "Sort Order Preserving Data Compression for Extended Alphabets.",
                    "Compression of DNA Sequences.",
                    "Fast and Efficient Lossless Image Compression.",
                    "Robust, Variable Bit-rate Coding Using Entropy-Based Codebooks.",
                    "Low Bit Rate Coding of Earth Science Images.",
                    "Algorithms for Fast Vector Quantizaton.",
                    "Multispectral Image Compression Algorithms.",
                    "Real-Time Focal-Plane Image Compression.",
                    "A Low Power Analog CMOS Vector Quantizer.",
                    "An MPEG Encoder Implementation on the Princeton Engine Video Supercomputer."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "2nd DCC 1992",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1992",
                "sub_name": "Proceedings of the IEEE Data Compression Conference, DCC 1992, Snowbird, Utah, USA, March 24-27, 1992.",
                "count": 38,
                "papers": [
                    "Subband Vector Quantization of Images Using Hexagonal Filter Banks.",
                    "Complexity Optimized Vector Quantization: A Neutral Network Approach.",
                    "Nearly Optimal Vecot Quantization via Linear Programming.",
                    "Optical Techniques for Image Compression.",
                    "Textual Image Compression.",
                    "Parallel Algorithms for Optimal Compression Using Dictionaries with the Prefix Property.",
                    "Constructing Word-Based Text Compression Algorithms.",
                    "Coding for Compression in Full-Text Retrieval Systems.",
                    "Model Based Concordance Compression.",
                    "Arithmetic Coding for Memoryless Cost Channels.",
                    "On the Coding Delay of a General Coder.",
                    "On Binary Alphabetical Codes.",
                    "A Comparison of Codebook Generation Techniques for Vector Quantization.",
                    "Vector Quantizer Design by Constrained Global Optimization.",
                    "Perceptually Based Coding of Monochrome and Color Still Images.",
                    "Real Time Implementation of Pruned Tree Search Vector Quantization.",
                    "Transpose Coding on the Systolic Array.",
                    "On the JPEG Model for Lossless Image Compression.",
                    "Progressive Vector Quantization of Multispectral Image Data Using a Massively Parallel SIMD Machine.",
                    "Possible Harmonic-Wavelet Hybrids in Image Compression.",
                    "Multispectral KLT-Wavelet Data Compression for Landsat Thematic Mapper Images.",
                    "Convolutional Interpolative Coding Algorithms.",
                    "A Forward Mapping Realization of the Inverse Discrete Cosine Transform.",
                    "Image Reconstruction for Hybrid Video Coding Systems.",
                    "A Split-Merge Parallel Block-Matching Algorithm for Video Displacement Estimation.",
                    "Lossless Interframe Compression of Medical Images.",
                    "The Use of Fractal Theory in a Video Compression System.",
                    "Error Modeling for Hierarchical Lossless Image Compression.",
                    "Efficient Two-Dimensional Compressed Matching.",
                    "Vector Run-length Coding of Bilevel Images.",
                    "Parallel Lossless Image Compression Using Huffman and Arithmetic Coding.",
                    "Compression of Grey-Scale Fingerprint Images.",
                    "Variable Precision Representation for Efficient VQ Codebook Storage.",
                    "Universal Coding of Band-Limited Sources by Sampling and Dithered Quantization.",
                    "Improving Search for Tree-Structured Vector Quantization.",
                    "An Adaptive High-Speed Lossy Data Compression.",
                    "Experiments Using Minimal-Length Encoding to Solve Machine Learning Problems.",
                    "Random Access in Huffman-Coded Files."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "1st DCC 1991",
        "info": "Snowbird, Utah",
        "venues": [
            {
                "sub_name_abbr": "conf/dcc/1991",
                "sub_name": "Proceedings of the IEEE Data Compression Conference, DCC 1991, Snowbird, Utah, USA, April 8-11, 1991.",
                "count": 44,
                "papers": [
                    "Analysis of Arithmetic Coding for Data Compression.",
                    "Probabilistic and Q-Coder Algorithms for Binary Source Adaption.",
                    "Models for Compression in Full-Text Retrieval Systems.",
                    "Piecewise Arithmetic Coding.",
                    "High Efficiency, Multiplication Free Approximation of Arithmetic Coding.",
                    "An Image Database for Low Bandwidth Communication Links.",
                    "On The Complexity of Optimal Tree Pruning for Source Coding.",
                    "Image Coding by Adaptive Tree-Structured Segmentation.",
                    "Prediction Trees and Lossless Image Compression: An Extended Abstract.",
                    "Image Compression Methods with Distortion Controlled Capabilities.",
                    "Entropy-Constrained Trellis Coded Quantization.",
                    "Combining Vector Quantization and Histogram Equalization.",
                    "Concentric-Shell Partition Vector Quantization with Application to Image Coding.",
                    "Design and Performance of Residual Quantizers.",
                    "An Iteratively Interpolative Vector Quantization Algorithm for Image Data Compression.",
                    "A New Transform Domain Vector Quantization Technique for Image Data Compression in an Asynchronous Transfer Mode Network.",
                    "Restricted Boundary Vector Quantization.",
                    "ω-Orbit Finite Automata for Data Compression.",
                    "A Practical Approach to Fractal-Based Image Compression.",
                    "Data Compression Using Wavelets: Errors, Smoothness, and Quantization.",
                    "A 64 Kb/s Video Codec Using the 2-D Wavelet Transform.",
                    "Fixed Data Base Version of the Lempel-Ziv Data Compression Algorithm.",
                    "Asymptotic Convergence of Dual-Tree Entropy Codes.",
                    "On Compression with Two-Way Head Machines.",
                    "Asymptotics of Predictive Stochastic Complexity.",
                    "On the Optimal Asymptotic Performance of Universal Ordering and Discrimination of Individual Sequences.",
                    "A Typical Behaviour of Some Data Compression Schemes.",
                    "New Methods for Lossless Image Compression Using Arithmetic Coding.",
                    "Inducing Codes from Examples.",
                    "The Cascading of the {LZW} Compression Algorithm with Arithmetic Coding.",
                    "Complexity Aspects of Map Compression.",
                    "An Optimal Algorithm for the Construction of Optimal Prefix Codes with Given Fringe.",
                    "Compression of Natural Images Using Thread-like Visual Primitives.",
                    "Streamlining Context Models for Data Compression.",
                    "Semantic Data Compression.",
                    "Improving LZW.",
                    "A Neural Network Based VLSI Vector Quantizer for Real-Time Image Compression.",
                    "Multibit Decoding/Encoding of Binary Codes Using Memory Based Architectures.",
                    "An Extremely Fast Ziv-Lempel Data Compression Algorithm.",
                    "Practical Evaluation of a Data Compression Algorithm.",
                    "Two-Level Context Based Compression of Binary Images.",
                    "A Better Tree-Structured Vector Quantizer.",
                    "Flexible Compression for Bitmap Sets.",
                    "Compression Experiments with AVHRR Data."
                ]
            }
        ]
    }
]