[
    {
        "name": "DCG",
        "year": "2022",
        "info": "2022: Volumes\n67,",
        "count": 37,
        "papers": [
            "Sufficient Conditions for the Global Rigidity of Periodic Graphs.",
            "On Simple Connectivity of Random 2-Complexes.",
            "More Bisections by Hyperplane Arrangements.",
            "The Covering Radius and a Discrete Surface Area for Non-Hollow Simplices.",
            "Homotopy Theory in Digital Topology.",
            "The Facial Weak Order on Hyperplane Arrangements.",
            "Graded Persistence Diagrams and Persistence Landscapes.",
            "Generating an Equidistributed Net on a Sphere Using Random Rotations.",
            "Farley-Sabalka's Morse-Theory Model and the Higher Topological Complexity of Ordered Configuration Spaces on Trees.",
            "Lattice Size and Generalized Basis Reduction in Dimension Three.",
            "Euclidean Bottleneck Bounded-Degree Spanning Tree Ratios.",
            "Asymptotical Unboundedness of the Heesch Number in ${\\mathbb {E}}^d$ for $d\\rightarrow \\infty $.",
            "A Sharp Threshold Phenomenon in String Graphs.",
            "A Tight Analysis of Geometric Local Search.",
            "Arrangements of Approaching Pseudo-Lines.",
            "Estimating the Reach of a Manifold via its Convexity Defect Function.",
            "The Maximum-Level Vertex in an Arrangement of Lines.",
            "An Algebraic Approach to Projective Uniqueness with an Application to Order Polytopes.",
            "Reconstructing d-Manifold Subcomplexes of Cubes from Their $(\\lfloor d/2 \\rfloor + 1)$-Skeletons.",
            "Short Simplex Paths in Lattice Polytopes.",
            "Polarization Problem on a Higher-Dimensional Sphere for a Simplex.",
            "On the Stability Problem of Equilibrium Discrete Planar Curves.",
            "Threshold Phenomena for Random Cones.",
            "Improvement on the Crossing Number of Crossing-Critical Graphs.",
            "Algebraic k-Sets and Generally Neighborly Embeddings.",
            "Bounds for Polynomials on Algebraic Numbers and Application to Curve Topology.",
            "Subdivision of Maps of Digital Images.",
            "How to Morph a Tree on a Small Grid.",
            "Density of Binary Disc Packings: The Nine Compact Packings.",
            "Continuous and Discrete Radius Functions on Voronoi Tessellations and Delaunay Mosaics.",
            "Computing Shapley Values in the Plane.",
            "Large Equilateral Sets in Subspaces of ℓ ∞ n of Small Codimension.",
            "Correction to: Large Equilateral Sets in Subspaces of ℓ ∞ n of Small Codimension.",
            "Bounds on the Lattice Point Enumerator via Slices and Projections.",
            "Two Remarks on Graph Norms.",
            "On Arithmetic Progressions in Model Sets.",
            "Generalized Dissections and Monsky's Theorem."
        ]
    },
    {
        "name": "DCG",
        "year": "2021",
        "info": "2021: Volumes\n65,\n66",
        "count": 122,
        "papers": [
            "Reconstruction of Convex Bodies from Moments.",
            "The Combinatorial Geometry of Stresses in Frameworks.",
            "Discrete Equidecomposability and Ehrhart Theory of Polygons.",
            "On the Number of Weakly Connected Subdigraphs in Random kNN Digraphs.",
            "A Counterexample to Las Vergnas' Strong Map Conjecture on Realizable Oriented Matroids.",
            "The Geometry of Synchronization Problems and Learning Group Actions.",
            "Equality Case in van der Corput's Inequality and Collisions in Multiple Lattice Tilings.",
            "Cubic Graphs, Their Ehrhart Quasi-Polynomials, and a Scissors Congruence Phenomenon.",
            "Upper Energy Bounds for Spherical Designs of Relatively Small Cardinalities.",
            "Arrangements of Pseudocircles: Triangles and Drawings.",
            "Thom Isotopy Theorem for Nonproper Maps and Computation of Sets of Stratified Generalized Critical Values.",
            "Equivelar Toroids with Few Flag-Orbits.",
            "Persistent Homology and the Upper Box Dimension.",
            "Weighted Lattice Point Sums in Lattice Polytopes, Unifying Dehn-Sommerville and Ehrhart-Macdonald.",
            "The Six Cylinders Problem: $\\mathbb {D}_{3}$-Symmetry Approach.",
            "On the Number of Integer Points in Translated and Expanded Polyhedra.",
            "Blockers for Simple Hamiltonian Paths in Convex Geometric Graphs of Odd Order.",
            "Removing Depth-Order Cycles Among Triangles: An Algorithm Generating Triangular Fragments.",
            "Finding Needles in a Haystack.",
            "A Proof of the Strict Monotone 5-Step Conjecture.",
            "On Extremal Sections of Subspaces of Lp.",
            "Volumes of Generalized Chan-Robbins-Yuen Polytopes.",
            "Semi-regular Tilings of the Hyperbolic Plane.",
            "Quantitative Simplification of Filtered Simplicial Complexes.",
            "A Short Exposition of Salman Parsa's Theorems on Intrinsic Linking and Non-realizability.",
            "Bounds on the Number of 2-Level Polytopes, Cones, and Configurations.",
            "On the Number of Coloured Triangulations of d-Manifolds.",
            "The Equivariant Volumes of the Permutahedron.",
            "A Polynomial Time Algorithm to Compute Geodesics in CAT(0) Cubical Complexes.",
            "Equivalence of Continuous, Local and Infinitesimal Rigidity in Normed Spaces.",
            "On the Carathéodory Number for Strong Convexity.",
            "Topological Complexity of Configuration Spaces of Fully Articulated Graphs and Banana Graphs.",
            "On Monotone Translation-Projection Covariant Minkowski Valuations.",
            "A Concentration Inequality for Random Polytopes, Dirichlet-Voronoi Tiling Numbers and the Geometric Balls and Bins Problem.",
            "Symmetric Non-Negative Forms and Sums of Squares.",
            "Substitutive Structure of Jeandel-Rao Aperiodic Tilings.",
            "Fast Approximation and Exact Computation of Negative Curvature Parameters of Graphs.",
            "Property Testing and Expansion in Cubical Complexes.",
            "Tverberg-Type Theorems with Altered Intersection Patterns (Nerves).",
            "Lattices of Finite Abelian Groups.",
            "On Recovery Guarantees for One-Bit Compressed Sensing on Manifolds.",
            "Every Collinear Set in a Planar Graph is Free.",
            "On a Relation Between Packing and Covering Densities of Convex Bodies.",
            "Combinatorial Modifications of Reeb Graphs and the Realization Problem.",
            "On the Number of Monochromatic Lines in $\\pmb {\\mathbb {R}}^d$.",
            "Enumeration of Lattice Polytopes by Their Volume.",
            "The Colin de Verdière Number and Joins of Graphs.",
            "Union of Hypercubes and 3D Minkowski Sums with Random Sizes.",
            "Sheaf-Theoretic Stratification Learning from Geometric and Topological Perspectives.",
            "Separation by Convex Pseudo-Circles.",
            "On Grids in Point-Line Arrangements in the Plane.",
            "Computing the Fréchet Gap Distance.",
            "Polytopal Bier Spheres and Kantorovich-Rubinstein Polytopes of Weighted Cycles.",
            "Compact Packings of Space with Two Sizes of Spheres.",
            "The Multi-Cover Persistence of Euclidean Balls.",
            "Computing Min-Convex Hulls in the Affine Building of $\\hbox {SL}_d$.",
            "Conflict-Free Coloring of String Graphs.",
            "Simplifying Triangulations.",
            "Taking a Detour; or, Gioan's Theorem, and Pseudolinear Drawings of Complete Graphs.",
            "Fractal Dimension and Lower Bounds for Geometric Problems.",
            "On Sets Defining Few Ordinary Solids.",
            "On the Stability of Interval Decomposable Persistence Modules.",
            "A New Approach to the Minkowski First Mixed Volume and the LYZ Conjecture.",
            "Extremal Cylinder Configurations I: Configuration $C_{\\mathfrak {m}}$.",
            "Classification of Triples of Lattice Polytopes with a Given Mixed Volume.",
            "On the Bi-Lipschitz Geometry of Lamplighter Graphs.",
            "Randomized Incremental Construction of Delaunay Triangulations of Nice Point Sets.",
            "Unit Distance Graphs and Algebraic Integers.",
            "Approximate Carathéodory's Theorem in Uniformly Smooth Banach Spaces.",
            "A Turán-Type Theorem for Large-Distance Graphs in Euclidean Spaces, and Related Isodiametric Problems.",
            "Unavoidable Minors for Graphs with Large ℓ p-Dimension.",
            "Graph Reconstruction from Unlabeled Edge Lengths.",
            "Triangulating Submanifolds: An Elementary and Quantified Version of Whitney's Method.",
            "Linking Numbers in Three-Manifolds.",
            "Binomial Inequalities for Chromatic, Flow, and Tension Polynomials.",
            "Quasi-Regular Polytopes of Full Rank.",
            "Fitting Tractable Convex Sets to Support Function Evaluations.",
            "New Expander Bounds from Affine Group Energy.",
            "Centroaffine Duality for Spatial Polygons.",
            "On Visibility Problems with an Infinite Discrete Set of Obstacles.",
            "Compact Packings of the Plane with Three Sizes of Discs.",
            "z-Knotted Triangulations of Surfaces.",
            "No More Than 2d+1-2 Nearly Neighbourly Simplices in ${\\mathbb {R}}^d$.",
            "Local Conditions for Triangulating Submanifolds of Euclidean Space.",
            "Randomized Construction of Complexes with Large Diameter.",
            "The h*-Polynomials of Locally Anti-Blocking Lattice Polytopes and Their γ-Positivity.",
            "Counting Integer Points of Flow Polytopes.",
            "A Fast Shortest Path Algorithm on Terrain-like Graphs.",
            "On the Falk Invariant of Shi and Linial Arrangements.",
            "Smallest k-Enclosing Rectangle Revisited.",
            "Shellings from Relative Shellings, with an Application to NP-Completeness.",
            "An Upper Bound on Pachner Moves Relating Geometric Triangulations.",
            "Spatiotemporal Persistent Homology for Dynamic Metric Spaces.",
            "Tilings of Convex Polyhedral Cones and Topological Properties of Self-Affine Tiles.",
            "Recursive Scheme for Angles of Random Simplices, and Applications to Random Polytopes.",
            "On Mutually Diagonal Nets on (Confocal) Quadrics and 3-Dimensional Webs.",
            "SL(n) Contravariant Lp Harmonic Valuations on Polytopes.",
            "On the Regularity Radius of Delone Sets in ${\\mathbb {R}}^3$.",
            "Chiral Polyhedra in 3-Dimensional Geometries and from a Petrie-Coxeter Construction.",
            "Regular Polygonal Partitions of a Tverberg Type.",
            "Random Geometric Complexes and Graphs on Riemannian Manifolds in the Thermodynamic Limit.",
            "On the Lattice Hadwiger Number of Superballs and Some Other Bodies.",
            "Biangular Lines Revisited.",
            "On the Number of Perfect Triangles with a Fixed Angle.",
            "Balanced Convex Partitions of Lines in the Plane.",
            "Existence of Well-Centered Simplicial Face-to-Face Tiling of Five-Dimensional Space.",
            "Perimeter Approximation of Convex Discs in the Hyperbolic Plane and on the Sphere.",
            "Vanishing of All Equivariant Obstructions and the Mapping Degree.",
            "Correction to: The Schläfli Fan.",
            "Spherical Cap Discrepancy of the Diamond Ensemble.",
            "Irregular Tilings of Regular Polygons with Similar Triangles.",
            "Packing Disks by Flipping and Flowing.",
            "Flexible Placements of Periodic Graphs in the Plane.",
            "The Typical Cell of a Voronoi Tessellation on the Sphere.",
            "The VC Dimension of Metric Balls under Fréchet and Hausdorff Distances.",
            "Nets of Lines with the Combinatorics of the Square Grid and with Touching Inscribed Conics.",
            "Approximating Maximum Diameter-Bounded Subgraph in Unit Disk Graphs.",
            "Number of Directions Determined by a Set in $\\mathbb {F}_{q}^{2}$ and Growth in $\\mathrm {Aff}(\\mathbb {F}_{q})$.",
            "Octahedralizing 3-Colorable 3-Polytopes.",
            "Classification of Vertex-Transitive Zonotopes.",
            "Random Surfaces with Boundary.",
            "Counterexample to a Variant of a Conjecture of Ziegler Concerning a Simple Polytope and Its Dual."
        ]
    },
    {
        "name": "DCG",
        "year": "2020",
        "info": "2020: Volumes\n63,\n64",
        "count": 97,
        "papers": [
            "Flip-Connectivity of Triangulations of the Product of a Tetrahedron and Simplex.",
            "Estimates of Covering Type and the Number of Vertices of Minimal Triangulations.",
            "Bounds for Totally Separable Translative Packings in the Plane.",
            "Reconstructing Plane Quartics from Their Invariants.",
            "On Planar Greedy Drawings of 3-Connected Planar Graphs.",
            "The Dimension of Valid Distance Drawings of Signed Graphs.",
            "Tilings of Convex Sets by Mutually Incongruent Equilateral Triangles Contain Arbitrarily Small Tiles.",
            "Locally Optimal 2-Periodic Sphere Packings.",
            "Cube is a Strict Local Maximizer for the Illumination Number.",
            "On the Number of Flats Tangent to Convex Hypersurfaces in Random Position.",
            "Decomposition of Exact pfd Persistence Bimodules.",
            "Double-Distance Frameworks and Mixed Sparsity Graphs.",
            "Impossibility of Dimension Reduction in the Nuclear Norm.",
            "Convergence of Discrete Exterior Calculus Approximations for Poisson Problems.",
            "On Tope Graphs of Complexes of Oriented Matroids.",
            "Voronoi Diagrams for a Moderate-Sized Point-Set in a Simple Polygon.",
            "On the Volume of the John-Löwner Ellipsoid.",
            "Near-Linear Algorithms for Geometric Hitting Sets and Set Covers.",
            "Minimum Perimeter-Sum Partitions in the Plane.",
            "Tropical Spectrahedra.",
            "The Cylinder of a Relation and Generalized Versions of the Nerve Theorem.",
            "On Coset Leader Graphs of Structured Linear Codes.",
            "On the Structure of Ammann A2 Tilings.",
            "Strong Discrete Morse Theory and Simplicial L-S Category: A Discrete Version of the Lusternik-Schnirelmann Theorem.",
            "Multi-Nets. Classification of Discrete and Smooth Surfaces with Characteristic Properties on Arbitrary Parameter Rectangles.",
            "Orthogonal Groups in Characteristic 2 Acting on Polytopes of High Rank.",
            "Discretizations of Surfaces with Constant Ratio of Principal Curvatures.",
            "On Separating Points by Lines.",
            "Optimal Line Packings from Nonabelian Groups.",
            "Guest Editors' Foreword.",
            "Capacitated Covering Problems in Geometric Spaces.",
            "Tree Drawings Revisited.",
            "From a (p, 2)-Theorem to a Tight (p, q)-Theorem.",
            "Further Consequences of the Colorful Helly Hypothesis.",
            "Near-Optimal Coresets of Kernel Density Estimates.",
            "Almost All String Graphs are Intersection Graphs of Plane Convex Sets.",
            "A Crossing Lemma for Multigraphs.",
            "Simple Realizability of Complete Abstract Topological Graphs Simplified.",
            "Admissible Complexes for the Projective X-ray Transform over a Finite Field.",
            "Rounding Meshes in 3D.",
            "Ideal Hyperbolic Polyhedra and Discrete Uniformization.",
            "Decomposing Arrangements of Hyperplanes: VC-Dimension, Combinatorial Dimension, and Point Location.",
            "Characterizing Face and Flag Vector Pairs for Polytopes.",
            "Polytopes Close to Being Simple.",
            "The Chromatic Number of the Plane is At Least 5: A New Proof.",
            "Correction to: On the Links of Vertices in Simplicial d-Complexes Embeddable in the Euclidean 2d-Space.",
            "Guest Editors' Foreword.",
            "Theorems of Carathéodory, Helly, and Tverberg Without Dimension.",
            "Treetopes and Their Graphs.",
            "On Polyatomic Tomography over Abelian Groups: Some Remarks on Consistency, Tree Packings and Complexity.",
            "Intersection Patterns of Planar Sets.",
            "Ordered and Convex Geometric Trees with Linear Extremal Function.",
            "On Regular Polytopes of 2-Power Order.",
            "Complexity Yardsticks for f-Vectors of Polytopes and Spheres.",
            "The Schläfli Fan.",
            "A One-Page Solution of a Problem of Erdős and Purdy.",
            "Embeddability of Arrangements of Pseudocircles and Graphs on Surfaces.",
            "Triangulations and a Discrete Brunn-Minkowski Inequality in the Plane.",
            "Unconditional Reflexive Polytopes.",
            "The Assembly Problem for Alternating Semiregular Polytopes.",
            "Pairing Symmetries for Euclidean and Spherical Frameworks.",
            "An Exploration of Locally Spherical Regular Hypertopes.",
            "Plus Minus Analogues for Affine Tverberg Type Results.",
            "Chiral Astral Realizations of Cyclic 3-Configurations.",
            "Richard Pollack, 1935-2018.",
            "In The Beginning...",
            "A Farewell to Ricky Pollack.",
            "Geometric Multicut: Shortest Fences for Separating Groups of Objects in the Plane.",
            "Barycentric Subdivisions of Convex Complexes are Collapsible.",
            "Eliminating Depth Cycles Among Triangles in Three Dimensions.",
            "Orthonormal Representations of H-Free Graphs.",
            "Pseudo-Edge Unfoldings of Convex Polyhedra.",
            "Efficient Packings of Unit Squares in a Large Square.",
            "Random Sampling with Removal.",
            "The Isostatic Conjecture.",
            "Tri-partitions and Bases of an Ordered Complex.",
            "Arrangements of Pseudocircles: On Circularizability.",
            "Cages of Small Length Holding Convex Bodies.",
            "Dynamic Planar Voronoi Diagrams for General Distance Functions and Their Algorithmic Applications.",
            "On Sets of n Points in General Position That Determine Lines That Can Be Pierced by n Points.",
            "Conflict-Free Coloring of Intersection Graphs of Geometric Objects.",
            "Coloring Intersection Hypergraphs of Pseudo-Disks.",
            "Dense Point Sets with Many Halving Lines.",
            "Rational Points of Some Elliptic Curves Related to the Tilings of the Equilateral Triangle.",
            "Bisectors and Pinned Distances.",
            "The Graphs Behind Reuleaux Polyhedra.",
            "Local Spectral Expansion Approach to High Dimensional Expanders Part II: Mixing and Geometrical Overlapping.",
            "From Crossing-Free Graphs on Wheel Sets to Embracing Simplices and Polytopes with Few Vertices.",
            "Constructing Planar Support for Non-Piercing Regions.",
            "Guest Editors' Foreword.",
            "On Weak ε-Nets and the Radon Number.",
            "Near-Optimal Algorithms for Shortest Paths in Weighted Unit-Disk Graphs.",
            "A Spanner for the Day After.",
            "Ham-Sandwich Cuts and Center Transversals in Subspaces.",
            "Counting Polygon Triangulations is Hard.",
            "Dynamic Geometric Data Structures via Shallow Cuttings.",
            "Topologically Trivial Closed Walks in Directed Surface Graphs."
        ]
    },
    {
        "name": "DCG",
        "year": "2019",
        "info": "2019: Volumes\n61,\n62",
        "count": 80,
        "papers": [
            "Enumerative Combinatorics of Simplicial and Cell Complexes: Kirchhoff and Trent Type Theorems.",
            "Polynomial-Sized Topological Approximations Using the Permutahedron.",
            "Equiangular Subspaces in Euclidean Spaces.",
            "Analyzing the Squared Distance-to-Measure Gradient Flow System with k-Order Voronoi Diagrams.",
            "A Remark on a Construction of D.S. Asche.",
            "Spherical 2-Designs and Lattices from Abelian Groups.",
            "Geometry of Log-Concave Density Estimation.",
            "Morphing Schnyder Drawings of Planar Triangulations.",
            "Vertex-Weighted Graphs and Freeness of ψ-Graphical Arrangements.",
            "Ultracontractivity and Functional Inequalities on Infinite Graphs.",
            "Acute Sets.",
            "Lines in Euclidean Ramsey Theory.",
            "Irrational Triangles with Polynomial Ehrhart Functions.",
            "On Open and Closed Convex Codes.",
            "New Results on Tripod Packings.",
            "On the Reconstruction of Polytopes.",
            "Maximum Likelihood Threshold and Generic Completion Rank of Graphs.",
            "Covering Lattice Points by Subspaces and Counting Point-Hyperplane Incidences.",
            "Convex Equipartitions of Colored Point Sets.",
            "Local h-Vectors of Quasi-Geometric and Barycentric Subdivisions.",
            "On Rigidity and Convergence of Circle Patterns.",
            "Mobile versus Point Guards.",
            "Hardness of almost embedding simplicial complexes in Rd.",
            "Dual-Antiprisms and Partitions of Powers of 2 into Powers of 2.",
            "Harmonic Dirichlet Functions on Planar Graphs.",
            "Geometric Realizations of the Accordion Complex of a Dissection.",
            "A Lower Bound Theorem for Centrally Symmetric Simplicial Polytopes.",
            "Split Packing: Algorithms for Packing Circles with Optimal Worst-Case Density.",
            "(δ, ε)-Ball Approximation of a Shape: Definition and Complexity.",
            "Corona Limits of Tilings: Periodic Case.",
            "Euclidean Distance Matrices and Separations in Communication Complexity Theory.",
            "Multi-splits and Tropical Linear Spaces from Nested Matroids.",
            "Approximating a Convex Body by a Polytope Using the Epsilon-Net Theorem.",
            "Guest Editors' Foreword.",
            "Subquadratic Algorithms for Algebraic 3SUM.",
            "A Nearly Quadratic Bound for Point-Location in Hyperplane Arrangements, in the Linear Decision Tree Model.",
            "Shallow Packings, Semialgebraic Set Systems, Macbeath Regions, and Polynomial Partitioning.",
            "On the Number of Ordinary Lines Determined by Sets in Complex Space.",
            "Erdős-Hajnal Conjecture for Graphs with Bounded VC-Dimension.",
            "Coloring Curves that Cross a Fixed Curve.",
            "Barcodes of Towers and a Streaming Algorithm for Persistent Homology.",
            "A Proof of the Orbit Conjecture for Flipping Edge-Labelled Triangulations.",
            "Orthogonal Range Searching in Moderate Dimensions: k-d Trees and Range Trees Strike Back.",
            "Unconstrained and Curvature-Constrained Shortest-Path Distances and Their Approximation.",
            "Optimising the Topological Information of the A∞-Persistence Groups.",
            "Unmixing the Mixed Volume Computation.",
            "Homology of Multi-Parameter Random Simplicial Complexes.",
            "On Flow Polytopes, Order Polytopes, and Certain Faces of the Alternating Sign Matrix Polytope.",
            "Asymptotic Measures and Links in Simplicial Complexes.",
            "Refined Descendant Invariants of Toric Surfaces.",
            "The Diameter and Automorphism Group of Gelfand-Tsetlin Polytopes.",
            "Correction to: Acute Sets of Exponentially Optimal Size.",
            "A General Framework for Tilings, Delone Sets, Functions, and Measures and Their Interrelation.",
            "Complements of Unbounded Convex Polyhedra as Polynomial Images of \\({{\\mathbb {R}}}^n\\).",
            "A 15-Vertex Triangulation of the Quaternionic Projective Plane.",
            "Quickest Visibility Queries in Polygonal Domains.",
            "Small Simplicial Complexes with Prescribed Torsion in Homology.",
            "Graphs with Flexible Labelings.",
            "Lower Bounds for the Measurable Chromatic Number of the Hyperbolic Plane.",
            "On the Density of Sets Avoiding Parallelohedron Distance 1.",
            "Bicriteria Rectilinear Shortest Paths Among Rectilinear Obstacles in the Plane.",
            "Polytopes of Maximal Volume Product.",
            "Lines on Smooth Polarized K3-Surfaces.",
            "Weighted 1 × 1 Cut-and-Project Sets in Bounded Distance to a Lattice.",
            "Z2 -Indices and Hedetniemi's Conjecture.",
            "Proper Coloring of Geometric Hypergraphs.",
            "An Asymptotically Improved Upper Bound on the Diameter of Polyhedra.",
            "Implicit Manifold Reconstruction.",
            "L1 Geodesic Farthest Neighbors in a Simple Polygon and Related Problems.",
            "Acute Sets of Exponentially Optimal Size.",
            "Covering a Ball by Smaller Balls.",
            "On the Multiplicity of Isolated Roots of Sparse Polynomial Systems.",
            "Random Steiner systems and bounded degree coboundary expanders of every dimension.",
            "A Geometric Perspective on the MSTD Question.",
            "On Recognizing Shapes of Polytopes from Their Shadows.",
            "Poisson-Delaunay Mosaics of Order k.",
            "Finding, Hitting and Packing Cycles in Subexponential Time on Unit Disk Graphs.",
            "Configuration Spaces of Graphs with Certain Permitted Collisions.",
            "On the Structural Theorem of Persistent Homology.",
            "Correction to: Metric Properties of Semialgebraic Mappings."
        ]
    },
    {
        "name": "DCG",
        "year": "2018",
        "info": "2018: Volumes\n59,\n60",
        "count": 83,
        "papers": [
            "The Genus of Curve, Pants and Flip Graphs.",
            "String-Node Nets and Meshes.",
            "On Sets Defining Few Ordinary Circles.",
            "Incidences Between Points and Lines on Two- and Three-Dimensional Varieties.",
            "Integral Homology of Random Simplicial Complexes.",
            "Drawing Graphs Using a Small Number of Obstacles.",
            "Random Approximation of Convex Bodies: Monotonicity of the Volumes of Random Tetrahedra.",
            "Multiscale Projective Coordinates via Persistent Cohomology of Sparse Filtrations.",
            "An Obstruction to Delaunay Triangulations in Riemannian Manifolds.",
            "New Construction of Graphs with High Chromatic Number and Small Clique Number.",
            "Collapsibility to a Subcomplex of a Given Dimension is NP-Complete.",
            "On the Computation of Zone and Double Zone Diagrams.",
            "Local Spectral Expansion Approach to High Dimensional Expanders Part I: Descent of Spectral Gaps.",
            "Graphs in the 3-Sphere with Maximum Symmetry.",
            "Zigzag Structure of Thin Chamber Complexes.",
            "2-Complexes with Large 2-Girth.",
            "Exact Simultaneous Recovery of Locations and Structure from Known Orientations and Corrupted Point Correspondences.",
            "Any Finite Group is the Group of Some Binary, Convex Polytope.",
            "Point Sets with Small Integer Coordinates and No Large Convex Polygons.",
            "An Improvement on the Rado Bound for the Centerline Depth.",
            "Tropical Effective Primary and Dual Nullstellensätze.",
            "Multi-degree Bounds on the Betti Numbers of Real Varieties and Semi-algebraic Sets and Applications.",
            "Extension Complexity and Realization Spaces of Hypersimplices.",
            "On a Recursive Construction of Circular Paths and the Search for π on the Integer Lattice Z2.",
            "On the Links of Vertices in Simplicial d-Complexes Embeddable in the Euclidean 2d-Space.",
            "Shellability and Sphericity of Finite Quasi-arc Complexes.",
            "Two New Weighted Erdős-Mordell Type Inequalities.",
            "Almost Tight Bounds for Eliminating Depth Cycles in Three Dimensions.",
            "On the Number of Maximum Empty Boxes Amidst n Points.",
            "Sampling from a Log-Concave Distribution with Projected Langevin Monte Carlo.",
            "The Central Set and Its Application to the Kneser-Poulsen Conjecture.",
            "An Isoperimetric Inequality for Planar Triangulations.",
            "A Zonotope and a Product of Two Simplices with Disconnected Flip Graphs.",
            "Loops in Reeb Graphs of n-Manifolds.",
            "Plane Bichromatic Trees of Low Degree.",
            "Order on Order Types.",
            "Stability and Minimax Optimality of Tangential Delaunay Complexes for Manifold Reconstruction.",
            "Construction and Shape Optimization of Simplicial Meshes in d-Dimensional Space.",
            "Central Limit Theorem for the Volume of Random Polytopes with Vertices on the Boundary.",
            "On the Circle Covering Theorem by A.W. Goodman and R.E. Goodman.",
            "Blockers for Simple Hamiltonian Paths in Convex Geometric Graphs of Even Order.",
            "Ma-Schlenker c-Octahedra in the 2-Sphere.",
            "Primitive Zonotopes.",
            "Well-Distributed Great Circles on S2.",
            "On Forbidden Induced Subgraphs for Unit Disk Graphs.",
            "Simion's Type B Associahedron is a Pulling Triangulation of the Legendre Polytope.",
            "On the Reverse Loomis-Whitney Inequality.",
            "Lattice Points in Algebraic Cross-polytopes and Simplices.",
            "Reptilings and space-filling curves for acute triangles.",
            "Expected Length of the Voronoi Path in a High Dimensional Poisson-Delaunay Triangulation.",
            "On Sets Defining Few Ordinary Planes.",
            "Geometric Classification of Real Ternary Octahedral Quartics.",
            "A Solution of the Erdős-Ulam Problem on Rational Distance Sets Assuming the Bombieri-Lang Conjecture.",
            "Complex Spherical Codes with Three Inner Products.",
            "Multihomogeneous Nonnegative Polynomials and Sums of Squares.",
            "Embedding-Preserving Rectangle Visibility Representations of Nonplanar Graphs.",
            "On the Reconstruction Problem for Pascal Lines.",
            "A Center Transversal Theorem for an Improved Rado Depth.",
            "Pach's Selection Theorem Does Not Admit a Topological Extension.",
            "Small Universal Point Sets for k-Outerplanar Graphs.",
            "Packing and Covering with Non-Piercing Regions.",
            "Minimising the Sum of Projections of a Finite Set.",
            "Simplicial Faces of the Set of Correlation Matrices.",
            "The Rigidity of Infinite Graphs.",
            "On the Circuit Diameter Conjecture.",
            "Tverberg Plus Minus.",
            "Fast Binary Embeddings with Gaussian Circulant Matrices: Improved Bounds.",
            "Computing Tropical Points and Tropical Links.",
            "Moments of the Maximal Number of Empty Simplices of a Random Point Set.",
            "Limit Theorems for Random Cubical Homology.",
            "On Face Numbers of Flag Simplicial Complexes.",
            "On Lattice Path Matroid Polytopes: Integer Points and Ehrhart Polynomial.",
            "Computational Aspects of the Colorful Carathéodory Theorem.",
            "Enumeration of Lattice 3-Polytopes by Their Number of Lattice Points.",
            "Hunting for Reduced Polytopes.",
            "John Ellipsoid and the Center of Mass of a Convex Body.",
            "Infinitesimal Conformal Deformations of Triangulated Surfaces in Space.",
            "Discrete Cycloids from Convex Symmetric Polygons.",
            "Berline-Vergne Valuation and Generalized Permutohedra.",
            "Rigidity and Volume Preserving Deformation on Degenerate Simplices.",
            "On the Approximation of Convex Bodies by Ellipses with Respect to the Symmetric Difference Metric.",
            "The Kneser-Poulsen Conjecture for Special Contractions.",
            "Geometrical Models for a Class of Reducible Pisot Substitutions."
        ]
    },
    {
        "name": "DCG",
        "year": "2017",
        "info": "2017: Volumes\n57,\n58",
        "count": 87,
        "papers": [
            "Decidability of the Extension Problem for Maps into Odd-Dimensional Spheres.",
            "The Realizability of Curves in a Tropical Plane.",
            "Tverberg Partitions of Points on the Moment Curve.",
            "Semidefinite Approximations of Conical Hulls of Measured Sets.",
            "The Number of Holes in the Union of Translates of a Convex Set in Three Dimensions.",
            "Vertex-Transitive Polyhedra of Higher Genus, I.",
            "Stability Inequalities for Projections of Convex Bodies.",
            "Recognition and Complexity of Point Visibility Graphs.",
            "On the Beer Index of Convexity and Its Variants.",
            "On the Combinatorics of Demoulin Transforms and (Discrete) Projective Minimal Surfaces.",
            "Inverse Littlewood-Offord Problems for Quasi-norms.",
            "Straight Line Triangle Representations.",
            "Universal Rigidity of Complete Bipartite Graphs.",
            "Quasiconformal Dilatation of Projective Transformations and Discrete Conformal Maps.",
            "Quantitative Combinatorial Geometry for Continuous Parameters.",
            "Generating Maps on Surfaces.",
            "Invariant Measure of Rotational Beta Expansion and Tarski's Plank Problem.",
            "New Error Measures and Methods for Realizing Protein Graphs from Distance Data.",
            "Diameter Bounded Equal Measure Partitions of Ahlfors Regular Metric Measure Spaces.",
            "Discrete Uniformization of Polyhedral Surfaces with Non-positive Curvature and Branched Covers over the Sphere via Hyper-ideal Circle Patterns.",
            "Bounds on the Number of Connected Components for Tropical Prevarieties.",
            "Quantitative Helly-Type Theorem for the Diameter of Convex Sets.",
            "Encoding Toroidal Triangulations.",
            "Voronoi-Based Estimation of Minkowski Tensors from Finite Point Samples.",
            "SL(n) Invariant Valuations on Polytopes.",
            "Unique Determination of Convex Lattice Sets.",
            "Box Representations of Embedded Graphs.",
            "Limits of Local Search: Quality and Efficiency.",
            "ε -Mnets: Hitting Geometric Set Systems with Subsets.",
            "What Happens to a Manifold Under a Bi-Lipschitz Map?",
            "Computing the L1 Geodesic Diameter and Center of a Polygonal Domain.",
            "Incidences Between Points and Lines in $${\\mathbb {R}}^4$$.",
            "Smaller Extended Formulations for the Spanning Tree Polytope of Bounded-Genus Graphs.",
            "Covering the Sphere with Equal Circles.",
            "Embedding Stacked Polytopes on a Polynomial-Size Grid.",
            "The Threshold for Integer Homology in Random d-Complexes.",
            "Extremal Examples of Collapsible Complexes and Random Discrete Morse Theory.",
            "Computational Aspects of the Gromov-Hausdorff Distance and its Application in Non-rigid Shape Matching.",
            "Regular Maps of High Density.",
            "Generic Power Sum Decompositions and Bounds for the Waring Rank.",
            "Algorithmic Solvability of the Lifting-Extension Problem.",
            "Antiprismlessness, or: Reducing Combinatorial Equivalence to Projective Equivalence in Realizability Problems for Polytopes.",
            "Packing and Covering with Balls on Busemann Surfaces.",
            "Realization Spaces of Arrangements of Convex Bodies.",
            "Generalization of Haberdasher's Puzzle.",
            "Carathéodory's Theorem in Depth.",
            "Hyperbolicity vs. Amenability for Planar Graphs.",
            "Iterating Evolutes and Involutes.",
            "A Simplicial Complex is Uniquely Determined by Its Set of Discrete Morse Functions.",
            "Tropical Approach to Nagata's Conjecture in Positive Characteristic.",
            "Four Soviets Walk the Dog: Improved Bounds for Computing the Fréchet Distance.",
            "Connectivity and Wv -Paths in Polyhedral Maps on Surfaces.",
            "Curves in R4 and Two-Rich Points.",
            "An Elementary Exposition of Topological Overlap in the Plane.",
            "Universal Completability, Least Eigenvalue Frameworks, and Vector Colorings.",
            "An Algorithm for Canonical Forms of Finite Subsets of Zd up to Affinities.",
            "Computing the Flip Distance Between Triangulations.",
            "3-Regular Colored Graphs and Classification of Surfaces.",
            "Characterization of Circuits Supporting Polynomial Systems with the Maximal Number of Positive Solutions.",
            "Intrinsic Volumes of Polyhedral Cones: A Combinatorial Perspective.",
            "On the Bounds of Conway's Thrackles.",
            "Inclusion-Exclusion Principles for Convex Hulls and the Euler Relation.",
            "Quantitative Tverberg Theorems Over Lattices and Other Discrete Sets.",
            "New Upper Bounds for the Density of Translative Packings of Three-Dimensional Convex Bodies with Tetrahedral Symmetry.",
            "Upper and Lower Bounds for Online Routing on Delaunay Triangulations.",
            "Trapezoidal Diagrams, Upward Triangulations, and Prime Catalan Numbers.",
            "On Homotopy Types of Euclidean Rips Complexes.",
            "Euclidean Greedy Drawings of Trees.",
            "Some Conditionally Hard Problems on Links and 3-Manifolds.",
            "A Minkowski Theorem for Quasicrystals.",
            "Packings of Equal Disks in a Square Torus.",
            "The Maximum Diameter of Pure Simplicial Complexes and Pseudo-manifolds.",
            "Edge-Covers in d-Interval Hypergraphs.",
            "On Densities of Lattice Arrangements Intersecting Every i-Dimensional Affine Subspace.",
            "Complexity of Tiling a Polygon with Trominoes or Bars.",
            "Nearest-Neighbor Searching Under Uncertainty I.",
            "A Note on the Tolerant Tverberg Theorem.",
            "Guest Editors' Foreword.",
            "Coloring Points with Respect to Squares.",
            "Recognizing Weakly Simple Polygons.",
            "Incremental Voronoi Diagrams.",
            "On the Combinatorial Complexity of Approximating Polytopes.",
            "Finding Non-orientable Surfaces in 3-Manifolds.",
            "Untangling Planar Curves.",
            "Shortest Path Embeddings of Graphs on Surfaces.",
            "Avoiding the Global Sort: A Faster Contour Tree Algorithm.",
            "Configurations of Lines in Space and Combinatorial Rigidity."
        ]
    },
    {
        "name": "DCG",
        "year": "2016",
        "info": "2016: Volumes\n55,\n56",
        "count": 83,
        "papers": [
            "Optimal Packings of Congruent Circles on a Square Flat Torus.",
            "Recognition of Collapsible Complexes is NP-Complete.",
            "How to Walk Your Dog in the Mountains with No Magic Leash.",
            "Geometric Realizations and Duality for Dahmen-Micchelli Modules and De Concini-Procesi-Vergne Modules.",
            "Persistence Modules on Commutative Ladders of Finite Type.",
            "Polynomial Partitioning on Varieties of Codimension Two and Point-Hypersurface Incidences in Four Dimensions.",
            "On the Complexity of the Set of Unconditional Convex Bodies.",
            "Cayley Factorization and the Area Principle.",
            "On the Multiple Packing Densities of Triangles.",
            "Proof of a Conjecture of Bárány, Katchalski and Pach.",
            "The Filling Problem in the Cube.",
            "Discrete Optimal Transport: Complexity, Geometry and Applications.",
            "A tk Inequality for Arrangements of Pseudolines.",
            "Two-Orbit Convex Polytopes and Tilings.",
            "Gain-Sparsity and Symmetry-Forced Rigidity in the Plane.",
            "Combining Persistent Homology and Invariance Groups for Shape Comparison.",
            "How to Guard Orthogonal Polygons: Diagonal Graphs and Vertex Covers.",
            "The Edit Distance for Reeb Graphs of Surfaces.",
            "Gap Probabilities and Betti Numbers of a Random Intersection of Quadrics.",
            "About f-Vectors of Inscribed Simplicial Polytopes.",
            "Configurations of Non-crossing Rays and Related Problems.",
            "Interlacement of Double Curves of Immersed Spheres.",
            "Generalizations of the Szemerédi-Trotter Theorem.",
            "Fractional and j-Fold Coloring of the Plane.",
            "Reconstruction of the Geometric Structure of a Set of Points in the Plane from Its Geometric Tree Graph.",
            "On the Densest Packing of Polycylinders in Any Dimension.",
            "Better Bounds for Planar Sets Avoiding Unit Distances.",
            "Combinatorially Two-Orbit Convex Polytopes.",
            "On the Diameter of Lattice Polytopes.",
            "Polycyclic Movable 4-Configurations are Plentiful.",
            "On the Odd Area of Planar Sets.",
            "Packing Convex Bodies by Cylinders.",
            "A Simple Proof of the Shallow Packing Lemma.",
            "Thirtieth Anniversary Note from the Editors in Chief.",
            "The Maximum Number of Faces of the Minkowski Sum of Two Convex Polytopes.",
            "Metric Properties of Semialgebraic Mappings.",
            "Apollonian Ball Packings and Stacked Polytopes.",
            "Delaunay Triangulations of Closed Euclidean d-Orbifolds.",
            "Categorified Reeb Graphs.",
            "Irrational Mixed Decomposition and Sharp Fewnomial Bounds for Tropical Polynomial Systems.",
            "Realising Equivelar Toroids of Type {4, 4}.",
            "On the Number of Rich Lines in High Dimensional Real Vector Spaces.",
            "Erdős-Szekeres Without Induction.",
            "Sub Rosa, A System of Quasiperiodic Rhombic Substitution Tilings with n-Fold Rotational Symmetry.",
            "Quadrilateral Meshes for PSLGs.",
            "Nonobtuse Triangulations of PSLGs.",
            "Intrinsic Volumes of Random Cubical Complexes.",
            "A Mihalisin-Klee Theorem for Fans.",
            "On Computability and Triviality of Well Groups.",
            "An Improved Upper Bound for the Erdős-Szekeres Conjecture.",
            "Quantum Jumps of Normal Polytopes.",
            "Homometry and Direct-Sum Decompositions of Lattice-Convex Sets.",
            "Nerve Complexes of Circular Arcs.",
            "Invariants of Random Knots and Links.",
            "Computing the Fréchet Distance with a Retractable Leash.",
            "Bisector Energy and Few Distinct Distances.",
            "Space Exploration via Proximity Search.",
            "Fast Domino Tileability.",
            "Random Conical Tessellations.",
            "Lines, Betweenness and Metric Spaces.",
            "The Local Optimality of the Double Lattice Packing.",
            "A 2× Lax Representation, Associated Family, and Bäcklund Transformation for Circular K-Nets.",
            "Correction to Our Article \"Topology of Random 2-Complexes\" Published in DCG 47 (2012), pp. 117-149.",
            "Tangent Estimation from Point Samples.",
            "Strong Isoperimetric Inequalities and Combinatorial Curvatures on Multiply Connected Planar Graphs.",
            "Injective Convex Polyhedra.",
            "From Proximity to Utility: A Voronoi Partition of Pareto Optima.",
            "Wythoffian Skeletal Polyhedra in Ordinary Space, I.",
            "Lattice Embeddings of Planar Point Sets.",
            "The number of double-normals in space.",
            "Polytopes of Eigensteps of Finite Equal Norm Tight Frames.",
            "Straight Skeletons and Mitered Offsets of Nonconvex Polytopes.",
            "On Non-separable Families of Positive Homothetic Convex Bodies.",
            "Turán Type Results for Distance Graphs.",
            "Guest Editors' Foreword.",
            "A Linear-Time Algorithm for the Geodesic Center of a Simple Polygon.",
            "A Simpler Linear-Time Algorithm for Intersecting Two Convex Polyhedra in Three Dimensions.",
            "Optimal Deterministic Algorithms for 2-d and 3-d Shallow Cuttings.",
            "On the Shadow Simplex Method for Curved Polyhedra.",
            "Two Proofs for Shallow Packings.",
            "Sylvester-Gallai for Arrangements of Subspaces.",
            "A Geometric Approach for the Upper Bound Theorem for Minkowski Sums of Convex Polytopes.",
            "Star Unfolding from a Geodesic Curve."
        ]
    },
    {
        "name": "DCG",
        "year": "2015",
        "info": "2015: Volumes\n53,\n54",
        "count": 97,
        "papers": [
            "A Combinatorial Tool for Computing the Effective Homotopy of Iterated Loop Spaces.",
            "Isometric Embedding of Busemann Surfaces into L1.",
            "A Quantitative Variant of the Multi-colored Motzkin-Rabin Theorem.",
            "On the Intersection of a Sparse Curve and a Low-Degree Curve: A Polynomial Version of the Lost Theorem.",
            "On the Geometric Ramsey Number of Outerplanar Graphs.",
            "Most Finite Point Sets in the Plane have Dilation > 1.",
            "Crossing Numbers and Combinatorial Characterization of Monotone Drawings of $$K_n$$ K n.",
            "On Lattice-Free Orbit Polytopes.",
            "On the Distance of Polytopes with Few Vertices to the Euclidean Ball.",
            "New Lower Bound for the Optimal Ball Packing Density in Hyperbolic 4-Space.",
            "Coloring Triangle-Free Rectangle Overlap Graphs with $$O(\\log \\log n)$$ O ( log log n ) Colors.",
            "Triangle-Free Geometric Intersection Graphs with No Large Independent Sets.",
            "Beyond the Efron-Buchta Identities: Distributional Results for Poisson Polytopes.",
            "The Voronoi Conjecture for Parallelohedra with Simply Connected δ-Surfaces.",
            "On the Number of Directions Determined by the Common Tangents to a Family of Pairwise Disjoint Convex Sets in the Plane.",
            "Fixed-Parameter Complexity and Approximability of Norm Maximization.",
            "Average Stretch Factor: How Low Does It Go?",
            "An O(lg lg OPT)-Approximation Algorithm for Multi-guarding Galleries.",
            "Independent and Hitting Sets of Rectangles Intersecting a Diagonal Line: Algorithms and Complexity.",
            "Closed Rotation Sequences.",
            "A Short Proof that the Extension Complexity of the Correlation Polytope Grows Exponentially.",
            "Topology of Geometric Joins.",
            "Illumination of Pascal's Hexagrammum and Octagrammum Mysticum.",
            "Distinct Distance Estimates and Low Degree Polynomial Partitioning.",
            "A Computer Search for Planar Substitution Tilings with n-Fold Rotational Symmetry.",
            "Tribone Tilings of Triangular Regions that Cover All but Three Holes.",
            "A Quadratic Lower Bound for the Convergence Rate in the One-Dimensional Hegselmann-Krause Bounded Confidence Dynamics.",
            "Guest Editors' Foreword.",
            "On Constant Factors in Comparison-Based Geometric Algorithms and Data Structures.",
            "There are Plane Spanners of Degree 4 and Moderate Stretch Factor.",
            "On the Complexity of Randomly Weighted Multiplicative Voronoi Diagrams.",
            "On the Reconstruction of Convex Sets from Random Normal Measurements.",
            "Discrete Systolic Inequalities and Decompositions of Triangulated Surfaces.",
            "Gromov-Hausdorff Approximation of Filamentary Structures Using Reeb-Type Graphs.",
            "Efficient Algorithms for Privately Releasing Marginals via Convex Relaxations.",
            "Counting Triangulations and Other Crossing-Free Structures via Onion Layers.",
            "Discrete Conics as Distinguished Projective Images of Regular Polygons.",
            "Empty Triangles in Complete Topological Graphs.",
            "Four-Connected Triangulations of Planar Point Sets.",
            "Liftings and Stresses for Planar Periodic Frameworks.",
            "The Density of Sets Avoiding Distance 1 in Euclidean Space.",
            "Small Extended Formulations for Cyclic Polytopes.",
            "Indecomposable Coverings with Homothetic Polygons.",
            "New Sum-Product Estimates for Real and Complex Numbers.",
            "Iterative Universal Rigidity.",
            "Unions of Regular Polygons with Large Perimeter-to-Area Ratio.",
            "Lossy Gossip and Composition of Metrics.",
            "Flip Invariance for Domino Tilings of Three-Dimensional Regions with Two Floors.",
            "About an Erdős-Grünbaum Conjecture Concerning Piercing of Non-bounded Convex Sets.",
            "Valid Orderings of Real Hyperplane Arrangements.",
            "Supersolvability and Freeness for ψ-Graphical Arrangements.",
            "Erratum to: On the Geometry of Cyclic Lattices.",
            "Jiří Matoušek, March 10, 1963-March 9, 2015.",
            "Three-Monotone Interpolation.",
            "Multilevel Polynomial Partitions and Simplified Range Searching.",
            "Homology of Cellular Structures Allowing Multi-incidence.",
            "Inductive Constructions for Frameworks on a Two-Dimensional Fixed Torus.",
            "Edge Flips in Surface Meshes.",
            "A d-dimensional Extension of Christoffel Words.",
            "The Packing Density of the n-Dimensional Cross-Polytope.",
            "Fan Realizations of Type A Subword Complexes and Multi-associahedra of Rank 3.",
            "When is the Ball a Local Pessimum for Covering?",
            "On the Covering Densities of Quarter-Convex Disks.",
            "Free Edge Lengths in Plane Graphs.",
            "A Nonlinear Approach to Dimension Reduction.",
            "Local Digital Algorithms for Estimating the Integrated Mean Curvature of r-Regular Sets.",
            "Frameworks with Forced Symmetry I: Reflections and Rotations.",
            "Flip Distance Between Triangulations of a Simple Polygon is NP-Complete.",
            "Finite and Infinitesimal Rigidity with Polyhedral Norms.",
            "Universality Theorems for Inscribed Polytopes and Delaunay Triangulations.",
            "Cycles in Oriented 3-Graphs.",
            "Polytopes with Preassigned Automorphism Groups.",
            "Compatible Connectivity Augmentation of Planar Disconnected Graphs.",
            "Incidence Bounds on Multijoints and Generic Joints.",
            "A Szemerédi-Trotter Type Theorem in ℝ4.",
            "On the Equivalence Between Two Problems of Asymmetry on Convex Bodies.",
            "Stress Matrices and Global Rigidity of Frameworks on Surfaces.",
            "Bounds for Pach's Selection Theorem and for the Minimum Solid Angle in a Simplex.",
            "A Variant of the Hadwiger-Debrunner (p, q)-Problem in the Plane.",
            "Quasi-periodic Tiling with Multiplicity: A Lattice Enumeration Approach.",
            "A Note on Smaller Fractional Helly Numbers.",
            "Erdős-Szekeres Theorem for Lines.",
            "Cubic Tessellations of the Helicosms.",
            "A Metric Characterisation of Repulsive Tilings.",
            "On the Multiple Covering Densities of Triangles.",
            "Positive Center Sets of Convex Curves.",
            "On Pattern Entropy of Weak Model Sets.",
            "New Results for the Growth of Sets of Real Numbers.",
            "Ramified Rectilinear Polygons: Coordinatization by Dendrons.",
            "Geometry-driven Collapses for Converting a Čech Complex into a Triangulation of a Nicely Triangulable Shape.",
            "On the Lower Bound in the Lattice Point Remainder Problem for a Parallelepiped.",
            "Kinetic Voronoi Diagrams and Delaunay Triangulations under Polygonal Distance Functions.",
            "Stable Delaunay Graphs.",
            "On Triple Intersections of Three Families of Unit Circles.",
            "Many 2-Level Polytopes from Matroids.",
            "No Weak Local Rules for the 4p-Fold Tilings.",
            "Algebraic-exponential Data Recovery from Moments."
        ]
    },
    {
        "name": "DCG",
        "year": "2014",
        "info": "2014: Volumes\n51,\n52",
        "count": 88,
        "papers": [
            "The Euclidean Bottleneck Steiner Path Problem and Other Applications of (α, β)-Pair Decomposition.",
            "Extendability of Continuous Maps Is Undecidable.",
            "Toroidal Maps: Schnyder Woods, Orthogonal Surfaces and Straight-Line Representations.",
            "Spaces of Polygonal Triangulations and Monsky Polynomials.",
            "On the Vertices of the d-Dimensional Birkhoff Polytope.",
            "Testing Graph Isotopy on Surfaces.",
            "Tverberg's Theorem and Graph Coloring.",
            "Manifold Reconstruction Using Tangential Delaunay Complexes.",
            "Tiling R 5 by Crosses.",
            "An Extension of a Theorem of Yao and Yao.",
            "Ollivier's Ricci Curvature, Local Clustering and Curvature-Dimension Inequalities on Graphs.",
            "Frankl-Füredi-Kalai Inequalities on the γ-Vectors of Flag Nestohedra.",
            "On Invariant Line Arrangements.",
            "Empty Monochromatic Simplices.",
            "Combinatorial 3-Manifolds with Transitive Cyclic Symmetry.",
            "On Improved Bounds for Bounded Degree Spanning Trees for Points in Arbitrary Dimension.",
            "Dimension Reduction by Random Hyperplane Tessellations.",
            "Covering Paths for Planar Point Sets.",
            "Pairwise Balanced Designs with Prescribed Minimum Dimension.",
            "Packing and Covering with Centrally Symmetric Convex Disks.",
            "On Borsuk's Conjecture for Two-Distance Sets.",
            "On Discrete Constant Mean Curvature Surfaces.",
            "Polytropes and Tropical Eigenspaces: Cones of Linearity.",
            "Nonnegative Polynomials and Their Carathéodory Number.",
            "Perfect Graphs and Guarding Rectilinear Art Galleries.",
            "Elimination for Generic Sparse Polynomial Systems.",
            "Categorification of Persistent Homology.",
            "Colourful and Fractional (p, q)-theorems.",
            "On Packing R3 with Thin Tori.",
            "Deformations of Period Lattices of Flexible Polyhedral Surfaces.",
            "Distinct Distances on Curves Via Rigidity.",
            "On Spaces of Infinitesimal Motions and Three Dimensional Henneberg Extensions.",
            "A Note on Toeplitz' Conjecture.",
            "Fractal Tilings from Iterated Function Systems.",
            "Tiling Convex Polygons with Congruent Equilateral Triangles.",
            "Realizability of Polytopes as a Low Rank Matrix Completion Problem.",
            "Non-Embeddability of Geometric Lattices and Buildings.",
            "Hyperbolic Polynomials and Generalized Clifford Algebras.",
            "Circumcenter of Mass and Generalized Euler Line.",
            "Some Remarks on the Circumcenter of Mass.",
            "Diameter Graphs in ℝ4.",
            "Duality Properties of Strong Isoperimetric Inequalities on a Planar Graph and Combinatorial Curvatures.",
            "Convex Polygons are Self-Coverable.",
            "Arrangements of Pseudocircles and Circles.",
            "From Steiner Formulas for Cones to Concentration of Intrinsic Volumes.",
            "Upper Bounds on Packing Density for Circular Cylinders with High Aspect Ratio.",
            "Covering Nearly Surface-Embedded Graphs with a Fixed Number of Balls.",
            "The Inradius of a Hyperbolic Truncated $$n$$ n -Simplex.",
            "Characterizing the Universal Rigidity of Generic Frameworks.",
            "On Gromov's Method of Selecting Heavily Covered Points.",
            "A Note on the Homotopy Type of the Alexander Dual.",
            "Fréchet Means for Distributions of Persistence Diagrams.",
            "New Roses: Simple Symmetric Venn Diagrams with 11 and 13 Curves.",
            "Projective Center Point and Tverberg Theorems.",
            "On Sub-determinants and the Diameter of Polyhedra.",
            "A New Approach to Crushing 3-Manifold Triangulations.",
            "On Maximally Inflected Hyperbolic Curves.",
            "Smooth Fano Polytopes with Many Vertices.",
            "Generalization of Sabitov's Theorem to Polyhedra of Arbitrary Dimensions.",
            "A Discrete Isoperimetric Inequality on Lattices.",
            "On the Geometry of Cyclic Lattices.",
            "A Probabilistic Symbolic Algorithm to Find the Minimum of a Polynomial Function on a Basic Closed Semialgebraic Set.",
            "Divide and Conquer Roadmap for Algebraic Sets.",
            "Necessary Conditions for the Generic Global Rigidity of Frameworks on Surfaces.",
            "On the Maximum Number of Independent Elements in Configurations of Points and Lines.",
            "Volume in General Metric Spaces.",
            "A New Topological Helly Theorem and Some Transversal Results.",
            "Coloring Intersection Graphs of Arc-Connected Sets in the Plane.",
            "On the Chromatic Number of ℝ4.",
            "Guest Editors' Foreword.",
            "Efficiently Hex-Meshing Things with Topology.",
            "Counting and Sampling Minimum Cuts in Genus $$g$$ g Graphs.",
            "A New Approach to Output-Sensitive Construction of Voronoi Diagrams and Delaunay Triangulations.",
            "A Faster Algorithm for Computing Motorcycle Graphs.",
            "A Möbius-Invariant Power Diagram and Its Applications to Soap Bubbles and Planar Lombardi Drawing.",
            "Union of Random Minkowski Sums and Network Vulnerability Analysis.",
            "On the Set of Points at Infinity of a Polynomial Image of ℝn.",
            "Discrete constant mean curvature nets in space forms: Steiner's formula and Christoffel duality.",
            "Equivalence Classes of Full-Dimensional 0/1 -Polytopes with Many Vertices.",
            "Coloring d-Embeddable k-Uniform Hypergraphs.",
            "Crackle: The Homology of Noise.",
            "On Sumsets and Convex Hull.",
            "Colouring Multijoints.",
            "Shellable Drawings and the Cylindrical Crossing Number of Kn.",
            "Ball Packings with Periodic Constraints.",
            "Fast and RIP-Optimal Transforms.",
            "A Finite Chiral 4-Polytope in ℝ4.",
            "On the Theory of Coconvex Bodies."
        ]
    },
    {
        "name": "DCG",
        "year": "2013",
        "info": "2013: Volumes\n49,\n50",
        "count": 94,
        "papers": [
            "Guest Editors' Foreword.",
            "No Dimension-Independent Core-Sets for Containment Under Homothetics.",
            "Witnessed k-Distance.",
            "Reeb Graphs: Approximation and Persistence.",
            "A Center Transversal Theorem for Hyperplanes and Applications to Graph Drawing.",
            "Disjoint Compatible Geometric Matchings.",
            "Optimal Reconstruction Might be Hard.",
            "Drawing Trees with Perfect Angular Resolution and Polynomial Area.",
            "Two Upper Bounds for the Erdős-Szekeres Number with Conditions.",
            "Rigid Ball-Polyhedra in Euclidean 3-Space.",
            "Asymptotics for Some Combinatorial Characteristics of the Convex Hull of a Poisson Point Process in the Clifford Torus.",
            "About Tracing Problems in Dynamic Geometry.",
            "Computing the Vertices of Tropical Polyhedra Using Directed Hypergraphs.",
            "Disjoint Edges in Complete Topological Graphs.",
            "New Examples of Oriented Matroids with Disconnected Realization Spaces.",
            "f-Vectors Implying Vertex Decomposability.",
            "Determining All Universal Tilers.",
            "Collapsibility and Vanishing of Top Homology in Random Simplicial Complexes.",
            "Delone Sets with Finite Local Complexity: Linear Repetitivity Versus Positivity of Weights.",
            "Hardness of Approximation for Crossing Number.",
            "Complete Enumeration of Small Realizable Oriented Matroids.",
            "Functions, Measures, and Equipartitioning Convex k-Fans.",
            "Cutting the Same Fraction of Several Measures.",
            "Shape Optimization Under Width Constraint.",
            "Explicit Constructions of Centrally Symmetric k-Neighborly Polytopes and Large Strictly Antipodal Sets.",
            "An Analogue of Gromov's Waist Theorem for Coloring the Cube.",
            "A Planar 3-Convex Set is Indeed a Union of Six Convex Sets.",
            "Combinatorial Generalizations of Jung's Theorem.",
            "Acyclic Systems of Permutations and Fine Mixed Subdivisions of Simplices.",
            "The Flip-Graph of the 4-Dimensional Cube is Connected.",
            "Parallelogram Tilings, Worms, and Finite Orientations.",
            "Sporadic Reinhardt Polygons.",
            "Estimating Support Functions of Random Polytopes via Orlicz Norms.",
            "The Small Octagons of Maximal Width.",
            "Small-Ball Probabilities for the Volume of Random Convex Sets.",
            "On the Stretch Factor of Randomly Embedded Random Graphs.",
            "Towards a de Bruijn-Erdős Theorem in the L1-Metric.",
            "Highly Incident Configurations with Chiral Symmetry.",
            "On the Degenerate Crossing Number.",
            "Regular Polytopes of Nearly Full Rank: Addendum.",
            "Guest Editors' Foreword.",
            "On Topological Changes in the Delaunay Triangulation of Moving Points.",
            "The 2-Page Crossing Number of Kn.",
            "Linear-Size Approximations to the Vietoris-Rips Filtration.",
            "Add Isotropic Gaussian Kernels at Own Risk: More and More Resilient Modes in Higher Dimensions.",
            "Tracing Compressed Curves in Triangulated Surfaces.",
            "A Deterministic O (m log m) Time Algorithm for the Reeb Graph.",
            "Bounds on the Complexity of Halfspace Intersections when the Bounded Faces have Small Dimension.",
            "Branched Polymers and Hyperplane Arrangements.",
            "Entropy and Diffraction of the k-Free Points in n-Dimensional Lattices.",
            "Topological Persistence for Circle-Valued Maps.",
            "Open Sets Avoiding Integral Distances.",
            "An Approximation Algorithm for Computing Shortest Paths in Weighted 3-d Domains.",
            "Size of Components of a Cube Coloring.",
            "Boundaries of Disk-Like Self-affine Tiles.",
            "Algebraic Boundaries of SO(2)-Orbitopes.",
            "Polarization Optimality of Equally Spaced Points on the Circle for Discrete Potentials.",
            "Many Empty Triangles have a Common Edge.",
            "A Question from a Famous Paper of Erdős.",
            "Solution of the Propeller Conjecture in ℝ3.",
            "The Geodesic Diameter of Polygonal Domains.",
            "Morse Theory for Filtrations and Efficient Computation of Persistent Homology.",
            "Maximal Equilateral Sets.",
            "Algorithms on Minimizing the Maximum Sensor Movement for Barrier Coverage of a Linear Domain.",
            "On Sets Defining Few Ordinary Lines.",
            "Tilings of Parallelograms with Similar Right Triangles.",
            "Polygons with Parallel Opposite Sides.",
            "Characterization of Co-blockers for Simple Perfect Matchings in a Convex Geometric Graph.",
            "Polytopal Affine Semigroups with Holes Deep Inside.",
            "Lower Bounds in Real Algebraic Geometry and Orientability of Real Toric Varieties.",
            "Approximating Tverberg Points in Linear Time for Any Fixed Dimension.",
            "Robust Tensegrity Polygons.",
            "LR Characterization of Chirotopes of Finite Planar Families of Pairwise Disjoint Convex bodies.",
            "The Combinatorial Structure of Spatial STIT Tessellations.",
            "Recovering an Homogeneous Polynomial from Moments of Its Level Set.",
            "Polytopes of Minimum Positive Semidefinite Rank.",
            "Local Tropical Linear Spaces.",
            "Triangle-Free Geometric Intersection Graphs with Large Chromatic Number.",
            "Improved Enumeration of Simple Topological Graphs.",
            "The Clique Problem in Ray Intersection Graphs.",
            "Computing Cartograms with Optimal Complexity.",
            "Many Collinear k-Tuples with no k+1 Collinear Points.",
            "Geometric Tomography with Topological Guarantees.",
            "A Helly-Type Theorem for Semi-monotone Sets and Monotone Maps.",
            "Many Neighborly Polytopes and Oriented Matroids.",
            "Minkowski Decomposition of Associahedra and Related Combinatorics.",
            "Generalized 1-Skeleta and a Lifting Result.",
            "Dimension Reduction for Finite Trees in ℓ 1.",
            "Structure Results for Multiple Tilings in 3D.",
            "Constructing Uniquely Realizable Graphs.",
            "The Set of Packing and Covering Densities of Convex Disks.",
            "On High-Dimensional Acyclic Tournaments.",
            "Holding Circles and Fixing Frames.",
            "Enumerating Cube Tilings."
        ]
    },
    {
        "name": "DCG",
        "year": "2012",
        "info": "2012: Volumes\n47,\n48",
        "count": 94,
        "papers": [
            "Non-periodic Tilings of ℝ n by Crosses.",
            "Matroid Enumeration for Incidence Geometry.",
            "Efficient Subspace Approximation Algorithms.",
            "Oriented Interval Greedoids.",
            "Weakly Regular Subdivisions.",
            "Topology of Random 2-Complexes.",
            "Hinged Dissections Exist.",
            "Constant Approximation Algorithms for Embedding Graph Metrics into Trees and Outerplanar Graphs.",
            "A Face of a Projective Triangulation Removed for Its Geometric Realizability.",
            "A Non-linear Lower Bound for Planar Epsilon-nets.",
            "A Geometric Proof of the Colored Tverberg Theorem.",
            "A Counterexample to Wegner's Conjecture on Good Covers.",
            "Illuminating Spindle Convex Bodies and Minimizing the Volume of Spherical Sets of Constant Width.",
            "The Probability that a Convex Body Intersects the Integer Lattice in a k-dimensional Set.",
            "Strong Homotopy Types, Nerves and Collapses.",
            "The Projection Median of a Set of Points in ℝ d.",
            "Optimal Topological Simplification of Discrete Functions on Surfaces.",
            "Allowable Interval Sequences and Separating Convex Sets in the Plane.",
            "Dual Complexes of Cubical Subdivisions of ℝ n.",
            "Asymmetry of Convex Bodies of Constant Width.",
            "Characterization of Polytopes via Tilings with Similar Pieces.",
            "Singular Tropical Hypersurfaces.",
            "A Generalisation of Tverberg's Theorem.",
            "The Shape of Orthogonal Cycles in Three Dimensions.",
            "A Simpler Proof of the Boros-Füredi-Bárány-Pach-Gromov Theorem.",
            "Moving Out the Edges of a Lattice Polygon.",
            "Maximal f-Vectors of Minkowski Sums of Large Numbers of Polytopes.",
            "A Hyperplane Inequality for Measures of Convex Bodies in ℝ n , n≤4.",
            "Sphere and Dot Product Representations of Graphs.",
            "Embedding a Pair of Graphs in a Surface, and the Width of 4-dimensional Prismatoids.",
            "Refined Bounds on the Number of Connected Components of Sign Conditions on a Variety.",
            "Octants Are Cover-Decomposable.",
            "Non-rigidity of Spherical Inversive Distance Circle Packings.",
            "Counterexamples of the Conjecture on Roots of Ehrhart Polynomials.",
            "Smooth Fano Polytopes Whose Ehrhart Polynomial Has a Root with Large Real Part.",
            "Scissors Congruence, the Golden Ratio and Volumes in Hyperbolic 5-Space.",
            "Guest Editor's Foreword.",
            "Optimal Partition Trees.",
            "Consistent Digital Line Segments.",
            "Tight Lower Bounds for Halfspace Range Searching.",
            "Linkless and Flat Embeddings in 3-Space.",
            "On the Complexity of Sets of Free Lines and Line Segments Among Balls in Three Dimensions.",
            "On Levels in Arrangements of Surfaces in Three Dimensions.",
            "A Tight Bound for the Delaunay Triangulation of Points on a Polyhedron.",
            "Conflict-Free Coloring for Rectangle Ranges Using O(n .382) Colors.",
            "Unions of Fat Convex Polytopes Have Short Skeletons.",
            "Lines Avoiding Balls in Three Dimensions Revisited.",
            "Approximating the Fréchet Distance for Realistic Curves in Near Linear Time.",
            "The Strong Thirteen Spheres Problem.",
            "Multitriangulations, Pseudotriangulations and Primitive Sorting Networks.",
            "On ≤k-Edges, Crossings, and Halving Lines of Geometric Drawings of K n.",
            "On the Reconstruction of Planar Lattice-Convex Sets from the Covariogram.",
            "Triangle Contact Representations and Duality.",
            "An Incidence Theorem in Higher Dimensions.",
            "On the Orlicz Minkowski Problem for Polytopes.",
            "Contact Numbers for Congruent Sphere Packings in Euclidean 3-Space.",
            "A Triangulation of ℂP 3 as Symmetric Cube of S 2.",
            "Tilings of Convex Polygons with Congruent Triangles.",
            "Approximation Algorithms for Maximum Independent Set of Pseudo-Disks.",
            "Planar Crossing Numbers of Graphs of Bounded Genus.",
            "Some Properties of Gromov-Hausdorff Distances.",
            "Erdős-Szekeres Theorem for Point Sets with Forbidden Subconfigurations.",
            "Linear Pencils of Tropical Plane Curves.",
            "Structure of the Space of Diametrically Complete Sets in a Minkowski Space.",
            "A New Lower Bound Based on Gromov's Method of Selecting Heavily Covered Points.",
            "Simple Proofs of Classical Theorems in Discrete Geometry via the Guth-Katz Polynomial Partitioning Technique.",
            "Computing Pseudotriangulations via Branched Coverings.",
            "Affine Properties of Convex Equal-Area Polygons.",
            "The Inverse Moment Problem for Convex Polytopes.",
            "Coning, Symmetry and Spherical Frameworks.",
            "Extended Formulations for Polygons.",
            "On the Connectivity of Visibility Graphs.",
            "Simplicial Arrangements with up to 27 Lines.",
            "A Note on Aperiodic Ammann Tiles.",
            "The Art Gallery Theorem for Polyominoes.",
            "An Application of Shadow Systems to Mahler's Conjecture.",
            "On Integral Well-rounded Lattices in the Plane.",
            "Determining a Rotation of a Tetrahedron from a Projection.",
            "Kadets-Type Theorems for Partitions of a Convex Body.",
            "The Structure of Cube Tilings Under Symmetry Conditions.",
            "Notes About the Carathéodory Number.",
            "Geometric Characterization of Weyl's Discrepancy Norm in Terms of Its n-Dimensional Unit Balls.",
            "Foundations for a Theory of Complex Matroids.",
            "Ehrhart h ∗-Vectors of Hypersimplices.",
            "Tropical Surface Singularities.",
            "Characteristics of Graph Braid Groups.",
            "Deconstructing Approximate Offsets.",
            "Point Sets on the Sphere S2 with Small Spherical Cap Discrepancy.",
            "Convex Pencils of Real Quadratic Forms.",
            "Nonpolytopal Nonsimplicial Lattice Spheres with Nonnegative Toric g-Vector.",
            "Allowable Interval Sequences and Line Transversals in the Plane.",
            "Mandelbrot Set + Symmetry Groups ∗ Higher Dimensions = ?",
            "Symmetries of Equivelar 4-Toroids.",
            "Minkowski Length of 3D Lattice Polytopes."
        ]
    },
    {
        "name": "DCG",
        "year": "2011",
        "info": "2011: Volumes\n45,\n46",
        "count": 91,
        "papers": [
            "Letter from the New Editors-in-Chief.",
            "Range Minima Queries with Respect to a Random Permutation, and Approximate Range Counting.",
            "Dense Fast Random Projections and Lean Walsh Transforms.",
            "On the Union of Cylinders in Three Dimensions.",
            "Small Grid Embeddings of 3-Polytopes.",
            "Straight-Line Rectangular Drawings of Clustered Graphs.",
            "Small Drawings of Outerplanar Graphs, Series-Parallel Graphs, and Other Planar Graphs.",
            "The Expected Genus of a Random Chord Diagram.",
            "A Baby Steps/Giant Steps Probabilistic Algorithm for Computing Roadmaps in Smooth Bounded Real Hypersurface.",
            "Guest Editors' Foreword.",
            "A Helly Type Theorem for Abstract Projective Geometries.",
            "Lines Pinning Lines.",
            "Carathéodory-type Theorems à la Bárány.",
            "More Colourful Simplices.",
            "On the Number of Simple Arrangements of Five Double Pseudolines.",
            "Pinning a Line by Balls or Ovaloids in ℝ3.",
            "Transversals in Superdisjoint T(3)-families of Translates.",
            "Line Transversals to Translates of a Convex Body.",
            "Tverberg-Type Theorems for Intersecting by Rays.",
            "Tolerance in Helly-Type Theorems.",
            "Piercing Numbers for Balanced and Unbalanced Families.",
            "Hyperseparoids: A Representation Theorem.",
            "The Overlay of Minimization Diagrams in a Randomized Incremental Construction.",
            "Simple Realizability of Complete Abstract Topological Graphs in P.",
            "The Ratio of the Perimeter and the Area of Unions of Copies of a Fixed Set.",
            "The f-Vector of the Descent Polytope.",
            "Hardness Results for Homology Localization.",
            "Smooth Fano Polytopes Arising from Finite Partially Ordered Sets.",
            "Relative (p, ε)-Approximations in Geometry.",
            "The List-Chromatic Number of Infinite Graphs Defined on Euclidean Spaces.",
            "On γ-Vectors Satisfying the Kruskal-Katona Inequalities.",
            "Dilation of Newton Polytope and p-adic Estimate.",
            "The Forest Hiding Problem.",
            "Random Geometric Complexes.",
            "New Classes of Counterexamples to Hendrickson's Global Rigidity Conjecture.",
            "Guest Editor's Foreword.",
            "k-means Requires Exponentially Many Iterations Even in the Plane.",
            "Binary Plane Partitions for Disjoint Line Segments.",
            "A Proof of the Molecular Conjecture.",
            "Minimum Manhattan Network is NP-Complete.",
            "Kinetic Spanners in ℝd.",
            "Persistent Cohomology and Circular Coordinates.",
            "Adaptive Isotopic Approximation of Nonsingular Curves: the Parameterizability and Nonlocal Isotopy Approach.",
            "Computing Hereditary Convex Structures.",
            "Cache-Oblivious Range Reporting with Optimal Queries Requires Superlinear Space.",
            "Equivalence of Self-similar and Pseudo-self-similar Tiling Spaces in ℝ2.",
            "A Polynomial Number of Random Points Does Not Determine the Volume of a Convex Body.",
            "Bounded Direction-Length Frameworks.",
            "Necessary Conditions for the Global Rigidity of Direction-Length Frameworks.",
            "A Celtic Framework for Knots and Links.",
            "Prodsimplicial-Neighborly Polytopes.",
            "Extremal Betti Numbers of Vietoris-Rips Complexes.",
            "Spherical Distribution of 5 Points with Maximal Distance Sum.",
            "The Banach-Mazur Distance to the Cube in Low Dimensions.",
            "Tiling Lattices with Sublattices, I.",
            "Polynomial Root-Finding Methods Whose Basins of Attraction Approximate Voronoi Diagram.",
            "On the Number of Ordinary Circles Determined by n Points.",
            "Lower Bounds for Cubical Pseudomanifolds.",
            "Rigidity of Quasicrystallic and Zγ-Circle Patterns.",
            "Improved Approximation for Guarding Simple Galleries from the Perimeter.",
            "On the Optimality of Gluing over Scales.",
            "Topological transversals to a family of convex sets.",
            "Properties of Axial Diameters of a Simplex.",
            "Optimally Decomposing Coverings with Translates of a Convex Polygon.",
            "Representing a Functional Curve by Curves with Fewer Peaks.",
            "Coreduction Homology Algorithm for Regular CW-Complexes.",
            "On Lebesgue Measure of Integral Self-Affine Sets.",
            "Aperiodic Tilings with One Prototile and Low Complexity Atlas Matching Rules.",
            "Coding and Counting Arrangements of Pseudolines.",
            "Projection Volumes of Hyperplane Arrangements.",
            "f-Vectors of Triangulated Balls.",
            "Constructing Highly Incident Configurations.",
            "Erratum to: Constructing Highly Incident Configurations.",
            "A Note on Projecting the Cubic Lattice.",
            "Edges of the Barvinok-Novik Orbitope.",
            "Roots of Ehrhart Polynomials of Smooth Fano Polytopes.",
            "Curvature, Geometry and Spectral Properties of Planar Graphs.",
            "Orphan-Free Anisotropic Voronoi Diagrams.",
            "From the Icosahedron to Natural Triangulations of ℂP2 and S2×S2.",
            "The Orbit Rigidity Matrix of a Symmetric Framework.",
            "On the Nonexistence of k-reptile Tetrahedra.",
            "A Bichromatic Incidence Bound and an Application.",
            "New Asymptotic Bounds on the Size of Multiple Packings of the Euclidean Sphere.",
            "Some Lower Bounds in the B. and M. Shapiro Conjecture for Flag Varieties.",
            "Regular Polytopes of Nearly Full Rank.",
            "A QPTAS for TSP with Fat Weakly Disjoint Neighborhoods in Doubling Metrics.",
            "Variations on R. Schwartz's Inequality for the Schwarzian Derivative.",
            "Scalar Field Analysis over Point Cloud Data.",
            "John and Loewner Ellipsoids.",
            "When do the Recession Cones of a Polyhedral Complex Form a Fan?",
            "Upper Bound on the Packing Density of Regular Tetrahedra and Octahedra."
        ]
    },
    {
        "name": "DCG",
        "year": "2010",
        "info": "2010: Volumes\n43,\n44",
        "count": 103,
        "papers": [
            "On the Maximum Number of Translates in a Point Set.",
            "An Optimal-Time Algorithm for Shortest Paths on Realistic Polyhedra.",
            "Convex Hulls of Orbits and Orientations of a Moving Protein Domain.",
            "Can We Compute the Similarity between Surfaces?",
            "A Characterization of the Angle Defect and the Euler Characteristic in Dimension 2.",
            "Delaunay Refinement for Piecewise Smooth Complexes.",
            "Covering the Plane with Translates of a Triangle.",
            "Generalized D-Forms Have No Spurious Creases.",
            "Unavoidable Crossings in a Thinnest Plane Covering with Congruent Convex Disks.",
            "Recurrence Relationships for the Mean Number of Faces and Vertices for Random Convex Hulls.",
            "Cuttings for Disks and Axis-Aligned Rectangles in Three-Space.",
            "Hamiltonian Submanifolds of Regular Polytopes.",
            "An Improvement to \"A Note on Euclidean Ramsey Theory\".",
            "Universal Sets of n Points for One-bend Drawings of Planar Graphs with n Vertices.",
            "Nonrealizable Minimal Vertex Triangulations of Surfaces: Showing Nonrealizability Using Oriented Matroids and Satisfiability Solvers.",
            "Oriented Mixed Area and Discrete Minimal Surfaces.",
            "Stabbing Simplices by Points and Flats.",
            "On a Formula Relating Volumes of Medial Sections of Simplices.",
            "Coarse Differentiation and Multi-flows in Planar Graphs.",
            "Laminating Lattices with Symmetrical Glue.",
            "Greedy Drawings of Triangulations.",
            "On a Question of Erdos and Ulam.",
            "Untangling Polygons and Graphs.",
            "Construction and Analysis of Projected Deformed Products.",
            "Geometry of Configuration Spaces of Tensegrities.",
            "On the Dimension of a Face Exposed by Proper Separation of Convex Polyhedra.",
            "Equipartition of a Measure by (Zp)k-Invariant Fans.",
            "Convex Polygons are Cover-Decomposable.",
            "Streaming Algorithms for Line Simplification.",
            "Simplices and Spectra of Graphs.",
            "Counting the Faces of Randomly-Projected Hypercubes and Orthants, with Applications.",
            "The Johnson-Lindenstrauss Lemma Almost Characterizes Hilbert Space, But Not Quite.",
            "Iterated Point-Line Configurations Grow Doubly-Exponentially.",
            "Bichromatic and Equichromatic Lines in C2 and R2.",
            "On the Characterization of Expansion Maps for Self-Affine Tilings.",
            "Characterizing Graphs with Convex and Connected Cayley Configuration Spaces.",
            "Planar Graphs Have 1-string Representations.",
            "Carathéodory, Helly and the Others in the Max-Plus World.",
            "Multiplicity mod 2 as a Metric Invariant.",
            "Segment Orders.",
            "The Charney-Davis Conjecture for Certain Subdivisions of Spheres.",
            "Global Rigidity: The Effect of Coning.",
            "Low-Light Trees, and Tight Lower Bounds for Euclidean Spanners.",
            "An Optimization Problem Related to Minkowski's Successive Minima.",
            "Uniform Convergence of Discrete Curvatures from Nets of Curvature Lines.",
            "On Rich Lines in Grids.",
            "Matroid Polytopes and their Volumes.",
            "The Finite Number of Interior Component Shapes of the Levy Dragon.",
            "Uneven Splitting of Ham Sandwiches.",
            "On 2-dimensional Simple Sets in n-dimensional Cubic Grids.",
            "Compression Schemes, Stable Definable Families, and o-Minimal Structures.",
            "Certain Homology Cycles of the Independence Complex of Grids.",
            "An Elementary Deduction of the Topological Radon Theorem from Borsuk-Ulam.",
            "A Revision of the Proof of the Kepler Conjecture.",
            "Star Unfolding Convex Polyhedra via Quasigeodesic Loops.",
            "The Euclidean Distortion of the Lamplighter Group.",
            "Vietoris-Rips Complexes of Planar Point Sets.",
            "Unknot Diagrams Requiring a Quadratic Number of Reidemeister Moves to Untangle.",
            "Newton Polyhedra of Discriminants of Projections.",
            "Totally Splittable Polytopes.",
            "Combinatorial Structure of Schulte's Chiral Polyhedra.",
            "On Sign Conditions Over Real Multivariate Polynomials.",
            "Obstacle Numbers of Graphs.",
            "Dense Periodic Packings of Tetrahedra with Small Repeating Units.",
            "Dense Crystalline Dimer Packings of Regular Tetrahedra.",
            "Bregman Voronoi Diagrams.",
            "Optimal Angle Bounds for Quadrilateral Meshes.",
            "Conformal Mapping in Linear Time.",
            "Knaster's Problem for (Z2)k-Symmetric Subsets of the Sphere S2k-1.",
            "Locked and Unlocked Chains of Planar Shapes.",
            "General Lower Bounds for the Minor Crossing Number of Graphs.",
            "Erratum to: There Is No Face-to-Face Partition of R5 into Acute Simplices.",
            "Irreducible Apollonian Configurations and Packings.",
            "On Clustering Bodies: Geometry and Polyhedral Approximation.",
            "Generalized Ham-Sandwich Cuts.",
            "Cech Type Approach to Computing Homology of Maps.",
            "Indecomposable Coverings with Concave Polygons.",
            "VC Dimensions of Principal Component Analysis.",
            "Vertex Numbers of Weighted Faces in Poisson Hyperplane Mosaics.",
            "A Measure of Non-convexity in the Plane and the Minkowski Sum.",
            "Sum Complexes - a New Family of Hypertrees.",
            "Hitting Simplices with Points in R3.",
            "The Least-Perimeter Partition of a Sphere into Four Equal Areas.",
            "Three-Dimensional Classical Groups Acting on Polytopes.",
            "Approximating the Pathway Axis and the Persistence Diagrams for a Collection of Balls in 3-Space.",
            "Some Results on Greedy Embeddings in Metric Spaces.",
            "Decomposition of Multiple Coverings into More Parts.",
            "Valedictory Editorial.",
            "Long Non-crossing Configurations in the Plane.",
            "An Improved Bound on the Number of Unit Area Triangles.",
            "Algorithms for Approximate Shortest Path Queries on Weighted Polyhedral Surfaces.",
            "Even- vs. Odd-dimensional Charney-Davis Conjecture.",
            "The Number of Generalized Balanced Lines.",
            "Slider-Pinning Rigidity: a Maxwell-Laman-Type Theorem.",
            "On Lines and Joints.",
            "Covers P for Abstract Regular Polytopes Q such that Q=P/Zpk.",
            "Lines, Circles, Planes and Spheres.",
            "Improved Results on Geometric Hitting Set Problems.",
            "Tiling Polygons with Lattice Triangles.",
            "The Contact Polytope of the Leech Lattice.",
            "Computing the Shortest Essential Cycle.",
            "An Eberhard-Like Theorem for Pentagons and Heptagons.",
            "Symmetric Versions of Laman's Theorem."
        ]
    },
    {
        "name": "DCG",
        "year": "2009",
        "info": "2009: Volumes\n41,\n42",
        "count": 81,
        "papers": [
            "Unit Distances and Diameters in Euclidean Spaces.",
            "Small Hop-diameter Sparse Spanners for Doubling Metrics.",
            "Isoperimetric Polygons of Maximum Width.",
            "Geometric Tomography of Convex Cones.",
            "Matching Points with Squares.",
            "Coreduction Homology Algorithm.",
            "Generalized Thrackle Drawings of Non-bipartite Graphs.",
            "Combinatorial Groupoids, Cubical Complexes, and the Lovász Conjecture.",
            "A Note on the Distribution of the Distance from a Lattice.",
            "Affine Configurations and Pure Braids.",
            "On Kalai's Conjectures Concerning Centrally Symmetric Polytopes.",
            "Linear Programming Bounds for Codes via a Covering Argument.",
            "Simple Polygons of Maximum Perimeter Contained in a Unit Disk.",
            "On Regular Vertices of the Union of Planar Convex Objects.",
            "Generalizations of Schöbi's Tetrahedral Dissection.",
            "Finding a Simple Polytope from Its Graph in Polynomial Time.",
            "Stability Properties of Neighbourly Random Polytopes.",
            "Lower Bounds for Local Versions of Dimension Reductions.",
            "Multitriangulations as Complexes of Star Polygons.",
            "A Continuous d -Step Conjecture for Polytopes.",
            "On Minimal Triangulations of Products of Convex Polygons.",
            "Coloring Geometric Range Spaces.",
            "Guest Editors' Foreword.",
            "On the Maximum Number of Edges in Topological Graphs with no Four Pairwise Crossing Edges.",
            "Degenerate Crossing Numbers.",
            "On Overlays and Minimization Diagrams.",
            "The Effect of Corners on the Complexity of Approximate Range Searching.",
            "Refolding Planar Polygons.",
            "A Sampling Theory for Compact Sets in Euclidean Space.",
            "Affine and Toric Hyperplane Arrangements.",
            "Traversing a Set of Points with a Minimum Number of Turns.",
            "A Polynomial-Time Algorithm to Approximate the Mixed Volume within a Simply Exponential Factor.",
            "Region-Fault Tolerant Geometric Spanners.",
            "Circumscribed Polygons of Small Area.",
            "Volume Distortion for Subsets of Euclidean Spaces.",
            "On a Theorem of Bandt and Wang and Its Extension to p 2-tiles.",
            "Open Rectangle-of-Influence Drawings of Inner Triangulated Plane Graphs.",
            "Guest Editor's Foreword.",
            "On Approximate Range Counting and Depth.",
            "Constrained Minkowski Sums: A Geometric Framework for Solving Interval Problems in Computational Biology Efficiently.",
            "Manifold Reconstruction in Arbitrary Dimensions Using Witness Complexes.",
            "The Theory of Multidimensional Persistence.",
            "The Voronoi Diagram of Three Lines.",
            "Guest Editors' Foreword.",
            "The Odd-Distance Plane Graph.",
            "Very Colorful Theorems.",
            "On the Graph Connectivity of Skeleta of Convex Polytopes.",
            "Three-Dimensional Polyhedra Can Be Described by Three Polynomial Inequalities.",
            "Pivoting in Linear Complementarity: Two Polynomial-Time Cases.",
            "Finite Sets as Complements of Finite Unions of Convex Sets.",
            "Blocking Visibility for Points in General Position.",
            "Regular Apeirotopes of Dimension and Rank 4.",
            "Applications of Klee's Dehn-Sommerville Relations.",
            "A Jordan-Brouwer Separation Theorem for Polyhedral Pseudomanifolds.",
            "Diagrams, Tensors and Geometric Reasoning.",
            "Simultaneous Packing and Covering in Sequence Spaces.",
            "Guest Editor's Foreword.",
            "Intersecting Convex Sets by Rays.",
            "Consistent Digital Rays.",
            "Helly-Type Theorems for Approximate Covering.",
            "Markov Incremental Constructions.",
            "Polychromatic Colorings of Plane Graphs.",
            "Fast Enumeration Algorithms for Non-crossing Geometric Graphs.",
            "Dynamic Coresets.",
            "Schnyder Woods for Higher Genus Triangulated Surfaces, with Applications to Encoding.",
            "Removing Degeneracy in LP-Type Problems Revisited.",
            "Zonotopes with Large 2D-Cuts.",
            "Untangling a Planar Graph.",
            "A Polynomial Bound for Untangling Geometric Planar Graphs.",
            "Note: Combinatorial Alexander Duality - A Short and Elementary Proof.",
            "Contraction and Expansion of Convex Sets.",
            "Fast Dimension Reduction Using Rademacher Series on Dual BCH Codes.",
            "Dimension Gaps between Representability and Collapsibility.",
            "More on an Erdos-Szekeres-Type Problem for Interior Points.",
            "On the Exact Maximum Complexity of Minkowski Sums of Polytopes.",
            "Ehrhart Polynomials of Matroid Polytopes and Polymatroids.",
            "Ehrhart Polynomials of Matroid Polytopes and Polymatroids.",
            "Delannoy Orthants of Legendre Polytopes.",
            "A Framework for the Construction of Self-replicating Tilings.",
            "Uniqueness in Discrete Tomography of Delone Sets with Long-Range Order.",
            "Visible Vectors and Discrete Euclidean Medial Axis."
        ]
    },
    {
        "name": "DCG",
        "year": "2008",
        "info": "2008: Volumes\n39,\n40",
        "count": 73,
        "papers": [
            "Foreword.",
            "There Are Not Too Many Magic Configurations.",
            "Computing the Detour and Spanning Ratio of Paths, Trees, and Cycles in 2D and 3D.",
            "Robust Shape Fitting via Peeling and Grating Coresets.",
            "Siegel's Lemma and Sum-Distinct Sets.",
            "Slicing Convex Sets and Measures by a Hyperplane.",
            "A Centrally Symmetric Version of the Cyclic Polytope.",
            "On Projections of Semi-Algebraic Sets Defined by Few Quadratic Inequalities.",
            "Enumeration in Convex Geometries and Associated Polytopal Subdivisions of Spheres.",
            "Isotopic Implicit Surface Meshing.",
            "Line Transversals to Disjoint Balls.",
            "Generating All Vertices of a Polyhedron Is Hard.",
            "Norm Bounds for Ehrhart Polynomial Roots.",
            "Helly-Type Theorems for Line Transversals to Disjoint Unit Balls.",
            "Grid Vertex-Unfolding Orthogonal Polyhedra.",
            "Empty Convex Hexagons in Planar Point Sets.",
            "Affinely Regular Polygons as Extremals of Area Functionals.",
            "Improved Output-Sensitive Snap Rounding.",
            "Pure Point Diffractive Substitution Delone Sets Have the Meyer Property.",
            "Metric Combinatorics of Convex Polyhedra: Cut Loci and Nonoverlapping Unfoldings.",
            "Empty Simplices of Polytopes and Graded Betti Numbers.",
            "Rigidity and the Lower Bound Theorem for Doubly Cohen-Macaulay Complexes.",
            "Finding the Homology of Submanifolds with High Confidence from Random Samples.",
            "Odd Crossing Number and Crossing Number Are Not the Same.",
            "Visibility Graphs of Point Sets in the Plane.",
            "Decomposability of Polytopes.",
            "An Inscribing Model for Random Polytopes.",
            "An Optimal-Time Algorithm for Shortest Paths on a Convex Polytope in Three Dimensions.",
            "General-Dimensional Constrained Delaunay and Constrained Regular Triangulations, I: Combinatorial Properties.",
            "Certificates of Positivity in the Bernstein Basis.",
            "Efficient Algorithms for Maximum Regression Depth.",
            "Weighted Derivations and the cd -Index.",
            "Discrete and Lexicographic Helly-Type Theorems.",
            "On Average Distortion of Embedding Metrics into the Line.",
            "A Sharper Estimate on the Betti Numbers of Sets Defined by Quadratic Inequalities.",
            "Embedding into linfinity2 Is Easy, Embedding into l infinity3 Is NP-Complete.",
            "Piercing Families of Convex Sets with the d -Intersection Property in R d .",
            "Automorphisms and Distinguishing Numbers of Geometric Cliques.",
            "There Are Integral Heptagons, no Three Points on a Line, no Four on a Circle.",
            "Note on the Pair-crossing Number and the Odd-crossing Number.",
            "Polyboxes, Cube Tilings and Rigidity.",
            "Enumerating Constrained Non-crossing Minimally Rigid Frameworks.",
            "Circle Patterns on Singular Surfaces.",
            "Schnyder Woods and Orthogonal Surfaces.",
            "Improved Bounds on the Union Complexity of Fat Objects.",
            "Geometric Realization of a Triangulation on the Projective Plane with One Face Removed.",
            "On the Number of Facets of Three-Dimensional Dirichlet Stereohedra III: Full Cubic Groups.",
            "Shellable Complexes and Topology of Diagonal Arrangements.",
            "A Dense Packing of Regular Tetrahedra.",
            "An Upper Bound on the Average Size of Silhouettes.",
            "Pin-Collinear Body-and-Pin Frameworks and the Molecular Conjecture.",
            "( m , n )-Equidistant Sets in \\mathbbRk, \\mathbbSk\\mathbb{R}^{k}, \\mathbb{S}^{k} , and P k .",
            "Ordering Cellular Spaces with Application to Curves and Knots.",
            "Line Transversals in Large T (3)- and T (4)-Families of Congruent Discs.",
            "Neighborly Embedded Manifolds.",
            "Reconstruction Using Witness Complexes.",
            "Set Partition Complexes.",
            "Ehrhart Series and Lattice Triangulations.",
            "Tight Bounds for Connecting Sites Across Barriers.",
            "A Polyhedral Model in Euclidean 3-Space of the Six-Pentagon Map of the Projective Plane.",
            "Distributions of Points in d Dimensions and Large k -Point Simplices.",
            "Aperture-Angle and Hausdorff-Approximation of Convex Figures.",
            "Topological Complexity of the Relative Closure of a Semi-Pfaffian Couple.",
            "Cores of Simplicial Complexes.",
            "On the Hardness of Computing Intersection, Union and Minkowski Sum of Polytopes.",
            "On the Number of Topological Types Occurring in a Parameterized Family of Arrangements.",
            "The Intrinsic Diameter of the Surface of a Parallelepiped.",
            "Asymmetry of Convex Polytopes and Vertex Index of Symmetric Convex Bodies.",
            "Analysis of Incomplete Data and an Intrinsic-Dimension Helly Theorem.",
            "A Variational Proof of Alexandrov's Convex Cap Theorem.",
            "On the Number of Birch Partitions.",
            "Minimizing the Stabbing Number of Matchings, Trees, and Triangulations.",
            "Self-Similar Tiling Systems, Topological Factors and Stretching Factors."
        ]
    },
    {
        "name": "DCG",
        "year": "2007",
        "info": "2007: Volumes\n37,\n38",
        "count": 85,
        "papers": [
            "Guest Editor's Foreword.",
            "Smaller Coresets for k-Median and k-Means Clustering.",
            "A Single Cell in an Arrangement of Convex Polyhedra in \\Bbb R3.",
            "Improved Approximation Algorithms for Geometric Set Cover.",
            "Inclusion-Exclusion Formulas from Independent Complexes.",
            "Multi-Pass Geometric Algorithms.",
            "Stability of Persistence Diagrams.",
            "Realizability of Graphs.",
            "Realizability of Graphs in Three Dimensions.",
            "Incidence Theorems for Pseudoflats.",
            "Average-Case Analysis of the Double Description Method and the Beneath-Beyond Algorithm.",
            "Optimal Arrangements in Packing Congruent Balls in a Spherical Container.",
            "Finding Shortest Non-Separating and Non-Contractible Cycles for Topologically Embedded Graphs.",
            "Covering Planar Graphs with a Fixed Number of Balls.",
            "Note on an Inequality of Wegner.",
            "Fiber Fans and Toric Quotients.",
            "Harmonic Algebraic Curves and Noncrossing Partitions.",
            "Sommerville's Missing Tetrahedra.",
            "Covering n-Segment Unit Arcs Is Not Sufficient.",
            "Volume and Lattice Points of Reflexive Simplices.",
            "Geodesic Ham-Sandwich Cuts.",
            "The Katchalski-Lewis Transversal Problem in Rn.",
            "Dynamic Enumeration of All Mixed Cells.",
            "Lines Tangent to Four Triangles in Three-Dimensional Space.",
            "Computing Modular Coincidences for Substitution Tilings and Point Sets.",
            "Line Transversals to Translates of Unit Discs.",
            "The Local Steiner Problem in Finite-Dimensional Normed Spaces.",
            "A Non-Regular Grobner Fan.",
            "New Non-Linear Inequalities for Flag-Vectors of 4-Polytopes.",
            "Frobenius Problem and the Covering Radius of a Lattice.",
            "A Note on the Kissing Numbers of Superballs.",
            "The Hadwiger Number of Jordan Regions Is Unbounded.",
            "f-Vectors of Minkowski Additions of Convex Polytopes.",
            "Realizations of the Associahedron and Cyclohedron.",
            "Finding a Guard that Sees Most and a Shop that Sells Most.",
            "Open Caps and Cups in Planar Point Sets.",
            "Covering Polygonal Annuli by Strips.",
            "Staircase Connected Sets.",
            "Stability and Computation of Topological Invariants of Solids in \\Bbb Rn.",
            "Which n-Venn Diagrams Can Be Drawn with Convex k-Gons?",
            "The Genus of a Digital Image Boundary Is Determined by Its Foreground, Background, and Reeb Graphs.",
            "Graph Treewidth and Geometric Thickness Parameters.",
            "Acute Triangulations of Flat Mobius Strips.",
            "New Lower Bounds for the Number of (<=k)-Edges and the Rectilinear Crossing Number of Kn.",
            "A Positive Semidefinite Approximation of the Symmetric Traveling Salesman Polytope.",
            "Banach-Mazur Distances and Projections on Random Subgaussian Polytopes.",
            "The On-Line Heilbronn's Triangle Problem in d Dimensions.",
            "Distance Measures for Well-Distributed Sets.",
            "Notes on the Roots of Ehrhart Polynomials.",
            "Paths of Trains with Two-Wheeled Cars.",
            "Coincidence Site Modules in 3-Space.",
            "Dimensionality Reductions in l2 that Preserve Volumes and Distance to Affine Spaces.",
            "A Note on Euclidean Ramsey Theory.",
            "A Smaller Sleeping Bag for a Baby Snake.",
            "The Number of k-Faces of a Simple d-Polytope.",
            "Foreword.",
            "Packing Cones and Their Negatives in Space.",
            "On a Generalization of Tarski's Plank Problem.",
            "Ball-Polyhedra.",
            "Polytopes of Minimal Volume with Respect to a Shell - Another Characterization ofthe Octahedron and the Icosahedron.",
            "Convexity in Topological Affine Planes.",
            "Best Partial Covering of a Convex Domain by Congruent Circles of a Given Total Area.",
            "Covering a Triangle with Positive and Negative Homothetic Copies.",
            "Proof of the Katchalski-Lewis Transversal Conjecture for T(3)-Families of Congruent Discs.",
            "Typical Cells in Poisson Hyperplane Tessellations.",
            "At Least n - 1 Intersection Points in a Connected Family of n Unit Circles in the Plane.",
            "Four-Dimensional Regular Polyhedra.",
            "The Empty Hexagon Theorem.",
            "Solution of Scott's Problem on the Number of Directions Determined by a Point Set in 3-Space.",
            "Multiple Coverings of the Plane with Triangles.",
            "Alcoved Polytopes, I.",
            "Stability of Critical Points with Interval Persistence.",
            "Tverberg's Transversal Conjecture and Analogues of Nonembeddability Theorems for Transversals.",
            "Enumeration of Non-Orientable 3-Manifolds Using Face-Pairing Graphs and Union-Find.",
            "How to Exhibit Toroidal Maps in Space.",
            "Simple Euclidean Arrangements with No (>= 5)-Gons.",
            "Concerning the Relationship between Realizations and Tight Spans of Finite Metrics.",
            "Plane Embeddings of Planar Graph Metrics.",
            "A Combinatorial Property of Points and Balls, a Colored Version.",
            "A Monotonicity Property for Weighted Delaunay Triangulations.",
            "Covering Spheres with Spheres.",
            "Pebble Sets in Convex Polygons.",
            "Pre-Triangulations and Liftable Complexes.",
            "Fréchet Embeddings of Negative Type Metrics.",
            "A Discrete Laplace-Beltrami Operator for Simplicial Surfaces."
        ]
    },
    {
        "name": "DCG",
        "year": "2006",
        "info": "2006: Volumes\n35,\n36",
        "count": 64,
        "papers": [
            "Apollonian Circle Packings: Geometry and Group Theory II. Super-Apollonian Group and Integral Packings.",
            "Apollonian Circle Packings: Geometry and Group Theory III. Higher Dimensions.",
            "Computational Approaches to Lattice Packing and Covering Problems.",
            "Tropical Secant Varieties of Linear Spaces.",
            "Polygons Needing Many Flipturns.",
            "Combinatorial Complexity of Convex Sequences.",
            "Packing Disks on a Torus.",
            "k-Sets in Four Dimensions.",
            "The Sylvester-Chvatal Theorem.",
            "Pseudo-Simplicial Complexes from Maximal Locally Convex Functions.",
            "Minkowski Sums of Monotone and General Simple Polygons.",
            "Rearrangement Inequalities and the Alternahedron.",
            "Compact Packings of the Plane with Two Sizes of Discs.",
            "Combinatorially Regular Polyomino Tilings.",
            "Common Tangents to Spheres in R3.",
            "Homogeneity Properties of Some l1-Spaces.",
            "The Angle Defect for Odd-Dimensional Simplicial Manifolds.",
            "Rhombus Tilings: Decomposition and Space Structure.",
            "Erratum to \"Pseudo-Triangulations, Rigidity and Motion Planning\".",
            "Sylvester-Gallai Theorems for Complex Numbers and Quaternions.",
            "The Kissing Problem in Three Dimensions.",
            "Neighborhood Complexes and Generating Functions for Affine Semigroups.",
            "Small Triangle-Free Configurations of Points and Lines.",
            "Lattice Points in Large Borel Sets and Successive Minima.",
            "The Stirling Polynomial of a Simplicial Complex.",
            "On the Bounded Complex of an Affine Oriented Matroid.",
            "The Maximal Number of Geometric Permutations for n Disjoint Translates of a Convex Set in R Is Omega(n).",
            "Bar-Magnet Polyhedra and NS-Orientations of Maps.",
            "Globally Linked Pairs of Vertices in Equivalent Realizations of Graphs.",
            "Tverberg-Type Theorems for Separoids.",
            "Elementary Moves on Triangulations.",
            "Distinct Distances in Homogeneous Sets in Euclidean Space.",
            "Volume Computation for Polytopes and Partition Functions for Classical Root Systems.",
            "Colourful Simplicial Depth.",
            "High-Dimensional Centrally Symmetric Polytopes with Neighborliness Proportional to Dimension.",
            "The Lifting Model for Reconfiguration.",
            "k-Sets, Convex Quadrilaterals, and the Rectilinear Crossing Number of Kn.",
            "Guest Editors' Foreword.",
            "Historical Overview of the Kepler Conjecture.",
            "A Formulation of the Kepler Conjecture.",
            "Sphere Packing, III. Extremal Cases.",
            "Sphere Packing, IV. Detailed Bounds.",
            "Sphere Packings, V. Pentahedral Prisms.",
            "Sphere Packings, VI. Tame Graphs and Linear Programs.",
            "How Neighborly Can a Centrally Symmetric Polytope Be?",
            "A Linear Time Algorithm for Constructing Maximally Symmetric Straight Line Drawings of Triconnected Planar Graphs.",
            "Homotopy Type of Complexes of Graph Homomorphisms between Cycles.",
            "A Geometric Study of the Split Decomposition.",
            "Isodiametric Problems for Polygons.",
            "There Is No Face-to-Face Partition of R5 into Acute Simplices.",
            "Unfolding of Surfaces.",
            "Three-Dimensional Delaunay Mesh Generation.",
            "Isometry-Invariant Valuations on Hyperbolic Space.",
            "Measuring Solid Angles Beyond Dimension Three.",
            "Some Incidence Theorems and Integrable Discrete Equations.",
            "Guest Editors' Foreword.",
            "On Distinct Distances from a Vertex of a Convex Polygon.",
            "On the Union of kappa-Round Objects in Three and Four Dimensions.",
            "Improving the Crossing Lemma by Finding More Crossings in Sparse Graphs.",
            "Extreme Elevation on a 2-Manifold.",
            "A Two-Dimensional Kinetic Triangulation with Near-Quadratic Topological Changes.",
            "On the Least Median Square Problem.",
            "Low-Dimensional Embedding with Extra Information.",
            "Range Counting over Multidimensional Data Streams."
        ]
    },
    {
        "name": "DCG",
        "year": "2005",
        "info": "2005: Volumes\n33,\n34",
        "count": 78,
        "papers": [
            "Editorial Note.",
            "The Randomized Integer Convex Hull.",
            "Some Low Distortion Metric Ramsey Problems.",
            "Radii of Regular Polytopes.",
            "Valuations on Convex Sets of Oriented Hyperplanes.",
            "Equilibrium Placement of Periodic Graphs and Convexity of Plane Tilings.",
            "Dense Point Sets Have Sparse Delaunay Triangulations or \"... But Not Too Nasty\".",
            "epsilon-Unit Distance Graphs.",
            "An Identity Relating Moments of Functionals of Convex Hulls.",
            "Covering a Ball with Smaller Equal Balls in Rn.",
            "The Space of Unordered Real Line Arrangements.",
            "Finite Coverings in the Hyperbolic Plane.",
            "Incidences between Points and Circles in Three and Higher Dimensions.",
            "A Rigidity Criterion for Non-Convex Polyhedra.",
            "A Note on Caterpillar-Embeddings with No Two Parallel Edges.",
            "Cutting Triangular Cycles of Lines in Space.",
            "Computing Persistent Homology.",
            "The Polytope of Non-Crossing Graphs on a Planar Point Set.",
            "An Improved Bound for Joints in Arrangements of Lines in Space.",
            "Canonical Ordering Trees and Their Applications in Graph Drawing.",
            "Allocating Vertex pi-Guards in Simple Polygons via Pseudo-Triangulations.",
            "Extremal Convex Planar Sets.",
            "Betti Numbers of Semialgebraic Sets Defined by Quantifier-Free Formulae.",
            "The Mixed Volume of Two Finite Vector Sets.",
            "Topology of Definable Hausdorff Limits.",
            "Oriented Matroids and Associated Valuations.",
            "A Near-Quadratic Algorithm for Fence Design.",
            "Almost Periodic Measures and Long-Range Order in Meyer Sets.",
            "Optimal System of Loops on an Orientable Surface.",
            "Obstructions to Shiftedness.",
            "Generic Global Rigidity.",
            "An Improved Bound on the One-Sided Minimum Crossing Number in Two-Layered Drawings.",
            "Output-Sensitive Algorithms for Computing Nearest-Neighbour Decision Boundaries.",
            "Pairs of Convex Bodies with Centrally Symmetric Intersections of Translates.",
            "The Envelope of Lines Meeting a Fixed Line and Tangent to Two Spheres.",
            "The Topological Representation of Oriented Matroids.",
            "Lower Bounds for Simplicial Covers and Triangulations of Cubes.",
            "Monotone Paths in Line Arrangements with a Small Number of Directions.",
            "On the Lp Minkowski Problem for Polytopes.",
            "Covering Things with Things.",
            "Forbidden Families of Geometric Permutations in Rd.",
            "On Levels in Arrangements of Curves, II: A Simple Inequality and Its Consequences.",
            "Partitions of a Polytope and Mappings of a Point Set to Facets.",
            "Conflict-Free Coloring of Points and Simple Regions in the Plane.",
            "Bier Spheres and Posets.",
            "Equipartitions of Measures by 2-Fans.",
            "Improved Dense Packings of Congruent Squares in a Square.",
            "Configurations of Flats, I: Manifolds of Points in the Projective Line.",
            "Covering with Fat Convex Discs.",
            "Hyperbolic Regular Polygons with Notched Edges.",
            "Maximal Dimension of Unit Simplices.",
            "Chiral Polyhedra in Ordinary Space, II.",
            "Lines Avoiding Unit Balls in Three Dimensions.",
            "Criteria for Balance in Abelian Gain Graphs, with Applications to Piecewise-Linear Geometry.",
            "Real Root Conjecture Fails for Five- and Higher-Dimensional Spheres.",
            "Geometric Permutations Induced by Line Transversals through a Fixed Point.",
            "Dissection of a Triangle into Similar Triangles.",
            "Tiling a Polygon with Two Kinds of Rectangles.",
            "Lower Bound for the Maximal Number of Facets of a 0/1 Polytope.",
            "Stability of the Minkowski Measure of Asymmetry for Convex Bodies.",
            "The Geometry of Random {-1, 1}-Polytopes.",
            "Transversals to Line Segments in Three-Dimensional Space.",
            "Sums, Projections, and Sections of Lattice Sets, and the Discrete Covariogram.",
            "Grid Orientations, (d, d+2)-Polytopes, and Arrangements of Pseudolines.",
            "The Voronoi Diagram of Curved Objects.",
            "The Width of the Transversal Strips of T(3)-Families in the Plane.",
            "New Upper Bound on the Transversal Width of T(3)-Families of Discs.",
            "Some Bounds for the Number of Components of Real Zero Sets of Sparse Polynomials.",
            "On the Chromatic Number of the Visibility Graph of a Set of Points in the Plane.",
            "Families of Tight Inequalities for Polytopes.",
            "Non-Periodic Rhomb Substitution Tilings that Admit Order n Rotational Symmetry.",
            "A New Packing Density Bound in 3-Space.",
            "Apollonian Circle Packings: Geometry and Group Theory I. The Apollonian Group.",
            "Acute Triangulations of Polygons.",
            "Drapeability.",
            "Quantitative Generalized Bertini-Sard Theorem for Smooth Affine Varieties.",
            "Geometric Graphs with No Three Disjoint Edges.",
            "Acute Triangulations of Polygons."
        ]
    },
    {
        "name": "DCG",
        "year": "2004",
        "info": "2004: Volumes\n31,\n32",
        "count": 79,
        "papers": [
            "Guest Editor's Foreword.",
            "The Power of Nonmonotonicity in Geometric Searching.",
            "Quickest Paths, Straight Skeletons, and the City Voronoi Diagram.",
            "Optimally Cutting a Surface into a Disk.",
            "Testing Homotopy for Paths in the Plane.",
            "Polyhedral Voronoi Diagrams of Polyhedra in Three Dimensions.",
            "The One-Round Voronoi Game.",
            "Pseudo Approximation Algorithms with Applications to Optimal Motion Planning.",
            "Sylvester-Gallai Theorem and Metric Betweenness.",
            "Acute Triangulations of the Regular Icosahedral Surface.",
            "Binary Space Partitions for Axis-Parallel Segments, Rectangles, and Hyperrectangles.",
            "Linear Inequalities for Rank 3 Geometric Lattices.",
            "Distance Sets of Well-Distributed Planar Point Sets.",
            "Bounded VC-Dimension Implies a Fractional Helly Theorem.",
            "Relationships Among Flag f-Vector Inequalities for Polytopes.",
            "Expanding Polynomials and Connectedness of Self-Affine Tiles.",
            "The Number of Embeddings of Minimally Rigid Graphs.",
            "Intersection and Linking Numbers in Oriented Matroids.",
            "Aperiodic Linearly Repetitive Delone Sets Are Densely Repetitive.",
            "The Extreme Points of Subsets of s-Concave Probabilities and a Geometric Localization Theorem.",
            "Metric Embeddings--Beyond One-Dimensional Distortion.",
            "An Inequality for Circle Packings Proved by Semidefinite Programming.",
            "A Linear Bound on the Complexity of the Delaunay Triangulation of Points on Polyhedral Surfaces.",
            "On Linear Programming Bounds for Spherical Codes and Designs.",
            "Decompositions and Connectivity of Matching and Chessboard Complexes.",
            "No Helly Theorem for Stabbing Translates by Lines in R 3.",
            "Mazur Sets in Normed Spaces.",
            "Crumpled Cube and Solid Horned Sphere Space Fillers.",
            "Sharp Bounds for Vertical Decompositions of Linear Arrangements in Four Dimensions.",
            "Classes of Discrete Convexity Properties.",
            "The Number of Isosceles Right Triangles Determined by n Points in Convex Position in the Plane.",
            "Large Cells in Poisson-Delaunay Tessellations.",
            "Gram Matrix Analysis of Finite Distance Spaces in Constant Curvature.",
            "Clustering Motion.",
            "The Tight Span of an Antipodal Metric Space: Part II--Geometrical Properties.",
            "Properties of R-Sausages.",
            "The Thirteen Spheres: A New Proof.",
            "Finding the Sink Takes Some Time: An Almost Quadratic Lower Bound for Finding the Sink of Unique Sink Oriented Cubes.",
            "Some Characterizations of Ellipsoids by Sections.",
            "More About 4-Isosceles Planar Sets.",
            "Regular Polytopes of Full Rank.",
            "Computing the Writhing Number of a Polygonal Knot.",
            "Chiral Polyhedra in Ordinary Space, I.",
            "The Kneser-Poulsen Conjecture for Spherical Polytopes.",
            "Cell Complexities in Hyperplane Arrangements.",
            "Construction of a 3/4-Ideal Hyperbolic Tetrahedron out of Ideal Tetrahedra.",
            "The Integer Hull of a Convex Rational Polytope.",
            "A Small Cover for Convex Unit Arcs.",
            "The Alexandroff Dimension of Quotients of R 2.",
            "Guest Editor's Foreword.",
            "Long Monotone Paths in Line Arrangements.",
            "Euclidean Bounded-Degree Spanning Tree Ratios.",
            "New Constructions of Weak epsilon-Nets.",
            "Fault-Tolerant Geometric Spanners.",
            "Loops in Reeb Graphs of 2-Manifolds.",
            "Shape Dimension and Intrinsic Metric from Samples of Manifolds.",
            "High-Dimensional Shape Fitting in Linear Time.",
            "The Area Derivative of a Space-Filling Diagram.",
            "Unflippable Tetrahedral Complexes.",
            "Relaxation, New Combinatorial and Polynomial Algorithms for the Linear Feasibility Problem.",
            "Stabbing Delaunay Tetrahedralizations.",
            "Convexity Properties of the Cone of Nonnegative Polynomials.",
            "Directed Trees in a String, Real Polynomials with Triple Roots, and Chain Mails.",
            "Approximation of the Normal Vector Field and the Area of a Smooth Surface.",
            "Hierarchical Decompositions and Circular Ray Shooting in Simple Polygons.",
            "Properness Defects of Projections and Computation of at Least One Point in Each Connected Component of a Real Algebraic Set.",
            "Guest Editors' Preface.",
            "The Partial-Fractions Method for Counting Solutions to Integral Linear Systems.",
            "Isoradial Bodies.",
            "Vertices of Gelfand-Tsetlin Polytopes.",
            "A Complexity Bound on Faces of the Hull Complex.",
            "Enumerative Properties of Ferrers Graphs.",
            "Tchebyshev Posets.",
            "Mixed Fibre Polytopes.",
            "Inequalities for the h-Vectors and Flag h-Vectors of Geometric Lattices.",
            "Convex Combinatorial Optimization.",
            "Non-Crossing Frameworks with Non-Crossing Reciprocals.",
            "The E t-Construction for Lattices, Spheres and Polytopes.",
            "Graphs, Syzygies, and Multivariate Splines."
        ]
    },
    {
        "name": "DCG",
        "year": "2003",
        "info": "2003: Volumes\n29,\n30",
        "count": 81,
        "papers": [
            "The Size of Spanning Disks for Polygonal Curves.",
            "The Euclidean Distortion of Complete Binary Trees.",
            "Densest Packing of Equal Spheres in Hyperbolic Space.",
            "The Combinatorial and Topological Complexity of a Single Cell.",
            "A Space of Cyclohedra.",
            "A Lower Bound on the Distortion of Embedding Planar Metrics into Euclidean Space.",
            "Circular Cylinders through Four or Five Points in Space.",
            "In between k -Sets, j -Facets, and i -Faces: (i , j) - Partitions.",
            "A Note on the Minimal Volume of Almost Cubic Parallelepipeds.",
            "On the Identification of Sets of Points in the Square Lattice.",
            "Finding Sets of Points without Empty Convex 6-Gons.",
            "A Constant Bound for Geometric Permutations of Disjoint Unit Balls.",
            "Substitution Delone Sets.",
            "Topological Complexity of Motion Planning.",
            "A Euclidean Ramsey Problem.",
            "Anchored Hyperplane Location Problems.",
            "An Isoperimetric Theorem in Plane Geometry.",
            "Mixed Volume Computation for Semi-Mixed Systems.",
            "Reconstruction of Convex Bodies from Brightness Functions.",
            "Imbedded Circle Patterns with the Combinatorics of the Square Grid and Discrete Painlevé Equations.",
            "Bochner's Method for Cell Complexes and Combinatorial Ricci Curvature.",
            "On Levels in Arrangements of Curves.",
            "New Bounds on the Katchalski-Lewis Transversal Problem.",
            "An Improved Upper Bound for Leo Moser's Worm Problem.",
            "Shape Dimension and Approximation from Samples.",
            "Quotients of Some Finite Universal Locally Projective Polytopes.",
            "Doubly Transitive Automorphism Groups of Combinatorial Surfaces.",
            "Detecting Combinatorial Hierarchy in Tilings Using Derived Voronoi Tessellations.",
            "Covering the Plane with Fat Ellipses without Non-Crossing Assumption.",
            "The Representation of Polyhedra by Polynomial Inequalities.",
            "Tverberg's Conjecture.",
            "A General Notion of Visibility Graphs.",
            "Consequences of Pure Point Diffraction Spectra for Multiset Substitution Systems.",
            "The Characteristic Intersection Property of Line-Free Choquet Simplices in Ed.",
            "Mixed Polytopes.",
            "A Helly-Type Theorem for Line Transversals to Disjoint Unit Balls.",
            "The Heighway Dragon Revisited.",
            "Perfect Packings of Squares Using the Stack-Pack Strategy.",
            "Guest Editor's Foreword.",
            "A Note on Binary Plane Partitions.",
            "A Fully Dynamic Algorithm for Planar Width.",
            "Segment Intersection Searching Problems in General Settings.",
            "Discrete Mobile Centers.",
            "Different Bounds on the Different Betti Numbers of Semi-Algebraic Sets.",
            "Hierarchical Morse - Smale Complexes for Piecewise Linear 2-Manifolds.",
            "Nice Point Sets Can Have Nasty Delaunay Triangulations.",
            "The Union of Congruent Cubes in Three Dimensions.",
            "Guest Editors' Foreword.",
            "Total Curvature and Spiralling Shortest Paths.",
            "Covering an Annulus by Strips.",
            "The Radon Number of the Three-Dimensional Integer Lattice.",
            "Finite packing and covering by congruent convex domains.",
            "Small convex polytopes with long edges and many vertices.",
            "Blowing Up Polygonal Linkages.",
            "Some Densest Two-Size Disc Packings in the Plane.",
            "Slicing the Pie.",
            "Point Configurations in d-Space without Large Subsets in Convex Position.",
            "The Determination of a Convex Set from Its Angle Function.",
            "The Complexity of Hyperplane Depth in the Plane.",
            "Unavoidable Configurations in Complete Topological Graphs.",
            "A Partitioned Version of the Erdös-Szekeres Theorem for Quadrilaterals.",
            "Note on Integral Distances.",
            "A Volume Formual for Medial Sections of Simplices.",
            "Facility Location on a Polyhedral Surface.",
            "The Density of Shapes in Three-Dimensional Barycentric Subdivision.",
            "Counting Real Connected Components of Trinomial Curve Intersections and m-nomial Hypersurfaces.",
            "Lines With Many Points On Both Sides.",
            "Complexity of the Delaunay Triangulation of Points on Polyhedral Surfaces.",
            "The Number of Cylindrical Shells.",
            "An isosceles triangle that tiles the sphere in exactly three ways.",
            "Tilings of the Sphere with Isosceles Triangles.",
            "Illuminating Disjoint Line Segments in the Plane.",
            "Asymptotically Efficient Triangulations of the d-Cube.",
            "Combinatorics of Polytopes with a Group of Linear Symmetries of Prime Power Order.",
            "Common Transversals and Tangents to Two Lines and Two Quadrics in P.",
            "A Note on Shelling.",
            "Spanning Trees Crossing Few Barriers.",
            "Expressing the box cone radius in the relational calculus with real polynomial constraints.",
            "The Ehrhart Polynomial of the Birkhoff Polytope.",
            "On the Complexity of Halfspace Area Queries.",
            "The \"Point\" Goalie Problem."
        ]
    },
    {
        "name": "DCG",
        "year": "2002",
        "info": "2002: Volumes\n27,\n28",
        "count": 81,
        "papers": [
            "Guest Editors' Foreword.",
            "Infinitesimal Hopf Algebras and the cd-Index of Polytopes.",
            "The Number of Triangulations of the Cyclic Polytope C (n, n-4).",
            "A Combinatorial Study of Multiplexes and Ordinary Polytopes.",
            "Lattice Polytopes with Distinct Pair-Sums.",
            "A Commutative Algebra for Oriented Matroids.",
            "Canonical Modules of Semigroup Rings and a Conjecture of Reiner.",
            "Convex, Acyclic, and Free Sets of an Oriented Matroid.",
            "Generation of Oriented Matroids - A Graph Theoretical Approach.",
            "Examples of Z-Acyclic and Contractible Vertex-Homogeneous Simplicial Complexes.",
            "Circuit Admissible Triangulations of Oriented Matroids.",
            "Bounds for Local Density of Sphere Packings and the Kepler Conjecture.",
            "On the Topology of the Combinatorial Flag Varieties.",
            "Hyperplane projections of the unit ball of lpn.",
            "A Dido Problem as Modernized by Fejes Toth.",
            "On asymmetry of some convex bodies.",
            "Combinatorics of the Toric Hilbert Scheme.",
            "The Alexandroff Dimension of Digital Quotients of Euclidean Spaces.",
            "About 4-Isosceles Planar Sets.",
            "Equipartition of Two Measures by a 4-Fan.",
            "Perpendicular Dissections of Space.",
            "Closed-Form Expressions for Uniform Polyhedra and Their Duals.",
            "Separoids, Their Categories and a Hadwiger-Type Theorem for Transversals.",
            "Helly-Type Theorems on the Homology of the Space of Transversals.",
            "Kalai's Squeezed 3-Spheres Are Polytopal.",
            "Momentopes, the Complexity of Vector Partitioning, and Davenport - Schinzel Sequences.",
            "On a Conjecture of A. Bezdek.",
            "Explicit and Efficient Formulas for the Lattice Point Count in Rational Polygons Using Dedekind - Rademacher Sums.",
            "Visibility Queries and Maintenance in Simple Polygons.",
            "The Mean Number of Extreme Lines in a Convex Hull of Lines.",
            "Fractional Power Series Solutions for Systems of Equations.",
            "A Deterministic Algorithm for Approximating the Mixed Discriminant and Mixed Volume, and a Combinatorial Corollary.",
            "Toric Ideals and an Infinite Family of Normal (0, 1)-Polytopes without Unimodular Regular Triangulations.",
            "K-Levels of Concave Surfaces.",
            "Fractional Planks.",
            "A Polytope Related to Empirical Distributions, Plane Trees, Parking Functions, and the Associahedron.",
            "Approximation Results for Kinetic Variants of TSP.",
            "Multivariate Regression Depth.",
            "The Tilt Formula for Generalized Simplices in Hyperbolic Space.",
            "Examples and Counterexamples for the Perles Conjecture.",
            "A Lower Bound for Weak epsilon-Nets in High Dimension.",
            "Classification of Integral Expanding Matrices and Self-Affine Tiles.",
            "Improving Rogers' Upper Bound for the Density of Unit Ball Packings via Estimating the Surface Area of Voronoi Cells from Below in Euclidean d-Space for All d>=8.",
            "Improved Linear Programming Bounds for Antipodal Spherical Codes.",
            "Packings of Unequal Circles in a Convex Set.",
            "The Number of Congruent Simplices in a Point Set.",
            "Combinatorics and Quotients of Toric Varieties.",
            "Lattice Points, Dedekind Sums, and Ehrhart Polynomials of Lattice Polyhedra.",
            "Geometric Optimization Problems Likely Not Contained in $$\\mathbb{A}\\mathbb{P}\\mathbb{X}$$.",
            "Perfect Partitions of Convex Sets in the Plane.",
            "Triangulated Spheres and Colored Cliques.",
            "Flipturning Polygons.",
            "Random Spaces Generated by Vertices of the Cube.",
            "A Cube Tiling of Dimension Eight with No Facesharing.",
            "A Short Simplicial h-Vector and the Upper Bound Theorem.",
            "Box-Trees and R-Trees with Near-Optimal Query Time.",
            "Isoperimetric Constants of Infinite Plane Graphs.",
            "Degrees of Real Wronski Maps.",
            "NP - Hardness of Largest Contained and Smallest Containing Simplices for V- and H-Polytopes.",
            "Line Transversals to Unit Disks.",
            "On Extremal Finite Packings.",
            "Configurations of 2n-2 Quadrics in Rn with 3 times 2n-1 Common Tangent Lines.",
            "The Kernel of the Adjacency Matrix of a Rectangular Mesh.",
            "Congruence by Dissection of Topological Discs - An Elementary Approach to Tarski's Circle Squaring Problem.",
            "Guest Editors' Foreword.",
            "Visibility Graphs and Oriented Matroids.",
            "The Unit Distance Problem for Centrally Symmetric Convex Polygons.",
            "Cutting Circles into Pseudo-Segments and Improved Bounds for Incidences% and Complexity of Many Faces.",
            "The Number of Directions Determined by Points in the Three-Dimensional Euclidean Space.",
            "Combinatorial Geometry Problems in Pattern Recognition.",
            "Topological Persistence and Simplification.",
            "New Similarity Measures between Polylines with Applications to Morphing and Polygon Sweeping.",
            "Restricted Point Configurations with Many Collinear {k}-Tuplets.",
            "Almost Disjoint Triangles in 3-Space.",
            "Untangling a Polygon.",
            "Recognizing String Graphs Is Decidable.",
            "Gallai - Sylvester Theorem for Pairwise Intersecting Unit Circles.",
            "The Partitioned Version of the Erdös - Szekeres Theorem.",
            "The k Most Frequent Distances in the Plane.",
            "Independence Numbers of Planar Contact Graphs.",
            "A Sufficient Condition for the Existence of Large Empty Convex Polygons."
        ]
    },
    {
        "name": "DCG",
        "year": "2001",
        "info": "2001: Volumes\n25,\n26",
        "count": 72,
        "papers": [
            "The Honeycomb Conjecture.",
            "A Remark on the Rank of Positive Semidefinite Matrices Subject to Affine Constraints.",
            "Plane Sections of Convex Bodies of Maximal Volume.",
            "Polytopes in Arrangements.",
            "Simple Paradoxical Replications of Sets.",
            "Convex Dimension of Locally Planar Convex Geometries.",
            "Approximation of Quasisymmetries Using Circle Packings.",
            "Geometric Construction of a Coboundary of a Cycle.",
            "Curvature and Geometry of Tessellating Plane Graphs.",
            "Face-Transitive Polyhedra with Rectangular Faces and Icosahedral Symmetry.",
            "Lattice Substitution Systems and Model Sets.",
            "On the Number of Regular Vertices of the Union of Jordan Regions.",
            "An Approach to Hierarchical Clustering via Level Surfaces and Convexity.",
            "An Efficient Algorithm for the Three-Dimensional Diameter Problem.",
            "Isoperimetric Quotients for a Decomposed Convex Body.",
            "Voronoi Diagrams for Convex Polygon-Offset Distance Functions.",
            "About the Error Term for Best Approximation with Respect to the Hausdorff Related Metrics.",
            "An Addition to Art Galleries with Interior Walls.",
            "Simultaneous Partitions of Measures by k-Fans.",
            "Conical Equipartitions of Mass Distributions.",
            "Entering and Leaving j-Facets.",
            "Inequalities between Lattice Packing and Covering Densities of Centrally Symmetric Plane Convex Bodies.",
            "On Directional Convexity.",
            "Drawing Planar Graphs with Circular Arcs.",
            "On the Number of Facets of Three-Dimensional Dirichlet Stereohedra I: Groups with Reflections.",
            "Crystallography and Riemann Surfaces.",
            "The Screensaver Map: Dynamics on Elliptic Curves Arising from Polygonal Folding.",
            "Guest Editors' Foreword.",
            "A Helly-Type Theorem for Hyperplane Transversals to Well-Separated Convex Sets.",
            "The Discrepancy of Boxes in Higher Dimension.",
            "Dynamic Skin Triangulation.",
            "A Simple Sampling Lemma: Analysis and Applications in Geometric Optimization.",
            "Kinetic Connectivity for Unit Disks.",
            "On the Number of Balanced Lines.",
            "Distinct Distances in the Plane.",
            "Common Tangents to Four Unit Balls in R3.",
            "Online Point Location in Planar Arrangements and Its Applications.",
            "Intrinsic Volumes of the Brownian Motion Body.",
            "Triangles of Extremal Area or Perimeter in a Finite Planar Point Set.",
            "Edge Close Ball Packings.",
            "Grid Drawings of 4-Connected Plane Graphs.",
            "Decomposition of Polytopes and Polynomials.",
            "Reconstructing Convex Polygons in the Plane from One Directed X-Ray.",
            "On Quasiperiodic Space Tilings, Inflation, and Dehn Invariants.",
            "A Smaller Sleeping Bag for a Baby Snake.",
            "Guest Editor's Foreword.",
            "Point Sets with Many k-Sets.",
            "An Improved Bound for k-Sets in Three Dimensions.",
            "A Continuous Analogue of the Upper Bound Theorem.",
            "A Trace Bound for the Hereditary Discrepancy.",
            "An Optimal Deterministic Algorithm for Computing the Diameter of a Three-Dimensional Point Set.",
            "A Randomized Algorithm for Triangulating a Simple Polygon in Linear Time.",
            "Locked and Unlocked Polygonal Chains in Three Dimensions.",
            "Lower Bounds on the Transversal Numbers of d-Intervals.",
            "Characterization of Planar Pseudo-Self-Similar Tilings.",
            "Exact and Approximation Algorithms for Minimum-Width Cylindrical Shells.",
            "Bounded Valence Excess and the Parabolicity of Tilings.",
            "Maintaining the Extent of a Moving Point Set.",
            "On the Pentomino Exclusion Problem.",
            "Every Set of Disjoint Line Segments Admits a Binary Tree.",
            "Linear Repetitivity, I. Uniform Subadditive Ergodic Theorems and Applications.",
            "Equivelar Polyhedra with Few Vertices.",
            "On the Complexity of Arrangements of Circles in the Plane.",
            "Lines Tangent to Four Unit Spheres with Coplanar Centres.",
            "Approximation for Minimum Triangulations of Simplicial Convex 3-Polytopes.",
            "Cyclic Product Theorems for Polygons (II) Constructions using Conic Sections.",
            "Solution of the Illumination Problem for Bodies with md M=2.",
            "A Tight Bound on the Number of Geometric Permutations of Convex Fat Objects in Rd.",
            "Recognition of Flat Orbifolds and the Classification of Tilings in R3.",
            "Hard Tiling Problems with Simple Tiles.",
            "Disk-Like Self-Affine Tiles in R2.",
            "A Characterization of Astral (n4) Configurations."
        ]
    },
    {
        "name": "DCG",
        "year": "2000",
        "info": "2000: Volumes\n23,\n24",
        "count": 84,
        "papers": [
            "Counting the Interior Points of a Point Configuration.",
            "Triangulations with Very Few Geometric Bistellar Neighbors.",
            "A Central Limit Theorem for Convex Chains in the Square.",
            "Coverings of Convex Sets and Volume Inequalities.",
            "On Simple Polygonalizations with Optimal Area.",
            "Semistable Reduction in Characteristic Zero for Families of Surfaces and Threefolds.",
            "A Theorem on Higher Bruhat Orders.",
            "On the Maximum Number of Equilateral Triangles, I.",
            "Sections of the Difference Body.",
            "A Condition for Sets in R3 to be Cones.",
            "On Random Sections of the Cube.",
            "On the Complexity of the Union of Fat Convex Objects in the Plane.",
            "Bounds for Generalized Thrackles.",
            "Integer Optimization on Convex Semialgebraic Sets.",
            "Solid Coverings of the Euclidean Plane with Incongruent Circles.",
            "Sharp Bounds on Geometric Permutations of Pairwise Disjoint Balls in Rd.",
            "Cutting Polytopes and Flag f-Vectors.",
            "Efficient Algorithms for Approximating Polygonal Chains.",
            "A Note on Geometric Embeddings of Simplicial Complexes in a Euclidean Space.",
            "Regression Depth and Center Points.",
            "A Bound on the Ratio between the Packing and Covering Densities of a Convex Body.",
            "Asymptotic Behavior of a Set-Statistic.",
            "Voronoi Diagrams and Convex Hulls of Random Moving Points.",
            "Decomposing the Secondary Cayley Polytope.",
            "The Missing Boundaries of the Santaló Diagrams for the Cases (d, w, R) and (w, R, r).",
            "On Minimum Stars and Maximum Matchings.",
            "Dihedral Angles of Convex Polyhedra.",
            "Growth Rates in the Quaquaversal Tiling.",
            "Computing the Degree-4 Shortest Network under a Given Topology.",
            "Relations in SO (3) Supported by Geodetic Angles.",
            "Medians of Discrete Sets according to a Linear Distance.",
            "The Euler Characteristic Is the Unique Locally Determined Numerical Invariant of Finite Simplicial Complexes which Assigns the Same Number to Every Cone.",
            "The Graph of Triangulations of a Point Configuration with d +4 Vertices Is 3-Connected.",
            "On the Structure of Multiple Translational Tilings by Polygonal Regions.",
            "Separating Maps of the Lattice E8 and Triangulations of the Eight-Dimensional Torus.",
            "Morphing Simple Polygons.",
            "Minimal Simplicial Dissections and Triangulations of Convex 3-Polytopes.",
            "Affine Maps That Induce Polyhedral Complex Isomorphisms.",
            "On Approximate Geometric k-Clustering.",
            "On Holyhedra.",
            "Embedding Tree Metrics into Low-Dimensional Euclidean Spaces.",
            "How Many Diagonal Rectangles Are Needed to Cover an Orthogonal Polygon?",
            "A Generalized Conjecture about Cutting a Polygon into Triangles of Equal Areas.",
            "Guest Editors' Foreword.",
            "Covering Squares with Squares.",
            "On the Helly Number for Hyperplane Transversals to Unit Balls.",
            "Oriented Matroid Rigidity of Multiplices.",
            "Face Numbers of Scarf Complexes.",
            "On the Generation of Oriented Matroids.",
            "Cardinalities of Primitive Fixing Systems for Convex Bodies.",
            "Finding Optimal Shadows of Polytopes.",
            "Realizations of Regular Abstract Polyhedra of Types {3, 6} and {6, 3}.",
            "On the Cocircuit Graph of an Oriented Matroid.",
            "The Blocking Numbers of Convex Bodies.",
            "4-Regular Vertex-Transitive Tilings of E3.",
            "Some Properties of Graphs of Diameters.",
            "Stability Theorems for Two Measures of Symmetry.",
            "Ubiquitous Angles in Equiangular Sets of Lines.",
            "Neighborly Cubical Polytopes.",
            "Transversals for Families of Translates of a Two-Dimensional Convex Compact Set.",
            "Hadwiger - Wills-Type Higher-Dimensional Generalizations of Pick's Theorem.",
            "Mutation Polynomials and Oriented Matroids.",
            "Kalai's Squeezed Spheres Are Shellable.",
            "Simplices with Equiareal Faces.",
            "Three Theorems, with Computer-Aided Proofs, on Three-Dimensional Faces and Quotients of Polytopes.",
            "Convex and Linear Orientations of Polytopal Graphs.",
            "Icosahedra Constructed from Congruent Triangles.",
            "Realizations of Regular Toroidal Maps of Type {4, 4}.",
            "A Double Tiling of Triangles and Regular Hexagons.",
            "Cutting Glass.",
            "Hamiltonian Cycles in T-Graphs.",
            "Finding Small Triangulations of Polytope Boundaries Is Hard.",
            "Unilateral and Equitransitive Tilings by Squares.",
            "Mixed Functionals of Convex Bodies.",
            "Densest Packings of More than Three d -Spheres Are Nonplanar.",
            "Cyclic Product Theorems for Polygons (I) Constructions using Circles.",
            "Guest Editor's Foreword.",
            "Curve Reconstruction, the Traveling Salesman Problem, and Menger's Theorem on Length.",
            "Generalizing Ham Sandwich Cuts to Equitable Subdivisions.",
            "New Bounds on Crossing Numbers.",
            "Pipes, Cigars, and Kreplach: the Union of Minkowski Sums in Three Dimensions.",
            "Approximation Algorithms for Minimum-Width Annuli and Shells.",
            "Edgewise Subdivision of a Simplex.",
            "Lower Bounds for Kinetic Planar Subdivisions."
        ]
    },
    {
        "name": "DCG",
        "year": "1999",
        "info": "1999: Volumes\n21,\n22",
        "count": 80,
        "papers": [
            "The Number of k -Faces of a Simple d -Polytope.",
            "Angular Properties of Delaunay Diagrams in Any Dimension.",
            "A Helly Type Conjecture.",
            "Approximating Planar Rotations.",
            "Incremental Convex Hull Algorithms Are Not Output Sensitive.",
            "On the Determination of Star and Convex Bodies by Section Functions.",
            "Deformable Smooth Surface Design.",
            "Piles of Cubes, Monotone Path Polytopes, and Hyperplane Arrangements.",
            "The Number of Geometric Bistellar Neighbors of a Triangulation.",
            "Nonexistence of Certain Spherical Designs of Odd Strengths and Cardinalities.",
            "Geometric Models for Quasicrystals I. Delone Sets of Finite Type.",
            "On Galleries with No Bad Points.",
            "A Normal (0, 1)-Polytope None of Whose Regular Triangulations Is Unimodular.",
            "Hilbert Bases, Unimodular Triangulations, and Binary Covers of Rational Polyhedral Cones.",
            "Approximate Shortest Paths and Geodesic Diameter on a Convex Polytope in Three Dimensions.",
            "On the Kissing Numbers of Some Special Convex Bodies.",
            "Resolvable Representation of Polyhedra.",
            "Geometric Pattern Matching in d -Dimensional Space.",
            "Intersection Properties of Families of Convex (n, d)-Bodies.",
            "All Polytopes Are Quotients, and Isomorphic Polytopes Are Quotients by Conjugate Subgroups.",
            "Tiling Space by Platonic Solids, I.",
            "On the Boundary of the Union of Planar Convex Sets.",
            "Randomized Complexity Lower Bound for Arrangements and Polyhedra.",
            "Geometric Models for Quasicrystals II. Local Rules Under Isometries.",
            "Line Transversals of Balls and Smallest Enclosing Cylinders in Three Dimensions.",
            "On Flag Vectors, the Dowling Lattice, and Braid Arrangements.",
            "Finding the Medial Axis of a Simple Polygon in Linear Time.",
            "Quasicrystals and the Wulff-Shape.",
            "Vertex Degrees of Steiner Minimal Trees in lpd and Other Smooth Minkowski Spaces.",
            "Parallelotopes of Maximum Volume in a Simplex.",
            "Self-Replicating Tiles and Their Boundary.",
            "Stresses and Liftings of Cell-Complexes.",
            "Shellings and the Lower Bound Theorem.",
            "Approximating Minimum-Weight Triangulations in Three Dimensions.",
            "Subalgebras of the Stanley - Reisner Ring.",
            "New Maximal Numbers of Equilibria in Bimatrix Games.",
            "Enumerating Regular Mixed-Cell Configurations.",
            "A Characterization of Gram Matrices of Polytopes.",
            "Straight-Line Embeddings of Two Rooted Trees in the Plane.",
            "Isohedral Polyomino Tiling of the Plane.",
            "On Bounding the Betti Numbers and Computing the Euler Characteristic of Semi-Algebraic Sets.",
            "Discrete Solutions of Dirichlet Problems, Finite Volumes, and Circle Packings.",
            "Empilements de cercles et discrétisation quasiconforme: comportement asymptotique des rayons.",
            "Nearest Neighbor Queries in Metric Spaces.",
            "Obstructions to Shellability.",
            "Properties of Random Triangulations and Trees.",
            "Coherence and Enumeration of Tilings of 3-Zonotopes.",
            "Spatial Graphs and Oriented Matroids: the Trefoil.",
            "Minkowski Circle Packings on the Sphere.",
            "Depth in an Arrangement of Hyperplanes.",
            "Infinitesimal Rigidity of Convex Polytopes.",
            "A Characterization of Homothetic Simplices.",
            "Motion Planning for a Convex Polygon in a Polygonal Environment.",
            "Nonconstructible Simplicial Balls and a Way of Testing Constructibility.",
            "The Translative Kissing Number of Tetrahedra Is 18.",
            "Art Galleries with Interior Walls.",
            "On Generalized h -Vectors of Rational Polytopes with a Symmetry of Prime Order.",
            "On the Area Bisectors of a Polygon.",
            "On a Characterization of Gauss Codes.",
            "Configuration Spaces of Mechanical Linkages.",
            "On Angles Whose Squared Trigonometric Functions Are Rational.",
            "Flipping Edges in Triangulations.",
            "On the Volume Formula for Hyperbolic Tetrahedra.",
            "Almost-Tiling the Plane by Ellipses.",
            "Finding the Shortest Watchman Route in a Simple Polygon.",
            "On Grünbaum's Conjecture about Inner Illumination of Convex Bodies.",
            "Convexity and the Beta Invariant.",
            "A Construction of H4 without Miracles.",
            "Triangles in Euclidean Arrangements.",
            "More Optimal Packings of Equal Circles in a Square.",
            "Coloring Quasicrystals with Prescribed Symmetries and Frequencies.",
            "Guest Editor's Foreword.",
            "Surface Reconstruction by Voronoi Filtering.",
            "Motion Planning for Multiple Robots.",
            "Degenerate Convex Hulls On-Line in Any Fixed Dimension.",
            "Geometric Applications of a Randomized Optimization Technique.",
            "Raising Roofs, Crashing Cycles, and Playing Pool: Applications of a Data Structure for Finding Pairwise Interactions.",
            "Vertex-Rounding a Three-Dimensional Polyhedral Subdivision.",
            "Cross-Ratios and Angles Determine a Polygon.",
            "Geometric Graphs with Few Disjoint Edges."
        ]
    },
    {
        "name": "DCG",
        "year": "1998",
        "info": "1998: Volumes\n19,\n20",
        "count": 75,
        "papers": [
            "The Nature and Meaning of Perturbations in Geometric Computing.",
            "Counting d -Step Paths in Extremal Dantzig Figures.",
            "Counterexamples to the Strong d -Step Conjecture for d ge 5.",
            "The Complexity of Stratification Computation.",
            "Lower Bounds on the Distortion of Embedding Finite Metric Spaces in Graphs.",
            "Largest Placement of One Convex Polygon Inside Another.",
            "On Functional Separately Convex Hulls.",
            "Fast Algorithms for Complete Linkage Clustering.",
            "Seven Cubes and Ten 24-Cells.",
            "Shelling Polyhedral 3-Balls and 4-Polytopes.",
            "An Optimal Algorithm for Closest-Pair Maintenance.",
            "Finite Packings of Spheres.",
            "Containment and Circumscribing Simplices.",
            "Intersection of Curves and Crossing Number of Cm x Cn on Surfaces.",
            "Tessellation and Visibility Representations of Maps on the Torus.",
            "How to Cut Pseudoparabolas into Segments.",
            "Minimum Convex Partition of Polygonal Domains by Guillotine Cuts.",
            "Guest Editor's Foreword.",
            "On Levels in Arrangements of Lines, Segments, Planes, and Triangles%.",
            "Piercing d -Intervals.",
            "A Positive Fraction Erdos - Szekeres Theorem.",
            "Rectification Principles in Additive Number Theory.",
            "On Point Sets with Many Unit Distances in Few Directions.",
            "Forced Convex n -Gons in the Plane.",
            "Improved Bounds for Planar k -Sets and Related Problems.",
            "A Combinatorial Problem on Polynomials.",
            "Isosceles Planar Subsets.",
            "On Geometric Graphs with No Two Edges in Convex Position.",
            "Finding Convex Sets Among Points in the Plane.",
            "Tilings of Polygons with Similar Triangles, II.",
            "Canonical Theorems for Convex Sets.",
            "A Generalization of the Erdos - Szekeres Theorem to Disjoint Convex Sets.",
            "Exponential Lower Bound for the Translative Kissing Numbers of d -Dimensional Convex Bodies.",
            "Note on the Erdos - Szekeres Theorem.",
            "On Geometric Graphs with No k Pairwise Parallel Edges.",
            "Extremal Problems for Geometric Hypergraphs.",
            "Voronoi Diagrams in Higher Dimensions under Certain Polyhedral Distance Functions.",
            "On the Universal Partition Theorem for 4-Polytopes.",
            "Visibility with One Reflection.",
            "An Upper and a Lower Bound Theorem for Combinatorial 4-Manifolds.",
            "Embedding into Rectilinear Spaces.",
            "Frontier and Closure of a Semi-Pfaffian Set.",
            "Many Polytopes Meeting the Conjectured Hirsch Bound.",
            "Realizations of Symmetric Maps by Symmetric Polyhedra.",
            "Visibility Complexes and the Baues Problem for Triangulations in the Plane.",
            "Visibility with Multiple Reflections.",
            "Some Generalizations of the Pinwheel Tiling.",
            "Finite and Uniform Stability of Sphere Packings.",
            "Mapping Zr into Zs with Maximal Contraction.",
            "Two Finiteness Theorems for Periodic Tilings of d-Dimensional Euclidean Space.",
            "Straight Line Arrangements in the Real Projective Plane.",
            "A Special Case of Mahler's Conjecture.",
            "On the Independence Number of Minimum Distance Graphs.",
            "Tiling Groups: New Applications in the Triangular Lattice.",
            "Notes on the Complexity of Exact View Graph Algorithms for Piecewise Smooth Algebraic Surfaces.",
            "The Geometry of Products of Minors.",
            "Covering the Plane with Copies of a Convex Disk.",
            "Nonperiodicity Implies Unique Composition for Self-Similar Translationally Finite Tilings.",
            "Guest Editor's Foreword.",
            "The Discrete 2-Center Problem.",
            "Distribution of Distances and Triangles in a Point Set and Algorithms for Computing the Largest Common Point Sets.",
            "Primal - Dual Methods for Vertex and Facet Enumeration.",
            "Approximate Nearest Neighbor Queries Revisited.",
            "Ramsey-Type Results for Geometric Graphs, II.",
            "Fitting a Set of Points by a Circle.",
            "The Volume as a Metric Invariant of Polyhedra.",
            "On Constants for Cuttings in the Plane.",
            "On the Volume of the Union of Balls.",
            "Geometric Lower Bounds for Parametric Matroid Optimization.",
            "Multiregular Point Systems.",
            "Pushing Disks Together - The Continuous-Motion Case.",
            "Counterexamples to the Connectivity Conjecture of the Mixed Cells.",
            "A Probabilistic Analysis of the Power of Arithmetic Filters.",
            "Homotopy Groups of the Combinatorial Grassmannian.",
            "Motion Planning in Environments with Low Obstacle Density."
        ]
    },
    {
        "name": "DCG",
        "year": "1997",
        "info": "1997: Volumes\n17,\n18",
        "count": 56,
        "papers": [
            "Sphere Packings, I.",
            "Lower Bounds for Off-Line Range Searching.",
            "Approximation of Analytic Functions with Prescribed Boundary Conditions by Circle-Packing Maps.",
            "Average Complexity of a Gift-Wrapping Algorithm for Determining the Convex Hull of Randomly Given Points.",
            "On the Quantitative Steinitz Theorem in the Plane.",
            "Voronoi Diagrams of Random Lines and Flats.",
            "Bernstein's Theorem in Affine Space.",
            "On Recognizing and Characterizing Visibility Graphs of Simple Polygons.",
            "Polytopes and the Mean Value Property.",
            "Lower Bound on Testing Membership to a Polyhedron by Algebraic Decision and Computation Trees.",
            "Rectangling a Rectangle.",
            "On Critical Orientations in the Kedem-Sharir Motion Planning Algorithm.",
            "Cutting Dense Point Sets in Half.",
            "Gaussian Samples, Regular Simplices, and Exchangeability.",
            "On Nearest-Neighbor Graphs.",
            "Lattice Coverings and Gaussian Measures of n-Dimensional Convex Bodies.",
            "Inclusion - Exclusion Complexes for Pseudodisk Collections.",
            "A Combinatorial Property of Convex Sets.",
            "Monte Carlo Approximation of Form Factors with Error Bounded a Priori.",
            "Grid Embedding of 4-Connected Plane Graphs.",
            "Erratum to Free Arrangement and Rhombic Tilings.",
            "Guest Editor's Foreword.",
            "Inradii of Simplices.",
            "Cell Decompositions of the Projective Plane with Petrie Polygons of Constant Length.",
            "On Helly's Theorem: Algorithms and Extensions.",
            "Stability of Blaschke's Characterization of Ellipsoids and Radon Norms.",
            "A Polyhedral Approach for a Constrained Matching Problem.",
            "Extremal Properties of 0/1-Polytopes.",
            "Regular Polytopes in Ordinary Space.",
            "A Helly-Type Theorem for Unions of Convex Sets.",
            "Isogonal Prismatoids.",
            "The d-Step Conjecture and Gaussian Elimination.",
            "Weak epsilon-Nets for Points on a Hypersphere.",
            "Faster Approximation Algorithms for the Rectilinear Steiner Tree Problem.",
            "Packing up to 50 Equal Circles in a Square.",
            "A Near-Linear Algorithm for the Planar 2-Center Problem.",
            "Sphere Packings, II.",
            "Approximation of Planar Convex Sets from Hyperplane Probes.",
            "Curved Hexagonal Packings of Equal Disks in a Circle.",
            "Transversals of d-Intervals.",
            "Computing Mixed Discriminants, Mixed Volumes, and Permanents.",
            "Erratum to Better Lower Bounds on Detecting Affine and Spherical Degeneracies.",
            "Guest Editor's Foreword.",
            "Ramsey-Type Results for Geometric Graphs, I.",
            "On the Number of Arrangements of Pseudolines.",
            "Vertical Decomposition of a Single Cell in a Three-Dimensional Arrangement of Surfaces.",
            "A Large Subgraph of the Minimum Weight Triangulation.",
            "Adaptive Precision Floating-Point Arithmetic and Fast Robust Geometric Predicates.",
            "On Conway's Thrackle Conjecture.",
            "An Efficient Algorithm for Euclidean Shortest Paths Among Polygonal Obstacles in the Plane.",
            "Appollonius Revisited: Supporting Spheres for Sundered Systems.",
            "Bounded-Independence Derandomization of Geometric Partitioning with Applications to Parallel Fixed-Dimensional Linear Programming.",
            "Convex Hulls of f- and $\\beta$-Vectors.",
            "Primal Dividing and Dual Pruning: Output-Sensitive Construction of Four-Dimensional Polytopes and Three-Dimensional Voronoi Diagrams.",
            "Every Simplicial Polytope with at Most d + 4 Vertices Is a Quotient of a Neighborly Polytope.",
            "On the Number of Linearly Separable Subsets of Finite Sets in Rn."
        ]
    },
    {
        "name": "DCG",
        "year": "1996",
        "info": "1996: Volumes\n15,\n16",
        "count": 49,
        "papers": [
            "The Overlay of Lower Envelopes and Its Applications.",
            "Yang-Baxter Invariants for Line Configurations.",
            "Vertical Decompositions for Triangles in 3-Space.",
            "Star-Shaped Sets in Normed Spaces.",
            "A Compact Piecewise-Linear Voronoi Diagram for Convex Sites in the Plane.",
            "Embedding Metric Spaces in the Rectilinear Plane: a Six-Point Criterion.",
            "The Universal Partition Theorem for Oriented Matroids.",
            "Equipartition of Mass Distributions by Hyperplanes.",
            "An Optimal Bound for High-Quality Conforming Triangulations.",
            "Extremal Theory for Convex Matchings in Convex Geometric Graphs.",
            "A Construction of Inflation Rules Based on n-Fold Symmetry.",
            "The Kissing Numbers of Tetrahedra.",
            "Nonregular Triangulations of Products of Simplices.",
            "Folding Rulers Inside Triangles.",
            "Computation of Betti Numbers of Monomial Ideals Associated with Cyclic Polytopes.",
            "The Illumination Bodies of a Simplex.",
            "Free Arrangements and Rhombic Tilings.",
            "Edge-Ramsey Theory.",
            "Nonrevisiting Paths on Surfaces.",
            "Weights on Polytopes.",
            "P.L.-Spheres, Convex Polytopes, and Stress.",
            "A Short Proof of an Interesting Helly-Type Theorem.",
            "McLaren's Improved Snub Cube and Other New Spherical Designs in Three Dimensions.",
            "Signable Posets and Partitionable Simplicial Complexes.",
            "Central Points for Sets in Rn (or: the Chocolate Ice-Cream Problem).",
            "The Number of Extreme Triples of a Planar Point Set.",
            "Planar Rectifiable Curves Are Determined by Their. Projections.",
            "An Algorithm To Compute Orders and Ramification Indices of Cyclic Actions on Compact Surfaces, II.",
            "A Helmholtz-Lie Type Characterization of Ellipsoids, II.",
            "Mixed-Volume Computation by Dynamic Lifting Applied to Polynomial System Solving.",
            "The Maximum Number of Odd Integral Distances Between Points in the Plane.",
            "A Near-Quadratic Algorithm for Planning the Motion of a Polygon in a Polygonal Environment.",
            "Lower Bounds for the Complexity of the Graph of the Hausdorff Distance as a Function of Transformation.",
            "Accounting for Boundary Effects in Nearest-Neighbor Searching.",
            "On Voronoi Diagrams in the $R^D$.",
            "On Delaunay Oriented Matroids for Convex Distance Functions.",
            "Projections of Polytopes and the Generalized Baues Conjecture.",
            "A Near-Linear Algorithm for the Planar Segment-Center Problem.",
            "On the cd-Variation Polynomials of André and Simsun Permutations.",
            "Isomorphism of Spiral Polygons.",
            "Inequalities for Convex Bodies and Polar Reciprocal Lattices in $R^n$ II: Application of $K$-Convexity.",
            "Guest Editor's Foreword.",
            "Efficient Randomized Algorithms for Some Geometric. Optimization Problems.",
            "Triangulations Intersect Nicely.",
            "Optimal Output-Sensitive Convex Hull Algorithms in Two and Three Dimensions.",
            "Output-Sensitive Results on Convex Hulls, Extreme Points, and Related Problems.",
            "New Lower Bounds for Hopcroft's Problem.",
            "Topologically Sweeping Visibility Complexes via Pseudotriangulations.",
            "A New Technique for Analyzing Substructures in Arrangements of Piecewise Linear Surfaces."
        ]
    },
    {
        "name": "DCG",
        "year": "1995",
        "info": "1995: Volumes\n13,\n14",
        "count": 71,
        "papers": [
            "Improved Bounds on Weak epsilon-Nets for Convex Sets.",
            "Chiral Polytopes from Hyperbolic Honeycombs.",
            "Better Lower Bounds on Detecting Affine and Spherical Degeneracies.",
            "Lattice-Free Polytopes and Their Diameter.",
            "An Efficient Algorithm for Guard Placement in Polygons with Holes.",
            "Dynamic Euclidean Minimum Spanning Trees and Extrema of Binary Functions.",
            "Reconfigurating Closed Polygonal Chains in Euclidean d-Space.",
            "Decomposition of Convex Figures into Similar Pieces.",
            "Intersections of Curve Systems and the Crossing Number of C5 X C5.",
            "On Minimum and Maximum Spanning Trees of Linearly Moving Points.",
            "The Mayer-Vietoris and IC Equations for Convex Polytopes.",
            "Problems of Distance Geometry and Convex Properties of Quadratic Maps.",
            "Lowe-Bound Theorems for Pseudomanifolds.",
            "Inequalites for Convex Bodies and Polar Reciprocal Lattices in Rn.",
            "Successive Minima, Intrinsic Volumes, and Lattice Determinants.",
            "Guest Editor's Forword.",
            "Bounding the Piercing Number.",
            "Arrangements of Segments that Share Endpoints Single Face Results.",
            "Mahler's Conjecture and Wavelets.",
            "The Limit Shape of Convex Lattice Polygons.",
            "Sausages are Good Packings.",
            "Finite and Uniform Stability of Sphere Covering.",
            "The Cubical d-Polytopes with Fewer than 2d+1 Vertices.",
            "Equifacetted 3-Spheres as Topes of Nonpolytopal Matroid Polytopes.",
            "An Elementary Approach to Lower Bounds in Geometric Discrepancy.",
            "What are All the Best Sphere Packings n Low Dimensions?.",
            "The Countability of a Tiling Family and the Periodicity of a Tiling.",
            "The Union of Balls and Its Dual Shape.",
            "Two Combinatorial Problems in the Plane.",
            "Covering the Plane with Two Kinds of Circles.",
            "A Left-First Search Algorithm for Planar Graphs.",
            "On the Connected Components of the Space of Line Transersals t a Family of Convex Sets.",
            "Largest j-Simplices n-Polytopes.",
            "A Helmholtz-Lie Type Characterization of Ellipsoids, I.",
            "On Surface-Minimizing Polyhedral Decompositions.",
            "Isoperimetric Problems for Convex Bodies and a Localization Lemama.",
            "Knotted Lattice-Like Space Fillers.",
            "Tilings of the Square with Similar Rectangles.",
            "Polytopes that Fill Rn and Scissors Congruence.",
            "Embedding a Polytope in a Lattice.",
            "Tight Upper Bounds for the Discrepancy of Half-Spaces.",
            "Another Space-Filling Trefoil Knot.",
            "Isoperimetric Inequalities for Infinite Hyperplane Systems.",
            "On Antipodal and Adjoint Pairs of Points for Two Convex Bodies.",
            "Probability that n Random Points are in Convex Position.",
            "Densest Packing of Typical Convex Sets are Nont Lattice-Like.",
            "Piecewise Linear Paths Among Convex Obstacles.",
            "Local Rules for Pentagonal Quasi-Crystals.",
            "Complexity of Stratifications of Semi-Pfaffian Sets.",
            "A New Technique To Compute Polygonal Schema for 2-Manifolds with Application to Null-homotopy Detection.",
            "Vertical Decomposition of Arrangements of Hyperplanes in Four Dimensions.",
            "Hyperbolic and Parabolic Packings.",
            "Low-Degree Minimum Spanning Trees.",
            "Extremal Polynomials for Obtaining Bounds for Spherical Codes and Designs.",
            "The Order of Points on the Second Convex Hull of a Simple Polygon.",
            "Spaces of Domino Tilings.",
            "Minimal-Energy Clusters of Hard Spheres.",
            "On Lazy Randomized Incremental Construction.",
            "On Polytopes Cut by Flats.",
            "Facet-Reducing Cuts of a Convex Polytope.",
            "Hamiltonian Simple Polytopes.",
            "On the Stanley Ring of a Cubical Complex.",
            "Visibility Graphs of Staircase Polygons and the Weak Bruhat Order, I: from Visibility Graphs to Maximal Chains.",
            "Acknowledgment of Priority Concerning Polytopes that Fill Rn and Scissors Congruence.",
            "Guest Editor's Foreword.",
            "On Geometric Optimization with Few Violated Constraints.",
            "Almost Tight Upper Bounds for the Single Cell and Zone Problems in Three Dimensions.",
            "Linear-Size Nonobtuse Triangulation of Polygons.",
            "Bounds on the Size of Tetrahedralizations.",
            "Efficient Piecewise-Linear Function Approximation Using the Uniform Metric.",
            "Almost Optimal Set Covers in Finite VC-Dimension."
        ]
    },
    {
        "name": "DCG",
        "year": "1994",
        "info": "1994: Volumes\n11,\n12",
        "count": 57,
        "papers": [
            "On the Complexity of a Single Cell in Certain Arrangement of Surfaces Related to Motion Planning.",
            "Second Derivatives of Circle Packing and Conformal Mapping.",
            "The Rooted Tree Embedding Problem into Points in the Plane.",
            "Computation of Peirod Matrices of Real Algebraic Curves.",
            "Convex Representations of Maps on the Torus and Other Flat Surfaces.",
            "On the Cayley Factorization of Calotte Conditions.",
            "A Postscript on Distances in Convex n-Gons.",
            "Description of the Connected Components of a Semialgebraic in Single Exponential Time.",
            "Regular Simplices and Gaussian Samples.",
            "Lower Bounds for the Numbers of Antipodal Pairs and Strictly Antipodal Pairs of Vertices in a Convex Polytope.",
            "Approximating the Minimum Weight Steiner Triangulation.",
            "Higher-Order Rigidity - What Is the Proper Definition.",
            "Residual Finiteness of Surface Groups via Tessellations.",
            "Approximating Euclidean Distances by Small Degree Graphs.",
            "Unit Squares Intersecting All Secants of a Square.",
            "On the Expected Number of k-Sets.",
            "Computability and Complexity of Ray Tracing.",
            "Simple Vertices of Maximal Minor Polytopes.",
            "Mirror Property for Nonsingular Mixed Configurations of Lines and Points in R3.",
            "Iterated Nearest Neighbors and Finding Minimal Polytopes.",
            "Gaps in the Numbers of Vertices of Cubical Polytopes, I.",
            "Cube-Tilings of Rn and Nonlinear Codes.",
            "On Range Searching with Semialgebraic Sets.",
            "Approximation of Zonoids by Zonotopes in Fixed Directions.",
            "Algorithms for Ham-Sandwich Cuts.",
            "Quotients of Polytopes and C-Groups.",
            "On Subdivisions of Simplicial Complexes: Characterizing Local h-Vectors.",
            "Some Geometric Applications of Dilworth's Theorem.",
            "Special Representations for n-Bridge Links.",
            "On the Number of Minimal 1-Steiner Trees.",
            "Computing the Ehrhart Polynomial of a Convex Lattice Polytope.",
            "Free Arrangements and Relation Spaces.",
            "A New Necessary Condition for the Vertex Visibility Graphs of Simple Polygons.",
            "On-Line Covering a Cube by a Sequence of Cubes.",
            "Camera Placement in Integer Lattices.",
            "The Asymptotic Value of the Circle-Packing Rigidity Constants Sn.",
            "Castles in the Air Revisited.",
            "Search Costs in Quadtrees and Singularity Perturbation Asymptotics.",
            "On the Number of Views of Polyhedral Terrains.",
            "An Example Concerning the Translative Kissing Number of Convex Body.",
            "Optimality of the Delaunay Triangulation in Rd.",
            "On Lines Missing Polyhedral Sets in 3-Space.",
            "Areas of Polygons Inscribed in a Circle.",
            "Helly-Type Theorems and Generalized Linear Programming.",
            "Finding a Minimum-Weight k-Link Path Graphs with the Concae Monge Property and Applications.",
            "Counting Triangle Crossing and Halving Planes.",
            "Computing a Centerpoint of a Finite Planar Set of Points in Linear Time.",
            "New Bounds for Lower Envelopes in Three Dimensions, with Applications to Visbility in Terrains.",
            "Almost Tight Upper Bounds for Lower Envelopes in Higher Dimensions.",
            "Can Visibility Graphs Be Represented Compactly?.",
            "Objects that Cannot Be Taken Apart with Two Hands.",
            "On the Exact Constant i the Quantitative Steinitz Theorem in the Plane.",
            "Vapnik-Chervonenkis Dimension and (Pseudo-)Hyperplane Arrangements.",
            "On-line Covering the Unit Cube by Cubes.",
            "Generalized Breadths, Circular Cantor Sets, and the Least Area UCC.",
            "An Algorithm to Compute Odd Orders and Ramification Indices of Cyclic Actions on Compact Surfaces.",
            "A Decomposition of 2-Weak Vertex-packing Polytopes."
        ]
    },
    {
        "name": "DCG",
        "year": "1993",
        "info": "1993: Volumes\n9,\n10",
        "count": 53,
        "papers": [
            "Flight in a Packing of Disks.",
            "Applications of a New Space-Partitioning Technique.",
            "Classification of Arrangement by the Number of Their Cells.",
            "A Generalization of Dehn-Sommerville Relations to Simple Stratified Spaces.",
            "Minimum Dissection of a Rectilinear Polygon with Arbitrary Holes into Rectangles.",
            "On Sparse Spanners of Weighted Graphs.",
            "Independent Collections of Translates of Boxes and a Conjecture due to Grübaum.",
            "On a New Method for Constructing Good Point Sets on Spheres.",
            "Approximating the Ball by a Minkowski Sum of Segments with Equal Length.",
            "Cutting Hyperplanes for Divide-and-Conquer.",
            "The Lower and Upper Bound Problems for Cubical Polytopes.",
            "Successive-Minima-Type Inequalities.",
            "On the Zone of a Surface in a Hyperplane Arrangement.",
            "There Exist 6n/13 Ordinary Points.",
            "A Gallai-Type Transversal Problem in the Plane.",
            "The Furthest-Site Geodesic Voronoi Diagram.",
            "An Equipartition of Planar Sets.",
            "The Upper Envelope of voronoi Surfaces and Its Applications.",
            "On Convex Body Chasing.",
            "The Steiner Minimal Network for Convex Configurations.",
            "Note on a Conjecture of Sierksma.",
            "Minimum Steiner Trees in Normed Planes.",
            "Constructing Arrangement Optimally in Parallel.",
            "Representing Geometric Structures in d Dimensions: Topology and Order.",
            "An Upper Bound for the Minimum Diameter of Integral Point Sets.",
            "Feasibility Testing for Systems of Real Quadratic Equations.",
            "Approximating the Volume of Convex Bodies.",
            "Extension Spaces of Oriented Matroids.",
            "Edge Insertion for Optimal Triangulations.",
            "A Note on Small Linear-Ordering Polytopes.",
            "On the Euler Characteristic of Finite Unions of Convex Sets.",
            "On Lattice Points in Polyhedral Cross-Sections.",
            "Partitioning Euclidean Space.",
            "On-Line Steine Trees in the Euclidean Plane.",
            "Computing the Volume, Counting Integral Points, and Exponential Sums.",
            "How Hard Is Half-Space Range Searching.",
            "Range Searching with Efficient Hiearchical Cutting.",
            "Diameter, Width, Closest Line Pair, and Parametric Searching.",
            "An Upper Bound for Conforming Delaunary Triangulations.",
            "On Ray Shooting in Convex Polytopes.",
            "Topological Representation of Dual Pairs of Oriented Matroids.",
            "Combinatorial Models for the Finite-Dimensional Grassmannians.",
            "Oriented Matroids with Few Mutations.",
            "Two Constructions of Oriented Matroids with Disconnected Extension Space.",
            "Combinatorial Obstructions to the Lifting of Weaving Diagrams.",
            "\"What Is a Complex Matroid?\".",
            "A New Bound on the Local Density of Sphere Packings.",
            "An Optimal Convex Hull Algorithm in Any Fixed Dimension.",
            "The Reserse Isoperimetric Problem for Gaussian Measure.",
            "An Invariant Property of Balls in Arrangements of Hyperplanes.",
            "A Bound on Local Minima of Arrangements that Implies the Upper Bound Theorem.",
            "Arrangement of Oriented Hyperplanes.",
            "On the Number of Guard Edges of a Polygon."
        ]
    },
    {
        "name": "DCG",
        "year": "1992",
        "info": "1992: Volumes\n7,\n8",
        "count": 53,
        "papers": [
            "The Number of Different Distances Determined by a Set of Points in the Euclidean Plane.",
            "Classes of Graphs Which Approximate the Complete Euclidean Graph.",
            "Solid Circle-Packings in the Euclidean Plane.",
            "Finding Minimum Area k-gons.",
            "The Euler Characteristic is the Unique Locally Determined Numerical Homotopy Invariant of Finite Complexes.",
            "Motions of a Short-Linked Robot Arm in a Square.",
            "The Steiner Ration Conjecture for Cocircular Points.",
            "On a Generalization of the Gallai-Sylvester Theorem.",
            "An Upper Bound on the Number of Planar K-Sets.",
            "Ammann Bars and Quasicrystals.",
            "Convex Independent Sets and 7-holes in Restricted Planar Point Sets.",
            "The Worm Problem of Leo Moser.",
            "Almost Tight Bounds for epsilon-Nets.",
            "Tiling Polygons with Parallelograms.",
            "Separating Convex Sets in the Plane.",
            "The Different Ways of Stabbling Disjoint Convex Sets.",
            "Shellings Pseudopolyhedre.",
            "Random Projections of Regular Simplices.",
            "On the Difficulty of Triangulating Three-Dimensional Nonconvex Polyhedra.",
            "Inner and Outer j-Radii of Convex Bodies in Finite-Dimensional Normed Spaces.",
            "X-Rays of Polygons.",
            "Quantitative Steinitz's Theorems Applications to Multifingered Grasping.",
            "The Generic Contact of Convex Bodies with Circumscribed Homothets of a Convex Surface.",
            "Polygon Triangulation in O (n log log n) Time with Simple Data Structures.",
            "The Classification of Quasi-Regular Polyhedra of Genus 2.",
            "Counting Facets and Incidences.",
            "The maximum Number of Second Smallest Distances in Finite Planar Sets.",
            "Area Requirement and Symmetry Display of Planar Upward Drawings.",
            "Spectra of Regular Polytopes.",
            "Maintaining the Minimal Distance of a Point Set in Polylogarithmic Time.",
            "Alternative Proof of Sine's Theorem on the Size of a Regular Polygon in Rn with the lfinite-Metric.",
            "Aperiodic Tiles.",
            "A New Step in the Solution of the Szökefalvi-Nagy Problem.",
            "Applications of Random Sampling to On-line Algorithms in Computational Geometry.",
            "Worst-Case Minimum Rectilinear Steiner Trees in All Dimensions.",
            "Neighborly Maps with Few Vertices.",
            "On the Covering Multiplicity of Lattices.",
            "An O(n log n) Algorithm for Computing the Link Center of a Simple Polygon.",
            "Nonuniqueness Results for X-Ray Problems with Point Sources.",
            "Self-Packing of Centrally Symmetric Convex Bodies in R2.",
            "Finding Stabbing Lines in 3-Space.",
            "On the Average Number of k-Sets.",
            "Nonoverlap of the Star Unfolding.",
            "How to Take Short Cuts.",
            "Transitions in Geometric Minimum Spanning Trees.",
            "A Pivoting Algorithm for Convex Hulls and Vertex Enumeration of Arrangements and Polyhedra.",
            "Efficient Partition Trees.",
            "Dynamic Point Location in Arrangement of Hyperplanes.",
            "Upper Bounds for the Diameter and Height of Graphs of Convex Polyhedra.",
            "A Bounded Compactness Theorem for L1 - Embed ability of Metric Spaces in the Plane.",
            "A Cone of Inhomogeneous Second-Order Polynomials.",
            "Subdivision Algorithms and the Kernel of a Polyhedron.",
            "Circle Packing and Polyhedral Surfaces."
        ]
    },
    {
        "name": "DCG",
        "year": "1991",
        "info": "1991: Volume 6",
        "count": 36,
        "papers": [
            "An On-line Potato-Sack Theorem.",
            "Shortest Watchman Routes in Simple Polygons.",
            "A New Index for Polytopes.",
            "Theorems on the Existence of Separating Surfaces.",
            "Dispersed Points and Geometric Embedding of Complete Bipartite Graphs.",
            "Analytic Formulas for Full Steiner Trees.",
            "Convex Polytopes Whose Projection Bodies and Difference Set Are Polars.",
            "The Densest Packing of Equal Circles into a Parallel Strip.",
            "A Dimension Series for Multivariate Splines.",
            "Lower Bounds on the Length of Monotone Paths in Arrangement.",
            "Minimum Ideal Triangulations of Hyperbolic 3-Manifolds.",
            "A Jordan Surface Theorem for Three-Dimensional Digital Spaces.",
            "Constraints on the Angular Distribution of the Zeros of a Polynomial of Low Complexity.",
            "On Two Conjectures of Franz Hering about Convex Surfaces.",
            "Disks with Special Properties of Densest Packings.",
            "Bounding the Number of Connected Components of a Real Algebraic Set.",
            "On the Construction of Abstract Voronoi Diagrams.",
            "On the Global Structure of Crystalline Surfaces.",
            "Bisectors of Linearly Separable Sets.",
            "Maximum Density Space Packing with Parallel Strings of Spheres.",
            "A Simple and Relatively Efficient Triangulation of the n-Cube.",
            "On the Convex Hull of Uniform Randowm Points in a Simple d-polytope.",
            "On Levels in Arrangement and Voronoi Diagrams.",
            "On Graver's Conjecture Concerning the Rigidity Problem of Graphs.",
            "Higher-Dimensional Voronoi Diagrams in Linear Expected Time.",
            "A sparse Graph Almost as Good as the Complete Graph on Points in K Dimensions.",
            "Cutting Hyperplane Arrangements.",
            "Euclidean Minimum Spanning Trees and Bichromatic Closest Pairs.",
            "Small-Dimensional Linear Programming and Convex Hulls Made Easy.",
            "Points and Triangles in the Plane and Halving Planes in Space.",
            "Some Provably Hard Crossing Number Problems.",
            "An Exact Algorithm for Kinodynamic Planning in the Plane.",
            "Triangulating a Simple Polygon in Linear Time.",
            "Disjoint Homotopic Paths and Trees in a Planar Graph.",
            "On Translating One Polyomino to Tile the Plane.",
            "On k-Sets in Arrangement of Curves and Surfaces."
        ]
    },
    {
        "name": "DCG",
        "year": "1990",
        "info": "1990: Volume 5",
        "count": 35,
        "papers": [
            "Penny-Packing and Two-Dimensional Codes.",
            "Geometry of the Gass-Saaty Parametric Cost LP Algorithm.",
            "Upper Bounds on Geometric Permutations for Convex Sets.",
            "The Maximum Number of Ways To Stab n Convex Nonintersecting Sets in the Plane Is 2n-2.",
            "An Efficient Motion-planning Algorithm for a Convex Polygonal Object in Two Dimensional Polygonal Space.",
            "On a Problem About Covering Lines by Squares.",
            "Combinatorial Geometries Representable over GF(3) and GF(q). I. The Number of Points.",
            "Combinatorial Complexity Bounds for Arrangement of Curves and Spheres.",
            "The Complexity and Construction of Many Faces in Arrangement of Lines and of Segments.",
            "The Complexity of Many Cells in Arrangements of Planes and Related Problems.",
            "An Inequality for the Volume of Inscribed Ellipsoids.",
            "Reconstructing Plane Sets from Projections.",
            "A New Duality Result Concerning Voronoi Diagrams.",
            "On the Existence of Certain Smooth Toric Varieties.",
            "Hyperplane Arrangements with a Lattice of Regions.",
            "Computing Simple Circuits form a Set of Line Segments.",
            "Exterior Algebra and projections of Polytopes.",
            "Countable Decompositions of R2 and R3.",
            "Nonrealizability Proofs in Computational Geometry.",
            "Diameter and Radius in the Manhattan Metric.",
            "On Convex Bodies that Permit Packings of High Density.",
            "A New Approach to the Dynamic Maintaince of Maximal Points in a Plane.",
            "A Combinatorial Property of Points anf Ellipsoids.",
            "A Generalization of Hadwiger's Transversal Theorem to Intersecting Sets.",
            "Double-Lattice Packings of Convex Bodies in the Plane.",
            "Delaunay Graphs are almost as Good as Complete Graphs.",
            "On the Modality of Convex Polygons.",
            "Construction of epsilon-Nets.",
            "Partitioning Arrangements of Lines I: An Efficient deterministic Algorithm.",
            "Efficient Binary Space Partitions for Hidden-Surface Removal and Solid Modeling.",
            "Triangulating a Nonconvex Polytope.",
            "Convex Disks Can Cover Their Shadow.",
            "Parititoning Arrangements of Lines II: Applications.",
            "Toughness and Delaunay Triangulations.",
            "Wv Paths on the Torus."
        ]
    },
    {
        "name": "DCG",
        "year": "1989",
        "info": "1989: Volume 4",
        "count": 41,
        "papers": [
            "A Nonuniform Matroid Which violates the Isotogy Conecture.",
            "Geometric Optimization and Dp - Completeness.",
            "Note on Induced Subgraphs of the Unit Distance Graph En.",
            "Finite Sphere Packing and Sphere Covering.",
            "Rectilinear Shortest Paths in the presence of Rectangular Barriers.",
            "Incidence-Polytopes with Toroidal Cells.",
            "A Matroid on Hypergraphs with Applications in Scene Analysis and Geometry.",
            "Uniform Oriented Matroids Without the Isotopy Property.",
            "An O(n log n) Algorithm for the All-nearest.Neighbors Problem.",
            "Diameter-Extremal Subsets of Spheres.",
            "The Complexity of Cutting Complexes.",
            "Sphere-and-Point Incidence Relations in High Dimensions with Applications to Unit Distances and Furthest-Neighbor Pairs.",
            "Proof of Grünbaum's Conjecture on Common Transversals for Translates.",
            "An Algorithm for Reconstructing Convex Bodies form Their Projections.",
            "Cutting Disjoint Disks by Straight Lines.",
            "The Maximum Size of a Convex Polygon in a Restricted Set in the Plane.",
            "A Combinatorial Result About Points and Balls in Euclidean Space.",
            "A Note on the Circle Containment Problem.",
            "On Seperating Two Simple Polygons by a Single Translation.",
            "Helly-Type Theorems for Spheres.",
            "Disjoint Edges in Geometric Graphs.",
            "The Upper Envelope of Piecewise Linear Functions and the Boundary of a Region Enclosed by Convex Plates: Combinatorial Analysis.",
            "The Upper Envelope of Piecewise Linear Functions: Algorithms and Applications.",
            "The Upper Envelope of Piecewise Linear Functions: Tight Bounds on the Number of Faces.",
            "On Representing Sylvester- Gallai Designs.",
            "Embeddings of Graphs in Euclidean Spaces.",
            "Complexes Whose Boundaries Cannot Be Pused Around.",
            "Dissections of Regular Polygons into Triangles of Equal Areas.",
            "Application of Random Sampling in Computational Geometry, II.",
            "A Fast Las Vegas Algorithm for Triangulating a Simple Polygon.",
            "Implicitly Representing Arrangements of Lines or Segments.",
            "Quasi-Optimal Range Searching in Space of Finite VC-Dimension.",
            "On the General Motion-Planning Problem with Two Degrees of Freedom.",
            "On Arrangement of Jordan Arcs with Three Intersection per Pair.",
            "On the Graph of Large Distance.",
            "Visibility and Intersection Problems in Plane Geometry.",
            "A Geometric Realization Without Self-Intersections Does Exist for Dyck's Regular Map.",
            "A Linear-Time Algorithm for Computing the Voronoi Diagram of a Convex Polygon.",
            "On the Ball Spanned by Balls.",
            "Computing the Geodesic Center of a Simple Polygon.",
            "Estimates for the Minimal Width of Polytopes Inscribed in Convex Bodies."
        ]
    },
    {
        "name": "DCG",
        "year": "1988",
        "info": "1988: Volume 3",
        "count": 27,
        "papers": [
            "Many Triangulated Spheres.",
            "Planar Realizations of Nonlinear Davenport-Schnitzel Sequences by Segments.",
            "On the Classification of Toric Fano Varieties.",
            "Tiling the Torus and Other Space Forms.",
            "Repeated Angles in E4.",
            "Polygonizations of Point Sets in the Plane.",
            "On the Contact Dimensions of Graphs.",
            "Arrangements of Lines with a Minimum Number of Triangles are Simple.",
            "On Optimal Realizations of Finite Metric Spaces by Graphs.",
            "Separating Two Simple Polygons by a Sequence of Translations.",
            "Nonorientable Genus of Nearly Complete Bipartite Graphs.",
            "Nonobtuse Triangulation of Polygons.",
            "Combinatorial d-Tori with a Large Symmetry Group.",
            "The Algebraic Degree of Geometric Optimization Problems.",
            "Lower Bounds on Moving a Ladder in Two and Three Dimensions.",
            "Simplified Voronoi Diagrams.",
            "Congruence, Similarity, and Symmetries of Geometric Objects.",
            "Polyhedral Line transversals in Space.",
            "Establishing Order in Planar Subdivisions.",
            "Computing the Link Center of a Simple Polygon.",
            "A Sylvester Theorem for Conic Sections.",
            "Valuations and Polarity.",
            "On the Complexity of Polyhedral Separability.",
            "Branced Covering.",
            "The Orthogonal Convex Skull Problem.",
            "A Decomposition Theorem on Euclidean Steiner Minimal Trees.",
            "Equidecomposabilitz of Polyhedra with Reference to Crystallographic Groups."
        ]
    },
    {
        "name": "DCG",
        "year": "1987",
        "info": "1987: Volume 2",
        "count": 26,
        "papers": [
            "On Lattices with Möbius Function ±1, 0.",
            "Planning a Purely Translational Motion for a Convex Object in Two-Dimensional Space Using Generalized Voronoi Diagrams.",
            "A Reduction of Lattice Tiling bz Translates of a Cubical Cluster.",
            "A Polynomial-Time Linear Decision Tree for the Traveling Salesman Problem and Other NP-Complete Problems.",
            "A Criterion for the Affine Equivalence of Cell Complexes in Rd and Convex Polyhedra in Rd+1+.",
            "Steiner Minimal Trees for Regular Polygons.",
            "On Nonnegative Solutions of Random Systems of Linear Inequalities.",
            "Triangulating Point Sets in Space.",
            "Linear Space Data Structures for Two Types of Range Search.",
            "epsilon-Nets and Simplex Range Queries.",
            "Storing the Subdivision of a Polyhedral Surface.",
            "Computing Convolutions by Reciprocal Search.",
            "New Applications of random Sampling in Computational Geometry.",
            "Tessellations Generated by Hyperplanes.",
            "Generating Closed 2-Cell Embeddings in the Torus and the Projective Plane.",
            "Direction Trees.",
            "On the Number of Critical Free Contacts of a Convex Polygonal Object Moving in Two-Dimensional Polygonal Space.",
            "delta-Morphic Sets of Prototiles.",
            "Balanced Subdivision and Enumeration in Balanced Spheres.",
            "Computing the Volume is Difficulte.",
            "A Low Bound for the Optimal Crossing-Free Hamiltonian Cycle Problem.",
            "A Power Law for the Distortion of Planar Sets.",
            "Finite Coverings by Translates of Centrally Symmetric Convex Domains.",
            "An O (n log n) Algorithm for the Voronoi Diagram of a Set of Simple Curve Segments.",
            "Invertible Relations on Polytopes.",
            "Steiner Minimal Trees on Sets of Four Points."
        ]
    },
    {
        "name": "DCG",
        "year": "1986",
        "info": "1986: Volume 1",
        "count": 30,
        "papers": [
            "Covering a Square by Small Perimeter Rectangles.",
            "Two Poset Polytopes.",
            "Voronoi Diagrams and Arrangements.",
            "Can You Cover Your Shadows?.",
            "On the Union of Jordan Regions and Collision-Free Translational Motion Amidst Polygonal Obstacles.",
            "Covering the Plane with Convex Polygons.",
            "Halfspace Range Search: An Algorithmic Application of k-Sets.",
            "More on k-Sets of Finite Sets in the Plane.",
            "A Resolution of the Sylvester - Gallai Problem of J. -P. Serre.",
            "Spherical Complexes and Nonprojective Toric Varieties.",
            "Smooth, Easy to Computer Interpolating Splines.",
            "Geometric Realizations for Dyck's Regular Map on a Surface of Genus 3.",
            "A Polynomial Solution for the Potato-peeling Problem.",
            "Some Basic Properties of Packing and Covering Constants.",
            "On polyhedra with Transitivity Properties.",
            "Generalized Dalaunay Triangualtion for Planar Graphs.",
            "Upper Bounds for Configurations and Polytopes in Rd.",
            "On the Cone of Nonnegative Circuits.",
            "Approximation of Convex Discs by Polygons.",
            "diameter Partitioning.",
            "Periodic Orbits for Additive Cellular Automata.",
            "A Geometric Inequality and the Complexity of Computing Volume.",
            "On the Coordinatization of Oriented Matroids.",
            "Densest Packing of Translates of the Union of Two Circles.",
            "Random Polytopes in the d-Dimensional Cube.",
            "A Unified Approach a Visibility Representation of Planar Graphs.",
            "Rectilinear Planar Layouts and Bipolar Orientations of Planar Graphs.",
            "The Weakly Neighborly Polyhedral Maps on the 2-Manifold with Euler Characteristic - 1.",
            "Geometric Permutations and Common Transversals.",
            "On Squashed Designs."
        ]
    }
]