[
    {
        "year": "2021",
        "name": "42nd Eurographics 2021",
        "info": "Vienna, Austria",
        "venues": []
    },
    {
        "year": "2020",
        "name": "41st Eurographics / 22nd EuroVis 2020",
        "info": "Norrköping, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2020education",
                "sub_name": "41st Annual Conference of the European Association for Computer Graphics, Eurographics 2020 - Education Papers, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 7,
                "papers": [
                    "Rayground: An Online Educational Tool for Ray Tracing.",
                    "Designing a Course on Non-Photorealistic Rendering.",
                    "Critical Thinking Sheet (CTS) for Design Thinking in Programming Courses.",
                    "Asset Integration: An Exceptional Undergraduate Student Project.",
                    "Recreating Past and Present: An Exceptional Student-Created Virtual Heritage Experience.",
                    "Treemap Literacy: A Classroom-Based Investigation.",
                    "Visualization for Data Scientists: How specific is it?"
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2020posters",
                "sub_name": "41st Annual Conference of the European Association for Computer Graphics, Eurographics 2020 - Posters, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 5,
                "papers": [
                    "An End-to-end Framework for 3D Capture and Human Digitization with a Single RGB Camera.",
                    "Fabric Appearance Benchmark.",
                    "Streamlining Photogrammetry Reconstructions of Bone Fragments for Bioarchaeological Analysis, Conservation, and Public Engagement.",
                    "Integrating Local Collision Avoidance with Shortest Path Maps.",
                    "GPU-Accelerated Generation of the Molecular Surface."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2020short",
                "sub_name": "41st Annual Conference of the European Association for Computer Graphics, Eurographics 2020 - Short Papers, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 24,
                "papers": [
                    "Accelerated Foveated Rendering based on Adaptive Tessellation.",
                    "Photon Mapping Superluminal Particles.",
                    "Controllable Caustic Animation Using Vector Fields.",
                    "Conservative Ray Batching using Geometry Proxies.",
                    "Compression and Real-Time Rendering of Inward Looking Spherical Light Fields.",
                    "Multisample Anti-aliasing in Deferred Rendering.",
                    "On Learning the Best Local Balancing Strategy.",
                    "MEPP2: A Generic Platform for Processing 3D Meshes and Point Clouds.",
                    "First Order Signed Distance Fields.",
                    "Learning Body Shape and Pose from Dense Correspondences.",
                    "Adversarial Generation of Continuous Implicit Shape Representations.",
                    "Space-Time Blending for Heterogeneous Objects.",
                    "Neural Smoke Stylization with Color Transfer.",
                    "Triplanar Displacement Mapping for Terrain Rendering.",
                    "A Practical Male Hair Aging Model.",
                    "UV Completion with Self-referenced Discrimination.",
                    "Frequency-Aware Reconstruction of Fluid Simulations with Generative Networks.",
                    "Procedural 3D Asteroid Surface Detail Synthesis.",
                    "Interactive Assembly and Animation of 3D Digital Garments.",
                    "ScagnosticsJS: Extended Scatterplot Visual Features for the Web.",
                    "Deep-Eyes: Fully Automatic Anime Character Colorization with Painting of Details on Empty Pupils.",
                    "Interactive Flat Coloring of Minimalist Neat Sketches.",
                    "Pair Correlation Functions with Free-Form Boundaries for Distribution Inpainting and Decomposition.",
                    "Organic Narrative Charts."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2020tutorials",
                "sub_name": "41st Annual Conference of the European Association for Computer Graphics, Eurographics 2020 - Tutorials, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 2,
                "papers": [
                    "Black Box Geometric Computing with Python: From Theory to Practice.",
                    "From Perception to Interaction with Virtual Characters."
                ]
            },
            {
                "sub_name_abbr": "conf/wiced/2020",
                "sub_name": "9th Workshop on Intelligent Cinematography and Editing, WICED@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 7,
                "papers": [
                    "User-Adaptive Rotational Snap-Cutting for Streamed 360º Videos.",
                    "Designing an Adpative Assisting Interface for Learning Virtual Filmmaking.",
                    "How Good is Good Enough? The Challenge of Evaluating Subjective Quality of AI-Edited Video Coverage of Live Events.",
                    "Exploring the Impact of 360º Movie Cuts in Users' Attention.",
                    "CineFilter: Unsupervised Filtering for Real Time Autonomous Camera Systems.",
                    "GAZED - Gaze-guided Cinematic Editing of Wide-Angle Monocular Video Recordings.",
                    "Joint Attention for Automated Video Editing."
                ]
            },
            {
                "sub_name_abbr": "conf/vissym/2020",
                "sub_name": "22nd Eurographics Conference on Visualization, EuroVis 2020 - Short Papers, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 31,
                "papers": [
                    "The Effect of Graph Layout on the Perception of Graph Properties.",
                    "Exploring Time Series Segmentations Using Uncertainty and Focus+Context Techniques.",
                    "SAMBAVis: Design Study of a Visual Analytics Tool for the Music Industry Powered by YouTube Comments.",
                    "Configuration Finder: A Tidy Visual Interface for Effective Faceted Search.",
                    "ARGUS: Interactive Visual Analytics Framework for the Discovery of Disruptions in Bio-Behavioral Rhythms.",
                    "Design of a Real Time Visual Analytics Support Tool for Conflict Detection and Resolution in Air Traffic Control.",
                    "Dissecting Visual Analytics: Comparing Frameworks for Interpreting and Modelling Observed Visual Analytics Behavior.",
                    "Examining Design-Centric Test Participants in Graphical Perception Experiments.",
                    "Designing Pairs of Colormaps for Visualizing Bivariate Scalar Fields.",
                    "Interactive Creation of Perceptually Uniform Color Maps.",
                    "Task-based Colormap Design Supporting Visual Comprehension in Process Tomography.",
                    "Investigating the Role of Locus of Control in Moderating Complex Analytic Workflows.",
                    "Exploring Design Opportunities for Visually Congruent Proxemics in Information Visualization: A Design Space.",
                    "Characterizing Exploratory Behaviors on a Personal Visualization Interface Using Interaction Logs.",
                    "TopoLines: Topological Smoothing for Line Charts.",
                    "Evaluating Strategies of Exploratory Visual Data Analysis in Multi Device Environments.",
                    "Influence of Container Resolutions on the Layout Stability of Squarified and Slice-And-Dice Treemaps.",
                    "Width-Scale Bar Charts for Data with Large Value Range.",
                    "A Force-Directed Power Diagram Approach for Interactive Voronoi Treemaps.",
                    "Fast Design Space Rendering of Scatterplots.",
                    "Glyph-Based Visualization of Affective States.",
                    "GaCoVi: a Correlation Visualization to Support Interpretability-Aware Feature Selection for Regression Models.",
                    "Progressive Uniform Manifold Approximation and Projection.",
                    "Sketchy Rendering to Aid the Recollection of Regular Visualizations.",
                    "Progressive Rendering of Transparent Integral Surfaces.",
                    "Effective Visualization of Sparse Image-to-Image Correspondences.",
                    "Joint-Sphere: Intuitive and Detailed Human Joint Motion Representation.",
                    "MODELAR: A MODular and EvaLuative framework to improve surgical Augmented Reality visualization.",
                    "Comprehensive Visualization of Longitudinal Patient Data for the Dermatological Oncological Tumor Board.",
                    "RankBooster: Visual Analysis of Ranking Predictions.",
                    "Visualising Collocation for Close Writing."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2020",
                "sub_name": "20th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 8,
                "papers": [
                    "Finding Efficient Spatial Distributions for Massively Instanced 3-d Models.",
                    "Fast Multi-View Rendering for Real-Time Applications.",
                    "Moment-Based Opacity Optimization.",
                    "Improving Performance of M-to-N Processing and Data Redistribution in In Transit Analysis and Visualization.",
                    "Effective Parallelization Strategies for Scalable, High-Performance Iterative Reconstruction.",
                    "Approaches for In Situ Computation of Moments in a Data-Parallel Environment.",
                    "High-Quality Rendering of Glyphs Using Hardware-Accelerated Ray Tracing.",
                    "Alternative Parameters for On-The-Fly Simplification of MergeTrees."
                ]
            },
            {
                "sub_name_abbr": "conf/envirvis-ws/2020",
                "sub_name": "8th Workshop on Visualisation in Environmental Sciences, EnvirVis@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 3,
                "papers": [
                    "Visual Exploration of Climate-Related Volunteered Geographic Information.",
                    "Visual Analysis of a Full-Scale-Emplacement Experiment in the Underground Rock Laboratory Mont Terri using Fiber Surfaces.",
                    "SoilScanner: 3D Visualization for Soil Profiling using Portable X-ray Fluorescence."
                ]
            },
            {
                "sub_name_abbr": "conf/eurova-ws/2020",
                "sub_name": "11th International EuroVis Workshop on Visual Analytics, EuroVA@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 14,
                "papers": [
                    "SpatialRugs: Enhancing Spatial Awareness of Movement in Dense Pixel Visualizations.",
                    "SepEx: Visual Analysis of Class Separation Measures.",
                    "Dual Radial Set.",
                    "An Exploratory Visual Analytics Tool for Multivariate Dynamic Networks.",
                    "DualNetView: Dual Views for Visualizing the Dynamics of Networks.",
                    "Quality Metrics to Guide Visual Analysis of High Dimensional Genomics Data.",
                    "Enhanced Attribute-Based Explanations of Multidimensional Projections.",
                    "Progressive Parameter Space Visualization for Task-Driven SAX Configuration.",
                    "Congnostics: Visual Features for Doubly Time Series Plots.",
                    "A Window-based Approach for Mining Long Duration Event-sequences.",
                    "Learning and Teaching in Co-Adaptive Guidance for Mixed-Initiative Visual Analytics.",
                    "A Generic Model for Projection Alignment Applied to Neural Network Visualization.",
                    "Visual Analysis for Hospital Infection Control using a RNN Model.",
                    "Interactive Visualization of AI-based Speech Recognition Texts."
                ]
            },
            {
                "sub_name_abbr": "conf/mlvis-ws/2020",
                "sub_name": "3rd Workshop on Machine Learning Methods in Visualisation for Big Data, MLVis@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 5,
                "papers": [
                    "Progressive Multidimensional Projections: A Process Model based on Vector Quantization.",
                    "ModelSpeX: Model Specification Using Explainable Artificial Intelligence Methods.",
                    "Visual Analysis of the Impact of Neural Network Hyper-Parameters.",
                    "Improving the Sensitivity of Statistical Testing for Clusterability with Mirrored-Density Plots.",
                    "Visual Interpretation of DNN-based Acoustic Models using Deep Autoencoders."
                ]
            },
            {
                "sub_name_abbr": "conf/molva-ws/2020",
                "sub_name": "3rd Workshop on Molecular Graphics and Visual Analysis of Molecular Data, MolVA@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 4,
                "papers": [
                    "Molecular Binding in a Visuohaptic Environment: An Enhanced Approach in STEM Learning.",
                    "The Vesicle Builder - A Membrane Packing Algorithm for the CELLmicrocosmos MembraneEditor.",
                    "Improved Umbrella Visualization implemented in UnityMol gives valuable insight on sugar/protein interplay.",
                    "Mesoscope: A Web-based Tool for Mesoscale Data Integration and Curation."
                ]
            },
            {
                "sub_name_abbr": "conf/vissym/2020visgap",
                "sub_name": "1st Workshop on the Gap between Visualization Research and Visualization Software, VisGap@Eurographics/EuroVis 2020, Norrköping, Sweden, May 25, 2020 [online only].",
                "count": 10,
                "papers": [
                    "Visualization in Notebook-Style Interfaces.",
                    "Selecting and Sharing Multidimensional Projection Algorithms: A Practical View.",
                    "Framing the Challenges of Operational and Domain Usage of Volume Visualization Methods in Ocean Science.",
                    "Towards Closing the Gap of Medical Visualization Research and Clinical Daily Routine.",
                    "Participatory Visualization Design as an Approach to Minimize the Gap between Research and Application.",
                    "From Research Topic to Industrial Practice: An Experience Report.",
                    "Lessons Learnt from Developing Visual Analytics Applications for Adaptive Prostate Cancer Radiotherapy.",
                    "How the Deprecation of Java Applets Affected Online Visualization Frameworks - A Case Study.",
                    "Tales from the Trenches: Developing sciview, a new 3D viewer for the ImageJ community.",
                    "Lessons Learned from Large Data Visualization Software Development for the K computer."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "40th Eurographics 2019",
        "info": "Genoa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/vissym/2020p",
                "sub_name": "22nd Eurographics Conference on Visualization, EuroVis 2019 - Posters, Norrköping, Sweden, May 25-29, 2020 [online only].",
                "count": 11,
                "papers": [
                    "A Tool to Help lay out Multiple View Visualisations Guided by View Analysis.",
                    "Evaluation of Mesh Compression and GPU Ray Casting for Tree Based AMR data in VTK.",
                    "ResFlow: Visualizing Global Resource Flows.",
                    "Data Driven Multi-Hazard Risk Visualization.",
                    "Designing Effective Network Visualization Representations of Disinformation Operations - Improving DisInfoVis.",
                    "Visual Analysis of Car-hailing Reimbursement Data for Overtime.",
                    "The Impact of EuroVis Publications.",
                    "Rockwell Adhesion Test - Approach to Standard Modernization.",
                    "A Tool for N-way Analysis of Programming Exercises.",
                    "Accurate Visualization of Galaxy Velocity Fields from Three-Dimensional Integral Field Spectroscopy Data.",
                    "A Web-based Visual Analytics Application for Biological Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2019dbp",
                "sub_name": "40th Annual Conference of the European Association for Computer Graphics, Eurographics 2019 - Dirk Bartz Prize, Genoa, Italy, May 6-10, 2019.",
                "count": 3,
                "papers": [
                    "Cytosplore: Interactive Visual Single-Cell Profiling of the Immune System.",
                    "Model-based Visualization for Medical Education and Training.",
                    "Visual Analytics for Epidemiology."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2019education",
                "sub_name": "40th Annual Conference of the European Association for Computer Graphics, Eurographics 2019 - Education Papers, Genoa, Italy, May 6-10, 2019.",
                "count": 10,
                "papers": [
                    "Integrating Visualization Literacy into Computer Graphics Education Using the Example of Dear Data.",
                    "EduClust - A Visualization Application for Teaching Clustering Algorithms.",
                    "Mapping Creative Coding Courses: Toward Bespoke Programming Curricula in Graphic Design Education.",
                    "A Parser-based Tool to Assist Instructors in Grading Computer Graphics Assignments.",
                    "How to Write a Visualization Survey Paper: A Starting Point.",
                    "Assessing Graphic Designers' Learning Style Profile to Improve Creative Coding Courses.",
                    "Do contests improve students skills in Computer Graphics? The case of API8.",
                    "A Breadth-First Introduction to VFX: A Holistic Approach for Teaching the Visual Effects Production Pipeline.",
                    "Vegetable Matter Decay: An Exceptional Student 'Innovations' Project.",
                    "Teaching Computer Graphics Based on a Commercial Product."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2019posters",
                "sub_name": "40th Annual Conference of the European Association for Computer Graphics, Eurographics 2019 - Posters, Genoa, Italy, May 6-10, 2019.",
                "count": 16,
                "papers": [
                    "Flexible Type: Methods and Applications of Modifying Glyph's Horizontal and Vertical Weight.",
                    "Voxelizing Light-Field Recordings.",
                    "Enhanced Reconstruction of Architectural Wall Surfaces for 3D Building Models.",
                    "Assembly Retrieval Results Inspection in Immersive Environment.",
                    "VITON-GAN: Virtual Try-on Image Generator Trained with Adversarial Loss.",
                    "Towards the Fitting of Parametric 2D Sketches and 3D CAD Models to Point Clouds of Digitized Assemblies for Reverse Engineering.",
                    "Adaptive Frameless Rendering with NVIDIA OptiX.",
                    "Can we Invert a Local Reflectance Model From a Single Specular Highlight with Known Scene Geometry and Camera Pose?",
                    "Multi-Scale Point Cloud Analysis.",
                    "The Effects of Adaptive Synchronization on Performance and Experience in Gameplay.",
                    "Towards Point-based Facial Movement Simulation.",
                    "Visualization of Large Point Cloud in Unity.",
                    "Visual-auditory Representation and Analysis of Molecular Scalar Fields.",
                    "D.A.V.E: A Prototype for Automatic Environment Decoration.",
                    "A Projection Mapping System onto a Human Body for Medical Applications.",
                    "3D Mesh Description Using \"Subdivided Shape-Curvature-Graphs\"."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2019short",
                "sub_name": "40th Annual Conference of the European Association for Computer Graphics, Eurographics 2019 - Short Papers, Genoa, Italy, May 6-10, 2019.",
                "count": 22,
                "papers": [
                    "Perceptual Characteristics by Motion Style Category.",
                    "GPU Smoke Simulation on Compressed DCT Space.",
                    "Stylistic Locomotion Modeling with Conditional Variational Autoencoder.",
                    "Schelling Meshes.",
                    "Hybrid Function Representation with Distance Properties.",
                    "One-step Compact Skeletonization.",
                    "A Preliminary Analysis of Methods for Curvature Estimation on Surfaces With Local Reliefs.",
                    "3DVFX: 3D Video Editing using Non-Rigid Structure-from-Motion.",
                    "Image Recoloring Based on Object Color Distributions.",
                    "Making Gabor Noise Fast and Normalized.",
                    "Automatic Environment Map Registration.",
                    "Investigating Different Augmented Reality Approaches in Circuit Assembly: a User Study.",
                    "Integrating Server-based Simulations Into Web-based Geo-applications.",
                    "Asteroid Escape: A Serious Game to Foster Teamwork Abilities.",
                    "A Validation Tool For Improving Semantic Segmentation of Complex Natural Structures.",
                    "Font Specificity.",
                    "Towards Diverse Anime Face Generation: Active Label Completion and Style Feature Network.",
                    "Fine-Grained Semantic Segmentation of Motion Capture Data using Dilated Temporal Fully-Convolutional Networks.",
                    "Optimal Deterministic Mixture Sampling.",
                    "Anisotropic Filtering for On-the-fly Patch-based Texturing.",
                    "Planar Abstraction and Inverse Rendering of 3D Indoor Environment.",
                    "Area Lights in Signed Distance Function Scenes."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2019tutorials",
                "sub_name": "40th Annual Conference of the European Association for Computer Graphics, Eurographics 2019 - Tutorials, Genoa, Italy, May 6-10, 2019.",
                "count": 4,
                "papers": [
                    "Smoothed Particle Hydrodynamics Techniques for the Physics Based Simulation of Fluids and Solids.",
                    "Deep Learning for Computer Graphics and Geometry Processing.",
                    "libigl: Prototyping Geometry Processing Research in C++.",
                    "Learning Generative Models of 3D Structures."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2019",
                "sub_name": "12th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2019, Genoa, Italy, May 5-6, 2019.",
                "count": 16,
                "papers": [
                    "POP: Full Parametric model Estimation for Occluded People.",
                    "mpLBP: An Extension of the Local Binary Pattern to Surfaces based on an Efficient Coding of the Point Neighbours.",
                    "Sketch-Aided Retrieval of Incomplete 3D Cultural Heritage Objects.",
                    "Protein Shape Retrieval Contest.",
                    "Extended 2D Scene Sketch-Based 3D Scene Retrieval.",
                    "Extended 2D Scene Image-Based 3D Scene Retrieval.",
                    "Classification in Cryo-Electron Tomograms.",
                    "Depth-Based Face Recognition by Learning from 3D-LBP Images.",
                    "CMH: Coordinates Manifold Harmonics for Functional Remeshing.",
                    "Generalizing Discrete Convolutions for Unstructured Point Clouds.",
                    "A 3D CAD Assembly Benchmark.",
                    "Feature Curve Extraction on Triangle Meshes.",
                    "Online Gesture Recognition.",
                    "Monocular Image Based 3D Model Retrieval.",
                    "Shape Correspondence with Isometric and Non-Isometric Deformations.",
                    "Matching Humans with Different Connectivity."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "39th Eurographics 2018",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2018education",
                "sub_name": "39th Annual Conference of the European Association for Computer Graphics, Eurographics 2018 - Education Papers, Delft, The Netherlands, April 16-20, 2018.",
                "count": 8,
                "papers": [
                    "I3T: Using Interactive Computer Graphics to Teach Geometric Transformations.",
                    "Incorporating Visualization Research in Introductory Programming Course: Case Studies.",
                    "Teaching Image-Processing Programming for Mobile Devices: A Software Development Perspective.",
                    "GL-Socket: A CG Plugin-based Framework for Teaching and Assessment.",
                    "Teaching Spatial Augmented Reality: a Practical Assignment for Large Audiences.",
                    "Turtle Fractals and Spirolaterals: Effective Assignments for Novice Graphics Programmers.",
                    "A Creative First Assignment in the Modern Graphics Pipeline.",
                    "On the Pedagogy of Teaching Introductory Computer Graphics without Rendering APIs."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2018posters",
                "sub_name": "39th Annual Conference of the European Association for Computer Graphics, Eurographics 2018 - Posters, Delft, The Netherlands, April 16-20, 2018.",
                "count": 18,
                "papers": [
                    "A Smart Palette for Helping Novice Painters to Mix Physical Watercolor Pigments.",
                    "A Probabilistic Motion Planning Algorithm for Realistic Walk Path Simulation.",
                    "Presenting a Deep Motion Blending Approach for Simulating Natural Reach Motions.",
                    "Introducing a Modular Concept for Exchanging Character Animation Approaches.",
                    "Towards Self-Perception in Augmented Virtuality: Hand Segmentation with Fully Convolutional Networks.",
                    "Human Sensitivity to Light Zones in Virtual Scenes.",
                    "Smoothing Noisy Skeleton Data in Real Time.",
                    "A Drink in Mars: an Approach to Distributed Reality.",
                    "RIFNOM: 3D Rotation-Invariant Features on Normal Maps.",
                    "Light Field Synthesis from a Single Image using Improved Wasserstein Generative Adversarial Network.",
                    "Growing Circles: A Region Growing Algorithm for Unstructured Grids and Non-aligned Boundaries.",
                    "Audio-driven Emotional Speech Animation.",
                    "Exemplar Based Filtering of 2.5D Meshes of Faces.",
                    "A Multifragment Renderer for Material Aging Visualization.",
                    "Boundary-aided Human Body Shape and Pose Estimation from a Single Image for Garment Design and Manufacture.",
                    "Style Translation to Create Child-like Motion.",
                    "A Virtual Space with Real IoT Data.",
                    "From Spectra to Perceptual Color: Visualization Tools for the Dimensional Reduction Achieved by the Human Color Sense."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2018short",
                "sub_name": "39th Annual Conference of the European Association for Computer Graphics, Eurographics 2018 - Short Papers, Delft, The Netherlands, April 16-20, 2018.",
                "count": 16,
                "papers": [
                    "Time-Reversed Art Directable Smoke Simulation.",
                    "Rigid Body Joints in Real-Time Unified Particle Physics.",
                    "Reduction of CPU-GPU Synchronization Overhead for Accelerating Implicit Clothing Simulator.",
                    "Kinder-Gator: The UF Kinect Database of Child and Adult Motion.",
                    "Optimized Sampling for View Interpolation in Light Fields with Overlapping Patches.",
                    "Halftone Pattern: A New Steganographic Approach.",
                    "Raw Point Cloud Deferred Shading Through Screen Space Pyramidal Operators.",
                    "Accelerating Sphere Tracing.",
                    "Expressive Curve Editing with the Sigma Lognormal Model.",
                    "Smooth Blended Subdivision Shading.",
                    "Iterative Carving for Self-supporting 3D Printed Cavities.",
                    "A Comparison of GPU Tessellation Strategies for Multisided Patches.",
                    "A Preliminary Investigation into the Impact of Training for Example-Based Facial Blendshape Creation.",
                    "Arm Swinging vs Treadmill: A Comparison Between Two Techniques for Locomotion in Virtual Reality.",
                    "Accurate Control of a Pan-tilt System Based on Parameterization of Rotational Motion.",
                    "Creating New Chinese Fonts based on Manifold Learning and Adversarial Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2018tutorials",
                "sub_name": "39th Annual Conference of the European Association for Computer Graphics, Eurographics 2018 - Tutorials, Delft, The Netherlands, April 16-20, 2018.",
                "count": 4,
                "papers": [
                    "Image-Based Information Visualization Tutorial.",
                    "Understanding Mystery Behind Example-Based Image Synthesis.",
                    "Voxel DAGs and Multiresolution Hierarchies: From Large-Scale Scenes to Pre-computed Shadows.",
                    "Deep Learning for Graphics."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2018",
                "sub_name": "11th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2018, Delft, The Netherlands, April 16, 2018.",
                "count": 15,
                "papers": [
                    "Edge-based LBP Description of Surfaces with Colorimetric Patterns.",
                    "Microshapes: Efficient Querying of 3D Object Collections based on Local Shape.",
                    "Automatic Extraction of Complex 3D Structures Application to the Inner Ear Segmentation from Cone Beam CT Digital Volumes.",
                    "Geodesic-based 3D Shape Retrieval Using Sparse Autoencoders.",
                    "2D Scene Sketch-Based 3D Scene Retrieval.",
                    "2D Image-Based 3D Scene Retrieval.",
                    "RGB-D Object-to-CAD Retrieval.",
                    "Protein Shape Retrieval.",
                    "Retrieval of Gray Patterns Depicted on 3D Models.",
                    "Recognition of Geometric Patterns Over 3D Models.",
                    "Non-rigid 3D Model Classification Using 3D Hahn Moment Convolutional Neural Networks.",
                    "Completion of Cultural Heritage Objects with Rotational Symmetry.",
                    "Person Re-Identification from Depth Cameras using Skeleton and 3D Face Data.",
                    "Experimental Similarity Assessment for a Collection of Fragmented Artifacts.",
                    "Performing Image-like Convolution on Triangular Meshes."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "38th Eurographics 2017",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2017dbp",
                "sub_name": "38th Annual Conference of the European Association for Computer Graphics, Eurographics 2017 - Dirk Bartz Prize, Lyon, France, April 24-28, 2017.",
                "count": 3,
                "papers": [
                    "Visual Analytics for Digital Radiotherapy: Towards a Comprehensible Pipeline.",
                    "Sketching and Annotating Vascular Structures to Support Medical Teaching, Treatment Planning and Patient Education.",
                    "Visual Computing for Big Data Analysis in Prostate Cancer Research."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2017education",
                "sub_name": "38th Annual Conference of the European Association for Computer Graphics, Eurographics 2017 - Education Papers, Lyon, France, April 24-28, 2017.",
                "count": 9,
                "papers": [
                    "What we are teaching in Introduction to Computer Graphics.",
                    "Designing a Computer Graphics Course for First Year Undergraduates.",
                    "Generating ASCII-Art: A Nifty Assignment from a Computer Graphics Programming Course.",
                    "bRenderer: A Flexible Basis for a Modern Computer Graphics Curriculum.",
                    "Accessible GLSL Shader Programming.",
                    "Using Activity Led Learning for Teaching Computer Graphics Principles Through Augmented Reality.",
                    "Virtual Reality to teach anatomy.",
                    "What Should a Virtual/Augmented Reality Course be?",
                    "The New CGEMS - Preparing the Computer Graphics Educational Materials Source to Meet the Needs of Educators."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2017posters",
                "sub_name": "38th Annual Conference of the European Association for Computer Graphics, Eurographics 2017 - Posters, Lyon, France, April 24-26, 2017.",
                "count": 7,
                "papers": [
                    "High Quality and Efficient Direct Rendering of Massive Real-world Point Clouds.",
                    "Coupled Simulation of Deformable Bodies and ISPH Fluids for Secondary Bone Healing.",
                    "Swung-to-Cylinder Projection for Panoramic Image Viewing.",
                    "Differencing and Merging for 3D Animation Revision Control.",
                    "Proxy Clouds for RGB-D Stream Processing: A Preview.",
                    "Mesh SimplificationWith Curvature Error Metric.",
                    "Towards Developable Products from a Sketch."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2017short",
                "sub_name": "38th Annual Conference of the European Association for Computer Graphics, Eurographics 2017 - Short Papers, Lyon, France, April 24-28, 2017.",
                "count": 19,
                "papers": [
                    "Robust Blending and Occlusion Compensation in Dynamic Multi-Projection Mapping.",
                    "AIR: Anywhere Immersive Reality with User-Perspective Projection.",
                    "\"Synchronize\" to VR Body: Full Body Illusion in VR Space.",
                    "Ambient Occlusion Baking via a Feed-Forward Neural Network.",
                    "Real-Time View Independent Rasterization for Multi-View Rendering.",
                    "Variable k-buffer using Importance Maps.",
                    "Discovering New Monte Carlo Noise Filters with Genetic Programming.",
                    "AnimDiff: Comparing 3D Animations for Revision Control.",
                    "Physically-based Muscles and Fibers Modeling from Superficial Patches.",
                    "Fast Flow-based Distance Quantification and Interpolation for High-Resolution Density Distributions.",
                    "Spline-based Decomposition of Streamed Particle Trajectories for Efficient Transfer and Analysis.",
                    "Geometric Modeling of Multi-Material Printed Objects.",
                    "Phong Tessellation and PN Polygons for Polygonal Models.",
                    "Stroke Style Transfer.",
                    "Conformal Factor Persistence for Fast Hierarchical Cone Extraction.",
                    "Expanding Color Query Results via Image Recoloring.",
                    "An Automatic Stroke Extraction Method using Manifold Learning.",
                    "Detail Highlighting using a Shadow Edge Histogram.",
                    "Parameter Estimation of BSSRDF for Heterogeneous Materials."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2017tutorials",
                "sub_name": "38th Annual Conference of the European Association for Computer Graphics, Eurographics 2017 - Tutorials, Lyon, France, April 24-28, 2017.",
                "count": 6,
                "papers": [
                    "A Survey on Position Based Dynamics.",
                    "Partitioning Surfaces into Quad Patches.",
                    "Mobile Graphics.",
                    "Computer Generated Display Holography.",
                    "Topology Optimization for Computational Fabrication.",
                    "Introduction to Crowd Simulation."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2017",
                "sub_name": "10th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2017, Lyon, France, April 23-24, 2017.",
                "count": 18,
                "papers": [
                    "Exploiting the PANORAMA Representation for Convolutional Neural Network Classification and Retrieval.",
                    "LightNet: A Lightweight 3D Convolutional Neural Network for Real-Time 3D Object Recognition.",
                    "Unstructured Point Cloud Semantic Labeling Using Deep Segmentation Networks.",
                    "RGB-D to CAD Retrieval with ObjectNN Dataset.",
                    "3D Hand Gesture Recognition Using a Depth and Skeletal Dataset.",
                    "Large-Scale 3D Shape Retrieval from ShapeNet Core55.",
                    "Shape Similarity System driven by Digital Elevation Models for Non-rigid Shape Retrieval.",
                    "Sketch-based 3D Object Retrieval with Skeleton Line Views - Initial Results and Research Problems.",
                    "GSHOT: a Global Descriptor from SHOT to Reduce Time and Space Requirements.",
                    "A Framework Based on Compressed Manifold Modes for Robust Local Spectral Analysis.",
                    "Protein Shape Retrieval.",
                    "SHREC'17 Track: Point-Cloud Shape Retrieval of Non-Rigid Toys.",
                    "Deformable Shape Retrieval with Missing Parts.",
                    "Retrieval of Surfaces with Similar Relief Patterns.",
                    "3D Mesh Unfolding via Semidefinite Programming.",
                    "Directed Curvature Histograms for Robotic Grasping.",
                    "Semantic Correspondence Across 3D Models for Example-based Modeling.",
                    "Towards Recognizing of 3D Models Using A Single Image."
                ]
            },
            {
                "sub_name_abbr": "conf/wiced/2017",
                "sub_name": "6th Workshop on Intelligent Cinematography and Editing, WICED@Eurographics 2017, Lyon, France, April 24, 2017.",
                "count": 15,
                "papers": [
                    "Declarative Spatial Reasoning for Intelligent Cinematography.",
                    "La Caméra Enchantée.",
                    "Implementing Hitchcock - the Role of Focalization and Viewpoint.",
                    "CaMor: Screw Interpolation between Perspective Projections of Partial Views of Rectangular Images.",
                    "Inferring the Structure of Action Movies.",
                    "Analyzing Elements of Style in Annotated Film Clips.",
                    "Five Challenges for Intelligent Cinematography and Editing.",
                    "Zooming On All Actors: Automatic Focus+Context Split Screen Video Generation.",
                    "Pano2Vid: Automatic Cinematography for Watching 360° Videos.",
                    "A Probabilistic Logic Programming Approach to Automatic Video Montage.",
                    "Automatic Camera Selection and PTZ Canvas Steering for Autonomous Filming of Reality TV.",
                    "Making Movies from Make-Believe Games.",
                    "Design of an Intelligent Navigation System for Participative Computer Animation.",
                    "Using ECPs for Interactive Applications in Virtual Cinematography.",
                    "Film Ties: A Web-based Virtual 3D Lab for Teaching the Film Art from Script to Blocking."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "37th Eurographics 2016",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2016education",
                "sub_name": "37th Annual Conference of the European Association for Computer Graphics, Eurographics 2016 - Education Papers, Lisbon, Portugal, May 9-13, 2016.",
                "count": 10,
                "papers": [
                    "A Trip to Arts for Computer Graphics Students.",
                    "A Visualisation Course in a Game Development Curriculum.",
                    "Aiming High: Undergraduate Research Projects in Computer Graphics and Animation.",
                    "20 Years of the Central European Seminar on Computer Graphics.",
                    "Peer Review: Does it really help students?",
                    "Lowering the Entry Barrier for Students Programming Virtual Reality Applications.",
                    "The Online Anatomical Human: Web-based Anatomy Education.",
                    "Agile Curriculum Design for the Creative Industries.",
                    "A Video Games Technologies Course: Teaching, Learning, and Research.",
                    "MOOCs in Computer Graphics."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2016posters",
                "sub_name": "37th Annual Conference of the European Association for Computer Graphics, Eurographics 2016 - Posters, Lisbon, Portugal, May 9-13, 2016.",
                "count": 21,
                "papers": [
                    "Real-time Rendering of Heterogeneous Translucent Objects using Voxel Number Map.",
                    "Real-Time Rendering of Heterogeneous Translucent Materials with Dynamic Programming.",
                    "Rig-Space Motion Retargeting.",
                    "Efficient Point based Global Illumination on Intel MIC Architecture.",
                    "Efficient Voxel Marking for Hierarchical Volumetric Fusion.",
                    "Interactive Additive Diffraction Synthesis.",
                    "Acceptable System Latency for Gaze-Dependent Level of Detail Rendering.",
                    "A Practical GPU-accelerated Method for the Simulation of Naval Objects on Irregular Waves.",
                    "Physically-based Rendering of Highly Scattering Fluorescent Solutions using Path Tracing.",
                    "Tonal Art Maps with Image Space Strokes.",
                    "3D Modelling Framework: an Incremental Approach.",
                    "Interactive Monte-Carlo Ray-Tracing Upsampling.",
                    "Terracotta Reassembly from Fragments Based on Surface Ornamentation Adjacency Constraints.",
                    "Real-Time Video Texture Synthesis for Multi-Frame Capsule Endoscopy Visualization.",
                    "Transferring and Animating a non T-pose Model to a T-pose Model.",
                    "Augmenting Physical Maps: an AR Platform for Geographical Information Visualization.",
                    "Conversion of CAD Models to Loop Subdivision Surfaces.",
                    "A 3D Morphable Model of the Eye Region.",
                    "Skyglow: Towards a Night-time Illumination Model for Urban Environments.",
                    "Tiled Depth of Field Splatting.",
                    "No-infill 3D Printing."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2016short",
                "sub_name": "37th Annual Conference of the European Association for Computer Graphics, Eurographics 2016 - Short Papers, Lisbon, Portugal, May 9-13, 2016.",
                "count": 19,
                "papers": [
                    "Robust Transmission of Motion Capture Data using Interleaved LDPC and Inverse Kinematics.",
                    "Example-based Body Model Optimization and Skinning.",
                    "Trajectory Data Visualization on Mobile Devices with Animated Maps.",
                    "Mesh Saliency Analysis via Local Curvature Entropy.",
                    "Robust Gap Removal from Binary Volumes.",
                    "Smooth Interpolation of Curve Networks with Surface Normals.",
                    "Interactive Modeling of Support-free Shapes for Fabrication.",
                    "Subjective and Objective Evaluation of Multi-exposure High Dynamic Range Image Deghosting Methods.",
                    "A Simple and Effective Method to Detect Orthogonal Vanishing Points in Uncalibrated Images of Man-Made Environments.",
                    "Multi-Focus Plenoptic Simulator and Lens Pattern Mixing for Dense Depth Map Estimation.",
                    "Adaptive UW Image Deblurring via Sparse Representation.",
                    "Drift-Diffusion Based Real-Time Dynamic Terrain Deformation.",
                    "Interactive Deformation of Structurally Complex Heart Models Constructed from Medical Images.",
                    "Minimum Displacements For Cloth-obstacle Penetration Resolving.",
                    "Garment Transfer for Quadruped Characters.",
                    "Peripheral Retinal Image Simulation Based on Retina Shapes.",
                    "Two-Level Adaptive Sampling for Illumination Integrals using Bayesian Monte Carlo.",
                    "A Generic Physically-based Approach to the Opening Design Problem.",
                    "Texel Shading."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2016tutorials",
                "sub_name": "37th Annual Conference of the European Association for Computer Graphics, Eurographics 2016 - Tutorials, Lisbon, Portugal, May 9-13, 2016.",
                "count": 8,
                "papers": [
                    "Sketch-based Modeling.",
                    "Information Theory in Visualization.",
                    "The HDR-video Pipeline.",
                    "Advances in Geometry and Reflectance Acquisition.",
                    "Algorithms and Techniques for Virtual Camera Control.",
                    "3D Characters for Virtual Reality.",
                    "Deep Learning for Shape Analysis.",
                    "Visual Attention from a Graphics Point of View."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2016",
                "sub_name": "9th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2016, Lisbon, Portugal, May 8, 2016.",
                "count": 15,
                "papers": [
                    "Shape Retrieval and 3D Gestural Interaction.",
                    "Towards an Observer-oriented Theory of Shape Comparison.",
                    "3D Objects Exploration: Guidelines for Future Research.",
                    "A Descriptor for Voxel Shapes Based on the Skeleton Cut Space.",
                    "An Experimental Shape Matching Approach for Protein Docking.",
                    "An Edit Distance for Reeb Graphs.",
                    "An Evaluation of Local Feature Encodings for Shape Retrieval.",
                    "Retrieval of Human Subjects from Depth Sensor Data.",
                    "3D Sketch-Based 3D Shape Retrieval.",
                    "Matching of Deformable Shapes with Topological Noise.",
                    "Partial Matching of Deformable Shapes.",
                    "Shape Retrieval of Low-Cost RGB-D Captures.",
                    "Partial Shape Queries for 3D Object Retrieval.",
                    "Large-Scale 3D Shape Retrieval from ShapeNet Core55.",
                    "3D Object Retrieval with Multimodal Views."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2016gradifab",
                "sub_name": "1st Eurographics Workshop on Graphics for Digital Fabrication, GraDiFab@Eurographics 2016, Lisbon, Portugal, May 8, 2016.",
                "count": 6,
                "papers": [
                    "State of The Art on Functional Fabrication.",
                    "Tight Printable Enclosures and Support Structures for Additive Manufacturing.",
                    "Low-budget 3D Printed Haptic Navigation Aids for the Visually Impaired.",
                    "Foldlings: A Tool for Interactive Pop-up Card Design.",
                    "Restoration of Architectural Ornament for Historic Buildings.",
                    "Shape Adaptive Cut Lines."
                ]
            },
            {
                "sub_name_abbr": "conf/wiced/2016",
                "sub_name": "5th Workshop on Intelligent Cinematography and Editing, WICED@Eurographics 2016, Lisbon, Portugal, May 9, 2016.",
                "count": 5,
                "papers": [
                    "Automatic Lighting Design from Photographic Rules.",
                    "Contact Visualization.",
                    "Introducing Basic Principles of Haptic Cinematography and Editing.",
                    "Automated Cinematography with Unmanned Aerial Vehicles.",
                    "Analysing Cinematography with Embedded Constrained Patterns."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "36th Eurographics 2015",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2015dbp",
                "sub_name": "36th Annual Conference of the European Association for Computer Graphics, Eurographics 2015 - Dirk Bartz Prize, Zurich, Switzerland, May 4-8, 2015.",
                "count": 3,
                "papers": [
                    "Surgery Training, Planning and Guidance Using the SOFA Framework.",
                    "Guided Analysis of Cardiac 4D PC-MRI Blood Flow Data.",
                    "Multi-Touch Table System for Medical Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2015education",
                "sub_name": "36th Annual Conference of the European Association for Computer Graphics, Eurographics 2015 - Education Papers, Zurich, Switzerland, May 4-8, 2015.",
                "count": 8,
                "papers": [
                    "Adapting the Twelve Principles of Classic Animation to Lectures.",
                    "Redesign of an Introductory Computer Graphics Course.",
                    "A Virtual and Augmented Reality Course Based on Inexpensive Interaction Devices and Displays.",
                    "Teaching Graphics To Students Struggling in Math: An Experience.",
                    "Augmenting Design Curriculum with Location-Aware Technologies.",
                    "Augmented Reality as a Tool to Deliver e-Learning based Blended Content in and out of the Class-room.",
                    "InfoView3D: A Solution Showing Educational Model on Multi-Touch Surfaces.",
                    "SVEn - Shared Virtual Environment."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2015posters",
                "sub_name": "36th Annual Conference of the European Association for Computer Graphics, Eurographics 2015 - Posters, Zurich, Switzerland, May 4-8, 2015.",
                "count": 12,
                "papers": [
                    "Exploiting the Potential of Image Based Crowd Rendering.",
                    "Big City 3D Visual Analysis.",
                    "GHand: A GPU Algorithm for Realtime Hand Pose Estimation Using Depth Camera.",
                    "Privacy Protecting, Real-time Face Re-recognition.",
                    "Real-time Content Adaptive Depth Retargeting for Light Field Displays.",
                    "Deep Learning on a Raspberry Pi for Real Time Face Recognition.",
                    "Egocentric Normalization of Kinematic Path.",
                    "A Computational Model of Light-Sheet Fluorescence Microscopy using Physically-based Rendering.",
                    "Combining Human Visual System Models for Geographic Gaze Contingent Displays.",
                    "PHENOM: Interest Points on Photometric Normal Maps.",
                    "SpatialWhiteboard: A New Wearable Air-Writing Interaction with Kinect Sensor and Vibrating Ring Interface.",
                    "Evaluation of the compressibility of Computer-Generated Holograms."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2015short",
                "sub_name": "36th Annual Conference of the European Association for Computer Graphics, Eurographics 2015 - Short Papers, Zurich, Switzerland, May 4-8, 2015.",
                "count": 20,
                "papers": [
                    "Fast Edge-based Geodesic Poisson Disk Remeshing.",
                    "3D Architectural Modeling: Efficient RANSAC for n-gonal Primitive Fitting.",
                    "4D Mesh Reconstruction from Time-Varying Voxelized Geometry through ARAP Tracking.",
                    "Quadratic Encoding for Hand Pose Reconstruction from Multi-Touch Input.",
                    "Isogeometric Analysis for Modelling and Design.",
                    "Fractured Object Reassembly via Robust Surface Registration.",
                    "Sketch-Based Controllers for Blendshape Facial Animation.",
                    "Interactive HDR Environment Map Capturing on Mobile Devices.",
                    "Content-Aware Projection for Tiny Planets.",
                    "Eye-tracktive: Measuring Attention to Body Parts when Judging Human Motions.",
                    "Individual Time Stepping for SPH Fluids.",
                    "Target Temperature Driven Dynamic Flame Animation.",
                    "An Interactive Editing System for Visual Appearances of Fire and Explosions.",
                    "Pixel Merge Unit.",
                    "High-Quality Shadows for Streaming Terrain Rendering.",
                    "Adaptive LightSlice for Virtual Ray Lights.",
                    "Interactive Pixel-Accurate Rendering of LR-Splines and T-Splines.",
                    "Improving k-buffer Methods via Occupancy Maps.",
                    "Separation of Manga Line Drawings and Screentones.",
                    "Generation of Folded Terrains from Simple Vector Maps."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2015tutorials",
                "sub_name": "36th Annual Conference of the European Association for Computer Graphics, Eurographics 2015 - Tutorials, Zurich, Switzerland, May 4-8, 2015.",
                "count": 5,
                "papers": [
                    "3D Video: from Capture to Interactive Display.",
                    "Eye Tracking Visualization.",
                    "Position-Based Simulation Methods in Computer Graphics.",
                    "Meshless Interpolations for Computer Graphics, Visualization and Games.",
                    "Tools and Techniques for Direct Volume Interaction."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2015",
                "sub_name": "8th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2015, Zurich, Switzerland, May 2-3, 2015.",
                "count": 22,
                "papers": [
                    "3D GrabCut: Interactive Foreground Extraction for Reconstructed 3D Scenes.",
                    "Automatic 3D Object Fracturing for Evaluation of Partial Retrieval and Object Restoration Tasks - Benchmark and Application to 3D Cultural Heritage Data.",
                    "Randomized Sub-Volume Partitioning for Part-Based 3D Model Retrieval.",
                    "Partial 3D Object Retrieval combining Local Shape Descriptors with Global Fisher Vectors.",
                    "Indoor Location Retrieval using Shape Matching of KinectFusion Scans to Large-Scale Indoor Point Clouds.",
                    "Sketch-based 3D Object Retrieval Using Two Views and a Visual Part Alignment.",
                    "3D Object Retrieval with Parametric Templates.",
                    "Morphological Analysis of 3D Faces for Weight Gain Assessment.",
                    "A Spatio-Temporal Descriptor for Dynamic 3D Facial Expression Retrieval and Recognition.",
                    "Accelerating the Computation of Canonical Forms for 3D Nonrigid Objects using Multidimensional Scaling.",
                    "ThOR: Three-dimensional Object Retrieval Library.",
                    "Towards Scientific Benchmarks: On Increasing the Credibility of Benchmarks.",
                    "Bag of Compact HKS-based Feature Descriptors.",
                    "Computing Local Binary Patterns on Mesh Manifolds for 3D Texture Retrieval.",
                    "RETRIEVAL 3D: An On-line Content-Based Retrieval Performance Evaluation Tool.",
                    "Canonical Forms for Non-Rigid 3D Shape Retrieval.",
                    "Non-rigid 3D Shape Retrieval.",
                    "Scalability of Non-Rigid 3D Shape Retrieval.",
                    "3D Object Retrieval with Multimodal Views.",
                    "Retrieval of Non-rigid (textured) Shapes Using Low Quality 3D Models.",
                    "Retrieval of Objects Captured with Kinect One Camera.",
                    "Range Scans based 3D Shape Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/wiced/2015",
                "sub_name": "4th Workshop on Intelligent Cinematography and Editing, WICED@Eurographics 2015, Zurich, Switzerland, May 4, 2015.",
                "count": 13,
                "papers": [
                    "Designing Computer Based Archaeological 3D-Reconstructions: How Camera Zoom Influences Attention.",
                    "Computer Generation of Filmic Discourse from a Cognitive/Affective Perspective.",
                    "Comparing Film-editing.",
                    "Key-frame Based Spatiotemporal Scribble Propagation.",
                    "Efficient Salient Foreground Detection for Images and Video using Fiedler Vectors.",
                    "A Computational Framework for Vertical Video Editing.",
                    "Toward More Effective Viewpoint Computation Tools.",
                    "Stylistic Patterns for Generating Cinematographic Sequences.",
                    "The Influence of a Moving Camera on the Perception of Distances between Moving Objects.",
                    "Insight: An Annotation Tool and Format for Film Analysis.",
                    "Implementing Game Cinematography: Technical Challenges and Solutions for Automatic Camera Control in Games.",
                    "Film Ties: An Architecture for Collaborative Data-driven Cinematography.",
                    "Visibility-Aware Framing for 3D Modelers."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "35th Eurographics 2014",
        "info": "Strasbourg, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2014education",
                "sub_name": "35th Annual Conference of the European Association for Computer Graphics, Eurographics 2014 - Education Papers, Strasbourg, France, April 7-11, 2014.",
                "count": 8,
                "papers": [
                    "Programming Topological Operations for Visual Illustrations in an Introductory Geomorphology Course.",
                    "glGA: an OpenGL Geometric Application Framework for a Modern, Shader-based Computer Graphics Curriculum.",
                    "Using Modern Interaction Devices for HCI and Interaction Design Courses.",
                    "Teaching Interactivity: Introducing Design Students to Sensors and Microcontrollers.",
                    "The Four I's Recipe for Cooking Up Computer Graphics Exercises and Assessments.",
                    "Student Project - Portable Real-Time 3D Engine.",
                    "Producing Creative Artistic Projects by Grouping Students' Computer Graphics Research Topics.",
                    "Two Exceptional Projects from a Multidisciplinary Game Development Curriculum."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2014posters",
                "sub_name": "35th Annual Conference of the European Association for Computer Graphics, Eurographics 2014 - Posters, Strasbourg, France, April 7-11, 2014.",
                "count": 10,
                "papers": [
                    "Facet Extraction and Classification for the Reassembly of Fractured 3D Objects.",
                    "HDR Imaging Using Augmented Lagrange Multipliers (ALM).",
                    "AR-TagBrowse: Annotating and Browsing 3D Objects on Mobile Devices.",
                    "A Nonobscuring Eye Tracking Solution for Wide Field-of-View Head-mounted Displays.",
                    "Interactive Diffraction from Biological Nanostructures.",
                    "Learning Strategies to Select Point Cloud Descriptors for 3D Object Classification: A Proposal.",
                    "Hexahedral Mesh Adaptation to Imprint Geometric Details: Application to CAD Models.",
                    "The Split Grid - A Hierarchical 1D-Grid-based Acceleration Data Structure for Ray Tracing.",
                    "Skeleton-based Joints Position Detection.",
                    "Reconstructing Complex Indoor Environments with Arbitrary Wall Orientations."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2014short",
                "sub_name": "35th Annual Conference of the European Association for Computer Graphics, Eurographics 2014 - Short Papers, Strasbourg, France, April 7-11, 2014.",
                "count": 16,
                "papers": [
                    "Depth Sensor-Based Realtime Tumor Tracking for Accurate Radiation Therapy.",
                    "Unified Skeletal Animation Reconstruction with Multiple Kinects.",
                    "Merging Live and pre-Captured Data to support Full 3D Head Reconstruction for Telepresence.",
                    "Combining Inertial Navigation and ICP for Real-time 3D Surface Reconstruction.",
                    "A Tone Reproduction Operator for All Luminance Ranges Considering Human Color Perception.",
                    "Towards Understanding Beautiful Things: A Computational Approach for the Study of Color Modulation in Visual Art.",
                    "HDR Reconstruction for Alternating Gain (ISO) Sensor Readout.",
                    "Unsupervised Three-dimensional Reconstruction of Small Rocks from a Single Two-dimensional Image.",
                    "CSG Feature Trees from Engineering Sketches of Polyhedral Shapes.",
                    "Data Driven Assembly of Procedurally Modeled Facilities.",
                    "A User Study: Is the Advection Step in Shallow Water Equations Really Necessary?.",
                    "Regional Time Stepping for SPH.",
                    "Deferred Shading for Order-Independent Transparency.",
                    "Latency Considerations of Depth-first GPU Ray Tracing.",
                    "Post-Tessellation Geometry Caches.",
                    "Information-Guided Transfer Function Refinement."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2014stars",
                "sub_name": "35th Annual Conference of the European Association for Computer Graphics, Eurographics 2014 - State of the Art Reports, Strasbourg, France, April 7-11, 2014.",
                "count": 10,
                "papers": [
                    "Physically-based Simulation of Cuts in Deformable Bodies: A Survey.",
                    "SPH Fluids in Computer Graphics.",
                    "A Survey of Color Mapping and its Applications.",
                    "Look me in the Eyes: A Survey of Eye and Gaze Animation for Virtual Agents and Artificial Systems.",
                    "State of the Art Report on Real-time Rendering with Hardware Tessellation.",
                    "Data-Driven Video Completion.",
                    "Quantifying 3D Shape Similarity Using Maps: Recent Trends, Applications and Perspectives.",
                    "State of the Art in Surface Reconstruction from Point Clouds.",
                    "State of the Art in Artistic Editing of Appearance, Lighting, and Material.",
                    "Practice and Theory of Blendshape Facial Models."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2014tutorials",
                "sub_name": "35th Annual Conference of the European Association for Computer Graphics, Eurographics 2014 - Tutorials, Strasbourg, France, April 7-11, 2014.",
                "count": 9,
                "papers": [
                    "Simulating Heterogeneous Crowds with Interactive Behaviors.",
                    "3D Video: from Capture to Diffusion.",
                    "Reasoning About Shape in Complex Datasets: Geometry, Structure and Semantics.",
                    "Bayesian and Quasi Monte Carlo Spherical Integration for Illumination Integrals.",
                    "Path Integral Methods for Light Transport Simulation: Theory and Practice.",
                    "Turbulent Fluids.",
                    "Dynamic 2D/3D Registration.",
                    "Efficient Sorting and Searching in Rendering Algorithms.",
                    "An Introduction to Optimization Techniques in Computer Graphics."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2014",
                "sub_name": "7th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2014, Strasbourg, France, April 6, 2014.",
                "count": 17,
                "papers": [
                    "GeoTopo: Dynamic 3D Facial Expression Retrieval Using Topological and Geometric Information.",
                    "Coulomb Shapes: Using Electrostatic Forces for Deformation-invariant Shape Representation.",
                    "TreeSha: 3D Shape Retrieval with a Tree Graph Representation based on the Autodiffusion Function Topology.",
                    "Quantitative Comparison of Hole Filling Methods for 3D Object Search.",
                    "The Canonically Posed 3D Objects Dataset.",
                    "Manifold Harmonic Transform and Spatial Relationships for Partial 3D Object Retrieval.",
                    "Symmetry and Fourier Descriptor: A Hybrid Feature For NURBS based B-Rep Models Retrieval.",
                    "Temporal Ensemble of Shape Functions.",
                    "Fisher Encoding of Adaptive Fast Persistent Feature Histograms for Partial Retrieval of 3D Pottery Objects.",
                    "3D Volume Matching for Mesh Animation of Moving Actors.",
                    "Similarity of Deforming Meshes Based on Spatio-temporal Segmentation.",
                    "Towards the Extraction of Hierarchical Building Descriptions from 3D Indoor Scans.",
                    "Automatic Location of Landmarks used in Manual Anthropometry.",
                    "Shape Retrieval of Non-Rigid 3D Human Models.",
                    "Retrieval and Classification on Textured 3D Models.",
                    "Extended Large Scale Sketch-Based 3D Shape Retrieval.",
                    "Large Scale Comprehensive 3D Shape Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "34th Eurographics 2013",
        "info": "Girona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2013dbp",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Dirk Bartz Prize, Girona, Spain, May 6-10, 2013.",
                "count": 3,
                "papers": [
                    "High-Quality 3D Visualization of In-Situ Ultrasonography.",
                    "Effective Visual Exploration of Hemodynamics in Cerebral Aneurysms.",
                    "OctaVis: A Virtual Reality System for Clinical Studies and Rehabilitation."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013education",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Education Papers, Girona, Spain, May 6-10, 2013.",
                "count": 4,
                "papers": [
                    "Project-Based Learning of Advanced Computer Graphics and Interaction.",
                    "Student Project - Racing Launcher Game.",
                    "Introductory Graphics for Very Diverse Audiences.",
                    "Scene Graph Creation And Management For Undergraduates."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013lab",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Lab Presentations, Girona, Spain, May 6-10, 2013.",
                "count": 10,
                "papers": [
                    "Graphics & Interaction Group, The Computer Laboratory, University of Cambridge, UK.",
                    "Simulation Unit in CEIT, Navarra, Spain.",
                    "CRS4 Visual Computing, Pula, Italy.",
                    "DCGI Laboratories at CTU Prague, Czech Republic.",
                    "CIIG: Granada Graphics Group, Granada, Spain.",
                    "Graphics and Imaging Lab, Zaragoza, Spain.",
                    "The Institute of Computer Graphics and Algorithms, Vienna, Austria.",
                    "The Research Institude of Visual Computing, RIVIC, UK.",
                    "ViRVIG: Research Center for Visualization, Virtual Reality and Graphics Interaction, Girona, Spain.",
                    "VRVis Zentrum für Virtual Reality und Visualisierung Forschungs-GmbH, Vienna, Austria."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013posters",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Posters, Girona, Spain, May 6-10, 2013.",
                "count": 12,
                "papers": [
                    "Towards a Physically Plausible Constrained Shader Graph System for Predictive Rendering.",
                    "A Sensor Based Approach to Outdoor Illumination Estimation for Augmented Reality Applications on Mobile Devices.",
                    "Poisson Image Analogy: Texture-Aware Seamless Cloning.",
                    "Volume Ray Casting quality estimation in terms of Peak Signal-to-Noise Ratio.",
                    "Real-time Control and Stopping of Fluids.",
                    "A Distributed and Collaborative vSLAM Framework for Real-Time Localisation in Huge Environments for Mobile Devices.",
                    "Multi-Camera Acquisition and Placement Strategy for Displaying High-Resolution Images for Telepresence Systems.",
                    "On Depth-testing Wide Outlines.",
                    "Reverse Skew-T - A Cloudmaking Tool for CG.",
                    "Time-variant Volumetric Colors for Metamorphosis.",
                    "Using Webcams for Product Presentations in HTML5.",
                    "Automatic Convergence Adjustment for Stereoscopy using Eye Tracking."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013short",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Short Papers, Girona, Spain, May 6-10, 2013.",
                "count": 24,
                "papers": [
                    "Direct Contouring of Implicit Closest Point Surfaces.",
                    "Transfinite Surface Patches Using Curved Ribbons.",
                    "Feature-preserving Direct Blue Noise Sampling for Surface Meshes.",
                    "Centers of Approximate Spherical Symmetry and Radial Symmetry Graphs.",
                    "A Segmentation Transfer Method for Articulated Models.",
                    "Volume Controllable SPH.",
                    "Enhanced Lattice Boltzmann Shallow Waters for Real-time Fluid Simulations.",
                    "Adaptive Remeshing for Real-Time Mesh Deformation.",
                    "Real-time Collision Detection for Dynamic Hardware Tessellated Objects.",
                    "Accelerating kd-tree Searches for all k-nearest Neighbours.",
                    "Real-Time High Fidelity Inverse Tone Mapping for Low Dynamic Range Content.",
                    "Seam-Driven Image Stitching.",
                    "Generating Pseudo-3D Painting Based on Visual Saliency and Composition Rules.",
                    "Automatic Parameter Control for Metropolis Light Transport.",
                    "Real-Time Image-Based Volume Lighting.",
                    "Perceptually Motivated Real-Time Compression of Motion Data Enhanced by Incremental Encoding and Parameter Tuning.",
                    "Real-Time Importance Sampling of Dynamic Environment Maps.",
                    "Extraction and Visual Analysis of Seismic Horizon Ensembles.",
                    "Size-Based Rendering for Lung Cancer Screening.",
                    "Graph Abstraction for Simplified Proofreading of Slice-based Volume Segmentation.",
                    "Automatic Generation of Constructable Brick Sculptures.",
                    "GPU Roof Grammars.",
                    "Automatic Modeling of Planar-Hinged Buildings.",
                    "Guided Capturing of Multi-view Stereo Datasets."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013stars",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - State of the Art Reports, Girona, Spain, May 6-10, 2013.",
                "count": 9,
                "papers": [
                    "Position-based Methods for the Simulation of Solid Objects in Computer Graphics.",
                    "Scalable Realistic Rendering with Many-Light Methods.",
                    "Glyph-based Visualization: Foundations, Design Guidelines, Techniques and Applications.",
                    "A Survey of Interaction Techniques for Interactive 3D Environments.",
                    "State of the Art of Parallel Coordinates.",
                    "A Survey of Compressed GPU-Based Direct Volume Rendering.",
                    "Computational Fabrication and Display of Material Appearance.",
                    "Modeling Terrains and Subsurface Geology.",
                    "Structure-Aware Shape Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2013tutorials",
                "sub_name": "34th Annual Conference of the European Association for Computer Graphics, Eurographics 2013 - Tutorials, Girona, Spain, May 6-10, 2013.",
                "count": 9,
                "papers": [
                    "Data-Driven Simulation Methods in Computer Graphics: Cloth, Tissue and Faces.",
                    "Video Visualization.",
                    "Understanding and Designing Perceptual Experiments.",
                    "Computational Displays: Combining Optical Fabrication, Computational Processing, and Perceptual Tricks to Build the Displays of the Future.",
                    "An Eye on Perceptual Graphics: Eye-Tracking Methodology.",
                    "Tensor Approximation in Visualization and Computer Graphics.",
                    "Projective Geometry, Duality and Precision of Computation in Computer Graphics, Visualization and Games.",
                    "Natural Image Statistics: Foundations and Applications.",
                    "Symmetry in Shapes - Theory and Practice."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2013",
                "sub_name": "6th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2013, Girona, Spain, May 11, 2013.",
                "count": 15,
                "papers": [
                    "Automatic Shape Expansion with Verification to Improve 3D Retrieval, Classification and Matching.",
                    "Local Signature Quantization by Sparse Coding.",
                    "Compact Vectors of Locally Aggregated Tensors for 3D Shape Retrieval.",
                    "Learning Kernels on Extended Reeb Graphs for 3D Shape Classification and Retrieval.",
                    "3D Human Video Retrieval: from Pose to Motion Matching.",
                    "SymPan: 3D Model Pose Normalization via Panoramic Views and Reflective Symmetry.",
                    "Sketch-Based 3D Model Retrieval by Viewpoint Entropy-Based Adaptive View Clustering.",
                    "Geometric Histograms of 3D Keypoints for Face Identification with Missing Parts.",
                    "SHREC'13 Track: Retrieval of Objects Captured with Low-Cost Depth-Sensing Cameras.",
                    "SHREC'13 Track: Retrieval on Textured 3D Models.",
                    "SHREC'13 Track: Large-Scale Partial Shape Retrieval Using Simulated Range Images.",
                    "SHREC'13 Track: Large Scale Sketch-Based 3D Shape Retrieval.",
                    "Charge Density-Based 3D Model Retrieval Using Bag-of-Feature.",
                    "3D-Model Retrieval Using Bag-of-Features Based on Closed Curves.",
                    "Features Accumulation on a Multiple View Oriented Model for People Re-Identification."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2013",
                "sub_name": "13th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2013, Girona, Spain, May 4-5, 2013.",
                "count": 9,
                "papers": [
                    "GPU Acceleration of Particle Advection Workloads in a Parallel, Distributed Memory Setting.",
                    "In Situ Pathtube Visualization with Explorable Images.",
                    "Scalable Parallel Feature Extraction and Tracking for Large Time-varying 3D Volume Data.",
                    "Scalable Seams for Gigapixel Panoramas.",
                    "Rendering Molecular Surfaces using Order-Independent Transparency.",
                    "VtkSMP: Task-based Parallel Operators for VTK Filters.",
                    "Practical Parallel Rendering of Detailed Neuron Simulations.",
                    "Analysis of Cache Behavior and Performance of Different BVH Memory Layouts for Tracing Incoherent Rays.",
                    "Image-parallel Ray Tracing using OpenGL Interception."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "33rd Eurographics 2012",
        "info": "Cagliari, Sardinia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2012education",
                "sub_name": "33rd Annual Conference of the European Association for Computer Graphics, Eurographics 2012 - Education Papers, Cagliari, Sardinia, Italy, May 13-18, 2012.",
                "count": 11,
                "papers": [
                    "Visualization Curriculum Panel - or The Changes We Have Made to Our Visualization Courses Over the Last 10 Years.",
                    "Adaptation of Electrical Laboratory Systems through Augmented Reality for Optimization of Engineering Teaching University.",
                    "Evaluation of an Augmented Reality Enhanced Tabletop System as a Collaborative Learning Tool: A Case Study on Mathematics at the Primary School.",
                    "Evaluation of a Curriculum for Technical Artists.",
                    "Teaching 3D Acquisition for Cultural Heritage: a Theory and Practice Approach.",
                    "Building a Serious Game to Teach Secure Coding in Introductory Programming Courses.",
                    "Next Generation Handheld Graphics Edutainment for Learning in Adaptive Student Centric Environments: Constraints and Benefits.",
                    "TECHNI Photons: Evolution of a Course in Data Structures.",
                    "Evaluation of Students' Skills in Remote Collaboration for Creative Problem Solving in Computer Graphics.",
                    "Distance Learning in Computer Graphics.",
                    "Teaching a Modern Graphics Pipeline Using a Shader-based Software Renderer."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2012posters",
                "sub_name": "33rd Annual Conference of the European Association for Computer Graphics, Eurographics 2012 - Posters, Cagliari, Sardinia, Italy, May 13-18, 2012.",
                "count": 20,
                "papers": [
                    "Revision Control Framework for 3D Assets.",
                    "Combining Texture Streaming and Run-Time Generation.",
                    "Virtual Architecture in the Free Space.",
                    "Interactive Insertion of Virtual Objects in Photos and Videos.",
                    "A Pipeline for Procedural Modelling from Geospatial Data.",
                    "A New Approach to Cultural Heritage Information Systems.",
                    "On User-Interaction in 3D Reconstruction.",
                    "Exploration of 3D Spectroscopy Data.",
                    "Efficient Point Based Global Illumination on GPU.",
                    "Automatic Alignment of Shape Collections.",
                    "Digital Archiving of Large 3D Woven Cultural Artifacts.",
                    "Meshless Statistical Occlusion Computation.",
                    "Minimising Longest Edge for Closed Surface Construction from Unorganised 3D Point Sets.",
                    "Multi-user Immersive 3D Reconstruction Environment.",
                    "GPU Texture Level of Abstraction in 3D Scenes.",
                    "Multiview-Consistent Color Sampling for Alpha Matting.",
                    "Combining Structure from Motion and Photometric Stereo: A Piecewise Formulation.",
                    "Joint Interactive Visualization of 3D Models and Pictures in Walkable Scenes.",
                    "Consistent Media Model for Real-Time Scene Rendering.",
                    "Realtime 3D Sensor Based Air Flow Reconstruction."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2012short",
                "sub_name": "33rd Annual Conference of the European Association for Computer Graphics, Eurographics 2012 - Short Papers, Cagliari, Sardinia, Italy, May 13-18, 2012.",
                "count": 27,
                "papers": [
                    "Skeleton Based Importance Sampling for Path Tracing.",
                    "Forward+: Bringing Deferred Lighting to the Next Level.",
                    "Reflective Shadow Map Clustering for Real-Time Global Illumination.",
                    "Hybrid CPU/GPU KD-Tree Construction for Versatile Ray Tracing.",
                    "Perceptually Based Afterimage Synthesis.",
                    "Robust Outlier Removal from Point Clouds Acquired with Structured Light.",
                    "Automatic Multi-view Surface Matching.",
                    "Growing Cell Structures Learning a Progressive Mesh During Surface Reconstruction - A Top-Down Approach.",
                    "Shape Reconstruction from Raw Point Clouds using Depth Carving.",
                    "Variation-Factored Encoding of Facade Images.",
                    "Efficient Evaluation of Semi-Smooth Creases in Catmull-Clark Subdivision Surfaces.",
                    "Scented Sliders for Procedural Textures.",
                    "Geometric Details on Skeleton-based Implicit Surfaces.",
                    "Example-based Road Network Synthesis.",
                    "Steady State Stokes Flow Interpolation for Fluid Control.",
                    "FTLE Computation Beyond First-Order Approximation.",
                    "Solid-state Culled Discrete Element Granular Systems.",
                    "Image-based Animation of Clothes.",
                    "Improved Obstacle Relevancy, Distance, and Angle for Crowds Constrained to Arbitrary Manifolds in 3D Space.",
                    "Fast Response, Quick Progressive Transitions using Body Part Motion Graphs.",
                    "Automatic Line Handles for Freeform Deformation.",
                    "GPU based ARAP Deformation using Volumetric Lattices.",
                    "Physically-Based Depth of Field in Augmented Reality.",
                    "Real-Time Metaball Ray Casting with Fragment Lists.",
                    "Incoherent Ray Tracing without Acceleration Structures.",
                    "S-buffer: Sparsity-aware Multi-fragment Rendering.",
                    "Hyperplane Culling for Stochastic Rasterization."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2012stars",
                "sub_name": "33rd Annual Conference of the European Association for Computer Graphics, Eurographics 2012 - State of the Art Reports, Cagliari, Sardinia, Italy, May 13-18, 2012.",
                "count": 8,
                "papers": [
                    "A Survey of Urban Reconstruction.",
                    "Symmetry in 3D Geometry: Extraction and Applications.",
                    "Interactive Volume Rendering with Volumetric Illumination.",
                    "Illustrative Flow Visualization: State of the Art, Trends and Challenges.",
                    "Interactive Simulation of Rigid Body Dynamics in Computer Graphics.",
                    "Perceptual Metrics for Static and Dynamic Triangle Meshes.",
                    "Quad Meshing.",
                    "A Facial Rigging Survey."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2012tutorials",
                "sub_name": "33rd Annual Conference of the European Association for Computer Graphics, Eurographics 2012 - Tutorials, Cagliari, Sardinia, Italy, May 13-18, 2012.",
                "count": 5,
                "papers": [
                    "Mapping Images to Target Devices: Spatial, Temporal, Stereo, Tone, and Color.",
                    "Diffusion Geometry in Shape Analysis.",
                    "Dynamic Geometry Processing.",
                    "A Practical Guide to Polygon Mesh Repairing.",
                    "Recent Advances in Real-Time Collision and Proximity Computations for Games and Simulations."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2012",
                "sub_name": "5th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2012, Cagliari, Sardinia, Italy, May 13, 2012.",
                "count": 19,
                "papers": [
                    "Similarity Based Object Retrieval of Composite Neuronal Structures.",
                    "3D Object Retrieval via Range Image Queries based on SIFT descriptors on Panoramic Views.",
                    "Parallelized Algorithms for Rigid Surface Alignment on GPU.",
                    "Key-component Detection on 3D Meshes using Local Features.",
                    "Intrinsic Local Symmetries: A Computational Framework.",
                    "Affine-Invariant Photometric Heat Kernel Signatures.",
                    "Sketch-based 3D Model Retrieval using Keyshapes for Global and Local Representation.",
                    "Towards an Immersive Interface for 3D Object Retrieval.",
                    "Local Goemetrical Feature with Spatial Context for Shape-based 3D Model Retrieval.",
                    "Spectral Analysis Driven Sparse Matching of 3D Shapes.",
                    "Effective Shapes Generation for Bayesian CAD Model Reconstruction.",
                    "Automated Contextual Annotation of B-Rep Cad Mechanical Components Deriving Technology and Symmetry Information to Support Partial Retrieval.",
                    "Kinematic Skeleton Extraction Based on Motion Boundaries for 3D Dynamic Meshes.",
                    "Articulated Motion Segmentation of Point Clouds by Group-Valued Regularization.",
                    "Real-time Expression Recognition from Dynamic Sequences of 3D Facial Scans.",
                    "SHREC'12 Track: 3D Mesh Segmentation.",
                    "SHREC'12 Track: Stability on Abstract Shapes.",
                    "SHREC'12 Track: Sketch-Based 3D Shape Retrieval.",
                    "SHREC'12 Track: Generic 3D Shape Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2012",
                "sub_name": "12th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2012, Cagliari, Sardinia, Italy, May 13-14, 2012.",
                "count": 16,
                "papers": [
                    "HyperFlow: A Heterogeneous Dataflow Architecture.",
                    "PISTON: A Portable Cross-Platform Framework for Data-Parallel Visualization Operators.",
                    "EAVL: The Extreme-scale Analysis and Visualization Library.",
                    "Explicit Cache Management for Volume Ray-Casting on Parallel Architectures.",
                    "GLuRay: Enhanced Ray Tracing in Existing Scientific Visualization Applications using OpenGL Interception.",
                    "A Study of Ray Tracing Large-scale Scientific Data in Two Widely Used Parallel Visualization Applications.",
                    "Dynamic Scheduling for Large-Scale Distributed-Memory Ray Tracing.",
                    "Fast Collision Culling in Large-Scale Environments Using GPU Mapping Function.",
                    "Light Propagation Maps on Parallel Graphics Architectures.",
                    "Polygonization of Implicit Surfaces on Multi-Core Architectures with SIMD Instructions.",
                    "Load-Balanced Multi-GPU Ambient Occlusion for Direct Volume Rendering.",
                    "Parallel Rendering on Hybrid Multi-GPU Clusters.",
                    "Multi-GPU Image-based Visual Hull Rendering.",
                    "Shift-Based Parallel Image Compositing on InfiniBandTM Fat-Trees.",
                    "Auto Splats: Dynamic Point Cloud Visualization on the GPU.",
                    "Time-constrained Animation Rendering on Desktop Grids."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "32nd Eurographics 2011",
        "info": "Llandudno, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2011areas",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Areas Papers, Llandudno, UK, April 11-15, 2011.",
                "count": 13,
                "papers": [
                    "High-Quality Tactile Paintings.",
                    "Multispectral Image Matting of Ancient Chinese Paintings.",
                    "Learning How to Match Fresco Fragments.",
                    "A Streaming Framework for Seamless Detailed Photo Blending on Massive Point Clouds.",
                    "Relightable Buildings from Images.",
                    "Using Procedural Modelling as a Framework for Representing Style: An Example from Regency Architecture.",
                    "Rendering Interior Cultural Heritage Scenes Using Image-based Shooting.",
                    "Enhancement of Low Dynamic Range Videos using High Dynamic Range Backgrounds.",
                    "Avoiding Chromaticity Creep with PseudoGrey.",
                    "Synthesizing Relative Radiance for Realistic Rendering of Virtual Objects in 3D Photo Collections.",
                    "Photographically Guided Alignment for HDR Images.",
                    "Towards Mobile HDR Video.",
                    "HDR Photographic Pipeline for Camera Modules in Mobile Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011dbp",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Dirk Bartz Prize, Llandudno, UK, April 11-15, 2011.",
                "count": 5,
                "papers": [
                    "The Tumor Therapy Manager and its Clinical Impact.",
                    "A Virtual Environment for Radiotherapy Training and Education - VERT.",
                    "AVM-Explorer: Multi-Volume Visualization of Vascular Structures for Planning of Cerebral AVM Surgery.",
                    "Interactive Visualization Techniques for Neurosurgery Planning.",
                    "FEMONUM: A Framework for Whole Body Pregnant Woman Modeling from Ante-Natal Imaging Data."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011education",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Education Papers, Llandudno, UK, April 11-15, 2011.",
                "count": 6,
                "papers": [
                    "In at the Deep End: An Activity-Led Introduction to Creative Computing with Interactive Computer Graphics.",
                    "Interdisciplinary Game Projects: Opening the Graphics (Back) Door with the Soft Skills Key.",
                    "The Art and Science of Digital Production Arts.",
                    "PhD Education Through Apprenticeship.",
                    "The Five Design-Sheet (FdS) approach for Sketching Information Visualization Designs.",
                    "High-Level Application Development for non-Computer Science majors using Image Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011posters",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Posters, Llandudno, UK, April 11-15, 2011.",
                "count": 24,
                "papers": [
                    "Architectural Styles Dependent Shape Grammar Representation of Facades.",
                    "Four Virtual Reality Simulations for Teaching Earth Sciences.",
                    "The Langweil Model of Prague - a Challenge for State-of-the-art 3D Reconstruction Techniques.",
                    "Reconstruction of Cultural Heritage Object Utilizing its Paper Model for Augmented Reality.",
                    "Concept of Skeleton Texture Mapping.",
                    "GPU Based On-the-fly Light Emission-absorption Approximation for Direct Multi-volume Rendering.",
                    "Design and Implementation of a System for Interactive Higher Dimensional Vector Field Visualization.",
                    "Application of Active Appearance Model to Automatic Face Replacement.",
                    "Visual Analysis of Hierarchical Management Data.",
                    "Synesthetic Sound-Color Cross-Modality in Animations.",
                    "The Worst View for Virtual Museum Presentation.",
                    "High Performance Interactive Painting On The GPU.",
                    "Visualising Semantic Pathways in Document Collections.",
                    "Improving BVH Ray Tracing Speed Using the AVX Instruction Set.",
                    "User Manual on Augmented Reality for Installation and Maintenance of the V-Brakes System of a Mountain Bike.",
                    "Procedural Generation of Infinite Cities.",
                    "AA Patterns.",
                    "LiveLayer Live Traffic Projection onto Maps.",
                    "From Video to Animated 3D Reconstruction: A Computer Graphics Application for Snooker Skills Training.",
                    "Using a Kinect Interface to Develop an Interactive 3D Tabletop Display.",
                    "Image-based Retexturing of Deformed Surfaces from a Single Image.",
                    "Accelerated 5D Ray Tree construction on the GPU.",
                    "Using Visualisation Techniques and Molecular Dynamics to Study Atoms Diffusing in Glass.",
                    "Methodologies for Connected Structured Idealized Ice Crystal Growth Models."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011short",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Short Papers, Llandudno, UK, April 11-15, 2011.",
                "count": 18,
                "papers": [
                    "Feature-Based Mesh Editing.",
                    "Volumetric plastic deformation.",
                    "Collision-Driven Volumetric Deformation on the GPU.",
                    "Efficient Feature-preserving Local Projection Operator for Geometry Reconstruction.",
                    "Reconstructing Buildings as Textured Low Poly Meshes from Point Clouds and Images.",
                    "Folded Paper Geometry from 2D Pattern and 3D Contour.",
                    "An Error Bound for Decoupled Visibility with Application to Relighting.",
                    "Separable Approximation of Ambient Occlusion.",
                    "Improving Shadow Map Filtering with Statistical Analysis.",
                    "Realistic Simulation of Peripheral Vision Using An Aspherical Eye Model.",
                    "Warp-based Motion Compensation for Endoscopic Kymography.",
                    "Motion Capture Data Completion and Denoising by Singular Value Thresholding.",
                    "Skimming Video Action Using Annotated 3D Surfaces.",
                    "Automatic Stream Surface Seeding.",
                    "Fast Hydraulic and Thermal Erosion on GPU.",
                    "Crystal Scattering Simulation for PET on the GPU.",
                    "Alpha Compression with Variable Data Formats.",
                    "Enhancing Image-Based Aging Approaches."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011stars",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - State of the Art Reports, Llandudno, UK, April 11-15, 2011.",
                "count": 7,
                "papers": [
                    "A Survey on Video-based Graphics and Video Visualization.",
                    "Computational Plenoptic Imaging.",
                    "Visualization for the Physical Sciences.",
                    "Believable Virtual Characters in Human-Computer Dialogs.",
                    "A Survey on Temporal Coherence Methods in Real-Time Rendering.",
                    "Interactive Character Animation using Simulated Physics.",
                    "Acoustic Rendering and Auditory-Visual Cross-Modal Perception and Interaction."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2011tutorials",
                "sub_name": "32nd Annual Conference of the European Association for Computer Graphics, Eurographics 2011 - Tutorials, Llandudno, UK, April 11-15, 2011.",
                "count": 6,
                "papers": [
                    "Computing Correspondences in Geometric Data Sets.",
                    "Sketch Input of Engineering Solid Models.",
                    "Artistic Stylisation of Images and Video.",
                    "(Bi)spectral Rendering in Practice.",
                    "Rendering with Layered Materials.",
                    "Scientific Evaluation in Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2011",
                "sub_name": "4th Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2011, Llandudno, UK, April 10, 2011.",
                "count": 18,
                "papers": [
                    "Generative Object Definition and Semantic Recognition.",
                    "Real-Time 3D Face Recognition using Line Projection and Mesh Sampling.",
                    "Refining Shape Correspondence for Similar Objects Using Strain.",
                    "ConTopo: Non-Rigid 3D Object Retrieval using Topological Information guided by Conformal Factors.",
                    "Heat Diffusion Approach for Feature-based Body Scans Analysis.",
                    "Bag of Words and Local Spectral Descriptor for 3D Partial Shape Retrieval.",
                    "Local Shape Descriptors, a Survey and Evaluation.",
                    "Evaluation of 3D Interest Point Detection Techniques.",
                    "SHREC '11 Track: Generic Shape Retrieval.",
                    "SHREC '11: Robust Feature Detection and Description Benchmark.",
                    "SHREC '11 Track: Shape Retrieval on Non-rigid 3D Watertight Meshes.",
                    "SHREC '11 Track: 3D Face Models Retrieval.",
                    "A GPU Based High-efficient and Accurate Optimal Pose Alignment Approach of 3D Objects.",
                    "Selecting 3D Curves on the Nasal Surface using AdaBoost for Person Authentication.",
                    "Human Activity Modeling on Shape Manifold.",
                    "Feature Template based 3D Model Retrieval.",
                    "Partial Match of 3D Faces using Facial Curves between SIFT Keypoints.",
                    "A Framework For 3D Object Retrieval Algorithm Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2011",
                "sub_name": "11th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2011, Llandudno, UK, April 10-11, 2011.",
                "count": 14,
                "papers": [
                    "Optimal Multi-Image Processing Streaming Framework on Parallel Heterogeneous Systems.",
                    "Parallel Gradient Domain Processing of Massive Images.",
                    "Distributed OpenGL Rendering in Network Bandwidth Constrained Environments.",
                    "Revisiting Parallel Rendering for Shared Memory Machines.",
                    "Cross-Segment Load Balancing in Parallel Rendering.",
                    "Load Balancing Utilizing Data Redundancy in Distributed Volume Rendering.",
                    "Real-Time Ray Tracer for Visualizing Massive Models on a Cluster.",
                    "Interactive Particle Tracing in Time-Varying Tetrahedral Grids.",
                    "Efficient I/O for Parallel Visualization.",
                    "Parallel Computational Steering and Analysis for HPC Applications using a ParaView Interface and the HDF5 DSM Virtual File Driver.",
                    "Parallel In Situ Coupling of Simulation with a Fully Featured Visualization System.",
                    "A Preview and Exploratory Technique for Large-Scale Scientific Simulations.",
                    "GPU Algorithms for Diamond-based Multiresolution Terrain Processing.",
                    "Data-Parallel Mesh Connected Components Labeling and Analysis."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "31st Eurographics 2010",
        "info": "Norrköping, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2010areas",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - Areas Papers, Norrköping, Sweden, May 3-7, 2010.",
                "count": 9,
                "papers": [
                    "Progress in Rendering and Modeling for Digital Planetariums.",
                    "Interactive 3D Stereoscopic Dome with Automatic Calibration.",
                    "DomeView: A Tool for Digital Planetariums.",
                    "Towards an Academic Praxis for Domed Virtual Environments.",
                    "Visualizing Climate Change: the Potential of Dome Presentations as a Tool for Climate Communication.",
                    "Uniview - Visualizing the Universe.",
                    "Ad-Hoc Multi-Displays for Mobile Interactive Applications.",
                    "In-Situ 3D Sketching Using a Video Camera as an Interaction and Tracking Device.",
                    "A Mobile Augmented Reality System to Enjoy the Sagrada Familia."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2010education",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - Education Papers, Norrköping, Sweden, May 3-7, 2010.",
                "count": 9,
                "papers": [
                    "A Computer Animation System for Creating Deaf-Accessible Math and Science Curriculum Materials.",
                    "Using Augmented Reality as a Medium to Assist Teaching in Higher Education.",
                    "Digitizing Data: Computational Thinking for Middle School Students through Computer Graphics.",
                    "Intelligent Games for Education - An Intention Monitoring Approach based on Dynamic Bayesian Network.",
                    "No More Reinventing the Virtual Wheel: Middleware for Use in Computer Games and Interactive Computer Graphics Education.",
                    "Experimental Feedback on Prog and Play, a Serious Game for Programming Practice.",
                    "Educating Students in Official Statistics using Embedded Geovisual Analytics Storytelling Methods.",
                    "Computer Graphics for Information System Programmers.",
                    "Using VisTrails and Provenance for Teaching Scientific Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2010posters",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - Posters, Norrköping, Sweden, May 3-7, 2010.",
                "count": 15,
                "papers": [
                    "Procedural Approach for RealisticWoven Fabric Rendering.",
                    "A Method for Fast Initialization of Markerless Object Tracking.",
                    "Efficient Free Path Sampling in Inhomogeneous Media.",
                    "Towards Multi-Touch Map Interaction on Tabletops: State of the Art and Design Recommendations.",
                    "Undoing Subpixel Rendering for Better Screenshots.",
                    "Automated Astrophysical Modeling with Shape.",
                    "A curvature based lightning model for quasi-global diffuse illumination.",
                    "A Framework for Simulation-Event Triggered Animations.",
                    "Accelerated Deterministic Simulation of X-ray Attenuation Using Graphics Hardware.",
                    "User's Preference-Based Color Transformation Using Interactive Genetic Algorithm.",
                    "CAVER Viewer - the explorer of behaviour of tunnels in proteins.",
                    "GPU Destruction: Real-Time Procedural Demolition of Virtual Environments.",
                    "Real-Time Smoke Rendering and Light Interaction.",
                    "Face Fitting using a Genetic Algorithm.",
                    "Procedural Generation of Urban Environments through Space and Time."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2010short",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - Short Papers, Norrköping, Sweden, May 3-7, 2010.",
                "count": 25,
                "papers": [
                    "Sliding Deformation: Shape Preserving Per-Vertex Displacement.",
                    "A Spatially Adaptive Morphological Filter for Dual-Resolution Interface Tracking of Fluids.",
                    "Animating Sand as a Surface Flow.",
                    "Skeleton Computation of an Image Using a Geometric Approach.",
                    "3D Isocontours Real-time Generation and Visualization of 3D Stepped Terrain Models.",
                    "Skeleton Based As-Rigid-As-Possible Volume Modeling.",
                    "Finding Approximate Ambigrams and Making them Exact.",
                    "Interactive Creation of Virtual Worlds Using Procedural Sketching.",
                    "A Film Balloon Design System Integrated with Shell Element Simulation.",
                    "Volumetric Hand Reconstructions for Non-verbal Communication in Shared Virtual Environments.",
                    "Hybrid Mesh Editing.",
                    "gCubik+i Virtual 3D Aquarium: Interfacing a Graspable 3d Display with a Tabletop Display.",
                    "Adapting Precomputed Radiance Transfer to Real-time Spectral Rendering.",
                    "Data-parallel Micropolygon Rasterization.",
                    "Simple and Robust Iterative Importance Sampling of Virtual Point Lights.",
                    "Path Regeneration for Interactive Path Tracing.",
                    "Real-Time Ray Tracing Using Nvidia OptiX.",
                    "Ray Tracing using Hierarchies of Slab Cut Balls.",
                    "Adaptive Collapsing on Bounding Volume Hierarchies for Ray-Tracing.",
                    "Procedural Descriptions of Anisotropic Noisy Textures by Example.",
                    "Interactive Rendering to View-Dependent Texture-Atlases.",
                    "Automatic Composition of Motion Capture Animation for Music Synchronization.",
                    "Segmental Brush Synthesis with Stroke Images.",
                    "Dynamic Cage-Driven 3D Range-Scan Alignment.",
                    "Using Lego Pieces for Camera Calibration: a Preliminary Study."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2010stars",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - State of the Art Reports, Norrköping, Sweden, May 3-7, 2010.",
                "count": 7,
                "papers": [
                    "State of the Art in Procedural Noise Functions.",
                    "A Survey of Real-Time Hard Shadow Mapping Methods.",
                    "Visual Analysis of Large Graphs.",
                    "A Survey on Shape Correspondence.",
                    "Image Statistics and their Applications in Computer Graphics.",
                    "Simplex and Diamond Hierarchies: Models and Applications.",
                    "On the Way Towards Topology-Based Visualization of Unsteady Flow."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2010tutorials",
                "sub_name": "31st Annual Conference of the European Association for Computer Graphics, Eurographics 2010 - Tutorials, Norrköping, Sweden, May 3-7, 2010.",
                "count": 5,
                "papers": [
                    "Designing Multi-projector VR Systems: From Bits to Bolts.",
                    "Geometric Registration for Deformable Shapes.",
                    "Shadow Algorithms for Real-time Rendering.",
                    "Theory and Methods of Lightfield Photography.",
                    "Advanced Material Appearance Models."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2010",
                "sub_name": "3rd Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2010, Norrköping, Sweden, May 2, 2010.",
                "count": 16,
                "papers": [
                    "Robust Volumetric Shape Descriptor.",
                    "A Robust 3D Interest Points Detector Based on Harris Operator.",
                    "Semantics-Driven Approach for Automatic Selection of Best Views of 3D Shapes.",
                    "The Fast Reject Schema for Part-in-Whole 3D Shape Matching.",
                    "Feature Selection for Enhanced Spectral Shape Comparison .",
                    "Learning the Compositional Structure of Man-Made Objects for 3D Shape Retrieval.",
                    "Person Independent 3D Facial Expression Recognition by a Selected Ensemble of SIFT Descriptors.",
                    "Fast Human Classification of 3D Object Benchmarks.",
                    "SHREC'10 Track: Large Scale Retrieval.",
                    "SHREC'10 Track: Robust Shape Retrieval.",
                    "SHREC'10 Track: Feature Detection and Description.",
                    "SHREC'10 Track: Correspondence Finding.",
                    "SHREC'10 Track: Generic 3D Warehouse.",
                    "SHREC'10 Track: Non-rigid 3D Shape Retrieval.",
                    "SHREC'10 Track: Range Scan Retrieval.",
                    "SHREC'10 Track: Protein Model Classification."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2010",
                "sub_name": "10th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2010, Norrköping, Sweden, May 2-3, 2010.",
                "count": 15,
                "papers": [
                    "MPI-hybrid Parallelism for Volume Rendering on Large, Multi-core Systems.",
                    "Cross-Node Occlusion in Sort-Last Volume Rendering.",
                    "Multi-Frame Rate Volume Rendering.",
                    "Ray Tracing Dynamic Scenes with Shadows on the GPU.",
                    "Streamed Ray Tracing of Single Rays on the Cell Processor.",
                    "Asynchronous Parallel Reliefboard Computation for Scene Object Approximation.",
                    "Parallel View-Dependent Refinement of Compact Progressive Meshes.",
                    "Scalable Parallel Out-of-core Terrain Rendering.",
                    "Self-Scheduled Parallel Isosurfacing using Distributed Span Space on Cell.",
                    "Cache-Efficient Parallel Isosurface Extraction for Shared Cache Multicores.",
                    "Load-Balanced Isosurfacing on Multi-GPU Clusters.",
                    "Accelerating and Benchmarking Radix-k Image Compositing at Large Scale.",
                    "Fast Compositing for Cluster-Parallel Rendering.",
                    "Towards a Software Transactional Memory for Graphics Processors.",
                    "PaTraCo: A Framework Enabling the Transparent and Efficient Programming of Heterogeneous Compute Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/vg/2010",
                "sub_name": "8th IEEE VGTC / Eurographics International Symposium on Volume Graphics, VG@Eurographics 2010, Norrköping, Sweden, May 2-3, 2010.",
                "count": 16,
                "papers": [
                    "A New Sampling Scheme for Slice Based Volume Rendering.",
                    "Multi-layer Volume Ray Casting on GPU.",
                    "Wavelet-based Multiresolution Isosurface Rendering.",
                    "Split-Voxel: A Simple Discontinuity-Preserving Voxel Representation for Volume Rendering.",
                    "Real-time Surface Analysis and Tagged Material Cleansing for Virtual Colonoscopy.",
                    "Slimming Brick Cache Strategies for Seismic Horizon Propagation Algorithms.",
                    "Volumetric Evaluation of Meshless Data From Smoothed Particle Hydrodynamics Simulations.",
                    "Concurrent Volume Visualization of Real-Time fMRI.",
                    "Fast Volumetric Data Exploration with Importance-Based Accumulated Transparency Modulation.",
                    "Multi-dimensional Reduction and Transfer Function Design using Parallel Coordinates.",
                    "A Survey of Transfer Functions Suitable for Volume Rendering.",
                    "Feature-Driven Ambient Occlusion for Direct Volume Rendering.",
                    "Depth-Enhanced Maximum Intensity Projection.",
                    "Advanced Light Material Interaction for Direct Volume Rendering.",
                    "A GPU-Supported Lossless Compression Scheme for Rendering Time-Varying Volume Data.",
                    "Efficient Acquisition and Clustering of Local Histograms for Representing Voxel Neighborhoods."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "30th Eurographics 2009",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2009areas",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - Areas Papers, Munich, Germany, March 30 - April 3, 2009.",
                "count": 9,
                "papers": [
                    "Geo-Spatial Context-Aware Visualization.",
                    "Visualizing Heterogeneous Utility Data: A Case for Aesthetic Design.",
                    "Supporting Interactive Haptic Shaping of 3D Geologic Surfaces with Deformation Property Painting.",
                    "A web-enabled Geovisual Analytics tool applied to OECD Regional Data.",
                    "Visualization Framework for the Integration and Exploration of Heterogeneous Geospatial Data.",
                    "RASTeR: Simple and Efficient Terrain Rendering on the GPU.",
                    "GPU Ray-Casting for Scalable Terrain Rendering.",
                    "Hybrid Ambient Occlusion.",
                    "A Hybrid GPU Rendering Pipeline for Alias-Free Hard Shadows."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2009education",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - Education Papers, Munich, Germany, March 30 - April 3, 2009.",
                "count": 11,
                "papers": [
                    "Applications of Multitouch and Gaming Technology for the Classroom.",
                    "On the Provision of a Comprehensive Computer Graphics Education in the Context of Computer Games: An Activity-Led Instruction Approach.",
                    "Learning by Fixing and Extending Games.",
                    "Using processing.org in an Introductory Computer Graphics Course.",
                    "Easel: A Java Based Top-Down Approach to 3D Graphics Education.",
                    "Applet Competition as an Educational Tool in Creating Novel e-Textbook.",
                    "Introducing Students to Empirical Methods in CG and HCI Courses through User Studies.",
                    "Teaching Quaternions is not Complex.",
                    "How to Write a Visualization Research Paper: The Art and Mechanics.",
                    "Teaching Computer Graphics in the Context of Theatre.",
                    "Computer Animation Curriculum: An Interdisciplinary Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2009prize",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - Medical Prize, Munich, Germany, March 30 - April 3, 2009.",
                "count": 4,
                "papers": [
                    "Virtual Hip Joint: from Computer Graphics to Computer-Assisted Diagnosis.",
                    "ImaGINe-S: Imaging Guided Interventional Needle Simulation.",
                    "GREiF - Graphical Documentation of Retinal Findings Using a Standardized Digital Symbol Library.",
                    "Advanced GPU Volume Rendering for Virtual Endoscopy."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2009short",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - Short Papers, Munich, Germany, March 30 - April 3, 2009.",
                "count": 24,
                "papers": [
                    "Bilateral Filter Based Compositing for Variable Exposure Photography.",
                    "Depth of Field in Plenoptic Cameras.",
                    "A Gaze-Contingent Display Compensating for Scotomata.",
                    "Real-time Vision-based Lateral Drift Correction.",
                    "Continuous Search and Replace in Vector Graphics.",
                    "Multisampled Antialiasing of Per-pixel Geometry.",
                    "A Dynamic Caching System for Rendering an Animated Crowd in Real-Time.",
                    "Levels of Real-Time Crowd Navigation Behaviour in Urban Environments.",
                    "Does Brief Exposure to a Self-avatar Effect Common Human Behaviors in Immersive Virtual Environments?",
                    "Volume Conserving Simulation of Deformable Bodies.",
                    "Video-Realistic Image-based Eye Animation System.",
                    "Procedural City Layout Generation Based on Urban Land Use Models.",
                    "A Cost Metric for Scene-Interior Ray Origins.",
                    "Fast Approximation of Multiple Scattering in Inhomogeneous Participating Media.",
                    "Real-time Volumetric Lighting in Participating Media.",
                    "Fast Rendering of Particle-Based Fluid by Utilizing Simulation Data.",
                    "A Precalculated Point Set for Caching Shading Information.",
                    "Importance Sampling with Floyd-Steinberg Halftoning.",
                    "Noise Robust Surface Reconstruction by Combining PU and Graph-cut.",
                    "A new Projection Method for Point Set Surfaces.",
                    "Dent Removal: Geodesic Curve-Based Mesh Fairing.",
                    "A Real-time Interactive Tool for Image Cutout.",
                    "Tile-based Image Forces for Active Contours on GPU.",
                    "Improving Interactive Image Segmentation via Appearance Propagation."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2009stars",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - State of the Art Reports, Munich, Germany, March 30 - April 3, 2009.",
                "count": 6,
                "papers": [
                    "Modeling the Appearance and Behavior of Urban Spaces.",
                    "High Dynamic Range Imaging and Low Dynamic Range Expansion for Generating HDR Content.",
                    "Real Time Animation of Virtual Humans: A Trade-off Between Naturalness and Control.",
                    "Over Two Decades of Integration-Based, Geometric Flow Visualization.",
                    "State of the Art in Example-based Texture Synthesis.",
                    "Time-of-Flight Sensors in Computer Graphics."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2009tutorials",
                "sub_name": "30th Annual Conference of the European Association for Computer Graphics, Eurographics 2009 - Tutorials, Munich, Germany, March 30 - April 3, 2009.",
                "count": 7,
                "papers": [
                    "EUROGRAPHICS Tutorial on Sketch Recognition.",
                    "Course: Modeling Individualities in Groups and Crowds.",
                    "Interactive Shape Modeling and Deformation.",
                    "GPU-Based Volume Ray-Casting with Advanced Illumination.",
                    "Meshless Approximation Methods and Applications in Physics Based Modeling and Animation.",
                    "3D Anatomical Modelling and Simulation Concepts.",
                    "Analysis and Retrieval Techniques for Motion and Music Data."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2009",
                "sub_name": "2nd Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographics 2009, Munich, Germany, March 29, 2009.",
                "count": 12,
                "papers": [
                    "Template Based Shape Descriptor.",
                    "Partial Matching for Real Textured 3D Objects using Color Cubic Higher-order Local Auto-Correlation Features.",
                    "SkelTre - Fast Skeletonisation for Imperfect Point Cloud Data of Botanic Trees.",
                    "Visual Vocabulary Signature for 3D Object Retrieval and Partial Matching.",
                    "Retrieval of 3D Articulated Objects Using a Graph-based Representation.",
                    "Automatic 3D Facial Region Retrieval from Multi-pose Facial Datasets.",
                    "Multilevel Relevance Feedback for 3D Shape Retrieval.",
                    "A 3D Shape Benchmark for Retrieval and Automatic Classification of Architectural Data.",
                    "SHREC 2009 - Shape Retrieval Contest.",
                    "SHREC'09 Track: Generic Shape Retrieval.",
                    "SHREC'09 Track: Querying with Partial Models.",
                    "SHREC'09 Track: Structural Shape Retrieval on Watertight Models."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2009",
                "sub_name": "9th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2009, Munich, Germany, March 29-30, 2009.",
                "count": 14,
                "papers": [
                    "Interactive Physical Simulation on Multicore Architectures.",
                    "Dynamic Grid Refinement for Fluid Simulations on Parallel Graphics Architectures.",
                    "Simulation of Radio Wave Propagation by Beam Tracing.",
                    "Parallelized Matrix Factorization for fast BTF Compression.",
                    "Parallel Mesh Clustering.",
                    "Fast Parallel Unbiased Diffeomorphic Atlas Construction on Multi-Graphics Processing Units.",
                    "A Flexible Adaptation Service for Distributed Rendering.",
                    "Wait-Free Shared-Memory Irradiance Cache.",
                    "Data-Parallel Hierarchical Link Creation for Radiosity.",
                    "A Decomposition Approach for Optimizing Large-Scale Parallel Image Composition on Multi-Core MPP Systems.",
                    "Hybrid Parallelization for Multi-View Visualization of Time-Dependent Simulation Data.",
                    "Distributed Visualization of Complex Black Oil Reservoir Models.",
                    "Parallel Solution to the Radiative Transport.",
                    "Time-constrained High-fidelity Rendering on Local Desktop Grids."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "29th Eurographics 2008",
        "info": "Hersonissos, Crete, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2008education",
                "sub_name": "29th Annual Conference of the European Association for Computer Graphics, Eurographics 2008 - Education Papers, Hersonissos, Crete, Greece, April 14-18, 2008.",
                "count": 7,
                "papers": [
                    "eNVyMyCar: a Multi-player Car Racing Game for Teaching Computer Graphics.",
                    "Teaching Soft-skills: Digital Game Development in a Multi-Discipline Environment.",
                    "From a Light CG Framework to a strong Cannibal Experience.",
                    "Panel: What Can We Gain from Transdisciplinary Visualization Courses?",
                    "Computer Graphics: Problem Based Learning and Interactive Embodied Pedagogical Agents.",
                    "Graphics based Computer Adaptive Testing and Beyond.",
                    "Computer Graphics Curriculum: a Programming Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2008short",
                "sub_name": "29th Annual Conference of the European Association for Computer Graphics, Eurographics 2008 - Short Papers, Hersonissos, Crete, Greece, April 14-18, 2008.",
                "count": 34,
                "papers": [
                    "Boolean Operations for Free-form Models Represented in Geometry Images.",
                    "A Fragile Watermarking Scheme for Authentication of Semi-regular Meshes.",
                    "Efficient Soft Tissue Modelling Using Charged Particle Control Points.",
                    "Physically Based Modeling of Ice with Bubbles.",
                    "Knitty: 3D Modeling of Knitted Animals with a Production Assistant Interface.",
                    "Physically-Based Interactive Sand Simulation.",
                    "Adaptive Remeshing of Non-Manifold Surfaces.",
                    "Post Facto Registration Tools for Urban Modelling.",
                    "Crowds in Context: Evaluating the Perceptual Plausibility of Pedestrian Orientations.",
                    "A Novel Approach to Support Quality of Experience in Remote Visualization on Mobile Devices.",
                    "Evaluation of a Mobile MR Geovisualisation Interface.",
                    "Measuring and Enhancing the Legibility of GPU-rendered Text.",
                    "Real-Time Volumetric Tests Using Layered Depth Images.",
                    "Artificial Mosaics by Gradient Vector Flow.",
                    "Removing Artifacts Due To Frequency-Domain Processing of Light-Fields.",
                    "Video Carving.",
                    "Revealing Pentimenti Through Raking Angle Photography.",
                    "Mining Motifs from Human Motion.",
                    "Contact Skinning.",
                    "Recognition of Human Actions using Layered Hidden Markov Models.",
                    "FMDistance: A Fast and Effective Distance Function for Motion Capture Data.",
                    "Laziness is a Virtue: Motion Stitching Using Effort Minimization.",
                    "Efficient Visualization of Architectural Models from a Structure and Motion Pipeline.",
                    "Interactive Stroke-Based NPR using Hand Postures on Large Displays.",
                    "Improving Interaction Performance for Ray Tracing.",
                    "Volume Data Visualization Using Fractal Interpolation Surfaces.",
                    "Rendering Method for Flat Origami.",
                    "Microquad Soft Shadow Mapping Revisited.",
                    "Shadowed Relighting of Dynamic Geometry with 1D BRDFs.",
                    "Efficient Spherical Harmonics Lighting with the Preetham Skylight Model.",
                    "Compensation of the Light Attenuation with Depth of Images Captured by a Confocal Microscope Using a MRF Deformation Model and Graph Cuts.",
                    "Level of Detail Flow Simulation.",
                    "Identification of Dynamic Mass Spring Parameters for Deformable Body Simulation.",
                    "Virtual Hair Handle: A Model for Haptic Hairstyling."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2008stars",
                "sub_name": "29th Annual Conference of the European Association for Computer Graphics, Eurographics 2008 - State of the Art Reports, Hersonissos, Crete, Greece, April 14-18, 2008.",
                "count": 6,
                "papers": [
                    "Quadruped Animation.",
                    "Advanced Algorithms in Medical Computer Graphics.",
                    "A Taxonomy of Modeling Techniques using Sketch-Based Interfaces.",
                    "The Role of Perception for Computer Graphics.",
                    "Transparent and Specular Object Reconstruction.",
                    "Multiperspective Modeling, Rendering, and Imaging."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2008tutorials",
                "sub_name": "29th Annual Conference of the European Association for Computer Graphics, Eurographics 2008 - Tutorials, Hersonissos, Crete, Greece, April 14-18, 2008.",
                "count": 9,
                "papers": [
                    "Designing Multi-projector VR Systems: from Bits to Bolts.",
                    "Image-Based Empirical Information Acquisition, Scientific Reliability, and Long-Term Digital Preservation for the Natural Sciences and Cultural Heritage.",
                    "Mobile 3D Graphics.",
                    "Perceptually-Motivated Graphics.",
                    "Interactive Introduction to X3D Graphics.",
                    "Advanced Material Appearance Models.",
                    "Geometric Modeling Based on Polygonal Meshes.",
                    "Interactive Tools for Scientific and Medical Illustration Composition.",
                    "Theory and Methods of Light-Field Photography."
                ]
            },
            {
                "sub_name_abbr": "conf/3dor/2008",
                "sub_name": "1st Eurographics Workshop on 3D Object Retrieval, 3DOR@Eurographis 2008, Hersonissos, Crete, Greece, April 15, 2008.",
                "count": 10,
                "papers": [
                    "Characterizing Shape Using Conformal Factors.",
                    "3D Object Retrieval using an Efficient and Compact Hybrid Shape Descriptor .",
                    "Isometry-invariant Matching of Point Set Surfaces.",
                    "Markov Random Fields for Improving 3D Mesh Analysis and Segmentation.",
                    "Part Analogies in Sets of Objects.",
                    "Similarity Score Fusion by Ranking Risk Minimization for 3D Object Retrieval.",
                    "A Neurofuzzy Approach to Active Learning based Annotation Propagation for 3D Object Databases.",
                    "Face Recognition by SVMs Classification and Manifold Learning of 2D and 3D Radial Geodesic. Distances.",
                    "A 3D Face Recognition Algorithm Using Histogram-based Features.",
                    "On-line and Open Platform for 3D Object Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/egpgv/2008",
                "sub_name": "8th Eurographics Symposium on Parallel Graphics and Visualization, EGPGV@Eurographics 2008, Hersonissos, Crete, Greece, April 14-15, 2008.",
                "count": 10,
                "papers": [
                    "Multi-GPU Sort-Last Volume Visualization.",
                    "Streaming Model Based Volume Ray Casting Implementation for Cell Broadband Engine.",
                    "Acceleration of Opacity Correction Mechanisms for Over-sampled Volume Ray Casting.",
                    "A Scalable Parallel Force-Directed Graph Layout Algorithm.",
                    "Parallel Simplification of Large Meshes on PC Clusters.",
                    "High-Fidelity Rendering of Animations on the Grid: A Case Study.",
                    "CUDASA: Compute Unified Device and Systems Architecture.",
                    "Parallel Longest Common Subsequence using Graphics Hardware.",
                    "Time-Critical Distributed Visualization with Fault Tolerance.",
                    "Parallel Volume Rendering on the IBM Blue Gene/P."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "28th Eurographics 2007",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2007cult",
                "sub_name": "28th Annual Conference of the European Association for Computer Graphics, Eurographics 2007 - Cultural Heritage, Prague, Czech Republic, September 3-7, 2007.",
                "count": 7,
                "papers": [
                    "Cultural Heritage as a Vehicle for Basic Research in Computing Science: Pasteur's Quadrant and a Use-inspired Basic Research Agenda.",
                    "Photorealistic Real-Time Visualization of Cultural Heritage: A Case Study of Friedrichsburg Castle in Germany.",
                    "An Interactive Exploration of the Virtual Stronghold Dillenburg.",
                    "The Arnolfini Portrait in 3D - Creating Virtual World of a Painting with Inconsistent Perspective.",
                    "Flatland: A Tool for Transforming Historical Sites into Archival Drawings.",
                    "Tangible Heritage: Production of Astrolabes on a Laser Engraver.",
                    "Mapping highly detailed color information on extremely dense 3D models: the case of David s restoration."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2007education",
                "sub_name": "28th Annual Conference of the European Association for Computer Graphics, Eurographics 2007 - Education Papers, Prague, Czech Republic, September 3-7, 2007.",
                "count": 8,
                "papers": [
                    "Computational Geometry Education for Computer Graphics Students.",
                    "Creating Interest in Computer Graphics by Teaching Game Development.",
                    "An E-Learning Course on Scientific Visualization.",
                    "ProbonoWorld: Educating the Mentally Handicapped in a Virtual Environment using Props on a Board.",
                    "Teaching Data Structures and Algorithms through Graphics.",
                    "Extended Game Platform for Novice Programmers.",
                    "A Discussion of the CGE06 Workshop Report.",
                    "Report of the CGE 06 Computer Graphics Education Workshop, Vienna, Austria, September 9, 2006."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2007short",
                "sub_name": "28th Annual Conference of the European Association for Computer Graphics, Eurographics 2007 - Short Papers, Prague, Czech Republic, September 3-7, 2007.",
                "count": 32,
                "papers": [
                    "A Unified Interpolatory and Approximation sqrt-3 Subdivision Scheme.",
                    "An Accurate Implicit Field Representation for Meshes and Its Adapted Triangulation Algorithms.",
                    "Shape Analysis for Augmented Topological Shape Descriptor.",
                    "Reeb Chart Unfolding Based 3D Shape Signatures.",
                    "Exact Computation of the Hausdorff Distance between Triangular Meshes.",
                    "View-based Shape Similarity using Mutual Information Spheres.",
                    "Exemplar-based Worn Edges.",
                    "Stabilized Noise.",
                    "Improved Skeleton Computation of an Encoded Volume.",
                    "High Speed Skin Color Detection and Localization on a GPU.",
                    "Construction of Non-Blobby Surface from Particles.",
                    "Enforcing Scene Constraints in Single View Reconstruction.",
                    "Volumetric Normal Mapping in Rendering of Multivariate Volume Data.",
                    "Automated Combination of Real-Time Shader Programs.",
                    "Fast GPU-based Visibility Computation for Natural Illumination of Volume Data Sets.",
                    "Imperceptible Calibration for Radiometric Compensation.",
                    "Object-Oriented Shader Design.",
                    "Fast Hierarchical Methods to Detect Collisions between Deformable Objects: A Comparison.",
                    "Simultaneous Visualization of Preoperative Planning Models and Intraoperative 2D Ultrasound for Liver Surgery.",
                    "Adaptive Abstraction of 3D scenes in Real-Time.",
                    "Painterly Effects Rendering with Focus Based Level of Detail.",
                    "Liquid Diffusion Model that Accounts for a Variety of Dyeing Parameters.",
                    "Real-Time 3D Lettering with a 2D Font Engine.",
                    "Fast Hierarchical 3D Distance Transforms on the GPU.",
                    "Spinoff - Transferring Energy between Real and Virtual Worlds.",
                    "Bridging Semantic Web and Digital Shapes.",
                    "Pareto-Based Perceptual Metric for Imperceptible Simplification on Mobile Displays.",
                    "Take a Stroll in Another World.",
                    "Virtual Agent Navigation in Open Spaces using Iterative Shrinking Polygons.",
                    "State-of-the-Art Computer Graphics in Neurosurgical Planning and Risk Assessment.",
                    "A Pen-based Interface for Generating Graphical Reports of Findings in Cardiac Catheterization.",
                    "Analysis of the Pulmonary Vein Ostia using Cardiac 4DCT for Radiosurgical Ablation."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2007stars",
                "sub_name": "28th Annual Conference of the European Association for Computer Graphics, Eurographics 2007 - State of the Art Reports, Prague, Czech Republic, September 3-7, 2007.",
                "count": 6,
                "papers": [
                    "Spectral Methods for Mesh Processing and Analysis.",
                    "The Visual Computing of Projector-Camera Systems.",
                    "Towards Automatic Character Skeletonization and Interactive Skin Deformation.",
                    "Shape Representations Based on Simplicial and Cell Complexes.",
                    "State of the Art in Ray Tracing Animated Scenes.",
                    "Visualization of Multi-variate Scientific Data."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2007tutorials",
                "sub_name": "28th Annual Conference of the European Association for Computer Graphics, Eurographics 2007 - Tutorials, Prague, Czech Republic, September 3-7, 2007.",
                "count": 12,
                "papers": [
                    "Haptic Simulation, Perception and Manipulation of Deformable Objects.",
                    "EG 2007 Course on Populating Virtual Environments with Crowds.",
                    "Towards the Virtual Physiological Human.",
                    "Inverse Kinematics and Kinetics for Virtual Humanoids.",
                    "New Trends in 3D Video.",
                    "Capturing Reflectance - From Theory to Practice.",
                    "Computational Photography.",
                    "Applications of Information Theory to Computer Graphics.",
                    "Programming the Cell BE for High Performance Graphics.",
                    "Advanced Topics in Virtual Garment Simulation.",
                    "Visual Mining of Text Collections.",
                    "3D Shape Description and Matching Based on Properties of Real Functions."
                ]
            },
            {
                "sub_name_abbr": "conf/spbg/2007",
                "sub_name": "4th Symposium on Point Based Graphics, PBG@Eurographics 2007, Prague, Czech Republic, September 2-3, 2007.",
                "count": 14,
                "papers": [
                    "Sampling Point-Set Implicits.",
                    "Low-Discrepancy Point Sampling of Meshes for Rendering.",
                    "Direct Computing of Surface Curvatures for Point-Set Surfaces.",
                    "Interactive Editing of Large Point Clouds.",
                    "SIMOD: Making Freeform Deformation Size-Insensitive.",
                    "Efficient Bounds for Point-Based Animations.",
                    "Efficient Refinement of Dynamic Point Data.",
                    "Approximate Star-Shaped Decomposition of Point Set Data.",
                    "On the use of Gromov-Hausdorff Distances for Shape Comparison.",
                    "Topological Methods for the Analysis of High Dimensional Data Sets and 3D Object Recognition.",
                    "Efficient Point-Based Rendering Using Image Reconstruction.",
                    "Surfel-Based Billboard Hierarchies for Fast Rendering of 3D-Objects.",
                    "A Parallelly Decodeable Compression Scheme for Efficient Point-Cloud Rendering.",
                    "Self-Similarity-Based Compression of Point Clouds, with Application to Ray Tracing."
                ]
            },
            {
                "sub_name_abbr": "conf/vg/2007",
                "sub_name": "6th Eurographics / IEEE VGTC International Symposium on Volume Graphics, VG@Eurographics 2007, Prague, Czech Republic, September 3-4, 2007.",
                "count": 13,
                "papers": [
                    "Efficient Ambient and Emissive Tissue Illumination using Local Occlusion in Multiresolution Volume Rendering.",
                    "3D Reconstruction of Emission and Absorption in Planetary Nebulae.",
                    "Accelerated Light Propagation Through Participating Media.",
                    "Quality Enhancement of Direct Volume Rendered Images.",
                    "Palette-Style Volume Visualization.",
                    "Feature Enhancement using Locally Adaptive Volume Rendering.",
                    "Simultaneous GPU-Assisted Raycasting of Unstructured Point Sets and Volumetric Grid Data.",
                    "Applications of Optimal Sampling Lattices for Volume Acquisition via 3D Computed Tomography.",
                    "Variational Volumetric Surface Reconstruction from Unorganized Points.",
                    "Surface Reconstruction from Noisy Point Clouds using Coulomb Potentials.",
                    "(No) More Marching Cubes.",
                    "Volume Deformation via Scattered Data Interpolation.",
                    "Automatic Feature Modeling Techniques for Volume Segmentation Applications."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "27th Eurographics 2006",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2006education",
                "sub_name": "27th Annual Conference of the European Association for Computer Graphics, Eurographics 2006 - Education Papers, Vienna, Austria, September 4-8, 2006.",
                "count": 12,
                "papers": [
                    "A Breadth-First Approach for Teaching Computer Graphics.",
                    "Graphics-Based Learning in First-Year Computer Science.",
                    "Teaching, Exploring, Learning Developing Tutorials for In-Class Teaching and Self-Learning.",
                    "Long Distance Distribution of Educational Augmented Reality Applications.",
                    "3D Role-Playing Games as Language Learning Tools.",
                    "Computer Graphics Applications in the Education Process of People with Learning Difficulties.",
                    "A Programmable Tutor for OpenGL Transformations.",
                    "Teaching OpenGL Shaders: Hands-on, Interactive, and Immediate Feedback.",
                    "Using VTK as a Tool for Teaching and Applying Computer Graphics.",
                    "Evaluation Test for 3D Computer Graphics Content Production Capability based on Simulation Methodology.",
                    "Compter Graphics Education: Where and How Do We Develop Spatial Ability?",
                    "Learning and Assessment: Staff Conceptions of Final Projects for an Undergraduate Multimedia Design Degree."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2006short",
                "sub_name": "27th Annual Conference of the European Association for Computer Graphics, Eurographics 2006 - Short Presentations, Vienna, Austria, September 4-8, 2006.",
                "count": 36,
                "papers": [
                    "Fast Skeletal Animation by skinned Arc-Spline based Deformation.",
                    "Competitive Runtime Performance for Inverse Kinematics Algorithms using Conformal Geometric Algebra.",
                    "Similar Motion Retrieval for Dynamic 3D Mesh Based on Modified Shape Distributions.",
                    "Shape From Silhouette: Towards a Solution for Partial Visibility Problem.",
                    "Multiresolution GPU Mesh Painting.",
                    "Fast and Realistic Display of Clouds Using a Recording Matrix.",
                    "Solving Local Reflections: a Direct Methodology.",
                    "Real-time Reflection using Ray Tracing with Geometry Field.",
                    "GPU-Based Hierarchical Texture Decompression.",
                    "High Quality Shadows for Real-Time Crowds.",
                    "Dynamic Anisotropic Occlusion.",
                    "A Perceptual Approach to Texture Scaling based on Human Computer Interaction.",
                    "Real-time Soft Shadows with Shadow Accumulation.",
                    "Harnessing the Human Visual System for Image Based Modeling: an Interaction System.",
                    "Toward the Light Field Display: Autostereoscopic Rendering via a Cluster of Projectors.",
                    "Rapid Interactive Modelling from Video with Graph Cuts.",
                    "Articulated Video Sprites.",
                    "Automatic Depth-Map Colorization.",
                    "Evaluation of Different Diffuse Surface Reflection Models for Global Illumination.",
                    "Digital HPO Hologram Rendering Pipeline.",
                    "Lighting-Up Geometry: Accurate 3D Modelling of Museum Artifacts with a Torch and a Camera.",
                    "Modeling Real-time Rendering.",
                    "Rapid Modeling of Complex Building Façades.",
                    "HOPI: A Novel High Order Parametric Interpolation in 2D.",
                    "Clothing the Masses: Real-Time Clothed Crowds With Variation.",
                    "Modeling Autumn Sceneries.",
                    "Magical Mirrors.",
                    "Exploring Flow Fields with GPU-Based Stream Tracers in Virtual Environments.",
                    "Connectivity-Aware Sectional Visualization of 3D DTI Volumes using Perceptual Flat-Torus Coloring and Edge Rendering.",
                    "SpringLens Distributed Nonlinear Magnifications.",
                    "Simulating Drilling on Tetrahedral Meshes.",
                    "Virtual See-through Displays: Interactive Visualization Method in Ubiquitous Computing Environments.",
                    "m-LOMA - a Mobile 3D Portal to Location-based Information.",
                    "Enhanced Cartoon and Comic Rendering.",
                    "Two Layer Image Tile Mosaics.",
                    "Elastic Facial Caricature Warping."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2006stars",
                "sub_name": "27th Annual Conference of the European Association for Computer Graphics, Eurographics 2006 - State of the Art Reports, Vienna, Austria, September 4-8, 2006.",
                "count": 6,
                "papers": [
                    "Computational Photography.",
                    "Building Expression into Virtual Characters.",
                    "Rendering Plasma Phenomena: Applications and Challenges.",
                    "Camera Control in Computer Graphics.",
                    "Interactive Volume Rendering with Ray Tracing.",
                    "Segmentation and Shape Extraction of 3D Boundary Meshes."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2006tutorials",
                "sub_name": "27th Annual Conference of the European Association for Computer Graphics, Eurographics 2006 - Tutorials, Vienna, Austria, September 4-8, 2006.",
                "count": 13,
                "papers": [
                    "Geometric Modeling Based on Triangle Meshes.",
                    "Real Time Interactive Massive Model Visualization.",
                    "Developing Mobile 3D Applications with OpenGL ES and M3G.",
                    "Efficient Sorting and Searching in Rendering Algorithms.",
                    "Inverse Rendering: From Concept to Applications.",
                    "High Performance Virtual Garment Simulation.",
                    "Real-Time Volume Graphics.",
                    "Real-time Inhabited Virtual Worlds and Interaction - interactive virtual worlds module.",
                    "EG 2006 Course on Populating Virtual Environments with Crowds.",
                    "Modern Parallel Coordinates.",
                    "Illustrative Visualization for Medicine and Science.",
                    "GPUGI: Global Illumination Effects on the GPU.",
                    "Collision Handling and its Applications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "26th Eurographics 2005",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2005education",
                "sub_name": "26th Annual Conference of the European Association for Computer Graphics, Eurographics 2005 - Education Papers, Dublin, Ireland, August 29 - September 2, 2005.",
                "count": 7,
                "papers": [
                    "A PBL Experience in the Teaching of Computer Graphics.",
                    "Computer Graphics Courseware.",
                    "Function-based Shape Modeling Framework in Multilevel Education.",
                    "Virtual Reality Course - A Natural Enrichment of Computer Graphics Classes.",
                    "Using 3D Graphics for Learning and Collaborating Online.",
                    "Efficient Architecture for Low-Cost Adaptive 3D Graphics-Based E-Learning Applications.",
                    "Visual Learning for Science and Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2005short",
                "sub_name": "26th Annual Conference of the European Association for Computer Graphics, Eurographics 2005 - Short Presentations, Dublin, Ireland, August 29 - September 2, 2005.",
                "count": 32,
                "papers": [
                    "Constriction Computation using Surface Curvature.",
                    "Real-Time Marching Cubes on the Vertex Shader.",
                    "Fast and Controllable 3D Modelling From Silhouettes.",
                    "A Sharpness Dependent Approach to 3D Polygon Mesh Hole Filling.",
                    "Scalar Tagged PN Triangles.",
                    "Carving, Painting, and Printing with a Pen Tablet.",
                    "Sculpting in Augmented Reality.",
                    "Model-driven Virtual Mezzotint Techniques.",
                    "Walking with Pens.",
                    "Proactive Steering Toward Oriented Targets.",
                    "Real-time Upper Body 3D Pose Estimation from a Single Uncalibrated Camera.",
                    "Path Planning for Crowds: From Shared Goals to Individual Behaviors.",
                    "Perception-Based Rendering: Eyes Wide Bleached.",
                    "Differential Photon Mapping - Consistent Augmentation of Photographs with Correction of all Light Paths.",
                    "Video Textures Exploiting Symmetric Movements.",
                    "Image Reconstruction Invariant to Relighting.",
                    "Real-Time Rendering of Cloudy Natural Phenomena with Hierarchical Depth Impostors.",
                    "Leaf Cluster Impostors for Tree Rendering with Parallax.",
                    "Rendering Realistic Trees and Forests in Real Time.",
                    "Efficient, Physically Plausible Finite Elements.",
                    "Predicting Natural Hair Shapes by Solving the Statics of Flexible Rods.",
                    "Fast Body-Cloth simulation with moving humanoids.",
                    "Facial Motion Cloning Using Global Shape Deformation.",
                    "Progressive Cartesian Inequality Constraints for the Inverse Kinematic Control of Articulated Chains.",
                    "A 3D Perceptual Metric using Just-Noticeable-Difference.",
                    "A Visual Quality Prediction Model for 3D Texture.",
                    "Interactive Manipulation Of Projections With a Curved Perspective.",
                    "A Scalable Hardware and Software System for the Holographic Display of Interactive Graphics Applications.",
                    "Improving the Experience of Scenes with a Large Field of View using Shift Lens Perspective.",
                    "Photon Map Gathering on the GPU.",
                    "Spherical Harmonic Lighting of Wavelength-Dependent Phenomena.",
                    "Estimating Mobile Memory Requirements and Rendering Time for Remote Execution of the Graphics Pipeline."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2005stars",
                "sub_name": "26th Annual Conference of the European Association for Computer Graphics, Eurographics 2005 - State of the Art Reports, Dublin, Ireland, August 29 - September 2, 2005.",
                "count": 6,
                "papers": [
                    "Image-based Representations for Accelerated Rendering of Complex Scenes.",
                    "A Survey of General-Purpose Computation on Graphics Hardware.",
                    "Laplacian Mesh Processing.",
                    "Physically Based Deformable Models in Computer Graphics.",
                    "Verification of Physically Based Rendering Algorithms.",
                    "Deforming and Animating Discretely Sampled Object Representations."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2005tutorials",
                "sub_name": "26th Annual Conference of the European Association for Computer Graphics, Eurographics 2005 - Tutorials, Dublin, Ireland, August 29 - September 2, 2005.",
                "count": 9,
                "papers": [
                    "EG 2005 Tutorial on Mixed Realities in Inhabited Worlds.",
                    "Collision Handling in Dynamic Simulation Environments.",
                    "Illustrative Visualization.",
                    "Key Techniques for interactive Virtual Garment Simulation.",
                    "Interactive Shape Modeling.",
                    "Simulation of Light Interaction with Human Skin.",
                    "High Dynamic Range Techniques in Graphics: from Acquisition to Display.",
                    "Interaction in Distributed Virtual Environments.",
                    "Multimodal Interfaces: an Introduction to ENACTIVE systems."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "25th Eurographics 2004",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2004short",
                "sub_name": "25th Annual Conference of the European Association for Computer Graphics, Eurographics 2004 - Short Presentations, Grenoble, France, August 30 - September 3, 2004.",
                "count": 24,
                "papers": [
                    "A Real Time Light Probe.",
                    "Virtual Clay for Direct Hand Manipulation.",
                    "Modulating View-dependent Textures.",
                    "Modeling clouds shape.",
                    "A Web-Based Multimedia Virtual Reality Environment for E-Learning.",
                    "Frontier Sets: A Partitioning Scheme to Enable Scalable Virtual Environments.",
                    "Interactive Physically-based Animation System for Dense Meshes.",
                    "Adaptive Brush Stroke Generation for Painterly Rendering.",
                    "Steerable Texture Synthesis.",
                    "An Oriented Particle and Generalized Spring Model for Fast Prototyping Deformable Objects.",
                    "A Spectral Gamut-Mapping Environment with Rendering Parameter Feedback.",
                    "Interactive Modeling of Mushrooms.",
                    "The Visualisation and Expression of Virtual 3DSurfaces Explored through Custom Developed Interactive Software, Optically Mixed Coloured Surface Contouring and Fine Art Printmaking.",
                    "Enriching Animation Databases.",
                    "Visual Model of Fire.",
                    "Realtime Isosurface Extraction with Graphics Hardware.",
                    "SP-Octrees Visualization Using Impostors.",
                    "A Generic Method for Geometric Contraints Detection.",
                    "A Color Decomposition Method for Preserving Ukiyo-e Woodblocks.",
                    "Tone Mapping in VR Environments.",
                    "Region Completion in a Single Image.",
                    "Packing Square Tiles into One Texture.",
                    "A Quick and Automatic Image Based Modeling and Rendering System.",
                    "Uniform Sampling for Image-based Rendering Shiny Objects."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2004stars",
                "sub_name": "25th Annual Conference of the European Association for Computer Graphics, Eurographics 2004 - State of the Art Reports, Grenoble, France, August 30 - September 3, 2004.",
                "count": 6,
                "papers": [
                    "Visual Supercomputing - Technologies, Applications and Challenges.",
                    "Acquisition, Synthesis and Rendering of Bidirectional Texture Functions.",
                    "Perceptually Adaptive Graphics.",
                    "Classification of Illumination Methods for Mixed Reality.",
                    "Collision Detection for Deformable Objects.",
                    "Principles and Applications of Medical Virtual Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2004tutorials",
                "sub_name": "25th Annual Conference of the European Association for Computer Graphics, Eurographics 2004 - Tutorials, Grenoble, France, August 30 - September 3, 2004.",
                "count": 8,
                "papers": [
                    "Modern Approaches to Augmented Reality.",
                    "Advanced Virtual Medicine: Techniques and Applications for Medicine Oriented Computer Graphics.",
                    "Automatic Generation of Animated Population in Virtual Environments.",
                    "Programming Graphics Hardware.",
                    "RenderWare: Speed up the 3D Application Production Pipeline.",
                    "Multi-resolution Modeling, Visualization and Streaming of Volume Meshes.",
                    "Geometric Algebra and its Application to Computer Graphics.",
                    "Simulation of Clothes for Real-time Applications."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "24th Eurographics 2003",
        "info": "Granada, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2003education",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - Education Papers, Granada, Spain, September 1-5, 2003.",
                "count": 5,
                "papers": [
                    "A Refereed Server for Educational CG Content.",
                    "Learning by doing: A Case for Constructivist 3D Virtual Learning Environment.",
                    "Drag and Drop Scripting: How To Do Hypermedia Right.",
                    "A Virtual Laboratory for Computer Graphics Education.",
                    "Interactive Learning of Computer Graphics Algorithms."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2003posters",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - Posters, Granada, Spain, September 1-5, 2003.",
                "count": 27,
                "papers": [
                    "3D Model Search Engine Based on Lightfield Descriptors.",
                    "3deSoundBox - a Scalable, Platform-Independent 3D Sound System for Virtual and Augmented Reality Applications.",
                    "Curve Synthesis from Learned Refinement Models.",
                    "Polygon-Polygon Collision Detection in 2D.",
                    "A New 3D Spring for Deformable Object Animation.",
                    "Virtual Modelling.",
                    "Obscurances for ray-tracing.",
                    "Anisotropic Participating Media at Near Interactive Rates.",
                    "Point in Solid Tests for Triangle Meshes. Comparative Study.",
                    "Predictive fixed-frame rate tessellation of NURBS surfaces.",
                    "Persepolis: Recovering history with a handheld camera.",
                    "Pedagogic discrete visualization of electromagnetic waves.",
                    "Ashli - Advanced Shading Language Interface.",
                    "A Spatial Representation for Ray-Scene Intersection Test Improvement in Complex Scenes.",
                    "Large XML Document Manager and Visualizer.",
                    "Fast Marching farthest point sampling.",
                    "Parametric Foveation for Progressive Texture and Model Transmission.",
                    "VR Game Interfaces for Interaction onto 3D Display.",
                    "Real time positioning system based on active stereo and facial features identification.",
                    "Image-based Extraction of Material Reflectance Properties of a 3D Rigid Object.",
                    "Resampling structured grids into regular ones.",
                    "Pen and Ink Pictures from Gray-Scale Photographs.",
                    "Certosa virtual museum: a dynamic multilevel desktop VR application.",
                    "Combining 3D Scans and Motion Capture for Realistic Facial Animation.",
                    "GreenArt: A Tool for Non-Photorealistic Rendering of Plants and Trees.",
                    "Interactive demo: OpenGLfly, version Euskadi.",
                    "Multi-resolution modelling of terrains by using non restricted quadtree triangulation."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2003short",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - Short Presentations, Granada, Spain, September 1-5, 2003.",
                "count": 44,
                "papers": [
                    "Preface.",
                    "Mobile Augmented Reality for Environmental Management (MARE).",
                    "Continuous Local Parameterization of Polygons.",
                    "Automatic High Level Avatar Guidance Based on Affordance of Movement.",
                    "A Framework for Video-based and Hardware-Accelerated Remote 3D-Visualization.",
                    "Beyond Image Quality Comparison.",
                    "Adaptive quantization with error bounds for compressed view-dependent multiresolution meshes.",
                    "Animatope: A Manga-Styled Animation Expression Toolkit.",
                    "Interactive Dynamic Environments Using Image-Based Modeling and Rendering.",
                    "Parameter-driven freeform deformations.",
                    "Shadow Mapping Based on Dual Depth Layers.",
                    "Improved Indirect Photon Mapping withWeighted Importance Sampling.",
                    "Multilevel modelling and rendering of architectural scenes.",
                    "A Precise Approach Calibrated by Experimental Data to Make an Artificial Impulse.",
                    "Estimating Positions and Radiances of a Small Number of Light Sources for Real-Time Image-Based Lighting.",
                    "Generation of Radiosity Texture Atlas for Realistic Real-Time Rendering.",
                    "Implicit Surface Reconstruction and uniform Sampling by Striped Marching Triangles.",
                    "The Virtual Painting Paintbox.",
                    "Motion Planning and Visibility Problems using the Polar Diagram.",
                    "Interactive Dynamic Environments Using Image-Based Modeling and Rendering (393.4 kB) Timothy A. Davis, Stephen P. Ficklin An approach to construct augmented CAD models using acquired digital images.",
                    "Extending the Immediate Buckling Model to Triangular Meshes for Simulating Complex Clothes.",
                    "Precise Deformation of Rheology MSD Model Calibrated by Randomized Algorithm.",
                    "Inelastic Scattering and Participating Media.Application to the ocean.",
                    "Particle-based Collision Detection.",
                    "Uncertainty Visualization Methods in Isosurface Rendering.",
                    "Efficient Sampling of Textured Scenes in Vertex Tracing.",
                    "Cyclification of Human Motion for Animation Synthesis.",
                    "Reconstruction of Animatable Personalized 3D Faces by Adaptation-based Modeling.",
                    "High quality images from 2.5D video.",
                    "Accurate Dense Stereo Reconstruction using Graphics Hardware.",
                    "VelvetPath - Layout Design System with Sketch and Paint Manipulations.",
                    "An Iterative Stripification Algorithm Based on Dual Graph Operations.",
                    "ActiveInk.",
                    "Information Visualization using Transparent Shape Impostors.",
                    "On the characterization of avatars in Distributed Virtual Worlds.",
                    "Trans-Polygon Stroke Method for Frame Coherent Pastel Images.",
                    "Goniometric Diagram Mapping for Hemisphere.",
                    "Evolutionary Design of BRDFs.",
                    "Occlusion Culling for Image-Based Rendering withWarping.",
                    "Morphing Rational B-spline Curves and Surfaces Using Mass Distributions.",
                    "Skeleton Subspace Deformation with Displacement Map.",
                    "Real-Time Simulation of Flexible Materials in Avango Virtual Environment Framework.",
                    "Parallel Visibility Test and Occlusion Culling in Avango Virtual Environment Framework.",
                    "Crosstalk reduction in passive stereo-projection systems."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2003slvi",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - Slides and Videos, Granada, Spain, September 1-5, 2003.",
                "count": 8,
                "papers": [
                    "Animating Tree Movement with Sound Effects Generation.",
                    "Lip-Synching in Sourdough.",
                    "Transformation of a Boys Surface into a Steiners Surface and torus eversion.",
                    "Real-Time Simulation of Flexible Materials in Avango Virtual Environment Framework.",
                    "Real-time Obscurances with Color Bleeding (the three cubes demo).",
                    "Experimenting Prioritized IK for Motion Editing.",
                    "Visual Simulation of Lava Flows Employing Particle-based Approach.",
                    "DStrips: Dynamic Triangle Strips for Real-Time Mesh Simplification and Rendering."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2003stars",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - State of the Art Reports, Granada, Spain, September 1-5, 2003.",
                "count": 7,
                "papers": [
                    "Distributed and Collaborative Visualization.",
                    "Realtime Ray Tracing and its use for Interactive Global Illumination.",
                    "Virtual Endoscopy in Research and Clinical Practice.",
                    "Hardware Lighting and Shading.",
                    "An Interaction View on Information Visualization.",
                    "Research Problems for Creating Digital Actors.",
                    "A Survey of Real-time Soft Shadows Algorithms."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2003tutorials",
                "sub_name": "24th Annual Conference of the European Association for Computer Graphics, Eurographics 2003 - Tutorials, Granada, Spain, September 1-5, 2003.",
                "count": 15,
                "papers": [
                    "Hardware-Based Volume Ray Casting.",
                    "Non-Photorealistic Rendering.",
                    "Building Large Area Multi-Projector Displays.",
                    "Advanced Shading Techniques.",
                    "Flow Visualization by Texture Advection.",
                    "High-Level Shading Languages.",
                    "Low-Level Vertex Programming.",
                    "Low-Level Pixel Programming.",
                    "Facial Modeling and Animation.",
                    "Programming Graphics Hardware.",
                    "Real Numbers, Real Images.",
                    "Efficient Monte Carlo and Quasi-Monte Carlo Rendering Techniques.",
                    "Alternative Augmented Reality Approaches: Concepts, Techniques, and Applications.",
                    "Photorealistic Augmented Reality.",
                    "Point-Based Computer Graphics."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "23rd Eurographics 2002",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2002short",
                "sub_name": "23rd Annual Conference of the European Association for Computer Graphics, Eurographics 2002 - Short Presentations, Saarbrücken, Germany, September 2-6, 2002.",
                "count": 50,
                "papers": [
                    "Information-Theoretic Oracle Based on Kernel Smoothness for Hierarchical Radiosity.",
                    "Hardware-Assisted Relief Texture Mapping.",
                    "Visibility Preprocessing Using Spherical Sampling of Polygonal Patches.",
                    "Dependent Tests Driven Filtering in Monte-Carlo Global Illumination.",
                    "An Image-Based Radiosity Representation.",
                    "The Voronoi-Quadtree: construction and visualization.",
                    "On the Integration of Synthetic Objects with Real-World Scenes.",
                    "Using pre-integrated Transfer Functions in an Interactive Software System for Volume.",
                    "Extraction of Critical Points and Nets Based on Discrete Gradient Vector Field.",
                    "Distance fields applied to character animation.",
                    "Concise Tour to the Virtual Old Prague.",
                    "Dynamics-Based Motion Synthesis by Simple Learning Control.",
                    "Dynamic Motion Models.",
                    "Simulation of Cumuliform Clouds Based on Computational Fluid Dynamics.",
                    "A Method for Creating Mosaic Images Using Voronoi Diagrams.",
                    "Digital Watermarking for Volumetric Datasets.",
                    "Fast Volume Carving.",
                    "Real-Time Animated Grass.",
                    "Improved Integration for Cloth Simulation.",
                    "Geometric Simplification of Foliage.",
                    "Mesh Decimation for Displacement Mapping.",
                    "A Convolution-Based Algorithm for Animated Water Waves.",
                    "Modeling Visual Attention in VR: Measuring the Accuracy of Predicted Scanpaths.",
                    "Automatic Data Acquisition and Visualization for Usability Evaluation of Virtual Reality Systems.",
                    "Interactive Polygonisation for Function-based Modelling.",
                    "Knowledge-Based Representation of Cinematic Expression and its Application to Animation.",
                    "Multi-dimensional and Multi-scale Visualizer of Large XML Documents.",
                    "Improved Bump Mapping by using Quadratic Vector Interpolation.",
                    "Image Editing with Intelligent Paint.",
                    "Rendering of Japanese Artcraft.",
                    "Feature interference in free form template matching.",
                    "Interpolating 2D Shape Hierarchically.",
                    "Real-time 3D Deformations by Means of Compactly Supported Radial Basis Functions.",
                    "Tree balancing for mesh simplification.",
                    "Texture Mapping on Doo-Sabin Subdivision Surfaces Using Multiple Images.",
                    "SAVANT: A new efficient approach to generating the visual hull.",
                    "Texture Minification using Quad-trees and Fipmaps.",
                    "Texturing Calibrated Head Model from Images.",
                    "Flexible bump map capture from video.",
                    "Automated Enhancement of 3D Models.",
                    "Adaptive Tessellation for Trimmed NURBS Surface.",
                    "Rendering Artistic Line Drawings Using Off-the-Shelf 3-D Software.",
                    "Function-defined shape node for VRML.",
                    "Frame-Coherent Stippling.",
                    "From Textual Chats to Interest Groups in 3D Virtual Space.",
                    "View Interpolation for Dynamic Scenes.",
                    "Normal Enhancement for Interactive Non-photorealistic Rendering.",
                    "Adaptive Compression of Human Animation Data.",
                    "Measuring and Rendering Art Paintings Using an RGB Camera.",
                    "Reverse Diffusion for Smooth Buildup of Progressivly Transmitted Geometry."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2002stars",
                "sub_name": "23rd Annual Conference of the European Association for Computer Graphics, Eurographics 2002 - State of the Art Reports, Saarbrücken, Germany, September 2-6, 2002.",
                "count": 5,
                "papers": [
                    "Feature Extraction and Visualisation of Flow Fields.",
                    "Tone Reproduction and Physically Based Spectral Rendering.",
                    "Interactive High-Quality Volume Rendering with Flexible Consumer Graphics Hardware.",
                    "Visual Data Mining.",
                    "Global Illumination for Interactive Applications and High-Quality Animations."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2002tutorials",
                "sub_name": "23rd Annual Conference of the European Association for Computer Graphics, Eurographics 2002 - Tutorials, Saarbrücken, Germany, September 2-6, 2002.",
                "count": 10,
                "papers": [
                    "View-Dependent Rendering for Polygonal Datasets.",
                    "Geometric Data Structures for Computer Graphics.",
                    "Modeling and Rendering of Synthetic Plants.",
                    "Tutorial on Inhabited Virtual Heritage.",
                    "Point Based Computer Graphics.",
                    "More than RGB: Spectral Trends in Color Reproduction.",
                    "Programmable Graphics Hardware for Interactive Visualization.",
                    "Cloth Animation and Rendering.",
                    "Facial Modeling and Animation.",
                    "3D Data Acquisition."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "22nd Eurographics 2001",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2001short",
                "sub_name": "22nd Annual Conference of the European Association for Computer Graphics, Eurographics 2001 - Short Presentations, Manchester, UK, September 3-7, 2001.",
                "count": 46,
                "papers": [
                    "Virtual Actors' Behaviour for 3D Interactive Storytelling.",
                    "3dml: A Language for 3D Interaction Techniques.",
                    "Mayhem in Online Game and Virtual Environment Development.",
                    "Complexity Reduction of Catmull-Clark/Loop Subdivision Surfaces.",
                    "Animating cuts with on-the-fly re-meshing.",
                    "Individualising Human Animation Models.",
                    "Artist Driven Expressive Graphics.",
                    "A Visualization System for the Clinical Evaluation of Cerebral Aneurysms from MRA Data.",
                    "Real-Time Procedural Animation of Trees.",
                    "Improvement of the printing model in multi-colored and multi-woodblock virtual printing.",
                    "Metaprogramming for the Generation of Nonparametric Curves.",
                    "Redirected Walking.",
                    "Data driven motion transitions for interactive games.",
                    "Proxy Simulations for Efficient Dynamics.",
                    "An On-line Occlusio-Culling Algorithm for FastWalkthrough in Urban Areas.",
                    "CORBA Visualization Platform.",
                    "Post-rendering Composition for 3D Scenes.",
                    "Warped Textures for UV Mapping Encoding.",
                    "Improved Rendering with Dégradé.",
                    "Scalable Impressionist Rendering.",
                    "Simplification of implicit skeletal models.",
                    "Local Versus Global Triangulations.",
                    "Automatic Animated Face Modeling Using Multiview Video.",
                    "Fractal approximation of surfaces based on projected IFS attractors.",
                    "Free-Form Deformation of Solid Models in CSR.",
                    "Piecewise Constant Conic Sections for Accelerated Volume Density Rendering.",
                    "Deformable Terrain Generation for Real-time Strategy Game.",
                    "A Simple Validity Condition for B-Spline Hyperpatches.",
                    "Approximated Phong Shading by using the Euler Method.",
                    "Constructive Hypervolume Textures.",
                    "Approximated View Reconstruction Using Precomputed ID-Bitfields.",
                    "Adaptive Progressive Vertex Tracing for Interactive Reflections.",
                    "Towards Rapid Reconstruction for Animated Ray Tracing.",
                    "Volumetric Model Repair for Virtual Reality Applications.",
                    "Parametric Motion Blending through Wavelet Analysis.",
                    "HYPER MASK - Projecting a Virtual Face onto a Moving Real Object.",
                    "Gaze-Contingent Level Of Detail Rendering.",
                    "Collision Detection for Continuously Deforming Bodies.",
                    "A Microfacet Based Coupled Specular-Matte BRDF Model with Importance Sampling.",
                    "Space-Time Hierarchical Radiosity with Clustering and Higher-OrderWavelets.",
                    "Managing Gigabyte Virtual EnvironmentWalkthrough.",
                    "An Improved Spacetime Ray Tracing System for the Visualization of Relativistic Effects.",
                    "N-Adic Subdivision Schemes for Local Mesh Deformation.",
                    "Game Based Interfaces.",
                    "Animation of Facial Expressions by Physical Modeling.",
                    "Interactive 3D Modeling in the Inception Phase of Architectural Design."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2001stars",
                "sub_name": "22nd Annual Conference of the European Association for Computer Graphics, Eurographics 2001 - State of the Art Reports, Manchester, UK, September 3-7, 2001.",
                "count": 5,
                "papers": [
                    "State of the Art in Interactive Ray Tracing.",
                    "Occlusion Culling Methods.",
                    "Web 2D Graphics: State-of-the-Art.",
                    "Intelligent Virtual Environments - A State-of-the-art Report.",
                    "Mesh Morphing."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2001tutorials",
                "sub_name": "22nd Annual Conference of the European Association for Computer Graphics, Eurographics 2001 - Tutorials, Manchester, UK, September 3-7, 2001.",
                "count": 9,
                "papers": [
                    "Inhabited Virtual Heritage.",
                    "Rendering and Visualization in Parallel Environments.",
                    "Data Mining and Visualization of High Dimensional Datasets.",
                    "Collision Handling for Virtual Environments.",
                    "SVG Primer.",
                    "Interactive Simulation for Multimodal Virtual Environments.",
                    "Answering to What is the criterion? questions using integral geometry tools.",
                    "Clifford Algebra, Clifford Analysis and Applications in Physics and Visualization.",
                    "Simulation of Light Interaction with Plants."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "21st Eurographics 2000",
        "info": "Interlaken, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/2000talks",
                "sub_name": "21st Annual Conference of the European Association for Computer Graphics, Eurographics 2000 - Invited Papers, Interlaken, Switzerland, August 21-25, 2000.",
                "count": 3,
                "papers": [
                    "Collaboration in VEs - fact or fiction?",
                    "Virtual Humans: Ten Problems Still Not Completely Solved.",
                    "Principles of Computer Graphics: the experience of a class A user."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2000short",
                "sub_name": "21st Annual Conference of the European Association for Computer Graphics, Eurographics 2000 - Short Presentations, Interlaken, Switzerland, August 21-25, 2000.",
                "count": 24,
                "papers": [
                    "MeshSweeper: From Closest Point to Hausdorff Distance Between Meshes.",
                    "A Facial Repertoire for Animation.",
                    "Visibility Complexity of a Region in Flatland.",
                    "Volumetric Textures.",
                    "ALOHA : Adaptive Level Of Detail for Human Animation Towards a new framework.",
                    "An Accurate Illumination Model for Objects Coated with Multilayer Films.",
                    "Visualizing Stars and Emission Nebulas.",
                    "Interactive Modelling of Convolution Surfaces with an Extendable User Interface.",
                    "A Procedural Approach to Solving Constraints of Articulated Bodies.",
                    "Imaging Geometry for Concentric Mosaics.",
                    "An Image Processing Approach to Detection of Ridges and Ravines on Polygonal Surfaces.",
                    "Spreading of the cultural heritage by means of multi-configurable, low cost virtual reality techniques.",
                    "Towards Communicating Agents and Avatars in Virtual Worlds.",
                    "Combining finite element deformation with cutting for surgery simulations.",
                    "Component Based Human Animation Architecture.",
                    "Selecting Effective Occluders for Visibility Culling.",
                    "Interactive Vegetation Rendering with Slicing and Blending.",
                    "Efficient Evaluation of the Field Functions of Soft Objects Using Interval Tree.",
                    "Scene understanding techniques using a virtual camera.",
                    "Automatic Fitting of Digitised Contours at Multiple Scales through Curvature Scale Space.",
                    "Discrete Analysis for Antialiased Lines.",
                    "A Novel Image-Based Rendering System With A Longitudinally Aligned Camera Array.",
                    "Adding a scalar value to 2D vector field visualization: the BLIC (Bumped LIC).",
                    "Robust Polygons Clipping to Model Complex Objects."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2000stars",
                "sub_name": "21st Annual Conference of the European Association for Computer Graphics, Eurographics 2000 - State of the Art Reports, Interlaken, Switzerland, August 21-25, 2000.",
                "count": 6,
                "papers": [
                    "Shadow Computation: A Unified Perspective.",
                    "Geometric Signal Processing on Polygonal Meshes.",
                    "Recent Advances in Visualization of Volumetric Data.",
                    "Interactive Display of Global Illumination Solutions for Non-Diffuse Environments.",
                    "The 3D Model Acquisition Pipeline.",
                    "Visual Perception in Realistic Image Synthesis."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/2000tutorials",
                "sub_name": "21st Annual Conference of the European Association for Computer Graphics, Eurographics 2000 - Tutorials, Interlaken, Switzerland, August 21-25, 2000.",
                "count": 6,
                "papers": [
                    "Volume Visualization and Volume Rendering Techniques.",
                    "The modelling of growing natural forms.",
                    "Dealing with Shape Complexity for Internet Access and Graphic Applications.",
                    "Geometric Modeling Based on Polygonal Meshesv.",
                    "Interactive 3D Rendering and Visualization in Networked Environments.",
                    "Framework Technologies and Methods for Large Data Visualization."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "20th Eurographics 1999",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1999short",
                "sub_name": "20th Annual Conference of the European Association for Computer Graphics, Eurographics 1999 - Short Presentations, Milan, Italy, September 7-11, 1999.",
                "count": 66,
                "papers": [
                    "Digital Painting: facing the problem.",
                    "Animating Brachiation.",
                    "Interfacing Cultural Heritage.",
                    "Edinburgh: 200 years of heritage through image-based virtual environments.",
                    "Adaptive Refinements in Subdivision Surfaces?",
                    "Contour Extraction of Watermarks in Old Manuscripts.",
                    "Design or art? Art or design?",
                    "Visual Learning with Computer Art Graphics Artwork Description.",
                    "The Aurora.",
                    "Emotion-based, Multi-person Interactive Theatre - Romeo and Juliet in Hades.",
                    "3-D Spatial Skills-A Key to the Effective Use of Computer Graphics Software?",
                    "On the Opera Theatre Simulation.",
                    "Registration methods for harmonious integration of real worlds and computer generated objects.",
                    "Improving 3-D Spatial Visualization Skills with Multimedia Software.",
                    "Visible Surface Reconstruction with Accurate Localization of Object Boundaries.",
                    "Multidimensional Shape Modeling for Animation.",
                    "On Time-Varying Flow Fields: a streakline-based visualization method.",
                    "CharToon: a system to animate 2D cartoons faces.",
                    "Information Technologies for Set-designers.",
                    "Towards Spatial Specification of Interactive System.",
                    "A First Step to Evaluate and Compare Multiresolution Models.",
                    "Scanning Michelangelos Florentine Pieta: Making the Results Usable.",
                    "The InViWo virtual agents.",
                    "Psycho-social Happenings in Mediated Environments.",
                    "A Global Routing Mechanism for Modular VRML-Worlds.",
                    "Virtual Reconstruction of Medieval Architecture.",
                    "Fast Distance Field Interpolation for Reconstruction of Surfaces from Contours.",
                    "Better Pasting Via Quasi-Interpolation.",
                    "HIT! BAT! IT!",
                    "WebTalk: a 3D collaborative environment to access the Web.",
                    "A Rapid Clustering Algorithm for Efficient Rendering.",
                    "The Danteum.",
                    "Creating light-weight virtual humans for Virtual Environments.",
                    "Schock in the ear: sound and new media art.",
                    "Wavelet Projections for Volume Rendering.",
                    "Computer Animation of Pianist's Hand.",
                    "Accelerated Artificial Landscape Visualisation.",
                    "Adaptive Scattered Data Interpolation with Multilevel Nonuniform B-Splines.",
                    "A Minimalist Approach to Facial Reconstruction.",
                    "A Pyramidal Hemisphere Subdivision Method for Monte Carlo Radiosity.",
                    "Books and Devices from the Old -Their Renaissance in Computer Graphics.",
                    "Virtual lights: a method for expressive visualization.",
                    "Site and Structure at the Vatican: From the Earliest Settlement to the Present.",
                    "A Study of Automatic Program Production Using TVML.",
                    "VRML-based System for a Three-Dimensional Virtual Museum on the Web.",
                    "The atrium of St. Mary Abbey in Pomposa: a hypermedial 3-D network database.",
                    "Virtual Sculpture.",
                    "Monitoring of the visual arts degrade by means of the active vision system \"3EYES\".",
                    "Distributed Virtual Environments for Urban Modelling.",
                    "3D virtual facial reconstruction and visualization of ancient Egyptian mummies using spiral CT data.",
                    "Psychologically-based Walking in a Cluttered Environment.",
                    "How To Visit Dunhuang Without Travelling To Central Asia.",
                    "Looking for the Lost Follis.",
                    "A VR based safety training in a petroleum refinery.",
                    "Baroque Dance Animation with Virtual Dancers.",
                    "The Norwich Virtual City Project.",
                    "Gaseous Volume Visualization Using Particle Maps.",
                    "Las Meninas: Narrative Illusions in Virtual Reality.",
                    "Virtual Environments as Multimedia Contents Integrators.",
                    "Interactive Information System for the Camposanto Monumentale of Pisa.",
                    "Filtering mechanisms for the visualization of non-geometrical and geometrical data.",
                    "Exploiting Pompei Cultural Heritage: The Plinius Project.",
                    "Interference Detection in Architectural Databases.",
                    "Rapid Urban Modelling.",
                    "Virtual Reality and Cultural Heritage Examples: the Mysterious City Fresco, the Domus Aurea.",
                    "3D laser scanning numerical surface definition and fast prototyping of the Basel Bronze Head."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/1999stars",
                "sub_name": "20th Annual Conference of the European Association for Computer Graphics, Eurographics 1999 - State of the Art Reports, Milan, Italy, September 7-11, 1999.",
                "count": 6,
                "papers": [
                    "Graphics, Vision, and Visualization in Medical Imaging: A State of the Art Report.",
                    "Graph Visualisation and Navigation in Information Visualisation.",
                    "Multiresolution Modeling: Survey and Future Opportunities.",
                    "3D Geometry Compressionand Progressive Transmission.",
                    "Radiosity for Large Vegetation Scenes.",
                    "Modelling and Haptic Interaction with non-rigid materials."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/1999tutorials",
                "sub_name": "20th Annual Conference of the European Association for Computer Graphics, Eurographics 1999 - Tutorials, Milan, Italy, September 7-11, 1999.",
                "count": 9,
                "papers": [
                    "Tutorial 9 - Visibility.",
                    "Tutorial 7 - 3D Graphics Programming with Java 3D.",
                    "Tutorial 2 - Level-of-Detail in Surface and Volume Modeling.",
                    "Tutorial 6 - Rendering and Visualization in Parallel Environments.",
                    "Tutorial 5 - Integrated Environments for Cultural HeritageKnowledgeIntegrated Environments for Cultural HeritageKnowledge.",
                    "Tutorial 4 - Advanced Graphics Programming using OpenGL and Extensions.",
                    "Tutorial 8 - Adaptive Graphics Generation in theUser InterfaceAdaptive Graphics Generation in theUser Interface.",
                    "Tutorial 3 - Whats Happening in Collaborative Engineering?",
                    "Tutorial 1 -Advanced Radiosity: Complex Scenes and Glossy Reflections."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "19th Eurographics 1998",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1998short",
                "sub_name": "19th Annual Conference of the European Association for Computer Graphics, Eurographics 1998 - Short Presentations, Lisbon, Portugal, August 31 - September 4, 1998.",
                "count": 19,
                "papers": [
                    "Motion Reparametrization.",
                    "Modelling Cloth Buckling and Drape.",
                    "Agents in multi-user virtual environments.",
                    "Using constraints to describe high-level behaviours in virtual worlds.",
                    "Reconstruction of 3D colored Data.",
                    "Face-to-Face Communication System in Cyberspace by Voice Driven Avatar.",
                    "A Faster Algorithm for 3D Discrete Lines.",
                    "Virtual Sewing System for Apparel Design.",
                    "Navigation through Virtual 3D Worlds for Facilitating Childrens Spatial Orientation.",
                    "A Semi-empirical Model for the Representation of Materials in Photorealistic Rendering.",
                    "Dynamic Load Balancing in Distributed Virtual Environment.",
                    "Immersive High Quality Communication.",
                    "Behavior Authoring for VRML Applications in Industry.",
                    "The Hidden Face Determination Tree.",
                    "Interactive Analysis for MPEG-4 Facial Models Configuration.",
                    "Visualization of Dynamic Processes Recorded during Epileptic Seizures.",
                    "Scanning and Reconstruction of human body parts.",
                    "Comparison between two Three-Dimensional Edge Operators applied in a 3D Navigation Approach.",
                    "Towards more flexible shading architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/1998stars",
                "sub_name": "19th Annual Conference of the European Association for Computer Graphics, Eurographics 1998 - State of the Art Reports, Lisbon, Portugal, August 31 - September 4, 1998.",
                "count": 6,
                "papers": [
                    "State of the Art in Perceptually Driven Radiosity.",
                    "Multidimensional free-form deformation tools.",
                    "A Standard for Multimedia Middleware.",
                    "Distributed Cooperative Visualization.",
                    "Overview of Parallel Photo-realistic Graphics.",
                    "Interpolation and Approximation of Surfaces from Three-Dimensional Scattered Data Points."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/1998tutorials",
                "sub_name": "19th Annual Conference of the European Association for Computer Graphics, Eurographics 1998 - Tutorials, Lisbon, Portugal, August 31 - September 4, 1998.",
                "count": 5,
                "papers": [
                    "A Subdivision Scheme for Smooth Interpolation of Quad-Mesh Data.",
                    "Introduction to Programming with Java 3D.",
                    "Introduction to VRML 97.",
                    "Rendering and Visualization in Affordable Parallel Environments.",
                    "Advanced Application of Volume Visualization Methods in Medicine."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "18th Eurographics 1997",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1997stars",
                "sub_name": "18th Annual Conference of the European Association for Computer Graphics, Eurographics 1997 - State of the Art Reports, Budapest, Hungary, September 4-8, 1997.",
                "count": 6,
                "papers": [
                    "Photo-Realistic Rendering - Recent Trends and Developments.",
                    "Web Design - New design for web sites in a commercial context.",
                    "On the Computational Requirements of Virtual Reality Systems.",
                    "Digital Publishing.",
                    "Advanced Applications of Volume Visualization Methods in Medicine.",
                    "Digital Publishing - Data Handling."
                ]
            },
            {
                "sub_name_abbr": "conf/eurographics/1997tutorials",
                "sub_name": "18th Annual Conference of the European Association for Computer Graphics, Eurographics 1997 - Tutorials, Budapest, Hungary, September 4-8, 1997.",
                "count": 7,
                "papers": [
                    "Introduction to VRML 97.",
                    "Simplification, LOD and MultiresolutionPrinciples and Applications.",
                    "Simplification and Compression of 3D Scenes.",
                    "Non-manifold and special purpose modelling.",
                    "Virtual Spaces - VR Projection System Technologies and Applications.",
                    "Java APIs.",
                    "Developing and Publishing High-Quality Electronic Documents on CD-ROM."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "17th Eurographics 1996",
        "info": "Poitiers, France",
        "venues": []
    },
    {
        "year": "1995",
        "name": "16th Eurographics 1995",
        "info": "Maastricht, The Netherlands",
        "venues": []
    },
    {
        "year": "1994",
        "name": "15th Eurographics 1994",
        "info": "Oslo, Norway",
        "venues": []
    },
    {
        "year": "1993",
        "name": "14th Eurographics 1993",
        "info": "Barcelona, Spain",
        "venues": []
    },
    {
        "year": "1992",
        "name": "13th Eurographics 1992",
        "info": "Cambridge, UK",
        "venues": []
    },
    {
        "year": "1991",
        "name": "12th Eurographics 1991",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1991",
                "sub_name": "12th European Computer Graphics Conference and Exhibition, Eurographics 1991, Vienna, Austria, September 2-6, 1991, Proceedings.",
                "count": 40,
                "papers": [
                    "Continuation Methods for Approximating Isovalued Complex Surfaces.",
                    "Combining Volume Rendering with Line and Surface Rendering.",
                    "FACES: Facial Animation, Construction and Editing System.",
                    "A Testbed for Architectural Modeling.",
                    "Construction Techniques of Graphic, Direct-Manipulation User Interfaces.",
                    "A DDA Octree Traversal Algorithm for Ray Tracing.",
                    "Sampling and Anti-Aliasing of Discrete 3-D Volume Density Textures.",
                    "Using temporal and spatial coherence for accelerating the calculation of animation sequences.",
                    "Validity Issues for Modular Boundary Models.",
                    "Constructive Cubes: CSG Evaluation For Display Using Discrete 3-D Scalar Data Sets.",
                    "Configurable Representations in Feature-based Modelling.",
                    "Refinement criteria for adaptive stochastic ray tracing of textures.",
                    "Low Sampling Densities using a psychovisual approach.",
                    "Discrepancy as a Quality Measure for Sample Distributions.",
                    "Declarative Graphics And Dynamic Interaction.",
                    "Liberation from Flatland: 3D Interaction Based on the Desktop Bat.",
                    "A constraint-based UIMS using graph unification.",
                    "Shading with Area Light Sources.",
                    "Interrogation of Offsets of Polynomial Surface Patches.",
                    "An Algorithm of hidden Surface Removal based on Frame-To- Frame Coherence.",
                    "Constructive Page Description Opening Up the Prepress World.",
                    "Integrating Inheritance and Composition in an Objective Presentation Model for Multiple Media.",
                    "MOVE-X: A System for Combining Video Films and Computer Animation.",
                    "Geometric Modelling from Range Image Data.",
                    "Serial cuttings matching: An application to muscle fiber characterization.",
                    "A Symmetrical Input/Output Model.",
                    "Fast Rendering of General Ellipses.",
                    "Tessellation of Curved Surfaces under Highly Varying Transformations.",
                    "Timewarps: A Temporal Reparameterization Paradigm for Parametric Animation.",
                    "Computational Physics : A Modeler - Simulator for animated physical Objects.",
                    "Animation of Landscapes Using Satellite Imagery.",
                    "Radiosity for Furry Surfaces.",
                    "Time Complexity of Monte Carlo Radiosity.",
                    "A Testbed for Image Synthesis.",
                    "C 2 Gregory patch.",
                    "Solid-Interpolating Deformations: Construction and animation of PIPs.",
                    "Variable-Radius Blending by Using Gregory Patches in Geo- metric Modeling.",
                    "Interactive Conformance Testing for PHIGS.",
                    "Several approaches to implement the merging step of the split and merge region segmentation.",
                    "Colour Illustrations."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "11th Eurographics 1990",
        "info": "Montreux, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1990",
                "sub_name": "11th European Computer Graphics Conference and Exhibition, Eurographics 1990, Montreux, Switzerland, September 4-7, 1990, Proceedings.",
                "count": 45,
                "papers": [
                    "Prelog - a System for Presenting and Rendering Logic Specifications of Interactive Systems.",
                    "Fast Rendering of Arbitrary Distributed Volume Densities.",
                    "Optimization of the Binary Space Partition Algorithm (BSP) for the Visualization of Dynamic Scenes.",
                    "Tries: Data Structures based on Binary Representation for Ray Tracing.",
                    "An Approach to the Formal Specification of the Components of an Interaction.",
                    "WSE: An Environment for Exploring Window Strategies.",
                    "Rendering mirages and other atmospheric Phenomena.",
                    "Three-dimensional Texturing using Lattices.",
                    "Interactive Ray-Tracing for Image production with Increasing Realism.",
                    "Automatic modelling of Natural Scenes for Generating Synthetic Movies.",
                    "An Approach to Improve the reliability of Boolean Operation on a Pair of Polyhedra.",
                    "Reconstruction of a boundary Representation Model from three orthographic Projections: a Geometrical Approach.",
                    "A Raster Graphics Approach to Flow Visualization.",
                    "Hemi-Cube Ray-Tracing: A Method for Generating Soft Shadows.",
                    "An interpolation method for stochastic Models.",
                    "Mathematical Models for Semi-globalized Spectral Synthesis.",
                    "Hyperimages - an Alternative to the Conventional Digital Images.",
                    "A Stochastic Functional Approach for Terrain Modeling.",
                    "On Formulation and Display for Visualizing Features and Evaluating Quality of Free-form Surfaces.",
                    "Eden - an Editor Environment for Object- Oriented Graphics Editing.",
                    "End User Programming Environments : Interactive Programming-on-Example in CAD parametric Design.",
                    "3D modelling and motion of Deformable solids from 2D Images.",
                    "Characterization of Topographic surfaces.",
                    "Tightly-Coupled Multiprocessing for a Global Illumination Algorithm.",
                    "A Constraint-Based Figure-Maker.",
                    "Shading and Shadowing with Linear Light Sources.",
                    "The Architecture of a Prototype System for Drawing Data Structures.",
                    "TRIMO A Workstation-Based Interactive System for the Generation, Manipulation, and Display of Surfaces over Arbitrary Topological Meshes.",
                    "An Interactive Debugger for PHIGS.",
                    "Factoring a Homogeneous Transformation for a more Efficient Graphics Pipeline.",
                    "Presentation of Product Model Data -an Interface between Graphics and CAD-.",
                    "Interpolating Curve Networks with New blending patches.",
                    "An Object Oriented Approach to Ensure Portability of CAD Standard parts Libraries.",
                    "Color Image Reconstruction from nonuniform Sparse samples using a thin plate Model.",
                    "A Proposal for a PostScript 3D Extension.",
                    "DaScript Plus A PostScript Extension supporting 3D Graphics with 2D Functionality.",
                    "Joint Editing with DAPHNE A System integrating CGMs into SGML Documents.",
                    "Adaptive Polygonization of Implicit surfaces using Simplicial Decomposition and boundary Constraints.",
                    "A shadow algorithm for CSG.",
                    "Cross Scanline Algorithm.",
                    "Color Shading in 2D synthesis.",
                    "Some Possible Applications of CORDIC Processors in Computer Graphics.",
                    "Relaxed Multi-rate Systolic Array Graphics Engine for High Resolution Real-time Computer Graphics.",
                    "A Pipelined-Parallel Architecture for 2.5-d batch Rasterizers.",
                    "Colour Illustrations."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "10th Eurographics 1989",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1989",
                "sub_name": "10th European Computer Graphics Conference and Exhibition, Eurographics 1989, Hamburg, Germany, September 4-8, 1989, Proceedings.",
                "count": 41,
                "papers": [
                    "Supporting Graphical Languages with Structure Editors.",
                    "Visualizing Curvature Discontinuities of Free-Form Surfaces.",
                    "When is a Line a Line?",
                    "GEO++ - A System for Both Modelling and Display.",
                    "2.5 Dimensional Graphics Systems.",
                    "Variations on a Dither Algorithm.",
                    "Subdivisions of Surfaces and Generalized Maps.",
                    "A Reference Model for the Visualisation of Multi-Dimensional Data.",
                    "An Analysis of Modeling Clip.",
                    "Graph Grammars, A New Paradigm for Implementing Visual Languages.",
                    "The Use of Finite Element Theory for Simulating Object and Human Body Deformations and Contacts.",
                    "Message-Based Object-Oriented Interaction Modeling.",
                    "Representing Tolerance Information in Feature-Based Solid Modelling.",
                    "Blending Rational B-Spline Surfaces.",
                    "Hierarchical Texture Synthesis on 3-D Surfaces.",
                    "A Topological Map-Based Kernel for Polyhedron Modelers: Algebraic Specification and Logic Prototyping.",
                    "Toward Realistic Formal Specifications for Non-Trivial Graphical Objects.",
                    "GKS, Structures and Formal Specification.",
                    "A Model for Description and Synthesis of Heterogeneous Textures.",
                    "Anti-Aliasing by Successive Steps with a Z-Buffer.",
                    "Delauney Triangulations and the Radiosity Approach.",
                    "Algorithms for 2D Line Clipping.",
                    "Highlight Shading: Lighting and Shading in a PHIGS+/PEX-Environment.",
                    "On Reducing the Phong Shading Method.",
                    "A Parallel Image Computer with a Distributed Frame Buffer: System Architecture and Programming.",
                    "Visualisation of Digital Terrain Data.",
                    "Non-Planar Polygons and Photographic Components for Naturalism in Computer Graphics.",
                    "Visualisation in Astrophysics.",
                    "Deformation of Solids with Trivariate B-Splines.",
                    "Adding Parallelism in Object Space to the Rendering Pipeline.",
                    "Forest of Quadtrees: An Object Representation for 3D Graphics.",
                    "Two Object-Oriented Models to Design Graphical User Interfaces.",
                    "On the Software Structure of User Interface Management Systems.",
                    "Components, Frameworks and GKS Input.",
                    "A VLSI Chip for Ray Tracing Bicubic Patches.",
                    "Ray Tracing Polynomial Tensor Product Surfaces.",
                    "MICRO-UIDT: A User Interface Development Tool.",
                    "The Structure of Tube - A Tool for Implementing Advanced User Interfaces.",
                    "The Macro-Regions: An Efficient Space Subdivision Structure for Ray Tracing.",
                    "Pixel Selected Ray Tracing.",
                    "Accelerated Radiosity Method for Complex Environments."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "9th Eurographics 1988",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1988",
                "sub_name": "9th European Computer Graphics Conference and Exhibition, Eurographics 1988, Nice, France, September 12-16, 1988, Proceedings.",
                "count": 40,
                "papers": [
                    "Fast Algorithm for Polygon Clipping with 3D Windows.",
                    "An Evaluation of CSG Trees Based on Polyhedral Solids.",
                    "The Calculus of the Non-Exact Perspective Projection - Scene-Shifting for Computer Animation.",
                    "A Method for Providing Full Interactive Control of the Shape of 3-D Curves and Surfaces.",
                    "Optimal Texture Mapping.",
                    "Monte-Carlo Integration Applied to an Illumination Model.",
                    "Form-Factors for General Environments.",
                    "Pseudo Ordering of CSG-Trees.",
                    "Free-Form Surfaces Modeling by Evolution Simulation.",
                    "Architectures for Mass Market 3D Displays.",
                    "A Evalution of Some Three-Color Tiling Patterns.",
                    "Liberation from Rectangles: A Tiling Method for Dynamic Modification of Objects on Raster Displays.",
                    "Outline Phase Control for Character Rasterization.",
                    "Experimenting with a Parallel Ray-Tracing Algorithm on a Hypercube Machine.",
                    "Efficient Adaptive Subdivision of Bezier Surfaces.",
                    "Fractal Approximation of 2-D Object.",
                    "Animation of Stochastic Model-Based 3-D Textures.",
                    "A Simple Spectral Approach to Stochastic Modelling for Natural Objects.",
                    "A System for Graphical Interaction on Parametrized Models.",
                    "G1 Smoothing Solid Objects by Bicubic Bezier Patches.",
                    "An Object-Oriented Approach to Process Monitoring.",
                    "Construction and Animation of a Synthetic Actress.",
                    "Generation of High-Quality Curve and Surface with Smoothly Varying Curvature.",
                    "A New Algorithm for Converting Boundary Representation to Octree.",
                    "Conversion of Boundary Representations to Bintrees.",
                    "Automatic Detection of Closed Parametric Surfaces without Interior.",
                    "Conic Beta-Splines with Local Tension Control for Interactive Curve Fitting.",
                    "A Compositional Semantics for Graphics.",
                    "METAVIEWS: A Process-Oriented Approach to CAD and Graphics.",
                    "A Formal Specification of a Boundary Representation.",
                    "A Procedural System for the Definition and Storage of Technical Drawings in Parametric Form.",
                    "An Expert System for Polyhedra Modelling.",
                    "Towards a System for Exploring the Universe of Polyhedral Shapes.",
                    "Boundary to Constructive Solid Geometry: A Step Towards 3D Conversion.",
                    "Using Algebraic Constraints in Interactive Text and Graphics Editing.",
                    "Grafields: Field-Directed Dynamic Splines for Interactive Motion Control.",
                    "Tools for Efficient Photo-Realistic Computer Animation.",
                    "IXPHIGS: A Portable Implementation of the International PHIGS Standard.",
                    "The Development of PHEX, a 3D Graphics Extension to X11.",
                    "Application Profiles for Computer Graphics Standards - A Touch of Realism."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "8th Eurographics 1987",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1987",
                "sub_name": "8th European Computer Graphics Conference and Exhibition, Eurographics 1987, Amsterdam, The Netherlands, August 24-28, 1987, Proceedings.",
                "count": 42,
                "papers": [
                    "Splines for Engineers.",
                    "Interaction Management in CAD Systems with History Mechanism.",
                    "An Intersection-Sensitive Hidden-Surface Algorithm.",
                    "A New Algorithm for Contour-plotting.",
                    "Dynamic Management of 3D Scenes.",
                    "A Fast Antialiasing Method with a Z-Buffer.",
                    "A Metric for Computing Adaptive Detail in Animated Scenes Using Object-Oriented Programming.",
                    "A Temporal Scripting Language for Object-Oriented Animation.",
                    "Designing a System to Provide Graphical User Interfaces: The THESEUS Approach.",
                    "Viz: A Production System Based User Interface Management System.",
                    "Bezier Patches with Local Shape Control Parameters.",
                    "The Clockworks: An Object-Oriented Computer Animation System.",
                    "3D Models in Computer-Assisted Chemistry.",
                    "An Approach to the Formal Specification of Configurable Models of Graphics Systems.",
                    "A Shareable Centralised Database of KRT3 - A Hierarchical Graphics System Based on PHIGS.",
                    "HIRASP: A Hierarchical Interactive Rastergraphics System Based on Pattern Graphs and Pattern Expressions.",
                    "A Means to Improve the GKS-3D/PHIGS Output Pipeline Implementation.",
                    "Unifying Vector and Polygon Algorithms for Scan Conversion and Clipping.",
                    "Efficient and Consistent Algorithms for Determining the Containment of Points in Polygons and Polyhedra.",
                    "Display of Solid Models with a Multi-Processor System.",
                    "A New Scan Line Algorithm for the Rendering of CGS Trees.",
                    "An Automatic Interpolation Method of Grayvalued Images Utilizing Density Contour Lines.",
                    "Extraction and Organization of Form Features into a Structured Boundary Model.",
                    "Extended Octtrees, between CSG Trees and Boundary Representations.",
                    "Parallel Graphical Output from Dialogue Cells.",
                    "The Reconstruction of Neurone Morphology from Thin Optical Sections - Graphical Aspects.",
                    "An Interactive Graphic Simulator for the Teaching of Fibrendoscopic Techniques.",
                    "Active-Ray Tracing for 3D Medical Imaging.",
                    "An Algorithm for 3D Scan-Conversion of Polygons.",
                    "Real-Time Scan-Line In-Fill.",
                    "A VLSI System Architecture for High-Speed Radiative Transfer 3D Image Synthesis.",
                    "Interactive Generation of Fractal Objects.",
                    "Shape Approximation by a Fractal Model.",
                    "Generative Scene Modelling.",
                    "Parallel Polygon Rendering with Precomputed Surface Patches.",
                    "A Fast Ray Tracing Algorithm Using Space Indexing Techniques.",
                    "A Fast Voxel Traversal Algorithm for Ray Tracing.",
                    "Experiences in Implementing Postscript.",
                    "Conformal Texture Mapping.",
                    "GOCS - The GKS-oriented Communication System.",
                    "A New Algorithm of Space Tracing Using a CSG Model.",
                    "A Window Managment System on Top of GKS."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "7th Eurographics 1986",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1986",
                "sub_name": "7th European Computer Graphics Conference and Exhibition, Eurographics 1986, Lisbon, Portugal, August 25-29, 1986, Proceedings.",
                "count": 27,
                "papers": [
                    "An Implementation of the GKS-3D/Phigs Viewing Pipeline.",
                    "Mappings Between Product Data Definitions.",
                    "An Introduction to the Graphics Systems Processor.",
                    "Towards a Formal Specification of the GKS Output Primitives.",
                    "A Multiprocessor Architecture For High-Quality Interactive Displays.",
                    "The Integrated Display Controller (IDC) for VLSI-Design Workstations.",
                    "Geometric Boundary Modelling without Topological Data Structures.",
                    "Deformations of Sweep Objects in Solid Modelling.",
                    "Memory Organization for a Cubic Frame Buffer.",
                    "CSI: A Processor for Image Synthesis.",
                    "Towards the Construction of Graphical Interfaces on the Basis of Geometric Models.",
                    "Methods for Cross-Sectional Design of B-Spline Surfaces.",
                    "The Integration of Particle and Polygon Rendering using an A-buffer Algorithm.",
                    "A General Purpose User Interface With Hierarchical Data Structure Management.",
                    "An Adaptive Graphics Interface for Effective Visual Representation.",
                    "An Advanced Display System With Natural Interactivity.",
                    "A Statistical Method For Adaptive Stochastic Sampling.",
                    "A consistent algorithm to fill triangles and triangular patches.",
                    "A Version Management System for Design Environments.",
                    "A Visualisation Tool for (Landscape) Architects.",
                    "A Portable Graphical Display System For The Partially Sighted.",
                    "A Pixel-Parallelhidden Surface Algorithm For Constructive Solid Geometry.",
                    "Multi-Dimensional Graphics: Algorithms & Applications.",
                    "A Multiple Application Graphics Integrated Circuit - MAGIC.",
                    "Linked Management Graphics For Production Control.",
                    "A Quad-Tree Algorithm for Displaying a 2-Dimensional Slice of an N-Dimensional Weighted Voronoi Tessellation.",
                    "Digital Synthesis Of Calligraphic Script."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "6th Eurographics 1985",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1985",
                "sub_name": "6th European Computer Graphics Conference and Exhibition, Eurographics 1985, Nice, France, September 9-13, 1985, Proceedings.",
                "count": 35,
                "papers": [
                    "Fractional Brownian Relief: An Exact Local Method.",
                    "Graphics Programming with \"Archetypes\" - A Preliminary Study.",
                    "Pipeline Approach for Building the Presentation Graphics Systems.",
                    "Biceps - The Interactive Graphics Aided System for Bi-dimensional Geometry Yodeling, Nesting and Flame Cutting Technology.",
                    "Towards Object-oriented Graphics Standards.",
                    "Generalization of Contour Tracking in Image Synthesis, and Application.",
                    "Table Look-up Graphic Interpolation.",
                    "An Interactive Rendering Technique for 3-D Shapes.",
                    "Graphical Data Bases Built on Peano Space-filling Curves.",
                    "Configuring Reference Systems for Certifying GKS Implementations.",
                    "Multi-dimensional Graphics.",
                    "Raster Rotation of Bilevel Bitmap Images.",
                    "A Normal-buffer Vectorized Surface Shading Model.",
                    "A Generalisation of the Timmer Blending Functions for Bezier-type Cubic Curves.",
                    "A Concept for a GKS Machine.",
                    "A Three-dimensional Shaded Display Method for Voxel-based Representation.",
                    "Extending GKS to a Distributed Architecture.",
                    "GKS Inquiry Functions within PROLOG.",
                    "A 3-D Cellular Frame Buffer.",
                    "NEM: A Language for Animation of Actors and Objects.",
                    "Viewing Solid Models by Bintree Conversion.",
                    "Creating CSG Modelled Pictures for Ray-casting Display.",
                    "Geometric Modelling Using Exact Octree Representation of Polyhedral Objects.",
                    "Model Driven Synthesis of Natural Textures for 3-D Scenes.",
                    "Subactor Data Types as Hierarchical Procedural Models for Computer Animation.",
                    "An Improvement of the Ray-tracing Algorithm.",
                    "Determination of Local Coordinate Systems for Texture Synthesis on 3-D Surfaces.",
                    "PIPEMATIC: A Distributed System for the Design of Geometrically Tight Piping Structures.",
                    "Integrated Graphics Enivronment Eases Avionic Display Software Development.",
                    "Touchscreen and Computer Graphics in a Science Museum.",
                    "Graphics Programming for Knowledge-guided Interaction.",
                    "Hutwindows: An Approach to User Interface Development.",
                    "The Use of Graphical Symbolic Commands (Icons) in Application Programs.",
                    "An Illumination Model for Ray-tracing.",
                    "A CSG List Priority Hidden Surface Algorithm."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "5th Eurographics 1984",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1984",
                "sub_name": "5th European Computer Graphics Conference and Exhibition, Eurographics 1984, Copenhagen, Denmark, September 12-14, 1984, Proceedings.",
                "count": 35,
                "papers": [
                    "How Intelligent Can Business Graphics Software Be?",
                    "Computer Graphics Production as a Business.",
                    "An Approach to the Design of Hardware Curve Generators for Graphic Displays.",
                    "Bilevel Display Screen Presentation of Text, Graphics and Images for Page Make-up Work.",
                    "A Two-dimensional Clipping Divider.",
                    "Computer Graphics for Visualizing Simulation Results.",
                    "Graphical Support in a User Interface Management System.",
                    "Steps to Effective Business Graphics.",
                    "Drawing of an Unusual Kind of Diagrams - Nomogram Drawing.",
                    "Generating High Quality Pictures by Ray-tracing.",
                    "Numerical Simulation and Video Display of Dynamic Problems.",
                    "Steps to Effective Business Graphics.",
                    "SUDS - SUrface Description System.",
                    "Experiences with New Image Component Algorithms.",
                    "Shaping the Future a Systems Approach to MIS Planning.",
                    "User Interface: Concepts and Specifications.",
                    "The Design of a User Interface for a CAM Application.",
                    "Interactive Editing of Polygons.",
                    "The Development of Computer Graphics Curricula for Design Education.",
                    "Two Display Algorithms for Octtrees.",
                    "Quadtree Scan Conversion.",
                    "Direct CADD Drawing - A Flexible Screen Oriented User Interface to CADD.",
                    "Improving Computer Graphics Tools for Architects.",
                    "The Computer Graphics Scene in the United States.",
                    "Three-Dimensional Data Input by Selection of Hierarchically Defined Blocks.",
                    "TWIXT: A 3D Animation System.",
                    "A Paint Program for the Graphic Arts in Printing.",
                    "An Analytical Visibility Method for Displaying Parametrically Defined Surfaces.",
                    "A New Display File Structure for Line and Surface Presentations.",
                    "Application of Computer-generated Animation in European Space Research.",
                    "A Computer Graphic Approach to Lateral Skull Cephalostat Radiograph Analysis for Orthodontic Diagnosis and Treatment Planning.",
                    "Cadastral Mapping Pilot Project.",
                    "Ray Tracing Objects Defined by Sweeping a Sphere.",
                    "Conventional Elements of Engineering Drawings - Free Form Curves.",
                    "Computer-aided Three-dimensional Reconstruction from Serial Sections: A Software Package for Reconstruction and Selective Image Generation for Complex Topologies."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "4th Eurographics 1983",
        "info": "Zagreb, Yugoslavia",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1983",
                "sub_name": "4th European Computer Graphics Conference and Exhibition, Eurographics 1983, Zagreb, Yugoslavia, August 31 - September 2, 1983, Proceedings.",
                "count": 30,
                "papers": [
                    "A Delaunay-Based Method for Surface Approximation.",
                    "DisArray: A 16x16 RasterOp Processor.",
                    "Fast Access to Archival Information Stored on Optical Memory Discs.",
                    "An Intelligent Graphics Terminal's Intermediate Database.",
                    "On Didactic Implications in the Teaching of Applied Mathematics from a Coupling of Interactive Graphics and Waves.",
                    "CAD in the Design of Railway-Highway Intersection Safety Equipment and Railway Station Safety Equipment.",
                    "Decision Support Systems - The Significance of Hybrid Communication Facilities for Operations Research Consultancy.",
                    "Visualizing Inversions in Time with Computer Graphics.",
                    "XGKS - A Multitask Implementation of GKS.",
                    "Computer Graphic Presentation of Road Data.",
                    "Towards GKS Binding to PASCAL.",
                    "Fast Previewing Techniques in Raster Graphics.",
                    "GKS-300 - PASCAL Implementation of the Graphical Kernel System (GKS) on a Minicomputer Based Graphical Workstation.",
                    "Interactive Graphical Planning.",
                    "Inverse Perspective Mapping in Scanline Order onto Non-Planar Quadrilaterals.",
                    "Depth Sorting by Windowing.",
                    "Principal Patches - A New Class of Surface Patch Based on Differential Geometry.",
                    "A Geometric Data Manager.",
                    "Solid Modeling with Parametric Surfaces.",
                    "Contribution to Methodic in CAD.",
                    "Syntactic Methods in Computer Graphics.",
                    "Non-Rectangular Surface Patches Suitable for Inclusion in a B-Spline Surface.",
                    "Photogrammetric Stereocompilation Supported by Interactive Computer Graphics (Abstract).",
                    "Closed 2D Contour Algorithms for 3D Reconstruction.",
                    "On Developing a GKS Driver Architecture for Raster Workstations.",
                    "The GHOST-80 Colour Raster Extensions.",
                    "Refinement of the Stress Contour Plots by the Local Interpolations, Extrapolations ans Averaging.",
                    "High Level Language Support for 3-Dimensional Graphics.",
                    "Standard Graphics as a Geometric Modelling Device.",
                    "A High Level Interface to the Graphical Kernel System - GKS."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "3rd Eurographics 1982",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1982",
                "sub_name": "3rd European Computer Graphics Conference and Exhibition, Eurographics 1982, Manchester, UK, September 8-10, 1982, Proceedings.",
                "count": 33,
                "papers": [
                    "ALITE - An Engineering Tool for Automatic Chip Design.",
                    "CGM-Concepts and their Realization.",
                    "GRAPH: An Interactive Program Based on the Graphical Kernel System.",
                    "Analysis of the Design Process as Basis for the Definition of CAD-functions Distributed on Hierarchical Networks.",
                    "On Constructing Interactive Graphics Systems.",
                    "Computer Representation of Deaf Sign Language.",
                    "Computer Graphics in Interactive Discrete-event Simulation.",
                    "Computer-aided Design System for Three-dimensional Shape Plane Figures Shoe Making Application.",
                    "Graphic Displays in the Computer Aided Design of Lift Systems.",
                    "A Computer Graphics Package for Teaching Crystal Morphology.",
                    "A Methodology for Populating Default Color Maps.",
                    "Sammie: 3-D Graphics for Human Factors Applications.",
                    "The Effectiveness of High-level Graphical Languages in Dealing with Various Graphical Domains.",
                    "GKS in C.",
                    "VISTA: Visual Impact Simulation Technical Aid.",
                    "CHITRA - a Low Cost 2-D Graphics Package for the Design of Discrete Systems.",
                    "Perspective Mapping of Planar Textures.",
                    "Interactive Graphics in the Analysis of Public Utility Networks.",
                    "Generating and Printing of High Quality Documents in a Distributed Office Automation Network Environment.",
                    "The Application of Data Compression Techniques to Computer Graphics.",
                    "Computer Graphics for the Remote-sensing of the Ocean Surface by a High-resolution Radar.",
                    "A Package for Processing Remote Sensing Data Interactively on a Mini-computer System.",
                    "The Importance of a Correct Approach to the Design of Metafiles Standards.",
                    "Whatever Happened to Computer Art?",
                    "Attribute Handling in GKS.",
                    "Computer Graphics for Regional Planning: Monitoring Woodland Resources by a Land Information System.",
                    "A Practical Strategy for Certifying GKS Implementations.",
                    "A Semantic View on Geometric Representation of Urban Land Information.",
                    "The Representation and Use of Multivariate Information in Graphic Form.",
                    "Measures of Operator S Visual Accommodation and Convergence to Information Displays.",
                    "Interactive Generation of 3-dimensional Computer Graphics.",
                    "A Bifocal Display Technique for Data Presentation.",
                    "A Fast Algorithm for Colour Region Segmentation."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "2nd Eurographics 1981",
        "info": "Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1981",
                "sub_name": "2nd European Computer Graphics Conference and Exhibition, Eurographics 1981, Darmstadt, Germany, September 9-11, 1981, Proceedings.",
                "count": 30,
                "papers": [
                    "Application of GINO-F to Use Display File Techniques on Raster Scan Displays.",
                    "Computer Graphics for Federal Planning in West-Germany.",
                    "Capitol: A Low Cost 3-D Modelling and Visualization System for Interior Designers and Architects.",
                    "Town Planning Aided by an Integrated Municipal Land Information System.",
                    "Experiences in the Design and Support of a Graphics Device Driver Interface.",
                    "Extracting Line Maps from Images.",
                    "Telidon: Where Videotex Meets Computer Graphics.",
                    "SGL Application - Definition and Practical Use.",
                    "Computer Aided Design Language 'CADLAN'.",
                    "User Guidance in Interactive Systems - The Role of Graphical Features.",
                    "The Geometric Workbench (GWB) - An Experimental Geometric Modeling System.",
                    "Fast Interactive Graphic Analysis and Presentation of Irregularly Spaced Data z(x, y).",
                    "Some Useful but Rather Unusual Graphical Primitives.",
                    "Voice Recognition in a Graphic System.",
                    "The Use of Standard Graphics Software in the Starlink Image Processing Facility.",
                    "A GKS Interface to a Realtime Oriented Raster Workstation for CAD Applications.",
                    "The High-level Graphics Programming Language PASCAL/Graph.",
                    "Smoothing a Digitized Curve by Data Reduction Methods.",
                    "Automatic Generation of a Cubic B-Spline Representation for a General Digitized Curve.",
                    "A New Method for Local Smooth Interpolation.",
                    "Time and Space Bounds for Hidden Line and Hidden Surface Algorithms.",
                    "MOVIE.BYU - 1981.",
                    "State of the Art in Computer Graphics: A SIGGRAPH Perspective.",
                    "An Approach to a Calculation-minimized Hidden Line Algorithm.",
                    "A Revolution in Hardware Systems Design and Its Implications for the Graphics Community.",
                    "The Impact of Computer Graphics on Industrial Product Development.",
                    "Graphics Standards - Where Are We?",
                    "A GKS Implementation for Meteorological Applications.",
                    "A Hardware Approach to the Core System of ACM/SIGGRAPH.",
                    "Abstract Data Type Based Programming Style and Computer Graphics."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "1st Eurographics 1980",
        "info": "Geneva, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/eurographics/1980",
                "sub_name": "1st European Computer Graphics Conference and Exhibition, Eurographics 1980, Geneva, Switzerland, September 3-5, 1980, Proceedings.",
                "count": 29,
                "papers": [
                    "Computer Graphics in Multiple Microprocessor System.",
                    "F.I.R.S.T., A High Resolution Raster Scan Display System for Interactive Layout of Text and Figures.",
                    "Computrol in Flight Simulation.",
                    "A TV Graphics Display for the Man-Machine Interface.",
                    "Fast Colour Raster Graphics using an array Processor.",
                    "Easy to Use Graph Drawing Procedures in ALGOL 68.",
                    "Geographic Information Systems and the Odyssey Project.",
                    "Applications of an Interactive Vector Graphics System to Chemistry.",
                    "C. G .A. L.",
                    "Draw - A Graphical Program with the Ability to Draw Chemical Formulae.",
                    "Computer Graphics and Architecture.",
                    "Modelling and Display Concepts in a High-level Graphics Programming Language.",
                    "Interactive Computer Graphics in Computer-aided Decision Analysis.",
                    "A CAD-System for Interactive Graphical Handling of Hierarchical Block Diagram Information.",
                    "Computer Graphics Applied to Human Motion Analysis and Body Force Evaluation.",
                    "The GHOST-80 Interactive Metafile.",
                    "Optimized Software Distribution in Satellite Graphics Systems.",
                    "Image Modeling Aspects of Non-procedural Parallel Processing Language.",
                    "ALGRA, an Algebraic-graphic Programming Language for Modelling.",
                    "The Design of a General-purpose Command Interpreter for Graphical Man-machine Communication to Be Built on Top of a GKS.",
                    "SGL - A General Purpose Interactive System Built on Top of a GKS Implementation.",
                    "Trial-and-error Applications for Interactive Data Representation.",
                    "Considerations on Extensions of Input Functions Based on a Graphical Kernel System.",
                    "Surface Fitting by Means of Splines.",
                    "Generation of Complex 3D Finite Element Meshes on Turnkey Graphic Systems.",
                    "A Low-Cost, Interactive 2D Graphics Package.",
                    "KISS - An Experiment in the Design of Image Synthesis Systems.",
                    "Graphical Presentation for Data Analysis in Particle Physics Experiments: The HBOOK/HPLOT Package.",
                    "Towards the Integrated Interactive System."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "Eurographics 1979",
        "info": "Bologna, Italy",
        "venues": []
    }
]