[
    {
        "name": "GM",
        "year": "2022",
        "info": "2022: Volumes\n119,",
        "count": 4,
        "papers": [
            "Graph-PBN: Graph-based parallel branch network for efficient point cloud learning.",
            "Multi-scale and multi-level shape descriptor learning via a hybrid fusion network.",
            "Authoring multi-style terrain with global-to-local control.",
            "An Approach to Preprocess and Cluster a BRDF Database."
        ]
    },
    {
        "name": "GM",
        "year": "2021",
        "info": "2021: Volumes\n113,\n114,\n115,\n116,\n117,\n118",
        "count": 19,
        "papers": [
            "Bas-relief generation from point clouds based on normal space compression with real-time adjustment on CPU.",
            "Hybrid function representation for heterogeneous objects.",
            "Normal manipulation for bas-relief modeling.",
            "Orthogonality of isometries in the conformal model of the 3D space.",
            "Learning 3D face reconstruction from a single sketch.",
            "Landmark Detection and 3D Face Reconstruction for Caricature using a Nonlinear Parametric Model.",
            "Heterogeneous porous scaffold generation using trivariate B-spline solids and triply periodic minimal surfaces.",
            "Learning a shared deformation space for efficient design-preserving garment transfer.",
            "BPA-GAN: Human motion transfer using body-part-aware generative adversarial networks.",
            "Geometry-Based Layout Generation with Hyper-Relations AMONG Objects.",
            "VGF-Net: Visual-Geometric fusion learning for simultaneous drone navigation and height mapping.",
            "Adaptive geometric sound propagation based on A-weighting variance measure.",
            "Combining convex hull and directed graph for fast and accurate ellipse detection.",
            "Visually smooth multi-UAV formation transformation.",
            "Scale-Adaptive ICP.",
            "Single Image Tree Reconstruction via Adversarial Network.",
            "TopoKnit: A Process-Oriented Representation for Modeling the Topology of Yarns in Weft-Knitted Textiles.",
            "An optimal triangle projector with prescribed area and orientation, application to position-based dynamics.",
            "Wrinkle and curl distortion of leaves using plant dynamic."
        ]
    },
    {
        "name": "GM",
        "year": "2020",
        "info": "2020: Volumes\n107,\n108,\n109,\n110,\n111,\n112",
        "count": 29,
        "papers": [
            "Large-scale distributed semantic augmented reality services - A performance evaluation.",
            "Composing customized web 3D animations with semantic queries.",
            "Quasiconformal rectilinear map.",
            "Sketching Manipulators for Localized Blendshape Editing.",
            "Robust dimensionality reduction for data visualization with deep neural networks.",
            "Dynamic particle partitioning SPH model for high-speed fluids simulation.",
            "Proximity-aware multiple meshes decimation using quadric error metric.",
            "Morphological evaluation of closed planar curves and its application to aesthetic evaluation.",
            "A discrete projection analogue to Pick's theorem.",
            "Mapping two-dimensional plots to a spherical surface using elliptical grid mapping.",
            "Barycentric convolution surfaces based on general planar polygon skeletons.",
            "Skeletal saliency map computation based on projection symmetry analysis.",
            "Automatic 3D tooth segmentation using convolutional neural networks in harmonic parameter space.",
            "A dynamic and adaptive scheme for feature-preserving mesh denoising.",
            "Full-body motion capture for multiple closely interacting persons.",
            "Human-centric metrics for indoor scene assessment and synthesis.",
            "A recommendation dashboard utilising micro-filter visualisations: An evaluation and investigation of applicability on mobile devices.",
            "Defeating lag in network-distributed physics simulations.",
            "WallNet: Reconstructing General Room Layouts from RGB Images.",
            "Real-time hair simulation with heptadiagonal decomposition on mass spring system.",
            "DeepPipes: Learning 3D pipelines reconstruction from point clouds.",
            "A review on crowd simulation and modeling.",
            "Cumuliform cloud formation control using parameter-predicting convolutional neural network.",
            "Parallel hybrid mesh adaptation by refinement and coarsening.",
            "A rasterized ray-tracer pipeline for real-time, multi-device sonar simulation.",
            "Novel hierarchical strategies for SPH-centric algorithms on GPGPU.",
            "Stabilized blendshape editing using localized Jacobian transpose descent.",
            "Surface-based computation of the Euler characteristic in the cubical grid.",
            "Quasi-area functional for the Plateau-Bézier problem."
        ]
    },
    {
        "name": "GM",
        "year": "2019",
        "info": "2019: Volumes\n101,\n102,\n103,\n104,\n105,\n106",
        "count": 36,
        "papers": [
            "Hybrid 4D cardiovascular modeling based on patient-specific clinical images for real-time PCI surgery simulation.",
            "Generation of a tree-like support structure for fused deposition modelling based on the L-system and an octree.",
            "Feature-convinced mesh denoising.",
            "An improved skinning algorithm for circles and spheres providing smooth transitions.",
            "An emotion based simulation framework for complex evacuation scenarios.",
            "Portrait relief generation from 3D Object.",
            "Graph visual rhythms in temporal network analyses.",
            "Using curvature bounds towards collision free 5-axis tool-paths.",
            "Computing discrete Morse complexes from simplicial complexes.",
            "Noisy gradient meshes: Augmenting gradient meshes with procedural noise.",
            "Spline bas-relief modeling from sketches by isogeometric analysis approach.",
            "Curve and surface fitting based on the nonhomogeneous linear differential system.",
            "Layered leaf texturing using structure-guided model.",
            "Liquid-solid interaction sound synthesis.",
            "3D model retrieval and pose estimation for indoor images by simulating scene context.",
            "Supine to prone colon registration and visualization based on optimal mass transport.",
            "Additive depth maps, a compact approach for shape completion of single view depth maps.",
            "Deep point-based scene labeling with depth mapping and geometric patch feature encoding.",
            "Efficient and realistic character animation through analytical physics-based skin deformation.",
            "Near support-free multi-directional 3D printing via global-optimal decomposition.",
            "Concepts and techniques for web-based visualization and processing of massive 3D point clouds with semantics.",
            "Data-driven weight optimization for real-time mesh deformation.",
            "Learning semantic abstraction of shape via 3D region of interest.",
            "3D skeleton transfer for meshes and clouds.",
            "Service-oriented semantic enrichment of indoor point clouds using octree-based multiview classification.",
            "RELIGHT: A compact and accurate RTI representation for the web.",
            "Corrigendum to \"Bases and dimensions of C1-smooth isogeometric splines on volumetric two-patch domains\" [Graphical Models, 99 (2018), 46-56].",
            "Semantic based autoencoder-attention 3D reconstruction network.",
            "A greedy region growing algorithm for anisotropic stretch adaptive triangulation of geometry images.",
            "A non-stationary Catmull-Clark subdivision scheme with shape control.",
            "An overview of generalization techniques for street networks.",
            "Real-virtual consistent traffic flow interaction.",
            "Surfaces of revolution with moving axes and angles.",
            "Techniques for improved CityGML models.",
            "de Boor-like evaluation algorithm for Analysis-suitable T-splines.",
            "A subdivision scheme for unstructured quadrilateral meshes with improved convergence rate for isogeometric analysis."
        ]
    },
    {
        "name": "GM",
        "year": "2018",
        "info": "2018: Volumes\n95,\n96,\n97,\n98,\n99,\n100,",
        "count": 31,
        "papers": [
            "Spherical Laguerre Voronoi diagram approximation to tessellations without generators.",
            "Pore-scale flow simulation in anisotropic porous material via fluid-structure coupling.",
            "Editorial for Special issue on \"Massive 3D Urban Models\".",
            "Large-eddy simulations of pedestrian-level ventilation for assessing a satellite-based approach to urban geometry generation.",
            "Skyline-based geometric simplification for urban solar analysis.",
            "3D mesh segmentation via multi-branch 1D convolutional neural networks.",
            "A shape sampling technique via particle tracing for CAD models.",
            "Image-guided 3D model labeling via multiview alignment.",
            "A retroreflective BRDF model based on prismatic sheeting and microfacet theory.",
            "Efficient non-incremental constructive solid geometry evaluation for triangular meshes.",
            "An evaluation of canonical forms for non-rigid 3D shape retrieval.",
            "Intrinsic parameterization and registration of graph constrained surfaces.",
            "de Boor-suitable (DS) T-splines.",
            "Computing medial axis transformations of 2D point clouds.",
            "Terrain rendering with unlimited detail and resolution.",
            "Stress-oriented structural optimization for frame structures.",
            "Biharmonic deformation transfer with automatic key point selection.",
            "Generating sparse self-supporting wireframe models for 3D printing using mesh simplification.",
            "Data acquisition and simulation of dynamic flame with temperature distribution.",
            "Class-sensitive shape dissimilarity metric.",
            "A new mesh visual quality metric using saliency weighting-based pooling strategy.",
            "Accurate and reliable extraction of surfaces from image data using a multi-dimensional uncertainty model.",
            "A salience measure for 3D shape decomposition and sub-parts classification.",
            "Combining GPU-generated linear trajectory segments to create collision-free paths for real-time ambient crowds.",
            "Bases and dimensions of C1-smooth isogeometric splines on volumetric two-patch domains.",
            "Revolution mapping with bump mapping support.",
            "Geometry-based distortion measures for space deformation.",
            "FoldedGI: A highly parallel algorithm for interference detection by folding a geometry image into a 1D buffer.",
            "A description of the diamond grid for topological and combinatorial analysis.",
            "Hexagonal pyramid algorithm over a triangular domain.",
            "Efficient voxelization using projected optimal scanline."
        ]
    },
    {
        "name": "GM",
        "year": "2017",
        "info": "2017: Volumes\n89,\n90,\n91,\n92,\n93,\n94",
        "count": 20,
        "papers": [
            "ε-Guarantee of a covering of 2D domains using random-looking curves.",
            "Accumulative categorization: Online 3D shape classification for progressive collections.",
            "Registration of multiview point clouds for application to ship fabrication.",
            "Robust surface registration using optimal mass transport and Teichmüller mapping.",
            "Computing urban radiation: A sparse matrix approach.",
            "Editorial Special issue on the fifth Computational Visual Media conference (CVM 2017).",
            "Rigidity controllable as-rigid-as-possible shape deformation.",
            "A fast propagation scheme for approximate geodesic paths.",
            "Minkowski sum computation of B-spline surfaces.",
            "ExploreTree: Interactive tree modeling in semantic trait space with online intent learning.",
            "Topology based 2D engineering drawing and 3D model matching for process plant.",
            "Extract feature curves on noisy triangular meshes.",
            "Analysis of symmetry groups of box-splines for evaluation on GPUs.",
            "Optimizing layout using spatial quality metrics and user preferences.",
            "Detail-preserving level set surface editing and geometric texture transfer.",
            "An algorithm for the rapid generation of bas-reliefs based on point clouds.",
            "An efficient heat-based model for solid-liquid-gas phase transition and dynamic interaction.",
            "Scene reconstruction and analysis from motion.",
            "A non-stationary subdivision scheme for the construction of deformable models with sphere-like topology.",
            "Compactly-supported smooth interpolators for shape modeling with varying resolution."
        ]
    },
    {
        "name": "GM",
        "year": "2016",
        "info": "2016: Volumes\n83,\n84,\n85,\n86,\n87,\n88",
        "count": 25,
        "papers": [
            "Efficient 3D reflection symmetry detection: A view-based approach.",
            "Beyond symmetry groups: A grouping study on Escher's Euclidean ornaments.",
            "Exploration of multi-material surfaces as weighted shapes.",
            "Interactive cutaways of oil reservoirs.",
            "Fast computation of optimal polygonal approximations of digital planar closed curves.",
            "Fast exact shortest distance queries for massive point clouds.",
            "Extracting feature lines from point clouds based on smooth shrink and iterative thinning.",
            "Natural lines inspired 3D shape re-design.",
            "Symmetrization of facade layouts.",
            "Upright orientation of 3D shapes with Convolutional Networks.",
            "Building binary orientation octree for an arbitrary scattered point set.",
            "Skeleton-guided 3D shape distance field metamorphosis.",
            "Structure guided interior scene synthesis via graph matching.",
            "Extraction of cylinders and cones from minimal point sets.",
            "Multiresolution on spherical curves.",
            "Recognizing projections of algebraic curves.",
            "A combinatorial coordinate system for the body-centered cubic grid.",
            "Algebraic surfaces invariant under scissor shears.",
            "Multiresolution and fast decompression for optimal web-based rendering.",
            "Segmenting a surface mesh into pants using Morse theory.",
            "Preface of the special issue advances in Web3D.",
            "Customization of 3D content with semantic meta-scenes.",
            "Lightweighting for Web3D visualization of large-scale BIM scenes in real-time.",
            "GPU-based remote visualization of dynamic molecular data on the web.",
            "Web3D graphics enabled through sensor networks for cost-effective assessment and management of energy efficiency in buildings."
        ]
    },
    {
        "name": "GM",
        "year": "2015",
        "info": "2015: Volumes\n77,\n78,\n79,\n80,\n81,\n82",
        "count": 30,
        "papers": [
            "Finite element based tracking of deforming surfaces.",
            "Point-augmented biquadratic C1 subdivision surfaces.",
            "Simple and branched skins of systems of circles and convex shapes.",
            "Reducing numerical dissipation in smoke simulation.",
            "Microfacet-based interference simulation for multilayer films.",
            "Balanced multiresolution for symmetric/antisymmetric filters.",
            "An efficient volumetric method for non-rigid registration.",
            "Stretch-minimising stream surfaces.",
            "Motion reconstruction using very few accelerometers and ground contacts.",
            "Color adjustment in image-based texture maps.",
            "Isthmus based parallel and symmetric 3D thinning algorithms.",
            "Interactive design and simulation of tubular supporting structure.",
            "A fast algebraic non-penetration filter for continuous collision detection.",
            "A new optimization approach for mass-spring models parameterization.",
            "Quaternion rational surfaces: Rational surfaces generated from the quaternion product of two rational space curves.",
            "Geometry of 3D MAT and its application to moulding surfaces.",
            "A two-stage approach to align two surfaces of deformable objects.",
            "An iterative predictor-corrector approach for modeling static and kinetic friction in interactive simulations.",
            "Special Issue of selected papers from the 2014 Dagstuhl seminar on Geometric Modeling.",
            "Applying geometric constraints for perfecting CAD models in reverse engineering.",
            "The LIR space partitioning system applied to the Stokes equations.",
            "Smooth convolution-based distance functions.",
            "The metric of colour space.",
            "Improved shape for multi-surface blends.",
            "Geometric operations using sparse interpolation matrices.",
            "Representation of Dupin cyclides using quaternions.",
            "Gaussian curvature using fundamental forms for binary voxel data.",
            "Biharmonic fields and mesh completion.",
            "A new basis for PHT-splines.",
            "Survey on sparsity in geometric modeling and processing."
        ]
    },
    {
        "name": "GM",
        "year": "2014",
        "info": "Volume 76: 2014",
        "count": 58,
        "papers": [
            "Optimal crowd editing.",
            "Fast adaptive blue noise on polygonal surfaces.",
            "C2 interpolation of spatial data subject to arc-length constraints using Pythagorean-hodograph quintic splines.",
            "Equiareal parameterizations of NURBS surfaces.",
            "Deformation similarity measurement in quasi-conformal shape space.",
            "A low-dimensional representation for robust partial isometric correspondences computation.",
            "An effective quad-dominant meshing method for unorganized point clouds.",
            "Visualization of graphical data in a user-specified 2D space using a weighted Isomap method.",
            "Preface.",
            "Perception-based model simplification for motion blur rendering.",
            "A new sketch-based 3D model retrieval approach by using global and local features.",
            "Region-based bas-relief generation from a single image.",
            "Content-aware texture mapping.",
            "A bag of words approach to subject specific 3D human pose interaction classification with random decision forests.",
            "Real-time facial animation on mobile devices.",
            "A new lossless orthogonal simplification method for 3D objects based on bounding structures.",
            "Use of non-photorealistic rendering and photometric stereo in making bas-reliefs from photographs.",
            "A double layer method for constructing signed distance fields from triangle meshes.",
            "Differential geometry properties of lines of curvature of parametric surfaces and their visualization.",
            "Preface.",
            "Creases and boundary conditions for subdivision curves.",
            "Computing a compact spline representation of the medial axis transform of a 2D shape.",
            "Curvature-based blending of closed planar curves.",
            "Adaptive CAD model (re-)construction with THB-splines.",
            "Hierarchical B-splines on regular triangular partitions.",
            "Line accessibility of free form surfaces.",
            "Self-intersections of rational Bézier curves.",
            "The unified discrete surface Ricci flow.",
            "Improved, feature-centric EMD for 3D surface modeling and processing.",
            "Mesh resizing based on hierarchical saliency detection.",
            "A model synthesis method based on single building facade.",
            "Creature grammar for creative modeling of 3D monsters.",
            "Zometool shape approximation.",
            "3D ear recognition using local salience and principal manifold.",
            "Multi-scale geometric detail enhancement for time-varying surfaces.",
            "Isogeometric segmentation. Part II: On the segmentability of contractible solids with non-convex edges.",
            "Spectral 3D mesh segmentation with a novel single segmentation field.",
            "As-rigid-as-possible spherical parametrization.",
            "Anisotropic surface meshing with conformal embedding.",
            "A graph-based optimization algorithm for fragmented image reassembly.",
            "Swendsen-Wang Cuts sampling for spatially constrained Dirichlet process mixture models.",
            "A global energy optimization framework for 2.1D sketch extraction from monocular images.",
            "Approximation by piecewise polynomials on Voronoi tessellation.",
            "Automatic registration of vestibular systems with exact landmark correspondence.",
            "Globally consistent rigid registration.",
            "Deformable registration using patch-wise shape matching.",
            "Continuous collision detection for composite quadric models.",
            "Precise continuous contact motion for planar freeform geometric curves.",
            "Out-of-core adaptive iso-surface extraction from binary volume data.",
            "Improved pruning of large data sets for the minimum enclosing ball problem.",
            "Skeleton-enhanced line drawings for 3D models.",
            "Total curvature variation fairing for medial axis regularization.",
            "Automatic labelling of anatomical landmarks on 3D body scans.",
            "Direct repair of self-intersecting meshes.",
            "Flexible G1 interpolation of quad meshes.",
            "Hierarchical Laplacian-based compression of triangle meshes.",
            "Structure-aligned guidance estimation in surface parameterization using eigenfunction-based cross field.",
            "From 2D to 2.5D i.e. from painting to tactile model."
        ]
    },
    {
        "name": "GM",
        "year": "2013",
        "info": "Volume 75: 2013",
        "count": 29,
        "papers": [
            "Real-time bas-relief generation from a 3D mesh.",
            "Segmentation of temporal mesh sequences into rigidly moving components.",
            "Feature-preserving surface mesh smoothing via suboptimal Delaunay triangulation.",
            "Modeling perspective projections in 3-dimensions by rotations in 4-dimensions.",
            "Geometrically exact physics-based modeling and computer animation of highly flexible 1D mechanical systems.",
            "PDQ: Parallel Distance Queries for deformable meshes.",
            "Generalization of the incenter subdivision scheme.",
            "GPU isosurface raycasting of FCC datasets.",
            "Preface of special issue on computational visual media.",
            "Efficient synthesis of gradient solid textures.",
            "Complete residential urban area reconstruction from dense aerial LiDAR point clouds.",
            "Octree-based fusion for realtime 3D reconstruction.",
            "Curve skeleton extraction by coupled graph contraction and surface clustering.",
            "Compact combinatorial maps: A volume mesh data structure.",
            "Multiscale 3D feature extraction and matching with an application to 3D face recognition.",
            "Skeleton-based intrinsic symmetry detection on point clouds.",
            "Skeletal representations of orthogonal shapes.",
            "Artistic minimal rendering with lines and blocks.",
            "n-Dimensional multiresolution representation of subdivision meshes with arbitrary topology.",
            "A new interpolation subdivision scheme for triangle/quad mesh.",
            "Mesh saliency with global rarity.",
            "Geometry curves: A compact representation for 3D shapes.",
            "Robust diameter-based thickness estimation of 3D objects.",
            "Line-based sunken relief generation from a 3D mesh.",
            "Video-based personalized traffic learning.",
            "A comprehensive geometrical optics application for wave rendering.",
            "Reconstructing whole-body motions with wrist trajectories.",
            "Splat-based surface reconstruction from defect-laden point sets.",
            "Discrete bending forces and their Jacobians."
        ]
    },
    {
        "name": "GM",
        "year": "2012",
        "info": "Volume 74: 2012",
        "count": 36,
        "papers": [
            "Convolution surfaces based on polygons for infinite and compact support kernels.",
            "Sorting unorganized photo sets for urban reconstruction.",
            "G1 rational blend interpolatory schemes: A comparative study.",
            "CartoonModes: Cartoon stylization of video objects through modal analysis.",
            "Efficient algorithms for boundary extraction of 2D and 3D orthogonal pseudomanifolds.",
            "Preface.",
            "Adaptive tetrahedral remeshing for modified solid models.",
            "Efficient and robust 3D line drawings using difference-of-Gaussian.",
            "Unsupervised upright orientation of man-made models.",
            "Robust curve skeleton extraction for vascular structures.",
            "Discrete heat kernel determines discrete Riemannian metric.",
            "Surface mesh denoising with normal tensor framework.",
            "Fragmented skull modeling using heat kernels.",
            "Constructing common base domain by cues from Voronoi diagram.",
            "Motion-based mesh segmentation using augmented silhouettes.",
            "Empirical mode decomposition on surfaces.",
            "Visible neighborhood graph of point clouds.",
            "Multi-scale tensor voting for feature extraction from unstructured point clouds.",
            "An intrinsic algorithm for computing geodesic distance fields on triangle meshes with holes.",
            "Continuous and discrete Mexican hat wavelet transforms on manifolds.",
            "Vertex location optimisation for improved remeshing.",
            "3D molecular assembling of B-DNA sequences using nucleotides as building blocks.",
            "Computing the Hausdorff distance between NURBS surfaces using numerical iteration on the GPU.",
            "Detailed traffic animation for urban road networks.",
            "Computing polygonal path simplification under area measures.",
            "Special Issue of selected papers from the 8th Dagstuhl seminar on Geometric Modeling.",
            "Sketch-based mesh cutting: A comparative study.",
            "Example-guided segmentation.",
            "Transfinite surface interpolation with interior control.",
            "Notes on the curvature tensor.",
            "Formulas and algorithms for quantum differentiation of quantum Bernstein bases and quantum Bézier curves based on quantum blossoming.",
            "Sharp feature preserving MLS surface reconstruction based on local feature line approximations.",
            "Agnostic G1 Gregory surfaces.",
            "Free-form splines combining NURBS and basic shapes.",
            "H2 regularity properties of singular parameterizations in isogeometric analysis.",
            "Corrigendum to \"Continuous and discrete Mexican hat wavelet transforms on manifolds\" [Graphical Models 74 (2012) 221-232]."
        ]
    },
    {
        "name": "GM",
        "year": "2011",
        "info": "Volume 73: 2011",
        "count": 28,
        "papers": [
            "Characterizations of simple points, simple edges and simple cliques of digital spaces: One method of topology-preserving transformations of digital spaces by deleting simple points and edges.",
            "Robust mesh editing using Laplacian coordinates.",
            "Understanding quaternions.",
            "Spiral fat arcs - Bounding regions with cubic convergence.",
            "Sketch guided solid texturing.",
            "Structure grid for directional stippling.",
            "Blending multiple parametric normal ringed surfaces using implicit functional splines and auxiliary spheres.",
            "Sketch-based warping of RGBN images.",
            "Multiresolution image registration based on tree data structures.",
            "Quality mesh smoothing via local surface fitting and optimum projection.",
            "An animation bilateral filter for slow-in and slow-out effects.",
            "Graph-based representations of point clouds.",
            "Procedural function-based modelling of volumetric microstructures.",
            "Tetra-trees properties in graphic interaction.",
            "Smooth reverse Loop and Catmull-Clark subdivision.",
            "Optimised mesh traversal for dynamic mesh compression.",
            "A robust and rotationally invariant local surface descriptor with applications to non-local mesh processing.",
            "FABRIK: A fast, iterative solver for the Inverse Kinematics problem.",
            "Dimension-independent simplification and refinement of Morse complexes.",
            "Rational G2 splines.",
            "A connected-component-labeling-based approach to virtual porosimetry.",
            "Computational modeling of objects represented in images.",
            "Surface-based analysis methods for high-resolution functional magnetic resonance imaging.",
            "Connected distance-based rasterization of objects in arbitrary dimension.",
            "Thinning combined with iteration-by-iteration smoothing for 3D binary images.",
            "Decomposition of nD-rotations: Classification, properties and algorithm.",
            "Generalized Perpendicular Bisector and exhaustive discrete circle recognition.",
            "Direction-dependency of binary tomographic reconstruction algorithms."
        ]
    },
    {
        "name": "GM",
        "year": "2010",
        "info": "Volume 72: 2010",
        "count": 7,
        "papers": [
            "GMOD: Creation, processing, animation, visualization, and dissemination of GRAPHICAL MODELS.",
            "Hyperbolic polynomial uniform B-spline curves and surfaces with shape parameter.",
            "MCCD: Multi-core collision detection between deformable models using front-based decomposition.",
            "Temporally coherent video matting.",
            "Sparse grid distance transforms.",
            "Projection of curves on B-spline surfaces using quadratic reparameterization.",
            "Determination of elasticity parameters in lumped element (mass-spring) models of deformable objects."
        ]
    },
    {
        "name": "GM",
        "year": "2009",
        "info": "Volume 71: 2009",
        "count": 21,
        "papers": [
            "PlantGL: A Python-based geometric library for 3D plant modelling at different scales.",
            "Three-dimensional point cloud recognition via distributions of geometric distances.",
            "SMI 2008 Special Issue.",
            "Noise analysis and synthesis for 3D laser depth scanners.",
            "Harmonic 1-form based skeleton extraction from examples.",
            "Alignment of 3D models.",
            "A 3D face matching framework for facial curves.",
            "OCTOR: Subset selection in recursive pattern hierarchies.",
            "Computing the minimum distance between a point and a clamped B-spline surface.",
            "A framework for dynamic implicit curve approximation by an irregular discrete approach.",
            "Symposium on Computer Animation 2008.",
            "Visual simulation of shockwaves.",
            "Achieving good connectivity in motion graphs.",
            "Flexible simulation of deformable models using discontinuous Galerkin FEM.",
            "A line-space analysis of light-field representations.",
            "Rendering continuous level-of-detail meshes by Masking Strips.",
            "SCA 2006 Symposium.",
            "Generating surface crack patterns.",
            "Splitting meshless deforming objects with explicit surface tracking.",
            "Detail-preserving fluid control.",
            "Simulation of bubbles."
        ]
    },
    {
        "name": "GM",
        "year": "2008",
        "info": "Volume 70: 2008",
        "count": 11,
        "papers": [
            "Painterly animation using motion maps.",
            "Topological simplification of isosurfaces in volumetric data using octrees.",
            "Interaction of two-phase flow with animated models.",
            "Efficient texture synthesis using strict Wang Tiles.",
            "Inside looking out camera pose estimation for virtual studio.",
            "Polynomial splines over hierarchical T-meshes.",
            "Full-body performance animation with Sequential Inverse Kinematics.",
            "Stable and controllable noise.",
            "Simulation of atmospheric binary mixtures based on two-fluid model.",
            "Interactive classification for pre-integrated volume rendering of high-precision volume data.",
            "Shape from silhouettes based on a centripetal pentahedron model."
        ]
    },
    {
        "name": "GM",
        "year": "2007",
        "info": "Volume 69: 2007",
        "count": 16,
        "papers": [
            "Manifold-based approach to semi-regular remeshing.",
            "Finite volume flow simulations on arbitrary domains.",
            "Constructing a 3D trunk model from two images.",
            "Videoshop: A new framework for spatio-temporal video editing in gradient domain.",
            "Physically based rigging for deformable characters.",
            "A performance-based technique for timing keyframe animations.",
            "Facial motion cloning with radial basis functions in MPEG-4 FBA.",
            "Families of cut-graphs for bordered meshes with arbitrary genus.",
            "Contour-based surface reconstruction using MPU implicit models.",
            "Meshless geometric subdivision.",
            "Minkowski sum boundary surfaces of 3D-objects.",
            "Conservative occlusion culling for urban visualization using a slice-wise data structure.",
            "Data perturbation for fewer triangles in marching tetrahedra.",
            "An art-directed wrinkle system for CG character clothing and skin.",
            "A system for the capture and synthesis of insect motion.",
            "Autonomous pedestrians."
        ]
    },
    {
        "name": "GM",
        "year": "2006",
        "info": "Volume 68: 2006",
        "count": 33,
        "papers": [
            "Special issue: Shape Modeling International 2004.",
            "Sweepers: Swept deformation defined by gesture.",
            "Sparse surface reconstruction with adaptive partition of unity and radial basis functions.",
            "Reconstructing multi-scale variational partition of unity implicit surfaces with attributes.",
            "The HybridTree: Mixing skeletal implicit surfaces, triangle meshes, and point sets in a free-form modeling system.",
            "Tetrahedral and hexahedral invertible finite elements.",
            "Autonomous behaviors for interactive vehicle animations.",
            "Breathe easy: Model and control of human respiration for computer animation.",
            "Methods for exploring expressive stance.",
            "Precomputing avatar behavior from human motion data.",
            "Interactive motion deformation with prioritized constraints.",
            "Momentum-based parameterization of dynamic character motion.",
            "Animal gaits from video: Comparative studies.",
            "Special issue on SPM 05.",
            "Manifold splines.",
            "A composite approach to meshing scattered data.",
            "Poisson shape interpolation.",
            "Visual reconstruction of ground plane obstacles in a sparse view robot environment.",
            "Stick textures for image-based rendering.",
            "Skeleton based solid representation with topology preservation.",
            "Special Issue: PG2004.",
            "Swirling-sweepers: Constant-volume modeling.",
            "Modeling hairy plants.",
            "Accurate Minkowski sum approximation of polyhedral models.",
            "Rotation of 3D volumes by Fourier-interpolated shears.",
            "Vertex-transformation streams.",
            "The ModelCamera.",
            "Video motion analysis for the synthesis of dynamic cues and Futurist art.",
            "SVD-matching using SIFT features.",
            "Refraction in volume graphics.",
            "Retrieval of trademark images by means of size functions.",
            "Learnt inverse kinematics for animation synthesis.",
            "Adaptive grid optical tomography."
        ]
    },
    {
        "name": "GM",
        "year": "2005",
        "info": "Volume 67: 2005",
        "count": 30,
        "papers": [
            "Acquiring and validating motion qualities from live limb gestures.",
            "An optimization algorithm for free-form surface partitioning based on weighted gaussian image.",
            "Dynamic PDE-based surface design using geometric and physical constraints.",
            "Extending cubic uniform B-splines by unified trigonometric and hyperbolic basis.",
            "Algorithms for optimal partial matching of free-form objects with scaling effects.",
            "Camera field rendering for static and dynamic scenes.",
            "SMI 2003 special issue.",
            "3D scattered data interpolation and approximation with multilevel compactly supported RBFs.",
            "A framework for modeling, animating, and morphing textured implicit models.",
            "Generalized filleting and blending operations toward functional and decorative applications.",
            "Centroidal Voronoi diagrams for isotropic surface remeshing.",
            "3D acquisition of mirroring objects using striped patterns.",
            "A new characterization of simple elements in a tetrahedral mesh.",
            "Mason: morphological simplification.",
            "The \"lambda-medial axis\".",
            "Three-dimensional shape rendering from multiple images.",
            "DigitalSculpture: a subdivision-based approach to interactive implicit surface modeling.",
            "Solid Modeling Theory and Applications.",
            "Accuracy and semantics in shape-interrogation applications.",
            "A condition for isotopic approximation.",
            "Provably good sampling and meshing of surfaces.",
            "Optimization methods for scattered data approximation with subdivision surfaces.",
            "Special Issue: Vision, Video and Graphics 2003.",
            "3D S.O.M. - A commercial software solution to 3D scanning.",
            "Extending natural textures with multi-scale synthesis.",
            "Estimating the surface radiance function from single images.",
            "Rendering cartoon-style motion cues in post-production video.",
            "A vision-based postproduction tool for footage logging, analysis, and annotation.",
            "Elimination of artifacts due to occlusion and discretization problems in image space blurring techniques.",
            "Virtual view synthesis of people from multiple view video sequences."
        ]
    },
    {
        "name": "GM",
        "year": "2004",
        "info": "Volume 66: 2004",
        "count": 22,
        "papers": [
            "An example-based approach to human body manipulation.",
            "Topological volume skeletonization and its application to transfer function design.",
            "Interpolating scattered data using 2D self-organizing feature maps.",
            "A color model for rendering linear passive graphic 2D objects.",
            "Modelling tree structures using a single polygonal mesh.",
            "Skeleton-driven 2D distance field metamorphosis using intrinsic shape parameters.",
            "Rasterizing complex polygons without tessellations.",
            "Approximate distance fields with non-vanishing gradients.",
            "A unified approach for fairing arbitrary polygonal meshes.",
            "A subdivision-based deformable model for surface reconstruction of unknown topology.",
            "Representation and coding of light field data.",
            "Digital Intersections: minimal carrier, connectivity, and periodicity properties.",
            "Contour interpolation by straight skeletons.",
            "Corrigendum to \"Skeleton-driven 2D distance field metamorphosis using intrinsic shape parameters.",
            "Virtual hairy brush for painterly rendering.",
            "Quadric decomposition for computing the intersections of surfaces of revolution.",
            "Pacific Graphics 2003.",
            "Combining 3D flow fields with silhouette-based human motion capture for immersive video.",
            "Interactive global and local deformations for virtual clay.",
            "Efficient representation and extraction of 2-manifold isosurfaces using kd-trees.",
            "A state machine for real-time cutting of tetrahedral meshes.",
            "A painting interface for interactive surface deformations."
        ]
    },
    {
        "name": "GM",
        "year": "2003",
        "info": "Volume 65: 2003",
        "count": 25,
        "papers": [
            "10th International Conference on Discrete Geometry for Computer Imagery: Discrete topology and geometry for image and object representation.",
            "Decomposing non-manifold objects in arbitrary dimensions.",
            "Receptive fields within the Combinatorial Pyramid framework.",
            "Closed curves in n-dimensional discrete space.",
            "A linear incremental algorithm for naive and standard digital lines and planes recognition.",
            "Discretization in 2D and 3D orders.",
            "Discrete linear objects in dimension n: the standard model.",
            "Minimal non-simple sets in 4D binary images.",
            "Topological quadrangulations of closed triangulated surfaces using the Reeb graph.",
            "Split-and-merge algorithms defined on topological maps for 3D image segmentation.",
            "Special issue on Pacific Graphics 2002.",
            "A simple layered RGB BRDF model.",
            "Estimation of multiple directional light sources for synthesis of augmented reality images.",
            "Learning kernel-based HMMs for dynamic sequence synthesis.",
            "Robust acquisition of 3D informations from short image sequences.",
            "Compressing hexahedral volume meshes.",
            "Special Issue on the International Conference of Shape Modeling (SMI) 2002.",
            "A mapping-independent primitive for the triangulation of parametric surfaces.",
            "Skinning 3D meshes.",
            "A minimal and complete set of operators for the development of robust manifold mesh modelers.",
            "Non-linear anisotropic elasticity for real-time surgery simulation.",
            "Deterministic and stochastic state model of right generalized cylinder (RGC-sm): application in computer phantoms synthesis.",
            "Perturbing Bézier coefficients for best constrained degree reduction in the L2-norm.",
            "Computing the Minkowski sum of ruled surfaces.",
            "Facial motion cloning."
        ]
    },
    {
        "name": "GM",
        "year": "2002",
        "info": "Volume 64: 2002",
        "count": 22,
        "papers": [
            "Scattered Data Interpolation Using Data Dependant Optimization Techniques.",
            "Estimating Parameters for Procedural Texturing by Genetic Algorithms.",
            "Capturing the Complexity of Hair Motion.",
            "Special Issue on the Ninth Pacific Graphics Conference (PG 2001).",
            "Sharp Features on Multiresolution Subdivision Surfaces.",
            "Direct Reconstruction of a Displaced Subdivision Surface from Unorganized Points.",
            "Dual Mesh Resampling.",
            "Compressing the Property Mapping of Polygon Meshes.",
            "Minimizing the Distortion of Affine Spline Motions.",
            "Special Issue on Processing of Large Polygonal Meshes.",
            "Near-Optimal Connectivity Encoding of 2-Manifold Polygon Meshes.",
            "A Novel Volume Constrained Smoothing Method for Meshes.",
            "Piecewise Regular Meshes: Construction and Compression.",
            "Normal Vector Voting: Crease Detection and Curvature Estimation on Large, Noisy Meshes.",
            "Mesh Optimization Using Global Error with Application to Geometry Simplification.",
            "Fuzzy-connected 3D image segmentation at interactive speeds.",
            "Enhanced lane: interactive image segmentation by incremental path map construction.",
            "A dynamic method for dominant point detection.",
            "Surface construction by fitting unorganized curves.",
            "Computing quadric surface intersections based on an analysis of plane cubic curves.",
            "The µ-basis of a planar rational curve - properties and computation.",
            "Exact rotation-minimizing frames for spatial Pythagorean-hodograph curves."
        ]
    },
    {
        "name": "GM",
        "year": "2001",
        "info": "Volume 63: 2001",
        "count": 26,
        "papers": [
            "Extending Superquadrics with Exponent Functions: Modeling and Reconstruction.",
            "Physics-Based Explosion Modeling.",
            "Layer-Based Morphing.",
            "The International Workshop on Human Modeling and Animation in Graphical Models.",
            "Natural Hairstyle Modeling and Animation.",
            "A Coordinate-Invariant Approach to Multiresolution Motion Analysis.",
            "Comparing Constraint-Based Motion Editing Methods.",
            "Spatial Filtering Using the Active-Space Indexing Method.",
            "The Convex Hull of Rational Plane Curves.",
            "Topological and Geometric Properties of Interval Solid Models.",
            "Boundary Representation Model Rectification.",
            "Curve Evaluation and Interrogation on Surfaces.",
            "Special Issue on Pacific Graphics 2000.",
            "Blending Quadric Surfaces with Piecewise Algebraic Surfaces.",
            "The Intersection of Two Ringed Surfaces and Some Related Problems.",
            "A Silhouette-Based Algorithm for Texture Registration and Stitching.",
            "Efficient Coding of Nontriangular Mesh Connectivity.",
            "The Effect of Noise on Camera Calibration Parameters.",
            "Indoor Scene Reconstruction from Sets of Noisy Range Images.",
            "Building Three Dimensional Head Models.",
            "Hyperbolic Hausdorff Distance for Medial Axis Transform.",
            "Special Issue on Volume Modeling.",
            "Novel Techniques for Robust Voxelization and Visualization of Implicit Surfaces.",
            "Constructive Hypervolume Modeling.",
            "Animating Volumetric Models.",
            "Resolution Adaptive Volume Sculpting."
        ]
    },
    {
        "name": "GM",
        "year": "2000",
        "info": "Volume 62: 2000",
        "count": 22,
        "papers": [
            "Special Issue for CGI '98.",
            "Hierarchical Solutions for the Deformable Surface Problem in Visualization.",
            "Incremental Polygonization of Implicit Surfaces.",
            "Fuzzy B-Splines: A Surface Model Encapsulating Uncertainty.",
            "Optimal Absorption Probabilities for Random Walk Radiosity.",
            "Topology Preservation Within Digital Surfaces.",
            "The Cluster Hair Model.",
            "3D Reconstruction of Vessel Lumen from Very Few Angiograms by Dynamic Contours Using a Stochastic Approach.",
            "Continuous Analogs of Digital Boundaries: A Topological Approach to Iso-Surfaces.",
            "Surface Reconstruction and Display from Range and Color Data.",
            "Geometric Properties of Bisector Surfaces.",
            "An Efficient Method for Computation of Legendre Moments.",
            "On Enhancing the Speed of Splatting Using Both Object- and Image-Space Coherence.",
            "Partitioning Trimmed Spline Surfaces into NonSelf-Occluding Regions for Visibility Computation.",
            "3D Volume Rotation Using Shear Transformations.",
            "Locating Human Faces in a Cluttered Scene.",
            "The Digital Topology of Sets of Convex Voxels.",
            "Real-Time Inverse Kinematics Techniques for Anthropomorphic Limbs.",
            "Special Issue on Pacific Graphics '99.",
            "Compression-Based 3D Texture Mapping for Real-Time Rendering.",
            "Injectivity Conditions of 2D and 3D Uniform Cubic B-Spline Functions.",
            "Reconstruction and Simplification of Surfaces from Contours."
        ]
    },
    {
        "name": "GM",
        "year": "1999",
        "info": "Volume 61: 1999",
        "count": 19,
        "papers": [
            "C-Bézier Curves and Surfaces.",
            "Euclidean Paths: A New Representation of Boundary of Discrete Regions.",
            "On the Multiscale Representation of 2D and 3D Shapes.",
            "Photogrammetric Texture Mapping onto Planar Polygons.",
            "Topologically Reliable Approximation of Trimmed Polynomial Surface Patches.",
            "On Surface Approximation Using Developable Surfaces.",
            "Shape Reconstruction from Contours Using Isotopic Deformation.",
            "Parameter-Controlled Volume Thinning.",
            "Approximating Curves via Alpha Shapes.",
            "Approximate Implicitization Using Monoid Curves and Surfaces.",
            "A Parallel 3D 12-Subiteration Thinning Algorithm.",
            "An Algebraic Solution to Surface Recovery from Cross-Sectional Contours.",
            "Further Five-Point Fit Ellipse Fitting.",
            "Processing Motion Capture Data to Achieve Positional Accuracy.",
            "Digital Approximation of Moments of Convex Regions.",
            "A Complexity Analysis for Directional Parametric Height Field Ray Tracing.",
            "Two-Dimensional Direction-Based Interpolation with Local Centered Moments.",
            "On Computing Contact Configurations of a Curved Chain.",
            "Unification of Distance and Volume Optimization in Surface Simplification."
        ]
    },
    {
        "name": "GM",
        "year": "1998",
        "info": "Volume 60: 1998",
        "count": 30,
        "papers": [
            "On Levels of Detail in Terrains.",
            "Region-Based Parametric Motion Segmentation Using Color Information.",
            "Topology-Preserving Deformations of Two-Valued Digital Pictures.",
            "Boundary Extraction from Gray-Scale Document Images Based on Surface Data Structures.",
            "Finitary 1-Simply Connected Digital Spaces.",
            "Maximum Segmented Image Information Thresholding.",
            "Torus/Sphere Intersection Based on a Configuration Space Approach.",
            "Cramer-Rao Lower Bounds for Curve Fitting.",
            "Foldover-Free Image Warping.",
            "Planar Shape Enhancement and Exaggeration.",
            "The Crust and the beta-Skeleton: Combinatorial Curve Reconstruction.",
            "Polynomial/Rational Approximation of Minkowski Sum Boundary Curves.",
            "Digital Elevation Model Data Analysis Using the Contact Surface Area.",
            "A Hierarchical Markov Modeling Approach for the Segmentation and Tracking of Deformable Shapes.",
            "Panoramic Stereo Imaging System with Automatic Disparity Warping and Seaming.",
            "Ellipse Fitting Using Orthogonal Hyperbolae and Stirling's Oval.",
            "Optimizing a Strip Separating Two Polygons.",
            "Approximating Polygonal Curves in Two and Three Dimensions.",
            "On the Relation between Second-Order Statistics, Connectivity Analysis, and Percolation Models in Digital Textures.",
            "User-Steered Image Segmentation Paradigms: Live Wire and Live Lane.",
            "Control of Polygonal Mesh Resolution for 3-D Computer Vision.",
            "A New Approach to the Visualization of Tensor Fields.",
            "Zeta: A Resolution Modeling System.",
            "Contour-Based Warping.",
            "Interactive Segmentation with Intelligent Scissors.",
            "Optimizing Edge Detectors for Robust Automatic Threshold Selection: Coping with Edge Curvature and Noise.",
            "Efficient and Accurate Collision Detection for Granular Flow Simulation.",
            "Local Topological Parameters in a Tetrahedral Representation.",
            "A General Coding Scheme for Families of Digital Curve Segments.",
            "Deformable Object Modeling Using the Time-Dependent Finite Element Method."
        ]
    },
    {
        "name": "GM",
        "year": "1997",
        "info": "Volume 59: 1997",
        "count": 40,
        "papers": [
            "An Efficient Topological Characterization of Gray-Levels Textures, Using a Multiresolution Representation.",
            "Bounds on the Moving Control Points of Hybrid Curves.",
            "Region-Based Coding of Color Images Using Karhunen-Loeve Transform.",
            "Line-Based Correction of Radial Lens Distortion.",
            "Adaptive Ordered Dither.",
            "Finding the Minimal Set of Maximum Disks for Binary Objects.",
            "Use of Neural Networks to Estimate the Number of Nodes of an Edge Quadtree.",
            "Space-Efficient Outlines from Image Data via Vertex Minimization and Grid Constraints.",
            "Three-Dimensional Rotations by Three Shears.",
            "Fast Computation of Three-Dimensional Geometric Moments Using a Discrete Divergence Theorem and a Generalization to Higher Dimensions.",
            "An Efficient Class of Alternating Sequential Filters in Morphology.",
            "A Performance Analysis of Fast Gabor Transform Methods.",
            "A Scalable and Adaptive Temporal Segmentation Algorithm for Video Coding.",
            "Detection of Small Local Intensity Changes in CCD Images with Nonuniform Illumination and Large Signal Dependent Noise.",
            "Texture Analysis for Enhanced Color Image Quantization.",
            "3D Well-Composed Pictures.",
            "An Approximate Maximum Likelihood Linear Estimator of Circle Parameters.",
            "A New Two Successive Process Image Compression Technique Using Subband Coding and JPEG Discrete Cosine Transform Coding.",
            "Image Coding throughDLattice Quantization of Wavelet Coefficients.",
            "Parameter Estimation in Hidden Fuzzy Markov Random Fields and Image Segmentation.",
            "Maximum-Likelihood Estimation for the Two-Dimensional Discrete Boolean Random Set and Function Models Using Multidimensional Linear Samples.",
            "Constructive Fitting and Extraction of Geometric Primitives.",
            "Directional Distance Transforms and Height Field Preprocessing for Efficient Ray Tracing.",
            "Combinatorics and Image Processing.",
            "Geometric Shock-Capturing ENO Schemes for Subpixel Interpolation, Computation and Curve Evolution.",
            "Discrete Analytical Hyperplanes.",
            "Identification of Blur Parameters from Motion Blurred Images.",
            "An Eigenspace Update Algorithm for Image Analysis.",
            "A Hierarchical Model for Multiresolution Surface Reconstruction.",
            "On Digital Mammogram Segmentation and Microcalcification Detection Using Multiresolution Wavelet Analysis.",
            "Intrinsic Scale Space for Images on Surfaces: The Geodesic Curvature Flow.",
            "Multidimensional Alignment Using the Euclidean Distance Transform.",
            "Adaptive Early Jump-Out Technique for Fast Motion Estimation in Video Coding.",
            "Visibility Computation on Reconfigurable Meshes.",
            "Contrast Enhancement via Image Evolution Flow.",
            "Geometric Shape Recognition of Freeform Curves and Surfaces.",
            "Nonparametric Estimation and Simulation of Two-Dimensional Gaussian Image Textures.",
            "Vector Field Analysis and Synthesis Using Three-Dimensional Phase Portraits.",
            "New Algorithm for Medial Axis Transform of Plane Domain.",
            "Segmentation of Planar Curves into Straight-Line Segments and Elliptical Arcs."
        ]
    },
    {
        "name": "GM",
        "year": "1996",
        "info": "Volume 58: 1996",
        "count": 46,
        "papers": [
            "A Computational Approach to Zero-Crossing-Based Two-Dimensional Edge Detection.",
            "A Hierarchical Markov Random Field Model and Multitemperature Annealing for Parallel Image Classification.",
            "Gridless Halftoning: A Reincarnation of the Old Method.",
            "Transfer Function Estimation, Film Fusion and Image Restoration.",
            "Pyramids That Bound Surface Patches.",
            "Cellular Automata for Elementary Image Enhancement.",
            "NOTE: Blind Restoration of Degraded Binary Markov Random Field Images.",
            "On Multi-Edge Detection.",
            "Automatic Image Annotation Using Adaptive Color Classification.",
            "Image Processing: Flows under Min/Max Curvature and Mean Curvature.",
            "Geometric Correction of Digitized Art.",
            "Sparse, Opaque Three-Dimensional Texture: 2a. Visibility.",
            "A Structural Model of Curve Deformation by Discontinuous Transformations.",
            "An Alternative Algorithm for Adaptive Histogram Equalization.",
            "Multidimensional Co-occurrence Matrices for Object Recognition and Matching.",
            "Wavelet Multiresolution Representation of Curves and Surfaces.",
            "Generalized Subdivision of Bézier Surfaces.",
            "Curve Fitting with Bézier Cubics.",
            "Tomographic Reconstruction of Polygons from Knot Location and Chord Length Measurements.",
            "Fuzzy Connectedness and Object Definition: Theory, Algorithms, and Applications in Image Segmentation.",
            "A New Approach to Through-the-Lens Camera Control.",
            "Augmenting Corner Descriptors.",
            "A Parametrization of Digital Planes by Least-Squares Fits and Generalizations.",
            "Directional Moving Averaging Interpolation for Texture Mapping.",
            "Generation of Shading-Off in Images by Extrapolation of Lipschitz Functions.",
            "On Synthesizing Discrete Fractional Brownian Motion with Applications to Image Processing.",
            "Jordan Graphs.",
            "Candidate Functions for a Parallel Multi-level Thresholding Technique.",
            "Connectivity Preservation of 3D 6-Subiteration Thinning Algorithms.",
            "The Cone of Vision: A New Technique for Interactive Volumetric Display.",
            "Gaussian Pyramid Wavelet Transform for Multiresolution Analysis of Images.",
            "SpotIt!An Interactive Identikit System.",
            "Why R.G.B.? Or How to Design Color Displays for Martians.",
            "Fractal Modeling of Natural Terrain: Analysis and Surface Reconstruction with Range Data.",
            "Reflectance Analysis for 3D Computer Graphics Model Generation.",
            "Unexpected Spatial Patterns in Exponential Family Auto Models.",
            "Chain Codes and Their Application in Curve Design.",
            "Realistic Animation of Liquids.",
            "Two-Stage Dynamic Deformation for Construction of 3D Models.",
            "Assessing Error of Fit Functions for Ellipses.",
            "The 3D Marching Lines Algorithm.",
            "Knowledge-Guided Segmentation of 3D Imagery.",
            "Arbitrary Topology Shape Reconstruction from Planar Cross Sections.",
            "Rational Ruled Surfaces and Their Offsets.",
            "Tracking Motion and Intensity Variations Using Hierarchical 2-D Mesh Modeling for Synthetic Object Transfiguration.",
            "Differential and Topological Properties of Medial Axis Transforms."
        ]
    },
    {
        "name": "GM",
        "year": "1995",
        "info": "Volume 57: 1995",
        "count": 44,
        "papers": [
            "Model-based morphology: the opening spectrum.",
            "A Boundary Approach for Fast Neighborhood Operations on Three-Dimensional Binary Data.",
            "Discrete Combinatorial Surfaces.",
            "Mean-Absolute-Error Representation and Optimization of Computational-Morphological Filters.",
            "Regularized Multichannel Restoration Using Cross-Validation.",
            "Geometric Algorithms for Detecting and Calculating All Conic Sections in the Intersection of Any 2 Natural Quadric Surfaces.",
            "Surface Approximation of a Cloud of 3D Points.",
            "An Alternative Form of the Lee Filter for Speckle Suppression in SAR Images.",
            "Algorithms for Intersecting Parametric and Algebraic Curves II: Multiple Intersections.",
            "Discrete Binomial Splines.",
            "Toward Interactive-Rate Simulation of Fluids with Moving Obstacles Using Navier-Stokes Equations.",
            "Image-Modeling Gibbs Priors.",
            "Degraded Gray-Scale Text Recognition Using Pseudo-2D Hidden Markov Models and N-Best Hypotheses.",
            "Dynamic Threshold Determination by Local and Global Edge Evaluation.",
            "Image Smoothing Using Parametric Relaxation.",
            "Efficient 2-D Convolution Algorithm with the Single-Data Multiple Kernel Approach.",
            "An Analysis of Image Interpolation, Differentiation, and Reduction Using Local Polynomial Fits.",
            "Entropic Thresholding Using a Block Source Model.",
            "Practical Synthesis of Accurate Fractal Images.",
            "Constructing Implicit Shape Models from Boundary Data.",
            "Multisensor Image Fusion Using the Wavelet Transform.",
            "Higher Order Derivatives of a Rational Bézier Curve.",
            "Adaptive Neighborhood Extended Contrast Enhancement and Its Modifications.",
            "A Dynamic Window-Based Runlength Coding Algorithm Applied to Gray-Level Images.",
            "Unified 3D Models for Multisensor Image Synthesis.",
            "Topology-Oriented Divide-and-Conquer Algorithm for Voronoi Diagrams.",
            "Building 3-D Models from Unregistered Range Images.",
            "Rational-Ruled Surfaces: Implicitization and Section Curves.",
            "Wavelet-Based Shape from Shading.",
            "CSG 96: Set-Theoretic Solid Modelling: Techniques and Applications.",
            "Estimating the Parameters of an Illumination Model Using Photometric Stereo.",
            "Adaptive Mixture Estimation and Unsupervised Local Bayesian Image Segmentation.",
            "Determination of the Orientation of 3D Objects Using Spherical Harmonics.",
            "Color Palette Restoratio.",
            "Multiresolution Support Applied to Image Filtering and Restoration.",
            "High-Resolution Histogram Modification of Color Images.",
            "Boundaries through Scattered Points of Unknown Density.",
            "Fundamentals of Surface Voxelization.",
            "Representing and Visualizing Fluid Flow Images and Velocimetry Data by Nonlinear Dynamical Systems.",
            "Salience Distance Transforms.",
            "Threshold Decomposition of Gray-Scale Soft Morphology into Binary Soft Morphology.",
            "Cramer-Rao Lower Bounds for Estimation of a Circular Arc Center and Its Radius.",
            "Improved Codebook Edge Detection.",
            "A Note on \"Building Skeleton Models via 3-D Medial Surface/Axis Thinning Algorithms\"."
        ]
    },
    {
        "name": "GM",
        "year": "1994",
        "info": "Volume 56: 1994",
        "count": 46,
        "papers": [
            "Compact Image Representation by Edge Primitives.",
            "On the Difference Method for Drawing Conic Arcs.",
            "On the Existence and the Coefficients of the Implicit Equation of Rational Surfaces.",
            "Optimum Edge Detection for Object-Background Picture.",
            "Algebraic Specification of a 3D-Modeler Based on Hypermaps.",
            "Robust Image Restoration Algorithm Using Markov Random Field Model.",
            "Image Models for 2-D Flow Visualization and Compression.",
            "Curve and Surface Generation and Refinement Based on a High Speed Derivative Algorithm.",
            "Efficient Algorithms for the Implementation of General B-Splines.",
            "Recursive Wavelet Transform for 2D Signals.",
            "A Deterministic Algorithm for Reconstructing Images with Interacting Discontinuities.",
            "Reconstructing Ellipsoids from Projections.",
            "Multiresolution Adaptive Image Smoothing.",
            "Nonorthogonal Image Expansion Related to Optimal Template Matching in Complex Images.",
            "Image Warping by Radial Basis Functions: Application to Facial Expressions.",
            "A Catalog of 1-D Features in Natural Images.",
            "Using Marching Cubes on Small Machines.",
            "5th Eurographics Workshop on Rendering.",
            "On the Detection of Robust Curves.",
            "Automatic Threshold Selection Using the Wavelet Transform.",
            "A Particle System Model for Combining Edge Information from Multiple Segmentation Modules.",
            "On Approximating Polygonal Curves in Two and Three Dimensions.",
            "Subset Warping: Rubber Sheeting with Cuts.",
            "A Quasi-mechanical Method for Solving the Rectangle Covering Problem An Approach to Tackling NP Hard Problems.",
            "Compression of Color Image via the Technique of Surface Fitting.",
            "Curve Fitting by a Sum of Gaussians.",
            "Computationally Efficient Algorithms for High-Dimensional Robust Estimators.",
            "Counting and Reporting Red/Blue Segment Intersections.",
            "Multidimensional Digital Boundaries.",
            "Processing of Off-Line Handwritten Text: Polygonal Approximation and Enforcement of Temporal Information.",
            "Resampling on a Pseudohexagonal Grid.",
            "An Improved Fast Algorithm for the Restoration of Images Based on Chain Codes Description.",
            "Identifying the Existence of Bar Codes in Compressed Images.",
            "A New Approach for Multilevel Threshold Selection.",
            "Reconstructing Binary Polygonal Objects from Projections: A Statistical View.",
            "Visible Light and X-Ray Ray Tracing of Generalized Cylinders.",
            "A Morphological Approach to Text String Extraction from Regular Periodic Overlapping Text/Background Images.",
            "Utilization of Information Measure as a Means of Image Thresholding.",
            "On the Scaling Heuristic for Reconstruction from Slices.",
            "Unbiased Least Squares Fitting of Circular Arcs.",
            "Novel Deconvolution of Noisy Gaussian Filters with a Modified Hermite Expansion.",
            "Estimation of Edge Parameters and Image Blur Using Polynomial Transforms.",
            "Building Skeleton Models via 3-D Medial Surface/Axis Thinning Algorithms.",
            "Estimating Band-to-Band Misregistrations in Aliased Imagery.",
            "Binarization and Multithresholding of Document Images Using Connectivity.",
            "A New Dynamic Approach for Finding the Contour of Bi-level Images."
        ]
    },
    {
        "name": "GM",
        "year": "1993",
        "info": "Volume 55: 1993",
        "count": 41,
        "papers": [
            "Gibbs Random Fields, Fuzzy Clustering, and the Unsupervised Segmentation of Textured Images.",
            "Holes and Genus of 2D and 3D Digital Images.",
            "Codebook Edge Detection.",
            "An Extension of Chaiken's Algorithm to B-Spline Curves with Knots in Geometric Progression.",
            "Local Image Reconstruction and Subpixel Restoration Algorithms.",
            "Detecting the Dominant Points by the Curvature-Based Polygonal Approximation.",
            "Quasi-circular Splines: A Shape-Preserving Approximation.",
            "Approximate General Sweep Boundary of a 2D Curved Object, .",
            "Bayesian Block-Wise Segmentation of Interframe Differences in Video Sequences.",
            "The Nonlinear Prefiltering and Difference of Estimates Approaches to Edge Detection: Applications of Stack Filters.",
            "Comment on \"Generation of Noise in Binary Images\".",
            "Line Detection in Noisy and Structured Backgrounds Using Græco-Latin Squares.",
            "Effective Detection of Digital Bar Segments with Hough Transform.",
            "A Parallel Algorithm for the Visibility of a Simple Polygon Using Scan Operations.",
            "Extraction of Binary Character/Graphics Images from Grayscale Document Images.",
            "Identifying High Level Features of Texture Perception.",
            "Signal Detection Theory Approach to the Multiple Parallel Moving Targets Problem.",
            "On the Uncertainty of Straight Lines in Digital Images.",
            "GLHS: A Generalized Lightness, Hue, and Saturation Color Model.",
            "Multiscale Representation and Matching of Curves Using Codons.",
            "Edge Characterization Using Normalized Edge Detector.",
            "Estimation of Noise in Images: An Evaluation.",
            "Erratum: Volume 55, Number 1 (1993) in the article \"An Extension of Chaiken's Algorithm to B-Spline Curves with Knots in Geometric Progression,\" by Ron Goldman and Joe Warren, pages 58-62.",
            "Radial Decomposition of Discs and Spheres.",
            "On 3-D Real-Time Perspective Generation from a Multiresolution Photo-Mosaic Data Base.",
            "Light-Source Modeling Using Pyramidal Light Maps.",
            "Resolution-First Scanning of Multidimensional Spaces.",
            "Homogeneity Testing for Unlabeled Data: A Performance Evaluation.",
            "Oriented Surfaces in Digital Spaces.",
            "An Optimal Algorithm for the Straight Segment Approximation of Digital Arcs.",
            "Deterministic Interactive Particle Models for Image Processing and Computer Graphics.",
            "Vegetation-Limited Ground-to-Air Surveillance.",
            "Image Encoding, Labeling, and Reconstruction from Differential Geometry.",
            "Contrast Enhancement Using the Laplacian-of-a-Gaussian Filter.",
            "Theory and Design of Local Interpolators.",
            "A Truncation Method for Computing Walsh Transforms with Applications to Image Processing.",
            "Efficient Stochastic Algorithms on Locally Bounded Image Space.",
            "Physically Based Modeling and Control of Turning.",
            "Approximation of Generalized Voronoi Diagrams by Ordinary Voronoi Diagrams.",
            "An Analysis of Histogram-Based Thresholding Algorithms.",
            "Skew Correction of Document Images Using Interline Cross-Correlation."
        ]
    },
    {
        "name": "GM",
        "year": "1992",
        "info": "Volume 54: 1992",
        "count": 47,
        "papers": [
            "A polygonal approach to hidden-line and hidden-surface elimination.",
            "An image enhancement technique and its evaluation through bimodality analysis.",
            "Edge evaluation using necessary components.",
            "A hierarchical spatial data structure for global geographic information systems.",
            "Image enhancement by intensity-dependent spread functions.",
            "Distance transforms: Properties and machine vision applications.",
            "The Interpolation-Based Bintree and encoding of binary images.",
            "Realistic 3D simulation of shapes and shadows for image processing.",
            "A simple and efficient algorithm for determining the symmetries of polyhedra.",
            "Defining and rendering of textured objects through the use of exponential functions.",
            "Reconstruction of a color image from nonuniformly distributed sparse and noisy data.",
            "An optimal linear operator for step edge detection.",
            "Performance evaluation of some noise reduction methods.",
            "Hierarchical triangulation using cartographic coherence.",
            "A justification of a fast surface tracking algorithm.",
            "A new image contrast enhancement technique based on a contrast discrimination model.",
            "Improved resolution from subpixel shifted pictures.",
            "Parameter estimation and restoration of noisy images using Gibbs distributions in hidden Markov models.",
            "Harmonic models of shape transformations in digital images and patterns.",
            "Texture modeling using Gibbs distributions.",
            "New algorithms for maximum entropy image restoration.",
            "Maximum likelihood unsupervised textured image segmentation.",
            "Methods for fast morphological image transforms using bitmapped binary images.",
            "Adaptive-neighborhood histogram equalization for image enhancement.",
            "Investigations of image contrast space defined by variations on histogram equalization.",
            "A nonlinear filter for film restoration and other problems in image processing.",
            "An on-line algorithm for constrained Delaunay triangulation.",
            "Pascal triangle transform approach to the calculation of 3D moments.",
            "Unsupervised segmentation of noisy and textured images using Markov random fields.",
            "Texture classification using the cortex transform.",
            "High-accuracy rotation of images.",
            "Estimation of quaternion parameters from two dimensional image moments.",
            "Even degree B-spline curves and surfaces : A note on the paper \"B-spline Curves and Surfaces Viewed as Digital Filters\" by A. Goshtasby, F. Cheng, and B. Barsky.",
            "A new three-dimensional connected components labeling algorithm with simultaneous object feature extraction capability.",
            "Texture classification using QMF bank-based subband decomposition.",
            "Parameter estimation and reconstruction of digital conics in normal positions.",
            "Registration of multimodality medical images using a region overlap criterion.",
            "Statistical feature matrix for texture analysis.",
            "Generating skeletons and centerlines from the distance transform.",
            "A survey of moment-based techniques for unoccluded object representation and recognition.",
            "On edge preservation in multiresolution images.",
            "Fast generation and display of iso-surface wireframes.",
            "Page segmentation and classification.",
            "Image contrast enhancement based on the intensities of edge pixels.",
            "Discrete multidimensional Jordan surfaces.",
            "A generalization of dynamic constraints.",
            "The vector distance transform in two and three dimensions."
        ]
    },
    {
        "name": "GM",
        "year": "1991",
        "info": "Volume 53: 1991",
        "count": 58,
        "papers": [
            "Expressive brush strokes.",
            "Fast direct display of volume data for medical diagnosis.",
            "A mathematical semantics of rendering : II. Approximation.",
            "Coverage masks and convolution tables for fast area sampling.",
            "Gray levels can improve the performance of binary image digitizers.",
            "Edge detection in multispectral images.",
            "Enhancement of low bit-rate coded images using edge detection and estimation.",
            "Hierarchical address vector quantization for image coding.",
            "Image gathering and digital restoration for fidelity and visual quality.",
            "Image restoration and enhancement of characters, using convex projection methods.",
            "The termination criterion for subdivision of the rational Bézier curves.",
            "A method for ray tracing a wide class of generalized cylinders with straight line trajectories.",
            "Comparative study of some statistical and set-theoretic methods for image restoration.",
            "An identification approach for 2-D autoregressive models in describing textures.",
            "Fitting polygonal functions to a set of points in the plane.",
            "Interpolation and approximation of curves and surfaces using Pólya polynomials.",
            "Representation of orthogonal regions by vertices.",
            "Computing oriented texture fields.",
            "Edge errors in inverse and Wiener filter restorations of motion-blurred images and their windowing treatment.",
            "Median-based zero-crossing edge detectors for closely spaced edges.",
            "A noise peak elimination filter.",
            "Antialiasing the Hough transform.",
            "Unified sun and sky illumination for shadows under trees.",
            "Improving resolution by image registration.",
            "Unilateral approximation of Gibbs random field images.",
            "Rule-based multitemplate edge detector.",
            "An optimal algorithm to translate a convex polyhedron through a two-dimensional convex window.",
            "Elastic matching of multimodality medical images.",
            "A fast and accurate erosion-dilation method suitable for microcomputers.",
            "Restoration of real-world motion-blurred images.",
            "Digital surfaces.",
            "An edge-based description of color images.",
            "An algorithmic comparison between square- and hexagonal-based grids.",
            "Adaptation of group algebras to signal and image processing.",
            "Multiresolution statistical analysis of computer-generated fractal imagery.",
            "PSF estimation for image deblurring.",
            "Pyramid computation of neighbor distance statistics in dot patterns.",
            "Reconstruction of 3D medical images: A nonlinear interpolation technique for reconstruction of 3D medical images.",
            "Spline models for boundary detection/description: Formulation and performance evaluation.",
            "Robust identification of motion and out-of-focus blur parameters from blurred and noisy images.",
            "Convex set reconstruction using prior shape information.",
            "Decomposition methods for convolution operators.",
            "A piecewise linear approximation method preserving visual feature points of original figures.",
            "Extraction of accurate stomach contours from X-ray images of barium-filled stomachs and its application to detect potential abnormalities.",
            "Split-and-merge image segmentation based on localized feature analysis and statistical tests.",
            "Generation of noise in binary images.",
            "New methods for restoring motion-blurred images derived from edge error considerations.",
            "Windowing techniques for image restoration.",
            "Modeling and synthesis of images of 3D textured surfaces.",
            "Skinning rational B-spline curves to construct an interpolatory surface.",
            "Winding and Euler numbers for 2D and 3D digital images.",
            "On gray scale image measurements : I. Arc length and area.",
            "On gray scale image measurements : II. Surface area and volume.",
            "Multiple-seed 3D connectivity filling for inaccurate borders.",
            "An improved method for computing gray-level cooccurrence matrix based texture measures.",
            "A VLSI implementation of parallel image reconstruction.",
            "Automatic threshold selection from a histogram using the \"exponential hull\".",
            "A cost-optimal parallel algorithm for B-spline surface fitting."
        ]
    },
    {
        "name": "GM",
        "year": "1990",
        "info": "1990: Volumes\n49, 50, 51, 52",
        "count": 87,
        "papers": [
            "A Solution of Polygon Containment, Spatial Planning, and Other Related Problems Using Minkowski Operations.",
            "A Peak Detection Algorithm and its Application to Histogram-Based Image Data Reduction.",
            "Texture Analysis and Discrimination in Additive Noise.",
            "Octree Generation from Object Silhouettes in Perspective Views.",
            "A Morphological Transformation for Sharpening Edges of Features Before Segmentation.",
            "Establishing Collision Zones for Obstacles Moving with Uncertainty.",
            "Efficient Histogramming on Hypercube SIMD Machines.",
            "The Analytic Structure of Image Flows: Deformation and Segmentation.",
            "Stabbing Parallel Segments with a Convex Polygon.",
            "A Function Space Model for Digital Image Sampling and Its Application in Image Reconstruction.",
            "Rotation Invariance in Gradient and Higher Order Derivative Detectors.",
            "Qualitative Depth from Stereo, with Applications.",
            "Use of Shadows for Extracting Buildings in Aerial Images.",
            "On Minimal Energy Trajectories.",
            "Image Algebra: An Overview.",
            "A Pyramid Algorithm for Fast Curve Extraction.",
            "Variable Pyramid Structures for Image Segmentation.",
            "Digital Squares.",
            "O(N) Computation of Projections and Moments from the Labeled Skeleton.",
            "Engineering Drawing Processing and Vectorization System.",
            "Algorithm for Finding the Center of Circular Fiducials.",
            "The Estimation of Geometry and Motion of a Surface from Image Sequences by Means of Linearization of a Parametric Model.",
            "Set Operations for Unaligned Linear Quadtrees.",
            "Efficient Algorithms for Obstacle Detection Using Range Data.",
            "Learning a Near-Optimal Estimator for Surface Shape from Shading.",
            "Algorithms and Architectures for a Class of Non-Linear Hybrid Filters.",
            "Orientation Estimation of 3D Surface Patches.",
            "A Method of General Moments for Orienting 2D Projections of Unknown 3D Objects.",
            "Deblurring digital images by means of polynomial transforms.",
            "3D Curved Object Recognition from Multiple 2D Camera Views.",
            "Image analysis and computer vision 1989.",
            "The algebraic basis of mathematical morphology. I Dilations and erosions.",
            "A fast algorithm for the restoration of images based on chain codes description and its applications.",
            "The analysis of morphological filters with multiple structuring elements.",
            "Bounds on time-to-collision and rotational component from first-order derivatives of image flow.",
            "Two methods of image extension.",
            "Contour codes of isothetic polygons.",
            "Calibration of a stereo system with small relative angles.",
            "Direct construction of the perspective projection aspect graph of convex polyhedra.",
            "Automatic fixing of ship position by simulation-and-matching.",
            "Grey level corner detection: A generalization and a robust real time implementation.",
            "Texture descriptors based on co-occurrence matrices.",
            "Simple connectivity is not locally computable for connected 3D images.",
            "A note on the coefficients of compass mask convolutions.",
            "Detecting runways in complex airport scenes.",
            "Dynamic strip algorithm in curve fitting.",
            "A structure feature for some image processing applications based on spiral functions.",
            "k × k thinning.",
            "Using probabilistic domain knowledge to reduce the expected computational cost of template matching.",
            "Object detection by step-wise analysis of spectral, spatial, and topographic features.",
            "Edge contours using multiple scales.",
            "Refining edges detected by a LoG operator.",
            "A semi-analytic method of determining stereo camera geometry from matched points in a pair of images: Coincident meridional planes, exact or noisy data.",
            "The arc tree: An approximation scheme to represent arbitrary curved shapes.",
            "Template quadtrees for representing region and line data present in binary images.",
            "Boundary and object labelling in three-dimensional images.",
            "A color clustering technique for image segmentation.",
            "Three-frame corner matching and moving object extraction in a sequence of images.",
            "Parallel shrinking algorithms using 2-subfield approaches.",
            "Polygonal representation: A maximum likelihood approach.",
            "Shape from texture using the Wigner distribution.",
            "Finding point correspondences and determining motion of a rigid object from two weak perspective views.",
            "Exploiting image-plane data in the interpretation of edge-based binocular disparity.",
            "Pyramidal algorithms for iconic indexing.",
            "A hierarchical approach to line extraction based on the Hough transform.",
            "Representation and recognition of surface shapes in range images: A differential geometry approach.",
            "Using feature probabilities to reduce the expected computational cost of template matching.",
            "3D symmetry-curvature duality theorems.",
            "A color clustering technique for image segmentation.",
            "A comparative performance study of several global thresholding techniques for segmentation.",
            "Parallel shrinking algorithms using 2-subfields approaches.",
            "Three-frame corner matching and moving object extraction in a sequence of images.",
            "Polygonal representation: A maximum likelihood approach.",
            "Shape from texture using the Wigner distribution.",
            "B-spline curves and surfaces viewed as digital filters.",
            "Automated stereophotogrammetry.",
            "Digitization of straight line segments closeness and convexity.",
            "Finding point correspondence and determining motion of a rigid object from two weak perspective views.",
            "On characterizing ribbons and finding skewed symmetries.",
            "Simultaneous fitting of several planes to point sets using neural networks.",
            "Vector field restoration by the method of convex projections.",
            "Hough transform and signal detection theory performance for images with additive noise.",
            "Systolic implementation of the adaptive solution to normal equations.",
            "On topology as applied to image analysis.",
            "Index-based object recognition in pictorial data management.",
            "Synchronous multiprocessor implementation of the Hough transform.",
            "Symbolic reasoning in object extraction."
        ]
    },
    {
        "name": "GM",
        "year": "1989",
        "info": "1989: Volumes\n45, 46, 47, 48",
        "count": 80,
        "papers": [
            "Detecting the straightness of digital curves in O(N) steps.",
            "A multiscale region detector.",
            "Fast segmentation of range imagery into planar regions.",
            "A note on graphics editing of curved line drawings.",
            "Zero crossings on lines of curvature.",
            "A framework for estimation of motion parameters from range images.",
            "A theorem to determine the spatial containment of a point in a planar polyhedron.",
            "Conic B-splines for curve fitting: A unifying approach.",
            "Large sample bias in least squares estimators of a circular arc center and its radius.",
            "Connected component labeling of binary images on a mesh connected massively parallel processor.",
            "Texture description and segmentation through fractal geometry.",
            "A nonlinear laplace operator as edge detector in noisy images.",
            "Fast surface tracking in three-dimensional binary images.",
            "Structured graph representation of a hierarchical triangulation.",
            "Motion detection in spatio-temporal space.",
            "Invariant pattern recognition using multiple filter image representations.",
            "Stochastic image pyramids.",
            "Binary image algebra and optical cellular logic processor design.",
            "Adaptive multiscale feature extraction from range data.",
            "On the intersection of a set of direction cones.",
            "A simple approach for the estimation of circular arc center and its radius.",
            "Linear octrees by volume intersection.",
            "Local matching of surfaces using a boundary-centered radial decomposition.",
            "Multiresolution elastic matching.",
            "The same-object problem for polyhedral solids.",
            "Automating knowledge acquisition for aerial image interpretation.",
            "A new method for image segmentation.",
            "The visual potential: One convex polygon.",
            "Multicriterion image reconstruction and implementation.",
            "Finite topology as applied to image analysis.",
            "Contrast enhancement technique based on local detection of edges.",
            "A simplification to linear two-view motion algorithms.",
            "Using symmetry for detecting and locating objects in a picture.",
            "Image analysis and computer vision: 1988.",
            "Comparison at high spatial frequencies of two-pass and one-pass geometric transformation algorithms.",
            "Fractal-based analysis and interpolation of 3D natural surface shapes and their application to terrain modeling.",
            "A direct method for locating the focus of expansion.",
            "Hough transform for line recognition: Complexity of evidence accumulation and cluster detection.",
            "Local and semi-local shape from shading for a single perspective image of a smooth object.",
            "Neighbor finding in images represented by octrees.",
            "Illumination independent change detection for real world image sequences.",
            "Characteristics of edNLC-graph grammar for syntactic pattern recognition.",
            "Automatic thresholding of gray-level pictures using two-dimensional entropy.",
            "An analytic solution for the perspective 4-point problem.",
            "The extraction of ordered vector drainage networks from elevation data.",
            "Graphical stability analysis for control systems with model parameter uncertainties.",
            "Automated registration of dissimilar images: Application to medical imagery.",
            "A comment on \"a note on 'distance transformations in digital images'\".",
            "Reconstructing an edge on a polyhedron using an optimization method.",
            "Convergence of iterated median rules.",
            "Epicardial surface estimation from coronary angiograms.",
            "The use of gray-level information and fitting techniques for precise measurement of corneal curvature and thickness.",
            "Reconstruction of the left ventricle from two orthogonal projections.",
            "Lookup table loadings for image processing with controlled knots.",
            "Shape matching using curvature processes.",
            "A systolic algorithm for extracting regions from a planar graph.",
            "The effect of spatial discretization on the magnitude and direction response of simple differential edge operators on a step edge.",
            "A new interpretation of the compass gradient edge operators.",
            "A syntactic/geometric approach to recognition of dimensions in engineering machine drawings.",
            "Improved initial approximation and intensity-guided discontinuity detection in visible-surface reconstruction.",
            "Classification of newspaper image blocks using texture analysis.",
            "Counting straight lines.",
            "Integration of synthetic surface relief in range images.",
            "Digital plane and grid point segments.",
            "Correction of image deformation from lens distortion using bezier patches.",
            "Unsupervised textured image segmentation using feature smoothing and probabilistic relaxation techniques.",
            "Expert systems for image processing: Knowledge-based composition of image analysis processes.",
            "Modelling sensors: Toward automatic generation of object recognition program.",
            "Three-dimensional boundary following.",
            "Automatic recognition and representation of shape-based features in a geometric modeling system.",
            "A new surface interpolation technique for reconstructing 3D objects from serial cross-sections.",
            "The laplacian-of-gaussian kernel: A formal analysis and design procedure for fast, accurate convolution and full-frame output.",
            "Representation, display, and manipulation of 3D digital scenes and their medical applications.",
            "A unified approach for image segmentation using exact statistics.",
            "Optimal corner detector.",
            "An architecture independent programming language for low-level vision.",
            "Machine-independent image processing: Performance of apply on diverse architectures.",
            "A mathematical semantics of rendering I: ideal rendering.",
            "Extraction of early perceptual structure in dot patterns: Integrating region, boundary, and component gestalt.",
            "Digital topology: Introduction and survey."
        ]
    },
    {
        "name": "GM",
        "year": "1988",
        "info": "1988: Volumes\n41, 42, 43, 44",
        "count": 92,
        "papers": [
            "Moment-preserving sharpening - A new approach to digital picture deblurring.",
            "Constraints on length and angle.",
            "A simple method for computing general position in displaying three-dimensional objects.",
            "Wavelength selection for synthetic image generation.",
            "3D shape representation by contours.",
            "Restoration of binary images using contour direction chain codes description.",
            "A tape format for transferral of image data and source programs.",
            "A new chain-coding algorithm for binary images using run-length codes.",
            "Detecting buildings in aerial images.",
            "A new stereo vision model based upon the binocular fusion concept.",
            "Speeding up the Marr-Hildreth edge operator.",
            "Core zone scatterplots: A new approach to feature extraction for visual displays.",
            "Line rasterization algorithms that satisfy the subset line property.",
            "A note on histogram equalization for optimal intensity range utilization.",
            "A survey of thresholding techniques.",
            "Topologically invariant texture descriptors.",
            "Efficient axis-translation of binary digital pictures by blocks in linear quadtree representation.",
            "Hough transform algorithms for mesh-connected SIMD parallel processors.",
            "Approximation of displacement fields using wavefront region growing.",
            "Parallel computation of geometric properties from the medial axis transform.",
            "Some algorithms for approximating convolutions.",
            "Automated visual inspection: 1981 to 1987.",
            "Digital halftoning : Robert Ulichney.",
            "Processor arrays: Architecture and applications : Terry Fountain.",
            "The grammar of dimensions in machine drawings.",
            "Transform-coding of images with reduced complexity.",
            "A framework for surface reconstruction from 3D contours.",
            "Reed-muller transform image coding.",
            "Local shape from specularity.",
            "Control point transforms for shape representation and measurement.",
            "Some location problems for robot navigation using a single camera.",
            "The twisted cubic and camera calibration.",
            "A normalized clutter measure for images.",
            "Analyzing orthographic projection of multiple 3D velocity vector fields in optical flow.",
            "Parsing scale-space and spatial stability analysis.",
            "3D reconstruction: The registration problem.",
            "A practical approach to image restoration for computer vision.",
            "Image analysis and computer vision: 1987.",
            "Region filling with the use of the discrete green theorem.",
            "Three-dimensional space from optical flow correspondence.",
            "Feature identification for hybrid structural/statistical pattern classification.",
            "A simplified linear optic flow-motion algorithm.",
            "Shape from random planar features.",
            "Parallel processing of regions represented by linear quadtrees.",
            "Comments on fingerprints of two-dimensional edge models.",
            "A histogram modification unit for real-time image enhancement.",
            "A syntactic/Semantic technique for surface reconstruction from cross-sectional contours.",
            "A texture information-directed region growing algorithm for image segmentation and region classification.",
            "A contour detection algorithm based on the minimum radial inertia (MRI) criterion.",
            "Estimation of rigid body motion using straight line correspondences.",
            "A line-integration based method for depth recovery from surface normals.",
            "Picture generation and developmental matrix systems.",
            "Gray level requantization.",
            "A note on \"distance transformations in digital images\".",
            "PLANG based specification of patterns with variations for pictorial data bases.",
            "A dual plane variation of the Hough transform for detecting non-concentric circles of different radii.",
            "Bright-spot detection in pyramids.",
            "Investigations of multigrid algorithms for the estimation of optical flow fields in image sequences.",
            "A VLSI architecture for computing scale space.",
            "Digital geometry may not be discrete.",
            "Performance of the hough transform and its relationship to statistical signal detection theory.",
            "Parallel computation of image curve velocity fields.",
            "A new algorithm for extracting the interior of bounded regions based on chain coding.",
            "A structural analysis of visual form on packaging graphics and its use in an automated design system.",
            "The shape of SAR histograms.",
            "Advanced graphics for visualization of shielding relations.",
            "Discrimination vision.",
            "Statistical theory of edge detection.",
            "Trends in astronomical image processing.",
            "Finding local maxima in a pseudo-Euclidian distance transform.",
            "A note on \"distance transformations in arbitrary dimensions\".",
            "Matching straight lines.",
            "A survey of construction and manipulation of octrees.",
            "Shape reconstruction from planar cross sections.",
            "Restoration of blurred TV picture caused by uniform linear motion.",
            "A linear algorithm for motion estimation using straight line correspondences.",
            "Recognition and positioning of three-dimensional objects by combining matchings of primitive local patterns.",
            "Split-and-merge segmentation of aerial photographs.",
            "A survey of the hough transform.",
            "A topology-based component extractor for understanding electronic circuit diagrams.",
            "On shape from shading.",
            "The existence of geometrical density-image transformations corresponding to object motion.",
            "Heuristics for intermediate level road finding algorithms.",
            "Hyperquadrics: Smoothly deformable shapes with convex polyhedral bounds.",
            "Image enhancement using sliding histograms.",
            "A mathematical model for shape description using Minkowski operators.",
            "Surface reconstruction of 3D objects in computerized tomography.",
            "Multilevel thresholding using edge matching.",
            "Multiobject pattern recognition and detection in noisy backgrounds using a hierarchical approach.",
            "Robustness of image pyramids under structural perturbations.",
            "A sequential adaptive recursive filter for image restoration.",
            "Hierarchical edge detection."
        ]
    },
    {
        "name": "GM",
        "year": "1987",
        "info": "1987: Volumes\n37, 38, 40",
        "count": 54,
        "papers": [
            "Preface.",
            "Contingent aftereffects and isoluminance: Psychophysical evidence for separation of color, orientation, and motion.",
            "Nested structures of control: An intuitive view.",
            "A massively parallel architecture for a self-organizing neural pattern recognition machine.",
            "Neural dynamics of surface perception: Boundary webs, illuminants, and shape-from-shading.",
            "Reconstructing the third dimension: Interactions between color, texture, motion, binocular disparity, and shape.",
            "From orientation selection to optical flow.",
            "Machines should not see as people do, but must know how people see.",
            "Detecting structure by symbolic constructions on tokens.",
            "Selection of image primitives for general-purpose visual processing.",
            "Spatial frequency channels and perceptual grouping in texture segregation.",
            "Double-step incremental generation of lines and circles.",
            "3D objects recognition by optimal matching search of multinary relations graphs.",
            "Analyzing oriented patterns.",
            "A comparison of methods and computation for multi-resolution low- and band-pass transforms for image processing.",
            "Optimal quadtree construction algorithms.",
            "A simple approach to the problem of 3-D reconstruction.",
            "Theoretical assessments of mean square errors of antialiasing filters.",
            "An object centered hierarchical representation for 3D objects: The prism tree.",
            "Derivation of optical flow using a spatiotemporal-Frequency approach.",
            "Deblurring Gaussian blur.",
            "Oblique sampling of projections for direct three-dimensional reconstruction.",
            "Exploiting reflectance properties to analyze images of moving objects needs local constraints.",
            "Data dependent filters for edge enhancement of Landsat images.",
            "Structure and motion from optical flow under perspective projection.",
            "Picture Processing: 1986.",
            "Fast binary-image boundary extraction.",
            "Planar decomposition for quadtree data structure.",
            "A dynamic screen technique for shaded graphics display of slice-represented objects.",
            "Hough space transformations for discrimination and distortion estimation.",
            "Estimation of a circular arc center and its radius.",
            "Symmetry-curvature duality.",
            "Quantitative evaluation of similar images with quasi-gray levels.",
            "Generating octree models of 3D objects from their silhouettes in a sequence of images.",
            "A one-pass thinning algorithm and its parallel implementation.",
            "Transparent object extraction from regular textured backgrounds by using binary parallel operations.",
            "A parallel image segmentation algorithm using relaxation with varying neighborhoods and its mapping to array processors.",
            "Edgel aggregation and edge description.",
            "Line detection in digital pictures: A hypothesis prediction/verification paradigm.",
            "Computing the Euler characteristic and related additive functionals of digital objects from their bintree representation.",
            "Algorithms and hardware for efficient image smoothing.",
            "Object detection and experimental designs.",
            "Line connectivity algorithms for an asynchronous pyramid computer.",
            "New algorithms for special cases of the hidden line elimination problem.",
            "Transform amplitude sharpening: A new method of image enhancement.",
            "A surface specific-line tracking and slope recognition algorithm.",
            "Rough approximation of shapes in pattern recognition.",
            "Model-based recognition using 3D shape alone.",
            "Machine vision mensuration.",
            "Reliability analysis of parameter estimation in linear models with applications to mensuration problems in computer vision.",
            "Length estimators for digitized contours.",
            "A geometric approach to subpixel registration accuracy.",
            "Object recognition and localization via pose clustering.",
            "A width-independent algorithm for character skeleton estimation."
        ]
    },
    {
        "name": "GM",
        "year": "1986",
        "info": "1986: Volumes\n33, 34, 36",
        "count": 73,
        "papers": [
            "Algorithms for drawing anti-aliased circles and ellipses.",
            "Applying temporal constraints to the dynamic stereo problem.",
            "Invariant surface characteristics for 3D object recognition in range images.",
            "Geometrical transformations on pictures represented by leafcodes.",
            "Visual hyperacuity: Representation and computation of high precision position information.",
            "A note on the gradient of a multi-image.",
            "Adaptive gray scale mapping to reduce registration noise in difference images.",
            "Filling by quadrants or octants.",
            "Axial representations of shape.",
            "The variational approach to shape from shading.",
            "The characterization of parametric surface sections.",
            "Recursive region splitting at hierarchical scope views.",
            "Erratum.",
            "Edge detection with image enhancement via dynamic programming.",
            "Light diffusion through clouds and haze.",
            "Model-based strategies for high-level robot vision.",
            "Decomposition and approximation of three-dimensional solids.",
            "On digital approximation of moment invariants.",
            "Three adaptive discrete least squares cubic spline procedures for the compression of data.",
            "Automatic curve fitting with quadratic B-spline functions and its applications to computer-assisted animation.",
            "Combined local color and texture analysis of stained cells.",
            "Edge detection using median comparisons.",
            "Computing the visibility polygon from an edge.",
            "A new approach to the restoration of an image blurred by a linear uniform motion.",
            "Space-economical plane-sweep algorithms.",
            "Two-dimensional object recognition using multiresolution models.",
            "Hierarchical matching using relaxation.",
            "Computation of geometric properties from the medial axis transform in (O(nlogn) time.",
            "A method for almost exact histogram matching for two digitized images.",
            "\";Expert\" vision systems: Some issues.",
            "Vision expert systems demand challenging expert interactions.",
            "Comment on the position paper \"expert vision systems\".",
            "Workshop on goal-directed \";expert\" vision systems: My positions and comments.",
            "Comments on: \";Expert\" vision systems: Some issues.",
            "Dialog on \"expert\" vision systems: Comments.",
            "Expert systems for vision based on bayes' rule.",
            "The case for appropriate architecture.",
            "Rosenfeld's concluding remarks.",
            "Robot vision: Berthold Horn. MIT Press, Cambridge, MA 1986, 509 pp. $39.50.",
            "A new algorithm for object oriented ray tracing.",
            "Finding axes of skewed symmetry.",
            "Locating neuron boundaries in electron micrograph images using \"primal sketch\" primitives.",
            "Determining motion of image curves from local pattern changes.",
            "Efficient planar embedding of trees for VLSI layouts.",
            "Picture processing: 1985.",
            "On compatibility and support functions in probabilistic relaxation.",
            "A robust method for picture segmentation based on a split-and-merge procedure.",
            "A fast shape descriptor.",
            "An adaptive asteroid zonal filter for data compression.",
            "Toward the derivation of three-dimensional descriptions from image sequences for nonconvex moving objects.",
            "Pulse and staircase edge models.",
            "Distance transformations in digital images.",
            "A note on \"Rigid body motion from depth and optical flow\".",
            "Edge extraction using entropy operator.",
            "Digital straight segments.",
            "Computational-geometric methods for polygonal approximations of a curve.",
            "On translating a set of objects in 2- and 3-dimensional space.",
            "On the application of massively parallel SIMD tree machines to certain intermediate-level vision tasks.",
            "Recognition and recovery of the three-dimensional orientation of planar point patterns.",
            "Volume/surface octrees for the representation of three-dimensional objects.",
            "Digital color reproduction on color television monitors.",
            "Special issue on current issues and trends in computer vision.",
            "Fast Hough transform: A hierarchical approach.",
            "A distributed system for analyzing time-varying multiresolution imagery.",
            "Shape and motion of nonrigid bodies.",
            "Closed from solutions to image flow equations for planar surfaces in motion.",
            "Determination of the identity, position and orientation of the topmost object in a pile.",
            "Identification of 3D objects from multiple silhouettes using quadtrees/octrees.",
            "Task frames: Primitives for sensory-motor coordination.",
            "Shape from perspective: A rule-based approach.",
            "Hypothesis integration in image understanding systems.",
            "Computer vision theory: The lack thereof.",
            "Anything you can do, I can do better (No you can't)..."
        ]
    },
    {
        "name": "GM",
        "year": "1985",
        "info": "1985: Volumes\n29, 30, 31, 32",
        "count": 84,
        "papers": [
            "Tracing planar surface motion from a projection without knowing the correspondence.",
            "Detecting the motion of a planar surface by line and surface integrals.",
            "Rectification of multichannel images in mass storage using image transposition.",
            "Locating, replacing, and deleting patterns in graphics editing of line drawings.",
            "An amplitude segmentation method based on the distribution function of an image.",
            "Continuous analogs of axiomatized digital surfaces.",
            "Choosing a basis for perceptual space.",
            "Image segmentation techniques.",
            "Note on the determination of a digital straight line from chain codes.",
            "Topographic classification of digital image intensity surfaces using generalized splines and the discrete cosine transformation.",
            "A data reduction algorithm for planar curves.",
            "Counting regions, holes, and their nesting level in time proportional to the border.",
            "Automatic dimensional inspection of machine part cross-sections using Fourier analysis.",
            "Set operations on linear quadtrees.",
            "On different methods based on the Karhunen-Loeve expansion and used in image analysis.",
            "A new method for gray-level picture thresholding using the entropy of the histogram.",
            "Image representation using Voronoi tessellation.",
            "Matching shapes: A case study in time-varying images.",
            "Reconstruction of quadtrees from quadtree medial axis transforms.",
            "An imaging problem: Restoration of blurred digital characters.",
            "Texture analysis Anno 1983.",
            "A note on duhamel integrals and running average filters.",
            "Image space shading of 3-dimensional objects.",
            "Moment-preserving thresolding: A new approach.",
            "The m-dimensional grid point space.",
            "Terminal weighted grammars and picture description.",
            "Topological structural analysis of digitized binary images by border following.",
            "A new iterative algorithm for image restoration.",
            "Two-dimensional run-encoding for quadtree representation.",
            "A Gaussian-weighted multiresolution edge detector.",
            "Efficient diagram understanding with characteristic pattern detection.",
            "Digital images of geometric pictures.",
            "Threshold selection based on a simple image statistic.",
            "Determination of 3D human body postures from a single view.",
            "\"Form-invariant\" topological mapping strategy for 2D shape recognition.",
            "Picture processing: 1984.",
            "A fast algorithm for the Boolean masking problem.",
            "A generalised digital contour coding scheme.",
            "Representation of digital line segments and their preimages.",
            "Sequential synthesis of natural textures.",
            "Discontinuity detection for visual surface reconstruction.",
            "Vectorgraph coding: Efficient coding of line drawings.",
            "Display of 3D anisotropic images from limited-view computed tomograms.",
            "On the time complexity for circumscribing a convex polygon.",
            "Counterexamples to a minimal circumscription algorithm.",
            "Segment-based stereo matching.",
            "An approach to the definition, description, and extraction of structures in binary digital images.",
            "An image processing architecture for real time generation of scale and rotation invariant patterns.",
            "Detecting the spatial structure of natural textures based on shape analysis.",
            "Implicitization, inversion, and intersection of planar rational cubic curves.",
            "Adaptive filters for digital image noise smoothing: An evaluation.",
            "Perception of transparency in man and machine.",
            "Early vision: From computational structure to algorithms and parallel hardware.",
            "Preattentive processing in vision.",
            "Connectionist models and parallelism in high level vision.",
            "Generative systems of analyzers.",
            "Perception of organization in a random stimulus.",
            "Environment-centered and viewer-centered perception of surface orientation.",
            "Preface to the special issues on human and machine vision.",
            "Codon constraints on closed 2D shapes.",
            "Toward a theory of the perceived spatial layout of scenes.",
            "Autonomous scene description with range imagery.",
            "Intelligible encoding of ASL image sequences at extremely low information rates.",
            "Describing surfaces.",
            "Human image understanding: Recent research and a theory.",
            "Early orientation selection: Tangent fields and the dimensionality of their support.",
            "Rule-based image segmentation: A dynamic control strategy approach.",
            "Delaunay-based representation of surfaces defined over arbitrarily shaped domains.",
            "Using multisensory images to derive the structure of three-dimensional objects - A review.",
            "On the generation of discrete circular objects and their properties.",
            "Generalized sloped facet models useful in multispectral image analysis.",
            "Optical character recognition based on analog preprocessing and automatic feature extraction.",
            "Enhancing real-time perception of quantum limited images from a doubly intensified SIT camera system.",
            "A theory of binary digital pictures.",
            "Aspects of perception and computation in color vision.",
            "Convolution with separable masks for early image processing.",
            "Maximum likelihood classification of synthetic aperture radar imagery.",
            "Boundary conditions for lightness computation in Mondrian World.",
            "A distance metric for multidimensional histograms.",
            "Experiments with the intensity ratio depth sensor.",
            "A new lightpen for raster displays.",
            "Tracking modelled objects using binocular images.",
            "An algorithm for transformations of pictures represented by quadtrees.",
            "Texture classification by local rank correlation."
        ]
    },
    {
        "name": "GM",
        "year": "1984",
        "info": "1984: Volumes\n25, 26, 27, 28",
        "count": 87,
        "papers": [
            "Experiments in segmentation using a facet model region grower.",
            "An edge extraction technique for noisy images.",
            "Automatic multithreshold selection.",
            "Parallel computer architectures for image processing.",
            "Automatic inspection of the surface defects of cast metals.",
            "Metric bases in digital geometry.",
            "Classification by discrete optimization.",
            "A region extraction approach to blood smear segmentation.",
            "Segmentation of blood smears by hierarchical thresholding.",
            "Polyhedral approximation of 3-D objects without holes.",
            "An approach to the recognition of contours and line-shaped objects.",
            "Uniqueness of solutions to two-dimensional fourier phase problems for localized and positive images.",
            "An implementation of the exponential pyramid data structure with application to determination of symmetries in pictures.",
            "On the characterization of simple closed surfaces in three-dimensional digital images.",
            "Image enhancement using the median and the interquartile distance.",
            "A new approach to removing cloud cover from satellite imagery.",
            "Enhancement and detection of convex objects using regression models.",
            "Segmentation of a high-resolution urban scene using texture operators.",
            "Automatic Chinese seal identification.",
            "HIPS: A unix-based image processing system.",
            "Stochastic skeleton modeling of objects.",
            "Toward a data model for integrated pictorial databases.",
            "Clipping to the boundary of a circular-arc polygon.",
            "High-order tensor product approximation for two- and three-dimensional image blocks with application to multiresolution image representation.",
            "Algorithms for the conversion of quadtrees to rasters.",
            "Restoration of noisy images using a raised cosine function approximation.",
            "Page composition of continuous tone imagery.",
            "A note on the modeling space of Euler operators.",
            "An approach to figure decomposition using width information.",
            "New likelihood test methods for change detection in image sequences.",
            "The principles and methods of histogram modification adapted for visual perception.",
            "An efficient point in polyhedron algorithm.",
            "Connected pictures are not recognizable by deterministic two-dimensional on-line tessellation acceptors.",
            "Errors of the incremental method for curves.",
            "Exact reproduction of colored images.",
            "New measures of similarity between two contours based on optimal bivariate transforms.",
            "Solving three-dimensional small-rotation motion equations: Uniqueness, algorithms, and numerical results.",
            "Octree representations of moving objects.",
            "Systematic triangulations.",
            "On the encoding and representing of images.",
            "Simple enhancement techniques in digital image processing.",
            "Digital circles.",
            "Determining vanishing points from perspective images.",
            "Smoothed histogram modification for image processing.",
            "A fast recursive algorithm for binary-valued two-dimensional filters.",
            "A file organization for geographic information systems based on spatial proximity.",
            "Assessment of the intersection probabilities of random line segments and squares.",
            "A normalized quadtree representation.",
            "Picture processing: 1983.",
            "Image contrast, complexity, and stability.",
            "Curvilinear feature extraction using minimum spanning trees.",
            "Exponential and polynomial methods for applying tension to an interpolating spline curve.",
            "A B+-tree structure for large quadtrees.",
            "The maintenance of sharpness in magnified digital images.",
            "Atoms with transparency and shadows.",
            "The trapezoidal approximation of digitized images.",
            "Three-dimensional skeletonization of elongated solids.",
            "Grayscale simulation on a color display.",
            "Global shape recognition of 3-D objects using a differential library storage.",
            "Implementation of cellular-logic operators using 3*3 convolution and table lookup hardware.",
            "Evaluation of strategies for segmentation of blue-dyed pores in thin sections of reservoir rocks.",
            "Binocular shading and visual surface reconstruction.",
            "Encoding pixel trees.",
            "Minimal rectangular partitions of digitized blobs.",
            "Implicit representation of parametric curves and surfaces.",
            "Contour to rectangular grid conversion using minimum curvature.",
            "Some methods of computational geometry applied to computer graphics.",
            "An improved algorithm for the sequential extraction of boundaries from a raster scan.",
            "Acquiring 3-D spatial data of a real object.",
            "Region representation: Parallel connected stripes.",
            "Algorithms for the euler characteristic and related additive functionals of digital objects.",
            "A new class of similarity measures for robust image registration.",
            "Performance evaluation of shape matching via chord length distribution.",
            "Object detection based on gray level cooccurrence.",
            "A fast sequential method for polygonal approximation of digitized curves.",
            "Position determination using generalized multidirectional gradient codes.",
            "Document segmentation and coding techniques.",
            "Culling hidden edges of rectangular parallelepipeds.",
            "Segmentation and preprocessing of electrical schematics using picture graphs.",
            "Reconstructing faces on a polyhedron from apparent gradients of edges.",
            "Computational techniques for processing parametric surfaces.",
            "The extraction of drainage networks from digital elevation data.",
            "Detecting time-varying corners.",
            "Physical and informational constraints on the perception of transparency and translucency.",
            "Image restoration in signal-dependent noise using a Markovian covariance model.",
            "On some properties of the generation of discrete circular arcs on a square grid.",
            "A note on discrete relaxation."
        ]
    },
    {
        "name": "GM",
        "year": "1983",
        "info": "1983: Volumes\n21, 22, 23, 24",
        "count": 103,
        "papers": [
            "\"CVGIP\".",
            "Editorial.",
            "Passive navigation.",
            "Determining 3-D motion and structure of a rigid body using the spherical projection.",
            "A discrete spatial representation for lateral motion stereo.",
            "Understanding blood cell motion.",
            "Displacement vectors derived from second-order intensity variations in image sequences.",
            "Representation of three-dimensional motion in dynamic scenes.",
            "Shape and correspondence.",
            "Editorial.",
            "Kalman filter formulation of low-Level television image motion estimation.",
            "A spatio-temporal gradient method for estimating the displacement field in time-varying imagery.",
            "The detection of unresolved targets using the Hough Transform.",
            "An approach to the segmentation of textured dynamic scenes.",
            "Determining velocity maps by spatio-temporal neighborhoods from image sequences.",
            "Application of the one-dimensional Fourier transform for tracking moving objects in noisy environments.",
            "Editorial.",
            "Uniform color scale applications to computer graphics.",
            "Discrete convexity: Definition, parametrization, and compatibility with continuous convexity.",
            "Detection of moving edges.",
            "Fast algorithms for estimating local image properties.",
            "Approximating point-set images by line segments using a variation of the Hough transform.",
            "Experiments in combining intensity and range edge maps.",
            "The detection of intensity changes by computer and biological vision systems.",
            "Ridges and valleys on digital images.",
            "An implementation of a computational theory of visual surface interpolation.",
            "Rotationally symmetric operators for surface interpolation.",
            "Rigid body motion from depth and optical flow.",
            "Processing translational motion sequences.",
            "Using shadows in finding surface orientations.",
            "3-D shape from contour and selective confirmation.",
            "An investigation of occlusion in one dimension.",
            "Page composition of continuous tone imagery.",
            "Octree representations of moving objects.",
            "An approach to figure decomposition using width information.",
            "Towards a data model for integrated pictorial databases.",
            "Gray scale simulation on a color display.",
            "Errors of the incremental method for curves.",
            "Visibility of a simple polygon.",
            "Algebraic methods for intersections of quadric surfaces in GMSOLID.",
            "On the information in optical flows.",
            "Nonlinear reduction of data.",
            "More about areas and perimeters of quantized objects.",
            "Segmentation of digital curves using linguistic techniques.",
            "A new connected components algorithm for virtual memory computers.",
            "Matching the task to an image processing architecture.",
            "Solving three-dimensional small-rotation motion equations: Uniqueness, algorithms, and numerical results.",
            "A fast recursive algorithm for binary valued two-dimensional filters.",
            "Systematic triangulations.",
            "Connected pictures are not recognizable by deterministic two-dimensional on-line tessellation acceptors.",
            "Digital circles.",
            "A UNIX*-based image processing system.",
            "An estimation-theoretic approach to terrain image segmentation.",
            "Rays - New representation for polygons and polyhedra.",
            "Picture processing: 1982.",
            "An interpretation for probabilistic relaxation.",
            "Contour registration by shape-specific points for shape matching.",
            "Correction of a statement inDigital picture processing.",
            "Edge detection using sliding statistical tests.",
            "Some features of visual form.",
            "An operating system interface for transportable image processing software.",
            "Quantitative evaluation of some edge-preserving noise-smoothing techniques.",
            "Closed-form extension of the anharmonic ratio to N-space.",
            "Parallel syntactic thinning by recoding of binary pictures.",
            "Image restoration by a powerful maximum entropy method.",
            "Automatic rib detection in chest radiographs.",
            "A topological proof of a surface tracking algorithm.",
            "Direct dynamic structures for some line segment problems.",
            "Generalized texture representation and metric.",
            "A new three-dimensional connected components algorithm.",
            "A new distance mapping and its use for shape measurement on binary patterns.",
            "An experiment in multispectral, multitemporal crop classification using relaxation techniques.",
            "Image random file access routines.",
            "Image reconstruction by parametric cubic convolution.",
            "Design and implementation of SPIDER - A transportable image processing software package.",
            "On sequential and parallel node-rewriting graph grammars, II.",
            "Contour-based motion estimation.",
            "Waveform segmentation and description using edge preserving smoothing.",
            "Histogram deconvolution: An aid to automated classifiers.",
            "Neighboring gray level dependence matrix for texture classification.",
            "Topology quasi-preservation by local parallel operations.",
            "Picture information measures for similarity retrieval.",
            "A data structure and algorithm based on a linear key for a rectangle retrieval problem.",
            "A hybrid structure for the storage and manipulation of very large spatial data sets.",
            "Surface consistency constraints in vision.",
            "Multilevel computational processes for visual surface reconstruction.",
            "TOPPSY: A time overlapped parallel processing system.",
            "Image enhancement in a dithered picture.",
            "Generation of radar echo images from a contour map.",
            "Circumscribing a convex polygon by a polygon of fewer sides with minimal area addition.",
            "Performance analysis of cell based geometric file organizations.",
            "Gradient space under orthography and perspective.",
            "On approaches to polygonal decomposition for hierarchical image representation.",
            "VLSI architectures for feature extraction and pattern classification.",
            "Discrimination and classification of vehicles in natural scenes from thermal imagery.",
            "Animating planar folds by computer.",
            "Digital image smoothing and the sigma filter.",
            "Computing the optic flow: The MATCH algorithm and prediction.",
            "Algorithms for circular propagation in discrete images.",
            "Resolution and tonal continuity in bilevel printed picture quality.",
            "Structural analysis of natural textures by Fourier transformation.",
            "Digital image enhancement: A survey.",
            "On translating a set of line segments."
        ]
    },
    {
        "name": "GM",
        "year": "1982",
        "info": "1982: Volumes\n18,\n19,\n20",
        "count": 152,
        "papers": [
            "Surface measurement by space-encoded projected beam systems.",
            "A network flow approach to reconstruction of the left ventricle from two projections.",
            "Neighbor finding techniques for images represented by quadtrees.",
            "Electron image processing: 1978-1980.",
            "Fitting conic sections to \"very scattered\" data: An iterative refinement of the bookstein algorithm.",
            "Ray casting for modeling solids.",
            "Computer graphics: A keyword-indexed bibliography for the year 1980.",
            "Extraction of moving object descriptions via differencing.",
            "Stochastic table arrays.",
            "Interactive segmentation and boundary surface formation for 3-D digital images.",
            "Elliptic Fourier features of a closed contour.",
            "A structural analyzer for regularly arranged textures.",
            "On sequential and parallel node-rewriting graph grammars.",
            "Obtaining 3-dimensional shape of textured and specular surfaces using four-source photometry.",
            "Cell division patterns: Syntactical description and implementation.",
            "Extraction of line shaped objects from aerial images using a special operator to analyze the profiles of functions.",
            "Using the FFT to determine digital straight line chain codes.",
            "On cellular straight line segments.",
            "Polygon decomposition and switching function minimization.",
            "An interactive high-level language system for picture processing.",
            "Jigsaw puzzle matching using a boundary-centered polar encoding.",
            "A modified alpha-root technique for image processing.",
            "Picture Processing: 1981.",
            "Streak removal method for CT based digital X-ray images.",
            "Vector code probability and metrication error in the representation of straight lines of finite length.",
            "Detection of osteogenesis imperfecta by automated texture analysis.",
            "Uniform color scale applications to computer graphics.",
            "Matching of featured objects relational tables from stereo images.",
            "On cubics: A survey.",
            "Curvature relations in three-dimensional symmetric axes.",
            "Mites (mit-∂s): A model-driven, iterative texture segmentation algorithm.",
            "Geometric modeling using octree encoding.",
            "Sequential tracking extraction of shape features and its constructive description.",
            "A model for cell receptive fields in the visual striate cortex.",
            "A generalized distance transformation of a line pattern with gray values and its applications.",
            "Image segmentation using simple markov field models.",
            "On the topology preservation property of local parallel operations.",
            "Polygonal approximation by the minimax method.",
            "Determining the spatial containment of a point in general polyhedra.",
            "Recognition of occluded shapes using relaxation.",
            "Discrete convexity: Definition, parametrization, and compatibility with continuous convexity.",
            "A study of edge detection algorithms.",
            "Image segmentation in pyramids.",
            "Volumetric model and 3D trajectory of a moving car derived from monocular TV frame sequences of a street scence.",
            "Curve encoding and the detection of discontinuities.",
            "Linear octtres for fast processing of three-dimensional objects.",
            "Some properties of stochastic labeling procedures.",
            "Algorithms for smoothing data with periodic and parametric splines.",
            "The space efficiency of quadtrees.",
            "Sketching: Estimating object positions from relational descriptions.",
            "Understanding engineering drawings.",
            "An asynchronous thinning algorithm.",
            "Fast algorithms for estimating local image properties.",
            "Detection of moving edges.",
            "Approximating point set images by line segments using a variation of the hough transform.",
            "An isotropic four-point interpolation based on cubic splines.",
            "Normalized quadtrees with respect to translations.",
            "Nonlinear reduction of data.",
            "An approach to local-edge detection based on the direction of edge elements.",
            "The local median and other window operations in SIMD computers.",
            "Vectorization of raster images using hierarchcial methods.",
            "The representation and display of scenes with a wide range o f detail.",
            "Adaptive bit allocation for image compression.",
            "A new linear algorithm for intersecting convex polygons.",
            "Rank filters in digital image processing.",
            "False contour removal by random blurring.",
            "Boundary detection in scintigraphic images.",
            "A two-pass filling algorithm for raster graphics.",
            "Chord distributions for shape matching.",
            "A construction for visual C1 continuity of polynomial surface patches.",
            "Software pipelines in image processing.",
            "Block segmentation and text extraction in mixed text/image documents.",
            "Experiments in combining intensity and range-edge maps.",
            "Edge detection using charge analogy.",
            "MITES (mit-æs): A model-driven, iterative texture segmentation algorithm.",
            "Recognition of occluded shapes using relaxation.",
            "Geometric modeling using octree encoding.",
            "Rank filters in digital image processing.",
            "The local median and other window operations on SIMD computers.",
            "An approach to edge detection based on the direction of edge elements.",
            "A structural analysis of complex aerial photographs : Makoto Nagao and Takashi Matsuyama. Plenum Press, New York, 1980. 199 pages.",
            "On cubics: A survey.",
            "Sketching: Estimating object positions from relational descriptions.",
            "Polygonal approximation by the minimax method.",
            "On the topology preservation property of local parallel operations.",
            "Boundary detection in scintigraphic images.",
            "The representation and display of scenes with a wide range of detail.",
            "Determining the spatial containment of a point in general polyhedra.",
            "The space efficiency of quadtrees.",
            "A sequential tracking extraction of shape features and its constructive description.",
            "Image segmentation in pyramids.",
            "A new linear algorithm for intersecting convex polygons.",
            "Adaptive bit allocation for image compression.",
            "An opening system interface for trasportable image processing software.",
            "Algebraic methods for intersections of quadric surface om gmsolid.",
            "An estimation-theoric approach to terrain image segmentation.",
            "A topological proof of a surface tracking algorithm.",
            "Contour registration by shape-specific points for shape matching.",
            "Quantitative evaluationof some edge-preserving noisse-smoothing techniques.",
            "Matching the task to an I. P. architecture.",
            "A study of edge detection algorithms.",
            "Matching of featured objects using relational tables from stereo images.",
            "Curvature relations in three-dimensional symmetric axes.",
            "Curve encoding and the detection of discontinuities.",
            "Normalized quadtrees with respect to translations.",
            "Vectorization of raster images using hierarchical methods.",
            "Software pipelines in image processing.",
            "A new three dimensional connected components algorithm.",
            "Image segmentation using simple Markov field models.",
            "An asynchronous thinning algorithm.",
            "Some properties of stochastic labeling procedures.",
            "Algorithms for smoothing data with periodic and parametric splines.",
            "Edge detection using charge analogy.",
            "Image restoration by a powerful maximum entropy method.",
            "Determining 3-D motion and structure of a rigid body using the spherical projection.",
            "Passive navigation.",
            "A spatio-temporal gradient method for estimating the displacement field in time-varying imagery.",
            "An approach to the segmentation of textured dynamic scenes.",
            "Understanding blood cell motion.",
            "The detection of unresolved targets using the hough transform.",
            "The principles and methods of histogram modification adapte for visual perception.",
            "Application of the one-dimensional fourier transform for tracking moving objects in noisy environments.",
            "On sequential and parallel node-rewriting graph grammars, II.",
            "Volumetric model and 3D trajectory of a moving car derived from monocular TV frame sequences of a street scene.",
            "Detection of osteogenesis imperfecta by automated texture analysis.",
            "Understanding engineering drawings.",
            "Chord distributions for shape matching.",
            "A construction for visualC1 continuity of polynomial surface patches.",
            "An isotropic four-point interpolation based on cubic splines.",
            "A two-pass filling algorithm for raster graphics.",
            "A discrete spatial representation for lateral motion stereo.",
            "Displacement vectors derived from second order intensity variations in image sequences.",
            "Representation of three-dimensional motion in dynamic scenes.",
            "Shape and correspondence.",
            "Determining velocity maps by spatio-temporal neighborhoods from image sequences.",
            "Neighboring gray level dependence matrix for texture classification.",
            "Closed-form extension of the anharmonic ratio toN-space.",
            "An experiment in multi-spectral, multi-temporal crop classification using relaxation techniques.",
            "A model for cell receptive fields in the visual striate cortex.",
            "A generalized distance transformation of a line pattern with gray values and its applications.",
            "Vector code probability and metrication error in the representation of straight lines of finite length.",
            "Linear octtrees for fast processing of three-dimensional objects.",
            "Block segmentation and text extraction in mixed text/image documents.",
            "False-contour removal by random blurring.",
            "Image random file access routines.",
            "Contour-based motion estimation.",
            "Image reconstruction by parametric cubic convolution.",
            "Surface consistency constraints in vision.",
            "Topology quasi-preservation by local parallel operations.",
            "Waveform segmentation and description using edge preserving smoothing.",
            "A new distance mapping and its use for shape measurement on binary patterns.",
            "Picture information measures for similarity retrieval."
        ]
    },
    {
        "name": "GM",
        "year": "1974",
        "info": "Volume 3: 1974",
        "count": 29,
        "papers": [
            "Recognizing Objects by Rules of Inference on Sequentially Thresholded Gray-Level Pictures.",
            "Representation of Digitized Contours in Terms of Conic Arcs and Straight-Line Segments.",
            "Concavity Point Detection by Iterative Arrays.",
            "Linguistic Methods for the Description of a Straight Line on a Grid.",
            "Array Grammars and Kolam.",
            "Printed Text Discrimination.",
            "Computer graphics for drafting.",
            "A decision function method for boundary detection.",
            "Computing the perceptual boundaries of dot patterns.",
            "Unsharp masking and related image enhancement techniques.",
            "Picture processing: 1973.",
            "Digital transmission of halftone pictures.",
            "Some computer experiments in picture processing for data compaction.",
            "Techniques for optimal compaction of pictures and maps.",
            "Optimal matching of wheat chromosomes.",
            "Pebble automata on arrays.",
            "A search algorithm for skeletonization of thick patterns.",
            "\"Integer Circles, Etc.\" - three move extension of Bresenham's algorithm.",
            "\"Integer Circles, Etc.\" - some further thoughts.",
            "A new computer language for electron image processing.",
            "Determining lightness from an image.",
            "Recovery of perceptual shape organizations from simple closed boundaries.",
            "A triangular scanning technique for locating boundary curves.",
            "A technique for the reconstruction of a straight-edge, wire-frame object from two or more central projections.",
            "Considerations for efficient picture output via lineprinter.",
            "Reconstruction of objects from their projections using generalized inverses.",
            "An algorithm for high-speed curve generation.",
            "An automated apparatus for cancer prescreening: CYBEST.",
            "Review of psychological processes in pattern recognition."
        ]
    },
    {
        "name": "GM",
        "year": "1973",
        "info": "Volume 2: 1973",
        "count": 31,
        "papers": [
            "Generating halftone pictures on graphic computer terminals using run length coding.",
            "Binary data compression by linear transformation.",
            "On blob reconstruction.",
            "A model building approach to property measurement in black and white pictures.",
            "Image analysis and graphs.",
            "A method for computing points of a circle using only integers.",
            "A compiler for simple boolean functions of binary patterns.",
            "Finding \"Vertices\" in a picture\".",
            "Computer identification of visual surfaces.",
            "Computer determination of depth maps.",
            "Three methods for reconstructing objects from x rays: A comparative study.",
            "Recovering multidimensional signals from their projections.",
            "Review of Graphic Languages (1972).",
            "Picture processing system using a computer complex.",
            "A structural analyzer for a class of textures.",
            "Computer analysis of chest radiographs.",
            "Pattern recognition of chest X-ray images.",
            "Automatic model generation and recognition of simple three-dimensional bodies.",
            "Scene analysis in support of a Mars rover.",
            "A step toward context-sensitive recognition of irregular objects.",
            "On locating objects by their distinguishing features in multisensory images.",
            "Edge representation in gradient space.",
            "A process for detecting defects in complicated patterns.",
            "Derivation of the contribution index of frequency components to picture quality, and applications.",
            "Towards color picture processing.",
            "A corner finder for visual feedback.",
            "Computer analysis of traffic flow observed by subtractive television.",
            "An iterative prediction and correction method for automatic stereocomparison.",
            "Chromosome analysis by minicomputer.",
            "Picture analysis applied to biomedicine.",
            "Stochastic languages for picture analysis."
        ]
    },
    {
        "name": "GM",
        "year": "1972",
        "info": "Volume 1: 1972",
        "count": 24,
        "papers": [
            "Computer-produced grey scales.",
            "Parallel shrinking in three dimensions.",
            "The perception and description of line drawings by computer.",
            "Recognition of printed chinese characters by automatic pattern analysis.",
            "Preprocessing of gray-scale pictures.",
            "Extraction of invariant picture sub-structures by computer.",
            "Algorithms for reproducing objects from their X-rays.",
            "An algebraic approach to image restoration filter design.",
            "Two direct methods for reconstructingpictures from their projections: A comparative study.",
            "Texture descriptors using neighborhood information.",
            "Edge detection using heuristic search methods.",
            "The analysis of convex blobs.",
            "Web grammars and picture description.",
            "An approach to the optimum implementation of interactive display data structures.",
            "An iterative procedure for the polygonal approximation of plane curves.",
            "Stochastic syntactic analysis for programmed grammars and syntactic pattern recognition.",
            "Abstract families of matrices and picture languages.",
            "On the recognition of topological invariants by 4-way finite automata.",
            "Ex. FRAF: An extensible language including graphical operations.",
            "On coons and other methods for the representation of curved surfaces.",
            "Segmentation of pictures and maps through functional approximation.",
            "A computer system for scientific typography.",
            "Some experiments in scene analysis and scene regeneration using COMPAX.",
            "Picture processing: 1972."
        ]
    }
]