[
    {
        "year": "2010",
        "name": "GMP 2010",
        "info": "Castro Urdiales, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2010",
                "sub_name": "Advances in Geometric Modeling and Processing, 6th International Conference, GMP 2010, Castro Urdiales, Spain, June 16-18, 2010. Proceedings.",
                "count": 20,
                "papers": [
                    "Global Solutions of Well-Constrained Transcendental Systems Using Expression Trees and a Single Solution Test.",
                    "Surfaces with Rational Chord Length Parameterization.",
                    "Support Function of Pythagorean Hodograph Cubics and G1 Hermite Interpolation.",
                    "Piecewise Tri-linear Contouring for Multi-material Volumes.",
                    "An Efficient Algorithm for the Sign Condition Problem in the Semi-algebraic Context.",
                    "Constraints on Curve Networks Suitable for G2 Interpolation.",
                    "Computing the Distance between Canal Surfaces.",
                    "A Subdivision Approach to Planar Semi-algebraic Sets.",
                    "Non-manifold Medial Surface Reconstruction from Volumetric Data.",
                    "Decomposing Scanned Assembly Meshes Based on Periodicity Recognition and Its Application to Kinematic Simulation Modeling.",
                    "Automatic Generation of Riemann Surface Meshes.",
                    "G1 Bézier Surface Generation from Given Boundary Curve Network with T-Junction.",
                    "Efficient Point Projection to Freeform Curves and Surfaces.",
                    "Construction of Minimal Catmull-Clark's Subdivision Surfaces with Given Boundaries.",
                    "Parameterization of Star-Shaped Volumes Using Green's Functions.",
                    "Optimal Analysis-Aware Parameterization of Computational Domain in Isogeometric Analysis.",
                    "Construction of Subdivision Surfaces by Fourth-Order Geometric Flows with G1 Boundary Conditions.",
                    "Efficient Computation of 3D Clipped Voronoi Diagram.",
                    "Selecting Knots Locally for Curve Interpolation with Quadratic Precision.",
                    "Eigenmodes of Surface Energies for Shape Analysis."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "GMP 2008",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2008",
                "sub_name": "Advances in Geometric Modeling and Processing, 5th International Conference, GMP 2008, Hangzhou, China, April 23-25, 2008. Proceedings.",
                "count": 53,
                "papers": [
                    "Automatic PolyCube-Maps.",
                    "Bicubic G1 Interpolation of Irregular Quad Meshes Using a 4-Split.",
                    "Bounding the Distance between a Loop Subdivision Surface and Its Limit Mesh.",
                    "A Carving Framework for Topology Simplification of Polygonal Meshes.",
                    "Comparing Small Visual Differences between Conforming Meshes.",
                    "Continuous Collision Detection between Two 2DCurved-Edge Polygons under Rational Motions.",
                    "Controlling Torsion Sign.",
                    "Cutting and Fracturing Models without Remeshing.",
                    "Detection of Planar Regions in Volume Data for Topology Optimization.",
                    "Determining Directional Contact Range of Two Convex Polyhedra.",
                    "Efficient Collision Detection Using a Dual Bounding Volume Hierarchy.",
                    "Fast and Local Fairing of B-Spline Curves and Surfaces.",
                    "Finite Element Methods for Geometric Modeling and Processing Using General Fourth Order Geometric Flows.",
                    "Geodesic as Limit of Geodesics on PL-Surfaces.",
                    "Hausdorff and Minimal Distances between Parametric Freeforms in R2 and R3.",
                    "On Interpolation by Spline Curves with Shape Parameters.",
                    "Lepp Terminal Centroid Method for Quality Triangulation: A Study on a New Algorithm.",
                    "Mean Value Bézier Maps.",
                    "Meaningful Mesh Segmentation Guided by the 3D Short-Cut Rule.",
                    "Mesh Simplification with Vertex Color.",
                    "A Multistep Approach to Restoration of Locally Undersampled Meshes.",
                    "Noise Removal Based on the Variation of Digitized Energy.",
                    "Note on Industrial Applications of Hu's Surface Extension Algorithm.",
                    "Parameterizing Marching Cubes Isosurfaces with Natural Neighbor Coordinates.",
                    "Parametric Polynomial Minimal Surfaces of Degree Six with Isothermal Parameter.",
                    "Physically-Based Surface Texture Synthesis Using a Coupled Finite Element System.",
                    "Planar Shape Matching and Feature Extraction Using Shape Profile.",
                    "Reconstructing a Mesh from a Point Cloud by Using a Moving Parabolic Approximation.",
                    "A Revisit to Least Squares Orthogonal Distance Fitting of Parametric Curves and Surfaces.",
                    "Shifting Planes to Follow a Surface of Revolution.",
                    "Slit Map: Conformal Parameterization for Multiply Connected Surfaces.",
                    "Solving Systems of 3D Geometric Constraints with Non-rigid Clusters.",
                    "Space-Time Curve Analogies for Motion Editing.",
                    "Variational Skinning of an Ordered Set of Discrete 2D Balls.",
                    "3D Mesh Segmentation Using Mean-Shifted Curvature.",
                    "Convex Surface Interpolation.",
                    "Deformation and Smooth Joining of Mesh Models for Cardiac Surgical Simulation.",
                    "Digital Design for Functionally Graded Material Components Rapid Prototyping Manufacturing.",
                    "Layer-Based Mannequin Reconstruction and Parameterization from 3D Range Data.",
                    "Manifoldization of pi-Shapes by Topology Operators.",
                    "A Mesh Simplification Method Using Noble Optimal Positioning.",
                    "Narrow-Band Based Radial Basis Functions Implicit Surface Reconstruction.",
                    "Progressive Interpolation Using Loop Subdivision Surfaces.",
                    "Protein Surface Modeling Using Active Contour Model.",
                    "Quasi-interpolation for Data Fitting by the Radial Basis Functions.",
                    "A Shape Feature Based Simplification Method for Deforming Meshes.",
                    "Shape Representation and Invariant Description of Protein Tertiary Structure in Applications to Shape Retrieval and Classification.",
                    "The Structure of V-System over Triangulated Domains.",
                    "Tool Path Planning for 5-Axis Flank Milling Based on Dynamic Programming Techniques.",
                    "Trimming Bézier Surfaces on Bézier Surfaces Via Blossoming.",
                    "A Volumetric Framework for the Modeling and Rendering of Dynamic and Heterogeneous Scenes.",
                    "Geometric Calibration of Projector Imagery on Curved Screen Based-on Subdivision Mesh.",
                    "A Comment on \"Constructing Regularity Feature Trees for Solid Models\"."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "GMP 2006",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2006",
                "sub_name": "Geometric Modeling and Processing - GMP 2006, 4th International Conference, Pittsburgh, PA, USA, July 26-28, 2006, Proceedings.",
                "count": 57,
                "papers": [
                    "Automatic Extraction of Surface Structures in Digital Shape Reconstruction.",
                    "Ensembles for Normal and Surface Reconstructions.",
                    "Adaptive Fourier-Based Surface Reconstruction.",
                    "Least-Squares Approximation by Pythagorean Hodograph Spline Curves Via an Evolution Process.",
                    "Geometric Accuracy Analysis for Discrete Surface Approximation.",
                    "Quadric Surface Extraction by Variational Shape Approximation.",
                    "Tracking Point-Curve Critical Distances.",
                    "Theoretically Based Robust Algorithms for Tracking Intersection Curves of Two Deforming Parametric Surfaces.",
                    "Subdivision Termination Criteria in Subdivision Multivariate Solvers.",
                    "Towards Unsupervised Segmentation of Semi-rigid Low-Resolution Molecular Surfaces.",
                    "Piecewise Developable Surface Approximation of General NURBS Surfaces, with Global Error Bounds.",
                    "Efficient Piecewise Linear Approximation of Bézier Curves with Improved Sharp Error Bound.",
                    "Approximate µ-Bases of Rational Curves and Surfaces.",
                    "Inverse Adaptation of Hex-dominant Mesh for Large Deformation Finite Element Analysis.",
                    "Preserving Form-Features in Interactive Mesh Deformation.",
                    "Surface Creation and Curve Deformations Between Two Complex Closed Spatial Spline Curves.",
                    "Computing a Family of Skeletons of Volumetric Models for Shape Description.",
                    "Representing Topological Structures Using Cell-Chains.",
                    "Constructing Regularity Feature Trees for Solid Models.",
                    "Insight for Practical Subdivision Modeling with Discrete Gauss-Bonnet Theorem.",
                    "Shape-Based Retrieval of Articulated 3D Models Using Spectral Embedding.",
                    "Separated Medial Surface Extraction from CT Data of Machine Parts.",
                    "Two-Dimensional Selections for Feature-Based Data Exchange.",
                    "Geometric Modeling of Nano Structures with Periodic Surfaces.",
                    "Minimal Mean-Curvature-Variation Surfaces and Their Applications in Surface Modeling.",
                    "Parametric Design Method for Shapes with Aesthetic Free-Form Surfaces.",
                    "Control Point Removal Algorithm for T-Spline Surfaces.",
                    "Shape Representations with Blossoms and Buds.",
                    "Manifold T-Spline.",
                    "Composite sqrt(2) Subdivision Surfaces.",
                    "Tuned Ternary Quad Subdivision.",
                    "Simultaneous Precise Solutions to the Visibility Problem of Sculptured Models.",
                    "Density-Controlled Sampling of Parametric Surfaces Using Adaptive Space-Filling Curves.",
                    "Verification of Engineering Models Based on Bipartite Graph Matching for Inspection Applications.",
                    "A Step Towards Automated Design of Side Actions in Injection Molding of Complex Parts.",
                    "Finding All Undercut-Free Parting Directions for Extrusions.",
                    "Robust Three-Dimensional Registration of Range Images Using a New Genetic Algorithm.",
                    "Geometrical Mesh Improvement Properties of Delaunay Terminal Edge Refinement.",
                    "Matrix Based Subdivision Depth Computation for Extra-Ordinary Catmull-Clark Subdivision Surface Patches.",
                    "Hierarchically Partitioned Implicit Surfaces for Interpolating Large Point Set Models.",
                    "A New Class of Non-stationary Interpolatory Subdivision Schemes Based on Exponential Polynomials.",
                    "Detection of Closed Sharp Feature Lines in Point Clouds for Reverse Engineering Applications.",
                    "Feature Detection Using Curvature Maps and the Min-cut/Max-flow Algorithm.",
                    "Computation of Normals for Stationary Subdivision Surfaces.",
                    "Voxelization of Free-Form Solids Represented by Catmull-Clark Subdivision Surfaces.",
                    "Interactive Face-Replacements for Modeling Detailed Shapes.",
                    "Straightest Paths on Meshes by Cutting Planes.",
                    "3D Facial Image Recognition Using a Nose Volume and Curvature Based Eigenface.",
                    "Surface Reconstruction for Efficient Colon Unfolding.",
                    "Spectral Sequencing Based on Graph Distance.",
                    "An Efficient Implementation of RBF-Based Progressive Point-Sampled Geometry.",
                    "Segmentation of Scanned Mesh into Analytic Surfaces Based on Robust Curvature Estimation and Region Growing.",
                    "Finding Mold-Piece Regions Using Computer Graphics Hardware.",
                    "A Method for FEA-Based Design of Heterogeneous Objects.",
                    "Time-Varying Volume Geometry Compression with 4D Lifting Wavelet Transform.",
                    "A Surface Displaced from a Manifold.",
                    "Smoothing of Meshes and Point Clouds Using Weighted Geometry-Aware Bases."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "GMP 2004",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2004",
                "sub_name": "2004 Geometric Modeling and Processing (GMP 2004), Theory and Applications, 13-15 April 2004, Beijing, China.",
                "count": 45,
                "papers": [
                    "The Fractal Nature of Bezier Curves.",
                    "Overview of Recent Work on Geometry Images.",
                    "Surface Processing by Partial Differential Equation.",
                    "Chord Length (Motivated) Parameterization of Marching Cubes IsoSurfaces.",
                    "Knot Choosing by Accommodating the First Derivative Constraint.",
                    "Intersecting a Freeform Surface with a Ruled or a Ringed Surface.",
                    "On Convergence of the Control Polygons Series of C-Bezier Curves.",
                    "Smooth Trimmed NURBS Surface Connection with Tension Control.",
                    "Existence of the Normalized B-basis and a Practical Construction Method of the B-algorithm.",
                    "Some Estimates of the Height of Rational Bernstein-Bezier Triangular Surface.",
                    "Shape-Preserving MQ-B-Splines Quasi-Interpolation.",
                    "Rational Quadratic Approximation to Real Plane Algebraic Curves.",
                    "Surface Interpolation of Meshes with Shape Optimization.",
                    "Bivariate Cubic Spline Space and Bivariate Cubic NURBS Surfaces.",
                    "A Hybrid Method for Fast Computing the Curvature Scale Space Image.",
                    "Analyzing and Enhancing the Robustness of Implicit Representations.",
                    "Segmentation and Parametrization of Arbitrary Polygon Meshes.",
                    "Triangular/Quadrilateral Remeshing of an Arbitrary Polygonal Surface via Packing Bubbles.",
                    "Feature Based Retargeting of Parameterized Geometry.",
                    "Topology-Free Cut-and-Paste Editing over Meshes.",
                    "Interpolatory v2-Subdivision Surfaces.",
                    "Convergent Discrete Laplace-Beltrami Operators over Triangular Surfaces.",
                    "Fast Evaluation of the Improved Loop's Subdivision Surfaces.",
                    "Global Curvature Analysis and Segmentation of Volumetric Data Sets Using Trivariate B-spline Functions.",
                    "Topological Volume Skeletonization Using Adaptive Tetrahedralization.",
                    "Improved Geometric Constraints on Deformable Surface Model for Volumetric Segmentation.",
                    "Interpreting Line Drawings of Objects with K-Vertices.",
                    "Shrinking: Another Method for Surface Reconstruction.",
                    "Handling Sectional Views in Volume-based Approach to Automatically Construct 3D Solid from 2D Views.",
                    "Surface Reconstruction with Triangular B-splines.",
                    "Efficient and Stable Numerical Algorithms on Equilibrium Equations for Geometric Modeling.",
                    "Recognition and Reconstruction of Developable Surfaces from Point Clouds.",
                    "An Engineering Rules based Parameterization Approach for Turbine Blade Reverse Engineering.",
                    "A Fast NC Simulation Method for Circularly Moving Tools in the Z-Map Environment.",
                    "Theory of 2-D Non-separable Optimal M-band Wavelets and Its Applications.",
                    "Least Squares Ellipsoid Specific Fitting.",
                    "G{2} Continuity Conditions for Two Adjacent B-spline Surfaces.",
                    "Adaptive Multi-Resolution Fitting and its Application to Realistic Head Modeling.",
                    "Three-axis NC Cutter Path Generation for Subdivision Surface.",
                    "M-Band Subdivision of Bivariate B-Splines of Uniform Partition in Three Directions.",
                    "Efficient Topology Construction from Triangle Soup.",
                    "Generalized NURBS Curves and Surfaces.",
                    "BIUP{3}: Boundary Topological Invariant of 3D Objects Through Front Propagation at a Constant Speed.",
                    "Optimal Mesh Signal Transforms.",
                    "Interpolatory Convexity Preserving Subdivision Schemes for Curves."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "GMAG 2003",
        "info": "London, England",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2003",
                "sub_name": "2003 International Conference on Geometric Modeling and Graphics, GMAG'03, London, England, July 16-18, 2003.",
                "count": 31,
                "papers": [
                    "A Role for 3D Modelling in Controlling Webcams and Interpreting Real-Time Video.",
                    "Geometric Correction of Scanned Topographic Maps Using Capable Input Information.",
                    "Combination of Automatic and Interactive Tools for Solution Space Browsing.",
                    "A Web-Based System Using Trade Knowledge.",
                    "Offline Arabic Text Recognition System.",
                    "Saudi Arabian License Plate Recognition System.",
                    "Normalisation and Exploration Design Method of Islamic Geometric Patterns.",
                    "Data Organization for Broadcasting in Mobile Computing.",
                    "Generating Well Behaved Meshes for Parameterized Surfaces.",
                    "Generating Blending Surfaces with an Iterative Solution to Fourth Order PDE.",
                    "Accurate Silhouettes - Do Polyhedral Models Suffice?",
                    "Reconstruction of a 3D Solid Model from Orthographic Projections.",
                    "Extensible Point Location Algorithm.",
                    "Geometric Desing and Space Planning Using the Marching Squares and Marching Cube Algorithms.",
                    "A Neural Approach for Solving the Constraint Satisfaction Problem.",
                    "Message Recovery Signature Scheme Using Complementary Elliptic Curves.",
                    "Performance, and Accuracy Improvements in Algorithms for Centred, Axes-Aligned Ellipses.",
                    "Family of G2 Cubic Transition Curves.",
                    "Improvement in Decimation of Triangle Meshes for Level of Detail.",
                    "An Unified Framework to Solve the Broad and Narrow Phases of the Collision Detection Problem in Virtual Prototype Environments.",
                    "A Fast and Memory-Efficient Method for LOD Modeling of Polygonal Models.",
                    "Proposition of Two Evolutionist Approachs - Genetic Algorithm and Neural Network - To Solve CSP.",
                    "Mobile Agent System Architecture for Supporting Mobile Market Application Service in Mobile Computing Environment.",
                    "An Obstacle-Avoiding Minimum Variation B-Spline Problem.",
                    "A Linear Complexity Algorithm for the Bernstein Basis.",
                    "Visual and Complexity Analysis of the Extended Loop Subdivision Scheme.",
                    "Synthetic Modelling System Architecture.",
                    "Bump Map Generation from 3D Scan Data.",
                    "FreeSculptor: A Computer-Aided Freeform Design Environment.",
                    "Computer Aided Ferret Design.",
                    "Research on Digitizing Processing of the Terracotta Warriors and Horses of the Qin Dynasty."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "GMP 2002",
        "info": "Wako, Saitama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2002",
                "sub_name": "2002 Geometric Modeling and Processing (GMP 2002), Theory and Applications, 10-12 July 2002, Wako, Saitama, Japan.",
                "count": 25,
                "papers": [
                    "Accelerated Volume Graphics.",
                    "The Algebra and Geometry of Curve and Surface Inversion.",
                    "Classifying the Nonsingular Intersection Curve of Two Quadric Surfaces.",
                    "The Minkowski Sum of Two Simple Surfaces Generated by Slope-Monotone Closed Curves.",
                    "Directions in the Use and Computation of Proximity Queries.",
                    "Construct Piecewise Hermite Interpolation Surface with Blending Methods.",
                    "Efficient Distance Computation for Quadratic Curves and Surfaces.",
                    "Acoustics Scattering on Arbitrary Manifold Surfaces.",
                    "Lofted Catmull-Clark Subdivision Surfaces.",
                    "Subdivision Surface Fitting from a Dense Triangle Mesh.",
                    "Hex-Dominant Mesh Generation with Directionality Control via Packing Rectangular Solid Cells.",
                    "Fair Triangle Mesh Generation with Discrete Elastica.",
                    "Mesh Smoothing via Mean and Median Filtering Applied to Face Normals.",
                    "Polyhedra Operators for Mesh Refinement.",
                    "Non-Manifold Implicit Surfaces Based on Discontinuous Implicitization and Polygonization.",
                    "Applying Knowledge to Reverse Engineering Problems.",
                    "Numerical Methods for Beautification of Reverse Engineered Geometric Models.",
                    "Direct Segmentation of Smooth, Multiple Point Regions.",
                    "An Automatic Construction of a Person's Face Model from the Person?s Two Orthogonal Views.",
                    "G1 Surface Interpolation for Irregularly Located Data.",
                    "Curved Shapes Construction for Object Recognition.",
                    "Information Models of Design Constraints for Collaborative Product Development.",
                    "Slicing and Contours Generation for Fabricating Heterogeneous Objects.",
                    "Mapping 2D Midship Drawings into 3D Structural Models based on STEP AP218.",
                    "Persistent Naming Through Persistent Entities."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "GMP 2000",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/gmp/2000",
                "sub_name": "Geometric Modeling and Processing 2000, Hong Kong, China, April 10-12, 2000.",
                "count": 39,
                "papers": [
                    "Reverse Engineering B-Rep Models from Multiple Point Clouds.",
                    "A System for Constructing Boundary Representation Solid Models from a Two-Dimensional Sketch.",
                    "Rapid 3D Model Acquisition from Images of Small Objects.",
                    "Geometric Processing for Analysis.",
                    "A Feature-Based Approach to Automatic Injection Mold Generation.",
                    "Effect of Fabric Properties on Cloth Draping Modeling.",
                    "A Representation Independent Geometric Modeling Kernel.",
                    "Dimension-Driven Parameterized Design of Free Form Objects.",
                    "On Families of Objects and Their Semantics.",
                    "Proximity Queries for Modeling and Manufacturing.",
                    "Distance Computation between Non-Convex Polyhedra at Short Range Based on Discrete Voronoi Regions.",
                    "A Sequence of Generalized Coordinate Systems Based on Voronoi Diagrams and Its Application to Interpolation.",
                    "Poisson Approximation.",
                    "Optimization of Knots for the Multi Curve B-Spline Approximation.",
                    "Constrained C1 Piecewise Bicubic Bézier Surface Interpolation.",
                    "Approximating NURBS Curves by Arc Splines.",
                    "A Method of Shape Control of Curve Design.",
                    "Recursive Formulae for Hermite Polynomial Approximations to Rational Bézier Curves.",
                    "Robust Watermarking of Polygonal Meshes.",
                    "On-Line Polygon Refining Using a Low Computation Subdivision Algorithm.",
                    "Using Most Isometric Parametrizations for Remeshing Polygonal Surfaces.",
                    "Polyhedral Surface Smoothing with Simultaneous Mesh Regularization.",
                    "Approximate Shortest Path on Polyhedral Surface Based on Selective Refinement of the Discrete Graph and Its Applications.",
                    "Generating Fair Meshes with G1 Boundary Conditions.",
                    "A Polygonal Approach for Interpolating Meshes of Curves by Subdivision Surfaces.",
                    "Catmull-Clark Surface Fitting for Reverse Engineering Applications.",
                    "Minkowski Roots of Complex Sets.",
                    "Rational Parametrization of Canal Surface by 4 Dimensional Minkowski Pythagorean Hodograph Curves.",
                    "Implicitization by Dixon A-Resultants.",
                    "Interval Methods in Geometric Modeling.",
                    "Bounding Interval Rational Bézier Curves with Interval Polynomial Bézier Curves.",
                    "Fast Conversion of Dynamic B-Spline Curves into a Set of Power Form Polynomial Curves.",
                    "On Optimal Tolerancing in Computer-Aided Design.",
                    "A Computational Model for Nonrational Bisector Surfaces: Curve-Surface and Surface-Surface Bisectors.",
                    "Surface Slicing Algorithm for Rapid Prototyping and Machining.",
                    "Gn-Blending with Rolling Ball Contact Curves.",
                    "Blending between Right Circular Cylinders with Parabolic Cyclides.",
                    "Constrained Shape Scaling of Multi-Surface Objects.",
                    "B-Spline Free-Form Deformation of Polygonal Objects through Fast Functional Composition."
                ]
            }
        ]
    }
]