[
    {
        "year": "2021",
        "name": "ICMR 2021",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2021",
                "sub_name": "ICMR '21: International Conference on Multimedia Retrieval, Taipei, Taiwan, August 21-24, 2021.",
                "count": 96,
                "papers": [
                    "Combining Adversarial and Reinforcement Learning for Video Thumbnail Selection.",
                    "Efficient Indexing of 3D Human Motions.",
                    "Global Relation-Aware Attention Network for Image-Text Retrieval.",
                    "MS-SincResNet: Joint Learning of 1D and 2D Kernels Using Multi-scale SincNet and ResNet for Music Genre Classification.",
                    "MLFont: Few-Shot Chinese Font Generation via Deep Meta-Learning.",
                    "Facial Structure Guided GAN for Identity-preserved Face Image De-occlusion.",
                    "Heterogeneous Side Information-based Iterative Guidance Model for Recommendation.",
                    "Dense Scale Network for Crowd Counting.",
                    "Leveraging Two Types of Global Graph for Sequential Fashion Recommendation.",
                    "HSGMP: Heterogeneous Scene Graph Message Passing for Cross-modal Retrieval.",
                    "GCNBoost: Artwork Classification by Label Propagation through a Knowledge Graph.",
                    "Can Action be Imitated? Learn to Reconstruct and Transfer Human Dynamics from Videos.",
                    "SAGN: Semantic Adaptive Graph Network for Skeleton-Based Human Action Recognition.",
                    "Text-Guided Visual Feature Refinement for Text-Based Person Search.",
                    "RGB-D Scene Recognition based on Object-Scene Relation and Semantics-Preserving Attention.",
                    "Multi-Feature Graph Attention Network for Cross-Modal Video-Text Retrieval.",
                    "HPOF: 3D Human Pose Recovery from Monocular Video with Optical Flow.",
                    "Leveraging EfficientNet and Contrastive Learning for Accurate Global-scale Location Estimation.",
                    "Relation-aware Hierarchical Attention Framework for Video Question Answering.",
                    "Cross-Modal Image-Recipe Retrieval via Intra- and Inter-Modality Hybrid Fusion.",
                    "Unsupervised Deep Cross-Modal Hashing by Knowledge Distillation for Large-scale Cross-modal Retrieval.",
                    "A Unified-Model via Block Coordinate Descent for Learning the Importance of Filter.",
                    "Local-enhanced Interaction for Temporal Moment Localization.",
                    "Reading Scene Text by Fusing Visual Attention with Semantic Representations.",
                    "Generative Adversarial Networks with Bi-directional Normalization for Semantic Image Synthesis.",
                    "A Smart Adversarial Attack on Deep Hashing Based Image Retrieval.",
                    "Image-to-Image Transfer Makes Chaos to Order.",
                    "Summary of the 2021 Embedded Deep Learning Object Detection Model Compression Competition for Traffic in Asian Countries.",
                    "Nested Dense Attention Network for Single Image Super-Resolution.",
                    "Multi-scale Dynamic Network for Temporal Action Detection.",
                    "Distractor-Aware Tracker with a Domain-Special Optimized Benchmark for Soccer Player Tracking.",
                    "Efficient Nearest Neighbor Search by Removing Anti-hub.",
                    "A Denoising Convolutional Neural Network for Self-Supervised Rank Effectiveness Estimation on Image Retrieval.",
                    "Know Yourself and Know Others: Efficient Common Representation Learning for Few-shot Cross-modal Retrieval.",
                    "Neural Symbolic Representation Learning for Image Captioning.",
                    "G-CAM: Graph Convolution Network Based Class Activation Mapping for Multi-label Image Recognition.",
                    "NASTER: Non-local Attentional Scene Text Recognizer.",
                    "Few-Shot Action Localization without Knowing Boundaries.",
                    "Learning Hierarchical Visual-Semantic Representation with Phrase Alignment.",
                    "Social Relation Analysis from Videos via Multi-entity Reasoning.",
                    "Aligning Visual Prototypes with BERT Embeddings for Few-Shot Learning.",
                    "TEACH: Attention-Aware Deep Cross-Modal Hashing.",
                    "Scene Text Recognition with Cascade Attention Network.",
                    "Multi-Attention Audio-Visual Fusion Network for Audio Spatialization.",
                    "Multi-Initialization Graph Meta-Learning for Node Classification.",
                    "Question-Guided Semantic Dual-Graph Visual Reasoning with Novel Answers.",
                    "Joint Hand-Object Pose Estimation with Differentiably-Learned Physical Contact Point Analysis.",
                    "HINFShot: A Challenge Dataset for Few-Shot Node Classification in Heterogeneous Information Network.",
                    "Learning to Select: A Fully Attentive Approach for Novel Object Captioning.",
                    "Semi-supervised Many-to-many Music Timbre Transfer.",
                    "Text-Enhanced Attribute-Based Attention for Generalized Zero-Shot Fine-Grained Image Classification.",
                    "Spatio-Temporal Activity Detection and Recognition in Untrimmed Surveillance Videos.",
                    "Cross-Modal Self-Attention with Multi-Task Pre-Training for Medical Visual Question Answering.",
                    "Body Shape Calculator: Understanding the Type of Body Shapes from Anthropometric Measurements.",
                    "Unsupervised Video Summarization via Multi-source Features.",
                    "Evaluating Contrastive Models for Instance-based Image Retrieval.",
                    "AWFA-LPD: Adaptive Weight Feature Aggregation for Multi-frame License Plate Detection.",
                    "NMS-Loss: Learning with Non-Maximum Suppression for Crowded Pedestrian Detection.",
                    "Image Retrieval by Hierarchy-aware Deep Hashing Based on Multi-task Learning.",
                    "Weakly Supervised Sketch Based Person Search.",
                    "Personal Knowledge Base Construction from Multimodal Data.",
                    "2.5D Pose Guided Human Image Generation.",
                    "Collaborative Representation for Deep Meta Metric Learning.",
                    "Ten Questions in Lifelog Mining and Information Recall.",
                    "Bag of Tricks for Building an Accurate and Slim Object Detector for Embedded Applications.",
                    "Efficient-ROD: Efficient Radar Object Detection based on Densely Connected Residual Network.",
                    "DANet: Dimension Apart Network for Radar Object Detection.",
                    "Object Detection on Embedded Systems for Traffic in Asian Countries.",
                    "Squeeze-and-Excitation network-Based Radar Object Detection With Weighted Location Fusion.",
                    "ROD2021 Challenge: A Summary for Radar Object Detection Challenge for Autonomous Driving Applications.",
                    "Embedded YOLO: Faster and Lighter Object Detection.",
                    "Radar Object Detection Using Data Merging, Enhancement and Fusion.",
                    "Scene-aware Learning Network for Radar Object Detection.",
                    "GPT2MVS: Generative Pre-trained Transformer-2 for Multi-modal Video Summarization.",
                    "Impact of Interaction Strategies on User Relevance Feedback.",
                    "Automatic Baseball Pitch Overlay.",
                    "Video Action Retrieval Using Action Recognition Model.",
                    "MeTILDA: Platform for Melodic Transcription in Language Documentation and Application.",
                    "IR Questioner: QA-based Interactive Retrieval System.",
                    "Reproducibility Companion Paper: Knowledge Enhanced Neural Fashion Trend Forecasting.",
                    "A Beneficial Dual Transformation Approach for Deep Learning Networks Used in Steel Surface Defect Detection.",
                    "Discrete Tchebichef Transform for Versatile Video Coding.",
                    "Fire Detection using Transformer Network.",
                    "Visible-infrared Person Re-identification with Human Body Parts Assistance.",
                    "Look Back Again: Dual Parallel Attention Network for Accurate and Robust Scene Text Recognition.",
                    "Contextualized Keyword Representations for Multi-modal Retinal Image Captioning.",
                    "MSAV: An Unified Framework for Multi-view Subspace Analysis with View Consistence.",
                    "A Tensor Sparse Representation-Based CBMIR System for Computer-Aided Diagnosis of Focal Liver Lesions and its Pilot Trial.",
                    "M-DFNet: Multi-phase Discriminative Feature Network for Retrieval of Focal Liver Lesions.",
                    "M2GUDA: Multi-Metrics Graph-Based Unsupervised Domain Adaptation for Cross-Modal Hashing.",
                    "Human Pose Estimation based on Attention Multi-resolution Network.",
                    "ICDAR'21: Intelligent Cross-Data Analysis and Retrieval.",
                    "Introduction to the Fourth Annual Lifelog Search Challenge, LSC'21.",
                    "MMArt-ACM'21: International Joint Workshop on Multimedia Artworks Analysis and Attractiveness Computing in Multimedia 2021.",
                    "MMPT'21: International Joint Workshop on Multi-Modal Pre-Training for Multimedia Understanding.",
                    "CEA'21: The 13th Workshop on Multimedia for Cooking and Eating Activities."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2021lsc",
                "sub_name": "Proceedings of the 4th Annual on Lifelog Search Challenge, LSC@ICMR 2021, Taipei, Taiwan, 21 August 2021.",
                "count": 17,
                "papers": [
                    "Lifelogging as a Memory Prosthetic.",
                    "Exquisitor at the Lifelog Search Challenge 2021: Relationships Between Semantic Classifiers.",
                    "Exploring Graph-querying approaches in LifeGraph.",
                    "Myscéal 2.0: A Revised Experimental Interactive Lifelog Retrieval System for LSC'21.",
                    "Exploring Intuitive Lifelog Retrieval and Interaction Modes in Virtual Reality with vitrivr-VR.",
                    "lifeXplore at the Lifelog Search Challenge 2021.",
                    "ViRMA: Virtual Reality Multimedia Analytics at LSC 2021.",
                    "Interactive Multimodal Lifelog Retrieval with vitrivr at LSC 2021.",
                    "LifeSeeker 3.0: An Interactive Lifelog Search Engine for LSC'21.",
                    "LifeConcept: An Interactive Approach for Multimodal Lifelog Retrieval through Concept Recommendation.",
                    "Memento: A Prototype Lifelog Search Engine for LSC'21.",
                    "PhotoCube at the Lifelog Search Challenge 2021.",
                    "Voxento 2.0: A Prototype Voice-controlled Interactive Search Engine for Lifelogs.",
                    "Enhanced SOMHunter for Known-item Search in Lifelog Data.",
                    "LifeMon: A MongoDB-Based Lifelog Retrieval Prototype.",
                    "Flexible Interactive Retrieval SysTem 2.0 for Visual Lifelog Exploration at LSC 2021.",
                    "XQC at the Lifelog Search Challenge 2021: Interactive Learning on a Mobile Device."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2021icdar",
                "sub_name": "ICDAR@ICMR 2021: Proceedings of the 2021 Workshop on Intelligent Cross-Data Analysis and Retrieval, Taipei, Taiwan, 21 August 2021.",
                "count": 14,
                "papers": [
                    "Session details: Keynote & Invited Talks.",
                    "Discovering Knowledge Hidden in Raster Images using RasterMiner.",
                    "Multimodal Virtual Avatars for Investigative Interviews with Children.",
                    "Session details: Session 1: Full Papers.",
                    "ST-HOI: A Spatial-Temporal Baseline for Human-Object Interaction Detection in Videos.",
                    "Temperature Forecasting using Tower Networks.",
                    "Scattering Transform Based Image Clustering using Projection onto Orthogonal Complement.",
                    "Pyramidal Segmentation of Medical Images using Adversarial Training.",
                    "Two-Faced Humans on Twitter and Facebook: Harvesting Social Multimedia for Human Personality Profiling.",
                    "Session details: Session 2: Short Papers.",
                    "Cross-Modal Deep Neural Networks based Smartphone Authentication for Intelligent Things System.",
                    "Models to Predict Sleeping Quality from Activities and Environment: Current Status, Challenges and Opportunities.",
                    "Dutkat: A Multimedia System for Catching Illegal Catchers in a Privacy-Preserving Manner.",
                    "Investigation on Privacy-Preserving Techniques For Personal Data."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2021mmpt",
                "sub_name": "MMPT@ICMR2021: Proceedings of the 2021 Workshop on Multi-Modal Pre-Training for Multimedia Understanding, Taipei, Taiwan, August 21, 2021.",
                "count": 8,
                "papers": [
                    "Cross-modal Pretraining and Matching for Video Understanding.",
                    "WenLan: Efficient Large-Scale Multi-Modal Pre-Training on Real World Data.",
                    "Be Specific, Be Clear: Bridging Machine and Human Captions by Scene-Guided Transformer.",
                    "Language-Conditioned Region Proposal and Retrieval Network for Referring Expression Comprehension.",
                    "Residual Recurrent CRNN for End-to-End Optical Music Recognition on Monophonic Scores.",
                    "Style-Guided Image-to-Image Translation for Multiple Domains.",
                    "A Fair and Comprehensive Comparison of Multimodal Tweet Sentiment Analysis Methods.",
                    "Unsupervised Training Data Generation of Handwritten Formulas using Generative Adversarial Networks with Self-Attention."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2021mmart",
                "sub_name": "MMArt-ACM '21: Proceedings of the 2021 International Joint Workshop on Multimedia Artworks Analysis and Attractiveness Computing in Multimedia 2021, Taipei, Taiwan, August 21, 2021.",
                "count": 4,
                "papers": [
                    "Automatic Music Composition with Transformers.",
                    "Color-Grayscale-Pair Image Sentiment Dataset and Its Application to Sentiment-Driven Image Color Conversion.",
                    "Ketchup GAN: A New Dataset for Realistic Synthesis of Letters on Food.",
                    "Estimating Groups of Featured Characters in Comics with Sequence of Characters' Appearance."
                ]
            },
            {
                "sub_name_abbr": "conf/cea/2021",
                "sub_name": "CEA '21: Proceedings of the 13th International Workshop on Multimedia for Cooking and Eating Activities, Taipei, Taiwan, August 21, 2021.",
                "count": 6,
                "papers": [
                    "IYASHI Recipe: Cooking Recipe Recommendation for Healing based on Physical Conditions and Human Relations.",
                    "Increasing Diversity through Dynamic Critique in Conversational Recipe Recommendations.",
                    "Region-Based Food Calorie Estimation for Multiple-Dish Meals.",
                    "Few-Shot and Zero-Shot Semantic Segmentation for Food Images.",
                    "Boosting Personalized Food Image Classifier by Sharing Food Records.",
                    "World Food Atlas Project."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ICMR 2020",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2020",
                "sub_name": "Proceedings of the 2020 on International Conference on Multimedia Retrieval, ICMR 2020, Dublin, Ireland, June 8-11, 2020.",
                "count": 90,
                "papers": [
                    "What Should I Do?",
                    "Medical Image Retrieval: Applications and Resources.",
                    "Beyond Relevance Feedback for Searching and Exploring large Multimedia Collections.",
                    "Automation of Deep Learning - Theory and Practice.",
                    "One Perceptron to Rule Them All: Language, Vision, Audio and Speech.",
                    "Visual Relations Augmented Cross-modal Retrieval.",
                    "Multimodal Analytics for Real-world News using Measures of Cross-modal Entity Consistency.",
                    "Human Object Interaction Detection via Multi-level Conditioned Network.",
                    "Explaining with Counter Visual Attributes and Examples.",
                    "Deep Semantic-Alignment Hashing for Unsupervised Cross-Modal Retrieval.",
                    "Forward and Backward Multimodal NMT for Improved Monolingual and Multilingual Cross-Modal Retrieval.",
                    "Heterogeneous Non-Local Fusion for Multimodal Activity Recognition.",
                    "Trajectory Prediction Network for Future Anticipation of Ships.",
                    "Knowledge Enhanced Neural Fashion Trend Forecasting.",
                    "Learning to Select Elements for Graphic Design.",
                    "Actor-Critic Sequence Generation for Relative Difference Captioning.",
                    "Interactivity Proposals for Surveillance Videos.",
                    "Sentence-based and Noise-robust Cross-modal Retrieval on Cooking Recipes and Food Images.",
                    "QIK: A System for Large-Scale Image Retrieval on Everyday Scenes With Common Objects.",
                    "Deep Discrete Attention Guided Hashing for Face Image Retrieval.",
                    "Image Synthesis from Locally Related Texts.",
                    "Automatic Color Scheme Extraction from Movies.",
                    "Compact Network Training for Person ReID.",
                    "Google Helps YouTube: Learning Few-Shot Video Classification from Historic Tasks and Cross-Domain Sample Transfer.",
                    "iSparse: Output Informed Sparsification of Neural Network.",
                    "Super-Resolution Coding Defense Against Adversarial Examples.",
                    "Continuous ODE-defined Image Features for Adaptive Retrieval.",
                    "Search Result Clustering in Collaborative Sound Collections.",
                    "EfficientFAN: Deep Knowledge Transfer for Face Alignment.",
                    "DAGC: Employing Dual Attention and Graph Convolution for Point Cloud based Place Recognition.",
                    "PredNet and Predictive Coding: A Critical Review.",
                    "Query-controllable Video Summarization.",
                    "Semantic Gated Network for Efficient News Representation.",
                    "System Fusion with Deep Ensembles.",
                    "Reducing Response Time for Multimedia Event Processing using Domain Adaptation.",
                    "Are You Watching Closely? Content-based Retrieval of Hand Gestures.",
                    "Efficient Base Class Selection Algorithms for Few-Shot Classification.",
                    "A Crowd Analysis Framework for Detecting Violence Scenes.",
                    "Towards Evaluating and Simulating Keyword Queries for Development of Interactive Known-item Search Systems.",
                    "Itinerary Planning via Deep Reinforcement Learning.",
                    "Confidence-based Weighted Loss for Multi-label Classification with Missing Labels.",
                    "Learning Fine-Grained Similarity Matching Networks for Visual Tracking.",
                    "At the Speed of Sound: Efficient Audio Scene Classification.",
                    "Imageability Estimation using Visual and Language Features.",
                    "Image Retrieval using Multi-scale CNN Features Pooling.",
                    "Analysis of the Effect of Dataset Construction Methodology on Transferability of Music Emotion Recognition Models.",
                    "One Shot Logo Recognition Based on Siamese Neural Networks.",
                    "Visual Story Ordering with a Bidirectional Writer.",
                    "Salienteye: Maximizing Engagement While Maintaining Artistic Style on Instagram Using Deep Neural Networks.",
                    "Attention Mechanisms, Signal Encodings and Fusion Strategies for Improved Ad-hoc Video Search with Dual Encoding Networks.",
                    "Emotion Recognition from Galvanic Skin Response Signal Based on Deep Hybrid Neural Networks.",
                    "Automatic Evaluation of Iconic Image Retrieval based on Colour, Shape, and Texture.",
                    "HLVU: A New Challenge to Test Deep Understanding of Movies the Way Humans do.",
                    "On Visualizations in the Role of Universal Data Representation.",
                    "An Interactive Learning System for Large-Scale Multimedia Analytics.",
                    "Object Detection for Unseen Domains while Reducing Response Time using Knowledge Transfer in Multimedia Event Processing.",
                    "Enabling Relevance-Based Exploration of Cataract Videos.",
                    "Automatic Reminiscence Therapy for Dementia.",
                    "Music Tower Blocks: Multi-Faceted Exploration Interface for Web-Scale Music Access.",
                    "A Framework for Paper Submission Recommendation System.",
                    "surgXplore: Interactive Video Exploration for Endoscopy.",
                    "Detection of Semantic Risk Situations in Lifelog Data for Improving Life of Frail People.",
                    "SenseMood: Depression Detection on Social Media.",
                    "An Active Learning Framework for Duplicate Detection in SaaS Platforms.",
                    "An Interactive Multimodal Retrieval System for Memory Assistant and Life Organized Support.",
                    "Visible-infrared Person Re-identification via Colorization-based Siamese Generative Adversarial Network.",
                    "iCap: Interactive Image Captioning with Predictive Text.",
                    "Multi-Attention Multimodal Sentiment Analysis.",
                    "MAENet: Boosting Feature Representation for Cross-Modal Person Re-Identification with Pairwise Supervision.",
                    "Incorporating Semantic Knowledge for Visual Lifelog Activity Recognition.",
                    "Anomaly Detection in Traffic Surveillance Videos with GAN-based Future Frame Prediction.",
                    "Multi-level Recognition on Falls from Activities of Daily Living.",
                    "Intelligent Task Recognition: Towards Enabling Productivity Assistance in Daily Life.",
                    "Flood Level Prediction via Human Pose Estimation from Social Media Images.",
                    "Continuous Health Interface Event Retrieval.",
                    "Detecting, Classifying, and Mapping Retail Storefronts Using Street-level Imagery.",
                    "Urban Movie Map for Walkers: Route View Synthesis using 360° Videos.",
                    "Urban Object Detection Kit: A System for Collection and Analysis of Street-Level Imagery.",
                    "YOLO-mini-tiger: Amur Tiger Detection.",
                    "Deep Adversarial Discrete Hashing for Cross-Modal Retrieval.",
                    "A Lightweight Gated Global Module for Global Context Modeling in Neural Networks.",
                    "Fake News Detection via Knowledge-driven Multimodal Graph Convolutional Networks.",
                    "Optimizing Queries over Video via Lightweight Keypoint-based Object Detection.",
                    "Multi-Graph Group Collaborative Filtering.",
                    "Rank-embedded Hashing for Large-scale Image Retrieval.",
                    "A Coordinated Representation Learning Enhanced Multimodal Machine Translation Approach with Multi-Attention.",
                    "CEA'20: The 12th Workshop on Multimedia for Cooking and Eating Activities.",
                    "ICDAR'20: Intelligent Cross-Data Analysis and Retrieval.",
                    "MMArt-ACM'20: International Joint Workshop on Multimedia Artworks Analysis and Attractiveness Computing in Multimedia 2020.",
                    "Introduction to the Third Annual Lifelog Search Challenge (LSC'20)."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2020lsc",
                "sub_name": "Proceedings of the Third ACM Workshop on Lifelog Search Challenge, LSC@ICMR 2020, Dublin, Ireland, June 8-11, 2020.",
                "count": 14,
                "papers": [
                    "Interactive Lifelog Retrieval with vitrivr.",
                    "VRLE: Lifelog Interaction Prototype in Virtual Reality: Lifelog Search Challenge at ACM ICMR 2020.",
                    "LifeGraph: A Knowledge Graph for Lifelogs.",
                    "Exquisitor at the Lifelog Search Challenge 2020.",
                    "Myscéal: An Experimental Interactive Lifelog Retrieval System for LSC'20.",
                    "A Multi-level Interactive Lifelog Search Engine with User Feedback.",
                    "lifeXplore at the Lifelog Search Challenge 2020.",
                    "BIDAL-HCMUS@LSC2020: An Interactive Multimodal Lifelog Retrieval with Query-to-Sample Attention-based Search Engine.",
                    "Multimodal Retrieval through Relations between Subjects and Objects in Lifelog Images.",
                    "LifeSeeker 2.0: Interactive Lifelog Search Engine at LSC 2020.",
                    "VIRET Tool with Advanced Visual Browsing and Feedback.",
                    "FIRST - Flexible Interactive Retrieval SysTem for Visual Lifelog Exploration at LSC 2020.",
                    "SOMHunter for Lifelog Search.",
                    "Voxento: A Prototype Voice-controlled Interactive Search Engine for Lifelogs."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2020mmart",
                "sub_name": "Proceedings of the 2020 Joint Workshop on Multimedia Artworks Analysis and Attractiveness Computing in Multimedia, MMArt&ACM 2020, Dublin, Ireland, June 8, 2020.",
                "count": 7,
                "papers": [
                    "Session details: Multimedia Artworks Analysis.",
                    "Style Image Retrieval for Improving Material Translation Using Neural Style Transfer.",
                    "Iconify: Converting Photographs into Icons.",
                    "BatikGAN: A Generative Adversarial Network for Batik Creation.",
                    "Session details: Attractiveness Computing in Multimedia.",
                    "Recommendations for Attractive Hairstyles.",
                    "Automatic YouTube-Thumbnail Generation and Its Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/cea/2020",
                "sub_name": "CEA '20: Proceedings of the 12th Workshop on Multimedia for Cooking and Eating Activities, Dublin, Ireland, June 8, 2020.",
                "count": 3,
                "papers": [
                    "Cooking Activity Recognition in Egocentric Videos with a Hand Mask Image Branch in the Multi-stream CNN.",
                    "Interactive Cake Decoration with Whipped Cream.",
                    "Cooking Recipe Analysis based on Sequences of Distributed Representation on Procedure Texts and Associated Images."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ICMR 2019",
        "info": "Ottawa, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2019",
                "sub_name": "Proceedings of the 2019 on International Conference on Multimedia Retrieval, ICMR 2019, Ottawa, ON, Canada, June 10-13, 2019.",
                "count": 61,
                "papers": [
                    "Keynote: Towards Explainability in AI and Multimedia Research.",
                    "Interactive Video Retrieval in the Age of Deep Learning.",
                    "Similarity Search in 3D Human Motion Data.",
                    "A Geographical-Temporal Awareness Hierarchical Attention Network for Next Point-of-Interest Recommendation.",
                    "The Focus-Aspect-Value Model for Explainable Prediction of Subjective Visual Interpretation.",
                    "Context-Aware Embeddings for Automatic Art Analysis.",
                    "Methods of Multi-Modal Data Exploration.",
                    "Benchmarking Search and Annotation in Continuous Human Skeleton Sequences.",
                    "A Genetic Programming Approach for Searching on Nearest Neighbors Graphs.",
                    "Weakly Supervised Image Retrieval via Coarse-scale Feature Fusion and Multi-level Attention Blocks.",
                    "Integrity Verification in Medical Image Retrieval Systems using Spread Spectrum Steganography.",
                    "An Unsupervised Genetic Algorithm Framework for Rank Selection and Fusion on Image Retrieval.",
                    "Collaborating CNN and SVM for Automatic Image Annotation.",
                    "Relationship Detection Based on Object Semantic Inference and Attention Mechanisms.",
                    "3D Human Tracking with Catadioptric Omnidirectional Camera.",
                    "Learning Task Relatedness in Multi-Task Learning for Images in Context.",
                    "High-Capacity Convolutional Video Steganography with Temporal Residual Modeling.",
                    "Learning Discriminative Features for Image Retrieval.",
                    "DeepMarks: A Secure Fingerprinting Framework for Digital Rights Management of Deep Learning Models.",
                    "Feature Pyramid Hashing.",
                    "Deep Policy Hashing Network with Listwise Supervision.",
                    "RobustiQ: A Robust ANN Search Method for Billion-scale Similarity Search on GPUs.",
                    "Triplet Fusion Network Hashing for Unpaired Cross-Modal Retrieval.",
                    "A Hierarchical Attentive Deep Neural Network Model for Semantic Music Annotation Integrating Multiple Music Representations.",
                    "Adversary Guided Asymmetric Hashing for Cross-Modal Retrieval.",
                    "Understanding, Categorizing and Predicting Semantic Image-Text Relations.",
                    "VIRET: A Video Retrieval Tool for Interactive Known-item Search.",
                    "Self-Supervised Visual Representations for Cross-Modal Retrieval.",
                    "Multimodal Dialog for Browsing Large Visual Catalogs using Exploration-Exploitation Paradigm in a Joint Embedding Space.",
                    "Unsupervised Rank-Preserving Hashing for Large-Scale Image Retrieval.",
                    "PhonoNet: Multi-Stage Deep Neural Networks for Raga Identification in Hindustani Classical Music.",
                    "Hierarchical Variational Network for User-Diversified & Query-Focused Video Summarization.",
                    "Stacked Self-Attention Networks for Visual Question Answering.",
                    "Joint Cluster Unary Loss for Efficient Cross-Modal Hashing.",
                    "Cross-Modal Video Moment Retrieval with Spatial and Language-Temporal Attention.",
                    "Deep Semantic Space with Intra-class Low-rank Constraint for Cross-modal Retrieval.",
                    "Assist Users' Interactions in Font Search with Unexpected but Useful Concepts Generated by Multimodal Learning.",
                    "Improving What Cross-Modal Retrieval Models Learn through Object-Oriented Inter- and Intra-Modal Attention Networks.",
                    "Deep Association: End-to-end Graph-Based Learning for Multiple Object Tracking with Conv-Graph Neural Network.",
                    "Multi-shot Person Re-identification through Set Distance with Visual Distributional Representation.",
                    "Take Goods from Shelves: A Dataset for Class-Incremental Object Detection.",
                    "Annotating Objects and Relations in User-Generated Videos.",
                    "Towards Cloud Distributed Image Indexing by Sparse Hashing.",
                    "Emotion Reinforced Visual Storytelling.",
                    "Who's Afraid of Adversarial Queries?: The Impact of Image Modifications on Content-based Image Retrieval.",
                    "RACKNet: Robust Allocation of Convolutional Kernels in Neural Networks for Image Classification.",
                    "A Benchmark of Visual Storytelling in Social Media.",
                    "qwLSH: Cache-conscious Indexing for Processing Similarity Search Query Workloads in High-Dimensional Spaces.",
                    "V3C1 Dataset: An Evaluation of Content Characteristics.",
                    "Increasingly Packing Multiple Facial-Informatics Modules in A Unified Deep-Learning Model via Lifelong Learning.",
                    "Cross-modal Collaborative Manifold Propagation for Image Recommendation.",
                    "Progressive Image Enhancement under Aesthetic Guidance.",
                    "Cross-Database Micro-Expression Recognition: A Benchmark.",
                    "Naturalness Preserved Image Aesthetic Enhancement with Perceptual Encoder Constraint.",
                    "Hierarchical Attention based Neural Network for Explainable Recommendation.",
                    "Image Emotion Distribution Learning with Graph Convolutional Networks.",
                    "Multimodal Multimedia Retrieval with vitrivr.",
                    "Recognizing User-Defined Subsequences in Human Motion Data.",
                    "DietLens-Eout: Large Scale Restaurant Food Photo Recognition.",
                    "Blockchain and IoT-based Secure Multimedia Retrieval System for a Massive Crowd: Sharing Economy Perspective.",
                    "EAGER: Edge-Aided imaGe undERstanding System."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2019lsc",
                "sub_name": "Proceedings of the ACM Workshop on Lifelog Search Challenge, LSC@ICMR 2019, Ottawa, ON, Canada, 10 June 2019.",
                "count": 9,
                "papers": [
                    "Smart Lifelog Retrieval System with Habit-based Concepts and Moment Visualization.",
                    "Exquisitor at the Lifelog Search Challenge 2019.",
                    "lifeXplore at the Lifelog Search Challenge 2019.",
                    "A Two-Level Lifelog Search Engine at the LSC 2019.",
                    "Enhanced VIRET Tool for Lifelog Data.",
                    "Retrieval of Structured and Unstructured Data with vitrivr.",
                    "VieLens, : An Interactive Search engine for LSC2019.",
                    "LifeSeeker: Interactive Lifelog Search Engine at LSC 2019.",
                    "An Interactive Approach to Integrating External Textual Knowledge for Multimodal Lifelog Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/cea/2019",
                "sub_name": "Proceedings of the 11th Workshop on Multimedia for Cooking and Eating Activities, CEA@ICMR 2019, Ottawa ON, Canada, June 10, 2019.",
                "count": 9,
                "papers": [
                    "Session details: Session 1: Long Oral Session.",
                    "Mixed Dish Recognition through Multi-Label Learning.",
                    "Frame Selection for Producing Recipe with Pictures from an Execution Video of a Recipe.",
                    "Session details: Session 2: Short Oral Session.",
                    "Foods Recommendation System for Meals-out in Nutrient Balance.",
                    "Learning Distributed Representation of Recipe Flow Graphs via Frequent Subgraphs.",
                    "Representation of Recipe Flow Graphs in Succinct Data Structures.",
                    "Application of Data Augmentation for Accurate Attractiveness Estimation for Food Photography.",
                    "Cooking State Recognition based on Acoustic Event Detection."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ICMR 2018",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2018",
                "sub_name": "Proceedings of the 2018 ACM on International Conference on Multimedia Retrieval, ICMR 2018, Yokohama, Japan, June 11-14, 2018.",
                "count": 77,
                "papers": [
                    "The Ongoing Evolution of Broadcast Technology.",
                    "Prototyping for Envisioning the Future.",
                    "Orion: An Integrated Multimedia Content Moderation System for Web Services.",
                    "Industrial Applications of Image Recognition and Retrieval Technologies for Public Safety and IT Services.",
                    "NEC's Object Recognition Technologies and their Industrial Applications.",
                    "Promoting Open Innovations in Real Estate Tech: Provision of the LIFULL HOME'S Data Set and Collaborative Studies.",
                    "Objects, Relationships, and Context in Visual Data.",
                    "Recommendation Technologies for Multimedia Content.",
                    "Multimedia Content Understanding by Learning from Very Few Examples: Recent Progress on Unsupervised, Semi-Supervised and Supervised Deep Learning Approaches.",
                    "Ranking News-Quality Multimedia.",
                    "Learning Joint Embedding with Multimodal Cues for Cross-Modal Video-Text Retrieval.",
                    "Class-aware Self-Attention for Audio Event Recognition.",
                    "Mining Exoticism from Visual Content with Fusion-based Deep Neural Networks.",
                    "Modal-adversarial Semantic Learning Network for Extendable Cross-modal Retrieval.",
                    "Cross-Modal Retrieval Using Deep De-correlated Subspace Ranking Hashing.",
                    "Learning Multilevel Semantic Similarity for Large-Scale Multi-Label Image Retrieval.",
                    "Multi-view Collective Tensor Decomposition for Cross-modal Hashing.",
                    "Binary Coding by Matrix Classifier for Efficient Subspace Retrieval.",
                    "Instance Image Retrieval by Aggregating Sample-based Discriminative Characteristics.",
                    "Deep Extreme Multi-label Learning.",
                    "Multimodal Network Embedding via Attention based Multi-view Variational Autoencoder.",
                    "Exploiting Relational Information in Social Networks using Geometric Deep Learning on Hypergraphs.",
                    "Automatic Prediction of Building Age from Photographs.",
                    "The PMEmo Dataset for Music Emotion Recognition.",
                    "Interpretable Partitioned Embedding for Customized Multi-item Fashion Outfit Composition.",
                    "A Multi-Oriented Scene Text Detector with Position-Sensitive Segmentation.",
                    "Scene Text Detection and Tracking in Video with Background Cues.",
                    "Recognizing Actions in Wearable-Camera Videos by Training Classifiers on Fixed-Camera Videos.",
                    "Annotating, Understanding, and Predicting Long-term Video Memorability.",
                    "Optimally Grouped Deep Features Using Normalized Cost for Video Scene Detection.",
                    "Transductive Zero-Shot Hashing via Coarse-to-Fine Similarity Mining.",
                    "Asymmetric Discrete Cross-Modal Hashing.",
                    "Collaborative Subspace Graph Hashing for Cross-modal Retrieval.",
                    "Dictionary Learning based Supervised Discrete Hashing for Cross-Media Retrieval.",
                    "Feature Reconstruction by Laplacian Eigenmaps for Efficient Instance Search.",
                    "Image Annotation Retrieval with Text-Domain Label Denoising.",
                    "Multi-label Triplet Embeddings for Image Annotation from User-Generated Tags.",
                    "Linguistic Patterns and Cross Modality-based Image Retrieval for Complex Queries.",
                    "A Context-Aware Late-Fusion Approach for Disaster Image Retrieval from Social Media.",
                    "Face Retrieval Framework Relying on User's Visual Memory.",
                    "Facial Expression Synthesis by U-Net Conditional Generative Adversarial Networks.",
                    "PatternNet: Visual Pattern Mining with Deep Neural Network.",
                    "Steganographer Detection based on Multiclass Dilated Residual Networks.",
                    "An Entropy Model for Loiterer Retrieval across Multiple Surveillance Cameras.",
                    "Visual Question Answering With a Hybrid Convolution Recurrent Model.",
                    "Searching and Matching Texture-free 3D Shapes in Images.",
                    "Challenges and Opportunities within Personal Life Archives.",
                    "Object Trajectory Proposal via Hierarchical Volume Grouping.",
                    "CBVMR: Content-Based Video-Music Retrieval Using Soft Intra-Modal Structure Constraint.",
                    "Multi-Scale Spatiotemporal Conv-LSTM Network for Video Saliency Detection.",
                    "Supervised Nonparametric Multimodal Topic Modeling Methods for Multi-class Video Classification.",
                    "Dense Dilated Network for Few Shot Action Recognition.",
                    "Precise Temporal Action Localization by Evolving Temporal Proposals.",
                    "Image Selection in Photo Albums.",
                    "Feature Selection and Multimodal Fusion for Estimating Emotions Evoked by Movie Clips.",
                    "Multimodal Continuous Prediction of Emotions in Movies using Long Short-Term Memory Networks.",
                    "Learning Perceptual Embeddings with Two Related Tasks for Joint Predictions of Media Interestingness and Emotions.",
                    "Deep Pairwise Classification and Ranking for Predicting Media Interestingness.",
                    "Perceptually-guided Understanding of Egocentric Video Content: Recognition of Objects to Grasp.",
                    "Towards Better Understanding of Player's Game Experience.",
                    "Multimodal Filtering of Social Media for Temporal Monitoring and Event Analysis.",
                    "A LiDAR Point Cloud Generator: from a Virtual World to Autonomous Driving.",
                    "3D Image-based Indoor Localization Joint With WiFi Positioning.",
                    "Compare Stereo Patches Using Atrous Convolutional Neural Networks.",
                    "Personal Basketball Coach: Tactic Training through Wireless Virtual Reality.",
                    "Extracting and Using Medical Expert Knowledge to Advance in Video Processing for Gynecologic Endoscopy.",
                    "Temporal Aggregation of Visual Features for Large-Scale Image-to-Video Retrieval.",
                    "Tourism Category Classification on Image Sharing Services Through Estimation of Existence of Reliable Results.",
                    "Considering Documents in Lifelog Information Retrieval.",
                    "VP-ReID: Vehicle and Person Re-Identification System.",
                    "VisLoiter+: An Entropy Model-Based Loiterer Retrieval System with User-Friendly Interfaces.",
                    "Automated Scanning and Individual Identification System for Parts without Marking or Tagging.",
                    "Dynamic Construction and Manipulation of Hierarchical Quartic Image Graphs.",
                    "WTPlant (What's That Plant?): A Deep Learning System for Identifying Plants in Natural Images.",
                    "MOOCex: Exploring Educational Video via Recommendation.",
                    "Who to Ask: An Intelligent Fashion Consultant.",
                    "A Simple Score Following System for Music Ensembles Using Chroma and Dynamic Time Warping."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2018lsc",
                "sub_name": "Proceedings of the 2018 ACM Workshop on The Lifelog Search Challenge, LSC@ICMR 2018, Yokohama, Japan, June 11, 2018.",
                "count": 8,
                "papers": [
                    "LSE2018 Panel - Challenges of Lifelog Search and Access.",
                    "lifeXplore at the Lifelog Search Challenge 2018.",
                    "LIFER: An Interactive Lifelog Retrieval System.",
                    "Using an Interactive Video Retrieval Tool for LifeLog Data.",
                    "Virtual Reality Lifelog Explorer: Lifelog Search Challenge at ACM ICMR 2018.",
                    "Lifelogging Retrieval based on Semantic Concepts Fusion.",
                    "An Interactive Lifelog Search Engine for LSC2018.",
                    "Geospatial Access to Lifelogging Photos in Virtual Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2018mmart",
                "sub_name": "Proceedings of the 2018 International Joint Workshop on Multimedia Artworks Analysis and Attractiveness Computing in Multimedia, MMArt&ACM@ICMR 2018, Yokohama, Japan, June 11, 2018.",
                "count": 7,
                "papers": [
                    "Digital Art by teamLab.",
                    "Doodle Master: A Doodle Beautification System Based on Auto-encoding Generative Adversarial Networks.",
                    "Photo Selection for Family Album using Deep Neural Networks.",
                    "Predicting Image Aesthetics using Objects in the Scene.",
                    "Colour Perception Characteristics of Women in Menopause.",
                    "Temporal Course of Neural Processing during Skin Color Perception: An Event-related Potential Study.",
                    "Modeling the Relation between Skin Attractiveness and Physical Characteristics."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2018retech",
                "sub_name": "Proceedings of the 2018 ACM Workshop on Multimedia for Real Estate Tech, RETech@ICMR 2018, Yokohama, Japan, June 11, 2018.",
                "count": 5,
                "papers": [
                    "Apartment Structure Estimation Using Fully Convolutional Networks and Graph Model.",
                    "Users' Preference Prediction of Real Estates Featuring Floor Plan Analysis using FloorNet.",
                    "Visual Estimation of Building Condition with Patch-level ConvNets.",
                    "Fast Semi-dense Depth Map Estimation.",
                    "Proposition of VR-MR Hybrid System for Sharing Living-in-Room."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ICMR 2017",
        "info": "Bucharest, Romania",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2017",
                "sub_name": "Proceedings of the 2017 ACM on International Conference on Multimedia Retrieval, ICMR 2017, Bucharest, Romania, June 6-9, 2017.",
                "count": 78,
                "papers": [
                    "Searching for A Thing.",
                    "Making a Cultural Visit with a Smart Mate.",
                    "Video Indexing, Search, Detection, and Description with Focus on TRECVID.",
                    "Generating Video Descriptions with Topic Guidance.",
                    "Estimating the Information Gap between Textual and Visual Representations.",
                    "MSRC: Multimodal Spatial Regression with Semantic Context for Phrase Grounding.",
                    "Leveraging Multi-modal Prior Knowledge for Large-scale Concept Learning in Noisy Web Data.",
                    "Transductive Visual-Semantic Embedding for Zero-shot Learning.",
                    "3D Facial Video Retrieval and Management for Decision Support in Speech and Language Therapy.",
                    "Music-Guided Video Summarization using Quadratic Assignments.",
                    "Insiders and Outsiders: Comparing Urban Impressions between Population Groups.",
                    "Deep Sentiment Features of Context and Faces for Affective Video Analysis.",
                    "Frame-Transformer Emotion Classification Network.",
                    "The Geo-Privacy Bonus of Popular Photo Enhancements.",
                    "Light Curve Analysis From Kepler Spacecraft Collected Data.",
                    "Health Multimedia: Lifestyle Recommendations Based on Diverse Observations.",
                    "An Unsupervised Distance Learning Framework for Multimedia Retrieval.",
                    "ClusterTag: Interactive Visualization, Clustering and Tagging Tool for Big Image Collections.",
                    "Scalable Hadoop-Based Pooled Time Series of Big Video Data from the Deep Web.",
                    "PACE: Prediction-based Annotation for Crowded Environments.",
                    "TEX-Nets: Binary Patterns Encoded Convolutional Neural Networks for Texture Recognition.",
                    "DeepHash for Image Instance Retrieval: Getting Regularization, Depth and Fine-Tuning Right.",
                    "Balanced Search Space Partitioning for Distributed Media Redundant Indexing.",
                    "Deep Supervised Hashing for Multi-Label and Large-Scale Image Retrieval.",
                    "Accelerated Nearest Neighbor Search with Quick ADC.",
                    "Improving Small Object Proposals for Company Logo Detection.",
                    "Discrete Multi-view Hashing for Effective Image Retrieval.",
                    "Quadruplet Networks for Sketch-Based Image Retrieval.",
                    "On the Automatic Identification of Music for Common Activities.",
                    "Improving Context-Aware Music Recommender Systems: Beyond the Pre-filtering Approach.",
                    "Groups Re-identification with Temporal Context.",
                    "Simple, Efficient and Effective Encodings of Local Deep Features for Video Action Recognition.",
                    "Musical Instrument Recognition in User-generated Videos using a Multimodal Convolutional Neural Network Architecture.",
                    "A Spatio-Temporal Category Representation for Brand Popularity Prediction.",
                    "Bridging the Aesthetic Gap: The Wild Beauty of Web Imagery.",
                    "Multimodal Analysis of Image Search Intent: Intent Recognition in Image Search from User Behavior and Visual Content.",
                    "Nested Invariance Pooling and RBM Hashing for Image Instance Retrieval.",
                    "Embedding Watermarks into Deep Neural Networks.",
                    "Learning to Detect Misleading Content on Twitter.",
                    "On the Selection of Anchors and Targets for Video Hyperlinking.",
                    "Visual Descriptors in Methods for Video Hyperlinking.",
                    "Linking Multimedia Content for Efficient News Browsing.",
                    "Multi-view Manifold Learning for Media Interestingness Prediction.",
                    "Utilising High-Level Features in Summarisation of Academic Presentations.",
                    "How to Make an Image More Memorable?: A Deep Style Transfer Approach.",
                    "Cross-modal Image-Graphics Retrieval by Neural Transfer Learning.",
                    "DRAW: Deep Networks for Recognizing Styles of Artists Who Illustrate Children's Books.",
                    "AMECON: Abstract Meta-Concept Features for Text-Illustration.",
                    "Leveraging Semantic Facets for Adaptive Ranking of Social Comments.",
                    "Multi-task Deep Neural Network for Joint Face Recognition and Facial Attribute Prediction.",
                    "Finger Vein Image Retrieval via Coding Scale-varied Superpixel Feature.",
                    "Joint Saliency Estimation and Matching using Image Regions for Geo-Localization of Online Video.",
                    "Panorama to Panorama Matching for Location Recognition.",
                    "Concept Language Models and Event-based Concept Number Selection for Zero-example Event Detection.",
                    "Tiny Transform Net for Mobile Image Stylization.",
                    "Query and Keyframe Representations for Ad-hoc Video Search.",
                    "Manga FaceNet: Face Detection in Manga based on Deep Neural Network.",
                    "Generative Adversarial Networks for Multimodal Representation Learning in Video Hyperlinking.",
                    "Efficient Indexing of Regional Maximum Activations of Convolutions using Full-Text Search Engines.",
                    "Family Photo Recognition via Multiple Instance Learning.",
                    "TaiChi: A Fine-Grained Action Recognition Dataset.",
                    "Conditional Fast Style Transfer Network.",
                    "Improving Image Classification using Coarse and Fine Labels.",
                    "Fast Multi-Modal Unified Sparse Representation Learning.",
                    "Badminton Video Analysis based on Spatiotemporal and Stroke Features.",
                    "Expo: An Expectation-oriented System for Selecting Important Photos from Personal Collections.",
                    "Multimodal Video Retrieval with the 2017 IMOTION System.",
                    "The JORD System: Linking Sky and Social Multimedia Data to Natural Disasters.",
                    "LireSolr: A Visual Information Retrieval Server.",
                    "VideoAnalysis4ALL: An On-line Tool for the Automatic Fragmentation and Concept-based Annotation, and the Interactive Exploration of Videos.",
                    "Visually Browsing Millions of Images Using Image Graphs.",
                    "A Generic Framework for Social Event Analysis.",
                    "Semi-Automatic Retrieval of Relevant Segments from Laparoscopic Surgery Videos.",
                    "On the Effectiveness of Distance Measures for Similarity Search in Multi-Variate Sensory Data: Effectiveness of Distance Measures for Similarity Search.",
                    "Classification of sMRI for Alzheimer's disease Diagnosis with CNN: Single Siamese Networks with 2D+? Approach and Fusion on ADNI.",
                    "With 5G Approaching, How will Audio/Video Technology that Serves 800 Million QQ Users Bring Forth New Ideas.",
                    "Information Retrieval from Multi-Sensor Data for Enriching Location Services at HERE Technologies.",
                    "Intelligently Connecting People with Information."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2017mfsec",
                "sub_name": "Proceedings of the 2nd International Workshop on Multimedia Forensics and Security, MFSec@ICMR 2017, Bucharest, Romania, June 6, 2017.",
                "count": 5,
                "papers": [
                    "Image Clustering by Source Camera via Sparse Representation.",
                    "Web Video Verification using Contextual Cues.",
                    "Threat Models and Games for Adversarial Multimedia Forensics.",
                    "An Approach for Automatic and Large Scale Image Forensics.",
                    "Detection of Terrorism-related Twitter Communities using Centrality Scores."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2017wearmme",
                "sub_name": "Proceedings of the 2017 Workshop on Wearable MultiMedia, WearMMe@ICMR 2017, Bucharest, Romania, June 6, 2017.",
                "count": 3,
                "papers": [
                    "On the Exploitation of Hidden Markov Models to Improve Location-Based Temporal Segmentation of Egocentric Videos.",
                    "Wearable for Wearable: A Social Signal Processing Perspective for Clothing Analysis using Wearable Devices.",
                    "Semi-Automatic Annotation with Predicted Visual Saliency Maps for Object Recognition in Wearable Video."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ICMR 2016",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2016",
                "sub_name": "Proceedings of the 2016 ACM on International Conference on Multimedia Retrieval, ICMR 2016, New York, New York, USA, June 6-9, 2016.",
                "count": 78,
                "papers": [
                    "Situation Recognition from Multimodal Data.",
                    "On the \"Face of Things\".",
                    "New Frontiers of Large Scale Multimedia Information Retrieval.",
                    "Matching User Photos to Online Products with Robust Deep Features.",
                    "Video Emotion Recognition with Transferred Deep Feature Encodings.",
                    "Scene-driven Retrieval in Edited Videos using Aesthetic and Semantic Deep Features.",
                    "ACD: Action Concept Discovery from Image-Sentence Corpora.",
                    "GPU-FV: Realtime Fisher Vector and Its Applications in Video Monitoring.",
                    "Mouse Activity as an Indicator of Interestingness in Video.",
                    "Automatic Identification of Sports Video Highlights using Viewer Interest Features.",
                    "Diverse Concept-Level Features for Multi-Object Classification.",
                    "Personalized Privacy-aware Image Classification.",
                    "The Science and Detection of Tilting.",
                    "Using Photos as Micro-Reports of Events.",
                    "Searching for Audio by Sketching Mental Images of Sound: A Brave New Idea for Audio Retrieval in Creative Music Production.",
                    "The LFM-1b Dataset for Music Retrieval and Recommendation.",
                    "Foreground Object Sensing for Saliency Detection.",
                    "Constrained Local Enhancement of Semantic Features by Content-Based Sparsity.",
                    "Event Detection with Zero Example: Select the Right and Suppress the Wrong Concepts.",
                    "Homemade TS-Net for Automatic Face Recognition.",
                    "Pooling Objects for Recognizing Scenes without Examples.",
                    "Multilingual Visual Sentiment Concept Matching.",
                    "Action Recognition by Learning Deep Multi-Granular Spatio-Temporal Video Representation.",
                    "A Short Survey of Recent Advances in Graph Matching.",
                    "The ImageNet Shuffle: Reorganized Pre-training for Video Event Detection.",
                    "Learning for Traffic State Estimation on Large Scale of Incomplete Data.",
                    "Diverse Yet Efficient Retrieval using Locality Sensitive Hashing.",
                    "Correlation Autoencoder Hashing for Supervised Cross-Modal Search.",
                    "Regional Subspace Projection Coding for Image Retrieval.",
                    "Scaling Group Testing Similarity Search.",
                    "Vinereactor: Crowdsourced Spontaneous Facial Expression Data.",
                    "Mirroring Facial Expressions: Evidence from Visual Analysis of Dyadic Interactions.",
                    "Sequential Correspondence Hierarchical Dirichlet Processes for Video Data Analysis.",
                    "A Computational Approach to Finding Facial Patterns of a Babyface.",
                    "Video Description Generation using Audio and Visual Cues.",
                    "Xplore-M-Ego: Contextual Media Retrieval Using Natural Language Queries.",
                    "Learning Music Embedding with Metadata for Context Aware Recommendation.",
                    "Region Trajectories for Video Semantic Concept Detection.",
                    "Audiovisual Summarization of Lectures and Meetings Using a Segment Similarity Graph.",
                    "Recurrent Support Vector Machines for Audio-Based Multimedia Event Detection.",
                    "Adding Chinese Captions to Images.",
                    "Emotion Recognition from EEG Signals Enhanced by User's Profile.",
                    "Multimodal Deep Convolutional Neural Network for Audio-Visual Emotion Recognition.",
                    "Large-Scale E-Commerce Image Retrieval with Top-Weighted Convolutional Neural Networks.",
                    "Web Video Popularity Prediction using Sentiment and Content Visual Features.",
                    "Accurate Aggregation of Local Features by using K-sparse Autoencoder for 3D Model Retrieval.",
                    "Image Annotation using Multi-scale Hypergraph Heat Diffusion Framework.",
                    "Discriminant Cross-modal Hashing.",
                    "CNN-based Style Vector for Style Image Retrieval.",
                    "MVC: A Dataset for View-Invariant Clothing Retrieval and Attribute Prediction.",
                    "A Quality Adaptive Multimodal Affect Recognition System for User-Centric Multimedia Indexing.",
                    "Rank Diffusion for Context-Based Image Retrieval.",
                    "Bags of Local Convolutional Features for Scalable Instance Search.",
                    "Interactive Multimodal Learning on 100 Million Images.",
                    "Combining Holistic and Part-based Deep Representations for Computational Painting Categorization.",
                    "Bidirectional Joint Representation Learning with Symmetrical Deep Neural Networks for Multimodal and Crossmodal Applications.",
                    "SSD Technology Enables Dynamic Maintenance of Persistent High-Dimensional Indexes.",
                    "Item-Based Video Recommendation: An Hybrid Approach considering Human Factors.",
                    "Human's Scene Sketch Understanding.",
                    "Retrieval of Multimedia Objects by Fusing Multiple Modalities.",
                    "Incremental Learning for Fine-Grained Image Recognition.",
                    "Spatially Localized Visual Dictionary Learning.",
                    "Semantic Binary Codes.",
                    "On the Effects of Spam Filtering and Incremental Learning for Web-Supervised Visual Concept Classification.",
                    "Semi-supervised Identification of Rarely Appearing Persons in Video by Correcting Weak Labels.",
                    "Introducing Concept And Syntax Transition Networks for Image Captioning.",
                    "SentiCart: Cartography and Geo-contextualization for Multilingual Visual Sentiment.",
                    "Personalized Retrieval and Browsing of Classical Music and Supporting Multimedia Material.",
                    "The Social Picture.",
                    "Watching What and How Politicians Discuss Various Topics: A Large-Scale Video Analytics UI.",
                    "Object-aware Deep Network for Commodity Image Retrieval.",
                    "An Automated End-To-End Pipeline for Fine-Grained Video Annotation using Deep Neural Networks.",
                    "Serendipity-driven Celebrity Video Hyperlinking.",
                    "Complura: Exploring and Leveraging a Large-scale Multilingual Visual Sentiment Ontology.",
                    "Multimodal Event Detection and Summarization in Large Scale Image Collections.",
                    "Multimodal Analysis of User-Generated Content in Support of Social Media Applications.",
                    "Multimodal Visual Pattern Mining with Convolutional Neural Networks.",
                    "Facial Landmark Detection and Tracking for Facial Behavior Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2016marmi",
                "sub_name": "Proceedings of the 1st International Workshop on Multimedia Analysis and Retrieval for Multimodal Interaction, MARMI@ICMR 2016, New York, New York, USA, June 6, 2016.",
                "count": 7,
                "papers": [
                    "Event-based MultiMedia Search and Retrieval for Question Answering.",
                    "Action Recognition Using Convolutional Restricted Boltzmann Machines.",
                    "A Multimodal Annotation Schema for Non-Verbal Affective Analysis in the Health-Care Domain.",
                    "Towards an Ontology-Driven Adaptive Dialogue Framework.",
                    "Towards a Multimedia Knowledge-Based Agent with Social Competence and Human Interaction Capabilities.",
                    "Effective Speaker Retrieval and Recognition through Vector Quantization and Unsupervised Distance Learning.",
                    "A Probabilistic Ranking Model for Audio Stream Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ICMR 2015",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2015",
                "sub_name": "Proceedings of the 5th ACM on International Conference on Multimedia Retrieval, Shanghai, China, June 23-26, 2015.",
                "count": 114,
                "papers": [
                    "Dense Models from Videos: Can YouTube be the Font of All Knowledge Bases?",
                    "Image Classification and Retrieval are ONE.",
                    "Social Event Mining in Large Photo Collections.",
                    "Unified YouTube Video Recommendation via Cross-network Collaboration.",
                    "Bridging the Ultimate Semantic Gap: A Semantic Search Engine for Internet Videos.",
                    "Fast Democratic Aggregation and Query Fusion for Image Search.",
                    "DeepIndex for Accurate and Efficient Image Retrieval.",
                    "Effective, Efficient, and Scalable Unsupervised Distance Learning in Image Retrieval Tasks.",
                    "Twin Feature and Similarity Maximal Matching for Image Retrieval.",
                    "Fusing Pointwise and Pairwise Labels for Supporting User-adaptive Image Retrieval.",
                    "Facial Action Unit Classification with Hidden Knowledge under Incomplete Annotation.",
                    "Extracting 3D Trajectories of Objects from 2D Videos using Particle Filter.",
                    "Space-time Histograms And Their Application To Person Re-identification In TV Shows.",
                    "Temporal Order-Preserving Dynamic Quantization for Human Action Recognition from Multimodal Sensor Streams.",
                    "Fine-Grained Image Categorization by Localizing TinyObject Parts from Unannotated Images.",
                    "Robust and Discriminative Concept Factorization for Image Representation.",
                    "Encoding Concept Prototypes for Video Event Detection and Summarization.",
                    "Discovering Semantic Vocabularies for Cross-Media Retrieval.",
                    "Semi-Supervised Image Classification by Nonnegative Sparse Neighborhood Propagation.",
                    "Hierarchical Encoding of Binary Descriptors for Image Matching.",
                    "Kernelizing Spatially Consistent Visual Matches for Fine-Grained Classification.",
                    "High-Dimensional Indexing by Sparse Approximation.",
                    "Diffusion-on-Manifold Aggregation of Local Features for Shape-based 3D Model Retrieval.",
                    "Bundling Centre for Landmark Image Discovery.",
                    "To Keep or not to Keep: An Expectation-oriented Photo Selection Method for Personal Photo Collections.",
                    "Latent Factors of Visual Popularity Prediction.",
                    "Visual Event Summarization on Social Media using Topic Modelling and Graph-based Ranking Algorithms.",
                    "Attribute Guided Dictionary Learning.",
                    "Online Multimodal Co-indexing and Retrieval of Weakly Labeled Web Image Collections.",
                    "Weakly Supervised Random Forest for Multi-Label Image Clustering and Segmentation.",
                    "Harvesting Multiple Sources for User Profile Learning: a Big Data Study.",
                    "A Privacy-Preserving Bipartite Graph Matching Framework for Multimedia Analysis and Retrieval.",
                    "Describing Images with Hierarchical Concepts and Object Class Localization.",
                    "Supervised Multi-scale Locality Sensitive Hashing.",
                    "A Novel Visual-Region-Descriptor-based Approach to Sketch-based Image Retrieval.",
                    "Location Prediction of Social Images via Generative Model.",
                    "Scalable Multimodal Search with Distributed Indexing by Sparse Hashing.",
                    "Insight in Image Collections by Multimedia Pivot Tables.",
                    "Distribution Regularized Nonnegative Matrix Factorization for Transfer Visual Feature Learning.",
                    "Heterogeneous Semantic Level Features Fusion for Action Recognition.",
                    "Social Friend Recommendation Based on Network Correlation and Feature Co-Clustering.",
                    "Improving Diversity in Image Search via Supervised Relevance Scoring.",
                    "Unsupervised Distance Learning by Rank Correlation Measures for Image Retrieval.",
                    "Exploring Pooling Strategies based on Idiosyncrasies of Spatio-Temporal Interest Points.",
                    "Image-Text Cross-Modal Retrieval via Modality-Specific Feature Learning.",
                    "Location-Based Parallel Tag Completion for Geo-tagged Social Image Retrieval.",
                    "Exploiting Spatial Relationship between Scenes for Hierarchical Video Geotagging.",
                    "Using Viewer's Facial Expression and Heart Rate for Sports Video Highlights Detection.",
                    "A Deep Neural Network for Modeling Music.",
                    "Robust Seed Localization and Growing with Deep Convolutional Features for Scene Text Detection.",
                    "Swap Retrieval: Retrieving Images of Cats When the Query Shows a Dog.",
                    "Graph Learning on K Nearest Neighbours for Automatic Image Annotation.",
                    "Scalable Organization of Collections of Motion Capture Data via Quantitative and Qualitative Analysis.",
                    "Content-Based Video Search over 1 Million Videos with 1 Core in 1 Second.",
                    "Bag-of-Fragments: Selecting and Encoding Video Fragments for Event Detection and Recounting.",
                    "Evaluating Two-Stream CNN for Video Classification.",
                    "Content-based Image Retrieval Using Rotation-invariant Histograms of Oriented Gradients.",
                    "Augmented Feature Fusion for Image Retrieval System.",
                    "Parallel AP Clustering and Re-ranking for Automatic Image-Text Alignment and Large-Scale Web Image Search.",
                    "Accio: A Data Set for Face Track Retrieval in Movies Across Age.",
                    "A Two-step Approach to Cross-modal Hashing.",
                    "Cross-Scenario Eyeglasses Retrieval via EGYPT Model.",
                    "People News Search via Name-Face Association Analysis.",
                    "Discovering the Latent Similarities of the KNN Graph by Metric Transformation.",
                    "Formation Period Matters: Towards Socially Consistent Group Detection via Dense Subgraph Seeking.",
                    "Memory Vectors for Particular Object Retrieval with Multiple Queries.",
                    "Semantic-aware Hashing for Social Image Retrieval.",
                    "Zero-shot Image Categorization by Image Correlation Exploration.",
                    "Deep Bottleneck Feature for Image Classification.",
                    "Maximally Visual-Homogeneous Region Detector for Large Scale Image Retrieval.",
                    "Rapid Clothing Retrieval via Deep Learning of Binary Codes and Hierarchical Search.",
                    "Information Gain Study for Visual Vocabulary Construction.",
                    "Discriminative Latent Feature Space Learning for Cross-Modal Retrieval.",
                    "Image Retrieval by User-oriented Ranking.",
                    "Spatial Constraint for Image Location Estimation.",
                    "Shape-based Object Matching Using Point Context.",
                    "Large Scale Image Annotation via Deep Representation Learning and Tag Embedding Learning.",
                    "Probabilistic Matrix Factorization With Semantic And Visual Neighborhoods For Image Tag Completion.",
                    "Exploiting Multiple Web Resources towards Collecting Positive Training Samples for Visual Concept Learning.",
                    "CRMActive: An Active Learning Based Approach for Effective Video Annotation and Retrieval.",
                    "Personalized Egocentric Video Summarization for Cultural Experience.",
                    "EMIF: Towards a Scalable and Effective Indexing Framework for Large Scale Music Retrieval.",
                    "Specific Person Retrieval via Incomplete Text Description.",
                    "Combining Generic and Specific Information for Cross-modal Retrieval.",
                    "3D Sketch-Based 3D Model Retrieval.",
                    "Boosting Prediction of Geo-location for Web Images Through Integrating Multiple Knowledge Sources.",
                    "Expression Recognition from Visible Images with the Help of Thermal Images.",
                    "Multi-facet Learning using Deep Convolutional Neural Network for Person-Related Categories in Photos.",
                    "Sketch-based Image Retrieval via Shape Words.",
                    "Multiple Aesthetic Attribute Assessment by Exploiting Relations Among Aesthetic Attributes.",
                    "Emotion Recognition from EEG Signals using Hierarchical Bayesian Network with Privileged Information.",
                    "Multi-Label Active Learning with Chi-Square Statistics for Image Classification.",
                    "Multiple Measurements and Joint Dimensionality Reduction for Large Scale Image Search with Short Vectors.",
                    "Exploring EEG for Object Detection and Retrieval.",
                    "Kernel Local Descriptors with Implicit Rotation Matching.",
                    "Semantic Concept Annotation For User Generated Videos Using Soundtracks.",
                    "Automatic Image Annotation using Deep Learning Representations.",
                    "\"My Day in Review\": Visually Summarising Noisy Lifelog Data.",
                    "Audio-Based Multimedia Event Detection with DNNs and Sparse Sampling.",
                    "Learning Binary Codes for Hashing via Feature Decomposition.",
                    "Mutlimodal Learning with Deep Boltzmann Machine for Emotion Prediction in User Generated Videos.",
                    "Improving Automatic Name-Face Association using Celebrity Images on the Web.",
                    "End-to-End Photo-Sketch Generation via Fully Convolutional Representation Learning.",
                    "Teaching Video Analytics Based on Student Spatial and Temporal Behavior Mining.",
                    "Multi-view Face Detection Using Deep Convolutional Neural Networks.",
                    "Music Positioning and Annotation For Television Videos.",
                    "KinectSBR: A Kinect-Assisted 3D Sketch-Based 3D Model Retrieval System.",
                    "An Improved System For Real-Time Scene Text Recognition.",
                    "DigInPix: Visual Named-Entities Identification in Images and Videos.",
                    "Mobile Media Thumbnailing.",
                    "IdeaPanel: A Large Scale Interactive Sketch-based Image Search System.",
                    "A Sparse Ensemble Learning System For Efficient Semantic Indexing.",
                    "A Multi-Sensory Gesture-Based Occupational Therapy Environment for Controlling Home Appliances.",
                    "Incremental Multimodal Query Construction for Video Search."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2015emr",
                "sub_name": "Proceedings of the 2nd International Workshop on Environmental Multimedia Retrieval, EMR@ICMR 2015, Shanghai, China, June 23-26, 2015.",
                "count": 7,
                "papers": [
                    "Grass, Scrub, Tree, Random Forest and Human in the Loop: Automatic habitat classification based on digital photographs.",
                    "Complex Background Leaf-based Plant Identification Method Based on Interactive Segmentation and Kernel Descriptor.",
                    "Environmental Microorganism Classification Using Sparse Coding and Weakly Supervised Learning.",
                    "Image Processing and Classification Procedure for the Analysis of Australian Frog Vocalisations.",
                    "Automated Analysis of Wild Fish Behavior in a Natural Habitat.",
                    "Discovery of Environmental Web Resources Based on the Combination of Multimedia Evidence.",
                    "Evaluation of Air Quality Using Dynamic Land-use Regression and Fusion of Environmental Information."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ICMR 2014",
        "info": "Glasgow, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2014",
                "sub_name": "International Conference on Multimedia Retrieval, ICMR '14, Glasgow, United Kingdom - April 01 - 04, 2014.",
                "count": 91,
                "papers": [
                    "Event-Driven Semantic Concept Discovery by Exploiting Weakly Tagged Internet Images.",
                    "Multimedia Event Detection Using Hidden Conditional Random Fields.",
                    "Composite Concept Discovery for Zero-Shot Video Event Detection.",
                    "Video event detection using generalized subclass discriminant analysis and linear support vector machines.",
                    "Massive Query Expansion by Exploiting Graph Knowledge Bases for Image Retrieval.",
                    "Superimage: Packing Semantic-Relevant Images for Indexing and Retrieval.",
                    "Toward efficient, privacy-aware media classification on public databases.",
                    "Discriminative Cellets Discovery for Fine-Grained Image Categories Retrieval.",
                    "Athmos: Focus+Context for Browsing in Mobile Thumbnail Collections.",
                    "A Cross-media Model for Automatic Image Annotation.",
                    "Image Tagging with Social Assistance.",
                    "Improving the Quality of K-NN Graphs for Image Databases through Vector Sparsification.",
                    "Monte Carlo Sampling based Salient Region Detection.",
                    "Minimally Needed Evidence for Complex Event Recognition in Unconstrained Videos.",
                    "Sparse Kernel Learning for Image Annotation.",
                    "Towards Efficient Learning of Optimal Spatial Bag-of-Words Representations.",
                    "Image re-ranking based on statistics of frequent patterns.",
                    "Story-based Video Retrieval in TV series using Plot Synopses.",
                    "Realtime Video Classification using Dense HOF/HOG.",
                    "Attribute-based People Search: Lessons Learnt from a Practical Surveillance System.",
                    "Improving Neighborhood-Based Collaborative Filtering by Reducing Hubness.",
                    "Brand Data Gathering From Live Social Media Streams.",
                    "Emotionally Representative Image Discovery for Social Events.",
                    "Just-for-Me: An Adaptive Personalization System for Location-Aware Social Music Recommendation.",
                    "Viral Video Style: A Closer Look at Viral Videos on YouTube.",
                    "A Real-time Complex Event Discovery Platform for Cyber-Physical-Social Systems.",
                    "Context in Video Search: Is Close-by Good Enough When Using Linking?",
                    "Experiments with Segmentation Strategies for Passage Retrieval in Audio-Visual Documents.",
                    "Multimodal Reranking of Content-based Recommendations for Hyperlinking Video Snippets.",
                    "Predicting Viewer Affective Comments Based on Image Content in Social Media.",
                    "ISOMER: Informative Segment Observations for Multimedia Event Recounting.",
                    "Iterative Random Visual Word Selection.",
                    "Semi-Supervised Rank Learning for Multimedia Known-Item Search.",
                    "When textual and visual information join forces for multimedia retrieval.",
                    "Search Strategies for Pattern Identification in Multimodal Data: Three Case Studies.",
                    "How Well Do Computational Features Perceptually Rank Textures? A Comparative Evaluation.",
                    "Modeling Concept Dependencies for Event Detection.",
                    "Zero-Example Event Search using MultiModal Pseudo Relevance Feedback.",
                    "Interactive Surveillance Event Detection through Mid-level Discriminative Representation.",
                    "ReEnact: Sketch based Choreographic Design from Archival Dance Footage.",
                    "Multi-Modal Image Retrieval for Complex Queries using Small Codes.",
                    "Placing Photos with a Multimodal Probability Density Function.",
                    "On detection of novel categories and subcategories of images using incongruence.",
                    "Unsupervised Distance Learning By Reciprocal kNN Distance for Image Retrieval.",
                    "Automatic Detection of CSA Media by Multi-modal Feature Fusion for Law Enforcement Support.",
                    "Learning to Rank Similar Apparel Styles with Economically-Efficient Rule-Based Active Learning.",
                    "A Hybrid Model for Automatic Image Annotation.",
                    "Collecting and Annotating Human Activities in Web Videos.",
                    "\"Nobody comes here anymore, it's too crowded\"; Predicting Image Popularity on Flickr.",
                    "Experimental Investigation of Transitions for Mixed Speech and Music Playlist Generation.",
                    "Rank-Preserving and Unsupervised Hash Learning from Auxiliary Contextual Cues.",
                    "Robust aggregation of GWAP tracks for local image annotation.",
                    "Scalable Image Search with Multiple Index Tables.",
                    "Covariance of Covariance Features for Image Classification.",
                    "A Representative Local Region Detector Based On Color-Contrast-MSER.",
                    "Highly Efficient Multimedia Event Recounting from User Semantic Preferences.",
                    "Source Separation Improves Music Emotion Recognition.",
                    "Sketch-Based Image Retrieval via Adaptive Weighting.",
                    "Instance classification with prototype selection.",
                    "Infrequent concept pairs detection in multimedia documents.",
                    "Indexing Vectors of Locally Aggregated Descriptors Using Inverted Files.",
                    "Selective Multi-cotraining for Video Concept Detection.",
                    "Dating Color Images with Ordinal Classification.",
                    "The Rijksmuseum Challenge: Museum-Centered Visual Recognition.",
                    "Improved Hierarchical Clustering for Face Images in Videos: Integrating positional and temporal information with HAC.",
                    "Few-Example Video Event Retrieval using Tag Propagation.",
                    "An Application Search Interface Including Sense-related Search Facets.",
                    "The Mystery of Faces: Investigating Face Contribution for Multimedia Event Detection.",
                    "Efficient Face Detection by Leveraging Knowledge from Large-Scale Photos.",
                    "Salient features for visual word based image copy detection.",
                    "OpenCV Performance Measurements on Mobile Devices.",
                    "Joint Audio-Visual Words for Violent Scenes Detection in Movies.",
                    "Estimation of the Representative Story Transition in a Chronological Semantic Structure of News Topics.",
                    "A Combined Approach of Structured and Non-structured IR in Multimodal Domain.",
                    "A Robust Audio Similarity Estimation Method for Audio Alignment in Mobile Karaoke Apps.",
                    "Stop-Frame Removal Improves Web Video Classification.",
                    "Gesture Interaction for Content-based Medical Image Retrieval.",
                    "Mobile Music Genius: Reggae at the Beach, Metal on a Friday Night?",
                    "3D Image Browsing: The Planets.",
                    "CeleBrowser: An example of browsing big data on small device.",
                    "On-the-Fly Video Event Search by Semantic Signatures.",
                    "A Visualization Tool for Violent Scenes Detection.",
                    "On Effective Known Item Video Search Using Feature Signatures.",
                    "Pl@ntNet Mobile 2014: Android port and new features.",
                    "A Low-cost Serious Game Therapy Environment with Inverse Kinematic Feedback for Children Having Physical Disability.",
                    "Flower Classification for a Citizen Science Mobile App.",
                    "VideoJot: A Multifunctional Video Annotation Tool.",
                    "SocialZap: Catch-up on Interesting Television Fragments Discovered from Social Media.",
                    "CLAN Photo Presenter: Multi-modal Summarization Tool for Image Collections.",
                    "A System Framework for Concept- and Credibility-Based Multimedia Retrieval.",
                    "Astera - A model for Multimodal IR with a Combined Approach of Structured and Non-structured Retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2014somus",
                "sub_name": "Proceedings of the 1st International Workshop on Social Multimedia and Storytelling co-located with ACM International Conference on Multimedia Retrieval (ICMR 2014), Glasgow, Scotland, UK, April 1, 2014.",
                "count": 9,
                "papers": [
                    "SoMuS: Social Multimedia and Storytelling.",
                    "The Rise of Mobile Social Video: An In-depth Analysis of Vine.",
                    "Towards Boosting Video Popularity via Tag Selection.",
                    "Extracting Resources that Help Tell Events' Stories.",
                    "Two Sides to Every Story: Subjective Event Summarization of Sports Events using Twitter.",
                    "StreamGrid: Summarization of Large Scale Events using Topic Modelling and Temporal Analysis.",
                    "Sweet FA: Sentiment, Swearing and Soccer.",
                    "Telling Breaking News Stories from Wikipedia with Social Multimedia: A Case Study of the 2014 Winter Olympics.",
                    "A Model for Interactive CSR Campaigns using Storytelling."
                ]
            },
            {
                "sub_name_abbr": "conf/mir/2014emr",
                "sub_name": "Proceedings of the 1st International Workshop on Environnmental Multimedia Retrieval co-located with ACM International Conference on Multimedia Retrieval, EMR@ICMR 2014, Glasgow, UK, April 1, 2014.",
                "count": 9,
                "papers": [
                    "Automating the web publishing process of environmental data by using semantic annotations.",
                    "LifeCLEF: Multimedia life species identification.",
                    "Point-based medialness for animal and plant identification.",
                    "Do geographic features impact pictures location shared on the Web? Modeling photographic suitability in the Swiss Alps.",
                    "The extraction and fusion of meteorological and air quality information for orchestrated services.",
                    "Identification of plant species on large botanical image datasets.",
                    "A mission-oriented citizen science platform for efficient flower classification based on combination of feature descriptors.",
                    "Multiple leaflets-based identification approach for compound leaf species.",
                    "Focussed crawling of environmental web resources: A pilot study on the combination of multimedia evidence."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ICMR 2013",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2013",
                "sub_name": "International Conference on Multimedia Retrieval, ICMR'13, Dallas, TX, USA, April 16-19, 2013.",
                "count": 58,
                "papers": [
                    "Retrieving geo-location of videos with a divide & conquer hierarchical multimodal approach.",
                    "A unified framework for context assisted face clustering.",
                    "Indexing and searching 100M images with map-reduce.",
                    "Feature propagation on image webs for enhanced image retrieval.",
                    "Learning attribute-aware dictionary for image classification and search.",
                    "Signature matching distance for content-based image retrieval.",
                    "Tag completion based on belief theory and neighbor voting.",
                    "Searching visual instances with topology checking and context modeling.",
                    "Fisher kernel based relevance feedback for multimodal video retrieval.",
                    "A cross-media evolutionary timeline generation framework based on iterative recommendation.",
                    "Geo-visual ranking for location prediction of social images.",
                    "Recommendations for video event recognition using concept vocabularies.",
                    "Fusing matching and biometric similarity measures for face diarization in video.",
                    "Getting the look: clothing recognition and segmentation for automatic product suggestions in everyday photos.",
                    "Bundle min-hashing for logo recognition.",
                    "Fast nonrigid 3D retrieval using modal space transform.",
                    "A shape-based approach for leaf classification using multiscaletriangular representation.",
                    "Social event detection with robust high-order co-clustering.",
                    "Social events and social ties.",
                    "Heterogeneous features and model selection for event-based media classification.",
                    "Jointly exploiting visual and non-visual information for event-related social media retrieval.",
                    "Automated social event detection in large photo collections.",
                    "A semantic model for cross-modal and multi-modal retrieval.",
                    "Direct modeling of image keypoints distribution through copula-based image signatures.",
                    "Identification of plants from multiple images and botanical IdKeys.",
                    "HSOG: a novel local descriptor based on histograms of second order gradients for object categorization.",
                    "Towards automatic object annotations from global image labels.",
                    "A naive mid-level concept-based fusion approach to violence detection in Hollywood movies.",
                    "An information retrieval approach to identifying infrequent events in surveillance video.",
                    "Exploiting language models to recognize unseen actions.",
                    "Large-scale visual concept detection with explicit kernel maps and power mean SVM.",
                    "A general Framework of video segmentation to logical unit based on conditional random fields.",
                    "Searching informative concept banks for video event detection.",
                    "Tagging human activities in video by crowdsourcing.",
                    "Who produced this video, amateur or professional?",
                    "Markov random fields for sketch based video retrieval.",
                    "Multimedia information seeking through search and hyperlinking.",
                    "Explicit diversification of image search.",
                    "Twitter's visual pulse.",
                    "Mobile video browsing with a 3D filmstrip.",
                    "Interactive surveillance event detection at TRECVid2012.",
                    "EventEnricher: a novel way to collect media illustrating events.",
                    "Dynamic multimedia exploration using SIFT matching.",
                    "The AXES PRO video search system.",
                    "An android application for leaf-based plant identification.",
                    "Video2Book: semi-automatic tool to create mediaproducts from videos on smart phones.",
                    "Multimedia interactive therapy environment for children having physical disabilities.",
                    "Visualizing progressive discovery.",
                    "ObjectSense: a scalable multi-objects recognition system based on partial-duplicate image retrieval.",
                    "Flexible navigation in smartphones and tablets using scalable storyboards.",
                    "ZhiWo: activity tagging and recognition system for personal lifelogs.",
                    "Connect commercial films with realities.",
                    "Expression analysis in the wild: from individual to groups.",
                    "Towards fusion of collective knowledge and audio-visual content features for annotating broadcast video.",
                    "Next generation image and video browsing on mobile devices.",
                    "Semantic indexing and computational aesthetics: interactions, bridgesand boundaries.",
                    "CueNet: a context discovery framework to tag personal photos.",
                    "Toward segmentation of popular music."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ICMR 2012",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2012",
                "sub_name": "International Conference on Multimedia Retrieval, ICMR '12, Hong Kong, China, June 5-8, 2012.",
                "count": 67,
                "papers": [
                    "High-confidence near-duplicate image detection.",
                    "Beyond audio and video retrieval: towards multimedia summarization.",
                    "Name that sculpture.",
                    "Fusing concept detection and geo context for visual search.",
                    "Multi-modal region selection approach for training object detectors.",
                    "Classification based group photo retrieval with bag of people features.",
                    "SUPER: towards real-time event recognition in internet videos.",
                    "All vehicles are cars: subclass preferences in container concepts.",
                    "Content is still king: the effect of neighbor voting schemes on tag relevance for social image retrieval.",
                    "Because not all displays are lists.",
                    "Analysing Facebook features to support event detection for photo-based Facebook applications.",
                    "Watching and talking: media content as social nexus.",
                    "Security-oriented picture-in-picture visual modifications.",
                    "Efficient video copy detection via aligning video signature time series.",
                    "Bayesian approach for near-duplicate image detection.",
                    "Constrained keypoint quantization: towards better bag-of-words model for large-scale multimedia retrieval.",
                    "Ordinal preserving projection: a novel dimensionality reduction method for image ranking.",
                    "Compact hashing for mixed image-keyword query over multi-label images.",
                    "Hamming embedding similarity-based image classification.",
                    "Exploring two spaces with one feature: kernelized multidimensional modeling of visual alphabets.",
                    "Social event detection and retrieval in collaborative photo collections.",
                    "Event-based classification of social media streams.",
                    "Social event detection using multimodal clustering and integrating supervisory signals.",
                    "Linking visual concept detection with viewer demographics.",
                    "Cross-modal categorisation of user-generated video sequences.",
                    "Making a scene: alignment of complete sets of clips based on pairwise audio match.",
                    "Visual pattern discovery for architecture image classification and product image search.",
                    "Learning to summarize web image and text mutually.",
                    "An extensible personal photograph collection for graded relevance assessments and user simulation.",
                    "Musical keys and chords recognition using unsupervised learning with infinite Gaussian mixture.",
                    "Contour canonical form: an efficient intrinsic embedding approach to matching non-rigid 3D objects.",
                    "Semiconducting bilinear deep learning for incomplete image recognition.",
                    "Color CENTRIST: a color descriptor for scene categorization.",
                    "Video retrieval by mimicking poses.",
                    "Multi-graph multi-instance learning for object-based image and video retrieval.",
                    "Efficient graffiti image retrieval.",
                    "Joint-rerank: a novel method for image search reranking.",
                    "Multimodal feature generation framework for semantic image classification.",
                    "Joint audio-visual bi-modal codewords for video event detection.",
                    "ImageTerrier: an extensible platform for scalable high-performance image retrieval.",
                    "Indexing media by personal events.",
                    "Labelset anchored subspace ensemble (LASE) for multi-label annotation.",
                    "Distributed KNN-graph approximation via hashing.",
                    "Deriving a discriminative color model for a given object class from weakly labeled training data.",
                    "Quantity versus quality: the role of layout and interaction complexity in thumbnail-based video retrieval interfaces.",
                    "Geo-based automatic image annotation.",
                    "Video saliency detection with robust temporal alignment and local-global spatial contrast.",
                    "Discovering inherent event taxonomies from social media collections.",
                    "Advanced shape context for plant species identification using leaf image retrieval.",
                    "Classifier-specific intermediate representation for multimedia tasks.",
                    "Multimodal knowledge-based analysis in multimedia event detection.",
                    "Large vocabulary quantization for searching instances from videos.",
                    "A visual approach for video geocoding using bag-of-scenes.",
                    "A RELIEF-based modality weighting approach for multimodal information retrieval.",
                    "Supervised dictionary learning for music genre classification.",
                    "Multimodal fusion for image retrieval using matrix factorization.",
                    "nepDroid: an intelligent mobile music player.",
                    "One size does not fit all: multimodal search on mobile and desktop devices with the I-SEARCH search engine.",
                    "PythiaSearch: a multiple search strategy-supportive multimedia retrieval system.",
                    "Cluster-based photo browsing and tagging on the go.",
                    "Mobile image browsing on a 3D globe: demo paper.",
                    "Categorization of a collection of pictures into structured events.",
                    "Texmix: an automatically generated news navigation portal.",
                    "Supporting browsing of user generated video on a tablet.",
                    "World seer: a realtime geo-tweet photo mapping system.",
                    "Image exploration using online feature extraction and reranking.",
                    "Active learning of custom sound taxonomies in unstructured audio data."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ICMR 2011",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2011",
                "sub_name": "Proceedings of the 1st International Conference on Multimedia Retrieval, ICMR 2011, Trento, Italy, April 18 - 20, 2011.",
                "count": 76,
                "papers": [
                    "MuMIe: a new system for multimedia metadata interoperability.",
                    "Efficient clustering and quantisation of SIFT features: exploiting characteristics of the SIFT descriptor and interest region detectors under image inversion.",
                    "Synthetically trained multi-view object class and viewpoint detection for advanced image retrieval.",
                    "Summarization of personal photologs using multidimensional content and context.",
                    "Water reflection recognition via minimizing reflection cost based on motion blur invariant moments.",
                    "Biometric animal databases from field photographs: identification of individual zebra in the wild.",
                    "Learning reconfigurable hashing for diverse semantics.",
                    "Large-scale music exploration in hierarchically organized landscapes using prototypicality information.",
                    "Interactive schematic summaries for exploration of surveillance video.",
                    "A color-action perceptual approach to the classification of animated movies.",
                    "TV program segmentation using multi-modal information fusion.",
                    "Social negative bootstrapping for visual categorization.",
                    "Exploiting contextual spaces for image re-ranking and rank aggregation.",
                    "Exploiting photographic style for category-level image classification by generalizing the spatial pyramid.",
                    "Fusing heterogeneous modalities for video and image re-ranking.",
                    "Lost in binarization: query-adaptive ranking for similar image search with compact codes.",
                    "Harmonic style-based song retrieval using N-gram.",
                    "Attribute-based vehicle search in crowded surveillance videos.",
                    "Accurate content-based video copy detection with efficient feature indexing.",
                    "Scalable triangulation-based logo recognition.",
                    "Interpretable visual models for human perception-based object retrieval.",
                    "Face alignment via joint-AAM.",
                    "A comprehensive neural-based approach for text recognition in videos using natural language processing.",
                    "Indexing the signature quadratic form distance for efficient content-based multimedia retrieval.",
                    "Scalable logo recognition in real-world images.",
                    "STELA: sketch-based 3D model retrieval using a structure-based local approach.",
                    "Folksonomy-boosted social media search and ranking.",
                    "A kernel density based approach for large scale image retrieval.",
                    "Consumer video understanding: a benchmark database and an evaluation of human and machine performance.",
                    "Learning crop regions for content-aware generation of thumbnail images.",
                    "A comparison of extended fingerprint hashing and locality sensitive hashing for binary audio fingerprints.",
                    "Graph-based methods for the automatic annotation and retrieval of art prints.",
                    "Social media driven image retrieval.",
                    "Adaptive clustering and interactive visualizations to support the selection of video clips.",
                    "Large-scale EMM identification based on geometry-constrained visual word correspondence voting.",
                    "Botanical data retrieval system supporting discovery learning.",
                    "ShotTagger: tag location for internet videos.",
                    "Person-specific age estimation under ranking framework.",
                    "Saliency moments for image categorization.",
                    "Instant video summarization during shooting with mobile phone.",
                    "3D model retrieval using accurate pose estimation and view-based similarity.",
                    "Pairwise weak geometric consistency for large scale image search.",
                    "An eye-tracking-based approach to facilitate interactive video search.",
                    "Semantic combination of textual and visual information in multimedia retrieval.",
                    "Relevance feedback strategies for artistic image collections tagging.",
                    "Active learning through notes data in Flickr: an effortless training data acquisition approach for object localization.",
                    "Scene-based image retrieval by transitive matching.",
                    "Finding locations of flickr resources using language models and similarity search.",
                    "Consistent visual words mining with adaptive sampling.",
                    "Spatial codebooks for image categorization.",
                    "Automatic tagging and geotagging in video collections and communities.",
                    "Multi-modal, multi-resource methods for placing Flickr videos on the map.",
                    "Large scale visual-based event matching.",
                    "NV-Tree: nearest neighbors at the billion scale.",
                    "Image modality classification: a late fusion method based on confidence indicator and closeness matrix.",
                    "Diversity ranking for video retrieval from a broadcaster archive.",
                    "Learning people co-occurrence relations by using relevance feedback for retrieving group photos.",
                    "Finding media illustrating events.",
                    "Locally regressive G-optimal design for image retrieval.",
                    "Component-based track inspection using machine-vision technology.",
                    "Landmark recognition in VISITO: VIsual Support to Interactive TOurism in Tuscany.",
                    "Embracing semantics in zoomable user interface.",
                    "Image and video browsing with a cylindrical 3D storyboard.",
                    "The hyper media news system for multimodal and personalised fruition of informative content.",
                    "City exploration by use of spatio-temporal analysis and clustering of user contributed photos.",
                    "Lookapp: interactive construction of web-based concept detectors.",
                    "Considerations for a touchscreen visual lifelog.",
                    "High-level event detection system based on discriminant visual concepts.",
                    "Instant Bag-of-Words served on a laptop.",
                    "PhotoCube: effective and efficient multi-dimensional browsing of personal photo collections.",
                    "RetrievalLab: a programming tool for content based retrieval.",
                    "Multimedia retrieval in social networks for photo book creation.",
                    "A parallel cross-modal search engine over large-scale multimedia collections with interactive relevance feedback.",
                    "Automated detection of errors and quality issues in audio-visual content.",
                    "Photo summary: automated selection of representative photos from a digital collection.",
                    "A flexible environment for multimedia management and publishing."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "MIR 2010",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2010",
                "sub_name": "Proceedings of the 11th ACM SIGMM International Conference on Multimedia Information Retrieval, MIR 2010, Philadelphia, Pennsylvania, USA, March 29-31, 2010.",
                "count": 81,
                "papers": [
                    "Bioimage informatics: recent advances and challenges.",
                    "Multimedia processing for advanced content services.",
                    "Semantic understanding of geotagged pictures.",
                    "Next generation map making: automation from mobile data collection.",
                    "Multimedia semantics: opportunities and challenges.",
                    "Implementing a content-based public-oriented audio and video news retrieval system.",
                    "Recovering the past through computation: new techniques for cultural heritage.",
                    "Recognition of object categories using affine kernels.",
                    "Relevance filtering meets active learning: improving web-based concept detectors.",
                    "Performance measures for multilabel evaluation: a case study in the area of image classification.",
                    "Video retargeting with multi-scale trajectory optimization.",
                    "Exploring automatic music annotation with \"acoustically-objective\" tags.",
                    "Multimodal ranking for image search on community databases.",
                    "3d object retrieval using salient views.",
                    "Texture image retrieval using compact texton co-occurrence matrix descriptor.",
                    "Incremental indexing and distributed image search using shared randomized vocabularies.",
                    "Exploiting external knowledge to improve video retrieval.",
                    "AdaOUBoost: adaptive over-sampling and under-sampling to boost the concept learning in large scale imbalanced data sets.",
                    "Effective and scalable video copy detection.",
                    "Robust image copy detection using multi-resolution histogram.",
                    "Sublinear querying of realistic timeseries and its application to human motion.",
                    "A classification-driven similarity matching framework for retrieval of biomedical images.",
                    "Chest x-ray characterization: from organ identification to pathology categorization.",
                    "Multimodal medical image retrieval: image categorization to improve search precision.",
                    "Redundancy, redundancy, redundancy: the three keys to highly robust anatomical parsing in medical images.",
                    "An investigation into the relationship between semantic and content based similarity using LIDC.",
                    "Augmenting clinical observations with visual features from longitudinal MRI data for improved dementia diagnosis.",
                    "Wavelet, active basis, and shape script: a tour in the sparse land.",
                    "Discovering word associations in news media via feature selection and sparse classification.",
                    "Intensity based nonparametric image registration.",
                    "Speculation on the generality of the backward stepwise view of PCA.",
                    "Quest for relevant tags using local interaction networks and visual content.",
                    "Multimodal retrieval and ranking: more than waveforms.",
                    "Learning similarity in heterogeneous data.",
                    "Music retrieval from everything.",
                    "Automated analysis of performance variations in folk song recordings.",
                    "Improving automatic music classification performance by extracting features from different types of data.",
                    "Feature selection for content-based, time-varying musical emotion regression.",
                    "Topic models for semantics-preserving video compression.",
                    "Learning to rank for content-based image retrieval.",
                    "Face-and-clothing based people clustering in video content.",
                    "Region-based automatic web image selection.",
                    "Stratification-based keyframe cliques for removal of near-duplicates in video search results.",
                    "Distances and weighting schemes for bag of visual words image retrieval.",
                    "A matrix modular SVM robust to imbalanced data for efficient visual concept detection.",
                    "Beyond 2D-grids: a dependence maximization view on image browsing.",
                    "Wikipedia-assisted concept thesaurus for better web media understanding.",
                    "Combining visual features and text data for medical image retrieval using latent semantic kernels.",
                    "SNDocRank: a social network-based video search ranking framework.",
                    "NewsRoom: an information-seeking support system for news videos.",
                    "SVE: an integrated system for soccer video edition.",
                    "The lIGVID system for video retrieval and concept annotation.",
                    "Sharing of baseball event through social media.",
                    "Shape rank: efficient web3D search technique using 3D features.",
                    "Tag dictionary and its applications.",
                    "Analyzing real mobile web usage of a multimedia streaming application through log files.",
                    "Controlling your TV with gestures.",
                    "Combinatorial ECG analysis for mobile devices.",
                    "Eva: an evaluation tool for comparing descriptors in content-based image retrieval tasks.",
                    "QbS: searching for known images using user-drawn sketches.",
                    "ACQUINE: aesthetic quality inference engine - real-time automatic rating of photo aesthetics.",
                    "Digimatge, a rich internet application for video retrieval from a multimedia asset management system.",
                    "Meerkat: exploring semantic music discovery using personalized radio.",
                    "From microblogs to social images: event analytics for situation assessment.",
                    "Assessment of the utility of tag clouds for faster image retrieval.",
                    "Visualization for increased understanding and learning using augmented reality.",
                    "Automatic image captioning from the web for GPS photographs.",
                    "Body sensor data processing using stream computing.",
                    "Adaptive sized windows to improve real-time health monitoring: a case study on heart attack prediction.",
                    "Multimodal analysis of body sensor network data streams for real-time healthcare.",
                    "Processing body sensor data streams for continuous physiological monitoring.",
                    "The participation payoff: challenges and opportunities for multimedia access in networked communities.",
                    "Object-based tag propagation for semi-automatic annotation of images.",
                    "Semantic structuring and retrieval of event chapters in social photo collections.",
                    "An interactive framework for image annotation through gaming.",
                    "New trends and ideas in visual concept detection: the MIR flickr retrieval evaluation initiative.",
                    "Image annotation with tagprop on the MIRFLICKR set.",
                    "Automatically annotating the MIR Flickr dataset: experimental protocols, openly available data and semantic spaces.",
                    "How reliable are annotations via crowdsourcing: a study about inter-annotator agreement for multi-label image annotation.",
                    "Minimum explanation complexity for MOD based visual concept detection.",
                    "The influence of internet hypes on multimedia information retrieval research."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "MIR 2008",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2008",
                "sub_name": "Proceedings of the 1st ACM SIGMM International Conference on Multimedia Information Retrieval, MIR 2008, Vancouver, British Columbia, Canada, October 30-31, 2008.",
                "count": 64,
                "papers": [
                    "What are the 7 millennium problems in multimedia information retrieval?",
                    "Mining GPS traces and visual words for event classification.",
                    "Combining image descriptors to effectively retrieve events from visual lifelogs.",
                    "Monitoring visual focus of attention via local discriminant projection.",
                    "Spirittagger: a geo-aware tag suggestion tool mined from flickr.",
                    "Locating key views for image indexing of spaces.",
                    "The MIR flickr retrieval evaluation.",
                    "Face annotation for personal photos using context-assisted face recognition.",
                    "A string matching approach for visual retrieval and classification.",
                    "Large scale image copy detection evaluation.",
                    "Diversifying image search with user generated content.",
                    "Automatic image tagging as a random walk with priors on the canonical correlation subspace.",
                    "A critical assessment of spoken utterance retrieval through approximate lattice representations.",
                    "A generalized graph-spectral approach to melodic modeling and retrieval.",
                    "Content-based mood classification for photos and music: a generic multi-modal classification framework and evaluation approach.",
                    "Large-scale content-based audio retrieval from text queries.",
                    "On enabling techniques for personal audio content management.",
                    "Searching musical audio datasets by a batch of multi-variant tracks.",
                    "An efficient image normalization method for face recognition under varying illuminations.",
                    "Can relevance of images be inferred from eye movements?",
                    "Cross-media manifold learning for image retrieval & annotation.",
                    "Extracting contextual information from multiuser systems for improving annotation-based retrieval of image data.",
                    "Graph-based multiple-instance learning for object-based image retrieval.",
                    "Image retrieval using query by contextual example.",
                    "Late fusion of heterogeneous methods for multimedia image retrieval.",
                    "Learning tag relevance by neighbor voting for social image retrieval.",
                    "Multimodal photo annotation and retrieval on a mobile phone.",
                    "Ontology enhanced web image retrieval: aided by wikipedia & spreading activation theory.",
                    "Interest points based on maximization of distinctiveness.",
                    "A salient-point signature for 3d object retrieval.",
                    "Component based shape retrieval using differential profiles.",
                    "Robust foreground segmentation based on two effective background models.",
                    "Multimedia information retrieval: watershed events.",
                    "CuZero: embracing the frontier of interactive visual search for informed users.",
                    "Action video retrieval based on atomic action vocabulary.",
                    "Optimizing video search reranking via minimum incremental information loss.",
                    "Human activity localization via sequential change detection.",
                    "Place retrieval with graph-based place-view model.",
                    "Solving the label resolution problem in supervised video content classification.",
                    "Spatio-temporal features for robust content-based video copy detection.",
                    "Spatio-temporal pyramid matching for sports videos.",
                    "Transductive multi-label learning for video concept detection.",
                    "View-invariant action recognition using interest points.",
                    "An efficient indexing structure for multimedia data.",
                    "Applications of description logics to improve multimedia information retrieval for efficient educational tools.",
                    "Improving object detection by removing noisy samples from training sets.",
                    "Perplexity-based evidential neural network classifier fusion using mpeg-7 low-level visual features.",
                    "Semantic lattices for multiple annotation of images.",
                    "Towards a structure-based multimedia retrieval model.",
                    "A novel approach to enable semantic and visual image summarization for exploratory image search.",
                    "A set theoretical method for video synopsis.",
                    "Aggregated cross-media news visualization and personalization.",
                    "\"Inside the bible\": segmentation, annotation and retrieval for a new browsing experience.",
                    "Multimedia ontology learning for automatic annotation and video browsing.",
                    "A rectilinearity measurement for 3d meshes.",
                    "Multiresolution wavelet analysis of shape orientation for 3d shape retrieval.",
                    "Ranking on semantic manifold for shape-based 3d model retrieval.",
                    "Unsupervised modeling and recognition of object categories with combination of visual contents and geometric similarity links.",
                    "Outdoors augmented reality on mobile phone using loxel-based visual feature organization.",
                    "Video copy detection based on source device characteristics: a complementary approach to content-based methods.",
                    "Collaborative learning for image and video annotation.",
                    "An efficient algorithm for keyframe-based motion retrieval in the presence of temporal deformations.",
                    "Assessing concept selection for video retrieval.",
                    "A framework for classifier adaptation and its applications in concept detection."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "MIR 2007",
        "info": "Augsburg, Bavaria, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2007",
                "sub_name": "Proceedings of the 9th ACM SIGMM International Workshop on Multimedia Information Retrieval, MIR 2007, Augsburg, Bavaria, Germany, September 24-29, 2007.",
                "count": 38,
                "papers": [
                    "Managing 3D: our next problem.",
                    "Semantic search.",
                    "New challenges in multimedia research for the increasingly connected and fast growing digital society.",
                    "Regularized regression on image manifold for retrieval.",
                    "Clustering near-duplicate images in large collections.",
                    "Learning semantic categories for 3D model retrieval.",
                    "Learning user intention in relevance feedback using optimization.",
                    "RoleNet: treat a movie as a small society.",
                    "Video diver: generic video indexing with diverse features.",
                    "Combining multimodal preferences for multimedia information retrieval.",
                    "Trademark matching and retrieval in sports video databases.",
                    "Unsupervised content-based indexing of sports video.",
                    "Semantic-event based analysis and segmentation of wedding ceremony videos.",
                    "Effective retrieval of polyphonic audio with polyphonic symbolic queries.",
                    "Visual language modeling for image classification.",
                    "Optimal decomposition of P2P networks based on file exchange patterns for multimedia content search & replication.",
                    "Music similarity: improvements of edit-based algorithms by considering music theory.",
                    "Sample-based creation of peer summaries for efficient similarity search in scalable peer-to-peer networks.",
                    "Tempo induction algorithm in MP3 compressed domain.",
                    "Visual & textual fusion for region retrieval: from both fuzzy matching and bayesian reasoning aspects.",
                    "Stratified helix information of medial-axis-points matching for 3D model retrieval.",
                    "Exploiting redundancy in cross-channel video retrieval.",
                    "Adapting appearance models of semantic concepts to particular videos via transductive learning.",
                    "Evaluating bag-of-visual-words representations in scene classification.",
                    "Searching for repeated video sequences.",
                    "TV ad video categorization with probabilistic latent concept learning.",
                    "Building a comprehensive ontology to refine video concept detection.",
                    "Scene duplicate detection from videos based on trajectories of feature points.",
                    "Kodak's consumer video benchmark data set: concept definition and annotation.",
                    "Large-scale multimodal semantic concept detection for consumer video.",
                    "Multi-modality web video categorization.",
                    "Watch what I watch: using community activity to understand content.",
                    "Learning people annotation from the web via consistency learning.",
                    "ITEMS: intelligent travel experience management system.",
                    "Personalized multimedia retrieval: the new trend?",
                    "Browsing visual collections using graphs.",
                    "Personalized retrieval of sports video.",
                    "Evaluating the implicit feedback models for adaptive video retrieval."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "MIR 2006",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2006",
                "sub_name": "Proceedings of the 8th ACM SIGMM International Workshop on Multimedia Information Retrieval, MIR 2006, October 26-27, 2006, Santa Barbara, California, USA.",
                "count": 38,
                "papers": [
                    "Interactive image retrieval by mental matching.",
                    "Unified and scalable learning in multimedia information retrieval.",
                    "Diversity in multimedia information retrieval research.",
                    "Description and retrieval of 3D face models using iso-geodesic stripes.",
                    "Quantization-based probabilistic feature modeling for kernel design in content-based image retrieval.",
                    "Exploring temporal consistency for video analysis and retrieval.",
                    "Dual diffusion model of spreading activation for content-based image retrieval.",
                    "Using score distributions for query-time fusion in multimediaretrieval.",
                    "An adaptive graph model for automatic image annotation.",
                    "Low cost soccer video summaries based on visual rhythm.",
                    "Incorporating concept ontology to enable probabilistic concept reasoning for multi-level image annotation.",
                    "Generating summaries and visualization for large collections of geo-referenced photographs.",
                    "Robust scene recognition using language models for scene contexts.",
                    "Similarity learning via dissimilarity space in CBIR.",
                    "Adaptive image retrieval using a Graph model for semantic feature integration.",
                    "Visual pattern discovery using web images.",
                    "Dynamic similarity search in multi-metric spaces.",
                    "Combining audio-based similarity with web-based data to accelerate automatic music playlist generation.",
                    "Retrieval of Ottoman documents.",
                    "Unsupervised learning from a corpus for shape-based 3D model retrieval.",
                    "Image classification using cluster cooccurrence matrices of local relational features.",
                    "Mining temporal patterns of movement for video content classification.",
                    "Joint categorization of queries and clips for web-based video search.",
                    "Constant tangential angle elected interest points.",
                    "Video summarization using personal photo libraries.",
                    "Assembling personal speech collections by monologue scene detection from a news video archive.",
                    "Automatically selecting shots for action movie trailers.",
                    "Matching slides to presentation videos using SIFT and scene background matching.",
                    "To search or to label?: predicting the performance of search-based automatic image classifiers.",
                    "Dynamic storyboards for video content summarization.",
                    "Scalable search-based image annotation of personal images.",
                    "Efficient filtering with sketches in the ferret toolkit.",
                    "Efficient semantic annotation method for indexing large personal video database.",
                    "Benchmarking image and video retrieval: an overview.",
                    "Usage-oriented multimedia information retrieval technological evaluation.",
                    "Human performance measures for video retrieval.",
                    "Benchmarking multimedia search in structured collections.",
                    "Evaluation campaigns and TRECVid."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "MIR 2005",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2005",
                "sub_name": "Proceedings of the 7th ACM SIGMM International Workshop on Multimedia Information Retrieval, MIR 2005, November 10-11, 2005, Singapore.",
                "count": 34,
                "papers": [
                    "From relevance to intelligence: toward next generation web search.",
                    "Video search: opportunities & challenges.",
                    "Multimedia information retrieval: what is it, and why isn't anyone using it?",
                    "Active semi-supervised fuzzy clustering for image database categorization.",
                    "Mutual relevance feedback for multimodal query formulation in video retrieval.",
                    "Player identification in soccer videos.",
                    "Tracking concept drifting with an online-optimized incremental learning framework.",
                    "Low-cost distributed learning of a Gaussian mixture model for multimedia content-based indexing on a peer-to-peer network.",
                    "Similarity space projection for web image search and annotation.",
                    "Probabilistic web image gathering.",
                    "Multi-graph enabled active learning for multimodal web image retrieval.",
                    "Inferring similarity between music objects with application to playlist generation.",
                    "Framework for personalized multimedia summarization.",
                    "Enhanced ontologies for video annotation and retrieval.",
                    "Semi-automatic video annotation based on active learning with multiple complementary predictors.",
                    "A motion-flow-based fast video retrieval system.",
                    "Video booklet: a natural video searching and browsing interface.",
                    "A new general framework for shot boundary detection and key-frame extraction.",
                    "A unified framework for semantic shot representation of sports video.",
                    "Semantic image classification with hierarchical feature subset selection.",
                    "Photo-to-search: using multimodal queries to search the web from mobile devices.",
                    "Multiple random walk and its application in content-based image retrieval.",
                    "Scenario optimization for interactive category search.",
                    "Macroblock mode decision for H.264.",
                    "A mutual semantic endorsement approach to image retrieval and context provision.",
                    "Exploiting temporal discontinuities for event detection and manipulation in video streams.",
                    "An interactive system for mental face retrieval.",
                    "Discriminant local features selection using efficient density estimation in a large database.",
                    "Hybrid visual and conceptual image representation within active relevance feedback context.",
                    "Evaluation strategies for image understanding and retrieval.",
                    "Localized content based image retrieval.",
                    "A content-based image retrieval system for fish taxonomy.",
                    "Extracting information from multimedia meeting collections.",
                    "Content-based image retrieval: approaches and trends of the new age."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "MIR 2004",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2004",
                "sub_name": "Proceedings of the 6th ACM SIGMM International Workshop on Multimedia Information Retrieval, MIR 2004, October 15-16, 2004, New York, NY, USA.",
                "count": 42,
                "papers": [
                    "An user preference information based kernel for SVM active learning in content-based image retrieval.",
                    "Researchexplorer: gaining insights through exploration in multimedia scientific data.",
                    "Mean version space: a new active learning method for content-based image retrieval.",
                    "Retrieval of difficult image classes using svd-based relevance feedback.",
                    "Boosting contextual information in content-based image retrieval.",
                    "Key-frame extraction algorithm using entropy difference.",
                    "Content based access for a massive database of human observation video.",
                    "Clip-based similarity measure for hierarchical video retrieval.",
                    "Fast and robust short video clip search using an index structure.",
                    "Structuring home video by snippet detection and pattern parsing.",
                    "Retrieval of 3D objects by visual similarity.",
                    "Effective browsing of web image search results.",
                    "Image recognition for digital libraries.",
                    "Leveraging face recognition technology to find and organize photos.",
                    "A graphical user interface for a fine-art painting image retrieval system.",
                    "A statistical approach to retrieval under user-dependent uncertainty in query-by-humming systems.",
                    "The story picturing engine: finding elite images to illustrate a story using mutual reinforcement.",
                    "The fusion of audio-visual features and external knowledge for event detection in team sports video.",
                    "Texture based medical image indexing and retrieval: application to cardiac imaging.",
                    "A query description model based on basic semantic unit composite petri-nets for soccer video analysis.",
                    "Relevance feedback: perceptual learning and retrieval in bio-computing, photos, and video.",
                    "A time series clustering based framework for multimedia mining and summarization using audio features.",
                    "Long-term learning of semantic grouping from relevance-feedback.",
                    "Experimenting with music taste prediction by user profiling.",
                    "Latent semantic analysis of facial action codes for automatic facial expression recognition.",
                    "Efficient 3D object retrieval using depth images.",
                    "Analysing the performance of visual, concept and text features in content-based video retrieval.",
                    "A multimodal approach to time-invariant scene retrieval from single overhead image.",
                    "Concept-oriented video skimming and adaptation via semantic classification.",
                    "Video story segmentation with multi-modal features: experiments on TRECvid 2003.",
                    "Symbolic representation and retrieval of moving object trajectories.",
                    "A hybrid system for affine-invariant trajectory retrieval.",
                    "Latent semantic analysis for an effective region-based video shot retrieval system.",
                    "Action movies segmentation and summarization based on tempo analysis.",
                    "Offense based temporal segmentation for event detection in soccer video.",
                    "The power of play-break for automatic detection and browsing of self-consumable sport video highlights.",
                    "Repeating pattern discovery and structure analysis from acoustic music data.",
                    "Towards automatic analysis of social interaction patterns in a nursing home environment from video.",
                    "Semantic video adaptation based on automatic annotation of sport videos.",
                    "High performance crawling system.",
                    "A web-enabled video indexing system.",
                    "Autonomous visual model building based on image crawling through internet search engines."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "MIR 2003",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mir/2003",
                "sub_name": "Proceedings of the 5th ACM SIGMM International Workshop on Multimedia Information Retrieval, MIR 2003, November 7, 2003, Berkeley, CA, USA.",
                "count": 36,
                "papers": [
                    "The Family Video Archive: an annotation and browsing environment for home movies.",
                    "Semantic video classification by integrating flexible mixture model with adaptive EM algorithm.",
                    "Semi-supervised learning for facial expression recognition.",
                    "Design, implementation and testing of an interactive video retrieval system.",
                    "Context-based video retrieval system for the life-log applications.",
                    "Retrieving 3D shapes based on their appearance.",
                    "Modeling and clustering of photo capture streams.",
                    "A bootstrapping approach to annotating large image collection.",
                    "Content representation and similarity matching for texture-based image retrieval.",
                    "Addressing CBIR efficiency, effectiveness, and retrieval subjectivity simultaneously.",
                    "Fast retrieval of high-dimensional feature vectors in P2P networks using compact peer data summaries.",
                    "Annodex: a simple architecture to enable hyperlinking, search & retrieval of time--continuous data on the Web.",
                    "An evolutionary optimization approach for 3D human head model classification.",
                    "A Wavelet Packet representation of audio signals for music genre classification using different ensemble and feature selection techniques.",
                    "Semantic context detection based on hierarchical audio models.",
                    "Creating data resources for designing user-centric frontends for query by humming systems.",
                    "Semantic-meaningful content-based image retrieval in wavelet domain.",
                    "Distance measures for MPEG-7-based retrieval.",
                    "Efficient contour-based shape representation and matching.",
                    "Generic sign board detection in images.",
                    "Query definition using interactive saliency.",
                    "Fuzzy color quantization and its application to scene change detection.",
                    "Efficient K-NN search in polyphonic music databases using a lower bounding mechanism.",
                    "Multimedia modeling using MPEG-7 for authoring multimedia integration.",
                    "Repeated utterance extraction by a new algorithm for labeling a presentation speech.",
                    "An analysis of multimedia searching on AltaVista.",
                    "Content-based image retrieval by clustering.",
                    "Sports video summarization using highlights and play-breaks.",
                    "Highlight scene extraction in real time from baseball live video.",
                    "Model checking for detection of sport highlights.",
                    "DAVE: a system for quality driven adaptive video delivery.",
                    "A wireless handheld multi-modal digital video library client system.",
                    "Threading news video topics.",
                    "Multimedia streaming services: specification, implementation, and retrieval.",
                    "Replication algorithms to retrieve scalable streaming media over Content Delivery Networks.",
                    "Fast video matching with signature alignment."
                ]
            }
        ]
    }
]