[
    {
        "year": "2021",
        "name": "32nd IEEE VIS 2021",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2021",
                "sub_name": "2021 IEEE Visualization Conference, IEEE VIS 2021 - Short Papers, New Orleans, LA, USA, October 24-29, 2021.",
                "count": 41,
                "papers": [
                    "CloudFindr: A Deep Learning Cloud Artifact Masker for Satellite DEM Data.",
                    "Semantic Resizing of Charts Through Generalization: A Case Study with Line Charts.",
                    "An Exploration And Validation of Visual Factors in Understanding Classification Rule Sets.",
                    "Fast & Accurate Gaussian Kernel Density Estimation.",
                    "\"Why did my AI agent lose?\": Visual Analytics for Scaling Up After-Action Review.",
                    "VAINE: Visualization and AI for Natural Experiments.",
                    "Semantic Explanation of Interactive Dimensionality Reduction.",
                    "AdViCE: Aggregated Visual Counterfactual Explanations for Machine Learning Model Validation.",
                    "Contrastive Identification of Covariate Shift in Image Data.",
                    "TimeElide: Visual Analysis of Non-Contiguous Time Series Slices.",
                    "Bayesian Modelling of Alluvial Diagram Complexity.",
                    "When Red Means Good, Bad, or Canada: Exploring People's Reasoning for Choosing Color Palettes.",
                    "Does the Layout Really Matter? A Study on Visual Model Accuracy Estimation.",
                    "Histogram binning revisited with a focus on human perception.",
                    "Jurassic Mark: Inattentional Blindness for a Datasaurus Reveals that Visualizations are Explored, not Seen.",
                    "Fixation and Creativity in Data Visualization Design: Experiences and Perspectives of Practitioners.",
                    "Towards a Survey on Static and Dynamic Hypergraph Visualizations.",
                    "Time-Varying Fuzzy Contour Trees.",
                    "Ray-traced Shell Traversal of Tetrahedral Meshes for Direct Volume Visualization.",
                    "Segmentation Driven Peeling for Visual Analysis of Electronic Transitions.",
                    "Exact Analytical Parallel Vectors.",
                    "Uncertainty Visualization of the Marching Squares and Marching Cubes Topology Cases.",
                    "Intercept Graph: An Interactive Radial Visualization for Comparison of State Changes.",
                    "Automatic Y-axis Rescaling in Dynamic Visualizations.",
                    "A Mixed-Initiative Visual Analytics Approach for Qualitative Causal Modeling.",
                    "A Visual Analytics System for Water Distribution System Optimization.",
                    "CellProfiler Analyst Web (CPAW) - Exploration, analysis, and classification of biological images on the web.",
                    "Inspecting the Process of Bank Credit Rating via Visual Analytics.",
                    "Where and Why is My Bot Failing? A Visual Analytics Approach for Investigating Failures in Chatbot Conversation Flows.",
                    "AiR: An Augmented Reality Application for Visualizing Air Pollution.",
                    "ConVIScope: Visual Analytics for Exploring Patient Conversations.",
                    "Visually Connecting Historical Figures Through Event Knowledge Graphs.",
                    "Understanding the Effects of Visualizing Missing Values on Visual Data Exploration.",
                    "GeoSneakPique: Visual Autocompletion for Geospatial Queries.",
                    "Atlas: Grammar-based Procedural Generation of Data Visualizations.",
                    "On the Potential of Zines as a Medium for Visualization.",
                    "Narrative Sensemaking: Strategies for Narrative Maps Construction.",
                    "Text Visualization and Close Reading for Journalism with Storifier.",
                    "Conceptualizing Visual Analytic Interventions for Content Moderation.",
                    "How Learners Sketch Data Stories.",
                    "Gemini2: Generating Keyframe-Oriented Animated Transitions Between Statistical Graphics."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st IEEE VIS 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2020",
                "sub_name": "31st IEEE Visualization Conference, IEEE VIS 2020 - Short Papers, Virtual Event, USA, October 25-30, 2020.",
                "count": 59,
                "papers": [
                    "The Anatomical Edutainer.",
                    "Topological Analysis of Magnetic Reconnection in Kinetic Plasma Simulations.",
                    "A Virtual Frame Buffer Abstraction for Parallel Rendering of Large Tiled Display Walls.",
                    "Uncertain Transport in Unsteady Flows.",
                    "High-quality real-time raycasting and raytracing of streamtubes with sparse voxel octrees.",
                    "GPU-based Raycasting of Hermite Spline Tubes.",
                    "Implicit Ray Casting of the Parallel Vectors Operator.",
                    "GPU Parallel Computation of Morse-Smale Complexes.",
                    "Relationship-aware Multivariate Sampling Strategy for Scientific Simulation Data.",
                    "PRAGMA: Interactively Constructing Functional Brain Parcellations.",
                    "A Review of Geospatial Content in IEEE Visualization Publications.",
                    "COVIs: Supporting Temporal Visual Analysis of Covid-19 Events Usable in Data-Driven Journalism.",
                    "TradAO: A Visual Analytics System for Trading Algorithm Optimization.",
                    "A Study of Opacity Ranges for Transparent Overlays in 3D Landscapes.",
                    "Co-Visualization of Air Temperature and Urban Data for Visual Exploration.",
                    "A Visual Analytics Approach to Scheduling Customized Shuttle Buses via Perceiving Passengers' Travel Demands.",
                    "Designing for Ambiguity: Visual Analytics in Avalanche Forecasting.",
                    "A Visual Analytics Based Decision Making Environment for COVID-19 Modeling and Visualization.",
                    "Mapping the Global South: Equal-Area Projections for Choropleth Maps.",
                    "Accelerating Force-Directed Graph Drawing with RT Cores.",
                    "Fast and Flexible Overlap Detection for Chart Labeling with Occupancy Bitmap.",
                    "FAVR - Accelerating Direct Volume Rendering for Virtual RealitySystems.",
                    "DRUIDJS - A JavaScript Library for Dimensionality Reduction.",
                    "Trrack: A Library for Provenance-Tracking in Web-Based Visualizations.",
                    "Just TYPEical: Visualizing Common Function Type Signatures in R.",
                    "Loch Prospector: Metadata Visualization for Lakes of Open Data.",
                    "Encodable: Configurable Grammar for Visualization Components.",
                    "Facilitating Exploration with Interaction Snapshots under High Latency.",
                    "Improving Engagement of Animated Visualization with Visual Foreshadowing.",
                    "Representing Real-Time Multi-User Collaboration in Visualizations.",
                    "Narrative Transitions in Data Videos.",
                    "Visualizing Information on Watch Faces: A Survey with Smartwatch Users.",
                    "Evaluating Animated Transitions between Contiguous Visualizations for Streaming Big Data.",
                    "Gaze-Driven Links for Magazine Style Narrative Visualizations.",
                    "Characterizing Automated Data Insights.",
                    "Design Judgment in Data Visualization Practice.",
                    "What are Data Insights to Professional Visualization Users?",
                    "A Didactic Methodology for Crafting Information Visualizations.",
                    "CrowdTrace: Visualizing Provenance in Distributed Sensemaking.",
                    "Let's Gamble: How a Poor Visualization Can Elicit Risky Behavior.",
                    "Exploring How Personality Models Information Visualization Preferences.",
                    "Why Shouldn't All Charts Be Scatter Plots? Beyond Precision-Driven Visualizations.",
                    "Data Visualization Practitioners' Perspectives on Chartjunk.",
                    "Sentifiers: Interpreting Vague Intent Modifiers in Visual Analysis using Word Co-occurrence and Sentiment Analysis.",
                    "Data Visualization for Transgender Voice Training.",
                    "GlassViz: Visualizing Automatically-Extracted Entry Points for Exploring Scientific Corpora in Problem-Driven Visualization Research.",
                    "Knowing what to look for: A Fact-Evidence Reasoning Framework for Decoding Communicative Visualization.",
                    "MeetCues: Supporting Online Meetings Experience.",
                    "DebateVis: Visualizing Political Debates for Non-Expert Users.",
                    "ClaimViz: Visual Analytics for Identifying and Verifying Factual Claims.",
                    "Visually Analyzing and Steering Zero Shot Learning.",
                    "DRIL: Descriptive Rules by Interactive Learning.",
                    "Vortex Boundary Identification using Convolutional Neural Network.",
                    "How Does Visualization Help People Learn Deep Learning? Evaluating GAN Lab with Observational Study and Log Analysis.",
                    "Bluff: Interactively Deciphering Adversarial Attacks on Deep Neural Networks.",
                    "Visually Analyzing Contextualized Embeddings.",
                    "Explainable Spatial Clustering: Leveraging Spatial Data in Radiation Oncology.",
                    "ProtoViewer: Visual Interpretation and Diagnostics of Deep Neural Networks with Factorized Prototypes.",
                    "InstanceFlow: Visualizing the Evolution of Classifier Confusion at the Instance Level."
                ]
            },
            {
                "sub_name_abbr": "conf/ieeevast/2020",
                "sub_name": "15th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST@IEEE VIS 2020, Virtual Event, USA, October 25-30, 2020.",
                "count": 10,
                "papers": [
                    "ConceptExplorer: Visual Analysis of Concept Drifts in Multi-source Time-series Data.",
                    "Diagnosing Concept Drift with Visual Analytics.",
                    "A Visual Analytics Approach to Debugging Cooperative, Autonomous Multi-Robot Systems' Worldviews.",
                    "Visual Analytics of Multivariate Event Sequence Data in Racquet Sports.",
                    "A Visual Analytics Framework for Contrastive Network Analysis.",
                    "Visual Abstraction of Geographical Point Data with Spatial Autocorrelations.",
                    "STULL: Unbiased Online Sampling for Visual Exploration of Large Spatiotemporal Data.",
                    "iConViz: Interactive Visual Exploration of the Default Contagion Risk of Networked-Guarantee Loans.",
                    "SilkViser: A Visual Explorer of Blockchain-based Cryptocurrency Transaction Data.",
                    "SMAP: A Joint Dimensionality Reduction Scheme for Secure Multi-Party Visualization."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th IEEE VIS 2019",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2019",
                "sub_name": "30th IEEE Visualization Conference, IEEE VIS 2019 - Short Papers, Vancouver, BC, Canada, October 20-25, 2019.",
                "count": 59,
                "papers": [
                    "Periphery Plots for Contextualizing Heterogeneous Time-Based Charts.",
                    "Graph-Assisted Visualization of Microvascular Networks.",
                    "Learning Vis Tools: Teaching Data Visualization Tutorials.",
                    "Sociotechnical Considerations for Accessible Visualization Design.",
                    "Toward Interface Defaults for Vague Modifiers in Natural Language Interfaces for Visual Analysis.",
                    "VisWall: Visual Data Exploration Using Direct Combination on Large Touch Displays.",
                    "EasyPZ.js: Interaction Binding for Pan and Zoom Visualizations.",
                    "Would You Like A Chart With That? Incorporating Visualizations into Conversational Interfaces.",
                    "Designing Visual Guides for Casual Listeners of Live Orchestral Music.",
                    "Uncovering Data Landscapes through Data Reconnaissance and Task Wrangling.",
                    "Sabrina: Modeling and Visualization of Financial Data over Time with Incremental Domain Knowledge.",
                    "Visual Analysis of the Time Management of Learning Multiple Courses in Online Learning Environment.",
                    "H-Matrix: Hierarchical Matrix for Visual Analysis of Cross-Linguistic Features in Large Learner Corpora.",
                    "OCTVis: Ontology-Based Comparison of Topic Models.",
                    "MissBiN: Visual Analysis of Missing Links in Bipartite Networks.",
                    "FacIt: Factorizing Tensors into Interpretable and Scrutinizable Patterns.",
                    "A Markov Model of Users' Interactive Behavior in Scatterplots.",
                    "Slope-Dependent Rendering of Parallel Coordinates to Reduce Density Distortion and Ghost Clusters.",
                    "Evaluating Ordering Strategies of Star Glyph Axes.",
                    "Interactive Visualisation of Hierarchical Quantitative Data: An Evaluation.",
                    "Evidence for Area as the Primary Visual Cue in Pie Charts.",
                    "Visual Cues in Estimation of Part-To-Whole Comparisons.",
                    "Toward a Design Space for Mitigating Cognitive Bias in Vis.",
                    "Thumbnails for Data Stories: A Survey of Current Practices.",
                    "Towards Quantifying Multiple View Layouts in Visualisation as Seen from Research Publications.",
                    "Visualization Assessment: A Machine Learning Approach.",
                    "A Deep Learning Approach to Selecting Representative Time Steps for Time-Varying Multivariate Data.",
                    "Disentangled Representation of Data Distributions in Scatterplots.",
                    "Toward Perception-Based Evaluation of Clustering Techniques for Visual Analytics.",
                    "SANVis: Visual Analytics for Understanding Self-Attention Networks.",
                    "TeleGam: Combining Visualization and Verbalization for Interpretable Machine Learning.",
                    "Visualizing RNN States with Predictive Semantic Encodings.",
                    "FeatureExplorer: Interactive Feature Selection and Exploration of Regression Models for Hyperspectral Images.",
                    "scenery: Flexible Virtual Reality Visualization on the Java VM.",
                    "Interactive Dendritic Spine Analysis Based on 3D Morphological Features.",
                    "High Fidelity Visualization of Large Scale Digitally Reconstructed Brain Circuitry with Signed Distance Functions.",
                    "Visual Inspection of DBS Efficacy.",
                    "TempoCave: Visualizing Dynamic Connectome Datasets to Support Cognitive Behavioral Therapy.",
                    "RuleVis: Constructing Patterns and Rules for Rule-Based Models.",
                    "ElectroLens: Understanding Atomistic Simulations through Spatially-Resolved Visualization of High-Dimensional Features.",
                    "Analyzing Time Attributes in Temporal Event Sequences.",
                    "Evaluating Alignment Approaches in Superimposed Time-Series and Temporal Event-Sequence Visualizations.",
                    "Interpreting Distortions in Dimensionality Reduction by Superimposing Neighbourhood Graphs.",
                    "Hi-D Maps: An Interactive Visualization Technique for Multi-Dimensional Categorical Data.",
                    "Conditional Parallel Coordinates.",
                    "Towards Enhancing RadViz Analysis and Interpretation.",
                    "Time Varying Predominance Tag Maps.",
                    "SAX Navigator: Time Series Exploration through Hierarchical Clustering.",
                    "Nonuniform Timeslicing of Dynamic Graphs Based on Visual Complexity.",
                    "Interactive Bicluster Aggregation in Bipartite Graphs.",
                    "Overlap-Free Drawing of Generalized Pythagoras Trees for Hierarchy Visualization.",
                    "Efficient Space Skipping and Adaptive Sampling of Unstructured Volumes Using Hardware Accelerated Ray Tracing.",
                    "Hybrid Grids for Sparse Volume Rendering.",
                    "Data-Driven Colormap Optimization for 2D Scalar Field Visualization.",
                    "Evaluating Gradient Perception in Color-Coded Scalar Fields.",
                    "GalStamps: Analyzing Real and Simulated Galaxy Observations.",
                    "Point Movement in a DSL for Higher-Order FEM Visualization.",
                    "Unsteady Flow Visualization via Physics Based Pathline Exploration.",
                    "Visualization of Symmetries in Fourth-Order Stiffness Tensors."
                ]
            },
            {
                "sub_name_abbr": "conf/ieeevast/2019",
                "sub_name": "14th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2019, Vancouver, BC, Canada, October 20-25, 2019.",
                "count": 34,
                "papers": [
                    "VIS Keynote Address: Data Visualization Literacy.",
                    "VIS Capstone Address: Visualizing Temporality and Chronologies for the Humanities.",
                    "Influence Flowers of Academic Entities.",
                    "VIANA: Visual Interactive Annotation of Argumentation.",
                    "ICE: An Interactive Configuration Explorer for High Dimensional Categorical Parameter Spaces.",
                    "TopicSifter: Interactive Search Space Reduction through Targeted Topic Modeling.",
                    "FAIRVIS: Visual Analytics for Discovering Intersectional Bias in Machine Learning.",
                    "Interactive Correction of Mislabeled Training Data.",
                    "FDive: Learning Relevance Models Using Pattern-based Similarity Measures.",
                    "Origraph: Interactive Network Wrangling.",
                    "Do What I Mean, Not What I Say! Design Considerations for Supporting Intent and Context in Analytical Conversation.",
                    "N.E.A.T. - Novel Emergency Analysis Tool.",
                    "Earthquake Damage Report Interactive Dashboard Using Bayesian Structural Time Series and Value-Suppressing Uncertainty Palettes.",
                    "Interactive Ranking Uncertain Multivariate Ordinal Time Series.",
                    "IDUVis: An Interactive Dashboard for Uncertainty Visualization and Analysis - Vast Challenge 2019 MC1 Award for Supporting Situation Awareness and Anomaly Detection.",
                    "HeatMosaic: Interactive Uncertainty Analysis of Disaster Events: 2019 VAST Challenge Honorable Mention Award for Visualization of Uncertainty.",
                    "Award for Outstanding Comprehensive Mini-Challenge 2 Solution - RadiationMonitor: An Interactive System for Visualizing and Exploring Spatial-Temporal Data.",
                    "MC2 - SUA: A Sensor Uncertainty Analysis Tool of Radiation Measurement Data (VAST Challenge 2019 Award - Integrated Tool with Rich Data Encodings).",
                    "Visual Analysis of Multivariate Time Series of Static and Mobile Sensors.",
                    "RescueMark: Visual Analytics of Social Media Data for Guiding Emergency Response in Disaster Situations: Award for Skillful Integration of Language Model.",
                    "EarthquakeAware: Visual Analytics for Understanding Human Impacts of Earthquakes from Social Media Data.",
                    "TopicInk: Visualizing Disaster-Related Textual Data Using LDA Topic Modeling: Vast Challenge 2019: Honorable Mention for Clear Articulation of Methodology.",
                    "Visual Analysis for Messages in Social Media.",
                    "UofC-Bayes: A Bayesian Approach to Visualizing Uncertainty in Radiation Data.",
                    "UofC-Bayes: A Bayesian Approach to Visualizing Uncertainty in Likert Scales.",
                    "Visual Analytics of Spatio-Temporal Uncertainties for Radiation Monitoring in a Nuclear Leakage Crisis.",
                    "Pattern-Based Semantic and Temporal Exploration of Social Media Messages.",
                    "Earthquake Investigation and Visual Cognizance of Multivariate Temporal Tabular Data Using Machine Learning.",
                    "Using a Multi-Level and Multi-Resolution Visual Analytics Software to Understand the Aftermath of a Catastrophe.",
                    "cpmViz: A Web-Based Visualization Tool for Uncertain Spatiotemporal Data.",
                    "EQSA: Earthquake Situational Analytics from Social Media.",
                    "Social Media Text Streaming Visualization.",
                    "Visualization of Spatial-Temporal Distribution of Damage Reports.",
                    "Visualization of Spatial-Temporal Distribution of Radioactivity Measurements."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th IEEE VIS 2018",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2018",
                "sub_name": "13th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2018, Berlin, Germany, October 21-26, 2018.",
                "count": 29,
                "papers": [
                    "VIS Keynote Address : When Visualization Met Augmented Reality.",
                    "VIS Capstone Address : Can I believe what I see?-Information theoretic algorithm validation.",
                    "The Effect of Proximity in Social Data Charts on Perceived Unity.",
                    "The Effect of Semantic Interaction on Foraging in Text Analysis.",
                    "VUSphere: Visual Analysis of Video Utilization in Online Distance Education.",
                    "SMARTexplore: Simplifying High-Dimensional Data Analysis through a Table-Based Visual Analytics Approach.",
                    "EmbeddingVis: A Visual Analytics Approach to Comparative Network Embedding Inspection.",
                    "Analyzing the Noise Robustness of Deep Neural Networks.",
                    "Segue: Overviewing Evolution Patterns of Egocentric Networks by Interactive Construction of Spatial Layouts.",
                    "VAST Challenge 2018: Suspense at the Wildlife Preserve.",
                    "VAST Challenge 2018: Mini-Challenge 1 Award: Applied Visual Data Science.",
                    "Audio Explorer - VAST Challenge 2018 MC1 (Awarded \"Excellent Comprehensive Submission\").",
                    "Visual Bird Watcher: Interactive Visual Analysis on Bird Distribution and Migration.",
                    "Interactive Webtool for Tempospatial Data and Visual Audio Analysis : VAST Challenge 2018: Honorable Mention for Interactive Analytic Tool.",
                    "Identifying Patterns and Anomalies within Spatiotemporal Water Sampling Data : VAST Challenge 2018: Award for Elegant Design of an Interactive Display.",
                    "MTDES: Multi-dimensional Temporal Data Exploration System; Strong Support for Exploratory Analysis Award in VAST 2018, Mini-Challenge 2.",
                    "Unearthing the X-Streams: Visualizing Water Contamination : VAST Mini-Challenge 2 Honorable Mention: Clarity of Narrative.",
                    "Time Series Projection to Highlight Trends and Outliers.",
                    "Visual Analysis for Subgroups in a Dynamic Network.",
                    "TimeMatrix: Visual Representation for Temporal Pattern Detection in Dynamic Networks, VAST 2018 Mini-Challenge 3.",
                    "Interactive Classification Using Spectrograms and Audio Glyphs.",
                    "They do Move! Visual Analytics of Rose-Crested Blue Pipit Habitat.",
                    "Phoenixmap: Spatio-Temporal Distribution Analysis With Deep Learning Classifications.",
                    "Multilevel Visual Clustering Exploration for Incomplete Time-Series in Water Samples.",
                    "A Unified Approach For Sampling And Measurement Joint Analysis.",
                    "Using Tableau to Discover the Effect of Chemical Release at Wildlife Preserve.",
                    "River-water Quality Exploration.",
                    "Contourmap: Contour Based Visualization Of Water Chemical Data.",
                    "A Visualization Study on Visual Analysis to Explore the Organizational Structure of the Group Within a Factory."
                ]
            },
            {
                "sub_name_abbr": "conf/scivis/2018",
                "sub_name": "2018 IEEE Scientific Visualization Conference, SciVis 2018, Berlin, Germany, October 21-26, 2018.",
                "count": 22,
                "papers": [
                    "An Organic Visual Metaphor for Public Understanding of Conditional Co-occurrences.",
                    "VAPLI: Novel Visual Abstraction for Protein-Lipid Interactions.",
                    "Color Interpolation for Non-Euclidean Color Spaces.",
                    "VRGE: An Immersive Visualization Application for the Geosciences.",
                    "3De Interactive Lenses for Visualization in Virtual Environments.",
                    "Toward A Deep Understanding of What Makes a Scientific Visualization Memorable.",
                    "Ordering Perceptions about Perceptual Order.",
                    "QuFlow: Visualizing Parameter Flow in Quantum Circuits for Understanding Quantum Computation.",
                    "Cluster-Based Visualization for Merger Tree Data: The Challenge of Missing Expectations.",
                    "Visualization of Uncertainty for Computationally Intensive Simulations Using High Fidelity Emulators.",
                    "A Lagrangian Method for Extracting Eddy Boundaries in the Red Sea and the Gulf of Aden.",
                    "FTLE Ridge Lines for Long Integration Times.",
                    "Ocean Current Segmentation at Different Depths and Correlation with Temperature in a MPAS-Ocean Simulation.",
                    "TimeTubes: Automatic Extraction of Observable Blazar Features from Long-Term, Multi-Dimensional Datasets.",
                    "aflak: Pluggable Visual Programming Environment with Quick Feedback Loop Tuned for Multi-Spectral Astrophysical Observations.",
                    "Biclusters Based Visual Exploration of Multivariate Scientific Data.",
                    "Using Cinematic Effects to Visualize the Deep Water Impact Data Set.",
                    "Visualization and Analysis of Deep Water Asteroid Impacts.",
                    "Visualizing Deep Water Asteroid Impacts: Interactive Visual Analysis of Multi-run Spatio-temporal Simulations.",
                    "Interactive Visual Exploration and Comparison on the Effect of Asteroid Impacts.",
                    "Interactive Visualization and Analysis of High Resolution HPC Simulation Data on a Laptop With VTK.",
                    "Comparative Visualization of Deep Water Asteroid Impacts on Ultra-high-resolution Wall Displays with Seawall."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28th IEEE VIS 2017",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2017",
                "sub_name": "12th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2017, Phoenix, AZ, USA, October 3-6, 2017.",
                "count": 54,
                "papers": [
                    "VIS Keynote Address: Analytics Inspired Visualization: a Holistic In-situ Scientific Workflow at Extreme Scale.",
                    "VIS Capstone Address Data Humanism: The Revolution will be Visualized.",
                    "Pattern Trails: Visual Analysis of Pattern Transitions in Subspaces.",
                    "Understanding Hidden Memories of Recurrent Neural Networks.",
                    "CrystalBall: A Visual Analytic System for Future Event Discovery and Analysis from Social Media Data.",
                    "E-Map: A Visual Analytics Approach for Exploring Significant Event Evolutions in Social Media.",
                    "QSAnglyzer: Visual Analytics for Prismatic Analysis of Question Answering System Evaluations.",
                    "A Visual Analytics System for Optimizing Communications in Massively Parallel Applications.",
                    "Visualizing Real-Time Strategy Games: The Example of StarCraft II.",
                    "The \"y\" of it Matters, Even for Storyline Visualization.",
                    "The Role of Explicit Knowledge: A Conceptual Model of Knowledge-Assisted Visual Analytics.",
                    "Warning, Bias May Occur: A Proposed Approach to Detecting Cognitive Bias in Interactive Visual Analytics.",
                    "The Anchoring Effect in Decision-Making with Visual Analytics.",
                    "Interactive Visual Alignment of Medieval Text Versions.",
                    "CRICTO: Supporting Sensemaking through Crowdsourced Information Schematization.",
                    "Visual Causality Analysis Made Practical.",
                    "A Workflow for Visual Diagnostics of Binary Classifiers using Instance-Level Explanations.",
                    "VAST Challenge 2017: Mystery at the Wildlife Preserve.",
                    "ClockPetals: Interactive Sequential Analysis of Traffic Patterns VAST Challenge MC1 Award: Multi-Challenge Award for Aesthetic Design.",
                    "WindNebula: Vectorial-Temporal Analysis for Environmental Assessment : VAST Challenge MC2 Award: Multi-challenge Award for Aesthetic Design.",
                    "PreserVis, a Visual Analytic System for Traffic and Pollution Patterns - Multi-Challenge Award for Compelling Synthesis of Information.",
                    "Spatiotemporal identification of anomalies in a wildlife preserve VAST Grand Challenge 2017 Award: Clear Presentation of Hypotheses and Supporting Evidence.",
                    "Interactive and Collaborative Visual Analysis on Traffic Sensor Data.",
                    "Temporal Pattern Analysis and Source Detection through Visual Analysis on Multi-Dimensional Time Series Data.",
                    "Visual Analysis for Multi-Spectral Images Comparisons.",
                    "Exploring Lekagul Sensor Events using Rules, Aggregations, and Selections.",
                    "Interactive Visual Analytics Application for Spatiotemporal Movement Data VAST Challenge 2017 Mini-Challenge 1: Award for Actionable and Detailed Analysis.",
                    "ODIX: A Rapid Hypotheses Testing System for Origin-Destination Data IEEE VAST Challenge Award for Excellence in Spatio-temporal Graph Analytics.",
                    "A Visual Explorer for Analyzing Trajectory Patterns.",
                    "Visual Analytic Design for Detecting Airborne Pollution Sources VAST Challenge 2017 Award: Comprehensive Mini-Challenge 2 Answer.",
                    "MC2 - Mining Factory Pollution Data through a Spatial-Nonspatial Flow Approach (Honorable Mention for Clarity in Visual Communication).",
                    "Multi-Spectral Satellite Image Analysis for Feature Identification and Change Detection VAST Challenge 2017: Honorable Mention for Good Facilitation of Single Image Analysis.",
                    "MC3 - A Web-Based Interactive Image Explorer for Temporal Analysis of Satellite Images (Honorable Mention - Good Interactive Image Explorer).",
                    "Detecting Vehicular Patterns Using a Graph-Based Approach.",
                    "Visual Analysis to Explore Mystery at Wildlife Preserve.",
                    "iDVL Visualizes Patterns of Traffic.",
                    "Temporal and Spatial Analysis of VAST 2017's Mini-Challenge 1.",
                    "Visual Analytic Design for Characterizing Air-Sampling Sensor Performance and Operation.",
                    "SIZE: Satellite Image Zooming and Exploration.",
                    "VAST Mini-Challenge 1.",
                    "Multilab: Multispectral image analysis in Matlab.",
                    "Visual Integration of Meteorological and Sensor Data for Identifying Suspicious Company Behavior.",
                    "MC1 - Iterative Analysis of Spatio-temporal Data by Textual Queries and Visualizations.",
                    "MC2 - Spatio-Temporal Provenance Data Aggregation for Visual Analysis.",
                    "MC3 - Modified Frame Differencing of Satellite Images to Detect Temporal Changes in a Natural Preserve.",
                    "GC - Holistic Analysis of Heterogeneous Datasets.",
                    "MC1: A Bespoke Analysis Tool for Spatio-temporal Park Traffic Data.",
                    "Interactive Visual Analysis of Traffic Patterns: Ecological Impact within a Nature Preserve (VAST Challenge 2017).",
                    "Data Aggregation and Visualization Technique for Traffic Sensor Data.",
                    "Visualizing chemicals detection VAST 2017 Mini Challenge 2.",
                    "Uncovering the Mistford Toxic Conspiracy.",
                    "Visual Statistical Analysis of Environmental Sensor Data.",
                    "Visual Analysis for Wildlife Preserve based on Muti-systems.",
                    "VAST Challenge 2017: Mini-challenge 1."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27th IEEE VIS 2016",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2016",
                "sub_name": "11th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2016, Baltimore, MD, USA, October 23-28, 2016.",
                "count": 19,
                "papers": [
                    "The 2016 Visualization Career Award.",
                    "The 2016 Visualization Technical Achievement Award.",
                    "VIS keynote address.",
                    "VIS capstone address.",
                    "Supporting visual exploration for multiple users in large display environments.",
                    "DocuCompass: Effective exploration of document landscapes.",
                    "C2A: Crowd consensus analytics for virtual colonoscopy.",
                    "The DataSpace for HIV vaccine studies.",
                    "D-Map: Visual analysis of ego-centric information diffusion patterns in social media.",
                    "How ideas flow across multiple social groups.",
                    "EventAction: Visual analytics for temporal event sequence recommendation.",
                    "SocialBrands: Visual analysis of public perceptions of brands on social media.",
                    "DimScanner: A relation-based visual exploration approach towards data dimension inspection.",
                    "SenseMap: Supporting browser-based online sensemaking through analytic provenance.",
                    "PorosityAnalyzer: Visual analysis and evaluation of segmentation pipelines to determine the porosity in fiber-reinforced polymers.",
                    "DropoutSeer: Visualizing learning patterns in Massive Open Online Courses for dropout reasoning and prediction.",
                    "Shape grammar extraction for efficient query-by-sketch pattern matching in long time series.",
                    "The semantics of sketch: Flexibility in visual query systems for time series data.",
                    "Visual analysis and coding of data-rich user behavior."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26th IEEE VIS 2015",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2015",
                "sub_name": "10th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2015, Chicago, IL, USA, October 25-30, 2015.",
                "count": 68,
                "papers": [
                    "VIS keynote address: An Evolving Visual Language.",
                    "VIS capstone address: Architectures Physical and Digital.",
                    "Wavelet-based visualization of time-varying data on graphs.",
                    "Mixed-initiative visual analytics using task-driven recommendations.",
                    "Integrating predictive analytics into a spatiotemporal epidemic simulation.",
                    "Collaborative visual analysis with RCloud.",
                    "Four considerations for supporting visual analysis in display ecologies.",
                    "Supporting activity recognition by visual analytics.",
                    "iVizTRANS: Interactive visual learning for home and work place detection from massive public transportation data.",
                    "DemographicVis: Analyzing demographic information based on user generated content.",
                    "EgoNetCloud: Event-based egocentric dynamic network visualization.",
                    "FPSSeer: Visual analysis of game frame rate data.",
                    "Comparative visual analysis of vector field ensembles.",
                    "Interactive visual steering of hierarchical simulation ensembles.",
                    "Urbane: A 3D framework to support data driven decision making in urban development.",
                    "FeatureInsight: Visual support for error-driven feature ideation in text classification.",
                    "VAST Challenge 2015: Mayhem at dinofun world.",
                    "VAST challenge 2015: Grand challenge - team VADER/VIS Award for Outstanding Comprehensive Submission.",
                    "Using visual analytics to provide situation awareness for movement and communication data.",
                    "ParkVis: A visual analytic system for anomaly detection in DinoFun World.",
                    "Interactive analysis of movement and communication data by animation.",
                    "Applying visual analytics to explore and analyze movement data.",
                    "Middguard at dinofun world.",
                    "Behavior analysis through collaborative visual exploration on trajectory data.",
                    "VAST challenge 2015 solver.",
                    "Applying advanced analytic techniques to visually explore communication patterns in mobile data.",
                    "Visual analytics for detecting communication patterns.",
                    "A collaborative visual analysis system for communication pattern discovery.",
                    "Rapid exploration and analysis of VAST 2015 \"Mini-Challenge 2\" dataset.",
                    "Group identification from visitor movement data: VAST 2015 mini-challenge 1.",
                    "Case study of dino fun world movement and communication data.",
                    "Visualizing movement in theme park.",
                    "Visual analytics of heterogeneous data for criminal event analysis VAST challenge 2015: Grand challenge.",
                    "A methodology for classifying visitors to an amusement park.",
                    "ParkVis: Visual analytic system for population movement in DinoFun World.",
                    "ParkVis: Visual analytic system for communication data in DinoFun World.",
                    "Exploring dinofun park happenings.",
                    "On the move at DinoFun world.",
                    "Visualizing communication patterns at DinoFun World.",
                    "Dynamic DinoFun World Communication Graph.",
                    "Eagleyes: Performing data analysis using an interactive dataflow.",
                    "Exploring trajectory data using ComVis CMV tool VAST 2015 Mini-Challenge 1.",
                    "Visual analytics for inspecting the evolution of a graph over time: Pattern discovery in a communication network.",
                    "Using visual analytics to analyze movement and action patterns.",
                    "[COMM]gregater: A toolset for temporal communication patterns and dynamic network structure.",
                    "Spectrum: A visual analytics tool to explore movement logs.",
                    "CrowdAnalyzer: A collaborative visual analytic system.",
                    "ParkAnalyzer: Characterizing the movement patterns of visitors VAST 2015 Mini-Challenge 1.",
                    "Safety-oriented visual analytics of people movement.",
                    "Visual scalability of spatial ensemble uncertainty.",
                    "Visually and statistically guided imputation of missing values in univariate seasonal time series.",
                    "StreamVisND: Visualizing relationships in streaming multivariate data.",
                    "A software developer's guide to informal evaluation of Visual Analytics environments using VAST Challenge information.",
                    "HTMVS: Visualizing hierarchical topics and their evolution.",
                    "Interactive semi-automatic categorization for spinel group minerals.",
                    "A System for visual exploration of caution spots from vehicle recorder data.",
                    "Visual Analytics for fraud detection and monitoring.",
                    "Visual analysis of route choice behaviour based on GPS trajectories.",
                    "Using visualization and analysis with efficient dimension Reduction to determine underlying factors in hospital inpatient procedure costs.",
                    "Topicks: Visualizing complex topic models for user comprehension.",
                    "TimeStitch: Interactive multi-focus cohort discovery and comparison.",
                    "Tell me what do you see: Detecting perceptually-separable visual patterns via clustering of image-space features in visualizations.",
                    "Sequencing of categorical time series.",
                    "Visual Pruner: Visually guided cohort selection for observational studies.",
                    "uRank: Visual analytics approach for search result exploration.",
                    "Evolution inspector: Interactive visual analysis for evolutionary molecular design.",
                    "Trending pool: Visual analytics for trending event compositions for time-series categorical log data.",
                    "Visual data quality analysis for taxi GPS data."
                ]
            },
            {
                "sub_name_abbr": "conf/scivis/2015",
                "sub_name": "2015 IEEE Scientific Visualization Conference, SciVis 2015, Chicago, IL, USA, October 25-30, 2015.",
                "count": 31,
                "papers": [
                    "VIS keynote address: An evolving visual language.",
                    "VIS capstone address: Architectures physical and digital.",
                    "A classification of user tasks in visual analysis of volume data.",
                    "Using maximum topology matching to explore differences in species distribution models.",
                    "Visual verification of space weather ensemble simulations.",
                    "A visual voting framework for weather forecast calibration.",
                    "Real-time uncertainty visualization for B-mode ultrasound.",
                    "Explicit frequency control for high-quality texture-based flow visualization.",
                    "Feature-based tensor field visualization for fiber reinforced polymers.",
                    "CPU ray tracing large particle data with balanced P-k-d trees.",
                    "Auto-calibration of multi-projector displays with a single handheld camera.",
                    "Halos in a dark sky: Interactively exploring the structure of dark matter halo merger trees.",
                    "Visualising the dark sky IEEE SciVis contest 2015.",
                    "Cavern Halos: Exploring spatial and nonspatial cosmological data in an immersive virtual environment.",
                    "Visualizing the life and anatomy of dark matter.",
                    "Integrated explorer for cosmological evolution.",
                    "Visualize the universe: Interactive exploration of cosmological dark matter simulation data.",
                    "Correlation analysis in multidimensional multivariate time-varying datasets.",
                    "OpenSpace: Public dissemination of space mission profiles.",
                    "3D superquadric glyphs for visualizing myocardial motion.",
                    "Real-time interactive time correction on the GPU.",
                    "Visualizing crossing probabilistic tracts.",
                    "An evaluation of three methods for visualizing uncertainty in architecture and archaeology.",
                    "Multiresolution visualization of digital earth data via hexagonal box-spline wavelets.",
                    "Automated visualization workflow for simulation experiments.",
                    "A bottom-up scheme for user-defined feature exploration in vector field ensembles.",
                    "A proposed multivariate visualization taxonomy from user data.",
                    "PathlinesExplorer - Image-based exploration of large-scale pathline fields.",
                    "Visualizing 3D flow through cutting planes.",
                    "Inviwo - An extensible, multi-purpose visualization framework.",
                    "High performance flow field visualization with high-order access dependencies."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25th IEEE VIS 2014",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2014",
                "sub_name": "9th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2014, Paris, France, October 25-31, 2014.",
                "count": 107,
                "papers": [
                    "Towards interactive, intelligent, and integrated multimedia analytics.",
                    "Feature-driven visual analytics of soccer data.",
                    "Baseball4D: A tool for baseball game reconstruction & visualization.",
                    "A system for visual analysis of radio signal data.",
                    "Feedback-driven interactive exploration of large multidimensional data supported by visual classifier.",
                    "An integrated visual analysis system for fusing MR spectroscopy and multi-modal radiology imaging.",
                    "An insight- and task-based methodology for evaluating spatiotemporal visual analytics.",
                    "Weaving a carpet from log entries: A network security visualization built with co-creation.",
                    "Analyzing high-dimensional multivaríate network links with integrated anomaly detection, highlighting and exploration.",
                    "Visual analysis of patterns in multiple amino acid mutation graphs.",
                    "A visual reasoning approach for data-driven transport assessment on urban roads.",
                    "Using visualizations to monitor changes and harvest insights from a global-scale logging infrastructure at Twitter.",
                    "HydroQual: Visual analysis of river water quality.",
                    "Vismate: Interactive visual analysis of station-based observation data on climate changes.",
                    "BoundarySeer: Visual analysis of 2D boundary changes.",
                    "YMCA - Your mesh comparison application.",
                    "Multi-model semantic interaction for text analytics.",
                    "Serendip: Topic model-driven visual exploration of text corpora.",
                    "TopicPanorama: A full picture of relevant topics.",
                    "Integrating predictive analytics and social media.",
                    "PEARL: An interactive visual analytic tool for understanding personal emotion style derived from social media.",
                    "Visual exploratory tool for storyline generation.",
                    "TimeGraph: A data management framework for visual analytics of large multivariate time-oriented networks.",
                    "Detecting and tracking dynamic clusters of spatial events.",
                    "A multidimensional brush for scatterplot data analytics.",
                    "TimeFork: Mixed-initiative time-series prediction.",
                    "Extracting and visualizing insights from real-time conversations around public presentations.",
                    "Towards a user-defined visual-interactive definition of similarity functions for mixed data.",
                    "Visual process mining: Event data exploration and analysis.",
                    "Interactive visualization for optimal placement of public-access AEDs.",
                    "Interactive visual support for metagenomic contig binning.",
                    "Balanced layouts using the composite data-variable matrix.",
                    "Emoticons and linguistic alignment: How visual analytics can elicit storytelling.",
                    "MovementFinder: Visual analytics of origin-destination patterns from geo-tagged social media.",
                    "PIVE: Per-Iteration visualization environment for supporting real-time interactions with computational methods.",
                    "VisIRR: Visual analytics for information retrieval and recommendation with large-scale document data.",
                    "3DArcLens: A technique for the exploration of geographical networks.",
                    "Linea: Tailoring timelines by visual exploration of temporal text.",
                    "Visual analysis of missing data - To see what isn't there.",
                    "Visualizing the effects of scale and geography in multivariate comparison.",
                    "Segmentation-free quantification of spots on a homogeneous background.",
                    "VisAdapt - Increasing nordic houseowners' adaptive capacity to climate change.",
                    "I-VEST: Intelligent visual email search and triage.",
                    "Visual analysis of stance markers in online social media.",
                    "StretchPlot: Interactive visualization of multi-dimensional trajectory data.",
                    "Visual analytics for the exploration of multiparametric cancer imaging.",
                    "A sketch+fisheye interface for visual analytics of large time-series.",
                    "Visualizing statistical analysis of curve datasets in ParaView.",
                    "Analyzing parameter influence on time-series segmentation and labeling.",
                    "Towards a tighter coupling of visualization and public policy making.",
                    "Exploiting history to reduce interaction costs in collaborative analysis.",
                    "mailVis: Visualizing emailbox for re-finding emails.",
                    "VisMOOC: Visualizing video clickstream data from massive open online courses.",
                    "The care and condition monitor: Designing a tablet based tool for visualizing informal qualitative healthcare data.",
                    "Studying propagation dynamics in networks through rule-based modeling.",
                    "Application of visual analytics to aviation safety - Wildlife strikes - The '5 W Questions'.",
                    "Interactive visual sequence mining based on pattern-growth.",
                    "MatchVis: A generalized visual multi-scale analysis framework for competitive sports.",
                    "Pantheon: Visualizing historical cultural production.",
                    "Visualization of social media flows with interactively identified key players.",
                    "VAST challenge 2014: The Kronos incident.",
                    "Using visual analytics to support decision making to solve the Kronos incident (VAST challenge 2014).",
                    "AnnotatedTimeTree, Dodeca-Rings Map & SMART: A geo-temporal analysis of criminal events.",
                    "VAST 2014: Summary on grant challenge work.",
                    "Safeguarding abila through multiple data perspectives VAST 2014 Grand Challenge award: Effective analysis and presentation.",
                    "The Kronos Incident (Mini-challenge 1).",
                    "IPM - A framework for visual sense making VAST 2014 mini-challenge 1.",
                    "VACI: Towards visual analytics for criminal investigation.",
                    "VAST 2014 mini-challenge 1: MEAT - Multiview event analysis tool of diverse data sources.",
                    "Visual analytics support for collecting and correlating evidence for intelligence analysis.",
                    "Multi-view display coordinated visualization design for crime solving analysis: Vast challenge 2014: Honorable mention for effective use of coordinated visualizations.",
                    "Summarising the structure of an organisation and reconstructing a chain of events.",
                    "Integrated visual analytics tool for heterogeneous text data.",
                    "Safeguarding Abila: Discovering evolving activist networks VAST 2014 mini challenge 1: Unstructured text and network data analysis.",
                    "VAST challenge 2014: Mini-challenge 1.",
                    "Using a knowledge graph data structure to analyze text documents (VAST challenge 2014 MC1).",
                    "Event-based text visual analytics.",
                    "Story explorer: A visual analysis tool for heterogeneous text data.",
                    "AnnotatedTimeTree: Visualization and annotation of news text and other heterogeneous document collections.",
                    "VAST 2014 Mini-challenge 1: Team Aptima.",
                    "Analysis of mobility behaviors in geographic and semantic spaces.",
                    "Patterns of life visual analytics suite for analyzing GPS movement patterns.",
                    "MovementFinder: A multi-filter visual analytics design for movement data investigation.",
                    "Exploring anomalies in GAStech: VAST 2014 Mini Challenge 1 and 2.",
                    "A three step process to design visualisations for GeoTemporal analysis (VAST 2014 Mini Challenge 2).",
                    "UCD-Griffin-MC2 submission summary.",
                    "Dodeca-rings map: Interactively finding patterns and events in large geo-temporal data.",
                    "Visual analytics for detecting behaviour patterns in geo-temporal data.",
                    "Detecting suspicious behavior using a graph-based approach.",
                    "Safeguarding Abila: Spatio-temporal activity modeling VAST 2014 Mini Challenge 2 award: Honorable mention for effective presentation.",
                    "Data mining driven visual pattern discovery: RBEI-IYER-MC2.",
                    "VAST 2014: Summary on Mini Challenge two.",
                    "Making sense of daily life data: From commonalities to anomalies: VAST 2014 Mini Challenge #2.",
                    "Visual analytics of GPS tracks: From location to place to behaviour.",
                    "Regular and unusual data visualization IIIT-H.",
                    "A collaborative visual analytics of trajectory and transaction data for digital forensics: VAST 2014 Mini-Challenge 2: Award for outstanding visualization and analysis.",
                    "NStreamAware: Real-Time visual analytics for data streams (VAST Challenge 2014 MC3).",
                    "A platform for collaborative visual analysis on streaming messages.",
                    "VAST 2014: Summary on Mini Challenge 3 work.",
                    "VAST Challenge MC1: An off the shelf approach to messy data.",
                    "Visual analytics of text streams through multiple dynamic frequency matrices.",
                    "VAST Challenge 2014 - The Kronos incident - Mini-Challenge 3.",
                    "Safeguarding Abila: Real-time streaming analysis VAST 2014 Mini Challenge 3: Streaming text analysis.",
                    "ScatterScopes: Understanding events in real-time through spatiotemporal indication and hierarchical drilldown: VAST 2014 Mini Challenge 3 Recognition: \"Honorable mention for good support for situation awareness\".",
                    "Visual analysis of streaming data with SAVI and SenseMAP.",
                    "ClueMiner: A real-time multi-dimentional visualization system: Vast Challenge 2014: Honorable mention for good support for streaming and forensic analysis.",
                    "Real-time identification and monitoring of abnormal events based on microblog and emergency call data using SMART."
                ]
            },
            {
                "sub_name_abbr": "conf/visualization/20143dvis",
                "sub_name": "2014 IEEE VIS International Workshop on 3DVis, 3DVis@IEEE VIS, Paris, France, November 9, 2014.",
                "count": 14,
                "papers": [
                    "The (possible) utility of stereoscopic 3D displays for information visualization: The good, the bad, and the ugly.",
                    "2D and 3D presentation of spatial data: A systematic review.",
                    "Beyond the classical monoscopic 3D in graph analytics: An experimental study of the impact of stereoscopy.",
                    "3D InfoVis is here to stay: Deal with it.",
                    "How to master challenges in experimental evaluation of 2D versus 3D software visualizations.",
                    "Does 3D really make sense for visual cluster analysis? yes!",
                    "Spatial augmented reality - A tool for 3D data visualization.",
                    "The evolution of three dimensional visualization for commanding the Mars rovers.",
                    "On the use of 1D, 2D, and 3D visualisation for molecular graphics.",
                    "Interaction techniques as a communication channel when presenting 3D visualizations.",
                    "Comparison of interactive environments for the archaeological exploration of 3D landscape data.",
                    "Interactive volume rendering for immersive virtual environments.",
                    "Benefits of 3D immersion for virtual colonoscopy.",
                    "SPAROGRAM: The spatial augmented reality holographic display for 3D visualization and exhibition."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th IEEE VIS 2013",
        "info": "Atlanta, GA, USA",
        "venues": []
    },
    {
        "year": "2012",
        "name": "23rd IEEE VisWeek 2012",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2012",
                "sub_name": "7th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2012, Seattle, WA, USA, October 14-19, 2012.",
                "count": 69,
                "papers": [
                    "Visual cluster exploration of web clickstream data.",
                    "An adaptive parameter space-filling algorithm for highly interactive cluster exploration.",
                    "Inter-active learning of ad-hoc classifiers for video visual analytics.",
                    "A correlative analysis process in a visual analytics environment.",
                    "Visual pattern discovery using random projections.",
                    "iLAMP: Exploring high-dimensional spacing through backward multidimensional projection.",
                    "Subspace search and visualization to make sense of alternative clusterings in high-dimensional data.",
                    "Just-in-time annotation of clusters, outliers, and trends in point-based data visualizations.",
                    "Dis-function: Learning distance functions interactively.",
                    "LeadLine: Interactive visual analysis of text data through event identification and exploration.",
                    "Relative N-gram signatures: Document visualization at the level of character N-grams.",
                    "The Deshredder: A visual analytic approach to reconstructing shredded documents.",
                    "Analyst's Workspace: An embodied sensemaking environment for large, high-resolution displays.",
                    "SocialNetSense: Supporting sensemaking of social and structural features in networks with interactive visualization.",
                    "Spatiotemporal social media analytics for abnormal event detection and examination using seasonal-trend decomposition.",
                    "AlVis: Situation awareness in the surveillance of road tunnels.",
                    "Smart super views - A knowledge-assisted interface for medical visualization.",
                    "Visual analytics for the big data era - A comparative review of state-of-the-art commercial systems.",
                    "Visual analytics methods for categoric spatio-temporal data.",
                    "Watch this: A taxonomy for dynamic data visualization.",
                    "Information retrieval failure analysis: Visual analytics as a support for interactive \"what-if\" investigation.",
                    "A visual analytics approach to understanding cycling behaviour.",
                    "Matrix-based visual correlation analysis on large timeseries data.",
                    "Feature-similarity visualization of MRI cortical surface data.",
                    "Augmenting visual representation of affectively charged information using sound graphs.",
                    "Time-oriented visualization and anticipation.",
                    "Visualising variations in household energy consumption.",
                    "Optimizing an SPT-tree for visual analytics.",
                    "Using translational science in visual analytics.",
                    "Incorporating GOMS analysis into the design of an EEG data visual analysis tool.",
                    "Exploring cyber physical data streams using Radial Pixel Visualizations.",
                    "Exploring the impact of emotion on visual judgement.",
                    "Visualizing flows of images in social media.",
                    "Using visual analytics to detect problems in datasets collected from photo-sharing services.",
                    "A generic model for the integration of interactive visualization and statistical computing using R.",
                    "The spatiotemporal multivariate hypercube for discovery of patterns in event data.",
                    "Priming Locus of Control to affect performance.",
                    "Visual exploration of local interest points in sets of time series.",
                    "Infographics at the Congressional Budget Office.",
                    "A case study: Tracking and visualizing the evolution of dark matter halos and groups of satellite halos in cosmology simulations.",
                    "VDQAM: A toolkit for database quality evaluation based on visual morphology.",
                    "LensingWikipedia: Parsing text for the interactive visualization of human history.",
                    "VAST Challenge 2012: Visual analytics for big data.",
                    "BANKSAFE: A visual situational awareness tool for large-scale computer networks: VAST 2012 challenge award: Outstanding comprehensive submission, including multiple vizes.",
                    "SemanticPrism: A multi-aspect view of large high-dimensional data: VAST 2012 Mini Challenge 1 award: Outstanding integrated analysis and visualization.",
                    "BusinessForensics HQ: VAST Challenge Mini Challenge 1 award: \"Good visualization\".",
                    "Visual analytics for situation awareness of a large-scale network: VAST 2012 Mini Challenge #1 award: \"Effective video presentation\".",
                    "M-Sieve: A visualisation tool for supporting network security analysts: VAST 2012 Mini Challenge 1 award: \"Subject matter expert's award\".",
                    "OWLAP - Using OLAP approach in anomaly detection: Award: Good support for the data preparation, analysis, and presentation process.",
                    "Monitoring the health of computer networks with visualization: VAST 2012 Mini Challenge 1 award: \"Efficient use of visualization\".",
                    "Visualizing large scale patterns and anomalies in geospatial data: VAST 2012 Mini Challenge #1 award: Honorable mention for good visual design.",
                    "SitaVis - Interactive situation awareness visualization of large datasets: VAST 2012 Mini Challenge 1 award: Honorable mention for good situational awareness snapshot.",
                    "Enhancing the \"think loop process\" with consistent interactions: VAST 2012 Mini Challenge 1 award: Honorable mention for good interaction techniques.",
                    "HIVEBEAT - A highly interactive visualization environment for broad-scale exploratory analysis and tracing: VAST 2012 Mini Challenge 1 award: Honorable mention for comprehensive visualization suite.",
                    "Investigating network traffic through compressed graph visualization: VAST 2012 Mini Challenge 2 award: \"Good adaptation of graph analysis techniques\".",
                    "NetSecRadar: A real-time visualization system for network security: VAST 2012 Mini Challenge. Award: Honorable mention for interesting use of radial visualization technique.",
                    "Dynamic analysis of large datasets with animated and correlated views: VAST 2012 Mini Challenge # award: Honorable mention for good use of coordinated displays.",
                    "Big data exploration through visual analytics.",
                    "VAST 2012 Mini-Challenge 2: Chart- and Matrix-based approach to network operations forensics.",
                    "Pixel-oriented Treemap for multiple displays.",
                    "3D anomaly bar visualization for large-scale network: VAST 2012 Mini Challenge #1.",
                    "Network infrastructure visualisation using high-dimensional node-attribute data.",
                    "Combining traditional and high-density visualizations in a dashboard to network health monitoring.",
                    "VAST Challenge 2012: Interactively finding anomalies in geo-temporal multivariate data.",
                    "Agile visual analytics for banking cyber \"big data\".",
                    "Visual analytics for network security.",
                    "Federating geovisual analytic tools for cyber security analysis.",
                    "Irregular Trend Finder: Visualization tool for analyzing time-series big data.",
                    "situ: Situational understanding and discovery for cyber attacks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22nd IEEE VisWeek 2011",
        "info": "Providence, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2011",
                "sub_name": "6th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2011, Providence, RI, USA, October 23-28, 2011.",
                "count": 59,
                "papers": [
                    "Message from the conference and paper chairs.",
                    "Visual thinking in discovery and invention: From physics to cognitive social science.",
                    "How editing and design changes news graphics.",
                    "Visual analytic roadblocks for novice investigators.",
                    "Perception-based visual quality measures.",
                    "Characterizing the intelligence analysis process: Informing visual analytics design through a longitudinal field study.",
                    "Interactive visual comparison of multiple trees.",
                    "Network-based visual analysis of tabular data.",
                    "Orion: A system for modeling, transformation and visualization of multidimensional heterogeneous networks.",
                    "G-PARE: A visual analytic tool for comparative analysis of uncertain graphs.",
                    "Visual social network analytics for relationship discovery in the enterprise.",
                    "How locus of control influences compatibility with visualization style.",
                    "Obvious: A meta-toolkit to encapsulate information visualization toolkits - One toolkit to bind them all.",
                    "Supporting effective common ground construction in Asynchronous Collaborative Visual Analytics.",
                    "Guiding feature subset selection with an interactive visualization.",
                    "Observation-level interaction with statistical models for visual analytics.",
                    "Pointwise local pattern exploration for sensitivity analysis.",
                    "Interactive decision making using dissimilarity to visually represented prototypes.",
                    "BaobabView: Interactive construction and analysis of decision trees.",
                    "From movement tracks through events to places: Extracting and characterizing significant places from mobility data.",
                    "Visual analysis of route diversity.",
                    "SensePlace2: GeoTwitter analytics support for situational awareness.",
                    "Visual analytics decision support environment for epidemic modeling and response evaluation.",
                    "SAVE: Sensor anomaly visualization engine.",
                    "A visual navigation system for querying neural stem cell imaging data.",
                    "A visual analytics process for maritime resource allocation and risk assessment.",
                    "ParallelTopics: A probabilistic approach to exploring document collections.",
                    "Analysis of large digital collections with interactive visualization.",
                    "A two-stage framework for designing visual analytics system in organizational environments.",
                    "Using random projections to identify class-separating variables in high-dimensional spaces.",
                    "Evaluation of large display interaction using smart phones.",
                    "Query-based coordinated multiple views with Feature Similarity Space for visual analysis of MRI repositories.",
                    "Reasonable abstractions: Semantics for dynamic data visualization.",
                    "Exploring agent-based simulations using temporal graphs.",
                    "Visual analytical approaches to evaluating uncertainty and bias in crowd sourced crisis information.",
                    "TreeVersity: Comparing tree structures by topology and node's attributes differences.",
                    "Visual sentiment analysis on twitter data streams.",
                    "Analysts aren't machines: Inferring frustration through visualization interaction.",
                    "Automated measures for interpretable dimensionality reduction for visual classification: A user study.",
                    "3D Visualization of temporal changes in bloggers' activities and interests.",
                    "A state transition approach to understanding users' interactions.",
                    "Visualizing an information assurance risk taxonomy.",
                    "Find distance function, hide model inference.",
                    "KD-photomap: Exploring photographs in space and time.",
                    "PORGY: Interactive and visual reasoning with graph rewriting systems.",
                    "Exploring proportions: Comparative visualization of categorical data.",
                    "Pexel and heatmap visual analysis of multidimensional gun/homicide data.",
                    "City sentinel - VAST 2011 mini challenge 1 award: \"Outstanding integration of computational and visual methods\".",
                    "Mapping an epidemic outbreak: Effective analysis and presentation.",
                    "ScatterBlogs: Geo-spatial document analysis.",
                    "epSpread - Storyboarding for visual analytics.",
                    "MobileAnalymator: Animating data changes on mobile devices.",
                    "Geovisual analytics for cyber security: Adopting the GeoViz Toolkit.",
                    "Guiding security analysis through visualization.",
                    "An integrated visualization on network events VAST 2011 mini challenge #2 award: \"Outstanding integrated overview display\".",
                    "Analyst's workspace: Protecting vastopolis.",
                    "Jigsaw to save vastopolis.",
                    "Interactive data analysis with nSpace2®.",
                    "Visual analytics of terrorist activities related to epidemics."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21st IEEE VisWeek 2010",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2010",
                "sub_name": "5th IEEE Conference on Visual Analytics Science and Technology, IEEE VAST 2010, Salt Lake City, UT, USA, October 24-29, 2010, part of VisWeek 2010.",
                "count": 64,
                "papers": [
                    "Keynote address: How will big pictures emerge from a sea of [...] biological data?",
                    "DimStiller: Workflows for dimensional analysis and reduction.",
                    "Visual exploration of classification models for risk assessment.",
                    "Improving the visual analysis of high-dimensional datasets using quality measures.",
                    "iVisClassifier: An interactive visual analytics system for classification based on supervised dimension reduction.",
                    "Finding and visualizing relevant subspaces for clustering high-dimensional astronomical data using connected morphological operators.",
                    "Flow-based scatterplots for sensitivity analysis.",
                    "Anomaly detection in GPS data based on visual analytics.",
                    "Discovering bits of place histories from people's activity traces.",
                    "A visual analytics approach to model learning.",
                    "Multidimensional data dissection using attribute relationship graphs.",
                    "Visual market sector analysis for financial time series data.",
                    "Two-stage framework for a topology-based projection and visualization of classified document collections.",
                    "Understanding text corpora with multiple facets.",
                    "VizCept: Supporting synchronous collaboration for constructing visualizations in intelligence analysis.",
                    "Diamonds in the rough: Social media visual analytics for journalistic inquiry.",
                    "Visual readability analysis: How to make your writings easier to read.",
                    "NetClinic: Interactive visualization to enhance automated fault diagnosis in enterprise networks.",
                    "Geo-historical context support for information foraging and sensemaking: Conceptual model, implementation, and assessment.",
                    "Real-time aggregation of Wikipedia data for visual analytics.",
                    "Click2Annotate: Automated Insight Externalization with rich semantics.",
                    "Interactive querying of temporal data using a comic strip metaphor.",
                    "A closer look at note taking in the co-located collaborative visual analytics process.",
                    "An exploratory study of co-located collaborative visual analytics around a tabletop display.",
                    "Helping users recall their reasoning process.",
                    "Comparing different levels of interaction constraints for deriving visual problem isomorphs.",
                    "Towards the Personal Equation of Interaction: The impact of personality factors on visual analytics interface interaction.",
                    "Poster: Dynamic time transformation for interpreting clusters of trajectories with space-time cube.",
                    "Interactive visual analysis of multiobjective optimizations.",
                    "Cluster correspondence views for enhanced analysis of SOM displays.",
                    "Visualization of temporal relationships within coordinated views.",
                    "Conveying network features in geospatial battlespace displays.",
                    "ALIDA: Using machine learning for intent discernment in visual analytics interfaces.",
                    "Enhancing text-based chat with visuals for hazardous weather decision making.",
                    "Visual analysis of frequent patterns in large time series.",
                    "Visually representing geo-temporal differences.",
                    "A continuous analysis process between desktop and collaborative visual analytics environments.",
                    "EmailTime: Visual analytics of emails.",
                    "Enron case study: Analysis of email behavior using EmailTime.",
                    "Large-scale neuroanatomical visualization using a manifold embedding approach.",
                    "Combining statistical independence testing, visual attribute selection and automated analysis to find relevant attributes for classification.",
                    "Visual tools for dynamic analysis of complex situations.",
                    "Data representation and exploration with Geometric Wavelets.",
                    "Poster: Translating cross-filtered queries into questions.",
                    "ProDV - A case study in delivering visual analytics.",
                    "A Visual Analytics approach to identifying protein structural constraints.",
                    "A radial visualization tool for depicting hierarchically structured video content.",
                    "Adapting Daniel and Wood's modeling approach to interactive visual analytics.",
                    "The state of visual analytics: Views on what visual analytics is and where it is going.",
                    "VAST 2010 Challenge: Arms dealings and pandemics.",
                    "Multi-viz data fusion VAST 2010 Grand Challenge award: Outstanding debrief.",
                    "CZSaw, IMAS & Tableau: Collaboration among teams: VAST 2010 Grand Challenge award: Excellent student team analysis.",
                    "VisWorks text and network visual analytics: VAST 2010 Mini Challenge 1 award: \"Effective interactive visualization of document contents\".",
                    "Data ingestion and evidence marshalling in Jigsaw VAST 2010 Mini Challenge 1 award: Good support for data ingest.",
                    "Integrated visual analytics workflow with GeoTime and nSpace VAST 2010 mini challenge 1 award: Outstanding Analysis and Accuracy.",
                    "Model based interactive analysis of interwoven, imprecise narratives: VAST 2010 mini challenge 1 award: Outstanding interaction model.",
                    "Visual analytics of a pandemic spread: VAST 2010 Mini Challenge 2 award: Thorough description of analytic process.",
                    "VASTvis - Visual analytics with multiple coordinated views: VAST 2010 Mini Challenge 2 award: Good analytic process and explanation.",
                    "VACCINATED - Visual analytics for characterizing a pandemic spread VAST 2010 Mini Challenge 2 award: Support for future detection.",
                    "Periscopic visualizes symptomatology of pandemic: VAST 2010 Mini Challenge 2 award: Effective visualization of symptoms.",
                    "Designing visual analytics systems for disease spread and evolution: VAST 2010 mini challenge 2 and 3 award: Good overall design and analysis.",
                    "Gene similarity uncovers mutation path VAST 2010 mini challenge 3 award: Innovative tool adaptation.",
                    "A statistical approach to measuring alignment of genetic sequences and determining critical mutations in a viral gene sequence: VAST 2010 Mini challenge 3 award: Innovative visualization.",
                    "GeneTracer: Gene sequence analysis of disease mutations VAST 2010 mini challenge 3 award: Excellent process explanation."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20th IEEE VisWeek 2009",
        "info": "Atlantic City, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2009",
                "sub_name": "4th IEEE Symposium on Visual Analytics Science and Technology, IEEE VAST 2009, Atlantic City, NJ, USA, October 11-16, 2009, part of VisWeek 2009.",
                "count": 60,
                "papers": [
                    "Preface.",
                    "Using stories to understand patterns.",
                    "Interactive visual clustering of large collections of trajectories.",
                    "Proximity-based visualization of movement trace data.",
                    "Guided analysis of hurricane trends using statistical processes integrated with interactive parallel coordinates.",
                    "Finding comparable temporal categorical records: A similarity measure with an interactive visualization.",
                    "A visual analytics system for radio frequency fingerprinting-based localization.",
                    "Geovisual analytics for self-organizing network data.",
                    "A framework for uncertainty-aware visual analytics.",
                    "Combining automated analysis and visualization techniques for effective exploration of high-dimensional data.",
                    "Two-stage framework for visualization of clustered high dimensional data.",
                    "Model space visualization for multivariate linear trend discovery.",
                    "LSAView: A tool for visual exploration of latent semantic modeling.",
                    "Parallel Tag Clouds to explore and analyze faceted text corpora.",
                    "Describing story evolution from dynamic information streams.",
                    "What's being said near \"Martha\"? Exploring name entities in literary text collections.",
                    "VAST contest dataset use in education.",
                    "Connecting the dots in visual analysis.",
                    "Capturing and supporting the analysis process.",
                    "Evaluating visual analytics systems for investigative analysis: Deriving design principles from a case study.",
                    "A multi-level middle-out cross-zooming approach for large graph analytics.",
                    "Visual analysis of graphs with multiple connected components.",
                    "MassVis: Visual analysis of protein complexes using mass spectrometry.",
                    "Using projection and 2D plots to visually reveal genetic mechanisms of complex human disorders.",
                    "SpRay: A visual analytics approach for gene expression data.",
                    "Visual opinion analysis of customer feedback data.",
                    "FinVis: Applied visual analytics for personal financial planning.",
                    "Iterative integration of visual insights during patent search and analysis.",
                    "Analysis of community-contributed space- and time-referenced data (example of flickr and panoramio photos).",
                    "Interactive poster: A proposal for sharing user requirements for visual analytic tools.",
                    "Working memory load as a novel tool for evaluating visual analytics.",
                    "Comparing two interface tools in performing visual analytics tasks.",
                    "A scalable architecture for visual data exploration.",
                    "Interactive visual analysis of location reporting patterns.",
                    "Reordered tilebars for visual text exploration.",
                    "Visual knowledge exploration and discovery from different points of view.",
                    "Poster: Visual prediction of time series.",
                    "ProcessLine: Visualizing time-series data in process industry.",
                    "Articulate: a conversational interface for visual analytics.",
                    "BEADS: High dimensional data cluster visualization.",
                    "Interactive poster: Interactive multiobjective optimization - a new application area for visual analytics.",
                    "Poster: Icexplorer: Studying Great Lakes Ice cover.",
                    "VAST 2009 challenge: An insider threat.",
                    "Timeline analysis of undercover activities VAST 2009 traffic mini challenge award: Good analytical technique.",
                    "Solving the traffic and flitter challenges with tulip.",
                    "Palantir: A visualization platform for real-world analysis.",
                    "Combining iterative analytical reasoning and software development using the visualization language Processing.",
                    "Integrative visual analytics for suspicious behavior detection.",
                    "Detecting and analyzing relationships among anomalies.",
                    "VIDI surveillance - embassy monitoring and oversight system.",
                    "VIScover: Visualizing, exploring, and analysing structured data.",
                    "Visualization of uncertainty and analysis of geographical data.",
                    "Multiple step social structure analysis with Cytoscape.",
                    "EAKOS: VAST 2009.",
                    "Visualized subgraph search.",
                    "Innovative filtering techniques and customized analytics tools.",
                    "VAST 2009 Traffic Mini Challenge: Intuitive analytic information presentation.",
                    "Professional analysts using a large, high-resolution display.",
                    "Merging visual analysis with automated reasoning: Using Prajna to solve the traffic challenge.",
                    "How interactive visualization can assist investigative analysis: Views and perspectives from domain experts."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19th IEEE VisWeek 2008",
        "info": "Columbus, OH, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2008",
                "sub_name": "3rd IEEE Symposium on Visual Analytics Science and Technology, IEEE VAST 2008, Columbus, OH, USA, October 19-24, 2008.",
                "count": 46,
                "papers": [
                    "Keynote address Practical applications of visual analytics: On the cusp of widespread adoption.",
                    "Visual cluster analysis of trajectory data with interactive Kohonen Maps.",
                    "Crystal structures classifier for an evolutionary algorithm structure predictor.",
                    "Model-driven Visual Analytics.",
                    "Using visual analytics to maintain situation awareness in astrophysics.",
                    "Understanding syndromic hotspots - a visual analytics approach.",
                    "Configurable Spaces: Temporal analysis in diagrammatic contexts.",
                    "Spatio-temporal aggregation for visual analysis of movements.",
                    "Maintaining interactivity while exploring massive time series.",
                    "Collaborative synthesis of visual analytic results.",
                    "Visual evaluation of text features for document summarization and analysis.",
                    "Evaluating the relationship between user interaction and financial visual analysis.",
                    "Visual analytics for complex concepts using a human cognition model.",
                    "Entity-based collaboration tools for intelligence analysis.",
                    "Applied visual analytics for economic decision-making.",
                    "Narratives: A visualization to track narrative events as they develop.",
                    "Characterizing users' visual analytic activity for insight provenance.",
                    "The Scalable Reasoning System: Lightweight visualization for distributed analytics.",
                    "Generating hypotheses of trends in high-dimensional data skeletons.",
                    "Multivariate visual explanation for high dimensional datasets.",
                    "Visual mining of multimedia data for social and behavioral studies.",
                    "Multidimensional visual analysis using cross-filtered views.",
                    "Interactive poster: Visual analytic techniques for CO2 emissions and concentrations in the United States.",
                    "Envisioning user models for adaptive visualization.",
                    "A compound approach for interactive visualization of time-oriented data.",
                    "Interactive poster - SocialRank: An ego- and time-centric workflow for relationship identification.",
                    "Visual analysis for mutual fund performance.",
                    "An information visualisation system for the understanding of web data.",
                    "Supporting exploration awareness for visual analytics.",
                    "Interactive poster: Visual data mining of unevenly-spaced event sequences.",
                    "A 3D treemap approach for analyzing the classificatory distribution in patent portfolios.",
                    "Visual analysis of seismic simulation data.",
                    "VAST 2008 Challenge: Introducing mini-challenges.",
                    "Grand challenge award: Data integration visualization and collaboration in the VAST 2008 Challenge.",
                    "Grand challenge award 2008: Support for diverse analytic techniques - nSpace2 and GeoTime visual analytics.",
                    "Grand challenge award: Interactive visual analytics palantir: The future of analysis.",
                    "Migrant boat mini challenge award: Simple and effective integrated display geo-temporal analysis of migrant boats.",
                    "Evacuation trace Mini Challenge award: Tool integration analysis of movements with Geospatial Visual Analytics Toolkit.",
                    "Cell phone mini challenge award: Social network accuracy - exploring temporal communication in mobile call graphs.",
                    "Evacuation traces mini challenge: User testing to obtain consensus discovering the terrorist.",
                    "Cell phone mini challenge award: Intuitive social network graphs visual analytics of cell phone data using mobivis and ontovis.",
                    "Using SocialAction to uncover structure in social networks over time.",
                    "Cell phone Mini Challenge: Node-link animation award animating multivariate dynamic social networks.",
                    "Migrant boat mini challenge award: Analysis summary a geo-temporal analysis of the migrant boat dataset.",
                    "Evacuation Traces Mini Challenge award: Innovative trace visualization staining for information discovery.",
                    "Award: Efficient toolkit integration solving the cell phone calls challenge with the Prajna Project."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18th Vis / 13th InfoVis / 2nd VAST 2007",
        "info": "Sacramento, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2007",
                "sub_name": "2nd IEEE Symposium on Visual Analytics Science and Technology, IEEE VAST 2007, Sacramento, CA,USA, October 30 - November 1, 2007.",
                "count": 48,
                "papers": [
                    "InfoVis as Seen by the World Out There: 2007 in Review.",
                    "Activity Analysis Using Spatio-Temporal Trajectory Volumes in Surveillance Applications.",
                    "FemaRepViz: Automatic Extraction and Geo-Temporal Visualization of FEMA National Situation Updates.",
                    "Stories in GeoTime.",
                    "LAHVA: Linked Animal-Human Health Visual Analytics.",
                    "Visual Analytics on Mobile Devices for Emergency Response.",
                    "Visual Analytics Approach to User-Controlled Evacuation Scheduling.",
                    "Thin Client Visualization.",
                    "IMAS: The Interactive Multigenomic Analysis System.",
                    "Balancing Interactive Data Management of Massive Data with Situational Awareness through Smart Aggregation.",
                    "ClusterSculptor: A Visual Analytics Tool for High-Dimensional Data.",
                    "Analysis Guided Visual Exploration of Multivariate Data.",
                    "Intelligent Visual Analytics Queries.",
                    "Point Placement by Phylogenetic Trees and its Application to Visual Analysis of Document Collections.",
                    "Analyzing Large-Scale News Video Databases to Support Knowledge Visualization and Intuitive Retrieval.",
                    "Literature Fingerprinting: A New Method for Visual Literary Analysis.",
                    "NewsLab: Exploratory Broadcast News Video Analysis.",
                    "Jigsaw: Supporting Investigative Analysis through Interactive Visualization.",
                    "SpiralView: Towards Security Policies Assessment through Visual Correlation of Network Resources with Evolution of Alarms.",
                    "Session Viewer: Visual Exploratory Analysis of Web Session Logs.",
                    "WireVis: Visualization of Categorical, Time-Varying Data From Financial Transactions.",
                    "Us vs. Them: Understanding Social Dynamics in Wikipedia with Revert Graph Visualizations.",
                    "Design Considerations for Collaborative Visual Analytics.",
                    "Visual Analysis of Controversy in User-generated Encyclopedias.",
                    "DataMeadow: A Visual Canvas for Analysis of Large-Scale Multivariate Data.",
                    "VAST to Knowledge: Combining tools for exploration and mining.",
                    "VAST 2007 Contest Interactive Poster: Data Analysis Using NdCore and REGGAE.",
                    "Visual Analytics with Jigsaw.",
                    "Something's \"Fishy\" at Global Ways and Gill Breeders - Analysis with nSpace and GeoTime.",
                    "TextPlorer: An application supporting text analysis.",
                    "University of British Columbia & Simon Fraser University - The Bricolage.",
                    "VisPad: Integrating Visualization, Navigation and Synthesis.",
                    "C-GROUP: A Visual Analytic Tool for Pairwise Analysis of Dynamic Group Membership.",
                    "Situation Awareness Tool for Global Argus.",
                    "Spectra transformed for model-testing and visual exploration.",
                    "Formalizing Analytical Discourse in Visual Analytics.",
                    "Sunfall: A Collaborative Visual Analytics System for Astrophysics.",
                    "Visual Analysis of Dynamic Networks with Geological Clustering.",
                    "From Tasks to Tools: A Field Study in Collaborative Visual Analytics.",
                    "Outlook for Visual Analytics Research Funding.",
                    "VAST 2007 Contest - Blue Iguanodon.",
                    "VAST 2007 Contest - Analysis with nSpace and GeoTime.",
                    "Jigsaw meets Blue Iguanodon - The VAST 2007 Contest.",
                    "VAST to Knowledge: Combining tools for exploration and mining.",
                    "University of British Columbia & Simon Fraser University - The Bricolage.",
                    "Intelligence Analysis Using Titan.",
                    "VAST 2007 Contest TexPlorer.",
                    "VAST 2007 Contest Data Analysis Using NdCore and REGGAE."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17th Vis / 12th InfoVis / 1st VAST 2006",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ieeevast/2006",
                "sub_name": "1st IEEE Symposium On Visual Analytics Science And Technology, IEEE VAST 2006, Baltimore, MD, USA, October 31 - November 2, 2006.",
                "count": 29,
                "papers": [
                    "Designer Information - Why Visualization and Analytics Technologies Should Help Us Focus Our Minds and Not Our Senses.",
                    "Time Tree: Exploring Time Changing Hierarchies.",
                    "Visual Exploration of Spatio-temporal Relationships for Scientific Data.",
                    "Visual Analytics of Paleoceanographic Conditions.",
                    "Avian Flu Case Study with nSpace and GeoTime.",
                    "Visual Analysis of Historic Hotel Visitation Patterns.",
                    "D-Dupe: An Interactive Tool for Entity Resolution in Social Networks.",
                    "Interactive Visual Synthesis of Analytic Knowledge.",
                    "Visual Analysis of Conflicting Opinions.",
                    "Have Green - A Visual Analytics Framework for Large Semantic Graphs.",
                    "Exploring Large-Scale Video News via Interactive Visualization.",
                    "Interactive Visualization and Analysis of Network and Sensor Data on Mobile Devices.",
                    "NetLens: Iterative Exploration of Content-Actor Network Data.",
                    "Interactive Wormhole Detection in Large Scale Wireless Networks.",
                    "Enhancing Visual Analysis of Network Traffic Using a Knowledge Representation.",
                    "Accelerating Network Traffic Analytics Using Query-Driven Visualization.",
                    "Monitoring Network Traffic with Radial Traffic Analyzer.",
                    "Toward a Multi-Analyst, Collaborative Framework for Visual Analytics.",
                    "Collaborative Visual Analytics: Inferring from the Spatial Organization and Collaborative Use of Information.",
                    "Beyond Usability: Evaluation Aspects of Visual Analytic Environments.",
                    "Visualizing the Performance of Computational Linguistics Algorithms.",
                    "Scentindex: Conceptually Reorganizing Subject Indexes for Reading.",
                    "A Visual Interface for Multivariate Temporal Data: Finding Patterns of Events across Multiple Histories.",
                    "User Interfaces for the Exploration of Hierarchical Multi-dimensional Data.",
                    "Exploratory Visualization of Multivariate Data with Variable Quality.",
                    "Semantic Image Browser: Bridging Information Visualization with Automated Intelligent Image Analysis.",
                    "Pixnostics: Towards Measuring the Value of Visualization.",
                    "Visual Analytics Education.",
                    "VAST 2006 Contest - A Tale of Alderwood."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16th Vis / 11th InfoVis 2005",
        "info": "Minneapolis, MN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2005",
                "sub_name": "16th IEEE Visualization Conference, IEEE Vis 2005, Minneapolis, MN, USA, October 23-28, 2005, Proceedings.",
                "count": 134,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Preface.",
                    "Keynote.",
                    "Capstone Address.",
                    "Committees.",
                    "Awards.",
                    "2D Asymmetric Tensor Analysis.",
                    "Exploring 2D Tensor Fields Using Stress Nets.",
                    "Illuminated Lines Revisited.",
                    "HOT- Lines: Tracking Lines in Higher Order Tensor Fields.",
                    "Visualizing Tensor Fields in Geomechanics.",
                    "Framework for Visualizing Higher-Order Basis Functions.",
                    "Visualization of White Matter Tracts with Wrapped Streamlines.",
                    "Fast and Reproducible Fiber Bundle Selection in DTI Visualization.",
                    "Evaluation of Fiber Clustering Methods for Diffusion Tensor Imaging.",
                    "The Application of GPU Particle Tracing to Diffusion Tensor Field Visualization.",
                    "The Value of Visualization.",
                    "On the Optimization of Visualizations of Complex Phenomena.",
                    "Curve-Skeleton Applications.",
                    "Sort-Middle Multi-Projector Immediate-Mode Rendering in Chromium.",
                    "COTS Cluster-based Sort-last Rendering: Performance Evaluation and Pipelined Implementation.",
                    "OpenGL Multipipe SDK: A Toolkit for Scalable Parallel Rendering.",
                    "A Shader-Based Parallel Rendering Framework.",
                    "VisTrails: Enabling Interactive Multiple-View Visualizations.",
                    "Build-by-Number: Rearranging the Real World to Visualize Novel Architectural Spaces.",
                    "Phonon Tracing for Auralization and Visualization of Sound.",
                    "The Visible Radio: Process Visualization of a Software-Defined Radio.",
                    "Query-Driven Visualization of Large Data Sets.",
                    "Visualization of Time-Dependent Remote Adaptive Mesh Refinement Data.",
                    "Distributed Data Management for Large Volume Visualization.",
                    "A Contract Based System For Large Data Visualization.",
                    "Interactive Rendering of Large Unstructured Grids Using Dynamic Level-of-Detail.",
                    "Batched Multi Triangulation.",
                    "View-Dependent Rendering of Multiresolution Texture-Atlases.",
                    "Exploiting Frame-to-Frame Coherence for Accelerating High-Quality Volume Raycasting on Graphics Hardware.",
                    "Streaming Meshes.",
                    "Stream-Processing Points.",
                    "VolumeExplorer: Roaming Large Volumes to Couple Visualization and Data Processing for Oil and Gas Exploration.",
                    "Reflection Nebula Visualization.",
                    "Multimodal Exploration of the Fourth Dimension.",
                    "High Performance Volume Splatting for Visualization of Neurovascular Data.",
                    "Teniae Coli Guided Navigation and Registration for Virtual Colonoscopy.",
                    "Statistically Quantitative Volume Visualization.",
                    "Scale-Invariant Volume Rendering.",
                    "Rendering Tetrahedral Meshes with Higher-Order Attenuation Functions for Digital Radiograph Reconstruction.",
                    "Prefiltered Gaussian Reconstruction for High-Quality Rendering of Volumetric Data sampled on a Body-Centered Cubic Grid.",
                    "VolQD: Direct Volume Rendering of Multi-million Atom Quantum Dot Simulations.",
                    "High Dynamic Range Volume Visualization.",
                    "Volume rendering of smoke propagation CFD data.",
                    "Hardware-Accelerated Simulated Radiography.",
                    "Fast Visualization by Shear-Warp on Quadratic Super-Spline Models Using Wavelet Data Decompositions.",
                    "Dataset Traversal with Motion-Controlled Transfer Functions.",
                    "The Magic Volume Lens: An Interactive Focus+Context Technique for Volume Rendering.",
                    "Effectively Visualizing Large Networks Through Sampling.",
                    "Opening the Black Box - Data Driven Visualization of Neural Network.",
                    "Interactive Visual Analysis and Exploration of Injection Systems Simulations.",
                    "Quality Mesh Generation for Molecular Skin Surfaces Using Restricted Union of Balls.",
                    "Surface Reconstruction Via Contour Metamorphosis: An Eulerian Approach With Lagrangian Particle Tracking.",
                    "Reconstructing Manifold and Non-Manifold Surfaces from Point Clouds.",
                    "Marching Diamonds for Unstructured Meshes.",
                    "Evolutionary Morphing.",
                    "Hardware-Accelerated 3D Visualization of Mass Spectrometry Data.",
                    "Differential Protein Expression Analysis via Liquid-Chromatography/Mass-Spectrometry Data Visualization.",
                    "The Software Interface to the 3D-Force Microscope.",
                    "Opening the Can of Worms: An Exploration Tool for Vortical Flows.",
                    "Strategy for Seeding 3D Streamlines.",
                    "Farthest Point Seeding for Efficient Placement of Streamlines.",
                    "View Selection for Volume Rendering.",
                    "A Feature-Driven Approach to Locating Optimal Viewpoints for Volume Visualization.",
                    "Visualizing intersecting surfaces with nested-surface techniques.",
                    "Understanding Visualization through Spatial Ability Differences.",
                    "Eyegaze Analysis of Displays With Combined 2D and 3D Views.",
                    "Visualizing Data with Motion.",
                    "Topology-based Simplification for Feature Extraction from 3D Scalar Fields.",
                    "Topology-driven Surface Mappings with Robust Feature Alignment.",
                    "Topological Structures of 3D Tensor Fields.",
                    "Extracting Higher Order Critical Points and Topological Simplification of 3D Vector Fields.",
                    "Visualization of the Genus of Knots.",
                    "Visualizing the tightening of knots.",
                    "Visualization in the Einstein Year 2005: A Case Study on Explanatory and Illustrative Visualization of Relativity and Astrophysics.",
                    "A Handheld Flexible Display System.",
                    "Profile Flags: a Novel Metaphor for Probing of T2 Maps.",
                    "Eyelet Particle Tracing - Steady Visualization of Unsteady Flow.",
                    "Interpolation And Visualization For Advected Scalar Fields.",
                    "Visual Analysis and Exploration of Fluid Flow in a Cooling Jacket.",
                    "Extraction of Parallel Vector Surfaces in 3D Time-Dependent Fields and Application to Vortex Core Line Tracking.",
                    "Particle and Texture Based Spatiotemporal Visualization of Time-Dependent Vector Fields.",
                    "Texture-Based Visualization of Uncertainty in Flow Fields.",
                    "Example-based Volume Illustrations.",
                    "Illustrative Display of Hidden Iso-Surface Structures.",
                    "VolumeShop: An Interactive System for Direct Volume Illustration.",
                    "Illustration-inspired techniques for visualizing time-varying data.",
                    "Illustration and Photography Inspired Visualization of Flows and Volumes.",
                    "Visualization with stylized line primitives.",
                    "Interactive Poster: Using CoMIRVA for Visualizing Similarities Between Music Artists.",
                    "Visual Exploration of Multidimensional Feature Space of Biological Data.",
                    "Exploring Defects in Nematic Liquid Crystals.",
                    "Neuroanatomical image alignment.",
                    "A Visualization Tool for fMRI Data Mining.",
                    "Integrated 3D Visualization of fMRI and DTI tractography.",
                    "Dynamic Volume Rendering for Intensity Modulated Radiation Therapy (IMRT) Treatment.",
                    "Volume Exploration Using Spatially Linked Transfer Functions.",
                    "Scientific Visualization of time-Varying Oceanographic and Meteorological Data using VR.",
                    "Enclosure Sphere Based Cell Visibility for Virtual Endoscopy.",
                    "Perceptually-Based Comparisons of Direct Volume Rendered Images.",
                    "Evaluation of Areal Touch Feedback for Palpation Simulation.",
                    "Using Visual Design Expertise to Characterize the Effectiveness of 2D Scientific Visualization Methods.",
                    "A web-based visualization solution for very large 2D datasets.",
                    "NASA's Scientific Visualization Studio Image Server.",
                    "The EventScope Remote Science Operations Tool: Using a Visualization of a Remote Location as an Interface for Robotic Exploration.",
                    "Noise-Adjusted Principle Component Analysis For Hyperspectral Remotely Sensed Imagery Visualization.",
                    "Interactive CSG Trees Inside Complex Scenes.",
                    "View-dependent Meshing And Rendering of Tetrahedral Meshes.",
                    "Particle Generation from User-specified Transfer Function for Point-based Volume Rendering.",
                    "Anisotropic Ellipsoidal Smoothing of Volume Data.",
                    "A System for Interactive Volume Visualization on the PowerWall.",
                    "Visualizing Large Scale Laser-Plasma Interaction 3D Simulations Using Parallel VTK and Extensions on Clusters.",
                    "Visualization in the Earth Sciences: A Discussion on Various Visualization Methods using amira.",
                    "Clustering Techniques for Out-of-Core Multi-resolution Modeling.",
                    "Volume Rendering of Real-Time 3D Echocardiographic Data.",
                    "A Concurrent Visualization System for High-Performance Computational Simulations.",
                    "PSALM: A Data Model for Pervasive Visualization.",
                    "Design and Evaluation in Visualization Research.",
                    "The Visualization Process: The Path from Data to Insight.",
                    "End Users' Perspectives on Volume Rendering in Medical Imaging: A job well done or not over yet?",
                    "Illustrative Rendering Techniques for Visualization: Future of Visualization or Just Another Technique?.",
                    "General Purpose Computation on Graphics Hardware.",
                    "Visual Medicine: Part One - Medical Imaging.",
                    "Visual Medicine: Part Two - Advanced Applications of Medical Imaging.",
                    "Illustrative Visualization.",
                    "Level Set and PDE Methods for Visualization.",
                    "Visualization and Mining of Temporal Data.",
                    "Color in Information Display."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2005",
                "sub_name": "IEEE Symposium on Information Visualization (InfoVis 2005), 23-25 October 2005, Minneapolis, MN, USA.",
                "count": 31,
                "papers": [
                    "Baby Names, Visualization, and Social Data Analysis.",
                    "A Sky Dome Visualisation for Identification of Astronomical Orientations.",
                    "Interactive Visualization of Genealogical Graphs.",
                    "The Visual Code Navigator: An Interactive Toolset for Source Code Investigation.",
                    "Vizster: Visualizing Online Social Networks.",
                    "PRISAD: A Partitioned Rendering Infrastructure for Scalable Accordion Drawing.",
                    "Voronoi Treemaps.",
                    "Elastic Hierarchies: Combining Treemaps and Node-Link Diagrams.",
                    "DIG-COLA: Directed Graph Layout through Constrained Energy Minimization.",
                    "Dynamic Visualization of Graphs with Extended Labels.",
                    "An Evaluation of Content Browsing Techniques for Hierarchical Space-Filling Visualizations.",
                    "Turning the Bucket of Text into a Pipe.",
                    "Visual Correlation for Situational Awareness.",
                    "Highlighting Conflict Dynamics in Event Data.",
                    "Low-Level Components of Analytic Activity in Information Visualization.",
                    "Simple 3D Glyphs for Spatial Multivariate Data.",
                    "Revealing Structure within Clustered Parallel Coordinates Displays.",
                    "Parallel Sets: Visual Analysis of Categorical Data.",
                    "Multivariate Glyphs for Multi-Object Clusters.",
                    "An Interactive 3D Integration of Parallel Coordinates and Star Glyphs.",
                    "Graph-Theoretic Scagnostics.",
                    "Visualizing Coordination In Situ.",
                    "Two-Tone Pseudo Coloring: Compact Visualization for One-Dimensional Data.",
                    "A Note on Space-Filling Visualizations and Space-Filling Curves.",
                    "An Optimization-based Approach to Dynamic Visual Context Management.",
                    "Adapting the Cognitive Walkthrough Method to Assess the Usability of a Knowledge Domain Visualization.",
                    "Importance-Driven Visualization Layouts for Large Time Series Data.",
                    "Temporal Visualization of Planning Polygons for Efficient Partitioning of Geo-Spatial Data.",
                    "Flow Map Layout.",
                    "Visualization of Graphs with Associated Timeseries Data.",
                    "Interactive Sankey Diagrams."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15th Vis / 10th InfoVis 2004",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2004",
                "sub_name": "15th IEEE Visualization Conference, IEEE Vis 2004, Austin, TX, USA, October 10-15, 2004, Proceedings.",
                "count": 111,
                "papers": [
                    "Keynote Address: The Human Visual System: How Is Its Design Related to the Physics of the Natural Environment?",
                    "Capstone Address: Self-Illustrating Phenomena.",
                    "Methods for Efficient, High Quality Volume Resampling in the Frequency Domain.",
                    "Linear and Cubic Box Splines for the Body Centered Cubic Lattice.",
                    "Light Weight Space Leaping using Ray Coherence.",
                    "Projecting Tetrahedra without Rendering Artifacts.",
                    "Flow Field Clustering via Algebraic Multigrid.",
                    "Centroidal Voronoi Tessellation Based Algorithms for Vector Fields Visualization and Segmentation.",
                    "Investigating Swirl and Tumble Flow with a Comparison of Visualization Techniques.",
                    "Visualizing Gyrokinetic Simulations.",
                    "Hardware-Accelerated Adaptive EWA Volume Splatting.",
                    "Generating Sub-Resolution Detail in Images and Volumes Using Constrained Texture Synthesis.",
                    "Constrained Inverse Volume Rendering for Planetary Nebulae.",
                    "Generating Realistic Images from Hydrothermal Plume Data.",
                    "Rendering Implicit Flow Volumes.",
                    "Anisotropic Volume Rendering for Extremely Dense, Thin Line Data.",
                    "Display of Vector Fields Using a Reaction-Diffusion Model.",
                    "Physically Based Methods for Tensor Field Visualization.",
                    "Quick-VDR: Interactive View-Dependent Rendering of Massive Models.",
                    "Importance-Driven Volume Rendering.",
                    "Visibility Culling for Time-Varying Volume Rendering Using Temporal Occlusion Coherence.",
                    "Visualization in Grid Computing Environments.",
                    "Visualizing Competitive Behaviors in Multi-User Virtual Environments.",
                    "Scout: A Hardware-Accelerated System for Quantitatively Driven Visualization and Analysis.",
                    "Vorticity Based Flow Analysis and Visualization for Pelton Turbine Design Optimization.",
                    "Visualization of Intricate Flow Structures for Vortex Breakdown Analysis.",
                    "A Graphics Hardware-Based Vortex Detection and Visualization System.",
                    "Radial Hermite Operators for Scattered Point Cloud Data with Normal Vectors and Applications to Implicitizing Polygon Mesh Surfaces for Generalized CSG Operations and Smoothing.",
                    "Compatible Triangulations of Spatial Decompositions.",
                    "Adaptive 4-8 Texture Hierarchies.",
                    "Immersive Design of DNA Molecules with a Tangible Interface.",
                    "Augmented Reality with Tangible Auto-Fabricated Models for Molecular Biology Applications.",
                    "TexMol: Interactive Visual Exploration of Large Flexible Multi-Component Molecular Complexes.",
                    "Rough Interface Reconstruction Using the Level Set Method.",
                    "Surface Reconstruction of Noisy and Defective Data Sets.",
                    "Optimal Global Conformal Surface Parameterization.",
                    "Local and Global Comparison of Continuous Functions.",
                    "Light Collages: Lighting Design for Effective Visualization.",
                    "Lighting Transfer Functions Using Gradient Aligned Sampling.",
                    "Haptic Display of Interaction between Textured Models.",
                    "On the Role of Color in the Perception of Motion in Animated Visualizations.",
                    "Topological Lines in 3D Tensor Fields.",
                    "Stream Line and Path Line Oriented Topology for 2D Time-Dependent Vector Fields.",
                    "Tracking of Vector Field Singularities in Unstructured 3D Time-Dependent Datasets.",
                    "Topology Visualization of the Optical Power Flow through a Novel C-Shaped Nano-Aperture.",
                    "Interactive Exploration of Large Remote Micro-CT Scans.",
                    "Interactive Terascale Particle Visualization.",
                    "Intuitive and Interactive Modification of Large Finite Element Models.",
                    "Visualization of Salt-Induced Stress Perturbations.",
                    "Exploration of the Brain's White Matter Pathways with Dynamic Queries.",
                    "The VesselGlyph: Focus & Context Visualization in CT-Angiography.",
                    "Non-Linear Model Fitting to Parameterize Diseased Blood Vessels.",
                    "Visualizing Cortical Waves and Timing from Data.",
                    "Rendering Planar Cuts Through Quadratic and Cubic Finite Elements.",
                    "LoD Volume Rendering of FEA Data.",
                    "Pixel-Exact Rendering of Spacetime Finite Element Solutions.",
                    "TetSplat Real-Time Rendering and Volume Clipping of Large Unstructured Tetrahedral Meshes.",
                    "Efficient Point-Based Isosurface Exploration Using the Span-Triangle.",
                    "Volume Refinement Fairing Isosurfaces.",
                    "Interactive Point-Based Isosurface Extraction.",
                    "Detection and Visualization of Anomalous Structures in Molecular Dynamics Simulation Data.",
                    "PQuad: Visualization of Predicted Peptides and Proteins.",
                    "Guaranteed Quality Triangulation of Molecular Skin Surfaces.",
                    "Dual Marching Cubes.",
                    "Simplifying Flexible Isosurfaces Using Local Geometric Measures.",
                    "Dual Contouring with Topology-Preserving Simplification Using Enhanced Cell Representation.",
                    "STEPS - An Application for Simulation of Transsphenoidal Endonasal Pituitary Surgery.",
                    "Interactive Thickness Visualization of Articular Cartilage.",
                    "ImageSurfer: A Tool for Visualizing Correlations between Two Volume Scalar Fields.",
                    "Interactive Design of Multi-Perspective Images for Visualizing Urban Landscapes.",
                    "Real-Time Motion Estimation and Visualization on Graphics Cards.",
                    "Dispersion Simulation and Visualization For Urban Security.",
                    "Panel 1: Can We Determine the Top Unresolved Problems of Visualization?",
                    "Panel 2: In the Eye of the Beholder: The Role of Perception in Scientific Visualization.",
                    "Panel 3: The Future Visualization Platform.",
                    "Panel 4: What Should We Teach in a Scientific Visualization Class?",
                    "VisBiz: A Simplified Visualization of Business Operation.",
                    "2D Maps for Visual Analysis and Retrieval in Large Multi-Feature 3D Model Databases.",
                    "Visual Inspection Methods for Quality Control in Automotive Engineering.",
                    "Hierarchy Based 3D Visualization of Large Software Structures.",
                    "Linking Representation with Meaning.",
                    "Introducing Topological Attributes for Objective-Based Visualization.",
                    "Building an Ontology of Visualization.",
                    "Context-Adaptive Mobile Visualization and Information Management.",
                    "DaMI - Data Management for Multimedial Information Systems.",
                    "Code Checking and Visualization of an Architecture Design.",
                    "Depth Enhanced Panoramas.",
                    "Live Range Visibility Constraints for Adaptive Terrain Visualization.",
                    "Visualizing Botanical Trees over Four Seasons.",
                    "Modeling Decomposing Objects under Combustion.",
                    "Visualizing the Energetics of the Dissociation of a Metastable Molecule.",
                    "Visualizing the Evolution of Horned Lizards Using 3D Morphing Techniques.",
                    "On the Visualization of Time-Varying Structured Grids Using a 3D Warp Texture.",
                    "Interactive Poster: Grid-Enabled Collaborative Scientific Visualization Environment.",
                    "Vol-a-Tile - A Tool for Interactive Exploration of Large Volumetric Data on Scalable Tiled Displays.",
                    "Visualization of Vortices in Simulated Airflow around Bat Wings During Flight.",
                    "Visualization of Topological Defects in Nematic Liquid Crystals Using Streamtubes, Streamsurfaces and Ellipsoids.",
                    "Visualizing Turbulent Flow.",
                    "Visualization of Nanoparticle Formation in Turbulent Flows.",
                    "Interactive Poster: Illustrating Different Convection Velocities of Turbulent Flow.",
                    "Vector Wavelet Thresholding for Vector Field Denoising.",
                    "Fast Rendering of Foveated Volume in the Wavelet Domain.",
                    "Atlas-Aware Laplacian Smoothing.",
                    "DTI Fiber Clustering in the Whole Brain.",
                    "Visualization of the Interaction of Multiple Sclerosis Lesions with Adjacent White Matter Fibers Using Streamtubes and Streamsurfaces.",
                    "Capillary Histology Imagery Visualization and Exploration.",
                    "Compression, Segmentation, and Modeling of Large-Scale Filamentary Volumetric Data.",
                    "Force-Feedback-Enhanced Navigation for Interactive Visualization of Coronary Vessels.",
                    "Automatic Fast Detection of Tumor Suspect Areas on CT Scan.",
                    "Real-Time Volume Rendering of Four Channel Data Sets.",
                    "JointViewer - An Interactive System for Exploring Orthopedic Data."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2004",
                "sub_name": "10th IEEE Symposium on Information Visualization (InfoVis 2004), 10-12 October 2004, Austin, TX, USA.",
                "count": 63,
                "papers": [
                    "Keynote Address: From Information Visualization to Sensemaking: Connecting the Mind's Eye to the Mind's Muscle.",
                    "Capstone Address: Visualization as a Medium for Capturing and Sharing Thoughts.",
                    "An Evaluation of Microarray Visualization Tools for Biological Insight.",
                    "User Experiments with Tree Visualization Systems.",
                    "A Comparison of the Readability of Graphs Using Node-Link and Matrix-Based Representations.",
                    "GeoTime Information Visualization.",
                    "RecMap: Rectangular Map Approximations.",
                    "EZEL: a Visual Tool for Performance Assessment of Peer-to-Peer File-Sharing Network.",
                    "A History Mechanism for Visual Data Mining.",
                    "Steerable, Progressive Multidimensional Scaling.",
                    "A Rank-by-Feature Framework for Unsupervised Multidimensional Data Exploration Using Low Dimensional Projections.",
                    "Value and Relation Display for Interactive Exploration of High Dimensional Datasets.",
                    "Uncovering Clusters in Crowded Parallel Coordinates Visualizations.",
                    "Clutter Reduction in Multi-Dimensional Data Visualization Using Dimension Reordering.",
                    "Time-Varying Data Visualization Using Information Flocking Boids.",
                    "Artifacts of the Presence Era: Using Information Visualization to Create an Evocative Souvenir.",
                    "Paint Inspired Color Mixing and Compositing for Visualization.",
                    "Expand-Ahead: A Space-Filling Strategy for Browsing Trees.",
                    "Evaluating a System for Interactive Exploration of Large, Hierarchically Structured Document Repositories.",
                    "Metric-Based Network Exploration and Multiscale Scatterplot.",
                    "BEST PAPER: A Knowledge Task-Based Framework for Design and Evaluation of Information Visualizations.",
                    "Rethinking Visualization: A High-Level Taxonomy.",
                    "Building Highly-Coordinated Visualizations in Improvise.",
                    "The InfoVis Toolkit.",
                    "Topological Fisheye Views for Visualizing Large Graphs.",
                    "Matrix Zoom: A Visual Interface to Semi-External Graphs.",
                    "Dynamic Drawing of Clustered Graphs.",
                    "Interactive Visualization of Small World Graphs.",
                    "Non-Euclidean Spring Embedders.",
                    "TextPool: Visualizing Live Text Streams.",
                    "BinX: Dynamic Exploration of Time Series Datasets Across Aggregation Levels.",
                    "PhylloTrees: Harnessing Nature's Phyllotactic Patterns for Tree Layout.",
                    "Hypothesis Visualization.",
                    "An Experimental Investigation of Magnification Lens Offset and Its Impact on Imagery Analysis.",
                    "Visualizing E-mail with a Semantically Zoomable Interface.",
                    "Interactive Exploration of the AFS File System.",
                    "ARNA: Interactive Comparison and Alignment of RNA Secondary Structure.",
                    "Tracking User Interactions Within Visualizations.",
                    "Interactive Poster: Visual Mining of Business Process Data.",
                    "Interactive Visualization Approaches to the Analysis of System Identification Data.",
                    "Visual Browsing of Remote and Distributed Data.",
                    "Resource Systems Reference Database.",
                    "faMailiar & Intimacy-Based Email Visualization.",
                    "Visualizing and Interacting with Multi-Tree Hierarchical Data.",
                    "EventScope: Bringing Remote Experience of Mars to the Public through Telepresence.",
                    "Histographs: Interactive Clustering of Stacked Graphs.",
                    "RankSpiral: Toward Enhancing Search Results Visualizations.",
                    "Creating and Managing \"Lookmarks\" in ParaView.",
                    "Visualizing High Dimensional Datasets Using Partiview.",
                    "Distortion-Based Visualization for Long-Term Continuous Acoustic Monitoring.",
                    "VIM: A Framework for Intelligence Analysis.",
                    "Major Information Visualization Authors, Papers and Topics in the ACM Library.",
                    "IN-SPIRE InfoVis 2004 Contest Entry.",
                    "Understanding Eight Years of InfoVis Conferences Using PaperLens.",
                    "WilmaScope Graph Visualisation.",
                    "Case Study: Visualizing Visualization.",
                    "Exploring and Visualizing the History of InfoVis.",
                    "InfoVisExplorer.",
                    "An Associative Information Visualizer.",
                    "MonkEllipse: Visualizing the History of Information Visualization.",
                    "Exploring InfoVis Publication History with Tulip.",
                    "Information Visualization Research: Citation and Co-Citation Highlights.",
                    "One-For-All: Visualization of the Information Visualization Symposia."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14th Vis / 9th InfoVis 2003",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2003",
                "sub_name": "14th IEEE Visualization Conference, IEEE Vis 2003, Seattle, WA, USA, October 19-24, 2003, Proceedings.",
                "count": 80,
                "papers": [
                    "The Visualization Market: Open Source vs. Commercial Approaches.",
                    "Exploring Curved Anatomic Structures with Surface Sections.",
                    "Psychophysical Scaling of a Cardiovascular Information Display.",
                    "Advanced Curved Planar Reformation: Flattening of Vascular Structures.",
                    "Counting Cases in Marching Cubes: Toward a Generic Algorithm for Producing Substitopes.",
                    "MC*: Star Functions for Marching Cubes.",
                    "Extraction of topologically simple isosurfaces from volume datasets.",
                    "Interactive Deformation and Visualization of Level Set Surfaces Using Graphics Hardware.",
                    "Signed Distance Transform Using Graphics Hardware.",
                    "Piecewise C1 Continuous Surface Reconstruction of Noisy Point Cloud via Local Implicit Quadric Regression.",
                    "Feature-Sensitive Subdivision and Isosurface Reconstruction.",
                    "A Texture-Based Framework for Spacetime-Coherent Visualization of Time-Dependent Vector Fields.",
                    "Effectively Visualizing Multi-Valued Flow Data Using Color and Texture.",
                    "Image Based Flow Visualization for Curved Surfaces.",
                    "Image Space Based Visualization of Unsteady Flow on Surfaces.",
                    "A Multi-Resolution Data Structure for 2-Dimensional Morse Functions.",
                    "Planet-Sized Batched Dynamic Adaptive Meshes (P-BDAM).",
                    "Real-Time Refinement and Simplification of Adaptive Triangular Meshes.",
                    "Interactive View-Dependent Rendering with Conservative Occlusion Culling in Complex Environments.",
                    "Fast Volume Segmentation With Simultaneous Visualization Using Programmable Graphics Hardware.",
                    "Hybrid Segmentation and Exploration of the Human Lungs.",
                    "Feature Space Analysis of Unstructured Meshes.",
                    "Clifford Convolution And Pattern Matching On Vector Fields.",
                    "Space Efficient Fast Isosurface Extraction for Large Datasets.",
                    "Volume Tracking Using Higher Dimensional Isocontouring.",
                    "Out-of-Core Isosurface Extraction of Time-Varying Irregular Grids.",
                    "Saddle Connectors - An Approach to Visualizing the Topological Skeleton of Complex 3D Vector Fields.",
                    "3D IBFV: Hardware-Accelerated 3D Flow Visualization.",
                    "Chameleon: An interactive texture-based rendering framework for visualizing three-dimensional vector fields.",
                    "HyperLIC.",
                    "Quasi-Static Approximation for 6 Degrees-of-Freedom Haptic Rendering.",
                    "A Constraint-Based Technique for Haptic Volume Exploration.",
                    "Voxels on Fire.",
                    "Visually Accurate Multi-Field Weather Visualization.",
                    "Acceleration Techniques for GPU-based Volume Rendering.",
                    "Compression Domain Volume Rendering.",
                    "High-Quality Two-Level Volume Rendering of Segmented Data Sets on Consumer Graphics Hardware.",
                    "Hardware-Based Nonlinear Filtering and Segmentation using High-Level Shading Languages.",
                    "Empty Space Skipping and Occlusion Clipping for Texture-based Volume Rendering.",
                    "Hierarchical Clustering for Unstructured Volumetric Scalar Fields.",
                    "Hardware-Based Ray Casting for Tetrahedral Meshes.",
                    "Visibility Culling Using Plenoptic Opacity Functions for Large Data Visualization.",
                    "Conveying Shape and Features with Image-Based Relighting.",
                    "Vicinity Shading for Enhanced Perception of Volumetric Data.",
                    "LightKit: A lighting system for effective visualization.",
                    "Mental Registration of 2D and 3D Visualizations (An Empirical Study).",
                    "Visualization of Noisy and Biased Volume Data Using First and Second Order Derivative Techniques.",
                    "Fairing scalar fields by variational modeling of contours.",
                    "Visualization of Volume Data with Quadratic Super Splines.",
                    "Using Deformations for Browsing Volumetric Data.",
                    "Video Visualization.",
                    "High Dimensional Direct Rendering of Time-Varying Volumetric Data.",
                    "A Frequency-Sensitive Point Hierarchy for Images and Volumes.",
                    "Hierarchical Splatting of Scattered Data.",
                    "A Framework for Sample-based Rendering with O-buffers.",
                    "Monte Carlo Volume Rendering.",
                    "Visibility based methods and assessment for detail-recovery.",
                    "Large Mesh Simplification using Processing Sequences.",
                    "Appearance-Preserving View-Dependent Visualization.",
                    "Shape Simplification Based on the Medial Axis Transform.",
                    "Adaptive Design of a Global Opacity Transfer Function for Direct Volume Rendering of Ultrasound Data.",
                    "Gaussian Transfer Functions for Multi-Field Volume Visualization.",
                    "A Novel Interface for Higher-Dimensional Classification of Volume Data.",
                    "Curvature-Based Transfer Functions for Direct Volume Rendering: Methods and Applications.",
                    "A Visual Exploration Process for the Analysis of Internet Routing Data.",
                    "Visualization, Optimization, and Business Strategy: A Case Study.",
                    "Interactive 3D Visualization Of Rigid Body Systems.",
                    "Visualizing Industrial CT Volume Data for Nondestructive Testing Applications.",
                    "Visualization of Steep Breaking Waves and Thin Spray Sheets around a Ship.",
                    "Accelerating Large Data Analysis by Exploiting Regularities.",
                    "Visualizing Spatial and Temporal Variability in Coastal Observatories.",
                    "Producing High Quality Visualizations of Large-Scale Simulations.",
                    "Interactive Protein Manipulation.",
                    "Holographic Video Display of Time-Series Volumetric Medical Data.",
                    "Heart-Muscle Fiber Reconstruction from Diffusion Tensor MRI.",
                    "Which Comes First, Utility or Usability?",
                    "Interoperability of Visualization Software and Data Models is NOT an Achievable Goal.",
                    "Information and Scientific Visualization: Separate but Equal or Happy Together at Last.",
                    "Do I Really See a Bone?",
                    "Visualization Experiences and Issues in Deep Space Exploration."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2003",
                "sub_name": "9th IEEE Symposium on Information Visualization (InfoVis 2003), 20-21 October 2003, Seattle, WA, USA.",
                "count": 32,
                "papers": [
                    "Thinking with Visualization.",
                    "Information Esthetics: from MoMA to Wall Street.",
                    "Smooth and efficient zooming and panning.",
                    "A Model of Multi-Scale Perceptual Organization in Information Graphics.",
                    "Exploring High-D Spaces with Multiform Matrices and Small Multiples.",
                    "Design Choices when Architecting Visualizations.",
                    "EdgeLens: An Interactive Method for Managing Edge Congestion in Graphs.",
                    "MoireGraphs: Radial Focus+Context Visualization and Interaction for Graphs with Visual Nodes.",
                    "Visualizing Evolving Networks: Minimum Spanning Trees versus Pathfinder Networks.",
                    "Multiscale Visualization of Small World Networks.",
                    "Improving Hybrid MDS with Pivot-Based Searching.",
                    "A Visual Workspace for Hybrid Multidimensional Scaling Algorithms.",
                    "Dynamic Visualization of Transient Data Streams.",
                    "Interactive Hierarchical Dimension Ordering, Spacing and Filtering for Exploration of High Dimensional Datasets.",
                    "Mapping Nominal Values to Numbers for Effective Visualization.",
                    "Visualization of Labeled Data Using Linear Transformations.",
                    "Intelligently Resolving Point Occlusion.",
                    "Constant Density Displays Using Diversity Sampling.",
                    "Empirical Comparison of Dynamic Query Sliders and Brushing Histograms.",
                    "An Experimental Evaluation of Continuous Semantic Zooming in Program Visualization.",
                    "Conveying Shape with Texture: an experimental investigation of the impact of texture type on shape categorization judgments.",
                    "Coordinated Graph and Scatter-Plot Views for the Visual Exploration of Microarray Time-Series Data.",
                    "Compound Brushing.",
                    "Causality Visualization Using Animated Growing Polygons.",
                    "Visualization of Large-Scale Customer Satisfaction Surveys Using a Parallel Coordinate Tree.",
                    "FundExplorer: Supporting the Diversification of Mutual Fund Portfolios Using Context Treemaps.",
                    "THREAD ARCS: An Email Thread Visualization.",
                    "BARD: A visualization tool for biological sequence analysis.",
                    "Using Multilevel Call Matrices in Large Software Projects.",
                    "Between Aesthetics and Utility: Designing Ambient Information Visualizations.",
                    "Developing Architectural Lighting Representations.",
                    "Exploding the Frame: Designing for Wall-Size Computer Displays."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13th Vis / 8th InfoVis 2002",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2002",
                "sub_name": "13th IEEE Visualization Conference, IEEE Vis 2002, Boston, MA, USA, October 27 - November 1, 2002, Proceedings.",
                "count": 78,
                "papers": [
                    "Integration of Measurement Tools in Medical 3d Visualizations.",
                    "Fast Visualization of Plane-Like Structures in Voxel Data.",
                    "Direct Surface Extraction from 3D Freehand Ultrasound Images.",
                    "CPR - Curved Planar Reformation.",
                    "Interactive Rendering of Large Volume Data Sets.",
                    "Semotus Visum: A Flexible Remote Visualization Framework.",
                    "Out-of-Core Rendering of Massive Geometric Datasets.",
                    "Optimized View-Dependent Rendering for Large Polygonal Datasets.",
                    "Volumetric Shadows Using Splatting.",
                    "Volume Clipping via Per-Fragment Operations in Texture-Based Volume Visualization.",
                    "Interactive Spectral Volume Rendering.",
                    "Interactive Translucent Volume Rendering and Procedural Modeling.",
                    "A Multiphase Approach to Efficient Surface Simplification.",
                    "Geometric Surface Smoothing via Anisotropic Diffusion of Normals.",
                    "TetFusion: An Algorithm For Rapid Tetrahedral Mesh Simplification.",
                    "Compressing Polygon Mesh Geometry with Parallelogram Prediction.",
                    "Probabilistic Surfaces: Point Based Primitives to Show Surface Uncertainty.",
                    "PMR: Point to Mesh Rendering, A Feature-Based Approach.",
                    "Efficient Simplification of Point-Sampled Surfaces.",
                    "Exploring Scalar Fields Using Critical Isovalues.",
                    "Level-Set Segmentation From Multiple Non-Uniform Volume Datasets.",
                    "Efficient Computation of the Topology of Level Set.",
                    "Fast and Reliable Space Leaping for Interactive Volume Rendering.",
                    "A New Object-Order Ray-Casting Algorithm.",
                    "Non-Photorealistic Volume Rendering Using Stippling Techniques.",
                    "Interactive Visualization of Complex Plant Ecosystems.",
                    "Simulating Fire with Texture Splats.",
                    "Visualizing Dynamic Molecular Conformations.",
                    "GeneVis: Visualization Tools for Genetic Regulatory Network Dynamics.",
                    "Isometric Embedding by Surface Reconstruction from Distances.",
                    "Fast View-Dependent Level-of-Detail Rendering Using Cached Geometry.",
                    "Visibility-Guided Simplification.",
                    "Maximum Entropy Light Source Placement.",
                    "Computing Singularities of 3D Vector Fields with Geometric Algebra .",
                    "Seamster: Inconspicuous Low-Distortion Texture Seam Layout.",
                    "Face-based Luminance Matching for Perceptual Colormap Generation.",
                    "Geometric Verification of Features in Flow Fields.",
                    "Comparative Evaluation of Visualization and Experimental Results Using Image Comparison Metrics.",
                    "A Model for the Visualization Exploration Process.",
                    "Sea of Images.",
                    "Scalable Alignment of Large-Format Multi-Projector Displays Using Camera Homography Trees.",
                    "Efficient Compression and Rendering of Multi-Resolution Meshes.",
                    "Bounded-distortion Piecewise Mesh Parameterization.",
                    "XFastMesh: Fast View-dependent Meshing from External Memory.",
                    "Tensor Field Visualisation using Adaptive Filtering of Noise Fields combined with Glyph Rendering.",
                    "Volume Deformation For Tensor Visualization.",
                    "Oriented Tensor Reconstruction: Tracing Neural Pathways from Diffusion Tensor MRI.",
                    "QuadTIN: Quadtree based Triangulated Irregular Networks.",
                    "Horizon Occlusion Culling for Real-time Rendering of Hierarchical Terrains.",
                    "Evaluation of a Multimodal Interface for 3D Terrain Visualization.",
                    "Assisted Navigation of Complex Information Spaces.",
                    "BM3D: Motion Estimation in Time Dependent Volume Data.",
                    "Kinetic Visualization - A Technique for Illustrating 3D Shape and Structure.",
                    "A Radial Focus+Context Visualization for Multi-Dimensional Functions.",
                    "BLIC: Bi-Level Isosurface Compression .",
                    "Approximating Normals for Marching Cubes applied to Locally Supported Isosurfaces.",
                    "Volume Warping for Adaptive Isosurface Extraction.",
                    "Interactive View-Dependent Rendering of Large IsoSurfaces.",
                    "Christmas Tree Case Study: Computed Tomography as a Tool for Mastering Complex Real World Objects with Applications in Computer Graphics.",
                    "Case Study: Hardware-Accelerated Selective LIC Volume Rendering.",
                    "Case Study: Visualization and Analysis of High Rayleigh Number - 3D Convection in the Earth's Mantle.",
                    "Immersive Volume Visualization of Seismic Simulations: A Case Study of Techniques Invented and Lessons Learned.",
                    "Case Study: A Look of Performance Expression.",
                    "Case Study: Interactive Visualization for Internet Security.",
                    "PRIMA: A Case Study of Using Information Visualization Techniques for Patient Record Analysis.",
                    "Case Study: A Virtual Environment for Genomic Data Visualization.",
                    "Case Study: Visual Debugging of Finite Element Codes.",
                    "Case Study: Interactive Rendering of Adaptive Mesh Refinement Data.",
                    "A Case Study in Selective Visualization of Unsteady 3D Flow.",
                    "Case Study: Visualizing Ocean Flow Vertical Motions using Lagrangian-Eulerian Time Surfaces.",
                    "A Case Study on Multiresolution Visualization of Local Rainfall from Weather Radar Measurements.",
                    "Rendering The First Star In The Universe - A Case Study.",
                    "NASA's Great Zooms: A Case Study.",
                    "A Case Study on Automatic Camera Placement and Motion for Visualizing Historical Data.",
                    "Case Study on the Adaptation of Interactive Visualization Applications to Web-Based Production for Operational Mesoscale Weather Models.",
                    "Exploring Surface Characteristics with Interactive Gaussian Images (A Case Study).",
                    "A Case Study On The Applications Of A Generic Library For Low-Cost Polychromatic Passive Stereo.",
                    "Case Study: \"The Office of Real Soon Now\" for Visualization."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2002",
                "sub_name": "2002 IEEE Symposium on Information Visualization (InfoVis 2002), 27 October - 1 November 2002, Boston, MA, USA.",
                "count": 25,
                "papers": [
                    "Internet Traffic: Visualization, Discovery, and Very Large Displays.",
                    "Multiscale Visualization Using Data Cubes \"InfoVis 2002 Best Paper\".",
                    "Visualization Schemas for Flexible Information Visualization.",
                    "Building a Visual Database for Example-based Graphics Generation.",
                    "Efficient Cartogram Generation: A Comparison.",
                    "Visualizing Data with Bounded Uncertainty.",
                    "Graphical Encoding for Information Visualization: An Empirical Study.",
                    "The Illusion of Perceived Metric 3D Structure.",
                    "SpaceTree: Supporting Exploration in Large Node Link Tree, Design Evolution and Empirical Evaluation.",
                    "Process Visualization with Levels of Detail.",
                    "Case Study: Visualizing Sets of Evolutionary Trees.",
                    "InterRing: An Interactive Tool for Visually Navigating and Manipulating Hierarchical Structures.",
                    "A Space-Optimized Tree Visualization.",
                    "Beamtrees: Compact Visualization of Large Hierarchies.",
                    "Visualizing Biosequence Data Using Texture Mapping.",
                    "Arc Diagrams: Visualizing Structure in Strings.",
                    "Interactive Information Visualization of a Million Items.",
                    "Angular Brushing of Extended Parallel Coordinates.",
                    "Multiple Foci Drill-Down through Tuple and Attribute Aggregation Polyarchies in Tabular Data.",
                    "ACE: A Fast Multiscale Eigenvectors Computation for Drawing Huge Graphs.",
                    "Visual Unrolling of Network Evolution and the Analysis of Dynamic Discourse.",
                    "A Hybrid Layout Algorithm for Sub-Quadratic Multidimensional Scaling.",
                    "Demystifying Venture Capital Investing.",
                    "Visual Path Analysis.",
                    "Display Design for the Eye and Mind."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "12th Vis / 7th InfoVis 2001",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2001",
                "sub_name": "12th IEEE Visualization Conference, IEEE Vis 2001, San Diego, CA, USA, October 24-26, 2001, Proceedings.",
                "count": 74,
                "papers": [
                    "Point Set Surfaces.",
                    "EWA Volume Splatting.",
                    "Hybrid Simplification: Combining Multi-Resolution Polygon and Point Rendering.",
                    "POP: A Hybrid Point and Polygon Rendering System for Large Data.",
                    "Lagrangian-Eulerian Advection for Unsteady Flow Visualization.",
                    "Transport and Anisotropic Diffusion in Time-Dependent Flow Visualization.",
                    "Enridged Contour Maps.",
                    "Visualization of Sports using Motion Trajectories: Providing Insights into Performance, Style, and Strategy.",
                    "PingTV: A Case Study in Visual Network Monitoring.",
                    "Case Study: Medical Web Service for the Automatic 3D Documentation for Neuroradiological Diagnosis.",
                    "Case Study: Visual Debugging Of Cluster Hardware.",
                    "Case Study on Real-Time Visualization of Virtual Tübingen on Commodity PC Hardware.",
                    "Undersampling and Oversampling in Sample Based Shape Modeling.",
                    "Optimal Regular Volume Sampling.",
                    "Simplicial Subdivisions and Sampling Artifacts.",
                    "A Simple Algorithm for Surface Denoising.",
                    "Attribute Preserving Dataset Simplification.",
                    "A Memory Insensitive Technique for Large Model Simplification.",
                    "Efficient Adaptive Simplification of Massive Meshes.",
                    "Connectivity Shapes.",
                    "An Immersive Virtual Environment for DT-MRI Volume Visualization Applications: A Case Study.",
                    "Chromatin Decondensation: A Case Study of Tracking Features in Confocal Dat.",
                    "Case Study: An Environment for Understanding Protein Simulations Using Game Graphics.",
                    "Surgical Simulator for Hysteroscopy: A Case Study of Visualization in Surgical Training.",
                    "Quantitative Comparative Evaluation of 2D Vector Field Visualization Methods.",
                    "A Tetrahedra-Based Stream Surface Algorithm.",
                    "Continuous Topology Simplification of Planar Vector Fields.",
                    "PixelFlex: A Reconfigurable Multi-Projector Display System.",
                    "Dynamic Shadow Removal from Front Projection Displays.",
                    "The \"Which Blair Project\": A Quick Visual Method for Evaluating Perceptual Color Maps.",
                    "Circular Incident Edge Lists: A Data Structure for Rendering Complex Unstructured Grids.",
                    "Hardware-Software-Balanced Resampling for the Interactive Visualization of Unstructured Grids.",
                    "The Perspective Shear-Warp Algorithm in a Virtual Environment.",
                    "Cell-Projection of Cyclic Meshes.",
                    "Fast Detection of Meaningful Isosurfaces for Volume Data Visualization.",
                    "Salient Iso-Surface Detection with Model-Independent Statistical Signatures.",
                    "Distance-Field-Based Skeletons for Virtual Navigation.",
                    "A Complete Distance Field Representation.",
                    "Case Study: Reconstruction, Visualization, and Quantification of Neuronal Fiber Pathways.",
                    "Visualizing 2D Probability Distributions from EOS Satellite Image-Derived Data Sets: A Case Study.",
                    "Case Study: Application of Feature Tracking to Analysis of Autoignition Simulation Data.",
                    "Case Study: Visualization of Particle Track Data.",
                    "Interactive Volume Rendering Using Multi-Dimensional Transfer Functions and Direct Manipulation Widgets.",
                    "Texture Hardware Assisted Rendering of Time-Varying Volume Data.",
                    "Accelerated Volume Ray-Casting using Texture Mapping.",
                    "RTVR - A Flexible Java Library for Interactive Volume Rendering.",
                    "Multiresolution Feature Extraction from Unstructured Meshes.",
                    "Fast Extraction of Adaptive Multiresolution Meshes with Guaranteed Properties from Volumetric Data.",
                    "Wavelet Representation of Contour Sets.",
                    "User-Centric Viewpoint Computations for Haptic Exploration and Manipulation.",
                    "Case Study: Interacting with Cortical Flat Maps of the Human Brain.",
                    "4D Space-Time Techniques: A Medical Imaging Case Study.",
                    "Computed Tomography Angiography: A Case Study of Peripheral Vessel Investigation.",
                    "Graphical Strategies to Convey Functional Relationships in the Human Brain: A Case Study.",
                    "Fitting Subdivision Surfaces.",
                    "Nonmanifold Subdivision.",
                    "Normal Bounds for Subdivision-Surface Interference Detection.",
                    "Smooth Approximation and Rendering of Large Scattered Data Sets.",
                    "Real-Time Decompression and Visualization of Animated Volume Data.",
                    "Compressing Large Polygonal Models.",
                    "Visualization of Large Terrains Made Easy.",
                    "Integrating Occlusion Culling with View-Dependent Rendering.",
                    "Approximate Shading for the Re-Illumination of Synthetic Images.",
                    "A Case Study on Interactive Exploration and Guidance Aids for Visualizing Historical Data.",
                    "The MetVR Case Study: Meteorological Visualization in an Immersive Virtual Environment.",
                    "Archaeological Data Visualization in VR: Analysis of Lamp Finds at the Great Temple of Petra, a Case Study.",
                    "Volume Rendering of Fine Details Within Medical Data.",
                    "Visualization and Interaction Techniques for the Exploration of Vascular Structures.",
                    "Variational Classification for Visualization of 3D Ultrasound Data.",
                    "Nonlinear Virtual Colon Unfolding.",
                    "Virtual Temporal Bone Dissection: A Case Study.",
                    "Semi-Immersive Space Mission Design and Visualization: Case Study of the Terrestrial Planet Finder Mission.",
                    "Wind Tunnel Data Fusion and Immersive Visualization: A Case Study.",
                    "A Virtual Environment for Simulated Rat Dissection: A Case Study of Visualization for Astronaut Training."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2001",
                "sub_name": "IEEE Symposium on Information Visualization 2001 (INFOVIS'01), San Diego, CA, USA, October 22-23, 2001.",
                "count": 24,
                "papers": [
                    "To Draw a Tree.",
                    "Visualizing Time-Series on Spirals.",
                    "Change Blindness in Information Visualization: A Case Study.",
                    "Cluster Stability and the Use of Noise in Interpretation of Clustering.",
                    "Technical Note: Visually Encoding Program Test Information to Find Faults in Software.",
                    "Getting Along: Composition of Visualization Paradigms.",
                    "Animated Exploration of Dynamic Graphs with Radial Layout.",
                    "Effective Graph Visualization via Node Grouping.",
                    "Visualization of State Transition Graphs.",
                    "Graph Sketches.",
                    "Ordered Treemap Layouts.",
                    "Collapsible Cylindrical Trees: A Fast Hierarchical Navigation Technique.",
                    "Botanical Visualization of Huge Hierarchies.",
                    "Semantic Depth of Field.",
                    "Interactive Visualization of Multiple Query Results.",
                    "Pixel Bar Charts: A New Technique for Visualizing Large Multi-Attribute Data Sets without Aggregation.",
                    "An Empirical Comparison of Three Commercial Information Visualization Systems.",
                    "A Comparison of 2-D Visualizations of Hierarchies.",
                    "2D vs 3D, Implications on Spatial Memory.",
                    "Case Study: Visualization for Decision Tree Analysis in Data Mining.",
                    "Case Study: E-Commerce Clickstream Visualization.",
                    "Case Study: Design and Assessment of an Enhanced Geographic Information System for Exploration of Multivariate Health Statistics.",
                    "Graphic Data Display for Cardiovascular System.",
                    "Battlespace Visualization: A Grand Challenge."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "11th Vis / 6th InfoVis 2000",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/2000",
                "sub_name": "11th IEEE Visualization Conference, IEEE Vis 2000, Salt Lake City, UT, USA, October 8-13, 2000, Proceedings.",
                "count": 76,
                "papers": [
                    "Extracting regions of interest applying a local watershed transformation.",
                    "A visibility determination algorithm for interactive virtual endoscopy.",
                    "3D digital cleansing using segmentation rays.",
                    "CEASAR: a smooth, accurate and robust centerline extraction algorithm.",
                    "Creating reusable visualizations with the relational visualization notation.",
                    "H-BLOB: a hierarchical visual clustering method using implicit surfaces.",
                    "A spreadsheet interface for visualization exploration.",
                    "Procedural annotation of uncertain information.",
                    "Simplification of Tetrahedral meshes with accurate error evaluation.",
                    "Tetrahedron based, least squares, progressive volume models with application to freehand ultrasound data.",
                    "On-the-Fly rendering of losslessly compressed irregular volume data.",
                    "Hardware-accelerated volume and isosurface rendering based on cell-projection.",
                    "Achieving color uniformity across multi-projector displays.",
                    "Automatic alignment of high-resolution multi-projector display using an un-calibrated camera.",
                    "Shock and vortex visualization using a combined visual/Haptic interface.",
                    "Six degree-of-freedom haptic display of polygonal models.",
                    "A level-set method for flow visualization.",
                    "Hardware-accelerated texture advection for unsteady flow visualization.",
                    "A flow-guided streamline seeding strategy.",
                    "Enabling level-of-detail matching for exterior scene synthesis.",
                    "Visual cues for imminent object contact in realistic virtual environment.",
                    "Basic research for coloring multichannel MRI data.",
                    "Volume illustration: non-photorealistic rendering of volume models.",
                    "Pen-and-Ink rendering in volume visualisation.",
                    "Two-level volume rendering - fusing MIP and DVR.",
                    "FastSplats: optimized splatting on rectilinear grids.",
                    "Texturing techniques for terrain visualization.",
                    "Simplification of surface annotations.",
                    "Uniform frequency images: adding geometry to images to produce space-efficient textures.",
                    "Image based rendering with stable frame rates.",
                    "Topology preserving and controlled topology simplifying multiresolution isosurface extraction.",
                    "Isosurfacing in higher dimensions.",
                    "Semi-regular mesh extraction from volumes.",
                    "Scanline surfacing: building separating surfaces from planar contours.",
                    "Navigating high-dimensional spaces to support design steering.",
                    "Visualization of multi-dimensional data with vector-fusion.",
                    "Real-world relativity: image-based special relativistic visualization.",
                    "Visualizing geodesics.",
                    "Geometric compression for interactive transmission.",
                    "Toward a compelling sensation of telepresence: demonstrating a portal to a distant (static) office.",
                    "Multi-user view-dependent rendering.",
                    "Topology preserving compression of 2D vector fields.",
                    "A continuous clustering method for vector fields.",
                    "A topology simplification method for 2D vector fields.",
                    "Constructing material interfaces from data sets with volume-fraction information.",
                    "New techniques for topologically correct surface reconstruction.",
                    "Polyhedral modeling.",
                    "Bicubic subdivision-surface wavelets for large-scale isosurface representation and visualization.",
                    "Anisotropic geometric diffusion in surface processing.",
                    "Fairing of non-manifolds for visualization.",
                    "Interior/exterior classification of polygonal models.",
                    "Multi-resolution dynamic meshes with arbitrary deformations.",
                    "Fast visualization methods for comparing dynamics: a case study in combustion.",
                    "Mastering interactive surface rendering for Java-based diagnostic applications.",
                    "A computational steering system for studying microwave interactions with missile bodies.",
                    "Four-dimensional non-linear ray tracing as a visualization tool for gravitational physics.",
                    "Combining local and remote visualization techniques for interactive volume rendering in medical applications.",
                    "An integrated visualization and design toolkit for flexible prosthetic heart valves.",
                    "Immersive virtual reality for visualizing flow through an artery.",
                    "Mastering interactive virtual Bronchioscopy on a Low-end PC.",
                    "Interactive visualization of protein dynamics.",
                    "Interactive visualization of particle-in-cell simulations.",
                    "Visualization of time dependent confocal microscopy data.",
                    "Visual data fusion for applications of high-resolution numerical weather prediction.",
                    "Case study: a methodology for plume visualization with application to real-time acquisition and navigation.",
                    "Vector fields simplification - a case study of visualizing climate modeling and simulation data sets.",
                    "WEAVE: a system for visually linking 3-D and statistical visualizations, applied to cardiac simulation and measurement data.",
                    "Visualizing high-dimensional predicitive model quality.",
                    "Visualizing volume data using physical models.",
                    "Visualizing DIII-D Tokamak magnetic field lines.",
                    "Real-time visualization of the clear-up of a former U.S. Naval base.",
                    "Scientific visualization of water quality in the Chesapeake Bay.",
                    "Multi-resolution visualization techniques for nested weather models.",
                    "The impact of computer games on scientific & information visualization: \"if you can't beat them, join them\" (panel session).",
                    "The transfer function bake-off (panel session).",
                    "Next-generation visualization displays: the research challenges of building tiled displays (panel session)."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/2000",
                "sub_name": "IEEE Symposium on Information Visualization 2000 (INFOVIS'00), Salt Lake City, Utah, USA, October 9-10, 2000.",
                "count": 21,
                "papers": [
                    "Presentation, Visualization, What's Next?",
                    "Polaris: A System for Query, Analysis and Visualization of Multi-Dimensional Relational Databases.",
                    "Getting Portals to Behave.",
                    "A Scalable Framework for Information Visualization.",
                    "Visualizing Massive Multi-Digraphs.",
                    "Density Functions for Visual Attributes and Effective Partitioning in Graph Visualization.",
                    "Focus+Context Display and Navigation Techniques for Enhancing Radial, Space-Filling Hierarchy Visualizations.",
                    "A Taxonomy of Visualization Techniques Using the Data State Reference Model.",
                    "GADGET/IV: A Taxonomic Approach to Semi-Automatic Design of Information Visualization Applications Using Modular Visualization Environment.",
                    "Redefining the Focus and Context of Focus+Context Visualizations.",
                    "From Metaphor to Method: Cartographic Perspectives on Information Visualization.",
                    "Information Content Measures of Visual Displays.",
                    "Visualizing Sequential Patterns for Text Mining.",
                    "ThemeRiver: Visualizing Theme Changes over Time.",
                    "Lighthouse: Showing the Way to Relevant Information.",
                    "New Methods for the Visualization of Electric Power System Information.",
                    "Collaborative Geographic Visualization: Enabling Shared Understanding of Environmental Processes.",
                    "Interactive Problem Solving via Algorithm Visualization.",
                    "Metaphor-Aware 3D Navigation.",
                    "Creativity, Complexity, and Precision: Information Visualization for (Landscape) Architecture.",
                    "Using Visualization to Detect Plagiarism in Computer Science Classes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "10th Vis / 5th InfoVis 1999",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1999",
                "sub_name": "10th IEEE Visualization Conference, IEEE Vis 1999, San Francisco, CA, USA, October 24-29, 1999, Proceedings.",
                "count": 74,
                "papers": [
                    "Keynote Address: Data and Visualization Corridors.",
                    "Capstone Address: ActiveSpaces - The Access Grid, Active Mural and Advanced Visualization Systems.",
                    "Construction of Vector Field Hierarchies.",
                    "Large Field Visualization with Demand-Driven Calculation.",
                    "Simplified Representation of Vector Fields.",
                    "Hierarchical Parallel Coordinates for Exploration of Large Datasets.",
                    "Tetrahedral Mesh Compression with the Cut-Border Machine.",
                    "New Quadric Metric for Simplifying Meshes with Appearance Attributes.",
                    "Progressive Compression of Arbitrary Triangular Meshes.",
                    "Efficient Compression of Non-Manifold Polygonal Meshes.",
                    "Image Graphs - A Novel Approach to Visual Data Exploration.",
                    "Forward Image Mapping.",
                    "Structured Spatial Domain Image and Data Comparison Metrics.",
                    "Feature Comparisons of 3-D Vector Fields Using Earth Mover's Distance.",
                    "Rendering on a Budget: A Framework for Time-Critical Rendering.",
                    "Time-Critical Multiresolution Scene Rendering.",
                    "Skip Strips: Maintaining Triangle Strips for View-Dependent Rendering.",
                    "Isosurface Extraction Techniques for Web-Based Volume Visualization.",
                    "Isosurface Extraction in Time-varying Fields Using a Temporal Branch-on-Ned Tree (T-BON).",
                    "Interactive Lens Visualization Techniques.",
                    "Multi-Projector Displays Using Camera-Based Registration.",
                    "Exploring Geo-Scientific Data in Virtual Environments.",
                    "Animating Wrinkles on Clothes.",
                    "Hue-Balls and Lit-Tensors for Direct Volume Rendering of Diffusion Tensor Fields.",
                    "Mixing Translucent Polygons with Volumes.",
                    "Multi-Resolution Multi-Field Ray Tracing: A Mathematical Overview.",
                    "Enabling Calssification and Shading for 3D Texture Mapping Based Volume Rendering Using OpenGL and Extensions.",
                    "A Distributed Graphics System for Large Tiled Displays.",
                    "A Multi-Threaded Streaming Pipeline Architecture for Large Structured Data Sets.",
                    "Interacitve Exploration of Volume Line Integral Convolution Based on 3D-Texture Mapping.",
                    "A Framework for Assisted Exploration with Collaboration.",
                    "Tensorlines: Advection-Diffusion Based Propagation through Diffusion Tensor Fields.",
                    "Visualizing Planar Vector Fields with Normal Component Using Line Integral Convolution.",
                    "The \"Parallel Vectors\" Operator - A Vector Field Visualization Primitive.",
                    "C1-Interpolation for Vector Field Topology Visualization.",
                    "Optimal Triangular Haar Bases for Spherical Data.",
                    "Cracking the Cracking Problem with Coons Patches.",
                    "LOD-Sprite Technique for Accelerated Terrain Rendering.",
                    "Implant Sprays: Compression of Progressive Tetrahedral Mesh Connectivity.",
                    "Progressive Compression and Transmission of Arbitrary Triangular Meshes.",
                    "Spiraling Edge: Fast Surface Reconstruction from Partially Organized Sample Points.",
                    "Anisotropic Nonlinear Diffusion in Flow Visualization.",
                    "Visualizing Multivalued Data from 2D Incompressible Flows Using Concepts from Painting.",
                    "PLIC: Briding the Gap Between Streamlines and LIC.",
                    "Collapsing Flow Topology Using Area Metrics.",
                    "Multiresolution Techniques for Interactive Texture-Based Volume Visualization.",
                    "Splatting Without the Blur.",
                    "A Fast Volume Rendering Algorithm for Time-Varying Fields Using a Time-Space Partitioning (TSP) Tree.",
                    "High Performance Presence-Accelerated Ray Casting.",
                    "Interacitve Exploration of Extra- and Interacranial Blood Vessels.",
                    "Digital Design of a Surgical Simulator for Interventional Magnetic Resonance Imaging.",
                    "Volume Rendering Based Interactive Navigation within the Human Colon.",
                    "A Computer Animation Representing the Molecular Events of G Protein-Coupled Receptor Activation.",
                    "Visualizing Gridded Datasets with Large Number of Missing Values.",
                    "Detecting Vortical Phenomena in Vector Data by Medium-Scale Correlation.",
                    "Interacitve Visualization of Fluid Dynamics Simulations in Locally Refined Cartesian Grids.",
                    "Visual Debugging of Visualization Software: A Case Study for Particle Systems.",
                    "DELTA's Virtual Physics Laboratory: A Comprehensive Learning Platform on Physics & Astronomy.",
                    "VizCraft: A Multidimensional Visualization Tool for Aircraft Configuration Design.",
                    "Design and Implementation of an Immersive Geoscience Toolkit.",
                    "Visualization of Conflicts and Resolutions in a \"Free Flight\" Scenario.",
                    "Real-Time Visualization of Scalably Large Collections of Heterogeneous Objects.",
                    "Geo Spatial Visualization for Situational Awareness.",
                    "\"Whole Field Modelling\" - Effective Real-Time and Post-Survey Visualization of Underwater Pipelines.",
                    "Visualizing the Evolution of a Subject Domain: A Case Study.",
                    "An Interactive Framework for Visualizing Foreign Currency Exchange Options.",
                    "Visualizing Large-Scale Telecommunication Networks and Services.",
                    "Detecting Null Alleles with Vasarely Charts.",
                    "Automating Transfer Function Design for Comprehensible Volume Rendering Based on 3D Field Topology Analysis.",
                    "Accelerating 3D Convolution Using Graphics Hardware.",
                    "Visualizing Simulated Room Fires.",
                    "Why the PC Will Be the Most Pervasive Visualization Platform in 2001.",
                    "Visualization Needs More Visual Design!",
                    "Automation or Interaction: What's Best for Big Data?"
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/1999",
                "sub_name": "IEEE Symposium on Information Visualization 1999 (INFOVIS'99), San Francisco, California, USA, October 24-29, 1999.",
                "count": 19,
                "papers": [
                    "Cluster and Calendar Based Visualization of Time Series Data.",
                    "Visualizing Application Behavior on Superscalar Processors.",
                    "Sensemaking of Evolving Web Sites Using Visualization Spreadsheets.",
                    "Does Animation Help Users Build Mental Maps of Spatial Information?",
                    "Evaluating a Visualization of Image Similarity as a Tool for Image Browsing.",
                    "Domain Analysis: A Technique to Design a User-Centered Visualization Framework.",
                    "A Framework for Focus+Context Visualization.",
                    "Navigating Hierarchies with Structure-Based Brushes.",
                    "Dynamic Hierarchy Specification and Visualization.",
                    "Cushion Treemaps: Visualization of Hierarchical Information.",
                    "3D Interactive Visualization for Inter-Cell Dependencies of Spreadsheets.",
                    "Efficient Multi-Object Dynamic Query Histograms.",
                    "Aggregate Towers: Scale Sensitive Visualization and Decluttering of Geospatial Data.",
                    "VisageWeb: Visualizing WWW Data in Visage.",
                    "The Automated Multidimensional Detective.",
                    "Visualizing Association Rules for Text Mining.",
                    "A Java-Based Visual Mining Infrastructure and Applications.",
                    "The Sunflower Visual Metaphor, a New Paradigm for Dimensional Compression.",
                    "Constellation: A Visualization Tool for Linguistic Queries from MindNet."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "9th Vis / 4th InfoVis 1998",
        "info": "Research Triangle Park, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1998",
                "sub_name": "9th IEEE Visualization Conference, IEEE Vis 1998, Research Triangle Park, North Carolina, USA, October 18-23, 1998, Proceedings.",
                "count": 78,
                "papers": [
                    "Modern Trompe l'oeil - Keynote.",
                    "Draw on the wall - Capstone Address.",
                    "Large scale terrain visualization using the restricted quadtree triangulation.",
                    "Contour interpolation and surface reconstruction of smooth terrain models.",
                    "Smooth view-dependent level-of-detail control and its application to terrain rendering.",
                    "Efficient implementation of multi-triangulations.",
                    "Visualization of scalar topology for structural enhancement.",
                    "A general method for preserving attribute values on simplified meshes.",
                    "Surface reconstruction with anisotropic density-scaled alpha shapes.",
                    "Level of detail visualization of scalar data sets on irregular surface meshes.",
                    "Tracking scalar features in unstructured datasets.",
                    "Feature detection in linked derived spaces.",
                    "Extremal feature extraction from 3-D vector and noisy scalar fields.",
                    "Feature comparisons of vector fields using earth mover's distance.",
                    "Building perceptual textures to visualize multidimensional datasets.",
                    "Efficient co-triangulation of large data sets.",
                    "Visualizing diffusion tensor images of the mouse spinal cord.",
                    "Image-guided streamline placement on curvilinear grid surfaces.",
                    "A higher-order method for finding vortex core lines.",
                    "Automatic detection of open and closed separation and attachment lines.",
                    "Isosurface extraction in time-varying fields using a temporal hierarchical index tree.",
                    "Interactive out-of-core isosurface extraction.",
                    "View dependent isosurface extraction.",
                    "The Gridfit algorithm: an efficient and effective approach to visualizing large amounts of spatial data.",
                    "TOPIC ISLANDS - a wavelet-based text visualization system.",
                    "Continuous cartogram construction.",
                    "A concept for virtual reality tools for design reviews.",
                    "Efficient warping for architectural walkthroughs using layered depth images.",
                    "Visualizing differences in movies of cortical activity.",
                    "A distributed blackboard architecture for interactive data visualization.",
                    "Interactive ray tracing for isosurface rendering.",
                    "Eliminating popping artifacts in sheet buffer-based splatting.",
                    "Accelerated ray-casting for curvilinear volumes.",
                    "High quality rendering of attributed volume data.",
                    "Simplifying surfaces with color and texture using quadric error metrics.",
                    "A unified approach for simplifying polygonal and spline models.",
                    "Fast and memory efficient polygonal simplification.",
                    "Simplification of tetrahedral meshes.",
                    "Interactive deformations from tensor fields.",
                    "Real-time techniques for 3D flow visualization.",
                    "Wavelets over curvilinear grids.",
                    "Image-based transfer function design for data exploration in volume visualization.",
                    "Image-based rendering with occlusions via cubist images.",
                    "Hierarchical volume analysis and visualization based on morphological operators.",
                    "Interactive display of very large textures.",
                    "Pixel masks for screen-door transparency.",
                    "Comparing LIC and spot noise.",
                    "Size preserving pattern mapping.",
                    "Constrained optimal framings of curves and surfaces using quaternion Gauss maps.",
                    "Converting sets of polygons to manifold surfaces by cutting and stitching.",
                    "Interpolation of triangle hierarchies.",
                    "Progressive tetrahedralizations.",
                    "Task-specific visualization design: a case study in operational weather forecasting.",
                    "Development of a multi-source visualization prototype.",
                    "Data level comparison of wind tunnel and computational fluid dynamics data.",
                    "Selective visualization of vortices in hydrodynamic flows.",
                    "Visual presentation of magnetic resonance images.",
                    "Visualization in corneal topography.",
                    "A case study using the virtual environment for reconstructive surgery.",
                    "Interactive virtual angioscopy.",
                    "Volumetric modeling of acoustic fields in CNMAT's sound spatialization theatre.",
                    "Supporting detail-in-context for the DNA representation, H-curves.",
                    "Visualizing Hilbert curves.",
                    "Rear-projecting virtual data onto physical terrain: an exercise in two senses being better than one.",
                    "Intent, perception, and out-of-core visualization applied to terrain.",
                    "Production visualization for the ASCI one TeraFLOPS machine.",
                    "Battlefield visualization on the responsive workbench.",
                    "Scientific visualization and data modeling of scattered sediment contaminant data in New York/New Jersey estuaries.",
                    "POPTEX: interactive ocean model visualization using texture mapping hardware.",
                    "Acoustic imaging and visualization of plumes discharging from black smoker vents on the deep seafloor.",
                    "Seabed visualization.",
                    "Configuration space visualization for mechanical design.",
                    "Three-dimensional visualization of microstructures.",
                    "Visualization for multiparameter aircraft designs.",
                    "Why is real-time volume rendering no longer a year away?",
                    "Multi-source data analysis challenges.",
                    "Key problems and thorny issues in multidimensional visualization.",
                    "Art and visualization: oil and water?"
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/1998",
                "sub_name": "1998 IEEE Symposium on Information Visualization (InfoVis '98), 19-20 October 1998, Research Triangle Park, NC, USA, Proceedings.",
                "count": 18,
                "papers": [
                    "WebPath - A Three-Dimensional Web History.",
                    "Traversal-Based Visualization of Data Structures.",
                    "Reconfigurable Disc Trees for Visualizing Large Hierarchical Information Space.",
                    "An Interactive View for Hierarchical Clustering.",
                    "Dynamic Aggregation with Circular Visual Designs.",
                    "The Generalized Detail-In-Context Problem.",
                    "Similarity Clustering of Dimensions for an Enhanced Visualization of Multidimensional Data.",
                    "An Operator Interaction Framework for Visualization Systems.",
                    "Algorithm Visualization For Distributed Environments.",
                    "IVORY - An Object-Oriented Framework for Physics-Based Information Visualization in Java.",
                    "Geographic Visualization: Designing Manipulable Maps for Exploring Temporally Varying Georeferenced Statistics.",
                    "Saying It in Graphics: From Intentions to Visualizations.",
                    "Visualizing Decision Table Classifiers.",
                    "Comparative Visualization of Protein Structure-Sequence Alignments.",
                    "LensBar - Visualization for Browsing and Filtering Large Lists of Data.",
                    "The Shape of Shakespeare: Visualizing Text using Implicit Surfaces.",
                    "BiblioMapper: A Cluster-Based Information Visualization Technique.",
                    "Multi-Faceted Insight Through Interoperable Visual Information Analysis Paradigms."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "8th Vis / 3rd InfoVis 1997",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1997",
                "sub_name": "8th IEEE Visualization Conference, IEEE Vis 1997, Phoenix, AZ, USA, October 19-24, 1997, Proceedings.",
                "count": 77,
                "papers": [
                    "Global tele-immersion.",
                    "Dissolving Descartes: perception and the construction of reality (address).",
                    "A comparison of normal estimation schemes.",
                    "Collision detection for volumetric objects.",
                    "The VSBUFFER: visibility ordering of unstructured volume primitives by polygon drawing.",
                    "Volume rendering of abdominal aortic aneurysms.",
                    "Auralization of streamline vorticity in computational fluid dynamics data.",
                    "Singularities in nonuniform tensor fields.",
                    "Visualization of higher order singularities in vector fields.",
                    "Principal stream surfaces.",
                    "ROAMing terrain: real-time optimally adapting meshes.",
                    "Visualization of height field data with physical models and texture photomapping.",
                    "Visualization of large terrains in resource-limited computing environments.",
                    "Building and traversing a surface at variable resolution.",
                    "Multivariate visualization using metric scaling.",
                    "Visualizing the behavior of higher dimensional dynamical systems.",
                    "Displaying data in multidimensional relevance space with 2D visualization maps.",
                    "Multiresolution tetrahedral framework for visualizing regular volume data.",
                    "Haar wavelets over triangular domains with applications to multiresolution models for flow over a sphere.",
                    "Wavelet-based multiresolutional representation of computational field simulation datasets.",
                    "Dynamic color mapping of bivariate qualitative data.",
                    "The contour spectrum.",
                    "Constrained 3D navigation with 2D controllers.",
                    "Two-phase perspective ray casting for interactive volume navigation.",
                    "Accelerated volume rendering using homogeneous region encoding.",
                    "An anti-aliasing technique for splatting.",
                    "A topology modifying progressive decimation algorithm.",
                    "Efficient subdivision of finite-element datasets into consistent tetrahedra.",
                    "Interval volume tetrahedrization.",
                    "Computing the separating surface for segmented data.",
                    "Application-controlled demand paging for out-of-core visualization.",
                    "GADGET: goal-oriented application design guidance for modular visualization environments.",
                    "Collaborative visualization.",
                    "VizWiz: a Java applet for interactive 3D scientific visualization on the web.",
                    "Image synthesis from a sparse set of views.",
                    "Virtualized reality: constructing time-varying virtual worlds from real world events.",
                    "Extracting feature lines from 3D unstructured grids.",
                    "I/O optimal isosurface extraction (extended abstract).",
                    "CAVEvis: distributed real-time visualization of time-varying scalar and vector fields using the CAVE virtual reality theater.",
                    "Fast oriented line integral convolution for vector field visualization via the Internet.",
                    "UFLIC: a line integral convolution algorithm for visualizing unsteady flows.",
                    "The motion map: efficient computation of steady flow animations.",
                    "Integrated volume compression and visualization.",
                    "Multiresolution compression and reconstruction.",
                    "Optimized geometry compression for real-time rendering.",
                    "Architectural walkthroughs using portal textures.",
                    "Repairing CAD models.",
                    "Dynamic smooth subdivision surfaces for data visualization.",
                    "Smooth hierarchical surface triangulations.",
                    "The multilevel finite element method for adaptive mesh optimization and visualization of volume data.",
                    "Simplifying polygonal models using successive mappings.",
                    "Controlled simplification of genus for polygonal models.",
                    "Vortex identification - applications in aerodynamics: a case study.",
                    "exVis: developing a wind tunnel data visualization tool.",
                    "Strategies for effectively visualizing 3D flow with volume LIC.",
                    "Towards efficient visualization support for single-block and multi-block datasets.",
                    "Brushing techniques for exploring volume datasets.",
                    "Interactive volume rendering for virtual colonoscopy.",
                    "DNA visual and analytic data mining.",
                    "An interactive cerebral blood vessel exploration system.",
                    "Instructional software for visualizing optical phenomena.",
                    "Wildfire visualization (case study).",
                    "Visualization of geometric algorithms in an electronic classroom.",
                    "Collaborative augmented reality: exploring dynamical systems.",
                    "Visualizing customer segmentations produce by self organizing maps (case study).",
                    "Pearls found on the way to the ideal interface for scanned-probe microscopes.",
                    "Viewing IGES files through VRML.",
                    "Visualization of plant growth.",
                    "Determination of unknown particle charges in a thunder cloud based upon detected electric field vectors.",
                    "Interactive visualization of aircraft and power generation engines.",
                    "Efficient visualization of physical and structural properties in crash-worthiness simulations (case study).",
                    "Visualization of rotation fields.",
                    "Isosurface extraction using particle systems.",
                    "A visualization of music.",
                    "Terascale visualization: approaches, pitfalls and issues (panel).",
                    "Information exploration shootout project and benchmark data sets: evaluating how visualization does in analyzing real-world data analysis problems (panel).",
                    "Perceptual measures for effective visualizations."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/1997",
                "sub_name": "1997 IEEE Symposium on Information Visualization (InfoVis '97), October 18-25, 1997, Phoenix, AZ, USA.",
                "count": 16,
                "papers": [
                    "H3: laying out large directed graphs in 3D hyperbolic space.",
                    "Visualizing Information on a Sphere.",
                    "A spreadsheet approach to information visualization.",
                    "Adaptive information visualization based on the user's multiple viewpoints-interactive 3D visualization of the WWW.",
                    "Managing Software with New Visual Representations.",
                    "On Integrating Visualization Techniques for Effective Software Exploration.",
                    "Cacti: a front end for program visualization.",
                    "Nonlinear Magnification Fields.",
                    "Managing multiple focal levels in Table Lens.",
                    "Coordinating declarative queries with a direct manipulation data exploration environment.",
                    "Domesticating Bead: adapting an information visualization system to a financial institution.",
                    "Design and Evaluation of Incremental Data Structures and Algorithms for Dynamic Query Interfaces.",
                    "Research Report: Volume Rendering for Relational Data.",
                    "The structure of the information visualization design space.",
                    "Multidimensional detective.",
                    "Metrics for effective information visualization."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "7th Vis / 2nd InfoVis 1996",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1996",
                "sub_name": "7th IEEE Visualization Conference, IEEE Vis 1996, San Francisco, CA, USA, October 27 - November 1, 1996, Proceedings.",
                "count": 72,
                "papers": [
                    "Keynote Address: Bringing Visualization to the User (Abstract).",
                    "Capstone Address: Color, Pattern, and the Human Visual System (Abstract).",
                    "Anatomy-Based Facial Tissue Modeling Using the Finite Element Method.",
                    "A Fast Gibbs Sampler for Synthesizing Constrained Fractals.",
                    "Temporal Continuity of Levels of Detail in Delaunay Triangualted Terrain.",
                    "BLaC-Wavelets: A Multiresolution Analysis With Non-Nested Spaces.",
                    "Fast Stereo Volume Rendering.",
                    "Hierarchical and Parallelizable Direct Volume Rendering for Irregular and Multiple Grids.",
                    "Fast Perspective Volume Rendering with Splatting by Utilizing a Ray-Driven Approach.",
                    "Deformable Volume Rendering by 3D Texture Mapping and Octree Encoding.",
                    "Visualization Over the World Wide Web and its Application to Environmental Data.",
                    "Cheops: A Compact Explorer for Complex Hierarchies.",
                    "The Design and Implementation of an Object-Oriented Toolkit for 3D Graphics and Visualization.",
                    "Visualization of Complex Models Using Dynamic Texture-based Simplification.",
                    "Interactive Visualiztion of 3D-Vector Fields using Illuminated Streamlines.",
                    "Raycasting Vector Fields.",
                    "Multi-Frequency Noise for LIC.",
                    "A Linear Iteration Time Layout Algorithm for Visualising High-Dimensional Data.",
                    "Flexible Information Visualization of Multivariate Data from Biological Sequence Similarity Searches.",
                    "Multiresolution Multidimensional Wavelet Brushing.",
                    "History Consideration in Reconstructuring Polythedral Surfaces from Parallel Slices.",
                    "Volume Tracking.",
                    "Contour Blending Using Warp-Guided Distance Field Interpolation.",
                    "Complex-Valued Contour Meshing.",
                    "Perceptualisation using a Tactile Mouse.",
                    "LISTEN: Sounding Uncertainty Visualization.",
                    "A Haptic Interaction Method for Volume Visualization.",
                    "Two-handed Interactive Stereoscopic Visualization.",
                    "Illustrating Transparent Surfaces with Curvature-Directed Strokes.",
                    "Opacity-modulating Triangular Textures for Irregular Surfaces.",
                    "Generation of Transfer Functions with Stochastic Search Techniques.",
                    "Real-Time Incremental Visualization of Dynamic Ultrasound Volumes Using Parallel BSP Trees.",
                    "FEL: The Field Encapsulation Library.",
                    "UFLOW: Visualizing Uncertainty in Fluid Flow.",
                    "Time Management, Simultaneity and Time-Critical Computation in Interactive Unsteady Visualization Environments.",
                    "Choosing Effective Colours for Data Visualization.",
                    "Real-time Slicing of Data Space.",
                    "Untangling Knots by Stochastic Energy Optimization.",
                    "Isosurfacing in Span Space with Utmost Efficiency (ISSUE).",
                    "Triangular NURBS Surface Modeling of Scattered Data.",
                    "Volume Thinning for Automatic Isosurface Propagation.",
                    "Mesh Reduction with Error Control.",
                    "Optimizing Triangle Strips for Fast Rendering.",
                    "Dynamic View-Dependent Simplification for Polygonal Models.",
                    "Octree-Based Decimation of Marching Cubes Surfaces.",
                    "Virtual Workbench - A Non-Immersive Virtual Environment for Visualizing and Interacting with 3D Objects for Scientific Visualization.",
                    "A System for the Complementary Visualization of 3D Volume Images Using 2D and 3D Binaurally Processed Sonification Representations.",
                    "Visualization of Roughness in Musical Consonance.",
                    "Using Visualization in the Archaeological Excavations of Pre-Inca Temple in Peru.",
                    "Three Dimensional Visualization of Proteins in Cellular Interactions.",
                    "Clinical Evaluation of Interactive Volume Visualization.",
                    "Electrical Energy Absorption in the Human Head from a Cellular Telephone.",
                    "Visualization of Laser Confocal Microscopy Datasets.",
                    "Flow Visualization for Turbomachinery Design.",
                    "Wavelets Applied to Lossless Compression and Progressive Transmission of Floating Point Data in 3-D Curvilinear Grids.",
                    "Directional Flow Visualization of Vector Fields.",
                    "Data Level Comparative Visualization in Aircraft Design.",
                    "A System for Measuring Surface Facet Orientation from Atomic Force Microscope Data.",
                    "A Visualization Tool for Mechanical Design.",
                    "A 3D Contextual Shading Method for Visualization of Diecasting Defects.",
                    "Mantle Convection Visualization on the Cray T3D.",
                    "The Challenges of Visualizing and Modeling Environmental Data.",
                    "Visualization of Water Quality Data for the Chesapeake Bay.",
                    "Data Reduction and Interpolation for Visualizing 3D Soil-Quality Data.",
                    "Case Study: Visual Access for Landscape Event Based Temporal Data.",
                    "Interactive Visulization of Ocean Circulation Models.",
                    "Interactive Exploration and Modeling of Large Data Sets: A Case Study with Venus Light Scattering Data.",
                    "Surface Rendering versus Volume Rendering in Medical Imaging.",
                    "Breaking the Myth: a Picture is NOT (always) Worth a 1, 000 Words.",
                    "Real-Time Accelerators for Volume Rendering.",
                    "Information Exploration Shootout.",
                    "Mathematical Visualization: Standing at the Crossroads."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/1996",
                "sub_name": "Proceedings of the IEEE Symposium on Information Visualization 1996, InfoVis '96, San Francisco, CA, USA, October 28-29, 1996.",
                "count": 19,
                "papers": [
                    "Visage: a user interface environment for exploring information.",
                    "Data characterization for automatically visualizing heterogeneous information.",
                    "Rapid prototyping of information visualizations using VANISH.",
                    "On the semantics of interactive visualizations.",
                    "Techniques for non-linear magnification transformations.",
                    "Distortion viewing techniques for 3-dimensional data.",
                    "Selection: 524, 288 ways to say \"this is interesting\".",
                    "Towards rich information landscapes for visualising structured Web spaces.",
                    "Visualizing the results of multimedia Web search engines.",
                    "Minimally-immersive interactive volumetric information visualization.",
                    "Interactive visualization of multiway tables.",
                    "FINESSE: a financial information spreadsheet.",
                    "Animating multidimensional scaling to visualize N-dimensional data sets.",
                    "Dual multiresolution HyperSlice for multivariate data visualization.",
                    "Geospatial metadata querying and visualization on the WWW using JavaTM applets.",
                    "Visualizing the global topology of the MBone.",
                    "Visualizing usability log data.",
                    "DEPICT: Documents Evaluated as Pictures. Visualizing information using context vectors and self-organizing maps.",
                    "Visualizing a tennis match."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "6th Vis / 1st InfoVis 1995",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1995",
                "sub_name": "6th IEEE Visualization Conference, IEEE Vis 1995, Atlanta, GA, USA, October 29 - November 3, 1995, Proceedings.",
                "count": 56,
                "papers": [
                    "Interval Set: A Volume Rendering Technique Generalizing Isosurface Extraction.",
                    "Interactive Maximum Projection Volume Rendering.",
                    "Interactive Realism for Visualization Using Ray Tracing.",
                    "A Hardware Acceleration Method for Volumetric Ray Tracing.",
                    "Defining, Computing, and Visualizing Molecular Interfaces.",
                    "Visualization of Biological Sequence Similarity Search Results.",
                    "Enhancing Transparent Skin Surfaces with Ridge and Valley Lines.",
                    "Splatting of Curvilinear Volumes.",
                    "On Enhancing the Speed of Splatting with Indexing.",
                    "IFS Fractal Interpolation for 2D and 3D Visualization.",
                    "Automated Generation of Visual Simulation Databases Using Remote Sensing and GIS.",
                    "Virtual GIS: A Real-Time 3D Geographic Information System.",
                    "An Architecture for Retaining and Analyzing Visual Explorations of Databases.",
                    "An Illustrated Analysis of Sonification for Scientific Visualisation.",
                    "A Rule-Based Tool for Assisting Colormap Selection.",
                    "Space Walking.",
                    "Fast Multiresolution Surface Meshing.",
                    "Sweeping Simplices: A Fast Iso-Surface Extraction Algorithm for Unstructured Grids.",
                    "Interval Volume: A Solid Fitting Technique for Volumetric Data Display and Analysis.",
                    "Fast Normal Estimation Using Surface Characteristics.",
                    "Compression Domain Rendering of Time-Resolved Volume Data.",
                    "High-Speed Volume Rendering Using Redundant Block Compression.",
                    "Authenticity Analysis of Wavelet Approximations in Visualization.",
                    "Direct Rendering of Laplacian Pyramid Compressed Volume Data.",
                    "Automatic Generation of Triangular Irregular Networks Using Greedy Cuts.",
                    "Legibility Enhancement for Information Visualisation.",
                    "Subverting Structure: Data-Driven Diagram Generation.",
                    "A Model and a System for Data-Parallel Program Visualization.",
                    "Enhanced Spot Noise for Vector Field Visualization.",
                    "Interactive Visualization of Mixed Scalar and Vector Fields.",
                    "Vector Plots for Irregular Grids.",
                    "Tensor Product Surfaces Guided by Minimal Surface Area Triangulations.",
                    "An Extended Data-Flow Architecture for Data Analysis and Visualization.",
                    "High Dimensional Brushing for Interactive Exploration of Multivariate Data.",
                    "Recursive Pattern: A Technique for Visualizing Very Large Amounts of Data.",
                    "Iconic Techniques for Feature Visualization.",
                    "Voxel Based Object Simplification.",
                    "3D Computational Steering with Parametrized Geometric Objects.",
                    "Fast Algorithms for Visualizing Fluid Motion in Steady Flow on Unstructured Grids.",
                    "Optimization of Time-Dependent Particle Tracing Using Tetrahedral Decomposition.",
                    "Unsteady Flow Volumes.",
                    "Propositional n-traces: Visualizing a Problem in Philosophic Logic.",
                    "Qualitative Analysis of Invariant Tori in a Dynamical System.",
                    "Pictorial Statistics - Visualization of High Dimensional Statistical Distributions.",
                    "Visualization for Aerodynamic Design of Helicopter Rotor Blades.",
                    "Visualization of High Speed Aerodynamic Configuration Design.",
                    "Volume-Based Reasoning and Visualization of Diecastability.",
                    "A Visualization Tool for Studying the Development of the Moss Physcomitrella patens.",
                    "Marching Through the Visible Man.",
                    "Astronomers and their Shady Algorithms.",
                    "Flow Visualization in a Hypersonic Fin/Ramp Flow.",
                    "An Integrated Approach for Steering, Visualization, and Analysis of Atmospheric Simulations.",
                    "Turbulent Flow Visualization in Computational and Experimental Hydraulics.",
                    "Interactive 3D Visualization of Actual Anatomy and Simulated Chemical Time-Course Data for Fish.",
                    "Visualizing the Tracking and Diving Behavior of Marine Mammals.",
                    "Using Spatial Access Methods to Support the Visualization of Environmental Data."
                ]
            },
            {
                "sub_name_abbr": "conf/infovis/1995",
                "sub_name": "IEEE Symposium On Information Visualization 1995, InfoVis 1995, 30-31 October 1995, Atlanta, Georgia, USA.",
                "count": 19,
                "papers": [
                    "Keynote Address: Information Visualization: Wings for the Mind.",
                    "Visualization for functional design.",
                    "Towards a generative theory of diagram design.",
                    "Research report: information animation applications in the capital markets.",
                    "Research report: improving browsing in information by the automatic display layout.",
                    "SDM: malleable information graphics.",
                    "The information mural: a technique for displaying and navigating large information spaces.",
                    "Visualizing the non-visual: spatial analysis and interaction with information from text documents.",
                    "VRMosaic: WEB access from within a virtual environment.",
                    "IVEE: an Information Visualization and Exploration Environment.",
                    "Research report: Interacting with huge hierarchies: beyond cone trees.",
                    "Research report: DataSpace: 3-D visualizations of large databases.",
                    "Case study: Narcissus: visualising information.",
                    "Case study: Visualising cyberspace: information visualisation in the Harmony Internet browser.",
                    "Case study: fishing for information on the Internet.",
                    "Case study: A WWW viewpoint on scientific visualization: an EPA case study for technology transfer.",
                    "Case study: an empirical investigation of thumbnail image recognition.",
                    "Case study: visualizing Internet resources.",
                    "Case study: 3D displays of Internet traffic."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "5th Vis 1994",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1994",
                "sub_name": "5th IEEE Visualization Conference, IEEE Vis 1994, Washington, DC, USA, October 17-21, 1994, Proceedings.",
                "count": 65,
                "papers": [
                    "Interactive Visualization via 3D User Interfaces.",
                    "Visualization in the Information Highway.",
                    "Information Workspaces for Large Scale Cognition.",
                    "A Visualization System on Every Desk - Keeping it Simple.",
                    "The Future of Graphic User Interfaces.",
                    "The Crucial Difference Between Human and Machine Vision: Focal Attention.",
                    "Integrated Control of Distributed Volume Visualization Through the World-Wide-Web.",
                    "A distributed, parallel, interactive volume rendering package.",
                    "VolVis: A Diversified Volume Visualization System.",
                    "Implicit Modeling of Swept Surfaces and Volumes.",
                    "Visualizing Polycrystalline Orientation Microstructures with Spherical Color Maps.",
                    "Introducing Alpha Shapes for the Analysis of Path Integral Monte Carlo Results.",
                    "Piecewise-Linear Surface Approximation From Noisy Scattered Samples.",
                    "Triangulation and Display of Rational Parametric Surfaces.",
                    "Isosurface Generation by Using Extrema Graphs.",
                    "Wavelet-Based Volume Morphing.",
                    "Progressive Transmission of Scientific Data Using Biorthogonal Wavelet Transform.",
                    "An Evaluation of Reconstruction Filters for Volume Rendering.",
                    "Visualizing Flow with Quaternion Frames.",
                    "Feature Detection from Vector Quantities in a Numerically Simulated Hypersonic Flow Field in Combination with Experimental Flow Visualization.",
                    "3D Visualization of Unsteady 2D Airplane Wake Vortices.",
                    "Vortex Tubes in Turbulent Flows: Identification, Representation, Reconstruction.",
                    "The Topology of Symmetric, Second-Order Tensor Fields.",
                    "GASP - A System for Visualizing Geometric Algorithms.",
                    "Virtual Reality Performance for Virtual Geometry.",
                    "A Library for Visualizing Combinatorial Structures.",
                    "Strata-Various: Multi-Layer Visualization of Dynamics in Software System Behavior.",
                    "Differential Volume Rendering: A Fast Volume Visualization Technique for Flow Animation.",
                    "Fast Surface Rendering from Raster Data by Voxel Traversal Using Chessboard Distance.",
                    "Parallel Performance Measures for Volume Ray Casting.",
                    "Spiders: A New User Interface for Rotation and Visualization of N-dimensional Point Sets.",
                    "Restorer: A Visualization Technique for Handling Missing Data.",
                    "User Modeling for Adaptive Visualization Systems.",
                    "Streamball Techniques for Flow Visualization.",
                    "Volume Rendering Methods for Computational Fluid Dynamics Visualization.",
                    "Visualizing Flow Over Curvilinear Grid Surfaces Using Line Integral Convolution.",
                    "Visualizing 3D Velocity Fields Near Contour Surfaces.",
                    "UFAT - A Particle Tracer for Time-Dependent Flow Fields.",
                    "The Design and Implementation of the Cortex Visualization System.",
                    "An Annotation System for 3D Fluid Flow Visualization.",
                    "Discretized Marching Cubes.",
                    "Approximation of Isosurface in the Marching Cube: Ambiguity Problem.",
                    "Nonpolygonal Isosurface Rendering for Large Volume Datasets.",
                    "Mix&Match: A Construction Kit for Visualization.",
                    "A Lattice Model for Data Display.",
                    "An Object Oriented Design for the Visualization of Multi-Variable Data Objects.",
                    "XmdvTool: Integrating Multiple Methods for Visualizing Multivariate Data.",
                    "Case Study: Tokamak Plasma Turbulence Visualization.",
                    "Case Study: Visualization and Data Analysis in Space and Atmospheric Science.",
                    "A Case Study on Visualization for Boundary Value Problems.",
                    "Case Study: Severe Rainfall Events in Northwestern Peru (Visualization of Scattered Meteorological Data).",
                    "Case Study: Visualization of Mesoscale Flow Features in Ocean Basins.",
                    "Case Study: Integrating Spatial Data Display with Virtual Reconstruction.",
                    "Case Study: Observing a Volume Rendered Fetus within a Pregnant Patient.",
                    "Case Study: Visualization of 3D Ultrasonic Data.",
                    "Case Study: New Techniques in the Design of Healthcare Facilities.",
                    "Case Study: Visualization of an Electric Power Transmission System.",
                    "Case Study: Volume Rendering of Pool Fire Data.",
                    "Case Study: Visualization of Volcanic Ash Clouds.",
                    "Challenges and Opportunities in Visualization for NASA's EOS Mission to Planet Earth - Panel.",
                    "Visualization in Medicine: VIRTUAL Reality or ACTUAL Reality? (Panel).",
                    "Visualization and Geographic Information System Integration: What are the needs and the requirements, if any? (Panel).",
                    "Visualizing multidimensional (multivariate) data and relations (Panel).",
                    "Visualizing Data: Is Virtual Reality the Key? (Panel).",
                    "Validation, verification and evaluation (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th Vis 1993",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1993",
                "sub_name": "4th IEEE Visualization Conference, IEEE Vis 1993, San Jose, CA, USA, October 25-29, 1993, Proceedings.",
                "count": 55,
                "papers": [
                    "Fast Volume Rendering of Compressed Data.",
                    "Flow Volumes for Interactive Vector Field Visualization.",
                    "The Vision Camera: An Interactive Tool for Volume Data Exploration and Navigation.",
                    "Visualization of Time-Dependent Flow Fields.",
                    "A Probe for Local Flow Field Visualization.",
                    "Visualization of Turbulent Flow with Particles.",
                    "Optimal Filter Design for Volume Reconstruction and Visualization.",
                    "Accelerating Volume Animation by Space-Leaping.",
                    "Rapid Exploration of Curvilinear Grids Using Direct Volume Rendering.",
                    "Volume Sampled Voxelization of Geometric Primitives.",
                    "Tioga: A Database-Oriented Visualization Tool.",
                    "Bridging the Gap Between Visualization and Data Management: A Simple Visualization Management System.",
                    "GRASPARC: A Problem Solving Environment Integrating Computation and Visualization.",
                    "An Environment for Telecollaborative Data Exploration.",
                    "HyperSlice - Visualization of Scalar Functions of Many Variables.",
                    "Fine-Grain Visualization Algorithms in Dataflow Environments.",
                    "Developing Modular Applications Builders to Exploit MIMD Parallel Resources.",
                    "Virtual Input Devices for 3D Systems.",
                    "InfoCrystal: A Visual Tool for Information Retrieval.",
                    "Visual Feedback in Querying Large Databases.",
                    "DIVIDE: Distributed Visual Display of the Execution of Asynchronous, Distributed Algorithms on Loosely-Coupled Parallel Processors.",
                    "Performance Visualization of Parallel Programs.",
                    "Orientation Maps: Techniques for Visualizing Rotations.",
                    "Geometric Optimization.",
                    "Interactive Visualization Methods for Four Dimensions.",
                    "Navigating Large Networks with Hierarchies.",
                    "Dichromatic Color Representations for Complex Display Systems.",
                    "Towards a Texture Naming System: Identifying Relevant Dimensions in Texture.",
                    "Applying Observations of Work Activity in Designing Prototype Data Analysis Tools.",
                    "An Architecute for Rule-Based Visualization.",
                    "Implicit Stream Surfaces.",
                    "Cloud Tracing in Conection-Diffusion Systems.",
                    "Texture Splats for 3D Scalar and Field Visualization.",
                    "Geometric Clipping Using Boolean Textures.",
                    "Data Shaders.",
                    "Spray Rendering: Visualization Using Smart Particles.",
                    "Interactive Shading for Surface and Volume Visualization on Graphics Workstations.",
                    "Fast Analytical Computation of Richard's Smooth Molecular Surface.",
                    "Computer Visualization of Long Genomic Sequences.",
                    "Visualization of Acoustic Lens Data.",
                    "MRIVIEW: An Interactive Computational Tool for Investigation of Brain Structure and Function.",
                    "Visualization and Modeling of Geophysical Data.",
                    "Visualization of Oil Reservoirs Ovew a Large Range of Scales as a Catalyst for Multi-Disciplinary Integration.",
                    "Unsteady Phenomena, Hypersonic Flows and Co-Operative Flow Visualization.",
                    "Towards Interactive Steering, Visualization and Animation of Unsteady Finite Element Simulations.",
                    "The Quantum Coulomb Three Body Problem - Visualization of Simulation Results and Numerical Methods.",
                    "Fanel: A Relational Analysis and Visualization Package for High Energy Physics.",
                    "Non Conventional Methods for the Visualization of Events from High Energy Physics.",
                    "Visualization of Stratospheric Ozone Depletion and the Polar Vortex.",
                    "A Climate Simulation Case Study.",
                    "Feature Extraction for Oceanographic Data Using a 3D Edge Operator.",
                    "Visualizing Results of Transient Flow Simulations.",
                    "Enhancing Reality in the Operating Room.",
                    "3D Simulation of Delivery.",
                    "The Virtual Restoration of the Visir Tomb."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3rd Vis 1992",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1992",
                "sub_name": "3rd IEEE Visualization Conference, IEEE Vis 1992, Boston, MA, USA, October 19-23, 1992, Proceedings.",
                "count": 53,
                "papers": [
                    "Towards a Comprehensive Volume Visualization System.",
                    "Approximation and Rendering of Volume Data Using Wavelet Transforms.",
                    "Interactive Visualization of Large Scalar Voxel Fields.",
                    "Interactive Splatting of Nonrectilinear Volumes.",
                    "Virtual Smoke: An Interactive 3-D Flow Visualization Technique.",
                    "Rendering Surface Particles.",
                    "A 3-D Streamline Tracking Algorithm Using Dual Stream Functions.",
                    "Generalized Focal Surfaces: A New Method for Surface Interrogation.",
                    "Massively Parallel Isosurface Extraction.",
                    "Four-Dimensional Views of 3-D Scalar Fields.",
                    "Volume Rendering on a Distributed Memory Parallel Computer.",
                    "Direct Volumetric Visualization.",
                    "An Architecture for a Scientific Visualization System.",
                    "Anatomical Atlases Based on Volume Visualization.",
                    "Improving the Visualization of Hierarchies with Treemaps: Design Issues and Experimentation.",
                    "An Efficient Range Search Algorithm for Visualizing Extrema of Volume Data.",
                    "Display of Scientific Data Structures for Algorithm Visualization.",
                    "Representing Medical Images with Partitioning Trees.",
                    "Visualization of Simulated Airflow in a Clean Room.",
                    "Flow Visualization as a Basic Tool to Investigate the Dynamics and Topology of Jets.",
                    "Constructing Stream Surfaces in Steady 3-D Vector Fields.",
                    "Visualizing Wind Velocities by Advecting Cloud Textures.",
                    "Logical Time in Visualizations Produced by Parallel Programs.",
                    "Visual Query Specification in a Multimedia Database System.",
                    "The State of the Art of Visual Languages for Visualization.",
                    "Visualizing Code Profiling Line Oriented Statistics.",
                    "VISAGE: An Object-Oriented Scientific Visualization System.",
                    "A Scientific Visualization Renderer.",
                    "A Characterization of the Scientific Data Analysis Process.",
                    "SuperGlue: A Programming Environment for Scientific Visualization.",
                    "Color, Change and Control for Quantitative Data Display.",
                    "Surface Curvature Analysis Using Color.",
                    "Visualization of Fuzzy Data Using Generalized Animation.",
                    "Visualization for the Document Space.",
                    "Automated Design of Virtual Worlds for Visualizing Multivariate Relations.",
                    "Virtual Spacetime: An Environment for the Visualization of Curved Spacetimes via Geodesic Flows.",
                    "Network Video Device Control.",
                    "Volume Warping.",
                    "Visualization of Second-Order Tensor Fields and Matrix Data.",
                    "Visualization of High-Resolution, 3-D, Nonlinear, Finite Element Analyses.",
                    "Optimizing Triangulation by Curvature Equalization.",
                    "A Voxel-Based, Forward-Projection Algorithm for Rendering Surface and Volumetric Data.",
                    "Interactive Terrain Rendering van Volume Visualization on the Princeton Engine.",
                    "Visualizing n-Dimensional Implications of 2-D Design Decisions.",
                    "Visualizing the Universe.",
                    "Visualization of Neutron Scattering Data Using AVS.",
                    "Visualization in Anthropology: Reconstruction of Human Fossils.",
                    "Visualization of Cardiac Bioelectricty - A Case Study.",
                    "The Microscopist's Workstation.",
                    "Visualizing Seafloor Structures with Satellite Gravity Measurements.",
                    "Visualization Requirements in the Atmospheric and Environmental Sciences (Five Case Study Reports).",
                    "Visualizing Classical Problems in CFD.",
                    "Visualizing a 3-D Hydrodynamic Model."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd Vis 1991",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1991",
                "sub_name": "2nd IEEE Visualization Conference, IEEE Vis 1991, San Diego, CA, USA, October 22-25, 1991, Proceedings.",
                "count": 50,
                "papers": [
                    "Visualizing Causal Effects in 4D Space-Time Vector Fields.",
                    "The Virtual Windtunnel: An Environment for the Exploration of Three-Dimensional Unsteady Flows.",
                    "Volume Rendering of Flow-Visualization Point Data.",
                    "A Tool for Visualizing the Topology of Three-Dimensional Vector Fields.",
                    "Two Widely Different Architectural Approaches to Computer Image Generation.",
                    "Fast Rotation of Volume Data on Data Parallel Architectures.",
                    "Achieving Direct Volume Visualization with Interactive Semantic Region Selection.",
                    "Span Filering: An Optimization Scheme for Volume Visualization of Large Finite Element Methods.",
                    "Visualization of Equations in an Interactive Environment.",
                    "The Asymptotic Decider: Resolving the Ambiguity in Marching Cubes.",
                    "Acoustic Imaging: The Reconstruction of Underwater Objects.",
                    "Computer Assisted Sphere Packing in Higher Dimensions.",
                    "The Electronic Structure of Oxygen in Silicon as Revealed by Volume Visualization of Ab Initio Calculations.",
                    "Golf Green Visualization.",
                    "The Stream Polygon: A Technique for 3D Vector Field Visualization.",
                    "The Hyperbox.",
                    "Gray Scale Diagrams as Business Charts.",
                    "Shadowed Hedgehogs: A Technique for Visualizing 2D Slices of 3D Vector Fields.",
                    "Interactive Data Visualization Using Focusing and Linking.",
                    "Color Icons: Merging Color and Texture Perception for Integrated Visualization of Multiple Parameters.",
                    "Visualization and Analysis of Multivariate Data: A Technique for all Fields.",
                    "The Visual Comparison of Three Sequences.",
                    "Enhanced Visualization of Multi-dimensional Structures: Applications in Positron Emission Tomography and Cimate Data.",
                    "Topographical Mapping of Brain Electrical Activity.",
                    "In Vivo Blood Flow Visualization with Magnetic Resonance Imaging.",
                    "Visualizing 4-D Medical Ultrasound Data.",
                    "Multi-Valued Volumetric Visualization.",
                    "Realistic Volumetric Imaging.",
                    "A Fast Ray Casting Algorithm Using Adaptive Isotriangular Subdivision.",
                    "NetV: An Experimental Network-Based Volume Visualization System.",
                    "Interactive Data Exploration with a Supercomputer.",
                    "Run-Time Visualization of Program Data.",
                    "A Scientific Visualization Synthesizer.",
                    "Integration of Visualization and Scientific Calculation in a Software System.",
                    "Image Handling in a Multi-Vendor Environment.",
                    "Tree maps: A Space-Filling Approach to the Visualization of Hierarchical Information Structures.",
                    "How Shall We Connect Our Software Tools?",
                    "Data Model for Scientific Visualization with Provisions for Regular and Irregular Grids.",
                    "Cooperative, Computer-Aided Design of Scientific Visualizations.",
                    "Deixis and the Future of Visualization Excellence.",
                    "Visualizing the Fourth Dimension Using Geometry and Light.",
                    "Visualization Tools for Semi-Conductor Modeling Software.",
                    "Visualizing Chemical Kinetics in Fractal Domains.",
                    "Multidimensional Real-Time Visualization on Personal Computers.",
                    "Advanced Visualization on Desktop Workstations.",
                    "Distributed Visualization using Workstations, SuperJacques Lévy-Vehelcomputers and High Speed Networks.",
                    "Designing a Distributed Scientific Visualization Tool.",
                    "Experiments with Interdisciplinary Projects and Scientific Visualization Applications at the Undergraduate Level.",
                    "Visualization in Computational Fluid Dynamics: A Case Study.",
                    "Visualizing Environmental Data for Program Decision Support."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "1st Vis 1990",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/visualization/1990",
                "sub_name": "1st IEEE Visualization Conference, IEEE Vis 1990, San Francisco, CA, USA, October 23-26, 1990, Proceedings.",
                "count": 54,
                "papers": [
                    "Surface Representations of Two- and Three-Dimensional Fluid Flow Topology.",
                    "FAST: A Multi-Processed Environment for Visualization of Computational Fluid Dynamics.",
                    "The VIS-5D System for Easy Interactive Visualization.",
                    "A Procedural Interface for Volume Rendering.",
                    "Techniques for the Interactive Visualization of Volumetric Data.",
                    "Displaying Voxel-Based Objects According to Their Qualitative Shape Synthesis.",
                    "Interpreting a 3D Object from a Rough 2D Line Drawing.",
                    "Animation Techniques for Chain-Coded Objects.",
                    "Extracting Geometric Models Through Constraint Minimization.",
                    "Wide-band Relativistic Doppler Effect Visualization.",
                    "Dynamic Graphics for Network Visualization.",
                    "Techniques for Visualizing Fermat's Last Theorem.",
                    "Visualizing Computer Memory Architectures.",
                    "A Methodology for Scientific Visualization: Choosing Representations based on Natural Scene Paradigm.",
                    "Moving Iconic Objects in Scientific Visualization.",
                    "Classifying Visual Knowledge Representations: A Foundation for Visualization Research.",
                    "A Problem-oriented Classification of Visualization Techniques.",
                    "Visualization and Three-Dimensional Image Processing of Positron Emission.",
                    "Applying Space Subdivision Techniques to Volume Rendering.",
                    "Volume Visualization in Cell Biology.",
                    "ierarchical Triangulation Using Terrain Features.",
                    "Rendering and Managing Spherical Data with Sphere Quadtrees.",
                    "Methods for Surface Interrogation.",
                    "A Three-Dimensional/Stereoscopic Display and Model Control System for Great Lakes Forecasts.",
                    "Spline-Based Color Sequences for Univariate, Bivariate and Trivariate Mapping.",
                    "Interactive Visualization of Quaternion Julia Sets.",
                    "A Journey into the Fourth Dimension.",
                    "Exploring N-Dimensional Databases.",
                    "Shape Coding of Multidimensional Data on a Microcomputer Display.",
                    "Visualization of Irregular Multivariate Data.",
                    "Visualizing a Scalar Field on an N-dimensional Lattice.",
                    "Ray Traced Scalar Fields with Shaded Polygonal Output.",
                    "The Application of Transport Theory to Visualization of 3D Scalar Data Fields.",
                    "Visualization of Scalar Data Defined on a Structured Grid: Applications to Petroleum Research.",
                    "A Numerical Method for Rendering Spherical Reflections.",
                    "Superposing Images with Shadow Casting.",
                    "Automatic Illustration of 3D Geometric Models: Surfaces.",
                    "Scattered Data Interpolation Tools in a Microcomputer Visualization Environment.",
                    "Design of an End-User Data Visualization System.",
                    "A System for Three-Dimensional Acoustic Visualization in a Virtual Environment Workstation.",
                    "An Interpersonal Multimedia Visualization System.",
                    "Techniques for Visualizing 3-Dimensional Manifolds.",
                    "Accurate Display of Tensor Product Isosurfaces.",
                    "Parallel Coordinates: A Tool for Visualizing Multi-dimensional Geometry.",
                    "Visualization of Free-Form Volumes.",
                    "Visualization of Non-Linear Engineering FEM Analysis in Manufacturing.",
                    "Volume Microscopy of Biological Specimens Based on Nonconfocal Imaging Techniques.",
                    "Visualization of the Information Age.",
                    "Factors Inducing Periodic Breathing in Humans Blunted Hypoxic Sensitivity.",
                    "Interactive Investigations of Fluid Mechanics Data Sets.",
                    "Real-World Applications of Visualization Solutions.",
                    "Personal Visualization System: Applications in Research and Engineering.",
                    "A Graphical Interface for Robotic Remediation of Underground Storage Tanks.",
                    "Interdisciplinary Visualization: Lessons Learned at NCSA."
                ]
            }
        ]
    }
]