[
    {
        "name": "IET-IPR",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 72,
        "papers": [
            "SAR image classification based on multi-feature fusion decision convolutional neural network.",
            "A comprehensive survey: Image deraining and stereo-matching task-driven performance analysis.",
            "CP-GAN: Meet the high requirements of diagnose report to medical image by content preservation.",
            "DDNet: 3D densely connected convolutional networks with feature pyramids for nasopharyngeal carcinoma segmentation.",
            "Learning spatial self-attention information for visual tracking.",
            "Image enhancement via texture protection Retinex.",
            "Hyperspectral image classification with deep 3D capsule network and Markov random field.",
            "Road infrared target detection with I-YOLO.",
            "Ensemble cross-stage partial attention network for image classification.",
            "An optimal 3D convolutional neural network based lipreading method.",
            "Learning compact ConvNets through filter pruning based on the saliency of a feature map.",
            "Coal gangue detection and recognition algorithm based on deformable convolution YOLOv3.",
            "Trident-YOLO: Improving the precision and speed of mobile device object detection.",
            "Underwater image enhancement via LBP-based attention residual network.",
            "ESA-CycleGAN: Edge feature and self-attention based cycle-consistent generative adversarial network for style transfer.",
            "Disentangled and controllable sketch creation based on disentangling the structure and color enhancement.",
            "Heterogeneous face detection based on multi-task cascaded convolutional neural network.",
            "A multi-focus image fusion method based on multi-source joint layering and convolutional sparse representation.",
            "PCAF-Net: A liver segmentation network based on deep learning.",
            "New flexible deterministic compressive measurement matrix based on finite Galois field.",
            "Multiple classifier system for remotely sensed data clustering.",
            "Data gap decomposed by auxiliary modality for NIR-VIS heterogeneous face recognition.",
            "Deep coordinate attention network for single image super-resolution.",
            "Corrigendum.",
            "Comprehensive Review of Machine Learning (ML) in Image Defogging: Taxonomy of Concepts, Scenes, Feature Extraction, and Classification techniques.",
            "A thorough review of models, evaluation metrics, and datasets on image captioning.",
            "A coarse-refine segmentation network for COVID-19 CT images.",
            "Efficient video hashing based on low-rank frames.",
            "Quality assessment for inspection images of power lines based on spatial and sharpness evaluation.",
            "Enhanced gradient learning for deep neural networks.",
            "Detecting adversarial examples by additional evidence from noise domain.",
            "Disentangled representation learning GANs for generalized and stable font fusion network.",
            "A new image processing strategy for surface crack identification in building structures under non-uniform illumination.",
            "A combination of feature extraction methods and deep learning for brain tumour classification.",
            "Real-world super-resolution of face-images from surveillance cameras.",
            "Metric of choosing the optimal parameter setting for edge aware filtering.",
            "LESC: Superpixel cut-based local expansion for accurate stereo matching.",
            "Image haze removal based on rolling deep learning and Retinex theory.",
            "CFNet: Context fusion network for multi-focus images.",
            "Facial skin colour classification using machine learning and hyperspectral imaging data.",
            "Image quality enhancement using hybrid attention networks.",
            "LBP-based progressive feature aggregation network for low-light image enhancement.",
            "Hierarchical broad learning system for hyperspectral image classification.",
            "Augmented global attention network for image super-resolution.",
            "Real time detection of driver fatigue based on CNN-LSTM.",
            "Glioma classification framework based on SE-ResNeXt network and its optimization.",
            "Yeast cell detection in color microscopic images using ROC-optimized decoloring and segmentation.",
            "OsaMOT: Occlusion and scale-aware multi-object tracking algorithm for low viewpoint.",
            "Real-time classification on oral ulcer images with residual network and image enhancement.",
            "Identification of malnutrition and prediction of BMI from facial images using real-time image processing and machine learning.",
            "MSAR-DefogNet: Lightweight cloud removal network for high resolution remote sensing images based on multi scale convolution.",
            "ILBPSDNet: Based on improved local binary pattern shallow deep convolutional neural network for character recognition.",
            "An image enhancement algorithm of video surveillance scene based on deep learning.",
            "MAM: A multipath attention mechanism for image recognition.",
            "Inferior alveolar nerve canal segmentation by local features based neural network model.",
            "Data augmentation and shadow image classification for shadow detection.",
            "Exploiting robust unsupervised video person re-identification.",
            "Single sample per person face recognition algorithm based on the robust prototype dictionary and robust variation dictionary construction.",
            "Multiscale spectral-spatial cross-extraction network for hyperspectral image classification.",
            "Two-stage progressive residual learning network for multi-focus image fusion.",
            "A deep learning approach for the classification of TB from NIH CXR dataset.",
            "An image cipher system based on networked chaotic map with parameter q.",
            "Road crack detection network under noise based on feature pyramid structure with feature enhancement (road crack detection under noise).",
            "An improved dark channel defogging algorithm based on the HSI colour space.",
            "AC-SDBSCAN: Toward concealed object detection of passive terahertz images.",
            "Metallic debossed characters industrial online non-segmentation identification based on improved multi-scale image fusion enhancement and deep neural network.",
            "Pavement crack detection using non-local theory and iterative sampling.",
            "Multiscale residual fusion network for image denoising.",
            "Reversible data hiding based on multi-predictor and adaptive expansion.",
            "Fast outdoor hazy image dehazing based on saturation and brightness.",
            "Tomato leaf disease classification by exploiting transfer learning and feature concatenation.",
            "Quaternion-based improved cuckoo algorithm for colour UAV image edge detection."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 298,
        "papers": [
            "CNN-based infrared dim small target detection algorithm using target-oriented shallow-deep features and effective small anchor.",
            "Face alignment based on fusion subspace and 3D fitting.",
            "Features' value range approach to enhance the throughput of texture classification.",
            "A remote-sensing image enhancement algorithm based on patch-wise dark channel prior and histogram equalisation with colour correction.",
            "An efficient semantic segmentation method based on transfer learning from object detection.",
            "Classification of human activity detection based on an intelligent regression model in video sequences.",
            "KS-FQA: Keyframe selection based on face quality assessment for efficient face recognition in video.",
            "End-to-end feature fusion Siamese network for adaptive visual tracking.",
            "Image denoising method based on variable exponential fractional-integer-order total variation and tight frame sparse regularization.",
            "Residual dense U-Net for abnormal exposure restoration from single images.",
            "Feature fusion quality assessment model for DASH video streaming.",
            "MSNet: A novel end-to-end single image dehazing network with multiple inter-scale dense skip-connections.",
            "SAR image noise suppression of BEMD by the kernel principle component analysis.",
            "A generalized quality assessment method for natural and screen content images.",
            "An innovate approach for retinal blood vessel segmentation using mixture of supervised and unsupervised methods.",
            "Object scale selection of hierarchical image segmentation with deep seeds.",
            "Fast depth intra coding based on texture feature and spatio-temporal correlation in 3D-HEVC.",
            "Double-weighted patch-based label fusion for MR brain image segmentation.",
            "An effective weighted vector median filter for impulse noise reduction based on minimizing the degree of aggregation.",
            "Gender discrimination, age group classification and carried object recognition from gait energy image using fusion of parallel convolutional neural network.",
            "Parallel global convolutional network for semantic image segmentation.",
            "A new recognition algorithm for high-voltage lines based on improved LSD and convolutional neural networks.",
            "Underwater image restoration: A state-of-the-art review.",
            "Deep learning for occluded and multi-scale pedestrian detection: A review.",
            "Review of automated segmentation approaches for knee images.",
            "Deep multi-level up-projection network for single image super-resolution.",
            "Atom search-Jaya-based deep recurrent neural network for liver cancer detection.",
            "The trade-off between accuracy and the complexity of real-time background subtraction.",
            "Interest point detection from multi-beam light detection and ranging point cloud using unsupervised convolutional neural network.",
            "A feature-optimized Faster regional convolutional neural network for complex background objects detection.",
            "On learning based compressed sensing for high resolution image reconstruction.",
            "Providing clear pruning threshold: A novel CNN pruning method via L0 regularisation.",
            "Fuzzy based iterative matting technique for underwater images.",
            "An unsupervised approach for traffic motion patterns extraction.",
            "Completely blind image quality assessment via contourlet energy statistics.",
            "Classification of breast mass in two-view mammograms via deep learning.",
            "Facial expression recognition using a combination of enhanced local binary pattern and pyramid histogram of oriented gradients features extraction.",
            "Vehicle detection in aerial images based on lightweight deep convolutional network.",
            "A new two-stage method for single image rain removal.",
            "Digital image steganalysis: A survey on paradigm shift from machine learning to deep learning based techniques.",
            "Fractional-order generalized Laguerre moments and moment invariants for grey-scale image analysis.",
            "A hybrid BPSO-SVM for feature selection and classification of ocular health.",
            "Infrared small target detection based on non-convex triple tensor factorisation.",
            "A novel reversible data hiding based on adaptive block-partition and payload-allocation method.",
            "Hard exudate segmentation in retinal image with attention mechanism.",
            "An image denoising algorithm based on adaptive clustering and singular value decomposition.",
            "A fast level set image segmentation driven by a new region descriptor.",
            "Image denoising based on BCOLTA: Dataset and study.",
            "Convolutional neural network for smoke and fire semantic segmentation.",
            "Recurrent learning with clique structures for prostate sparse-view CT artifacts reduction.",
            "Dual branch convolutional neural network for copy move forgery detection.",
            "Application of a novel image moment computation in X-ray and MRI image watermarking.",
            "A new blind image conversion complexity metric for intelligent CMOS image sensors.",
            "Iterative registration for multi-modality retinal fundus photographs using directional vessel skeleton.",
            "Medical JPEG image steganography method according to the distortion reduction criterion based on an imperialist competitive algorithm.",
            "Dense spatio-temporal stereo matching for intelligent driving systems.",
            "Deep residual deconvolutional networks for defocus blur detection.",
            "A stochastic approach for automated brain MRI segmentation.",
            "Multi-style Chinese art painting generation of flowers.",
            "Full-reference tone-mapped images quality assessment.",
            "UDA-Net: Densely attention network for underwater image enhancement.",
            "A robust tracking algorithm for a human-following mobile robot.",
            "Graph-based saliency and ensembles of convolutional neural networks for glaucoma detection.",
            "Noise robust intuitionistic fuzzy c-means clustering algorithm incorporating local information.",
            "Delta tributary network - An efficient alternate approach for bottleneck layers in CNN for plant disease classification.",
            "A method of inpainting moles and acne on the high-resolution face photos.",
            "Analysis on segmentation and biomarker-based approaches for liver cancer detection: A survey.",
            "Attentive generative adversarial network for removing thin cloud from a single remote sensing image.",
            "A probabilistic collaborative dictionary learning-based approach for face recognition.",
            "Multi-image encryption algorithm based on image hash, bit-plane decomposition and dynamic DNA coding.",
            "A novel diagnostic map for computer-aided diagnosis of skin cancer.",
            "A pixel pair-based encoding pattern for stereo matching via an adaptively weighted cost.",
            "Real-time long-term tracking with reliability assessment and object recovery.",
            "Optimised CNN in conjunction with efficient pooling strategy for the multi-classification of breast cancer.",
            "Finger vein recognition algorithm under reduced field of view.",
            "Dense connection decoding network for crisp contour detection.",
            "Hyperspectral image, video compression using sparse tucker tensor decomposition.",
            "Unsupervised change detection method in SAR images based on deep belief network using an improved fuzzy C-means clustering algorithm.",
            "A content-dependent Daltonization algorithm for colour vision deficiencies based on lightness and chroma information.",
            "Visual-attention GAN for interior sketch colourisation.",
            "An improved symbol reduction technique based Huffman coder for efficient entropy coding in the transform coders.",
            "Single image dehazing based on bright channel prior model and saliency analysis strategy.",
            "Multi-focus image fusion evaluation based on jointly sparse representation and atom focus measure.",
            "Security augmentation grounded on Fresnel and Arnold transforms using hybrid chaotic structured phase mask.",
            "Meaningful ciphertext encryption algorithm based on bit scrambling, discrete wavelet transform, and improved chaos.",
            "Light field editing in the gradient domain.",
            "Hyperspectral image classification using 3D 2D CNN.",
            "Extraction of compact boundary normalisation based geometric descriptors for affine invariant shape retrieval.",
            "Face recognition based on adaptive margin and diversity regularization constraints.",
            "Identification of plant disease images via a squeeze-and-excitation MobileNet model and twice transfer learning.",
            "Sparse representation based intraframe and semi-intraframe video coding schemes for low bitrates.",
            "Adaptive enhanced affine transformation for non-rigid registration of visible and infrared images.",
            "High-speed target tracking algorithm for the pulse-sequence-based image sensor.",
            "Segregation of meaningful strokes, a pre-requisite for self co-articulation removal in isolated dynamic gestures.",
            "Pre-training of gated convolution neural network for remote sensing image super-resolution.",
            "Low-light image enhancement based on Retinex decomposition and adaptive gamma correction.",
            "Brain medical image fusion scheme based on shuffled frog-leaping algorithm and adaptive pulse-coupled neural network.",
            "Ground truth free retinal vessel segmentation by learning from simple pixels.",
            "Crowd counting with segmentation attention convolutional neural network.",
            "Adaptive comprehensive particle swarm optimisation-based functional-link neural network filtre model for denoising ultrasound images.",
            "FPGA-based favourite skin colour restoration using improved histogram equalization with variable enhancement degree and ensemble extreme learning machine.",
            "A new blind image denoising method based on asymmetric generative adversarial network.",
            "Vehicle license plate recognition for fog-haze environments.",
            "SAR image despeckling using deep CNN.",
            "Keypoint based comprehensive copy-move forgery detection.",
            "Segmentation of osteosarcoma in MRI images by K-means clustering, Chan-Vese segmentation, and iterative Gaussian filtering.",
            "High-resolution optical-to-SAR image registration using mutual information and SPSA optimisation.",
            "Selective focus saliency model driven by object class-awareness.",
            "Paralleled attention modules and adaptive focal loss for Siamese visual tracking.",
            "Towards accurate coronary artery calcium segmentation with multi-scale attention mechanism.",
            "Artefact-free image stitching via a better normed seam-cutting energy function.",
            "Mixed Poisson Gaussian noise reduction in fluorescence microscopy images using modified structure of wavelet transform.",
            "Deep spectral unmixing framework via 3D denoising convolutional autoencoder.",
            "Fusion-based simultaneous estimation of reflectance and illumination for low-light image enhancement.",
            "An adaptive level set method based on joint estimation dealing with intensity inhomogeneity.",
            "A level-set method for inhomogeneous image segmentation with application to breast thermography images.",
            "Window-aware guided image filtering via local entropy.",
            "A hybrid feature descriptor with Jaya optimised least squares SVM for facial expression recognition.",
            "Unsupervised automated retinal vessel segmentation based on Radon line detector and morphological reconstruction.",
            "Image stitching method by multi-feature constrained alignment and colour adjustment.",
            "Error feedback denoising network.",
            "An exclusive-disjunction-based detection of neovascularisation using multi-scale CNN.",
            "Level set method with Retinex-corrected saliency embedded for image segmentation.",
            "Generative adversarial network for low-light image enhancement.",
            "An efficient framework for deep learning-based light-defect image enhancement.",
            "Localised edge-region-based active contour for medical image segmentation.",
            "Iterative multi-scale residual network for deblurring.",
            "Colour image segmentation based on a convex K-means approach.",
            "Bilateral attention network for semantic segmentation.",
            "Hyperspectral face recognition with a spatial information fusion for local dynamic texture patterns and collaborative representation classifier.",
            "A full-reference stereoscopic image quality assessment index based on stable aggregation of monocular and binocular visual features.",
            "A dual-attention V-network for pulmonary lobe segmentation in CT scans.",
            "Video super-resolution with non-local alignment network.",
            "Attention-based video object segmentation algorithm.",
            "A plexus-convolutional neural network framework for fast remote sensing image super-resolution in wavelet domain.",
            "Medical image fusion and noise suppression with fractional-order total variation and multi-scale decomposition.",
            "A novel denoising algorithm for medical images based on the non-convex non-local similar adaptive regularization.",
            "Efficient recurrent attention network for remote sensing scene classification.",
            "An efficient local stereo matching method based on an adaptive exponentially weighted moving average filter in SLIC space.",
            "Feature pyramid U-Net for retinal vessel segmentation.",
            "Constructing an efficient and adaptive learning model for 3D object generation.",
            "A low-light image enhancement method based on bright channel prior and maximum colour channel.",
            "Learning adaptive spatial-temporal regularized correlation filters for visual tracking.",
            "A pyramid non-local enhanced residual dense network for single image de-raining.",
            "A keypoint-based object detection method with wide dual-path backbone network and attention modules.",
            "COVID-19 disease severity assessment using CNN model.",
            "Sparse representation for face recognition: A review paper.",
            "A review of approaches investigated for right ventricular segmentation using short-axis cardiac MRI.",
            "Online variational inference on finite multivariate Beta mixture models for medical applications.",
            "Agile reactive navigation for a non-holonomic mobile robot using a pixel processor array.",
            "Forgery localization in images based on joint statistics of image blocks with neighbouring blocks.",
            "CSIS: Compressed sensing-based enhanced-embedding capacity image steganography scheme.",
            "Image restoration model using Jaya-Bat optimization-enabled noise prediction map.",
            "Optimized deep learning model for mango grading: Hybridizing lion plus firefly algorithm.",
            "Weakly supervised salient object detection via double object proposals guidance.",
            "Towards accurate classification of skin cancer from dermatology images.",
            "Remote sensing target tracking in satellite videos based on a variable-angle-adaptive Siamese network.",
            "Lemon-YOLO: An efficient object detection method for lemons in the natural environment.",
            "DuGAN: An effective framework for underwater image enhancement.",
            "AMBCR: Low-light image enhancement via attention guided multi-branch construction and Retinex theory.",
            "An image encryption algorithm with a plaintext-related quantisation scheme.",
            "A method of lining seam elimination with angle adaptation and rectangular mark for road tunnel concrete lining images.",
            "A robust sperm cell tracking algorithm using uneven lighting image fixing and improved branch and bound algorithm.",
            "An automatic feature selection and classification framework for analyzing ultrasound kidney images using dragonfly algorithm and random forest classifier.",
            "Scale space Radon transform.",
            "An optimized YOLO-based object detection model for crop harvesting system.",
            "Cloud detection of GF-7 satellite laser footprint image.",
            "Spatial-tree filter for cost aggregation in stereo matching.",
            "U-FPNDet: A one-shot traffic object detector based on U-shaped feature pyramid module.",
            "Recognizing apple leaf diseases using a novel parallel real-time processing framework based on MASK RCNN and transfer learning: An application for smart agriculture.",
            "Improve conditional adversarial domain adaptation using self-training.",
            "A pre-processing technique to decrease inspection time in glass tube production lines.",
            "Improving crowd counting with scale-aware convolutional neural network.",
            "Rotational invariant fractional derivative filters for lung tissue classification.",
            "A motion parameters estimating method based on deep learning for visual blurred object tracking.",
            "Looking around in the neighbourhood: Location estimation of outdoor urban images.",
            "Spectral clustering based on high-frequency texture components for face datasets.",
            "High-sensitivity synchronous image encryption based on improved one-dimensional compound sine map.",
            "Diagnosing skin cancer via C-means segmentation with enhanced fuzzy optimization.",
            "Jointly human semantic parsing and attribute recognition with feature pyramid structure in EfficientNets.",
            "Occluded pedestrian detection combined with semantic features.",
            "Salient target detection in hyperspectral image based on visual attention.",
            "Multiscale ensemble of convolutional neural networks for skin lesion classification.",
            "An efficient way to use MS-CLEAN associated with Shannon's entropy.",
            "Learning-free handwritten word spotting method for historical handwritten documents.",
            "Blocking artefacts reduction based on a ripple matrix permutation image of high-frequency images in the wavelet domain.",
            "Alzheimer's disease diagnosis based on the visual attention model and equal-distance ring shape context features.",
            "Brain tumour cell segmentation and detection using deep learning networks.",
            "Graph wavelet transform for image texture classification.",
            "Shadow detection from images using fuzzy logic and PCPerturNet.",
            "Pedestrian re-identification based on attribute mining and reasoning.",
            "Unsupervised many-to-many image-to-image translation across multiple domains.",
            "Weight-based colour constancy using contrast stretching.",
            "Automatic detection of safety helmet wearing based on head region location.",
            "Image defogging based on amended dark channel prior and 4-directional L1 regularisation.",
            "Deep forgery discriminator via image degradation analysis.",
            "Fast and efficient lossless encoder in image compression with low computation and low memory.",
            "Remote sensing image super-resolution based on convolutional blind denoising adaptive dense connection.",
            "Part-MOT: A multi-object tracking method with instance part-based embedding.",
            "Automatic image segmentation based on label propagation.",
            "SeqFace: Learning discriminative features by using face sequences.",
            "Blood vessel and background separation for retinal image quality assessment.",
            "Thigh muscle segmentation using a hybrid FRFCM-based multi-atlas method and morphology-based interpolation algorithm.",
            "Medical image steganographic algorithm via modified LSB method and chaotic map.",
            "Underwater image enhancement based on colour correction and fusion.",
            "A multi-class COVID-19 segmentation network with pyramid attention and edge loss in CT images.",
            "A discriminative self-attention cycle GAN for face super-resolution and recognition.",
            "Smart pansharpening approach using kernel-based image filtering.",
            "Reversible data hiding for encrypted image based on adaptive prediction error coding.",
            "Spectral recovery-guided hyperspectral super-resolution using transfer learning.",
            "HNSF Log-Demons: Diffeomorphic demons registration using hierarchical neighbourhood spectral features.",
            "An improved algorithm using weighted guided coefficient and union self-adaptive image enhancement for single image haze removal.",
            "An unsupervised person re-identification approach based on cross-view distribution alignment.",
            "Texture and exposure awareness based refill for HDRI reconstruction of saturated and occluded areas.",
            "Automatic license plate recognition on microprocessors and custom computing platforms: A review.",
            "Detail texture detection based on Yolov4-tiny combined with attention mechanism and bicubic interpolation.",
            "A novel weighted total variation model for image denoising.",
            "Gait recognition based on sparse linear subspace.",
            "Robustly correlated key-medical image for DNA-chaos based encryption.",
            "Medical image encryption scheme based on self-verification matrix.",
            "Candidate box fusion based approach to adjust position of the candidate box for object detection.",
            "A fuzzy spectral clustering algorithm for hyperspectral image classification.",
            "SFCN: Symmetric feature comparison network for detecting ischemic stroke lesions on CT images.",
            "Image resolution and contrast enhancement with optimal brightness compensation using wavelet transforms and particle swarm optimization.",
            "Face hallucination based on cluster consistent dictionary learning.",
            "BFGS method based variable projection approach for image restoration.",
            "Classification of hand-wrist maturity level based on similarity matching.",
            "Continuous digital zooming using generative adversarial networks for dual camera system.",
            "Edge feature enhancement approach using hilbert transform of Cauchy distribution and its applications.",
            "Infrared imaging enhancement through local window-based saliency extraction with spatial weight.",
            "Multistage reaction-diffusion equation network for image super-resolution.",
            "Leveraging attention-based visual clue extraction for image classification.",
            "Pain expression assessment based on a locality and identity aware network.",
            "PaI-Net: A modified U-Net of reducing semantic gap for surgical instrument segmentation.",
            "High energy flash X-ray image restoration using region extrema and kernel optimization.",
            "Tensor dimensionality reduction via mode product and HSIC.",
            "Low-light image enhancement based on exponential Retinex variational model.",
            "Erratum: Secure high capacity tetris-based scheme for data hiding.",
            "Low-rank nonnegative sparse representation and local preservation-based matrix regression for supervised image feature selection.",
            "Integration of gradient guidance and edge enhancement into super-resolution for small object detection in aerial images.",
            "A parallel multi-block alternating direction method of multipliers for tensor completion.",
            "Vector co-occurrence morphological edge detection for colour image.",
            "YOLOFig detection model development using deep learning.",
            "Road extraction from high resolution remote sensing image via a deep residual and pyramid pooling network.",
            "Accurate and efficient vehicle detection framework based on SSD algorithm.",
            "An unsupervised generative adversarial network for single image deraining.",
            "Generative domain adaptation for chest X-ray image analysis.",
            "In-orbit geometric calibration approach and positioning accuracy analysis for the Gaofen-7 laser footprint camera.",
            "Salient region growing based on Gaussian pyramid.",
            "Moving target inverse synthetic aperture radar image resolution enhancement based on two-dimensional block sparse signal reconstruction.",
            "Exploiting texture characteristics and spatial correlations for robustness metric of data hiding with noisy transmission.",
            "AFF-UNIT: Adaptive feature fusion for unsupervised image-to-image translation.",
            "Co-teaching based pseudo label refinery for cross-domain object detection.",
            "Efficient detection and robust tracking of spermatozoa in microscopic video.",
            "Multi-exposure image fusion based on feature evaluation with adaptive factor.",
            "A night low-illumination image enhancement model based on small probability area filtering and lossless mapping enhancement.",
            "LR-RoadNet: A long-range context-aware neural network for road extraction via high-resolution remote sensing images.",
            "Hierarchical guided network for low-light image enhancement.",
            "Subcutaneous sweat pore estimation from optical coherence tomography.",
            "MPI: Multi-receptive and parallel integration for salient object detection.",
            "Boundary augment: A data augment method to defend poison attack.",
            "Pseudo-Siamese residual atrous pyramid network for multi-focus image fusion.",
            "No-reference image quality assessment based on multiscale feature representation.",
            "HCISNet: Higher-capacity invisible image steganographic network.",
            "A Weibull-distribution-based hybrid total variation method for speckle reduction in ultrasound images.",
            "Prior-guided multiscale network for single-image dehazing.",
            "Change detection with cross enhancement of high- and low-level change-related features.",
            "Dynamic optimization of hessian determinant image pyramid for memory-efficient and high performance keypoint detection in SURF.",
            "Detection of material on a tray in automatic assembly line based on convolutional neural network.",
            "Erratum.",
            "Crowd understanding and analysis.",
            "Human behaviour recognition with mid-level representations for crowd understanding and analysis.",
            "Class structure-aware adversarial loss for cross-domain human action recognition.",
            "Dual-view 3D human pose estimation without camera parameters for action recognition.",
            "Deep social force network for anomaly event detection.",
            "Anomaly detection in video sequences: A benchmark and computational model.",
            "Behaviour detection in crowded classroom scenes via enhancing features robust to scale and perspective variations.",
            "Crowd activity recognition in live video streaming via 3D-ResNet and region graph convolution network.",
            "Latent label mining for group activity recognition in basketball videos.",
            "A deep learning method for video-based action recognition.",
            "MSR-FAN: Multi-scale residual feature-aware network for crowd counting.",
            "MFP-Net: Multi-scale feature pyramid network for crowd counting.",
            "Multi-level features extraction network with gating mechanism for crowd counting.",
            "Learn from Object Counting: Crowd Counting with Meta-learning.",
            "Crowd estimation using key-point matching with support vector regression.",
            "A novel face recognition method based on fusion of LBP and HOG.",
            "Multi-view intrinsic low-rank representation for robust face recognition and clustering.",
            "Multi-dimensional weighted cross-attention network in crowded scenes.",
            "Part-level attention networks for cross-domain person re-identification.",
            "MFNet-LE: Multilevel fusion network with Laplacian embedding for face presentation attacks detection.",
            "Real-time automatic helmet detection of motorcyclists in urban traffic using improved YOLOv5 detector.",
            "Multi-label learning based target detecting from multi-frame data.",
            "Contrastive learning of graph encoder for accelerating pedestrian trajectory prediction training.",
            "Multiple object tracking based on multi-task learning with strip attention.",
            "Cross-modal semantic correlation learning by Bi-CNN network.",
            "Adaptive colour restoration and detail retention for image enhancement.",
            "Image encryption algorithm for crowd data based on a new hyperchaotic system and Bernstein polynomial.",
            "CA-PMG: Channel attention and progressive multi-granularity training network for fine-grained visual classification."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 505,
        "papers": [
            "Vehicle detection in intelligent transport system under a hazy environment: a survey.",
            "Image-independent optimal non-negative integer bit allocation technique for the DCT-based image transform coders.",
            "Binary tomography on the isometric tessellation involving pixel shape orientation.",
            "Image sorting via a reduction in travelling salesman problem.",
            "Colour image encryption scheme based on enhanced quadratic chaotic map.",
            "Real-time least-squares ensemble visual tracking.",
            "Automatic optical-to-SAR image registration using a structural descriptor.",
            "Automatic rectification of warped Bangla document images.",
            "Gradient-based kernel selection technique for tumour detection and extraction of medical images using graph cut.",
            "Regularised IHS-based pan-sharpening approach using spectral consistency constraint and total variation.",
            "XNORCONV: CNNs accelerator implemented on FPGA using a hybrid CNNs structure and an inter-layer pipeline method.",
            "Low-rank tensor completion for visual data recovery via the tensor train rank-1 decomposition.",
            "Higher precision range estimation for context-based adaptive binary arithmetic coding.",
            "Automatic detection of acute lymphoblastic leukaemia based on extending the multifractal features.",
            "Image retrieval based on ASIFT features in a Hadoop clustered system.",
            "Integrated system for automatic detection of representative video frames in wireless capsule endoscopy using adaptive sliding window singular value decomposition.",
            "Correction of complex purple fringing by green-channel compensation and local luminance adaptation.",
            "Novel image restoration method based on multi-frame super-resolution for atmospherically distorted images.",
            "Fusing HOG and convolutional neural network spatial-temporal features for video-based facial expression recognition.",
            "Level set based shape prior and deep learning for image segmentation.",
            "DRU-net: a novel U-net for biomedical image segmentation.",
            "Optimisation of linear dependence energy for object co-segmentation in a set of images with heterogeneous contents.",
            "Backlit images enhancement using global tone mappings and image fusion.",
            "Hyperspectral image restoration by subspace representation with low-rank constraint and spatial-spectral total variation.",
            "Research on fingerprint classification based on twin support vector machine.",
            "Real-time multi-trajectory matching for dynamic hand gesture recognition.",
            "Background subtraction in dynamic scenes using the dynamic principal component analysis.",
            "Training approach using the shallow model and hard triplet mining for person re-identification.",
            "Heat diffusion embedded level set evolution for infrared image segmentation.",
            "Assessment of Sentinel-2A multispectral image for benthic habitat composition mapping.",
            "Effective hybrid genetic algorithm for removing salt and pepper noise.",
            "Blur parameter locus curve and its applications.",
            "Improving 3D reconstruction accuracy in wavelet transform profilometry by reducing shadow effects.",
            "Ensemble of deep convolutional neural networks based multi-modality images for Alzheimer's disease diagnosis.",
            "Reversible contrast enhancement for medical images with background segmentation.",
            "Investigation of filtering of rain streaks affected video sequences under various quantisation parameter in HEVC encoder using an enhanced V-BM4D algorithm.",
            "Identification of wool and mohair fibres with texture feature extraction and deep learning.",
            "Highly efficient neoteric histogram-entropy-based rapid and automatic thresholding method for moving vehicles and pedestrians detection.",
            "Non-redundant frame identification and keyframe selection in DWT-PCA domain for authentication of video.",
            "Fast and robust video stabilisation with preserved intentional camera motion and smear removal for infrared video.",
            "No-reference image quality assessment via structural information fluctuation.",
            "New video encryption schemes based on chaotic maps.",
            "Video segmentation scheme based on AMC.",
            "CAD: concatenated action descriptor for one and two person(s), using silhouette and silhouette's skeleton.",
            "Design of vision-based indoor positioning based on embedded system.",
            "BM3D-GT&AD: an improved BM3D denoising algorithm based on Gaussian threshold and angular distance.",
            "Integrating Taylor-Krill herd-based SVM to fuzzy-based adaptive filter for medical image denoising.",
            "Soft biometrics-based face image retrieval using improved grey wolf optimisation.",
            "Enhanced copy-paste forgery detection in digital images using scale-invariant feature transform.",
            "Edge-aware image filtering using a structure-guided CNN.",
            "Effect of pooling strategy on convolutional neural network for classification of hyperspectral remote sensing images.",
            "Image classification using SLIC superpixel and FAAGKFCM image segmentation.",
            "Fully automated scheme for computer-aided detection and breast cancer diagnosis using digitised mammograms.",
            "Left ventricular segmentation based on a parallel watershed transformation towards an accurate heart function evaluation.",
            "Novel multiple images encryption algorithm using CML system and DNA encoding.",
            "Application of random elements in ISS.",
            "Automatic thresholding using a modified valley emphasis.",
            "Quality assessment framework for video contextualisation of personal videos.",
            "Image denoising using 2D orthogonal locality preserving discriminant projection.",
            "Design of fuzzy inference system for apple ripeness estimation using gradient method.",
            "Fast search real-time face recognition based on DCT coefficients distribution.",
            "Image segmentation algorithm based on neutrosophic fuzzy clustering with non-local information.",
            "Varied channels region proposal and classification network for wildlife image classification under complex environment.",
            "Robust retinal optic disc and optic cup segmentation via stationary wavelet transform and maximum vessel pixel sum.",
            "Context-based ensemble classification for the detection of architectural distortion in a digitised mammogram.",
            "Detection and localisation of multiple brain tumours by object counting and elimination.",
            "Deep convolution network for dense crowd counting.",
            "Reference data preparation for complex satellite image segmentation.",
            "Effective key-frame extraction approach using TSTBTC-BBA.",
            "Image quality assessment via spatial-transformed domains multi-feature fusion.",
            "Medical fusion framework using discrete fractional wavelets and non-subsampled directional filter banks.",
            "Low light image enhancement with adaptive sigmoid transfer function.",
            "New design of adaptive Gabor wavelet filter bank for medical image retrieval.",
            "Efficient inception V2 based deep convolutional neural network for real-time hand action recognition.",
            "Wavelet transform modulus maxima-based robust logo watermarking.",
            "Semi-supervised convolutional generative adversarial network for hyperspectral image classification.",
            "Wavelet-based deep learning for skin lesion classification.",
            "Novel visual tracking approach via ant lion optimiser.",
            "Segmentation-based MAP despeckling of medical ultrasound images in shearlet domain based on normal inverse Gaussian distribution.",
            "Normalised gamma transformation-based contrast-limited adaptive histogram equalisation with colour correction for sand-dust image enhancement.",
            "Semantic combined network for zero-shot scene parsing.",
            "Variable step-size matching pursuit based on oblique projection for compressed sensing.",
            "No-reference quality assessment for live broadcasting videos in temporal and spatial domains.",
            "Learning a minimum similarity projection and lowest correlation representation for image classification.",
            "Application of optimal FrFT order for improving the azimuth resolution of range Doppler imaging algorithm.",
            "Image contrast enhancement with brightness preservation using an optimal gamma and logarithmic approach.",
            "Enhanced image no-reference quality assessment based on colour space distribution.",
            "Improved strategy for human action recognition; experiencing a cascaded design.",
            "Stereo matching for infrared images using guided filtering weighted by exponential moving average.",
            "Image patch prior learning based on random neighbourhood resampling for image denoising.",
            "Blind video quality assessment via spatiotemporal statistical analysis of adaptive cube size 3D-DCT coefficients.",
            "KSR-BOF: a new and exemplified method (as KSRs method) for image classification.",
            "Hybrid higher-order total variation model for multiplicative noise removal.",
            "Privacy preserving search index for image databases based on SURF and order preserving encryption.",
            "CapsNet topology to classify tumours from brain images and comparative evaluation.",
            "Kernel-based Bayesian clustering of computed tomography images for lung nodule segmentation.",
            "Robust image hashing with visual attention model and invariant moments.",
            "Depth data and fusion of feature descriptors for static gesture recognition.",
            "Active contour image segmentation model with de-hazing constraints.",
            "Structure tensor-based SIFT algorithm for SAR image registration.",
            "Two-stage traffic sign detection and recognition based on SVM and convolutional neural networks.",
            "CNN based localisation of forged region in object-based forgery for HD videos.",
            "Segmentation-based recognition system for handwritten Bangla and Devanagari words using conventional classification and transfer learning.",
            "Image encryption with cross colour field algorithm and improved cascade chaos systems.",
            "Multi-directional local adjacency descriptors (MDLAD) for heterogeneous face recognition.",
            "Corrigendum: Automatic detection of acute lymphoblastic leukaemia based on extending the multifractal features.",
            "Flow driven attention network for video salient object detection.",
            "Lossless digital image watermarking in sparse domain by using K-singular value decomposition algorithm.",
            "Parallel strength Pareto evolutionary algorithm-II based image encryption.",
            "Blind quality assessment for 3D synthesised video with binocular asymmetric distortion.",
            "Inhomogeneous morphological PDEs for robust and adaptive image shock filters.",
            "Image reflection removal using end-to-end convolutional neural network.",
            "Dual attention convolutional network for action recognition.",
            "End-to-end learning interpolation for object tracking in low frame-rate video.",
            "Cooperation: A new force for boosting generative adversarial nets with dual-network structure.",
            "CPGAN: Conditional patch-based generative adversarial network for retinal vessel segmentation.",
            "DRAN: Deep recurrent adversarial network for automated pancreas segmentation.",
            "Writer identification with n-tuple direction feature from contour.",
            "New adaptive histogram equalisation heuristic approach for contrast enhancement.",
            "Image encryption using a combination of Grain-128a algorithm and Zaslavsky chaotic map.",
            "Two-stage image smoothing based on edge-patch histogram equalisation and patch decomposition.",
            "Smoke detection in ship engine rooms based on video images.",
            "Joint rain and atmospheric veil removal from single image.",
            "Efficient symmetric image encryption by using a novel 2D chaotic system.",
            "Image DAEs based on residual entropy maximum.",
            "Empirical wavelet transform-based fog removal via dark channel prior.",
            "Robust random walk for leaf segmentation.",
            "Compressive sensed video recovery via iterative thresholding with random transforms.",
            "Generalised deep learning framework for HEp-2 cell recognition using local binary pattern maps.",
            "Securing DICOM images by a new encryption algorithm using Arnold transform and Vigenère cipher.",
            "Guest Editorial: Deep Learning for 3D Reconstruction.",
            "Dynamic image reconstruction and synthesis framework using deep learning algorithm.",
            "Optimisation analysis of pulmonary nodule diagnostic test based on deep belief nets.",
            "Support vector machine combined with magnetic resonance imaging for accurate diagnosis of paediatric pancreatic cancer.",
            "Deep3DSCan: Deep residual network and morphological descriptor based framework for lung cancer classification and 3D segmentation.",
            "Computational approach to body mass index estimation from dressed people in 3D space.",
            "Multi-dimensional data modelling of video image action recognition and motion capture in deep learning framework.",
            "Fabric defect detection using saliency of multi-scale local steering kernel.",
            "Automatic cloud segmentation from INSAT-3D satellite image via IKM and IFCM clustering.",
            "Super-resolution mapping of hyperspectral satellite images using hybrid genetic algorithm.",
            "Adaptive frequency median filter for the salt and pepper denoising problem.",
            "Texture and colour region separation based image retrieval using probability annular histogram and weighted similarity matching scheme.",
            "No-reference video quality assessment method based on spatio-temporal features using the ELM algorithm.",
            "Construction of high dynamic range image based on gradient information transformation.",
            "Multi-focus image fusion with Siamese self-attention network.",
            "Automatic segmentation for pulmonary nodules in CT images based on multifractal analysis.",
            "Chua's diode and strange attractor: a three-layer hardware-software co-design for medical image confidentiality.",
            "Tablet identification using support vector machine based text recognition and error correction by enhanced n-grams algorithm.",
            "Novel deep learning model for facial expression recognition based on maximum boosted CNN and LSTM.",
            "Improved water quality mapping based on cross-fusion of Sentinel-2 and Landsat-8 imageries.",
            "Efficient image noise estimation based on skewness invariance and adaptive noise injection.",
            "Non-linear calibration optimisation based on the Levenberg-Marquardt algorithm.",
            "Property-based shadow detection and removal method for licence plate image.",
            "Review of image processing approaches for detecting plant diseases.",
            "Survey on visual sentiment analysis.",
            "Joint low-rank project embedding and optimal mean principal component analysis.",
            "Single image rain removal with reusing original input squeeze-and-excitation network.",
            "Fast algorithm for large-scale subspace clustering by LRR.",
            "Pulmonary nodule risk classification in adenocarcinoma from CT images using deep CNN with scale transfer module.",
            "Deep detector classifier (DeepDC) for moving objects segmentation and classification in video surveillance.",
            "Object detection based on RGC mask R-CNN.",
            "Optical flow refinement using iterative propagation under colour, proximity and flow reliability constraints.",
            "Segmentation of the pulmonary nodule and the attached vessels in the CT scan of the chest using morphological features and topological skeleton of the nodule.",
            "Adaptive Gaussian notch filter for removing periodic noise from digital images.",
            "Image interpolation with adaptive k-nearest neighbours search and random non-linear regression.",
            "Hierarchical morphological graph signal multi-layer decomposition for editing applications.",
            "Measuring photography aesthetics with deep CNNs.",
            "Classification of dry age-related macular degeneration and diabetic macular oedema from optical coherence tomography images using dictionary learning.",
            "Pavement crack detection network based on pyramid structure and attention mechanism.",
            "Single image super-resolution based on sparse representation using dictionaries trained with input image patches.",
            "Quantitative assessment of capabilities of colour models for pen ink discrimination in handwritten documents.",
            "Improved compound image segmentation using automatic pixel block classification with SVM.",
            "NSST and vector-valued C-V model based image segmentation algorithm.",
            "Object counting method based on dual attention network.",
            "Automatic aircraft extraction using video matting and frame registration.",
            "Visual object tracking via iterative ant particle filtering.",
            "Pain intensity recognition via multi-scale deep network.",
            "FuSENet: fused squeeze-and-excitation network for spectral-spatial hyperspectral image classification.",
            "SODNet: small object detection using deconvolutional neural network.",
            "From pyramids to state-of-the-art: a study and comprehensive comparison of visible-infrared image fusion techniques.",
            "DRGAN: a deep residual generative adversarial network for PET image reconstruction.",
            "Collaborative model tracking with robust occlusion handling.",
            "Fingerprint liveness detection based on guided filtering and hybrid image analysis.",
            "Novel distortion free and histogram based data hiding scheme.",
            "Segmentation techniques for early cancer detection in red blood cells with deep learning-based classifier - a comparative approach.",
            "Fast fractal image compression algorithm using specific update search.",
            "Robust graph regularised sparse matrix regression for two-dimensional supervised feature selection.",
            "General generative model-based image compression method using an optimisation encoder.",
            "Collaborative similarity metric learning for face recognition in the wild.",
            "Adaptive bag-of-visual word modelling using stacked-autoencoder and particle swarm optimisation for the unsupervised categorisation of images.",
            "Denoising framework based on external prior guided rotational clustering.",
            "Neural network-based image quality comparator without collecting the human score for training.",
            "H-WordNet: a holistic convolutional neural network approach for handwritten word recognition.",
            "Segmentation method of multiple sclerosis lesions based on 3D-CNN networks.",
            "Surface segmentation and environment change analysis using band ratio phenology index method - supervised aspect.",
            "Swift distance transformed belief propagation using a novel dynamic label pruning method.",
            "Specific category region proposal network for text detection in natural scene.",
            "Optimal weighted bilateral filter with dual-range kernel for Gaussian noise removal.",
            "Combining highlight removal and low-light image enhancement technique for HDR-like image generation.",
            "Optimised multi-wavelet domain for decomposed electrooculogram-based eye movement classification.",
            "Medical image fusion using the PCNN based on IQPSO in NSST domain.",
            "Detecting abnormal events in traffic video surveillance using superorientation optical flow feature.",
            "Fast prediction mode selection and CU partition for HEVC intra coding.",
            "Multi-objectives optimisation of features selection for the classification of thyroid nodules in ultrasound images.",
            "Automatic tracing and extraction of text-line and word segments directly in JPEG compressed document images.",
            "Fully-automatic raw G-band chromosome image segmentation.",
            "Novel fuzzy clustering-based bias field correction technique for brain magnetic resonance images.",
            "Reweighted infrared patch image model for small target detection based on non-convex ℒp-norm minimisation and TV regularisation.",
            "Corrigendum: Speckle suppression in medical ultrasound images through Schur decomposition.",
            "Guest Editorial: Multidisciplinary advancement of imaging technologies: from medical diagnostics and genomics to cognitive machine vision, and artificial intelligence.",
            "Hybrid deep learning and machine learning approach for passive image forensic.",
            "Development of an intelligent CAD system for mass detection in mammographic images.",
            "Automatic grading of brain tumours using LSTM neural networks on magnetic resonance spectroscopy signals.",
            "Unified deep learning approach for prediction of Parkinson's disease.",
            "Deep learning-based automated detection of human knee joint's synovial fluid from magnetic resonance images with transfer learning.",
            "Smart feature extraction and classification of hyperspectral images based on convolutional neural networks.",
            "Evaluation of nano-filler dispersion quality in polymeric films with binary feature characteristics and fractal analysis.",
            "Combination of multi-scale and residual learning in deep CNN for image denoising.",
            "Where to look: a collection of methods forMAV heading correction in underground tunnels.",
            "Automated fish cage net inspection using image processing techniques.",
            "Performance evaluation of single and cross-dimensional feature detection and description.",
            "Optimised robust watermarking technique using CKGSA in DCT-SVD domain.",
            "Comparative analysis of reversible data hiding schemes.",
            "Block cosparsity overcomplete learning transform image segmentation algorithm based on burr model.",
            "Image multi-encryption architecture based on hybrid keystream sequence interspersed with Haar discrete wavelet transform.",
            "Image copy-move forgery detection algorithm based on ORB and novel similarity metric.",
            "Optimisation of both classifier and fusion based feature set for static American sign language recognition.",
            "Rapid region analysis for classification.",
            "Use of gradient and normal vectors for face recognition.",
            "Bi-dictionary learning model for medical image reconstruction from undersampled data.",
            "Visual saliency based global-local feature representation for skin cancer classification.",
            "Sonar image mosaic based on a new feature matching method.",
            "1D representation of Laplacian eigenmaps and dual k-nearest neighbours for unified video coding.",
            "Feature encoding with hybrid heterogeneous structure model for image classification.",
            "Hyperspectral image classification using three-dimensional geometric moments.",
            "Multi-frame image super resolution using spatially weighted total variation regularisations.",
            "Phase congruency and ODBTC based image retrieval.",
            "Advanced lung cancer classification approach adopting modified graph clustering and whale optimisation-based feature selection technique accompanied by a hybrid ensemble classifier.",
            "Adaptive road detection method combining lane line and obstacle boundary.",
            "Target tracker with masked discriminative correlation filter.",
            "MRGAN: a generative adversarial networks model for global mosaic removal.",
            "Accurate leukocoria predictor based on deep VGG-net CNN technique.",
            "Evaluating salient object detection in natural images with multiple objects having multi-level saliency.",
            "Automatic recognition and location system for electric vehicle charging port in complex environment.",
            "Survey of single image super-resolution reconstruction.",
            "Urdu handwritten text recognition: a survey.",
            "Symbol positions-based Slepian-Wolf coding with application to distributed video coding.",
            "Novel image encryption by combining dynamic DNA sequence encryption and the improved 2D logistic sine map.",
            "Background subtraction using infinite asymmetric Gaussian mixture models with simultaneous feature selection.",
            "Robust palmprint identification using efficient enhancement and two-stage matching technique.",
            "Conditional semi-fuzzy c-means clustering for imbalanced dataset.",
            "Physics-based dynamic texture analysis and synthesis model using GPU.",
            "Sparse representation based computed tomography images reconstruction by coupled dictionary learning algorithm.",
            "Feature channel enhancement for crowd counting.",
            "Approach to model human appearance based on sparse representation for human tracking in surveillance.",
            "Multi-head mutual-attention CycleGAN for unpaired image-to-image translation.",
            "New flexible directional filter bank by tuning Hermite transform parameters for content based medical image retrieval.",
            "E2-capsule neural networks for facial expression recognition using AU-aware attention.",
            "ResDNN: deep residual learning for natural image denoising.",
            "Acceleration of multi-task cascaded convolutional networks.",
            "Detection, quantification and classification of ripened tomatoes: a comparative analysis of image processing and machine learning.",
            "Perceptual accessible image encryption scheme conjugating multiple chaotic maps.",
            "Automatic food recognition system for middle-eastern cuisines.",
            "Dynamic gesture recognition based on feature fusion network and variant ConvLSTM.",
            "Vanishing point detection using the teaching learning-based optimisation algorithm.",
            "Extreme learning machine with feature mapping of kernel function.",
            "Seed picking crossover optimisation algorithm for semantic segmentation from images.",
            "A bi-directional fractional-order derivative mask for image processing applications.",
            "Structure-texture image decomposition using a new non-local TV-Hilbert model.",
            "Comparative analysis of texture feature extraction techniques for rice grain classification.",
            "DeepJoint segmentation for the classification of severity-levels of glioma tumour using multimodal MRI images.",
            "Robust landmark-free head pose estimation by learning to crop and background augmentation.",
            "Self-guided filter for image denoising.",
            "SAR multi-target interactive motion recognition based on convolutional neural networks.",
            "Hybrid deep emperor penguin classifier algorithm-based image quality assessment for visualisation application in HDR environments.",
            "Non-uniform image blind deblurring by two-stage fully convolution network.",
            "Higher order PDE based model for segmenting noisy image.",
            "Support vector machine classification combined with multimodal magnetic resonance imaging in detection of patients with schizophrenia.",
            "Unsupervised multiscale retinal blood vessel segmentation using fundus images.",
            "Guest Editorial: AI-Powered 3D Vision.",
            "Depth map artefacts reduction: a review.",
            "Absolute phase unwrapping with SVM for fringe-projection profilometry.",
            "Geometry and context guided refinement for stereo matching.",
            "Energy minimisation-based multi-class multi-instance geometric primitives extraction from 3D point clouds.",
            "New multi-view human motion capture framework.",
            "Individual retrieval based on oral cavity point cloud data and correntropy-based registration algorithm.",
            "DenseUNet: densely connected UNet for electron microscopy image segmentation.",
            "Coarse-to-fine 3D road model registration for traffic video augmentation.",
            "Method for automatic railway track surface defect classification and evaluation using a laser-based 3D model.",
            "IET Image Processing.",
            "MapReduce framework based big data clustering using fractional integrated sparse fuzzy C means algorithm.",
            "Automatic labelling of brain tissues in MR images through spatial indexes based hybrid atlas forest.",
            "Bayesian multilevel random-effects model for estimating noise in image sensors.",
            "3D reconstruction of spine image from 2D MRI slices along one axis.",
            "Simultaneous filter tuning and calibration of the camera and inertial measurement unit camera for a vision inertial navigation system.",
            "Adaptive colour-guided non-local means algorithm for compound noise reduction of depth maps.",
            "Multi-metric domain adaptation for unsupervised transfer learning.",
            "Improved MR image denoising via low- rank approximation and Laplacian-of-Gaussian edge detector.",
            "Image copy-move forgery detection using sparse recovery and keypoint matching.",
            "Classification of magnetic resonance images for brain tumour detection.",
            "Underwater sonar image classification using generative adversarial network and convolutional neural network.",
            "Quantitative analysis of cell morphology based on the contourlet transform.",
            "Fast multi-spectral image super-resolution via sparse representation.",
            "IET Image Processing.",
            "SiameseCCR: a novel method for one-shot and few-shot Chinese CAPTCHA recognition using deep Siamese network.",
            "Deep learning algorithm for breast masses classification in mammograms.",
            "Adaptive switching interpolation filter for restoring impulse corrupted digital images.",
            "Target segmentation of industrial smoke image based on LBP Silhouettes coefficient variant (LBPSCV) algorithm.",
            "Novel approach for automatic mid-diastole frame detection in 2D echocardiography sequences for performing planimetry of the mitral valve orifice.",
            "Method of multi-region tumour segmentation in brain MRI images using grid-based segmentation and weighted bee swarm optimisation.",
            "Row-level algorithm to improve real-time performance of glass tube defect detection in the production phase.",
            "Super-resolution image reconstruction using molecular docking.",
            "Distributed ImageJ(Fiji): a framework for parallel image processing.",
            "A point-based redesign algorithm for designing geometrically complex surfaces. A case study: Miralles's croissant paradox.",
            "Accelerating convolutional neural network training using ProMoD backpropagation algorithm.",
            "Structure preservation in content-aware image retargeting using multi-operator.",
            "Boundary detection using unbiased sparseness-constrained colour-opponent response and superpixel contrast.",
            "Ring oscillator as confusion - diffusion agent: a complete TRNG drove image security.",
            "Approach for shadow detection and removal using machine learning techniques.",
            "Image super-resolution based on conditional generative adversarial network.",
            "Blood flow imaging of high frame rate two-dimensional vector in cardiovascular ultrasound detection.",
            "Feedback evaluations to promote image captioning.",
            "Adaptive iterative global image denoising method based on SVD.",
            "Minimum class variance broad learning system for hyperspectral image classification.",
            "Class-aware single image to 3D object translational autoencoder.",
            "Occlusion-handling tracker based on discriminative correlation filters.",
            "Mutual information guided 3D ResNet for self-supervised video representation learning.",
            "Efficient segmentation of lumbar intervertebral disc from MR images.",
            "Eigenstructure involving the histogram for image thresholding.",
            "Analysis of the correlation between infrared thermal sequence images of nostril area and respiratory rate.",
            "Denoising real bursts with squeeze-and-excitation residual network.",
            "Siamese convolutional neural network-based approach towards universal image forensics.",
            "Toward a general model for reflection recovery and single image enhancement.",
            "Multi-exposure image fusion via a pyramidal integration of the phase congruency of input images with the intensity-based maps.",
            "Video summarisation with visual and semantic cues.",
            "Advanced framework for highly secure and cloud-based storage of colour images.",
            "Recognition of distorted QR codes with one missing position detection pattern.",
            "Multi-scale patches based image denoising using weighted nuclear norm minimisation.",
            "Dynamic mosaicking: combining A* algorithm with fractional Brownian motion for an optimal seamline detection.",
            "Target distance measurement method using monocular vision.",
            "Multi-modal image fusion based on saliency guided in NSCT domain.",
            "Colour image enhancement with brightness preservation and edge sharpening using a heat conduction matrix.",
            "Multiscale matters for part segmentation of instruments in robotic surgery.",
            "Human activity recognition using improved dynamic image.",
            "Active contours driven by modified LoG energy term and optimised penalty term for image segmentation.",
            "F2PNet: font-to-painting translation by adversarial learning.",
            "Novel breast cancer classification framework based on deep learning.",
            "Image dehazing with uneven illumination prior by dense residual channel attention network.",
            "Robust segmentation of the colour image by fusing the SDD clustering results from different colour spaces.",
            "Deep visual unsupervised domain adaptation for classification tasks: a survey.",
            "Classifying functional nuclear images with convolutional neural networks: a survey.",
            "Automatic 3D point cloud registration algorithm based on triangle similarity ratio consistency.",
            "Medical image segmentation using deep learning with feature enhancement.",
            "Empirical greedy machine-based automatic liver segmentation in CT images.",
            "Guided adaptive interpolation filter.",
            "Automatic segmentation and classification of lung tumour using advance sequential minimal optimisation techniques.",
            "Proximal approach to denoising hyperspectral images under mixed-noise model.",
            "Robust defect detection in 2D images printed on 3D micro-textured surfaces by multiple paired pixel consistency in orientation codes.",
            "Corner detection using the point-to-centroid distance technique.",
            "Dense optical flow based background subtraction technique for object segmentation in moving camera environment.",
            "Simple algorithm for L1-norm regularisation-based compressed sensing and image restoration.",
            "Outlier percentage estimation for shape- and parameter-independent outlier detection.",
            "Blind atmospheric turbulence deconvolution.",
            "Learning an adaptive model for extreme low-light raw image processing.",
            "Recognition of cursive video text using a deep learning framework.",
            "Volumetric lung nodule segmentation in thoracic CT scan using freehand sketch.",
            "Efficient image classification technique for weather degraded fruit images.",
            "Image decomposition and denoising using fractional-order partial differential equations.",
            "FI-GAN: fewer iterations GAN for rapid synthesis controllable realistic images.",
            "Modification and hardware implementation of cortex-like object recognition model.",
            "Grain segmentation of sandstone images based on convolutional neural networks and weighted fuzzy clustering.",
            "Compressive sensing MR imaging based on adaptive tight frame and reference image.",
            "Automated unsupervised learning-based clustering approach for effective anomaly detection in brain magnetic resonance imaging (MRI).",
            "Progressive learning with style transfer for distant domain adaptation.",
            "Deep facial emotion recognition in video using eigenframes.",
            "Adaptive trainable non-linear reaction diffusion for Rician noise removal.",
            "Infrared and visible image fusion using a shallow CNN and structural similarity constraint.",
            "Image compression using adaptive multiresolution image decomposition algorithm.",
            "Multi-view hand gesture recognition via pareto optimal front.",
            "Highly accurate 3D reconstruction based on a precise and robust binocular camera calibration method.",
            "Correlation scan matching algorithm based on multi-resolution auxiliary historical point cloud and lidar simultaneous localisation and mapping positioning application.",
            "Tensor total variation regularised low-rank approximation framework for video deraining.",
            "UCT-GAN: underwater image colour transfer generative adversarial network.",
            "Salient object detection via reliability-based depth compactness and depth contrast.",
            "Guest Editorial: Evolutionary Computation for Image Processing.",
            "Research on image sharpening algorithm in weak illumination environment.",
            "Improved artificial bee colony algorithm with opposition-based learning.",
            "KSSD: single-stage multi-object detection algorithm with higher accuracy.",
            "Gesture recognition algorithm based on multi-scale feature fusion in RGB-D images.",
            "Innovative approach for multimodal fusion recognition based feature extraction using band-limited phase-only correlation and discrete orthonormal Stockwell transform.",
            "Convolutional neural network based on differential privacy in exponential attenuation mode for image classification.",
            "Research on measurement and energy efficiency improvement of flat panel display based on industrial control.",
            "Jointly network image processing: multi-task image semantic segmentation of indoor scene based on CNN.",
            "Combined mixed Gaussian model with pattern recognition in the automatic diagnosis of Alzheimer's disease.",
            "Segmentation of brain magnetic resonance images using a novel fuzzy clustering based method.",
            "Retinal image blood vessel extraction and quantification with Euclidean distance transform approach.",
            "Local contrast measure with iterative error for infrared small target detection.",
            "Water level monitoring using classification techniques on Landsat-8 data at Sangam region, Prayagraj, India.",
            "Genetic-based feature fusion in face recognition using arithmetic coded local binary patterns.",
            "Multi-camera 3D ball tracking framework for sports video.",
            "Rotational invariant biologically inspired object recognition.",
            "EKFPnP: extended Kalman filter for camera pose estimation in a sequence of images.",
            "Target object detection using chicken social-based deep belief network with hyperspectral imagery.",
            "Deep convolutional neural network for mixed random impulse and Gaussian noise reduction in digital images.",
            "Wise optimisation: deep image embedding by informative pair weighting and ranked list learning.",
            "Automatic production of synthetic labelled OCT images using an active shape model.",
            "Two-stage visible watermark removal architecture based on deep learning.",
            "Fast and robust image watermarking method in the spatial domain.",
            "CMCS-net: image compressed sensing with convolutional measurement via DCNN.",
            "Ensemble-based glioma grade classification using Gabor filter bank and rotation forest.",
            "Multimodal biometric recognition systems using deep learning based on the finger vein and finger knuckle print fusion.",
            "PReLU and edge-aware filter-based image denoiser using convolutional neural network.",
            "Image enhancement using convolutional neural network to identify similar patterns.",
            "HU-PageScan: a fully convolutional neural network for document page crop.",
            "High-precision refocusing method with one interpolation for camera array images.",
            "Hyperspectral remote sensing image classification using combinatorial optimisation based un-supervised band selection and CNN.",
            "Printed Persian OCR system using deep learning.",
            "Defect detection of printed circuit board based on lightweight deep convolution network.",
            "Vector ordering and regression learning-based ranking for dynamic summarisation of user videos.",
            "Deep feature learning for gender classification with covered/camouflaged faces.",
            "Category-wise feature extractor based on ADL method for weak-supervised object localisation.",
            "Tumour growth prediction of follow-up lung cancer via conditional recurrent variational autoencoder.",
            "CGGAN: a context-guided generative adversarial network for single image dehazing.",
            "Iterative PET image reconstruction using cascaded data consistency generative adversarial network.",
            "DeepInterpolation: fusion of multiple interpolations and CNN to obtain super-resolution.",
            "Machine learning and deep learning for clinical data and PET/SPECT imaging in Parkinson's disease: a review.",
            "Survey on mixed impulse and Gaussian denoising filters.",
            "Fast visual saliency based on multi-scale difference of Gaussians fusion in frequency domain.",
            "Common-specific feature learning for multi-source domain adaptation.",
            "Ensemble learning-based COVID-19 detection by feature boosting in chest X-ray images.",
            "Automated detection of multiple structural changes of diabetic macular oedema in SDOCT retinal images through transfer learning in CNNs.",
            "Evaluation criterion of underwater object clustering segmentation with pulse-coupled neural network.",
            "Hybrid feature CNN model for point cloud classification and segmentation.",
            "Automatic layered RGB-D scene flow estimation with optical flow field constraint.",
            "Efficient and unified license plate recognition via lightweight deep neural network.",
            "Design and implementation of image kernels using reversible logic gates.",
            "Social bat optimisation dependent deep stacked auto-encoder for skin cancer detection.",
            "Image clustering algorithm using superpixel segmentation and non-symmetric Gaussian-Cauchy mixture model.",
            "IET Image Processing.",
            "SAR image denoising based on multifractal feature analysis and TV regularisation.",
            "Inter-frame forgery detection and localisation in videos using earth mover's distance metric.",
            "Segmentation using fuzzy cluster-based thresholding method for apple fruit sorting.",
            "Depth estimation for underwater images from single view image.",
            "Efficient image segmentation method based on an adaptive selection of Gabor filters.",
            "Infrared and visible image fusion using multi-scale NSCT and rolling-guidance filter.",
            "Ordered and fixed-length bit-string fingerprint representation with minutia vicinity combined feature and spectral clustering.",
            "Reversible data hiding in encrypted images for coding channel based on adaptive steganography.",
            "Image dehazing method via a cycle generative adversarial network.",
            "Synthetic medical image generator for data augmentation and anonymisation based on generative adversarial network for glioblastoma tumors growth prediction.",
            "Low-complexity block tree image coder for visual sensor networks.",
            "Diagnosis of brain tumours by MRI binarisation with variable fuzzy level.",
            "Automatic detection of multiple sclerosis lesions using Mask R-CNN on magnetic resonance scans.",
            "NSST domain CT-MR neurological image fusion using optimised biologically inspired neural network.",
            "Research on adaptive local feature enhancement in convolutional neural networks.",
            "Optimised hybrid classifiers for automatic HEp-2 cell classification.",
            "Comprehensive evaluation of image enhancement for unsupervised image description and matching.",
            "Novel superpixel-based algorithm for segmenting lung images via convolutional neural network and random forest.",
            "SE-RWNN: an synergistic evolution and randomly wired neural network-based model for adaptive underwater image enhancement.",
            "MaskHunter: real-time object detection of face masks during the COVID-19 pandemic.",
            "Design of optimal blind watermarking technique based on MOEA/D.",
            "Image compact-resolution and reconstruction using reversible network.",
            "Residual-wider convolutional neural network for image recognition.",
            "Hybridisation of single-image super-resolution with edge-aware multi-focus image fusion for edge enrichment.",
            "Efficient image structural similarity quality assessment method using image regularised feature.",
            "Two-scale fusion method of infrared and visible images via parallel saliency features.",
            "Computational complexity of fractal image compression algorithm.",
            "Efficient computer-aided diagnosis technique for leukaemia cancer detection.",
            "Bow image retrieval method based on SSD target detection.",
            "Hybrid DSSCS and convolutional neural network for peripheral blood cell recognition system.",
            "Super-pixel image segmentation algorithm based on adaptive equalisation feature parameters.",
            "Balanced principal component for 3D shape recognition using convolutional neural networks.",
            "Performance enhancement of image segmentation analysis for multi-grade tumour classification in MRI image.",
            "Improved probabilistic decision-based trimmed median filter for detection and removal of high-density impulsive noise.",
            "Non-iterative blind deconvolution algorithm based on power-law distribution.",
            "Improved algorithm for multiple sclerosis diagnosis in MRI using convolutional neural network.",
            "Simple accurate model-based phase diversity phase retrieval algorithm for wavefront sensing in high-resolution optical imaging systems.",
            "Generative adversarial image super-resolution network for multiple degradations.",
            "Composite attacks-based copy-move image forgery detection using AKAZE and FAST with automatic contrast thresholding.",
            "Fast and robust superpixel generation method.",
            "MPA-Net: multi-path attention stereo matching network.",
            "Novel segmentation algorithm for jacquard patterns based on multi-view image fusion.",
            "Microaneurysms segmentation and diabetic retinopathy detection by learning discriminative representations.",
            "Flow-based frame interpolation networks combined with occlusion-aware mask estimation.",
            "Segmentation of images through curve fitting analysis by modified Vandermonde matrix and modified Gram-Schmidt method.",
            "Retinal vessel segmentation based on task-driven generative adversarial network.",
            "Two viewpoints based real-time recognition for hand gestures.",
            "Multi-scale feature fusion network for person re-identification.",
            "Vehicle detection based on improved multitask cascaded convolutional neural network and mixed image enhancement.",
            "Secure high capacity tetris-based scheme for data hiding.",
            "Intelligent monitoring method of water quality based on image processing and RVFL-GMDH model.",
            "SIFT and HOG features for the retrieval of ancient Kannada epigraphs.",
            "Novel framework for automatic localisation of gun carrying by moving person using various indoor and outdoor mimic and real-time views/Scenes.",
            "Joint detection and tracking of non-ellipsoidal extended targets based on cubature Kalman-CBMeMBer sub-random matrices filter.",
            "Real-time keypoints detection for autonomous recovery of the unmanned ground vehicle.",
            "Multi-scale supervised network for crowd counting.",
            "Edge-guided single facial depth map super-resolution using CNN.",
            "Cervical cancer detection in cervical smear images using deep pyramid inference with refinement and spatial-aware booster.",
            "Item-to-item recommender system with simultaneous use of multiple images for image mosaicking creation in dynamic scenes.",
            "End to end system for hazy image classification and reconstruction based on mean channel prior using deep learning network.",
            "Forged text detection in video, scene, and document images.",
            "Infant brain segmentation based on a combination of VGG-16 and U-Net deep neural networks.",
            "Blind multipurpose watermarking with insertion of a single watermark: a generic construction based on verifiable threshold secret sharing.",
            "Blind deblurring and denoising via a learning deep CNN denoiser prior and an adaptive L 0-regularised gradient prior for passive millimetre-wave images.",
            "Multimodal action recognition using variational-based Beta-Liouville hidden Markov models.",
            "Improved framework of many-objective evolutionary algorithm to handle cloud detection problem in satellite imagery."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 324,
        "papers": [
            "Fast and accurate compressed sensing model in magnetic resonance imaging with median filter and split Bregman method.",
            "Dynamic texture classification using Gumbel mixtures in the complex wavelet domain.",
            "Efficient edge-preserved sonar image enhancement method based on CVT for object recognition.",
            "Controversial 'pixel' prior rule for JPEG adaptive steganography.",
            "Machine learning-based H.264/AVC to HEVC transcoding via motion information reuse and coding mode similarity analysis.",
            "DCF with high-speed spatial constraint.",
            "Linearly uncorrelated principal component and deep convolutional image deblurring for natural images.",
            "Affine invariant fusion feature extraction based on geometry descriptor and BIT for object recognition.",
            "Computer aided diagnosis of glaucoma using discrete and empirical wavelet transform from fundus images.",
            "CT and MRI image fusion based on multiscale decomposition method and hybrid approach.",
            "Accommodative extractor for QIM-based watermarking schemes.",
            "As-global-as-possible stereo matching with adaptive smoothness prior.",
            "Fractional crow search-based support vector neural network for patient classification and severity analysis of tuberculosis.",
            "Exact Legendre-Fourier moments in improved polar pixels configuration for image analysis.",
            "Novel image encryption algorithm based on improved logistic map.",
            "Mixture separability loss in a deep convolutional network for image classification.",
            "Adaptive appearance separation for interactive image segmentation based on Dense CRF.",
            "Image deformation based on contour using moving integral least squares.",
            "Development of a global batch clustering with gradient descent and initial parameters in colour image classification.",
            "Reliability verification-based convolutional neural networks for object tracking.",
            "Image segmentation framework based on optimal multi-method fusion.",
            "Semantic convex matrix factorisation for cross-media retrieval.",
            "Despeckling of ultrasound images using directionally decimated wavelet packets with adaptive clustering.",
            "Detail-enhanced target segmentation method for thermal video sequences based on spatiotemporal parameter update technique.",
            "Structural pattern-based approach for Betacam dropout detection in degraded archived media.",
            "Guest Editorial: Hyperspectral Imaging and Applications.",
            "Spatial-spectral classification of hyperspectral images: a deep learning framework with Markov Random fields based modelling.",
            "Convolutional neural network in network (CNNiN): hyperspectral image classification and dimensionality reduction.",
            "Weighted Kernel joint sparse representation for hyperspectral image classification.",
            "Hyperspectral image clustering via sparse dictionary-based anchored regression.",
            "Morphology-based structure-preserving projection for spectral-spatial feature extraction and classification of hyperspectral data.",
            "Hyperspectral band selection using crossover-based gravitational search algorithm.",
            "Combined FATEMD-based band selection method for hyperspectral images.",
            "Dimensionality reduction based on determinantal point process and singular spectrum analysis for hyperspectral images.",
            "Spectral clustering and spatial Frobenius norm-based Jaya optimisation for BS of hyperspectral images.",
            "Target detection of hyperspectral image based on spectral saliency.",
            "Selecting optimal bands for sub-pixel target detection in hyperspectral images based on implanting synthetic targets.",
            "Endmember extraction from hyperspectral imagery based on QR factorisation using givens rotations.",
            "Bilinear normal mixing model for spectral unmixing.",
            "Comparison of altered mineral information extracted from ETM+, ASTER and Hyperion data in Águas Claras iron ore, Brazil.",
            "High-density impulse noise detection and removal using deep convolutional neural network with particle swarm optimisation.",
            "Optic disc segmentation in fundus images using adversarial training.",
            "Late fusion of deep learning and handcrafted visual features for biomedical image modality classification.",
            "Hyperspectral imaging classification based on convolutional neural networks by adaptive sizes of windows and filters.",
            "Weighted similarity and distance metric learning for unconstrained face verification with 3D frontalisation.",
            "Automated glaucoma detection using retinal layers segmentation and optic cup-to-disc ratio in optical coherence tomography images.",
            "Biometric-based efficient medical image watermarking in E-healthcare application.",
            "Intelligent system with dragonfly optimisation for caries detection.",
            "Robust retinal blood vessel segmentation using hybrid active contour model.",
            "Pose detection in complex classroom environment based on improved Faster R-CNN.",
            "Image restoration via DOST and total variation regularisation.",
            "Deep pixel-to-pixel network for underwater image enhancement and restoration.",
            "Robust, blind multichannel image identification and restoration using stack decoder.",
            "Single image fast deblurring algorithm based on hyper-Laplacian model.",
            "Deep neural network with FGL for small dataset classification.",
            "Target tracking based on the cognitive associative network.",
            "Automatic segmentation of MR depicted carotid arterial boundary based on local priors and constrained global optimisation.",
            "Detected text-based image retrieval approach for textual images.",
            "Inter-frame forgery detection based on differential energy of residue.",
            "Optimised halftoning and inverse halftoning of dermoscopic images for supporting teledermoscopy system.",
            "Low-light image enhancement with strong light weakening and bright halo suppressing.",
            "Fast active learning for hyperspectral image classification using extreme learning machine.",
            "Conditional progressive network for clothing parsing.",
            "Reduced quaternion matrix-based sparse representation and its application to colour image processing.",
            "Fast proximal splitting algorithm for constrained TGV-regularised image restoration and reconstruction.",
            "Abnormal region detection in cervical smear images based on fully convolutional network.",
            "Deep residual refining based pseudo-multi-frame network for effective single image super-resolution.",
            "Robust multi-view videos face recognition based on particle filter with immune genetic algorithm.",
            "Rough intuitionistic type-2 fuzzy c-means clustering algorithm for MR image segmentation.",
            "Multimodal framework based on audio-visual features for summarisation of cricket videos.",
            "Multi-label automatic image annotation approach based on multiple improvement strategies.",
            "Geometric positions and optical flow based emotion detection using MLP and reduced dimensions.",
            "Compressive spectral feature sensing.",
            "Shock filter-based morphological scheme for texture enhancement.",
            "Sparse representation based multi-frame image super-resolution reconstruction using adaptive weighted features.",
            "Turning video into traffic data - an application to urban intersection analysis using transfer learning.",
            "Image denoising by low-rank approximation with estimation of noise energy distribution in SVD domain.",
            "Detection and tracking of bubbles in two-phase air water flow for non-convergent sinusoidal channel.",
            "Study of performance of a 'second-generation wavelet video encoder with a scalable rate'.",
            "Survey on depth perception in head mounted displays: distance estimation in virtual reality, augmented reality, and mixed reality.",
            "High-resolution DEM building with SAR interferometry and high-resolution optical image.",
            "ACT: an ACTNet for visual tracking.",
            "Rock-ring detection accuracy improvement in infrared satellite image with sub-pixel edge detection.",
            "3D palmprint recognition using unsupervised convolutional deep learning network and SVM classifier.",
            "Spatially varying blur estimation from a single image.",
            "Robust correlation filter tracking with deep semantic supervision.",
            "Efficient level-set segmentation model driven by the local GMM and split Bregman method.",
            "Gabor phase response based scheme for accurate pectoral muscle boundary detection.",
            "Thinning of convolutional neural network with mixed pruning.",
            "Design and implementation of a novel low complexity symmetric orthogonal wavelet filter-bank.",
            "Image reconstruction for emission tomography using intensity normalised patch-based regularisation.",
            "Transfer metric learning for unsupervised domain adaptation.",
            "Demosaicking algorithm for white-RGB CFA images.",
            "Fast and efficient contrast-enhanced super-resolution without real-world data using concatenated recursive compressor-decompressor network.",
            "Shape geodesics for robust sign language recognition.",
            "Quality assessment tool for performance measurement of image contrast enhancement methods.",
            "Machine-learning regression in evolutionary algorithms and image registration.",
            "Regional adaptive affinitive patterns (RADAP) with logical operators for facial expression recognition.",
            "Survey on hardware implementations of visual object trackers.",
            "Lung tumour detection by fusing extended local binary patterns and weighted orientation of difference from computed tomography.",
            "Accelerated seam carving for image retargeting.",
            "MFO-based thresholded and weighted histogram scheme for brightness preserving image enhancement.",
            "L 2, 1-norm-based sparse principle component analysis with trace norm regularised term.",
            "Real-time recovery and recognition of motion blurry QR code image based on fractional order deblurring method.",
            "Morphological PDEs on graphs for saliency detection.",
            "New method for simultaneous moderate bias correction and image segmentation.",
            "Iterative grouping median filter for removal of fixed value impulse noise.",
            "Field programmable gate array implementation of variable-bins high efficiency video coding CABAC decoder with path delay optimisation.",
            "Novel invariant feature descriptor and a pipeline for range image registration in robotic welding applications.",
            "Robust lane-detection algorithm based on improved symmetrical local threshold for feature extraction and inverse perspective mapping.",
            "3D Features for human action recognition with semi-supervised learning.",
            "Mobile terminal gesture recognition based on improved FAST corner detection.",
            "Ultrasound image segmentation with multilevel threshold based on differential search algorithm.",
            "Calibration of a panoramic 3D reconstruction system.",
            "Semantic segmentation of remote sensing ship image via a convolutional neural networks model.",
            "Computer-aided diagnosis system for ulcer detection in wireless capsule endoscopy images.",
            "Facial expression recognition techniques: a comprehensive survey.",
            "New approach to vehicle license plate location based on new model YOLO-L and plate pre-identification.",
            "Automatic geometry calibration for multi-projector display systems with arbitrary continuous curved surfaces.",
            "Robust long-term correlation tracking with multiple models.",
            "Generalising multistain immunohistochemistry tissue segmentation using end-to-end colour deconvolution deep neural networks.",
            "High-quality X-ray computed tomography reconstruction using projected and interpolated images.",
            "Image contrast enhancement using triple clipped dynamic histogram equalisation based on standard deviation.",
            "Modified grey world method to detect and restore colour cast images.",
            "Novel multispectral face descriptor using orthogonal walsh codes.",
            "Graph clustering and variational image segmentation for automated firearm detection in X-ray images.",
            "Non-local weighted fuzzy energy-based active contour model with level set evolution starting with a constant function.",
            "Fast generative adversarial networks model for masked image restoration.",
            "Image colourisation using deep feature-guided image retrieval.",
            "Online burr video denoising by learning sparsifying transform.",
            "Successive minutia-free mosaicking for small-sized fingerprint recognition.",
            "Use of hyperspectral imaging for cake moisture and hardness prediction.",
            "Optimisation of transmission map for improved image defogging.",
            "FQI: feature-based reduced-reference image quality assessment method for screen content images.",
            "Robust and real-time lane detection filter based on adaptive neuro-fuzzy inference system.",
            "New strategy for CBIR by combining low-level visual features with a colour descriptor.",
            "Speedy and accurate image super-resolution via deeply recursive CNN with skip connection and network in network.",
            "Fundus image quality assessment: survey, challenges, and future scope.",
            "Survey on the approaches based geometric information for 3D face landmarks detection.",
            "Review of the application of machine learning to the automatic semantic annotation of images.",
            "Image recovery and recognition: a combining method of matrix norm regularisation.",
            "Quick response barcode deblurring via L 0 regularisation based sparse optimisation.",
            "Aircraft tracking based on fully conventional network and Kalman filter.",
            "Empirical study of neighbourhood rough sets based band selection techniques for classification of hyperspectral images.",
            "Robust fingerprint classification with Bayesian convolutional networks.",
            "Slope-compensated interferogram filter with ESPRIT for adaptive frequency estimation.",
            "Multi-scale Cross-path Concatenation Residual Network for Poisson denoising.",
            "Computational colour constancy based on convolutional neural networks with a cross-level architecture.",
            "Nighttime image enhancement using a new illumination boost algorithm.",
            "No-reference image quality metric based on multiple deep belief networks.",
            "NIR-red algorithms-based model for chlorophyll-a retrieval in highly turbid Inland Densu River Basin in South-East Ghana, West Africa.",
            "Video retargeting based on SH equalisation and seam carving.",
            "Automated detection of microaneurysms using Stockwell transform and statistical features.",
            "Influence of shape and texture features on facial expression recognition.",
            "Enhanced embedded zerotree wavelet algorithm for lossy image coding.",
            "Characterising and predicting the movement of clouds using fractional-order optical flow.",
            "Improved hierarchical quantisation parameter setting method for screen content coding in high efficiency video coding.",
            "Structured group local sparse tracker.",
            "Combining colour and grey-level co-occurrence matrix features: a comparative study.",
            "Reversibility-oriented secret image sharing mechanism with steganography and authentication based on code division multiplexing.",
            "Multi-objective differential evolution-based ensemble method for brain tumour diagnosis.",
            "Pedestrian detection framework based on magnetic regional regression.",
            "Copy-for-duplication forgery detection in colour images using QPCETMs and sub-image approach.",
            "Multi-sensor medical image fusion using pyramid-based DWT: a multi-resolution approach.",
            "Comparative framework for vision-based gesturing modes and implementation of robust colour-marker detector for practical environments.",
            "Combining multi-wavelet and CNN for palmprint recognition against noise and misalignment.",
            "Fusion of transformed shallow features for facial expression recognition.",
            "Memorability-based image compression.",
            "Multi-Frame motion deblurring of video using the natural oscillatory motion of dexterous legged robots.",
            "SAR image change detection based on deep denoising and CNN.",
            "Deep learning approach for segmentation of plain carbon steel microstructure images.",
            "Content-based retinal image retrieval.",
            "Chaotic image encryption algorithm using frequency-domain DNA encoding.",
            "Classification of textured images based on new information fusion methods.",
            "Deep CNN for removal of salt and pepper noise.",
            "Age-related craniofacial differences based on spatio-temporal face image atlases.",
            "Long-term adaptive tracking via complementary trackers.",
            "Fast algorithm for HEVC intra-coding implemented by preprocessing.",
            "Review of underwater image restoration algorithms.",
            "Levellings based on spatially adaptive scale spaces using local image features.",
            "Stereoscopic image quality assessment by analysing visual hierarchical structures and binocular effects.",
            "Salient object detection via reciprocal function filter.",
            "Band selection of hyperspectral image by sparse manifold clustering.",
            "Deep-network based method for joint image deblocking and super-resolution.",
            "Robust part-based visual tracking via adaptive collaborative modelling.",
            "Modified clipping based image enhancement scheme using difference of histogram bins.",
            "Fast HSI super resolution using linear regression.",
            "Three-dimensional fusion of clustered and classified features for enhancement of liver and lesions from abdominal radiology images.",
            "Edge detection of retinal OCT image based on complex shearlet transform.",
            "Region-division-based joint sparse representation classification for hyperspectral images.",
            "Prediction error expansion-based reversible data hiding in encrypted images with public key cryptosystem.",
            "Adaptive multilayer level set method for segmenting images with intensity inhomogeneity.",
            "Automatic and optimal segmentation of the left ventricle in cardiac magnetic resonance images independent of the training sets.",
            "Efficient medical image enhancement based on CNN-FBB model.",
            "Lung segmentation based on random forest and multi-scale edge detection.",
            "Local difference-based active contour model for medical image segmentation and bias correction.",
            "Efficient clustering approach for adaptive unsupervised colour image segmentation.",
            "FD-based detector for medical image watermarking.",
            "Generative adversarial networks model for visible watermark removal.",
            "Combined training strategy for low-resolution face recognition with limited application-specific data.",
            "Single image rain removal model using pure rain dictionary learning.",
            "Lightweight cascade framework for optic disc segmentation.",
            "Bibliography of digital image anti-forensics and anti-anti-forensics techniques.",
            "Automated retinal layer segmentation in OCT images of age-related macular degeneration.",
            "Directional relative total variation for structure-texture decomposition.",
            "Single-image super-resolution using online kernel adaptive filters.",
            "Two-dimensional shape-adaptive windowing functions for image analysis.",
            "Video retargeting through spatio-temporal seam carving using Kalman filter.",
            "Orthogonal sparse fractal coding algorithm based on image texture feature.",
            "Robust face anti-spoofing using CNN with LBP and WLD.",
            "Multi-perspective gait recognition based on classifier fusion.",
            "Multi-objective genetic algorithm on hexagonal search for fast motion estimation.",
            "Through-the-wall radar imaging algorithm for moving target under wall parameter uncertainties.",
            "Data embedding in high efficiency video coding (HEVC) videos by modifying the partitioning of coding units.",
            "Mobile terminal trajectory recognition based on improved LSTM model.",
            "Spatial non-local attention for thoracic disease diagnosis and visualisation in weakly supervised learning.",
            "Realtime dehazing using colour uniformity principle.",
            "Fleckmentation: rapid segmentation using repeated 2-means.",
            "TDCC: top-down semantic aggregation for colour constancy.",
            "Alpha cut for interactive image segmentation of thin and elongated objects.",
            "Image compression system with an optimisation of compression ratio.",
            "Chest X-ray image denoising method based on deep convolution neural network.",
            "Feature fusion method using BoVW framework for enhancing image retrieval.",
            "Reversible data hiding using B-tree triangular decomposition based prediction.",
            "Texture spectral similarity criteria.",
            "Compressive domain spatial-temporal difference saliency-based realtime adaptive measurement method for video recovery.",
            "Automatic classification of skin burn colour images using texture-based feature extraction.",
            "Corrigendum: Image segmentation algorithm based on superpixel clustering.",
            "Hybrid CBIR method using statistical, DWT-Entropy and POPMV-based feature sets.",
            "Global median filtering forensic method based on Pearson parameter statistics.",
            "Image resizing using fuzzy inferences.",
            "OrthoMaps: an efficient convolutional neural network with orthogonal feature maps for tiny image classification.",
            "Sparsity measure based library aided unmixing of hyperspectral image.",
            "Image encryption based on Fisher-Yates shuffling and three dimensional chaotic economic map.",
            "Interest point detection method based on multi-scale Gabor filters.",
            "Visual tracking with tree-structured appearance model for online learning.",
            "Robust watermarking scheme for tamper detection and authentication exploiting CA.",
            "Diagnosis of melanoma from dermoscopic images using a deep depthwise separable residual convolutional network.",
            "Deep supervised hashing network with integrated regularisation.",
            "Enhanced pooling method for convolutional neural networks based on optimal search theory.",
            "Appearance model update based on online learning and soft-biometrics traits for people re-identification in multi-camera environments.",
            "Improved neural network classification of hyperspectral imagery using weighted genetic algorithm and hierarchical segmentation.",
            "DDLA: dual deep learning architecture for classification of plant species.",
            "Directional tensor product complex tight framelets for compressed sensing MRI reconstruction.",
            "Non-linear unmixing of hyperspectral images using multiple-kernel self-organising maps.",
            "RHEVC intra-prediction mode.",
            "Supervised image segmentation based on superpixel and improved normalised cuts.",
            "Glaucoma screening pipeline based on clinical measurements and hidden features.",
            "SVD-based image compression, encryption, and identity authentication algorithm on cloud.",
            "Multi-scale analysis of ulcer disease detection from WCE images.",
            "Efficient and robust segmentation and correction model for medical images.",
            "Change detection in SAR images using deep belief network: a new training approach based on morphological images.",
            "Tongue colour and coating prediction in traditional Chinese medicine based on visible hyperspectral imaging.",
            "Fusion of multi-modal lumbar spine images using Kekre's hybrid wavelet transform.",
            "Face recognition algorithm based on feature descriptor and weighted linear sparse representation.",
            "View's dependency and low-rank background-guided compressed sensing for multi-view image joint reconstruction.",
            "Bio-inspired contour detection model based on multi-bandwidth fusion and logarithmic texture inhibition.",
            "LSTM-based dynamic probability continuous hand gesture trajectory recognition.",
            "New image-guided method for localisation of an active capsule endoscope in the stomach.",
            "Unified multi-scale method for fast leaf classification and retrieval using geometric information.",
            "Locating multiple license plates using scale, rotation, and colour-independent clustering and filtering techniques.",
            "Fractional-integral-operator-based improved SVM for filtering salt-and-pepper noise.",
            "Detection of power line insulators on digital images with the use of laser spots.",
            "State-of-art analysis of image denoising methods using convolutional neural networks.",
            "Advances in human action recognition: an updated survey.",
            "Fuzzy farthest point first method for MRI brain image clustering.",
            "Automated glaucoma detection using quasi-bivariate variational mode decomposition from fundus images.",
            "Fast and robust ellipse detector based on edge following method.",
            "Authentication of medical images using passive approach.",
            "Objective estimation of subjective image quality assessment using multi-parameter prediction.",
            "Visual saliency object detection using sparse learning.",
            "Low light image enhancement based on non-uniform illumination prior model.",
            "Trilateral convolutional neural network for 3D shape reconstruction of objects from a single depth view.",
            "Enhancing scene perception using a multispectral fusion of visible-near-infrared image pair.",
            "Multi-mother wavelet neural network-based on genetic algorithm and multiresolution analysis for fast 3D mesh deformation.",
            "Determination of tool deflection in drilling by image processing.",
            "Discarding jagged artefacts in image upscaling with total variation regularisation.",
            "Multi-scale microstructure binary pattern extraction and learning for image representation.",
            "Incorporating iris, fingerprint and face biometric for fraud prevention in e-passports using fuzzy vault.",
            "STCMH with minimal semantic loss.",
            "Retinal vessel segmentation approach based on corrected morphological transformation and fractal dimension.",
            "Automated acute lymphoblastic leukaemia detection system using microscopic images.",
            "Multi-exposure image fusion technique using multi-resolution blending.",
            "Enhancement of variably illuminated document images through noise-induced stochastic resonance.",
            "Human activity recognition using 2D skeleton data and supervised machine learning.",
            "Applying maximally stable extremal regions and local binary patterns for guide-wire detecting in percutaneous coronary intervention.",
            "Area-efficient parallel adder with faithful approximation for image and signal processing applications.",
            "Improved image segmentation algorithms for detecting types of acute lymphatic leukaemia.",
            "Denoising convolutional neural network with mask for salt and pepper noise.",
            "Pansharpening with transform-based gradient transferring model.",
            "SUGAMAN: describing floor plans for visually impaired by annotation learning and proximity-based grammar.",
            "Image denoising using patch ordering and 3D transformation of patches.",
            "Welding defect detection based on local image enhancement.",
            "Guest Editorial: Adversarial Learning in Image Processing.",
            "Survey on GAN-based face hallucination with its model development.",
            "Image super-resolution using conditional generative adversarial network.",
            "Learning one-to-many stylised Chinese character transformation and generation by generative adversarial networks.",
            "ACFT: adversarial correlation filter for robust tracking.",
            "ASiam: adaptive Siamese regression tracking with adversarial template generation and motion-based failure recovery.",
            "ApprGAN: appearance-based GAN for facial expression synthesis.",
            "Adversarial image generation by combining content and style.",
            "High confidence detection for moving target in aerial video.",
            "Combination of modified U-Net and domain adaptation for road detection.",
            "PixTextGAN: structure aware text image synthesis for license plate recognition.",
            "Progressive graph-based subspace transductive learning for semi-supervised classification.",
            "Two-order graph convolutional networks for semi-supervised classification.",
            "Adversarial auto-encoder for unsupervised deep domain adaptation.",
            "SDCA: a novel stack deep convolutional autoencoder - an application on retinal image denoising.",
            "Modified tropical algebra based median filter for removing salt and pepper noise in digital image.",
            "Dense small face detection based on regional cascade multi-scale method.",
            "Fusing texture, edge and line features for smoke recognition.",
            "Capturing the spatio-temporal continuity for video semantic segmentation.",
            "Aesthetic assessment of paintings based on visual balance.",
            "Homography-based traffic sign localisation and pose estimation from image sequence.",
            "Single sample description based on Gabor fusion.",
            "Blind text images deblurring based on a generative adversarial network.",
            "Salient object detection with adversarial training.",
            "Supervised fusion approach of local features extracted from SAR images for detecting deforestation changes.",
            "Statistical multidirectional line dark channel for single-image dehazing.",
            "New over-relaxed monotone fast iterative shrinkage-thresholding algorithm for linear inverse problems.",
            "HPILN: a feature learning framework for cross-modality person re-identification.",
            "Image encryption algorithm based on image hashing, improved chaotic mapping and DNA coding.",
            "Defect inspection research on fabric based on template correction and primitive decomposition.",
            "Learning mean progressive scattering using binomial truncated loss for image dehazing."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 269,
        "papers": [
            "Comprehensive survey of 3D image steganography techniques.",
            "Crowd counting considering network flow constraints in videos.",
            "Restoring highly corrupted images by impulse noise using radial basis functions interpolation.",
            "Numerical accuracy of integral images computation algorithms.",
            "Secure chaotic dual encryption scheme for H.264/AVC video conferencing protection.",
            "Automatic choroid layer segmentation using normalized graph cut.",
            "Innovative CFAR detector with effective parameter estimation method for generalised gamma distribution and iterative sliding window strategy.",
            "Small target detection based on reweighted infrared patch-image model.",
            "Recognition of complex static hand gestures by using the wristband-based contour features.",
            "Haze removal for unmanned aerial vehicle aerial video based on spatial-temporal coherence optimisation.",
            "Improving the robustness of motion vector temporal descriptor.",
            "Multiscale adaptive regularisation Savitzky-Golay method for speckle noise reduction in ultrasound images.",
            "Statistical search range adaptation solution for effective frame rate up-conversion.",
            "Natural image illuminant estimation via deep non-negative matrix factorisation.",
            "FBSLS model for image segmentation.",
            "Anomaly detection and localisation in the crowd scenes using a block-based social force model.",
            "Guided filter-based images fusion algorithm for CT and MRI medical images.",
            "Collaborative filtering model for enhancing fingerprint image.",
            "Cryptographic algorithm based on pixel shuffling and dynamical chaotic economic map.",
            "Erratum: A new cryptographic algorithm based on pixel shuffling and dynamical chaotic economic map.",
            "CMFD: a detailed review of block based and key feature based techniques in image copy-move forgery detection.",
            "Improved particle swarm optimisation to estimate bone age.",
            "Non-invasive detection of alcohol concentration based on photoplethysmogram signals.",
            "Combined imaging matching method of side scan sonar images with prior position knowledge.",
            "License number plate recognition system using entropy-based features selection approach with SVM.",
            "Perceptual hash algorithm-based adaptive GOP selection algorithm for distributed compressive video sensing.",
            "AC coefficient and K-means cuckoo optimisation algorithm-based segmentation and compression of compound images.",
            "Image smoothing via truncated ℓ 0 gradient regularisation.",
            "Low-complexity and efficient image coder/decoder with quad-tree search model for embedded computing platforms.",
            "Optimisation of HEVC motion estimation exploiting SAD and SSD GPU-based implementation.",
            "Iterative weighted sparse representation for X-ray cardiovascular angiogram image denoising over learned dictionary.",
            "Image decomposition and texture analysis via combined bi-dimensional Bedrosian's principles.",
            "Efficient fingerprint matching using GPU.",
            "Model for smoothing and segmentation of texture images using L 0 norm.",
            "Hue preserving-based approach for underwater colour image enhancement.",
            "Mesh-free approach for enhancement of mammograms.",
            "Speckle suppression in medical ultrasound images through Schur decomposition.",
            "Improved colour-to-grey method using image segmentation and colour difference model for colour vision deficiency.",
            "Anomaly classification in digital mammography based on multiple-instance learning.",
            "Fast-efficient algorithm of high-profile intra prediction for H.264 encoding system.",
            "Medical image rigid registration using a novel binary feature descriptor and modified affine transform.",
            "Robust image fusion with block sparse representation and online dictionary learning.",
            "Improved side information generation algorithm based on naive Bayesian theory for distributed video coding.",
            "Fast vanishing point detection method based on road border region estimation.",
            "Perceptual video quality metric for compression artefacts: from two-dimensional to omnidirectional.",
            "Geometrical flow-guided fast beamlet transform for crack detection.",
            "Robust retinal blood vessel segmentation using line detectors with multiple masks.",
            "Locality and context-aware top-down saliency.",
            "Robust face recognition via non-linear correlation filter bank.",
            "Colour balancing using sclera colour.",
            "Randomised visual secret sharing scheme for grey-scale and colour images.",
            "Gyrator wavelet transform.",
            "Text line segmentation using a fully convolutional network in handwritten document images.",
            "Acceleration of histogram-based contrast enhancement via selective downsampling.",
            "Fuzzy enhanced image fusion using pixel intensity control.",
            "Effective image enhancement techniques for fog-affected indoor and outdoor images.",
            "Colour image encryption algorithm using one-time key and FrFT.",
            "Hash rearrangement scheme for HEVC screen content coding.",
            "Image denoising method based on a deep convolution neural network.",
            "Automatic segmentation and reconstruction of historical manuscripts in gradient domain.",
            "Fast and Automatically Adjustable GRBF Kernel Based Fuzzy C-Means for Cluster-wise Coloured Feature Extraction and Segmentation of MR Images.",
            "Information fusion for unsupervised image segmentation using stochastic watershed and Hessian matrix.",
            "Rapid contour detection for image classification.",
            "Hybrid fitting energy-based fast level set model for image segmentation solving by algebraic multigrid and sparse field method.",
            "Fast detection method of quick response code based on run-length coding.",
            "Fast and robust homography estimation method with algebraic outlier rejection.",
            "Deep multiple instance learning for automatic detection of diabetic retinopathy in retinal images.",
            "HWFusion: Holoentropy and SP-Whale optimisation-based fusion model for magnetic resonance imaging multimodal image fusion.",
            "Dark target effectiveness for dark-object subtraction atmospheric correction method on mangrove above-ground carbon stock mapping.",
            "Detection of morphology defects in pipeline based on 3D active stereo omnidirectional vision sensor.",
            "Global abnormal events detection in crowded scenes using context location and motion-rich spatio-temporal volumes.",
            "Towards an accurate and fast computation of discrete Tchebychev moments for binary and grey-level images.",
            "Scene flow for 3D laser scanner and camera system.",
            "Erratum: 'Comprehensive survey of 3D image steganography techniques'.",
            "Image colourisation by non-local total variation method in the CB and YIQ colour spaces.",
            "Edge preserving suppression for depth estimation via comparative variation.",
            "Single image dehazing using local linear fusion.",
            "Fast mode decision method based on edge feature for HEVC inter-prediction.",
            "Robust fuzzy c-means clustering algorithm using non-parametric Bayesian estimation in wavelet transform domain for noisy MR brain image segmentation.",
            "Local similarity refinement of shape-preserved warping for parallax-tolerant image stitching.",
            "Retinal vessel segmentation using neural network.",
            "Normal curvature-induced variational model for image restoration.",
            "New colour morphological operators on hypergraph.",
            "CT and MR image information fusion scheme using a cascaded framework in ripplet and NSST domain.",
            "CT image denoising using NLM and correlation-based wavelet packet thresholding.",
            "Hybrid model of diffusion based on the Jeffreys-type equation for noise reduction on images.",
            "Region growing for image segmentation using an extended PCNN model.",
            "Fast intra bit rate transcoding for HEVC screen content coding.",
            "Curvelet analysis of breast masses on dynamic magnetic resonance mammography.",
            "Transform-based watermarking algorithm maintaining perceptual transparency.",
            "Revealing the traces of histogram equalisation in digital images.",
            "Adaptive image interpolation technique based on cubic trigonometric B-spline representation.",
            "Hybrid image denoising method based on non-subsampled contourlet transform and bandelet transform.",
            "Adaptive image segmentation method based on the fuzzy c-means with spatial information.",
            "Wire segmentation for printed circuit board using deep convolutional neural network and graph cut model.",
            "Hyperspectral anomaly detection using differential image.",
            "Perceptual stereoscopic image quality assessment method with tensor decomposition and manifold learning.",
            "Patch strategy for deep face recognition.",
            "Sparse representation-based face recognition against expression and illumination.",
            "Point-based spatial colour sampling in Milano-Retinex: a survey.",
            "BCH-LSH: a new scheme of locality-sensitive hashing.",
            "Automatic centroid extraction method for noisy star image.",
            "Adaptive probability filter for removing salt and pepper noises.",
            "Improved SSIM IQA of contrast distortion based on the contrast sensitivity characteristics of HVS.",
            "Criteria to evaluate the fidelity of image enhancement by MSRCR.",
            "Correction of micro-CT image geometric artefacts based on marker.",
            "Action recognition using fast HOG3D of integral videos and Smith-Waterman partial matching.",
            "Curvelet-based multiscale denoising using non-local means & guided image filter.",
            "Automated method for the detection and segmentation of drusen in colour fundus image for the diagnosis of age-related macular degeneration.",
            "Multiframe super-resolution based on a high-order spatially weighted regularisation.",
            "Hyperspectral image classification based on adaptive-weighted LLE and clustering-based FSVMs.",
            "Spatially adaptive total variation deblurring with split Bregman technique.",
            "Matrix completion via capped nuclear norm.",
            "Proposed adaptive joint error-resilience concealment algorithms for efficient colour-plus-depth 3D video transmission.",
            "Hierarchical palmprint feature extraction and recognition based on multi-wavelets and complex network.",
            "Contour detection model using linear and non-linear modulation based on non-CRF suppression.",
            "Emotion recognition from facial expressions using hybrid feature descriptors.",
            "Pansharpening scheme using filtering in two-dimensional discrete fractional Fourier transform.",
            "Efficient design of BinDCT in quantum-dot cellular automata (QCA) technology.",
            "Biomedical compound figure detection using deep learning and fusion techniques.",
            "Semi-automatic leaf disease detection and classification system for soybean culture.",
            "Saliency-based dark channel prior model for single image haze removal.",
            "Locality sensitive hashing based space partitioning approach for indexing multidimensional feature vectors of fingerprint image data.",
            "Efficient image steganography using graph signal processing.",
            "Generalised non-locally centralised image de-noising using sparse dictionary.",
            "Image segmentation fusion using weakly supervised trace-norm multi-task learning method.",
            "Image filtering method using trimmed statistics and edge preserving.",
            "Fuzzy multiclass active learning for hyperspectral image classification.",
            "Effect of fusing features from multiple DCNN architectures in image classification.",
            "Multi-directional colour edge detector using LQS convolution.",
            "Adaptive active contours based on variable kernel with constant initialisation.",
            "SAR image segmentation algorithm based on Contourlet domain AFMRF model.",
            "Automatic object extraction from images using deep neural networks and the level-set method.",
            "Saliency enabled compression in JPEG framework.",
            "Automated spectral domain approach of quasi-periodic denoising in natural images using notch filtration with exact noise profile.",
            "Image completion using multispectral imaging.",
            "Multiple hypothesis tracking algorithm for multi-target multi-camera tracking with disjoint views.",
            "Factoring two-dimensional two-channel non-separable stripe filter banks into lifting steps.",
            "Two reversible data hiding schemes for VQ-compressed images based on index coding.",
            "K-unknown models detection through clustering in blind source camera identification.",
            "Visual tracking via ensemble autoencoder.",
            "Neighbourhood decision based impulse noise filter.",
            "Rules of photography for image memorability analysis.",
            "Visibility distance estimation in foggy situations and single image dehazing based on transmission computation model.",
            "JPEG image width estimation for file carving.",
            "Automatic benign and malignant classification of pulmonary nodules in thoracic computed tomography based on RF algorithm.",
            "Investigating local orientation methods to segment microstructure with 3D solid texture.",
            "Colour image encryption technique using differential evolution in non-subsampled contourlet transform domain.",
            "Hot spot method for pedestrian detection using saliency maps, discrete Chebyshev moments and support vector machine.",
            "Extended scale invariant local binary pattern for background subtraction.",
            "Localisation and segmentation of optic disc with the fractional-order Darwinian particle swarm optimisation algorithm.",
            "Minimum elastic bounding box algorithm for dimension detection of 3D objects: a case of airline baggage measurement.",
            "Brain MRI segmentation by combining different MRI modalities using Dempster-Shafer theory.",
            "Image region annotation based on segmentation and semantic correlation analysis.",
            "Modified spatial neutrosophic clustering technique for boundary extraction of tumours in B-mode BUS images.",
            "Sparse patch-based representation with combined information of atlas for multi-atlas label fusion.",
            "Efficient bivariate image denoising technique using new orthogonal CWT filter design.",
            "Image seamless stitching and straightening based on the image block.",
            "Calculation of phase fraction in steel microstructure images using random forest classifier.",
            "Fast adaptive and selective mean filter for the removal of high-density salt and pepper noise.",
            "Some variants of spiral LBP in texture recognition.",
            "Edge-preserving image denoising.",
            "Adaptive decomposition method for multi-modal medical image fusion.",
            "Level set evolution with sparsity constraint for object extraction.",
            "Correlation filter-based visual tracking via adaptive weighted CNN features fusion.",
            "Convolutional neural network for smooth filtering detection.",
            "Illumination-based texture descriptor and fruitfly support vector neural network for image forgery detection in face images.",
            "Improved multi-scale line detection method for retinal blood vessel segmentation.",
            "Thorough approach toward cylindrical MMW image reconstruction using sparse antenna array.",
            "Ensemble classifier-based off-line handwritten word recognition system in holistic approach.",
            "Fractal triangular search: a metaheuristic for image content search.",
            "Lossless and reversible colour space transformation for Bayer colour filter array images.",
            "Multifeature-based medical image segmentation.",
            "Composite filtering strategy for improving distortion invariance in object recognition.",
            "Image smoothing via a scale-aware filter and L 0 norm.",
            "Anti-occlusion particle filter object-tracking method based on feature fusion.",
            "Backprojection inverse filtration for laminographic reconstruction.",
            "Efficient approach for the automatic detection of haemorrhages in colour retinal images.",
            "Study on the method of colour image noise reduction based on optimal channel-processing.",
            "Improved visual/infrared colour fusion method with double-opponency colour constancy mechanism.",
            "Efficient direction-oriented search algorithm for block motion estimation.",
            "Survey on various lane and driver detection techniques based on image processing for hilly terrain.",
            "Structure-based interpolation method for restoring the intensity of low-density impulse noise.",
            "Regularisation learning of correlation filters for robust visual tracking.",
            "Plane detection in 3D point cloud using octree-balanced density down-sampling and iterative adaptive plane extraction.",
            "Statistical geometric components of straight lines (SGCSL) feature extraction method for offline Arabic/Persian handwritten words recognition.",
            "Plateau limit-based tri-histogram equalisation for image enhancement.",
            "Review of wavelet-based unsupervised texture segmentation, advantage of adaptive wavelets.",
            "Unrestricted LR detection for biomedical applications using coarse-to-fine hierarchical approach.",
            "Background subtraction using Gaussian-Bernoulli restricted Boltzmann machine.",
            "Non-parametric mixture model with TV spatial regularisation and its dual expectation maximisation algorithm.",
            "Efficient 3D mesh salient region detection using local homogeneity measure.",
            "Deriving scale normalisation factors for a GLoG detector.",
            "Cross-channel regularisation for joint demosaicking and intrinsic lens deblurring.",
            "Daubechies wavelet-based local feature descriptor for multimodal medical image registration.",
            "Depth extraction method with subpixel matching for light-coding-based depth camera.",
            "Three-dimensional image registration using distributed parallel computing.",
            "Efficient approach for non-ideal iris segmentation using improved particle swarm optimisation-based multilevel thresholding and geodesic active contours.",
            "Fast enhancement algorithm of highway tunnel image based on constraint of imaging model.",
            "Denoising hyperspectral images using Hilbert vibration decomposition with cluster validation.",
            "Non-rigid point set registration by high-dimensional representation.",
            "Memory-efficient architecture of circle Hough transform and its FPGA implementation for iris localisation.",
            "Entropy-based variational Bayes learning framework for data clustering.",
            "Orthogonal gradient measurement matrix optimisation method.",
            "Hand gesture recognition using DWT and F-ratio based feature descriptor.",
            "Subjectively correlated estimation of noise due to blurriness distortion based on auto-regressive model using the Yule-Walker equations.",
            "Circular trace transform and its PCA-based fusion features for image representation.",
            "Fast matching pursuit for sparse representation-based face recognition.",
            "Image splicing detection based on Markov features in discrete octonion cosine transform domain.",
            "Hyperspectral image super-resolution under misaligned hybrid camera system.",
            "Adaptive spatio-temporal background subtraction using improved Wronskian change detection scheme in Gaussian mixture model framework.",
            "Probabilistic binary similarity distance for quick binary image matching.",
            "FPR using machine learning with multi-feature method.",
            "Multi-stage filtering for single rainy image enhancement.",
            "Non-subsampled shearlet transform based MRI and PET brain image fusion using simplified pulse coupled neural network and weight local features in YIQ colour space.",
            "Segmentation of the lumen and media-adventitial borders in intravascular ultrasound images using a geometric deformable model.",
            "Adaptive patched L0 gradient minimisation model applied on image smoothing.",
            "Motion and illumination defiant cut detection based on Weber features.",
            "Colour image encryption via fractional chaotic state estimation.",
            "Handwritten Hindi character recognition: a review.",
            "Deep learning-based approach to latent overlapped fingerprints mask segmentation.",
            "Semantic image segmentation using an improved hierarchical graphical model.",
            "Using feature points and angles between them to recognise facial expression by a neural network approach.",
            "Gradation of diabetic retinopathy on reconstructed image using compressed sensing.",
            "Fully automated brain tumour segmentation system in 3D-MRI using symmetry analysis of brain and level sets.",
            "Two-step evidential fusion approach for accurate breast region segmentation in mammograms.",
            "Blind image quality assessment based on Benford's law.",
            "Watermarking image encryption using deterministic phase mask and singular value decomposition in fractional Mellin transform domain.",
            "Two improved extension of local binary pattern descriptors using wavelet transform for texture classification.",
            "Using a generalised method of moment approach and 2D-generalised autoregressive conditional heteroscedasticity modelling for denoising ultrasound images.",
            "Occlusion-robust object tracking based on the confidence of online selected hierarchical features.",
            "Image segmentation algorithm based on superpixel clustering.",
            "Multi-scale deep neural network for salient object detection.",
            "Enhancement of dim targets in a sea background based on long-wave infrared polarisation features.",
            "Change detection in Landsat images based on local neighbourhood information.",
            "Detection and analysis of large-scale WT blade surface cracks based on UAV-taken images.",
            "PLT-based spectral features for texture image retrieval.",
            "BAT algorithm inspired retinal blood vessel segmentation.",
            "Spatialising uncertainty in image segmentation using weakly supervised convolutional neural networks: a case study from historical map processing.",
            "Keypoints based enhanced multiple copy-move forgeries detection system using density-based spatial clustering of application with noise clustering algorithm.",
            "Automatic detection and segmentation of optic disc and fovea in retinal images.",
            "View synthesis method for 3D video coding based on temporal and inter view correlation.",
            "Efficient interpolated compressed sensing reconstruction scheme for 3D MRI.",
            "Statistical characterisation of block variance and AC DCT coefficients for power law enhanced images.",
            "Local multiscale blur estimation based on toggle mapping for sharp region extraction.",
            "Dynamical stochastic resonance for non-uniform illumination image enhancement.",
            "Classification of EEG signals for detection of epileptic seizure activities based on feature extraction from brain maps using image processing algorithms.",
            "Retinal blood vessel segmentation using the elite-guided multi-objective artificial bee colony algorithm.",
            "Modified mean shift algorithm.",
            "Robust image hashing using exact Gaussian-Hermite moments.",
            "Multilevel magnetic resonance imaging compression using compressive sensing.",
            "Tool for automatic tuning of binarisation techniques.",
            "Improvement of global motion estimation in two-dimensional digital video stabilisation methods.",
            "Comparison of level set models in image segmentation.",
            "Detection of vehicle wheels from images using a pseudo-wavelet filter for analysis of congested traffic.",
            "Efficient coarser-to-fine holistic traffic sign detection for occlusion handling.",
            "Multiple-parameter fractional quaternion Fourier transform and its application in colour image encryption.",
            "Video denoising algorithm based on improved dual-domain filtering and 3D block matching.",
            "Scene invariant crowd counting using multi-scales head detection in video surveillance.",
            "Poisson image denoising by piecewise principal component analysis and its application in single-particle X-ray diffraction imaging.",
            "Salient region detection using feature extraction in the non-subsampled contourlet domain.",
            "Single-pixel compressive imaging based on motion compensation.",
            "Multi-frame super-resolution algorithm using common vector approach.",
            "Method based on bitonic filtering decomposition and sparse representation for fusion of infrared and visible images.",
            "Fast codebook design method for image vector quantisation.",
            "Hierarchical CNN-based real-time fatigue detection system by visual-based technologies using MSP model.",
            "GrabCut algorithm for dental X-ray images based on full threshold segmentation.",
            "Deep learning features for robust facial kinship verification.",
            "Denoising of ultrasound images affected by combined speckle and Gaussian noise."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 145,
        "papers": [
            "Generalised fuzzy c-means clustering algorithm with local information.",
            "Single-image super resolution using evolutionary sparse coding technique.",
            "Fast motion estimation algorithm using multilevel distortion search in Walsh-Hadamard domain.",
            "Real-time multi-feature based fire flame detection in video.",
            "Underwater image colour constancy based on DSNMF.",
            "Splicing image forgery detection using textural features based on the grey level co-occurrence matrices.",
            "Image denoising based on sparse representation and gradient histogram.",
            "Wavelet denoising of multiframe optical coherence tomography data using similarity measures.",
            "Three-dimensional separate descendant-based SPIHT algorithm for fast compression of high-resolution medical image sequences.",
            "New content-based image retrieval system based on optimised integration of DCD, wavelet and curvelet features.",
            "Copy-move forgery detection based on multi-radius PCET.",
            "Hybrid local and global descriptor enhanced with colour information.",
            "Structural difference histogram representation for texture image classification.",
            "Low-complexity feedback-channel-free distributed video coding using local rank transform.",
            "Fast single image SR via dictionary learning.",
            "Single image dehazing by latent region-segmentation based transmission estimation and weighted L 1-norm regularisation.",
            "MR image reconstruction using cosupport constraints and group sparsity regularisation.",
            "Edge patch image-based morphological profiles for classification of multispectral and hyperspectral data.",
            "Analysis of produce recognition system with taxonomist's knowledge using computer vision and different classifiers.",
            "Automated marker identification using the Radon transform for watershed segmentation.",
            "Supervised sparse neighbourhood preserving embedding.",
            "Fast algorithm for hybrid region-based active contours optimisation.",
            "Colour image encryption based on logistic mapping and double random-phase encoding.",
            "Robust fuzzy local information and L p -norm distance-based image segmentation method.",
            "Bionic RSTN invariant feature extraction method for image recognition and its application.",
            "Segmentation of the left ventricle in short-axis sequences by combining deformation flow and optical flow.",
            "Efficient frame-level bit allocation algorithm for H.265/HEVC.",
            "Complete three-phase detection framework for identifying abnormal cervical cells.",
            "Hyperspectral face recognition via feature extraction and CRC-based classifier.",
            "RKEM: Redundant Keypoint Elimination Method in Image Registration.",
            "Image colourisation using linear neighbourhood propagation and weighted smoothing.",
            "Quality index evaluation of videos based on fuzzy interface system.",
            "Blur-invariant copy-move forgery detection technique with improved detection accuracy utilising SWT-SVD.",
            "Regularised differentiation for image derivatives.",
            "Pruned non-local means.",
            "Chaos-based fast colour image encryption scheme with true random number keys from environmental noise.",
            "Frame duplication/mirroring detection method with binary features.",
            "Fast coding algorithm for HEVC based on video contents.",
            "Combination of adaptive vector median filter and weighted mean filter for removal of high-density impulse noise from colour images.",
            "Hardware efficient multiplier-less multi-level 2D DWT architecture without off-chip RAM.",
            "Multiple Laplacian graph regularised low-rank representation with application to image representation.",
            "Lossless image compression algorithm and hardware architecture for bandwidth reduction of external memory.",
            "Unsupervised cluster-based method for segmenting biological tumour volume of laryngeal tumours in 18F-FDG-PET images.",
            "IR small target detection based on human visual attention using pulsed discrete cosine transform.",
            "Optimised blind image watermarking method based on firefly algorithm in DWT-QR transform domain.",
            "Step-by-step pipeline processing approach for line segment detection.",
            "Sparse PDE for SAR image speckle suppression.",
            "Development of saliency-based seamless image compositing using hybrid blending (SSICHB).",
            "Hybrid NSS features for no-reference image quality assessment.",
            "Text segmentation using superpixel clustering.",
            "Video stabilisation with total warping variation model.",
            "WN-based approach to melanoma diagnosis from dermoscopy images.",
            "Part-based recognition of vehicle make and model.",
            "Multi-dimensional data representation using linear tensor coding.",
            "Label fusion method based on sparse patch representation for the brain MRI image segmentation.",
            "Semi-guided bilateral filter.",
            "Matrix embedding in steganography with binary Reed-Muller codes.",
            "Hybrid approach to classification of focal and diffused liver disorders using ultrasound images with wavelets and texture features.",
            "Dynamic RGB-to-CMYK conversion using visual contrast optimisation.",
            "Discrete image data transmission in heterogeneous wireless network using vertical handover mechanism.",
            "Estimating just-noticeable distortion for images/videos in pixel domain.",
            "Estimation of edge displacement against brightness and camera-to-object distance.",
            "Localisation of topological features using 3D object representations.",
            "Colour image dehazing using near-infrared fusion.",
            "Mathematical analysis for CSI scheme with the interpolation kernel size increased.",
            "Convergent heterogeneous particle swarm optimisation algorithm for multilevel image thresholding segmentation.",
            "Quantitative metric for MR brain tumour grade classification using sample space density measure of analytic intrinsic mode function representation.",
            "Comprehensive analysis and evaluation to unsupervised binary hashing method in image similarity measurement.",
            "Texture-based image segmentation using neutrosophic clustering.",
            "Design of hardware RGB to HMMD converter based on reversible logic.",
            "Maximum a posteriori-based texture estimation by despeckling of SAR clutter amplitude data.",
            "Modified ultrasound despeckling assessment index for the Field II simulated cyst image.",
            "No-reference quality measure in brain MRI images using binary operations, texture and set analysis.",
            "Implementation of in-loop filter for HEVC decoder on reconfigurable processor.",
            "Improved automated detection of glaucoma from fundus image using hybrid structural and textural features.",
            "Modified simultaneous iterative reconstruction technique for fast, high-quality CT reconstruction.",
            "Effective and adaptive algorithm for pepper-and-salt noise removal.",
            "Fast CU partition strategy for HEVC based on Haar wavelet.",
            "New non-negative sparse feature learning approach for content-based image retrieval.",
            "Fractional-order tensor regularisation for image inpainting.",
            "Review, analysis and parameterisation of techniques for copy-move forgery detection in digital images.",
            "Histogram of Radon transform and texton matrix for texture analysis and classification.",
            "Image denoising using generalised Cauchy filter.",
            "Generalised rough intuitionistic fuzzy c-means for magnetic resonance brain image segmentation.",
            "Image enhancement for outdoor long-range surveillance using IQ-learning multiscale Retinex.",
            "Fine feature sensitive marching squares.",
            "Guest Editorial: Advances in Big Data Methods for Image Processing.",
            "Muzzle point pattern based techniques for individual cattle identification.",
            "Digital image watermarking method based on DCT and fractal encoding.",
            "3D model watermarking algorithm robust to geometric attacks.",
            "Fast pedestrian detection and dynamic tracking for intelligent vehicles within V2V cooperative environment.",
            "Effective geometric restoration of distorted historical document for large-scale digitisation.",
            "Structured entropy of primitive: big data-based stereoscopic image quality assessment.",
            "Image segmentation using a unified Markov random field model.",
            "Novel image inpainting algorithm based on adaptive fourth-order partial differential equation.",
            "Widening residual skipped network for semantic segmentation.",
            "Diagonal-based fast intra-mode decision algorithm for HEVC.",
            "Hybrid WPT-BDCT transform for high-quality image compression.",
            "Image coding based on classified vector quantisation using edge orientation patterns.",
            "Multi-focus image fusion algorithm based on multilevel morphological component analysis and support vector machine.",
            "Low-latency median filter core for hardware implementation of 5 × 5 median filtering.",
            "Lung field segmentation in chest radiographs: a historical review, current status, and expectations from deep learning.",
            "Some studies on detection and filtering algorithms for the removal of random valued impulse noise.",
            "Adaptive Weberfaces for occlusion-robust face representation and recognition.",
            "Convex-relaxed active contour model based on localised kernel mapping.",
            "Micro-movement magnification in video signals using complex wavelet analysis.",
            "High discriminative SIFT feature and feature pair selection to improve the bag of visual words model.",
            "Reversible data hiding scheme based on significant-bit-difference expansion.",
            "Quantitative growth analysis of pulp necrotic tooth (post-op) using modified region growing active contour model.",
            "Smartphone application for medical images secured exchange based on encryption using the matrix product and the exclusive addition.",
            "Content-based bitrate model for perceived compression distortion evaluation of mobile video services.",
            "Fast pore matching method based on deterministic annealing algorithm.",
            "Image fusion based on multi-scale transform and sparse representation: an image energy approach.",
            "Supervised orthogonal discriminant projection based on double adjacency graphs for image classification.",
            "Improved partial differential equation-based enhancement for underwater images using local-global contrast operators and fuzzy homomorphic processes.",
            "Automatic facial flaw detection and retouching via discriminative structure tensor.",
            "Robust and automatic cell detection and segmentation from microscopic images of non-setae phytoplankton species.",
            "Depth extraction for a structured light system based on mismatched image pair rectification using a virtual camera.",
            "Image segmentation using a hierarchical student's-t mixture model.",
            "Efficient Bayesian approach to saliency detection based on Dirichlet process mixture.",
            "Reconstruction of three-dimensional linear structures in the breast from craniocaudal and mediolateral oblique mammographic views.",
            "Analysis and design of coded apertures for defocus deblurring based on imaging system properties and optical features.",
            "Regularity of spectral residual for reduced reference image quality assessment.",
            "Adaptive localised region and edge-based active contour model using shape constraint and sub-global information for uterine fibroid segmentation in ultrasound-guided HIFU therapy.",
            "Pansharpening approach using Hilbert vibration decomposition.",
            "Scene-aware image dehazing based on sky-segmented dark channel prior.",
            "Robust multi-feature visual tracking via multi-task kernel-based sparse learning.",
            "Low-complexity face recognition using contour-based binary descriptor.",
            "Fast segmentation of ultrasound images by incorporating spatial information into Rayleigh mixture model.",
            "Improved BM3D denoising method.",
            "Texture classification by multifractal spectrum and barycentric coordinates of bit planes of wavelet coefficients.",
            "Robust hypothesis generation method using binary blob analysis for multi-lane detection.",
            "Segmentation of large images based on super-pixels and community detection in graphs.",
            "Maximised self-similarity upsampler.",
            "Image noise types recognition using convolutional neural network with principal components analysis.",
            "Multimodal image registration based on the expectation-maximisation methodology.",
            "Super-resolution reconstruction: using non-local structure similarity and edge sharpness dictionary.",
            "Improved chamfer matching method for surface mount component positioning.",
            "Contrast-aware power control method for mobile active-matrix organic light-emitting diode display.",
            "Integrated tone and structure refinement for high-fidelity colour transfer.",
            "3D MRI image super-resolution for brain combining rigid and large diffeomorphic registration.",
            "Synthetic aperture radar image segmentation using non-linear diffusion-based hierarchical triplet Markov fields model.",
            "Graph-based spatial-spectral feature learning for hyperspectral image classification.",
            "Single image-based HDR image generation with camera response function estimation.",
            "Active Canny: edge detection and recovery with open active contour models."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 109,
        "papers": [
            "Digital video steganalysis toward spread spectrum data hiding.",
            "Early DIRECT mode decision based on all-zero block and rate distortion cost for multiview video coding.",
            "Automatic chessboard corner detection method.",
            "Localised rank-ordered differences vector filter for suppression of high-density impulse noise in colour images.",
            "Block-based discrete wavelet transform-singular value decomposition image watermarking scheme using human visual system characteristics.",
            "Complexity reduction algorithm for prediction unit decision process in high efficiency video coding.",
            "Efficient image classification via sparse coding spatial pyramid matching representation of SIFT-WCS-LTP feature.",
            "Compressed sensing magnetic resonance imaging based on dictionary updating and block-matching and three-dimensional filtering regularisation.",
            "Weighted total generalised variation scheme for image restoration.",
            "Zero coefficient-aware fast butterfly-based inverse discrete cosine transform algorithm.",
            "Image super-resolution based on the pairwise dictionary selected learning and improved bilateral regularisation.",
            "Complex number-based image quality assessment using singular value decomposition.",
            "Active contours for image segmentation using complex domain-based approach.",
            "High capacity turtle shell-based data hiding.",
            "Amplitude-adaptive spread-spectrum data embedding.",
            "Context aware image enhancement for online fish behaviour monitoring.",
            "Stroke width-based directional total variation regularisation for document image super resolution.",
            "Speckle reduction method for thyroid ultrasound images in neutrosophic domain.",
            "Video stabilisation based on modelling of motion imaging.",
            "Extrinsic parameters and focal length calibration using rotation-symmetric patterns.",
            "High-dynamic range image generation from single low-dynamic range image.",
            "Single image dehazing via multi-scale gradient domain contrast enhancement.",
            "Fast coding unit decision and mode selection for intra-frame coding in high-efficiency video coding.",
            "Neural network technique for image compression.",
            "Junction-aware water flow approach for urban road network extraction.",
            "Abnormal event detection and localisation in traffic videos based on group sparse topical coding.",
            "Quality metric-based fitness function for robust watermarking optimisation with Bees algorithm.",
            "Diverse videos synthesis using manifold-based parametric motion model for facial understanding.",
            "Combination of hybrid median filter and total variation minimisation for medical X-ray image restoration.",
            "Adaptive fuzzy c-means algorithm based on local noise detecting for image segmentation.",
            "Noise-insensitive and edge-preserving resolution upconversion scheme for digital image based on the spatial general autoregressive model.",
            "Real-time vehicle detection with foreground-based cascade classifier.",
            "Higher-order MRFs based image super resolution: why not MAP?",
            "High quality impulse noise removal via non-uniform sampling and autoregressive modelling based super-resolution.",
            "Robust fast corner detector based on filled circle and outer ring mask.",
            "Resolution enhancement of textual images: a survey of single image-based methods.",
            "Capillary extraction by detecting polarity in circular profiles.",
            "Grey-level context-driven histogram equalisation.",
            "Spatio-temporal mean curvature based image sequence restoration.",
            "Fast coding unit selection and motion estimation algorithm based on early detection of zero block quantified transform coefficients for high-efficiency video coding standard.",
            "Integration of colour and uniform interlaced derivative patterns for object tracking.",
            "Objectness to assist salient object detection.",
            "Non-local feature back-projection for image super-resolution.",
            "Bio-inspired image enhancement derived from a 'rank order coding' model.",
            "Enhanced mutual information based medical image registration.",
            "Context-based prediction filtering of impulse noise images.",
            "Adaptive low-complexity motion estimation algorithm for high efficiency video coding encoder.",
            "Classification of malignant melanoma and benign skin lesions: implementation of automatic ABCD rule.",
            "Parsing fashion image into mid-level semantic parts based on chain-conditional random fields.",
            "Scheme for unsupervised colour-texture image segmentation using neutrosophic set and non-subsampled contourlet transform.",
            "Inspecting lens collars for defects using discrete cosine transformation based on an image restoration scheme.",
            "Fast localised active contour for inhomogeneous image segmentation.",
            "Alternating direction method for TGV-TGV* based cartoon-texture image decomposition.",
            "Improved probabilistic pseudo-morphology for noise reduction in colour images.",
            "Adaptive scene-text binarisation on images captured by smartphones.",
            "Infrared dim small target detection with high reliability using saliency map fusion.",
            "Spatiotemporal feature extraction for facial expression recognition.",
            "Power-constrained contrast enhancement for organic light-emitting diode display using locality-preserving histogram equalisation.",
            "Directional SUSAN image boundary detection of breast thermogram.",
            "Matching cost function using robust soft rank transformations.",
            "Reference-omitted affine soft correspondence algorithm.",
            "Fast algorithm for least-squares based image prediction.",
            "Distortion-free secret image sharing method with two meaningful shadows.",
            "Sparse representation based on vector extension of reduced quaternion matrix for multiscale image denoising.",
            "Minimisation of local within-class variance for image segmentation.",
            "Facial expression recognition via sparse representation using positive and reverse templates.",
            "Detecting asymmetry in the presence of symmetry with maximum likelihood three-dimensional reconstructions of viruses from electron microscope images.",
            "Quantitative evaluation of margin sharpness of pulmonary nodules in lung CT images.",
            "Real-time video chroma keying: a parallel approach based on local texture and global colour distribution.",
            "Fourier transform-based windowed adaptive switching minimum filter for reducing periodic noise from digital images.",
            "Lunar surface crater topology generation using adaptive edge detection algorithm.",
            "Object recognition using rotation invariant local binary pattern of significant bit planes.",
            "Pyramid coding based rate control for variable bit rate video streaming.",
            "Comments on and corrections to 'Hardware-software co-design architecture for joint photo expert graphic XR encoder'.",
            "Diffusion-steered super-resolution method based on the Papoulis-Gerchberg algorithm.",
            "Fast-efficient shape error concealment technique based on block classification.",
            "Image enhancement based on intuitionistic fuzzy sets theory.",
            "Multilabel statistical shape prior for image segmentation.",
            "Segmentation of the right ventricle in MRI images using a dual active shape model.",
            "Semi-automatic detection of coronary artery stenosis in 3D CTA.",
            "Robust facial landmark detection using mixture of discriminative visibility-aware models.",
            "Image encryption by chaos mixing.",
            "Mid-sagittal plane detection in brain magnetic resonance image based on multifractal techniques.",
            "Combining firefly algorithm and Bayesian classifier: new direction for automatic multilabel image annotation.",
            "Blind image watermarking method based on linear canonical wavelet transform and QR decomposition.",
            "Saliency histogram equalisation and its application to image resizing.",
            "Contrast enhancement using entropy-based dynamic sub-histogram equalisation.",
            "Hybrid bilateral filtering algorithm based on edge detection.",
            "Novel blind colour image watermarking technique using Hessenberg decomposition.",
            "Cryptography of medical images based on a combination between chaotic and neural network.",
            "Simultaneous enhancement and noise reduction of a single low-light image.",
            "Super-speed up robust features image geometrical registration algorithm.",
            "Non-local-based spatially constrained hierarchical fuzzy C-means method for brain magnetic resonance imaging segmentation.",
            "Scene-adaptive single image dehazing via opening dark channel model.",
            "Multilevel framework to handle object occlusions for real-time tracking.",
            "Saliency and depth-based unsupervised object segmentation.",
            "Vanishing point detection using random forest and patch-wise weighted soft voting.",
            "Image decomposition-based blind image deconvolution model by employing sparse representation.",
            "Coupled image restoration model with non-convex non-smooth ℓ p  wavelet frame and total variation regularisation.",
            "Fully automatic figure-ground segmentation algorithm based on deep convolutional neural network and GrabCut.",
            "Simple median-based EP PP scheme for enhancement of reconstructed Bayer colour filter array images.",
            "Image denoising via bidirectional low rank representation with cluster adaptive dictionary.",
            "Denoising model for parallel magnetic resonance imaging images using higher-order Markov random fields.",
            "Robust image authentication scheme with self-repair capability for greyscale source document images via PNG format.",
            "Semi-real-time algorithm for fast pattern matching.",
            "Kernelised supervised context hashing.",
            "Haze removal for a single inland waterway image using sky segmentation and dark channel prior.",
            "Level set method for image segmentation based on local variance and improved intensity inhomogeneity model.",
            "When spatial distribution unites with spatial contrast: an effective blind image quality assessment model."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 120,
        "papers": [
            "Single-frame image super-resolution inspired by perceptual criteria.",
            "Local gradient-based illumination invariant face recognition using local phase quantisation and multi-resolution local binary pattern fusion.",
            "New reversible full-embeddable information hiding method for vector quantisation indices based on locally adaptive complete coding list.",
            "Towards blind detection of low-rate spatial embedding in image steganalysis.",
            "Local brightness adaptive image colour enhancement with Wasserstein distance.",
            "Semantic image compression based on data hiding.",
            "Segmentation with saliency map using colour and depth images.",
            "Efficient image sharpening and denoising using adaptive guided image filtering.",
            "High-speed quantile-based histogram equalisation for brightness preservation and contrast enhancement.",
            "Locally principal component analysis based on L1-norm maximisation.",
            "RANdom sample consensus (RANSAC) algorithm for enhancing overlapped etched track counting.",
            "Speckle filtering of ultrasound images using a modified non-linear diffusion model in non-subsampled shearlet domain.",
            "Single-image shadow detection and removal using local colour constancy computation.",
            "Corrected unwrapping method based on the tangential and radial distortion centre for the panoramic annular image.",
            "Variational approach for multi-source image fusion.",
            "Spatially adaptive image denoising using inter-scale dependence in directionlet domain.",
            "Fractal image coding algorithm using particle swarm optimisation and hybrid quadtree partition scheme.",
            "Automatic detection and removal of high-density impulse noises.",
            "Image compression and encryption scheme using fractal dictionary and Julia set.",
            "Histogram of dense subgraphs for image representation.",
            "Tuned depth signal analysis on merged transform domain for view synthesis in free viewpoint systems.",
            "Active contours with prior corner detection to extract discontinuous boundaries of anatomical structures in X-ray images.",
            "Patch-based locality-enhanced collaborative representation for face recognition.",
            "Adaptive CLEAN algorithm for millimetre wave synthetic aperture imaging radiometer in near field.",
            "Entropy maximisation histogram modification scheme for image enhancement.",
            "Synthetic aperture radar image despeckling via total generalised variation approach.",
            "Shape registration using characteristic functions.",
            "Focal and diffused liver disease classification from ultrasound images based on isocontour segmentation.",
            "Image segmentation framework based on multiple feature spaces.",
            "Linear colour correction for multiple illumination changes and non-overlapping cameras.",
            "Enhanced side match vector quantisation based on constructing complementary state codebook.",
            "Second-order steganographic method based on adaptive reference matrix.",
            "Content-based image retrieval in dermatology using intelligent technique.",
            "Infrared-visible video fusion based on motion-compensated wavelet transforms.",
            "Acquisition source identification through a blind image classification.",
            "Bayesian denoising of ultrasound images using heavy-tailed Levy distribution.",
            "Simultaneous image fusion and denoising with adaptive sparse representation.",
            "Fast large-scale image enlargement method with a novel evaluation approach: benchmark function-based peak signal-to-noise ratio.",
            "Colour compressed sensing imaging via sparse difference and fractal minimisation recovery.",
            "Spelled sign word recognition using key frame.",
            "Improved fast mean shift algorithm for remote sensing image segmentation.",
            "Image transmission using unequal error protected multi-fold turbo codes over a two-user power-line binary adder channel.",
            "Efficient iris localisation using a guided filter.",
            "Decomposition by binary codes-based speedy image encryption algorithm for multiple applications.",
            "Towards automatic image analysis and assessment of the multicellular apoptosis process.",
            "Multiple-constraint variational framework and image restoration problems.",
            "Deinterlacing algorithm using gradient-guided interpolation and weighted average of directional estimation.",
            "Single-image super-resolution in RGB space via group sparse representation.",
            "Hardware architectures for the H.265/HEVC discrete cosine transform.",
            "Variants of seeded region growing.",
            "Computer-aided analysis of fluorescein angiograms using colour leakage maps.",
            "Colour image steganography method based on sparse representation.",
            "Interesting components detection for space satellites from inverse synthetic aperture radar image via feature probabilistic estimation.",
            "Anisotropic adaptive method for triangular meshes smoothing.",
            "Vehicle logo recognition by weighted multi-class support vector machine ensembles based on sharpness histogram features.",
            "Incorporating approximate rotational invariance into two-dimensional S-transform.",
            "Steganalysis of JPEG images using enhanced neighbouring joint density features.",
            "Improving image clarity using local feature dimension.",
            "Reversible data hiding in JPEG images utilising zero quantised coefficients.",
            "Gaussian mixture model-based contrast enhancement.",
            "Local neighbourhood-based robust colour occurrence descriptor for colour image retrieval.",
            "Fast three-dimensional video coding encoding algorithms based on edge information of depth map.",
            "Video-based facial expression recognition by removing the style variations.",
            "Low-cost and high-speed hardware implementation of contrast-preserving image dynamic range compression for full-HD video enhancement.",
            "Robust medical image watermarking technique for accurate detection of tampers inside region of interest and recovering original region of interest.",
            "Supervised locally linear embedding algorithm based on orthogonal matching pursuit.",
            "Texture descriptor based on local combination adaptive ternary pattern.",
            "Logarithmical hopping encoding: a low computational complexity algorithm for image compression.",
            "High-speed implementation of rate-distortion optimised quantisation for H.265/HEVC.",
            "Efficient naturalness restoration for non-uniform illumination images.",
            "Wavelet-based blind deconvolution of near-field ultrasound scans.",
            "Security analysis of a three-dimensional rotation-based image encryption.",
            "Real-world gender classification via local Gabor binary pattern and three-dimensional face reconstruction by generic elastic model.",
            "Fast computation of residual complexity image similarity metric using low-complexity transforms.",
            "Image denoising using common vector approach.",
            "Local selected features of dual-tree complex wavelet transform for single sample face recognition.",
            "Real-time single image dehazing using block-to-pixel interpolation and adaptive dark channel prior.",
            "Automated segmentation of the epidermis area in skin whole slide histopathological images.",
            "Vessel transform for automatic optic disk detection in retinal images.",
            "Human colour skin detection in CMYK colour space.",
            "Moving visual focus in salient object segmentation.",
            "New interface for musical instruments using lip reading.",
            "Variable bit rate video traffic prediction based on kernel least mean square method.",
            "Digital image watermarking using partial pivoting lower and upper triangular decomposition into the wavelet domain.",
            "Locality-sensitive hashing for region-based large-scale image indexing.",
            "Robust moving object detection using compressed sensing.",
            "Small dim object tracking using a multi objective particle swarm optimisation technique.",
            "Robust deblurring based on prediction of informative structure.",
            "Content-based image retrieval using fuzzy class membership and rules based on classifier confidence.",
            "Real-time image smoke detection using staircase searching-based dual threshold AdaBoost and dynamic analysis.",
            "Tumour localisation in ultrasound-guided high-intensity focused ultrasound ablation using improved gradient and direction vector flow.",
            "Context-driven hybrid image inpainting.",
            "Handwritten numeral recognition using non-redundant Stockwell transform and bio-inspired optimal zoning.",
            "Feature structure fusion modelling for classification.",
            "Colour retinal fundus image registration by selecting stable extremum points in the scale-invariant feature transform detector.",
            "Improved centroid extraction algorithm for autonomous star sensor.",
            "Combination of contrast limited adaptive histogram equalisation and discrete wavelet transform for image enhancement.",
            "Revised spectral matching algorithm for scenes with mutually inconsistent local transformations.",
            "Guest Editorial.",
            "Unsupervised domain adaptation using eigenanalysis in kernel space for categorisation tasks.",
            "Super-resolution reconstruction based on multisource bidirectional similarity and non-local similarity matching.",
            "Multi-step radiographic image enhancement conforming to weld defect segmentation.",
            "Fuzzy match index for scale-invariant feature transform (SIFT) features with application to face recognition with weak supervision.",
            "Particle filter with occlusion handling for visual tracking.",
            "Information fusion from multiple cameras for gait-based re-identification and recognition.",
            "Salient object detection based on meanshift filtering and fusion of colour information.",
            "High-quality initial codebook design method of vector quantisation using grouping strategy.",
            "Compressive sensing measurement matrix construction based on improved size compatible array LDPC code.",
            "Topomorphological approach to automatic posture recognition in ballet dance.",
            "Adaptive extended piecewise histogram equalisation for dark image enhancement.",
            "Recent review on image clustering.",
            "Binary image enhancement based on aperiodic stochastic resonance.",
            "Accurate system for automatic pill recognition using imprint information.",
            "Super resolution reconstruction based on block matching and three-dimensional filtering with sharpening.",
            "Wavelets-based smoothness comparisons for volume data.",
            "Benchmarking of wildland fire colour segmentation algorithms.",
            "Multi-round dynamic swap optimisation for table-based steganography.",
            "High-performance high dynamic range image generation by inverted local patterns.",
            "Optimised cubic spline approximations of image contours using points suppression.",
            "Signal-walking-driven active contour model."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 84,
        "papers": [
            "Annularcut: A graph-cut design for left ventricle segmentation from magnetic resonance images.",
            "Performance analysis of hierarchical transform coding with a large kernel for video codecs.",
            "Efficient wavelet-based perceptual watermark masking for robust fingerprint image watermarking.",
            "Hardware stream cipher with controllable chaos generator for colour image encryption.",
            "Colour edge detection based on the fusion of hue component and principal component analysis.",
            "Segmentation of sows in farrowing pens.",
            "Semi-automatic object segmentation using colour invariance and Graph cuts.",
            "One-third probability embedding: a new ±1 histogram compensating image least significant bit steganography scheme.",
            "Fine logarithmic adaptive soft morphological algorithm for synthetic aperture radar image segmentation.",
            "Image segmentation by dirichlet process mixture model with generalised mean.",
            "Fast hardware architecture for grey-level image morphology with flat structuring elements.",
            "An approach for chest tube detection in chest radiographs.",
            "Filtering of mixed Gaussian and impulsive noise using morphological contrast detectors.",
            "Robust image hashing via colour vector angles and discrete wavelet transform.",
            "Neighbourhood weighted fuzzy c-means clustering algorithm for image segmentation.",
            "Geometric modelling of the wavelet coefficients for image watermarking using optimum detector.",
            "Index compression for vector quantisation using modified coding tree assignment scheme.",
            "Image fusion using multiscale edge-preserving decomposition based on weighted least squares filter.",
            "Efficient residual coding algorithm based on hadamard transform in lossless H.264/AVC.",
            "Efficient adaptive fuzzy-based switching weighted average filter for the restoration of impulse corrupted digital images.",
            "Greedy framework for optical flow tracking of myocardium contours.",
            "Reduced memory, low complexity embedded image compression algorithm using hierarchical listless discrete tchebichef transform.",
            "New accelerated graph-based method of image segmentation applying minimum spanning tree.",
            "Edge-preserving colour-to-greyscale conversion.",
            "Edge detection for illumination varying images using wavelet similarity.",
            "Robust multilane detection and tracking in urban scenarios based on LIDAR and mono-vision.",
            "Visual wafer dies counting using geometrical characteristics.",
            "New optimised region-based multi-scale image fusion method for thermal and visible images.",
            "Multiview face recognition based on multilinear decomposition and pose manifold.",
            "Informative visual words construction to improve bag of words image representation.",
            "Performance improvement of fuzzy-based algorithms for medical image retrieval.",
            "Adaptive image segmentation by using mean-shift and evolutionary optimisation.",
            "Single change detection-based moving object segmentation by using Daubechies complex wavelet transform.",
            "Area-delay-power-efficient architecture for folded two-dimensional discrete wavelet transform by multiple lifting computation.",
            "Combining fractional-order edge detection and chaos synchronisation classifier for fingerprint identification.",
            "Self-embedding watermarking scheme for colour images by bi-level moment-preserving technique.",
            "Image adaptive and high-capacity watermarking system using accurate Zernike moments.",
            "Image object extraction with shape and edge-driven Markov random field model.",
            "Omni-gradient-based total variation minimisation for sparse reconstruction of omni-directional image.",
            "Estimating the queue length at street intersections by using a movement feature space approach.",
            "Efficient 2-fold contextual filtering approach for fingerprint enhancement.",
            "Unsupervised evaluation method using Markov random field for moving object segmentation in infrared videos.",
            "Detection methods for blocking artefacts in transform coded images.",
            "Subpixel-based image downsampling algorithm using content-adaptive two-dimensional FIR filters.",
            "Efficient scrolling videotext detection with adaptive temporal differential approach.",
            "Medical image denoising by generalised Gaussian mixture modelling with edge information.",
            "Pan-sharpening based on weighted red black wavelets.",
            "Neighbourhood sensitive preserving embedding for pattern classification.",
            "Texture and edge preserving multiframe super-resolution.",
            "Weighting scheme for image retrieval based on bag-of-visual-words.",
            "Region-based saliency detection.",
            "Different lighting processing and feature extraction methods for efficient face recognition.",
            "Colour combination attention for object recognition.",
            "Multivariate mathematical morphology based on fuzzy extremum estimation.",
            "Estimation of measurements for block-based compressed video sensing: study of correlation noise in measurement domain.",
            "Effective fuzzy clustering algorithm with Bayesian model and mean template for image segmentation.",
            "Robust registration of partially overlapping point sets via genetic algorithm with growth operator.",
            "Removing Gaussian noise for colour images by quaternion representation and optimisation of weights in non-local means filter.",
            "Diagnosis of diabetic retinopathy by employing image processing technique to detect exudates in retinal images.",
            "Query-dependent metric learning for adaptive, content-based image browsing and retrieval.",
            "Image authentication algorithm with recovery capabilities based on neural networks in the DCT domain.",
            "New approach for the detection of noise-distorted signals based on the method of S-preparation.",
            "Corner detection using Gabor filters.",
            "High-payload block-based data hiding scheme using hybrid edge detector with minimal distortion.",
            "Structural similarity-based video fingerprinting for video copy detection.",
            "Capacity improved robust lossless image watermarking.",
            "Lossless chaos-based crypto-compression scheme for image protection.",
            "Document image super-resolution using structural similarity and Markov random field.",
            "Multimodal non-rigid registration methods based on local variability measures in computed tomography and magnetic resonance brain images.",
            "Intelligent hybrid watermarking ancient-document wavelet packet decomposition-singular value decomposition-based schema.",
            "Inversion attack resilient zero-watermarking scheme for medical image authentication.",
            "Sparse-induced similarity measure: mono-modal image registration via sparse-induced similarity measure.",
            "A fractal-based image encryption system.",
            "Edge preservation image enlargement and enhancement method based on the adaptive Perona-Malik non-linear diffusion model.",
            "Human perception-based image segmentation using optimising of colour quantisation.",
            "Hybrid approach using map-based estimation and class-specific Hough forest for pedestrian counting and detection.",
            "Histogram modification using grey-level co-occurrence matrix for image contrast enhancement.",
            "New technique for online object tracking-by-detection in video.",
            "Saliency detection framework via linear neighbourhood propagation.",
            "Image restoration by blind-Wiener filter.",
            "Active contours with a joint and region-scalable distribution metric for interactive natural image segmentation.",
            "Single-image super-resolution with total generalised variation and Shearlet regularisations.",
            "Image processing system dedicated to a visual intra-cortical stimulator.",
            "Synthetic aperture radar image segmentation using fuzzy label field-based triplet Markov fields model."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 80,
        "papers": [
            "Framework for image retrieval using machine learning and statistical similarity matching techniques.",
            "Is there a relationship between peak-signal-to-noise ratio and structural similarity index measure?",
            "Wavelet statistical texture features-based segmentation and classification of brain computed tomography images.",
            "Transmission of JPEG2000 images over frequency selective channels with unequal power allocation.",
            "Fast and reliable iris segmentation algorithm.",
            "Uniform depth regionbased registration between colour channels and its application to single camerabased multifocusing.",
            "Optimised image retargeting using aesthetic-based cropping and scaling.",
            "Boosted subunits: a framework for recognising sign language from videos.",
            "Whitening central projection descriptor for affine-invariant shape description.",
            "Improved algorithm for detecting zero-quantised discrete cosine transform coefficients in H.264/AVC (revised version).",
            "Histogram-bin-shifting-based reversible watermarking for colour images.",
            "Non-ideal iris segmentation using anisotropic diffusion.",
            "Detection of hard exudates from diabetic retinopathy images using fuzzy logic.",
            "Semi-supervised low-rank representation graph for pattern recognition.",
            "Quality-improved threshold visual secret sharing scheme by random grids.",
            "Enhancing accuracy and sharpness of motion field with adaptive scheme and occlusion-aware filter.",
            "Hybrid approach for Farsi/Arabic text detection and localisation in video frames.",
            "Zero-quantised discrete cosine transform coefficients prediction technique for intra-frame video encoding.",
            "Enhancement of dark and low-contrast images using dynamic stochastic resonance.",
            "Low-complexity multi-standard variable length coding decoder using tree-based partition and classification.",
            "Noise-refined image enhancement using multi-objective optimisation.",
            "Image segmentation using multilevel graph cuts and graph development using fuzzy rule-based system.",
            "Colour and texture feature-based image retrieval by using hadamard matrix in discrete wavelet transform.",
            "Using macroscopic information in image segmentation.",
            "Three-dimensional positioning from Google street view panoramas.",
            "Image segmentation by a new weighted student's t-mixture model.",
            "Active contour driven by local divergence energies for ultrasound image segmentation.",
            "Two anisotropic fourth-order partial differential equations for image inpainting.",
            "Guided image filtering using signal subspace projection.",
            "Image watermark detection in the wavelet domain using Bessel K densities.",
            "Fusion framework for multi-focus images based on compressed sensing.",
            "Colour fringe detection and correction in YCbCr colour space.",
            "Mixed noise removal filter for multi-channel images based on halfspace deepest location.",
            "Ontology reasoning scheme for constructing meaningful sports video summarisation.",
            "Non-linear fourth-order telegraph-diffusion equation for noise removal.",
            "Angle consistency for registration between catadioptric omni-images and orthorectified aerial images.",
            "Development and evaluation of perceptually adapted colour gradients.",
            "Detection of local invariant features using contour.",
            "Retinal vessel segmentation by improved matched filtering: evaluation on a new high-resolution fundus image database.",
            "Pornographic image region detection based on visual attention model in compressed domain.",
            "Automatic and quick blood vessels extraction algorithm in retinal images.",
            "Multiple interpretations by using pixel resonance concept.",
            "Image fusion scheme based on modified dual pulse coupled neural network.",
            "Myocardium segmentation in strain-encoded (SENC) magnetic resonance images using graph-cuts.",
            "New approach for identifying hereditary relation using primary fingerprint patterns.",
            "Robust quantisation index modulation-based approach for image watermarking.",
            "Image denoising algorithm based on contourlet transform for optical coherence tomography heart tube image.",
            "Robust image watermarking using dihedral angle based on maximum-likelihood detector.",
            "Segmentation and localisation of whole slide images using unsupervised learning.",
            "Low-contrast satellite images enhancement using discrete cosine transform pyramid and singular value decomposition.",
            "Compound image compression based on unified LZ and hybrid coding.",
            "Extraction of interest points by Harris interest operator for synthetic aperture radar image coregistration.",
            "Visual illumination compensation for face images using light mapping matrix.",
            "Automatic classification of medical X-ray images: hybrid generative-discriminative approach.",
            "High throughput and energy efficient twodimensional inverse discrete cosine transform architecture.",
            "Spatio-temporal video contrast enhancement.",
            "Lossy and lossless image encoding using multi-scale recurrent pattern matching.",
            "Medical image registration based on fast and adaptive bidimensional empirical mode decomposition.",
            "Exploiting chrominance planes similarity on listless quadtree coders.",
            "Object virtual viewing using adaptive tri-view morphing.",
            "Surface fitting for individual image thresholding and beyond.",
            "Low-bit depth-high-dynamic range image generation by blending differently exposed images.",
            "Mosaic method of side-scan sonar strip images using corresponding features.",
            "Effective two-step method for face hallucination based on sparse compensation on over-complete patches.",
            "Multi-focus image fusion based on non-subsampled shearlet transform.",
            "Non-parametric modified histogram equalisation for contrast enhancement.",
            "Multiple pedestrians tracking algorithm by incorporating histogram of oriented gradient detections.",
            "Stabilising illumination variations in motion detection for surveillance applications.",
            "Construction method of three-channel non-separable symmetric wavelets with arbitrary dilation matrices and its applications in multispectral image fusion.",
            "Comparison of fractal coding methods for medical image compression.",
            "Multi-level fuzzy contourlet-based image fusion for medical applications.",
            "Layered-based exposure fusion algorithm.",
            "Automated photo-consistency test for voxel colouring based on fuzzy adaptive hysteresis thresholding.",
            "Difference theoretic feature set for scale-, illumination- and rotation-invariant texture classification.",
            "Minimisation of image watermarking side effects through subjective optimisation.",
            "Data-mining process: application for hand detection in contact free settings.",
            "Pixel-wise skin colour detection based on flexible neural tree.",
            "Adaptive sampling approach for volumetric shadows in dynamic scenes.",
            "Vessel-based registration of fundus and optical coherence tomography projection images of retina using a quadratic registration model.",
            "Interpolation-based impulse noise removal."
        ]
    },
    {
        "name": "IET-IPR",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 31,
        "papers": [
            "Real-time implementation of order-statistics-based directional filters.",
            "Probabilistic relevance feedback approach for content-based image retrieval based on gaussian mixture models.",
            "Rate control algorithm based on intra-picture complexity for H.264/AVC.",
            "Contrast enhancement and phase-sensitive boundary detection in ultrasonic speckle using Bessel spatial filters.",
            "Multi-component image segmentation using a hybrid dynamic genetic algorithm and fuzzy C-means.",
            "An effective calibration procedure for correction of parallax unmatched image pairs.",
            "Adaptive rate control for Motion JPEG2000.",
            "Multi-direction search algorithm for block motion estimation in H.264/AVC.",
            "Histogram-based reversible data hiding for vector quantisation-compressed images.",
            "Image colourisation using graph-based semi-supervised learning.",
            "Fast video shot boundary detection framework employing pre-processing techniques.",
            "Spectral sensitivity design for maximum colour separation in artificial colour systems.",
            "Spatially adaptive thresholding in wavelet domain for despeckling of ultrasound images.",
            "Image denoising using 2-D separable oversampled DFT modulated filter banks.",
            "Comments on 'new family of lapped biorthogonal transform via lifting steps'.",
            "Reduction of discrete cosine transform/quantisation/inverse quantisation/inverse discrete cosine transform computational complexity in H.264 video encoding by using an efficient prediction algorithm.",
            "Compressed image reproduction based on block decomposition.",
            "Typhoon cloud image enhancement and reducing speckle with genetic algorithm in stationary wavelet domain.",
            "Computation of Zernike moments in improved polar configuration.",
            "Robust and transparent watermarking scheme for colour images.",
            "A new steganographic scheme based on vector quantisation and search-order coding.",
            "Distance measures for reduced ordering-based vector filters.",
            "Improved parabolic prediction-based fractional search for H.264/AVC video coding.",
            "Real-time video object segmentation in H.264 compressed domain.",
            "Incremental rate control for H.264/AVC video compression.",
            "Quad-splitting algorithm for a window query on a Hilbert curve.",
            "Editorial: Distributed video coding.",
            "Adaptive deblocking filter for transform domain Wyner-Ziv video coding.",
            "Enhanced reconstruction algorithm for unidirectional distributed video coding.",
            "Motion vector refinement in a Wyner-Ziv to H.264 transcoder for mobile telephony.",
            "Transform-domain distributed video coding with rate-distortion-based adaptive quantisation."
        ]
    }
]