[
    {
        "year": "2021",
        "name": "ISMAR 2021",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2021",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2021, Bari, Italy, October 4-8, 2021.",
                "count": 56,
                "papers": [
                    "Perception-Driven Hybrid Foveated Depth of Field Rendering for Head-Mounted Displays.",
                    "Edge-Guided Near-Eye Image Analysis for Head Mounted Displays.",
                    "OpenRDW: A Redirected Walking Library and Benchmark with Multi-User, Learning-based Functionalities and State-of-the-art Algorithms.",
                    "Cybersickness Prediction from Integrated HMD's Sensors: A Multimodal Deep Fusion Approach using Eye-tracking and Head-tracking Data.",
                    "STGAE: Spatial-Temporal Graph Auto-Encoder for Hand Motion Denoising.",
                    "The Effects of Virtual Avatar Visibility on Pointing Interpretation by Observers in 3D Environments.",
                    "VR Collaborative Object Manipulation Based on Viewpoint Quality.",
                    "TransforMR: Pose-Aware Object Substitution for Composing Alternate Mixed Realities.",
                    "BDLoc: Global Localization from 2.5D Building Map.",
                    "The Object at Hand: Automated Editing for Mixed Reality Video Guidance from Hand-Object Interactions.",
                    "SAR: Spatial-Aware Regression for 3D Hand Pose and Mesh Reconstruction from a Monocular RGB Image.",
                    "Measuring the Perceived Three-Dimensional Location of Virtual Objects in Optical See-Through Augmented Reality.",
                    "Exploring Head-based Mode-Switching in Virtual Reality.",
                    "AlterEcho: Loose Avatar-Streamer Coupling for Expressive VTubing.",
                    "Using Trajectory Compression Rate to Predict Changes in Cybersickness in Virtual Reality Games.",
                    "Investigation of Size Variations in Optical See-through Tangible Augmented Reality.",
                    "Parametric Model Estimation for 3D Clothed Humans from Point Clouds.",
                    "Gaze Comes in Handy: Predicting and Preventing Erroneous Hand Actions in AR-Supported Manual Tasks.",
                    "Now I'm Not Afraid: Reducing Fear of Missing Out in 360° Videos on a Head-Mounted Display using a Panoramic Thumbnail.",
                    "A Reinforcement Learning Approach to Redirected Walking with Passive Haptic Feedback.",
                    "DVIO: Depth-Aided Visual Inertial Odometry for RGBD Sensors.",
                    "A Predictive Performance Model for Immersive Interactions in Mixed Reality.",
                    "Safety, Power Imbalances, Ethics and Proxy Sex: Surveying In-The-Wild Interactions Between VR Users and Bystanders.",
                    "Personal Identifiability and Obfuscation of User Tracking Data From VR Training Sessions.",
                    "Classifying In-Place Gestures with End-to-End Point Cloud Learning.",
                    "PAVAL: Position-Aware Virtual Agent Locomotion for Assisted Virtual Reality Navigation.",
                    "Two-hand Pose Estimation from the non-cropped RGB Image with Self-Attention Based Network.",
                    "Rotation-constrained optical see-through headset calibration with bare-hand alignment.",
                    "The Passenger Experience of Mixed Reality Virtual Display Layouts in Airplane Environments.",
                    "RNIN-VIO: Robust Neural Inertial Navigation Aided Visual-Inertial Odometry in Challenging Scenes.",
                    "Evaluating the user Experience of a Photorealistic Social VR Movie.",
                    "SceneAR: Scene-based Micro Narratives for Sharing and Remixing in Augmented Reality.",
                    "Fine Virtual Manipulation with Hands of Different Sizes.",
                    "Diegetic Representations for Seamless Cross-Reality Interruptions.",
                    "Investigating Textual Visual Sound Effects in a Virtual Environment and their impacts on Object Perception and Sound Perception.",
                    "BuildingSketch: Freehand Mid-Air Sketching for Building Modeling.",
                    "Understanding the Two-Step Nonvisual Omnidirectional Guidance for Target Acquisition in 3D Spaces.",
                    "Varying user agency and interaction opportunities in a home mobile augmented virtuality story.",
                    "Excite-O-Meter: Software Framework to Integrate Heart Activity in Virtual Reality.",
                    "TEyeD: Over 20 Million Real-World Eye Images with Pupil, Eyelid, and Iris 2D and 3D Segmentations, 2D and 3D Landmarks, 3D Eyeball, Gaze Vector, and Eye Movement Types.",
                    "Supporting Iterative Virtual Reality Analytics Design and Evaluation by Systematic Generation of Surrogate Clustered Datasets.",
                    "Detection-Guided 3D Hand Tracking for Mobile AR Applications.",
                    "Simulating Realistic Human Motion Trajectories of Mid-Air Gesture Typing.",
                    "Separation, Composition, or Hybrid? - Comparing Collaborative 3D Object Manipulation Techniques for Handheld Augmented Reality.",
                    "Selective Foveated Ray Tracing for Head-Mounted Displays.",
                    "Blending Shadows: Casting Shadows in Virtual and Real using Occlusion-Capable Augmented Reality Near-Eye Displays.",
                    "A Taxonomy of Interaction Techniques for Immersive Augmented Reality based on an Iterative Literature Review.",
                    "Distortion-Aware Room Layout Estimation from A Single Fisheye Image.",
                    "CrowdXR - Pitfalls and Potentials of Experiments with Remote Participants.",
                    "A Comparison of the Fatigue Progression of Eye-Tracked and Motion-Controlled Interaction in Immersive Space.",
                    "Mirror, Mirror on My Phone: Investigating Dimensions of Self-Face Perception Induced by Augmented Reality Filters.",
                    "ARENA: The Augmented Reality Edge Networking Architecture.",
                    "FLASH: Video-Embeddable AR Anchors for Live Events.",
                    "Redirected Walking using Noisy Galvanic Vestibular Stimulation.",
                    "Neural Cameras: Learning Camera Characteristics for Coherent Mixed Reality Rendering.",
                    "Scan&Paint: Image-based Projection Painting."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2021a",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality Adjunct, ISMAR 2021 Adjunct, Bari, Italy, October 4-8, 2021.",
                "count": 113,
                "papers": [
                    "From Virtual Reality to Augmented Reality: Devices, Bodies, Places and Relationships.",
                    "Visitor Artwork Ambient and how Making New Functions of Cultural Heritage by Using Augmented Reality within an Ambient Intelligence.",
                    "CubeMuseum: An Augmented Reality Prototype of Embodied Virtual Museum.",
                    "Accessible Tangible User Interfaces in eXtended Reality Experiences for Cultural Heritage.",
                    "Designing Historical Tours for Head-Worn AR.",
                    "Transdisciplinary approach to Augmented reality Digital heritage Mobile applications.",
                    "A VR Application for the Virtual Fitting of Fashion Garments on Avatars.",
                    "Snapwear: A Snapchat AR filter for the virtual tryon of real clothes.",
                    "Assessing Telepresence, Social Presence and Stress Response in a Virtual Reality Store.",
                    "Eye-gaze, inter-brain synchrony, and collaborative VR in conjunction with online counselling: A pilot study.",
                    "Individualised Virtual Reality for Supporting Depression: Feedback from Mental Health Professionals.",
                    "An XRI Mixed-Reality Internet-of-Things Architectural Framework Toward Immersive and Adaptive Smart Environments.",
                    "Immersive Experience Prototyping: Using Mixed Reality to Integrate Real Devices in Virtual Simulated Contexts to Prototype Experiences with Mobile Apps.",
                    "Comparing Distance Judgments in Real and Augmented Reality.",
                    "Distance Estimation with Social Distancing: A Mobile Augmented Reality Study.",
                    "Adapting Image Analysis Measures of Visual Clutter to Multiple Plane Augmented Reality User Interfaces.",
                    "Effects of a Distracting Background and Focal Switching Distance in an Augmented Reality System.",
                    "Reducing the Human Factor in Virtual Reality Research to Increase Reproducibility and Replicability.",
                    "Reflections on a Comparative AR Study.",
                    "Comparing Head and AR Glasses Pose Estimation.",
                    "Perceived Transparency in Optical See-Through Augmented Reality.",
                    "Multi-Drone Collaborative Trajectory Optimization for Large-Scale Aerial 3D Scanning.",
                    "Gaze-Adaptive Subtitles Considering the Balance among Vertical/Horizontal and Depth of Eye Movement.",
                    "Learning to Perceive: Perceptual Resolution Enhancement for VR Display with Efficient Neural Network Processing.",
                    "VR Collaboration in Large Companies: An Interview Study on the Role of Avatars.",
                    "3D Photography with One-shot Portrait Relighting.",
                    "Motion and Meaning: Sample-Level Nonlinear Analyses of Virtual Reality Tracking Data.",
                    "Analysis and Validation for Kinematic and Physiological Data of VR Training System.",
                    "Exploring the Effect of Visual Cues on Eye Gaze During AR-Guided Picking and Assembly Tasks.",
                    "Visual SLAM with Graph-Cut Optimized Multi-Plane Reconstruction.",
                    "COVINS: Visual-Inertial SLAM for Centralized Collaboration.",
                    "An Evaluation of Virtual Reality for Fear Arousal Safety Training in the Construction Industry.",
                    "Enabling Collaborative Interaction with 360° Panoramas between Large-scale Displays and Immersive Headsets.",
                    "An RGB-D Refinement Solution for Accurate Object Pose Estimation.",
                    "Novel Augmented Reality Enhanced Solution towards Vocational Training for People with Mental Disabilities.",
                    "Manipulating Rotational Perception in Virtual Reality.",
                    "Focus-Aware Retinal Projection-based Near-Eye Display.",
                    "Finding a range of perceived natural visual walking speed for stationary travelling techniques in VR.",
                    "A Nugget-Based Concept for Creating Augmented Reality.",
                    "PanoCue: An Efficient Visual Cue With a Omnidirectional Panoramic View for Finding a Target in 3D Space.",
                    "Interactive Embodied Agent for Navigation in Virtual Environments.",
                    "A Comparison of Common Video Game versus Real-World Heads-Up-Display Designs for the Purpose of Target Localization and Identification.",
                    "Evaluation of Visual Requirements and Software-Design for Immersive Visibility in Industrial Applications.",
                    "3D Volume Visualization and Screen-based Interaction with Dynamic Ray Casting on Autostereoscopic Display.",
                    "Occlusion Handling in Outdoor Augmented Reality using a Combination of Map Data and Instance Segmentation.",
                    "A Japanese Character Flick-Input Interface for Entering Text in VR.",
                    "Designing an Extended Reality Application to Expand Clinic-Based Sensory Strategies for Autistic Children Requiring Substantial Support: Participation of Practitioners.",
                    "Augmented Reality Interface for Sailing Navigation: a User Study for Wind Representation.",
                    "Walking Through Walls: The Effect of Collision-Based Feedback on Affordance Judgments in Augmented Reality.",
                    "Mobile Augmented Reality as a Field-Assistance Tool in Urban Maintenance.",
                    "A Mixed-Reality System to Promote Child Engagement in Remote Intergenerational Storytelling.",
                    "Indicators of Training Success in Virtual Reality Using Head and Eye Movements.",
                    "Depth Inpainting via Vision Transformer.",
                    "Future Visions for Higher Education: An Investigation of the Benefits of Virtual Reality for Teaching University Students.",
                    "Compelling AR Earthquake Simulation with AR Screen Shaking.",
                    "Reproduction of Environment Reflection using Extrapolation of Front Camera Images in Mobile AR.",
                    "Light4AR: a Shadow-based Estimator of Multiple Light Sources in Interactive Time for More Photorealistic AR Experiences.",
                    "Subtle Attention Guidance for Real Walking in Virtual Environments.",
                    "ASAP: Auto-generating Storyboard And Previz with Virtual Humans.",
                    "Simultaneous Real Walking and Asymmetric Input in Virtual Reality with a Smartphone-based Hybrid Interface.",
                    "Towards In-situ Authoring of AR Visualizations with Mobile Devices.",
                    "A Toolkit to Evaluate and Characterize the Collaborative Process in Scenarios of Remote Collaboration Supported by AR.",
                    "Evaluating Wearable Tactile Feedback Patterns During a Virtual Reality Fighting Game.",
                    "Exploring and Slicing Volumetric Medical Data in Augmented Reality Using a Spatially-Aware Mobile Device.",
                    "Device-Agnostic Augmented Reality Rendering Pipeline for AR in Medicine.",
                    "Tactile Telepresence for Isolated Patients.",
                    "Heat Pain Threshold Modulation By Experiencing Burning Hands in Augmented Reality.",
                    "Research on the Usability of Hand Motor Function Training based on VR System.",
                    "Augmented Reality meets Non-Fungible Tokens: Insights Towards Preserving Property Rights.",
                    "VRSmartphoneSketch: Augmenting VR Controller With A Smartphone For Mid-air Sketching.",
                    "Positive Computing in Virtual Reality Industrial Training.",
                    "A Classification of Augmented Reality Approaches for Spatial Data Visualization.",
                    "Augmenting Human Perception: Mediation of Extrasensory Signals in Head-Worn Augmented Reality.",
                    "Revive Family Photo Albums through a Collaborative Environment Exploiting the HoloLens 2.",
                    "An Empirical Study of Size Discrimination in Augmented Reality.",
                    "Watch-Your-Skiing: Visualizations for VR Skiing using Real-time Body Tracking.",
                    "Fisheye vs Rubber Sheet: Supporting Visual Search and Fine Motor Skills in Augmented Reality.",
                    "A Grasp on Reality: Understanding Grasping Patterns for Object Interaction in Real and Virtual Environments.",
                    "A Study of Human-Machine Teaming For Single Pilot Operation with Augmented Reality.",
                    "Augmented Reality in Chinese Language Pronunciation Practice.",
                    "Exploring Augmented Reality Privacy Icons for Smart Home Devices and their Effect on Users' Privacy Awareness.",
                    "Socially Distanced: Have user evaluation methods for Immersive Technologies changed during the COVID-19 pandemic?",
                    "Analysing a UI's Impact on the Usability of Hands-free Interaction on Smart Glasses.",
                    "Global Heading Estimation For Wide Area Augmented Reality Using Road Semantics For Geo-referencing.",
                    "Designing a Multi-Modal Communication System for the Deaf and Hard-of-Hearing Users.",
                    "Multi-scale Mixed Reality Collaboration for Digital Twin.",
                    "Focus Group on Social Virtual Reality in Social Virtual Reality: Effects on Emotion and Self-Awareness.",
                    "XR Mobility Platform: Multi-Modal XR System Mounted on Autonomous Vehicle for Passenger's Comfort Improvement.",
                    "Dynamic Content Generation for Augmented Technical Support.",
                    "Conect - An application for hybrid conferences.",
                    "Hybrid Conference Experiences in the ARENA.",
                    "The Owl: Immersive Telepresence Communication for Hybrid Conferences.",
                    "Using Context and Physiological Cues to Improve Emotion Recognition in Virtual Reality.",
                    "Doctoral Consortium: Human aspects of virtual characters.",
                    "Designing Augmented Reality Virtual Displays for Productivity Work.",
                    "Maximising the Transferability of Interaction Techniques for Immersive Technologies.",
                    "Amplifying Realities: Gradual and Seamless Scaling of Visual and Auditory Stimuli in Extended Reality.",
                    "Context-Aware Markerless Augmented Reality for Shared Educational Spaces.",
                    "The Impact of Gaze Cues in Mixed Reality Collaborations.",
                    "Designing Virtual Pedagogical Agents and Mentors for Extended Reality.",
                    "As-built Industrial Scene Reconstruction based on Photogrammetry and Prior-Knowledge for Extended Reality Scenarios.",
                    "Depth Perception using X-Ray Visualizations.",
                    "Vision-based Acoustic Information Retrieval for Interactive Sound Rendering.",
                    "Inter-Brain Synchronization during Collaboration in Virtual Reality.",
                    "Demo: The First Open AR Cloud Testbed.",
                    "Co-Drive: the experience of a shared car trip between a driver and a remote passenger.",
                    "Virtual Negotiation Training \"Beat the Bot\".",
                    "Cuboid-Shaped Space Recognition from Noisy Point Cloud for Indoor AR Workspace.",
                    "Two-way Augmented Reality Co-location Under Telemedicine Context.",
                    "Designing VRPT experience for empathy toward out-groups using critical incidents and cultural explanations.",
                    "Prototype of Force Feedback Tool for Mixed Reality Applications.",
                    "MusiKeys: Investigating Auditory-Physical Feedback Replacement Technique for Mid-air Typing.",
                    "Deepfake Portraits in Augmented Reality for Museum Exhibits."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ISMAR 2020",
        "info": "Recife/Porto de Galinhas, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2020",
                "sub_name": "2020 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2020, Recife/Porto de Galinhas, Brazil, November 9-13, 2020.",
                "count": 72,
                "papers": [
                    "Message from the ISMAR 2020 Science and Technology Program Chairs.",
                    "Message from the ISMAR 2020 Science and Technology Program Chairs and TVCG Guest Editors.",
                    "Message from the ISMAR 2020 Workshop and Tutorial Chairs.",
                    "Foveated Instant Radiosity.",
                    "Flower Factory: A Component-based Approach for Rapid Flower Modeling.",
                    "Generating Emotive Gaits for Virtual Agents Using Affect-Based Autoregression.",
                    "Scale-aware Insertion of Virtual Objects in Monocular Videos.",
                    "Perception of Multisensory Wind Representation in Virtual Reality.",
                    "The Effects of Body Tracking Fidelity on Embodiment of an Inverse-Kinematic Avatar for Male Participants.",
                    "The Effects of Object Shape, Fidelity, Color, and Luminance on Depth Perception in Handheld Mobile Augmented Reality.",
                    "Optical distortions in VR bias the perceived slant of moving surfaces.",
                    "Can Retinal Projection Displays Improve Spatial Perception in Augmented Reality?",
                    "Stimulating the Human Visual System Beyond Real World Performance in Future Augmented Reality Displays.",
                    "Digital Full-Face Mask Display with Expression Recognition using Embedded Photo Reflective Sensor Arrays.",
                    "Color Moiré Reduction and Resolution Improvement for Integral 3D Displays Using Multiple Wobbling Optics.",
                    "Optical Gaze Tracking with Spatially-Sparse Single-Pixel Detectors.",
                    "RGB-D-E: Event Camera Calibration for Fast 6-DOF object Tracking.",
                    "An Efficient Planar Bundle Adjustment Algorithm.",
                    "Learning Bipartite Graph Matching for Robust Visual Localization.",
                    "Object Detection in the Context of Mobile Augmented Reality.",
                    "ElaMorph Projection: Deformation of 3D Shape by Dynamic Projection Mapping.",
                    "Real-Time Adaptive Color Correction in Dynamic Projection Mapping.",
                    "Transitioning360: Content-aware NFoV Virtual Camera Paths for 360° Video Playback.",
                    "Tangi: Tangible Proxies For Embodied Object Exploration And Manipulation In Virtual Reality.",
                    "Gain A New Perspective: Towards Exploring Multi-View Alignment in Mixed Reality.",
                    "Augmented Mirrors.",
                    "A Comparative Study of Orientation Support Tools in Virtual Reality Environments with Virtual Teleportation.",
                    "Haptic Handshank - A Handheld Multimodal Haptic Feedback Controller for Virtual Reality.",
                    "Bare-hand Depth Inpainting for 3D Tracking of Hand Interacting with Object.",
                    "Influence of hand visualization on tool-based motor skills training in an immersive VR simulator.",
                    "Determining Detection Thresholds for Fixed Positional Offsets for Virtual Hand Remapping in Virtual Reality.",
                    "Enhancing Visitor Experience or Hindering Docent Roles: Attentional Issues in Augmented Reality Supported Installations.",
                    "AR Interfaces for Mid-Air 6-DoF Alignment: Ergonomics-Aware Design and Evaluation.",
                    "Super Wide-view Optical See-through Head Mounted Displays with Per-pixel Occlusion Capability.",
                    "Towards Eyeglass-style Holographic Near-eye Displays with Statically.",
                    "Improved vergence and accommodation via Purkinje Image tracking with multiple cameras for AR glasses.",
                    "ARPads: Mid-air Indirect Input for Augmented Reality.",
                    "Exploration of Hands-free Text Entry Techniques For Virtual Reality.",
                    "Investigating Remote Tactile Feedback for Mid-Air Text-Entry in Virtual Reality.",
                    "Pen-based Interaction with Spreadsheets in Mobile Virtual Reality.",
                    "Face Commands - User-Defined Facial Gestures for Smart Glasses.",
                    "Virtual reality sickness detection: an approach based on physiological signals and machine learning.",
                    "Automatic Detection and Prediction of Cybersickness Severity using Deep Neural Networks from user's Physiological Signals.",
                    "Seamless, Bi-directional Transitions along the Reality-Virtuality Continuum: A Conceptualization and Prototype Exploration.",
                    "Towards Real-Time Recognition of Users Mental Workload Using Integrated Physiological Sensors Into a VR HMD.",
                    "Evaluating Mixed and Augmented Reality: A Systematic Literature Review (2009-2019).",
                    "Studying the Inter-Relation Between Locomotion Techniques and Embodiment in Virtual Reality.",
                    "Body Weight Perception of Females using Photorealistic Avatars in Virtual and Augmented Reality.",
                    "A Neurophysiological Approach for Measuring Presence in Immersive Virtual Environments.",
                    "Guideline and Tool for Designing an Assembly Task Support System Using Augmented Reality.",
                    "Enhancing First-Person View Task Instruction Videos with Augmented Reality Cues.",
                    "View Splicing for Effective VR Collaboration.",
                    "Evaluating Remote Virtual Hands Models on Social Presence in Hand-based 3D Remote Collaboration.",
                    "Collaborative Augmented Reality on Smartphones via Life-long City-scale Maps.",
                    "CollaboVR: A Reconfigurable Framework for Creative Collaboration in Virtual Reality.",
                    "Enhancing Participation Experience in VR Live Concerts by Improving Motions of Virtual Audience Avatars.",
                    "Virtual Reality Racket Sports: Virtual Drills for Exercise and Training.",
                    "Perspective Matters: Design Implications for Motion Guidance in Mixed Reality.",
                    "3D Hand Pose Estimation with a Single Infrared Camera via Domain Transfer Learning.",
                    "Automatic Generation of Diegetic Guidance in Cinematic Virtual Reality.",
                    "Walking and Teleportation in Wide-area Virtual Reality Experiences.",
                    "Rock or Roll - Locomotion Techniques with a Handheld Spherical Device in Virtual Reality.",
                    "The Cognitive Load and Usability of Three Walking Metaphors for Consumer Virtual Reality.",
                    "Visual-Auditory Redirection: Multimodal Integration of Incongruent Visual and Auditory Cues for Redirected Walking.",
                    "Comparing World and Screen Coordinate Systems in Optical See-Through Head-Mounted Displays for Text Readability while Walking.",
                    "Landmark-based mixed-reality perceptual alignment of medical imaging data and accuracy validation in living subjects.",
                    "Supporting Medical Auxiliary Work: The Central Sterile Services Department as a Challenging Environment for Augmented Reality Applications.",
                    "An Intelligent Augmented Reality Training Framework for Neonatal Endotracheal Intubation.",
                    "CatARact: Simulating Cataracts in Augmented Reality.",
                    "Extracting Velocity-Based User-Tracking Features to Predict Learning Gains in a Virtual Reality Training Application.",
                    "HydrogenAR: Interactive Data-Driven Presentation of Dispenser Reliability.",
                    "An In-Depth Exploration of the Effect of 2D/3D Views and Controller Types on First Person Shooter Games in Virtual Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2020a",
                "sub_name": "2020 IEEE International Symposium on Mixed and Augmented Reality Adjunct, ISMAR 2020 Adjunct, Recife, Brazil, November 9-13, 2020.",
                "count": 76,
                "papers": [
                    "An Evaluation of AR-Assisted Navigation for Search and Rescue in Underground Spaces.",
                    "A Conceptual Model for Data Collection and Analysis for AR-based Remote Collaboration Evaluation.",
                    "An Image-Based Method for Measuring Strabismus in Virtual Reality.",
                    "AR Circuit Constructor: Combining Electricity Building Blocks and Augmented Reality for Analogy-Driven Learning and Experimentation.",
                    "AR Mini-Games for Supermarkets.",
                    "Augmented Reality for Pack Optimization using Video and Depth Data.",
                    "Catching the Drone - A Tangible Augmented Reality Game in Superhuman Sports.",
                    "Comparing Methods for Mapping Facial Expressions to Enhance Immersive Collaboration with Signs of Emotion.",
                    "Concept for a Virtual Reality Robot Ground Simulator.",
                    "Designing a Multitasking Interface for Object-aware AR applications.",
                    "Effects of Behavioral and Anthropomorphic Realism on Social Influence with Virtual Humans in AR.",
                    "Evaluation of Different Visualization Techniques for Perception-Based Alignment in Medical AR.",
                    "Exploring Virtual Environments by Visually Impaired Using a Mixed Reality Cane Without Visual Feedback.",
                    "Extended by Design: A Toolkit for Creation of XR Experiences.",
                    "Ginput: a tool for fast hi-fi prototyping of gestural interactions in virtual reality.",
                    "HuTrain: a Framework for Fast Creation of Real Human Pose Datasets.",
                    "Industrial Augmented Reality: Concepts and User Interface Designs for Augmented Reality Maintenance Worker Support Systems.",
                    "Intention to use an interactive AR app for engineering education.",
                    "Locomotive and Cognitive Trade-Offs for Target-based Travel.",
                    "MiXR: A Hybrid AR Sheet Music Interface for Live Performance.",
                    "Modeling Emotions for Training in Immersive Simulations (METIS): A Cross-Platform Virtual Classroom Study.",
                    "Real-Time Gait Reconstruction For Virtual Reality Using a Single Sensor.",
                    "Small Marker Tracking with Low-Cost, Unsynchronized, Movable Consumer Cameras For Augmented Reality Surgical Training.",
                    "Stepping over Obstacles with Augmented Reality based on Visual Exproprioception.",
                    "The Comfort Benefits of Gaze-Directed Steering.",
                    "User-Aided Global Registration Method using Geospatial 3D Data for Large-Scale Mobile Outdoor Augmented Reality.",
                    "Virtual Reality in Education: A Case Study on Exploring Immersive Learning for Prisoners.",
                    "\"Kapow!\": Augmenting Contacts with Real and Virtual Objects Using Stylized Visual Effects.",
                    "3D human model creation on a serverless environment.",
                    "A Brain-Computer Interface and Augmented Reality Neurofeedback to Treat ADHD: A Virtual Telekinesis Approach.",
                    "A Sense of Quality for Augmented Reality Assisted Process Guidance.",
                    "A User Study on AR-assisted Industrial Assembly.",
                    "A Virtual Morris Water Maze to Study Neurodegenarative Disorders.",
                    "An Exploratory Study for Designing Social Experience of Watching VR Movies Based on Audience's Voice Comments.",
                    "AR-Chat: an AR-based instant messaging system.",
                    "Augmented illusionism. The influence of optical illusions through artworks with augmented reality.",
                    "Comparing Single-modal and Multimodal Interaction in an Augmented Reality System.",
                    "Decoupled Localization and Sensing with HMD-based AR for Interactive Scene Acquisition.",
                    "Design preferences on Industrial Augmented Reality: a survey with potential technical writers.",
                    "Distortion Correction Algorithm of AR-HUD Virtual Image based on Neural Network Model of Spatial Continuous Mapping.",
                    "Effects of Augmented Content's Placement and Size on User's Search Experience in Extended Displays.",
                    "Effects of Background Complexity and Viewing Distance on an AR Visual Search Task.",
                    "EmnDash: M-sequence Dashed Markers on Vector-based Laser Projection for Robust High-speed Spatial Tracking.",
                    "Evaluate Optimal Redirected Walking Planning Using Reinforcement Learning.",
                    "Industrial Augmented Reality: 3D-Content Editor for Augmented Reality Maintenance Worker Support System.",
                    "Investigating Three-dimensional Directional Guidance with Nonvisual Feedback for Target Pointing Task.",
                    "LCR-SMPL: Toward Real-time Human Detection and 3D Reconstruction from a Single RGB Image.",
                    "Living with Rules: An AR Approach.",
                    "Lower Limb Balance Rehabilitation of Post-stroke Patients Using an Evaluating and Training Combined Augmented Reality System.",
                    "LSFB: A Low-cost and Scalable Framework for Building Large-Scale Localization Benchmark.",
                    "Machine Intelligence Matters: Rethink Human-Robot Collaboration Based on Symmetrical Reality.",
                    "Multi-feature 3D Object Tracking with Adaptively-Weighted Local Bundles.",
                    "Perceptions of Integrating Augmented Reality into Network Cabling Tutors.",
                    "Pleistocene Crete: A narrative, interactive mixed reality exhibition that brings prehistoric wildlife back to life.",
                    "PRISME: An interaction model linking domain activities and mixed and tangible interactors in virtual environments.",
                    "Real-Time Detection of Simulator Sickness in Virtual Reality Games Based on Players' Psychophysiological Data during Gameplay.",
                    "Retargetable AR: Context-aware Augmented Reality in Indoor Scenes based on 3D Scene Graph.",
                    "Stencil Marker: Designing Partially Transparent Markers for Stacking Augmented Reality Objects.",
                    "TGA: Two-level Group Attention for Assembly State Detection.",
                    "Towards an AR game for walking rehabilitation: Preliminary study of the impact of augmented feedback modalities on walking speed.",
                    "Towards Sailing supported by Augmented Reality: Motivation, Methodology and Perspectives.",
                    "Understanding Physical Common Sense in Symmetrical Reality.",
                    "Usability Considerations of Hand Held Augmented Reality Wiring Tutors.",
                    "User Study on Virtual Reality for Design Reviews in Architecture.",
                    "Using Space Syntax to Enable Walkable AR Experiences.",
                    "Using Augmented Reality to Explore Museum Artifacts.",
                    "Developing an eXtended Reality platform for Immersive and Interactive Experiences for Cultural Heritage: Serralves Museum and Coa Archeologic Park.",
                    "Intelligent Adaptive Agents and Trust in Virtual and Augmented Reality.",
                    "Augmented Reality Narratives for Post-Traumatic Stress Disorder Treatment.",
                    "Evaluation of Stroke Assessment in Simulated Virtual World.",
                    "Augmented Reality for Easy Sailing.",
                    "Exploring Design Strategies for Augmented Reality Learning Experience in Classrooms.",
                    "Augmented Reality for Vocational Education Training in K12 Classrooms.",
                    "Remote Assistance System in Augmented Reality for Early School Dropout Prevention.",
                    "ARsinoë - Learning Egyptian Hieroglyphs with Augmented Reality and Machine Learning.",
                    "Merging Geospatial Technologies with Cross Reality in the context of smart manufacturing systems."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ISMAR 2019",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2019",
                "sub_name": "2019 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2019, Beijing, China, October 14-18, 2019.",
                "count": 36,
                "papers": [
                    "Towards SLAM-Based Outdoor Localization using Poor GPS and 2.5D Building Models.",
                    "Camera Relocalization with Ellipsoidal Abstraction of Objects.",
                    "Efficient 3D Reconstruction and Streaming for Group-Scale Multi-client Live Telepresence.",
                    "Tangible and Visible 3D Object Reconstruction in Augmented Reality.",
                    "3D Virtual Garment Modeling from RGB Images.",
                    "Spatially-Varying Diffuse Reflectance Capture Using Irradiance Map Rendering for Image-Based Modeling Applications.",
                    "Augmented Environment Mapping for Appearance Editing of Glossy Surfaces.",
                    "Coherent Rendering of Virtual Smile Previews with Fast Neural Style Transfer.",
                    "Real-Time Mixed Reality Rendering for Underwater 360° Videos.",
                    "VR Props: An End-to-End Pipeline for Transporting Real Objects Into Virtual and Augmented Environments.",
                    "Manipulating 3D Anatomic Models in Augmented Reality: Comparing a Hands-Free Approach and a Manual Approach.",
                    "DepthMove: Leveraging Head Motions in the Depth Dimension to Interact with Virtual Reality Head-Worn Displays.",
                    "Studying Exocentric Distance Perception in Optical See-Through Augmented Reality.",
                    "Influence of Personality Traits and Body Awareness on the Sense of Embodiment in Virtual Reality.",
                    "Is Any Room Really OK? The Effect of Room Size and Furniture on Presence, Narrative Engagement, and Usability During a Space-Adaptive Augmented Reality Game.",
                    "Effects of \"Real-World\" Visual Fidelity on AR Interface Assessment: A Case Study Using AR Head-up Display Graphics in Driving.",
                    "Walking Your Virtual Dog: Analysis of Awareness and Proxemics with Simulated Support Animals in Augmented Reality.",
                    "Prediction of Discomfort due to Egomotion in Immersive Videos for Virtual Reality.",
                    "Accurate and Fast Classification of Foot Gestures for Virtual Locomotion.",
                    "Non-Visual Cues for View Management in Narrow Field of View Augmented Reality Displays.",
                    "Is It Cold in Here or Is It Just Me? Analysis of Augmented Reality Temperature Visualization for Computer-Mediated Thermoception.",
                    "DeepTaste: Augmented Reality Gustatory Manipulation with GAN-Based Real-Time Food-to-Food Translation.",
                    "Mixed Reality Office System Based on Maslow's Hierarchy of Needs: Towards the Long-Term Immersion in Virtual Environments.",
                    "Improving Information Sharing and Collaborative Analysis for Remote GeoSpatial Visualization Using Mixed Reality.",
                    "Sharing Manipulated Heart Rate Feedback in Collaborative Virtual Environments.",
                    "ObserVAR: Visualization System for Observing Virtual Reality Users using Augmented Reality.",
                    "Understanding Users' Preferences for Augmented Reality Television.",
                    "Pointing and Selection Methods for Text Entry in Augmented Reality Head Mounted Displays.",
                    "Performance Envelopes of Virtual Keyboard Text Input Strategies in Virtual Reality.",
                    "Enhanced Geometric Techniques for Point Marking in Model-Free Augmented Reality.",
                    "The Importance of Intersection Disambiguation for Virtual Hand Techniques.",
                    "Annotation vs. Virtual Tutor: Comparative Analysis on the Effectiveness of Visual Instructions in Immersive Virtual Reality.",
                    "Investigating Cyclical Stereoscopy Effects Over Visual Discomfort and Fatigue in Virtual Reality While Learning.",
                    "A Comparison of Desktop and Augmented Reality Scenario Based Training Authoring Tools.",
                    "Measuring Cognitive Load and Insight: A Methodology Exemplified in a Virtual Reality Learning Context.",
                    "Acceptance and Effectiveness of a Virtual Reality Public Speaking Training."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2019a",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2019 Adjunct, Beijing, China, October 10-18, 2019.",
                "count": 111,
                "papers": [
                    "Low-Cost Real-Time Mental Load Adaptation for Augmented Reality Instructions - A Feasibility Study.",
                    "A Scalable and Long-Term Wearable Augmented Reality System for Order Picking.",
                    "Augmented Reality-Based Peephole Interaction using Real Space Information.",
                    "Exploring the Use of Augmented Reality in a Kinesthetic Learning Application Integrated with an Intelligent Virtual Embodied Agent.",
                    "Filtering Mechanisms of Shared Social Surrounding Environments in AR.",
                    "Design of an AR-Based System for Group Piano Learning.",
                    "Merging Live and Static 360 Panoramas Inside a 3D Scene for Mixed Reality Remote Collaboration.",
                    "The Kuroko Paradigm: The Implications of Augmenting Physical Interaction with AR Avatars.",
                    "SceneCam: Improving Multi-camera Remote Collaboration using Augmented Reality.",
                    "AR Tips: Augmented First-Person View Task Instruction Videos.",
                    "A High-Precision Localization Device for Outdoor Augmented Reality.",
                    "Smart Haproxy: A Novel Vibrotactile Feedback Prototype Combining Passive and Active Haptic in AR Interaction.",
                    "A User Experience Study of Locomotion Design in Virtual Reality Between Adult and Minor Users.",
                    "A Deformation Method in a Wrapping Manner for Virtual Gingiva Based on Mass-Spring Model.",
                    "New System to Measure Motion Motion-to-Photon Latency of Virtual Reality Head Mounted Display.",
                    "Hololens AR - Using Vuforia-Based Marker Tracking Together with Text Recognition in an Assembly Scenario.",
                    "A Preliminary Exploration of Montage Transitions in Cinematic Virtual Reality.",
                    "WARP: Contributional Tracking Architecture Towards a Worldwide Augmented Reality Platform.",
                    "Consolidating the Research Agenda of Augmented Reality Television with Insights from Potential End-Users.",
                    "A Low-Cost Drift-Free Optical-Inertial Hybrid Motion Capture System for High-Precision Human Pose Detection.",
                    "SafeAR: AR Alert System Assisting Obstacle Avoidance for Pedestrians.",
                    "Easy Extrinsic Calibration of VR System and Multi-camera Based Marker-Less Motion Capture System.",
                    "Automatic Viewpoint Switching for Multi-view Surgical Videos.",
                    "An MR Remote Collaborative Platform Based on 3D CAD Models for Training in Industry.",
                    "Location-Based Augmented Reality In-situ Visualization Applied for Agricultural Fieldwork Navigation.",
                    "Food Talks: Visual and Interaction Principles for Representing Environmental and Nutritional Food Information in Augmented Reality.",
                    "Integrating AR and VR for Mobile Remote Collaboration.",
                    "Visual and Proprioceptive Evaluation for Virtual Bicycle Ride.",
                    "PostAR: Design a Responsive Reading System with Multiple Interactions for Campus Augmented Posters.",
                    "Enhancing Rock Painting Tour Experience with Outdoor Augmented Reality.",
                    "VesARlius: An Augmented Reality System for Large-Group Co-located Anatomy Learning.",
                    "Mental Fatigue of Long-Term Office Tasks in Virtual Environment.",
                    "Multi-vehicle Cooperative Military Training Simulation System Based on Augmented Reality.",
                    "Industrial Use Case - AR Guidance using Hololens for Assembly and Disassembly of a Modular Mold, with Live Streaming for Collaborative Support.",
                    "A Two-Point Map-Based Interface for Architectural Walkthrough.",
                    "Why Don't We See More of Augmented Reality in Schools?",
                    "Hand ControlAR: An Augmented Reality Application for Learning 3D Geometry.",
                    "Words in Kitchen: An Instance of Leveraging Virtual Reality Technology to Learn Vocabulary.",
                    "Holding Virtual Objects Using a Tablet for Tangible 3D Sketching in VR.",
                    "Tie-Brake: Tie-Based Wearable Device for Navigation with Brake Function.",
                    "Augmenting a Psoriasis-patient Doctor-dialogue through Intergrating Real Face and Maps of Psoriasis Pathology.",
                    "InvisibleRobot: Facilitating Robot Manipulation Through Diminished Reality.",
                    "DroneCamo: Modifying Human-Drone Comfort via Augmented Reality.",
                    "Evaluating IVR in Primary School Classrooms.",
                    "3DUITK: An Opensource Toolkit for Thirty Years of Three-Dimensional Interaction Research.",
                    "Compiling VR/AR Trainings from Business Process Models.",
                    "Volumetric Representation of Human Body Parts Using Superquadrics.",
                    "Deep Consistent Illumination in Augmented Reality.",
                    "Improving Hybrid Tracking System for First-Person Interaction in Immersive CAVE Environment.",
                    "Video Synthesis of Human Upper Body with Realistic Face.",
                    "Joint Inpainting of RGB and Depth Images by Generative Adversarial Network with a Late Fusion Approach.",
                    "InteractionGAN: Image-Level Interaction using Generative Adversarial Networks.",
                    "Blended-Keyframes for Mobile Mediated Reality Applications.",
                    "The Effect of Two Different Types of Human-Computer Interactions on User's Emotion in Virtual Counseling Environment.",
                    "Deep Multi-state Object Pose Estimation for Augmented Reality Assembly.",
                    "Real-Time 3D Hand Gesture Based Mobile Interaction Interface.",
                    "A Neural Virtual Anchor Synthesizer Based on Seq2Seq and GAN Models.",
                    "Setforge - Synthetic RGB-D Training Data Generation to Support CNN-Based Pose Estimation for Augmented Reality.",
                    "Improving Color Discrimination for Color Vision Deficiency (CVD) with Temporal-Domain Modulation.",
                    "Compact Light Field Augmented Reality Display with Eliminated Stray Light using Discrete Structures.",
                    "Faithful Face Image Completion for HMD Occlusion Removal.",
                    "Reconstructing HDR Image from a Single Filtered LDR Image Base on a Deep HDR Merger Network.",
                    "OSTNet: Calibration Method for Optical See-Through Head-Mounted Displays via Non-Parametric Distortion Map Generation.",
                    "A Projector Calibration Method Using a Mobile Camera for Projection Mapping System.",
                    "Real-Time Hand Model Estimation from Depth Images for Wearable Augmented Reality Glasses.",
                    "LE-HGR: A Lightweight and Efficient RGB-Based Online Gesture Recognition Network for Embedded AR Devices.",
                    "Object Manipulation: Interaction for Virtual Reality on Multi-touch Screen.",
                    "Birds vs. Fish: Visualizing Out-of-View Objects in Augmented Reality using 3D Minimaps.",
                    "Realtime Water-Hazard Detection and Visualisation for Autonomous Navigation and Advanced Driving Assistance.",
                    "Online Gesture Recognition Algorithm Applied to HUD Based Smart Driving System.",
                    "Real-Time Texturing for 6D Object Instance Detection from RGB Images.",
                    "Dual-Model Approach for Engineering Collision Detection in the CAVE Environment.",
                    "Barrier Detection and Tracking from Parameterized Lidar Data.",
                    "Multi-level Scene Modeling and Matching for Smartphone-Based Indoor Localization.",
                    "Indoor Scene Reconstruction: From Panorama Images to CAD Models.",
                    "A Fast Method for Large-Scale Scene Data Acquisition and 3D Reconstruction.",
                    "Optimization for RGB-D SLAM Based on Plane Geometrical Constraint.",
                    "A Shape Completion Component for Monocular Non-Rigid SLAM.",
                    "Inter-Brain Connectivity: Comparisons between Real and Virtual Environments using Hyperscanning.",
                    "Less is More: Using Spatialized Auditory and Visual Cues for Target Acquisition in a Real-World Search Task.",
                    "FragmentFusion: A Light-Weight SLAM Pipeline for Dense Reconstruction.",
                    "Mid-Air Haptic Bio-Holograms in Mixed Reality.",
                    "Perceptual MR Space: Interactive Toolkit for Efficient Environment Reconstruction in Mobile Mixed Reality.",
                    "Integrating Peripheral Interaction Into Augmented Reality Applications.",
                    "6DoF Pose Estimation with Object Cutout based on a Deep Autoencoder.",
                    "NEAR: The NetEase AR Oriented Visual Inertial Dataset.",
                    "Visualization-Guided Attention Direction in Dynamic Control Tasks.",
                    "Large-Scale Optical Tracking System.",
                    "HIGS: Hand Interaction Guidance System.",
                    "FrictionHaptics : Encountered-Type Haptic Device forTangential Friction Emulation.",
                    "Utilizing Multiple Calibrated IMUs for Enhanced Mixed Reality Tracking.",
                    "Evaluating Text Entry in Virtual Reality using a Touch-sensitive Physical Keyboard.",
                    "Wearable RemoteFusion: A Mixed Reality Remote Collaboration System with Local Eye Gaze and Remote Hand Gesture Sharing.",
                    "Learning Perceived Emotion Using Affective and Deep Features for Mental Health Applications.",
                    "Investigating Augmented Reality Animals as Companions.",
                    "Increasing Self-Compassion in Young People through Virtual Reality.",
                    "Design and Development of a Virtual Reality System for the Management of Adult Neurogenic Communication Disorders.",
                    "Breathe to Dive: Exploring a Virtual Reality Game for Treatment of Cystic Fibrosis.",
                    "Design of Paper Book Oriented Augmented Reality Collaborative Annotation System for Science Education.",
                    "Extended Reality for Refugees: Pragmatic Ideas through Ethnographic Research with Refugees in Australia.",
                    "Heading Home - Adapting a Clinical Mixed-Reality Rehabilitation System for Patients' Home Use.",
                    "Augmenting Communication Between Hearing Parents and Deaf Children.",
                    "Exploring the Design Space of an Augmented Display for Conveying Facial Expressions for People with Autism.",
                    "Computational Glasses: Vision Augmentations Using Computational Near-Eye Optics and Displays.",
                    "Accessibility of Immersive Serious Games for Persons with Cognitive Disabilities.",
                    "Anon-Emoji: An Optical See-Through Augmented Reality System for Children with Autism Spectrum Disorders to promote Understanding of Facial Expressions and Emotions.",
                    "Accessible by Design: An Opportunity for Virtual Reality.",
                    "Towards a Typology for Playable Digital Interventions in Urban Public.",
                    "MAXIM: Mixed-reality Automotive Driving XIMulation.",
                    "Marking the City: Interactions in Multiple Space Scales in Virtual Reality.",
                    "AR/VR Based Smart Policing For Fast Response to Crimes in Safe City."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ISMAR 2018",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2018",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2018, Munich, Germany, October 16-20, 2018.",
                "count": 18,
                "papers": [
                    "Efficient Point Cloud Rasterization for Real Time Volumetric Integration in Mixed Reality Applications.",
                    "MaskFusion: Real-Time Recognition, Tracking and Reconstruction of Multiple Moving Objects.",
                    "Impact of Alignment Point Distance and Posture on SPAAM Calibration of Optical See-Through Head-Mounted Displays.",
                    "Efficient Pose Selection for Interactive Camera Calibration.",
                    "Visual-Inertial SLAM Initialization: A General Linear Formulation and a Gravity-Observing Non-Linear Optimization.",
                    "On Exploiting Per-Pixel Motion Conflicts to Extract Secondary Motions.",
                    "Hybrid 3D Hand Articulations Tracking Guided by Classification and Search Space Adaptation.",
                    "Ensuring Safety in Augmented Reality from Trade-off Between Immersion and Situation Awareness.",
                    "Obstacle Avoidance Method in Real Space for Virtual Reality Immersion.",
                    "The Impact of an Accurate Vertical Localization with HRTFs on Short Explorations of Immersive Virtual Reality Scenarios.",
                    "IntelliPupil: Pupillometric Light Modulation for Optical See-Through Head-Mounted Displays.",
                    "Does a Digital Assistant Need a Body? The Influence of Visual Embodiment and Social Behavior on the Perception of Intelligent Virtual Agents in AR.",
                    "Rethinking Redirected Walking: On the Use of Curvature Gains Beyond Perceptual Limitations and Revisiting Bending Gains.",
                    "Enlarging a Smartphone with AR to Create a Handheld VESAD (Virtually Extended Screen-Aligned Display).",
                    "Comparing HMD-Based and Paper-Based Training.",
                    "Evaluating Engagement Level and Analytical Support of Interactive Visualizations in Virtual Reality Environments.",
                    "A User Study on MR Remote Collaboration Using Live 360 Video.",
                    "Effects of Sharing Real-Time Multi-Sensory Heart Rate Feedback in Different Immersive Collaborative Virtual Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2018a",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2018 Adjunct, Munich, Germany, October 16-20, 2018.",
                "count": 112,
                "papers": [
                    "3D PixMix: Image Inpainting in 3D Environments.",
                    "A First-Person Mentee Second-Person Mentor AR Interface for Surgical Telementoring.",
                    "A Method to Quantitatively Evaluate Geo Augmented Reality Applications.",
                    "A Single-Shot-Per-Pose Camera-Projector Calibration System for Imperfect Planar Targets.",
                    "Addressing the Occlusion Problem in Augmented Reality Environments with Phantom Hollow Objects.",
                    "AgileSLAM: A Localization Approach for Agile Head Movements in Augmented Reality.",
                    "An Analysis Tool for Cooperative Mixed Reality Scenarios.",
                    "An Explanatory Windshield Display Interface with Augmented Reality Elements for Urban Autonomous Driving.",
                    "Augmented Reality Remote Collaboration with Dense Reconstruction.",
                    "Augmenting a Cardiology-Patient Doctor-Dialogue Through Integrated Heartbeat-Activated Holographic Display.",
                    "Back to the Future: Constructivist Learning in Virtual Reality.",
                    "Browsing Spatial Photography Using Augmented Models.",
                    "Camera Time Warp: Compensating Latency in Video See-Through Head-Mounted-Displays for Reduced Cybersickness Effects.",
                    "Closed - Loop Calibration for Optical See-Through Near Eye Display with Infinity Focus.",
                    "CNN-MonoFusion: Online Monocular Dense Reconstruction Using Learned Depth from Single View.",
                    "Compact Object Representation of a Non-Rigid Object for Real-Time Tracking in AR Systems.",
                    "Comparing Different Augmented Reality Support Applications for Cooperative Repair of an Industrial Robot.",
                    "Design and Calibration of an Augmented Reality Haploscope.",
                    "Do You Know What I Mean? An MR-Based Collaborative Platform.",
                    "DualGaze: Addressing the Midas Touch Problem in Gaze Mediated VR Interaction.",
                    "Dynamic Omnidirectional Texture Synthesis for Photorealistic Virtual Content Creation.",
                    "Effect of Navigation Speed and VR Devices on Cybersickness.",
                    "Effect of Using HMDs for One Hour on Preteens Visual Fatigue.",
                    "Effective Free Field of View Scene Exploration in VR and AR.",
                    "Effects of Hybrid and Synthetic Social Gaze in Avatar-Mediated Interactions.",
                    "Egocentric Gesture Recognition for Head-Mounted AR Devices.",
                    "Extended Workspace Using a Smartphone with a Depth Camera.",
                    "Fast Depth Map Super-Resolution Using Deep Neural Network.",
                    "Filtering 3D Shared Surrounding Environments by Social Proximity in AR.",
                    "Gamifying Stereo Camera Registration for Augmented Reality.",
                    "Guiding Smombies: Augmenting Peripheral Vision with Low-Cost Glasses to Shift the Attention of Smartphone Users.",
                    "HiKeyb: High-Efficiency Mixed Reality System for Text Entry.",
                    "HoloLens Integration into a Multi-Kinect Tracking Environment.",
                    "Illumination Invariant Camera Localization Using Synthetic Images.",
                    "Indirect Augmented Reality Browser for GIS Data.",
                    "Industrial Augmented Reality: Requirements for an Augmented Reality Maintenance Worker Support System.",
                    "Inverse Augmented Reality: A Virtual Agent's Perspective.",
                    "Is That Me? - Embodiment and Body Perception with an Augmented Reality Mirror.",
                    "Learning 6DoF Object Poses from Synthetic Single Channel Images.",
                    "Look Inside: Understanding Thermal Flux Through Augmented Reality.",
                    "Manufacturing Defects Visualization via Robust Edge-Based Registration.",
                    "Mid-Air Fingertip-Based User Interaction in Mixed Reality.",
                    "MIME: A Mixed-Space Collaborative System with Three Immersion Levels and Multiple Users.",
                    "Perception and Action in Peripersonal Space: A Comparison Between Video and Optical See-Through Augmented Reality Devices.",
                    "Precise Surface Color Estimation Using a Non-Diagonal Reflectance Matrix on an Adaptive Projector-Camera System.",
                    "Reproducing Material Appearance of Real Objects Using Mobile Augmented Reality.",
                    "Seamless Bare-Hand Interaction in Mixed Reality.",
                    "Seeing is Believing: Improving the Perceived Trust in Visually Embodied Alexa in Augmented Reality.",
                    "Semantic Segmentation of Geometric Primitives in Dense 3D Point Clouds.",
                    "Sharing and Augmenting Emotion in Collaborative Mixed Reality.",
                    "The Deployment of a Mixed Reality Experience for a Small-Scale Exhibition in the Wild.",
                    "The Effect of AR Based Emotional Interaction Among Personified Physical Objects in Manual Operation.",
                    "Toward More Believable VR by Smooth Transition Between Real and Virtual Environments via Omnidirectional Video.",
                    "Towards Mobile Diminished Reality.",
                    "Tracking an Object-Grabbing Hand Using Occluded Depth Reconstruction.",
                    "[Poster] Using an Industry-Ready AR HMD on a Real Maintenance Task: AR Benefits Performance on Certain Task Steps More Than Others.",
                    "Using Eye Tracking to Improve Information Retrieval in Virtual Reality.",
                    "Visually Induced Motion Sickness in 360° Videos: Comparing and Combining Visual Optimization Techniques.",
                    "Walking Support in Real Space Using Social Force Model When Wearing Immersive HMD.",
                    "Walking-in-Place for VR Navigation Independent of Gaze Direction Using a Waist-Worn Inertial Measurement Unit.",
                    "xyzNet: Towards Machine Learning Camera Relocalization by Using a Scene Coordinate Prediction Network.",
                    "Enterprise AR Functional Requirements Workshop.",
                    "Multimodal Virtual & Augmented Reality - Editorial to the MVAR Workshop at ISMAR 2018.",
                    "Evaluation of Direct Manipulation Methods in Augmented Reality Environments Using Google Glass.",
                    "User-Perspective Rendering for Handheld Applications.",
                    "VIRTOOAIR: Virtual Reality TOOlbox for Avatar Intelligent Reconstruction.",
                    "1st International Workshop on Multimedia Analysis for Architecture, Design and Virtual Reality Games (MADVR 2018).",
                    "Art and VR Technology, Creating the \"Experience Society\".",
                    "Exploring Past and Present: VR Reconstruction of the Berlin Gendarmenmarkt.",
                    "From TLS Recoding to VR Environment for Documentation of the Governor's Tombs in Dayr al-Barsha, Egypt.",
                    "InLife Ecosystem: Creating Serious Games with IoT Features.",
                    "V4Design for Enhancing Architecture and Video Game Creation.",
                    "Virtual Museum for the Antikythera Mechanism: Designing an Immersive Cultural Exhibition.",
                    "Workshop on Creativity in Designing with & for Mixed Reality.",
                    "Co-Design of Gamified Mixed Reality Applications.",
                    "Designing Haptics: Comparing Two Virtual Reality Gloves with Respect to Realism, Performance and Comfort.",
                    "RealityMedia: An Experimental Digital Book in WebXR.",
                    "Rethinking Reality: A Layered Model of Reality for Immersive Systems.",
                    "The Trouble with Augmented Reality/Virtual Reality Authoring Tools.",
                    "Thoughts on the Future of WebXR and the Immersive Web.",
                    "International Workshop on Comfort Intelligence with AR for Autonomous Vehicle 2018.",
                    "A Virtual Boarding System of an Autonomous Vehicle for Investigating the Effect of an AR Display on Passenger Comfort.",
                    "Comfort Intelligence for Autonomous Vehicles.",
                    "Diminished Reality System Based on Open-Source Software for Self-Driving Mobility.",
                    "Supporting Driver Situation Awareness for Autonomous Urban Driving with an Augmented-Reality Windshield Display.",
                    "3rd Virtual and Augmented Reality for Good (VAR4Good) Workshop.",
                    "Ethical Considerations for AR Experiences at Dark Tourism Sites.",
                    "Identifying Accessibility Conditions for Children with Multiple Disabilities: A Virtual Reality Wheelchair Simulator.",
                    "Interfacing with Global Collective Intelligence Using Virtual Assistants.",
                    "Mixed-Reality Guidance for Brain Stimulation Treatment of Depression.",
                    "Opportunities for Virtual and Mixed Reality Knowledge Demonstration.",
                    "Viability of Augmented Content for Field Policing.",
                    "War Children: Using AR in a Documentary Context.",
                    "A Fingertip Gestural User Interface Without Depth Data for Mixed Reality Applications.",
                    "A Low-Latency, High-Precision Handheld Perspective Corrected Display.",
                    "Accessing BIM-Related Information Through AR.",
                    "Augmenting Mixed Reality Applications with the Vibro Motors Wearable.",
                    "CVR-Analyzer: A Tool for Analyzing Cinematic Virtual Reality Viewing Patterns.",
                    "Demonstrating Emotion Sharing and Augmentation in Cooperative Virtual Reality Games.",
                    "Face Parsing for Mobile AR Applications.",
                    "HoloRoyale: A Large Scale High Fidelity Augmented Reality Game.",
                    "Hybrid UIs for Music Exploration in AR and VR.",
                    "Live Collaborative Large-Scale Dense 3D Reconstruction Using Consumer-Grade Hardware.",
                    "Localization Service Using Sparse Visual Information Based on Recent Augmented Reality Platforms.",
                    "Magestro: Gamification of the Data Collection Process for Development of the Hand Gesture Recognition Technology.",
                    "Probeless and Realistic Mixed Reality Application in Presence of Dynamic Light Sources.",
                    "Reproducing Material Appearance of Real Objects Using Mobile Augmented Reality.",
                    "Retrospective Speech Balloons on Speech-Visible AR via Head-Mounted Display.",
                    "Shading Atlas Streaming Demonstration.",
                    "SoliScratch: A Radar Interface for Scratch DJs.",
                    "SWAG Demo: Smart Watch Assisted Gesture Interaction for Mixed Reality Head-Mounted Displays.",
                    "TutAR: Semi-Automatic Generation of Augmented Reality Tutorials for Medical Education."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ISMAR 2017",
        "info": "Nantes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2017",
                "sub_name": "2017 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2017, Nantes, France, October 9-13, 2017.",
                "count": 17,
                "papers": [
                    "Improving Camera Pose Estimation via Temporal EWA Surfel Splatting.",
                    "Monocular Visual-Inertial State Estimation for Mobile Augmented Reality.",
                    "VisMerge: Light Adaptive Vision Augmentation via Spectral and Temporal Fusion of Non-visible Light.",
                    "Facade Proposals for Urban Augmented Reality.",
                    "Robust Geometric Self-Calibration of Generic Multi-Projector Camera Systems.",
                    "Extended Dot Cluster Marker for High-speed 3D Tracking in Dynamic Projection Mapping.",
                    "Occlusion Matting: Realistic Occlusion Handling for Augmented Reality Applications.",
                    "Synthesis of Environment Maps for Mixed Reality.",
                    "Learning Lightprobes for Mixed Reality Illumination.",
                    "Mixed Voxel Reality: Presence and Embodiment in Low Fidelity, Visually Coherent, Mixed Reality Environments.",
                    "A Primer on Spatial Scale and Its Application to Mixed Reality.",
                    "Designing for Depth Perceptions in Augmented Reality.",
                    "Recent Developments and Future Challenges in Medical Mixed Reality.",
                    "3D-FRC: Depiction of the future road course in the Head-Up-Display.",
                    "Assessing Upper Extremity Motor Dysfunction Using an Augmented Reality Game.",
                    "Exploring the Hype: Investigating Technology Acceptance Factors of Pokémon Go.",
                    "Empirical Study of Non-Reversing Magic Mirrors for Augmented Reality Anatomy Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2017a",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2017 Adjunct, Nantes, France, October 9-13, 2017.",
                "count": 83,
                "papers": [
                    "A Probabilistic Combination of CNN and RNN Estimates for Hand Gesture Based Interaction in Car.",
                    "The Social AR Continuum: Concept and User Study.",
                    "Composite Realism: Effects of Object Knowledge and Mismatched Feature Type on Observer Gaze and Subjective Quality.",
                    "The Augmented Library: An Approach for Improving Users Awareness in a Campus Library.",
                    "Decision Forest For Efficient and Robust Camera Relocalization.",
                    "The Impact of the Frame of Reference on Attention Shifts Between Augmented Reality and Real-World Environment.",
                    "Usability Analysis of an Off-the-Shelf Hand Posture Estimation Sensor for Freehand Physical Interaction in Egocentric Mixed Reality.",
                    "Volume Lens: Exploring Medical Volume Datasets Using Mobile Devices.",
                    "Industrial Augmented Reality: Transferring a Numerical Control Connected Augmented Realty System from Marketing to Maintenance.",
                    "Social Augmentations in Multi-User Virtual Reality: A Virtual Museum Experience.",
                    "Feasibility of Corneal Imaging for Handheld Augmented Reality.",
                    "Visualizing In-Organ Tumors in Augmented Monocular Laparoscopy.",
                    "Hybrid Video/Optical See-Through HMD.",
                    "Planning-Based Workflow Modeling for AR-enabled Automated Task Guidance.",
                    "Reactive Displays for Virtual Reality.",
                    "Enhanced Personalized Targeting Using Augmented Reality.",
                    "Prevention of Visually Induced Motion Sickness Based on Dynamic Real-Time Content-Aware Non-salient Area Blurring.",
                    "Mutually Shared Gaze in Augmented Video Conference.",
                    "AR as a User Interface for The Internet of Things - Comparing Three Interaction Models.",
                    "HoloBee: Augmented Reality Based Bee Drift Analysis.",
                    "Depth Map Interpolation Using Perceptual Loss.",
                    "Optimizing Background Subtraction for OST-HMD.",
                    "Augmented Reality for User-Friendly Intra-Oral Scanning.",
                    "Augmented Things: Enhancing AR Applications leveraging the Internet of Things and Universal 3D Object Tracking.",
                    "Fusion of Unsynchronized Optical Tracker and Inertial Sensor in EKF Framework for In-car Augmented Reality Delay Reduction.",
                    "ChiroChroma: An Augmented Reality Game for the Assessment of Hand Motor Functionality.",
                    "Believable Virtual Characters for Mixed Reality.",
                    "ORBFusion: Real-Time and Accurate Dense SLAM at Large Scale.",
                    "Two-Step Gamut Mapping for Optical See-Through Displays.",
                    "Automated Evaluation and Configuration of Object Tracking for Augmented Reality.",
                    "Semantic Augmented Reality Environment with Material-Aware Physical Interactions.",
                    "Double Reality: Shifting the Gaze Between the Physical Object and Its Digital Representation.",
                    "Walking in Augmented Reality: An Experimental Evaluation by Playing with a Virtual Hopscotch.",
                    "A Predictive Approach to On-line Time Warping of Motion.",
                    "MR TV Mozaik: A New Mixed Reality Interactive TV Experience.",
                    "Further Experiments and Considerations on Weight Perception Caused by Visual Diminishing of Real Objects.",
                    "Consistency between Reflection on the Glass and Virtual Object in Augmented Reality.",
                    "Deformed Reality: Proof of Concept and Preliminary Results.",
                    "An Inertial, Magnetic and Vision Based Trusted Pose Estimation for AR and 3D Data Qualification on Long Urban Pedestrian Displacements.",
                    "Halo3D: A Technique for Visualizing Off-Screen Points of Interest in Mobile Augmented Reality.",
                    "Augmented Reality Assistance in the Central Field-of-View Outperforms Peripheral Displays for Order Picking: Results from a Virtual Reality Simulation Study.",
                    "Efficient Pose Selection for Interactive Camera Calibration.",
                    "DotWarp: Dynamic Object Timewarping for Video See-Through Augmented Reality.",
                    "A Benchmark Dataset for 6DoF Object Pose Tracking.",
                    "Illumination Estimation Using Cast Shadows for Realistic Augmented Reality Applications.",
                    "Position Estimation of a Strongly Occluded Object by Using an Auxiliary Point Cloud in Occluded Space.",
                    "Background Image Registration as a Post-Processing Technique in Diminished Reality Rendering Procedures.",
                    "BrightView: Increasing Perceived Brightness in Optical See-Through Head-Mounted Displays.",
                    "Mixed Reality Support for Orthopaedic Surgery.",
                    "ARial Texture: Dynamic Projection Mapping on Drone Propellers.",
                    "Design and Implementation of a Common Dataset for Comparison and Evaluation of Diminished Reality Methods.",
                    "Realtime Generation of Caustic Images Using a Deep Neural Network.",
                    "CamSLAM: Vision Aided Inertial Tracking and Mapping Framework for Large Scale AR Applications.",
                    "CoVAR: Mixed-Platform Remote Collaborative Augmented and Virtual Realities System with Shared Collaboration Cues.",
                    "Holographic iRay: Exploring Augmentation for Medical Applications.",
                    "Development of a Haptic Device with Tactile and Proprioceptive Feedback for Spatial Design Tasks.",
                    "Lightning Markers: Synchronization-free Single-shot Detection of Imperceptible AR Markers Embedded in a High-Speed Video Display.",
                    "AirGestAR: Leveraging Deep Learning for Complex Hand Gestural Interaction with Frugal AR Devices.",
                    "SelfieWall: A Mixed Reality Advertising Platform.",
                    "An Accurate Calibration Method for Optical See-Through Head-Mounted Displays Based on Actual Eye-Observation Model.",
                    "Workshop on Enterprise AR Adoption Obstacles Summary.",
                    "Workshop on Standards for Mixed and Augmented Reality Summary.",
                    "Workshop on VR and AR meet Creative Industries Summary.",
                    "Narrative Grammar in 360.",
                    "Interactive Diorama: A Virtual Reality (VR) Reconstruction of The Anatomy Lesson of Doctor Nicolaes Tulp by Rembrandt, 1632.",
                    "Virtual Play in Free-Viewpoint Video: Reinterpreting Samuel Beckett for Virtual Reality.",
                    "Workshop on Augmented Reality for Good Summary.",
                    "A Mixed-Reality System for Breast Surgical Planning.",
                    "Towards Engaging Upper Extremity Motor Dysfunction Assessment Using Augmented Reality Games.",
                    "BrainChat - A Collaborative Augmented Reality Brain Interface for Message Communication.",
                    "EatAR Tango: Results on the Accuracy of Portion Estimation.",
                    "AR4VI: AR as an Accessibility Tool for People with Visual Impairments.",
                    "Workshop on Virtual, Augmented and Mixed Reality in Education (VAMrE 2017) Summary.",
                    "Daily Living Skills Training in Virtual Reality to Help Children with Autism Spectrum Disorder in a Real Shopping Scenario.",
                    "ARClassNote: Augmented Reality Based Remote Education Solution with Tag Recognition and Shared Hand-Written Note.",
                    "Improving the Immersion in Virtual Reality with Real-Time Avatar and Haptic Feedback in a Cricket Simulation.",
                    "Setting up Virtual Reality and Augmented Reality Learning Environment in Unity.",
                    "BoostHand : Distance-free Object Manipulation System with Switchable Non-linear Mapping for Augmented Reality Classrooms.",
                    "Workshop on Highly Diverse Cameras and Displays for Mixed and Augmented Reality (HDCD4MAR) Summary.",
                    "Pseudo-Dolly-In Video Generation Combining 3D Modeling and Image Reconstruction.",
                    "Diminished Reality for Privacy Protection by Hiding Pedestrians in Motion Image Sequences Using Structure from Motion.",
                    "Semantic Object Selection and Detection for Diminished Reality Based on SLAM with Viewpoint Class.",
                    "An Instant See-Through Vision System Using a Wide Field-of-View Camera and a 3D-Lidar."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ISMAR 2016",
        "info": "Merida, Yucatan, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2016",
                "sub_name": "2016 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2016, Merida, Yucatan, Mexico, September 19-23, 2016.",
                "count": 16,
                "papers": [
                    "Robust Keyframe-based Monocular SLAM for Augmented Reality.",
                    "Leveraging the User's Face for Absolute Scale Estimation in Handheld Monocular SLAM.",
                    "σ-DVO: Sensor Noise Model Meets Dense Visual Odometry.",
                    "Instant Mixed Reality Lighting from Casual Scanning.",
                    "A Single Camera Image Based Approach for Glossy Reflections in Mixed Reality Applications.",
                    "An Empirical Model for Specularity Prediction with Application to Dynamic Retexturing.",
                    "Edge Snapping-Based Depth Enhancement for Dynamic Occlusion Handling in Augmented Reality.",
                    "Practical and Precise Projector-Camera Calibration.",
                    "Learning to Fuse: A Deep Learning Approach to Visual-Inertial Camera Pose Estimation.",
                    "PPV: Pixel-Point-Volume Segmentation for Object Referencing in Collaborative Augmented Reality.",
                    "Analysis of Medium Wrap Freehand Virtual Object Grasping in Exocentric Mixed Reality.",
                    "Automated Spatial Calibration of HMD Systems with Unconstrained Eye-cameras.",
                    "TactileVR: Integrating Physical Toys into Learn and Play Virtual Reality Experiences.",
                    "The Influence of using Augmented Reality on Textbook Support for Learners of Different Learning Styles.",
                    "Reality Skins: Creating Immersive and Tactile Virtual Environments.",
                    "Augmented Reality 3D Discrepancy Check in Industrial Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2016a",
                "sub_name": "2016 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2016 Adjunct, Merida, Yucatan, Mexico, September 19-23, 2016.",
                "count": 96,
                "papers": [
                    "Mobile Guide to Augmented Reality for Campus of the Autonomous University of Nayarit.",
                    "A Perspective on Non-Isometric Shape-from-Template.",
                    "EyeAR: Empiric Evaluation of a Refocusable Augmented Reality System.",
                    "Measuring Observer Response to Object-Scene Disparity in Composites.",
                    "Improving Localization under Varying Illumination.",
                    "DualCAD: Integrating Augmented Reality with a Desktop GUI and Smartphone Interaction.",
                    "Real Time Noise Reduction to Identify Motion Parameters in AR Maintenance Scenario.",
                    "Challenges for Asynchronous Collaboration in Augmented Reality.",
                    "Mobile Augmented Reality: Placing Labels Based on Gaze Position.",
                    "Augmenting Surface Reconstructions.",
                    "Streaming and Exploration of Dynamically Changing Dense 3D Reconstructions in Immersive Virtual Reality.",
                    "A Systematic Review of Usability Studies in Augmented Reality between 2005 and 2014.",
                    "Full-Scale Visualization of a Person on a Movable Transparent Screen.",
                    "Participatory Design of STEM Education AR Experiences for Heterogeneous Student Groups: Exploring Dimensions of Tangibility, Simulation, and Interaction.",
                    "An Augmented Reality Guide for Assisting Forklift Operation.",
                    "Mimicking an Object Using Multiple Projectors.",
                    "EgoSAR: Towards a Personalized Spatial Augmented Reality Experience in Multi-user Environments.",
                    "Robust 3D Object Tracking Using an Elaborate Motion Model.",
                    "Pre-attentive Features in Natural Augmented Reality Visualizations.",
                    "Visual Guidance for Encountered Type Haptic Display: A feasibility study.",
                    "Mobile Augmented Reality Based on Invisible Marker.",
                    "TeachAR: An Interactive Augmented Reality Tool for Teaching Basic English to Non-Native Children.",
                    "Visualisation of the Electronic Horizon in Head-Up-Displays.",
                    "Enhancing 3D Mapping via Real-Time Superpixel-based Segmentation.",
                    "A Hand-Held, Self-Contained Simulated Transparent Display.",
                    "A Haptic Serious Augmented Reality Game for Motor Assessment of Parkinson's Disease Patients.",
                    "Motion Parallax Representation for Indirect Augmented Reality.",
                    "Indoor Localisation and Navigation on Augmented Reality Devices.",
                    "Technical Concept and Technology Choices for Implementing a Tangible Version of the Sokoban Game.",
                    "Enhancing Immersive Cinematic Experience with Augmented Virtuality.",
                    "Diminishing Real Objects and Adding Virtual Objects Using a RGB-D Camera.",
                    "Frustration Free Pose Computation For Spatial AR Devices in Industrial Scenario.",
                    "Low-Cost Depth Camera Pose Tracking for Mobile Platforms.",
                    "iRay: Mobile AR Using Structure Sensor.",
                    "3D Character Customization for Non-Professional Users in Handheld Augmented Reality.",
                    "I Want to Change My Floor: Dominant Plane Recognition from a Single Image to Augment the Scene.",
                    "The RealityMashers: Augmented Reality Wide Field-of-View Optical See-Through Head Mounted Displays.",
                    "Distributed Optimization for Shadow Removal in Spatial Augmented Reality.",
                    "IoT Platform-based iAR: a Prototype for Plant O&M Applications.",
                    "Chromaticity Based Local Linear Regression for Color Distortion Estimation of Optical See-Through Displays.",
                    "Modeling Physical Structure as Additional Constraints for Stereoscopic Optical See-Through Head-Mounted Display Calibration.",
                    "Reduction of Interaction Space in Single Point Active Alignment Method for Optical See-Through Head-Mounted Display Calibration.",
                    "A Transitional AR Furniture Arrangement System with Automatic View Recommendation.",
                    "Riverwalk: Incorporating Historical Photographs in Public Outdoor Augmented Reality Experiences.",
                    "Designing AR Systems to Explore Point-of-View, Bias, and Trans-cultural Conflict.",
                    "Using Visual Effects to Facilitate Depth Perception for Spatial Tasks in Virtual and Augmented Reality.",
                    "Acceptability of an A2R Application: Analysis of Correlations between Factors in a TAM.",
                    "A LED-Based IR/RGB End-to-End Latency Measurement Device.",
                    "Real-Time High Resolution 3D Data on the HoloLens.",
                    "Evaluating Positional Head-Tracking in Immersive VR for 3D Designers.",
                    "Augmented Cues Facilitate Learning Transfer from Virtual to Real Environments.",
                    "Simultaneous Pose Estimation and Augmentation of Elastic Surfaces from a Moving Monocular Camera.",
                    "HORUS EYE: See the Invisible Bird and Snake Vision for Augmented Reality Information Visualization.",
                    "An Artistic and Curatorial Installation in Virtual Reality: The Development of an Artistic Low-Cost Interface at University.",
                    "A Tangible Volume for Portable 3D Interaction.",
                    "An AR Inspection Framework: Feasibility Study with Multiple AR Devices.",
                    "PoLAR: A Portable Library for Augmented Reality.",
                    "Evaluation of Motion Tracking and Depth Sensing Accuracy of the Tango Tablet.",
                    "An Evaluation of Information Connection in Augmented Reality for 3D Scenes with Occlusion.",
                    "On Combining a Semi-Calibrated Stereo Camera and Massive Parallelism for Fast Plane Extraction.",
                    "Reflectance and Illumination Estimation for Realistic Augmentations of Real Scenes.",
                    "Use of Random Dot Pattern for Achieving X-Ray Vision with Stereoscopic Augmented Reality Displays.",
                    "A Low Cost Optical See-Through HMD - Do-It-Yourself.",
                    "Randomly Distributed Small Chip Makers.",
                    "Integrating Building Information Modeling with Augmented Reality for Interdisciplinary Learning.",
                    "GestAR: Real Time Gesture Interaction for AR with Egocentric View.",
                    "Motion-Aware Iterative Closest Point Estimation for Fast Visual Odometry.",
                    "Effective Registration for Multiple Users AR System.",
                    "Learning Object and State Models for AR Task Guidance.",
                    "Empower VR Art and AR Book with Spatial Interaction.",
                    "On Stage Interactive Spatial AR for Drama Performance.",
                    "Augmenting Three-dimensional Effects in Digital Exhibition of a Cultural Artifact using 3D Pseudo Hologram.",
                    "AR Tabletop Interface using a Head-Mounted Projector.",
                    "Detour Light Field Rendering for Diminished Reality Using Unstructured Multiple Views.",
                    "First Deployment of Diminished Reality for Anatomy Education.",
                    "Diminished Reality for Acceleration - Motion Sickness Reduction with Vection for Autonomous Driving.",
                    "Exploring Immersive AR Instructions for Procedural Tasks: The Role of Depth, Motion, and Volumetric Representations.",
                    "Human Attention and fatigue for AR Head-Up Displays.",
                    "Perceptual Issues of a Passive Haptics Feedback Based MR System.",
                    "AR-Based Learning and AR Guides as Strategy in Two-Phase Learning Enhancement: A Case Study.",
                    "Camouflage as an Adaptive Control System: Applications for Multimedia and Interactive Composition.",
                    "The Human BIOS Project - Organic Data Feeding: Synthesizing Digital World Phenomena Using Natural Data as a Source.",
                    "Mixed Reality Extended TV.",
                    "EyeAR: Refocusable Augmented Reality Content through Eye Measurements.",
                    "Blurry (Sticky) Finger: Proprioceptive Pointing and Selection of Distant Objects for Optical See-Through Based Augmented Reality.",
                    "Scalable Mobile Image Recognition for Real-Time Video Annotation.",
                    "Robust Keyframe-Based Monocular SLAM for Augmented Reality.",
                    "A Remote Collaboration System with Empathy Glasses.",
                    "TeachAR: An Interactive Augmented Reality Tool for Teaching Basic English to Non-native Children.",
                    "From CAD to 3D Tracking - Enhancing & Scaling Model-Based Tracking for Industrial Appliances.",
                    "AR4AR Based on ARVIDA Reference Architecture: Application Demonstration.",
                    "Collaborative content creation with the OpenUIX Framework.",
                    "The Object of Absence.",
                    "Participatory Mixed Reality Space: Collective Memories.",
                    "InspectAR: An Augmented Reality Inspection Framework for Industry.",
                    "deBallution - Interactive Artwork by Throwing Pseudo Balls Based on Cultural Heritages."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ISMAR 2015",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2015",
                "sub_name": "2015 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2015, Fukuoka, Japan, September 29 - Oct. 3, 2015.",
                "count": 64,
                "papers": [
                    "Introducing Augmented Reality to Optical Coherence Tomography in Ophthalmic Microsurgery.",
                    "Auditory and Visio-Temporal Distance Coding for 3-Dimensional Perception in Medical Augmented Reality.",
                    "RGBDX: First Design and Experimental Validation of a Mirror-Based RGBD X-ray Imaging System.",
                    "Efficient Computation of Absolute Pose for Gravity-Aware Augmented Reality.",
                    "Augmented Reality Scout: Joint Unaided-Eye and Telescopic-Zoom System for Immersive Team Training.",
                    "A Framework to Evaluate Omnidirectional Video Coding Schemes.",
                    "Tiled Frustum Culling for Differential Rendering on Mobile Devices.",
                    "Simultaneous Direct and Augmented View Distortion Calibration of Optical See-Through Head-Mounted Displays.",
                    "The Ventriloquist Effect in Augmented Reality.",
                    "Augmented Reality during Cutting and Tearing of Deformable Objects.",
                    "Augmented Reality for Radiation Awareness.",
                    "Remote Mixed Reality System Supporting Interactions with Virtualized Objects.",
                    "Fusion of Vision and Inertial Sensing for Accurate and Efficient Pose Tracking on Smartphones.",
                    "Augmenting Mobile C-arm Fluoroscopes via Stereo-RGBD Sensors for Multimodal Visualization.",
                    "Natural User Interface for Ambient Objects.",
                    "INCAST: Interactive Camera Streams for Surveillance Cams AR.",
                    "Natural 3D Interaction Using a See-Through Mobile ASystem.",
                    "Augmented Wire Routing Navigation for Wire Assembly.",
                    "Affording Visual Feedback for Natural Hand Interaction in Ato Assess Upper Extremity Motor Dysfunction.",
                    "Marker Identification Using ILEDs and RGB Color Descriptors.",
                    "RGB-D/C-arm Calibration and Application in Medical Augmented Reality.",
                    "A Comprehensive Interaction Model for ASystems.",
                    "Transforming Your Website to an Augmented Reality View.",
                    "A Step Closer To Reality: Closed Loop Dynamic Registration Correction in SAR.",
                    "Realtime Shape-from-Template: System and Applications.",
                    "Design Guidelines for Generating Augmented Reality Instructions.",
                    "Haptic Ring Interface Enabling Air-Writing in Virtual Reality Environment.",
                    "Remote Welding Robot Manipulation Using Multi-view Images.",
                    "A Particle Filter Approach to Outdoor Localization Using Image-Based Rendering.",
                    "Tracking and Mapping with a Swarm of Heterogeneous Clients.",
                    "AR4AR: Using Augmented Reality for guidance in Augmented Reality Systems Setup.",
                    "Exploiting Photogrammetric Targets for Industrial AR.",
                    "Rubix: Dynamic Spatial Augmented Reality by Extraction of Plane Regions with a RGB-D Camera.",
                    "An Adaptive Augmented Reality Interface for Hand Based on Probabilistic Approach.",
                    "Content Completion in Lower Dimensional Feature Space through Feature Reduction and Compensation.",
                    "ARPML: The Augmented Reality Process Modeling Language.",
                    "Authoring Tools in Augmented Reality: An Analysis and Classification of Content Design Tools.",
                    "Overlaying Navigation Signs on a Road Surface Using a Head-Up Display.",
                    "Deformation Estimation of Elastic Bodies Using Multiple Silhouette Images for Endoscopic Image Augmentation.",
                    "Hands-Free AWork Support System Monitoring Work Progress with Point-cloud Data Processing.",
                    "Pseudo Printed Fabrics through Projection Mapping.",
                    "Endoscopic Image Augmentation Reflecting Shape Changes in Cutting Procedures.",
                    "Toward Enhancing Robustness of DSystem: Ranking Model for Background Inpainting.",
                    "Interactive Visualizations for Monoscopic Eyewear to Assist in Manually Orienting Objects in 3D.",
                    "Movable Spatial AOn-The-Go.",
                    "2D-3D Co-segmentation for AR-based Remote Collaboration.",
                    "Maintaining Appropriate Interpersonal Distance Using Virtual Body Size.",
                    "Vergence-Based AX-ray Vision.",
                    "Manipulating Haptic Shape Perception by Visual Surface Deformation and Finger Displacement in Spatial Augmented Reality.",
                    "Mixed-Reality Store on the Other Side of a Tablet.",
                    "Avatar-Mediated Contact Interaction between Remote Users for Social Telepresence.",
                    "Towards Estimating Usability Ratings of Handheld Augmented Reality Using Accelerometer Data.",
                    "Abecedary Tracking and Mapping: A Toolkit for Tracking Competitions.",
                    "Improved SPAAM Robustness through Stereo Calibration.",
                    "Retrieving Lights Positions Using Plane Segmentation with Diffuse Illumination Reinforced with Specular Component.",
                    "Road Maintenance MSystem Using LRF and PDR.",
                    "Geometric Mapping for Color Compensation Using Scene Adaptive Patches.",
                    "On-site AInterface with Web-Based 3D Archiving System for Archaeological Project.",
                    "Photo Billboarding: A Simple Method to Provide Clues that Relate Camera Views and a 2D Map for Mobile Pedestrian Navigation.",
                    "Automatic Visual Feedback from Multiple Views for Motor Learning.",
                    "Tutorial 1: Global-scale Localization in Outdoor Environments for AR.",
                    "Tutorial 2: Computational Imaging and Projection.",
                    "Tutorial 3: Intelligent User Interfaces.",
                    "Tutorial 4: AImplementations in Informal Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2015w",
                "sub_name": "2015 IEEE International Symposium on Mixed and Augmented Reality Workshops, ISMAR Workshops 2015, Fukuoka, Japan, September 29 - October 3, 2015.",
                "count": 21,
                "papers": [
                    "Collaboration in Mediated and Augmented Reality (CiMAR) Summary.",
                    "Human Perception and Psychology in Augmented Reality (HPPAR) Summary.",
                    "Visual Subliminal Cues for Spatial Augmented Reality.",
                    "Depth Perception and Action in Wearable Augmented Reality: A Pilot Study.",
                    "Maintaining and Enhancing Human-Surrogate Presence in Augmented Reality.",
                    "Exploiting Binocular Rivalry: Presenting Different Contents on Dominant and Non-dominant Eyes.",
                    "Measuring Perception of Realism in Mixed and Augmented Reality Summary.",
                    "Diminished Reality as Challenging Issue in Mixed and Augmented Reality (IWDR2015) Summary.",
                    "AR Marker Hiding with Real-Time Texture Deformation.",
                    "Efficient Use of Textured 3D Model for Pre-observation-based Diminished Reality.",
                    "MR Visualization of Wheel Trajectories of Driving Vehicle by Seeing-Through Dashboard.",
                    "Diminished Reality for Hiding a Pedestrian using Hand-Held Camera.",
                    "Real-Time Diminished Reality for Dynamic Scenes.",
                    "Motion-Aware Ghosted Views for Single Layer Occlusions in Augmented Reality.",
                    "Exploring Diminished Reality (DR) Spaces to Augment the Attention of Individuals with Autism.",
                    "1st International Workshop on Recognition Based Augmented Reality Summary.",
                    "Towards Mobile Recognition and Verification of Holograms Using Orthogonal Sampling.",
                    "Efficient Texture-less Object Detection for Augmented Reality Guidance.",
                    "Challenges and Applications of Urban Augmented Reality Summary.",
                    "Geolocation for Printed Maps Using Line Segment-Based SIFT-like Feature Matching.",
                    "Prior-Based Facade Rectification for AR in Urban Environment."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2015mashd",
                "sub_name": "2015 IEEE International Symposium on Mixed and Augmented Reality - Media, Art, Social Science, Humanities and Design, ISMAR-MASH'D 2015, Fukuoka, Japan, September 29 - October 3, 2015.",
                "count": 15,
                "papers": [
                    "Using Augmented Reality to Promote Homogeneity in Learning Achievement.",
                    "The Effect of Tangible User Interfaces on Cognitive Load in the Creative Design Process.",
                    "CI-Spy: Designing A Mobile Augmented Reality System for Scaffolding Historical Inquiry Learning.",
                    "IoT-enhanced and Bidirectionally Interactive Information Visualization for Context-Aware Home Energy Savings.",
                    "Augmented \"Ouch!\". How to Create Intersubjective Augmented Objects into Which We can Bump.",
                    "The Paranoid Interface.",
                    "Can Reconstruction of the Human Body Reveal a New Transition Phase for the Human Species into a Yet to be Known Living Form? Posthumanism: Future Biomorphic Transformations and Sculptural Reconstruction of the Human Body.",
                    "WildAR: Creating a Networked AR System for \"In-the-Wild\" Studies.",
                    "Metadata Design for Location-Based Film Experience in Augmented Places.",
                    "Handling, Addition and Snipping Human Interface: HASHI.",
                    "A Novel Haptic Vibration Media and Its Application.",
                    "The Use of Shadows on Real Floor as a Depth Correction of Stereoscopically Visualized Virtual Objects.",
                    "Light Detecting 3D User Interface-Equipped System for Mixed and Augmented Reality Games.",
                    "Designing for Engagement in Augmented Reality Games to Assess Upper Extremity Motor Dysfunctions.",
                    "Augmented Reality Tool for Markerless Virtual Try-on around Human Arm."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ISMAR 2014",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2014",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2014, Munich, Germany, September 10-12, 2014.",
                "count": 119,
                "papers": [
                    "AR-IVI - Implementation of In-Vehicle Augmented Reality.",
                    "Thermal touch: Thermography-enabled everywhere touch interfaces for mobile augmented reality applications.",
                    "AR-mentor: Augmented reality based mentoring system.",
                    "Towards Augmented Reality user interfaces in 3D media production.",
                    "Interactive near-field illumination for photorealistic augmented reality on mobile devices.",
                    "Delta Voxel Cone Tracing.",
                    "Importance weighted image enhancement for prosthetic vision: An augmentation framework.",
                    "P-HRTF: Efficient personalized HRTF computation for high-fidelity spatial sound.",
                    "Visibility-based blending for real-time applications.",
                    "Grasp-Shell vs gesture-speech: A comparison of direct and indirect natural interaction techniques in augmented reality.",
                    "Improving co-presence with augmented visual communication cues for sharing experience through video conference.",
                    "A study of depth perception in hand-held augmented reality using autostereoscopic displays.",
                    "Measurements of live actor motion in mixed reality interaction.",
                    "Improved registration for vehicular AR using auto-harmonization.",
                    "Real-time illumination estimation from faces for coherent rendering.",
                    "Comprehensive workspace calibration for visuo-haptic augmented reality.",
                    "Recognition and reconstruction of transparent objects for augmented reality.",
                    "Pixel-wise closed-loop registration in video-based augmented reality.",
                    "Semi-dense visual odometry for AR on a smartphone.",
                    "Sticky projections - A new approach to interactive shader lamp tracking.",
                    "Dense planar SLAM.",
                    "Real-time deformation, registration and tracking of solids based on physical simulation.",
                    "Performance and sensitivity analysis of INDICA: INteraction-Free DIsplay CAlibration for Optical See-Through Head-Mounted Displays.",
                    "Analysing the effects of a wide field of view augmented reality display on search performance in divided attention tasks.",
                    "SmartColor: Real-time color correction and contrast for optical see-through head-mounted displays.",
                    "Minimizing latency for augmented reality displays: Frames considered harmful.",
                    "Creating automatically aligned consensus realities for AR videoconferencing.",
                    "FLARE: Fast layout for augmented reality applications.",
                    "Presence and discernability in conventional and non-photorealistic immersive augmented reality.",
                    "WeARHand: Head-worn, RGB-D camera-based, bare-hand user interface with visually enhanced depth perception.",
                    "Single view augmentation of 3D elastic objects.",
                    "Improved interventional X-ray appearance.",
                    "Computer-Assisted Laparoscopic myomectomy by augmenting the uterus with pre-operative MRI data.",
                    "MOBIL: A moments based local binary descriptor.",
                    "Ongoing development of a user-centered, AR testbed in industry.",
                    "Visualization of solar radiation data in augmented reality.",
                    "Visual-lnertial 6-DOF localization for a wearable immersive VR/AR system.",
                    "Augmentation of live excavation work for subsurface utilities engineering.",
                    "Exploring social augmentation concepts for public speaking using peripheral feedback and real-time behavior analysis.",
                    "Using augmented reality to support information exchange of teams in the security domain.",
                    "HMD Video see though AR with unfixed cameras vergence.",
                    "Towards user perspective augmented reality for public displays.",
                    "Contextually panned and zoomed augmented reality interactions using COTS heads up displays.",
                    "View management for webized mobile AR contents.",
                    "Non-parametric camera-based calibration of optical see-through glasses for augmented reality applications.",
                    "Towards mobile augmented reality for the elderly.",
                    "An augmented and virtual reality system for training autistic children.",
                    "Device vs. user perspective rendering in google glass AR applications.",
                    "Combining multi-touch and device movement in mobile augmented reality manipulations.",
                    "Turbidity-based aerial perspective rendering for mixed reality.",
                    "Representing degradation of real objects using augmented reality.",
                    "Indirect augmented reality considering real-world illumination change.",
                    "Augmented reality binoculars on the move.",
                    "Motion detection based ghosted views for occlusion handling in augmented reality.",
                    "QR code alteration for augmented reality interactions.",
                    "Interactive deformation of real objects.",
                    "Contact-view: A magic-lens paradigm designed to solve the dual-view problem.",
                    "Utilizing contact-view as an augmented reality authoring method for printed document annotation.",
                    "A preliminary study on altering surface softness perception using augmented color and deformation.",
                    "Social panoramas using wearable computers.",
                    "A Mobile Augmented reality system to assist auto mechanics.",
                    "Smartwatch-aided handheld augmented reality.",
                    "View independence in remote collaboration using AR.",
                    "Local optimization for natural feature tracking targets.",
                    "Interacting with your own hands in a fully immersive MR system.",
                    "Touch gestures for improved 3D object manipulation in mobile augmented reality.",
                    "The posture angle threshold between airplane and window frame metaphors.",
                    "A reconstructive see-through display.",
                    "High volume offline image recognition.",
                    "Insight: Webized mobile AR and real-life use cases.",
                    "MRI design review system: A mixed reality interactive design review system for architecture, serious games and engineering using game engines, standard software, a tablet computer and natural interfaces.",
                    "On the use of augmented reality techniques in a telerehabilitation environment for wheelchair users' training.",
                    "Tracking texture-less, shiny objects with descriptor fields.",
                    "Comprehensive workspace calibration for visuo-haptic augmented reality.",
                    "Exploring multimodal interaction techniques for a mixed reality digital surface.",
                    "The collaborative design platform - A protocol for a mixed reality installation for improved incorporation of laypeople in architecture.",
                    "Towards user perspective augmented reality for public displays.",
                    "Adventurous Dreaming Highflying Dragon: A full body game for children with Attention Deficit Hyperactivity Disorder (ADHD).",
                    "Measurement of perceptual tolerance for inconsistencies within mixed reality scenes.",
                    "INDICA : Interaction-free display calibration for optical see-through head-mounted displays based on 3D eye localization.",
                    "Integrating highly dynamic RESTful linked data APIs in a virtual reality environment.",
                    "Real-time illumination estimation from faces for coherent rendering.",
                    "Towards augmented reality user interfaces in 3D media production.",
                    "Thermal touch: Thermography-enabled everywhere touch interfaces for mobile augmented reality applications.",
                    "Device vs. user-perspective rendering in AR applications for monocular optical see-through head-mounted displays.",
                    "RGB-D-T camera system for AR display of temperature change.",
                    "Markerless augmented reality solution for industrial manufacturing.",
                    "\"It's a Pirate's Life\" AR game.",
                    "QubeAR: Cube style QR code AR interaction.",
                    "G-SIAR: Gesture-speech interface for augmented reality.",
                    "Dense planar SLAM.",
                    "On-site augmented collaborative architecture visualization.",
                    "A complete interior design solution with diminished reality.",
                    "Smartwatch-aided handheld augmented reality.",
                    "A mobile augmented reality system for portion estimation.",
                    "Placing information near to the gaze of the user.",
                    "Fast vision-based multiplanar scene modeling in unprepared environments.",
                    "Mobile augmented reality - 3D object selection and reconstruction with an RGBD sensor and scene understanding.",
                    "Mobile augmented reality - Tracking, mapping and rendering.",
                    "User friedly calibration and tracking for optical stereo see-through augmented reality.",
                    "Tablet system for visual, overlay of 3D virtual object onto real environment.",
                    "Displaying free-viewpoint video with user controlable head mounted display DEMO.",
                    "Video see through AR head-mounted display for medical procedures.",
                    "Corneal imaging in localization and HMD interaction.",
                    "Semantic contextual augmented reality environments.",
                    "Designing support for collaboration around physical artefacts: Using augmented reality in learning environments.",
                    "A 'Look Into' Medical augmented reality.",
                    "Google glass, The META and Co. How to calibrate optical see-through head mounted displays.",
                    "Training detectors and recognizers in Python and OpenCV.",
                    "Advanced manufacturing with augmented reality.",
                    "AR development with the Metaio product suite: Demonstration of use cases in industry.",
                    "Collaboration in mediated and augmented reality.",
                    "Open and interoperable augmented reality.",
                    "Workshop on tracking methods & applications.",
                    "Hands free - Exploring AR glasses and their peculiarities.",
                    "Diminished reality as challenging extension of mixed and augmented reality.",
                    "Designing location-based experiences.",
                    "The glass class: Designing wearable interfaces.",
                    "Fusing web technologies & augmented reality."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2014mashd",
                "sub_name": "2014 IEEE International Symposium on Mixed and Augmented Reality - Media, Art, Social Science, Humanities and Design, ISMAR-MASH'D 2014, Munich, Germany, September 10-12, 2014.",
                "count": 16,
                "papers": [
                    "Smart Headlight: A new active augmented reality that improves how the reality appears to a human.",
                    "The role of augmented reality displays for guiding intra-cardiac interventions.",
                    "Seeing anew: Paradigm shifting across the virtuality continuum.",
                    "Effects of mobile AR-enabled interactions on retention and transfer for learning in art museum contexts.",
                    "AR Petite Theater: Augmented reality storybook for supporting children's empathy behavior.",
                    "Integrating augmented reality to enhance expression, interaction & collaboration in live performances: A ballet dance case study.",
                    "VAL: Visually Augmented Laser cutting to enhance and support creativity.",
                    "nARratives of augmented worlds.",
                    "A theory of meaning for Mixed Reality walking tours.",
                    "Can mobile augmented reality systems assist in portion estimation? A user study.",
                    "Evaluating controls for a point and shoot mobile game: Augmented Reality, Touch and Tilt.",
                    "[Poster] AIBLE: An inquiry-based augmented reality environment for teaching astronomical phenomena.",
                    "[Poster] classifications of augmented reality uses in marketing.",
                    "[Poster] AR for the comprehension of linear perspective in the Renaissance masterpiece the Holy Trinity (Masaccio, 1426).",
                    "[Poster] a single co-lived augmented world or many solipsistic fantasies?",
                    "[Poster] CI-Spy: Using mobile-AR for scaffolding historical inquiry learning."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ISMAR 2013",
        "info": "Adelaide, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2013",
                "sub_name": "IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2013, Adelaide, Australia, October 1-4, 2013.",
                "count": 93,
                "papers": [
                    "Adaptive ghosted views for Augmented Reality.",
                    "Diminished reality using appearance and 3D geometry of internet photo collections.",
                    "Approximated user-perspective rendering in tablet-based augmented reality.",
                    "Computational augmented reality eyeglasses.",
                    "Improving procedural task performance with Augmented Reality annotations.",
                    "Through the looking glass: Pretend play for children with autism.",
                    "Effects of an in-car augmented reality system on improving safety of younger and older drivers.",
                    "Going with the flow: Modifying self-motion perception with computer-mediated optic flow.",
                    "Mobile interactive hologram verification.",
                    "MonoFusion: Real-time 3D reconstruction of small scenes with a single web camera.",
                    "Simultaneous 3D tracking and reconstruction on a mobile phone.",
                    "Scanning and tracking dynamic objects with commodity depth cameras.",
                    "Interactive syntactic modeling with a single-point laser range finder and camera.",
                    "Real-time modeling and tracking manual workflows from first-person vision.",
                    "Delta Light Propagation Volumes for mixed reality.",
                    "Differential Irradiance Caching for fast high-quality light transport between virtual and real worlds.",
                    "3D High Dynamic Range dense visual SLAM and its application to real-time object re-lighting.",
                    "User friendly SLAM initialization.",
                    "Behaviour-aware sensor fusion: Continuously inferring the alignment of coordinate systems from user behaviour.",
                    "Real-time RGB-D camera relocalization.",
                    "Single-shot extrinsic calibration of a generically configured RGB-D camera rig from scene constraints.",
                    "A camera-based calibration for automotive augmented reality Head-Up-Displays.",
                    "Image-guided simulation of heterogeneous tissue deformation for augmented reality during hepatic surgery.",
                    "Robust monocular SLAM in dynamic environments.",
                    "Augmented Reality binoculars.",
                    "Handling pure camera rotation in keyframe-based SLAM.",
                    "See-through window vs. magic mirror: A comparison in supporting visual-motor tasks.",
                    "AR in the library: A pilot study of multi-target acquisition usability.",
                    "Interaction techniques for HMD-HHD hybrid AR systems.",
                    "Giving mobile devices a SIXTH sense: Introducing the SIXTH middleware for Augmented Reality applications.",
                    "Third person perspective augmented reality for high accuracy applications.",
                    "Poor man's SimulCam: Real-time and effortless matchmoving.",
                    "Content first - A concept for industrial augmented reality maintenance applications using mobile devices.",
                    "Augmented Reality driving supported by Vehicular Ad Hoc Networking.",
                    "Acceleration methods for radiance transfer in photorealistic augmented reality.",
                    "Passive Deformable Haptic glove to support 3D interactions in mobile augmented reality environments.",
                    "Diminished reality considering background structures.",
                    "Study of augmented gesture communication cues and view sharing in remote collaboration.",
                    "An outdoor ground truth evaluation dataset for sensor-aided visual handheld camera localization.",
                    "Fast and automatic city-scale environment modeling for an accurate 6DOF vehicle localization.",
                    "Are HMDs the better HUDs?",
                    "In-situ interactive modeling using a single-point laser rangefinder coupled with a new hybrid orientation tracker.",
                    "Subtle cueing for visual search in head-tracked head worn displays.",
                    "Photo-shoot localization of a mobile camera based on registered frame data of virtualized reality models.",
                    "In-situ lighting and reflectance estimations for indoor AR systems.",
                    "Kinect for interactive AR anatomy learning.",
                    "Interactive exploration of augmented aerial scenes with free-viewpoint image generation from pre-rendered images.",
                    "Towards intelligent view management: A study of manual text placement tendencies in mobile environments using video see-through displays.",
                    "Psychophysical exploration of stereoscopic pseudo-transparency.",
                    "User awareness of tracking uncertainties in AR navigation scenarios.",
                    "Augmenting markerless complex 3D objects by combining geometrical and color edge information.",
                    "KITE: Platform for mobile Augmented Reality gaming and interaction using magnetic tracking and depth sensing.",
                    "Panoramic mapping on a mobile phone GPU.",
                    "Design of an AR marker for cylindrical surface.",
                    "Geometric registration for zoomable camera using epipolar constraint and pre-calibrated intrinsic camera parameter change.",
                    "Further stabilization of a microlens-array-based fiducial marker.",
                    "User attention oriented augmented reality on documents with document dependent dynamic overlay.",
                    "Augmented reality image generation with virtualized real objects using view-dependent texture and geometry.",
                    "From augmented reality to augmented human.",
                    "Tutorial chairs.",
                    "Filling the gaps: Hybrid vision and inertial tracking.",
                    "Motion capturing empowered interaction with a virtual agent in an Augmented Reality environment.",
                    "Markerless 3D gesture-based interaction for handheld Augmented Reality interfaces.",
                    "Blur with depth: A depth cue method based on blur effect in augmented reality.",
                    "Consider your clutter: Perception of virtual object motion in AR.",
                    "A projected augmented reality system for remote collaboration.",
                    "Visuo-Haptic Augmented Reality runtime environment for medical training.",
                    "Adapting ray tracing to Spatial Augmented Reality.",
                    "A pilot study for Augmented Reality supported procedure guidance to operate payload racks on-board the International Space Station.",
                    "Towards object based manipulation in remote guidance.",
                    "Management and manipulation of text in dynamic mixed reality workspaces.",
                    "Improved outdoor augmented reality through \"Globalization\".",
                    "View management for driver assistance in an HMD.",
                    "Workshop chairs.",
                    "Not just augmentation: How to re-make the world?",
                    "Unified Visual Perception Model for context-aware wearable AR.",
                    "Representational systems with tangible and graphical elements.",
                    "Comparing pointing and drawing for remote collaboration.",
                    "Using a HHD with a HMD for mobile AR interaction.",
                    "CARMa: Content augmented reality marker.",
                    "Psychophysical exploration of stereoscopic pseudo-transparency.",
                    "3D interactions with a passive deformable haptic glove.",
                    "SIXTH middleware for sensor web enabled AR applications.",
                    "Bare hand natural interaction with augmented objects.",
                    "Visual analytics in Augmented Reality.",
                    "Region-based tracking using sequences of relevance measures.",
                    "Doctoral chairs.",
                    "General chair.",
                    "Wip chairs.",
                    "Program chairs.",
                    "Ego- and Exocentric interaction for mobile AR conferencing.",
                    "Tangible interaction techniques to support asynchronous collaboration.",
                    "Demo chairs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ISMAR 2012",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2012",
                "sub_name": "11th IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2012, Atlanta, GA, USA, November 5-8, 2012.",
                "count": 72,
                "papers": [
                    "BOF.",
                    "Portable reality: Expanding available space.",
                    "A new era of Human Computer Interaction.",
                    "Tutorial 1: Adaptive augmented reality (A2R): Where AR meets user's interest.",
                    "Tutorial 2: Integrating and using panoramas and photographic images in AR experiences.",
                    "Tutorial 3: AR mobile game development: Getting started.",
                    "Workshop 1: 2nd IEEE ISMAR workshop on authoring solutions for augmented reality.",
                    "Workshop 2: Classifying the AR presentation space.",
                    "Workshop 3: IEEE ISMAR 2012 workshop on tracking methods and applications (TMA).",
                    "Wide-area scene mapping for mobile visual tracking.",
                    "Live tracking and mapping from both general and rotation-only camera motion.",
                    "Kinectrack: Agile 6-DoF tracking using a projected dot pattern.",
                    "Dense multibody motion estimation and reconstruction from a handheld camera.",
                    "Distributed visual processing for augmented reality.",
                    "LDB: An ultra-fast feature for scalable Augmented Reality on mobile devices.",
                    "VRCodes: Unobtrusive and active visual codes for interaction by exploiting rolling shutter.",
                    "Representative feature descriptor sets for robust handheld camera localization.",
                    "Multi-sensor navigation algorithm using monocular camera, IMU and GPS for large scale augmented reality.",
                    "Optical outside-in tracking using unmodified mobile phones.",
                    "Real-time surface light-field capture for augmentation of planar specular surfaces.",
                    "High-quality reflections, refractions, and caustics in Augmented Reality and their contribution to visual coherence.",
                    "Instant indirect illumination for dynamic mixed reality scenes.",
                    "Real-time photometric registration from arbitrary geometry.",
                    "Reduction of contradictory partial occlusion in mixed reality by using characteristics of transparency perception.",
                    "PixMix: A real-time approach to high-quality Diminished Reality.",
                    "A non-photorealistic rendering framework with temporal coherence for augmented reality.",
                    "Subtle cueing for visual search in augmented reality.",
                    "Interactive 4D overview and detail visualization in augmented reality.",
                    "Image-driven view management for augmented reality browsers.",
                    "Tablet versus phone: Depth perception in handheld augmented reality.",
                    "A hand-held AR magic lens with user-perspective rendering.",
                    "3D referencing techniques for physical objects in shared augmented reality.",
                    "Quick viewpoint switching for manipulating virtual objects in hand-held augmented reality using stored snapshots.",
                    "Using children's developmental psychology to guide augmented-reality design and usability.",
                    "Learning task structure from video examples for workflow tracking and authoring.",
                    "Mobile augmented reality for cultural heritage: A technology acceptance study.",
                    "Augmented reality during angiography: Integration of a virtual mirror for improved 2D/3D visualization.",
                    "Making Pretense Visible and Graspable: An augmented reality approach to promote pretend play.",
                    "An interactive Augmented Reality system: A prototype for industrial maintenance training applications.",
                    "Superman-like X-ray vision: Towards brain-computer interfaces for medical augmented reality.",
                    "Integrating 3D object detection, modelling and tracking on a mobile phone.",
                    "Hybrid virtual-physical entities.",
                    "ClonAR: Rapid redesign of real-world objects.",
                    "Relationship between features of augmented reality and user memorization.",
                    "Occlusion capable optical see-through head-mounted display using freeform optics.",
                    "Recreating the parallax effect associated with Fishtank VR in a Real-Time telepresence system using head-tracking and a robotic camera.",
                    "Fractal marker fields: No more scale limitations for fiduciary markers.",
                    "Distance-based modeling and manipulation techniques using ultrasonic gloves.",
                    "A GPGPU accelerated descriptor for mobile devices.",
                    "Using mixed reality to map human exercise demonstrations to a robot exercise coach.",
                    "AR marker hiding based on image inpainting and reflection of illumination changes.",
                    "Interface design for an inexpensive hands-free collaborative videoconferencing system.",
                    "Texture-less planar object detection and pose estimation using Depth-Assisted Rectification of Contours.",
                    "Development of a ubiquitous learning system for dexterous hand operation.",
                    "A waist-mounted ProCam system for remote collaboration.",
                    "Alice's adventures in an immersive mixed reality environment.",
                    "Lighty: A painting interface for room illumination by robotic light array.",
                    "Augmented prototyping of 3D rigid curved surfaces.",
                    "Digital map based pose improvement for outdoor Augmented Reality.",
                    "Supervised classification for customized intraoperative augmented reality visualization.",
                    "Why should my students use AR? A comparative review of the educational impacts of augmented-reality.",
                    "Effect of eye and body movement on augmented reality in the manufacturing domain.",
                    "Generation of virtual display surfaces for in-vehicle contextual augmented reality.",
                    "Uniform Marker Fields: Camera localization by orientable De Bruijn tori.",
                    "SLAM using both points and planes for hand-held 3D sensors.",
                    "Depth perception control by hiding displayed images based on car vibration for monocular head-up display.",
                    "Touch-n-Paste: Direct texture transfer interaction in AR environments.",
                    "Subjective evaluations on perceptual depth of stereo image and effective field of view of a wide-view head mounted projective display with a semi-transparent retro-reflective screen.",
                    "A component-based approach towards mobile distributed and collaborative PTAM.",
                    "BurnAR: Feel the heat.",
                    "Toward a practical wall see-through system for drivers: How simple can it be?",
                    "A general approach for closed-loop registration in AR."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ISMAR 2011",
        "info": "Basel, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2011",
                "sub_name": "10th IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2011, Basel, Switzerland, October 26-29, 2011.",
                "count": 69,
                "papers": [
                    "Art exhibit chairs.",
                    "Demo chairs.",
                    "General chairs.",
                    "Will we ever become used to immersion? Art History and Image Science.",
                    "Surface/space.",
                    "Multi modal sensory human communication in the internet society.",
                    "St chairs.",
                    "Building your vision with Qualcomm's Mobile Augmented Reality (AR) Platform: AR on mobile devices.",
                    "Bi-directional OLED microdisplay for see-through HMD.",
                    "Psychological keys to success in MAR systems.",
                    "Work tut chairs.",
                    "Enabling large-scale outdoor Mixed Reality and augmented reality.",
                    "International workshop on AR/MR registration, tracking and benchmarking (TrakMark2011).",
                    "Visualization in mixed reality environments.",
                    "Indoor positioning and navigation for mobile AR.",
                    "Authoring solutions for Augmented Reality.",
                    "Accurate and robust planar tracking based on a model of image sampling and reconstruction process.",
                    "Robust planar target tracking and pose estimation from a single concavity.",
                    "Toward augmenting everything: Detecting and tracking geometrical features on planar objects.",
                    "Homography-based planar mapping and tracking for mobile phones.",
                    "Real-time self-localization from panoramic images on mobile devices.",
                    "Information-theoretic database building and querying for mobile Augmented Reality applications.",
                    "Rapid scene reconstruction on mobile phones from panoramic images.",
                    "The Argon AR Web Browser and standards-based AR application environment.",
                    "Online user survey on current mobile augmented reality applications.",
                    "Tracking-by-synthesis using point features and pyramidal blurring.",
                    "Evaluating the impact of recovery density on augmented reality tracking.",
                    "Using egocentric vision to achieve robust inertial body tracking under magnetic disturbances.",
                    "Gravity-aware handheld Augmented Reality.",
                    "Texture-less object tracking with online training using an RGB-D camera.",
                    "KinectFusion: Real-time dense surface mapping and tracking.",
                    "Encumbrance-free telepresence system with real-time 3D capture and display using commodity depth cameras.",
                    "RGB-D camera-based parallel tracking and meshing.",
                    "Interactive visualization technique for truthful color reproduction in spatial augmented reality applications.",
                    "Adaptive camera-based color mapping for mixed-reality applications.",
                    "Image-based clothes transfer.",
                    "Light factorization for mixed-frequency shadows in augmented reality.",
                    "Providing guidance for maintenance operations using automatic markerless augmented reality system.",
                    "Augmented reality in the psychomotor phase of a procedural task.",
                    "Is there a reality in Industrial Augmented Reality?",
                    "MR in OR: First analysis of AR/VR visualization in 100 intra-operative Freehand SPECT acquisitions.",
                    "Out of reach? - A novel AR interface approach for motor rehabilitation.",
                    "User experiences with augmented reality aided navigation on phones.",
                    "Creating hybrid user interfaces with a 2D multi-touch tabletop and a 3D see-through head-worn display.",
                    "Usability of one handed interaction methods for hand-held projection-based augmented reality.",
                    "3D high dynamic range display system.",
                    "Deformable random dot markers.",
                    "Virtual transparency: Introducing parallax view into video see-through AR.",
                    "Augmenting 3D urban environment using mobile devices.",
                    "Graph-cut-based 3D model segmentation for articulated object reconstruction.",
                    "A user study on the Snap-To-Feature interaction method.",
                    "Outdoor mobile localization from panoramic imagery.",
                    "Evolutionary augmented reality at the Natural History Museum.",
                    "Adaptive substrate for enhanced spatial augmented reality contrast and resolution.",
                    "Transformative reality: Augmented reality for visual prostheses.",
                    "Tightly-coupled robust vision aided inertial navigation algorithm for augmented reality using monocular camera and IMU.",
                    "Edgel templates for fast planar object detection and pose estimation.",
                    "An interactive augmented reality coloring book.",
                    "Fusing the real and the virtual: A depth-camera based approach to Mixed Reality.",
                    "Augmenting magnetic field lines for school experiments.",
                    "Interactive annotation on mobile phones for real and virtual space registration.",
                    "An empiric evaluation of confirmation methods for optical see-through head-mounted display calibration.",
                    "Augmented reality pipe layout planning in the shipbuilding industry.",
                    "Urban canvas: Unfreezing street-view imagery with semantically compressed LIDAR pointclouds.",
                    "Comparing spatial understanding between touch-based and AR-style interaction.",
                    "Bare-hand-based augmented reality interface on mobile phone.",
                    "Visualization of geometric properties of flexible objects for form designing.",
                    "\"Soul Hunter\": A novel augmented reality application in theme parks.",
                    "Toe input with mobile projector and depth camera."
                ]
            },
            {
                "sub_name_abbr": "conf/ismar/2011amh",
                "sub_name": "10th IEEE International Symposium on Mixed and Augmented Reality - Arts, Media, and Humanities, ISMAR-AMH 2011, Basel, Switzerland, October 26-29, 2011.",
                "count": 20,
                "papers": [
                    "Where virtual enhances physical mock-up: A way to understand our heritage.",
                    "Augmenting experiences - A bridge between two universities.",
                    "The House of Olbrich - An Augmented Reality tour through architectural history.",
                    "Pre-patterns for designing embodied interactions in handheld augmented reality games.",
                    "Handheld AR games - A triarchic conceptual design framework.",
                    "Augmented reality in a serious game for manual assembly processes.",
                    "Mobile augmented reality in the museum: Can a lace-like technology take you closer to works of art?",
                    "The augmented Van Gogh's: Augmented reality experiences for museum visitors.",
                    "Imagination: The third reality to the virtuality continuum.",
                    "The role of the artist in evolving AR as a new medium.",
                    "A syncretic approach to artistic research in mixed reality data transfer.",
                    "lifeClipper3 - An augmented walking experience field evaluation of an experience design approach for immersive outdoor augmented reality.",
                    "Turning Augmented Reality into a media: Design exploration to build a dedicated visual language.",
                    "Experience design, interactive art environments and the sense of becoming.",
                    "Sound Perfume: Augmenting user's identity using sound and fragrance stimulation.",
                    "The Arlab and Cave libraries: On authoring augmented reality and virtual reality experiences using a graphical programming language.",
                    "Water in augmented space.",
                    "Social semiotic analysis of the design space of augmented reality.",
                    "Sensitivity of image based Augmented Reality fitting simulation.",
                    "Architectural models in urban landscapes: Synthesis of markers and virtual structures."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ISMAR 2010",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2010",
                "sub_name": "9th IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2010, Seoul, Korea, 13-16 October 2010.",
                "count": 73,
                "papers": [
                    "Augmenting reality for medicine, training, presence and telepresence.",
                    "Augmented dreams.",
                    "Perceptual issues in augmented reality revisited.",
                    "The effect of out-of-focus blur on visual discomfort when using stereo displays.",
                    "Image-based ghostings for single layer occlusions in augmented reality.",
                    "An Augmented Reality X-Ray system based on visual saliency.",
                    "Determining the point of minimum error for 6DOF pose uncertainty representation.",
                    "Accurate real-time tracking using mutual information.",
                    "Point-and-shoot for ubiquitous tagging on mobile phones.",
                    "Foldable augmented maps.",
                    "Management of tracking for industrial AR setups.",
                    "Task support system by displaying instructional video onto AR workspace.",
                    "Evaluation of the virtual mirror as a navigational aid for augmented reality driven minimally invasive procedures.",
                    "Differential Instant Radiosity for mixed reality.",
                    "Foreground and shadow occlusion handling for outdoor augmented reality.",
                    "The importance of eye-contact for collaboration in AR systems.",
                    "Experiences with an AR evaluation test bed: Presence, performance, and physiological measurement.",
                    "Effects of a retroreflective screen on depth perception in a head-mounted projection display.",
                    "A practical multi-viewer tabletop autostereoscopic display.",
                    "The City of Sights: Design, construction, and measurement of an Augmented Reality stage set.",
                    "Build your world and play in it: Interacting with surface particles on complex objects.",
                    "Positioning, tracking and mapping for outdoor augmentation.",
                    "Towards real time 3D tracking and reconstruction on a GPU using Monte Carlo simulations.",
                    "Keyframe-based modeling and tracking of multiple 3D objects.",
                    "Interactive modelling for AR applications.",
                    "Advanced self-contained object removal for realizing real-time Diminished Reality in unconstrained environments.",
                    "An automatic parallax adjustment method for stereoscopic augmented reality systems.",
                    "Painterly rendering with coherence for augmented reality.",
                    "k-MART: Authoring tool for mixed reality contents.",
                    "A precise controllable projection system for projected virtual characters and its calibration.",
                    "Generating vision based Lego augmented reality training and evaluation systems.",
                    "Augmented reality in large environments: Application to aided navigation in urban context.",
                    "Color harmonization for Augmented Reality.",
                    "Extended investigations of user-related issues in mobile industrial AR.",
                    "Digital Diorama system for museum exhibition.",
                    "KHARMA: An open KML/HTML architecture for mobile augmented reality applications.",
                    "EXMAR: EXpanded view of mobile augmented reality.",
                    "Haptic simulation of breast cancer palpation: A case study of haptic augmented reality.",
                    "Range-finding projectors: Visualizing range information without sensors.",
                    "3D discrepancy check via Augmented Reality.",
                    "Augmentation of check in/out model for remote collaboration with Mixed Reality.",
                    "Sensor Synchronization for AR Applications.",
                    "Light-weight marker hiding for augmented reality.",
                    "An immersive e-learning system providing virtual experience.",
                    "Designing and comparing two-handed gestures to confirm links between user controlled objects.",
                    "Augmented reality for board games.",
                    "PoP-EYE environment: Mixed Reality using 3D Photo Collections.",
                    "Video stabilization to a global 3D frame of reference by fusing orientation sensor and image alignment data.",
                    "Augmented telepresence using autopilot airship and omni-directional camera.",
                    "Time-domain augmented reality based on locally adaptive video sampling.",
                    "3DOF tracking accuracy improvement for outdoor Augmented Reality.",
                    "Validating Spatial Augmented Reality for interactive rapid prototyping.",
                    "North-centred orientation tracking on mobile phones.",
                    "Large area indoor tracking for industrial augmented reality.",
                    "Camera pose navigation using Augmented Reality.",
                    "SnapAR: Storing snapshots for quick viewpoint switching in hand-held augmented reality.",
                    "A multi-sensor platform for wide-area tracking.",
                    "Floyd-Warshall all-pair shortest path for accurate multi-marker calibration.",
                    "MTMR: A conceptual interior design framework integrating Mixed Reality with the Multi-Touch tabletop interface.",
                    "AR-based visibility evaluation for preserving landscapes of historical buildings.",
                    "Various tangible devices suitable for mixed reality interactions.",
                    "Camera motion tracking in a dynamic scene.",
                    "ARCrowd-a tangible interface for interactive crowd simulation.",
                    "Origami recognition system using natural feature tracking.",
                    "An intermediate report of TrakMark WG - international voluntary activities on establishing benchmark test schemes for AR/MR geometric registration and tracking methods.",
                    "Feature tracking and object recognition on a hand-held.",
                    "Origami recognition system using natural feature tracking.",
                    "Breast cancer palpation system using haptic augmented reality.",
                    "Demo for differential Instant Radiosity for Mixed Reality.",
                    "A Web Service Platform dedicated to building mixed reality solutions.",
                    "AR Shooter: An augmented reality shooting game system.",
                    "Foldable augmented maps.",
                    "Smart Glasses: An open environment for AR apps."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ISMAR 2009",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2009",
                "sub_name": "Science & Technology Proceedings, 8th IEEE International Symposium on Mixed and Augmented Reality 2009, ISMAR 2009, Orlando, Florida, USA, October 19-22, 2009.",
                "count": 63,
                "papers": [
                    "Mixing reality and magic at Disney theme parks.",
                    "UPWAKE: Art performance fusing dreams and technology.",
                    "SixthSense: Integrating information and the real world.",
                    "Using AR to support cross-organisational collaboration in dynamic tasks.",
                    "Interference avoidance in multi-user hand-held augmented reality.",
                    "Continuous natural user interface: Reducing the gap between real and digital world.",
                    "Animatronic Shader Lamps Avatars.",
                    "Augmenting Aerial Earth Maps with dynamic information.",
                    "Interaction and presentation techniques for shake menus in tangible augmented reality.",
                    "Influence of visual and haptic delays on stiffness perception in augmented reality.",
                    "A user study towards understanding stereo perception in head-worn augmented reality displays.",
                    "Multiple target detection and tracking with guaranteed framerates on mobile phones.",
                    "Shape recognition and pose estimation for mobile augmented reality.",
                    "Wide area localization on mobile phones.",
                    "Parallel Tracking and Mapping on a camera phone.",
                    "In-place 3D sketching for authoring and augmenting mechanical systems.",
                    "Augmenting text document by on-line learning of local arrangement of keypoints.",
                    "Augmented touch without visual obtrusion.",
                    "Online environment model estimation for augmented reality.",
                    "In situ image-based modeling.",
                    "Dynamic seethroughs: Synthesizing hidden views of moving objects.",
                    "Pick-by-Vision: A first stress test.",
                    "Real-time in-situ visual feedback of task performance in mixed environments for learning joint psychomotor-cognitive tasks.",
                    "Evaluating the benefits of augmented reality for task localization in maintenance of an armored personnel carrier turret.",
                    "A dataset and evaluation methodology for template-based tracking algorithms.",
                    "Global pose estimation using multi-sensor fusion for outdoor Augmented Reality.",
                    "ESM-Blur: Handling & rendering blur in 3D tracking and augmentation.",
                    "Integration of georegistered information on a virtual globe.",
                    "Forked! A demonstration of physics realism in augmented reality.",
                    "Contextual in-situ visualization for port placement in keyhole surgery: Evaluation of three target applications by two surgeons and eighteen medical trainees.",
                    "Using optical flow as lightweight SLAM alternative.",
                    "Advanced training methods using an Augmented Reality ultrasound simulator.",
                    "Object recognition and localization while tracking and mapping.",
                    "Streaming mobile augmented reality on mobile phones.",
                    "MoleARlert - an augmented reality game based on Lemmings.",
                    "A setup for evaluating detectors and descriptors for visual tracking.",
                    "Photo-based Industrial Augmented Reality application using a single keyframe registration procedure.",
                    "Evaluating the trackability of natural feature-point sets.",
                    "Robust pose estimation in untextured environments for augmented reality applications.",
                    "In-situ refinement techniques for outdoor geo-referenced models using mobile AR.",
                    "Temporal calibration in multisensor tracking setups.",
                    "Integrating conversational virtual humans and mannequin patient simulators to present mixed reality clinical training experiences.",
                    "Mobile augmented reality based 3D snapshots.",
                    "Effects of sizes and shapes of props in tangible augmented reality.",
                    "A replication study testing the validity of AR simulation in VR for controlled experiments.",
                    "Physical-virtual tools for spatial augmented reality user interfaces.",
                    "Head-mounted virtual loupe with sight-based activation for surgical applications.",
                    "Interactive model reconstruction with user guidance.",
                    "Egocentric space-distorting visualizations for rapid environment exploration in mobile mixed reality.",
                    "Multitouch interaction for Tangible User Interfaces.",
                    "Immersive image-based modeling of polyhedral scenes.",
                    "Real-time representation of inter-reflection for cubic marker.",
                    "A solution for navigating user-generated content.",
                    "Vision based people tracking for ubiquitous Augmented Reality applications.",
                    "Consistent real-time lighting for virtual objects in augmented reality.",
                    "Comprehensive tutorials.",
                    "Experiential learning with Mixed and Augmented Reality.",
                    "Transforming lives: High-performance, high-risk training with mixed reality.",
                    "Industrial workshop: Manufacturing the future.",
                    "Mobile Magic Wand: Augmented reality on mobile devices.",
                    "Lets go out: Research in outdoor mixed and augmented reality.",
                    "AR 2.0: Social Augmented Reality - social computing meets Augmented Reality.",
                    "Proposal of international voluntary activities on establishing benchmark test schemes for AR/MR geometric registration and tracking methods."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ISMAR 2008",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2008",
                "sub_name": "7th IEEE and ACM International Symposium on Mixed and Augmented Reality, ISMAR 2008, Cambridge, UK, 15-18th September 2008.",
                "count": 48,
                "papers": [
                    "Hawk-Eye: Augmented reality in sports broadcasting and officiating.",
                    "Near-eye displays - a look into the Christmas ball.",
                    "Physical gaming: Out of the lap and into the living room.",
                    "Using the marginalised particle filter for real-time visual-inertial sensor fusion.",
                    "Dynamic gyroscope fusion in Ubiquitous Tracking environments.",
                    "Relative pose calibration of a spherical camera and an IMU.",
                    "A differential GPS carrier phase technique for precision outdoor AR tracking.",
                    "Optical free-form surfaces in off-axis head-worn display design.",
                    "An optical see-through head mounted display with addressable focal planes.",
                    "Vesp'R: design and evaluation of a handheld AR device.",
                    "Photometric registration by adaptive high dynamic range image generation for augmented reality.",
                    "Compositing for small cameras.",
                    "OutlinAR: an assisted interactive model building system with reduced computational effort.",
                    "Fast annotation and modeling with a single-point laser range finder.",
                    "User evaluation of see-through vision for mobile outdoor augmented reality.",
                    "An evaluation of graphical context when the graphics are outside of the task area.",
                    "The effect of registration error on tracking distant augmented objects.",
                    "Mobile Augmented Reality in industrial applications: Approaches for solution of user-related issues.",
                    "Supporting order picking with Augmented Reality.",
                    "Virtual redlining for civil engineering in real environments.",
                    "The design of a mixed-reality book: Is it still a real book?",
                    "An Augmented Reality museum guide.",
                    "Collocated AAR: Augmenting After Action Review with Mixed Reality.",
                    "Multiple 3D Object tracking for augmented reality.",
                    "Robust and unobtrusive marker tracking on mobile phones.",
                    "Pose tracking from natural features on mobile phones.",
                    "In-place Augmented Reality.",
                    "An information layout method for an optical see-through head mounted display focusing on the viewability.",
                    "Label segregation by remapping stereoscopic depth in far-field augmented reality.",
                    "A practical radiometric compensation method for projector-based augmentation.",
                    "Relighting with real incident light source.",
                    "Optical tracking using commodity hardware.",
                    "Augmented robot agent: Enhancing co-presence of the remote participant.",
                    "The haunted book.",
                    "Stepping into the operating theater: ARAV - Augmented Reality Aided Vertebroplasty.",
                    "Augmented assembly using a mobile phone.",
                    "Haptically extended augmented prototyping.",
                    "How to augment the second image? Recovery of the translation scale in image to image registration.",
                    "Generating perceptually-correct shadows for mixed reality.",
                    "Wearable augmented reality system using gaze interaction.",
                    "ComposAR: An intuitive tool for authoring AR applications.",
                    "Fast geometry acquisition for mixed reality applications using motion tracking.",
                    "Efficiency of techniques for mixed-space collaborative navigation.",
                    "3D fiducials for scalable AR visual tracking.",
                    "Augmented reality in-situ 3D model menu for outdoors.",
                    "ARWeather - An Augmented Reality Weather ystem.",
                    "Perception thresholds for augmented reality navigation schemes in large distances.",
                    "Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ISMAR 2007",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2007",
                "sub_name": "Sixth IEEE/ACM International Symposium on Mixed and Augmented Reality, ISMAR 2007, 13-16 November 2007, Nara, Japan.",
                "count": 52,
                "papers": [
                    "Experiences with Handheld Augmented Reality.",
                    "Laser Pointer Tracking in Projector-Augmented Architectural Environments.",
                    "Urban Sketcher: Mixed Reality on Site for Urban Planning and Architecture.",
                    "Augmented Reality-based factory planning - an application tailored to industrial needs.",
                    "Face-to-Face Tabletop Remote Collaboration in Mixed Reality.",
                    "Visual Hints for Tangible Gestures in Augmented Reality.",
                    "A 3D Flexible and Tangible Magic Lens in Augmented Reality.",
                    "AR-Jig: A Handheld Tangible User Interface for Modification of 3D Digital Form via 2D Physical Curve.",
                    "Semi-automatic Annotations in Unknown Environments.",
                    "Automatic Reconstruction of Wide-Area Fiducial Marker Models.",
                    "Automatic contour model creation out of polygonal CAD models for markerless Augmented Reality.",
                    "Semi-Autonomous Generation of Appearance-based Edge Models from Image Sequences.",
                    "Visual Longitudinal and Lateral Driving Assistance in the Head-Up Display of Cars.",
                    "Evaluating Display Types for AR Selection and Annotation.",
                    "An Evaluation of Graphical Context as a Means for Ameliorating the Effects of Registration Error.",
                    "An Industrial Augmented Reality Solution For Discrepancy Check.",
                    "Visualization of Spatial Sensor Data in the Context of Automotive Environment Perception Systems.",
                    "Laparoscopic Virtual Mirror for Understanding Vessel Structure Evaluation Study by Twelve Surgeons.",
                    "Contextual Anatomic Mimesis Hybrid In-Situ Visualization Method for Improving Multi-Sensory Depth Perception in Medical Augmented Reality.",
                    "Feature Tracking for Mobile Augmented Reality Using Video Coder Motion Vectors.",
                    "Real-Time Object Tracking for Augmented Reality Combining Graph Cuts and Optical Flow.",
                    "Ninja on a Plane: Automatic Discovery of Physical Planes for Augmented Reality Using Visual SLAM.",
                    "A Method for Predicting Marker Tracking Error.",
                    "Initialisation for Visual Tracking in Urban Environments.",
                    "Hear-Through and Mic-Through Augmented Reality: Using Bone Conduction to Display Spatialized Audio.",
                    "Human-Centered Development of an AR Handheld Display.",
                    "Dynamic Adaptation of Projected Imperceptible Codes.",
                    "Interactive Focus and Context Visualization for Augmented Reality.",
                    "A Two-by-Two Mixed Reality System That Merges Real and Virtual Worlds in Both Audio and Visual Senses.",
                    "A Wide Field-of-view Head Mounted Projective Display using Hyperbolic Half-silvered Mirrors.",
                    "A System Architecture for Ubiquitous Tracking Environments.",
                    "Measurement of absolute latency for video see through augmented reality.",
                    "Precise Geometric Registration by Blur Estimation for Vision-based Augmented Reality.",
                    "Parallel Tracking and Mapping for Small AR Workspaces.",
                    "Deformable Surface Augmentation in Spite of Self-Occlusions.",
                    "A Fast Initialization Method for Edge-based Registration Using an Inclination Constraint.",
                    "Retexturing in the Presence of Complex Illumination and Occlusions.",
                    "Initializing Markerless Tracking Using a Simple Hand Gesture.",
                    "Visually Elegant and Robust Semi-Fiducials for Geometric Registration in Mixed Reality.",
                    "Webtag: A World Wide Internet Based AR System.",
                    "Mosaicing a Wide Geometric Field of View for Effective Interaction in Augmented Reality.",
                    "Adaptive Augmented Reality Using Context Markup and Style Maps.",
                    "A High-level Event System for Augmented Reality.",
                    "Accelerating Template-Based Matching on the GPU for AR Applications.",
                    "ARMO: Augmented Reality based Reconfigurable MOck-up.",
                    "Overlay what Humanoid Robot Perceives and Thinks to the Real-world by Mixed Reality System.",
                    "Vesp'R - Transforming Handheld Augmented Reality.",
                    "Reliving Museum Visiting Experiences on-and-off the Spot.",
                    "Identifying differences between CAD and physical mock-ups using AR.",
                    "A Framework for Tangible User Interfaces within Projector-based Mixed Reality.",
                    "Visualizing Occluded Physical Objects in Unfamiliar Outdoor Augmented Reality Environments.",
                    "Efficient Extraction of Robust Image Features on Mobile Devices."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ISMAR 2006",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2006",
                "sub_name": "Fifth IEEE/ACM International Symposium on Mixed and Augmented Reality, ISMAR 2006, October 22-25, 2006, Santa Barbara, CA, USA.",
                "count": 48,
                "papers": [
                    "Workshop - Industrial augmented reality.",
                    "Tutorials - MAR Tutorial 1 (half day) & ISMAR Tutorial 2 (half day).",
                    "Keynote speeches - The poor man's palace: special effects in the real world / Do we have six brains?",
                    "Quantification of visual capabilities using augmented reality displays.",
                    "Effective control of a car driver's attention for visual and acoustic guidance towards the direction of imminent dangers.",
                    "User evaluations on form factors of tangible magic lenses.",
                    "Evaluation of three input techniques for selection and annotation of physical objects through an augmented reality view.",
                    "Automatic online walls detection for immediate use in AR tasks.",
                    "Predicting and estimating the accuracy of n-occular optical tracking systems.",
                    "Hybrid tracking algorithms for planar and non-planar structures subject to illumination changes.",
                    "Online camera pose estimation in partially known and dynamic scenes.",
                    "An all-in-one solution to geometric and photometric calibration.",
                    "A registration evaluation system using an industrial robot.",
                    "Spatial relationship patterns: elements of reusable tracking and calibration systems.",
                    "Performance analysis of an outdoor augmented reality tracking system that relies upon a few mobile beacons.",
                    "A mobile markerless AR system for maintenance and repair.",
                    "Going out: robust model-based tracking for outdoor augmented reality.",
                    "LightSense: enabling spatially aware handheld interaction devices.",
                    "Interactive laser-projection for programming industrial robots.",
                    "Photometric inconsistency on a mixed-reality face.",
                    "Texture overlay for virtual clothing based on PCA of silhouettes.",
                    "Ubiquitous animated agents for augmented reality.",
                    "Visualizing and navigating complex situated hypermedia in augmented and virtual reality.",
                    "Using aerial photographs for improved mobile AR annotation.",
                    "Implementation of god-like interaction techniques for supporting collaboration between outdoor AR and indoor tabletop users.",
                    "A 2D-3D integrated interface for mobile robot control using omnidirectional images and 3D geometric models.",
                    "The universal media book: tracking and augmenting moving surfaces with projected information.",
                    "\"Move the couch where?\" : developing an augmented reality multimodal interface.",
                    "High-fidelity visuo-haptic interaction with virtual objects in multi-modal AR systems.",
                    "An event architecture for distributed interactive multisensory rendering.",
                    "Enhanced visual realism by incorporating camera image effects.",
                    "Interactive context-driven visualization tools for augmented reality.",
                    "Augmented reality based on estimation of defocusing and motion blurring from captured images.",
                    "Notational-based prototyping of mixed interactions.",
                    "Transitional interface: concept, issues and framework.",
                    "Visualization of sensor data using mobile phone augmented reality.",
                    "Mobile augmented reality interaction techniques for authoring situated media on-site.",
                    "Mobile pointing and input system using active marker.",
                    "Mixed reality pre-visualization and camera-work authoring in filmmaking.",
                    "Viewpoint stabilization for live collaborative video augmentations.",
                    "Support system for guitar playing using augmented reality display.",
                    "Using backlight intensity for device identification.",
                    "User experience and acceptance of a mixed reality system in a naturalistic setting - a case study.",
                    "Tag detection algorithm for improving the instability problem of an augmented reality.",
                    "Augmented reality as a comparison tool in automotive industry.",
                    "Robust gloves for 3D interaction in mobile outdoor AR environments.",
                    "Texture generation over the marker area.",
                    "Markerless augmented reality for cubic panorama sequences."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ISMAR 2005",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2005",
                "sub_name": "Fourth IEEE / ACM International Symposium on Mixed and Augmented Reality (ISMAR 2005), 5-8 October 2005, Vienna, Austria.",
                "count": 57,
                "papers": [
                    "Message from the General Chairs.",
                    "Message from the Program Chairs.",
                    "Organizing Committee.",
                    "Steering Committee and Area Chairs.",
                    "Program Committee.",
                    "Additional Reviewers.",
                    "Support.",
                    "Workshop.",
                    "Panel.",
                    "Mixed Reality Research: The European Dimension.",
                    "The Art of Technology and the Future of MR: Integrating an Artistic Approach to Transform the Next Generation of Mixed and Augmented Reality.",
                    "The Art of Nurturing Citizen Scientists through Mixed Reality.",
                    "Enabling View-Dependent Stereoscopic Projection in Real Environments.",
                    "ASTOR: An Autostereoscopic Optical See-through Augmented Reality System.",
                    "Simulation-Based Design and Rapid Prototyping of a Parallax-Free, Orthoscopic Video See-Through Head-Mounted Display.",
                    "A Polarized Head-Mounted Projective Display.",
                    "Synchronizing 3D Movements for Quantitative Comparison and Simultaneous Visualization of Actions.",
                    "Authoring and User Interaction for the Production of Wave Field Synthesis Content in an Augmented Reality System.",
                    "ARVino - Outdoor Augmented Reality Visualisation of Viticulture GIS Data.",
                    "Experimental Evaluation of an Augmented Reality Visualization for Directing a Car Driver's Attention.",
                    "Adaptive Line Tracking with Multiple Hypotheses for Augmented Reality.",
                    "A Balanced Approach to 3D Tracking from Image Streams.",
                    "Face to Face Collaborative AR on Mobile Phones.",
                    "Evaluation of Mixed-Space Collaboration.",
                    "Enhanced Eyes for Better Gaze-Awareness in Collaborative Mixed Reality.",
                    "Augmented Foam: A Tangible Augmented Reality for Product Design.",
                    "Immersive Mixed-Reality Configuration of Hybrid User Interfaces.",
                    "AR Karaoke: Acting in Your Favorite Scenes.",
                    "Localisation and Interaction for Augmented Maps.",
                    "Lens Model Selection for a Markerless AR Tracking System.",
                    "Augmenting Deformable Objects in Real-Time.",
                    "A Hybrid and Linear Registration Method Utilizing Inclination Constraint.",
                    "Encoded LED System for Optical Trackers.",
                    "Calibration Errors in Augmented Reality: A Practical Study.",
                    "Novel View Generation from Multiple Omni-Directional Videos.",
                    "A Pipeline for Rapidly Incorporating Real Objects into a Mixed Environment.",
                    "Augmented Reality Techniques in Games.",
                    "The Synthetic Character Ritchie: First Steps Towards a Virtual Companion for Mixed Reality.",
                    "The SQUASH 1000 Tangible User Interface System.",
                    "Autocalibration of an Electronic Compass for Augmented Reality.",
                    "A Mediated Reality Environment Using a Loose and Sketchy Rendering Technique.",
                    "Reality Tooning: Fast Non-Photorealism for Augmented Video Streams.",
                    "Camera-Marker Alignment Framework and Comparison with Hand-Eye Calibration for Augmented Reality Applications.",
                    "Projected Augmentation II - A Scalable Architecture for Multi Projector Based AR-Systems Based on \"Projected Applications\".",
                    "Annotating User-Viewed Objects for Wearable AR Systems.",
                    "Specular Reflection Elimination for Projection-Based Augmented Reality.",
                    "ARpm: An Augmented Reality Interface for Polygonal Modeling.",
                    "AR Storyboard: An Augmented Reality Based Interactive Storyboard Authoring Tool.",
                    "Shading and Shadowing of Architecture in Mixed Reality.",
                    "A Hybrid Image-Based and Model-Based Telepresence System Using Two-Pass Video Projection onto a 3D Scene Model.",
                    "Real-Time Rendering of Realistic Trees in Mixed Reality.",
                    "A Step Towards a Multimodal AR Interface: A New Handheld Device for 3D Interaction.",
                    "Spatial Measurements for Medical Augmented Reality.",
                    "Product Associated Displays in a Shopping Scenario.",
                    "Butterfly Effect: An Augmented Reality Puzzle Game.",
                    "Driving View Simulation Synthesizing Virtual Geometry and Real Images in an Experimental Mixed-Reality Traffic Space.",
                    "Design and Implementation of a Widget Set for Steerable Projector-Camera Units."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ISMAR 2004",
        "info": "Arlington, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2004",
                "sub_name": "3rd IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR 2004), 2-5 November 2004, Arlington, VA, USA.",
                "count": 56,
                "papers": [
                    "The Transcendent Greek.",
                    "Augmenting This ... Augmented That: Maximizing Human Performance.",
                    "OSGAR: A Scene Graph with Uncertain Transformations.",
                    "A Compact Optical See-Through Head-Worn Display with Occlusion Support.",
                    "Projected Augmentation - Augmented Reality using Rotatable Video Projectors.",
                    "Sensor Fusion and Occlusion Refinement for Tablet-Based AR.",
                    "ombining Edge and Texture Information for Real-Time Accurate 3D Camera Tracking.",
                    "Handling Uncertain Sensor Data in Vision-Based Camera Tracking.",
                    "Display-Relative Calibration for Optical See-Through Head-Mounted Displays.",
                    "Automated Initialization for Marker-Less Tracking: A Sensor Fusion Approach.",
                    "A Marker Calibration Method Utilizing A Priori Knowledge on Marker Arrangement.",
                    "Embedding Imperceptible Patterns into Projected Images for Simultaneous Acquisition and Display.",
                    "Scene Modelling, Recognition and Tracking with Invariant Image Features.",
                    "A Method for Designing Marker-Based Tracking Probes.",
                    "Collaborative Mixed Reality Visualization of an Archaeological Excavation.",
                    "Agents That Talk And Hit Back: Animated Agents in Augmented Reality.",
                    "Outdoor See-Through Vision Utilizing Surveillance Cameras.",
                    "Augmented Reality Working Planes: A Foundation for Action and Construction at a Distance.",
                    "Immersive Authoring of Tangible Augmented Reality Applications.",
                    "Online Estimation of Trifocal Tensors for Augmenting Live Video.",
                    "Ubiquitous Tracking for Augmented Reality.",
                    "A Head Tracking Method Using Bird's-Eye View Camera and Gyroscope.",
                    "FlightTracker: A Novel Optical/Inertial Tracker for Cockpit Enhanced Vision.",
                    "Automatic Determination of Text Readability over Textured Backgrounds for Augmented Reality Systems.",
                    "Interactive Tools for Virtual X-Ray Vision in Mobile Augmented Reality.",
                    "Recording and Reproducing High Order Surround Auditory Scenes for Mixed and Augmented Reality.",
                    "Video See-Through AR on Consumer Cell-Phones.",
                    "Rendering of Highly Polygonal Augmented Reality Applications on a Scalable PC-Cluster Architecture.",
                    "An Augmented Reality System for Treating Psychological Disorders: Application to Phobia to Cockroaches.",
                    "Projection Matrix Decomposition in AR - A Study with Access3D.",
                    "Accuracy in Optical Tracking with Fiducial Markers: An Accuracy Function for ARToolKit.",
                    "A Texture Based Time Delay Compensation Method for Augmented Reality.",
                    "3D Modeling of Wide Area Outdoor Environments by Integrating Omnidirectional Range and Color Images.",
                    "Real-Time Markerless Human Body Tracking Using Colored Voxels and 3-D Blobs.",
                    "Implementing MR-based Interaction Techniques for Manipulating 2D Visualizations in 3D Information Space.",
                    "Augmented Standardized Patients Now Virtually a Reality.",
                    "Invisible Marker Tracking for AR.",
                    "An Augmented Reality based Simulation of Obstetric Forceps Delivery.",
                    "Easing the Transition Between Multiple Trackers.",
                    "Virtual Reality and Augmented Reality in Digestive Surgery.",
                    "Designing Backpacks for High Fidelity Mobile Outdoor Augmented Reality.",
                    "Making Tracking Technology Accessible in a Rapid Prototyping Environment.",
                    "An AR Workbench for Experimenting with Attentive User Interfaces.",
                    "Augmented Reality in Support of Interaction for Location-Aware Applications.",
                    "Annotation-Based Assistance System for Unmanned Helicopter with Wearable Augmented Reality Environment.",
                    "The AR Apprenticeship: Replication and Omnidirectional Viewing of Subtle Movements.",
                    "Rapid Development of Expressive AR Applications.",
                    "The Effect that Haptically Perceiving a Projection Augmented Model has on the Perception of Size.",
                    "A Multi-Camera 6-DOF Pose Tracker.",
                    "Virtual Training for Welding.",
                    "Level of Detail Interfaces.",
                    "Vision-Based Augmented Reality for Pilot Guidance in Airport Runways and Taxiways.",
                    "Developing AR Applications with ARToolKit.",
                    "Advanced Visual Tracking.",
                    "Spatial Augmented Reality.",
                    "Extreme MR: Going Beyond Reality to Create Extreme Multi-Modal Mixed Reality for Entertainment, Training and Education."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "ISMAR 2003",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2003",
                "sub_name": "2003 IEEE / ACM International Symposium on Mixed and Augmented Reality (ISMAR 2003), 7-10 October 2003, Tokyo, Japan.",
                "count": 78,
                "papers": [
                    "Industrial Augmented Reality(IAR): Challenges in Design and Commercialization of Killer Apps.",
                    "The Great Buddha Project: Modeling Cultural Heritage for VR Systems through Observation.",
                    "Real-Time Localisation and Mapping with Wearable Active Vision.",
                    "Predicting Accuracy in Pose Estimation for Marker-based Tracking.",
                    "A real-time tracker for markerless augmented reality.",
                    "Robust Vision-Based Registration Utilizing Bird's-Eye View with User's View.",
                    "Resolving Multiple Occluded Layers in Augmented Reality.",
                    "Evaluating Label Placement for Augmented Reality View Management.",
                    "The Effects of Shadow Representation of Virtual Objects in Augmented Reality.",
                    "Using Augmented Reality for Visualizing Complex Graphs in Three Dimensions.",
                    "Fully Automated and Stable Registration for Augmented Reality Applications.",
                    "Personal Positioning based on Walking Locomotion Analysis with Self-Contained Sensors and a Wearable Camera.",
                    "Robust Visual Tracking for Non-Instrumented Augmented Reality.",
                    "Herding Sheep: Live System Development for Distributed Augmented Reality.",
                    "An Occlusion-Capable Optical See-through Head Mount Display for Supporting Co-located Collaboration.",
                    "A Tracker Alignment Framework for Augmented Reality.",
                    "Miniaturization, Calibration & Accuracy Evaluation of a Hybrid Self-Tracker.",
                    "Evaluation of Calibration Procedures for Optical See-Through Head-Mounted Displays.",
                    "3D Reconstruction of Stereo Images for Interaction between Real and Virtual Worlds.",
                    "Live Mixed-Reality 3D Video in Soccer Stadium.",
                    "Immersive Observation of Virtualized Soccer Match at Real Stadium Model.",
                    "Consistent Illumination within Optical See-Through Augmented Environments.",
                    "Photorealistic rendering for augmented reality using environment illumination.",
                    "Multiview Paraperspective Projection Model for Diminished Reality.",
                    "ID CAM: A Smart Camera for Scene Capturing and ID Recognition.",
                    "Authoring of a Mixed Reality Assembly Instructor for Hierarchical Structures.",
                    "An Object-Oriented Software Architecture for 3D Mixed Reality Application.",
                    "Marker-less Vision Based Tracking for Mobile Augmented Reality.",
                    "Fiducial-less 3-D Object Tracking in AR Systems Based on the Integration of Top-down and Bottom-up Approaches and Automatic Database Addition.",
                    "A Coded Visual Marker for Video Tracking System Based on Structured Image Analysis.",
                    "Computer Vision Based Head Tracking from Re-configurable 2D Markers for AR.",
                    "Hybrid Indoor and Outdoor Tracking for Mobile 3D Mixed Reality.",
                    "Inertial and magnetic sensing of human movement near ferromagnetic materials.",
                    "A High Performance AR System for Medical Applications.",
                    "Stereo depth assessment experiment for microscope-based surgery.",
                    "Results of a Study on Software Architectures for Augmented Reality Systems.",
                    "Implementation of an Augmented Reality System on a PDA.",
                    "Displaying Digital Documents on Real Paper Surface with Arbitrary Shape.",
                    "Towards a Usable Stereoscopic Augmented Reality Interface for the Manipulation of Virtual Cursors.",
                    "The CREATE Project: Mixed Reality for Design, Education, and Cultural Heritage with a Constructivist Approach.",
                    "A Mixed Reality System with Visual and Tangible Interaction Capability - Application to Evaluating Automobile Interior Design.",
                    "Image Overlay on Optical See-Through Displays for Vehicle Navigation.",
                    "All-Around Display for Video Avatar in Real World.",
                    "An Augmented Virtuality Approach to 3D Videoconferencing.",
                    "Telepresence System Using High-Resolution Omnidirectional Movies and a Reactive Display.",
                    "Case Studies in Application of Augmented Reality in Future Media Production.",
                    "3D Audio Augmented Reality: Implementation and Experiments.",
                    "ARWin-A Desktop Augmented Reality Window Manager.",
                    "SenseShapes: Using Statistical Geometry for Object Selection in a Multimodal Augmented Reality System.",
                    "Interactive Mediated Reality.",
                    "User Interaction in Mixed Reality Interactive Storytelling.",
                    "Graphic Shadow: Augmenting Your Shadow on the Floor.",
                    "A Step Forward in Manual Welding: Demonstration of Augmented Reality Helmet.",
                    "BlueTrak-A Wireless Six Degrees of Freedom Motion Tracking System.",
                    "Model-Based Tracking with Stereovision for AR.",
                    "Real-Time Visual Workspace Localisation and Mapping for a Wearable Robot.",
                    "Tinmith-Mobile Outdoor Augmented Reality Modelling Demonstration.",
                    "Augmented Reality for Programming Industrial Robots.",
                    "A Wearable Mixed Reality with an On-Board Projector.",
                    "A LCD Cube Transporting High Dynamic Range Light Environments.",
                    "Capturing Water and Sound Waves to Interact with Virtual Nature.",
                    "IP Network Designer: Interface for IP Network Simulation.",
                    "DART: The Designer's Augmented Reality Toolkit.",
                    "WireAR-Legacy Applications in Augmented Reality.",
                    "Collaborative Work with Volumetric Data Using Augmented Reality Videoconferencing.",
                    "Augmented Reality Kanji Learning.",
                    "Augmented Reality Live-Action Compositing.",
                    "The Augmented Composer Project: The Music Table.",
                    "A City-Planning System Based on Augmented Reality with a Tangible Interface.",
                    "A Wearable Augmented Reality System with Personal Positioning Based on Walking Locomotion Analysis.",
                    "A Wearable Augmented Reality System for Navigation Using Positioning Infrastructures and a Pedometer.",
                    "Real-Time Augmented Face.",
                    "Optical Camouflage Using Retro-Reflective Projection Technology.",
                    "A Mirror Metaphor Interaction System: Touching Remote Real Objects in an Augmented Reality Environment.",
                    "Textured Shadow.",
                    "MIXED FANTASY: Exhibition of Entertainment Research for Mixed Reality.",
                    "BLADESHIPS: An Interactive Attraction in Mixed Reality.",
                    "Jellyfish Party: Blowing Soap Bubbles in Mixed Reality Space."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "ISMAR 2002",
        "info": "Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2002",
                "sub_name": "2002 IEEE / ACM International Symposium on Mixed and Augmented Reality (ISMAR 2002), 30 September - 1 October 2002, Darmstadt, Germany.",
                "count": 53,
                "papers": [
                    "ARVIKA - Augmented Reality for Development, Production and Service.",
                    "3D Live: Real Time Captured Content for Mixed Reality.",
                    "The Use of Dense Stereo Range Data in Augmented Reality.",
                    "Circular Data Matrix Fiducial System and Robust Image Processing for a Wearable Vision-Inertial Self-Tracker.",
                    "Accurate Camera Calibration for Off-line, Video-Based Augmented Reality.",
                    "Tracking with Omni-Directional Vision for Outdoor AR Systems.",
                    "Interactive Theatre Experience in Embodied + Wearable Mixed Reality Space.",
                    "The Control Unit for a Head Mounted Operating Microscope Used for Augmented Reality Visualization in Computer Aided Sugery.",
                    "Fata Morgana - A Presentation System for Product Design.",
                    "Spacedesign: A Mixed Reality Workspace for Aesthetic Industrial Design.",
                    "Visual Marker Detection and Decoding in AR Systems: A Comparative Study.",
                    "Interactive Multi-Marker Calibration for Augmented Reality Applications.",
                    "Hand Tracking for Interactive Pattern-Based Augmented Reality.",
                    "Single Camera Tracking of Marker Clusters: Multiparameter Cluster Optimization and Experimental Verification.",
                    "Communication Behaviors of Co-Located Users in Collaborative AR Interfaces.",
                    "Diminishing Head-Mounted Display for Shared Mixed Reality.",
                    "Alternative Tools for Tangible Interaction: A Usability Evaluation.",
                    "Practical Solutions for Calibration of Optical See-Through Devices.",
                    "Calibration of a Head-Mounted Projective Display for Augmented Reality Systems.",
                    "Occlusion Shadows: Using Projected Light to Generate Realistic Occlusion Effects for View-Dependent Optical See-Through Displays.",
                    "Tangible Bits: Designing the Seamless Interface between People, Bits, and Atoms.",
                    "Augmented Urban Planning Workbench: Overlaying Drawings, Physical Models and Digital Simulation.",
                    "Augmented-Reality Visualizations Guided by Cognition: Perceptual Heuristics for Combining Visible and Obscured Information.",
                    "A Study for Image-Based Integrated Virtual Environment.",
                    "A Pragmatic Approach to Augmented Reality Authoring.",
                    "MR Platform: A Basic Body on Which Mixed Reality Applications Are Built.",
                    "A Concept for the Application of Augmented Reality in Manual Gas Metal Arc Welding.",
                    "Augmented Chemistry: An Interactive Educational Workbench.",
                    "A Flexible Tracking Concept Applied to Medical Scenarios Using an AR Window.",
                    "Archeoguide: System Architecture of a Mobile Outdoor Augmented Reality System.",
                    "Experimental Evaluation of Augmented Reality in Object Assembly Task.",
                    "Seeing Eye to Eye: A Shared Mediated Reality Using EyeTap Devices and the VideoOrbits Gyroscopic Head Tracker.",
                    "Bread Crumbs: A Technique for Modelling Large Outdoor Ground Features.",
                    "Stereo Augmentation of Simulation Results on a Projection Wall by Combining Two Basic ARVIKA Systems.",
                    "Inexpensive Non-Sensor Based Augmented Reality Modeling of Curves and Surfaces in Physical Space.",
                    "Exploring Humanistic Intelligence Through Physiologically Mediated Reality.",
                    "Model-Based Visual Tracking for Outdoor Augmented Reality Applications.",
                    "Geometric and Photometric Registration for Real-Time Augmented Reality.",
                    "Testable Design Representations for Mobile Augmented Reality Authoring.",
                    "Reconstructing While Registering: A Novel Approach for Markerless Augmented Reality.",
                    "Marker-less Tracking for AR: A Learning-Based Approach.",
                    "Online 6 DOF Augmented Reality Registration from Natural Features.",
                    "3D Live: Real Time Captured Content for Mixed Reality.",
                    "Interactive Theatre Experience in Embodied + Wearable Mixed Reality Space.",
                    "Spacedesign: A Mixed Reality Workspace for Aesthetic Industrial Design.",
                    "Alternative Tools for Tangible Interaction: A Usability Evaluation.",
                    "Occlusion Shadows: Using Projected Light to Generate Ralistic Occlusion Effects for View-Dependent Optical See-Through Approaches.",
                    "Augmented-Reality Visualizations Guided by Cognition: Perceptual Heuristics for Combining Visual and Obscured Information.",
                    "MR Platform: A Basic Body on Which Mixed Reality Applications are Built.",
                    "Augmented Chemistry: An Interactive Educational Workbench.",
                    "Bread Crumbs: A Technique for Modelling Large Outdoor Ground Features.",
                    "Stereo Augmentation of Simulation Results on a Projection Wall by Combining Two Basic ARVIKA Systems.",
                    "Model-Based Visual Tracking for Outdoor Augmented Reality Applications."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "ISAR 2001",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2001",
                "sub_name": "4th International Symposium on Augmented Reality (ISAR 2001), 29-30 October 2001, New York, NY, USA.",
                "count": 31,
                "papers": [
                    "Dynamic Superimposition of Synthetic Objects on Rigid and Simple-Deformable Real Objects.",
                    "Real Time Tomographic Reflection: Phantoms for Calibration and Biopsy.",
                    "Current Status of the Varioscope AR, a Head-Mounted Operating Microscope for Computer-Aided Surgery.",
                    "Augmented Reality Visualization of Ultrasound Images: System Description, Calibration, and Feature.",
                    "Design of a Component-Based Augmented Reality Framework.",
                    "Finger Tracking for Interaction in Augmented Environments.",
                    "A Hybrid Registration Method for Outdoor Augmented Reality.",
                    "Augmented Reality in a Wide Area Sentient Environment.",
                    "Markerless Augmented Reality with a Real-Time Affine Region Tracker.",
                    "Extendible Tracking by Line Auto-Calibration.",
                    "Distributed Low-Latency Rendering for Mobile AR.",
                    "Mobile Collaborative Augmented Reality.",
                    "Augmented Maintenance of Powerplants: A Prototyping Case Study of a Mobile AR System.",
                    "Dynamic Virtual Convergence for Video See-through Head-Mounted Displays: Maintaining Maximum Stereo Overlap throughout a Close-Range Work Space.",
                    "Optical See-through Calibration with Vision-Based Trackers: Propagation of Projection Matrices.",
                    "A New System for Online Quantitative Evaluation of Optical See-through Augmentation.",
                    "MR2 (MR Square): A Mixed-Reality Meeting Room.",
                    "Testing Information Delivery Methods Using Augmented Realit.",
                    "A Quick Method for Synthesizing Photorealistic Color Images under Various Illumination Conditions.",
                    "Real-Time 3D Object Recognition for Automatic Tracker Initialization.",
                    "Tinmith-evo5 -- An Architecture for Supporting Mobile Augmented Reality Environments.",
                    "Taking AR into Large Scale Industrial Environments: Navigation and Information Access with Mobile Computers.",
                    "Mobile AR4ALL.",
                    "Linear Solutions for Visual Augmented Reality Registration.",
                    "Augmented Reality (AR) for Assembly Processes?? An Experimental Evaluation.",
                    "Illuminating the Mixed Reality Stage: Applying Complex Lighting Conditions to AR.",
                    "Real-Time and Markerless Vision-Based Tracking for Outdoor Augmented Reality Applications.",
                    "3D Reconstruction of the Operating Field for Image Overlay in 3D-Endoscopic Surgery.",
                    "Augmented Reality as a New Media Experience.",
                    "Dynamic Shader Lamps: Painting on Movable Objects.",
                    "Using a Head-Mounted Projective Display in Interactive Augmented Environments."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "ISAR 2000",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/2000",
                "sub_name": "Proceedings of the IEEE and ACM International Symposium on Augmented Reality, ISAR 2000, October 5-6, 2000, Munich, Germany.",
                "count": 23,
                "papers": [
                    "Information filtering for mobile augmented reality.",
                    "A wearable augmented reality testbed for navigation and control, built solely with commercial-off-the-shelf (COTS) hardware.",
                    "Bridging multiple user interface dimensions with augmented reality.",
                    "The augmented man.",
                    "Distributed user tracking concepts for augmented reality applications.",
                    "Augmented workspace: designing an AR testbed.",
                    "Development of the Varioscope AR. A see-through HMD for computer-aided surgery.",
                    "An optical see-through display for mutual occlusion of real and virtual environments.",
                    "Development of a stereo video see-through HMD for AR systems.",
                    "A mobile Passive Augmented Reality Device - mPARD.",
                    "Adapting to dynamic registration errors using level of error (LOE) filtering.",
                    "Matching buildings: pose estimation in an urban environment.",
                    "Augmenting buildings with infrared information.",
                    "A stereo vision-based augmented reality system with an inertial sensor.",
                    "Virtual property lines drawing on the monitor for observation of unmanned dam construction site.",
                    "View-independent scene acquisition for tele-presence.",
                    "Virtual object manipulation on a table-top AR environment.",
                    "Markerless tracking using planar structures in the scene.",
                    "Weakly calibrated video-based augmented reality: embedding and rendering through virtual camera.",
                    "Handling occlusion in augmented reality systems: a semi-automatic method.",
                    "Single point active alignment method (SPAAM) for optical see-through HMD calibration for AR.",
                    "Autocalibration of an electronic compass in an outdoor augmented reality system.",
                    "Optical see-through HMD calibration: a stereo method validated with a video see-through system."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "IWAR 1999",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ismar/1999",
                "sub_name": "2nd IEEE and ACM International Workshop on Augmented Reality, IWAR '99, San Francisco, CA, USA, October 20-21, 1999.",
                "count": 15,
                "papers": [
                    "Vision-based pose computation: robust and accurate augmented reality tracking.",
                    "Building a hybrid tracking system: integration of optical and magnetic tracking.",
                    "An adaptive estimator for registration in augmented reality.",
                    "Enveloping users and computers in a collaborative 3D augmented reality.",
                    "Integrating virtual and augmented realities in an outdoor application.",
                    "A feasible low-power augmented-reality terminal.",
                    "Table-top spatially-augmented realty: bringing physical models to life with projected imagery.",
                    "A method for calibrating see-through head-mounted displays for AR.",
                    "Marker tracking and HMD calibration for a video-based augmented reality conferencing system.",
                    "Calibration propagation for image augmentation.",
                    "Registration with a zoom lens camera for augmented reality applications.",
                    "Photometric image-based rendering for virtual lighting image synthesis.",
                    "Scene augmentation via the fusion of industrial drawings and uncalibrated images with a view to marker-less calibration.",
                    "Merging visible and invisible: two Camera-Augmented Mobile C-arm (CAMC) applications.",
                    "The importance of being mobile: some social consequences of wearable augmented reality systems."
                ]
            }
        ]
    }
]