[
    {
        "name": "JVCIR",
        "year": "2022",
        "info": "2022: Volumes\n82,\n83,",
        "count": 52,
        "papers": [
            "Proximal-Gen for fast compressed sensing recovery.",
            "Complex Network-based features extraction in RGB-D human action recognition.",
            "DVL2021: An ultra high definition video dataset for perceptual quality study.",
            "Multi-oriented run length based static and dynamic features fused with Choquet fuzzy integral for human fall detection in videos.",
            "A comprehensive framework of multiple semantics preservation in neural style transfer.",
            "3DFP-FCGAN: Face completion generative adversarial network with 3D facial prior.",
            "CDGAN: Cyclic Discriminative Generative Adversarial Networks for image-to-image transformation.",
            "Optimization and regularization of complex task decomposition for blind removal of multi-factor degradation.",
            "Human skeleton representation for 3D action recognition based on complex network coding and LSTM.",
            "A novel active shape model-based DeepNeural network for age invariance face recognition.",
            "Cross-dataset emotion recognition from facial expressions through convolutional neural networks.",
            "Single image shadow detection via uncertainty analysis and GCN-based refinement strategy.",
            "Attention integrated hierarchical networks for no-reference image quality assessment.",
            "SpyGAN sketch: Heterogeneous Face Matching in video for crime investigation.",
            "Tamper video detection and localization using an adaptive segmentation and deep network technique.",
            "A new head pose tracking method based on stereo visual SLAM.",
            "Visual cryptography scheme for secret color images with color QR codes.",
            "Fall detection using body geometry and human pose estimation in video sequences.",
            "A contrast improved OR and XOR based (k, n) visual cryptography scheme without pixel expansion.",
            "Visual secret sharing scheme with (n, n) threshold based on WeChat Mini Program codes.",
            "A novel partial-to-partial registration method based on sampling network.",
            "Cross-layer progressive attention bilinear fusion method for fine-grained visual classification.",
            "QoE optimization for HTTP adaptive streaming: Performance evaluation of MEC-assisted and client-based methods.",
            "Human identification system using 3D skeleton-based gait features and LSTM model.",
            "Two-stream encoder-decoder network for localizing image forgeries.",
            "Person re-identification based on deep learning - An overview.",
            "M2OVQA: Multi-space signal characterization and multi-channel information aggregation for quality assessment of compressed omnidirectional videos.",
            "Deep network based stereoscopic image quality assessment via binocular summing and differencing.",
            "Reversal of pixel rotation: A reversible data hiding system towards cybersecurity in encrypted images.",
            "Deep low-rank feature learning and encoding for cross-age face recognition.",
            "DCA-CycleGAN: Unsupervised single image dehazing using Dark Channel Attention optimized CycleGAN.",
            "A-contrario framework for detection of alterations in varnished surfaces.",
            "A CBIR system based on saliency driven local image features and multi orientation texture features.",
            "Graph-based relational reasoning in a latent space for skeleton-based action recognition.",
            "Rotation-aware correlation filters for robust visual tracking.",
            "Security measurement of a medical communication scheme based on chaos and DNA coding.",
            "Multi-domain residual encoder-decoder networks for generalized compression artifact reduction.",
            "Collaborative Distribution Alignment for 2D image-based 3D shape retrieval.",
            "Accurate bounding-box regression with distance-IoU loss for visual tracking.",
            "Exemplar-based image inpainting using adaptive two-stage structure-tensor based priority function and nonlocal filtering.",
            "Local perspective based synthesis for vehicle re-identification: A transformation state adversarial method.",
            "Attention mechanism enhancement algorithm based on cycle consistent generative adversarial networks for single image dehazing.",
            "Video frame deletion detection based on time-frequency analysis.",
            "A self-embedding secure fragile watermarking scheme with high quality recovery.",
            "Detecting moving object from dynamic background video sequences via simulating heat conduction.",
            "Robust object tracking via deformation samples generator.",
            "Learning discriminative representations for multi-label image recognition.",
            "TGP-PCQA: Texture and geometry projection based quality assessment for colored point clouds.",
            "BGGMM-HMT based locally optimum image watermark detector in high-order NSST difference domain.",
            "Multimodal face aging framework via learning disentangled representation.",
            "A novel dynamic gesture understanding algorithm fusing convolutional neural networks with hand-crafted features.",
            "Optimized convolutional pose machine for 2D hand pose estimation."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2021",
        "info": "2021: Volumes\n74,\n75,\n76,\n77,\n78,\n79,\n80,\n81",
        "count": 233,
        "papers": [
            "Gradient-based conditional generative adversarial network for non-uniform blind deblurring via DenseResNet.",
            "Hypergraph-regularized sparse representation for single color image super resolution.",
            "Unsupervised video object segmentation with distractor-aware online adaptation.",
            "Text to photo-realistic image synthesis via chained deep recurrent generative adversarial network.",
            "Person Re-identification with Global-Local Background_bias Net.",
            "Densely connected network with improved pyramidal bottleneck residual units for super-resolution.",
            "Integrating saliency with fuzzy thresholding for brain tumor extraction in MR images.",
            "An efficient copy move forgery detection using adaptive watershed segmentation with AGSO and hybrid feature extraction.",
            "An anisotropic reference matrix for image steganography.",
            "A novel (k1, k2, n)-threshold two-in-one secret image sharing scheme for multiple secrets.",
            "Sentiment-based sub-event segmentation and key photo selection.",
            "Low-rank embedded orthogonal subspace learning for zero-shot classification.",
            "Conditional generative adversarial network for EEG-based emotion fine-grained estimation and visualization.",
            "Non-maximum suppression for object detection based on the chaotic whale optimization algorithm.",
            "Motion vector modification distortion analysis-based payload allocation for video steganography.",
            "Multiview video summarization using video partitioning and clustering.",
            "A Model-based dehazing scheme for unmanned aerial vehicle system using radiance boundary constraint and graph model.",
            "Noise reduction for sonar images by statistical analysis and fields of experts.",
            "Two in One Image Secret Sharing Scheme (TiOISSS) for extended progressive visual cryptography using simple modular arithmetic operations.",
            "Attention-based contextual interaction asymmetric network for RGB-D saliency prediction.",
            "Block-based image matching for image retrieval.",
            "Circular intra prediction for 360 degree video coding.",
            "Optimal feature selection-based biometric key management for identity management system: Emotion oriented facial biometric system.",
            "Image annotation based on multi-view robust spectral clustering.",
            "Reliable fusion of ToF and stereo data based on joint depth filter.",
            "Single image dehazing using a new color channel.",
            "Semantic-aware visual attributes learning for zero-shot recognition.",
            "Single image dehazing using improved cycleGAN.",
            "High capacity reversible data hiding in encrypted images using SIBRW and GCC.",
            "No-reference quality assessment of HEVC video streams based on visual memory modelling.",
            "Adaptive convolution kernel for artificial neural networks.",
            "Strong ghost removal in multi-exposure image fusion using hole-filling with exposure congruency.",
            "Facial expression recognition using frequency multiplication network with uniform rectangular features.",
            "Image super-resolution based on deep neural network of multiple attention mechanism.",
            "Exploiting color for graph-based 3D point cloud denoising.",
            "Person re-identification from appearance cues and deep Siamese features.",
            "Saliency detection via cross-scale deep inference.",
            "Interactive information module for person re-identification.",
            "Various density light field image coding based on distortion minimization interpolation.",
            "AdvCapsNet: To defense adversarial attacks based on Capsule networks.",
            "Real-time video super-resolution using lightweight depthwise separable group convolutions with channel shuffling.",
            "Single image deraining using Context Aggregation Recurrent Network.",
            "Revealing stable and unstable modes of denoisers through nonlinear eigenvalue analysis.",
            "Parallel-fusion LSTM with synchronous semantic and visual information for image captioning.",
            "Distance based kernels for video tensors on product of Riemannian matrix manifolds.",
            "Anomaly3D: Video anomaly detection based on 3D-normality clusters.",
            "Salient object detection via a boundary-guided graph structure.",
            "Lossless chain code compression with an improved Binary Adaptive Sequential Coding of zero-runs.",
            "Quality assessment for color correction-based stitched images via bi-directional matching.",
            "Gait recognition based on vision systems: A systematic survey.",
            "A minimal model for classification of rotated objects with prediction of the angle of rotation.",
            "Learning to predict the quality of distorted-then-compressed images via a deep neural network.",
            "Human pose estimation and its application to action recognition: A survey.",
            "Copy Move Forgery Detection based on double matching.",
            "High-capacity reversible data hiding in encrypted image based on Huffman coding and differences of high nibbles of pixels.",
            "Activity recognition in video sequences over qualitative abstracts of a diagram-based representation schema.",
            "Pain detection using batch normalized discriminant restricted Boltzmann machine layers.",
            "Reversible data hiding based on three shadow images using rhombus magic matrix.",
            "Steganalytic feature based adversarial embedding for adaptive JPEG steganography.",
            "Semantic loop closure detection based on graph matching in multi-objects scenes.",
            "Robust online multi-target visual tracking using a HISP filter with discriminative deep appearance learning.",
            "Long-term rate control for concurrent multipath real-time video transmission in heterogeneous wireless networks.",
            "A lightweight multi-scale aggregated model for detecting aerial images captured by UAVs.",
            "Multi-label image recognition by using semantics consistency, object correlation, and multiple samples.",
            "Fast and effective Keypoint-based image copy-move forgery detection using complex-valued moment invariants.",
            "Line-based visual odometry using local gradient fitting.",
            "Correlation filter via random-projection based CNNs features combination for visual tracking.",
            "Retraction notice to \"An iterative propagation based co-saliency framework for RGBD images\" [J. Vis. Commun. Image Represent. 59 (2019) 186-194].",
            "Discriminative semantic region selection for fine-grained recognition.",
            "A survey of reversible data hiding in encrypted images - The first 12 years.",
            "A joint cumulative distribution function and gradient fusion based method for dehazing of long shot hazy images.",
            "Depth-aware blending of smoothed images for Bokeh effect generation.",
            "A content-based late fusion approach applied to pedestrian detection.",
            "Gaussian Process-based Feature-Enriched Blind Image Quality Assessment.",
            "Person re-identification based on gait via Part View Transformation Model under variable covariate conditions.",
            "Learned Greedy Method (LGM): A novel neural architecture for sparse coding and beyond.",
            "Hybrid prediction-based pixel-value-ordering method for reversible data hiding.",
            "Image encryption using linear weighted fractional-order transform.",
            "Specular highlight region restoration using image clustering and inpainting.",
            "Siamese target estimation network with AIoU loss for real-time visual tracking.",
            "Multi-task learning with deformable convolution.",
            "Facial Expression Recognition through person-wise regeneration of expressions using Auxiliary Classifier Generative Adversarial Network (AC-GAN) based model.",
            "Weighted voting of multi-stream convolutional neural networks for video-based action recognition using optical flow rhythms.",
            "A bottom-up and top-down human visual attention approach for hyperspectral anomaly detection.",
            "MRANet: Multi-atrous residual attention Network for stereo image super-resolution.",
            "A review of video surveillance systems.",
            "Detecting facial manipulated videos based on set convolutional neural networks.",
            "Diverse Features Fusion Network for video-based action recognition.",
            "Statistical image watermarking using local RHFMs magnitudes and beta exponential distribution.",
            "A deep genetic algorithm for human activity recognition leveraging fog computing frameworks.",
            "Image deraining with Adversarial Residual Refinement Network.",
            "Contextual information enhanced convolutional neural networks for retinal vessel segmentation in color fundus images.",
            "Driver activity recognition by learning spatiotemporal features of pose and human object interaction.",
            "Underwater image super-resolution using multi-stage information distillation networks.",
            "TheiaNet: Towards fast and inexpensive CNN design choices for image dehazing.",
            "Deep multi-feature learning architecture for water body segmentation from satellite images.",
            "Air-writing recognition using reverse time ordered stroke context.",
            "Dual link distributed source coding scheme for the transmission of satellite hyperspectral imagery.",
            "An improved Gamma correction model for image dehazing in a multi-exposure fusion framework.",
            "Perceptual hash-based coarse-to-fine grained image tampering forensics method.",
            "A fast algorithm based on gray level co-occurrence matrix and Gabor feature for HEVC screen content coding.",
            "Attention-guided image captioning with adaptive global and local feature fusion.",
            "Combining Fields of Experts (FoE) and K-SVD methods in pursuing natural image priors.",
            "Subpixel rendering for diamond-shaped PenTile displays using patch-based adaptive filters.",
            "Rethinking pre-training on medical imaging.",
            "Disocclusion filling for depth-based view synthesis with adaptive utilization of temporal correlations.",
            "Single image deblurring with cross-layer feature fusion and consecutive attention.",
            "Saliency detection via coarse-to-fine diffusion-based compactness with weighted learning affinity matrix.",
            "Facial parts swapping with generative adversarial networks.",
            "Learn from the past - sequentially one-to-one video deblurring network.",
            "Multi-view motion modelled deep attention networks (M2DA-Net) for video based sign language recognition.",
            "A comprehensive survey on computer vision based concepts, methodologies, analysis and applications for automatic gun/knife detection.",
            "Reversible data hiding in encrypted color images using cross-channel correlations.",
            "Stacking learning with coalesced cost filtering for accurate stereo matching.",
            "Stable self-attention adversarial learning for semi-supervised semantic image segmentation.",
            "Harnessing high-level concepts, visual, and auditory features for violence detection in videos.",
            "A ghostfree contrast enhancement method for multiview images without depth information.",
            "Siamese CNN-based rank learning for quality assessment of inpainted images.",
            "Classifier aided training for semantic segmentation.",
            "Cross-modal dynamic convolution for multi-modal emotion recognition.",
            "Revisiting the Iterative Ant-tree for color quantization algorithm.",
            "A directional margin paradigm for noise suppression in face recognition.",
            "A generic, cluster-centred lossless compression framework for joint auroral data.",
            "HP-VCS: A high-quality and printer-friendly visual cryptography scheme.",
            "EdgeGAN: One-way mapping generative adversarial network based on the edge information for unpaired training set.",
            "Generative detect for occlusion object based on occlusion generation and feature completing.",
            "Who will receive the ball? Predicting pass recipient in soccer videos.",
            "Facial micro-expression recognition based on accordion spatio-temporal representation and random forests.",
            "Illumination-based adaptive saliency detection network through fusion of multi-source features.",
            "Recognition of user-dependent and independent static hand gestures: Application to sign language.",
            "Dynamic Dual-Peak Network: A real-time human detection network in crowded scenes.",
            "Wasserstein distance feature alignment learning for 2D image-based 3D model retrieval.",
            "3D reconstruction with auto-selected keyframes based on depth completion correction and pose fusion.",
            "A CNN model for real time hand pose estimation.",
            "LRGAN: Visual anomaly detection using GAN with locality-preferred recoding.",
            "Performance analysis of VVC intra coding.",
            "Privacy-preserving reversible data hiding based on quad-tree block encoding and integer wavelet transform.",
            "Joint model of gradient magnitude and Gabor features via Spatio-Temporal slice.",
            "Semantic meaning modulates object importance in human fixation prediction.",
            "Generalized multiple sparse information fusion for vehicle re-identification.",
            "Image compression optimized for 3D reconstruction by utilizing deep neural networks.",
            "Video hashing with secondary frames and invariant moments.",
            "Tile caching for scalable VR video streaming over 5G mobile networks.",
            "A survey on spatio-temporal framework for kinematic gait analysis in RGB videos.",
            "S&CNet: A lightweight network for fast and accurate depth completion.",
            "Are emotional objects visually salient? The Emotional Maps Database.",
            "Adaptive fractional motion and disparity estimation skipping in MV-HEVC.",
            "A regional distance regression network for monocular object distance estimation.",
            "Deep image compression with multi-stage representation.",
            "Atom specific multiple kernel dictionary based Sparse Representation Classifier for medium scale image classification.",
            "Generative image inpainting with salient prior and relative total variation.",
            "A comparative study between single and multi-frame anomaly detection and localization in recorded video streams.",
            "Beyond ITQ: Efficient binary multi-view subspace learning for instance retrieval.",
            "WavNet - Visual saliency detection using Discrete Wavelet Convolutional Neural Network.",
            "Superpixel alpha-expansion and normal adjustment for stereo matching.",
            "Dynamic texture analysis for detecting fake faces in video sequences.",
            "Variational optimization based single image dehazing.",
            "Region-level bit allocation for rate control of 360-degree videos using cubemap projection.",
            "GIFMarking: The robust watermarking for animated GIF based deep learning.",
            "SWS-DAN: Subtler WS-DAN for fine-grained image classification.",
            "SAF-Nets: Shape-Adaptive Filter Networks for 3D point cloud processing.",
            "Quality assessment of screen content images based on multi-stage dictionary learning.",
            "Sequence-tracker: Multiple object tracking with sequence features in severe occlusion scene.",
            "Amplitude based keyless optical encryption system using deep neural network.",
            "Instance search via instance level segmentation and feature representation.",
            "Stereoscopic image quality assessment considering visual mechanism and multi-loss constraints.",
            "Robust multimodal discrete hashing for cross-modal similarity search.",
            "Development of scale and illumination invariant feature detector with application to UAV attitude estimation.",
            "A salient object detection framework using linear quadratic regulator controller.",
            "An Interconnected Feature Pyramid Networks for object detection.",
            "Learning discriminative motion feature for enhancing multi-modal action recognition.",
            "Component-based metric learning for fully automatic kinship verification.",
            "Robust model adaption for colour-based particle filter tracking with contextual information.",
            "Multiple attention encoded cascade R-CNN for scene text detection.",
            "Multispectral background subtraction with deep learning.",
            "A novel deep learning framework for double JPEG compression detection of small size blocks.",
            "Depth completion towards different sensor configurations via relative depth map estimation and scale recovery.",
            "Sensor-based image manipulation localization with Discriminative Random fields and Graph Cut.",
            "Effective compressed sensing MRI reconstruction via hybrid GSGWO algorithm.",
            "Deep feature enhancing and selecting network for weakly supervised temporal action localization.",
            "Detection of moving objects using adaptive multi-feature histograms.",
            "Occlusion-robust online multi-object visual tracking using a GM-PHD filter with CNN-based re-identification.",
            "Sign language recognition based on global-local attention.",
            "Three Degree Binary Graph and Shortest Edge Clustering for re-ranking in multi-feature image retrieval.",
            "Sequential alignment attention model for scene text recognition.",
            "Using curved angular intra-frame prediction to improve video coding efficiency.",
            "Video object segmentation via random walks on two-frame graphs comprising superpixels.",
            "PSGU: Parametric self-circulation gating unit for deep neural networks.",
            "Distinguishing between natural and recolored images via lateral chromatic aberration.",
            "Blind image quality assessment with channel attention based deep residual network and extended LargeVis dimensionality reduction.",
            "Learning complementary Siamese networks for real-time high-performance visual tracking.",
            "Multi-scale attention network for image super-resolution.",
            "Internal and external spatial-temporal constraints for person reidentification.",
            "Camera style transformation with preserved self-similarity and domain-dissimilarity in unsupervised person re-identification.",
            "What and how well you exercised? An efficient analysis framework for fitness actions.",
            "Visible and thermal images fusion architecture for few-shot semantic segmentation.",
            "Indoor scene understanding based on manhattan and non-manhattan projection of spatial right-angles.",
            "Unsupervised person re-identification by Intra-Inter Camera Affinity Domain Adaptation.",
            "Towards better semantic consistency of 2D medical image segmentation.",
            "Residual attention-based tracking-by-detection network with attention-driven data augmentation.",
            "Label projection online hashing for balanced similarity.",
            "Scale aware remote sensing image enhancement using rolling guidance.",
            "Multi-ColorGAN: Few-shot vehicle recoloring via memory-augmented networks.",
            "Attention guided feature pyramid network for crowd counting.",
            "Adversarial steganography based on sparse cover enhancement.",
            "Geographical position spoofing detection based on camera sensor fingerprint.",
            "Video summary generation by visual shielding compressed sensing coding and double-layer affinity propagation.",
            "Stitched image quality assessment based on local measurement errors and global statistical properties.",
            "Multi-focus image fusion based on multi-scale sparse representation.",
            "Multi-frame co-saliency spatio-temporal regularization correlation filters for object tracking.",
            "Dynamic texture representation based on oriented magnitudes of Gaussian gradients.",
            "3-D Epanechnikov Mixture Regression in integral imaging compression.",
            "Improving UNIWARD distortion function via isotropic construction and hierarchical merging.",
            "Weighted truncated nuclear norm regularization for low-rank quaternion matrix completion.",
            "Augmented two stream network for robust action recognition adaptive to various action videos.",
            "Shape transformer nets: Generating viewpoint-invariant 3D shapes from a single image.",
            "YOLSO: You Only Look Small Object.",
            "A comparative study between PVO-based framework and multi-predictor mechanism in reversible data hiding.",
            "Global and local information aggregation network for edge-aware salient object detection.",
            "No-reference stereoscopic image quality evaluator based on human visual characteristics and relative gradient orientation.",
            "Discrete hashing with triple supervision learning.",
            "Fixation prediction for advertising images: Dataset and benchmark.",
            "Reversible data hiding with automatic contrast enhancement using two-sided histogram expansion.",
            "Learning to capture dependencies between global features of different convolution layers.",
            "Low-light image enhancement by diffusion pyramid with residuals.",
            "A discriminant kernel entropy-based framework for feature representation learning.",
            "Gaze prediction for first-person videos based on inverse non-negative sparse coding with determinant sparse measure.",
            "Spatial self-attention network with self-attention distillation for fine-grained image recognition.",
            "Gaze estimation via bilinear pooling-based attention networks.",
            "An adaptive two phase blind image deconvolution algorithm for an iterative regularization model.",
            "Structure-prior deep neural network for lane detection.",
            "A multi-exposure fusion framework for contrast enhancement of hazy images employing dynamic stochastic resonance.",
            "MultiTempGAN: Multitemporal multispectral image compression framework using generative adversarial networks."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2020",
        "info": "2020: Volumes\n66,\n67,\n68,\n69,\n70,\n71,\n72,\n73",
        "count": 177,
        "papers": [
            "Anti-forensics of median filtering and contrast enhancement.",
            "Convolutional sparse coding framework for compressive spectral imaging.",
            "Sparseness embedding in bending of space and time; a case study on unsupervised 3D action recognition.",
            "Unsupervised fisheye image correction through bidirectional loss with geometric prior.",
            "Objects and scenes classification with selective use of central and peripheral image content.",
            "Visualization, Discriminability and Applications of Interpretable Saak Features.",
            "IR saliency detection via a GCF-SB visual attention framework.",
            "Identifying biometrics in the wild - A time, erosion and neural inspired framework for gait identification.",
            "Secure and robust host-adapted color image watermarking using inter-layered wavelet-packets.",
            "Spline-like Chebyshev polynomial model for compressive imaging.",
            "A novel dark channel prior guided variational framework for underwater image restoration.",
            "A novel change-detection scheduler for a network of depth sensors.",
            "Video compressed sensing reconstruction based on structural group sparsity and successive approximation estimation model.",
            "Low complexity high efficiency coding of light fields using ensemble classifiers.",
            "Superpixels extracted via region fusion with boundary constraint.",
            "An efficient high-capacity reversible data hiding scheme for encrypted images.",
            "Face presentation attack detection based on chromatic co-occurrence of local binary pattern and ensemble learning.",
            "Screen content image quality assessment based on convolutional neural networks.",
            "Detecting spatiotemporal irregularities in videos via a 3D convolutional autoencoder.",
            "Matrix-variate variational auto-encoder with applications to image process.",
            "Exploiting the local temporal information for video captioning.",
            "Blind tone mapped image quality assessment with image segmentation and visual perception.",
            "Spatio-temporal metric learning for individual recognition from locomotion.",
            "A new pyramidal opponent color-shape model based video shot boundary detection.",
            "Retraction notice to \"Cross-camera multi-person tracking by leveraging fast graph mining algorithm\" [J. Vis. Commun. Image R. 55 (2018) 711-719].",
            "Retraction notice to \"Deep network for visual saliency prediction by encoding image composition\" [J. Vis. Commun. Image R. 55 (2018) 789-794].",
            "Retraction notice to \"A method of multi-criteria set recognition based on deep feature representation\" [J. Vis. Commun. Image R. 55 (2018) 756-760].",
            "Color image enhancement with high saturation using piecewise linear gamut mapping.",
            "A novel multi-focus image fusion method based on distributed compressed sensing.",
            "Saliency detection using adversarial learning networks.",
            "Sparsity adaptive matching pursuit for face recognition.",
            "Parallel spatial-temporal convolutional neural networks for anomaly detection and location in crowded scenes.",
            "Pure intra mode decision in HEVC using optimized firefly algorithm.",
            "A real time expert system for anomaly detection of aerators based on computer vision and surveillance cameras.",
            "Salient object detection in video using deep non-local neural networks.",
            "Research on image feature extraction and retrieval algorithms based on convolutional neural network.",
            "Cross-level reinforced attention network for person re-identification.",
            "JPEG quantization step estimation with coefficient histogram and spectrum analyses.",
            "No-reference quality metric for contrast-distorted image based on gradient domain and HSV space.",
            "Retraction notice to \"Deeply fusing multimodal features in hypergraph\" [J. Vis. Commun. Image Represent. 62 (2019) 97-104].",
            "Retraction notice to \"Efficient object analysis by leveraging deeply-trained object proposals prediction model\" [J. Vis. Commun. Image R. 61 (2019) 218-224].",
            "Retraction notice to \"Moving object surveillance using object proposals and background prior prediction\" [J. Vis. Commun. Image Represent. 61 (2019) 85-92].",
            "Retraction notice to \"Camera network analysis for visual surveillance in electric industrial context\" [J. Vis. Commun. Image Represent. 56 (2018) 201-206].",
            "Retraction notice to \"Analysis of security operation and maintenance system using privacy utility in media environment\" [J. Vis. Commun. Image Represent. 56 (2018) 177-181].",
            "Retraction notice to \"Image quality tendency modeling by fusing multiple visual cues\" [J. Vis. Commun. Image R. 62 (2019) 117-128].",
            "Perceptual visual quality assessment using deeply-learned gaze shifting kernel.",
            "Massive-scale image retrieval based on deep visual feature representation.",
            "Massive-scale visual information retrieval towards city residential environment surveillance.",
            "Human-computer interaction based on face feature localization.",
            "Data encryption based blockchain and privacy preserving mechanisms towards big data.",
            "PixelHop: A successive subspace learning (SSL) method for object recognition.",
            "Diverse receptive field network with context aggregation for fast object detection.",
            "Learning latent geometric consistency for 6D object pose estimation in heavily cluttered scenes.",
            "An efficient tensor completion method via truncated nuclear norm.",
            "Adaptive single image dehazing method based on support vector machine.",
            "Probabilistic color visual cryptography schemes for black and white secret images.",
            "Locality preserving projection based on Euler representation.",
            "An effective hybrid pruning architecture of dynamic convolution for surveillance videos.",
            "Histopathological image classification through discriminative feature learning and mutual information-based multi-channel joint sparse representation.",
            "End-to-end DeepNCC framework for robust visual tracking.",
            "Semi-automatic 2D-to-3D video conversion based on background sprite generation.",
            "Hand pose estimation in object-interaction based on deep learning for virtual reality applications.",
            "Combining polar harmonic transforms and 2D compound chaotic map for distinguishable and robust color image zero-watermarking algorithm.",
            "Low overhead spatiotemporal video compression over smartphone based Delay Tolerant Network.",
            "A novel haze image steganography method via cover-source switching.",
            "Reversible data hiding in binary images by flipping pattern pair with opposite center pixel.",
            "Learning spatial hierarchies of high-level features in deep neural network.",
            "Wavelet based medical image super resolution using cross connected residual-in-dense grouped convolutional neural network.",
            "Visual object tracking using sparse context-aware spatio-temporal correlation filter.",
            "Relative view based holistic-separate representations for two-person interaction recognition using multiple graph convolutional networks.",
            "Chronological pattern indexing: An efficient feature extraction method for hand gesture recognition with Leap Motion.",
            "Quality-guided video aesthetics assessment with social media context.",
            "Intra mode prediction for H.266/FVC video coding based on convolutional neural network.",
            "Hierarchical Learning-Guided human motion quality assessment in big data environment.",
            "Human motion quality assessment toward sophisticated sports scenes based on deeply-learned 3D CNN model.",
            "Application of fuzzy image restoration in criminal investigation.",
            "Application of multimedia technology in water conservancy and hydropower engineering.",
            "Water leakage image recognition of shield tunnel via learning deep feature representation.",
            "Research on the parallelization of image quality analysis algorithm based on deep learning.",
            "A novel approach for space debris recognition based on the full information vectors of star points.",
            "Polygonal approximation based on coarse-grained parallel genetic algorithm.",
            "Weakly-supervised large-scale image modeling for sport scenes and its applications.",
            "High-quality face image generation based on generative adversarial networks.",
            "Radar remote sensing image retrieval algorithm based on improved Sobel operator.",
            "Hyperspectral image quality based on convolutional network of multi-scale depth.",
            "Human action recognition based on convolutional neural network and spatial pyramid representation.",
            "Driver fatigue detection based on deeply-learned facial expression representation.",
            "Quality-related English text classification based on recurrent neural network.",
            "Salient object detection via two-stage absorbing Markov chain based on background and foreground.",
            "Vision-based optimization of the generalized predictive active disturbance rejection controller.",
            "Analysis of financial business model towards big data and its applications.",
            "Credit risk assessment of P2P lending platform towards big data based on BP neural network.",
            "E-commerce personalized recommendation analysis by deeply-learned clustering.",
            "Artificial intelligence based ensemble approach for intrusion detection systems.",
            "Learning multiple instance deep representation for objects tracking.",
            "An extension of the differential image foresting transform and its application to superpixel generation.",
            "Automated standardization of images of Drosophila embryos.",
            "☆ - Discriminative dictionary learning algorithm based on sample diversity and locality of atoms for face recognition.",
            "Video action recognition based on visual rhythm representation.",
            "Multimodal hand gesture recognition combining temporal and pose information based on CNN descriptors and histogram of cumulative magnitudes.",
            "Real-time license plate detection and recognition using deep convolutional neural networks.",
            "Detail retaining convolutional neural network for image denoising.",
            "Image understanding via learning weakly-supervised cross-modal semantic translation.",
            "Deep hierarchical encoding model for sentence semantic matching.",
            "Neural machine translation with Gumbel Tree-LSTM based encoder.",
            "Generating video animation from single still image in social media based on intelligent computing.",
            "Clustering adaptive canonical correlations for high-dimensional multi-modal data.",
            "Candidate region correlation for video action detection.",
            "Reversible data hiding in JPEG bitstream using optimal VLC mapping.",
            "An embedding strategy on fusing multiple image features for data hiding in multiple images.",
            "Hierarchical learning using deep optimum-path forest.",
            "Taguchi-TOPSIS based HOG parameter selection for complex background sign language recognition.",
            "Cross-domain representation learning by domain-migration generative adversarial network for sketch based image retrieval.",
            "BURSTS: A bottom-up approach for robust spotting of texts in scenes.",
            "Protein secondary structure prediction based on integration of CNN and LSTM model.",
            "Volume preserving image segmentation with entropy regularized optimal transport and its applications in deep learning.",
            "Spatial-temporal saliency action mask attention network for action recognition.",
            "An image similarity descriptor for classification tasks.",
            "No-reference stereoscopic images quality assessment method based on monocular superpixel visual features and binocular visual features☆.",
            "A novel fast intra mode decision for versatile video coding.",
            "An improved DCT-based JND estimation model considering multiple masking effects.",
            "NERNet: Noise estimation and removal network for image denoising.",
            "Multi-path connected network for medical image segmentation.",
            "No-reference image sharpness assessment based on discrepancy measures of structural degradation.",
            "Multi-scale active patches fusion based on spatiotemporal LBP-TOP for micro-expression recognition.",
            "Low-resource automatic cartoon image creation from limited samples.",
            "Three stage deep network for 3D human pose reconstruction by exploiting spatial and temporal data via its 2D pose.",
            "Structured feature sparsity training for convolutional neural network compression.",
            "Blind quality assessment for multiply distorted stereoscopic images towards IoT-based 3D capture systems.",
            "Rate-distortion-complexity optimization for x265.",
            "Adult-child 3D backward face aging model (3D B-FAM).",
            "Adaptive deep feature aggregation using Fourier transform and low-pass filtering for robust object retrieval.",
            "Semantic granularity metric learning for visual search.",
            "Novel shrinking residual convolutional neural network for efficient accurate stereo matching.",
            "Translating video into language by enhancing visual and language representations.",
            "Looking ahead: Joint small group detection and tracking in crowd scenes.",
            "Light field all-in-focus image fusion based on spatially-guided angular information.",
            "Transparency-guided ensemble convolutional neural network for the stratification between pseudoprogression and true progression of glioblastoma multiform in MRI.",
            "Learning discriminative update adaptive spatial-temporal regularized correlation filter for RGB-T tracking.",
            "TRBACF: Learning temporal regularized correlation filters for high performance online visual object tracking.",
            "Gray-level image denoising with an improved weighted sparse coding.",
            "Real-time long-term tracker with tracking-verification-detection-refinement.",
            "Weakly supervised single image dehazing.",
            "Real-time sepsis severity prediction on knowledge graph deep learning networks for the intensive care unit.",
            "Deep gradual flash fusion for low-light enhancement.",
            "Multiple objects tracking by a highly decisive three-frame differencing-combined-background subtraction method with GMPFM-GMPHD filters and VGG16-LSTM classifier.",
            "Automatic foreground extraction from imperfect backgrounds using multi-agent consensus equilibrium.",
            "Scalable Hash From Triplet Loss Feature Aggregation For Video De-duplication.",
            "Steganography using a 3-player game.",
            "(t, k, n) XOR-based visual cryptography scheme with essential shadows.",
            "A survey on analysis and implementation of state-of-the-art haze removal techniques.",
            "OSED: Object-specific edge detection.",
            "Transformed denoising autoencoder prior for image restoration.",
            "An improved noise loss correction algorithm for learning from noisy labels.",
            "Local relation network with multilevel attention for visual question answering.",
            "Semi-supervised cross-modal representation learning with GAN-based Asymmetric Transfer Network.",
            "A heuristic framework for perceptual saliency prediction.",
            "Exploiting multigranular salient features with hierarchical multi-mode attention network for pedestrian re-IDentification.",
            "An adaptive spatio-temporal perception aware quantization algorithm for AVS2.",
            "Depth segmentation in real-world scenes based on U-V disparity analysis.",
            "AP-GAN: Predicting skeletal activity to improve early activity recognition.",
            "Convolutional neural network with adaptive inferential framework for skeleton-based action recognition.",
            "Multiple depth-levels features fusion enhanced network for action recognition.",
            "Exploiting object features in deep gaze prediction models.",
            "Improving the representation of image descriptions for semantic image retrieval with RDF.",
            "SAR-NAS: Skeleton-based action recognition via neural architecture searching.",
            "Multi-stage all-zero block detection for HEVC coding using machine learning.",
            "A large-scale remote sensing database for subjective and objective quality assessment of pansharpened images.",
            "Automated work efficiency analysis for smart manufacturing using human pose tracking and temporal action localization.",
            "Contour and region harmonic features for sub-local facial expression recognition.",
            "A view-free image stitching network based on global homography.",
            "Improved-StoryGAN for sequential images visualization.",
            "Weakly supervised instance segmentation using multi-stage erasing refinement and saliency-guided proposals ordering.",
            "Analytical derivatives for differentiable renderer: 3D pose estimation by silhouette consistency.",
            "Resolving overlapping convex objects in silhouette images by concavity analysis and Gaussian process.",
            "Image splicing localization using residual image and residual-based fully convolutional network.",
            "Recognition of occupational therapy exercises and detection of compensation mistakes for Cerebral Palsy."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2019",
        "info": "2019: Volumes\n58,\n59,\n60,\n61,\n62,\n63,\n64,\n65",
        "count": 333,
        "papers": [
            "Supervised graph regularization based cross media retrieval with intra and inter-class correlation.",
            "Joint image encryption and compression schemes based on 16 × 16 DCT.",
            "Adaptive perceptual quantizer for high dynamic range video compression.",
            "Track circuit fault prediction method based on grey theory and expert system.",
            "Multi-cue fusion: Discriminative enhancing for person re-identification.",
            "Joint residual pyramid for joint image super-resolution.",
            "The literature review of action recognition in traffic context.",
            "Detection of alteration zones using hyperspectral remote sensing data from Dapingliang skarn copper deposit and its surrounding area, Shanshan County, Xinjiang Uygur autonomous region, China.",
            "A spatial-frequency-temporal domain based saliency model for low contrast video sequences.",
            "Generalized general access structure in secret image sharing.",
            "Detection and tracking based tubelet generation for video object detection.",
            "A multiscale Galerkin method for second-order boundary value problems of Fredholm integro-differential equation II: Efficient algorithm for the discrete linear system.",
            "The passenger flow status identification based on image and WiFi detection for urban rail transit stations.",
            "A novel MEDLINE topic indexing method using image presentation.",
            "Hybrid incremental learning of new data and new classes for hand-held object recognition.",
            "Learning target-aware correlation filters for visual tracking.",
            "A method of visibility forecast based on hierarchical sparse representation.",
            "Discriminant locality preserving projections based on L2, p-norm for image feature extraction and recognition.",
            "Online multi-object tracking combining optical flow and compressive tracking in Markov decision process.",
            "Weighted locality collaborative representation based on sparse subspace.",
            "Blind image quality assessment with semantic information.",
            "Boosting content based image retrieval performance through integration of parametric & nonparametric approaches.",
            "Application of entropy-based multi-attribute decision-making method to structured selection of settlement.",
            "Hyperspectral remote sensing image change detection based on tensor and deep learning.",
            "Cross-modal motion regeneration using Multimodal Deep Belief Network.",
            "3D object retrieval with graph-based collaborative feature learning.",
            "Neutrosophic C-means clustering with local information and noise distance-based kernel metric image segmentation.",
            "Super-resolution of single multi-color image with guided filter.",
            "A review on classifying abnormal behavior in crowd scene.",
            "Kernel cross-view collaborative representation based classification for person re-identification.",
            "A mix-pooling CNN architecture with FCRF for brain tumor segmentation.",
            "Using Expectation-Maximization for exposing image forgeries by revealing inconsistencies in shadow geometry.",
            "High-capacity reversible data hiding in encrypted images based on extended run-length coding and block-based MSB plane rearrangement.",
            "EVS-DK: Event video skimming using deep keyframe.",
            "Blind image quality assessment with hierarchy: Degradation from local structure to deep semantics.",
            "A touchless interaction interface for observing medical imaging.",
            "Adversarial learning for viewpoints invariant 3D human pose estimation.",
            "A survey on image tampering and its detection in real-world photos.",
            "Stereoscopic image quality assessment by deep convolutional neural network.",
            "Mesoscopic structure PFC∼2D model of soil rock mixture based on digital image.",
            "ImmerTai: Immersive Motion Learning in VR Environments.",
            "Sharing hand gesture and sketch cues in remote collaboration.",
            "Multimodal clothing recognition for semantic search in unconstrained surveillance imagery.",
            "Automatic extraction of impervious surfaces from high resolution remote sensing images based on deep learning.",
            "Fast prediction for quality scalability of High Efficiency Video Coding Scalable Extension.",
            "Scene graph captioner: Image captioning based on structural visual representation.",
            "Person re-identification based on re-ranking with expanded k-reciprocal nearest neighbors.",
            "Face recognition based on genetic algorithm.",
            "AGs: Local descriptors derived from the dependent effects model.",
            "Discovering spatio-temporal action tubes.",
            "Research on feature extraction algorithm for plantar pressure image and gait analysis in stroke patients.",
            "A novel framework for semantic segmentation with generative adversarial network.",
            "Heterogeneous multimedia cooperative annotation based on multimodal correlation learning.",
            "A deep generative directed network for scene depth ordering.",
            "Water level changes of Hulun Lake in Inner Mongolia derived from Jason satellite data.",
            "Affective image classification by jointly using interpretable art features and semantic annotations.",
            "Contrast enhancement and details preservation of tone mapped high dynamic range images.",
            "Binary image steganography based on joint distortion measurement.",
            "Cancellation of motion artifacts in ambulatory ECG signals using TD-LMS adaptive filtering techniques.",
            "T2FCS filter: Type 2 fuzzy and cuckoo search-based filter design for image restoration.",
            "Influence of CT scanning parameters on rock and soil images.",
            "Single image super-resolution based on adaptive convolutional sparse coding and convolutional neural networks.",
            "Object detection by spatio-temporal analysis and tracking of the detected objects in a video with variable background.",
            "Graph-based supervised discrete image hashing.",
            "Edge-enhancing bi-histogram equalisation using guided image filter.",
            "Zero shot learning by partial transfer from source domain with L2, 1 norm constraint.",
            "Multi-task multimodal feature refinement for emotional speech animation.",
            "Social multi-modal event analysis via knowledge-based weighted topic model.",
            "Multi-view non-negative matrix factorization for scene recognition.",
            "Dynamic embedding strategy of VQ-based information hiding approach.",
            "Research on image compression technology based on Huffman coding.",
            "A new adaptive boosting total generalized variation (TGV) technique for image denoising and inpainting.",
            "Defocus blur detection based on multiscale SVD fusion in gradient domain.",
            "Jointly social grouping and identification in visual dynamics with causality-induced hierarchical Bayesian model.",
            "A K-anonymous clustering algorithm based on the analytic hierarchy process.",
            "Facial expression recognition from image based on hybrid features understanding.",
            "A weighted edge-based level set method based on multi-local statistical information for noisy image segmentation.",
            "Trademark image retrieval via transformation-invariant deep hashing.",
            "Object Memorability Prediction using Deep Learning: Location and Size Bias.",
            "Object detection and localization in 3D environment by fusing raw fisheye image and attitude data.",
            "Hardware implementation of digital image skeletonization algorithm using FPGA for computer vision applications.",
            "Multimedia retrieval by deep hashing with multilevel similarity learning.",
            "Gait recognition based on capsule network.",
            "Application research of image compression and wireless network traffic video streaming.",
            "Video facial emotion recognition based on local enhanced motion history image and CNN-CTSLSTM networks.",
            "A probabilistic topic model using deep visual word representation for simultaneous image classification and annotation.",
            "Research on image restoration algorithms based on BP neural network.",
            "A survey of recent work on fine-grained image classification techniques.",
            "Learning spatiotemporal representations for human fall detection in surveillance video.",
            "A client-based adaptation framework for 360-degree video streaming.",
            "Seepage mechanism technical practice of hydraulic fracturing of coal seam and auxiliary image simulation technology.",
            "Deep feature representation for anti-fraud system.",
            "Development of a N-type GM-PHD filter for multiple target, multiple type visual tracking.",
            "3D human pose estimation from range images with depth difference and geodesic distance.",
            "Research on video classification method of key pollution sources based on deep learning.",
            "A new method of Thangka image inpainting quality assessment.",
            "Analysis of Beijing Tianjin Hebei regional credit system from the perspective of big data credit reporting.",
            "The application and design of neural computation in visual perception.",
            "Multi-vision tracking and collaboration based on spatial particle filter.",
            "Iterative fusion convolutional neural networks for classification of optical coherence tomography images.",
            "Copyright protection method for 3D model of geological body based on digital watermarking technology.",
            "An efficient privacy protection scheme for data security in video surveillance.",
            "An improved multi-branch residual network based on random multiplier and adaptive cosine learning rate method.",
            "3D human pose estimation from a single image via exemplar augmentation.",
            "A low-cost, accurate strain measurement using multi-view amplification mechanism and visual polydimethylsiloxane lens.",
            "An interactive method for identifying the stay points of the trajectory of moving objects.",
            "Multi-camera transfer GAN for person re-identification.",
            "The experimental study about laser-induced dizziness effect of medium-wave infrared seeker which based on image processing.",
            "No reference quality assessment for Thangka color image based on superpixel.",
            "Multi-level and multi-scale deep saliency network for salient object detection.",
            "Research on the size of mechanical parts based on image recognition.",
            "Evaluating hedge fund downside risk using a multi-objective neural network.",
            "Modeling of image, video and text fusion quality data packet system for aerospace complex products based on business intelligence.",
            "Quantitative similarity calculation method for trajectory-directed line using sketch retrieval.",
            "An efficient 3D face recognition approach using Frenet feature of iso-geodesic curves.",
            "Edge guided compressive sensing for image reconstruction based on two-stage l0 minimization.",
            "Barrett's esophagus analysis using infinity Restricted Boltzmann Machines.",
            "CNN-based method for blotches and scratches detection in archived videos.",
            "IL-GAN: Illumination-invariant representation learning for single sample face recognition.",
            "Band reordering heuristics for lossless satellite image compression with 3D-CALIC and CCSDS.",
            "A multi-image Joint Re-ranking framework with updateable Image Pool for person re-identification.",
            "Collaborative multimodal feature learning for RGB-D action recognition.",
            "A (k, n) threshold partial reversible AMBTC-based visual cryptography using one reference image.",
            "Principal characteristic networks for few-shot learning.",
            "Face liveness detection using convolutional-features fusion of real and deep network generated face images.",
            "Recognition and extraction of named entities in online medical diagnosis data based on a deep neural network.",
            "Automatic extraction of urban impervious surfaces based on deep learning and multi-source remote sensing data.",
            "A crowdsourced system for robust eye tracking.",
            "Adaptively feature learning for effective power defense.",
            "Multimodal activity recognition with local block CNN and attention-based spatial weighted CNN.",
            "Research on automatic target detection and recognition based on deep learning.",
            "SphereReID: Deep hypersphere manifold embedding for person re-identification.",
            "Perceptually learning multi-view sparse representation for scene categorization.",
            "A multi-view object tracking using triplet model.",
            "Matrix permutation meets block compressed sensing.",
            "ChaboNet : Design of a deep CNN for prediction of visual saliency in natural video.",
            "Image processing analysis and research based on game animation design.",
            "Compass aided visual-inertial odometry.",
            "Effect of subject's age and gender on face recognition results.",
            "Research on image recognition method of bank financing bill based on binary tree decision.",
            "BALG: An alternative for fast and robust feature matching.",
            "Reduced-reference quality assessment of image super-resolution by energy change and texture variation.",
            "Saliency prediction by Mahalanobis distance of topological feature on deep color components.",
            "No-reference quality assessment for contrast-distorted images based on multifaceted statistical representation of structure.",
            "Region based multi-stream convolutional neural networks for collective activity recognition.",
            "Infrared dim target detection method based on the fuzzy accurate updating symmetric adaptive resonance theory.",
            "Study on clues for gold prospecting in the Maizijing-Shulonggou area, Ningxia Hui autonomous region, China, using ALI, ASTER and WorldView-2 imagery.",
            "You always look again: Learning to detect the unseen objects.",
            "Image quality assessment using a novel region smoothness measure.",
            "Hybrid image super-resolution using perceptual similarity from pre-trained network.",
            "Relevance prediction in similarity-search systems using extreme value theory.",
            "Research on key technologies of remote design of mechanical products based on artificial intelligence.",
            "Wind turbine bionic blade design and performance analysis.",
            "Research on image steganography analysis based on deep learning.",
            "Reinforcement learning based coding unit early termination algorithm for high efficiency video coding.",
            "Detection and segmentation of underwater CW-like signals in spectrum image under strong noise background.",
            "A real-time detection method of building energy efficiency based on image processing.",
            "Deep blind quality evaluator for multiply distorted images based on monogenic binary coding.",
            "Correlation identification in multimodal weibo via back propagation neural network with genetic algorithm.",
            "Feature level MRI fusion based on 3D dual tree compactly supported Shearlet transform.",
            "A content-based rate control algorithm for screen content video coding.",
            "An integrated approach to emotion recognition and gender classification.",
            "Interpretable convolutional neural networks via feedforward design.",
            "Regularized uncertainty-based multi-task learning model for food analysis.",
            "Research on de-motion blur image processing based on deep learning.",
            "Outlier detection and disparity refinement in stereo matching.",
            "The optimization of sum-product network structure learning.",
            "Three dimensional image of stress space geotechnical constitutive model.",
            "Generalization of feature embeddings transferred from different video anomaly detection domains.",
            "Quantitative CT study of martial arts sports injuries based on image quality.",
            "Traffic surveillance video coding with libraries of vehicles and background.",
            "Depth-aware saliency detection using convolutional neural networks.",
            "An artificial intelligence based data-driven approach for design ideation.",
            "A novel method of text line segmentation for historical document image of the uchen Tibetan.",
            "Research on image screening model of ancient villages.",
            "Application of artificial intelligence algorithms in image processing.",
            "Predictor-corrector image interpolation.",
            "Convolutional neural networks-based stereo image reversible data hiding method.",
            "A combination of color-black-and-white visual cryptography and polynomial based secret image sharing.",
            "A chain code for representing high definition contour shapes.",
            "Research on sports video image based on fuzzy algorithms.",
            "Fashion recommendations through cross-media information retrieval.",
            "Discriminative regularization of the latent manifold of variational auto-encoders.",
            "Dual image reversible data hiding using trinary assignment and centre folding strategy with low distortion.",
            "Research on image processing of intelligent building environment based on pattern recognition technology.",
            "Huffman-code based retrieval for encrypted JPEG images.",
            "A novel natural language steganographic framework based on image description neural network.",
            "Frequency domain point cloud registration based on the Fourier transform.",
            "SRLibrary: Comparing different loss functions for super-resolution over various convolutional architectures.",
            "Enhanced two-phase residual network for single image super-resolution.",
            "Improving multimodal action representation with joint motion history context.",
            "Visual data of facial expressions for automatic pain detection.",
            "On the use of joint sparse representation for image fusion quality evaluation and analysis.",
            "Two-stages based facial demographic attributes combination for age estimation.",
            "Blind quality assessment of gamut-mapped images via local and global statistical analysis.",
            "Similarity-preserving hashing based on deep neural networks for large-scale image retrieval.",
            "Learning based no-reference metric for assessing quality of experience of stereoscopic images.",
            "End-to-end single image enhancement based on a dual network cascade model.",
            "Exploring frame segmentation networks for temporal action localization.",
            "Robust subspace clustering for image data using clean dictionary estimation and group lasso based matrix completion.",
            "Action recognition using dynamic hierarchical trees.",
            "Facial expression recognition via region-based convolutional fusion network.",
            "VST-Net: Variance-stabilizing transformation inspired network for Poisson denoising.",
            "Multi-script text versus non-text classification of regions in scene images.",
            "Face Expression Recognition with the Optimization based Multi-SVNN Classifier and the Modified LDP Features.",
            "HEVC intra-frame drift cancellation matrix.",
            "Smooth switching method for asynchronous multiple viewpoint videos using frame interpolation.",
            "AFIF4: Deep gender classification based on AdaBoost-based fusion of isolated facial features and foggy faces.",
            "A high-capacity reversible data hiding method for homomorphic encrypted images.",
            "Radial feature descriptors for cell classification and recommendation.",
            "Hierarchical deep transfer learning for fine-grained categorization on micro datasets.",
            "Picture-level just noticeable difference for symmetrically and asymmetrically compressed stereoscopic images: Subjective quality assessment study and datasets.",
            "Histogram distance metric learning for facial expression recognition.",
            "An object counting network based on hierarchical context and feature fusion.",
            "Lossless compression codec of aurora spectral data using hybrid spatial-spectral decorrelation with outlier recognition.",
            "Robust correlation filter tracking via context fusion and subspace constraint.",
            "Learning deep CNNs for impulse noise removal in images.",
            "Dim and small target detection based on feature mapping neural networks.",
            "Two-level attention with two-stage multi-task learning for facial emotion recognition.",
            "Fast combination filtering based on weighted fusion.",
            "Estimating the occupancy status of parking areas by counting cars and non-empty stalls.",
            "Multi-person pose estimation based on a deep convolutional neural network.",
            "Image classification base on PCA of multi-view deep representation.",
            "Semantic consistency cross-modal dictionary learning with rank constraint.",
            "Discriminative representation learning for person re-identification via multi-loss training.",
            "Deep fusion based video saliency detection.",
            "A learning based approach to additive, correlated noise removal.",
            "Ghost-free multi exposure image fusion technique using dense SIFT descriptor and guided filter.",
            "Locally optimum image watermark decoder by modeling NSCT domain difference coefficients with vector based Cauchy distribution.",
            "Salient object detection using background subtraction, Gabor filters, objectness and minimum directional backgroundness.",
            "Towards genre-specific frameworks for video summarisation: A survey.",
            "Research on fuzzy enhancement algorithms for infrared image recognition quality of power internet of things equipment based on membership function.",
            "Co-weighting semantic convolutional features for object retrieval.",
            "Deformed landmark fitting for sequential faces.",
            "Personalized training through Kinect-based games for physical education.",
            "Research on deep learning in the field of mechanical equipment fault diagnosis image quality.",
            "Research on regional energy efficiency based on GIS technology and image quality processing.",
            "Retraction notice to \"A new deep representation for large-scale scene classification\" [J. Vis. Commun. Image R. 55 (2018) 761-765].",
            "Quality assessment of stereoscopic video in free viewpoint video system.",
            "Image classification toward lung cancer recognition by learning deep quality model.",
            "Key pose recognition toward sports scene using deeply-learned model.",
            "A new image size reduction model for an efficient visual sensor network.",
            "Acceleration of RED via vector extrapolation.",
            "Towards controllable image descriptions with semi-supervised VAE.",
            "Quality assessment on remote sensing image based on neural networks.",
            "Pedestrian detection using multi-channel visual feature fusion by learning deep quality model.",
            "Reliable identification of redundant kernels for convolutional neural network compression.",
            "Weakly labeled fine-grained classification with hierarchy relationship of fine and coarse labels.",
            "Dynamic gesture recognition by directional pulse coupled neural networks for human-robot interaction in real time.",
            "Dimension reduction of image deep feature using PCA.",
            "Deep spatial attention hashing network for image retrieval.",
            "Image quality assessment for intelligent emergency application based on deep neural network.",
            "Weighted correlation filters guidance with spatial-temporal attention for online multi-object tracking.",
            "Content-sensitive superpixel segmentation via self-organization-map neural network.",
            "Automatic building change image quality assessment in high resolution remote sensing based on deep learning.",
            "FISH: Face intensity-shape histogram representation for automatic face splicing detection.",
            "Probabilistic guided polycystic ovary syndrome recognition using learned quality kernel.",
            "Research on image quality in decision management system and information system framework.",
            "Design of museum advertisement picture management system based on web.",
            "Learning sparse discriminant low-rank features for low-resolution face recognition.",
            "Learning a virtual codec based on deep convolutional neural network to compress image.",
            "Natural image segmentation with non-extensive mixture models.",
            "Quality-guided image classification toward information management applications.",
            "A (2, 2) XOR-based visual cryptography scheme without pixel expansion.",
            "Image quality assessment for advertising applications based on neural network.",
            "Robust estimation for image noise based on eigenvalue distributions of large sample covariance matrices.",
            "Cooperative media control parameter optimization of the integrated mixing and paving machine based on the fuzzy cuckoo search algorithm.",
            "Learning local feature representation from matching, clustering and spatial transform.",
            "Magnitude-Orientation Stream network and depth information applied to activity recognition.",
            "Part-based visual tracking via structural support correlation filter.",
            "Image quality guided biology application for genetic analysis.",
            "Fault point detection of IOT using multi-spectral image fusion based on deep learning.",
            "Image anomaly detection for IoT equipment based on deep learning.",
            "An adaptive template matching-based single object tracking algorithm with parallel acceleration.",
            "A square lattice oriented reversible information hiding scheme with reversibility and adaptivity for dual images.",
            "Quality guided image recognition towards industrial materials diffusion.",
            "Research on infrared image enhancement and segmentation of power equipment based on partial differential equation.",
            "Representative discovery of structure cues for coronary heart disease recognition based on quality assessment.",
            "Image classification toward breast cancer using deeply-learned quality features.",
            "Local energy oriented pattern for image indexing and retrieval.",
            "A method of processing color image watermarking based on the Haar wavelet.",
            "A new charge structure based on computer modeling and simulation analysis.",
            "A multiscale dilated dense convolutional network for saliency prediction with instance-level attention competition.",
            "Patch graph-based wavelet inpainting for color images.",
            "Image quality optimization towards lidar registration based on iterative termination.",
            "Scene flow estimation by depth map upsampling and layer assignment for camera-LiDAR system.",
            "A multi-scale topological shape model for single and multiple component shapes.",
            "IPTV video quality assessment model based on neural network.",
            "Quality assessment towards cell diffraction image based on multi-channel feature fusion.",
            "Progressive complex illumination image appearance transfer based on CNN.",
            "Finite element model of concrete material based on CT image processing technology.",
            "Road surface condition classification using deep learning.",
            "Ultrasonic image processing based on fusion super-resolution reconstruction of familiar models.",
            "Adaptive illumination-invariant face recognition via local nonlinear multi-layer contrast feature.",
            "Image classification towards transmission line fault detection via learning deep quality-aware fine-grained categorization.",
            "Hierarchically engineering quality-related perceptual features for understanding breast cancer.",
            "Inversion of organic matter content in wetland soil based on Landsat 8 remote sensing image.",
            "Deep spectral feature pyramid in the frequency domain for long-term action recognition.",
            "A fuzzy interaction scheme of mid-air gesture elicitation.",
            "Analyzing multiple types of behaviors from traffic videos via nonparametric topic model.",
            "Cityscape protection using VR and eye tracking technology.",
            "Research on quality improvement method of deformation monitoring data based on InSAR.",
            "Exclusive feature selection and multi-view learning for Alzheimer's Disease.",
            "Knowledge driven temporal activity localization.",
            "An hybrid feature space from texture information and transfer learning for glaucoma classification.",
            "A topic sentiment based method for friend recommendation in online social networks via matrix factorization.",
            "3DSportNet: 3D sport reconstruction by quality-aware deep multi-video summation.",
            "Analysis of active faults based on natural earthquakes in Central north China.",
            "Visual tracking via dynamic weighting with pyramid-redetection based Siamese networks.",
            "Intelligent attack defense scheme based on DQL algorithm in mobile fog computing.",
            "Image quality recognition technology based on deep learning.",
            "An extensive review on spectral imaging in biometric systems: Challenges & advancements.",
            "Study on short-term network forecasting based on SVM-MFA algorithm.",
            "Generative image deblurring based on multi-scaled residual adversary network driven by composed prior-posterior loss.",
            "Egocentric visitors localization in natural sites.",
            "Image quality study of CT imaging examination in children with childhood tumors under ultrasound-guided puncture.",
            "Scene categorization towards urban tunnel traffic by image quality assessment.",
            "Fusing dynamic deep learned features and handcrafted features for facial expression recognition.",
            "An image denoising approach based on adaptive nonlocal total variation.",
            "Learning attentive dynamic maps (ADMs) for Understanding Human Actions.",
            "Generation of personalized video summaries by detecting viewer's emotion using electroencephalography.",
            "Saliency detection using Multi-layer graph ranking and combined neural networks.",
            "Learning full-reference quality-guided discriminative gradient cues for lane detection based on neural networks.",
            "Salient object detection based on novel graph model.",
            "An extensive evaluation of deep featuresof convolutional neural networks for saliency prediction of human visual attention.",
            "Multisource surveillance video coding with synthetic reference frame.",
            "The affective facial recognition task: The influence of cognitive styles and exposure times.",
            "Quality-guided key frames selection from video stream based on object detection.",
            "Large-scale and adaptive service composition based on deep reinforcement learning.",
            "Benchmarking deep learning techniques for face recognition.",
            "Multiple object tracking in soccer videos using topographic surface analysis.",
            "Application research of digital image technology in graphic design.",
            "Design of high-resolution quantization scheme with exp-Golomb code applied to compression of special images."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2018",
        "info": "2018: Volumes\n50,\n51,\n52,\n53,\n54,\n55,\n56,\n57",
        "count": 244,
        "papers": [
            "Optimal feature combination analysis for crowd saliency prediction.",
            "Color image dehazing using surround filter and dark channel prior.",
            "Saliency ranker: A new salient object detection method.",
            "A novel statistical model for content-based stereo image retrieval in the complex wavelet domain.",
            "An efficient method of content-targeted online video advertising.",
            "TRLH: Fragile and blind dual watermarking for image tamper detection and self-recovery based on lifting wavelet transform and halftoning technique.",
            "Identifying facial expression using adaptive sub-layer compensation based feature extraction.",
            "Improved kernelized correlation filter tracking by using spatial regularization.",
            "Advanced texture and depth coding in 3D-HEVC.",
            "An efficient weak sharpening detection method for image forensics.",
            "A note on patch-based low-rank minimization for fast image denoising.",
            "Principal component dictionary-based patch grouping for image denoising.",
            "Shape decomposition-based handwritten compound character recognition for Bangla OCR.",
            "Partial secret image sharing for (k, n) threshold based on image inpainting.",
            "Blind image sharpness assessment based on local contrast map statistics.",
            "Low-complexity direct computation algorithm for cubic-spline interpolation scheme.",
            "Multi-atlas automatic positioning of anatomical landmarks.",
            "Extended smoothlets: An efficient multi-resolution adaptive transform.",
            "Novel reversible data hiding scheme for Two-stage VQ compressed images based on search-order coding.",
            "Saliency-based multi-feature modeling for semantic image retrieval.",
            "Egocentric video description based on temporally-linked sequences.",
            "High dynamic range 3D shape determination based on automatic exposure selection.",
            "Saliency integration driven by similar images.",
            "On data-driven Saak transform.",
            "No reference stereo video quality assessment based on motion feature in tensor decomposition domain.",
            "Encoder settings impact on intra-prediction-based descriptors for video retrieval.",
            "Salient object detection via spectral graph weighted low rank matrix recovery.",
            "A perceptually temporal adaptive quantization algorithm for HEVC.",
            "A highly efficient method for improving the performance of GLA-based algorithms.",
            "Leveraging deep neural networks to fight child pornography in the age of social media.",
            "Motion-based countermeasure against photo and video spoofing attacks in face recognition.",
            "Adaptive stopping strategies for fast intra mode decision in HEVC.",
            "HTTP adaptive streaming scheme for improving the quality of experience in multi-server environments.",
            "Design of linear-phase nonsubsampled nonuniform directional filter bank with arbitrary directional partitioning.",
            "Stroke-based stylization by learning sequential drawing examples.",
            "A structural post-processing method for enhancing intensity restoration of low-density impulse-noise for decision based filters.",
            "Face spoofing detection based on color texture Markov feature and support vector machine recursive feature elimination.",
            "Early event detection based on dynamic images of surveillance videos.",
            "An improved multimodal medical image fusion algorithm based on fuzzy transform.",
            "A novel method for automated correction of non-uniform/poor illumination of retinal images without creating false artifacts.",
            "Learning adaptively windowed correlation filters for robust tracking.",
            "Face sketch-photo synthesis and recognition: Dual-scale Markov Network and multi-information fusion.",
            "A lossy compression scheme for encrypted images exploiting Cauchy distribution and weighted rate distortion optimization.",
            "Video saliency detection via bagging-based prediction and spatiotemporal propagation.",
            "RENOIR - A dataset for real low-light image noise reduction.",
            "On Fisher vector encoding of binary features for video face recognition.",
            "Median filtering detection of small-size image based on CNN.",
            "Multi-modal activity recognition from egocentric vision, semantic enrichment and lifelogging applications for the care of dementia.",
            "Infrared image super-resolution using auxiliary convolutional neural network and visible image under low-light conditions.",
            "Image Splicing Localization using a Multi-task Fully Convolutional Network (MFCN).",
            "Personal-location-based temporal segmentation of egocentric videos for lifelogging applications.",
            "Physical blob detector and Multi-Channel Color Shape Descriptor for human detection.",
            "Eliminating the effects of illumination condition in feature based camera model identification.",
            "Generation of Chinese ink portraits by blending face photographs with Chinese ink paintings.",
            "Multiple-target tracking on mixed images with reflections and occlusions.",
            "Video you only look once: Overall temporal convolutions for action recognition.",
            "RGB-D face recognition under various conditions via 3D constrained local model.",
            "Lossless data hiding in JPEG bitstream using alternative embedding.",
            "Fast BCS-FOCUSS and DBCS-FOCUSS with augmented Lagrangian and minimum residual methods.",
            "Anisotropic blind image quality assessment: Survey and analysis with current methods.",
            "A spatiotemporal saliency-modulated JND profile applied to video watermarking.",
            "Edited nearest neighbour for selecting keyframe summaries of egocentric videos.",
            "Saliency detection via local structure propagation.",
            "Essential secret image sharing scheme with equal-sized shadows generation.",
            "Fusion of hyperspectral and panchromatic images using an average filter and a guided filter.",
            "Image restoration via Bayesian dictionary learning with nonlocal structured beta process.",
            "Sparsity constraint nearest subspace classifier for target recognition of SAR images.",
            "Chaotic particle filter for visual object tracking.",
            "A set-to-set nearest neighbor approach for robust and efficient face recognition with image sets.",
            "Single satellite imagery simultaneous super-resolution and colorization using multi-task deep neural networks.",
            "Integrating QDWD with pattern distinctness and local contrast for underwater saliency detection.",
            "A high payload steganography mechanism based on wavelet packet transformation and neutrosophic set.",
            "Making a long story short: A multi-importance fast-forwarding egocentric videos with the emphasis on relevant objects.",
            "Super-resolution image reconstruction using surface fitting with hierarchical structure.",
            "Rate control schemes for panoramic video coding.",
            "A new robust watermarking system in integer DCT domain.",
            "Object-level saliency: Fusing objectness estimation and saliency detection into a uniform framework.",
            "Saliency detection via bi-directional propagation.",
            "Enhanced local tone mapping for detail preserving reproduction of high dynamic range images.",
            "Reversible visual transformation via exploring the correlations within color images.",
            "Digital watermarking for camera-captured images based on just noticeable distortion and Wiener filtering.",
            "A novel multi-view dimensionality reduction and recognition framework with applications to face recognition.",
            "Hyperspectral pansharpening based on guided filter and Gaussian filter.",
            "Online object tracking via motion-guided convolutional neural network (MGNet).",
            "Affordable content creation for free-viewpoint video and VR/AR applications.",
            "A robust technique for copy-move forgery detection and localization in digital images via stationary wavelet and discrete cosine transform.",
            "Saliency detection integrating global and local information.",
            "A new variational model for joint restoration and segmentation based on the Mumford-Shah model.",
            "Edge-preserving smoothing pyramid based multi-scale exposure fusion.",
            "Temporally enhanced image object proposals for online video object and action detections.",
            "Connecting the dots: Toward accountable machine-learning printer attribution methods.",
            "Robust cross-pose face recognition using landmark oriented depth warping.",
            "Reducing the oversegmentation induced by quasi-flat zones for multivariate images.",
            "Salient object detection via a local and global method based on deep residual network.",
            "Convolutional neural networks: Ensemble modeling, fine-tuning and unsupervised semantic localization for neurosurgical CLE images.",
            "Lossless coding of light field images based on minimum-rate predictors.",
            "Towards exploiting change blindness for image processing.",
            "Color uniformity descriptor: An efficient contextual color representation for image indexing and retrieval.",
            "Saliency propagation with perceptual cues and background-excluded seeds.",
            "Chaotic firefly algorithm-based fuzzy C-means algorithm for segmentation of brain tissues in magnetic resonance images.",
            "Rician denoising and deblurring using sparse representation prior and nonconvex total variation.",
            "Targeted attack and security enhancement on texture synthesis based steganography.",
            "Region-based rate control for 3D-HEVC based texture video coding.",
            "Image quality assessment in first-person videos.",
            "A multilevel reversible data hiding scheme in encrypted domain based on LWE.",
            "A novel distortion criterion of rate-distortion optimization for depth map coding.",
            "Content-aware detection of JPEG grid inconsistencies for intuitive image forensics.",
            "Hierarchical uncorrelated multiview discriminant locality preserving projection for multiview facial expression recognition.",
            "Face spoofing detection with local binary pattern network.",
            "A reduced computational effort mode-level scheme for 3D-HEVC depth maps intra-frame prediction.",
            "Spatial gamut mapping among non-inclusive gamuts.",
            "Joint feature selection and graph regularization for modality-dependent cross-modal retrieval.",
            "Video oriented filter for impulse noise reduction.",
            "Multipath-based transmission scheme for improving the QoE of HTTP adaptive streaming.",
            "Learning spatial-temporal features for video copy detection by the combination of CNN and RNN.",
            "No-reference quality assessment of DIBR-synthesized videos by measuring temporal flickering.",
            "Deepdiary: Lifelogging image captioning and summarization.",
            "Iterative applications of image completion with CNN-based failure detection.",
            "Incremental generalized multiple maximum scatter difference with applications to feature extraction.",
            "Blind forensics of image gamma transformation and its application in splicing detection.",
            "Photographic composition classification and dominant geometric element detection for outdoor scenes.",
            "Probabilistic collaborative representation based orthogonal discriminative projection for image set classification.",
            "A wavelet-assisted subband denoising for tomographic image reconstruction.",
            "Context-Assisted 3D (C3D) Object Detection from RGB-D Images.",
            "Using suprathreshold color-difference ellipsoids to estimate any perceptual color-difference.",
            "Binary image steganalysis based on local texture pattern.",
            "Integrating support vector machine and graph cuts for medical image segmentation.",
            "Spatio-temporal constrained tone mapping operator for HDR video compression.",
            "MSKVS: Adaptive mean shift-based keyframe extraction for video summarization and a new objective verification approach.",
            "Co-segmentation via visualization.",
            "An effective motion object detection method using optical flow estimation under a moving camera.",
            "Depth sensing with coding-free pattern based on topological constraint.",
            "Multiple disjoint dictionaries for representation of histopathology images.",
            "Visual adaptive tracking for monocular omnidirectional camera.",
            "A multi-view camera-based anti-fraud system and its applications.",
            "An automatic and serialized ROI extraction framework for the slow-motion video frames.",
            "Single image super-resolution via adaptive sparse representation and low-rank constraint.",
            "Histogram-based local descriptors for facial expression recognition (FER): A comprehensive study.",
            "Coding unit complexity-based predictions of coding unit depth and prediction unit mode for efficient HEVC-to-SHVC transcoding with quality scalability.",
            "Introduction to the special issue: Egocentric Vision and Lifelogging.",
            "Correlation filter tracker based on sparse regularization.",
            "Single-shot underwater image restoration: A visual quality-aware method based on light propagation model.",
            "Spherically contoured exponential scale mixture prior based nonlocal image restoration with ADMM framework.",
            "Toward a unified scheme for fast interactive segmentation.",
            "Region ensemble network: Towards good practices for deep 3D hand pose estimation.",
            "Joint entropy based learning model for image retrieval.",
            "Feedback weight convolutional neural network for gait recognition.",
            "Multimedia analysis with collective intelligence.",
            "Cut set-based Dynamic Key frame selection and Adaptive Layer-based Background Modeling for background subtraction.",
            "Data-driven multimedia forensics and security.",
            "Guided filtering based data fusion for light field depth estimation with L0 gradient minimization.",
            "Learning an video frame-based face detection system for security fields.",
            "Long-term correlation tracking using multi-layer hybrid features in sparse and dense environments.",
            "Non-negative matrix factorization via discriminative label embedding for pattern classification.",
            "Learning an event-oriented and discriminative dictionary based on an adaptive label-consistent K-SVD method for event detection in soccer videos.",
            "Moving cast shadow detection using scale-relation multi-layer pooling features.",
            "Fuzzy averaging filter for impulse noise reduction in colour images with a correction step.",
            "Efficient graph cut optimization for shape from focus.",
            "Dynamic 3D reconstruction improvement via intensity video guided 4D fusion.",
            "Orthogonal filter banks with region Log-TiedRank covariance matrices for face recognition.",
            "Efficient feature-based image registration by mapping sparsified surfaces.",
            "Merged region based image retrieval.",
            "Single fog image restoration with multi-focus image fusion.",
            "A survey on image data analysis through clustering techniques for real world applications.",
            "3D human pose estimation from depth maps using a deep combination of poses.",
            "Small sample image recognition using improved Convolutional Neural Network.",
            "A sound-based video clipping framework toward sports scenes.",
            "Robust eye detection using deeply-learned gaze shifting path.",
            "Enhancing multi-factor cheating prevention in visual cryptography based minimum (k, n)-connected graph.",
            "Expression-targeted feature learning for effective facial expression recognition.",
            "Visual tracking via Graph Regularized Kernel Correlation Filer and Multi-Memory Voting.",
            "Multi-task based object tracking via a collaborative model.",
            "Content-based image retrieval model based on cost sensitive learning.",
            "Simultaneous joint and object trajectory templates for human activity recognition from 3-D data.",
            "A modified technique for face recognition under degraded conditions.",
            "Progressive (k, n) secret image sharing Scheme with meaningful shadow images by GEMD and RGEMD.",
            "Evolution modeling with multi-scale smoothing for action recognition.",
            "Face-mask recognition for fraud prevention using Gaussian mixture model.",
            "Object detection from dynamic scene using joint background modeling and fast deep learning classification.",
            "Leveraging multi-modal fusion for graph-based image annotation.",
            "Discriminative body part interaction mining for mid-level action representation and classification.",
            "Sampling strategies for performance improvement in cascaded face regression.",
            "Nonparametric blind SAR image super resolution based on combination of the compressive sensing and sparse priors.",
            "Robust visual tracking via multi-feature response maps fusion using a collaborative local-global layer visual model.",
            "No-reference image quality assessment with local features and high-order derivatives.",
            "Hybrid of extended locality-constrained linear coding and manifold ranking for salient object detection.",
            "Cost aggregation benchmark for light field depth estimation.",
            "A new Wronskian change detection model based codebook background subtraction for visual surveillance applications.",
            "Joint foveation-depth just-noticeable-difference model for virtual reality environment.",
            "General-to-specific learning for facial attribute classification in the wild.",
            "Visual tracking via context-aware local sparse appearance model.",
            "Cost and power efficient FPGA based stereo vision system using directional graph transform.",
            "A new framework of action recognition with discriminative parts, spatio-temporal and causal interaction descriptors.",
            "Content adaptive interpolation filters based on HEVC framework.",
            "An overview of face-related technologies.",
            "Image up-sampling using deep cascaded neural networks in dual domains for images down-sampled in DCT domain.",
            "Adaptive total variation-based spectral-spatial feature extraction of hyperspectral image.",
            "Classification of hyperspectral images via weighted spatial correlation representation.",
            "The spatial correlation problem of noise in imaging deblurring and its solution.",
            "A discriminative dynamic framework for facial expression recognition in video sequences.",
            "Moving object detection by low rank approximation and l1-TV regularization on RPCA framework.",
            "Discriminative kernel-based metric learning for face verification.",
            "Artistic movement recognition by consensus of boosted SVM based experts.",
            "Graph regularized low-rank tensor representation for feature selection.",
            "An efficient lossless secret sharing scheme for medical images.",
            "Unsupervised multi-view feature extraction with dynamic graph learning.",
            "Single image vehicle classification using pseudo long short-term memory classifier.",
            "Can a machine have two systems for recognition, like human beings?",
            "View synthesis using foreground object extraction for disparity control and image inpainting.",
            "Attention guided U-Net for accurate iris segmentation.",
            "3D object recognition based on pairwise Multi-view Convolutional Neural Networks.",
            "Saliency detection based on directional patches extraction and principal local color contrast.",
            "Graph regularized multiview marginal discriminant projection.",
            "Can modified minimax win in Pearl's game?",
            "Cross-modal hashing based on category structure preserving.",
            "A robust enhancement system based on observer-backstepping controller.",
            "A (t, n)-multi secret image sharing scheme based on Boolean operations.",
            "An optimized non-subsampled shearlet transform-based image fusion using Hessian features and unsharp masking.",
            "HCLR: A hybrid clustering and low-rank regularization-based method for photon-limited image restoration.",
            "A novel hypergraph matching algorithm based on tensor refining.",
            "HDR video quality assessment: Perceptual evaluation of compressed HDR video.",
            "Edge detection with feature re-extraction deep convolutional neural network.",
            "Community detection for multi-layer social network based on local random walk.",
            "Panoramic visual tracking based on adaptive mechanism.",
            "Efficient VR Video Representation and Quality Assessment.",
            "Visual comparison based on linear regression model and linear discriminant analysis.",
            "Reduced-reference quality assessment of multiply-distorted images based on structural and uncertainty information degradation.",
            "An uniformizing method of MR image intensity transformation.",
            "Learning multi-denoising autoencoding priors for image super-resolution.",
            "Geometric discriminative deep features for traffic image analysis.",
            "Pedestrian tracking by learning deep features.",
            "Anti-occlusion tracking algorithm of video target based on prediction and re-matching strategy.",
            "Extraction of PRNU noise from partly decoded video.",
            "Sparsity induced prototype learning via ℓp, 1-norm grouping.",
            "Saliency detection based on background seeds by object proposals and extended random walk.",
            "A multi-order derivative feature-based quality assessment model for light field image.",
            "Disparity tuning guided stereoscopic saliency detection for eye fixation prediction.",
            "Facial expression video analysis for depression detection in Chinese patients.",
            "Deep intensity guidance based compression artifacts reduction for depth map.",
            "Low-rank regularized multi-view inverse-covariance estimation for visual sentiment distribution prediction.",
            "Input-output finite-region stability and stabilization for discrete the 2-D Roesser model.",
            "Asymmetric filtering-based dense convolutional neural network for person re-identification combined with Joint Bayesian and re-ranking.",
            "Reversible data hiding in encrypted images with private-key homomorphism and public-key homomorphism.",
            "Sparse optimization of non separable vector lifting scheme for stereo image coding."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2017",
        "info": "2017: Volumes\n42,\n43,\n44,\n45,\n46,\n47,\n48,\n49",
        "count": 191,
        "papers": [
            "Gender dictionary learning for gender classification.",
            "HyperCast: Hyperspectral satellite image broadcasting with band ordering optimization.",
            "Low light image enhancement with dual-tree complex wavelet transform.",
            "Blind compressive sensing using block sparsity and nonlocal low-rank priors.",
            "Complexity-based intra frame rate control by jointing inter-frame correlation for high efficiency video coding.",
            "Reliability assessment of principal point estimates for forensic applications.",
            "Integration of wavelet transform, Local Binary Patterns and moments for content-based image retrieval.",
            "Segment-based view synthesis optimization scheme in 3D-HEVC.",
            "A primal-dual method with linear mapping for a saddle point problem in image deblurring.",
            "New privilege-based visual cryptography with arbitrary privilege levels.",
            "Intensity-guided edge-preserving depth upsampling through weighted L0 gradient minimization.",
            "Stereo matching algorithm based on per pixel difference adjustment, iterative guided filter and graph segmentation.",
            "A practical design of digital watermarking for video streaming services.",
            "Satellite image classification using Genetic Algorithm trained radial basis function neural network, application to the detection of flooded areas.",
            "Robust multi-view stereo synthesized by various parameters model.",
            "GAL: A global-attributes assisted labeling system for outdoor scenes.",
            "Memorable and rich video summarization.",
            "Integrating machine learning with region-based active contour models in medical image segmentation.",
            "Adaptive packet scheduling for scalable video streaming with network coding.",
            "A two-stage learning approach to face recognition.",
            "A nonconvex nonsmooth regularization method with structure tensor total variation.",
            "Virtual view quality assessment based on shift compensation and visual masking effect.",
            "Hierarchical content importance-based video quality assessment for HEVC encoded videos transmitted over LTE networks.",
            "HDR tone mapping algorithm based on difference compression with adaptive reference values.",
            "Rough mode cost-based fast intra coding for high-efficiency video coding.",
            "Dynamic texture representation using a deep multi-scale convolutional network.",
            "Dual learning based compression noise reduction in the texture domain.",
            "Quality assessment of retargeted images by salient region deformity analysis.",
            "A weighted full-reference image quality assessment based on visual saliency.",
            "Key-frame-based depth propagation for semi-automatic stereoscopic video conversion.",
            "Interactive image segmentation based on samples reconstruction and FLDA.",
            "Guided filtering based color image reversible data hiding.",
            "A privacy-preserving content-based image retrieval method in cloud environment.",
            "No-reference pixel based video quality assessment for HEVC decoded video.",
            "Spectral-spatial adaptive and well-balanced flow-based anisotropic diffusion for multispectral image denoising.",
            "Spectral shape classification: A deep learning approach.",
            "An image texture insensitive method for saliency detection.",
            "Robust object tracking based on adaptive templates matching via the fusion of multiple features.",
            "Store classification using Text-Exemplar-Similarity and Hypotheses-Weighted-CNN.",
            "Manifold-ranking embedded order preserving hashing for image semantic retrieval.",
            "Colorimetrically accurate gray component replacement using the additive model.",
            "Automatic image annotation based on Gaussian mixture model considering cross-modal correlations.",
            "Joint image compression and encryption based on order-8 alternating transforms.",
            "Iterative optimization for frame-by-frame object pose tracking.",
            "ColorED: Color edge and segment detection by Edge Drawing (ED).",
            "Fast indoor scene description for blind people with multiresolution random projections.",
            "Massive parallelization of approximate nearest neighbor search on KD-tree for high-dimensional image descriptor matching.",
            "An image coding scheme using parallel compressive sensing for simultaneous compression-encryption applications.",
            "Multiwavelet transform based license plate detection.",
            "Fast L1 regularized iterative forward backward splitting with adaptive parameter selection for image restoration.",
            "Novel video stabilization for real-time optical character recognition applications.",
            "Efficient fuzzy composite predictive scheme for effectual 2-D up-sampling of images for multimedia applications.",
            "Block compressive sensing: Individual and joint reconstruction of correlated images.",
            "Spatial/temporal motion consistency based MERGE mode early decision for HEVC.",
            "Region based Image Steganalysis using Artificial Bee Colony.",
            "Guest Editorial: Intermediate representation for vision and multimedia applications.",
            "Integration of semantic and visual hashing for image retrieval.",
            "No embedding: A novel image cryptosystem for meaningful encryption.",
            "Separable reversible data hiding in encrypted image based on pixel value ordering and additive homomorphism.",
            "High-dimensional feature extraction using bit-plane decomposition of local binary patterns for robust face recognition.",
            "Facial expression recognition using dual dictionary learning.",
            "Tunable data hiding in partially encrypted H.264/AVC videos.",
            "Multi-focus image fusion using HOSVD and edge intensity.",
            "Efficient object-based surveillance image search using spatial pooling of convolutional features.",
            "SIFT based video watermarking resistant to temporal scaling.",
            "Two-dimensional discriminant analysis based on Schatten p-norm for image feature extraction.",
            "Packet loss visibility across SD, HD, 3D, and UHD video streams.",
            "Contrast enhancement of noisy low-light images based on structure-texture-noise decomposition.",
            "Transparent encryption with scalable video communication: Lower-latency, CABAC-based schemes.",
            "Image enhancement using divide-and-conquer strategy.",
            "Exploring visual attention using random walks based eye tracking protocols.",
            "A ParaBoost stereoscopic image quality assessment (PBSIQA) system.",
            "Fast depth map mode decision based on depth-texture correlation and edge classification for 3D-HEVC.",
            "Robust corner detection using the eigenvector-based angle estimator.",
            "Image annotation using multi-view non-negative matrix factorization with different number of basis vectors.",
            "Robust skin-roughness estimation based on co-occurrence matrix.",
            "Perceptually lossless coder for volumetric medical image data.",
            "Robust blind image watermarking using crisscross inter-block prediction in the DCT domain.",
            "A splitting method for total least squares color image restoration problem.",
            "Efficient PVO-based reversible data hiding using multistage blocking and prediction accuracy matrix.",
            "Quality assessment for real out-of-focus blurred images.",
            "Robust player detection and tracking in broadcast soccer video based on enhanced particle filter.",
            "Recent developments and trends in point set registration methods.",
            "Multiple illuminant estimation from the covariance of colors.",
            "Steganalysis of content-adaptive binary image data hiding.",
            "Design, analysis and application of a volumetric convolutional neural network.",
            "Single-shot dense depth sensing with frequency-division multiplexing fringe projection.",
            "MRI reconstruction using a joint constraint in patch-based total variational framework.",
            "Distortion adaptive Sobel filters for the gradient estimation of wide angle images.",
            "Multinational vehicle license plate detection in complex backgrounds.",
            "Rotation and script independent text detection from video frames using sub pixel mapping.",
            "A global and local consistent ranking model for image saliency computation.",
            "Cross-layer optimized authentication and error control for wireless 3D medical video streaming over LTE.",
            "SIFT-Symmetry: A robust detection method for copy-move forgery with reflection attack.",
            "Camera as weather sensor: Estimating weather information from single images.",
            "Vehicle detection and inter-vehicle distance estimation using single-lens video camera on urban/suburb roads.",
            "Sparse representation for robust face recognition by dictionary decomposition.",
            "Stereoscopic image quality assessment by learning non-negative matrix factorization-based color visual characteristics and considering binocular interactions.",
            "Depth map super-resolution via low-resolution depth guided joint trilateral up-sampling.",
            "VideoSet: A large-scale compressed video quality dataset based on JND measurement.",
            "Adaptive stochastic segmentation via energy-convergence for brain tumor in MR images.",
            "Unsupervised multi class segmentation of 3D images with intensity inhomogeneities.",
            "A joint dictionary learning and regression model for intensity estimation of facial AUs.",
            "Discriminant analysis via jointly L2, 1-norm sparse tensor preserving embedding for image classification.",
            "Per-pixel mirror-based method for high-speed video acquisition.",
            "A new method for inpainting of depth maps from time-of-flight sensors based on a modified closing by reconstruction algorithm.",
            "Video synthesis from stereo videos with iterative depth refinement.",
            "Performance evaluation of local descriptors for maximally stable extremal regions.",
            "Fast super-resolution algorithm using rotation-invariant ELBP classifier and hierarchical pattern matching.",
            "Using 3D face priors for depth recovery.",
            "The use of IMUs for video object retrieval in lightweight devices.",
            "Non-texture image inpainting using histogram of oriented gradients.",
            "Complex impulse noise removal from color images based on super pixel segmentation.",
            "Combining self-learning based super-resolution with denoising for noisy images.",
            "Efficient local and global contour detection based on superpixels.",
            "Thermal-image processing and statistical analysis for vehicle category in nighttime traffic.",
            "Combining multi-layer integration algorithm with background prior and label propagation for saliency detection.",
            "A 3D-DCT video encoder using advanced coding techniques for low power mobile device.",
            "Boundary points based scale invariant 3D point feature.",
            "Frame-wise detection of relocated I-frames in double compressed H.264 videos based on convolutional neural network.",
            "Wide-angle and long-range real time pose estimation: A comparison between monocular and stereo vision systems.",
            "Image contrast enhancement based on intensity expansion-compression.",
            "Constructions of general (k, n) reversible AMBTC-based visual cryptography with two decryption options.",
            "Perceptual stereoscopic video coding using disparity just-noticeable-distortion model.",
            "Improved macroblock level rate control for the spatially scalable extension of H.264/AVC.",
            "Salient object detection via boosting object-level distinctiveness and saliency refinement.",
            "3D saliency detection based on background detection.",
            "Rate control for non-uniform video in HEVC.",
            "A two-stage convolutional sparse prior model for image restoration.",
            "Detecting image seam carving with low scaling ratio using multi-scale spatial and spectral entropies.",
            "Contour segment grouping for object detection.",
            "Semi-supervised learning on large-scale geotagged photos for situation recognition.",
            "Optimal PPVO-based reversible data hiding.",
            "Sum-of-gradient based fast intra coding in 3D-HEVC for depth map sequence (SOG-FDIC).",
            "A generic denoising framework via guided principal component analysis.",
            "Special issue on cross-media big data analytics.",
            "Internet cross-media retrieval based on deep learning.",
            "Hybrid textual-visual relevance learning for content-based image retrieval.",
            "Multimedia venue semantic modeling based on multimodal data.",
            "Multimedia annotation via semi-supervised shared-subspace feature selection.",
            "Representative band selection for hyperspectral image classification.",
            "Contextual aerial image categorization using codebook.",
            "Graph-regularized concept factorization for multi-view document clustering.",
            "Combining passive visual cameras and active IMU sensors for persistent pedestrian tracking.",
            "High-level background prior based salient object detection.",
            "Collaborative sparse representation leaning model for RGBD action recognition.",
            "Multi-view representation learning for multi-view action recognition.",
            "Bilinear dynamics for crowd video analysis.",
            "Identifying source camera using guided image estimation and block weighted average.",
            "Hierarchical image resampling detection based on blind deconvolution.",
            "Improved marching tetrahedra algorithm based on hierarchical signed distance field and multi-scale depth map fusion for 3D reconstruction.",
            "Online multi-objective optimization for live video forwarding across video data centers.",
            "Learning location constrained pixel classifiers for image parsing.",
            "Distributed video coding based on vector quantization: Application to capsule endoscopy.",
            "Saliency detection for panoramic landscape images of outdoor scenes.",
            "Block linear discriminant analysis for visual tensor objects with frequency or time information.",
            "Support vector machine active learning by Hessian regularization.",
            "Multiple structure recovery with T-linkage.",
            "Image retrieval framework based on texton uniform descriptor and modified manifold ranking.",
            "Motion detection using block based bi-directional optical flow method.",
            "SURF binarization and fast codebook construction for image retrieval.",
            "Using distortion and asymmetry determination for blind stereoscopic image quality assessment strategy.",
            "A chordiogram image descriptor using local edgels.",
            "Local SVD based NIR face retrieval.",
            "Aligned and non-aligned double JPEG detection using convolutional neural networks.",
            "Improved image tamper localisation using chaotic maps and self-recovery.",
            "A critical survey of state-of-the-art image inpainting quality assessment metrics.",
            "A novel recurrent hybrid network for feature fusion in action recognition.",
            "An efficient and effective blind camera image quality metric via modeling quaternion wavelet coefficients.",
            "Large scale automatic image annotation based on convolutional neural network.",
            "Coral reef image classification employing Improved LDP for feature extraction.",
            "Combating highly imbalanced steganalysis with small training samples using feature selection, .",
            "Adaptive directional bounding box from RGB-D information for improving fall detection.",
            "Optimizing the image R/D coding performance by tuning quantization parameters.",
            "Quaternion pseudo-Zernike moments combining both of RGB information and depth information for color image splicing detection.",
            "A novel approach for sharing multiple color images by employing Chinese Remainder Theorem.",
            "Fast mode decision and PU size decision algorithm for intra depth coding in 3D-HEVC.",
            "Exploring visual dictionaries: A model driven perspective.",
            "Robust face anti-spoofing with depth information.",
            "Cube-based perceptual weighted Kronecker Compressive Sensing: Can we avoid non-visible redundancies acquisition?",
            "Reversible data hiding using multi-pass pixel value ordering and prediction-error expansion.",
            "Speed up kernel dependence maximization for multi-label feature extraction.",
            "Novel \"Squiral\" (square spiral) architecture for fast image processing.",
            "No reference image blurriness assessment with local binary patterns.",
            "Graph-regularized CF with local coordinate for image representation.",
            "Next-active-object prediction from egocentric videos.",
            "Vehicle counting in crowded scenes with multi-channel and multi-task convolutional neural networks.",
            "Boolean operations on rasterized shapes represented by chain codes using space filling curves.",
            "A novel adaptive logic for dynamic adaptive streaming over HTTP.",
            "Color enhanced local binary patterns in covariance matrices descriptors (ELBCM).",
            "A novel Monogenic Directional Pattern (MDP) and pseudo-Voigt kernel for facilitating the identification of facial emotions."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2016",
        "info": "2016: Volumes\n34,\n35,\n36,\n37,\n38,\n39,\n40,\n41",
        "count": 276,
        "papers": [
            "A survey on image mosaicing techniques.",
            "Beyond pixels: A comprehensive survey from bottom-up to semantic image segmentation and cosegmentation.",
            "The ANN based detector to remove random-valued impulse noise in images.",
            "A novel hierarchical data association with dynamic viewpoint model for multiple targets tracking.",
            "Weber Binarized Statistical Image Features (WBSIF) based video copy detection.",
            "Iterative Wedgelet Transform: An efficient algorithm for computing wedgelet representation and approximation of images.",
            "A fast mode decision algorithm applied in medium-grain quality scalable video coding.",
            "Pathological liver segmentation using stochastic resonance and cellular automata.",
            "Unbalanced JPEG image steganalysis via multiview data match.",
            "A varied local edge pattern descriptor and its application to texture classification.",
            "An image pixel based variational model for histogram equalization.",
            "Double Gaussian mixture model for image segmentation with spatial relationships.",
            "Orthogonal Polar V Transforms and application to shape retrieval.",
            "A fast region segmentation algorithm on compressed gray images using Non-symmetry and Anti-packing Model and Extended Shading representation.",
            "Image distance metric learning based on neighborhood sets for automatic image annotation.",
            "Robust visual tracking via CAMShift and structural local sparse appearance model.",
            "Vehicle detection in aerial imagery : A small target detection benchmark.",
            "Content-adaptive parameters estimation for multi-dimensional rate control.",
            "Fast and robust object tracking via Accept-Reject color histogram-based method.",
            "Perceptual similarity between color images using fuzzy metrics.",
            "2D facial expression recognition via 3D reconstruction and feature fusion.",
            "A DAISY descriptor based multi-view stereo method for large-scale scenes.",
            "Integer transform based reversible watermarking incorporating block selection.",
            "People tracking in an environment with multiple depth cameras: A skeleton-based pairwise trajectory matching scheme.",
            "Double compression detection based on local motion vector field analysis in static-background videos.",
            "Recognition of the gaze direction: Anchoring with the eyebrows.",
            "SCTMS: Superpixel based color topographic map segmentation method.",
            "Single image super-resolution via internal gradient similarity.",
            "Learning hierarchical spatio-temporal pattern for human activity prediction.",
            "HEVC intra mode selection based on Rate Distortion (RD) cost and Sum of Absolute Difference (SAD).",
            "Low complexity encoder optimization for HEVC.",
            "Evaluation of objective quality metrics for multidimensional video scalability.",
            "Discriminative descriptors for object tracking.",
            "A new thresholding approach for automatic generation of polygonal approximations.",
            "Compressed domain video saliency detection using global and local spatiotemporal features.",
            "Image representation by harmonic transforms with parameters in SL(2, R).",
            "Halftoning-based Block Truncation Coding image restoration.",
            "Sequentially adaptive active appearance model with regression-based online reference appearance template.",
            "Canonical principal angles correlation analysis for two-view data.",
            "Complete lattice learning for multivariate mathematical morphology.",
            "Evaluating color vision deficiency daltonization methods using a behavioral visual-search method.",
            "Efficient virtual network transmission using correlated equilibrium on Xen-based platform.",
            "Spatially variant defocus blur map estimation and deblurring from a single image.",
            "A neutrosophic filter for high-density Salt and Pepper noise based on pixel-wise adaptive smoothing parameter.",
            "Evaluation of color descriptors for projector-camera systems.",
            "Denoising by low-rank and sparse representations.",
            "Indexing and encoding based image feature representation with bin overlapped similarity measure for CBIR applications.",
            "Robust residual error consistent tracker with ranking mechanism.",
            "Kernel propagation strategy: A novel out-of-sample propagation projection for subspace learning.",
            "Segmentation by weighted aggregation and perceptual hash for pedestrian detection.",
            "Efficient visual object detection with spatially global Gaussian mixture models and uncertainties.",
            "Gait identification with partial occlusion using six modules and consideration of occluded module exclusion.",
            "A model-based approach to camera's auto exposure control.",
            "Signal-dependent noise removal for color videos using temporal and cross-channel priors.",
            "Rate-energy-accuracy optimization of convolutional architectures for face recognition.",
            "Cartoon filter via adaptive abstraction.",
            "PEL: A Predictive Edge Linking algorithm.",
            "Automatic license plate detection in hazardous condition.",
            "A modified convex variational model for multiplicative noise removal.",
            "A novel moving object segmentation framework utilizing camera motion recognition for H.264 compressed videos.",
            "Sparse molecular image representation.",
            "An improved scheme for data hiding in encrypted H.264/AVC videos.",
            "Special issue on weakly supervised learning.",
            "Network in network based weakly supervised learning for visual tracking.",
            "Adaptive visual target detection and tracking using weakly supervised incremental appearance learning and RGM-PHD tracker.",
            "APPOS: An adaptive partial occlusion segmentation method for multiple vehicles tracking.",
            "Local consistent hierarchical Hough Match for image re-ranking.",
            "3D object retrieval based on sparse coding in weak supervision.",
            "Towards robust subspace recovery via sparsity-constrained latent low-rank representation.",
            "An aerial image recognition framework using discrimination and redundancy quality measure.",
            "An improved augmented reality system based on AndAR.",
            "Genetic algorithm and mathematical morphology based binarization method for strip steel defect image with non-uniform illumination.",
            "Digital images authentication scheme based on bimodal biometric watermarking in an independent domain.",
            "Spare L1-norm-based maximum margin criterion.",
            "SVD-based self-embedding image authentication scheme using quick response code features.",
            "A robust watermarking framework for High Efficiency Video Coding (HEVC) - Encoded video with blind extraction process.",
            "Finding spatio-temporal salient paths for video objects discovery.",
            "Background light ray modeling for change detection.",
            "A new Global-Gabor-Zernike feature descriptor and its application to face recognition.",
            "A novel image retrieval method based on multi-trend structure descriptor.",
            "Depth-based detection with region comparison features.",
            "Creative and high-quality image composition based on a new criterion.",
            "Modeling feature distances by orientation driven classifiers for person re-identification.",
            "FITD: Fast Intra Transcoding from H.264/AVC to high efficiency video coding based on DCT coefficients and prediction modes.",
            "Evaluation of feature point detection in high dynamic range imagery.",
            "A fast scanning based message receiving method on four directed acyclic subgraphs.",
            "Cluster-based image super-resolution via jointly low-rank and sparse representation.",
            "Unsigned Manhattan chain code.",
            "Multi-scale noise estimation for image splicing forgery detection.",
            "New iterative closest point algorithm for isotropic scaling registration of point sets with noise.",
            "Robust motion estimation for night-shooting videos using dual-accumulated constraint warping.",
            "Context-aware joint dictionary learning for color image demosaicking.",
            "Binocular perception based reduced-reference stereo video quality assessment method.",
            "A new SVM-based relevance feedback image retrieval using probabilistic feature and weighted kernel function.",
            "Evaluation of local and global descriptors for emotional impact recognition.",
            "Implementation of TiOISSS with meaningful shadows and with an additional authentication image.",
            "Memory-efficient high-speed VLSI implementation of multi-level discrete wavelet transform.",
            "A weakly supervised large margin domain adaptation method for isolated handwritten digit recognition.",
            "Predicted multi-variable intelligent matching pursuit algorithm for image sequences reconstruction based on l0 minimization.",
            "Improved PVO-based reversible data hiding: A new implementation based on multiple histograms modification.",
            "Low false positive learning with support vector machines.",
            "Virtual view synthesis using layered depth image generation and depth-based inpainting for filling disocclusions and translucent disocclusions.",
            "Perceptual synoptic view of pixel, object and semantic based attributes of video.",
            "Multiple description video coding based on adaptive data reuse.",
            "Spectral clustering steered low-rank representation for subspace segmentation.",
            "A new approach for multi-view gait recognition on unconstrained paths.",
            "Fractional-order total variation combined with sparsifying transforms for compressive sensing sparse image reconstruction.",
            "Spatial quality index based rate perceptual-distortion optimization for video coding.",
            "Small-world brain functional network altered by watching 2D/3DTV.",
            "Iterative non-local means filter for salt and pepper noise removal.",
            "Integration of image quality and motion cues for face anti-spoofing: A neural network approach.",
            "An image restoration model combining mixed L1/L2 fidelity terms.",
            "Efficient prediction of CU depth and PU mode for fast HEVC encoding using statistical analysis.",
            "Noise robust image matching using adjacent evaluation census transform and wavelet edge joint bilateral filter in stereo vision.",
            "Underwater image enhancement method using weighted guided trigonometric filtering and artificial light correction.",
            "Segmentation of longitudinal brain MR images using bias correction embedded fuzzy c-means with non-locally spatio-temporal regularization.",
            "Dense crowd counting from still images with convolutional neural networks.",
            "Constellational contour parsing for deformable object detection.",
            "Color image quality assessment based on sparse representation and reconstruction residual.",
            "Supervised within-class-similar discriminative dictionary learning for face recognition.",
            "A new sampling algorithm for high-quality image matting.",
            "Fast total variation deconvolution for blurred image contaminated by Poisson noise.",
            "Two-layered structure for optimally essential secret image sharing scheme.",
            "Matching of images with projective distortion using transform invariant low-rank textures.",
            "Tri-directional gradient operators for hexagonal image processing.",
            "Parsing 3D motion trajectory for gesture recognition.",
            "Leveraging similarities and structure for dense representations combination in image retrieval.",
            "Signer-independence finger alphabet recognition using discrete wavelet transform and area level run lengths.",
            "Local quaternion PHT based robust color image watermarking algorithm.",
            "Radiance map construction based on spatial and intensity correlations between LE and SE images for HDR imaging.",
            "Clustering of hierarchical image database to reduce inter-and intra-semantic gaps in visual space for finding specific image semantics.",
            "Adaptive deblocking method for low bitrate coded HEVC video.",
            "Intrinsic structure based feature transform for image classification.",
            "Spatially constrained level-set tracking and segmentation of non-rigid objects.",
            "A two-stage shape retrieval (TSR) method with global and local features.",
            "Deformable part-based tracking by coupled global and local correlation filters.",
            "Effective self-embedding watermarking scheme for image tampered detection and localization with recovery capability.",
            "An unequal error protection scheme for reliable peer-to-peer scalable video streaming.",
            "Histogram equalization and optimal profile compression based approach for colour image enhancement.",
            "A simple primal-dual method for total variation image restoration.",
            "Machine learning based fast H.264/AVC to HEVC transcoding exploiting block partition similarity.",
            "Robust non-blind color video watermarking using QR decomposition and entropy analysis.",
            "Fusion of multifocus images by lattice structures.",
            "Secure multicasting of images via joint privacy-preserving fingerprinting, decryption, and authentication.",
            "Depth extraction of partially occluded objects using deformable net.",
            "High-fidelity reversible data hiding based on pixel-value-ordering and pairwise prediction-error expansion.",
            "Optimal depth recovery using image guided TGV with depth confidence for high-quality view synthesis.",
            "A flexible technique based on fundamental matrix for camera self-calibration with variable intrinsic parameters from two views.",
            "A ROI-based reversible data hiding scheme in encrypted medical images.",
            "3-D color histogram equalization by principal component analysis.",
            "Efficient multiple-example based super-resolution for symmetric mixed resolution stereoscopic video coding.",
            "A real-time detector for parked vehicles based on hybrid background modeling.",
            "Adjusting samples for obtaining better l2-norm minimization based sparse representation.",
            "A multi-object image segmentation C-V model based on region division and gradient guide.",
            "Edge-preserving guided filtering based cost aggregation for stereo matching.",
            "Simultaneous reconstruction and calibration for multi-view structured light scanning.",
            "Efficient no-reference metric for sharpness mismatch artifact between stereoscopic views.",
            "Non-reference assessment of sharpness in blur/noise degraded images.",
            "An efficient unsupervised method for obtaining polygonal approximations of closed digital planar curves.",
            "Homography-based block motion estimation for video coding of PTZ cameras.",
            "Speckle noise removal via nonlocal low-rank regularization.",
            "Robust techniques for abandoned and removed object detection based on Markov random field.",
            "A mixture model using Random Rotation Bounding Box to detect table region in document image.",
            "Relative distance features for gait recognition with Kinect.",
            "An adaptive people counting system with dynamic features selection and occlusion handling.",
            "Underwater image processing method for fish localization and detection in submarine environment.",
            "SARDH: A novel sharpening-aware reversible data hiding algorithm.",
            "Tracking with dynamic weighted compressive model.",
            "Joint fingerprinting and decryption method for color images based on quaternion rotation with cipher quaternion chaining.",
            "Blind image motion deblurring with L0-regularized priors.",
            "A novel method for image classification based on bag of visual words.",
            "Computational complexity allocation and control for inter-coding of high efficiency video coding with fast coding unit split decision.",
            "Extended common molecular and discriminative atom dictionary based sparse representation for face recognition.",
            "On the effective subkey space of some image encryption algorithms using external key.",
            "Blind image restoration with sparse priori regularization for passive millimeter-wave images.",
            "Person re-identification based on multi-region-set ensembles.",
            "Improved visual information fidelity based on sensitivity characteristics of digital images.",
            "Single image dehazing via reliability guided fusion.",
            "A robust iterative super-resolution mosaicking algorithm using an adaptive and directional Huber-Markov regularization.",
            "Encrypted JPEG image retrieval using block-wise feature comparison.",
            "Disparity map enhancement in pixel based stereo matching method using distance transform.",
            "Computer assisted diagnosis of basal cell carcinoma using Z-transform features.",
            "Spatially misaligned HEVC transcoding with computational-complexity scalability.",
            "Gradient-layer feature transform for action detection and recognition.",
            "Adaptive shock filter for image super-resolution and enhancement.",
            "Robust natural image segmentation by using spatially constrained multivariate mixed Student's t-distribution and TV flow edge.",
            "A novel method of multimodal medical image fusion using fuzzy transform.",
            "Image fusion based on visual salient features and the cross-contrast.",
            "Image camouflage by reversible image transformation.",
            "Multiple clusters parts-based sparse representation for single example face identification.",
            "Visual saliency detection based on homology similarity and an experimental evaluation.",
            "Long-range trajectories from global and local motion representations.",
            "Accurate and robust feature-based homography estimation using HALF-SIFT and feature localization error weighting.",
            "Improved road centerlines extraction in high-resolution remote sensing images using shear transform, directional morphological filtering and enhanced broken lines connection.",
            "Structure-aware image inpainting using patch scale optimization.",
            "A new detector for contourlet domain multiplicative image watermarking using Bessel K form distribution.",
            "Blind quality index for camera images with natural scene statistics and patch-based sharpness assessment.",
            "A unified Bayesian mixture model framework via spatial information for grayscale image segmentation.",
            "Fast approximate DCT with GPU implementation for image compression.",
            "Combining inconsistent textures using convolutional neural networks.",
            "Object detection in SAR image based on bandlet transform.",
            "Anisotropic diffusion noise filtering using region adaptive smoothing strength.",
            "C2DMCP: View-consistent collaborative discriminative multiset correlation projection for data representation.",
            "An edge fusion scheme for image denoising based on anisotropic diffusion models.",
            "Scalable line-based wavelet image coding in wireless sensor networks.",
            "Kernel discriminant analysis of Block-wise Gaussian Derivative Phase Pattern Histogram for palmprint recognition.",
            "Joint image splicing detection in DCT and Contourlet transform domain.",
            "Reversible data hiding based on multilevel histogram modification and pixel value grouping.",
            "Kernel dictionary learning based discriminant analysis.",
            "A modified multi-grid algorithm for a novel variational model to remove multiplicative noise.",
            "Multi-layer authentication scheme for HEVC video based on embedded statistics.",
            "Fast reference frame selection based on content similarity for low complexity HEVC encoder.",
            "Regularized MSBL algorithm with spatial correlation for sparse hyperspectral unmixing.",
            "Block-based histogram of optical flow for isolated sign language recognition.",
            "Event recognition in photo albums using probabilistic graphical models and feature relevance.",
            "Coherence restricted StOMP and its application in image fusion.",
            "Boosting up the data hiding rate through multi cycle embedment process.",
            "Reconstruction of lost depth data in multiview video-plus-depth communications using geometric transforms.",
            "Perceptually-lossless image coding based on foveated-JND and H.265/HEVC.",
            "A spatially constrained generative asymmetric Gaussian mixture model for image segmentation.",
            "Feature discovering for image classification via wavelet-like pattern decomposition.",
            "Image selective restoration using multi-scale variational decomposition.",
            "Multiframe super-resolution based on half-quadratic prior with artifacts suppress.",
            "Fast algorithm based on the sole- and multi-depth texture measurements for HEVC intra coding.",
            "FACE: Fully Automated Context Enhancement for night-time video sequences.",
            "A rapid hybrid algorithm for image restoration combining parametric Wiener filtering and wave atom transform.",
            "Direct method for rotation estimation from spherical images using 3D mesh surfaces with SPHARM representation.",
            "3D model retrieval by sample based alignment.",
            "Improved joint reversible data hiding in encrypted images.",
            "Convolutional neural network based deep conditional random fields for stereo matching.",
            "An improved RANSAC based on the scale variation homogeneity.",
            "Reversible data hiding in Paillier cryptosystem.",
            "Unified discriminating feature analysis for visual category recognition.",
            "ARGIS-based outdoor underground pipeline information system.",
            "Artistic information extraction from Chinese calligraphy works via Shear-Guided filter.",
            "Weakly supervised image parsing via label propagation over discriminatively semantic graph.",
            "Vehicle Tracking and Speed Measurement system (VTSM) based on novel feature descriptor: Diagonal Hexadecimal Pattern (DHP).",
            "Plane surface detection and reconstruction using segment-based tensor voting.",
            "Quality biased multimedia data retrieval in microblogs.",
            "Unsupervised discriminative hashing.",
            "Representing 3D shapes based on implicit surface functions learned from RBF neural networks.",
            "Generalizing intersection kernel support vector machines for color texture based recognition.",
            "Intermediate multimedia node: Implantable spinal cord stimulator.",
            "Optimal bi-directional seam carving for compressibility-aware image retargeting.",
            "A simple computational framework for defect detection system with orthogonal polynomials transcoded coefficients.",
            "Multi-patch embedding canonical correlation analysis for multi-view feature learning.",
            "Reversible data hiding for encrypted signals by homomorphic encryption and signal energy transfer.",
            "A video semantic detection method based on locality-sensitive discriminant sparse representation and weighted KNN.",
            "An image denoising algorithm for mixed noise combining nonlocal means filter and sparse representation technique.",
            "Statistical feature extraction based technique for fast fractal image compression.",
            "Poisson inverse problems by the Plug-and-Play scheme.",
            "Robust penalty-weighted deblurring via kernel adaption using single image.",
            "Multi-manifold-based skin classifier on feature space Voronoï regions for skin segmentation.",
            "Visible-light and near-infrared face recognition at a distance.",
            "BDSB: Binary descriptor with shared pixel blocks.",
            "Nonnegative coding based ensemble tracking.",
            "An efficient depth image-based rendering with depth reliability maps for view synthesis.",
            "Reversible data hiding based on flexible block-partition and adaptive block-modification strategy.",
            "City-view image location identification by multiple geo-social media and graph-based image cluster refinement.",
            "Collaborative representation discriminant embedding for image classification.",
            "A fast and efficient image retrieval system based on color and texture features.",
            "Improving image segmentation by using energy function based on mixture of Gaussian pre-processing.",
            "Geometrically resilient color image zero-watermarking algorithm based on quaternion Exponent moments.",
            "Decomposition-based tensor learning regression for improved classification of multimedia.",
            "Semi-supervised feature selection with exploiting shared information among multiple tasks.",
            "Gaussian-Hermite moment-based depth estimation from single still image for stereo vision.",
            "A spatially variant total variational model for chromatic aberration correction.",
            "A polygonal approximation of shape boundaries of marine plankton based-on genetic algorithms.",
            "A semi-automated system based on level sets and invariant spatial interrelation shape features for Caenorhabditis elegans phenotypes.",
            "Joint enhancement-compression of handwritten document images through DjVu encoder.",
            "A robust 2D Otsu's thresholding method in image segmentation.",
            "Morphological normalization of vowel images for articulatory speech recognition.",
            "Saliency-based dense trajectories for action recognition using low-rank matrix decomposition.",
            "Spatio-temporal action localization and detection for human action recognition in big dataset.",
            "On-line video object segmentation using illumination-invariant color-texture feature extraction and marker prediction.",
            "Understanding convolutional neural networks with a mathematical model."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2015",
        "info": "2015: Volumes\n26,\n27,\n28,\n29,\n30,\n31,\n32,\n33",
        "count": 187,
        "papers": [
            "AN H.264/AVC HDTV watermarking algorithm robust to camcorder recording.",
            "JPEG encryption for image rescaling in the encrypted domain.",
            "A new lossless data hiding method based on joint neighboring coding.",
            "QoE-aware video streaming for SVC over multiuser MIMO-OFDM systems.",
            "Representation of image content based on RoI-BoW.",
            "Image super-resolution using sparse coding over redundant dictionary based on effective image representations.",
            "A human visual system-driven image segmentation algorithm.",
            "Non-iterative and spatial domain focus map estimation based on intentional re-blur from a single image (NasBirSi).",
            "Random grid-based visual secret sharing with multiple decryptions.",
            "Subjective quality evaluation of compressed digital compound images.",
            "An iterative adaptive multi-modal stereo-vision method using mutual information.",
            "Automatic Red-Channel underwater image restoration.",
            "The image segmentation based on optimized spatial feature of superpixel.",
            "Multi-scale contour flexibility shape signature for Fourier descriptor.",
            "Joint global-local information pedestrian detection algorithm for outdoor video surveillance.",
            "TriViews: A general framework to use 3D depth data effectively for action recognition.",
            "Saliency-based content-aware lifestyle image mosaics.",
            "Comparative study of frame-compatible stereo 3D services and a novel method for spatial interleaving using HEVC.",
            "QoS-Optimized Adaptive Multi-layer (OQAM) architecture of wireless network for high quality digital video transmission.",
            "Automatically classifying paintings with perceptual inspired descriptors.",
            "Visual object tracking via online sparse instance learning.",
            "Non-negativity and dependence constrained sparse coding for image classification.",
            "Feature histogram equalization for feature contrast enhancement.",
            "Singular Value Decomposition Projection for solving the small sample size problem in face recognition.",
            "Stereo matching cost computation based on nonsubsampled contourlet transform.",
            "Binary image steganalysis based on pixel mesh Markov transition matrix.",
            "Random-valued impulse noise removal using adaptive dual threshold median filter.",
            "Texture classification and discrimination for region-based image retrieval.",
            "Multi-frame de-raining algorithm using a motion-compensated non-local mean filter for rainy video sequences.",
            "STFC: Spatio-temporal feature chain for skeleton-based human action recognition.",
            "Incremental low-rank and sparse decomposition for compressing videos captured by fixed cameras.",
            "Corrigendum to \"Multi-resolution surfel maps for efficient dense 3D modeling and tracking\" [J. Visual Communication and Image Representation 25 (1) (2014) 137-147].",
            "Corrigendum to \"Fast and scalable lock methods for video coding on many-core architecture\" [J. Visual Communication and Image Representation 25 (7) (2014) 1758-1762].",
            "Video quality measurement based on 3-D. Singular value decomposition.",
            "Packet losses and objective video quality metrics in H.264 video streaming.",
            "Automatic target image detection for morphing.",
            "Object recognition via contextual color attention.",
            "Corrigendum to \"Fast and scalable lock methods for video coding on many-core architecture\" [J. Visual Communication and Image Representation 25(7) (2014) 1758-1762].",
            "Image denoising based on iterative generalized cross-validation and fast translation invariant.",
            "L0-norm sparse representation based on modified genetic algorithm for face recognition.",
            "Reversible data hiding in encrypted images based on absolute mean difference of multiple neighboring pixels.",
            "Spatially constrained sparse coding scheme for natural scene categorization.",
            "Dynamic macroblock wavefront parallelism for parallel video coding.",
            "Object tracking based on local dynamic sparse model.",
            "No-reference quality assessment for DCT-based compressed image.",
            "Reversible data hiding scheme for VQ indices based on modified locally adaptive coding and double-layer embedding strategy.",
            "High-fidelity reversible data hiding scheme based on multi-predictor sorting and selecting mechanism.",
            "Hybrid graphical model for semantic image segmentation.",
            "A hand gesture recognition technique for human-computer interaction.",
            "Quadri-directional searching algorithm for secret image sharing using meaningful shadows.",
            "Lossless and near-lossless compression of hyperspectral images based on distributed source coding.",
            "A quantitative evaluation of the conceptual consistency of visual words and visual vocabularies.",
            "No-reference blur assessment based on edge modeling.",
            "A universal chain code compression method.",
            "Going deeper into copy-move forgery detection: Exploring image telltales via multi-scale analysis and voting processes.",
            "A new intra prediction with adaptive template matching through finite state machine.",
            "User-friendly secret image sharing scheme with verification ability based on block truncation coding and error diffusion.",
            "Wavelet-based hybrid natural image modeling using generalized Gaussian and α-stable distributions.",
            "Automatic local parameterization of the Chan Vese active contour model's force coefficients using edge information.",
            "Cost effective window arrangement for spatial pyramid matching.",
            "A person re-identification algorithm by exploiting region-based feature salience.",
            "Forensic and anti-forensic techniques for video shot editing in H.264/AVC.",
            "TapTell: Interactive visual search for mobile task recommendation.",
            "Oriented total variation l1/2 regularization.",
            "Classification of farmland images based on color features.",
            "Robust skin detection in real-world images.",
            "Erratum to \"Automatically classifying paintings with perceptual inspired descriptor\" [J. Visual Commun. 26(2015) 222-230].",
            "MCL-V: A streaming video quality assessment database.",
            "Joint movement similarities for robust 3D action recognition using skeletal data.",
            "Human movement analysis around a view circle using time-order similarity distributions.",
            "Variational Feature Representation-based Classification for face recognition with single sample per person.",
            "A novel set of image morphological operators using a modified vector distance measure with color pixel classification.",
            "An effective vector model for global-contrast-based saliency detection.",
            "An efficient forgery detection algorithm for object removal by exemplar-based image inpainting.",
            "Using binarization and hashing for efficient SIFT matching.",
            "Adaptive sampling for compressed sensing based image compression.",
            "Novel method to obtain the optimal polygonal approximation of digital planar curves based on Mixed Integer Programming.",
            "Image denoising via local and nonlocal circulant similarity.",
            "Secure watermarking scheme against watermark attacks in the encrypted domain.",
            "An effective use of adaptive combination of visual features to retrieve image semantics from a hierarchical image database.",
            "GridSAR: Grid strength and regularity for robust evaluation of blocking artifacts in JPEG images.",
            "Moving object detection and tracking from video captured by moving camera.",
            "Video super-resolution with registration-reliability regulation and adaptive total variation.",
            "New high-performance reversible data hiding method for VQ indices based on improved locally adaptive coding scheme.",
            "Efficient saliency analysis based on wavelet transform and entropy theory.",
            "Robust tracking using visual cue integration for mobile mixed images.",
            "Geometrical-based lip-reading using template probabilistic multi-dimension dynamic time warping.",
            "Video rate control strategies for cloud gaming.",
            "Background replacement using chromatic adaptation transform for visual communication.",
            "Modeling and recognizing action contexts in persons using sparse representation.",
            "Affine hull based target representation for visual tracking.",
            "A bio-inspired center-surround model for salience computation in images.",
            "Context-aware vocabulary tree for mobile landmark recognition.",
            "A topology-based approach to computing neighborhood-of-interest points using the Morse complex.",
            "A singular-value-based semi-fragile watermarking scheme for image content authentication with tamper localization.",
            "Image segmentation via image decomposition and fuzzy region competition.",
            "G-SHOT: GPU accelerated 3D local descriptor for surface matching.",
            "Fast and quality-efficient scheme for asymmetric multi-view video plus depth coding under the bitrate constraint.",
            "Multi-level adaptive switching filters for highly corrupted images.",
            "Tensor rank selection for multimedia analysis.",
            "Rotation invariant color texture classification using multiple sub-DLBPs.",
            "Content adaptive video denoising based on human visual perception.",
            "Optimized sampling distribution based on nonparametric learning for improved compressive sensing performance.",
            "Scalable 3D video streaming over P2P networks with playback length changeable chunk segmentation.",
            "Robust tracking based on local structural cell graph.",
            "Reversible data hiding based on local histogram shifting with multilayer embedding.",
            "Digital watermark extraction using support vector machine with principal component analysis based feature reduction.",
            "An advanced gradient histogram and its application for contrast and gradient enhancement.",
            "Surface trees - Representation of boundary surfaces using a tree descriptor.",
            "Motion-compensated orthonormal expansion ℓ1-minimization for reference-driven MRI reconstruction using Augmented Lagrangian methods.",
            "Unsupervised regions based segmentation using object discovery.",
            "A perceptual stereoscopic image quality assessment model accounting for binocular combination behavior.",
            "A reversible data hiding method with contrast enhancement for medical images.",
            "Effective reversible data hiding in encrypted image with privacy protection for image content.",
            "Noise-resistant Digital Euclidean Connected Skeleton for graph-based shape matching.",
            "An ultra-fast human detection method for color-depth camera.",
            "Retinal blood vessel localization approach based on bee colony swarm optimization, fuzzy c-means and pattern search.",
            "Optimal-correlation-based reconstruction for distributed compressed video sensing.",
            "Dense SIFT for ghost-free multi-exposure fusion.",
            "Dictionary based surveillance image compression.",
            "LSH-based semantic dictionary learning for large scale image understanding.",
            "Improving the search accuracy of the VLAD through weighted aggregation of local descriptors.",
            "Beyond pure quality: Progressive modes, region of interest coding, and real time video decoding for PDE-based image compression.",
            "Adaptive-interpolative binarization with stroke preservation for restoration of faint characters in degraded documents.",
            "Split Bregmanized anisotropic total variation model for image deblurring.",
            "Adaptive intra-refresh for low-delay error-resilient video coding.",
            "Learning-based image interpolation via robust k-NN searching for coherent AR parameters estimation.",
            "Linear collaborative discriminant regression classification for face recognition.",
            "Copy-move image forgery detection based on Gabor magnitude.",
            "An effective cross-layer designed packet scheduling, call admission control, and handover system for video streaming services over LTE network.",
            "GPU-Accelerated Video Background Subtraction Using Gabor Detector.",
            "A survey of human pose estimation: The body parts parsing based methods.",
            "Semantic content-based image retrieval: A comprehensive study.",
            "Two-dimensional principal component analysis based on Schatten p-norm for image feature extraction.",
            "Two-person interaction recognition via spatial multiple instance embedding.",
            "New results on connectivity in wireless network.",
            "A two-stage shearlet-based approach for the removal of random-valued impulse noise in images.",
            "Saliency detection based on singular value decomposition.",
            "Effective computation-aware algorithm by inter-layer motion analysis for scalable video coding.",
            "Graph-based video fingerprinting using double optimal projection.",
            "Blind image watermarking via exploitation of inter-block prediction and visibility threshold in DCT domain.",
            "Salient region detection through sparse reconstruction and graph-based ranking.",
            "A comparison of interest point and region detectors on structured, range and texture images.",
            "Classification schemes based on Partial Least Squares for face identification.",
            "Nonconvex higher-order regularization based Rician noise removal with spatially adaptive parameters.",
            "Fine registration of 3D point clouds fusing structural and photometric information using an RGB-D camera.",
            "No reference image quality assessment metric via multi-domain structural information and piecewise regression.",
            "Image-based coin recognition using rotation-invariant region binary patterns based on gradient magnitudes.",
            "Center symmetric local binary co-occurrence pattern for texture, face and bio-medical image retrieval.",
            "Error concealment for the transmission of H.264/AVC-compressed 3D video in color plus depth format.",
            "Contrast enhancement influences the detection of gradient based local invariant features and the matching of their descriptors.",
            "NR-Bitstream video quality metrics for SSIM using encoding decisions in AVC and HEVC coded videos.",
            "Boundary-preserving stereo matching with certain region detection and adaptive disparity adjustment.",
            "Image segmentation based on weighting boundary information via graph cut.",
            "A site entropy rate and degree centrality based algorithm for image co-segmentation.",
            "Friendly progressive random-grid-based visual secret sharing with adaptive contrast.",
            "Bi-l0-l2-norm regularization for blind motion deblurring.",
            "Early merge mode decision for texture coding in 3D-HEVC.",
            "Gait recognition with Transient Binary Patterns.",
            "Improved SAP based on adaptive directional prediction for HEVC lossless intra prediction.",
            "A new image retrieval model based on monogenic signal representation.",
            "Blind single-image super resolution based on compressive sensing.",
            "Global Correlation Descriptor: A novel image representation for image retrieval.",
            "Mallows' statistics CL: A novel criterion for parametric PSF estimation.",
            "Supervised dictionary learning for blind image quality assessment using quality-constraint sparse coding.",
            "Robust domain adaptation image classification via sparse and low rank representation.",
            "Discriminative outlines parts for shape retrieval.",
            "Multiexposure image fusion using intensity enhancement and detail extraction.",
            "Cooperative object search and segmentation in Internet images.",
            "A self-adaptive weighted affinity propagation clustering for key frames extraction on human action recognition.",
            "Automated coronal hole segmentation from Solar EUV Images using the watershed transform.",
            "A fast encryption algorithm of color image based on four-dimensional chaotic system.",
            "Color gradient vectorization for SVG compression of comic image.",
            "A novel approach for pain intensity detection based on facial feature deformations.",
            "Optimal layered representation for adaptive interactive multiview video streaming.",
            "Projected Transfer Sparse Coding for cross domain image representation.",
            "Residential area extraction based on saliency analysis for high spatial resolution remote sensing images.",
            "Joint modeling and reconstruction of a compressively-sensed set of correlated images.",
            "SuperPixel based mid-level image description for image recognition.",
            "Depth video spatial and temporal correlation enhancement algorithm based on just noticeable rendering distortion model.",
            "Adjacent evaluation of local binary pattern for texture classification.",
            "Learning contrastive feature distribution model for interaction recognition.",
            "L2/3 regularization: Convergence of iterative thresholding algorithm.",
            "A privilege-based visual secret sharing model.",
            "Image automatic annotation via multi-view deep representation.",
            "Surroundedness based multiscale saliency detection.",
            "A novel reversible data hiding scheme based on difference-histogram modification and optimal EMD algorithm."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2014",
        "info": "2014: Volume 25",
        "count": 174,
        "papers": [
            "Introduction to the special issue on visual understanding and applications with RGB-D cameras.",
            "Effective 3D action recognition using EigenJoints.",
            "Pose-based human action recognition via sparse representation in dissimilarity space.",
            "Sequence of the most informative joints (SMIJ): A new representation for human skeletal action recognition.",
            "An adaptable system for RGB-D based human body detection and pose estimation.",
            "Pose Depth Volume extraction from RGB-D streams for frontal gait recognition.",
            "Learning of perceptual grouping for object segmentation on RGB-D data.",
            "Object segmentation and classification using 3-D range camera.",
            "Continuous plane detection in point-cloud data based on 3D Hough Transform.",
            "Local scene flow by tracking in intensity and depth.",
            "Incremental object learning and robust tracking of multiple objects from RGB-D point set data.",
            "Background foreground segmentation with RGB-D Kinect data: An efficient combination of classifiers.",
            "Multi-resolution surfel maps for efficient dense 3D modeling and tracking.",
            "A probabilistic framework for next best view estimation in a cluttered environment.",
            "Fusion of 3D-LIDAR and camera data for scene parsing.",
            "Region based foreground segmentation combining color and depth sensors via logarithmic opinion pool decision.",
            "The TUM Gait from Audio, Image and Depth (GAID) database: Multimodal recognition of subjects and traits.",
            "Live RGB-D camera tracking for television production studios.",
            "Automatic, fast, online calibration between depth and color cameras.",
            "Calibrated depth and color cameras for accurate 3D interaction in a stereoscopic augmented reality environment.",
            "A DCT/DST-based error propagation-free data hiding algorithm for HEVC intra-coded frames.",
            "Multiple-step local Wiener filter with proper stopping in wavelet domain.",
            "RGB-D image-based detection of stairs, pedestrian crosswalks and traffic signs.",
            "PLDD: Point-lines distance distribution for detection of arbitrary triangles, regular polygons and circles.",
            "A framework for video event classification by modeling temporal context of multimodal features using HMM.",
            "Local maximal margin discriminant embedding for face recognition.",
            "An effective dual method for multiplicative noise removal.",
            "A robust elastic net approach for feature learning.",
            "Efficient reversible data hiding in encrypted images.",
            "Graph-based approach for human action recognition using spatio-temporal features.",
            "Context-aware features and robust image representations.",
            "Encoding true-color images with a limited palette via soft vector clustering as an instance of dithering multidimensional signals.",
            "Low complexity distributed video coding.",
            "Rotation and flipping robust region binary patterns for video copy detection.",
            "Online image search result grouping with MapReduce-based image clustering and graph construction for large-scale photos.",
            "A framework for automated cell tracking in phase contrast microscopic videos based on normal velocities.",
            "An improved reversible data hiding-based approach for intra-frame error concealment in H.264/AVC.",
            "Collaborative object tracking model with local sparse representation.",
            "Computation of level lines of 4-/8-connectedness.",
            "Weighted haze removal method with halo prevention.",
            "A novel high-performance reversible data hiding scheme using SMVQ and improved locally adaptive coding method.",
            "Quality-efficient syntax element-based de-interlacing method for H.264-coded video sequences with various resolutions.",
            "An effective 2-stage method for removing impulse noise in images.",
            "Confidentiality of a selectively encrypted H.264 coded video bit-stream.",
            "Gesture-based interaction with voice feedback for a tour-guide robot.",
            "A rectilinear Gaussian model for estimating straight-line parameters.",
            "Editorial: Special issue on QoE in 2D/3D video systems.",
            "Saliency detection in computer rendered images based on object-level contrast.",
            "A new reduced reference metric for color plus depth 3D video.",
            "MDVQM: A novel multidimensional no-reference video quality metric for video transcoding.",
            "Calculation of average coding efficiency based on subjective quality scores.",
            "An autonomous QoE-driven network management framework.",
            "Spatial opportunistic transmission for Quality of Experience satisfaction.",
            "Quality perception when streaming video on tablet devices.",
            "Guest editorial: Advances in 3D video processing.",
            "A flexible architecture for multi-view 3DTV based on uncalibrated cameras.",
            "Simultaneous 2D and 3D perception for stereoscopic displays based on polarized or active shutter glasses.",
            "Real-time generation of multi-view video plus depth content using mixed narrow and wide baseline.",
            "Robust depth sensing with adaptive structured light illumination.",
            "Geometric calibration of a multi-layer LiDAR system and image sensors using plane-based implicit laser parameters for textured 3-D depth reconstruction.",
            "Depth sculpturing for 2D paintings: A progressive depth map completion framework.",
            "Overview of the MVC + D 3D video coding standard.",
            "Systematic analysis of the decoding delay in multiview video.",
            "Geometric and colorimetric error compensation for multi-view images.",
            "Automatic objects segmentation with RGB-D cameras.",
            "Recognizing object manipulation activities using depth and visual cues.",
            "Statistical distributional approach for scale and rotation invariant color image retrieval using multivariate parametric tests and orthogonality condition.",
            "Intrinsic dimensionality estimation based on manifold assumption.",
            "Salt and pepper noise removal in binary images using image block prior probabilities.",
            "Caged mice mating behavior detection in surveillance videos.",
            "Sparse representation for face recognition by discriminative low-rank matrix recovery.",
            "Orientation contrast model for boundary detection.",
            "An orthogonal regularized CCA learning algorithm for feature fusion.",
            "Online semi-supervised compressive coding for robust visual tracking.",
            "A content security protection scheme in JPEG compressed domain.",
            "Blind image deblurring via coupled sparse representation.",
            "Time-sliced averaged motion history image for gait recognition.",
            "Brain MR image segmentation based on local Gaussian mixture model and nonlocal spatial regularization.",
            "Color CENTRIST: Embedding color information in scene categorization.",
            "Bandlet-based sparsity regularization in video inpainting.",
            "Feature compression: A framework for multi-view multi-person tracking in visual sensor networks.",
            "Visual-PSNR measure of image quality.",
            "A novel total variation based frame layer rate control algorithm for H.264/AVC.",
            "Self-learning-based post-processing for image/video deblocking via sparse representation.",
            "Structure and motion from line correspondences: Representation, projection, initialization and sparse bundle adjustment.",
            "Facial expression cloning with elastic and muscle models.",
            "Queueing model based resource optimization for multimedia cloud.",
            "Fast 3D video stabilization using ROI-based warping.",
            "A novel multi-focus image fusion algorithm based on random walks.",
            "Content-based image retrieval using H.264 intra coding features.",
            "Face recognition under large illumination variations using homomorphic filtering in spatial domain.",
            "Moving cast shadow detection using online sub-scene shadow modeling and object inner-edges analysis.",
            "Sub-scene segmentation using constraints based on Gestalt principles.",
            "Patch based image denoising using the finite ridgelet transform for less artifacts.",
            "Model-based approach to spatial-temporal sampling of video clips for video object detection by classification.",
            "Iterative transductive learning for automatic image segmentation and matting with RGB-D data.",
            "Quadtree-based non-local Kuan's filtering in video compression.",
            "New simple and efficient color space transformations for lossless image compression.",
            "Semi-fragile watermarking for grayscale image authentication and tamper detection based on an adjusted expanded-bit multiscale quantization-based technique.",
            "PCA-based dictionary building for accurate facial expression recognition via sparse representation.",
            "Secret image sharing scheme with hierarchical threshold access structure.",
            "An improved differential box-counting method to estimate fractal dimensions of gray-level images.",
            "Multiple kernel-based multi-instance learning algorithm for image classification.",
            "A gender classification system robust to occlusion using Gabor features based (2D)2PCA.",
            "Extracting salient region for pornographic image detection.",
            "Supervised and transductive multi-class segmentation using p-Laplacians and RKHS methods.",
            "False-positive-free SVD-based image watermarking.",
            "Encrypted signal-based reversible data hiding with public key cryptosystem.",
            "CSM neural network for degraded printed character optical recognition.",
            "Image recognition via two-dimensional random projection and nearest constrained subspace.",
            "Content-adaptive bitstream-layer model for coding distortion assessment of H.264/AVC networked video.",
            "3D visual experience oriented cross-layer optimized scalable texture plus depth based 3D video streaming over wireless networks.",
            "Reversible AMBTC-based secret sharing scheme with abilities of two decryptions.",
            "User-independent system for sign language finger spelling recognition.",
            "Hierarchical Implicit Shape Modeling.",
            "Accurate segmentation of land regions in historical cadastral maps.",
            "Alternating asymmetric search range assignment for bidirectional motion estimation in H.265/HEVC and H.264/AVC.",
            "A passive multi-purpose scheme based on periodicity analysis of CFA artifacts for image forensics.",
            "Bird breed classification and annotation using saliency based graphical model.",
            "Content-based image retrieval using local visual attention feature.",
            "Expert content-based image retrieval system using robust local patterns.",
            "Fusion framework for effective color image retrieval.",
            "An expeditious cum efficient algorithm for salt-and-pepper noise removal and edge-detail preservation using cardinal spline interpolation.",
            "Efficient facial landmark localization using spatial-contextual AdaBoost algorithm.",
            "A reversible steganographic scheme for VQ indices based on locally adaptive coding.",
            "Beyond visual word ambiguity: Weighted local feature encoding with governing region.",
            "Handheld object detection and its related event analysis using ratio histogram and mixture of HMMs.",
            "Bipartite graph-based mismatch removal for wide-baseline image matching.",
            "An efficient reversible data hiding scheme using prediction and optimal side information selection.",
            "Action recognition on motion capture data using a dynemes and forward differences representation.",
            "Multiphase image segmentation via equally distanced multiple well potential.",
            "Generalized multiple maximum scatter difference feature extraction using QR decomposition.",
            "A new continuous max-flow algorithm for multiphase image segmentation using super-level set functions.",
            "Gait probability image: An information-theoretic model of gait representation.",
            "Engineering wireless broadband access to IPTV.",
            "Correlation based universal image/video coding loss recovery.",
            "Automatic identification of fruit flies (Diptera: Tephritidae).",
            "An efficient algorithm to eliminate temporal pumping artifact in video coding with hierarchical prediction structure.",
            "Multi-factor cheating prevention in visual secret sharing by hybrid codebooks.",
            "Gradient-based subspace phase correlation for fast and effective image alignment.",
            "Highly parallel GEMV with register blocking method on GPU architecture.",
            "A novel image retrieval method based on hybrid information descriptors.",
            "Finding suits in images of people in unconstrained environments.",
            "Discontinuity preserving disparity estimation with occlusion handling.",
            "MR image enhancement using an extended neighborhood filter.",
            "Multiple kernel learning with NOn-conVex group spArsity.",
            "No-reference image blur index based on singular value curve.",
            "A fast mode decision algorithm applied to Coarse-Grain quality Scalable Video Coding.",
            "Multi-scale embedded descriptor for shape classification.",
            "Discriminative common vector based finger knuckle recognition.",
            "Robust locality preserving projection based on maximum correntropy criterion.",
            "A generic, comprehensive and granular decoder complexity model for the H.264/AVC standard.",
            "Reversible data embedding for indices based on histogram analysis.",
            "Color texture classification method based on a statistical multi-model and geodesic distance.",
            "Fusing multi-cues description for partial-duplicate image retrieval.",
            "Image segmentation using fuzzy energy-based active contour with shape prior.",
            "Image quality/distortion metric based on α-stable model similarity in wavelet domain.",
            "Fast and scalable lock methods for video coding on many-core architecture.",
            "A no-reference sharpness metric based on the notion of relative blur for Gaussian blurred image.",
            "Multi-manifold metric learning for face recognition based on image sets.",
            "Early detection of all-zero 4×4 blocks in High Efficiency Video Coding.",
            "An improved universal subsampling strategy for compressing mosaic videos with arbitrary RGB color filter arrays in H.264/AVC.",
            "Extended linear regression for undersampled face recognition.",
            "Improved interview video error concealment on whole frame packet loss.",
            "Two-stage salient region detection by exploiting multiple priors.",
            "Genetic algorithm based on discrete wavelet transformation for fractal image compression.",
            "Cross-view gait recognition based on human walking trajectory.",
            "Media pattern exhibition mechanism via mobile devices.",
            "Rapid detection of camera tampering and abnormal disturbance for video surveillance system.",
            "Locality-sensitive kernel sparse representation classification for face recognition.",
            "Gamma rate theory for causal rate control in source coding and video coding.",
            "A novel semi-supervised canonical correlation analysis and extensions for multi-view dimensionality reduction.",
            "The computation of polygonal approximations for 2D contours based on a concavity tree.",
            "Generating algorithm for integer DST radixes in video coding."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2013",
        "info": "2013: Volume 24",
        "count": 132,
        "papers": [
            "Efficient HD video coding with joint first-order-residual (FOR) and second-order-residual (SOR) coding technique.",
            "A novel enhancement for hierarchical image coding.",
            "Integrating PSONN and Boltzmann function for feature selection and classification of lymph nodes in ultrasound images.",
            "Fast image deconvolution using closed-form thresholding formulas of regularization.",
            "A new method for image retrieval based on analyzing fractal coding characters.",
            "Random grid-based visual secret sharing with abilities of OR and XOR decryptions.",
            "A novel method for image retrieval based on structure elements' descriptor.",
            "A bivariate rational interpolation based on scattered data on parallel lines.",
            "Dynamic distortion maps for image retargeting.",
            "Sparse representations for image and video analysis.",
            "Image annotation by semi-supervised cross-domain learning with group sparsity.",
            "Supervised sparse patch coding towards misalignment-robust face recognition.",
            "Face recognition via Weighted Sparse Representation.",
            "Multi-pose 3D face recognition based on 2D sparse representation.",
            "Fast human action classification and VOI localization with enhanced sparse coding.",
            "SCoBeP: Dense image registration using sparse coding and belief propagation.",
            "Greedy regression in sparse coding space for single-image super-resolution.",
            "Saliency-guided compressive sensing approach to efficient laser range measurement.",
            "Visual attention modeling based on short-term environmental adaption.",
            "Dictionary learning and similarity regularization based image noise reduction.",
            "MR images reconstruction based on TVWL2-L1 model.",
            "On the reconstruction of sequences of sparse signals - The Weighted-CS.",
            "Adaptive tree-based P2P video streaming multicast system under high peer-churn rate.",
            "Human action recognition employing negative space features.",
            "Moving foreground object detection via robust SIFT trajectories.",
            "Region duplication detection based on Harris corner points and step sector statistics.",
            "An attention emphasized bit arrangement in 3-D SPIHT video coding for human vision.",
            "Perceptually friendly shape decomposition by resolving segmentation points with minimum cost.",
            "A restoration algorithm for images contaminated by mixed Gaussian plus random-valued impulse noise.",
            "Graph-based semi-supervised learning with multi-modality propagation for large-scale image datasets.",
            "3D shape from focus using LULU operators and discrete pulse transform in the presence of noise.",
            "Natural language letter based visual cryptography scheme.",
            "Non-convex hybrid total variation for image denoising.",
            "A weighted dominant color descriptor for content-based image retrieval.",
            "HTRI: High time range imaging.",
            "Optimal resource allocation for Medium Grain Scalable video transmission over MIMO channels.",
            "Measures of similarity between qualitative descriptions of shape, colour and size applied to mosaic assembling.",
            "Fast quasi-flat zones filtering using area threshold and region merging.",
            "Optimized contrast enhancement for real-time image and video dehazing.",
            "Dictionary learning for image prediction.",
            "Robust gait recognition via discriminative set matching.",
            "Image registration using BP-SIFT.",
            "Distributed video coding with progressive significance map.",
            "Saliency detection using joint spatial-color constraint and multi-scale segmentation.",
            "Interactive object segmentation from multi-view images.",
            "Packet prioritization for H.264/AVC video with cyclic intra-refresh line.",
            "Stretchability-aware block scaling for image retargeting.",
            "On quality of experience of scalable video adaptation.",
            "Active contours driven by local and global probability distributions.",
            "CDV-DVC: Transform-domain distributed video coding with multiple channel division.",
            "Visual attention guided video copy detection based on feature points matching with geometric-constraint measurement.",
            "Improving the visual quality of random grid-based visual secret sharing via error diffusion.",
            "Analysis of noise sensitivity of Tchebichef and Zernike moments with application to image watermarking.",
            "A content-adaptive sharpness enhancement algorithm using 2D FIR filters trained by pre-emphasis.",
            "Fast exhaustive-search equivalent pattern matching through norm ordering.",
            "Robust scalable video multi-cast with multiple sources and inter-source network decoding in lossy networks.",
            "Image registration using a point-line duality based line matching method.",
            "Active appearance models using statistical characteristics of Gabor based texture representation.",
            "Robust common visual pattern discovery using graph matching.",
            "Introduction to the Special Issue on \"Recent advances on analysis and processing for distributed video systems\".",
            "Correlation estimation from compressed images.",
            "Low complexity image interpolation method based on path selection.",
            "An effective error resilient 3D view synthesis method.",
            "Compensation of de-saturation effect in HDR imaging using a real scene adaptation model.",
            "Coding statistics based fast mode decision for multi-view video coding.",
            "Fast synthesized and predicted just noticeable distortion maps for perceptual multiview video coding.",
            "A generalized EMD with body prior for pedestrian identification.",
            "Multi-camera invariant appearance modeling for non-rigid object identification in a real-time environment.",
            "Online video summarization on compressed domain.",
            "RII: Renovating the irregular illumination of digital image archives.",
            "A fast algorithm of bitstream extraction using distortion prediction based on simulated annealing.",
            "Spatiotemporal saliency detection and salient region determination for H.264 videos.",
            "An exhaustive criterion for estimating quality of images in electrical impedance tomography with application to clinical imaging.",
            "Laplacian affine sparse coding with tilt and orientation consistency for image classification.",
            "An efficient and robust line segment matching approach based on LBD descriptor and pairwise geometric consistency.",
            "Image coarsening by using space-filling curve for decomposition-based image enhancement.",
            "Mixture models with skin and shadow probabilities for fingertip input applications.",
            "Layered moving-object segmentation for stereoscopic video using motion and depth information.",
            "Automated defect detection in uniform and structured fabrics using Gabor filters and PCA.",
            "Block-based image steganalysis: Algorithm and performance evaluation.",
            "Image content analysis for sector-wise JPEG fragment classification.",
            "Universal intra coding for arbitrary RGB color filter arrays in HEVC.",
            "Image representation using block compressive sensing for compression applications.",
            "Cross-modal social image clustering and tag cleansing.",
            "No-reference blur image quality measure based on multiplicative multiresolution decomposition.",
            "Gradient based adaptive thresholding.",
            "Ultrasound kidney segmentation with a global prior shape.",
            "Naming persons in video: Using the weak supervision of textual stories.",
            "Using Sorted Switching Median Filter to remove high-density impulse noises.",
            "Evaluating similarity measures for brain image registration.",
            "Mode dependent loop filter for intra prediction coding in H.264/AVC.",
            "Generic radial orthogonal moment invariants for invariant image recognition.",
            "Shape retrieval and recognition based on fuzzy histogram.",
            "Assessment of video tone-mapping: Are cameras' S-shaped tone-curves good enough?",
            "Adaptive all-season image tag ranking by saliency-driven image pre-classification.",
            "A new similarity measure for non-local means filtering of MRI images.",
            "A learning-based method for compressive image recovery.",
            "Discriminative two-level feature selection for realistic human action recognition.",
            "Geometric property based ellipse detection method.",
            "Structural image retrieval using automatic image annotation and region based inverted file.",
            "A blind image copyright protection scheme for e-government.",
            "Essential secret image sharing scheme with different importance of shadows.",
            "Sample-based image completion using structure synthesis.",
            "Exploring heuristic and optimum branching algorithms for image phylogeny.",
            "Gray-scale image watermarking using GA-BPN hybrid network.",
            "Robust frontal view search using extended manifold learning.",
            "Dictionary-based color image retrieval using multiset theory.",
            "A fixed-point augmented Lagrangian method for total variation minimization problems.",
            "Image-based on-road vehicle detection using cost-effective Histograms of Oriented Gradients.",
            "Recognizing jump patterns with physics-based validation in human moving trajectory.",
            "An experimental study on the universality of visual vocabularies.",
            "Video key frame extraction through dynamic Delaunay clustering with a structural constraint.",
            "Local descriptors and similarity measures for frontal face recognition: A comparative analysis.",
            "Dictionary learning based reconstruction for distributed compressed video sensing.",
            "Motion estimation in low-delay hierarchical p-frame coding using motion vector composition.",
            "Structured representations in a content based image retrieval context.",
            "Level-set-based motion estimation algorithm for multiple reference frame motion estimation.",
            "Computer generated images vs. digital photographs: A synergetic feature and classifier combination approach.",
            "QoS-supporting video streaming system with minimum data service cost over heterogeneous wireless networks.",
            "Image-pair-based deblurring with spatially varying norms and noisy image updating.",
            "Evaluation of Region-of-Interest coders using perceptual image quality assessments.",
            "Hybrid fractal image coding with quadtree-based progressive structure.",
            "Image annotation using high order statistics in non-Euclidean spaces.",
            "Hybrid regularization image deblurring in the presence of impulsive noise.",
            "Image indexing using the color and bit pattern feature fusion.",
            "Sharing more information in gray visual cryptography scheme.",
            "Robust blind motion deblurring using near-infrared flash image.",
            "Multi-feature gradient vector flow snakes for adaptive segmentation of the ultrasound images of breast cancer.",
            "Surveillance video synopsis in the compressed domain for fast video browsing.",
            "Parallel fast inter mode decision for H.264/AVC encoding.",
            "q-Gaussian mixture models for image and video semantic indexing.",
            "Depth sensor assisted real-time gesture recognition for interactive presentation."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2012",
        "info": "2012: Volume 23",
        "count": 113,
        "papers": [
            "Voxel-based shape decomposition for feature-preserving 3D thumbnail creation.",
            "Fast bilateral filter for HDR imaging.",
            "A multiresolution approach for rotation invariant texture image retrieval with orthogonal polynomials model.",
            "Video coding using fast geometry-adaptive partitioning and an elastic motion model.",
            "Multiview depth coding based on combined color/depth segmentation.",
            "Kernel-based feature extraction under maximum margin criterion.",
            "High efficient distributed video coding with parallelized design for LDPCA decoding on CUDA based GPGPU.",
            "Evaluation of image resolution and super-resolution on face recognition performance.",
            "Total least square kernel regression.",
            "Inpainting with image patches for compression.",
            "Key frame extraction based on visual attention model.",
            "Fast algorithm for multiplicative noise removal.",
            "Sustainable image transmission.",
            "Fuzzy Directional (FD) Filter for impulsive noise reduction in colour video sequences.",
            "Evaluation of segmentation techniques using region area and boundary matching information.",
            "A novel fountain code-based mobile IPTV multicast system architecture over WiMAX network.",
            "Selective color transferring via ellipsoid color mixture map.",
            "A novel predual dictionary learning algorithm.",
            "Choice of low resolution sample sets for efficient super-resolution signal reconstruction.",
            "Image super-resolution by curve fitting in the threshold decomposition domain.",
            "Wireless capsule endoscopy images enhancement via adaptive contrast diffusion.",
            "Side information generation with auto regressive model for low-delay distributed video coding.",
            "A Multi-Directional Search technique for image annotation propagation.",
            "Farewell Editorial.",
            "Modification and implementation of an edge-based fast intra prediction mode decision algorithm for H.264/AVC high resolution real-time systems.",
            "Online selection of the best k-feature subset for object tracking.",
            "Flash scene video coding using weighted prediction.",
            "High-performance template tracking.",
            "Efficient disparity vector prediction schemes with modified P frame for 2D camera arrays.",
            "A fast compression-based similarity measure with applications to content-based image retrieval.",
            "Video object segmentation in rainy situations based on difference scheme with object structure and color analysis.",
            "A fast progressive image transmission scheme using block truncation coding by pattern fitting.",
            "Multichannel image processing by using the Rank M-type L-filter.",
            "Improving the visual quality of size invariant visual cryptography scheme.",
            "Saliency-directed color image interpolation using artificial neural network and particle swarm optimization.",
            "Comparative study of global color and texture descriptors for web image retrieval.",
            "Radial Tchebichef moment invariants for image recognition.",
            "Towards clinical applicability of the diffusion-based DT-MRI visualization algorithm.",
            "3D information extraction using Region-based Deformable Net for monocular robot navigation.",
            "Total variation blind deconvolution employing split Bregman iteration.",
            "A generalized 3-D Hilbert scan using look-up tables.",
            "Playing into the wild: A gesture-based interface for gaming in public spaces.",
            "Improvements of a two-in-one image secret sharing scheme based on gray mixing model.",
            "Novel wavelet-based QIM data hiding technique for tamper detection and correction of digital images.",
            "Reference-guided exposure fusion in dynamic scenes.",
            "An MMSE approach to nonlocal image denoising: Theory and practical implementation.",
            "Measuring perceptual contrast in digital images.",
            "Image watermarking with feature point based synchronization robust to print-scan attack.",
            "Anisotropic diffusion for image denoising based on diffusion tensors.",
            "Iterative search strategy with selective bi-directional prediction for low complexity multiview video coding.",
            "Perceptual-based distributed video coding.",
            "A robust region-adaptive dual image watermarking technique.",
            "Low-complexity video coding via power-rate-distortion optimization.",
            "Salient video cube guided nighttime vehicle braking event detection.",
            "A pixel-wise directional intra prediction method.",
            "Gradient field multi-exposure images fusion for high dynamic range image visualization.",
            "Segmentation of images with separating layers by fuzzy c-means and convex optimization.",
            "Invariant curvature-based Fourier shape descriptors.",
            "Motion differential set partition coding for image sequence and video compression.",
            "A new approach to the reconstruction of contour lines extracted from topographic maps.",
            "Reliable moving vehicle detection based on the filtering of swinging tree leaves and raindrops.",
            "Unsupervised and reliable image matting based on modified spectral matting.",
            "Optimal (2, n) and (2, infinity) visual secret sharing by generalized random grids.",
            "Spatial pooling for measuring color printing quality attributes.",
            "Reducing frequency-domain artifacts of binary image due to coarse sampling by repeated interpolation and smoothing of Radon projections.",
            "Quantitative analysis of visibility determinations for networked virtual environments.",
            "Efficient method of pixel neighborhood traversal.",
            "Quality-efficient demosaicing for digital time delay and integration images using edge-sensing scheme in color difference domain.",
            "Batch-pipelining for multicore H.264 decoding.",
            "An augmented Lagrangian approach to general dictionary learning for image denoising.",
            "HMM-based ball hitting event exploration system for broadcast baseball video.",
            "Image forensic signature for content authenticity analysis.",
            "A Markov-based reversible data hiding method based on histogram shifting.",
            "A design framework for hybrid approaches of image noise estimation and its application to noise reduction.",
            "An edge detection algorithm based on the multi-direction shear transform.",
            "Objective and subjective quality assessment between JPEG XR with overlap and JPEG 2000.",
            "Self-similarity based structural regularity for just noticeable difference estimation.",
            "Using SAX representation for human action recognition.",
            "Edge Drawing: A combined real-time edge and segment detector.",
            "Novel rate control scheme for intra frame video coding with exponential rate-distortion model on H.264/AVC.",
            "Tree representation of digital picture embeddings.",
            "Affine invariant image watermarking using intensity probability density-based Harris Laplace detector.",
            "Rate-distortion optimized layered coding of high dynamic range videos.",
            "Rapid 3D face reconstruction by fusion of SFS and Local Morphable Model.",
            "Recognizing tactic patterns in broadcast basketball video using player trajectory.",
            "Spatially correlated background subtraction, based on adaptive background maintenance.",
            "Adaptive quantization using piecewise companding and scaling for Gaussian mixture.",
            "A novel gray image representation using overlapping rectangular NAM and extended shading approach.",
            "Monte Carlo cluster refinement for noise robust image segmentation.",
            "Super-resolution texture synthesis using stochastic PAR/NL model.",
            "Gabor feature based nonlocal means filter for textured image denoising.",
            "Color demosaicking with an image formation model and adaptive PCA.",
            "Adaptive key frame extraction for video summarization using an aggregation mechanism.",
            "Lagrangian multipliers and split Bregman methods for minimization problems constrained on Sn-1.",
            "Bilateral Markov mesh random field and its application to image restoration.",
            "Coordinate-descent super-resolution and registration for parametric global motion models.",
            "A contactless biometric system using multiple hand features.",
            "Reduced set density estimator for object segmentation based on shape probabilistic representation.",
            "LS-SVM based image segmentation using color and texture information.",
            "An interactive 3D video system for human facial reconstruction and expression modeling.",
            "A reduced-complexity image coding scheme using decision-directed wavelet-based contourlet transform.",
            "Model-based adaptive resolution upconversion of degraded images.",
            "Non-local spatial redundancy reduction for bottom-up saliency estimation.",
            "Mode decision acceleration for scalable video coding through coded block pattern.",
            "A high performance and low complexity sampling-based intra coding method for H.264/AVC.",
            "Multi-path content delivery: Efficiency analysis and optimization algorithms.",
            "Generalized Gaussian mixture models as a nonparametric Bayesian approach for clustering using class-specific visual features.",
            "Comparative study of moment based parameterization for morphological texture description.",
            "A new authentication based cheating prevention scheme in Naor-Shamir's visual cryptography.",
            "Expectation-maximization algorithm with total variation regularization for vector-valued image segmentation.",
            "Towards optimized binary pattern generation for grayscale digital halftoning: A binary particle swarm optimization (BPSO) approach.",
            "Local tracing of curvilinear structures in volumetric color images: Application to the Brainbow analysis.",
            "A multi-resolution approach for massively-parallel hardware-friendly optical flow estimation."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2011",
        "info": "2011: Volume 22",
        "count": 68,
        "papers": [
            "A steganographic method for digital images with four-pixel differencing and modified LSB substitution.",
            "Stabilization and optimization of PLUS factorization and its application in image coding.",
            "Quality adaptive least squares trained filters for video compression artifacts removal using a no-reference block visibility metric.",
            "Robust contour tracking based on a coupling between geodesic active contours and conditional random fields.",
            "Body color sets: A compact and reliable representation of images.",
            "H.264/AVC entropy decoder complexity analysis and its applications.",
            "Generation of high-quality depth maps using hybrid camera system for 3-D video.",
            "On the security of multiple Huffman table based encryption.",
            "Travelmedia: An intelligent management system for media captured in travel.",
            "Rate-distortion optimized rate-allocation for motion-compensated predictive video codecs using PixelRank.",
            "Rotationally invariant similarity measures for nonlocal image denoising.",
            "Reversible data embedding for high quality images using interpolation and reference pixel distribution mechanism.",
            "Image filtering in the block DCT domain using symmetric convolution.",
            "Temporal accumulation of oriented visual features.",
            "Spatial error concealment with sequence-aligned texture modeling and adaptive directional recovery.",
            "Motion-based unusual event detection in human crowds.",
            "A quantization-based semi-fragile watermarking scheme for image content authentication.",
            "Random linear network coding with ladder-shaped global coding matrix for robust video transmission.",
            "Motion Compensated Three-Dimensional Frequency Selective Extrapolation for improved error concealment in video communication.",
            "Content-aware video resizing based on salient visual cubes.",
            "Investigating the relationship between image enhancement and image compression in the context of the multi-scale retinex.",
            "Image postprocessing by Non-local Kuan's filter.",
            "Image restoration under mixed noise using globally convex segmentation.",
            "Tennis Video 2.0: A new presentation of sports videos with content separation and rendering.",
            "Cross-layer optimization for SVC video delivery over the IEEE 802.11e wireless networks.",
            "Perceptual visual quality metrics: A survey.",
            "No-reference analysis of decoded MPEG images for PSNR estimation and post-processing.",
            "Obtaining depth map from segment-based stereo matching using graph cuts.",
            "MIJ2K: Enhanced video transmission based on conditional replenishment of JPEG2000 tiles with motion compensation.",
            "Object detection with feature stability over scale space.",
            "Scalable video encryption of H.264 SVC Codec.",
            "Automatic body segmentation with graph cut and self-adaptive initialization level set (SAILS).",
            "Image retrieval systems based on compact shape descriptor and relevance feedback information.",
            "Motion-refined rewriting of H.264/AVC-coded video to SVC streams.",
            "Removing interference components in time-frequency representations using morphological operators.",
            "Computationally efficient, one-pass algorithm for morphological filters.",
            "3D dense reconstruction from 2D video sequence via 3D geometric segmentation.",
            "Automatic video activity detection using compressed domain motion trajectories for H.264 videos.",
            "An adaptive image authentication scheme for vector quantization compressed image.",
            "Computation-aware fast motion estimation for H.264/AVC using image indexing.",
            "Heuristic algorithm for visual tracking of deformable objects.",
            "Restricted H.264/AVC video coding for privacy protected video scrambling.",
            "Packet scheduling with playout adaptation for scalable video delivery over wireless networks.",
            "A rate-control algorithm using inter-layer information for H.264/SVC for low-delay applications.",
            "Complex background modeling based on Texture Pattern Flow with adaptive threshold propagation.",
            "An integrated temporal error concealment for H.264/AVC based on spatial evaluation criteria.",
            "Fast image inpainting and colorization by Chambolle's dual method.",
            "Robust real-time ship detection and tracking for visual surveillance of cage aquaculture.",
            "Novel H.264/AVC entropy coding mode decision.",
            "A solution to efficient power allocation for H.264/SVC video transmission over a realistic MIMO channel using precoder designs.",
            "Improved prediction methods for scalable predictive animated mesh compression.",
            "On the representation of a digital contour with an unordered point set for visual perception.",
            "Efficient video sequences alignment using unbiased bidirectional dynamic time warping.",
            "A region-based rate-control scheme using inter-layer information for H.264/SVC.",
            "Hierarchical B-picture mode decision in H.264/SVC.",
            "Kernel Discriminant Embedding in face recognition.",
            "Deconvolving Poissonian images by a novel hybrid variational model.",
            "High-quality non-blind image deconvolution with adaptive regularization.",
            "A reversible data hiding scheme for VQ indices using locally adaptive coding.",
            "Integrated video object tracking with applications in trajectory-based event detection.",
            "Novel intra prediction via position-dependent filtering.",
            "Adaptive pre-interpolation filter for high efficiency video coding.",
            "Efficient video coding based on audio-visual focus of attention.",
            "Sparse representations for spatial prediction and texture refinement.",
            "Fast mode dependent directional transform via butterfly-style transform and integer lifting steps.",
            "Efficient motion vector prediction algorithm using pattern matching.",
            "Towards high efficiency video coding: Subjective evaluation of potential coding technologies.",
            "Performance analysis, parameter selection and extensions to H.264/AVC FRExt for high resolution video coding."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2010",
        "info": "2010: Volume 21",
        "count": 89,
        "papers": [
            "An automated three-dimensional plus time registration framework for dynamic MR renography.",
            "A real-time FPGA architecture for 3D reconstruction from integral images.",
            "3D Model compression using Connectivity-Guided Adaptive Wavelet Transform built into 2D SPIHT.",
            "Rotation invariant analysis and orientation estimation method for texture classification based on Radon transform and correlation analysis.",
            "Geometric algebra colour image representations and derived total orderings for morphological operators - Part I: Colour quaternions.",
            "Grouping strategies for promoting image quality of watermarking on the basis of vector quantization.",
            "Geometric attraction-driven flow for image segmentation and boundary detection.",
            "A method for sparse disparity densification using voting mask propagation.",
            "Guest Editorial: Network Technologies for Emerging Broadband Multimedia Services.",
            "Robust video multicast with joint network coding and video interleaving.",
            "Wireless link state-aware H.264 MGS coding-based mobile IPTV system over WiMAX network.",
            "End-to-end optimized TCP-friendly rate control for real-time video streaming over wireless multi-hop networks.",
            "CORS: A cooperative overlay routing service to enhance interactive multimedia communications.",
            "M2FEC: An effective FEC based multi-path transmission scheme for interactive multimedia communication.",
            "Understanding Internet Video sharing site workload: A view from data center design.",
            "A framework for end-to-end video quality prediction of MPEG video.",
            "Fast Interframe mode decision algorithm based on mode mapping and MB activity for MPEG-2 to H.264/AVC transcoding.",
            "A fair optimization scheduling scheme for IEEE 802.16 networks in multimedia applications.",
            "Scalable diagnosis in IP networks using path-based measurement and inference: A learning framework.",
            "Deblurring Poissonian images by split Bregman techniques.",
            "Technologies and the development of the Automated Metadata Indexing and Analysis (AMIA) system.",
            "Adaptive resynchronization approach for scalable video over wireless channel.",
            "A secure digital camera based fingerprint verification system.",
            "Stochastic super-resolution image reconstruction.",
            "QoE-aware mobile IPTV channel control algorithm over WiMAX network.",
            "Consumer photo management and browsing facilitated by near-duplicate detection with feature filtering.",
            "Image matching using enclosed region detector.",
            "IM(S)2: Interactive movie summarization system.",
            "Construction of isothetic covers of a digital object: A combinatorial approach.",
            "Proposing a new code by considering pieces of discrete straight lines in contour shapes.",
            "Image representation by compressive sensing for visual sensor networks.",
            "Fractal curves to improve the reversible data embedding for VQ-indexes based on locally adaptive coding.",
            "Integrating local distribution information with level set for boundary extraction.",
            "Modeling, classifying and annotating weakly annotated images using Bayesian network.",
            "Tetrolet transform: A new adaptive Haar wavelet algorithm for sparse image representation.",
            "Multi-camera imaging, coding and innovative display: techniques and systems.",
            "Iterative colour correction of multicamera systems using corresponding feature points.",
            "Fast color correction for multi-view video by modeling spatio-temporal variation.",
            "Robust stereo matching with improved graph and surface models and occlusion handling.",
            "Efficient hundreds-baseline stereo by counting interest points for moving omni-directional multi-camera system.",
            "A quality controllable multi-view object reconstruction method for 3D imaging systems.",
            "Scaling iterative closest point algorithm for registration of m-D point sets.",
            "Multi-view video based multiple objects segmentation using graph cut and spatiotemporal projections.",
            "A novel multi-view image coding scheme based on view-warping and 3D-DCT.",
            "Multi-view video coding with view interpolation prediction for 2D camera arrays.",
            "Joint depth-motion dense estimation for multiview video coding.",
            "Depth perceptual region-of-interest based multiview video coding.",
            "Depth and depth-color coding using shape-adaptive wavelets.",
            "RD-optimized interactive streaming of multiview video with multiple encodings.",
            "Free-viewpoint depth image based rendering.",
            "Artifact reduction using reliability reasoning for image generation of FTV.",
            "A polygon soup representation for multiview coding.",
            "Real-time video-based rendering from uncalibrated cameras using plane-sweep algorithm.",
            "The Seelinder: Cylindrical 3D display viewable from 360 degrees.",
            "Virtual spotlighted advertising for tennis videos.",
            "Discrete visual features modeling via leave-one-out likelihood estimation and applications.",
            "Ripplet: A new transform for image processing.",
            "Performance of reconstruction-based super-resolution with regularization.",
            "Texture representation and retrieval using the causal autoregressive model.",
            "Robust bilayer video segmentation by adaptive propagation of global shape and local appearance.",
            "A motion vector prediction method for multi-view video coding.",
            "Augmented keyframe.",
            "Uniformly sampling multi-resolution analysis for image-based relighting.",
            "Fast segmentation of porcelain images based on texture features.",
            "Braille document recognition using Belief Propagation.",
            "Detection of landmines and underground utilities from acoustic and GPR images with a cepstral approach.",
            "Relevance of knowledge from bit-saving in progressive transmission.",
            "Scalable user-friendly image sharing.",
            "Low-bit-rate coding of underwater color image using improved wavelet difference reduction.",
            "Large-scale image and video search: Challenges, technologies, and trends.",
            "Design and implementation of geo-tagged video search framework.",
            "An integrated aurora image retrieval system: AuroraEye.",
            "Fusing semantic aspects for image annotation and retrieval.",
            "Web image concept annotation with better understanding of tags and visual features.",
            "Boosting image object retrieval and indexing by automatically discovered pseudo-objects.",
            "Visual quality assessment for web videos.",
            "Video copy detection using multiple visual cues and MPEG-7 descriptors.",
            "Using multi-modal 3D contours and their relations for vision and robotics.",
            "Improved motion vector scaling technique based on half-pixel offset compensation.",
            "A practical bit stream organization algorithm for robust H.264/SVC transmission.",
            "Object displays for identifying multidimensional outliers within a crowded visual periphery.",
            "A dual quad-tree based variable block-size coding method.",
            "Flip visual cryptography (FVC) with perfect security, conditionally-optimal contrast, and no expansion.",
            "A rate-distortion analysis on motion prediction efficiency and mode decision for scalable wavelet video coding.",
            "Activity-driven content adaptation for effective video summarization.",
            "An efficient motion vector composition algorithm for fast-forward playback in a video streaming system.",
            "Prediction of transmission distortion for wireless video communication: Algorithm and application.",
            "Image change detection using Gaussian mixture model and genetic algorithm.",
            "A joint encoder-decoder error control framework for stereoscopic video coding."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2009",
        "info": "2009: Volume 20",
        "count": 54,
        "papers": [
            "2D motion aided sampling and reconstruction.",
            "Face detection and tracking using a Boosted Adaptive Particle Filter.",
            "Frame-level bit allocation based on incremental PID algorithm and frame complexity estimation.",
            "An error resilient video coding and transmission solution over error-prone channels.",
            "A genetic algorithm with chromosome-repairing for min - # and min - epsilon polygonal approximation of digital curves.",
            "Reversible information hiding for VQ indices based on locally adaptive coding.",
            "A note on exact image reconstruction from a limited number of projections.",
            "On emerging techniques for multimedia content sharing, search and understanding.",
            "Geometric matching for clip-art drawing retrieval.",
            "Latent Style Model: Discovering writing styles for calligraphy works.",
            "Graph-based semi-supervised learning with multiple labels.",
            "Query representation by structured concept threads with application to interactive video retrieval.",
            "Interactive broadcast services for live soccer video based on instant semantics acquisition.",
            "Personal content management system: A semantic approach.",
            "Embedded lattices tree: An efficient indexing scheme for content based retrieval on image databases.",
            "Semantic clustering for region-based image retrieval.",
            "Region-based image retrieval using color-size features of watershed regions.",
            "A novel Fourier descriptor based image alignment algorithm for automatic optical inspection.",
            "Generating segmented meshes from textured color images.",
            "Physics-based ball tracking and 3D trajectory reconstruction with applications to shooting location estimation in basketball video.",
            "Real-time elliptical head contour detection under arbitrary pose and wide distance range.",
            "Blind blur assessment for vision-based applications.",
            "N-Point Hough transform for line detection.",
            "One-iteration dejittering of digital video images.",
            "Point control of the interpolating curve with a rational cubic spline.",
            "Error concealment of multi-view video sequences using inter-view and intra-view correlations.",
            "Variational denoising of partly textured images.",
            "Iterative compensation schemes for multimedia content authentication.",
            "Example-based image super-resolution with class-specific predictors.",
            "A visible watermarking algorithm based on the content and contrast aware (COCOA) technique.",
            "People detection and tracking with multiple stereo cameras using particle filters.",
            "A critical examination of the assumptions used in dynamic allocation.",
            "Wyner-Ziv-based bidirectionally decodable video coding.",
            "Robust image watermarking against local geometric attacks using multiscale block matching method.",
            "Demosaicing algorithms for area- and line-scan cameras in print inspection.",
            "Reversible data hiding of a VQ index table based on referred counts.",
            "Robust image watermarking using local Zernike moments.",
            "Key views for visualizing large spaces.",
            "Moving object detection in the H.264/AVC compressed domain for video surveillance applications.",
            "SNR and temporal scalable coding of 3-D mesh sequences using singular value decomposition.",
            "A unified image retrieval framework on local visual and semantic concept-based feature spaces.",
            "Adaptive video coding control for real-time H.264/AVC encoder.",
            "Surface Function Actives.",
            "Adapting quantization offset in multiple description coding for error resilient video transmission.",
            "Fractal image compression based on spatial correlation and hybrid genetic algorithm.",
            "Techniques for efficient and effective transformed image identification.",
            "Recovering high dynamic range by Multi-Exposure Retinex.",
            "Neighbourhood preserving discriminant embedding in face recognition.",
            "Subclass linear discriminant analysis for video-based face recognition.",
            "Bilayer representation for three dimensional visual communication.",
            "Textual description of shapes.",
            "Efficient one-pass frame level rate control for H.264/AVC.",
            "Efficient quadtree based block-shift filtering for deblocking and deringing.",
            "Face recognition using message passing based clustering method."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2008",
        "info": "2008: Volume 19",
        "count": 47,
        "papers": [
            "Hardware implementation of a disparity estimation scheme for real-time compression in 3D imaging applications.",
            "A 2D Wigner Distribution-based multisize windows technique for image fusion.",
            "Fast detection and removal of impulsive noise using peer groups and fuzzy metrics.",
            "Just-noticeable difference estimation with pixels in images.",
            "First-order modeling and stability analysis of illusory contours.",
            "Dynamic computational complexity and bit allocation for optimizing H.264/AVC video compression.",
            "Adaptive multi-modal stereo people tracking without background modelling.",
            "A fast MPEG-7 dominant color extraction with new similarity measure for image retrieval.",
            "An adaptive media playout for intra-media synchronization of networked-video applications.",
            "Video summarisation: A conceptual framework and survey of the state of the art.",
            "Mining user hidden semantics from image content for image retrieval.",
            "alpha-Trimmed lexicographical extrema for pseudo-morphological image analysis.",
            "Fast block mode decision algorithm in H.264/AVC video coding.",
            "A method for representing 3D tree objects using chain coding.",
            "Detection of visual attention regions in images using robust subspace analysis.",
            "Novel efficient two-pass algorithm for closed polygonal approximation based on LISE and curvature constraint criteria.",
            "Design a deblocking filter with three separate modes in DCT-based coding.",
            "As-rigid-as-possible shape deformation and interpolation.",
            "Content-Aware Fast Motion Estimation Algorithm.",
            "Compression of facial images using the K-SVD algorithm.",
            "Exact image reconstruction from a limited number of projections.",
            "Efficient edge-preserving algorithm for color contrast enhancement with application to color image segmentation.",
            "Robust multiple description image coding over wireless networks based on wavelet tree coding, error resilient entropy coding, and error concealment.",
            "Saliency model-based face segmentation and tracking in head-and-shoulder video sequences.",
            "A novel image watermarking scheme against desynchronization attacks by SVR revision.",
            "Content analysis based smart macroblock rearrangement for error resilience in wireless video transmission.",
            "Fast perceptual region tracking with coding-depth sensitive access for stream transcoding.",
            "Bit-depth scalability compatible to H.264/AVC-scalable extension.",
            "Efficient multiple faces tracking based on Relevance Vector Machine and Boosting learning.",
            "Geodesy on label images, and applications to video sequence processing.",
            "Study on the distribution of DCT residues and its application to R-D analysis of video coding.",
            "Ball detection from broadcast soccer videos using static and dynamic features.",
            "Alternate motion-compensated prediction for error resilient video coding.",
            "Foveation image coding with fuzzy-based joint parameter selection.",
            "Dictionary based color image retrieval.",
            "Special issue on resource-aware adaptive video streaming.",
            "Video quality and system resources: Scheduling two opponents.",
            "ARMOR - A system for adjusting repair and media scaling for video streaming.",
            "Rateless scalable video coding for overlay multisource streaming in MANETs.",
            "Combining the rate adaptation and quality adaptation schemes for wireless video streaming.",
            "Maximum-throughput delivery of SVC-based video over MIMO systems with time-varying channel capacity.",
            "Design options and comparison of in-network H.264/SVC adaptation.",
            "A rate-distortion optimization model for SVC inter-layer encoding and bitstream extraction.",
            "Adaptive slice-level parallelism for H.264/AVC encoding using pre macroblock mode selection.",
            "Hybrid layered video encoding and caching for resource constrained environments.",
            "Side information estimation and new symmetric schemes for multi-view distributed video coding.",
            "Advanced side information creation techniques and framework for Wyner-Ziv video coding."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2007",
        "info": "2007: Volume 18",
        "count": 44,
        "papers": [
            "Scene-based event detection for baseball videos.",
            "An efficient PCA-based color transfer method.",
            "Grayscale true two-dimensional dictionary-based image compression.",
            "Rate-distortion analysis of leaky prediction based FGS video for constant quality constrained rate adaptation.",
            "Complexity controllable DCT for real-time H.264 encoder.",
            "Scale multiplication in odd Gabor transform domain for edge detection.",
            "Signal modeling for two-dimensional image structures.",
            "Erratum to \"NMF, LNMF, and DNMF modeling of neural receptive fields involved in human facial expression perception\" [J. Visual Communication and Image Representation 17 (2006) 958-969].",
            "Efficient updates of bounding sphere hierarchies for geometrically deformable models.",
            "Position based dynamics.",
            "Fast and active texture segmentation based on orientation and local variance.",
            "ENCARA2: Real-time detection of multiple faces at different resolutions in video streams.",
            "Near-infrared composite pattern projection for continuous motion hand-computer interaction.",
            "Error resilient GOP structures on video streaming.",
            "From two-dimensional nonlinear diffusion to coupled Haar wavelet shrinkage.",
            "Fire detection using statistical color model in video sequences.",
            "Video transmission using advanced partial backward decodable bit stream (APBDBS).",
            "Robust video streaming over wireless LANs using multiple description transcoding and prioritized retransmission.",
            "Lossless recovery of a VQ index table with embedded secret data.",
            "An optimized MPEG-21 BSDL framework for the adaptation of scalable bitstreams.",
            "A comparison of three total variation based texture extraction models.",
            "Nonparametric background generation.",
            "A novel approach to polygonal approximation of digital curves.",
            "Real-time spatiotemporal segmentation of video objects in the H.264 compressed domain.",
            "Unsupervised learning of a finite discrete mixture: Applications to texture modeling and image databases summarization.",
            "Prescription-based error concealment technique for video transmission on error-prone channels.",
            "Image restoration combining a total variational filter and a fourth-order filter.",
            "Efficient hybrid error concealment algorithm based on adaptive estimation scheme.",
            "Predictive vector quantization of 3-D mesh geometry by representation of vertices in local coordinate systems.",
            "Special issue on high dynamic range imaging.",
            "Adaptive dynamic range camera with reflective liquid crystal.",
            "Noise reduction in high dynamic range imaging.",
            "Two-layer coding algorithm for high dynamic range images based on luminance compensation.",
            "Painting in High Dynamic Range.",
            "An adaptive algorithm for the display of high-dynamic range images.",
            "iCAM06: A refined image appearance model for HDR image rendering.",
            "Evaluating tone mapping algorithms for rendering non-pictorial (scientific) high-dynamic-range images.",
            "Displaying colourimetrically calibrated images on a high dynamic range display.",
            "Photometric image processing for high dynamic range displays.",
            "Analysis of sexual dimorphism in human face.",
            "Image decomposition combining staircase reduction and texture extraction.",
            "Task-based evaluation of skin detection for communication and perceptual interfaces.",
            "Unsupervised Bayesian image segmentation using orthogonal series.",
            "Text detection and restoration in natural scene images."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2006",
        "info": "2006: Volume 17",
        "count": 74,
        "papers": [
            "Vector sigma filters for noise detection and removal in color images.",
            "Thinning by curvature flow.",
            "Fast indexing method for image retrieval using k nearest neighbors searches by principal axis analysis.",
            "Scalable proxy caching algorithm minimizing client's buffer size and channel bandwidth.",
            "Scene-adaptive video partitioning by semantic object tracking.",
            "Fast exhaustive multi-resolution search algorithm based on clustering for efficient image retrieval.",
            "Image segmentation and filtering based on transformations with reconstruction criteria.",
            "Markov model fuzzy-reasoning based algorithm for fast block motion estimation.",
            "Particle swarm optimization for point pattern matching.",
            "Synthesising and reducing film grain.",
            "Special issue on emerging H.264/AVC video coding standard.",
            "Overview of H.264/MPEG-4 part 10.",
            "Fast motion search with efficient inter-prediction mode decision for H.264.",
            "Fast motion estimation and Inter-mode decision for H.264/MPEG-4 AVC encoding.",
            "Fast integer-pel and fractional-pel motion estimation for H.264/AVC.",
            "Fast H.264 Intra-prediction mode selection using joint spatial and transform domain features.",
            "An extension of direct macroblock coding in Predictive (P) slices of the H.264 standard.",
            "Efficient intra- and inter-mode selection algorithms for H.264/ AVC.",
            "An improved H.264/AVC video encoding based on a new syntax element.",
            "Flexible macroblock ordering in H.264/AVC.",
            "Adaptive rate control for H.264.",
            "Improved H.264 rate control by enhanced MAD-based frame complexity prediction.",
            "Error resiliency schemes in H.264/AVC standard.",
            "Layered H.264 video transmission with hierarchical QAM.",
            "Network performance analysis of advanced video coding schemes.",
            "Stitching of H.264 video streams for continuous presence multipoint videoconferencing.",
            "Implementation of H.264 encoder and decoder on personal computers.",
            "A proposed hardware reference model for spatial transformation and quantization in H.264.",
            "Special issue: Real-time imaging.",
            "Adaptive frame skipping based on spatio-temporal complexity for low bit-rate video coding.",
            "Trading off quality and complexity for a HVQ-based video codec on portable devices.",
            "Comments on: Novel full-search schemes for speeding up image coding using vector quantization.",
            "Computationally efficient filtered-backprojection algorithm for tomographic image reconstruction using Walsh transform.",
            "Real-time image processing for active monitoring of wide areas.",
            "Appearance-based person recognition using color/path-length profile.",
            "Forced intra refreshment method based on the propagation model of uncertainties in the reference pixels for H.264 streaming service.",
            "List-mode image reconstruction for real-time PET imaging.",
            "Effective vehicle detection technique for traffic surveillance systems.",
            "A robust real-time video stabilization algorithm.",
            "Recognition of traffic signs based on their colour and shape features extracted using human vision models.",
            "Morphological wavelet-based stereo image coders.",
            "Evaluation and comparison of texture descriptors proposed in MPEG-7.",
            "Perceptual quality and objective quality measurements of compressed videos.",
            "Combinatorial boundary of a 3D lattice point set.",
            "Adaptive computation-aware scheme for software-based predictive block motion estimation.",
            "A novel frame-level bit allocation based on two-pass video encoding for low bit rate video streaming applications.",
            "Rate-distortion-smoothness optimized rate allocation schemes for Spectral Fine Granular Scalable video coding technique.",
            "FGS enhancement layer truncation with reduced intra-frame quality variation.",
            "MPEG-2 stereoscopic video coding technique using adaptive bandwidth control.",
            "Automatic liver segmentation for volume measurement in CT Images.",
            "An error resilient coding scheme for JPEG image transmission based on data embedding and side-match vector quantization.",
            "Retrieval and constraint-based human posture reconstruction from a single image.",
            "Color image decomposition and restoration.",
            "Rate-constrained motion estimation using Kalman filter.",
            "Texture image retrieval and image segmentation using composite sub-band gradient vectors.",
            "NMF, LNMF, and DNMF modeling of neural receptive fields involved in human facial expression perception.",
            "Similarity retrieval of shape images based on database classification.",
            "A POCS-based constrained total least squares algorithm for image restoration.",
            "Combining geometrical and textured information to perform image classification.",
            "Emergence of region-based transmission when computation is unconstrained.",
            "An evolutionary blind image deconvolution algorithm through the pseudo-Wigner distribution.",
            "A TV flow based local scale estimate and its application to texture discrimination.",
            "A quadratic prediction based fractional-pixel motion estimation algorithm for H.264.",
            "Progressive compression and transmission of PointTexture images.",
            "Content-based image retrieval using association rule mining with soft relevance feedback.",
            "Two error resilient coding schemes for wavelet-based image transmission based on data embedding and genetic algorithms.",
            "Interactive key frame selection model.",
            "A joint source and channel coding algorithm for error-resilient SPIHT-coded video bitstreams.",
            "Approximating a set of points by a step function.",
            "Video object tracking using adaptive Kalman filter.",
            "A hybrid gray image representation using spatial- and DCT-based approach with application to moment computation.",
            "Indexing the aperture 3 hexagonal discrete global grid.",
            "Estimating the Euler Characteristic of a planar set from a digital image.",
            "Invariant salient regions based image retrieval under viewpoint and illumination variations."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2005",
        "info": "2005: Volume 16",
        "count": 37,
        "papers": [
            "A hierarchical video-on-demand system with double-rate batching.",
            "Joint source-channel coding of GGD sources with allpass filtering source reshaping.",
            "Detecting and matching feature points.",
            "Fast fractal coding of subbands using a non-iterative block clustering.",
            "Automatic extraction of moving objects for head-shoulder video sequence.",
            "An error resilient coding scheme for H.264/AVC video transmission based on data embedding.",
            "Enhancement of image watermark retrieval based on genetic algorithms.",
            "Markov random field approach to region extraction using Tabu Search.",
            "Enhancement layer rate control for high bitrate SNR scalable video coding.",
            "High quality, low delay foveated visual communications over mobile channels.",
            "Robust video sequence retrieval using a novel object-based T2D-histogram descriptor.",
            "Optimal projections onto grids and finite resolution images.",
            "On the foundations of vision modeling II. Mining of mirror symmetry of 2-D shapes.",
            "Perceptual assessment of simulated print noise with random and periodic structure.",
            "A hybrid error concealment scheme for MPEG-2 video transmission based on best neighborhood matching algorithm.",
            "Novel fast color reduction algorithm for time-constrained applications.",
            "A logic framework for active contours on multi-channel images.",
            "Multilayered protection of embedded video bitstreams over binary symmetric and packet erasure channels.",
            "A fast efficient restoration algorithm for high-noise image filtering with adaptive approach.",
            "Special issue on visual communication in the ubiquitous era.",
            "Benefits and costs of scalable video coding for internet streaming.",
            "Joint mode selection and unequal error protection for bitplane coded video transmission over wireless channels.",
            "A model-based adaptive motion estimation scheme using Renyi's entropy for wireless video.",
            "Split-domain video transmission protocol for video streaming over hybrid wired-wireless connections.",
            "Packet video transmission over wireless channels with adaptive channel rate allocation.",
            "Adaptive spatial-temporal error concealment with embedded side information.",
            "Real-time smoothing for network adaptive video streaming.",
            "Operational distortion-quantization curve-based bit allocation for smooth video quality.",
            "VLC/FLC data partitioning with intra AC prediction disabled.",
            "Content-aware error-resilient transcoding using prioritized intra-refresh for video streaming.",
            "MPEG video markup language and its applications to robust video transmission.",
            "A model for the assessment of watermark quality with regard to fidelity.",
            "Foveation embedded DCT domain video transcoding.",
            "Block-based motion field segmentation for video coding.",
            "Technologies for 3D mesh compression: A survey.",
            "A rate control scheme using Kalman filtering for H.263.",
            "Similarity retrieval of videos by using 3D C-string knowledge representation."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2004",
        "info": "2004: Volume 15",
        "count": 29,
        "papers": [
            "Colour and texture segmentation using wavelet frame analysis, deterministic relaxation, and fast marching algorithms.",
            "Modified Hausdorff distance for model-based 3-D object recognition from a single view.",
            "Progressive encoding of binary voxel models using pyramidal decomposition.",
            "Mapping colour in image stitching applications.",
            "Restoration of differential images for enhancement of compressed video.",
            "Human factors in color-based image retrieval: an empirical study on size estimate accuracies.",
            "A new cut detection algorithm with constant false-alarm ratio for video segmentation.",
            "A lifting based system for compression and classification trade off in the JPEG2000 framework.",
            "Perceptual dithering for octave subband image coding.",
            "Tissue separation in MR images - from supervised to unsupervised classification.",
            "A new adaptive search strategy for fast block based motion estimation algorithms.",
            "An error resilient coding scheme for H.26L video transmission based on data embedding.",
            "A discrete particle swarm algorithm for optimal polygonal approximation of digital curves.",
            "Multimedia database management systems.",
            "Framework for measurement of the intensity of motion activity of video segments.",
            "Evaluation of shape similarity measurement methods for spine X-ray images.",
            "Integrated use of different content derivation techniques within a multimedia database management system.",
            "Real-time view recognition and event detection for sports video.",
            "On supervision and statistical learning for semantic multimedia analysis.",
            "Video personalization and summarization system for usage environment.",
            "Bridging the semantic gap in sports video retrieval and summarization.",
            "Organizing a personal image collection with statistical model-based ICL clustering on spatio-temporal camera phone meta-data.",
            "Content-based retrieval for human motion data.",
            "Automatic generation of conference video proceedings.",
            "Adaptive partial distortion search for block motion estimation.",
            "Embedded colour image coding for content-based retrieval.",
            "Transform domain inter-block interleaving schemes for robust image and video transmission in ATM networks.",
            "A visualizing application of line integral convolution techniques.",
            "Combining a morphological interpolation approach with a surface reconstruction method for the 3-D representation of tomographic data."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2003",
        "info": "2003: Volume 14",
        "count": 27,
        "papers": [
            "3D target recognition based on projective invariant relationships.",
            "Efficient block-based video encoder embedding a Wiener filter for noisy video sequences.",
            "A comparative study of curvature scale space and Fourier descriptors for shape-based image retrieval.",
            "Hybrid global-local motion compensated frame interpolation for low bit rate video coding.",
            "A CA-based edge operator and its performance evaluation.",
            "New two-phase spatial data structures with applications to binary images.",
            "Analysis of image registration noise due to rotationally dependent aliasing.",
            "A bit allocation scheme for a class of embedded wavelet video encoders.",
            "Survey of compressed-domain features used in audio-visual indexing and analysis.",
            "Fast algorithms for color image processing by principal component analysis.",
            "Modeling of subband coefficients for clustering-based adaptive quantization with spatial constraints.",
            "Systolic array architectures for computation of the discrete wavelet transform.",
            "Visual attention for region of interest coding in JPEG 2000.",
            "Incremental modifications of segmented image defined by discrete maps.",
            "Indexing and retrieval of images by spatial constraints.",
            "An accurate bit-rate control algorithm for video transcoding.",
            "A quadtree-based representation technique for indexing and retrieval of image databases.",
            "On the preview of digital movies.",
            "Reduced complexity Retinex algorithm via the variational approach.",
            "Algorithms of halftoning color images with edge enhancement.",
            "An effective mesh-based motion compensation technique for video coding.",
            "Combining positive and negative examples in relevance feedback for content-based image retrieval.",
            "Error prevention and concealment for scalable video coding with dual-priority transmission.",
            "Image watermarking using tree-based spatial-frequency feature of wavelet transform.",
            "Blocking artifact reduction in compressed images based on edge-adaptive quadrangle meshes.",
            "Super-resolution reconstruction using spatio-temporal filtering.",
            "Efficient error localization and temporal concealment based on motion estimation of enlarged block."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2002",
        "info": "2002: Volume 13",
        "count": 29,
        "papers": [
            "Special Issue on Partial Differential Equations in Image Processing, Computer Vision, and Computer Graphics.",
            "Dense Disparity Map Estimation Respecting Image Discontinuities: A PDE and Scale-Space Based Approach.",
            "An Adaptive Finite Volume Scheme for Solving Nonlinear Diffusion Equations in Image Processing.",
            "Elastica with Hinges.",
            "Bayesian Level Sets for Image Segmentation.",
            "Surface Evolution under Curvature Flows.",
            "Reaction-Diffusion Equations and Learning.",
            "Shape Recovery by Diffusion Generated Motion.",
            "A Scheme for Coherence-Enhancing Diffusion Filtering with Optimized Rotation Invariance.",
            "Optimal Parameter Height Ridges.",
            "Medial Axes and Mean Curvature Motion I: Regular Points.",
            "Image Recovery via Diffusion Tensor and Time-Delay Regularization.",
            "Entropy-Controlled Artificial Anisotropic Diffusion for the Numerical Solution of Conservation Laws Based on Algorithms from Image Processing.",
            "A Fully Global Approach to Image Segmentation via Coupled Curve Evolution Equations.",
            "Variational Numerical Methods for Solving Nonlinear Diffusion Equations Arising in Image Processing.",
            "Orientation Diffusion or How to Comb a Porcupine.",
            "Geodesic Active Regions: A New Framework to Deal with Frame Partition Problems in Computer Vision.",
            "Algebraic Framework for Linear and Morphological Scale-Spaces.",
            "Matching Structures by Computing Minimal Paths on a Manifold.",
            "Monotonicity Enhancing Nonlinear Diffusion.",
            "3D Shape Reconstruction from Autostereograms and Stereo.",
            "A New Side-Match Finite-State Vector Quantization Using Neural Networks for Image Coding.",
            "Multiresolution Video Coding Based on Kalman Filtering Motion Estimation.",
            "A New Method for Region-Based Depth Ordering in a Video Sequence: Application to Frame Interpolation.",
            "Multiple Hierarchical Image Transmission over Wireless Channels.",
            "On Computing General Position Views of Data in Three Dimensions.",
            "A Graph-Based Object Description for Information Retrieval in Digital Image and Video Libraries.",
            "Perceptual Image Indexing and Retrieval.",
            "Providing VCR Functionality in Multicast Video-on-Demand Systems Using Adaptive Batching."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2001",
        "info": "2001: Volume 12",
        "count": 24,
        "papers": [
            "On-line Scene Change Detection of Multicast Video.",
            "Video Segmentation in the Wavelet Compressed Domain.",
            "Encoding DCT Coefficients Based on Rate-Distortion Measurement.",
            "Hurst Parameter Estimation of Long-Range Dependent VBR MPEG Video Traffic in ATM Networks.",
            "Efficient Motion Estimation and Coding for Arbitrary-Shaped Video Objects.",
            "A Robust Nonlinear Filtering Approach to Inverse Halftoning.",
            "A Novel Fast Block Motion Estimation Algorithm Based on Combined Subsamplings on Pixels and Search Candidates.",
            "Spatial Similarity Retrieval in Video Databases.",
            "Using Browsing to Improve Content-Based Image Retrieval.",
            "Oblivious Digital Watermarking Scheme with Blob-Oriented and Modular-Arithmetic-Based Spatial-Domain Mechanism.",
            "Content-Based Hybrid DPCM/Classified Vector Quantization for Coding Video Telephony Sequences.",
            "Hausdorff Discretization for Cellular Distances and Its Relation to Coverand Supercover Discretizations.",
            "Segmentation of Perspective Textured Planes through the Ridges of Continuous Wavelet Transform.",
            "An Object-Based Shot Boundary Detection Using Edge Tracing and Tracking.",
            "Perception of High-Contrast Blurred Edges.",
            "Efficient Detection of Second-Degree Variations in 2D and 3D Images.",
            "Automatic Moving Object Extraction toward Content-Based Video Representation and Indexing.",
            "An Illumination Effect Descriptor for Video Sequences.",
            "Automatic Shot Change Detection Algorithm Using Multi-stage Clustering for MPEG-Compressed Videos.",
            "Nice Perspective Projections.",
            "Design and Evaluation of an Entirely Psychovisual-Based Coding Scheme.",
            "Total Variation Denoising and Enhancement of Color Images Based on the CB and HSV Color Models.",
            "Nontexture Inpainting by Curvature-Driven Diffusions.",
            "Distortion Minimization with Fast Local Search for Fractal Image Compression."
        ]
    },
    {
        "name": "JVCIR",
        "year": "2000",
        "info": "2000: Volume 11",
        "count": 26,
        "papers": [
            "VQ Based on a Main Feature Classification in Images.",
            "A Haar Wavelet Approach to Compressed Image Quality Measurement.",
            "3D Shape Inferencing and Modeling for Video Retrieval.",
            "Robust 3D Clue-Based Video Segmentation for Video Indexing.",
            "Postprocessing of Compressed 3D Graphic Data.",
            "Call for Papers: Special Issue on Partial Differential Equations in Image Processing, Computer Vision, and Computer Graphics.",
            "Special Issue on the Second International Conference on Scale Space Theory in Computer Vision: Guest Editors' Comments.",
            "Scale-Space Properties of Nonstationary Iterative Regularization Methods.",
            "Qualitative Multiscale Feature Hierarchies for Object Tracking.",
            "Active Contours without Edges for Vector-Valued Images.",
            "Riemannian Drums, Anisotropic Curve Evolution, and Segmentation.",
            "VORTEX: Video Retrieval and Tracking from Compressed Multimedia Databases - Multiple Object Tracking from MPEG-2 Bit Stream.",
            "An Adaptive Finite Element Method for Large Scale Image Processing.",
            "Applications of Locally Orderless Images.",
            "Reconciling Distance Functions and Level Sets.",
            "Scale-Space from a Level Lines Tree.",
            "Blur and Disorder.",
            "Nonlinear Scale-Space Representation with Morphological Levelings.",
            "The Hausdorff Dimension and Scale-Space Normalization of Natural Images.",
            "Region-Based Video Coding Using a Geometric Motion Compensation.",
            "Searching Images on the Basis of Color Homogeneous Objects and their Spatial Relationship.",
            "Texture Recognition and Image Retrieval Using Gradient Indexing.",
            "Two-Dimensional Adaptive Decimation and Interpolation Scheme for Low Bit-Rate Image Coding.",
            "Interresolution Look-up Table for Improved Spatial Magnification of Image.",
            "Image Compression Based on Multistage Vector Quantization.",
            "Video Transcoding with H.263 Bit-Streams."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1999",
        "info": "1999: Volume 10",
        "count": 21,
        "papers": [
            "A Web-Based Secure System for the Distributed Printing of Documents and Images.",
            "Application of H.263+ Video Coding Modes in Lossy Packet Network Environments.",
            "Image Retrieval: Current Techniques, Promising Directions, and Open Issues.",
            "Design and Performance Analysis of Linear Phase Para-UnitaryMBand Filter Banks for Image Coding.",
            "A Survey on the Automatic Indexing of Video Data, .",
            "Sketch-Based Image Queries in Topographic Databases.",
            "On the Geometries of Conic Section Representation of Noisy Object Boundaries.",
            "Drawing Nice Projections of Objects in Space.",
            "Progressive Video Coding for Noisy Channels.",
            "A Rotation, Translation, and Scale-Invariant Approach to Content-Based Image Retrieval.",
            "Data Allocation and Dynamic Load Balancing for Distributed Video Storage Server.",
            "Illumination Invariance and Object Model in Content-Based Image and Video Retrieval.",
            "Color Filter Arrays Based on Mutually Exclusive Blue Noise Patterns.",
            "An Indexing and Retrieval Mechanism for Complex Similarity Queries in Image Databases.",
            "Object-Based Very Low Bit-Rate Coding Using Motion Parameter Estimation Based on Multiple Frame Prediction.",
            "Isometry-Based Shape-Adaptive Fractal Coding for Images.",
            "A Rate-Constrained Hierarchical Grid Interpolation for Object-Based Motion Compensation.",
            "Some Modifications of Gradient Weighted Filters.",
            "An Evaluation of the Effectiveness of Image Features for Image Retrieval.",
            "Call Admission for MPEG Video Streams.",
            "On Reversible Skeletonization Using Anchor-Points from Distance Transforms."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1998",
        "info": "1998: Volume 9",
        "count": 33,
        "papers": [
            "Special Issue on High Fidelity Media Processing: Guest Editors' Comments.",
            "Review of Postprocessing Techniques for Compression Artifact Removal.",
            "Enhancement of Compressed Images by Optimal Shift-Invariant Wavelet Packet Basis.",
            "Spatio-Chromatic Image Enhancement Based on a Model of Human Visual Information Processing.",
            "Subpixel Motion Estimation for Super-Resolution Image Sequence Enhancement.",
            "Signal Processing, Acoustics, and Psychoacoustics for High Quality Desktop Audio.",
            "Image Segmentation with Topological Maps and Inter-pixel Representation.",
            "A Novel Video Coding Scheme Using Delaunay Triangulation.",
            "Similarity Retrieval by 2D C-Trees Matching in Image Databases.",
            "Design and Implementation of Format Conversion Filters for MPEG-4.",
            "Frame-Adaptive Vector Quantization.",
            "Recursive Optical Flow Estimation - Adaptive Filtering Approach.",
            "On Block Motion Estimation Using a Novel Search Strategy for an Improved Adaptive Pixel Decimation.",
            "A Temporally Adaptive Layered Image Coding Technique Based on the 3D SBC for ATM Networks.",
            "Statistical Computation of Discrete Cosine Transform in Video Encoders.",
            "Recognition of 2D Object Contours Using Starting-Point-Independent Wavelet Coefficient Matching.",
            "Design and Performance Evaluation of a Multimedia Web Server.",
            "Watermarking Schemes and Protocols for Protecting Rightful Ownership and Customer's Rights.",
            "Streaming Video Using Dynamic Rate Shaping and TCP Congestion Control.",
            "Inverse Halftoning of Color Images Using Classified Vector Quantization.",
            "Fast Image Restoration for Reducing Block Artifacts Based on Adaptive Constrained Optimization.",
            "Video Coding with R-D Constrained Hierarchical Variable Block Size (VBS) Motion Estimation.",
            "Special Issue on Image Technology for World Wide Web Applications: Guest Editors' Comments.",
            "Real-Time Labeling of MPEG-2 Compressed Video.",
            "Recursive Representation and Progressive Display of Binary Objects for Efficient Network Browsing.",
            "Query Expansion by Text and Image Features in Image Retrieval.",
            "Tree-Based Indexes for Image Data.",
            "A Practical Approach to Resource Allocation in Video-on-Demand Servers.",
            "Efficient Filtering and Clustering Methods for Temporal Video Segmentation and Visual Summarization.",
            "Denoising Color Images Using Regularization and \"Correlation Terms\".",
            "Symmetry-Based Indexing of Image Databases.",
            "Visual Coding: Design of Psychovisual Quantizers.",
            "A Power Differentiation Method of Fractal Dimension Estimation for 2-D Signals."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1997",
        "info": "1997: Volume 8",
        "count": 32,
        "papers": [
            "Editorial.",
            "Region-Based Shape Matching for Automatic Image Annotation and Query-by-Example.",
            "Lossless Image Compression Using the Discrete Cosine Transform.",
            "An Improved VQ Codebook Search Algorithm Using Principal Component Analysis.",
            "On the Discretization of Morphological Operators.",
            "Adaptive Piecewise Linear Bits Estimation Model for MPEG Based Video Coding.",
            "Segmented Adaptive DPCM for Lossy Compression of Multispectral MR Images.",
            "A New Motion Estimation Method Using Frequency Components.",
            "A User-Dependent Definition of the Information in Images and Its Use in Information Retrieval.",
            "Video Content Representation, Indexing, and Matching in Video Information Systems.",
            "Graph Indexes of 2D-Thinned Images for Rapid Content-Based Image Retrieval.",
            "An Image Compression and Indexing System Using Neural Networks.",
            "Review of Image and Video Indexing Techniques.",
            "Image Decomposition and Representation in Large Image Database Systems.",
            "Robust and Efficient Transform Domain Video Sequence Analysis: An Approach from the Generalized Color Ratio Model.",
            "A Generalized Method for Image Coding Using Fractal-Based Techniques.",
            "Retrieval and Browsing of Images Using Image Thumbnails.",
            "Spatial and Frequency Decomposition for Image Compression.",
            "Motion-Adaptive Modelling of Scene Content for Very Low Bit Rate Model-Assisted Coding of Video.",
            "Efficient Luminance and Saturation Processing Techniques for Color Images.",
            "Facial Expression Recognition Using Model-Based Feature Extraction and Action Parameters Classification.",
            "A New Binary Image Representation: Logicodes.",
            "A Dense Class of Markov Random Fields and Associated Parameter Estimation.",
            "Polynomial Approximation Coding for Progressive Image Transmission.",
            "A Perceptual Approach to the Reduction of Blocking Effect in DCT-Coded Images.",
            "Edge Preserving Interpolation of Digital Images Using Fuzzy Inference.",
            "A Rate-Distortion Function for Vector Quantization with a Variable Block-Size Classification Model.",
            "New Order-8 Dyadic Transform for Image Coding.",
            "Morphological Image Enlargements.",
            "Lexicographic Bit Allocation for MPEG Video.",
            "Quantization of 3D-DCT Coefficients and Scan Order for Video Compression.",
            "Stochastic Screen Halftoning for Electronic Imaging Devices."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1996",
        "info": "1996: Volume 7",
        "count": 34,
        "papers": [
            "Special Issue on Digital Libraries: Guest Editor's Introduction: Guest Editor's Introduction.",
            "Optical Character Recognition and Parsing of Typeset Mathematics1.",
            "Content-Based Indexing of Spatial Objects in Digital Libraries.",
            "A Survey of Technologies for Parsing and Indexing Digital Video1.",
            "Querying Video Libraries*.",
            "Ensuring Retrieval Effectiveness in Distributed Digital Libraries.",
            "Retrieval and Reasoning in Distributed Case Bases1.",
            "Internet Categorization and Search: A Self-Organizing Approach.",
            "A Graded Approach to Shape Representation.",
            "A Two-Dimensional Inplace Truncation Walsh Transform Method.",
            "Uniqueness of Solutions to Structure and Motion from Combinations of Point and Line Correspondences.",
            "A Video Coder Based on Split-Merge Displacement Estimation.",
            "Applications of Partitioned Iterated Function Systems in Image and Video Compression.",
            "Shape from Photometric Ratio and Stereo.",
            "Fast Search Algorithms for VQ Codebook Generation.",
            "The Use of the Gray Level SAT to Find the Salient Cavities in Echocardiograms.",
            "How to Track a Flying Saucer.",
            "Geometric Feature Detection for Reverse Engineering Using Range Imaging.",
            "On the Validity of Fractal Dimension Measurements in Image Analysis.",
            "Boundary-Control Vector (BCV) Motion Field Representation and Estimation by Using a Markov Random Field Model.",
            "Multichannel Regularized Iterative Restoration of Motion Compensated Image Sequences.",
            "Anisotropic Hierarchical Motion Estimation Method Based on Decomposition of the Functional Domain.",
            "A Lattice-Theoretical Morphological View on Template Extraction in Images.",
            "Progressive Image Transmission by Segmentation-Based Coding.",
            "Guest Editors' Introduction: Special Issue on Indexing, Storage, Browsing, and Retrieval of Images and Video.",
            "A Unified Approach to Iconic Indexing, Retrieval, and Maintenance of Spatial Relationships in Image Databases.",
            "Spatial Indexing for Video Databases.",
            "Efficient Automatic Text Location Method and Content-Based Indexing and Structuring of Video Database.",
            "Abstracting Digital Movies Automatically.",
            "Video Annotation by Motion Interpretation Using Optical Flow Streams.",
            "A Scheme for Intelligent Image Retrieval in Multimedia Databases.",
            "Intermediate Annotationless Dynamical Object-Index-Based Query in Large Image Archives with Holographic Representation.",
            "Fast Inverse Motion Compensation Algorithms for MPEG and for Partial DCT Information.",
            "Convolution-Based Edge Detection for Image/Video in Block DCT Domain."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1995",
        "info": "1995: Volume 6",
        "count": 32,
        "papers": [
            "Virtual Space Teleconferencing: Real-Time Reproduction of 3D Human Images.",
            "Motion-Compensated Prediction Using Nodal-Based Deformable Block Matching.",
            "Conformal Mapping-Based Image Processing: Theory and Applications.",
            "Bit Allocation in Piecewise-Planar Representation of Images.",
            "Straight Line Extraction Using Iterative Total Least Squares Methods.",
            "Representation of Linear Granulometric Moments for Deterministic and Random Binary Euclidean Images.",
            "On the Finite-Precision Implementation of Arithmetic Codes.",
            "Multiplicative Zak Transform.",
            "Digital Visual Communications over Telephone Networks.",
            "Human Visual System Based Wavelet Decomposition for Image Compression.",
            "A Bevy of Novel Interpolating Kernels for the Shannon Reconstruction of High-Bandpass Images.",
            "Robust Estimation of Motion Vector Fields with Discontinuity and Occlusion Using Local Outliers Rejection.",
            "On Orthogonal Transforms of Images Using Paraunitary Filter Banks.",
            "Symmetry Interpretation of Complex Moments and the Local Power Spectrum.",
            "A Hybrid Subband-DCT Codec for Transmission of High Resolution Still Pictures at 64K bit/s.",
            "Postprocessing of Thresholded Images to Maximize Edge Coincidence.",
            "On Dimensionality in Multiscale Morphological Scale-Space with Elliptic Poweroid Structuring Functions.",
            "Application of Morphological Pyramids: Fusion of MR and CT Phantoms.",
            "Investigation of Receptive Fields Using Representations of the Dihedral Groups.",
            "Early Image Representation by Slope Districts.",
            "Colored Illumination for Enhancing Discriminability in Machine Vision.",
            "A New Generalized Hough Transform for the Detection of Irregular Objects.",
            "Error Detection and Concealment with an Unsupervised MPEG2 Video Decoder.",
            "Human Face Perception in Degraded Images.",
            "Autoregressive Estimation of High-Frequency Components in DCT Image Coding.",
            "Motion and Illumination Variation Estimation Using a Hierarchy of Models: Application to Image Sequence Coding.",
            "Multidimensional Characterization of the Perceptual Quality of Noise-Reduced Computed Tomography Images.",
            "Morphological Extraction of Line Networks from Noisy Low-Contrast Images.",
            "Robust Multiresolution Estimation of Parametric Motion Models.",
            "Compression of Binary Images by Composite Methods Based on Block Coding.",
            "Subband Finite-State Vector Quantization for Still Image Coding.",
            "Texture Segmentation via Haar Fractal Feature Estimation."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1994",
        "info": "1994: Volume 5",
        "count": 36,
        "papers": [
            "Tracking Human Body Motion Based on a Stick Figure Model.",
            "Recovering 3D Shape and Motion from Image Streams Using Nonlinear Least Squares.",
            "Morphological Image Coding Based on a Geometric Sampling Theorem and a Modified Skeleton Representation.",
            "Robust Spatial Autoregressive Modeling for Hardwood Log Inspection.",
            "Deterministic and Stochastic Separation of Digital Images.",
            "Layered Coding Schemes for Video Transmission on ATM Networks.",
            "Finite-State Residual Vector Quantization.",
            "Applications of the Phase Transition Theory in Visual Recognition and Classifications.",
            "An Approach to Subband DCT Image Coding.",
            "Well-Shaped, Stable, and Reversible Skeletons from the (3, 4)-Distance Transform.",
            "VLSI Design of Digital Cellular Neural Networks for Image Processing.",
            "Nonlinear Mapping Algorithm and Applications for Multidimensional Data Analysis.",
            "Polygons in Three Dimensions.",
            "2-D Curve Partitioning by Kohonen Feature Maps.",
            "Vector Space Projection Approach for Perfect Reconstruction Filter Banks Design.",
            "Detecting Activities.",
            "An Efficient Algorithm for Drainage Network Extraction on DEMs.",
            "A Study of Pyramidal Techniques for Image Representation and Compression.",
            "Subband/VQ Coding of Color Images Using a Separable Diamond Decomposition.",
            "A New Image and Video Compression Technique in an Asynchronous Transfer Mode Network Environment.",
            "A New Method for Nonorthogonal Signal Decomposition.",
            "Vectorization and Representation of Large-Size 2-D Line-Drawing Images.",
            "A Moving Window Shannon Reconstruction Algorithm for Image Interpolation.",
            "Automatic Keyword Recognition Using Hidden Markov Models.",
            "How to Catch a Crook.",
            "Visual Communication: Information and Data Transmission.",
            "Special Issue on Still and Video Image Compression: Guest Editors' Comments.",
            "A Fast Approximate Karhunen-Loève Transform (AKLT) for Data Compression.",
            "On Universal Data Compression - An Intuitive Overview.",
            "Pyramid Structure Using Projection for Progressive Image Transmission.",
            "Progressive Image Transmission Using LOT with Two-Channel Conjugate VQ.",
            "Video Coding Using Variable Block-Size Segmentation by Motion Vectors.",
            "Vector Quantization-Based Motion Field Segmentation under the Entropy Criterion.",
            "Classification-Based Motion Estimation for Video Coding.",
            "Performance of MPEG Codecs in the Presence of Errors.",
            "Adaptive Image Sampling and Interpolation for Data Compression."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1993",
        "info": "1993: Volume 4",
        "count": 33,
        "papers": [
            "Spatial Derivatives and the Propagation of Noise in Gaussian Scale Space.",
            "Motion from Optic Flow: Multiplicity of Solutions.",
            "A Gradient-Based Method for General Motion Estimation and Segmentation.",
            "Cell Loss and Error Recovery in Variable Rate Video.",
            "Quantifying Visualizations for Reduced Modeling in Nonlinear Science: Extracting Structures from Data Sets.",
            "Visual Communication: Information and Fidelity.",
            "Experimentally Obtained Thresholds for a Conditional-Replenishment Image-Sequence Coder.",
            "An Iterative Projection Technique for Blind Image Restoration.",
            "Video Compression: Standards and Applications.",
            "Principal Component Vector Quantization.",
            "Reconstruction of Binary and Gray-Scale Images from Mid-crack Code Descriptions.",
            "Sonar Feature-Based Bandwidth Compression.",
            "Measurement of Edge Coincidence in Image Thresholdings.",
            "GCV and ML Methods of Determining Parameters in Image Restoration by Regularization: Fast Computation in the Spatial Domain and Experimental Comparison.",
            "Side-Match Vector Quantization for Reconstruction of Lost Blocks.",
            "A Modified Cosine Transform.",
            "Conversion and Trade-offs between Scaled Gaussian Parallel and Hierarchic Analysis Multirate Filter Banks.",
            "Texture Classification and Segmentation Based on Iterative Morphological Decomposition.",
            "Transform-Coding Image Compression for Information Efficiency and Restoration.",
            "Image Compression Using Adaptive Multilevel Block Truncation Coding.",
            "Optimal PR-QMF Design for Subband Image Coding.",
            "A New Rate Control Strategy for the MPEG Video Coding Algorithm.",
            "Spherical Wavelets and Their Applications to Image Representation.",
            "Entropy and Image Compression.",
            "Wigner Distribution for 2D Motion Estimation from Noisy Images.",
            "Motion Oriented Picture Interpolation with Human Perceptual Consideration.",
            "Computation of Dense Optical Flow with a Parametric Smoothness Model.",
            "Motion Analysis for Image Enhancement: Resolution, Occlusion, and Transparency.",
            "A Two-Stage Fast Block Matching Algorithm Using Integral Projections.",
            "Recursive Locally Linear MMSE Motion-Compensated Image Sequence Filtering under Quantum-Limited Conditions.",
            "Analysis of Intensity and Range Image Sequences Using Adaptive-Size Meshes.",
            "Motion Tracking of Deformable Objects by Active Contour Models Using Multiscale Dynamic Programming.",
            "Interframe Interpolation of Cinematic Sequences."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1992",
        "info": "1992: Volume 3",
        "count": 36,
        "papers": [
            "Receptive field assembly pattern specificity.",
            "The finite Zak transform: An efficient tool for image representation and analysis.",
            "Graph morphology.",
            "Incremental estimation of image flow using a Kalman filter.",
            "Smoothed differentiation filters for images.",
            "Interesting properties of the discrete cosine transform.",
            "Convergence, continuity, and iteration in mathematical morphology.",
            "Preface.",
            "Optimization on euclidean distance transformation using grayscale morphology.",
            "Structuring element adaptation for morphological filters.",
            "Dimensionality in image analysis.",
            "Model-based characterization of statistically optimal design for morphological shape recognition algorithms via the hit-or-miss transform.",
            "Propagation algorithms on graphs for physical applications.",
            "Discretization of morphological operators.",
            "Morphological algorithms for visual analysis of integrated circuits.",
            "Asymptotic normality of the morphological pattern-spectrum moments and orthogonal granulometric generators.",
            "A new single-pass algorithm for extracting the mid-crack codes of multiple regions.",
            "Subsampling of Markov random fields.",
            "A multitask visual information processor with a biologically motivated design.",
            "Nonlinear prediction with neural networks applied to 1-D DPCM image coding.",
            "Motion of nonrigid objects from multiframe correspondences.",
            "Noise reduction in computerized tomography images by means of polynomial transforms.",
            "Fuzzy mathematical morphology.",
            "Image restoration and reconstruction Guest Editors' comments.",
            "Convex set theoretic image recovery: History, current status, and new directions.",
            "On methods for maximum a posteriori image reconstruction with a normal prior.",
            "Iterative restoration of MR images corrupted with translational motion.",
            "Noisy image restoration using multiresolution markov random fields.",
            "Restoration of images degraded by compound noise sources using Markov random field models.",
            "Multiresolution image gathering and restoration.",
            "Modeling of the point-spread function of laser scanning microscopes using canonical transforms.",
            "Compression and reconstruction of spatially invariant linearly additive image sequences with suppression of noise and undesired features.",
            "Optimal restoration of multichannel images based on constrained mean-square estimation.",
            "Optimal morphological restoration: The morphological filter mean-absolute-error theorem.",
            "A cross-validation framework for solving image restoration problems.",
            "Iterative evaluation of the regularization parameter in regularized image restoration."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1991",
        "info": "1991: Volume 2",
        "count": 34,
        "papers": [
            "Digital coding techniques for visual communications.",
            "On the morphological representation of binary images in a noisy environment.",
            "A computational model of spatiochromatic image coding in early vision.",
            "Coding of facial image sequence based on a 3-D model of the head and motion detection.",
            "On the computation of a scale-space primal sketch.",
            "Improving the translation parameter estimation of linear algorithms.",
            "A neural network-based on-line Chinese character recognition system.",
            "Image sequence coding by adaptive vector quantization with variable block size.",
            "Multiple-rate structured vector quantization of image pyramids.",
            "Localized measurement of image fractal dimension using gabor filters.",
            "A self-organizing adaptive vector quantization technique.",
            "Spatial distributions from contour lines: An efficient methodology based on distance transformations.",
            "Medial axis representation and encoding of scanned documents.",
            "Image sequence coding using adaptive nonuniform tree-structured vector quantization.",
            "Application of the Hausdorff metric in gray-scale mathematical morphology via truncated umbrae.",
            "Level-crossing approach to the compression of body surface potential maps.",
            "Binary space partitioning tree representation of images.",
            "The properties of space-time sampling and the extraction of the optical flow: The effects of motion uncertainty.",
            "Morphological hit-or-miss transformation for shape recognition.",
            "Variations on a theme in binary mathematical morphology.",
            "Pel-recursive motion field estimation from image sequences.",
            "Color printing image coding using vector quantization.",
            "Image coding based on two-channel conjugate VQ.",
            "Editorial Visual communication and image representation in Japan: Guest editor's comments.",
            "Performance evaluation of subband coding and optimization of its filter coefficients.",
            "3045 Mbps digital coding system for transmission of (4: 2: 2) digital component TV signals recommended by CCIR.",
            "Three-dimensional signal processing for full utilization of NTSC signals and transmission capacities.",
            "3D structure extraction coding of image sequences.",
            "Realistic image synthesis of a deformable living thing based on motion understanding.",
            "An interactive visualization system for three-dimensional medical images based on the density reprojection method.",
            "Three-dimensional reconstruction using homocentric spherical spatiotemporal image analysis.",
            "A single-board video codec using video image signal processors.",
            "Analog computation structure for surface reconstruction.",
            "Computation of the discrete cosine transform using the iterative arithmetic fourier transform."
        ]
    },
    {
        "name": "JVCIR",
        "year": "1990",
        "info": "1990: Volume 1",
        "count": 18,
        "papers": [
            "Editorial.",
            "Gramians, generalized inverses, and the least-squares approximation of optical flow.",
            "On deterministic convergence of iterations of relaxed projection operators.",
            "Morphological segmentation.",
            "Coding and retrieving method of stroke signals for multimedia mail.",
            "Three-dimensional microscopy toward in Vivo cellular imaging using NMR tomography.",
            "The group theoretic approach to image representation.",
            "Improved permutation codes with their application to image coding.",
            "A multiple input image restoration approach.",
            "The retinal rod as a chemical photomultiplier.",
            "Integrated information modalities for human/machine communication: HuMaNet, an experimental system for conferencing.",
            "A semiregular image grid.",
            "Image reconstruction based on human and monkey cone mosaics.",
            "Image reconstruction from one bit of phase information.",
            "Toward the unsupervised interpretation of outdoor imagery.",
            "Metrics for the strength of low-level motion perception.",
            "Attentive transmission.",
            "Image representation of moving nonrigid objects."
        ]
    }
]