[
    {
        "year": "2022",
        "name": "28th MMM 2022",
        "info": "Qui Nhon, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2022-1",
                "sub_name": "MultiMedia Modeling - 28th International Conference, MMM 2022, Phu Quoc, Vietnam, June 6-10, 2022, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "Real-time Detection of Tiny Objects Based on a Weighted Bi-directional FPN.",
                    "Multi-modal Fusion Network for Rumor Detection with Texts and Images.",
                    "PF-VTON: Toward High-Quality Parser-Free Virtual Try-On Network.",
                    "MF-GAN: Multi-conditional Fusion Generative Adversarial Network for Text-to-Image Synthesis.",
                    "Learning to Classify Weather Conditions from Single Images Without Labels.",
                    "Learning Image Representation via Attribute-Aware Attention Networks for Fashion Classification.",
                    "Toward Detail-Oriented Image-Based Virtual Try-On with Arbitrary Poses.",
                    "Parallel DBSCAN-Martingale Estimation of the Number of Concepts for Automatic Satellite Image Clustering.",
                    "AI for the Media Industry: Application Potential and Automation Levels.",
                    "Rating-Aware Self-Organizing Maps.",
                    "Color the Word: Leveraging Web Images for Machine Translation of Untranslatable Words.",
                    "MGMP: Multimodal Graph Message Propagation Network for Event Detection.",
                    "Pose-Enhanced Relation Feature for Action Recognition in Still Images.",
                    "Prostate Segmentation of Ultrasound Images Based on Interpretable-Guided Mathematical Model.",
                    "Spatiotemporal Perturbation Based Dynamic Consistency for Semi-supervised Temporal Action Detection.",
                    "A Task Category Space for User-Centric Comparative Multimedia Search Evaluations.",
                    "GPR1200: A Benchmark for General-Purpose Content-Based Image Retrieval.",
                    "LLQA - Lifelog Question Answering Dataset.",
                    "Category-Sensitive Incremental Learning for Image-Based 3D Shape Reconstruction.",
                    "AdaConfigure: Reinforcement Learning-Based Adaptive Configuration for Video Analytics Services.",
                    "Mining Minority-Class Examples with Uncertainty Estimates.",
                    "Conditional Context-Aware Feature Alignment for Domain Adaptive Detection Transformer.",
                    "Human Activity Recognition with IMU and Vital Signs Feature Fusion.",
                    "On Assisting Diagnoses of Pareidolia by Emulating Patient Behavior.",
                    "Using Explainable AI to Identify Differences Between Clinical and Experimental Pain Detection Models Based on Facial Expressions.",
                    "Double Granularity Relation Network with Self-criticism for Occluded Person Re-identification.",
                    "A Complementary Fusion Strategy for RGB-D Face Recognition.",
                    "Multi-scale Cross-Modal Transformer Network for RGB-D Object Detection.",
                    "Joint Re-Detection and Re-Identification for Multi-Object Tracking.",
                    "An Investigation into Keystroke Dynamics and Heart Rate Variability as Indicators of Stress.",
                    "Fall Detection Using Multimodal Data.",
                    "Prediction of Blood Glucose Using Contextual LifeLog Data.",
                    "Multimodal Embedding for Lifelog Retrieval.",
                    "A Multiple Positives Enhanced NCE Loss for Image-Text Retrieval.",
                    "SAM: Self Attention Mechanism for Scene Text Recognition Based on Swin Transformer.",
                    "JVCSR: Video Compressive Sensing Reconstruction with Joint In-Loop Reference Enhancement and Out-Loop Super-Resolution.",
                    "Point Cloud Upsampling via a Coarse-to-Fine Network.",
                    "Arbitrary Style Transfer with Adaptive Channel Network.",
                    "Fast Single Image Dehazing Using Morphological Reconstruction and Saturation Compensation.",
                    "One-Stage Image Inpainting with Hybrid Attention.",
                    "Real-Time FPGA Design for OMP Targeting 8K Image Reconstruction.",
                    "Time-Frequency Attention for Speech Emotion Recognition with Squeeze-and-Excitation Blocks.",
                    "Speech Intelligibility Enhancement By Non-Parallel Speech Style Conversion Using CWT and iMetricGAN Based CycleGAN.",
                    "A-Muze-Net: Music Generation by Composing the Harmony Based on the Generated Melody.",
                    "Melody Generation from Lyrics Using Three Branch Conditional LSTM-GAN.",
                    "Bi-attention Modal Separation Network for Multimodal Video Fusion.",
                    "Combining Knowledge and Multi-modal Fusion for Meme Classification.",
                    "Non-Uniform Attention Network for Multi-modal Sentiment Analysis.",
                    "Multimodal Unsupervised Image-to-Image Translation Without Independent Style Encoder."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2022-2",
                "sub_name": "MultiMedia Modeling - 28th International Conference, MMM 2022, Phu Quoc, Vietnam, June 6-10, 2022, Proceedings, Part II.",
                "count": 58,
                "papers": [
                    "Long-Range Feature Dependencies Capturing for Low-Resolution Image Classification.",
                    "An IBC Reference Block Enhancement Model Based on GAN for Screen Content Video Coding.",
                    "AS-Net: Class-Aware Assistance and Suppression Network for Few-Shot Learning.",
                    "DIG: A Data-Driven Impact-Based Grouping Method for Video Rebuffering Optimization.",
                    "Indie Games Popularity Prediction by Considering Multimodal Features.",
                    "An Iterative Correction Phase of Light Field for Novel View Reconstruction.",
                    "Multi-object Tracking with a Hierarchical Single-Branch Network.",
                    "ILMICA - Interactive Learning Model of Image Collage Assessment: A Transfer Learning Approach for Aesthetic Principles.",
                    "Exploring Implicit and Explicit Relations with the Dual Relation-Aware Network for Image Captioning.",
                    "Generative Landmarks Guided Eyeglasses Removal 3D Face Reconstruction.",
                    "Patching Your Clothes: Semantic-Aware Learning for Cloth-Changed Person Re-Identification.",
                    "Lightweight Wavelet-Based Network for JPEG Artifacts Removal.",
                    "Shared Latent Space of Font Shapes and Their Noisy Impressions.",
                    "Reconstructing 3D Contour Models of General Scenes from RGB-D Sequences.",
                    "SUnet++: Joint Demosaicing and Denoising of Extreme Low-Light Raw Image.",
                    "HyText - A Scene-Text Extraction Method for Video Retrieval.",
                    "Depthwise-Separable Residual Capsule for Robust Keyword Spotting.",
                    "Adaptive Speech Intelligibility Enhancement for Far-and-Near-end Noise Environments Based on Self-attention StarGAN.",
                    "Personalized Fashion Recommendation Using Pairwise Attention.",
                    "Graph Neural Networks Based Multi-granularity Feature Representation Learning for Fine-Grained Visual Categorization.",
                    "Skeletonization Based on K-Nearest-Neighbors on Binary Image.",
                    "Classroom Attention Estimation Method Based on Mining Facial Landmarks of Students.",
                    "A Novel Chinese Sarcasm Detection Model Based on Retrospective Reader.",
                    "Effects and Combination of Tailored Browser-Based and Mobile Cognitive Software Training.",
                    "Progressive GAN-Based Transfer Network for Low-Light Image Enhancement.",
                    "Rethinking Shared Features and Re-ranking for Cross-Modality Person Re-identification.",
                    "Adversarial Attacks on Deepfake Detectors: A Practical Analysis.",
                    "Multi-modal Semantic Inconsistency Detection in Social Media News Posts.",
                    "EEG Emotion Recognition Based on Dynamically Organized Graph Neural Network.",
                    "An Unsupervised Multi-scale Generative Adversarial Network for Remote Sensing Image Pan-Sharpening.",
                    "Leveraging Selective Prediction for Reliable Image Geolocation.",
                    "Compressive Sensing-Based Image Encryption and Authentication in Edge-Clouds.",
                    "ECAS-ML: Edge Computing Assisted Adaptation Scheme with Machine Learning for HTTP Adaptive Streaming.",
                    "Fast CU Depth Decision Algorithm for AVS3.",
                    "MEViT: Motion Enhanced Video Transformer for Video Classification.",
                    "CDeRSNet: Towards High Performance Object Detection in Vietnamese Document Images.",
                    "Making Few-Shot Object Detection Simpler and Less Frustrating.",
                    "PicArrange - Visually Sort, Search, and Explore Private Images on a Mac Computer.",
                    "XQM: Search-Oriented vs. Classifier-Oriented Relevance Feedback on Mobile Phones.",
                    "MoViDNN: A Mobile Platform for Evaluating Video Quality Enhancement with Deep Neural Networks.",
                    "DataCAP: A Satellite Datacube and Crowdsourced Street-Level Images for the Monitoring of the Common Agricultural Policy.",
                    "A Virtual Reality Reminiscence Interface for Personal Lifelogs.",
                    "Efficient Search and Browsing of Large-Scale Video Collections with Vibro.",
                    "Multi-modal Interactive Video Retrieval with Temporal Queries.",
                    "Multi-modal Video Retrieval in Virtual Reality with vitrivr-VR.",
                    "Video Search with Context-Aware Ranker and Relevance Feedback.",
                    "Exquisitor at the Video Browser Showdown 2022.",
                    "Videofall - A Hierarchical Search Engine for VBS2022.",
                    "IVIST: Interactive Video Search Tool in VBS 2022.",
                    "VERGE in VBS 2022.",
                    "AVSeeker: An Active Video Retrieval Engine at VBS2022.",
                    "VISIONE at Video Browser Showdown 2022.",
                    "Reinforcement Learning-Based Interactive Video Search.",
                    "UIT at VBS 2022: An Unified and Interactive Video Retrieval System with Temporal Search.",
                    "V-FIRST: A Flexible Interactive Retrieval System for Video at VBS 2022.",
                    "diveXplore 6.0: ITEC's Interactive Video Exploration System at VBS 2022.",
                    "CDC: Color-Based Diffusion Model with Caption Embedding in VBS 2022.",
                    "ViRMA: Virtual Reality Multimedia Analytics at Video Browser Showdown 2022."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "27th MMM 2021",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2021-1",
                "sub_name": "MultiMedia Modeling - 27th International Conference, MMM 2021, Prague, Czech Republic, June 22-24, 2021, Proceedings, Part I.",
                "count": 58,
                "papers": [
                    "Crossed-Time Delay Neural Network for Speaker Recognition.",
                    "An Asymmetric Two-Sided Penalty Term for CT-GAN.",
                    "Fast Discrete Matrix Factorization Hashing for Large-Scale Cross-Modal Retrieval.",
                    "Fast Optimal Transport Artistic Style Transfer.",
                    "Stacked Sparse Autoencoder for Audio Object Coding.",
                    "A Collaborative Multi-modal Fusion Method Based on Random Variational Information Bottleneck for Gesture Recognition.",
                    "Frame Aggregation and Multi-modal Fusion Framework for Video-Based Person Recognition.",
                    "An Adaptive Face-Iris Multimodal Identification System Based on Quality Assessment Network.",
                    "Thermal Face Recognition Based on Multi-scale Image Synthesis.",
                    "Contrastive Learning in Frequency Domain for Non-I.I.D. Image Classification.",
                    "Group Activity Recognition by Exploiting Position Distribution and Appearance Relation.",
                    "Multi-branch and Multi-scale Attention Learning for Fine-Grained Visual Categorization.",
                    "Dense Attention-Guided Network for Boundary-Aware Salient Object Detection.",
                    "Generative Image Inpainting by Hybrid Contextual Attention Network.",
                    "Atypical Lyrics Completion Considering Musical Audio Signals.",
                    "Improving Supervised Cross-modal Retrieval with Semantic Graph Embedding.",
                    "Confidence-Based Global Attention Guided Network for Image Inpainting.",
                    "Multi-task Deep Learning for No-Reference Screen Content Image Quality Assessment.",
                    "Language Person Search with Pair-Based Weighting Loss.",
                    "DeepFusion: Deep Ensembles for Domain Independent System Fusion.",
                    "Illuminate Low-Light Image via Coarse-to-fine Multi-level Network.",
                    "MM-Net: Learning Adaptive Meta-metric for Few-Shot Biometric Recognition.",
                    "A Sentiment Similarity-Oriented Attention Model with Multi-task Learning for Text-Based Emotion Recognition.",
                    "Locating Visual Explanations for Video Question Answering.",
                    "Global Cognition and Local Perception Network for Blind Image Deblurring.",
                    "Multi-grained Fusion for Conditional Image Retrieval.",
                    "A Hybrid Music Recommendation Algorithm Based on Attention Mechanism.",
                    "Few-Shot Learning with Unlabeled Outlier Exposure.",
                    "Fine-Grained Video Deblurring with Event Camera.",
                    "Discriminative and Selective Pseudo-Labeling for Domain Adaptation.",
                    "Multi-level Gate Feature Aggregation with Spatially Adaptive Batch-Instance Normalization for Semantic Image Synthesis.",
                    "Robust Multispectral Pedestrian Detection via Uncertainty-Aware Cross-Modal Learning.",
                    "Time-Dependent Body Gesture Representation for Video Emotion Recognition.",
                    "MusiCoder: A Universal Music-Acoustic Encoder Based on Transformer.",
                    "DANet: Deformable Alignment Network for Video Inpainting.",
                    "Deep Centralized Cross-modal Retrieval.",
                    "Shot Boundary Detection Through Multi-stage Deep Convolution Neural Network.",
                    "Towards Optimal Multirate Encoding for HTTP Adaptive Streaming.",
                    "Fast Mode Decision Algorithm for Intra Encoding of the 3rd Generation Audio Video Coding Standard.",
                    "Graph Structure Reasoning Network for Face Alignment and Reconstruction.",
                    "Game Input with Delay - A Model of the Time Distribution for Selecting a Moving Target with a Mouse.",
                    "Unsupervised Temporal Attention Summarization Model for User Created Videos.",
                    "Learning from the Negativity: Deep Negative Correlation Meta-Learning for Adversarial Image Classification.",
                    "Learning 3D-Craft Generation with Predictive Action Neural Network.",
                    "Unsupervised Multi-shot Person Re-identification via Dynamic Bi-directional Normalized Sparse Representation.",
                    "Classifier Belief Optimization for Visual Categorization.",
                    "Fine-Grained Generation for Zero-Shot Learning.",
                    "Fine-Grained Image-Text Retrieval via Complementary Feature Learning.",
                    "Considering Human Perception and Memory in Interactive Multimedia Retrieval Evaluations.",
                    "Learning Multi-level Interaction Relations and Feature Representations for Group Activity Recognition.",
                    "A Structured Feature Learning Model for Clothing Keypoints Localization.",
                    "Automatic Pose Quality Assessment for Adaptive Human Pose Refinement.",
                    "Deep Attributed Network Embedding with Community Information.",
                    "An Acceleration Framework for Super-Resolution Network via Region Difficulty Self-adaption.",
                    "Spatial Gradient Guided Learning and Semantic Relation Transfer for Facial Landmark Detection.",
                    "DVRCNN: Dark Video Post-processing Method for VVC.",
                    "An Efficient Image Transmission Pipeline for Multimedia Services.",
                    "Gaussian Mixture Model Based Semi-supervised Sparse Representation for Face Recognition."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2021-2",
                "sub_name": "MultiMedia Modeling - 27th International Conference, MMM 2021, Prague, Czech Republic, June 22-24, 2021, Proceedings, Part II.",
                "count": 50,
                "papers": [
                    "MSCANet: Adaptive Multi-scale Context Aggregation Network for Congested Crowd Counting.",
                    "Tropical Cyclones Tracking Based on Satellite Cloud Images: Database and Comprehensive Study.",
                    "Image Registration Improved by Generative Adversarial Networks.",
                    "Deep 3D Modeling of Human Bodies from Freehand Sketching.",
                    "Two-Stage Real-Time Multi-object Tracking with Candidate Selection.",
                    "Tell as You Imagine: Sentence Imageability-Aware Image Captioning.",
                    "Deep Face Swapping via Cross-Identity Adversarial Training.",
                    "Res2-Unet: An Enhanced Network for Generalized Nuclear Segmentation in Pathological Images.",
                    "Automatic Diagnosis of Glaucoma on Color Fundus Images Using Adaptive Mask Deep Network.",
                    "Initialize with Mask: For More Efficient Federated Learning.",
                    "Unsupervised Gaze: Exploration of Geometric Constraints for 3D Gaze Estimation.",
                    "Median-Pooling Grad-CAM: An Efficient Inference Level Visual Explanation for CNN Networks in Remote Sensing Image Classification.",
                    "Multi-granularity Recurrent Attention Graph Neural Network for Few-Shot Learning.",
                    "EEG Emotion Recognition Based on Channel Attention for E-Healthcare Applications.",
                    "The MovieWall: A New Interface for Browsing Large Video Collections.",
                    "Keystroke Dynamics as Part of Lifelogging.",
                    "HTAD: A Home-Tasks Activities Dataset with Wrist-Accelerometer and Audio Features.",
                    "MNR-Air: An Economic and Dynamic Crowdsourcing Mechanism to Collect Personal Lifelog and Surrounding Environment Dataset. A Case Study in Ho Chi Minh City, Vietnam.",
                    "Kvasir-Instrument: Diagnostic and Therapeutic Tool Segmentation Dataset in Gastrointestinal Endoscopy.",
                    "CatMeows: A Publicly-Available Dataset of Cat Vocalizations.",
                    "Search and Explore Strategies for Interactive Analysis of Real-Life Image Collections with Unknown and Unique Categories.",
                    "Graph-Based Indexing and Retrieval of Lifelog Data.",
                    "On Fusion of Learned and Designed Features for Video Data Analytics.",
                    "XQM: Interactive Learning on Mobile Phones.",
                    "A Multimodal Tensor-Based Late Fusion Approach for Satellite Image Search in Sentinel 2 Images.",
                    "Canopy Height Estimation from Spaceborne Imagery Using Convolutional Encoder-Decoder.",
                    "Implementation of a Random Forest Classifier to Examine Wildfire Predictive Modelling in Greece Using Diachronically Collected Fire Occurrence and Fire Mapping Data.",
                    "Mobile eHealth Platform for Home Monitoring of Bipolar Disorder.",
                    "Multimodal Sensor Data Analysis for Detection of Risk Situations of Fragile People in @home Environments.",
                    "Towards the Development of a Trustworthy Chatbot for Mental Health Applications.",
                    "Fusion of Multimodal Sensor Data for Effective Human Action Recognition in the Service of Medical Platforms.",
                    "SpotifyGraph: Visualisation of User's Preferences in Music.",
                    "A System for Interactive Multimedia Retrieval Evaluations.",
                    "SQL-Like Interpretable Interactive Video Search.",
                    "VERGE in VBS 2021.",
                    "NoShot Video Browser at VBS2021.",
                    "Exquisitor at the Video Browser Showdown 2021: Relationships Between Semantic Classifiers.",
                    "VideoGraph - Towards Using Knowledge Graphs for Interactive Video Retrieval.",
                    "IVIST: Interactive Video Search Tool in VBS 2021.",
                    "Video Search with Collage Queries.",
                    "Towards Explainable Interactive Multi-modal Video Retrieval with Vitrivr.",
                    "Competitive Interactive Video Retrieval in Virtual Reality with vitrivr-VR.",
                    "An Interactive Video Search Tool: A Case Study Using the V3C1 Dataset.",
                    "Less is More - diveXplore 5.0 at VBS 2021.",
                    "SOMHunter V2 at Video Browser Showdown 2021.",
                    "W2VV++ BERT Model at VBS 2021.",
                    "VISIONE at Video Browser Showdown 2021.",
                    "IVOS - The ITEC Interactive Video Object Search System at VBS2021.",
                    "Video Search with Sub-Image Keyword Transfer Using Existing Image Archives.",
                    "A VR Interface for Browsing Visual Spaces at VBS2021."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th MMM 2020",
        "info": "Daejeon, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2020-1",
                "sub_name": "MultiMedia Modeling - 26th International Conference, MMM 2020, Daejeon, South Korea, January 5-8, 2020, Proceedings, Part I.",
                "count": 67,
                "papers": [
                    "Light Field Reconstruction Using Dynamically Generated Filters.",
                    "Speaker-Aware Speech Emotion Recognition by Fusing Amplitude and Phase Information.",
                    "Gen-Res-Net: A Novel Generative Model for Singing Voice Separation.",
                    "A Distinct Synthesizer Convolutional TasNet for Singing Voice Separation.",
                    "Exploiting the Importance of Personalization When Selecting Music for Relaxation.",
                    "An Efficient Encoding Method for Video Compositing in HEVC.",
                    "VHS to HDTV Video Translation Using Multi-task Adversarial Learning.",
                    "Improving Just Noticeable Difference Model by Leveraging Temporal HVS Perception Characteristics.",
                    "Down-Sampling Based Video Coding with Degradation-Aware Restoration-Reconstruction Deep Neural Network.",
                    "Beyond Literal Visual Modeling: Understanding Image Metaphor Based on Literal-Implied Concept Mapping.",
                    "Deep Palette-Based Color Decomposition for Image Recoloring with Aesthetic Suggestion.",
                    "On Creating Multimedia Interfaces for Hybrid Biological-Digital Art Installations.",
                    "Image Captioning Based on Visual and Semantic Attention.",
                    "An Illumination Insensitive and Structure-Aware Image Color Layer Decomposition Method.",
                    "CartoonRenderer: An Instance-Based Multi-style Cartoon Image Translator.",
                    "Multi-condition Place Generator for Robust Place Recognition.",
                    "Guided Refine-Head for Object Detection.",
                    "Towards Accurate Panel Detection in Manga: A Combined Effort of CNN and Heuristics.",
                    "Subclass Deep Neural Networks: Re-enabling Neglected Classes in Deep Network Training for Multimedia Classification.",
                    "Automatic Material Classification Using Thermal Finger Impression.",
                    "Face Attributes Recognition Based on One-Way Inferential Correlation Between Attributes.",
                    "Eulerian Motion Based 3DCNN Architecture for Facial Micro-Expression Recognition.",
                    "Emotion Recognition with Facial Landmark Heatmaps.",
                    "One-Shot Face Recognition with Feature Rectification via Adversarial Learning.",
                    "Visual Sentiment Analysis by Leveraging Local Regions and Human Faces.",
                    "Prediction-Error Value Ordering for High-Fidelity Reversible Data Hiding.",
                    "Classroom Attention Analysis Based on Multiple Euler Angles Constraint and Head Pose Estimation.",
                    "Multi-branch Body Region Alignment Network for Person Re-identification.",
                    "DeepStroke: Understanding Glyph Structure with Semantic Segmentation and Tabu Search.",
                    "3D Spatial Coverage Measurement of Aerial Images.",
                    "Instance Image Retrieval with Generative Adversarial Training.",
                    "An Effective Way to Boost Black-Box Adversarial Attack.",
                    "Crowd Knowledge Enhanced Multimodal Conversational Assistant in Travel Domain.",
                    "Improved Model Structure with Cosine Margin OIM Loss for End-to-End Person Search.",
                    "Effective Barcode Hunter via Semantic Segmentation in the Wild.",
                    "Wonderful Clips of Playing Basketball: A Database for Localizing Wonderful Actions.",
                    "Structural Pyramid Network for Cascaded Optical Flow Estimation.",
                    "Real-Time Multiple Pedestrians Tracking in Multi-camera System.",
                    "Learning Multi-feature Based Spatially Regularized and Scale Adaptive Correlation Filters for Visual Tracking.",
                    "Unsupervised Video Summarization via Attention-Driven Adversarial Learning.",
                    "Efficient HEVC Downscale Transcoding Based on Coding Unit Information Mapping.",
                    "Fine-Grain Level Sports Video Search Engine.",
                    "The Korean Sign Language Dataset for Action Recognition.",
                    "SEE-LPR: A Semantic Segmentation Based End-to-End System for Unconstrained License Plate Detection and Recognition.",
                    "Action Co-localization in an Untrimmed Video by Graph Neural Networks.",
                    "A Novel Attention Enhanced Dense Network for Image Super-Resolution.",
                    "Marine Biometric Recognition Algorithm Based on YOLOv3-GAN Network.",
                    "Multi-scale Spatial Location Preference for Semantic Segmentation.",
                    "HRTF Representation with Convolutional Auto-encoder.",
                    "Unsupervised Feature Propagation for Fast Video Object Detection Using Generative Adversarial Networks.",
                    "OmniEyes: Analysis and Synthesis of Artistically Painted Eyes.",
                    "LDSNE: Learning Structural Network Embeddings by Encoding Local Distances.",
                    "FurcaNeXt: End-to-End Monaural Speech Separation with Dynamic Gated Dilated Temporal Convolutional Networks.",
                    "Multi-step Coding Structure of Spatial Audio Object Coding.",
                    "Thermal Face Recognition Based on Transformation by Residual U-Net and Pixel Shuffle Upsampling.",
                    "K-SVD Based Point Cloud Coding for RGB-D Video Compression Using 3D Super-Point Clustering.",
                    "Resolution Booster: Global Structure Preserving Stitching Method for Ultra-High Resolution Image Translation.",
                    "Cross Fusion for Egocentric Interactive Action Recognition.",
                    "Improving Brain Tumor Segmentation with Dilated Pseudo-3D Convolution and Multi-direction Fusion.",
                    "Texture-Based Fast CU Size Decision and Intra Mode Decision Algorithm for VVC.",
                    "An Efficient Hierarchical Near-Duplicate Video Detection Algorithm Based on Deep Semantic Features.",
                    "Meta Transfer Learning for Adaptive Vehicle Tracking in UAV Videos.",
                    "Adversarial Query-by-Image Video Retrieval Based on Attention Mechanism.",
                    "Joint Sketch-Attribute Learning for Fine-Grained Face Synthesis.",
                    "High Accuracy Perceptual Video Hashing via Low-Rank Decomposition and DWT.",
                    "HMM-Based Person Re-identification in Large-Scale Open Scenario.",
                    "No Reference Image Quality Assessment by Information Decomposition."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2020-2",
                "sub_name": "MultiMedia Modeling - 26th International Conference, MMM 2020, Daejeon, South Korea, January 5-8, 2020, Proceedings, Part II.",
                "count": 74,
                "papers": [
                    "Multi-scale Comparison Network for Few-Shot Learning.",
                    "Semantic and Morphological Information Guided Chinese Text Classification.",
                    "A Delay-Aware Adaptation Framework for Cloud Gaming Under the Computation Constraint of User Devices.",
                    "Efficient Edge Caching for High-Quality 360-Degree Video Delivery.",
                    "Inferring Emphasis for Real Voice Data: An Attentive Multimodal Neural Network Approach.",
                    "PRIME: Block-Wise Missingness Handling for Multi-modalities in Intelligent Tutoring Systems.",
                    "A New Local Transformation Module for Few-Shot Segmentation.",
                    "Background Segmentation for Vehicle Re-identification.",
                    "Face Tells Detailed Expression: Generating Comprehensive Facial Expression Sentence Through Facial Action Units.",
                    "A Deep Convolutional Deblurring and Detection Neural Network for Localizing Text in Videos.",
                    "Generate Images with Obfuscated Attributes for Private Image Classification.",
                    "Context-Aware Residual Network with Promotion Gates for Single Image Super-Resolution.",
                    "A Compact Deep Neural Network for Single Image Super-Resolution.",
                    "An Efficient Algorithm of Facial Expression Recognition by TSG-RNN Network.",
                    "Structured Neural Motifs: Scene Graph Parsing via Enhanced Context.",
                    "Perceptual Localization of Virtual Sound Source Based on Loudspeaker Triplet.",
                    "TK-Text: Multi-shaped Scene Text Detection via Instance Segmentation.",
                    "More-Natural Mimetic Words Generation for Fine-Grained Gait Description.",
                    "Lite Hourglass Network for Multi-person Pose Estimation.",
                    "Single View Depth Estimation via Dense Convolution Network with Self-supervision.",
                    "Multi-data UAV Images for Large Scale Reconstruction of Buildings.",
                    "Deformed Phase Prediction Using SVM for Structured Light Depth Generation.",
                    "Extraction of Multi-class Multi-instance Geometric Primitives from Point Clouds Using Energy Minimization.",
                    "Similarity Graph Convolutional Construction Network for Interactive Action Recognition.",
                    "Content-Aware Cubemap Projection for Panoramic Image via Deep Q-Learning.",
                    "Robust RGB-D Data Registration Based on Correntropy and Bi-directional Distance.",
                    "InSphereNet: A Concise Representation and Classification Method for 3D Object.",
                    "3-D Oral Shape Retrieval Using Registration Algorithm.",
                    "Face Super-Resolution by Learning Multi-view Texture Compensation.",
                    "Light Field Salient Object Detection via Hybrid Priors.",
                    "Multimedia Analytics Challenges and Opportunities for Creating Interactive Radio Content.",
                    "Interactive Search and Exploration in Discussion Forums Using Multimodal Embeddings.",
                    "An Inverse Mapping with Manifold Alignment for Zero-Shot Learning.",
                    "Baseline Analysis of a Conventional and Virtual Reality Lifelog Retrieval System.",
                    "An Extensible Framework for Interactive Real-Time Visualizations of Large-Scale Heterogeneous Multimedia Information from Online Sources.",
                    "GLENDA: Gynecologic Laparoscopy Endometriosis Dataset.",
                    "Kvasir-SEG: A Segmented Polyp Dataset.",
                    "Rethinking the Test Collection Methodology for Personal Self-tracking Data.",
                    "Experiences and Insights from the Collection of a Novel Multimedia EEG Dataset.",
                    "Relation Modeling with Graph Convolutional Networks for Facial Action Unit Detection.",
                    "Enhanced Gaze Following via Object Detection and Human Pose Estimation.",
                    "Region Based Adversarial Synthesis of Facial Action Units.",
                    "Facial Expression Restoration Based on Improved Graph Convolutional Networks.",
                    "Global Affective Video Content Regression Based on Complementary Audio-Visual Features.",
                    "Studying Public Medical Images from the Open Access Literature and Social Networks for Model Training and Knowledge Extraction.",
                    "AttenNet: Deep Attention Based Retinal Disease Classification in OCT Images.",
                    "NOVA: A Tool for Explanatory Multimodal Behavior Analysis and Its Application to Psychotherapy.",
                    "Instrument Recognition in Laparoscopy for Technical Skill Assessment.",
                    "Real-Time Recognition of Daily Actions Based on 3D Joint Movements and Fisher Encoding.",
                    "Model-Based and Class-Based Fusion of Multisensor Data.",
                    "Evaluating the Generalization Performance of Instrument Classification in Cataract Surgery Videos.",
                    "Compact Position-Aware Attention Network for Image Semantic Segmentation.",
                    "Law Is Order: Protecting Multimedia Network Transmission by Game Theory and Mechanism Design.",
                    "Rational Delegation Computing Using Information Theory and Game Theory Approach.",
                    "Multi-hop Interactive Cross-Modal Retrieval.",
                    "Browsing Visual Sentiment Datasets Using Psycholinguistic Groundings.",
                    "Framework Design for Multiplayer Motion Sensing Game in Mixture Reality.",
                    "Lyrics-Conditioned Neural Melody Generation.",
                    "A Web-Based Visualization Tool for 3D Spatial Coverage Measurement of Aerial Images.",
                    "An Attention Based Speaker-Independent Audio-Visual Deep Learning Model for Speech Enhancement.",
                    "DIME: An Online Tool for the Visual Comparison of Cross-modal Retrieval Models.",
                    "Real-Time Demonstration of Personal Audio and 3D Audio Rendering Using Line Array Systems.",
                    "A CNN-Based Multi-scale Super-Resolution Architecture on FPGA for 4K/8K UHD Applications.",
                    "Effective Utilization of Hybrid Residual Modules in Deep Neural Networks for Super Resolution.",
                    "diveXplore 4.0: The ITEC Deep Interactive Video Exploration System at VBS2020.",
                    "Combining Boolean and Multimedia Retrieval in vitrivr for Large-Scale Video Search.",
                    "An Interactive Video Search Platform for Multi-modal Retrieval with Advanced Concepts.",
                    "VIREO @ Video Browser Showdown 2020.",
                    "VERGE in VBS 2020.",
                    "VIRET at Video Browser Showdown 2020.",
                    "SOM-Hunter: Video Browsing with Relevance-to-SOM Feedback Loop.",
                    "Exquisitor at the Video Browser Showdown 2020.",
                    "Deep Learning-Based Video Retrieval Using Object Relationships and Associated Audio Classes.",
                    "IVIST: Interactive VIdeo Search Tool in VBS 2020."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th MMM 2019",
        "info": "Thessaloniki, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2019-1",
                "sub_name": "MultiMedia Modeling - 25th International Conference, MMM 2019, Thessaloniki, Greece, January 8-11, 2019, Proceedings, Part I.",
                "count": 58,
                "papers": [
                    "Sentiment-Aware Multi-modal Recommendation on Tourist Attractions.",
                    "SCOD: Dynamical Spatial Constraints for Object Detection.",
                    "STMP: Spatial Temporal Multi-level Proposal Network for Activity Detection.",
                    "Hierarchical Vision-Language Alignment for Video Captioning.",
                    "Task-Driven Biometric Authentication of Users in Virtual Reality (VR) Environments.",
                    "Deep Neural Network Based 3D Articulatory Movement Prediction Using Both Text and Audio Inputs.",
                    "Subjective Visual Quality Assessment of Immersive 3D Media Compressed by Open-Source Static 3D Mesh Codecs.",
                    "Joint EPC and RAN Caching of Tiled VR Videos for Mobile Networks.",
                    "Foveated Ray Tracing for VR Headsets.",
                    "Preferred Model of Adaptation to Dark for Virtual Reality Headsets.",
                    "From Movement to Events: Improving Soccer Match Annotations.",
                    "Multimodal Video Annotation for Retrieval and Discovery of Newsworthy Video in a News Verification Scenario.",
                    "Integration of Exploration and Search: A Case Study of the M ^3 3 Model.",
                    "Face Swapping for Solving Collateral Privacy Issues in Multimedia Analytics.",
                    "Exploring the Impact of Training Data Bias on Automatic Generation of Video Captions.",
                    "Fashion Police: Towards Semantic Indexing of Clothing Information in Surveillance Data.",
                    "CNN-Based Non-contact Detection of Food Level in Bottles from RGB Images.",
                    "Personalized Recommendation of Photography Based on Deep Learning.",
                    "Two-Level Attention with Multi-task Learning for Facial Emotion Estimation.",
                    "User Interaction for Visual Lifelog Retrieval in a Virtual Environment.",
                    "Query-by-Dancing: A Dance Music Retrieval System Based on Body-Motion Similarity.",
                    "Joint Visual-Textual Sentiment Analysis Based on Cross-Modality Attention Mechanism.",
                    "Deep Hashing with Triplet Labels and Unification Binary Code Selection for Fast Image Retrieval.",
                    "Incremental Training for Face Recognition.",
                    "Character Prediction in TV Series via a Semantic Projection Network.",
                    "A Test Collection for Interactive Lifelog Retrieval.",
                    "SEPHLA: Challenges and Opportunities Within Environment - Personal Health Archives.",
                    "Athens Urban Soundscape (ATHUS): A Dataset for Urban Soundscape Quality Recognition.",
                    "V3C - A Research Video Collection.",
                    "Image Aesthetics Assessment Using Fully Convolutional Neural Networks.",
                    "Detecting Tampered Videos with Multimedia Forensics and Deep Learning.",
                    "Improving Robustness of Image Tampering Detection for Compression.",
                    "Audiovisual Annotation Procedure for Multi-view Field Recordings.",
                    "A Robust Multi-Athlete Tracking Algorithm by Exploiting Discriminant Features and Long-Term Dependencies.",
                    "Early Identification of Oil Spills in Satellite Images Using Deep CNNs.",
                    "Point Cloud Colorization Based on Densely Annotated 3D Shape Dataset.",
                    "evolve2vec: Learning Network Representations Using Temporal Unfolding.",
                    "The Impact of Packet Loss and Google Congestion Control on QoE for WebRTC-Based Mobile Multiparty Audiovisual Telemeetings.",
                    "Hierarchical Temporal Pooling for Efficient Online Action Recognition.",
                    "Generative Adversarial Networks with Enhanced Symmetric Residual Units for Single Image Super-Resolution.",
                    "3D ResNets for 3D Object Classification.",
                    "Four Models for Automatic Recognition of Left and Right Eye in Fundus Images.",
                    "On the Unsolved Problem of Shot Boundary Detection for Music Videos.",
                    "Enhancing Scene Text Detection via Fused Semantic Segmentation Network with Attention.",
                    "Exploiting Incidence Relation Between Subgroups for Improving Clustering-Based Recommendation Model.",
                    "Hierarchical Bayesian Network Based Incremental Model for Flood Prediction.",
                    "A New Female Body Segmentation and Feature Localisation Method for Image-Based Anthropometry.",
                    "Greedy Salient Dictionary Learning for Activity Video Summarization.",
                    "Accelerating Topic Detection on Web for a Large-Scale Data Set via Stochastic Poisson Deconvolution.",
                    "Automatic Segmentation of Brain Tumor Image Based on Region Growing with Co-constraint.",
                    "Proposal of an Annotation Method for Integrating Musical Technique Knowledge Using a GTTM Time-Span Tree.",
                    "A Hierarchical Level Set Approach to for RGBD Image Matting.",
                    "A Genetic Programming Approach to Integrate Multilayer CNN Features for Image Classification.",
                    "Improving Micro-expression Recognition Accuracy Using Twofold Feature Extraction.",
                    "An Effective Dual-Fisheye Lens Stitching Method Based on Feature Points.",
                    "3D Skeletal Gesture Recognition via Sparse Coding of Time-Warping Invariant Riemannian Trajectories.",
                    "Efficient Graph Based Multi-view Learning.",
                    "DANTE Speaker Recognition Module. An Efficient and Robust Automatic Speaker Searching Solution for Terrorism-Related Scenarios."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2019-2",
                "sub_name": "MultiMedia Modeling - 25th International Conference, MMM 2019, Thessaloniki, Greece, January 8-11, 2019, Proceedings, Part II.",
                "count": 61,
                "papers": [
                    "Photo-Realistic Facial Emotion Synthesis Using Multi-level Critic Networks with Multi-level Generative Model.",
                    "Adaptive Alignment Network for Person Re-identification.",
                    "Visual Urban Perception with Deep Semantic-Aware Network.",
                    "Deep Reinforcement Learning for Automatic Thumbnail Generation.",
                    "3D Object Completion via Class-Conditional Generative Adversarial Network.",
                    "Video Summarization with LSTM and Deep Attention Models.",
                    "Challenges in Audio Processing of Terrorist-Related Data.",
                    "Identifying Terrorism-Related Key Actors in Multidimensional Social Networks.",
                    "Large Scale Audio-Visual Video Analytics Platform for Forensic Investigations of Terroristic Attacks.",
                    "A Semantic Knowledge Discovery Framework for Detecting Online Terrorist Networks.",
                    "A Reliability Object Layer for Deep Hashing-Based Visual Indexing.",
                    "Spectral Tilt Estimation for Speech Intelligibility Enhancement Using RNN Based on All-Pole Model.",
                    "Multi-channel Convolutional Neural Networks with Multi-level Feature Fusion for Environmental Sound Classification.",
                    "Audio-Based Automatic Generation of a Piano Reduction Score by Considering the Musical Structure.",
                    "Violin Timbre Navigator: Real-Time Visual Feedback of Violin Bowing Based on Audio Analysis and Machine Learning.",
                    "The Representation of Speech in Deep Neural Networks.",
                    "Realtime Human Segmentation in Video.",
                    "psDirector: An Automatic Director for Watching View Generation from Panoramic Soccer Video.",
                    "No-Reference Video Quality Assessment Based on Ensemble of Knowledge and Data-Driven Models.",
                    "Understanding Intonation Trajectories and Patterns of Vocal Notes.",
                    "Temporal Lecture Video Fragmentation Using Word Embeddings.",
                    "Using Coarse Label Constraint for Fine-Grained Visual Classification.",
                    "Gated Recurrent Capsules for Visual Word Embeddings.",
                    "An Automatic System for Generating Artificial Fake Character Images.",
                    "Person Re-Identification Based on Pose-Aware Segmentation.",
                    "Neuropsychiatric Disorders Identification Using Convolutional Neural Network.",
                    "Semantic Map Annotation Through UAV Video Analysis Using Deep Learning Models in ROS.",
                    "Temporal Action Localization Based on Temporal Evolution Model and Multiple Instance Learning.",
                    "Near-Duplicate Video Retrieval Through Toeplitz Kernel Partial Least Squares.",
                    "Action Recognition Using Visual Attention with Reinforcement Learning.",
                    "Soccer Video Event Detection Based on Deep Learning.",
                    "Spatio-Temporal Attention Model Based on Multi-view for Social Relation Understanding.",
                    "Detail-Preserving Trajectory Summarization Based on Segmentation and Group-Based Filtering.",
                    "Single-Stage Detector with Semantic Attention for Occluded Pedestrian Detection.",
                    "Poses Guide Spatiotemporal Model for Vehicle Re-identification.",
                    "Alignment of Deep Features in 3D Models for Camera Pose Estimation.",
                    "Regular and Small Target Detection.",
                    "From Classical to Generalized Zero-Shot Learning: A Simple Adaptation Process.",
                    "Bag of Deep Features for Instructor Activity Recognition in Lecture Room.",
                    "A New Hybrid Architecture for Human Activity Recognition from RGB-D Videos.",
                    "Utilizing Deep Object Detector for Video Surveillance Indexing and Retrieval.",
                    "Deep Recurrent Neural Network for Multi-target Filtering.",
                    "Adversarial Training for Video Disentangled Representation.",
                    "A Method for Enriching Video-Watching Experience with Applied Effects Based on Eye Movements.",
                    "Fontender: Interactive Japanese Text Design with Dynamic Font Fusion Method for Comics.",
                    "Training Researchers with the MOVING Platform.",
                    "Space Wars: An AugmentedVR Game.",
                    "ECAT - Endoscopic Concept Annotation Tool.",
                    "Automatic Classification and Linguistic Analysis of Extremist Online Material.",
                    "Autopiloting Feature Maps: The Deep Interactive Video Exploration (diveXplore) System at VBS2019.",
                    "VISIONE at VBS2019.",
                    "VIRET Tool Meets NasNet.",
                    "VERGE in VBS 2019.",
                    "VIREO @ Video Browser Showdown 2019.",
                    "Deep Learning-Based Concept Detection in vitrivr.",
                    "Structure Analysis on Common Plot in Four-Scene Comic Story Dataset.",
                    "Multi-task Model for Comic Book Image Analysis.",
                    "Estimating Comic Content from the Book Cover Information Using Fine-Tuned VGG Model for Comic Search.",
                    "How Good Is Good Enough? Establishing Quality Thresholds for the Automatic Text Analysis of Retro-Digitized Comics.",
                    "Comic Text Detection Using Neural Network Approach.",
                    "CNN-Based Classification of Illustrator Style in Graphic Novels: Which Features Contribute Most?"
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th MM 2018",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2018-1",
                "sub_name": "MultiMedia Modeling - 24th International Conference, MMM 2018, Bangkok, Thailand, February 5-7, 2018, Proceedings, Part I.",
                "count": 51,
                "papers": [
                    "A Markov Network Based Passage Retrieval Method for Multimodal Question Answering in the Cultural Heritage Domain.",
                    "A Method of Weather Radar Echo Extrapolation Based on Convolutional Neural Networks.",
                    "A Motion-Driven Approach for Fine-Grained Temporal Segmentation of User-Generated Videos.",
                    "A Novel 3D Human Action Recognition Framework for Video Content Analysis.",
                    "Adaptive Image Representation Using Information Gain and Saliency: Application to Cultural Heritage Datasets.",
                    "AGO: Accelerating Global Optimization for Accurate Stereo Matching.",
                    "An RNN-Based Speech-Music Discrimination Used for Hybrid Audio Coder.",
                    "Co-occurrent Structural Edge Detection for Color-Guided Depth Map Super-Resolution.",
                    "Collision-Free LSTM for Human Trajectory Prediction.",
                    "Convolution with Logarithmic Filter Groups for Efficient Shallow CNN.",
                    "Cost-Sensitive Deep Metric Learning for Fine-Grained Image Classification.",
                    "Crowd Distribution Estimation with Multi-scale Recursive Convolutional Neural Network.",
                    "Deep Convolutional Neural Network for Correlating Images and Sentences.",
                    "Deep Pedestrian Detection Using Contextual Information and Multi-level Features.",
                    "Dual-Way Guided Depth Image Inpainting with RGBD Image Pairs.",
                    "Efficient and Interactive Spatial-Semantic Image Retrieval.",
                    "Evaluation of Visual Content Descriptors for Supporting Ad-Hoc Video Search Tasks at the Video Browser Showdown.",
                    "Find Me a Sky: A Data-Driven Method for Color-Consistent Sky Search and Replacement.",
                    "Font Recognition in Natural Images via Transfer Learning.",
                    "Frame-Based Classification of Operation Phases in Cataract Surgery Videos.",
                    "High-Precision 3D Coarse Registration Using RANSAC and Randomly-Picked Rejections.",
                    "Image Aesthetic Distribution Prediction with Fully Convolutional Network.",
                    "Improving the Quality of Video-to-Language Models by Optimizing Annotation of the Training Material.",
                    "Iterative Active Classification of Large Image Collection.",
                    "Learning to Index in Large-Scale Datasets.",
                    "Light Field Foreground Matting Based on Defocus and Correspondence.",
                    "LOCO: Local Context Based Faster R-CNN for Small Traffic Sign Detection.",
                    "Multi-hypothesis-Based Error Concealment for Whole Frame Loss in HEVC.",
                    "Multi-stream Fusion Model for Social Relation Recognition from Videos.",
                    "Multimodal Augmented Reality - Augmenting Auditory-Tactile Feedback to Change the Perception of Thickness.",
                    "Parameter Selection for Denoising Algorithms Using NR-IQA with CNN.",
                    "Real-Time Polyps Segmentation for Colonoscopy Video Frames Using Compressed Fully Convolutional Network.",
                    "Recursive Pyramid Network with Joint Attention for Cross-Media Retrieval.",
                    "Reinforcing Pedestrian Parsing on Small Scale Dataset.",
                    "Remote Sensing Image Fusion Based on Two-Stream Fusion Network.",
                    "REVT: Robust and Efficient Visual Tracking by Region-Convolutional Regression Network.",
                    "Shallow-Water Image Enhancement Using Relative Global Histogram Stretching Based on Adaptive Parameter Acquisition.",
                    "Spatiotemporal 3D Models of Aging Fruit from Multi-view Time-Lapse Videos.",
                    "Stitch-Based Image Stylization for Thread Art Using Sparse Modeling.",
                    "Teacher and Student Joint Learning for Compact Facial Landmark Detection Network.",
                    "Text Image Deblurring via Intensity Extremums Prior.",
                    "The CAMETRON Lecture Recording System: High Quality Video Recording and Editing with Minimal Human Supervision.",
                    "Towards Demographic-Based Photographic Aesthetics Prediction for Portraitures.",
                    "Triplet Convolutional Network for Music Version Identification.",
                    "Two-Level Segment-Based Bitrate Control for Live ABR Streaming.",
                    "Uyghur Text Localization with Fast Component Detection.",
                    "Approaches for Event Segmentation of Visual Lifelog Data.",
                    "Category Specific Post Popularity Prediction.",
                    "Image Aesthetics and Content in Selecting Memorable Keyframes from Lifelogs.",
                    "On the Traceability of Results from Deep Learning-Based Cloud Services.",
                    "Rethinking Summarization and Storytelling for Modern Social Multimedia."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2018-2",
                "sub_name": "MultiMedia Modeling - 24th International Conference, MMM 2018, Bangkok, Thailand, February 5-7, 2018, Proceedings, Part II.",
                "count": 49,
                "papers": [
                    "A New Accurate Image Denoising Method Based on Sparse Coding Coefficients.",
                    "A Novel Frontal Facial Synthesis Algorithm Based on Individual Residual Face.",
                    "A Text Recognition and Retrieval System for e-Business Image Management.",
                    "Accurate Detection for Scene Texts with a Cascaded CNN Networks.",
                    "Cloud of Line Distribution and Random Forest Based Text Detection from Natural/Video Scene Images.",
                    "CNN-Based DCT-Like Transform for Image Compression.",
                    "Coarse-to-Fine Image Super-Resolution Using Convolutional Neural Networks.",
                    "Data Augmentation for EEG-Based Emotion Recognition with Deep Convolutional Neural Networks.",
                    "Domain Invariant Subspace Learning for Cross-Modal Retrieval.",
                    "Effective Action Detection Using Temporal Context and Posterior Probability of Length.",
                    "Efficient Two-Layer Model Towards Cover Song Identification.",
                    "Food Photo Recognition for Dietary Tracking: System and Experiment.",
                    "Fusion Networks for Air-Writing Recognition.",
                    "Global and Local C3D Ensemble System for First Person Interactive Action Recognition.",
                    "Implicit Affective Video Tagging Using Pupillary Response.",
                    "k-Labelsets for Multimedia Classification with Global and Local Label Correlation.",
                    "LVFS: A Lightweight Video Storage File System for IP Camera-Based Surveillance Applications.",
                    "Person Re-id by Incorporating PCA Loss in CNN.",
                    "Robust and Real-Time Visual Tracking Based on Complementary Learners.",
                    "Room Floor Plan Generation on a Project Tango Device.",
                    "Scalable Bag of Selected Deep Features for Visual Instance Retrieval.",
                    "SeqSense: Video Recommendation Using Topic Sequence Mining.",
                    "ShapeCreator: 3D Shape Generation from Isomorphic Datasets Based on Autoencoder.",
                    "Source Distortion Estimation for Wyner-Ziv Distributed Video Coding.",
                    "SRN: The Movie Character Relationship Analysis via Social Network.",
                    "The Long Tail of Web Video.",
                    "Vehicle Semantics Extraction and Retrieval for Long-Term Carpark Video Surveillance.",
                    "Venue Prediction for Social Images by Exploiting Rich Temporal Patterns in LBSNs.",
                    "A Virtual Reality Interface for Interactions with Spatiotemporal 3D Data.",
                    "ActionVis: An Explorative Tool to Visualize Surgical Actions in Gynecologic Laparoscopy.",
                    "AR DeepCalorieCam: An iOS App for Food Calorie Estimation with Augmented Reality.",
                    "Auto Accessory Segmentation and Interactive Try-on System.",
                    "Automatic Smoke Classification in Endoscopic Video.",
                    "Depth Representation of LiDAR Point Cloud with Adaptive Surface Patching for Object Classification.",
                    "ImageX - Explore and Search Local/Private Images.",
                    "Lifelog Exploration Prototype in Virtual Reality.",
                    "Multi-camera Microenvironment to Capture Multi-view Time-Lapse Videos for 3D Analysis of Aging Objects.",
                    "Ontlus: 3D Content Collaborative Creation via Virtual Reality.",
                    "Programmatic 3D Printing of a Revolving Camera Track to Automatically Capture Dense Images for 3D Scanning of Objects.",
                    "Video Browsing on a Circular Timeline.",
                    "Competitive Video Retrieval with vitrivr.",
                    "Enhanced VIREO KIS at VBS 2018.",
                    "Fusing Keyword Search and Visual Exploration for Untagged Videos.",
                    "Revisiting SIRET Video Retrieval Tool.",
                    "Sketch-Based Similarity Search for Collaborative Feature Maps.",
                    "Sloth Search System.",
                    "The ITEC Collaborative Video Search System at the Video Browser Showdown 2018.",
                    "VERGE in VBS 2018.",
                    "Video Search Based on Semantic Extraction and Locally Regional Object Proposal."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd MMM 2017",
        "info": "Reykjavik, Iceland",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2017-1",
                "sub_name": "MultiMedia Modeling - 23rd International Conference, MMM 2017, Reykjavik, Iceland, January 4-6, 2017, Proceedings, Part I.",
                "count": 59,
                "papers": [
                    "3D Sound Field Reproduction at Non Central Point for NHK 22.2 System.",
                    "A Comparison of Approaches for Automated Text Extraction from Scholarly Figures.",
                    "A Convolutional Neural Network Approach for Post-Processing in HEVC Intra Coding.",
                    "A Framework of Privacy-Preserving Image Recognition for Image-Based Information Services.",
                    "A Real-Time 3D Visual Singing Synthesis: From Appearance to Internal Articulators.",
                    "A Structural Coupled-Layer Tracking Method Based on Correlation Filters.",
                    "Augmented Telemedicine Platform for Real-Time Remote Medical Consultation.",
                    "Color Consistency for Photo Collections Without Gamut Problems.",
                    "Comparison of Fine-Tuning and Extension Strategies for Deep Convolutional Neural Networks.",
                    "Describing Geographical Characteristics with Social Images.",
                    "Fine-Grained Image Recognition from Click-Through Logs Using Deep Siamese Network.",
                    "Fully Convolutional Network with Superpixel Parsing for Fashion Web Image Segmentation.",
                    "Graph-Based Multimodal Music Mood Classification in Discriminative Latent Space.",
                    "Joint Face Detection and Initialization for Face Alignment.",
                    "Large-Scale Product Classification via Spatial Attention Based CNN Learning and Multi-class Regression.",
                    "Learning Features Robust to Image Variations with Siamese Networks for Facial Expression Recognition.",
                    "M3LH: Multi-modal Multi-label Hashing for Large Scale Data Search.",
                    "Model-Based 3D Scene Reconstruction Using a Moving RGB-D Camera.",
                    "Modeling User Performance for Moving Target Selection with a Delayed Mouse.",
                    "Multi-attribute Based Fire Detection in Diverse Surveillance Videos.",
                    "Near-Duplicate Video Retrieval by Aggregating Intermediate CNN Layers.",
                    "No-Reference Image Quality Assessment Based on Internal Generative Mechanism.",
                    "On the Exploration of Convolutional Fusion Networks for Visual Recognition.",
                    "Phase Fourier Reconstruction for Anomaly Detection on Metal Surface Using Salient Irregularity.",
                    "ReMagicMirror: Action Learning Using Human Reenactment with the Mirror Metaphor.",
                    "Robust Image Classification via Low-Rank Double Dictionary Learning.",
                    "Robust Scene Text Detection for Multi-script Languages Using Deep Learning.",
                    "Robust Visual Tracking Based on Multi-channel Compressive Features.",
                    "Single Image Super-Resolution with a Parameter Economic Residual-Like Convolutional Neural Network.",
                    "Spatio-Temporal VLAD Encoding for Human Action Recognition in Videos.",
                    "Structure-Aware Image Resizing for Chinese Characters.",
                    "Supervised Class Graph Preserving Hashing for Image Retrieval and Classification.",
                    "Visual Robotic Object Grasping Through Combining RGB-D Data and 3D Meshes.",
                    "What Convnets Make for Image Captioning?",
                    "What are Good Design Gestures? - -Towards User- and Machine-friendly Interface-.",
                    "Collaborative Dictionary Learning and Soft Assignment for Sparse Coding of Image Features.",
                    "LingoSent - A Platform for Linguistic Aware Sentiment Analysis for Social Media Messages.",
                    "Multi-Task Multi-modal Semantic Hashing for Web Image Retrieval with Limited Supervision.",
                    "Object-Based Aggregation of Deep Features for Image Retrieval.",
                    "Uyghur Language Text Detection in Complex Background Images Using Enhanced MSERs.",
                    "CELoF: WiFi Dwell Time Estimation in Free Environment.",
                    "Demographic Attribute Inference from Social Multimedia Behaviors: A Cross-OSN Approach.",
                    "Understanding Performance of Edge Prefetching.",
                    "User Identification by Observing Interactions with GUIs.",
                    "Utilizing Locality-Sensitive Hash Learning for Cross-Media Retrieval.",
                    "A Sensor-Based Official Basketball Referee Signals Recognition System Using Deep Belief Networks.",
                    "Compact CNN Based Video Representation for Efficient Video Copy Detection.",
                    "Cross-Modal Recipe Retrieval: How to Cook this Dish?",
                    "Deep Learning Based Intelligent Basketball Arena with Energy Image.",
                    "Efficient Multi-scale Plane Extraction Based RGBD Video Segmentation.",
                    "Human Pose Tracking Using Online Latent Structured Support Vector Machine.",
                    "Micro-Expression Recognition by Aggregating Local Spatio-Temporal Patterns.",
                    "egoPortray: Visual Exploration of Mobile Communication Signature from Egocentric Network Perspective.",
                    "i-Stylist: Finding the Right Dress Through Your Social Networks.",
                    "Boredom Recognition Based on Users' Spontaneous Behaviors in Multiparty Human-Robot Interactions.",
                    "Classification of sMRI for AD Diagnosis with Convolutional Neuronal Networks: A Pilot 2-D+ \\epsilon Study on ADNI.",
                    "Deep Learning for Shot Classification in Gynecologic Surgery Videos.",
                    "Description Logics and Rules for Multimodal Situational Awareness in Healthcare.",
                    "Speech Synchronized Tongue Animation by Combining Physiology Modeling and X-ray Image Fitting."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2017-2",
                "sub_name": "MultiMedia Modeling - 23rd International Conference, MMM 2017, Reykjavik, Iceland, January 4-6, 2017, Proceedings, Part II.",
                "count": 47,
                "papers": [
                    "A Comparative Study for Known Item Visual Search Using Position Color Feature Signatures.",
                    "A Novel Affective Visualization System for Videos Based on Acoustic and Visual Features.",
                    "A Novel Two-Step Integer-pixel Motion Estimation Algorithm for HEVC Encoding on a GPU.",
                    "A Scalable Video Conferencing System Using Cached Facial Expressions.",
                    "A Unified Framework for Monocular Video-Based Facial Motion Tracking and Expression Recognition.",
                    "A Virtual Reality Framework for Multimodal Imagery for Vessels in Polar Regions.",
                    "Adaptive and Optimal Combination of Local Features for Image Retrieval.",
                    "An Evaluation of Video Browsing on Tablets with the ThumbBrowser.",
                    "Binaural Sound Source Distance Reproduction Based on Distance Variation Function and Artificial Reverberation.",
                    "Color-Introduced Frame-to-Model Registration for 3D Reconstruction.",
                    "Compressing Visual Descriptors of Image Sequences.",
                    "Deep Convolutional Neural Network for Bidirectional Image-Sentence Mapping.",
                    "Discovering Geographic Regions in the City Using Social Multimedia and Open Data.",
                    "Discovering User Interests from Social Images.",
                    "Effect of Junk Images on Inter-concept Distance Measurement: Positive or Negative?",
                    "Exploiting Multimodality in Video Hyperlinking to Improve Target Diversity.",
                    "Exploring Large Movie Collections: Comparing Visual Berrypicking and Traditional Browsing.",
                    "Facial Expression Recognition by Fusing Gabor and Local Binary Pattern Features.",
                    "Frame-Independent and Parallel Method for 3D Audio Real-Time Rendering on Mobile Devices.",
                    "Illumination-Preserving Embroidery Simulation for Non-photorealistic Rendering.",
                    "Improving the Discriminative Power of Bag of Visual Words Model.",
                    "M-SBIR: An Improved Sketch-Based Image Retrieval Method Using Visual Word Mapping.",
                    "Movie Recommendation via BLSTM.",
                    "Multimodal Video-to-Video Linking: Turning to the Crowd for Insight and Evaluation.",
                    "Online User Modeling for Interactive Streaming Image Classification.",
                    "Recognizing Emotions Based on Human Actions in Videos.",
                    "Rocchio-Based Relevance Feedback in Video Event Retrieval.",
                    "Scale-Relation Feature for Moving Cast Shadow Detection.",
                    "Smart Loudspeaker Arrays for Self-Coordination and User Tracking.",
                    "Spatial Verification via Compact Words for Mobile Instance Search.",
                    "Stochastic Decorrelation Constraint Regularized Auto-Encoder for Visual Recognition.",
                    "The Perceptual Lossless Quantization of Spatial Parameter for 3D Audio Signals.",
                    "Unsupervised Multiple Object Cosegmentation via Ensemble MIML Learning.",
                    "Using Object Detection, NLP, and Knowledge Bases to Understand the Message of Images.",
                    "Video Search via Ranking Network with Very Few Query Exemplars.",
                    "A Demo for Image-Based Personality Test.",
                    "A Web-Based Service for Disturbing Image Detection.",
                    "An Annotation System for Egocentric Image Media.",
                    "DeepStyleCam: A Real-Time Style Transfer App on iOS.",
                    "V-Head: Face Detection and Alignment for Facial Augmented Reality Applications.",
                    "Collaborative Feature Maps for Interactive Video Search.",
                    "Concept-Based Interactive Search System.",
                    "Enhanced Retrieval and Browsing in the IMOTION System.",
                    "Semantic Extraction and Object Proposal for Video Search.",
                    "Storyboard-Based Video Browsing Using Color and Concept Indices.",
                    "VERGE in VBS 2017.",
                    "Video Hunter at VBS 2017."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd MMM 2016",
        "info": "Miami, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2016-1",
                "sub_name": "MultiMedia Modeling - 22nd International Conference, MMM 2016, Miami, FL, USA, January 4-6, 2016, Proceedings, Part I.",
                "count": 76,
                "papers": [
                    "Video Event Detection Using Kernel Support Vector Machine with Isotropic Gaussian Sample Uncertainty (KSVM-iGSU).",
                    "Video Content Representation Using Recurring Regions Detection.",
                    "Group Feature Selection for Audio-Based Video Genre Classification.",
                    "Computational Cartoonist: A Comic-Style Video Summarization System for Anime Films.",
                    "Exploring the Long Tail of Social Media Tags.",
                    "Visual Analyses of Music Download History: User Studies.",
                    "Personalized Annotation for Mobile Photos Based on User's Social Circle.",
                    "Utilizing Sensor-Social Cues to Localize Objects-of-Interest in Outdoor UGVs.",
                    "NEWSMAN: Uploading Videos over Adaptive Middleboxes to News Servers in Weak Network Infrastructures.",
                    "Computational Face Reader.",
                    "Posed and Spontaneous Expression Recognition Through Restricted Boltzmann Machine.",
                    "DFRS: A Large-Scale Distributed Fingerprint Recognition System Based on Redis.",
                    "Logo Recognition via Improved Topological Constraint.",
                    "Compound Figure Separation Combining Edge and Band Separator Detection.",
                    "Camera Network Based Person Re-identification by Leveraging Spatial-Temporal Constraint and Multiple Cameras Relations.",
                    "Global Contrast Based Salient Region Boundary Sampling for Action Recognition.",
                    "Elastic Edge Boxes for Object Proposal on RGB-D Images.",
                    "Pairing Contour Fragments for Object Recognition.",
                    "Instance Search with Weak Geometric Correlation Consistency.",
                    "Videopedia: Lecture Video Recommendation for Educational Blogs Using Topic Modeling.",
                    "Towards Training-Free Refinement for Semantic Indexing of Visual Media.",
                    "Deep Learning Generic Features for Cross-Media Retrieval.",
                    "Cross-Media Retrieval via Semantic Entity Projection.",
                    "Visual Re-ranking Through Greedy Selection and Rank Fusion.",
                    "No-reference Image Quality Assessment Based on Structural and Luminance Information.",
                    "Learning Multiple Views with Orthogonal Denoising Autoencoders.",
                    "Fast Nearest Neighbor Search in the Hamming Space.",
                    "SOMH: A Self-Organizing Map Based Topology Preserving Hashing Method.",
                    "Describing Images with Ontology-Aware Dictionary Learning.",
                    "Quality Analysis on Mobile Devices for Real-Time Feedback.",
                    "Interactive Search in Video: Navigation With Flick Gestures vs. Seeker-Bars.",
                    "Second-Layer Navigation in Mobile Hypervideo for Medical Training.",
                    "Reverse Testing Image Set Model Based Multi-view Human Action Recognition.",
                    "Face Image Super-Resolution Through Improved Neighbor Embedding.",
                    "Adaptive Multichannel Reduction Using Convex Polyhedral Loudspeaker Array.",
                    "Dominant Set Based Data Clustering and Image Segmentation.",
                    "An R-CNN Based Method to Localize Speech Balloons in Comics.",
                    "Facial Age Estimation with Images in the Wild.",
                    "Fast Visual Vocabulary Construction for Image Retrieval Using Skewed-Split k-d Trees.",
                    "OGB: A Distinctive and Efficient Feature for Mobile Augmented Reality.",
                    "Learning Relative Aesthetic Quality with a Pairwise Approach.",
                    "Robust Crowd Segmentation and Counting in Indoor Scenes.",
                    "Robust Sketch-Based Image Retrieval by Saliency Detection.",
                    "Image Classification Using Spatial Difference Descriptor Under Spatial Pyramid Matching Framework.",
                    "Exploring Relationship Between Face and Trustworthy Impression Using Mid-level Facial Features.",
                    "Edit-Based Font Search.",
                    "Private Video Foreground Extraction Through Chaotic Mapping Based Encryption in the Cloud.",
                    "Evaluating Access Mechanisms for Multimodal Representations of Lifelogs.",
                    "Analysis and Comparison of Inter-Channel Level Difference and Interaural Level Difference.",
                    "Automatic Scribble Simulation for Interactive Image Segmentation Evaluation.",
                    "Multi-modal Image Re-ranking with Autoencoders and Click Semantics.",
                    "Sketch-Based Image Retrieval with a Novel BoVW Representation.",
                    "Symmetry-Aware Human Shape Correspondence Using Skeleton.",
                    "XTemplate 4.0: Providing Adaptive Layouts and Nested Templates for Hypermedia Documents.",
                    "Level Ratio Based Inter and Intra Channel Prediction with Application to Stereo Audio Frame Loss Concealment.",
                    "Depth Map Coding by Modeling the Locality and Local Correlation of View Synthesis Distortion in 3-D Video.",
                    "Discriminative Feature Learning with an Optimal Pattern Model for Image Classification.",
                    "Sign Language Recognition Based on Trajectory Modeling with HMMs.",
                    "MusicMixer: Automatic DJ System Considering Beat and Latent Topic Similarity.",
                    "Adaptive Synopsis of Non-Human Primates' Surveillance Video Based on Behavior Classification.",
                    "A Packet Scheduling Method for Multimedia QoS Provisioning.",
                    "Robust Object Tracking Using Valid Fragments Selection.",
                    "Exploring Discriminative Views for 3D Object Retrieval.",
                    "What Catches Your Eyes as You Move Around? On the Discovery of Interesting Regions in the Street.",
                    "Bag Detection and Retrieval in Street Shots.",
                    "TV Commercial Detection Using Success Based Locally Weighted Kernel Combination.",
                    "Frame-Wise Continuity-Based Video Summarization and Stretching.",
                    "Respiration Motion State Estimation on 4D CT Rib Cage Images.",
                    "Location-Aware Image Classification.",
                    "Enhancement for Dust-Sand Storm Images.",
                    "Using Instagram Picture Features to Predict Users' Personality.",
                    "Extracting Visual Knowledge from the Internet: Making Sense of Image Data.",
                    "Ordering of Visual Descriptors in a Classifier Cascade Towards Improved Video Concept Detection.",
                    "Spatial Constrained Fine-Grained Color Name for Person Re-identification.",
                    "Dealing with Ambiguous Queries in Multimodal Video Retrieval.",
                    "Collaborative Q-Learning Based Routing Control in Unstructured P2P Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2016-2",
                "sub_name": "MultiMedia Modeling - 22nd International Conference, MMM 2016, Miami, FL, USA, January 4-6, 2016, Proceedings, Part II.",
                "count": 44,
                "papers": [
                    "Transfer Nonnegative Matrix Factorization for Image Representation.",
                    "Sentiment Analysis on Multi-View Social Data.",
                    "Single Image Super-Resolution via Convolutional Neural Network and Total Variation Regularization.",
                    "An Effective Face Verification Algorithm to Fuse Complete Features in Convolutional Neural Network.",
                    "Driver Fatigue Detection System Based on DSP Platform.",
                    "Real-Time Grayscale-Thermal Tracking via Laplacian Sparse Representation.",
                    "Efficient Perceptual Region Detector Based on Object Boundary.",
                    "1D Barcode Region Detection Based on the Hough Transform and Support Vector Machine.",
                    "Client-Driven Strategy of Large-Scale Scene Streaming.",
                    "SELSH: A Hashing Scheme for Approximate Similarity Search with Early Stop Condition.",
                    "Learning Hough Transform with Latent Structures for Joint Object Detection and Pose Estimation.",
                    "Consensus Guided Multiple Match Removal for Geometry Verification in Image Retrieval.",
                    "Locality Constrained Sparse Representation for Cat Recognition.",
                    "User Profiling by Combining Topic Modeling and Pointwise Mutual Information (TM-PMI).",
                    "Image Retrieval Using Color-Aware Tag on Progressive Image Search and Recommendation System.",
                    "Advancing Iterative Quantization Hashing Using Isotropic Prior.",
                    "An Improved RANSAC Image Stitching Algorithm Based Similarity Degree.",
                    "A Novel Emotional Saliency Map to Model Emotional Attention Mechanism.",
                    "Automatic Endmember Extraction Using Pixel Purity Index for Hyperspectral Imagery.",
                    "A Fast 3D Indoor-Localization Approach Based on Video Queries.",
                    "Smart Ambient Sound Analysis via Structured Statistical Modeling.",
                    "Discriminant Manifold Learning via Sparse Coding for Image Analysis.",
                    "A Very Deep Sequences Learning Approach for Human Action Recognition.",
                    "Attribute Discovery for Person Re-Identification.",
                    "What are the Limits to Time Series Based Recognition of Semantic Concepts?",
                    "Ten Research Questions for Scalable Multimedia Analytics.",
                    "Shaping-Up Multimedia Analytics: Needs and Expectations of Media Professionals.",
                    "Informed Perspectives on Human Annotation Using Neural Signals.",
                    "GrillCam: A Real-Time Eating Action Recognition System.",
                    "Searching in Video Collections Using Sketches and Sample Images - The Cineast System.",
                    "LoggerMan, a Comprehensive Logging and Visualization Tool to Capture Computer Usage.",
                    "E^2SGM E 2 S G M : Event Enrichment and Summarization by Graph Model.",
                    "METU-MMDS: An Intelligent Multimedia Database System for Multimodal Content Extraction and Querying.",
                    "Applying Visual User Interest Profiles for Recommendation and Personalisation.",
                    "Cross-Modal Fashion Search.",
                    "IMOTION - Searching for Video Sequences Using Multi-Shot Sketch Queries.",
                    "iAutoMotion - an Autonomous Content-Based Video Retrieval Engine.",
                    "Selecting User Generated Content for Use in Media Productions.",
                    "VERGE: A Multimodal Interactive Search Engine for Video Browsing and Retrieval.",
                    "Collaborative Video Search Combining Video Retrieval with Human-Based Visual Inspection.",
                    "Multi-sketch Semantic Video Browser.",
                    "Faceted Navigation for Browsing Large Video Collection.",
                    "Navigating a Graph of Scenes for Exploring Large Video Collections.",
                    "Mental Visual Browsing."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st MMM 2015",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2015-1",
                "sub_name": "MultiMedia Modeling - 21st International Conference, MMM 2015, Sydney, NSW, Australia, January 5-7, 2015, Proceedings, Part I.",
                "count": 49,
                "papers": [
                    "An Efficient Hybrid Steganography Method Based on Edge Adaptive and Tree Based Parity Check.",
                    "Secure Client Side Watermarking with Limited Key Size.",
                    "Orderless and Blurred Visual Tracking via Spatio-temporal Context.",
                    "Coupled Discriminant Multi-Manifold Analysis with Application to Low-Resolution Face Recognition.",
                    "Text Detection in Natural Images Using Localized Stroke Width Transform.",
                    "Moving Object Tracking with Structure Complexity Coefficients.",
                    "Real-Time People Counting across Spatially Adjacent Non-overlapping Camera Views.",
                    "Binary Code Learning via Iterative Distance Adjustment.",
                    "What Image Classifiers Really See - Visualizing Bag-of-Visual Words Models.",
                    "Coupled-View Based Ranking Optimization for Person Re-identification.",
                    "Wireless Video Surveillance System Based on Incremental Learning Face Detection.",
                    "An Automatic Rib Segmentation Method on X-Ray Radiographs.",
                    "Content-Based Discovery of Multiple Structures from Episodes of Recurrent TV Programs Based on Grammatical Inference.",
                    "FOCUSING PATCH: Automatic Photorealistic Deblurring for Facial Images by Patch-Based Color Transfer.",
                    "Efficient Compression of Hyperspectral Images Using Optimal Compression Cube and Image Plane.",
                    "Automatic Chinese Personality Recognition Based on Prosodic Features.",
                    "Robust Attribute-Based Visual Recognition Using Discriminative Latent Representation.",
                    "An Analysis of Time Drift in Hand-Held Recording Devices.",
                    "A Real-Time People Counting Approach in Indoor Environment.",
                    "Multi-instance Feature Learning Based on Sparse Representation for Facial Expression Recognition.",
                    "Object Detection in Low-Resolution Image via Sparse Representation.",
                    "A Novel Fast Full Frame Video Stabilization via Three-Layer Model.",
                    "Cross-Modal Self-Taught Learning for Image Retrieval.",
                    "Multimedia Social Event Detection in Microblog.",
                    "A Study on the Use of a Binary Local Descriptor and Color Extensions of Local Descriptors for Video Concept Detection.",
                    "Content-Based Image Retrieval with Gaussian Mixture Models.",
                    "Improving Interactive Known-Item Search in Video with the Keyframe Navigation Tree.",
                    "Large-Scale Image Mining with Flickr Groups.",
                    "FISIR: A Flexible Framework for Interactive Search in Image Retrieval Systems.",
                    "Auditory Scene Classification with Deep Belief Network.",
                    "An Improved Content-Based Music Recommending Method with Weighted Tags.",
                    "A Unified Model for Socially Interconnected Multimedia-Enriched Objects.",
                    "Concept-Based Multimodal Learning for Topic Generation.",
                    "Audio Secret Management Scheme Using Shamir's Secret Sharing.",
                    "Live Version Identification with Audio Scene Detection.",
                    "Community Detection Based on Links and Node Features in Social Networks.",
                    "Scaling and Cropping of Wavelet-Based Compressed Images in Hidden Domain.",
                    "MAP: Microblogging Assisted Profiling of TV Shows.",
                    "Improved Rate-Distortion Optimization Algorithms for HEVC Lossless Coding.",
                    "A Novel Error Concealment Algorithm for H.264/AVC.",
                    "Edge Direction-Based Fast Coding Unit Partition for HEVC Screen Content Coding.",
                    "Signal-Aware Parametric Quality Model for Audio and Speech over IP Networks.",
                    "Patch-Based Disparity Remapping for Stereoscopic Images.",
                    "3D Depth Perception from Single Monocular Images.",
                    "Muscular Movement Model Based Automatic 3D Facial Expression Recognition.",
                    "Azimuthal Perceptual Resolution Model Based Adaptive 3D Spatial Parameter Coding.",
                    "Flat3D: Browsing Stereo Images on a Conventional Screen.",
                    "Online 3D Shape Segmentation by Blended Learning.",
                    "Factorizing Time-Aware Multi-way Tensors for Enhancing Semantic Wearable Sensing."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2015-2",
                "sub_name": "MultiMedia Modeling - 21st International Conference, MMM 2015, Sydney, NSW, Australia, January 5-7, 2015, Proceedings, Part II.",
                "count": 60,
                "papers": [
                    "A Proxemic Multimedia Interaction over the Internet of Things.",
                    "Outdoor Air Quality Inference from Single Image.",
                    "Multimodal Music Mood Classification by Fusion of Audio and Lyrics.",
                    "Multidimensional Context Awareness in Mobile Devices.",
                    "AttRel: An Approach to Person Re-Identification by Exploiting Attribute Relationships.",
                    "Sparsity-Based Occlusion Handling Method for Person Re-identification.",
                    "Visual Attention Driven by Auditory Cues - Selecting Visual Features in Synchronization with Attracting Auditory Events.",
                    "A Synchronization Ground Truth for the Jiku Mobile Video Dataset.",
                    "Mobile Image Analysis: Android vs. iOS.",
                    "Dynamic User Authentication Based on Mouse Movements Curves.",
                    "Sliders Versus Storyboards - Investigating Interaction Design for Mobile Video Browsing.",
                    "Performance Evaluation of Students Using Multimodal Learning Systems.",
                    "Is Your First Impression Reliable? Trustworthy Analysis Using Facial Traits in Portraits.",
                    "Wifbs: A Web-Based Image Feature Benchmark System.",
                    "Personality Modeling Based Image Recommendation.",
                    "Aesthetic QR Codes Based on Two-Stage Image Blending.",
                    "Person Re-identification Using Data-Driven Metric Adaptation.",
                    "A Novel Optimized Watermark Embedding Scheme for Digital Images.",
                    "User-Centred Evaluation to Interface Design of E-Books.",
                    "A New Image Decomposition and Reconstruction Approach - Adaptive Fourier Decomposition.",
                    "Graph-Based Browsing for Large Video Collections.",
                    "Enhanced Signature-Based Video Browser.",
                    "VERGE: A Multimodal Interactive Video Search Engine.",
                    "IMOTION - A Content-Based Video Retrieval Engine.",
                    "A Storyboard-Based Interface for Mobile Video Browsing.",
                    "Collaborative Browsing and Search in Video Archives with Mobile Clients.",
                    "The Multi-stripe Video Browser for Tablets.",
                    "NII-UIT Browser: A Multimodal Video Search System.",
                    "Interactive Known-Item Search Using Semantic Textual and Colour Modalities.",
                    "ImageMap - Visually Browsing Millions of Images.",
                    "Dynamic Hierarchical Visualization of Keyframes in Endoscopic Video.",
                    "Facial Aging Simulator by Data-Driven Component-Based Texture Cloning.",
                    "Affective Music Recommendation System Based on the Mood of Input Video.",
                    "MemLog, an Enhanced Lifelog Annotation and Search Tool.",
                    "Software Solution for HEVC Encoding and Decoding.",
                    "A Surveillance Video Index and Browsing System Based on Object Flags and Video Synopsis.",
                    "A Web Portal for Effective Multi-model Exploration.",
                    "Wearable Cameras for Real-Time Activity Annotation.",
                    "Making Lifelogging Usable: Design Guidelines for Activity Trackers.",
                    "Towards Consent-Based Lifelogging in Sport Analytic.",
                    "A Multi-Dimensional Data Model for Personal Photo Browsing.",
                    "Discriminative Regions: A Substrate for Analyzing Life-Logging Image Sequences.",
                    "Fast Human Activity Recognition in Lifelogging.",
                    "Iron Maiden While Jogging, Debussy for Dinner? - An Analysis of Music Listening Behavior in Context.",
                    "Travel Recommendation via Author Topic Model Based Collaborative Filtering.",
                    "Robust User Community-Aware Landmark Photo Retrieval.",
                    "Cross-Domain Concept Detection with Dictionary Coherence by Leveraging Web Images.",
                    "Semantic Correlation Mining between Images and Texts with Global Semantics and Local Mapping.",
                    "Image Taken Place Estimation via Geometric Constrained Spatial Layer Matching.",
                    "Recognition of Meaningful Human Actions for Video Annotation Using EEG Based User Responses.",
                    "Challenging Issues in Visual Information Understanding Researches.",
                    "Emotional Tone-Based Audio Continuous Emotion Recognition.",
                    "A Computationally Efficient Algorithm for Large Scale Near-Duplicate Video Detection.",
                    "SLOREV: Using Classical CAD Techniques for 3D Object Extraction from Single Photo.",
                    "Hessian Regularized Sparse Coding for Human Action Recognition.",
                    "Robust Multi-label Image Classification with Semi-Supervised Learning and Active Learning.",
                    "Photo Quality Assessment with DCNN that Understands Image Well.",
                    "Non-negative Low-Rank and Group-Sparse Matrix Factorization.",
                    "Two-Dimensional Euler PCA for Face Recognition.",
                    "Multiclass Boosting Framework for Multimodal Data Analysis."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th MMM 2014",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2014-1",
                "sub_name": "MultiMedia Modeling - 20th Anniversary International Conference, MMM 2014, Dublin, Ireland, January 6-10, 2014, Proceedings, Part I.",
                "count": 50,
                "papers": [
                    "A Comparative Study on the Use of Multi-label Classification Techniques for Concept-Based Video Indexing and Annotation.",
                    "Coherence Analysis of Metrics in LBP Space for Interactive Face Retrieval.",
                    "A Hybrid Machine-Crowd Approach to Photo Retrieval Result Diversification.",
                    "Visual Saliency Weighting and Cross-Domain Manifold Ranking for Sketch-Based Image Retrieval.",
                    "A Novel Approach for Semantics-Enabled Search of Multimedia Documents on the Web.",
                    "Video to Article Hyperlinking by Multiple Tag Property Exploration.",
                    "Rebuilding Visual Vocabulary via Spatial-temporal Context Similarity for Video Retrieval.",
                    "Approximating the Signature Quadratic Form Distance Using Scalable Feature Signatures.",
                    "A Novel Human Action Representation via Convolution of Shape-Motion Histograms.",
                    "How Do Users Search with Basic HTML5 Video Players?",
                    "Visual Recognition by Exploiting Latent Social Links in Image Collections.",
                    "Collections for Automatic Image Annotation and Photo Tag Recommendation.",
                    "Graph-Based Multimodal Clustering for Social Event Detection in Large Collections of Images.",
                    "Tag Relatedness Using Laplacian Score Feature Selection and Adapted Jensen-Shannon Divergence.",
                    "User Intentions in Digital Photo Production: A Test Data Set.",
                    "Personal Media Reunion: Re-collecting Media Content Scattered over Smart Devices and Social Networks.",
                    "Summarised Presentation of Personal Photo Sets.",
                    "MOSRO: Enabling Mobile Sensing for Real-Scene Objects with Grid Based Structured Output Learning.",
                    "TravelBuddy: Interactive Travel Route Recommendation with a Visual Scene Interface.",
                    "Who's the Best Charades Player? Mining Iconic Movement of Semantic Concepts.",
                    "Tell Me about TV Commercials of This Product.",
                    "A Data-Driven Personalized Digital Ink for Chinese Characters.",
                    "Local Segmentation for Pedestrian Tracking in Dense Crowds.",
                    "An Optimization Model for Aesthetic Two-Dimensional Barcodes.",
                    "Live Key Frame Extraction in User Generated Content Scenarios for Embedded Mobile Platforms.",
                    "Understanding Affective Content of Music Videos through Learned Representations.",
                    "Robust Image Restoration via Reweighted Low-Rank Matrix Recovery.",
                    "Learning to Infer Public Emotions from Large-Scale Networked Voice Data.",
                    "Joint People Recognition across Photo Collections Using Sparse Markov Random Fields.",
                    "Event Detection by Velocity Pyramid.",
                    "Fusing Appearance and Spatio-temporal Features for Multiple Camera Tracking.",
                    "A Dense SURF and Triangulation Based Spatio-temporal Feature for Action Recognition.",
                    "Resource Constrained Multimedia Event Detection.",
                    "Random Matrix Ensembles of Time Correlation Matrices to Analyze Visual Lifelogs.",
                    "Exploring Distance-Aware Weighting Strategies for Accurate Reconstruction of Voxel-Based 3D Synthetic Models.",
                    "Exploitation of Gaze Data for Photo Region Labeling in an Immersive Environment.",
                    "MR Simulation for Re-wallpapering a Room in a Free-Hand Movie.",
                    "Segment and Label Indoor Scene Based on RGB-D for the Visually Impaired.",
                    "A Low-Cost Head and Eye Tracking System for Realistic Eye Movements in Virtual Avatars.",
                    "Real-Time Skeleton-Tracking-Based Human Action Recognition Using Kinect Data.",
                    "Kinect vs. Low-cost Inertial Sensing for Gesture Recognition.",
                    "Yoga Posture Recognition for Self-training.",
                    "Real-Time Gaze Estimation Using a Kinect and a HD Webcam.",
                    "A Framework of Video Coding for Compressing Near-Duplicate Videos.",
                    "An Improved Similarity-Based Fast Coding Unit Depth Decision Algorithm for Inter-frame Coding in HEVC.",
                    "Low-Complexity Rate-Distortion Optimization Algorithms for HEVC Intra Prediction.",
                    "Factor Selection for Reinforcement Learning in HTTP Adaptive Streaming.",
                    "Stixel on the Bus: An Efficient Lossless Compression Scheme for Depth Information in Traffic Scenarios.",
                    "A New Saliency Model Using Intra Coded High Efficiency Video Coding (HEVC) Frames.",
                    "Multiple Reference Frame Transcoding from H.264/AVC to HEVC."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2014-2",
                "sub_name": "MultiMedia Modeling - 20th Anniversary International Conference, MMM 2014, Dublin, Ireland, January 6-10, 2014, Proceedings, Part II.",
                "count": 50,
                "papers": [
                    "Organising Crowd-Sourced Media Content via a Tangible Desktop Application.",
                    "Scenarizing Metropolitan Views: FlanoGraphing the Urban Spaces.",
                    "Scenarizing CADastre Exquisse: A Crossover between Snoezeling in Hospitals/Domes, and Authoring/Experiencing Soundful Comic Strips.",
                    "An Interactive Device for Exploring Thematically Sorted Artworks.",
                    "Hierarchical Audio-Visual Surveillance for Passenger Elevators.",
                    "An Evaluation of Local Action Descriptors for Human Action Classification in the Presence of Occlusion.",
                    "Online Identification of Primary Social Groups.",
                    "Gait Based Gender Recognition Using Sparse Spatio Temporal Features.",
                    "Perspective Multiscale Detection and Tracking of Persons.",
                    "Human Action Recognition in Video via Fused Optical Flow and Moment Features - Towards a Hierarchical Approach to Complex Scenario Recognition.",
                    "Sparse Patch Coding for 3D Model Retrieval.",
                    "3D Object Classification Using Deep Belief Networks.",
                    "Pursuing Detector Efficiency for Simple Scene Pedestrian Detection.",
                    "Multi-view Action Synchronization in Complex Background.",
                    "Parameter-Free Inter-view Depth Propagation for Mobile Free-View Video.",
                    "Coverage Field Analysis to the Quality of Light Field Rendering.",
                    "Personalized Recommendation by Exploring Social Users' Behaviors.",
                    "Where Is the News Breaking? Towards a Location-Based Event Detection Framework for Journalists.",
                    "Location-Aware Music Artist Recommendation.",
                    "Task-Driven Image Retrieval Using Geographic Information.",
                    "The Evolution of Research on Multimedia Travel Guide Search and Recommender Systems.",
                    "Average Precision: Good Guide or False Friend to Multimedia Search Effectiveness?",
                    "An Investigation into Feature Effectiveness for Multimedia Hyperlinking.",
                    "Mining the Web for Multimedia-Based Enriching.",
                    "Spatial Similarity Measure of Visual Phrases for Image Retrieval.",
                    "Semantic Based Background Music Recommendation for Home Videos.",
                    "Smoke Detection Based on a Semi-supervised Clustering Model.",
                    "Empirical Exploration of Extreme SVM-RBF Parameter Values for Visual Object Classification.",
                    "Real-World Event Detection Using Flickr Images.",
                    "Spectral Classification of 3D Articulated Shapes.",
                    "Improving Scene Detection Algorithms Using New Similarity Measures.",
                    "EvoTunes: Crowdsourcing-Based Music Recommendation.",
                    "Affect Recognition Using Magnitude Models of Motion.",
                    "Effects of Audio Compression on Chord Recognition.",
                    "The Perceptual Characteristics of 3D Orientation.",
                    "Folkioneer: Efficient Browsing of Community Geotagged Images on a Worldwide Scale.",
                    "Muithu: A Touch-Based Annotation Interface for Activity Logging in the Norwegian Premier League.",
                    "FoodCam: A Real-Time Mobile Food Recognition System Employing Fisher Vector.",
                    "The LIRE Request Handler: A Solr Plug-In for Large Scale Content Based Image Retrieval.",
                    "M3 + P3 + O3 = Multi-D Photo Browsing.",
                    "Tools for User Interaction in Immersive Environments.",
                    "RESIC: A Tool for Music Stretching Resistance Estimation.",
                    "A Visual Information Retrieval System for Radiology Reports and the Medical Literature.",
                    "Eolas: Video Retrieval Application for Helping Tourists.",
                    "Audio-Visual Classification Video Browser.",
                    "Content-Based Video Browsing with Collaborating Mobile Clients.",
                    "Browsing Linked Video Collections for Media Production.",
                    "VERGE: An Interactive Search Engine for Browsing Video Collections.",
                    "Signature-Based Video Browser.",
                    "NII-UIT: A Tool for Known Item Search by Sequential Pattern Filtering."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th MMM 2013",
        "info": "Huangshan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2013",
                "sub_name": "Advances in Multimedia Modeling, 19th International Conference, MMM 2013, Huangshan, China, January 7-9, 2013, Proceedings, Part I.",
                "count": 50,
                "papers": [
                    "Semi-supervised Concept Detection by Learning the Structure of Similarity Graphs.",
                    "Refining Image Annotation by Integrating PLSA with Random Walk Model.",
                    "Social Media Annotation and Tagging Based on Folksonomy Link Prediction in a Tripartite Graph.",
                    "Can You See It? Two Novel Eye-Tracking-Based Measures for Assigning Tags to Image Regions.",
                    "Visual Analysis of Tag Co-occurrence on Nouns and Adjectives.",
                    "Verb-Object Concepts Image Classification via Hierarchical Nonnegative Graph Embedding.",
                    "Robust Semantic Video Indexing by Harvesting Web Images.",
                    "Interactive Evaluation of Video Browsing Tools.",
                    "Paint the City Colorfully: Location Visualization from Multiple Themes.",
                    "Interactive Video Advertising: A Multimodal Affective Approach.",
                    "GPS Estimation from Users' Photos.",
                    "Knowing Who You Are and Who You Know: Harnessing Social Networks to Identify People via Mobile Devices.",
                    "Hyperspectral Image Classification by Using Pixel Spatial Correlation.",
                    "Research on Face Recognition under Images Patches and Variable Lighting.",
                    "A New Network-Based Algorithm for Human Group Activity Recognition in Videos.",
                    "Exploit Spatial Relationships among Pixels for Saliency Region Detection Using Topic Model.",
                    "Mining People's Appearances to Improve Recognition in Photo Collections.",
                    "Person Re-identification by Local Feature Based on Super Pixel.",
                    "An Effective Tracking System for Multiple Object Tracking in Occlusion Scenes.",
                    "Image Search Reranking with Semi-supervised LPP and Ranking SVM.",
                    "Co-ranking Images and Tags via Random Walks on a Heterogeneous Graph.",
                    "Social Visual Image Ranking for Web Image Search.",
                    "Fusion of Audio-Visual Features and Statistical Property for Commercial Segmentation.",
                    "Learning Affine Robust Binary Codes Based on Locality Preserving Hash.",
                    "A Novel Segmentation-Based Video Denoising Method with Noise Level Estimation.",
                    "Blocking Artifact Reduction in DIBR Using an Overcomplete 3D Dictionary.",
                    "Efficient HEVC to H.264/AVC Transcoding with Fast Intra Mode Decision.",
                    "SSIM-Based End-to-End Distortion Model for Error Resilient Video Coding over Packet-Switched Networks.",
                    "A Novel and Robust System for Time Recognition of the Digital Video Clock Using the Domain Knowledge.",
                    "On Modeling 3-D Video Traffic.",
                    "A Low-Complexity Quantization-Domain H.264/SVC to H.264/AVC Transcoder with Medium-Grain Quality Scalability.",
                    "Evaluation of Product Quantization for Image Search.",
                    "Rate-Quantization and Distortion-Quantization Models of Dead-Zone Plus Uniform Threshold Scalar Quantizers for Generalized Gaussian Random Variables.",
                    "Flexible Presentation of Videos Based on Affective Content Analysis.",
                    "Dynamic Multi-video Summarization of Sensor-Rich Videos in Geo-Space.",
                    "Towards Automatic Music Performance Comparison with the Multiple Sequence Alignment Technique.",
                    "Multi-frame Super Resolution Using Refined Exploration of Extensive Self-examples.",
                    "Iterative Super-Resolution for Facial Image by Local and Global Regression.",
                    "Stripe Model: An Efficient Method to Detect Multi-form Stripe Structures.",
                    "Saliency-Based Content-Aware Image Mosaics.",
                    "Combining Visual and Textual Systems within the Context of User Feedback.",
                    "A Psychophysiological Approach to the Usability Evaluation of a Multi-view Video Browsing Tool.",
                    "Film Comic Generation with Eye Tracking.",
                    "Quality Assessment of User-Generated Video Using Camera Motion.",
                    "Multiscaled Cross-Correlation Dynamics on SenseCam Lifelogged Images.",
                    "Choreographing Amateur Performers Based on Motion Transfer between Videos.",
                    "Large Scale Image Retrieval with Practical Spatial Weighting for Bag-of-Visual-Words.",
                    "Music Retrieval in Joint Emotion Space Using Audio Features and Emotional Tags.",
                    "Analyzing Favorite Behavior in Flickr.",
                    "Unequally Weighted Video Hashing for Copy Detection."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2013-2",
                "sub_name": "Advances in Multimedia Modeling, 19th International Conference, MMM 2013, Huangshan, China, January 7-9, 2013, Proceedings, Part II.",
                "count": 67,
                "papers": [
                    "Quality Assessment on User Generated Image for Mobile Search Application.",
                    "2D/3D Model-Based Facial Video Coding/Decoding at Ultra-Low Bit-Rate.",
                    "Hierarchical Text Detection: From Word Level to Character Level.",
                    "Building a Large Scale Test Collection for Effective Benchmarking of Mobile Landmark Search.",
                    "Geographical Retagging.",
                    "Recompilation of Broadcast Videos Based on Real-World Scenarios.",
                    "Evaluating Novice and Expert Users on Handheld Video Retrieval Systems.",
                    "Perfect Snapping.",
                    "Smart Video Browsing with Augmented Navigation Bars.",
                    "Human Action Search Based on Dynamic Shape Volumes.",
                    "Video Retrieval Based on User-Specified Appearance and Application to Animation Synthesis.",
                    "Landmark History Visualization.",
                    "Discovering Latent Clusters from Geotagged Beach Images.",
                    "An Error Resilient Depth Map Coding Scheme Using Adaptive Wyner-Ziv Frame.",
                    "A New Closed Loop Method of Super-Resolution for Multi-view Images.",
                    "Fast Coding Unit Decision Algorithm for Compressing Depth Maps in HEVC.",
                    "Fast Mode Decision Based on Optimal Stopping Theory for Multiview Video Coding.",
                    "Inferring Depth from a Pair of Images Captured Using Different Aperture Settings.",
                    "Multiple Instance Learning for Automatic Image Annotation.",
                    "Combining Topic Model and Relevance Filtering to Localize Relevant Frames in Web Videos.",
                    "A Lightweight Fingerprint Recognition Mechanism of User Identification in Real-Name Social Networks.",
                    "A Novel Binary Feature from Intensity Difference Quantization between Random Sample of Points.",
                    "Beyond Kmedoids: Sparse Model Based Medoids Algorithm for Representative Selection.",
                    "Improving Automatic Image Tagging Using Temporal Tag Co-occurrence.",
                    "Robust Detection and Localization of Human Action in Video.",
                    "A Sparse Coding Based Transfer Learning Framework for Pedestrian Detection.",
                    "Sampling of Web Images with Dictionary Coherence for Cross-Domain Concept Detection.",
                    "Weakly Principal Component Hashing with Multiple Tables.",
                    "DUT-WEBV: A Benchmark Dataset for Performance Evaluation of Tag Localization for Web Video.",
                    "Clothing Extraction by Coarse Region Localization and Fine Foreground/Background Estimation.",
                    "Object Categorization Using Local Feature Context.",
                    "Statistical Multiplexing of MDFEC-Coded Heterogeneous Video Streaming.",
                    "Related HOG Features for Human Detection Using Cascaded Adaboost and SVM Classifiers.",
                    "Face Recognition Using Multi-scale ICA Texture Pattern and Farthest Prototype Representation Classification.",
                    "Detection of Biased Broadcast Sports Video Highlights by Attribute-Based Tweets Analysis.",
                    "Temporal Video Segmentation to Scene Based on Conditional Random Fileds.",
                    "Improving Preservation and Access Processes of Audiovisual Media by Content-Based Quality Assessment.",
                    "Distribution-Aware Locality Sensitive Hashing.",
                    "Cross Concept Local Fisher Discriminant Analysis for Image Classification.",
                    "A Weighted One Class Collaborative Filtering with Content Topic Features.",
                    "Contextualizing Tag Ranking and Saliency Detection for Social Images.",
                    "Illumination Variation Dictionary Designing for Single-Sample Face Recognition via Sparse Representation.",
                    "Efficient Extraction of Feature Signatures Using Multi-GPU Architecture.",
                    "Collaborative Tracking: Dynamically Fusing Short-Term Trackers and Long-Term Detector.",
                    "A Real-Time Fluid Rendering Method with Adaptive Surface Smoothing and Realistic Splash.",
                    "Multi-document Summarization Exploiting Semantic Analysis Based on Tag Cluster.",
                    "ShareDay: A Novel Lifelog Management System for Group Sharing.",
                    "Helping the Helpers: How Video Retrieval Can Assist Special Interest Groups.",
                    "Browsing Linked Video Archives of WWW Video.",
                    "Multi-camera Egocentric Activity Detection for Personal Assistant.",
                    "Music Search Engine with Virtual Musical Instruments Playing Interface.",
                    "Navilog: A Museum Guide and Location Logging System Based on Image Recognition.",
                    "Early Skip Mode Detection by Exploring Extra Skip Patterns for H.264 Coarse Grain Quality Scalable Video Coding.",
                    "A Video Communication System Based on Spatial Rewriting and ROI Rewriting.",
                    "NExT-Live: A Live Observatory on Social Media.",
                    "Online Boosting Tracking with Fragmented Model.",
                    "Nonrigid Object Modelling and Visualization for Hepatic Surgery Planning in e-Health.",
                    "Encoder/Decoder for Privacy Protection Video with Privacy Region Detection and Scrambling.",
                    "TVEar: A TV-tagging System Based on Audio Fingerprint.",
                    "VTrans: A Distributed Video Transcoding Platform.",
                    "Fast ASA Modeling and Texturing Using Subgraph Isomorphism Detection Algorithm of Relational Model.",
                    "An Approach for Browsing Video Collections in Media Production.",
                    "DCU at MMM 2013 Video Browser Showdown.",
                    "AAU Video Browser with Augmented Navigation Bars.",
                    "NII-UIT-VBS: A Video Browsing Tool for Known Item Search.",
                    "VideoCycle: User-Friendly Navigation by Similarity in Video Databases.",
                    "Interactive Video Retrieval Using Combination of Semantic Index and Instance Search."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th MMM 2012",
        "info": "Klagenfurt, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2012",
                "sub_name": "Advances in Multimedia Modeling - 18th International Conference, MMM 2012, Klagenfurt, Austria, January 4-6, 2012. Proceedings.",
                "count": 82,
                "papers": [
                    "A New Gap to Bridge: Where to Go Next in Social Media Retrieval? - (Extended Abstract).",
                    "Mining Multimedia Data for Meaning - (Extended Abstract).",
                    "Challenges in Serious Gaming as Emerging Multimedia Technology for Education, Training, Sports and Health - (Extended Abstract).",
                    "Building Semantic Hierarchies Faithful to Image Semantics.",
                    "Combining Image-Level and Segment-Level Models for Automatic Annotation.",
                    "Multi-layer Local Graph Words for Object Recognition.",
                    "Multimodal Video Concept Detection via Bag of Auditory Words and Multiple Kernel Learning.",
                    "Content-Based Video Description for Automatic Video Genre Categorization.",
                    "Towards Category-Based Aesthetic Models of Photographs.",
                    "Scene Signatures for Unconstrained News Video Stories.",
                    "Visual Vocabulary Optimization with Spatial Context for Image Annotation and Classification.",
                    "Colorization Using Quaternion Algebra with Automatic Scribble Generation.",
                    "Do-It-Yourself Eye Tracker: Low-Cost Pupil-Based Eye Tracker for Computer Graphics Applications.",
                    "Symbiotic Black-Box Tracker.",
                    "Identifying Objects in Images from Analyzing the Users' Gaze Movements for Provided Tags.",
                    "On Video Recommendation over Social Network.",
                    "Improving Item Recommendation Based on Social Tag Ranking.",
                    "Double Fusion for Multimedia Event Detection.",
                    "Multi-modal Solution for Unconstrained News Story Retrieval.",
                    "Workflow Activity Monitoring Using Dynamics of Pair-Wise Qualitative Spatial Relations.",
                    "Efficient Spatio-Temporal Edge Descriptor.",
                    "Recurring Element Detection in Movies.",
                    "Scalable Mobile-to-Mobile Video Communications Based on an Improved WZ-to-SVC Transcoder.",
                    "Place Recognition via 3D Modeling for Personal Activity Lifelog Using Wearable Camera.",
                    "Sensor-Based Analysis of User Generated Video for Multi-camera Video Remixing.",
                    "Gait-Based Action Recognition via Accelerated Minimum Incremental Coding Length Classifier.",
                    "Hairstyle Suggestion Using Statistical Learning.",
                    "Topic Based Query Suggestions for Video Search.",
                    "A Multimedia Retrieval Framework Based on Automatic Graded Relevance Judgments.",
                    "Effective Heterogeneous Similarity Measure with Nearest Neighbors for Cross-Media Retrieval.",
                    "TempoM 2: A Multi Feature Index Structure for Temporal Video Search.",
                    "Towards Automatic Detection of CBIRs Configuration.",
                    "On Stability of Adaptive Similarity Measures for Content-Based Image Retrieval.",
                    "Retrieval of Multiple Instances of Objects in Videos.",
                    "Video Summarization Based on Balanced AV-MMR.",
                    "Sequence Kernels for Clustering and Visualizing Near Duplicate Video Segments.",
                    "Investigating Gesture and Pressure Interaction with a 3D Display.",
                    "Film Comic Reflecting Camera-Works.",
                    "Large-Scale Similarity-Based Join Processing in Multimedia Databases.",
                    "Client-Driven Price Selection for Scalable Video Streaming with Advertisements.",
                    "Efficient Storage and Decoding of SURF Feature Points.",
                    "How to Select and Customize Object Recognition Approaches for an Application?",
                    "A Fuzzy Rank-Based Late Fusion Method for Image Retrieval.",
                    "Annotated Free-Hand Sketches for Video Retrieval Using Object Semantics and Motion.",
                    "Finding Suits in Images of People.",
                    "The Video Face Book.",
                    "Content Based Image Retrieval Using Bag-Of-Regions.",
                    "Active Cleaning for Video Corpus Annotation.",
                    "Improving Cluster Selection and Event Modeling in Unsupervised Mining for Automatic Audiovisual Video Structuring.",
                    "Pedestrian Attribute Analysis Using a Top-View Camera in a Public Space.",
                    "A Fast GPU-Based Motion Estimation Algorithm for H.264/AVC.",
                    "A Low Complexity Macroblock Layer Rate Control Scheme Base on Weighted-Window for H.264 Encoder.",
                    "Forward Wyner-Ziv Fast Video Decoding Using Multicore Processors.",
                    "Fast Mode Decision Algorithm for H.264/AVC-to-SVC Transcoding with Temporal Scalability.",
                    "Asserting the Precise Position of 3D and Multispectral Acquisition Systems for Multisensor Registration Applied to Cultural Heritage Analysis.",
                    "U-Drumwave: An Interactive Performance System for Drumming.",
                    "Real-Time Visualizations of Gigapixel Texture Data Sets Using HTML5.",
                    "Enhancing the User Experience with the Sensory Effect Media Player and AmbientLib.",
                    "EMIR: A Novel Music Retrieval System for Mobile Devices Incorporating Analysis of User Emotion.",
                    "Summarization and Presentation of Real-Life Events Using Community-Contributed Content.",
                    "Tracking Persons in Ultra-HD Panoramic Video.",
                    "A Real-Time Life Experience Logging Tool.",
                    "AAU Video Browser: Non-Sequential Hierarchical Video Browsing without Content Analysis.",
                    "Video Browser Showdown by NUS.",
                    "Clipboard: A Visual Search and Browsing Engine for Tablet and PC.",
                    "OVIDIUS: A Web Platform for Video Browsing and Search.",
                    "Hierarchical Navigation and Visual Search for Video Keyframe Retrieval.",
                    "A Key-Frame-Oriented Video Browser.",
                    "A Video Browsing Tool for Content Management in Media Post-Production.",
                    "Video Browsing with a 3D Thumbnail Ring Arranged by Color Similarity.",
                    "Multimodal Cue Detection Engine for Orchestrated Entertainment.",
                    "The Ultimate Immersive Experience: Panoramic 3D Video Acquisition.",
                    "The FascinatE Production Scripting Engine.",
                    "Linking User Generated Video Annotations to the Web of Data.",
                    "Challenges in Storing Multimedia Data for the Future - An Overview.",
                    "Optimizing Multimedia Retrieval Using Multimodal Fusion and Relevance Feedback Techniques.",
                    "Context-Aware Querying for Multimodal Search Engines.",
                    "A Novel Multi-modal Integration and Propagation Model for Cross-Media Information Retrieval.",
                    "RGB-D Based Multi-attribute People Search in Intelligent Visual Surveillance.",
                    "Template Matching and Monte Carlo Markova Chain for People Counting under Occlusions.",
                    "Visual-Based Spatiotemporal Analysis for Nighttime Vehicle Braking Event Detection.",
                    "Fusing Template and Point Information to Track Planes with Large Interframe Displacement."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th MMM 2011",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2011-1",
                "sub_name": "Advances in Multimedia Modeling - 17th International Multimedia Modeling Conference, MMM 2011, Taipei, Taiwan, January 5-7, 2011, Proceedings, Part I.",
                "count": 51,
                "papers": [
                    "A Generalized Coding Artifacts and Noise Removal Algorithm for Digitally Compressed Video Signals.",
                    "Efficient Mode Selection with BMA Based Pre-processing Algorithms for H.264/AVC Fast Intra Mode Decision.",
                    "Perceptual Motivated Coding Strategy for Quality Consistency.",
                    "Compressed-Domain Shot Boundary Detection for H.264/AVC Using Intra Partitioning Maps.",
                    "Adaptive Orthogonal Transform for Motion Compensation Residual in Video Compression.",
                    "Parallel Deblocking Filter for H.264/AVC on the TILERA Many-Core Systems.",
                    "Image Distortion Estimation by Hash Comparison.",
                    "Sewing Photos: Smooth Transition between Photos.",
                    "Employing Aesthetic Principles for Automatic Photo Book Layout.",
                    "Video Event Retrieval from a Small Number of Examples Using Rough Set Theory.",
                    "Community Discovery from Movie and Its Application to Poster Generation.",
                    "A BOVW Based Query Generative Model.",
                    "Video Sequence Identification in TV Broadcasts.",
                    "Content-Based Multimedia Retrieval in the Presence of Unknown User Preferences.",
                    "People Localization in a Camera Network Combining Background Subtraction and Scene-Aware Human Detection.",
                    "A Novel Depth-Image Based View Synthesis Scheme for Multiview and 3DTV.",
                    "Egocentric View Transition for Video Monitoring in a Distributed Camera Network.",
                    "A Multiple Camera System with Real-Time Volume Reconstruction for Articulated Skeleton Pose Tracking.",
                    "A New Two-Omni-Camera System with a Console Table for Versatile 3D Vision Applications and Its Automatic Adaptation to Imprecise Camera Setups.",
                    "3D Face Recognition Based on Local Shape Patterns and Sparse Representation Classifier.",
                    "An Effective Approach to Pose Invariant 3D Face Recognition.",
                    "Score Following and Retrieval Based on Chroma and Octave Representation.",
                    "Incremental Multiple Classifier Active Learning for Concept Indexing in Images and Videos.",
                    "A Semantic Higher-Level Visual Representation for Object Recognition.",
                    "Mining Travel Patterns from GPS-Tagged Photos.",
                    "Augmenting Image Processing with Social Tag Mining for Landmark Recognition.",
                    "News Shot Cloud: Ranking TV News Shots by Cross TV-Channel Filtering for Efficient Browsing of Large-Scale News Video Archives.",
                    "Speaker Change Detection Using Variable Segments for Video Indexing.",
                    "Correlated PLSA for Image Clustering.",
                    "Genre Classification and the Invariance of MFCC Features to Key and Tempo.",
                    "Combination of Local and Global Features for Near-Duplicate Detection.",
                    "Audio Tag Annotation and Retrieval Using Tag Count Information.",
                    "Similarity Measurement for Animation Movies.",
                    "A Feature Sequence Kernel for Video Concept Classification.",
                    "Bottom-Up Saliency Detection Model Based on Amplitude Spectrum.",
                    "L2-Signature Quadratic Form Distance for Efficient Query Processing in Very Large Multimedia Databases.",
                    "Generating Representative Views of Landmarks via Scenic Theme Detection.",
                    "Regularized Semi-supervised Latent Dirichlet Allocation for Visual Concept Learning.",
                    "Boosted Scene Categorization Approach by Adjusting Inner Structures and Outer Weights of Weak Classifiers.",
                    "A User-Centric System for Home Movie Summarisation.",
                    "Image Super-Resolution by Vectorizing Edges.",
                    "Vehicle Counting without Background Modeling.",
                    "Effective Color-Difference-Based Interpolation Algorithm for CFA Image Demosaicking.",
                    "Utility Max-Min Fair Rate Allocation for Multiuser Multimedia Communications.",
                    "Adaptive Model for Robust Pedestrian Counting.",
                    "Multi Objective Optimization Based Fast Motion Detector.",
                    "Narrative Generation by Repurposing Digital Videos.",
                    "A Coordinate Transformation System Based on the Human Feature Information.",
                    "An Effective Illumination Compensation Method for Face Recognition.",
                    "Shape Stylized Face Caricatures.",
                    "i - m - Breath: The Effect of Multimedia Biofeedback on Learning Abdominal Breath."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2011-2",
                "sub_name": "Advances in Multimedia Modeling - 17th International Multimedia Modeling Conference, MMM 2011, Taipei, Taiwan, January 5-7, 2011, Proceedings, Part II.",
                "count": 48,
                "papers": [
                    "Generative Group Activity Analysis with Quaternion Descriptor.",
                    "Grid-Based Retargeting with Transformation Consistency Smoothing.",
                    "Understanding Video Sequences through Super-Resolution.",
                    "Facial Expression Recognition on Hexagonal Structure Using LBP-Based Histogram Variances.",
                    "Towards More Precise Social Image-Tag Alignment.",
                    "Social Community Detection from Photo Collections Using Bayesian Overlapping Subspace Clustering.",
                    "Dynamic Estimation of Family Relations from Photos.",
                    "Semi-automatic Flickr Group Suggestion.",
                    "A Visualized Communication System Using Cross-Media Semantic Association.",
                    "Effective Large Scale Text Retrieval via Learning Risk-Minimization and Dependency-Embedded Model.",
                    "Efficient Large-Scale Image Data Set Exploration: Visual Concept Network and Image Summarization.",
                    "A Study in User-Centered Design and Evaluation of Mental Tasks for BCI.",
                    "Video CooKing: Towards the Synthesis of Multimedia Cooking Recipes.",
                    "Snap2Read: Automatic Magazine Capturing and Analysis for Adaptive Mobile Reading.",
                    "Multimodal Interaction Concepts for Mobile Augmented Reality Applications.",
                    "Morphology-Based Shape Adaptive Compression.",
                    "People Tracking in a Building Using Color Histogram Classifiers and Gaussian Weighted Individual Separation Approaches.",
                    "Human-Centered Fingertip Mandarin Input System Using Single Camera.",
                    "Automatic Container Code Recognition Using Compressed Sensing Method.",
                    "Combining Histograms of Oriented Gradients with Global Feature for Human Detection.",
                    "Video Browsing Using Object Trajectories.",
                    "Size Matters! How Thumbnail Number, Size, and Motion Influence Mobile Video Retrieval.",
                    "An Information Foraging Theory Based User Study of an Adaptive User Interaction Framework for Content-Based Image Retrieval.",
                    "Generalized Zigzag Scanning Algorithm for Non-square Blocks.",
                    "The Interaction Ontology Model - Supporting the Virtual Director Orchestrating Real-Time Group Interaction.",
                    "CLUENET: Enabling Automatic Video Aggregation in Social Media Networks.",
                    "Pedestrian Tracking Based on Hidden-Latent Temporal Markov Chain.",
                    "Motion Analysis via Feature Point Tracking Technology.",
                    "Traffic Monitoring and Event Analysis at Intersection Based on Integrated Multi-video and Petri Net Process.",
                    "Baseball Event Semantic Exploring System Using HMM.",
                    "Robust Face Recognition under Different Facial Expressions, Illumination Variations and Partial Occlusions.",
                    "Localization and Recognition of the Scoreboard in Sports Video Based on SIFT Point Matching.",
                    "3D Model Search Using Stochastic Attributed Relational Tree Matching.",
                    "A Novel Horror Scene Detection Scheme on Revised Multiple Instance Learning Model.",
                    "Randomly Projected KD-Trees with Distance Metric Learning for Image Retrieval.",
                    "A SAQD-Domain Source Model Unified Rate Control Algorithm for H.264 Video Coding.",
                    "A Bi-objective Optimization Model for Interactive Face Retrieval.",
                    "Multi-symbology and Multiple 1D/2D Barcodes Extraction Framework.",
                    "Wikipedia Based News Video Topic Modeling for Information Extraction.",
                    "Advertisement Image Recognition for a Location-Based Reminder System.",
                    "Flow of Qi: System of Real-Time Multimedia Interactive Application of Calligraphy Controlled by Breathing.",
                    "Measuring Bitrate and Quality Trade-Off in a Fast Region-of-Interest Based Video Coding.",
                    "Image Annotation with Concept Level Feature Using PLSA+CCA.",
                    "Multi-actor Emotion Recognition in Movies Using a Bimodal Approach.",
                    "RoboGene: An Image Retrieval System with Multi-Level Log-Based Relevance Feedback Scheme.",
                    "Query Difficulty Guided Image Retrieval System.",
                    "HeartPlayer: A Smart Music Player Involving Emotion Recognition, Expression and Recommendation.",
                    "Immersive Video Conferencing Architecture Using Game Engine Technology."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th MMM 2010",
        "info": "Chongqing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2010",
                "sub_name": "Advances in Multimedia Modeling, 16th International Multimedia Modeling Conference, MMM 2010, Chongqing, China, January 6-8, 2010. Proceedings.",
                "count": 92,
                "papers": [
                    "Slow Intelligence Systems.",
                    "Media 2.0 - The New Media Revolution?",
                    "Designing a Comprehensive Visual Recognition System.",
                    "Surface Reconstruction from Images Using a Variational Formulation.",
                    "Layer-Constraint-Based Visibility for Volumetric Multi-view Reconstruction.",
                    "Two Stages Stereo Dense Matching Algorithm for 3D Skin Micro-surface Reconstruction.",
                    "Safe Polyhedral Visual Hulls.",
                    "Enhanced Temporal Error Concealment for 1Seg Video Broadcasting.",
                    "User-Centered Video Quality Assessment for Scalable Video Coding of H.264/AVC Standard.",
                    "Subjective Experiments on Gender and Ethnicity Recognition from Different Face Representations.",
                    "Facial Parameters and Their Influence on Subjective Impression in the Context of Keyframe Extraction from Home Video Contents.",
                    "Characterizing Virtual Populations in Massively Multiplayer Online Role-Playing Games.",
                    "Browsing Large Personal Multimedia Archives in a Lean-Back Environment.",
                    "Automatic Image Inpainting by Heuristic Texture and Structure Completion.",
                    "Multispectral and Panchromatic Images Fusion by Adaptive PCNN.",
                    "A Dual Binary Image Watermarking Based on Wavelet Domain and Pixel Distribution Features.",
                    "PSF-Constraints Based Iterative Blind Deconvolution Method for Image Deblurring.",
                    "Face Image Retrieval across Age Variation Using Relevance Feedback.",
                    "Visual Reranking with Local Learning Consistency.",
                    "Social Image Search with Diverse Relevance Ranking.",
                    "View Context: A 3D Model Feature for Retrieval.",
                    "Scene Location Guide by Image-Based Retrieval.",
                    "Learning Landmarks by Exploiting Social Media.",
                    "Discovering Class-Specific Informative Patches and Its Application in Landmark Charaterization.",
                    "Mid-Level Concept Learning with Visual Contextual Ontologies and Probabilistic Inference for Image Annotation.",
                    "A Color Saliency Model for Salient Objects Detection in Natural Scenes.",
                    "Generating Visual Concept Network from Large-Scale Weakly-Tagged Images.",
                    "Automatic Image Annotation with Cooperation of Concept-Specific and Universal Visual Vocabularies.",
                    "Weak Metric Learning for Feature Fusion towards Perception-Inspired Object Recognition.",
                    "The Persian Linguistic Based Audio-Visual Data Corpus, AVA II, Considering Coarticulation.",
                    "Variational Color Image Segmentation via Chromaticity-Brightness Decomposition.",
                    "Image Matching Based on Representative Local Descriptors.",
                    "Stereoscopic Visual Attention Model for 3D Video.",
                    "Non-intrusive Speech Quality Assessment with Support Vector Regression.",
                    "Semantic User Modelling for Personal News Video Retrieval.",
                    "TV News Story Segmentation Based on Semantic Coherence and Content Similarity.",
                    "Query-Based Video Event Definition Using Rough Set Theory and High-Dimensional Representation.",
                    "Story-Based Retrieval by Learning and Measuring the Concept-Based and Content-Based Similarity.",
                    "Camera Take Reconstruction.",
                    "Semantic Based Adaptive Movie Summarisation.",
                    "Towards Annotation of Video as Part of Search.",
                    "Human Action Recognition in Videos Using Hybrid Motion Features.",
                    "Bag of Spatio-temporal Synonym Sets for Human Action Recognition.",
                    "A Novel Trajectory Clustering Approach for Motion Segmentation.",
                    "New Optical Flow Approach for Motion Segmentation Based on Gamma Distribution.",
                    "Reducing Frame Rate for Object Tracking.",
                    "A Study on Sampling Strategies in Space-Time Domain for Recognition Applications.",
                    "Fire Surveillance Method Based on Quaternionic Wavelet Features.",
                    "Object Tracking and Local Appearance Capturing in a Remote Scene Video Surveillance System with Two Cameras.",
                    "Dual Phase Learning for Large Scale Video Gait Recognition.",
                    "Semantic Concept Detection for User-Generated Video Content Using a Refined Image Folksonomy.",
                    "Semantic Entity-Relationship Model for Large-Scale Multimedia News Exploration and Recommendation.",
                    "PageRank with Text Similarity and Video Near-Duplicate Constraints for News Story Re-ranking.",
                    "Learning Vocabulary-Based Hashing with AdaBoost.",
                    "Mediapedia: Mining Web Knowledge to Construct Multimedia Encyclopedia.",
                    "Sensing Geographical Impact Factor of Multimedia News Events for Localized Retrieval and News Filtering.",
                    "Travel Photo and Video Summarization with Cross-Media Correlation and Mutual Influence.",
                    "An Augmented Reality Tourist Guide on Your Mobile Devices.",
                    "Transfer Regression Model for Indoor 3D Location Estimation.",
                    "Personalized Sports Video Customization for Mobile Devices.",
                    "3D Thumbnails for Mobile Media Browser Interface with Autostereoscopic Displays.",
                    "Video Scene Segmentation Using Time Constraint Dominant-Set Clustering.",
                    "Automatic Nipple Detection Using Shape and Statistical Skin Color Information.",
                    "Asymmetric Bayesian Learning for Image Retrieval with Relevance Feedback.",
                    "Automatic Visualization of Story Clusters in TV Series Summary.",
                    "From Image Hashing to Video Hashing.",
                    "Which Tags Are Related to Visual Content?",
                    "Anchor Shot Detection with Diverse Style Backgrounds Based on Spatial-Temporal Slice Analysis.",
                    "The SLDSRC Rate Control Scheme for H.264.",
                    "Adaptively Adjusted Gaussian Mixture Models for Surveillance Applications.",
                    "Estimating Poses of World's Photos with Geographic Metadata.",
                    "Discriminative Image Hashing Based on Region of Interest.",
                    "Transformational Breathing between Present and Past: Virtual Exhibition System of the Mao-Kung Ting.",
                    "Learning Cooking Techniques from YouTube.",
                    "Adaptive Server Bandwidth Allocation for Multi-channel P2P Live Streaming.",
                    "Feature Subspace Selection for Efficient Video Retrieval.",
                    "A Novel Retrieval Framework Using Classification, Feature Selection and Indexing Structure.",
                    "Fully Utilized and Low Design Effort Architecture for H.264/AVC Intra Predictor Generation.",
                    "A Database Approach for Expressive Modeling and Efficient Querying of Visual Information.",
                    "A Multiple Instance Approach for Keyword-Based Retrieval in Un-annotated Image Database.",
                    "On the Advantages of the Use of Bitstream Extraction for Video Summary Generation.",
                    "Image Clustering via Sparse Representation.",
                    "A Parameterized Representation for the Cartoon Sample Space.",
                    "Enhancing Seeker-Bars of Video Players with Dominant Color Rivers.",
                    "AdVR: Linking Ad Video with Products or Service.",
                    "Searching and Recommending Sports Content on Mobile Devices.",
                    "Extended CBIR via Learning Semantics of Query Image.",
                    "A Gesture-Based Personal Archive Browser Prototype.",
                    "E-learning Web, Printing and Multimedia Format Generation Using Independent XML Technology.",
                    "Dynamic Video Collage.",
                    "VDictionary: Automatically Generate Visual Dictionary via Wikimedias.",
                    "Video Reference: A Video Question Answering Engine."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2009",
                "sub_name": "Advances in Multimedia Modeling, 15th International Multimedia Modeling Conference, MMM 2009, Sophia-Antipolis, France, January 7-9, 2009. Proceedings.",
                "count": 48,
                "papers": [
                    "Searching and Finding in Large Video Collections.",
                    "Structuring and Accessing Semantic Multimedia Data.",
                    "Adaptive Model for Integrating Different Types of Associated Texts for Automated Annotation of Web Images.",
                    "SenseCam Image Localisation Using Hierarchical SURF Trees.",
                    "General Highlight Detection in Sport Videos.",
                    "Probabilistic Integration of Tracking and Recognition of Soccer Players.",
                    "A Fast and Fully Format Compliant Protection of JPEG2000 Code-Streams.",
                    "Towards a New Image-Based Spectrogram Segmentation Speech Coder Optimised for Intelligibility.",
                    "Robust 3D Face Tracking on Unknown Users with Dynamical Active Models.",
                    "A Fast Hybrid Decision Algorithm for H.264/AVC Intra Prediction Based on Entropy Theory.",
                    "Low Complexity Video Compression Using Moving Edge Detection Based on DCT Coefficients.",
                    "Converting H.264-Derived Motion Information into Depth Map.",
                    "A Novel Approach for Fast and Accurate Commercial Detection in H.264/AVC Bit Streams Based on Logo Identification.",
                    "Bit Allocation for Spatio-temporal Wavelet Coding of Animated Semi-regular Meshes.",
                    "Modeling the Quantizer Behavior of Subbands for Data Rate Limitations in JPEG2000.",
                    "Performance and Waiting-Time Predictability Analysis of Design Options in Cost-Based Scheduling for Scalable Media Streaming.",
                    "Evaluating Streaming Rate Controllers: A Support Tool.",
                    "Graph-Based Pairwise Learning to Rank for Video Search.",
                    "Comparison of Feature Construction Methods for Video Relevance Prediction.",
                    "Large Scale Concept Detection in Video Using a Region Thesaurus.",
                    "Multimedia Evidence Fusion for Video Concept Detection via OWA Operator.",
                    "Personalized Image Recommendation.",
                    "Online Macro-segmentation of Television Streams.",
                    "A Real-Time Content Based Video Copy Detection System.",
                    "Active Objects in Interactive Mobile TV.",
                    "Sparse Multiscale Patches (SMP) for Image Categorization.",
                    "Multiple-Instance Active Learning for Image Categorization.",
                    "A New Multiple Kernel Approach for Visual Concept Learning.",
                    "Integrating Image Segmentation and Classification for Fuzzy Knowledge-Based Multimedia Indexing.",
                    "Variability Tolerant Audio Motif Discovery.",
                    "Key Estimation Using Circle of Fifths.",
                    "Feature Analysis and Normalization Approach for Robust Content-Based Music Retrieval to Encoded Audio with Different Bit Rates.",
                    "A Multimodal Constellation Model for Object Category Recognition.",
                    "Robust Visual Content Representation Using Compression Modes Driven Low-level Visual Descriptors.",
                    "Spatial Hierarchy of Textons Distributions for Scene Classification.",
                    "Approximate Retrieval with HiPeR: Application to VA-Hierarchies.",
                    "A Novel Multi-reference Points Fingerprint Matching Method.",
                    "HVPN: The Combination of Horizontal and Vertical Pose Normalization for Face Recognition.",
                    "3D Multimedia Data Search System Based on Stochastic ARG Matching Method.",
                    "3D Face Recognition Using R-ICP and Geodesic Coupled Approach.",
                    "Mining Association Patterns between Music and Video Clips in Professional MTV.",
                    "Semi-supervised Learning of Caricature Pattern from Manifold Regularization.",
                    "An Image Inpainting Algorithm Based on Local Geometric Similarity.",
                    "Evidence Theory-Based Multimodal Emotion Recognition.",
                    "Sketch-on-Map: Spatial Queries for Retrieving Human Locomotion Patterns from Continuously Archived GPS Data.",
                    "Personalized News Video Recommendation.",
                    "Facet-Based Browsing in Video Retrieval: A Simulation-Based Evaluation.",
                    "A User Experience Model for Home Video Summarization."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th MMM 2008",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2008",
                "sub_name": "Advances in Multimedia Modeling, 14th International Multimedia Modeling Conference, MMM 2008, Kyoto, Japan, January 9-11, 2008, Proceedings.",
                "count": 47,
                "papers": [
                    "A Novel Approach for Filtering Junk Images from Google Search Results.",
                    "Object-Based Image Retrieval Beyond Visual Appearances.",
                    "MILC2: A Multi-Layer Multi-Instance Learning Approach to Video Concept Detection.",
                    "An Implicit Active Contour Model for Feature Regions and Lines.",
                    "New Approach for Hierarchical Classifier Training and Multi-level Image Annotation.",
                    "Extracting Text Information for Content-Based Video Retrieval.",
                    "Real-Time Video Surveillance Based on Combining Foreground Extraction and Human Detection.",
                    "Detecting and Clustering Multiple Takes of One Scene.",
                    "An Images-Based 3D Model Retrieval Approach.",
                    "'Oh Web Image, Where Art Thou?'.",
                    "Complementary Variance Energy for Fingerprint Segmentation.",
                    "Similarity Search in Multimedia Time Series Data Using Amplitude-Level Features.",
                    "Sound Source Localization with Non-calibrated Microphones.",
                    "PriSurv: Privacy Protected Video Surveillance System Using Adaptive Visual Abstraction.",
                    "Distribution-Based Similarity for Multi-represented Multimedia Objects.",
                    "A Multimodal Input Device for Music Authoring for Children.",
                    "Free-Shaped Video Collage.",
                    "Aesthetics-Based Automatic Home Video Skimming System.",
                    "Using Fuzzy Lists for Playlist Management.",
                    "Tagging Video Contents with Positive/Negative Interest Based on User's Facial Expression.",
                    "Snap2Play: A Mixed-Reality Game Based on Scene Identification.",
                    "Real-Time Multi-view Object Tracking in Mediated Environments.",
                    "Reconstruct 3D Human Motion from Monocular Video Using Motion Library.",
                    "Appropriate Segment Extraction from Shots Based on Temporal Patterns of Example Videos.",
                    "Fast Segmentation of H.264/AVC Bitstreams for On-Demand Video Summarization.",
                    "Blurred Image Detection and Classification.",
                    "Cross-Lingual Retrieval of Identical News Events by Near-Duplicate Video Segment Detection.",
                    "Web Image Gathering with a Part-Based Object Recognition Method.",
                    "A Query Language Combining Object Features and Semantic Events for Surveillance Video Retrieval.",
                    "Semantic Quantization of 3D Human Motion Capture Data Through Spatial-Temporal Feature Extraction.",
                    "Fast Intermode Decision Via Statistical Learning for H.264 Video Coding.",
                    "A Novel Motion Estimation Method Based on Normalized Cross Correlation for Video Compression.",
                    "Curved Ray-Casting for Displacement Mapping in the GPU.",
                    "Emotion-Based Music Visualization Using Photos.",
                    "LightCollabo: Distant Collaboration Support System for Manufacturers.",
                    "Accurate Identifying Method of JPEG2000 Images for Digital Cinema.",
                    "Optimization of Spatial Error Concealment for H.264 Featuring Low Complexity.",
                    "Temporal Error Concealment for H.264 Using Optimum Regression Plane.",
                    "Transform Domain Wyner-Ziv Codec Based on Turbo Trellis Codes Modulation.",
                    "Selective Sampling Based on Dynamic Certainty Propagation for Image Retrieval.",
                    "Local Radon Transform and Earth Mover's Distances for Content-Based Image Retrieval.",
                    "Content Based Querying and Searching for 3D Human Motions.",
                    "Bi-modal Conceptual Indexing for Medical Image Retrieval.",
                    "Audio Analysis for Multimedia Retrieval from a Ubiquitous Home.",
                    "Effectiveness of Signal Segmentation for Music Content Representation.",
                    "Probabilistic Estimation of a Novel Music Emotion Model.",
                    "Acoustic OFDM: Embedding High Bit-Rate Data in Audio."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th MMM 2007",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2007-1",
                "sub_name": "Advances in Multimedia Modeling, 13th International Multimedia Modeling Conference, MMM 2007, Singapore, January 9-12, 2007. Proceedings, Part I.",
                "count": 76,
                "papers": [
                    "Temporal Video Segmentation on H.264/AVC Compressed Bitstreams.",
                    "Ontology-Based Annotation of Paintings Using Transductive Inference Framework.",
                    "Interactive Visual Object Extraction Based on Belief Propagation.",
                    "Modeling Modifications of Multimedia Learning Resources Using Ontology-Based Representations.",
                    "Region-Based Reconstruction for Face Hallucination.",
                    "A Shape Distribution for Comparing 3D Models.",
                    "3D Facial Modeling for Animation: A Nonlinear Approach.",
                    "Normalization and Alignment of 3D Objects Based on Bilateral Symmetry Planes.",
                    "Extraction of Anatomic Structures from Medical Volumetric Images.",
                    "Dual-Space Pyramid Matching for Medical Image Classification.",
                    "An Image Registration Method Based on the Local and Global Structures.",
                    "Automated Segmentation of Drosophila RNAi Fluorescence Cellular Images Using Graph Cuts.",
                    "Recommendation of Visual Information by Gaze-Based Implicit Preference Acquisition.",
                    "The 3D Sensor Table for Bare Hand Tracking and Posture Recognition.",
                    "Legible Collaboration System Design.",
                    "Presentation of Dynamic Maps by Estimating User Intentions from Operation History.",
                    "An Object Tracking Scheme Based on Local Density.",
                    "Modeling Omni-Directional Video.",
                    "Temporally Integrated Pedestrian Detection from Non-stationary Video.",
                    "Visual Perception Theory Guided Depth Motion Estimation.",
                    "Adaptive Data Retrieval for Load Sharing in Clustered Video Servers.",
                    "A User-Friendly News Contents Adaptation for Mobile Terminals.",
                    "An Efficient Predictive Coding of Integers with Real-Domain Predictions Using Distributed Source Coding Techniques.",
                    "A Distributed Video Coding Scheme Based on Denoising Techniques.",
                    "Fusion of Region and Image-Based Techniques for Automatic Image Annotation.",
                    "Automatic Refinement of Keyword Annotations for Web Image Search.",
                    "Mining Multiple Visual Appearances of Semantics for Image Annotation.",
                    "Automatic Video Annotation and Retrieval Based on Bayesian Inference.",
                    "Density-Based Image Vector Quantization Using a Genetic Algorithm.",
                    "Multilayered Contourlet Based Image Compression.",
                    "Iterative Image Coding Using Hybrid Wavelet-Based Triangulation.",
                    "A Novel Video Coding Framework by Perceptual Representation and Macroblock-Based Matching Pursuit Algorithm.",
                    "MetaXa - Context- and Content-Driven Metadata Enhancement for Personal Photo Books.",
                    "Context-Sensitive Ranking for Effective Image Retrieval.",
                    "Visual Verification of Historical Chinese Calligraphy Works.",
                    "Discovering User Information Goals with Semantic Website Media Modeling.",
                    "Online Surveillance Video Archive System.",
                    "Hierarchical Indexing Structure for 3D Human Motions.",
                    "Similarity Searching Techniques in Content-Based Audio Retrieval Via Hashing.",
                    "Fast Answering k- Nearest-Neighbor Queries over Large Image Databases Using Dual Distance Transformation.",
                    "Subtrajectory-Based Video Indexing and Retrieval.",
                    "DR Image and Fractal Correlogram: A New Image Feature Representation Based on Fractal Codes and Its Application to Image Retrieval.",
                    "Cross-Modal Interaction and Integration with Relevance Feedback for Medical Image Retrieval.",
                    "A New Multi-view Learning Algorithm Based on ICA Feature for Image Retrieval.",
                    "A P2P Architecture for Multimedia Content Retrieval.",
                    "Optimizing the Throughput of Data-Driven Based Streaming in Heterogeneous Overlay Network.",
                    "LSONet: A Case of Layer-Encoded Video Transmission in Overlay Networks.",
                    "A Strategyproof Protocol in Mesh-Based Overlay Streaming System.",
                    "Utility-Based Summarization of Home Videos.",
                    "Performance Analysis of Multiple Classifier Fusion for Semantic Video Content Indexing and Retrieval.",
                    "Video Semantic Concept Detection Using Multi-modality Subspace Correlation Propagation.",
                    "Enhancing Comprehension of Events in Video Through Explanation-on-Demand Hypervideo.",
                    "Low-Complexity Binaural Decoding Using Time/Frequency Domain HRTF Equalization.",
                    "Complexity Reduction of Multi-frame Motion Estimation in H.264.",
                    "A Novel Intra/Inter Mode Decision Algorithm for H.264/AVC Based on Spatio-temporal Correlation.",
                    "Switchable Bit-Plane Coding for High-Definition Advanced Audio Coding.",
                    "Neighborhood Graphs for Semi-automatic Annotation of Large Image Databases.",
                    "Bridging the Gap Between Visual and Auditory Feature Spaces for Cross-Media Retrieval.",
                    "Film Narrative Exploration Through the Analysis of Aesthetic Elements.",
                    "Semantic Image Segmentation with a Multidimensional Hidden Markov Model.",
                    "Semi-supervised Cast Indexing for Feature-Length Films.",
                    "Linking Identities and Viewpoints in Home Movies Based on Robust Feature Matching.",
                    "An Efficient Automatic Video Shot Size Annotation Scheme.",
                    "Content Based Web Image Retrieval System Using Both MPEG-7 Visual Descriptors and Textual Information.",
                    "A New Method to Improve Multi Font Farsi/Arabic Character Segmentation Results: Using Extra Classes of Some Character Combinations.",
                    "Modeling Television Schedules for Television Stream Structuring.",
                    "Automatic Generation of Multimedia Tour Guide from Local Blogs.",
                    "A Robust 3D Face Pose Estimation and Facial Expression Control for Vision-Based Animation.",
                    "Hierarchical Shape Description Using Skeletons.",
                    "Motion Structure Parsing and Motion Editing in 3D Video.",
                    "Tamper Proofing 3D Motion Data Streams.",
                    "A Uniform Way to Handle Any Slide-Based Presentation: The Universal Presentation Controller.",
                    "A Tensor Voting for Corrupted Region Inference and Text Image Segmentation.",
                    "A Novel Coarse-to-Fine Adaptation Segmentation Approach for Cellular Image Analysis.",
                    "Vehicle Classification from Traffic Surveillance Videos at a Finer Granularity.",
                    "A Fuzzy Segmentation of Salient Region of Interest in Low Depth of Field Image."
                ]
            },
            {
                "sub_name_abbr": "conf/mmm/2007-2",
                "sub_name": "Advances in Multimedia Modeling, 13th International Multimedia Modeling Conference, MMM 2007, Singapore, January 9-12, 2007. Proceedings, Part II.",
                "count": 80,
                "papers": [
                    "Real-Time Streaming Audio Codecs for QoS Benchmarking Purposes.",
                    "Exploiting Video Stream Similarity for Energy-Efficient Decoding.",
                    "Optimization of System Performance for DVC Applications with Energy Constraints over Ad Hoc Networks.",
                    "Distributed Video Coding with Trellis Coded Quantization.",
                    "An Efficient VLSI Architecture for Full-Search Variable Block Size Motion Estimation in H.264/AVC.",
                    "A Secure and Robust Wavelet-Based Hashing Scheme for Image Authentication.",
                    "Automatic TV Logo Detection, Tracking and Removal in Broadcast Video.",
                    "Automatic Detection and Recognition of Athlete Actions in Diving Video.",
                    "Event Detection Models Using 2d-BN and CRFs.",
                    "Video Histogram: A Novel Video Signature for Efficient Web Video Duplicate Detection.",
                    "VOD Multicast Using CIWP and P2P Partial Stream Transfer.",
                    "Multimedia Service Composition for Context-Aware Mobile Computing.",
                    "Characterizing User Behavior Model to Evaluate Hard Cache in Peer-to-Peer Based Video-on-Demand Service.",
                    "Cooperative Caching for Peer-Assisted Video Distribution.",
                    "Metadata Management, Reuse, Inference and Propagation in a Collection-Oriented Metadata Framework for Digital Images.",
                    "Confidence Building Among Correlated Streams in Multimedia Surveillance Systems.",
                    "Boosting Cross-Media Retrieval by Learning with Positive and Negative Examples.",
                    "Searching the Video: An Efficient Indexing Method for Video Retrieval in Peer to Peer Network.",
                    "Integrating Semantic Templates with Decision Tree for Image Semantic Learning.",
                    "Neural Network Combining Classifier Based on Dempster-Shafer Theory for Semantic Indexing in Video Content.",
                    "Efficient Search with Changing Similarity Measures on Large Multimedia Datasets.",
                    "MuSQL: A Music Structured Query Language.",
                    "Hardware Accelerated Skin Deformation for Animated Crowds.",
                    "Multimedia Web Services for an Object Tracking and Highlighting Application.",
                    "A Novel Melody Line Identification Algorithm for Polyphonic MIDI Music.",
                    "Markerless Augmented Reality Using a Robust Point Transferring Method.",
                    "Accurate 3D Facial Synthesis for Plastic Surgery Simulation.",
                    "Generic 3-D Modeling for Content Analysis of Court-Net Sports Sequences.",
                    "Using Camera Calibration and Radiosity on GPU for Interactive Common Illumination.",
                    "The Study of Detecting for IR Weak and Small Targets Based on Fractal Features.",
                    "Visual Features Extraction Through Spatiotemporal Slice Analysis.",
                    "High Quality Color Interpolation for Color Filter Array with Low Complexity.",
                    "A Two-Level Matching Scheme for Speedy and Accurate Palmprint Identification.",
                    "Improving Quality of Live Streaming Service over P2P Networks with User Behavior Model.",
                    "Coopetitive Multimedia Surveillance.",
                    "Efficient H.264/AVC Video Encoder Where Pattern Is Used as Extra Mode for Wide Range of Video Coding.",
                    "Performance Enhancement of Error Resilient Entropy Coding on Block Based Bitstream of SPIHT.",
                    "FIDP: A Novel Architecture for Lifting-Based 2D DWT in JPEG2000.",
                    "Analysis of Monotonic Responsive Functions for Congestion Control.",
                    "A Computational Estimate of the Physical Effort in Human Poses.",
                    "A Matching-Based Approach for Human Motion Analysis.",
                    "Face Recognition Using Kernel Uncorrelated Discriminant Analysis.",
                    "Recognition of SAR Occluded Targets Using SVM.",
                    "Discovery of Image Versions in Large Collections.",
                    "User-Friendly Image Sharing in Multimedia Database Using Polynomials with Different Primes.",
                    "Accelerating Non-photorealistic Video Effects Using Compressed Domain Processing.",
                    "A Color Image Hiding Scheme Based on SMVQ and Modulo Operator.",
                    "Computer Interface to Use Eye and Mouse Movement.",
                    "Advanced Agent-Delegated Route Optimization Protocol for Efficient Multimedia Services at Low-Battery Devices.",
                    "A Study on Key Distribution and ID Registration in the AAA System for Ubiquitous Multimedia Environments.",
                    "A Distributed Broadcast Algorithm for Wireless Mobile Ad Hoc Networks.",
                    "Dynamic MAP Selection Scheme in HMIPv6 Network.",
                    "A New Fingerprinting Codes for Multimedia Contents.",
                    "Content and Location Addressable Overlay Network for Wireless Multimedia Communication.",
                    "A Centralized-Abstraction and Replicated-View Architecture Running on Ubiquitous Networks for Collaborative Multimedia Distance Education Services.",
                    "Asymmetric Link Dynamic Routing Algorithm for Ubiquitous Multimedia Services.",
                    "Building Detection in Augmented Reality Based Navigation System.",
                    "Local Authentication Scheme Based on AAA in Mobile IPv6 Networks.",
                    "Handover-Specific Optimization for IEEE 802.16e Sleep Mode.",
                    "An Improvement of the Processing Delay for the G.723.1 Vocoder.",
                    "Functional Architecture of Performance Measurement System Based on Grid Monitoring Architecture.",
                    "Adaptive Synchronization Scheme Using Terminal Buffering in Mobile Multimedia Networks.",
                    "Educational Information System Using Two Phase Feature Extract in u-Learning Environment.",
                    "Gradient Method for the Estimation of Travel Demand Using Traffic Counts on the Large Scale Network.",
                    "A New Distortion Correction Method for the Maps of Public Land of Korea.",
                    "Establishment of Car Following Theory Based on Fuzzy-Based Sensitivity Parameters.",
                    "Development of Model for Highway Design Consistency Evaluation with Artificial Neural Network.",
                    "Conversion Mechanism for MPEG-4 Contents Services on Web Environment.",
                    "P2P Multimedia Sharing over MANET.",
                    "A Hybrid MAC Protocol Based on Implicit Token and CSMA/CA for Wireless Network.",
                    "The Vehicle Location Tracking System Using Wireless Network.",
                    "A Representation of Korean Syllable Characters Defined in Hunminjeongeum.",
                    "A Study on the Accelerator for Efficient Distribution of the Multimedia Content.",
                    "A Study on Analysis of the Web-Object Reference Characteristics on the Web System.",
                    "Design and Performance Analysis of the Web Caching Algorithm for Performance Improvement of the Response Speed.",
                    "Induction and Implementation of Security Requirements in Each System Block.",
                    "TD-CDMA Systems Using Turbo Code for Mobile Multimedia Services.",
                    "Textual Communication in Virtual Environments for Real World Interaction.",
                    "Managing Transformations and Events in Networked Virtual Environments.",
                    "Scalable Vector Graphics Pattern P2P-Service for Enhanced Barrier-Free Web Applications."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "12th MMM 2006",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2006",
                "sub_name": "12th International Conference on Multi Media Modeling (MMM 2006), 4-6 January 2006, Beijing, China.",
                "count": 87,
                "papers": [
                    "Sports video analysis.",
                    "Achievements and remaining challenges in multimedia data modeling.",
                    "Multimedia search - Microsoft's perspective.",
                    "Perceptual rhythm determination of music signal for emotion-based classification.",
                    "Development of realistic applications based on explicit event detection in broadcasting baseball videos.",
                    "Narrative structure detection through audio pace.",
                    "Determining shot assonance/dissonance via salience maps and the match frame principle of continuity editing.",
                    "A multimedia user preference model that supports semantics and its application to MPEG 7/21.",
                    "Towards universal and statistical-driven heuristics for automatic classification of sports video events.",
                    "A new framework for video cut and paste.",
                    "A semi-supervised incremental learning framework for sports video view classification.",
                    "Flexible video coding scheme for content-based video storage and retrieval.",
                    "Robust abnormity detecting and tracking using correlation coefficient.",
                    "Experiences on peer to peer based live video steaming.",
                    "An improved distortion model for rate control of DCT-based video coding.",
                    "On-line multimedia courseware authoring system.",
                    "A real-time interactive shared system for distance learning.",
                    "Real-time 3D fire simulation using a spring-mass model.",
                    "An attention based spatial adaptation scheme for H.264 videos on mobiles.",
                    "Image model based on salient regions and its applications.",
                    "Affective content detection in sitcom using subtitle and audio.",
                    "A semantic based pre-fetch scheme for SMIL presentation proxy-delivery.",
                    "Color-based skin detection: survey and evaluation.",
                    "Semantic image retrieval and auto-annotation by converting keyword space to image space.",
                    "An approach for cross-media retrieval with cross-reference graph and PageRank.",
                    "Shape matching in pose reconstruction using shape context.",
                    "Shot segmentation based on the encoder signature.",
                    "JPEG2000-based viewer guidance for mobile image browsing.",
                    "Multi-faceted contextual model for person identification in news video.",
                    "Modeling of Web-based collaborative negotiation systems using colored Petri net.",
                    "Adaptive photon clustering method based on quadtree structure for dynamic scenes.",
                    "Detailed audiovisual profile: enabling interoperability between MPEG-7 based systems.",
                    "A novel data hiding scheme for keeping high stego-image quality.",
                    "Multimedia and metadata watermarking driven by application constraints.",
                    "New facilities for presenting and authoring MPEG-4 documents.",
                    "Combining long-term learning and active learning with semi-supervised method for content-based image retrieval.",
                    "A linear system of equations with constraints for multipoint queries in image retrieval.",
                    "Study on texture feature extraction in region-based image retrieval system.",
                    "Bayesian kernel inference for 2D objects recognition based on normalized curvature.",
                    "Efficient implementation of vector quantization for image retrieval.",
                    "Keep region for constructing LOD of terrain regular mesh.",
                    "A flexible service-oriented architecture for cross-enterprise business integration and cooperation.",
                    "Energy-efficient transmission over a wireless link with optimal selection for bit-planes.",
                    "A computer-aided style stroke extraction system for \"Dun Huang\" frescoes.",
                    "Matching 3D models with global geometric feature map.",
                    "Content based image retrieval using topological models.",
                    "Motion synthesis in motion reconstruction based on video.",
                    "Image segmentation by aggregation graph-cuts.",
                    "Implementation of streamed multimedia integrated courseware.",
                    "QoS model of Web adaptation server for heterogeneous terminals.",
                    "Stochastic collision detection between deformable models using particle swarm optimization algorithm.",
                    "Bit rate reduction of H.264/AVC video coding for mobile applications.",
                    "Discrimination and retrieval of animal sounds.",
                    "Similarity based image inpainting method.",
                    "AM-ESEDE: an adaptive model of enterprise spreadsheet engine in distributed environment.",
                    "Compact discrete polar coordinates transform for the restoration of rotational blurred image.",
                    "Motion and haar-like features based vehicle detection.",
                    "History-based visual mining of semi-structured audio and text.",
                    "An embedded 4-channel real-time multimedia coding system.",
                    "Robustness evaluation of the basic descriptors for audio indexing.",
                    "A novel regions-of-interest based image retrieval using multiple features.",
                    "Self-synchronization adaptive blind audio watermarking.",
                    "Information capacity of quantization steganography in the presence of active attack.",
                    "Effective similarity search in multimedia databases using multiple representations.",
                    "Hierarchically multi-modal indexing of soccer video.",
                    "News video story segmentation.",
                    "A SVM-based personal recommendation system for TV programs.",
                    "Digital image watermarking algorithm based on CDMA spread spectrum.",
                    "Concept hypotaxis semantic network: a knowledge representation model for multimedia data mining.",
                    "Automatic \"Go\" record generation from a TV program.",
                    "A robust object shape prediction algorithm in the presence of white Gaussian noise.",
                    "Error robustness scheme for H.264 based on LDPC code.",
                    "Improvements of the definition of image fidelity.",
                    "Image retrieval based on user-specified features in queries with multiple examples.",
                    "Tracking objects in an indoor environment using 3D models.",
                    "Sensitivity evaluation of SNoW and SVM based face detection methods.",
                    "Motion clustering for similar video segments mining.",
                    "A blog search method using news video scene order.",
                    "Sonification guidelines facilitating an intuitive and rapid understanding/interpretation.",
                    "TRAED: speech audio editing using imperfect transcripts.",
                    "Multimedia communication in wireless environment.",
                    "A comparative study of computational value in visual cues used in positioning 3D objects.",
                    "A Prism Based Single-Lens Multi-Ocular Stereo lmage Capture System.",
                    "A p2p scheme for live media stream multicast.",
                    "Video mining: concepts, approaches and applications.",
                    "Harmonic data placement: file system support for scalable streaming.",
                    "Interactive television and the role of affective usability."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th MMM 2005",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2005",
                "sub_name": "11th International Conference on Multi Media Modeling (MMM 2005), 12-14 January 2005, Melbourne, Australia.",
                "count": 64,
                "papers": [
                    "Believability and Interaction in Virtual Worlds.",
                    "Digitizing Personal Experiences: Capture and Retrieval of Life Log.",
                    "Content-Based Retrieval of 3D Models: Feature Extraction and Representation.",
                    "Audio Indexing for Efficient Music Information Retrieval.",
                    "Music Key Detection for Musical Audio.",
                    "Generative and Discriminative Modeling toward Semantic Context Detection in Audio Tracks.",
                    "Cyber Composer: Hand Gesture-Driven Intelligent Music Composition and Generation.",
                    "Generic Audio Classification Using a Hybrid Model Based on GMMs and HMMs.",
                    "Semantic Video Summarization Using Mutual Reinforcement Principle and Shot Arrangement Patterns.",
                    "Retrieval of News Video Using Video Sequence Matching.",
                    "Direct Fingerprinting on Multicasting Compressed Video.",
                    "A Framework for Sub-Window Shot Detection.",
                    "Video Snapshot: A Bird View of Video Sequence.",
                    "Analyzing Tennis Tactics from Broadcasting Tennis Video Clips.",
                    "Sports Video Mining with Mosaic.",
                    "A Generic Framework for Semantic Sports Video Analysis Using Dynamic Bayesian Networks.",
                    "COSMOS-7: A Video Content Modeling Framework for MPEG-7.",
                    "Multilevel Quadratic Variation Minimization for 3D Face Modeling and Virtual View Synthesis.",
                    "Realistic 3D Face Modeling by Fusing Multiple 2D Images.",
                    "Color Time Petri Net for Interactive Adaptive Multimedia Objects.",
                    "Performance Study of Gabor Filters and Rotation Invariant Gabor Filters.",
                    "Effective Feature Extraction for Play Detection in American Football Video.",
                    "Subspace Clustering and Label Propagation for Active Feedback in Image Retrieval.",
                    "Region-Based Image Retrieval with High-Level Semantic Color Names.",
                    "Paving the Last Mile for Multi-Channel Multimedia Presentation Generation.",
                    "An Intelligent Middleware for Dynamic Integration of Heterogeneous Health Care Applications.",
                    "ASAP: A Synchronous Approach for Photo Sharing across Multiple Devices.",
                    "Dissemination of Cultural Heritage Content through Virtual Reality and Multimedia Techniques: A Case Study.",
                    "WS-QBE: A QBE-Like Query Language for Complex Multimedia Queries.",
                    "Parallel Image Matrix Compression for Face Recognition.",
                    "Recognition of Enhanced Images.",
                    "Learning No-Reference Quality Metric by Examples.",
                    "Grouping WWW Image Search Results by Novel Inhomogeneous Clustering Method.",
                    "A Cooperative Image Editing Tool over Mobile Phones.",
                    "A Graphical User Interface for Automatic Facial Texture Mapping Based on Orthogonal Photos.",
                    "Semantic Virtual Environments with Adaptive Multimodal Interfaces.",
                    "Fast Screening in Large Face Databases Using Merit-Based Dominant Points.",
                    "Interoperability and Multimedia Archives.",
                    "A Wireless Layered Multicast Congestion Control Protocol for Multimedia.",
                    "Feature Relevance Learning in Content-Based Image Retrieval Using GRA.",
                    "An Interactive Camera Planning System for Automatic Cinematographer.",
                    "Improved Perceptual Tempo Detection of Music.",
                    "A Novel Approach to Auto Image Annotation Based on Pairwise Constrained Clustering and Semi-Naïve Bayesian Model.",
                    "Browsing Texture Image Databases.",
                    "Feature Combination and Relevance Feedback for 3D Model Retrieval.",
                    "Semantic-Sensitive Classification for Large Image Libraries.",
                    "Using Games As a Means for Collaboration.",
                    "Database Support for Haptic Exploration in Very Large Virtual Environments.",
                    "Gigabit Ethernet-Based Parallel Video Processing.",
                    "Gradual Transition Detection Using EM Curve Fitting.",
                    "Generative Sound Models.",
                    "A Novel Approach of 3D Reconstruction of Human Face Using Monocular Camera.",
                    "A Metadata Model Supporting Scalable Interactive TV Services.",
                    "A Model for Meeting Content Storage and Retrieval .",
                    "Modeling of Output Constraints in Multimedia Database Systems.",
                    "Meta Data Extraction from Linguistic Meeting Transcripts for the Annodex File Format.",
                    "Compositional Architecture Pattern for QoS-Oriented Communication Mechanisms.",
                    "A Structured Document Model for Authoring Video-Based Hypermedia.",
                    "Framework for Script Based Virtual Directing and Multimedia Authoring in Live Video Streaming.",
                    "A Community-Based Recommendation System to Reveal Unexpected Interests.",
                    "Conceptual Modeling of Web Application Transactions: Towards a Revised and Extended Version of the UWA Transaction Design Model.",
                    "Image Mining and Retrieval Using Hierarchical Support Vector Machines.",
                    "A Fuzzy Expert System for Concept-Based Image Indexing and Retrieval.",
                    "Interactive Visual Retrieval System for Large Scale 3D Models Database."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th MMM 2004",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2004",
                "sub_name": "10th International Multimedia Modeling Conference (MMM 2004), 5-7 January 2004, Brisbane, Australia.",
                "count": 63,
                "papers": [
                    "Non-Uniform Sampling for Image-Based Rendering: Convergence of Image, Vision, and Graphic.",
                    "Adaptive Content Delivery on Mobile Internet across Multiple Form Factor.",
                    "Single Model Face Database Retrieval by Directional Corner Points.",
                    "A Multimodal Database Framework for Multimedia Meeting Annotations.",
                    "Intention -based Image Retrieval with or without a Query Image.",
                    "A Multimedia Document Database Model Based on Multi-Layered Description Supporting Complex Multimedia Structural and Semantic Contents.",
                    "Audio Segmentation and Classification based on a Selective Analysis Scheme.",
                    "Applying Timed-Arc Petri Nets to improve the performance of the MPEG-2 Encoding Algorithm.",
                    "Wavelet Directional Histograms for Classification of Human Gestures Represented by Spatio-Temporal Templates.",
                    "Motion Vector Encryption in Multimedia Streaming.",
                    "A High Robust Watermarking Technique Using Sub-Band Filtering.",
                    "A Music Data Model and its Application.",
                    "Applying Speech Interface to Mahjong Gam.",
                    "Detection of Critical Points for Shape Metamorphosis Animation.",
                    "Lip-Sync in Human Face Animation Based on Video Analysis and Spline Models.",
                    "Discovering Semantics from Visualizations of Film Takes.",
                    "Multi-Level Video Representation with Application to Keyframe Extraction.",
                    "Segmentation of Intentional Human Gestures for Sports Video Annotation.",
                    "Pose determination and viewpoint determination of human head in video conferencing based on head movement.",
                    "A Bayesian framework for automated dataset retrieval in Geographic Information Systems.",
                    "Two Hybrid Multicast Algorithms for Optimizing Resources in a Distributed VoD System.",
                    "UML-SDL modelling of the FPTP QoS oriented transport protocol.",
                    "Architectural Description of QoS Provisioning for Multimedia Application Support.",
                    "A Framework of Semantic-based Agents to Support Designing in Virtual Environments.",
                    "A 3D Geometric Deformable Model for Tubular Structure Segmentation.",
                    "The Extraction of Text/Graphs from Degraded Documents.",
                    "Decomposing Polygon Meshes by Means of Critical Points.",
                    "Large Block Inpainting by Color Continuation Analysis.",
                    "LOD Modelling of Polygonal Models Based on Multiple Choice Optimization.",
                    "Advanced Metamorphosis Based on Bounded Space-time Blending.",
                    "Synthesis of Images of Historical Documents for Web Visualization.",
                    "Segmentation on Color Images Based on Watershed Algorithm.",
                    "Content-based Comparison of Image Collections via Distance Measuring of Self-organised Maps.",
                    "A Tonal Features Exploration Algorithm with Independent Component Analysis.",
                    "A Learning-based Approach for Annotating Large On-Line Image Collection.",
                    "Modelling Traditional Chinese Paintings for Content-Based Image Classification and Retrieval.",
                    "Multi-camera and Multi-projector based Seamless Live Image Display System.",
                    "Effects of Different Gabor Filter Parameters on Image Retrieval by Texture.",
                    "Efficient and Effective Content-Based Image Retrieval using Space Transformation.",
                    "Automatic Texture Segmentation for Texture-based Image Retrieval.",
                    "Conceptual Modeling of Data Intensive and Information Intensive Web Applications.",
                    "Collaborative Hypertext Editing in Mobile Environment.",
                    "An Efficient Caching Mechanism for XML Content Adaptation.",
                    "An Agent-Architecture for Implementing a Virtual Inhabitant.",
                    "Obtaining the Service Language for H.245's Multimedia Capability Exchange Signalling Protocol: the Final Step.",
                    "A Hierarchical Signature Scheme for Robust Video Authentication using Secret Sharing.",
                    "Real-Time Face Detection in Color Video.",
                    "FilmEd - Collaborative Video Indexing, Annotation and Discussion Tools Over Broadband Networks.",
                    "Implicit Concept-based Image Indexing and Retrieval.",
                    "SampLe: Towards a Framework for System-supported Multimedia Authoring.",
                    "An Intelligent Image Retrieval System using XML.",
                    "Cuypers Meets Users: Implementing a User Model Architecture for Multimedia Presentation Generation.",
                    "An Implementation of a Game Engine for Air Combat Simulation.",
                    "Image Arrangement Paradigm for Eye Contact Videoconference.",
                    "Taming the roving camera: A framework for creating professional home movies through narrative and cinesthetic elements.",
                    "Recognition of Human Actions Using Moment Based Features and Artificial Neural Networks.",
                    "Visual Hand Gestures Classification Using Temporal Motion Templates and Wavelet Transforms.",
                    "Creating Meaningful Multimedia with The Multimedia Design and Planning Pyramid.",
                    "Thematic Design and Efficiency in Virtual Environments Using Metaphors.",
                    "Visual Hand Gestures Classification Using Temporal Motion Templates.",
                    "Modeling of Moving Objects and Querying Videos by Trajectories.",
                    "A Semi-Fragile Watermark Scheme For Image Authentication.",
                    "Ann-e-mod - A Three-Dimensional Storyboarding Software."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th MMM 2003",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/2003",
                "sub_name": "9th International Conference on Multi-Media Modeling, MMM 2003, Taiwan, January 7-10, 2003, Proceedings.",
                "count": 29,
                "papers": [
                    "Semantics in Multimedia Systems.",
                    "An Improved Method for Image Retrieval Using Speech Annotation.",
                    "Emergence Index - An Approach to Content-based Image Retrieval.",
                    "Modeling Data and User Characteristics by Peer Indexing in Content-based Image Retrieval.",
                    "ASIA: An Automatic Annotation Technique for Query-by-Concept in Image Retrieval Systems.",
                    "Real-time Pattern Isolation and Recognition Over Immersive Sensor Data Streams.",
                    "XQOS: XML-based QoS Specification Language.",
                    "Universal Background Models for Real-time Speaker Change Detection.",
                    "Controlling Virtual Humans Using PDAs.",
                    "Modeling Video Data for Content Based Queries: Extending the DISIMA Image Data Model.",
                    "Semantic Video Annotation and Vague Query.",
                    "Contextual Information Extraction for Video Data.",
                    "ATMRA: An Automatic Temporal Multi-resolution Analysis Framework for Shot Boundary Detection.",
                    "Emotional Communication with Virtual Humans.",
                    "A Data Management Scheme for Effective Walkthrough in Complex Virtual Environments.",
                    "On Generating Virtual Worlds from Domain Ontologies.",
                    "A 3D Shape Matching Method with Neural Networks.",
                    "An Efficient Block-based Scheme for Progressively Transmitting Lossless Images.",
                    "The Improvement of Steganography Capacity.",
                    "A Framework for Reuse From Animation Multi-Databases.",
                    "XML-Based Multimedia Query System.",
                    "Modeling and Visualization of Bioelectric Phenomena of the Heart.",
                    "2D Shape Transformation Using 3D Blending.",
                    "From Region Features to Semantic Labels: a Probabilistic Approach.",
                    "Image Adaptation Based on Attention Model for Small-Form-Factor Device.",
                    "An End-to-End Resource Scheduling Scheme for the Presentation of Composite Multimedia Information in a Networked Environment.",
                    "Strategies for Multimedia Delivery on a Linear Multilevel Caching System.",
                    "Application Framework Supporting Distributed Multimedia System Development.",
                    "Optimal Resource Allocation with Mixed Use of M/M/1/K and /M/M/m/K Queueing Systems in Video-on-Demand Systems."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th MMM 2001",
        "info": "Amsterdam, The Netherlands",
        "venues": []
    },
    {
        "year": "2000",
        "name": "7th MMM 2000",
        "info": "Nagano, Japan",
        "venues": []
    },
    {
        "year": "1999",
        "name": "6th MMM 1999",
        "info": "Ottawa, Canada",
        "venues": []
    },
    {
        "year": "1998",
        "name": "5th MMM 1998",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/1998",
                "sub_name": "1998 MultiMedia Modeling (MMM '98), October 12-15, 1998, Lausanne, Switzerland, Proceedings.",
                "count": 28,
                "papers": [
                    "Invited Paper: Meme Media and Meme Market Architectures for the Reediting and Redistribution of Knowledge Resources.",
                    "Implementing Adaptability in the Standard Reference Model for Intelligent Multimedia Presentation Systems.",
                    "Formal Specification and Verification of Hypermedia Documents based on the Nested Context Model.",
                    "Meta-Data Modeling for Quality of Service (QoS) Management in the World Wide Web (WWW).",
                    "Relevance Feedback Techniques for Color-based Image Retrieval.",
                    "Color Co-occurence Descriptors for Querying-by-Example.",
                    "Multimedia Semantic Features and Image Content Description.",
                    "A Distributed Video Retrieval System Utilising Broadband Networked PC_s for Educational Applications.",
                    "Real-Time 3-D Head Motion Estimation in Facial Image Coding.",
                    "Simple Algorithms for Rational Time Speed Playback of a Standard Video Sequence.",
                    "Computer Generated Still Images Composited with Panned Landscape Video Sequences.",
                    "Multiviews Interfaces for Multimedia Authoring Environments.",
                    "WWW Fisheye-View Graphical Browser.",
                    "3D Data Visualization on the Web.",
                    "N-TSVS: a Videoconference Tool for Generic Cooperative Groups.",
                    "Object Assignment Strategy for Distributed Multimedia Systems.",
                    "Temporal Partial Order and Partial Reliability Service for Distributed Multimedia Applications.",
                    "Hybrid Participant Embodiments in Networked Collaborative Virtual Environment.",
                    "Autonomous Actors in Networked Collaborative Virtual Environments.",
                    "Topological Dress Making as Fashion Media Modeling.",
                    "Multiresolution Volume Data Structure for Shape Modeling.",
                    "A Dual Visualizer Method for Interactive Topology.",
                    "Invited Paper: Operator Localization of Virtual Objects.",
                    "An HDM Interpreter for On-Line Tutorials.",
                    "Interaction with a Projection Screen Using a Camera-tracked Laser Pointer.",
                    "A Virtual Reality Learning Environment Providing Access to Digital Museums.",
                    "An MPEG-4 Facial Animation System Driven by Synthetic Speech.",
                    "Comic Actors Representing Software Agents."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th MMM 1997",
        "info": "Singapore",
        "venues": []
    },
    {
        "year": "1996",
        "name": "3rd MMM 1996",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mmm/1996",
                "sub_name": "1996 MultiMedia Modeling: Towards The Information Society Superhighway, MMM 1996, Toulouse, France, November 12-15, 1996. Proceedings.",
                "count": 28,
                "papers": [
                    "Intelligent Multimedia Presentation Systems: A Proposal for a Reference Model.",
                    "Anchors and Links for Nested Composite Nodes.",
                    "Conceptual Modelling for Information Filtering in Broadcast Interactive Video Applications.",
                    "TeleSHOP: A Multimedia Communication Shopping System.",
                    "Multimedia Integration Into a Distance Learning Environment.",
                    "Models for Enforcing Multimedia Synchronization in Visioconference Applications.",
                    "Set-Based Hypermedia Modeling.",
                    "Spatial Reasoning Rules in Multimedia Management Systems.",
                    "Formal Model of Temporal Properties Underlying Multimedia Presentation.",
                    "Hypermedia Document Design Using the HTSPN Model.",
                    "A Leaves Initiated Resource Reservation Multicast Service for Group Delivery of Scaleable Multimedia Data over ATM Networks.",
                    "Optimizing Partially Ordered Transport Services for Multimedia Applications.",
                    "Synchronization Model in a Multimedia Client Server Architecture.",
                    "A Model for the Analysis of Intramedia Synchronization in a Multimedia Data Stream Served by an ATM Multiplexer.",
                    "Synchronization of Distributed Multimedia Systems with User Interactions.",
                    "Pseudo-Tree Data Structure for Content-Based Composition and Synchronization of Multimedia Presentations.",
                    "The Matilda Data Model and its Implications.",
                    "A Multimedia Information Object Model for Information Disclosure.",
                    "The Roles and Views of Multimedia Objects.",
                    "Conceptual Title Abstractions: Modeling and Querying Very Large Interactive Multimedia Repositories.",
                    "Using Domain Knowledge in Querying Image Databases.",
                    "Automatic Model Building from Images for Multimedia Systems.",
                    "A New Shape Distance for Content Based Image Retrieval.",
                    "IITB-VOD: A Video on Demand System for General Purpose Workstations.",
                    "Evaluations of Soft Real-Time Handling Methods in a Soft Real-Time Framework.",
                    "Statistical Admission Control in Video Servers with Constant Data Length Retrieval of VBR Streams.",
                    "Holographic Images in Multimedia Information Systems.",
                    "Autonomous Entities in Distributed Virtual Environments."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "2nd MMM 1995",
        "info": "Singapore",
        "venues": []
    },
    {
        "year": "1993",
        "name": "1st MMM 1993",
        "info": "Singapore",
        "venues": []
    }
]