[
    {
        "name": "MS",
        "year": "2022",
        "info": "Volume 28, 2022",
        "count": 25,
        "papers": [
            "A new, enhanced EZW image codec with subband classification.",
            "Music mood and human emotion recognition based on physiological signals: a systematic review.",
            "Visible light polarization image desmogging via Cycle Convolutional Neural Network.",
            "Scale-aware attention-based multi-resolution representation for multi-person pose estimation.",
            "Efficient and high-performance pedestrian detection implementation for intelligent vehicles.",
            "Transfer learning using freeze features for Alzheimer neurological disorder detection using ADNI dataset.",
            "A novel image encryption cryptosystem based on true random numbers and chaotic systems.",
            "Predicting COVID-19 statistics using machine learning regression model: Li-MuLi-Poly.",
            "Code generation from a graphical user interface via attention-based encoder-decoder model.",
            "Visual saliency prediction using multi-scale attention gated network.",
            "Camouflage design, assessment and breaking techniques: a survey.",
            "Complementary spatiotemporal network for video question answering.",
            "Lossy image compression based on efficient multiplier-less 8-points DCT.",
            "Dynamic hand gesture recognition using combination of two-level tracker and trajectory-guided features.",
            "Attention based video captioning framework for Hindi.",
            "A review of computer vision-based approaches for physical rehabilitation and assessment.",
            "Structural smoothness low-rank matrix recovery via outlier estimation for image denoising.",
            "Cellular automata-based CMF detection under single and multiple post-processing attacks.",
            "Multiple forgeries identification in digital video based on correlation consistency between entropy coded frames.",
            "FPPN: fast pixel purification network for single-image super-resolution.",
            "DwiMark: a multiscale robust deep watermarking framework for diffusion-weighted imaging images.",
            "A selection function for pitched instrument source separation.",
            "NasmamSR: a fast image super-resolution network based on neural architecture search and multiple attention mechanism.",
            "To balance: balanced micro-expression recognition.",
            "Employing data generation for visual weapon identification using Convolutional Neural Networks."
        ]
    },
    {
        "name": "MS",
        "year": "2021",
        "info": "Volume 27, 2021",
        "count": 79,
        "papers": [
            "Fast CU partition decision for H.266/VVC based on the improved DAG-SVM classifier model.",
            "Gaussian Hermite polynomial based lossless medical image compression.",
            "An improved algorithm of multi-exposure image fusion by detail enhancement.",
            "Video compression using hybrid hexagon search and teaching-learning-based optimization technique for 3D reconstruction.",
            "User segmentation via interpretable user representation and relative similarity-based segmentation method.",
            "Image steganography based on Kirsch edge detection.",
            "An image watermarking technique using hybrid signals as watermarks.",
            "Automatic liver segmentation from abdominal CT volumes using improved convolution neural networks.",
            "A hybrid firefly and particle swarm optimization algorithm applied to multilevel image thresholding.",
            "How does context influence music preferences: a user-based study of the effects of contextual information on users' preferred music.",
            "Face spoofing detection based on chromatic ED-LBP texture feature.",
            "RDH-based dynamic weighted histogram equalization using for secure transmission and cancer prediction.",
            "A compressed string matching algorithm for face recognition with partial occlusion.",
            "PAMTEL-RT: web-based multimedia platform for tele-assistance of pediatric health emergencies in real time in training centers.",
            "Reversible data hiding in adjacent zeros.",
            "Secure speech coding communication using hyperchaotic key generators for AMR-WB codec.",
            "Multichannel speech separation using hybrid GOMF and enthalpy-based deep neural networks.",
            "Incremental visual tracking via sparse discriminative classifier.",
            "Special issue on low complexity methods for multimedia security.",
            "Reversible data hiding in encrypted medical DICOM image.",
            "Low-complexity reversible data hiding in encrypted image via MSB hierarchical coding and LSB compression.",
            "Steganography in animated emoji using self-reference.",
            "Audio steganography with less modification to the optimal matching CNV-QIM path with the minimal hamming distance expected value to a secret.",
            "Low-complexity fake face detection based on forensic similarity.",
            "Resampling parameter estimation via dual-filtering based convolutional neural network.",
            "Low-complexity JPEG steganalysis via filters optimation from symmetric property.",
            "Steganalysis of convolutional neural network based on neural architecture search.",
            "Robust and fast image hashing with two-dimensional PCA.",
            "A privacy-preserving and traitor tracking content-based image retrieval scheme in cloud computing.",
            "A hybrid DST-SBPNRM approach for compressed video steganography.",
            "Evaluation of accurate iris center and eye corner localization method in a facial image for gaze estimation.",
            "Optical flow and pattern noise-based copy-paste detection in digital videos.",
            "Study of transmission system for compressed and encrypted image.",
            "Video-based driver action recognition via hybrid spatial-temporal deep learning framework.",
            "Deep reconstruction of 1D ISOMAP representations.",
            "SHetConv: target keypoint detection based on heterogeneous convolution neural networks.",
            "A novel pixel-wise authentication-based self-embedding fragile watermarking method.",
            "Understanding the limits of 2D skeletons for action recognition.",
            "3D color channel based adaptive contrast enhancement using compensated histogram system.",
            "Special issue on deep learning for emerging big multimedia super-resolution.",
            "Multi-feature-based crowd video modeling for visual event detection.",
            "The state of the art of deep learning models in medical science and their challenges.",
            "Image super-resolution model using an improved deep learning-based facial expression analysis.",
            "An image classification model based on transfer learning for ulcerative proctitis.",
            "FU-Net: fast biomedical image segmentation model based on bottleneck convolution layers.",
            "Robust image steganography approach based on RIWT-Laplacian pyramid and histogram shifting using deep learning.",
            "Foreground detection using motion histogram threshold algorithm in high-resolution large datasets.",
            "Habitat mapping using deep neural networks.",
            "An efficient 2D encoding/decoding technique for optical communication system based on permutation vectors theory.",
            "PFIMD: a parallel MapReduce-based algorithm for frequent itemset mining.",
            "A TextCNN and WGAN-gp based deep learning frame for unpaired text style transfer in multimedia services.",
            "An effective security assessment approach for Internet banking services via deep analysis of multimedia data.",
            "Pupil detection schemes in human eye: a review.",
            "Deep corner prediction to rectify tilted license plate images.",
            "Blockchain-enabled supply chain: analysis, challenges, and future directions.",
            "Bayer image demosaicking and denoising based on specialized networks using deep learning.",
            "Multi-scale skip-connection network for image super-resolution.",
            "A novel AFNCS algorithm for super-resolution SAR in curve trajectory.",
            "LMSN: a lightweight multi-scale network for single image super-resolution.",
            "A traffic flow estimation method based on unsupervised change detection.",
            "RiceNet: convolutional neural networks-based model to classify Pakistani grown rice seed types.",
            "A novel biometric crypto system based on cryptographic key binding with user biometrics.",
            "Edge-aware coding tree unit hierarchical partitioning for quality scalable compression of depth maps.",
            "A novel multi-image cryptosystem based on weighted plain images and using combined chaotic maps.",
            "Body parts relevance learning via expectation-maximization for human pose estimation.",
            "Efficient combination of classifiers for 3D action recognition.",
            "An effective and secure video watermarking using hybrid technique.",
            "Fusion of spatial and dynamic CNN streams for action recognition.",
            "Study and investigation of video steganography over uncompressed and compressed domain: a comprehensive review.",
            "Cellular automata-based digital image scrambling under JPEG compression attack.",
            "Correction to: Cellular automata-based CMF detection under single and multiple post-processing attacks.",
            "An energy-saving video compression targeting face recognition of disaster victim.",
            "Medical image encryption and compression by adaptive sigma filterized synorr certificateless signcryptive Levenshtein entropy-coding-based deep neural learning.",
            "A framework of generative adversarial networks with novel loss for JPEG restoration and anti-forensics.",
            "ParallelNet: multiple backbone network for detection tasks on thigh bone fracture.",
            "Modeling large-scale live video streaming client behavior.",
            "Low cost intent driven future multi-media content access system and network.",
            "New performance measures for object tracking under complex environments.",
            "DSTnet: a new discrete shearlet transform-based CNN model for image denoising."
        ]
    },
    {
        "name": "MS",
        "year": "2020",
        "info": "Volume 26, 2020",
        "count": 49,
        "papers": [
            "Special issue on multimedia fog/edge computing systems.",
            "QoI-aware incentive for multimedia crowdsensing enabled learning system.",
            "Three-dimensional laser image-filtering algorithm based on multi-source information fusion and adaptive offline fog computing.",
            "Oriented grouping-constrained spectral clustering for medical imaging segmentation.",
            "A novel automatic image segmentation method for Chinese literati paintings using multi-view fuzzy clustering technology.",
            "Person-independent facial expression recognition method based on improved Wasserstein generative adversarial networks in combination with identity aware.",
            "Fréchet mean-based Grassmann discriminant analysis.",
            "3D point cloud registration denoising method for human motion image using deep learning algorithm.",
            "Recent evolution of modern datasets for human activity recognition: a deep survey.",
            "On improving the engagement between viewers and TV commercials through gamification.",
            "A real-time 3D video analyzer for enhanced 3D audio-visual systems.",
            "Multimedia content recommendation in social networks using mood tags and synonyms.",
            "RMoCap: an R language package for processing and kinematic analyzing motion capture data.",
            "A reliable and efficient micro-protocol for data transmission over an RTP-based covert channel.",
            "Understanding minority costumes: a computer vision perspective.",
            "Automatic news-roundup generation using clustering, extraction, and presentation.",
            "A steganographic method based on gain quantization for iLBC speech streams.",
            "Editorial.",
            "Reconstruction of occluded ROI in multi-person gait based on numerical methods.",
            "Keyframe extraction using Pearson correlation coefficient and color moments.",
            "Con(dif)fused voice to convey secret: a dual-domain approach.",
            "Combining CNN streams of dynamic image and depth data for action recognition.",
            "A context-aware mobile application framework using audio watermarking.",
            "Towards a real-time image/video cryptosystem: problems, analysis and recommendations.",
            "Robust video encryption for H.264 compressed bitstream based on cross-coupled chaotic cipher.",
            "Identification of changes in grey matter volume using an evolutionary approach: an MRI study of schizophrenia.",
            "Saliency threshold: a novel saliency detection model using Ising's theory on Ferromagnetism (STIF).",
            "Review on image-stitching techniques.",
            "A deep learning architecture of RA-DLNet for visual sentiment analysis.",
            "A survey on speech synthesis techniques in Indian languages.",
            "Experimental study of QoE improvements towards adaptive HD video streaming using flexible dual TCP-UDP streaming protocol.",
            "Plant recognition based on Jaccard distance and BOW.",
            "Top-down thermal tracking based on rotatable elliptical motion model for intelligent livestock breeding.",
            "Predicting the popularity of micro-videos via a feature-discrimination transductive model.",
            "Manifold feature integration for micro-expression recognition.",
            "uMoDT: an unobtrusive multi-occupant detection and tracking using robust Kalman filter for real-time activity recognition.",
            "Matrix variate deep belief networks with CP decomposition algorithm and its application.",
            "A real-time two-input stream multi-column multi-stage convolution neural network (TIS-MCMS-CNN) for efficient crowd congestion-level analysis.",
            "Robust visual tracking via part-based model.",
            "Investigating efficient speech-based information communication: a comparison between the high-rate and the concurrent playback designs.",
            "Anti-distractors: two-branch siamese tracker with both static and dynamic filters for object tracking.",
            "MQTT-SN, CoAP, and RTP in wireless IoT real-time communications.",
            "Online multi-object tracking using KCF-based single-object tracker with occlusion analysis.",
            "Deep learning-based multi-modal approach using RGB and skeleton sequences for human activity recognition.",
            "Hybrid optimal algorithm-based 2D discrete wavelet transform for image compression using fractional KCA.",
            "Color image quantization with peak-picking and color space.",
            "Integrating Gaussian mixture model and dilated residual network for action recognition in videos.",
            "Multi-nonlinear multi-view locality-preserving projection with similarity learning for random cross-view gait recognition.",
            "Emperor Penguin optimized event recognition and summarization for cricket highlight generation."
        ]
    },
    {
        "name": "MS",
        "year": "2019",
        "info": "Volume 25, 2019",
        "count": 55,
        "papers": [
            "Name-face association with web facial image supervision.",
            "Exploring overall opinions for document level sentiment classification with structural SVM.",
            "Saliency detection on sampled images for tag ranking.",
            "General structured sparse learning for human facial age estimation.",
            "User-aware topic modeling of online reviews.",
            "Multimedia analysis for medical applications.",
            "Patch-wise label propagation for MR brain segmentation based on multi-atlas images.",
            "Automatic stenosis detection using SVM from CTA projection images.",
            "Automated segmentation of choroidal neovascularization in optical coherence tomography images using multi-scale convolutional neural networks with structure prior.",
            "Pooled time series representation for mitosis event recognition.",
            "Segmentation of blood vessels using rule-based and machine-learning-based methods: a review.",
            "Precise iterative closest point algorithm with corner point constraint for isotropic scaling registration.",
            "Adaptive kernelized evidential clustering for automatic 3D tumor segmentation in FDG-PET images.",
            "Efficient image reconstruction for fluorescence molecular tomography via linear regression approximation scheme with dual augmented Lagrangian method.",
            "A permissible region extraction based on a knowledge priori for X-ray luminescence computed tomography.",
            "Moving object detection using edges of residuals under varying illuminations.",
            "Accurate body-part reconstruction from a single depth image.",
            "General approach for video traffic: from modeling to optimization.",
            "Quality evaluation of DIBR 3D images based on blind watermarking.",
            "Interactive synthesis and visualization of self-organizing trees for large-scale forest succession simulation.",
            "ATM crime detection using image processing integrated video surveillance: a systematic review.",
            "A depth perception evaluation metric for immersive user experience towards 3D multimedia services.",
            "Visual node prediction for visual tracking.",
            "HVS-based scalable video watermarking - Video copyright protection against scalable coding using motion trajectory analysis in k( $$\\hbox {t}+2\\hbox {D}$$ )DWT domain.",
            "Efficient lossless compression for depth information in traffic scenarios.",
            "A comparison study of AR applications versus pseudo-holographic systems as virtual exhibitors for luxury watch retail stores.",
            "Multi-focus image fusion with random walks and guided filters.",
            "A semantic parliamentary multimedia approach for retrieval of video clips with content understanding.",
            "Joint optimization of routing and VM resource allocation for multimedia cloud.",
            "Extracting-mapping scheme for the dynamic details in fluid re-simulations from videos.",
            "Multi-target tracking by non-linear motion patterns based on hierarchical network flows.",
            "How to measure and model QoE for networked games? - A case study of World of Warcraft.",
            "A mulsemedia framework for delivering sensory effects to heterogeneous systems.",
            "Special issues on \"User-Centric Social Multimedia Computing\" and \"Multimedia Cloud Computing for Smarter Cities\".",
            "Multimodal shared features learning for emotion recognition by enhanced sparse local discriminative canonical correlation analysis.",
            "Automatic image annotation with real-world community contributed data set.",
            "Salient-points-guided face alignment.",
            "Structured fragment-based object tracking using discrimination, uniqueness, and validity selection.",
            "Informative image selection for crowdsourcing-based mobile location recognition.",
            "Models for Multimedia Mobile Cloud in Smart Cities.",
            "Towards a cloud-based automated surveillance system using wireless technologies.",
            "Cloud image watermarking: high quality data hiding and blind decoding scheme based on block truncation coding.",
            "Smart healthcare monitoring: a voice pathology detection paradigm for smart cities.",
            "Tradeoff between execution speedup and reliability for compute-intensive code offloading in mobile device cloud.",
            "Special issue on multimedia recommendation and multi-modal data analysis.",
            "Fashion clothes matching scheme based on Siamese Network and AutoEncoder.",
            "An app usage recommender system: improving prediction accuracy for both warm and cold start users.",
            "Deep learning-based automatic downbeat tracking: a brief review.",
            "Toward efficient indexing structure for scalable content-based music retrieval.",
            "Panorama based on multi-channel-attention CNN for 3D model recognition.",
            "Multi-guiding long short-term memory for video captioning.",
            "Crowdsourced subjective 3D video quality assessment.",
            "Lifetime-aware solid-state disk (SSD) cache management for video servers.",
            "Analyzing autostereoscopic environment configurations for the design of videogames.",
            "A novel depth perception prediction metric for advanced multimedia applications."
        ]
    },
    {
        "name": "MS",
        "year": "2018",
        "info": "Volume 24, 2018",
        "count": 41,
        "papers": [
            "Combining traffic-shaping methods with congestion control variants for HTTP adaptive streaming.",
            "Adaptation logic for HTTP dynamic adaptive streaming using geo-predictive crowdsourcing for mobile users.",
            "Impact of packet loss on the perceived quality of UDP-based multimedia streaming: a study of user quality of experience in real-life environments.",
            "Multi-modal video event recognition based on association rules and decision fusion.",
            "Latency-aware virtual desktops optimization in distributed clouds.",
            "Three-dimensional histogram shifting for reversible data hiding.",
            "Learning discriminative representations for semantical crossmodal retrieval.",
            "Towards professionally user-adaptive large medical image transmission processing in mobile telemedicine systems.",
            "Visual instance mining from the graph perspective.",
            "A content-based recommendation algorithm for learning resources.",
            "Visual tracking with conditionally adaptive multiple template update scheme for intricate videos.",
            "Affective content analysis of music emotion through EEG.",
            "Video content authentication techniques: a comprehensive survey.",
            "Optimized camera handover scheme in free-viewpoint video streaming.",
            "Multilevel active registration for kinect human body scans: from low quality to high quality.",
            "Restricted affine motion compensation and estimation in video coding with particle filtering and importance sampling: a multi-resolution approach.",
            "MOS estimation model development using ACR listening-opinion tests with Thai users referring to loss effects: a case of G.726 and G.729.",
            "1D representation of Isomap for united video coding.",
            "OpenIPTV: a comprehensive SDN-based IPTV service framework.",
            "On the trajectory of video quality transition in HTTP adaptive video streaming.",
            "An optimized high payload audio watermarking algorithm based on LU-factorization.",
            "An efficient and secure VoIP communication system with chaotic mapping and message digest.",
            "Review of data features-based music emotion recognition methods.",
            "A general framework for real-time analysis of massive multimedia streams.",
            "Biological property-based artificial scar synthesis using inverse lighting.",
            "Efficient HEVC selective stream encryption using chaotic logistic map.",
            "Customer pose estimation using orientational spatio-temporal network from surveillance camera.",
            "Windsurf: the best way to SURF - (and SIFT/BRISK/ORB/FREAK, too).",
            "Pseudo-positive regularization for deep person re-identification.",
            "Performance evaluation of TcpHas: TCP for HTTP adaptive streaming.",
            "SABA: segment and buffer aware rate adaptation algorithm for streaming over HTTP.",
            "Traffic prediction methods for quality improvement of adaptive video.",
            "Frame duplication detection based on BoW model.",
            "A novel two-stream saliency image fusion CNN architecture for person re-identification.",
            "Noise-resilient compressed domain video watermarking system for in-car camera security.",
            "Semantic object removal with convolutional neural network feature-based inpainting approach.",
            "Multiple player tracking in soccer videos: an adaptive multiscale sampling approach.",
            "Association rule mining for the usability of the CAPTCHA interfaces: a new study of multimedia systems.",
            "Modelling user quality of experience from objective and subjective data sets using fuzzy logic.",
            "Securing JPEG-2000 images in constrained environments: a dynamic approach.",
            "Smell and touch in the Virtual Jumpcube."
        ]
    },
    {
        "name": "MS",
        "year": "2017",
        "info": "Volume 23, 2017",
        "count": 58,
        "papers": [
            "Special issue on \"visual semantic analysis with weak supervision\".",
            "A discriminative graph inferring framework towards weakly supervised image parsing.",
            "3D Object retrieval based on viewpoint segmentation.",
            "Tag relevance fusion for social image retrieval.",
            "Graph-based clustering and ranking for diversified image search.",
            "Organizing photographs with geospatial and image semantics.",
            "Semi-supervised tensor learning for image classification.",
            "Robust visual tracking via discriminative appearance model based on sparse coding.",
            "A human motion feature based on semi-supervised learning of GMM.",
            "Semantic classification for hyperspectral image by integrating distance measurement and relevance vector machine.",
            "Image feature detection algorithm based on the spread of Hessian source.",
            "Vehicle collision risk estimation based on RGB-D camera for urban road.",
            "Learning for classification of traffic-related object on RGB-D data.",
            "Effective optimizations of cluster-based nearest neighbor search in high-dimensional space.",
            "Multiple level visual semantic fusion method for image re-ranking.",
            "Optimized residual vector quantization for efficient approximate nearest neighbor search.",
            "Recognizing human actions by two-level Beta process hidden Markov model.",
            "An improved and anonymous two-factor authentication protocol for health-care applications with wireless medical sensor networks.",
            "Confined projection on selected sub-surface using a robust binary-coded pattern for pico-projectors.",
            "Exposing video inter-frame forgery by Zernike opponent chromaticity moments and coarseness analysis.",
            "Perceptual multi-exposure image fusion with overall image quality index and local saturation.",
            "Feature selection and feature learning in arousal dimension of music emotion by using shrinkage methods.",
            "Cluster rendering on large high-resolution multi-displays using X3DOM and HTML.",
            "Learning high-dimensional multimedia data.",
            "Feature selection by combining subspace learning with sparse representation.",
            "Precise glasses detection algorithm for face with in-plane rotation.",
            "Learning in high-dimensional multimedia data: the state of the art.",
            "Fast document image comparison in multilingual corpus without OCR.",
            "Convolutional deep learning for 3D object retrieval.",
            "A new way of covert communication by steganography via JPEG images within a Microsoft Word document.",
            "A hierarchical visual saliency detection method by combining distinction and background probability maps.",
            "Self-representation graph feature selection method for classification.",
            "Online visual tracking based on subspace representation with continuous occlusion modeling.",
            "3-D human pose recovery using nonrigid point set registration and body part tracking of depth data.",
            "Recognizing human gestures in videos by modeling the mutual context of body position and hands movement.",
            "Efficient logo recognition by local feature groups.",
            "Management of virtual network resources for multimedia applications.",
            "Towards coordinated bandwidth adaptations for hundred-scale 3D tele-immersive systems.",
            "Procedural modeling and visualization of multiple leaves.",
            "Multi-view human activity recognition based on silhouette and uniform rotation invariant local binary patterns.",
            "Using the audio of 8-bit video games to monitor web marketing campaigns.",
            "Steganography in vector quantization process of linear predictive coding for low-bit-rate speech codec.",
            "Hand gesture recognition using two-level speed normalization, feature selection and classifier fusion.",
            "Learning rich features from objectness estimation for human lying-pose detection.",
            "A pattern-based evaluation of download and cache management algorithms for annotated interactive non-linear videos.",
            "Catch-up TV analytics: statistical characterization and consumption patterns identification on a production service.",
            "Multimedia-supported virtual experiment for online user-system trust studies.",
            "High-density crowd behaviors segmentation based on dynamical systems.",
            "Estimating deformation factors of planar patterns in spherical panoramic images.",
            "Spectral analysis of image-based rendering data with scene geometry.",
            "Guest editorial: mobile visual tagging with mobile context.",
            "A survey on context-aware mobile visual recognition.",
            "Automatic group activity annotation for mobile videos.",
            "Automatic image annotation using fuzzy association rules and decision tree.",
            "Discovering discriminative patches for free-hand sketch analysis.",
            "Flickr group recommendation with auxiliary information in heterogeneous information networks.",
            "Multi-modal tag localization for mobile video search.",
            "Semi-supervised image classification via nonnegative least-squares regression."
        ]
    },
    {
        "name": "MS",
        "year": "2016",
        "info": "Volume 22, 2016",
        "count": 64,
        "papers": [
            "Recent advances in social multimedia big data mining and applications.",
            "Chat with illustration.",
            "SocialRobot: a big data-driven humanoid intelligent system in social media services.",
            "Efficient video copy detection using multi-modality and dynamic path search.",
            "Semi-supervised feature selection via hierarchical regression for web image classification.",
            "Enriching one-class collaborative filtering with content information from social media.",
            "Logo information recognition in large-scale social media data.",
            "Cross-domain semantic transfer from large-scale social media.",
            "Characterizing users' check-in activities using their scores in a location-based social network.",
            "Accurate online video tagging via probabilistic hybrid modeling.",
            "Online web video topic detection and tracking with semi-supervised learning.",
            "BHoG: binary descriptor for sketch-based image retrieval.",
            "Decomposed human localization from social photo album.",
            "Semi-supervised image clustering with multi-modal information.",
            "Predicting the level of cooperation in a Peer-to-Peer live streaming application.",
            "Tracking 3-D motion from straight lines with trifocal tensors.",
            "Scene-based fingerprinting method for traitor tracing.",
            "Mean opinion score (MOS) revisited: methods and applications, limitations and alternatives.",
            "Live camera recording robust video fingerprinting.",
            "Saliency detection using boundary information.",
            "Robust tracking with adaptive appearance learning and occlusion detection.",
            "Letter to the Editor regarding \"Dynamic watermarking scheme for quantum images based on Hadamard transform\" by Song et al.",
            "Response to the Letter to the Editor from Y.G. Yang et al. regarding \"Dynamic watermarking scheme for quantum images based on Hadamard transform\" by Xianhua Song et al., Multimedia Systems, doi: 10.1007/s00530-014-0355-3.",
            "A fast recognition algorithm for suspicious behavior in high definition videos.",
            "A content-based approach for detecting highlights in action movies.",
            "Robust visual tracking via online semi-supervised co-boosting.",
            "Audio-visual speech recognition integrating 3D lip information obtained from the Kinect.",
            "2D Histogram-based player localization in broadcast volleyball videos.",
            "Tucker decomposition-based tensor learning for human action recognition.",
            "Spectral-spatial co-clustering of hyperspectral image data based on bipartite graph.",
            "A multiple reversible watermarking technique for fingerprint authentication.",
            "Automatic selection of color reference image for panoramic stitching.",
            "Special issue: When social media meets physical world.",
            "Geo-location driven image tagging via cross-domain learning.",
            "On the tag localization of web video.",
            "Social video annotation by combining features with a tri-adaptation approach.",
            "Detecting and tagging users' social circles in social media.",
            "Linking socially contributed media with events.",
            "Resolving local cuisines for tourists with multi-source social media contents.",
            "Mining location-aware discriminative blocklets for recognizing landmark architectures.",
            "An incremental probabilistic model for temporal theme analysis of landmarks.",
            "A cross-media public sentiment analysis system for microblog.",
            "Question microblog identification and answer recommendation.",
            "Geometric discriminative features for aerial image retrieval in social media.",
            "The effects of multiple query evidences on social image retrieval.",
            "Fast verification via statistical geometric for mobile visual search.",
            "A location-aware TV show recommendation with localized sementaic analysis.",
            "Resilient overlay network for real-time interactive multimedia sessions in corporate networks.",
            "Optimal tree packing for discretized live rate-adaptive streaming in CDN.",
            "VoIP quality measurement: subjective VoIP quality estimation model for G.711 and G.729 based on native Thai users.",
            "RecAm: a collaborative context-aware framework for multimedia recommendations in an ambient intelligence environment.",
            "Fragile watermarking with permutation code for content-leakage in digital rights management system.",
            "Building a post-compression region-of-interest encryption framework for existing video surveillance systems - Challenges, obstacles and practical concerns.",
            "Asymmetric self-recovery oriented stereo image watermarking method for three dimensional video system.",
            "Special issue on collaborative haptic audio-visual environments and systems.",
            "AR-based serious game framework for post-stroke rehabilitation.",
            "Object interaction and task programming by demonstration in visuo-haptic augmented reality.",
            "Video chroma keying via global sampling and trimap propagation.",
            "Special issue on multimedia in ecology.",
            "Motion analytics of zebrafish using fine motor kinematics and multi-view trajectory.",
            "A diversity-based search approach to support annotation of a large fish image dataset.",
            "Uncertainty-aware estimation of population abundance using machine learning.",
            "A look inside the Pl@ntNet experience - The good, the bias and the hope.",
            "Habitat image annotation with low-level features, medium-level knowledge and location information."
        ]
    },
    {
        "name": "MS",
        "year": "2015",
        "info": "Volume 21, 2015",
        "count": 46,
        "papers": [
            "New technologies and research trends for smartphone sensing in intelligent multimedia systems.",
            "Cooperative spectrum sensing via relay-assisted random broadcast in cognitive smartphone networks.",
            "Triangular inequality-based rotation-invariant boundary image matching for smart devices.",
            "Envelope-based boundary image matching for smart devices under arbitrary rotations.",
            "Robust anonymous authentication protocol for health-care applications using wireless medical sensor networks.",
            "Real-time smartphone sensing and recommendations towards context-awareness shopping.",
            "TwitterTrends: a spatio-temporal trend detection and related keywords recommendation scheme.",
            "The power of smartphones.",
            "Smartphone intelligent applications: a brief review.",
            "User-centric incremental learning model of dynamic personal identification for mobile devices.",
            "Guest editorial: selected papers from ICIMCS 2013.",
            "A new discriminative coding method for image classification.",
            "Large-margin multi-view Gaussian process.",
            "Image aesthetics enhancement using composition-based saliency detection.",
            "Camouflage texture evaluation using a saliency map.",
            "Efficient human detection in crowded environment.",
            "Soft-assigned bag of features for object tracking.",
            "Redundancy filtering and fusion verification for video copy detection.",
            "Click-boosting multi-modality graph-based reranking for image search.",
            "Multi-order visual phrase for scalable partial-duplicate visual search.",
            "Guest editorial: selected papers from ICIMCS 2012.",
            "Visual word expansion and BSIFT verification for large-scale image search.",
            "Accurate sensing of scene geo-context via mobile visual localization.",
            "Tag ranking based on salient region graph propagation.",
            "Transmission of multimedia contents in opportunistic networks with social selfish nodes.",
            "Nonlocal variational image segmentation models on graphs using the Split Bregman.",
            "Finding logos in real-world images with point-context representation-based region search.",
            "Multi-object tracking via MHT with multiple information fusion in surveillance video.",
            "SVDN: packetization and layer synchronization for scalable video delivery over peer-to-peer networks.",
            "Hybrid additive multi-watermarking and decoding.",
            "Subjective quality assessment of multichannel audio accompanied with video in representative broadcasting genres.",
            "Wide area localization and tracking on camera phones for mobile augmented reality systems.",
            "Star tracking and attitude determination using fuzzy based positional pattern and rotation compensation in Fourier domain.",
            "A low-latency scheduling approach for high-definition video streaming in a heterogeneous wireless network with multihomed clients.",
            "Modeling performing arts metadata and relationships in content service for institutions.",
            "2D to 3D conversion with motion-type adaptive depth estimation.",
            "ALD: adaptive layer distribution for scalable video.",
            "Behaviour recognition using multivariate m-mediod based modelling of motion trajectories.",
            "Context-based environmental audio event recognition for scene understanding.",
            "Analyzing semantic correlation for cross-modal retrieval.",
            "Facial expression recognition using active contour-based face detection, facial movement-based feature extraction, and non-linear feature selection.",
            "Human gesture recognition using a simplified dynamic Bayesian network.",
            "Tensor index for large scale image retrieval.",
            "Intelligent visual mouse system based on hand pose trajectory recognition in video sequences.",
            "NIF-based seam carving for image resizing.",
            "HDR image encoding using reconstruction functions based on piecewise linear approximations."
        ]
    },
    {
        "name": "MS",
        "year": "2014",
        "info": "Volume 20, 2014",
        "count": 47,
        "papers": [
            "Collaborative caching for efficient dissemination of personalized video streams in resource constrained environments.",
            "Balancing disk energy against reliability in video playback.",
            "A novel image encryption based on hash function with only two-round diffusion process.",
            "Miniature illustrations retrieval and innovative interaction for digital illuminated manuscripts.",
            "Rule-based approach to recognizing human body poses and gestures in real time.",
            "Advances in digital media security and right management.",
            "Privacy-aware peer-to-peer content distribution using automatically recombined fingerprints.",
            "A proposal of digital rights management based on incomplete cryptography using invariant Huffman code length feature.",
            "Improving security of quantization-index-modulation steganography in low bit-rate speech streams.",
            "Secure logarithmic audio watermarking scheme based on the human auditory system.",
            "Efficient block-based transparent encryption for H.264/SVC bitstreams.",
            "Robust drift-free bit-rate preserving H.264 watermarking.",
            "Digital video watermarking based on intra prediction modes for audio video coding standard.",
            "Enhancing the transmission security of biometric images using chaotic encryption.",
            "A novel joint secret image sharing and robust steganography method using wavelet.",
            "Adaptive steganography based on block complexity and matrix embedding.",
            "On robustness against JPEG2000: a performance evaluation of wavelet-based watermarking techniques.",
            "Spatially aggregating spectral descriptors for nonrigid 3D shape retrieval: a comparative survey.",
            "A review of multiple description coding techniques for error-resilient video delivery.",
            "A semi-oblivious energy-aware adaptive watermarking for wireless image sensor networks.",
            "A framework for automatic creation of motion effects from theatrical motion pictures.",
            "Multiple style exploration for story unit segmentation of broadcast news video.",
            "Reconstruction of multi-view compressed imaging using weighted total variation.",
            "Dynamic watermarking scheme for quantum images based on Hadamard transform.",
            "RELIEF-MM: effective modality weighting for multimedia information retrieval.",
            "On performance evaluation of swarm-based live peer-to-peer streaming applications.",
            "Graph regularized GM-pLSA and its applications to video content analysis.",
            "Guest editorial: special issue on network and systems support for games.",
            "Dissecting the protocol and network traffic of the OnLive cloud gaming platform.",
            "On the performance of OnLive thin client games.",
            "A game attention model for efficient bit rate allocation in cloud gaming.",
            "A hybrid edge-cloud architecture for reducing on-demand gaming latency.",
            "SLA-based operations of massively multiplayer online games in clouds.",
            "Opportunistic mobile games using public transportation systems: a deployability study.",
            "Lightweight graphics instrumentation for game state-specific power management in Android.",
            "Towards a scalable refereeing system for online gaming.",
            "Secure peer-to-peer trading in small- and large-scale multiplayer games.",
            "On synthetic workloads for multiplayer online games: a methodology for generating representative shooter game workloads.",
            "QoE assessment of fairness in networked game with olfaction: influence of time it takes for smell to reach player.",
            "Social media mining and knowledge discovery.",
            "Sparse semantic metric learning for image retrieval.",
            "Relative image similarity learning with contextual information for Internet cross-media retrieval.",
            "Grassmann multimodal implicit feature selection.",
            "Exploring sharing patterns for video recommendation on YouTube-like social media.",
            "Harvesting microblogs for contextual music similarity estimation: a co-occurrence-based framework.",
            "Real-time panoramic video streaming system with overlaid interface concept for social media.",
            "Personalising live zooming using the ePlayer."
        ]
    },
    {
        "name": "MS",
        "year": "2013",
        "info": "Volume 19, 2013",
        "count": 38,
        "papers": [
            "Guest editorial: selected papers from ICIMCS 2011.",
            "Video recommendation over multiple information sources.",
            "Multi-label multi-instance learning with missing object tags.",
            "Combining global and local matching of multiple features for precise item image retrieval.",
            "Weakly-supervised object localization in unlabeled image collection.",
            "Robust wireless sharing of internet video streams.",
            "Multimedia systems journal special issue on Mobile Multimedia applications.",
            "Allocation algorithms for personal TV advertisements.",
            "Frequency-based similarity measure for multimedia recommender systems.",
            "A predictive algorithm for multimedia data compression.",
            "Implementation and evaluation of a remote authentication system using touchless palmprint recognition.",
            "Mobile PointMe-based spatial haptic interaction with annotated media for learning purposes.",
            "Approximate range query processing in spatial network databases.",
            "On the impact of the GOP size in a temporal H.264/AVC-to-SVC transcoder in baseline and main profile.",
            "Guest editorial for special issue on network and systems support for games.",
            "From 101 to nnn: a review and a classification of computer game architectures.",
            "Player behavior and traffic characterization for MMORPGs: a survey.",
            "The Ex-Gaussian distribution as a model of first-person shooter game traffic.",
            "A model and software architecture for MMORPG traffic generation based on player behavior.",
            "Interest modeling in games: the case of dead reckoning.",
            "Timelines: simplifying the programming of lag compensation for the next generation of networked games.",
            "Exertion interfaces for computer videogames using smartphones as input controllers.",
            "Match+Guardian: a secure peer-to-peer trading card game protocol.",
            "Super-resolution image reconstruction for mobile devices.",
            "Performance analysis of various local and global shape descriptors for image retrieval.",
            "Adaptive music resizing with stretching, cropping and insertion - A generic content-aware music resizing framework.",
            "Multiple visual concept discovery using concept-based visual word clustering.",
            "Cross-media retrieval by intra-media and inter-media correlation mining.",
            "Panoramic video stitching from commodity HDTV cameras.",
            "State-of-the-art and future challenges in video scene detection: a survey.",
            "Semantic multimedia remote display for mobile thin clients.",
            "Special Issue on Social Recommendation and Delivery Systems for Video and TV Content.",
            "Twitter analysis algorithms for Intelligence Circulation System.",
            "User interest modeling for social TV-recommender systems based on audiovisual consumption.",
            "Folkommender: a group recommender system based on a graph-based ranking algorithm.",
            "Automatic and personalized recommendation of TV program contents using sequential pattern mining for smart TV user interaction.",
            "A recommender system for the TV on the web: integrating unrated reviews and movie ratings.",
            "Accessing movies based on emotional impact."
        ]
    },
    {
        "name": "MS",
        "year": "2012",
        "info": "Volume 18, 2012",
        "count": 31,
        "papers": [
            "Mobile and Ubiquitous Multimedia.",
            "Privacy-sensitive recognition of group conversational context with sociometers.",
            "User-centred process for the definition of free-hand gestures applied to controlling music playback.",
            "Gesture-based mobile training of intercultural behavior.",
            "Drawing on mobile crowds via social media - Case UbiAsk: image based mobile social search across languages.",
            "Personalise your massively multiplayer online game (MMOG) with Artemis.",
            "Guest editorial: Privacy-aware multimedia surveillance systems.",
            "User-centric privacy awareness in video surveillance.",
            "A general framework for managing and processing live video data with privacy protection.",
            "Chaos-cryptography based privacy preservation technique for video surveillance.",
            "Intended human object detection for automatically protecting privacy in mobile video surveillance.",
            "Privacy enabled video surveillance using a two state Markov tracking algorithm.",
            "@ICT: attention-based virtual content insertion.",
            "Mixed reality web service platform.",
            "Semi-supervised context adaptation: case study of audience excitement recognition.",
            "Eliminating the effect of freezing frames on user perceptive by using a time interleaving technique.",
            "Spatio-temporal querying recurrent multimedia databases using a semantic sequence state graph.",
            "CBIR with a subspace tree: principal component analysis versus averaging.",
            "A clustering method for concurrent photos obtained from multiple cameras using max-flow network model.",
            "Incremental indexing and retrieval mechanism for scalable and robust shape matching.",
            "Concept-based near-duplicate video clip detection for novelty re-ranking of web video search results.",
            "Fast macroblock mode decision for H.264/AVC baseline profile video transcoder based on support vector machines.",
            "A comparative analysis of video codecs for multihop wireless video sensor networks.",
            "Arrival process-controlled adaptive media playout with multiple thresholds for video streaming.",
            "Quality enhancement for scalable video delivery over wireless networks based on particle swarm optimization.",
            "MultiSense: proportional-share for mechanically steerable sensor networks.",
            "Assessing the importance of audio/video synchronization for simultaneous translation of video sequences.",
            "Inter-destination multimedia synchronization: schemes, use cases and standardization.",
            "Video summarization using a network of radial basis functions.",
            "Speech information retrieval: a review.",
            "Optimal strategies for creating paper models from 3D objects."
        ]
    },
    {
        "name": "MS",
        "year": "2011",
        "info": "Volume 17, 2011",
        "count": 35,
        "papers": [
            "Guest editorial: Networked television.",
            "Performance analysis of a caching algorithm for a catch-up television service.",
            "An enhanced content selection mechanism for personalization of video news programmes.",
            "iDTV Home Gateway convergence: an open software model integrating the Ginga middleware and the OSGi framework.",
            "Challenges and techniques for video streaming over mobile ad hoc networks.",
            "Dynamic behavior of balanced NV-trees.",
            "Pitch-density-based features and an SVM binary tree approach for multi-class audio classification in broadcast news.",
            "Stabilization and extraction of 2D barcodes for camera phones.",
            "A three-level architecture for bridging the image semantic gap.",
            "A middleware to enhance current multimedia retrieval systems with content-based functionalities.",
            "A speculative load adaptive streaming scheme for efficient video delivery.",
            "Enabling resilient P2P video streaming: survey and analysis.",
            "Supporting content discovery and organization in networks of contents and users.",
            "Relieving the burden of track switch in modern hard disk drives.",
            "MEMSA: mining emerging melody structures from music query data.",
            "Guest Editorial: Wireless multimedia transmission technology and application.",
            "Wireless MediaNets: application-driven next-generation wireless IP networks.",
            "Real-time video streaming over multipath in multi-hop wireless networks.",
            "Design and integration of the OpenCore-based mobile TV framework for DVB-H/T wireless network.",
            "M-MUSICS: an intelligent mobile music retrieval system.",
            "Adaptive hybrid error correction model for video streaming over wireless networks.",
            "Potential cyberterrorism via a multimedia smart phone based on a web 2.0 application via ubiquitous Wi-Fi access points and the corresponding digital forensics.",
            "IPTV service based on a content-zapping paradigm.",
            "Interactive multimedia computing.",
            "Adding semantics to image-region annotations with the Name-It-Game.",
            "Interactive browsing via diversified visual summarization for image search results.",
            "Security and privacy requirements in interactive TV.",
            "Semi-automatic cartoon generation by motion planning.",
            "Personalized video similarity measure.",
            "An interactive handheld spherical 3D object display system.",
            "Channel adaptive video stream switching for broadband wireless links.",
            "Context-aware adaptation of multimedia documents for consistent presentations.",
            "Analysis and verification of SMIL documents.",
            "Query quality refinement in singular value decomposition to improve genetic algorithms for multimedia data retrieval.",
            "Video personalization in heterogeneous and resource-constrained environments."
        ]
    },
    {
        "name": "MS",
        "year": "2010",
        "info": "Volume 16, 2010",
        "count": 28,
        "papers": [
            "Special Issue \"International Academic MindTrek2008: Entertainment and Media in the Ubiquitous Era\".",
            "WebMapMedia: a map-based Web application for facilitating participation in spatial planning.",
            "Implementing digital game-based learning in schools: augmented learning environment of 'Europe 2045'.",
            "Gaming on the move: urban experience as a new paradigm for mobile pervasive game design.",
            "Ubimedia based on readable and writable memory tags.",
            "The city is connections: Seoul as an urban network.",
            "Format-independent and metadata-driven media resource adaptation using semantic web technologies.",
            "Relevance ranking in georeferenced video search.",
            "Feedback-free rate-allocation scheme for transform domain Wyner-Ziv video coding.",
            "Dyadic spatial resolution reduction transcoding for H.264/AVC.",
            "A relaxing bandwidth smoothing schedule for transmitting prerecorded VBR video in periodic network.",
            "Guest Editorial: \"Special issue on selected papers from NOSSDAV 2009\".",
            "Frequent layer switching for perceived quality improvements of coarse-grained scalable video.",
            "InstantLeap: an architecture for fast neighbor discovery in large-scale P2P VoD streaming.",
            "Zebroid: using IPTV data to support STB-assisted VoD content delivery.",
            "Introduction to the special issue on multimedia intelligent services and technologies.",
            "The effects of recommendations' presentation on persuasion and satisfaction in a movie recommender system.",
            "A hybrid similarity measure of contents for TV personalization.",
            "MeshVision: an adaptive wireless mesh network video surveillance system.",
            "Semantic user profiling techniques for personalised multimedia recommendation.",
            "Location awareness-based intelligent multi-agent technology.",
            "Asynchronous reflections: theory and practice in the design of multimedia mirror systems.",
            "Where was that photo taken? Deriving geographical information from image collections based on temporal exposure attributes.",
            "Shape alignment and shape orientation analysis-based 3D shape retrieval system.",
            "AdOn: toward contextual overlay in-video advertising.",
            "Multimodal fusion for multimedia analysis: a survey.",
            "Bandwidth-effective streaming of educational medical videos.",
            "Sharing with people: a system for user-centric content sharing."
        ]
    },
    {
        "name": "MS",
        "year": "2009",
        "info": "Volume 15, 2009",
        "count": 26,
        "papers": [
            "Special issue from ACM NOSSDAV 2007.",
            "Characterising and exploiting workloads of highly interactive video-on-demand.",
            "Towards capacity and profit optimization of video-on-demand services in a peer-assisted IPTV platform.",
            "Traffic analysis and synthetic models of second life.",
            "On designing a shortest-path-based cache replacement in a transcoding proxy.",
            "Storage technique for real-time streaming of layered video.",
            "Optimizing P2P streaming throughput under peer churning.",
            "A joint encoder-decoder framework for supporting energy efficient audio decoding.",
            "An optimal speed control scheme supported by media servers for low-power multimedia applications.",
            "Special issue on personal interactive (TV) environments.",
            "Leveraging user impact: an architecture for secondary screens usage in interactive television.",
            "Unobtrusive dynamic modelling of TV programme preferences in a Finnish household.",
            "Users' needs, desires, and design preferences for recommendations in the living room.",
            "Broadcasting and personalization of user-generated contents in DVB-H mobile networks.",
            "Distributing the personal digital environment throughout your entertainment environment: handling personal metadata across domains.",
            "Visual and textual fusion for semantically supervised region-based retrieval.",
            "Discovering calligraphy style relationships by Supervised Learning Weighted Random Walk Model.",
            "A survey on JPEG2000 encryption.",
            "International Conference on Advances in Mobile Computing and Multimedia.",
            "Video transmission enhancement in presence of misbehaving nodes in MANETs.",
            "Evaluation of P2P multimedia clustering techniques in JXTA-Overlay.",
            "Voronoi-based reverse nearest neighbor query processing on spatial networks.",
            "A new dynamic cellular learning automata-based skin detector.",
            "Hiding data: a high-capacity distortionless approach.",
            "ViCopT: a robust system for content-based video copy detection in large databases.",
            "Priority-based haptic event filtering for transmission and error control in networked virtual environments."
        ]
    },
    {
        "name": "MS",
        "year": "2008",
        "info": "Volume 14, 2008",
        "count": 35,
        "papers": [
            "The impact of varying frame rates and bit rates on perceived quality of low/high motion sequences with smooth/complex texture.",
            "A framework for efficient and rapid development of cross-platform audio applications.",
            "Evalvid-RA: trace driven simulation of rate adaptive MPEG-4 VBR video.",
            "Continuous query processing over music streams based on approximate matching mechanisms.",
            "Multimedia systems, languages, and infrastructures for interactive television.",
            "An efficient ad recommendation system for TV programs.",
            "Using high-level models for the creation of staged participatory multimedia events on TV.",
            "'Podracing': experimenting with mobile TV content consumption and delivery methods.",
            "ShapeShifting TV: interactive screen media narratives.",
            "Guest editorial: Selected papers on wireless multimedia networking from the WMuNeP'06 Conference.",
            "A biologically inspired multimedia content repurposing system in heterogeneous environments.",
            "HyMN-injection-based multimedia content distribution in hybrid wireless networks.",
            "Multipath routing and rate-controlled video encoding in wireless video surveillance networks.",
            "Enhancing wireless video streaming using lightweight approximate authentication.",
            "Automatic composition of broadcast sports video.",
            "Perceptual image preview.",
            "Scalable search-based image annotation.",
            "Dynamic Bayesian approach for detecting cheats in multi-player online games.",
            "Discovering salient prosodic cues and their interactions for automatic story segmentation in Mandarin broadcast news.",
            "An automatic television stream structuring system for television archives holders.",
            "Graph-based multilevel temporal video segmentation.",
            "Lossless video coding based on pixel-wise prediction.",
            "COSMOROE: a cross-media relations framework for modelling multimedia dialectics.",
            "Editorial.",
            "Canonical processes of semantically annotated media production.",
            "Constructing a SenseCam visual diary as a media process.",
            "Processes of photo book production.",
            "Production and multi-channel distribution of news.",
            "Mobile cinema: canonical processes for video adaptation.",
            "Process modeling for new media artworks.",
            "The canonical processes of a dramatized approach to information presentation.",
            "The canonical expression of the drama product manufacturing processes.",
            "Non-linear interactive media productions.",
            "Canonical processes for creating personalized semantically rich multimedia presentations.",
            "Canonical processes in active reading and hypervideo production."
        ]
    },
    {
        "name": "MS",
        "year": "2007",
        "info": "Volume 13, 2007/2008",
        "count": 31,
        "papers": [
            "Guest editors' note.",
            "On frame rate and player performance in first person shooter games.",
            "Sampling cluster endurance for peer-to-peer based content distribution networks.",
            "Characterizing files in the modern Gnutella network.",
            "Metadata-driven optimal transcoding in a multimedia proxy.",
            "Streamline: scheduling streaming applications in a wide area environment.",
            "Editorial: Semantic media adaptation and personalisation.",
            "An analytical evaluation of search by content and interaction patterns on multimodal meeting records.",
            "Integrating semantic analysis and scalable video coding for efficient content-based adaptation.",
            "Preference-driven personalization for flexible digital item adaptation.",
            "An MPEG-7 query language and a user preference model that allow semantic retrieval and filtering of multimedia content.",
            "Closing the content-user gap in MPEG-7: the hanging basket model.",
            "PeerStreaming: design and implementation of an on-demand distributed streaming system with digital rights management capabilities.",
            "New approaches to encryption and steganography for digital videos.",
            "Delivering relative differentiated services in future high-speed networks using hierarchical dynamic deficit round robin.",
            "Seamless channel transition for slotted generalized fibonacci broadcasting.",
            "Design and analysis of a demand adaptive and locality aware streaming media server cluster.",
            "C-HAVE: Collaborative Haptic Audio Visual Environments and Systems.",
            "Prediction-based methods for teleoperation across delayed networks.",
            "Simultaneous remote haptic collaboration for assembling tasks.",
            "Perception-based lossy haptic compression considerations for velocity-based interactions.",
            "An efficient hybrid multicast transport protocol for collaborative virtual environment with networked haptic.",
            "Vibrotactile perception: examining the coding of vibrations and the just noticeable difference under various conditions.",
            "Semantic interactive image retrieval combining visual and conceptual content description.",
            "Mesh watermarking based projection onto two convex sets.",
            "On error-correcting fingerprinting codes for use with watermarking.",
            "Packet loss in peer-to-peer video streaming over the Internet.",
            "Robust source-channel coding for real-time multimedia.",
            "Image retrieval with a multi-modality ontology.",
            "Fast block mode decision algorithm in H.264/AVC using a filter bank of Kalman filters for high definition encoding.",
            "Energy-aware disk scheduling for soft real-time I/O requests."
        ]
    },
    {
        "name": "MS",
        "year": "2006",
        "info": "Volume 12, 2006/2007",
        "count": 41,
        "papers": [
            "Guest Editors' introduction to the special issue: machine learning approaches to multimedia information retrieval.",
            "Support vector machine active learning for music retrieval.",
            "Improved AdaBoost-based image retrieval with relevance feedback via paired feature learning.",
            "A probabilistic semantic model for image annotation and multi-modal image retrieval.",
            "Collaborative image retrieval via regularized metric learning.",
            "View-invariant motion trajectory-based activity classification and recognition.",
            "Machine-learning based classification of speech and music.",
            "Editors' note.",
            "Evaluation and analysis of similarity measures for content-based visual information retrieval.",
            "Buffer-assisted on-demand multicast for VOD applications.",
            "Comparison of XML serializations: cost benefits versus complexity.",
            "Frequency-based cache management policies for collaborative and non-collaborative topologies of segment based video caching proxies.",
            "A dynamic caching algorithm based on internal popularity distribution of streaming media.",
            "Analysis of the \"Wavelet Tree Quantization\" watermarking strategy and a modified robust scheme.",
            "Special issue on multimedia Surveillance systems: guest editorial.",
            "GPU-friendly warped display for scope-maintained video surveillance.",
            "Event detection in an audio-based sensor network.",
            "Calibrating and optimizing poses of visual sensors in distributed platforms.",
            "Constructing task visibility intervals for video surveillance.",
            "Classifying spatiotemporal object trajectories using unsupervised learning in the coefficient feature space.",
            "Information assimilation framework for event detection in multimedia surveillance systems.",
            "Functional calibration for pan-tilt-zoom cameras in hybrid sensor networks.",
            "Surveillance camera scheduling: a virtual vision approach.",
            "Guest Editors' Note.",
            "A two-level queueing system for interactive browsing and searching of video content.",
            "Automatic lyrics alignment for Cantonese popular music.",
            "Building a user-centered semantic hierarchy in image databases.",
            "Modeling user context with applications to media retrieval.",
            "Evaluating a workspace's usefulness for image retrieval.",
            "Collaborative video searching on a tabletop.",
            "An interface for mutual disambiguation of recognition errors in a multimodal navigational assistant.",
            "User-author centered multimedia building blocks.",
            "User-centered control within multimedia presentations.",
            "Meeting browsing.",
            "Editors' Note.",
            "Elastic time computation in QoS-driven hypermedia presentations.",
            "Event detection in real time on a personal camera phone image collection.",
            "Linear search applied to global motion estimation.",
            "Metadata-driven multimedia transcoding for distance learning.",
            "Secure authentication watermarking for localization against the Holliman-Memon attack.",
            "MKL-tree: an index structure for high-dimensional vector spaces."
        ]
    },
    {
        "name": "MS",
        "year": "2005",
        "info": "Volume 11, 2005/2006",
        "count": 50,
        "papers": [
            "Editor's note.",
            "Analogies based video editing.",
            "Multimedia and firewalls: a performance perspective.",
            "An adaptive web page layout structure for small devices.",
            "APEX: adaptive disk scheduling framework with QoS support.",
            "Scalable trusted online dissemination of JPEG2000 images.",
            "CollectCast: A peer-to-peer service for media streaming.",
            "A generalized temporal context model for classifying image collections.",
            "Editorial to the special issue about multimedia and security.",
            "Multimedia security: the 22nd century approach.",
            "Perturbed quantization steganography.",
            "Feature-based encoder classification of compressed audio streams.",
            "Towards geometrically robust data-hiding with structured codebooks.",
            "An improved attack analysis on a public-key spread spectrum watermarking.",
            "Complementing zero-knowledge watermark detection: Proving properties of embedded information without revealing it.",
            "Geometric distortion-resilient image hashing scheme and its applications on copy detection and authentication.",
            "Electronic content delivery and forensic watermarking.",
            "Watermarking via optimization algorithms for quantizing randomized semi-global image statistics.",
            "Editorial Introduction to multimedia system technologies for educational tools.",
            "Towards integrating semantics of multi-media resources and processes in e-Learning.",
            "Poster3D: a system for three-dimensional authoring and presentation in immersive virtual environments.",
            "Context aware guidance for multimedia authoring: harmonizing domain and discourse knowledge.",
            "Multimedia displays for conceptual discovery: information seeking with strand maps.",
            "Content-based adaptive compression of educational videos using phase correlation techniques.",
            "An object-based image retrieval system for digital libraries.",
            "Perceived quality of multimedia educational content: A cognitive style approach.",
            "Tunes on the table.",
            "A platform for virtual collaboration spaces and educational communities: the case of EVE.",
            "Forms and theories of communication: from multimedia to Kansei Mediation.",
            "Editors' Note.",
            "Scalable representation of vector descriptors.",
            "An MPEG-7 scheme for semantic content modelling and filtering of digital video.",
            "Exploring statistical correlations for image retrieval.",
            "Extracting semantic concepts from images: a decisive feature pattern mining approach.",
            "Context-aware support in structured documents for interactive-TV.",
            "Analysis of a CDN-P2P hybrid architecture for cost-effective streaming media distribution.",
            "Editor's Note.",
            "MPEG-21 bitstream syntax descriptions for scalable video codecs.",
            "Discrete wavelet packet transform and ensembles of lazy and eager learners for music genre classification.",
            "ICICLE: A semantic-based retrieval system for WWW images.",
            "Sequence of linear programming for transmission of fine-scalable coded content in bandwidth-limited environments.",
            "Introduction to the special issue on IEEE Multimedia Software Engineering 2004.",
            "Bayesian traffic dynamics and packet loss prediction for video over IP networks.",
            "Generating high-quality discrete LOD meshes for 3D computer games in linear time.",
            "Editor's Note.",
            "Adaptive low-latency peer-to-peer streaming and its application.",
            "An experimental analysis of DCT-based approaches for fine-grained multiresolution video.",
            "A unified benchmarking and model-based framework for building QoS-aware streaming media services.",
            "Adaptive receiver-driven streaming from multiple senders.",
            "Service composition for generic service graphs."
        ]
    },
    {
        "name": "MS",
        "year": "2004",
        "info": "Volume 10, 2004/2005",
        "count": 49,
        "papers": [
            "Editor's Note.",
            "Automating lecture capture and broadcast: technology and videography.",
            "A simple and efficient watermark technique based on JPEG2000 Codec.",
            "Introduction to Special Issue on Multimedia Information Systems.",
            "Multiresolution similarity search in image databases.",
            "Interactive pattern analysis for relevance feedback in multimedia information retrieval.",
            "MINDEX: An efficient index structure for salient-object-based queries in video databases.",
            "Retrieval in multimedia presentations.",
            "Editor's Note.",
            "Statistical analysis of content-based MPEG-7 descriptors for image retrieval.",
            "Exploring video content structure for hierarchical summarization.",
            "Introduction to the special issue on video surveillance.",
            "Monocular human motion tracking.",
            "Motion analysis for event detection and tracking with a mobile omnidirectional camera.",
            "Anatomy of a multicamera video surveillance system.",
            "A hierarchical Bayesian network for event recognition of human actions and interactions.",
            "Editor's Note.",
            "Toward better retrieval and presentation by exploring cross-media correlations.",
            "Quality-based I/O resource managementfor multimedia document database servers.",
            "A global timestamp-based approach to enhanced data consistency and fairness in collaborative virtual environments.",
            "Hybrid and forward error correction transmission techniques for unreliable transport of 3D geometry.",
            "Multimedia layout adaptation through grammatical specifications.",
            "Video text detection and segmentation for optical character recognition.",
            "Editor's Note.",
            "Layered coding vs. multiple descriptions for video streaming over multiple paths.",
            "Packaging models for the storage and distribution of complex digital objectsin archival information systems: a review of MPEG-21 DID principles.",
            "Video server scheduling using random early request migration.",
            "A structured learning framework for content-based image indexing and visual query.",
            "Unsupervised speaker segmentation and tracking in real-time audio content analysis.",
            "Caption analysis and recognition for building video indexing systems.",
            "Editor's note.",
            "GOP ARIMA: Modeling the nonstationarity of VBR processes.",
            "Automatic video logo detection and removal.",
            "Optimum adaptation trajectories for streamed multimedia.",
            "Toward bandwidth-efficient and error-robust audio streaming over lossy packet networks.",
            "Optimizing transmission time of scalable coded images in peer-to-peer networks.",
            "Application of evolutionary strategies for 3D graphical model categorization and retrieval.",
            "An algorithm for similar utterance section extraction for managing spoken documents.",
            "Multiple representations, similarity matching, and results fusion for content-based image retrieval.",
            "Systems and architectures for multimedia information retrieval.",
            "Fast retrieval of high-dimensional feature vectors in P2P networks using compact peer data summaries.",
            "Creating data resources for designing usercentric frontends for query-by-humming systems.",
            "Learning probabilistic classifiers for human-computer interaction applications.",
            "Relevance feedback based saliency adaptation in CBIR.",
            "Efficient kNN search in polyphonic music databases using a lower bounding mechanism.",
            "FAST: Toward more effective and efficient image retrieval.",
            "The Continuous Media Web: a distributed multimedia information retrieval architecture extending the World Wide Web.",
            "HIRBIR: A hierarchical approach to region-based image retrieval.",
            "Toward semantic indexing and retrieval using hierarchical audio models."
        ]
    },
    {
        "name": "MS",
        "year": "2003",
        "info": "Volume 9, 2003/2004",
        "count": 58,
        "papers": [
            "Editor's Note.",
            "Organizing multicast receivers deterministically by packet-loss correlation.",
            "Evaluation of MPEG-7 shape descriptors against other shape descriptors.",
            "Hierarchical video content description and summarization using unified semantic and visual similarity.",
            "Introduction to \"Multimedia Distribution\".",
            "Improving the I/O performance of intermediate multimedia storage nodes.",
            "An adaptive multiplexing algorithm of delay-sensitive multiple VBR-coded bit streams.",
            "Periodic broadcast and patching services - implementation, measurement and analysis in an internet streaming video testbed.",
            "Distinguishing video quality through differential matrices.",
            "Scattercast: an adaptable broadcast distribution framework.",
            "Editor's Note.",
            "Robust image authentication using content based compression.",
            "Adaptive tree similarity learning for image retrieval.",
            "Ubiquitous media agents: a framework for managing personally accumulated multimedia files.",
            "Video summarization and retrieval using singular value decomposition.",
            "Introduction to selected papers from MMCN 2002.",
            "Measuring and analyzing the characteristics of Napster and Gnutella hosts.",
            "Wireless network interface energy consumption: Implications for popular streaming formats.",
            "Reduced energy decoding of MPEG streams.",
            "Editorial.",
            "Encryption and watermarking for the secure distribution of copyrighted MPEG video on DVD.",
            "Digital rights management for digital cinema.",
            "Multimedia security in group communications: recent progress in key management, authentication, and watermarking.",
            "A novel approach to digital image watermarking based on a generalized secret sharing scheme.",
            "Generalized patchwork algorithm for image watermarking.",
            "Watermark detection with zero-knowledge disclosure.",
            "Selective encryption of wavelet-packet encoded image data: efficiency and security.",
            "Quantitative steganalysis of digital images: estimating the secret message length.",
            "A mathematical framework for active steganalysis.",
            "Editorial.",
            "The design and implementation of a Jini/Java-based A/V stream control and management.",
            "Late join algorithms for distributed interactive applications.",
            "Design considerations for the symphony integrated multimedia file system.",
            "A visual attention model for adapting images on small displays.",
            "Synchronised multimedia for engineering and scientific analysis.",
            "Video shot motion characterization based on hierarchical overlapped growing neural gas networks.",
            "Network-aware partial caching for Internet streaming media.",
            "Editor's Note.",
            "Directory-based composite routing and scheduling policies for dynamic multimedia environments.",
            "Comparison of stream merging algorithms for media-on-demand.",
            "Web-based image indexing and retrieval in JPEG compressed domain.",
            "Watermarking with retrieval systems.",
            "A secure and flexible authentication system for digital images.",
            "Editorial: Introduction to the ACM MMSJ special issue on multimedia software engineering.",
            "Personal orchestra: a real-time audio/video system for interactive conducting.",
            "A per-object-granularity tracking mechanism and systemfor interactive TV viewership estimation and program rating in real time.",
            "Internet-based interactive HDTV.",
            "Editor's Note.",
            "ARTiFACIAL: Automated Reverse Turing test using FACIAL features.",
            "Periodic broadcasting with VBR-encoded video.",
            "Adaptive rate control for streaming flows over the Internet.",
            "Special Issue on Multimedia Document Management Systems.",
            "Relevance feedback techniques in the MARS image retrieval system.",
            "Robust content-based image indexing using contextual clues and automatic pseudofeedback.",
            "Multireference object pose retrieval with volume feedback.",
            "VDBMS: A testbed facility for research in video database benchmarking.",
            "Multimodal detection of highlights for multimedia content.",
            "Personal orchestra: a real-time audio/video system for interactive conducting."
        ]
    },
    {
        "name": "MS",
        "year": "2000",
        "info": "Volume 8, 2000-2003",
        "count": 47,
        "papers": [
            "Failure Recovery Algorithms for Multimedia Servers.",
            "Efficient Support for Interactive Scanning Operations in MPEG-Based Video-on-Demand Systems.",
            "Metrics for Shot Boundary Detection in Digital Video Sequences.",
            "Improving Multimedia Systems Performance Using Constant-Density Recording Disks.",
            "Providing QOS Guarantees for Disk I/O.",
            "Automatic Text Segmentation and Text Recognition for Video Indexing.",
            "Dynamic Quota-Based Admission Control with Sub-Rating in Multimedia Servers.",
            "Video Placement and Configuration of Distributed Video Servers on Cable TV Networks.",
            "SMDP: Minimizing Buffer Requirements for Continuous Media Servers.",
            "Modeling, Authoring and Formatting Hypermedia Documents in the HyperProp System.",
            "An Experimental Analysis of Digital Video Library Servers.",
            "Retrieval Scheduling for Collaborative Multimedia Presentations.",
            "Multimedia authoring and presentation techniques - guest editor's introduction.",
            "The \"Authoring on the Fly\" system for automated recording and replay of (tele)presentations.",
            "Constraint-based document layout for the Web.",
            "Content-based navigation of music using melodic pitch contours.",
            "Zodiac: A history-based interactive video authoring system.",
            "An algebra for creating and querying multimedia presentations.",
            "Dejittering in the transport of MPEG-2 and MPEG-4 video.",
            "MPEG-2 sources: exploiting source scalability for an efficient bandwidth allocation.",
            "Editor's Note.",
            "An adaptive video multicast scheme for varying workloads.",
            "Architectural considerations for next-generation file systems.",
            "Efficient schemes for broadcasting popular videos.",
            "JINSIL: A middleware for presentation of composite multimedia objects in a distributed environment.",
            "Design and characterization of the Berkeley multimedia workload.",
            "Smart VideoText: a video data model based on conceptual graphs.",
            "Editor's Note.",
            "A retrospective on the design of the GOPI middleware platform.",
            "Robust and efficient content-based digital audio watermarking.",
            "A systematic rate controller for MPEG-4 FGS video streaming.",
            "Constructing a video server with tertiary storage: Practice and experience.",
            "Middleware + multimedia = multimedia middleware?",
            "A proxy architecture for collaborative media streaming.",
            "Infopipes: An abstraction for multimedia streaming.",
            "An integrated runtime QoS-aware middleware framework for distributed multimedia applications.",
            "Dynamic end-to-end QoS management middleware for distributed multimedia systems.",
            "Editor's Note.",
            "A digital rights management scheme for broadcast video.",
            "Browsing and placement of multi-resolution images on parallel disks.",
            "Analysis, management and indexing of distributed multimedia performances based on audience feedback.",
            "Content-based audio classification and segmentation by using support vector machines.",
            "Introduction to the Special Issue on Content-Based Image Retrieval (CBIR) Guest Editors.",
            "Analyzing scenery images by monotonic tree.",
            "Discovery of a perceptual distance function for measuring image similarity.",
            "Yoda, an adaptive soft classification model: content-based similarity queries and beyond.",
            "Relevance feedback in image retrieval: A comprehensive review."
        ]
    },
    {
        "name": "MS",
        "year": "1999",
        "info": "Volume 7, 1999",
        "count": 46,
        "papers": [
            "Editorial: Special Issue on Audio and Multimedia.",
            "An Overview of Audio Information Retrieval.",
            "Structured Audio and Effects Processing in the MPEG-4 Multimedia Standard.",
            "Using Sonification.",
            "Interactive Environments for Music and Multimedia.",
            "Embedding Interactive Sounds in Multimedia Applications.",
            "Real-time Spatial Processing of Sounds for Music, Multimedia and Interactive Human-computer Interfaces.",
            "Synchronized Delivery and Playout of Distributed Stored Multimedia Streams.",
            "Dynamic Real-time Scheduling Strategies for Interactive Continuous Media Servers.",
            "A Circular Skip-cluster Scheme to Support Video-on-Demand Services.",
            "A Feature-Based Algorithm for Detecting and Classifying Production Effects.",
            "Integrated Spatial and Feature Image Query.",
            "A Progressively Reliable Transport Protocol for Interactive Wireless Multimedia.",
            "Silence Detection for Multimedia Communication Systems.",
            "Region-based Shape Representation and Similarity Measure Suitable for Content-based Image Retrieval.",
            "Image Retrieval by Color Semantics.",
            "NeTra: A Toolbox for Navigating Large Image Databases.",
            "A Survey of Statistical Source Models for Variable-bit-rate Compressed Video.",
            "TELEPORT - Towards Immersive Copresence.",
            "Fast Techniques for the Optimal Smoothing of Stored Video.",
            "Comparing Images Using Joint Histograms.",
            "Efficient Support for Interactive Operations in Multi-Resolution Video Servers.",
            "Editorial: Content-Processing for Video Browsing, Retrieval, and Editing.",
            "Efficient and Reliable Digital Media Archive for Content-based Retrieval.",
            "On Fast Microscopic Browsing of MPEG-compressed Video.",
            "Searching and Editing MPEG-Compressed Video in a Distributed Online Environment.",
            "Efficient Admission Control Algorithms for Multimedia Servers.",
            "An Effective Admission Control Mechanism for variable-bit-rate Video Streams.",
            "Dynamic Playout Scheduling Algorithms for Continuous Multimedia Streams.",
            "Adaptive Multimedia Synchronization in a Teleconference System.",
            "A Data Model and a Query Language for Multimedia Documents Databases.",
            "Guest Editorial.",
            "Wavelet-Based Video Indexing and Querying.",
            "Constructing Table-of-Content for Videos.",
            "Query by Video Clip.",
            "Video OCR: Indexing Digital News Libraries by Recognition of Superimposed Captions.",
            "2PSM: An Efficient Framework for Searching Video Information in a Limited-Bandwidth Environment.",
            "A Multi-Level Abstraction and Modeling in Video Databases.",
            "Interactive Authoring of Multimedia Documents in a Constraint-Based Authoring System.",
            "Design and Analysis of Permutation-Based Pyramid Broadcasting.",
            "Advancing Content-Based Image Retrieval by Exploiting Image Color and Region Features.",
            "A Scalable Storage Supporting Multistream Real-Time Data Retrieval.",
            "Curvature Scale Space Image in Shape Similarity Retrieval.",
            "Resource Allocation for Multimedia Traffic Flows Using Rate Variance Envelopes.",
            "Experimental Evaluation of Loss Perception in Continuous Media.",
            "Constraint-Based Automation of Multimedia Presentation Assembly."
        ]
    },
    {
        "name": "MS",
        "year": "1998",
        "info": "Volume 6, 1998",
        "count": 32,
        "papers": [
            "A Constraint-Based Approach to Shape Management in Multimedia Databases.",
            "Packet Audio Playout Delay Adjustment: Performance Bounds and Algorithms.",
            "Merging Video Streams in Multimedia Storage Server: Complexity and Heuristics.",
            "The Multimedia Multicasting Problem.",
            "Performability of Disk-Array-Based Video Servers.",
            "Scalability Support for Multiparty Multimedia Communications.",
            "A Standard Model for Multimedia Synchronization: PREMO Synchronization Objects.",
            "Control of Perceived Quality of Service in Multimedia Retrieval Services: Prediction-Based Mechanism vs. Compensation Buffers.",
            "Block-Based Manipulations on Transform-Compressed Images and Videos.",
            "A Buffer-Inventory-Based Dynamic Scheduling Algorithm for Multimedia-On-Demand Servers.",
            "A Survey of QoS Architectures.",
            "HeiRAT - Quality-of-Service Management for Distributed Multimedia Systems.",
            "Transporting QoS Adaptive Flows.",
            "The Tenet Experience and the Design of Protocols for Integrated-Services Internetworks.",
            "Scene Change Detection Techniques for Video Database Systems.",
            "Synchronization of Distributed Multimedia Systems with User Interactions.",
            "Buffer Model and Management in Distributed Multimedia Presentation Systems.",
            "Bandwidth Reservation with Selectable Bit-Rate Streams.",
            "Retrieval Schedules Based on Resource Availability and Flexible Presentation Specifications.",
            "An Event-Based Model for Continous Media Data on Heterogeneous Disk Servers.",
            "Traffic Characterization Algorithms for VBR Video in Multimedia Networks.",
            "Spatio-Temporal Composition and Indexing for Large Multimedia Applications.",
            "Quality-of-Service Adaptation in Distributed Multimedia Applications.",
            "MING-I: A Distributed Interactive Multimedia Document Development Mechanism.",
            "A Comparison of Reliable Multicast Protocols.",
            "Personalized, Interactive News on the Web.",
            "Frame Rate as a QoS Parameter and Its Influence on Speech Perception.",
            "Design and Evaluation of a Multimedia Storage Server for Mixed Traffic.",
            "Exploring Wait Tolerance in Effective Batching for Video-on-Demand Scheduling.",
            "Intelligent Multimedia Data: Data + Indices + Inference.",
            "Presentations for Databases in Multimedia Environments.",
            "Increasing Multimedia System Throughput with Consumption-based Buffer Management."
        ]
    },
    {
        "name": "MS",
        "year": "1997",
        "info": "Volume 5, 1997",
        "count": 32,
        "papers": [
            "Synchronization Support and Group-Membership Services for Reliable Distributed Multimedia Applications.",
            "Floor Control for Multimedia Conferencing and Collaboration.",
            "Spatio-Temporal Effects of Multimedia Objects Storage and Delivery for Video-on-Demand Systems.",
            "An Evaluation of Design Trade-Offs in a High-Performance, Media-on-Demand Server.",
            "Towards Video-Based Immersive Environments.",
            "Usage of Multisensory Information in Scientific Data Sensualization.",
            "Embodiments, Avatars, Clones and Agents for Multi-User, Multi-Sensory Virtual Worlds.",
            "The ALIVE System: Wireless, Full-Body Interaction with Autonomous Agents.",
            "Animating Virtual Actors in Real Environments.",
            "THRED: A Two-Handed Design System.",
            "An Internet Accessible Telepresence.",
            "Shared Virtual Worlds for Education: The ExploreNet Experiment.",
            "Guest Editorial: Introduction to Special Issue on NOSSDAV 1995.",
            "Determining End-to-End Delay Bounds in Heterogeneous Networks.",
            "RED-VBR: A Renegotiation-Based Approach to Support Delay-Sensitive VBR Video.",
            "Advance Reservations for Predictive Service in the Internet.",
            "Distributed Advance Reservation of Real-Time Connections.",
            "Efficient Data Layout, Scheduling and Playout Control in MARS.",
            "I/O Scheduling for Digital Continuous Media.",
            "Design and Analysis of a Video-on-Demand Server.",
            "Advances in Fractal Compression for Multimedia Applications.",
            "Disk Placement for Arbitrary-Rate Playback in an Interactive Video Server.",
            "Efficient Video File Allocation Schemes for Video-on-Demand Services.",
            "An Optimal Bandwidth Allocation Strategy for the Delivery of Compressed Prerecorded Video.",
            "Scheduling and Data Layout Policies for a Near-Line Multimedia Storage Architecture.",
            "An Adaptive Protocol for Synchronizing Media Streams.",
            "Scheduling and Admission Testing for Jitter-Constrained Periodic Threads.",
            "Impact of Video Scheduling on Bandwidth Allocation for Multiplexes MPEG Streams.",
            "Disk Load Balancing for Video-On-Demand Systems.",
            "Using Rotational Mirrored Declustering for Replica Placement in a Disk-Array-Based Video Server.",
            "Joint Rate Control for VBR MPEG Video on PVC ATM Links.",
            "Tertiary Storage in Multimedia Systems: Staging of Direct Access?"
        ]
    },
    {
        "name": "MS",
        "year": "1996",
        "info": "Volume 4, 1996",
        "count": 31,
        "papers": [
            "A Synchronization Algorithm for Distributed Multimedia Environments.",
            "Transformation and Exchange of Multimedia Objects in Distributed Multimedia Systems.",
            "Delay-Jitter Control in Multimedia Applications.",
            "On the Design of a Low-Cost Video-on-Demand Storage System.",
            "An Analysis of Buffer Sharing and Prefetching Techniques for Multimedia Systems.",
            "Issues in the Design of a Storage Server for Video-on-Demand.",
            "Supporting Constant-Bit-Rate-Encoded MPEG-2 Transport Over Local ATM Networks.",
            "Grammar-Based Articulation for Multimedia Document Design.",
            "Dynamic Batching Policies for an On-Demand Video Server.",
            "The Personal Presence System: A Wide-Area Network Resource for the Real-Time Composition of Multipoint Multimedia Communications.",
            "A Hierarchical Architecture for Buffer Management in Integrated Services Networks.",
            "Adaptive Piggybacking: A Novel Technique for Data Sharing in Video-on-Demand Storage Servers.",
            "Experiments with Video Transmission over an Asynchronous Transfer Mode (ATM) Network.",
            "The Advanced Video Information System: Data Structures and Query Processing.",
            "Storing Continuous-Media Data on a Compact Disc.",
            "Metropolitan Area Video-on-Demand Service Using Pyramid Broadcasting.",
            "Editorial: Special Issue on Tutorials and Surveys.",
            "Conferencing and Collaborative Computing.",
            "Multimedia Databases.",
            "Future Multimedia User Interfaces.",
            "Operating System Issues for Continuous Media.",
            "Multimedia Mail.",
            "Editorial: Special Issue on Multimedia Networking.",
            "Multimedia Network Protocols: Where Are We?",
            "Video Transport in ATM Networks: A Systems View.",
            "Impact of QOS Requirements on Video Coding for ATM Networks.",
            "A Pricing Mechanism for Scalable Video Delivery.",
            "Part 2: Traffic Control in Multimedia Networks - An Efficient Algorithm for Multimedia Call-Admission Control.",
            "RCSP and Stop-and-Go: A Comparison of Two Non-Work-Conserving Disciplines for Supporting Multimedia Communication.",
            "Traffic and Video Quality with Adaptive Neural Compression.",
            "Packet Video Transport in ATM Networks with Single-Bit Feedback."
        ]
    },
    {
        "name": "MS",
        "year": "1995",
        "info": "Volume 3, 1995",
        "count": 26,
        "papers": [
            "Special Section on Content-based Retrieval.",
            "Vision Texture for Annotation.",
            "Automatic Authoring and Construction of Hypermedia for Information Retrieval.",
            "CORE: A Content-Based Retrieval Engine for Multimedia Information Systems.",
            "Evaluating Video Layout Strategies for a High-Performance Storage Server.",
            "Operating System Support for a Video-on-Demand File Service.",
            "Quality-of-Service Management for Multimedia Streams with Fixed Arrival Periods and Variable Frame Sizes.",
            "Continuous Display of Presentations Sharing Clips.",
            "A Dynamic Policy of Segment Replication for Load-Balancing in Video-On-Demand Servers.",
            "The ViewStation: A Software-Intensive Approach to Media Processing and Distribution.",
            "Audio Formatting - Presenting Structured Information Aurally.",
            "Storage and Retrieval Methods to Support Fully Interactive Playout in a Disk-Array-Based Video Server.",
            "Design and Analysis of a Look-Ahead Scheduling Scheme to Support Pause-Resume for Video-on-Demand Applications.",
            "Storage and Synchronization for Distributed Continuous Media.",
            "A Performance Analysis of an Object-Based I/O Architecture in a Video Server Environment.",
            "Special Issue on Multimedia Database Systems.",
            "An Object-Oriented Multimedia Database System for a News-on-Demand Applications.",
            "The Management and Application of Teleaction Objects.",
            "Design of a Multimedia Object-Oriented DBMS.",
            "A Multiresolution Representation Scheme for Multimedia Databases.",
            "An Architecture and a Data Model for Integrated Multimedia Documents and Presentational Applications.",
            "Quality of Service Specifications for Multimedia Presentations.",
            "Providing Definition and Temporal Structure for Multimedia Data.",
            "Continuous Media Described by Time-Dependent Data.",
            "Audio Support for an Object-Oriented Database-Management System.",
            "Issues in Storage and Retrieval of Multimedia Data."
        ]
    },
    {
        "name": "MS",
        "year": "1994",
        "info": "Volume 2, 1994/1995",
        "count": 24,
        "papers": [
            "Inference and Retrieval of Facial Images.",
            "Receiver Architectures for Real-Time Image-Compression Algorithms Based on a Feature-Visibility Model.",
            "Object Composition and Playback Models for Handling Multimedia Data.",
            "Performance Analysis of Advanced I/O Architectures for PC-Based Video Servers.",
            "Synchronization Models for Multimedia Presentation with User Participation.",
            "What Video Can and Cannot Do For Collaboration: A Case Study.",
            "Communication Support for Distributed Collaborative Applications.",
            "Architecture and Algorithms of the Xphone Multimedia Communications System.",
            "A Performance Analysis of Personal Computers in a Video Conferencing Environment.",
            "A Scheduling Discipline and Admission Control Policy for Xunet 2.",
            "Eventor: An Authoring System for Interactive Multimedia Applications.",
            "Receiver-Initiated Communication with ST-II.",
            "The Vidboard: A Video Capture and Processing Peripheral for a Distributed Multimedia System.",
            "Compact Disc Standards: An Introductory Overview.",
            "Media Sharing in a Multimedia Communication System.",
            "On Architecture for Video Compositing.",
            "Vector-Quantization-Based Video Codec for Software-Only Playback on Personal Computers.",
            "A Comparison of Fast Inverse Discrete Cosine Transform Algorithms.",
            "Compressing Still and Moving Images with Wavelets.",
            "Experiments on Block-Matching Techniques for Video Coding.",
            "A Priority Media Access Control Protocol for Video Communication Support on CSMA/CD LANs.",
            "Automatic Parsing and Indexing of News Video.",
            "An Empirical Study of a Jitter Management Scheme for Video Teleconferencing.",
            "Popularity-Based Assignment of Movies to Storage Devices in a Video-on-Demand System."
        ]
    },
    {
        "name": "MS",
        "year": "1993",
        "info": "Volume 1, 1993/1994",
        "count": 24,
        "papers": [
            "The Impact of Scaling on a Multimedia Connection Architecture.",
            "Automatic Partitioning of Full-Motion Video.",
            "MIME: A Portable and Robust Multimedia Format for Internet Mail.",
            "Proactive Cooperative Scheduling and Buffer Management for Multimedia Networks.",
            "Automatically Generating Consistent Schedules for Multimedia Documents.",
            "Specification and Support of Adaptable Networked Multimedia.",
            "Tactus: Toolkit-Level Support for Synchronized Interactive Multimedia.",
            "A Framework for Synchronous Delivery of Time-Dependent Multimedia Data.",
            "Grouped Sweeping Scheduling for DASD-based Multimedia Storage Management.",
            "Real-time Software-based Video Codes for Multimedia Communication Systems.",
            "The Washington University Multimedia System.",
            "Video as a High-level Data Type.",
            "Multimedia Teleorchestra with Independent Sources: Part 1 - Temporal Modeling of Collaborative Multimedia Scenarios.",
            "Multimedia Teleorchestra with Independent Sources: Part 2 - Synchronization Algorithms.",
            "Data Compression in Multimedia Computing: Principles and Techniques.",
            "HyOctane: A HyTime Engine for an MMIS.",
            "Data Compression in Multimedia Computing: Standards and Systems.",
            "Projection-detecting Filter for Video Cut Detection.",
            "Image Processing on Encoded Video Sequences.",
            "MPEGTool: an X Window-based MPEG Encoder and Statistics Tool.",
            "Comparison of Transform Coding Techniques for Two-Dimensional Arbitrarily Shaped Images.",
            "Multichannel Delay Sensitive Data Retrieval.",
            "Modeling Video Sources for Real-Time Scheduling.",
            "Dynamic Management of Guaranteed-Performance Multimedia Connections."
        ]
    }
]