[
    {
        "year": "2021",
        "name": "PacificVis 2021",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2021",
                "sub_name": "14th IEEE Pacific Visualization Symposium, PacificVis 2021, Tianjin, China, April 19-21, 2021.",
                "count": 29,
                "papers": [
                    "Visual Analysis on Machine Learning Assisted Prediction of Ionic Conductivity for Solid-State Electrolytes.",
                    "A Machine Learning Approach for Predicting Human Preference for Graph Layouts*.",
                    "ADVISor: Automatic Visualization Answer for Natural-Language Question on Tabular Data.",
                    "Automatic Generation of Unit Visualization-based Scrollytelling for Impromptu Data Facts Delivery.",
                    "Parsing and Summarizing Infographics with Synthetically Trained Icon Detection.",
                    "Visualising Temporal Uncertainty: A Taxonomy and Call for Systematic Evaluation.",
                    "An Extension of Empirical Orthogonal Functions for the Analysis of Time-Dependent 2D Scalar Field Ensembles.",
                    "NetScatter: Visual analytics of multivariate time series with a hybrid of dynamic and static variable relationships.",
                    "Stable Visual Summaries for Trajectory Collections.",
                    "Visual Analysis of Spatio-Temporal Trends in Time-Dependent Ensemble Data Sets on the Example of the North Atlantic Oscillation.",
                    "Visualization Support for Multi-criteria Decision Making in Software Issue Propagation.",
                    "Know-What and Know-Who: Document Searching and Exploration using Topic-Based Two-Mode Networks.",
                    "Context-Responsive Labeling in Augmented Reality.",
                    "Mapper Interactive: A Scalable, Extendable, and Interactive Toolbox for the Visual Exploration of High-Dimensional Data.",
                    "Mixed-Initiative Approach to Extract Data from Pictures of Medical Invoice.",
                    "FiberStars: Visual Comparison of Diffusion Tractography Data between Multiple Subjects.",
                    "Unravelling the Human Perspective and Considerations for Urban Data Visualization.",
                    "Exploratory User Study on Graph Temporal Encodings.",
                    "On the Visualization of Hierarchical Multivariate Data.",
                    "Sublinear-Time Attraction Force Computation for Large Complex Graph Drawing.",
                    "Louvain-based Multi-level Graph Drawing.",
                    "GDot: Drawing Graphs with Dots and Circles.",
                    "Sublinear-time Algorithms for Stress Minimization in Graph Drawing.",
                    "Papers101: Supporting the Discovery Process in the Literature Review Workflow for Novice Researchers.",
                    "Visual Analytics Methods for Interactively Exploring the Campus Lifestyle.",
                    "Investigating the Evolution of Tree Boosting Models with Visual Analytics.",
                    "A Visual Analytics Approach for the Diagnosis of Heterogeneous and Multidimensional Machine Maintenance Data.",
                    "KeywordMap: Attention-based Visual Exploration for Keyword Analysis.",
                    "Visualization of Topic Transitions in SNSs Using Document Embedding and Dimensionality Reduction."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "PacificVis 2020",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2020",
                "sub_name": "2020 IEEE Pacific Visualization Symposium, PacificVis 2020, Tianjin, China, June 3-5, 2020.",
                "count": 30,
                "papers": [
                    "Dynamic Graph Map Animation.",
                    "A Study of Mental Maps in Immersive Network Visualization.",
                    "Quality Metrics for Symmetric Graph Drawings.",
                    "BatchLayout: A Batch-Parallel Force-Directed Graph Layout Algorithm in Shared Memory.",
                    "ExplainExplore: Visual Exploration of Machine Learning Explanations.",
                    "DynamicsExplorer: Visual Analytics for Robot Control Tasks involving Dynamics and LSTM-based Control Policies.",
                    "Interactive Attention Model Explorer for Natural Language Processing Tasks with Unbalanced Data Sizes.",
                    "SCANViz: Interpreting the Symbol-Concept Association Captured by Deep Neural Networks through Visual Analytics.",
                    "Visual Interpretation of Recurrent Neural Network on Multi-dimensional Time-series Forecast.",
                    "SSR-VFD: Spatial Super-Resolution for Vector Field Data Analysis and Visualization.",
                    "Toward Feature-Preserving 2D and 3D Vector Field Compression.",
                    "LBVis: Interactive Dynamic Load Balancing Visualization for Parallel Particle Tracing.",
                    "Visualization of Unsteady Flow Using Heat Kernel Signatures.",
                    "Tensor Spines - A Hyperstreamlines Variant Suitable for Indefinite Symmetric Second-Order Tensors.",
                    "Uncertainty Treemaps.",
                    "Space-Reclaiming Icicle Plots.",
                    "PansyTree: Merging Multiple Hierarchies.",
                    "Efficient Morphing of Shape-preserving Star Coordinates.",
                    "Leveraging Peer Feedback to Improve Visualization Education.",
                    "Representing Multivariate Data by Optimal Colors to Uncover Events of Interest in Time Series Data.",
                    "Immersive WYSIWYG (What You See is What You Get) Volume Visualization.",
                    "Distribution-based Particle Data Reduction for In-situ Analysis and Visualization of Large-scale N-body Cosmological Simulations.",
                    "Towards Rigorously Designed Preference Visualizations for Group Decision Making.",
                    "AutoCaption: An Approach to Generate Natural Language Description from Visualization Automatically.",
                    "Uncertainty Visualisation: An Interactive Visual Survey.",
                    "A Visual Analytics Framework for Reviewing Streaming Performance Data.",
                    "PINGU Principles of Interactive Navigation for Geospatial Understanding.",
                    "A Radial Visualisation for Model Comparison and Feature Identification.",
                    "A Conference Paper Exploring System Based on Citing Motivation and Topic.",
                    "Interactive Assigning of Conference Sessions with Visualization and Topic Modeling."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "PacificVis 2019",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2019",
                "sub_name": "IEEE Pacific Visualization Symposium, PacificVis 2019, Bangkok, Thailand, April 23-26, 2019.",
                "count": 32,
                "papers": [
                    "CorFish: Coordinating Emphasis Across Multiple Views Using Spatial Distortion.",
                    "Collaborative Visual Analysis with Multi-level Information Sharing Using a Wall-Size Display and See-Through HMDs.",
                    "Object-in-Hand Feature Displacement with Physically-Based Deformation.",
                    "Challenges for Brain Data Analysis in VR Environments.",
                    "Jacob's Ladder: The User Implications of Leveraging Graph Pivots.",
                    "The Role of Working Memory Capacity in Graph Reading Performance.",
                    "Scatterplot Summarization by Constructing Fast and Robust Principal Graphs from Skeletons.",
                    "Defamiliarization, Representation Granularity, and User Experience: A Qualitative Study with Two Situated Visualizations.",
                    "Emoji and Chernoff - A Fine Balancing Act or are we Biased?",
                    "Visual Analytics of Dynamic Interplay Between Behaviors in MMORPGs.",
                    "What-Why Analysis of Expert Interviews: Analysing Geographically-Embedded Flow Data.",
                    "User Evaluation of Group-in-a-Box Variants.",
                    "An Interactive Visual Analytics System for Incremental Classification Based on Semi-supervised Topic Modeling.",
                    "Visual Quality Guidance for Document Exploration with Focus+Context Techniques.",
                    "Visual Analytics of Taxi Trajectory Data via Topical Sub-trajectories.",
                    "GitViz: An Interactive Visualization System for Analyzing Development Trends in the Open-Source Software Community.",
                    "EngineQV: Investigating External Cause of Engine Failures Based on Geo-Temporal Association.",
                    "Analysis of Coupled Thermo-Hydro-Mechanical Simulations of a Generic Nuclear Waste Repository in Clay Rock Using Fiber Surfaces.",
                    "Visual Exploration of Circulation Rolls in Convective Heat Flows.",
                    "Visual Analysis of Ligand Trajectories in Molecular Dynamics.",
                    "A Linear Time BVH Construction Algorithm for Sparse Volumes.",
                    "Uncertainty-Aware Ramachandran Plots.",
                    "Interactive Spatiotemporal Visualization of Phase Space Particle Trajectories Using Distance Plots.",
                    "Designing Narrative Slideshows for Learning Analytics.",
                    "A Visual Approach for the Comparative Analysis of Character Networks in Narrative Texts.",
                    "An Interactive Chart of Biography.",
                    "Smart Survey Tool: A Multi Device Platform for Museum Visitor Tracking and Tracking Data Visualization.",
                    "An Interactive System for Exploring Historical Fire Data.",
                    "DNN-VolVis: Interactive Volume Visualization Supported by Deep Neural Network.",
                    "Statistical Super Resolution for Data Analysis and Visualization of Large Scale Cosmological Simulations.",
                    "ComDia+: An Interactive Visual Analytics System for Comparing, Diagnosing, and Improving Multiclass Classifiers.",
                    "Space-Time Slicing: Visualizing Object Detector Performance in Driving Video Sequences."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "PacificVis 2018",
        "info": "Kobe, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2018",
                "sub_name": "IEEE Pacific Visualization Symposium, PacificVis 2018, Kobe, Japan, April 10-13, 2018.",
                "count": 29,
                "papers": [
                    "Optimal Algorithms for Compact Linear Layouts.",
                    "BC Tree-Based Proxy Graphs for Visualization of Big Graphs.",
                    "Development of an Integrated Visualization System for Phenotypic Character Networks.",
                    "Image and Distribution Based Volume Rendering for Large Data Sets.",
                    "Smart Surrogate Widgets for Direct Volume Manipulation.",
                    "Topologically Controlled Lossy Compression.",
                    "Information Guided Data Sampling and Recovery Using Bitmap Indexing.",
                    "In Situ Prediction Driven Feature Analysis in Jet Engine Simulations.",
                    "Access Pattern Learning with Long Short-Term Memory for Parallel Particle Tracing.",
                    "Dynamic Data Repartitioning for Load-Balanced Parallel Particle Tracing.",
                    "Uncertainty Visualization for Secondary Structures of Proteins.",
                    "Modeling and Visualization of Uncertainty-Aware Geometry Using Multi-variate Normal Distributions.",
                    "Visualization of Fullerene Fragmentation.",
                    "Composite Visual Mapping for Time Series Visualization.",
                    "Visual Detection of Structural Changes in Time-Varying Graphs Using Persistent Homology.",
                    "Optimal Sankey Diagrams Via Integer Programming.",
                    "A Visual Analytics Approach for Equipment Condition Monitoring in Smart Factories of Process Industry.",
                    "Visual Analysis of Collective Anomalies Through High-Order Correlation Graph.",
                    "Visual Analytics for Networked-Guarantee Loans Risk Management.",
                    "FraudVis: Understanding Unsupervised Fraud Detection Algorithms.",
                    "HeloVis: A Helical Visualization for SIGINT Analysis Using 3D Immersion.",
                    "Visualizing Deep Neural Networks for Text Analytics.",
                    "TagNet: Toward Tag-Based Sentiment Analysis of Large Social Media Data.",
                    "An Evaluation of Perceptually Complementary Views for Multivariate Data.",
                    "Know Your Enemy: Identifying Quality Problems of Time Series Data.",
                    "An Automatic Deformation Approach for Occlusion Free Egocentric Data Exploration.",
                    "Exploring the Role of Sound in Augmenting Visualization to Enhance User Engagement.",
                    "A Comparative 3D Visualization Tool for Observation of Mode Water.",
                    "An Evolutionary Signature for Animated Meshes."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "PacificVis 2017",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2017",
                "sub_name": "2017 IEEE Pacific Visualization Symposium, PacificVis 2017, Seoul, South Korea, April 18-21, 2017.",
                "count": 41,
                "papers": [
                    "Chair message.",
                    "Keynote speaker: Changing the world with visual analytics.",
                    "Keynote speaker: Requirements and recent directions in augmented reality visualization.",
                    "HoNVis: Visualizing and exploring higher-order networks.",
                    "Privacy preserving visualization for social network data with ontology information.",
                    "k-core based multi-level graph visualization for scale-free networks.",
                    "NetSet: A systematic integration of visualization for analyzing set intersections with network.",
                    "A visual analytics approach for understanding egocentric intimacy network evolution and impact propagation in MMORPGs.",
                    "A gesture system for graph visualization in virtual reality environments.",
                    "Design space for spatio-data coordination: Tangible interaction devices for immersive information visualisation.",
                    "Virtual retractor: An interactive data exploration system using physically based deformation.",
                    "Interaction+: Interaction enhancement for web-based visualizations.",
                    "In situ magnetic flux vortex visualization in time-dependent Ginzburg-Landau superconductor simulations.",
                    "Designing interactive distance cartograms to support urban travelers.",
                    "MobiSeg: Interactive region segmentation using heterogeneous mobility data.",
                    "Exploring the evolution of pressure-perturbations to understand atmospheric phenomena.",
                    "Homogeneity guided probabilistic data summaries for analysis and visualization of large-scale data sets.",
                    "Efficient distribution-based feature search in multi-field datasets.",
                    "SwiftTuna: Responsive and incremental visual exploration of large-scale multidimensional data.",
                    "Multivariate volumetric data analysis and visualization through bottom-up subspace exploration.",
                    "Range likelihood tree: A compact and effective representation for visual exploration of uncertain data sets.",
                    "Statistical visualization and analysis of large data using a value-based spatial distribution.",
                    "Transfer Function design toolbox for full-color volume datasets.",
                    "Efficient GPU-accelerated computation of isosurface similarity maps.",
                    "Using interactive particle-based rendering to visualize a large-scale time-varying unstructured volume with mixed cell types.",
                    "FFTEB: Edge bundling of huge graphs by the Fast Fourier Transform.",
                    "Visualizing the uncertainty induced by graph layout algorithms.",
                    "CactusTree: A tree drawing approach for hierarchical edge bundling.",
                    "Quasi-biclique edge concentration: A visual analytics method for biclustering.",
                    "Aeonium: Visual analytics to support collaborative qualitative coding.",
                    "ChartAccent: Annotation for data-driven storytelling.",
                    "Exploring controversy via sentiment divergences of aspects in reviews.",
                    "A visual analytics system for brain functional connectivity comparison across individuals, groups, and time points.",
                    "DrugPathSeeker: Interactive UI for exploring drug-ADR relation via pathways.",
                    "BioLinker: Bottom-up exploration of protein interaction networks.",
                    "Interactive visualization of assembly instruction for stone tools restoration.",
                    "Implicit Sphere Shadow Maps.",
                    "Compression and shifting to reduce occlusion in multiple short time series.",
                    "dNNG: Quality metrics and layout for neighbourhood faithfulness.",
                    "Radial contour labeling with straight leaders.",
                    "Making many-to-many parallel coordinate plots scalable by asymmetric biclustering."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "PacificVis 2016",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2016",
                "sub_name": "2016 IEEE Pacific Visualization Symposium, PacificVis 2016, Taipei, Taiwan, April 19-22, 2016.",
                "count": 41,
                "papers": [
                    "Keynote speaker: Visualization analysis and design.",
                    "Keynote speaker: Visualization for deep learning training.",
                    "SepMe: 2002 New visual separation measures.",
                    "Mathematical foundations of arc length-based aspect ratio selection.",
                    "Spot-tracking lens: A zoomable user interface for animated bubble charts.",
                    "Visualizing knots and braids with touchable 3D manipulatives.",
                    "Interactive visual co-cluster analysis of bipartite graphs.",
                    "A crowdsourcing system for integrated and reproducible evaluation in scientific visualization.",
                    "An integrated visualization system for interactive analysis of large, heterogeneous cosmology data.",
                    "EnsembleGraph: Interactive visual analysis of spatiotemporal behaviors in ensemble simulation data.",
                    "Rethinking sensitivity analysis of nuclear simulations with topology.",
                    "Topology-inspired Galilean invariant vector field analysis.",
                    "Efficient unsteady flow visualization with high-order access dependencies.",
                    "Comparative visualization of multiple time surfaces by planar surface reformation.",
                    "Comparative visualization of vector field ensembles based on longest common subsequence.",
                    "An integrated geometric and topological approach to connecting cavities in biomolecules.",
                    "Accelerated visualization of transparent molecular surfaces in molecular dynamics.",
                    "Interactive exploration of atomic trajectories through relative-angle distribution and associated uncertainties.",
                    "Dimension reconstruction for visual exploration of subspace clusters in high-dimensional data.",
                    "A visual analytics approach to high-dimensional logistic regression modeling and its application to an environmental health study.",
                    "Geo word clouds.",
                    "ICLIC: Interactive categorization of large image collections.",
                    "Visual monitoring of process runs: An application study for stored procedures.",
                    "MovementSlicer: Better Gantt charts for visualizing behaviors and meetings in movement data.",
                    "TravelDiff: Visual comparison analytics for massive movement patterns derived from Twitter.",
                    "Multilayer graph edge bundling.",
                    "Visualization of origin-destination matrices using a connection barchart and coordinated maps.",
                    "NetworkSeer: Visual analysis for social network in MOOCs.",
                    "Effects of curves on graph perception.",
                    "Screen-space silhouettes for visualizing ensembles of 3D isosurfaces.",
                    "Visualizing the variations of ensemble of isosurfaces.",
                    "A Bayesian approach for probabilistic streamline computation in uncertain flows.",
                    "A study of using motion for comparative visualization.",
                    "A visual analytics approach for exploring individual behaviors in smartphone usage data.",
                    "Visual analysis of body movement in serious games for healthcare.",
                    "STAC: Enhancing stacked graphs for time series analysis.",
                    "Semantic word cloud generation based on word embeddings.",
                    "A design study of personal bibliographic data visualization.",
                    "Bookwall: Visualizing books online based on user experience in physical bookstores.",
                    "A design study to identify inconsistencies in kinship information: The case of the 1000 Genomes project.",
                    "Fostering comparisons: Designing an interactive exhibit that visualizes marine animal behaviors."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "PacificVis 2015",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2015",
                "sub_name": "2015 IEEE Pacific Visualization Symposium, PacificVis 2015, Hangzhou, China, April 14-17, 2015.",
                "count": 46,
                "papers": [
                    "Keynote speaker.",
                    "Keynote speaker.",
                    "Interactive streamline exploration and manipulation using deformation.",
                    "Moment invariants for 3D flow fields via normalization.",
                    "Surface flow visualization using the closest point embedding.",
                    "Parallel unsteady flow line integral convolution for high-performance dense visualization.",
                    "Dendrogramix: A hybrid tree-matrix visualization technique to support interactive exploration of dendrograms.",
                    "Attribute-driven edge bundling for general graphs with applications in trail analysis.",
                    "Interactive visual summary of major communities in a large network.",
                    "Clustered edge routing.",
                    "Spherical layout and rendering methods for immersive graph visualization.",
                    "Laplacian-based dynamic graph visualization.",
                    "MultiStory: Visual analytics of dynamic multi-relational networks.",
                    "Variational circular treemaps for interactive visualization of hierarchical data.",
                    "OD-Wheel: Visual design to explore OD patterns of a central region.",
                    "Analyzing delays in trajectories.",
                    "Applying feature integration theory to glyph-based information visualization.",
                    "ERICAs: Enabling insights into ab initio Molecular Dynamics simulations.",
                    "Extending Dimensions in Radviz based on mean shift.",
                    "Text visualization techniques: Taxonomy, visual survey, and community insights.",
                    "Visual exploration of Location-Based Social Networks data in urban planning.",
                    "SentiCompass: Interactive visualization for exploring and comparing the sentiments of time-varying twitter data.",
                    "Application of Pareto sets in quality control of series production in car manufacturing.",
                    "Visualizing 2D scalar fields with hierarchical topology.",
                    "Adaptive particle relaxation for time surfaces.",
                    "Computation-to-core mapping strategies for iso-surface volume rendering on GPUs.",
                    "VisMOOC: Visualizing video clickstream data from Massive Open Online Courses.",
                    "TraVis - A visualization framework for mobile transect data sets in an urban microclimate context.",
                    "CloudGazer: A divide-and-conquer approach to monitoring and optimizing cloud-based networks.",
                    "Can twitter really save your life? A case study of visual social media analytics for situation awareness.",
                    "MetaTracts - A method for robust extraction and visualization of carbon fiber bundles in fiber reinforced composites.",
                    "SketchInsight: Natural data exploration on interactive whiteboards leveraging pen and touch interaction.",
                    "Clutter-aware label layout.",
                    "Uncertainty modeling and error reduction for pathline computation in time-varying flow fields.",
                    "An uncertainty-driven approach to vortex analysis using oracle consensus and spatial proximity.",
                    "Efficient volume illumination with multiple light sources through selective light updates.",
                    "Advanced lighting for unstructured-grid data visualization.",
                    "Illustrative Timelapse: A technique for illustrative visualization of particle-based simulations.",
                    "Coverage-based opacity estimation for interactive Depth of Field in molecular visualization.",
                    "Distance between extremum graphs.",
                    "A parallel and memory efficient algorithm for constructing the contour tree.",
                    "Ray tracing within a data parallel framework.",
                    "Biclustering multivariate data for correlated subspace mining.",
                    "Improving the fidelity of contextual data layouts using a Generalized Barycentric Coordinates framework.",
                    "Interactive high-dimensional visualization of social graphs.",
                    "TrajRank: Exploring travel behaviour on a route by trajectory ranking."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "PacificVis 2014",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2014",
                "sub_name": "IEEE Pacific Visualization Symposium, PacificVis 2014, Yokohama, Japan, March 4-7, 2014.",
                "count": 58,
                "papers": [
                    "Exploring Curved Schematization.",
                    "FlowString: Partial Streamline Matching Using Shape Invariant Similarity Measure for Exploratory Flow Visualization.",
                    "Non-overlapping Aggregated Multivariate Glyphs for Moving Objects.",
                    "FlowTour: An Automatic Guide for Exploring Internal Flow Features.",
                    "Scalable Lagrangian-Based Attribute Space Projection for Multivariate Unsteady Flow Data.",
                    "Moment Invariants for 2D Flow Fields Using Normalization.",
                    "2D Vector Field Simplification Based on Robustness.",
                    "An Edge-Bundling Layout for Interactive Parallel Coordinates.",
                    "Visual Signature of High-Dimensional Geometry in Parallel Coordinates.",
                    "ScagExplorer: Exploring Scatterplots by Their Scagnostics.",
                    "Using Entropy-Related Measures in Categorical Data Visualization.",
                    "Hierarchical Focus+Context Heterogeneous Network Visualization.",
                    "Rebuilding KEGG Maps: Algorithms and Benefits.",
                    "Improved Optimal and Approximate Power Graph Compression for Clearer Visualisation of Dense Graphs.",
                    "Maps of Computer Science.",
                    "Let It Flow: A Static Method for Exploring Dynamic Graphs.",
                    "Image Flows Visualization for Inter-media Comparison.",
                    "Visualizing Hidden Themes of Taxi Movement with Semantic Transformation.",
                    "Tensor Visualization Driven Mechanical Component Design.",
                    "FiberScout: An Interactive Tool for Exploring and Analyzing Fiber Reinforced Polymers.",
                    "A Visual Analytics Approach to Study Anatomic Covariation.",
                    "A Mobile Visual Analytics Approach for Law Enforcement Situation Awareness.",
                    "Revisiting Crisis Maps with Geo-temporal Tag Visualization.",
                    "Embedding Temporal Display into Maps for Occlusion-Free Visualization of Spatio-temporal Data.",
                    "Visual Analysis of Movement Behavior Using Web Data for Context Enrichment.",
                    "Efficient Range Distribution Query for Visualizing Scientific Data.",
                    "Multidimensional Projection with Radial Basis Function and Control Points Selection.",
                    "Manipulating Bilevel Feature Space for Category-Aware Image Exploration.",
                    "Color Tunneling: Interactive Exploration and Selection in Volumetric Datasets.",
                    "CluE: An Algorithm for Expanding Clustered Graphs.",
                    "A New Type of Web Graph for Personalized Visualization.",
                    "Boundary Labeling Methods for Dynamic Focus Regions.",
                    "Enhancing Layout and Interaction in Formal Concept Analysis.",
                    "Bridging the Gap of Network Management and Anomaly Detection through Interactive Visualization.",
                    "Visual Detection of Anomalies in DNS Query Log Data.",
                    "Transfer Function Map.",
                    "Application of Stochastic Point-Based Rendering to Transparent Visualization of Large-Scale Laser-Scanned Data of 3D Cultural Assets.",
                    "A Stochastic Approach for Rendering Multiple Irregular Volumes.",
                    "An Alternative Formulation of Lyapunov Exponents for Computing Lagrangian Coherent Structures.",
                    "2-3-4 Combination for Parallel Compression on the K Computer.",
                    "Strategies for Fault-Tolerant Distributed Visualization.",
                    "Improving Visual Communication for EIT-Based Lung Research.",
                    "Visualizing Time-Dependent Variables of Water Distribution Systems.",
                    "Visual Analysis of Dynamic Protein Cavities and Binding Sites.",
                    "Visual Analysis of Habitat Suitability Index Model for Predicting the Locations of Fishing Grounds.",
                    "Visualization of Building Performance Simulation Results: State-of-the-Art and Future Directions.",
                    "Traffic Origins: A Simple Visualization Technique to Support Traffic Incident Analysis.",
                    "EmailMap: Visualizing Event Evolution and Contact Interaction within Email Archives.",
                    "A Total Variation Based Spiral Video Visualization Method.",
                    "WeiboEvents: A Crowd Sourcing Weibo Visual Analytic System.",
                    "Affective and Effective Visualisation: Communicating Science to Non-expert Users.",
                    "Application of Visual Analytics to Ocean Science: Case Studies.",
                    "Visual Analytics of Malignant Blood Flow for Medical Professionals.",
                    "Analytical Visualization of Large-Scale Data of 3D Cultural Objects.",
                    "Agenda Setting in Policy-Making Using Visualization Techniques.",
                    "Japanese Behavior in Visual Analytics of Temporal Daily Life Data.",
                    "Visualizing Differences of DTI Fiber Models Using 2D Normalized Embeddings.",
                    "Visualization for Visual Analytics: Micro-visualization, Abstraction, and Physical Appeal."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "PacificVis 2013",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2013",
                "sub_name": "IEEE Pacific Visualization Symposium, PacificVis 2013, February 27 2013-March 1, 2013, Sydney, NSW, Australia.",
                "count": 34,
                "papers": [
                    "Circular-arc cartograms.",
                    "Exploring entities in text with descriptive non-photorealistic rendering.",
                    "Constrained optimization for disoccluding geographic landmarks in 3D urban maps.",
                    "Improved grid map layout by point set matching.",
                    "Reordering Massive Sequence Views: Enabling temporal and structural analysis of dynamic networks.",
                    "Smooth bundling of large streaming and sequence graphs.",
                    "GraphCharter: Combining browsing with query to explore large semantic graphs.",
                    "Visual summaries for graph collections.",
                    "Local WYSIWYG volume visualization.",
                    "Transfer function design based on user selected samples for intuitive multivariate volume exploration.",
                    "Evaluation of Depth of Field for depth perception in DVR.",
                    "Transformations for volumetric range distribution queries.",
                    "Guiding Deep Brain Stimulation interventions by fusing multimodal uncertainty regions.",
                    "Discovering and visualizing patterns in EEG data.",
                    "A topologically-enhanced juxtaposition tool for hybrid wind tunnel.",
                    "Visualization of piecewise linear interface calculation.",
                    "Illustrative visualization of cardiac and aortic blood flow from 4D MRI data.",
                    "iTree: Exploring time-varying data using indexable tree.",
                    "Interactive selection of multivariate features in large spatiotemporal data.",
                    "Self-organizing maps for multi-objective pareto frontiers.",
                    "Joint Contour Nets: Computation and properties.",
                    "Visual task solution strategies in tree diagrams.",
                    "Exploring agent-based simulations in political science using Aggregate Temporal Graphs.",
                    "Visual analysis of uncertainties in ocean forecasts for planning and operation of off-shore structures.",
                    "A visual analytics approach to exploring protein flexibility subspaces.",
                    "Visualizing edge-edge relations in graphs.",
                    "On the faithfulness of graph visualizations.",
                    "FlexGD: A flexible force-directed model for graph drawing.",
                    "A generative layout approach for rooted tree drawings.",
                    "FlowGraph: A compound hierarchical graph for flow field exploration.",
                    "Poisson-based tools for flow visualization.",
                    "Visualizing linear neighborhoods in non-linear vector fields.",
                    "Exploring vector fields with distribution-based streamline analysis.",
                    "Automatic, tensor-guided illustrative vector field visualization."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "PacificVis 2012",
        "info": "Songdo, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2012",
                "sub_name": "2012 IEEE Pacific Visualization Symposium, PacificVis 2012, Songdo, Korea (South), February 28 - March 2, 2012.",
                "count": 32,
                "papers": [
                    "Challenges for information visualization research: Visual quality and data quantity.",
                    "Quantitative visualization in the computational biological sciences.",
                    "Exploring the design space of composite visualization.",
                    "Topological analysis and visualization of cyclical behavior in memory reference traces.",
                    "A network-based interface for the exploration of high-dimensional data spaces.",
                    "Progressive parallel coordinates.",
                    "Embedding, clustering and coloring for dynamic maps.",
                    "Spatiotemporal anomaly detection through visual analysis of geolocated Twitter messages.",
                    "Analyzing the evolution of large scale structures in the universe with velocity based methods.",
                    "Analysis and visualization of temporal changes in bloggers' activities and interests.",
                    "SideKnot: Revealing relation patterns for graph visualization.",
                    "A maxent-stress model for graph layout.",
                    "Numerical optimization-based graph drawing revisited.",
                    "The mental map and memorability in dynamic graphs.",
                    "Effects of illumination, texture, and motion on task performance in 3D tensor-field streamtube visualizations.",
                    "Visual 4D MRI blood flow analysis with line predicates.",
                    "A statistics-based dimension reduction of the space of path line attributes for interactive visual flow analysis.",
                    "A benchmark for evaluating FTLE computations.",
                    "Dense flow visualization using wave interference.",
                    "Output-coherent image-space LIC for surface flow visualization.",
                    "A flow-guided file layout for out-of-core streamline computation.",
                    "As-Perpendicular-as-possible surfaces for flow visualization.",
                    "Volume rendering with multidimensional peak finding.",
                    "Combined surface and volumetric occlusion shading.",
                    "Interference microscopy volume illustration for biomedical data.",
                    "Intelligent cutaway illustrations.",
                    "Uncertainty visualization in HARDI based on ensembles of ODFs.",
                    "FluoRender: An application of 2D image space methods for 3D and 4D confocal microscopy data visualization in neurobiology research.",
                    "Object-space ambient occlusion for molecular dynamics.",
                    "Implicit representation of molecular surfaces.",
                    "Visualization of material interface stability.",
                    "Centerline reformations of complex vascular structures."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "PacificVis 2011",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2011",
                "sub_name": "IEEE Pacific Visualization Symposium, PacificVis 2011, Hong Kong, China, 1-4 March, 2011.",
                "count": 30,
                "papers": [
                    "Preface.",
                    "Keynote address: Immersive exploration of large datasets.",
                    "Keynote address: New approaches to large data visualization.",
                    "Keynote address: Why everyone seems to be using spring embedders for network visualization, and should not.",
                    "Full-resolution interactive CPU volume rendering with coherent BVH traversal.",
                    "Context-aware volume navigation.",
                    "Multi-dimensional transfer function design based on flexible dimension projection embedded in parallel coordinates.",
                    "Static correlation visualization for large time-varying volume data.",
                    "The Neuron Navigator: Exploring the information pathway through the neural maze.",
                    "CareCruiser: Exploring and visualizing plans, events, and effects interactively.",
                    "Loose capacity-constrained representatives for the qualitative visual analysis in molecular dynamics.",
                    "Interactive seismic interpretation with piecewise global energy minimization.",
                    "Uncertain topology of 3D vector fields.",
                    "Edge maps: Representing flow with bounded error.",
                    "View point evaluation and streamline filtering for flow visualization.",
                    "Dual space analysis of turbulent combustion particle data.",
                    "Analyzing information transfer in time-varying multivariate data.",
                    "Impact of group size on spatial structure understanding tasks.",
                    "Collaborative information linking: Bridging knowledge gaps between users by linking across applications.",
                    "The NETSPEAK WORDGRAPH: Visualizing keywords in context.",
                    "STREAMIT: Dynamic visualization and interactive exploration of text streams.",
                    "Exploring geo-temporal differences using GTdiff.",
                    "Interactive visualization of multivariate trajectory data with density maps.",
                    "Visualizing dynamic data with maps.",
                    "TripVista: Triple Perspective Visual Trajectory Analytics and its application on microscopic traffic data at a road intersection.",
                    "Interactive visualization of streaming data with Kernel Density Estimation.",
                    "Dynamic network visualization in 1.5D.",
                    "Multilevel agglomerative edge bundling for visualizing large graphs.",
                    "An extended evaluation of the readability of tapered, animated, and textured directed-edge representations in node-link graphs.",
                    "An advanced network visualization system for financial crime detection."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "PacificVis 2010",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2010",
                "sub_name": "IEEE Pacific Visualization Symposium PacificVis 2010, Taipei, Taiwan, March 2-5, 2010.",
                "count": 30,
                "papers": [
                    "A message from the program chairs.",
                    "Image-based biomedical computing and visualization.",
                    "Advanced interaction for Information Visualization.",
                    "Quantitative effectiveness measures for direct volume rendered images.",
                    "Shape-based transfer functions for volume visualization.",
                    "Volume visualization based on statistical transfer-function spaces.",
                    "Volume exploration using ellipsoidal Gaussian transfer functions.",
                    "Stack zooming for multi-focus interaction in time-series data visualization.",
                    "A layer-oriented interface for visualizing time-series data from oscilloscopes.",
                    "WikipediaViz: Conveying article quality for casual Wikipedia readers.",
                    "Caleydo: Design and evaluation of a visual analysis framework for gene expression data in its biological context.",
                    "Visualizing field-measured seismic data.",
                    "Seismic volume visualization for horizon extraction.",
                    "Verification of the time evolution of cosmological simulations via hypothesis-driven comparative and quantitative visualization.",
                    "CycleStack: Inferring periodic behavior via temporal sequence visualization in ultrasound video.",
                    "Interactive local clustering operations for high dimensional data in parallel coordinates.",
                    "A model of symbol lightness discrimination in sparse scatterplots.",
                    "Visual analysis of high dimensional point clouds using topological landscapes.",
                    "Context preserving dynamic word cloud visualization.",
                    "A sketch-based interface for classifying and visualizing vector fields.",
                    "An advection-reaction model for flow visualization.",
                    "Physically-based interactive schlieren flow visualization.",
                    "Motion track: Visualizing variations of human motion data.",
                    "Adaptive proxy geometry for direct volume manipulation.",
                    "Interactive volumetric lighting simulating scattering and shadowing.",
                    "Explorable images for visualizing volume data.",
                    "Crossing-free many-to-one boundary labeling with hyperleaders.",
                    "Graph visualization techniques for conceptual Web site traffic analysis.",
                    "GMap: Visualizing graphs and clusters as maps.",
                    "Visual analysis of large graphs using (X, Y)-clustering and hybrid visualizations."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "PacificVis 2009",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2009",
                "sub_name": "IEEE Pacific Visualization Symposium PacificVis 2009, Beijing, China, April 20-23, 2009.",
                "count": 29,
                "papers": [
                    "Keynote address Knots, maps, and tiles: Three visual puzzles.",
                    "Capstone address Introduction to processing and visualization of Chang'e-1 Lunar exploration data.",
                    "Visualizing time-varying features with TAC-based distance fields.",
                    "Dual streamline seeding.",
                    "Interactive feature extraction and tracking by utilizing region coherency.",
                    "An organization topographic map for visualizing business hierarchical relationships.",
                    "Visualizing metrics on areas of interest in software architecture diagrams.",
                    "HiMap: Adaptive visualization of large-scale online social networks.",
                    "Toward effective insight management in visual analytics systems.",
                    "Visual support for the understanding of simulation processes.",
                    "Optimized data transfer for time-dependent, GPU-based glyphs.",
                    "Out-of-core volume rendering for time-varying fields using a space-partitioning time (SPT) tree.",
                    "Point-based tree representation: A new approach for large hierarchies.",
                    "A visual canonical adjacency matrix for graphs.",
                    "Evaluation of symbol contrast in scatterplots.",
                    "A self-adaptive treemap-based technique for visualizing hierarchical data in 3D.",
                    "TugGraph: Path-preserving hierarchies for browsing proximity and paths in graphs.",
                    "A hybrid space-filling and force-directed layout method for visualizing multiple-category graphs.",
                    "Extending the spring-electrical model to overcome warping effects.",
                    "A graph reading behavior: Geodesic-path tendency.",
                    "Visualizing diffusion tensor imaging data with merging ellipsoids.",
                    "Blank page.",
                    "Fast and sleek glyph rendering for interactive HARDI data exploration.",
                    "Correlation study of time-varying multivariate climate data sets.",
                    "Visualization of signal transduction processes in the crowded environment of the cell.",
                    "Visibility-driven transfer functions.",
                    "Contextual picking of volumetric structures.",
                    "Structure-aware viewpoint selection for volume visualization.",
                    "Moment curves."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "PacificVis 2008",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2008",
                "sub_name": "IEEE VGTC Pacific Visualization Symposium 2008, PacificVis 2008, Kyoto, Japan, March 5-7, 2008.",
                "count": 32,
                "papers": [
                    "Interactive Visualization - Beyond Standard Techniques for Irrelevant Datasets.",
                    "Visualization of High Dimensional Data in Brain and Information Sciences.",
                    "Efficient Rendering of Extrudable Curvilinear Volumes.",
                    "Second Order Pre-Integrated Volume Rendering.",
                    "Dynamic Shader Generation for Flexible Multi-Volume Visualization.",
                    "Interactive Exploration of Remote Isosurfaces with Point-Based Non-Photorealistic Rendering.",
                    "Crossing Minimization meets Simultaneous Drawing.",
                    "Effects of Crossing Angles.",
                    "Visual Statistics for Collections of Clustered Graphs.",
                    "Energy-Based Hierarchical Edge Clustering of Graphs.",
                    "Finite-Time Transport Structures of Flow Fields.",
                    "Importance-Driven Particle Techniques for Flow Visualization.",
                    "Illustrative Streamline Placement and Visualization.",
                    "Optimizing Parallel Performance of Streamline Visualization for Large Distributed Flow Datasets.",
                    "Multiple Views on System Traces.",
                    "A Novel Visualization System for Expressive Facial Motion Data Exploration.",
                    "The Event Tunnel: Interactive Visualization of Complex Event Streams for Business Process Pattern Analysis.",
                    "Height Ridge Computation and Filtering for Visualization.",
                    "An Adaptive Gauss Filtering Method.",
                    "Multi-resolution Volume Rendering of Large Time-Varying Data using Video-based Compression.",
                    "Interactive Storyboard for Overall Time-Varying Data Visualization.",
                    "FanLens: A Visual Toolkit for Dynamically Exploring the Distribution of Hierarchical Attributes.",
                    "Pixelplexing: Gaining Display Resolution Through Time.",
                    "WhatsOnWeb+ : An Enhanced Visual Search Clustering Engine.",
                    "MobiVis: A Visualization System for Exploring Mobile Data.",
                    "Interactive Visual Analysis of the NSF Funding Information.",
                    "StarGate: A Unified, Interactive Visualization of Software Projects.",
                    "Map Warping for the Annotation of Metro Maps.",
                    "Multiple Uncertainties in Time-Variant Cosmological Particle Data.",
                    "ZAME: Interactive Large-Scale Graph Visualization.",
                    "Visualizing Multivariate Networks: A Hybrid Approach.",
                    "A Treemap Based Method for Rapid Layout of Large Graphs."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "APVIS 2007",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2007",
                "sub_name": "APVIS 2007, 6th International Asia-Pacific Symposium on Visualization 2007, Sydney, Australia, 5-7 February 2007.",
                "count": 24,
                "papers": [
                    "Visual analytics: A grand challenge in science - turning information overload into the opportunity of the decade.",
                    "Visualization and analysis of email networks.",
                    "Visualization of sanitized email logs for spam analysis.",
                    "Visualisation and analysis of the internet movie database.",
                    "Visualizing social interaction in open source software projects.",
                    "GraphScape: integrated multivariate network visualization.",
                    "Integrated visualization system for monitoring security in large-scale local area network.",
                    "Labeling collinear sites.",
                    "Efficiently drawing a significant spanning tree of a directed graph.",
                    "Directed graphs and rectangular layouts.",
                    "Many-to-one boundary labeling.",
                    "Overlapping cluster planarity.",
                    "Navigation techniques for 2.5D graph layout.",
                    "Force-directed drawing method for intersecting clustered graphs.",
                    "Analysis of a high-dimensional approach to interactive graph drawing.",
                    "Using eye tracking to investigate graph layout effects.",
                    "Placing connected components of disconnected graphs.",
                    "Straight-line grid drawings of planar graphs with linear area.",
                    "Adaptive sampling in three dimensions for volume rendering on GPUs.",
                    "Multi-scale morphological volume segmentation and visualization.",
                    "Particle-based volume rendering.",
                    "Level-of-detail visualization of clustered graph layouts.",
                    "A comparison of vertex ordering algorithms for large graph visualization.",
                    "Interpreting large visual similarity matrices."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "APVIS 2006",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2006",
                "sub_name": "Asia-Pacific Symposium on Information Visualisation, APVIS 2006, Tokyo, Japan, February 1-3, 2006.",
                "count": 32,
                "papers": [
                    "Cyber security through visualization.",
                    "Japanese landscape and my environmental design.",
                    "Polygon labelling of minimum leader length.",
                    "Visualization of multi-dimensional data of bioactive chemicals using a hierarchical data visualization technique \"Heiankyo view\".",
                    "Mesh simplification using ellipsoidal schema for isotropic quantization of face-normal vectors.",
                    "Visualization of a closed three-dimensional surface using portal-based rendering.",
                    "Coordinated perspectives and enhanced force-directed layout for the analysis of network motifs.",
                    "Generation of relevance maps and navigation in a digital book.",
                    "Knowledge visualization in hepatitis study.",
                    "Integrated visualization for geometry PIG data.",
                    "Increasing the readability of graph drawings with centrality-based scaling.",
                    "Visualizing multivariate network on the surface of a sphere.",
                    "An experimental study on algorithms for drawing binary trees.",
                    "Method for drawing intersecting clustered graphs and its application to web ontology language.",
                    "BiblioViz: a system for visualizing bibliography information.",
                    "Information gathering support interface by the overview presentation of web search results.",
                    "NeL2: network drawing tool for handling layered structured network diagram.",
                    "Interactive optimization in cooperative environments.",
                    "Enhancing the visualization process with principal component analysis to support the exploration of trends.",
                    "STARMINE: a visualization system for cyber attacks.",
                    "Spatial analysis of centralization and decentralization in the population migration network.",
                    "Visualization by information type on mobile device.",
                    "FindFlow: visual interface for information search based on intermediate results.",
                    "Ripple presentation for tree structures with historical information.",
                    "SnapShoot: integrating semantic analysis and visualization techniques for web-based note taking system.",
                    "Drawing bipartite graphs as anchored maps.",
                    "Mental map preserving graph drawing using simulated annealing.",
                    "Visual analysis of network centralities.",
                    "How people read sociograms: a questionnaire study.",
                    "Predicting graph reading performance: a cognitive approach.",
                    "Visual narratives: the essential role of imagination in the visualization process.",
                    "Pattern puzzle: a metaphor for visualizing software complexity measures."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "APVIS 2005",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2005",
                "sub_name": "Asia-Pacific Symposium on Information Visualisation, APVIS 2005, Sydney, Australia, January 27-29, 2005.",
                "count": 20,
                "papers": [
                    "Automatic Camera Path Generation for Graph Navigation in 3D.",
                    "Informing the Design of Pipeline-Based Software Visualisations.",
                    "Target Motion Analysis Visualisation.",
                    "Extending the WilmaScope 3D Graph Visualisation System --- Software Demonstration.",
                    "Visualisation of Reduced-Dimension Microarray Data Using Gaussian Mixture Models.",
                    "Haptic Shoes: Representing Information By Vibration.",
                    "Layered Drawings of Directed Graphs in Three Dimensions.",
                    "An Extended High-Dimensional Method for Interactive Graph Drawing.",
                    "How People Read Graphs.",
                    "Using Spring Algorithms to Remove Node Overlapping.",
                    "The Fish-eye Visualization of Foreign Currency Exchange Data Streams.",
                    "Rectangle-of-Influence Drawings of Four-Connected Plane Graphs.",
                    "A User-based Evaluation of Skeletal Animation Techniques in Graph Interaction.",
                    "Using Guidelines to assist in the Visualisation Design Process.",
                    "An Interactive Visualisation for Selecting PCR Primers.",
                    "Using MoneyColor to Represent Financial Data.",
                    "Puzzle Generators and Symmetric Puzzle Layout.",
                    "Three Dimensional Colour Pickers.",
                    "Visualising Internet Traffic Data with Three-Dimensional Spherical Display.",
                    "Crossing Minimization Problems of Drawing Bipartite Graphs in Two Clusters."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "InVis.au 2004",
        "info": "Christchurch, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2004",
                "sub_name": "Australasian Symposium on Information Visualisation, InVis.au, Christchurch, New Zealand, 23-24 January 2004.",
                "count": 19,
                "papers": [
                    "XML Database Support for Program Trace Visualisation.",
                    "High Resolution Scalable Displays: Manufacturing and Use.",
                    "A Colour-Filling Approach For Visualising Trait Evolution With Phylogenies.",
                    "Displaying Linear Programs and Their Solutions With XML and SVG.",
                    "Inhomogeneous Force-Directed Layout Algorithms in the Visualisation Pipeline: From Layouts to Visualisations.",
                    "Optimal Leaf Ordering for Two and a Half Dimensional Phylogenetic Tree Visualisation.",
                    "A Solar System Metaphor for 3D Visualisation of Object Oriented Software Metrics.",
                    "Visualisation of the Minority Game Using a Mod.",
                    "The Metro Map Layout Problem.",
                    "Adding Filtering to Geometric Distortion to Visualize a Clustered Graph on Small Screens..",
                    "Using Software Visualisation to Enhance Online Component Markets.",
                    "Semi-Automatic Feature Delineation In Medical Images.",
                    "Skeletal Animation for the Exploration of Graphs.",
                    "Creating Minimal Vertex Series Parallel Graphs from Directed Acyclic Graphs.",
                    "Graph Interaction through Force-Based Skeletal Animation.",
                    "An Interactive Visualisation for Investigating DNA Sequence Information.",
                    "An Architecture for Multi-View Information Overlays.",
                    "A Survey, Classification and Analysis of Perceptual Concepts and their Application for the Effective Visualisation of Complex Information.",
                    "A Comparison and Evaluation of Interpolation Methods for Visualising Discrete 2D Survey Data."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "InVis.au 2003",
        "info": "Adelaide, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2003",
                "sub_name": "Australasian Symposium on Information Visualisation, InVis.au, Adelaide, Australia, 2003.",
                "count": 15,
                "papers": [
                    "Spreadsheet Visualisation to Improve End-user Understanding.",
                    "The graphical interpretation of plausible tacit knowledge flows.",
                    "Direct Interaction with Large-Scale Display Systems using Infrared Laser tracking Devices.",
                    "Visualising Class Cohesion with Virtual Worlds.",
                    "Evaluating Scalable Vector Graphics for Use in Software Visualisation.",
                    "A Scalable Method for Visualising Changes in Portfolio Data.",
                    "Visualisation of Surveillance Coverage by Latency Mapping.",
                    "Experimental Evaluation of a Program Visualisation Tool for Use in Computer Science Education.",
                    "A Case Study of Cartoon Visualisation Using Aspect.",
                    "An Empirical Evaluation of Chernoff Faces, Star Glyphs, and Spatial Visualisations for Binary Data.",
                    "Aspects to Visualising Reusable Components.",
                    "Application of Focus + Context to UML..",
                    "A Unified Taxonomic Framework for Information Visualization.",
                    "Inclusion Tree Layout Convention : An Empirical Investigation.",
                    "Bubbleworld : A New Visual Information Retreival Technique."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "InVis.au 2001",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apvis/2001",
                "sub_name": "Australasian Symposium on Information Visualisation, InVis.au, Sydney, Australia, 3-4 December 2001.",
                "count": 21,
                "papers": [
                    "Visual Mapping of Articulable Tacit Knowledge.",
                    "Building Virtual Worlds with the Big-Bang Model.",
                    "Visualisation of Social Networks Using CAVALIER.",
                    "Usage-based Visualization of Web Locations.",
                    "A Framework for Human-Computer Interaction in Directed Graph Drawing.",
                    "Modular Techniques in Information Visualization.",
                    "Three Dimensional UML Using Force Directed Layout.",
                    "Information Visualization of Attributed Relational Data.",
                    "Visualising Reusable Software Over The Web.",
                    "Visualising the Probability Distribution Function of Uncertain Data - Application to Stochastic Modelling of Ground Water Solute Transport.",
                    "Use of Directed Acyclic Graph Analysis in Generating Instructions for Multiple Users.",
                    "Modelling the Multi-Sensory Design Space.",
                    "Visual Programs Module Choice and Layout in the Nord Modular Patch Language.",
                    "View Coordination Architecture for Information Visualisation.",
                    "Rapid Assembly and Deployment of Domain Visualisation Solutions.",
                    "Information Visualisation using Composable Layouts and Visual Sets.",
                    "Recursive Space Decompositions in Force-Directed Graph Drawing Algorithms.",
                    "UML Class Diagram Syntax: An Empirical Study of Comprehension.",
                    "Graph Drawing Aesthetics and the Comprehension of UML Class Diagrams: An Empirical Study.",
                    "Interaction Modes for Augmented Reality Visualization.",
                    "Interactive Visualisation of Large Multivariate Datasets on the World-Wide Web."
                ]
            }
        ]
    }
]