[
    {
        "year": "2018",
        "name": "19th PCM 2018",
        "info": "Hefei, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2018-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2018 - 19th Pacific-Rim Conference on Multimedia, Hefei, China, September 21-22, 2018, Proceedings, Part I.",
                "count": 80,
                "papers": [
                    "CodedVision: Towards Joint Image Understanding and Compression via End-to-End Learning.",
                    "Random Angular Projection for Fast Nearest Subspace Search.",
                    "Image Denoising with Local Dense and Adaptive Global Residual Networks.",
                    "Cross Diffusion on Multi-hypergraph for Multi-modal 3D Object Recognition.",
                    "View-Dependent Streaming of Dynamic Point Cloud over Hybrid Networks.",
                    "Video Captioning Based on the Spatial-Temporal Saliency Tracing.",
                    "CS-DeCNN: Deconvolutional Neural Network for Reconstructing Images from Compressively Sensed Measurements.",
                    "Semantic Correspondence Guided Deep Photo Style Transfer.",
                    "Multiple-Level Feature-Based Network for Image Captioning.",
                    "Collaborative Detection and Caption Network.",
                    "Video-Based Person Re-identification with Adaptive Multi-part Features Learning.",
                    "Visual-SLIM: Integrated Sparse Linear Model with Visual Features for Personalized Recommendation.",
                    "Residual Learning Dehazing Net.",
                    "Temporal-Contextual Attention Network for Video-Based Person Re-identification.",
                    "Synthetic Aperture Based on Plenoptic Camera for Seeing Through Occlusions.",
                    "Neutrosophic C-means Clustering with Local Information and Noise Distance-Based Kernel Metric Image Segmentation.",
                    "Reflection Separation Using Patch-Wise Sparse and Low-Rank Decomposition.",
                    "Conditional Feature Coupling Network for Multi-persons Clothing Parsing.",
                    "Intra-view and Inter-view Attention for Multi-view Network Embedding.",
                    "Multi-modal Sequence to Sequence Learning with Content Attention for Hotspot Traffic Speed Prediction.",
                    "Modeling Text with Graph Convolutional Network for Cross-Modal Information Retrieval.",
                    "Smoothness Assisted Interactive Face Annotation via Neural Network.",
                    "An End-to-End Real-Time 3D System for Integral Photography Display.",
                    "Deep Discriminative Quantization Hashing for Image Retrieval.",
                    "Automatic 3D Garment Fitting Based on Skeleton Driving.",
                    "Real-Time RGBD Reconstruction Using Structural Constraint for Indoor AR.",
                    "Pairwise Cross Pattern: A Color-LBP Descriptor for Content-Based Image Retrieval.",
                    "Multimodal Dimensional and Continuous Emotion Recognition in Dyadic Video Interactions.",
                    "Visual Object Tracking via Graph Learning and Flexible Manifold Ranking.",
                    "Gaussian Dilated Convolution for Semantic Image Segmentation.",
                    "Reading Document and Answering Question via Global Attentional Inference.",
                    "Residual Compression Network for Faster Correlation Tracking.",
                    "Robust Neighborhood Preserving Low-Rank Sparse CNN Features for Classification.",
                    "Pedestrian Detection with a Directly-Cascaded Deconvolution-Convolution Structure.",
                    "Adaptive Integration Skip Compensation Neural Networks for Removing Mixed Noise in Image.",
                    "Retrieval Across Optical and SAR Images with Deep Neural Network.",
                    "Tiny Surface Defects on Small Ring Parts Using Normal Maps.",
                    "Extracting Features of Interest from Small Deep Networks for Efficient Visual Tracking.",
                    "A Novel Feature Fusion with Self-adaptive Weight Method Based on Deep Learning for Image Classification.",
                    "Text Component Reconstruction for Tracking in Video.",
                    "Robust Deep Gaussian Descriptor for Texture Recognition.",
                    "JND-Pano: Database for Just Noticeable Difference of JPEG Compressed Panoramic Images.",
                    "HDP-Net: Haze Density Prediction Network for Nighttime Dehazing.",
                    "Reflectance Reference for Intra-Frame Coding of Surveillance Video.",
                    "Deeper Spatial Pyramid Network with Refined Up-Sampling for Optical Flow Estimation.",
                    "An Improved Algorithm for Saliency Object Detection Based on Manifold Ranking.",
                    "Discrete Manifold-Regularized Collaborative Filtering for Large-Scale Recommender Systems.",
                    "Multiscale Cascaded Scene-Specific Convolutional Neural Networks for Background Subtraction.",
                    "A Reference Resource Based End-to-End Image Compression Scheme.",
                    "Context and Temporal Aware Attention Model for Flood Prediction.",
                    "Hand Pose Estimation with Attention-and-Sequence Network.",
                    "None Ghosting Artifacts Stitching Based on Depth Map for Light Field Image.",
                    "Adaptive Hierarchical Motion-Focused Model for Video Prediction.",
                    "Subjective Quality Assessment of Stereoscopic Omnidirectional Image.",
                    "A Dual-Network Based Super-Resolution for Compressed High Definition Video.",
                    "Visual Dialog with Multi-turn Attentional Memory Network.",
                    "DT-3DResNet-LSTM: An Architecture for Temporal Activity Recognition in Videos.",
                    "Mutiple Transfer Net with Region Ensemble for Deep Hand Pose Estimation.",
                    "Parallelized Contour Based Depth Map Coding in DIBR.",
                    "Dual Subspaces with Adversarial Learning for Cross-Modal Retrieval.",
                    "Cross-Media Feature Learning Framework with Semi-supervised Graph Regularization.",
                    "A Rapid Scene Depth Estimation Model Based on Underwater Light Attenuation Prior for Underwater Image Restoration.",
                    "Sequential Feature Fusion for Object Detection.",
                    "Discriminative Correlation Quantization for Cross-Modal Similarity Retrieval.",
                    "GPU Assisted Towards Real-Time Reconstruction for Dual-Camera Compressive Hyperspectral Imaging.",
                    "Getting More from One Attractive Scene: Venue Retrieval in Micro-videos.",
                    "Simulating Bokeh Effect with Kinect.",
                    "LFSF: Latent Factor-Based Similarity Framework and Its Application for Collaborative Recommendation.",
                    "Image Aesthetics Assessment Based on User Social Behavior.",
                    "Adaptive STBC Scheme for Soft Video Transmission with Multiple Antennas.",
                    "Hypergraph-Based Discrete Hashing Learning for Cross-Modal Retrieval.",
                    "Improve Predictive Accuracy by Identifying Collusions in P2P Recommender Systems.",
                    "Multi-graph Regularized Deep Auto-Encoders for Multi-view Image Representation.",
                    "Discrete Semi-supervised Multi-label Learning for Image Classification.",
                    "Multispectral Foreground Detection via Robust Cross-Modal Low-Rank Decomposition.",
                    "Leveraging User Personality and Tag Information for One Class Collaborative Filtering.",
                    "Enhanced Linear Discriminant Canonical Correlation Analysis for Cross-modal Fusion Recognition.",
                    "Spatial-Temporal Attention for Action Recognition.",
                    "Prediction Method of Parking Space Based on Genetic Algorithm and RNN.",
                    "Perceptual Image Dehazing Based on Generative Adversarial Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2018-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2018 - 19th Pacific-Rim Conference on Multimedia, Hefei, China, September 21-22, 2018, Proceedings, Part II.",
                "count": 75,
                "papers": [
                    "Enhancing Low-Light Images with JPEG Artifact Based on Image Decomposition.",
                    "Depth Estimation from Monocular Images Using Dilated Convolution and Uncertainty Learning.",
                    "Enhancing Feature Correlation for Bi-Modal Group Emotion Recognition.",
                    "Frame Rate Conversion Based High Efficient Compression Method for Video Satellite.",
                    "Spectral-Spatial Hyperspectral Image Classification via Adaptive Total Variation Filtering.",
                    "Convolutional Neural Network Based Inter-Frame Enhancement for 360-Degree Video Streaming.",
                    "Robust and Index-Compatible Deep Hashing for Accurate and Fast Image Retrieval.",
                    "Self-supervised GAN for Image Generation by Correlating Image Channels.",
                    "Deformable Point Cloud Recognition Using Intrinsic Function and Deep Learning.",
                    "Feature Synthesization for Real-Time Pedestrian Detection in Urban Environment.",
                    "Enhancing Person Retrieval with Joint Person Detection, Attribute Learning, and Identification.",
                    "End-To-End Learning for Action Quality Assessment.",
                    "CGANs Based User Preferred Photorealistic Re-stylization of Social Image.",
                    "Cross-Modal Event Retrieval: A Dataset and a Baseline Using Deep Semantic Learning.",
                    "Retinal Vessel Segmentation via Multiscaled Deep-Guidance.",
                    "Image Synthesis with Aesthetics-Aware Generative Adversarial Network.",
                    "Hyperspectral Image Classification Using Nonnegative Sparse Spectral Representation and Spatial Regularization.",
                    "Adaptive Aggregation Network for Face Hallucination.",
                    "Multi-decoder Based Co-attention for Image Captioning.",
                    "Simultaneous Occlusion Handling and Optical Flow Estimation.",
                    "Handwritten Chinese Character Recognition Based on Domain-Specific Knowledge.",
                    "Attention to Refine Through Multi Scales for Semantic Segmentation.",
                    "Frame Segmentation Networks for Temporal Action Localization.",
                    "Stereo Matching Based on Density Segmentation and Non-Local Cost Aggregation.",
                    "Single Image Super Resolution Using Local and Non-local Priors.",
                    "Plenoptic Image Compression via Simplified Subaperture Projection.",
                    "Gaze Aware Deep Learning Model for Video Summarization.",
                    "Three-Stream Action Tubelet Detector for Spatiotemporal Action Detection in Videos.",
                    "Multi-person/Group Interactive Video Generation.",
                    "Image Denoising Based on Non-parametric ADMM Algorithm.",
                    "Satellite Image Scene Classification via ConvNet With Context Aggregation.",
                    "VAL: Visual-Attention Action Localizer.",
                    "Incremental Nonnegative Matrix Factorization with Sparseness Constraint for Image Representation.",
                    "A Data-Driven No-Reference Image Quality Assessment via Deep Convolutional Neural Networks.",
                    "An Asian Face Dataset and How Race Influences Face Recognition.",
                    "Towards Stereo Matching Algorithm Based on Multi-matching Primitive Fusion.",
                    "An Effective Image Detection Algorithm for USM Sharpening Based on Pixel-Pair Histogram.",
                    "Skeletal Bone Age Assessment Based on Deep Convolutional Neural Networks.",
                    "Panoramic Image Saliency Detection by Fusing Visual Frequency Feature and Viewing Behavior Pattern.",
                    "Coupled Learning for Image Generation and Latent Representation Inference Using MMD.",
                    "Enhanced Discriminative Generative Adversarial Network for Face Super-Resolution.",
                    "Image Splicing Detection Based on the Q-Markov Features.",
                    "Snapshot Multiplexed Imaging Based on Compressive Sensing.",
                    "Partially Annotated Gastric Pathological Image Classification.",
                    "Facial Expression Recognition Based on Local Double Binary Mapped Pattern.",
                    "Pixel-Copy Prediction Based Lossless Reference Frame Compression.",
                    "Robust Underwater Fish Classification Based on Data Augmentation by Adding Noises in Random Local Regions.",
                    "Study on User Experience of Panoramic Images on Different Immersive Devices.",
                    "Environmental Sound Classification Based on Multi-temporal Resolution Convolutional Neural Network Combining with Multi-level Features.",
                    "Discriminative Dictionary Learning Based on Sample Diversity for Face Recognition.",
                    "Spatial Attention Network for Head Detection.",
                    "Arbitrary Perspective Crowd Counting via Multi Convolutional Kernels.",
                    "3D Shape Co-segmentation by Combining Sparse Representation with Extreme Learning Machine.",
                    "RS-MSSF Frame: Remote Sensing Image Classification Based on Extraction and Fusion of Multiple Spectral-Spatial Features.",
                    "Hierarchical Image Segmentation Based on Multi-feature Fusion and Graph Cut Optimization.",
                    "A Sound Image Reproduction Model Based on Personalized Weight Vectors.",
                    "Reconstruction of Multi-view Video Based on GAN.",
                    "Contextual Attention Model for Social Recommendation.",
                    "Cracked Tongue Recognition Based on Deep Features and Multiple-Instance SVM.",
                    "Multitask Learning for Chinese Named Entity Recognition.",
                    "Sparse-Region Net: Local-Enhanced Facial Depthmap Reconstruction from a Single Face Image.",
                    "Entropy Based Boundary-Eliminated Pseudo-Inverse Linear Discriminant for Speech Emotion Recognition.",
                    "An Improved C-COT Based Visual Tracking Scheme to Weighted Fusion of Diverse Features.",
                    "Focal Liver Lesion Classification Based on Tensor Sparse Representations of Multi-phase CT Images.",
                    "Joint Learning of LSTMs-CNN and Prototype for Micro-video Venue Classification.",
                    "Spatial Pixels Selection and Inter-frame Combined Likelihood Based Observation for 60 fps 3D Tracking of Twelve Volleyball Players on GPU.",
                    "An Interactive Light Field Video System with User-Dependent View Selection and Coding Scheme.",
                    "Deep Residual Net Based Compact Feature Representation for Image Retrieval.",
                    "Sea Ice Change Detection from SAR Images Based on Canonical Correlation Analysis and Contractive Autoencoders.",
                    "Pedestrian Attributes Recognition in Surveillance Scenarios with Hierarchical Multi-task CNN Models.",
                    "Re-Ranking Person Re-Identification with Forward and Reverse Sorting Constraints.",
                    "Content-Based Co-Factorization Machines: Modeling User Decisions in Event-Based Social Networks.",
                    "Image-into-Image Steganography Using Deep Convolutional Network.",
                    "Deep Forest with Local Experts Based on ELM for Pedestrian Detection.",
                    "AdvRefactor: A Resampling-Based Defense Against Adversarial Attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2018-3",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2018 - 19th Pacific-Rim Conference on Multimedia, Hefei, China, September 21-22, 2018, Proceedings, Part III.",
                "count": 74,
                "papers": [
                    "MFDCNN: A Multimodal Fusion DCNN Framework for Object Detection and Segmentation.",
                    "Mixup-Based Acoustic Scene Classification Using Multi-channel Convolutional Neural Network.",
                    "Multimodal Fusion for Traditional Chinese Painting Generation.",
                    "Optimal Feature Selection for Saliency Seed Propagation in Low Contrast Images.",
                    "New Fusion Based Enhancement for Text Detection in Night Video Footage.",
                    "Deformable Feature Pyramid Network for Ship Recognition.",
                    "Learning Hierarchical Context for Action Recognition in Still Images.",
                    "iMakeup: Makeup Instructional Video Dataset for Fine-Grained Dense Video Captioning.",
                    "Embedded Temporal Visualization of Collaboration Networks.",
                    "Particle Swarm Programming-Based Interactive Content-Based Image Retrieval.",
                    "Video Clip Growth: A General Algorithm for Multi-view Video Summarization.",
                    "Cross-Media Retrieval via Deep Semantic Canonical Correlation Analysis and Logistic Regression.",
                    "3D Global Trajectory and Multi-view Local Motion Combined Player Action Recognition in Volleyball Analysis.",
                    "Underwater Image Enhancement by the Combination of Dehazing and Color Correction.",
                    "A Novel No-Reference QoE Assessment Model for Frame Freezing of Mobile Video.",
                    "Saliency Detection Based on Deep Learning and Graph Cut.",
                    "Rethinking Fusion Baselines for Multi-modal Human Action Recognition.",
                    "A DCT-JND Profile for Disorderly Concealment Effect.",
                    "Breast Ultrasound Image Classification and Segmentation Using Convolutional Neural Networks.",
                    "Intra-Image Region Context for Image Captioning.",
                    "Viewpoint Quality Evaluation for Augmented Virtual Environment.",
                    "A Flower Classification Framework Based on Ensemble of CNNs.",
                    "Image Translation Between High-Resolution Remote Sensing Optical and SAR Data Using Conditional GAN.",
                    "A Combined Strategy of Hand Tracking for Desktop VR.",
                    "Super-Resolution of Text Image Based on Conditional Generative Adversarial Network.",
                    "Latitude-Based Visual Attention in 360-Degree Video Display.",
                    "Branched Convolutional Neural Networks for Face Alignment.",
                    "A Robust Approach for Scene Text Detection and Tracking in Video.",
                    "Improving Intra Block Copy with Low-Rank Based Rectification for Urban Building Scenes.",
                    "Assembly-Based 3D Modeling Using Graph Convolutional Neural Networks.",
                    "Blur Measurement for Partially Blurred Images with Saliency Constrained Global Refinement.",
                    "SCAN: Spatial and Channel Attention Network for Vehicle Re-Identification.",
                    "Speech Data Enhancement Based on Hybrid Neural Network.",
                    "Unified Data Hiding and Scrambling Method for JPEG Images.",
                    "Cross-Modal Retrieval with Discriminative Dual-Path CNN.",
                    "Deep Learning for Ovarian Tumor Classification with Ultrasound Images.",
                    "Arbitrary Image Emotionalizing with Style Transfer.",
                    "Text-to-Image Synthesis via Visual-Memory Creative Adversarial Network.",
                    "Sequence-Based Recommendation with Bidirectional LSTM Network.",
                    "Natural Scene Text Detection Based on Deep Supervised Fully Convolutional Network.",
                    "MFM: A Multi-level Fused Sequence Matching Model for Candidates Filtering in Multi-paragraphs Question-Answering.",
                    "Multiview CNN Model for Sensor Fusion Based Vehicle Detection.",
                    "Color Image Super Resolution by Using Cross-Channel Correlation.",
                    "Stereoscopic Video Quality Prediction Based on End-to-End Dual Stream Deep Neural Networks.",
                    "Fast and Robust 3D Numerical Method for Coronary Artery Vesselness Diffusion from CTA Images.",
                    "Multi-view Viewpoint Assessment for Architectural Photos.",
                    "Underwater Image Enhancement Using Stacked Generative Adversarial Networks.",
                    "An Efficient Complexity Reduction Scheme for CU Partitioning in Quality Scalable HEVC.",
                    "Extended Multi-column Convolutional Neural Network for Crowd Counting.",
                    "ECG Classification Algorithm Using Shape Context.",
                    "Small Object Detection Using Deep Feature Pyramid Networks.",
                    "Dataset Refinement for Convolutional Neural Networks via Active Learning.",
                    "Gaze Information Channel.",
                    "A Multi-information Fusion Model for Shop Recommendation Based on Deep Learning.",
                    "An Improved SKFCM-CV Whole Heart MR Image Segmentation Algorithm.",
                    "An Image Splicing Localization Algorithm Based on SLIC and Image Features.",
                    "Effect of Checkerboard on the Accuracy of Camera Calibration.",
                    "Weighted Multi-feature Fusion Algorithm for Fine-Grained Image Retrieval.",
                    "Convolutional Neural Networks Based Soft Video Broadcast.",
                    "Image Generation for Printed Character by Representation Learning.",
                    "CRNet: Classification and Regression Neural Network for Facial Beauty Prediction.",
                    "Stitches Generation for Random-Needle Embroidery Based on Markov Chain Model.",
                    "Image Recognition with Deep Learning for Library Book Identification.",
                    "Learning Affective Features Based on VIP for Video Affective Content Analysis.",
                    "Research on Multitask Deep Learning Network for Semantic Segmentation and Object Detection.",
                    "Learning to Match Using Siamese Network for Object Tracking.",
                    "Macropixel Based Fast Motion Estimation for Plenoptic Video Compression.",
                    "Text to Region: Visual-Word Guided Saliency Detection.",
                    "Text-Guided Dual-Branch Attention Network for Visual Question Answering.",
                    "A Fast Zero-Quantized Percentage Model for Video Coding with RDO Quantization.",
                    "Partially Separated Networks for Person Search.",
                    "Action Tree Convolutional Networks: Skeleton-Based Human Action Recognition.",
                    "Research of Secret Sharing Digital Watermarking Scheme Based on Spread Spectrum Algorithm and PCA.",
                    "Convolutional Neural Networks Based Image Classification for Himawari-8 Stationary Satellite Imagery."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "18th PCM 2017",
        "info": "Harbin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2017-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2017 - 18th Pacific-Rim Conference on Multimedia, Harbin, China, September 28-29, 2017, Revised Selected Papers, Part I.",
                "count": 87,
                "papers": [
                    "Deep Graph Laplacian Hashing for Image Retrieval.",
                    "Deep Video Dehazing.",
                    "Image Tagging by Joint Deep Visual-Semantic Propagation.",
                    "Exploiting Time and Frequency Diversities for High-Quality Linear Video Transmission: A MCast Framework.",
                    "Light Field Image Compression with Sub-apertures Reordering and Adaptive Reconstruction.",
                    "Fast QTBT Partition Algorithm for JVET Intra Coding Based on CNN.",
                    "A Novel Saliency Based Bit Allocation and RDO for HEVC.",
                    "Light Field Image Compression Scheme Based on MVD Coding Standard.",
                    "A Real-Time Multi-view AVS2 Decoder on Mobile Phone.",
                    "Compressive Sensing Depth Video Coding via Gaussian Mixture Models and Object Edges.",
                    "AWCR: Adaptive and Weighted Collaborative Representations for Face Super-Resolution with Context Residual-Learning.",
                    "Single Image Haze Removal Based on Global-Local Optimization for Depth Map.",
                    "Single Image Dehazing Using Deep Convolution Neural Networks.",
                    "SPOS: Deblur Image by Using Sparsity Prior and Outlier Suppression.",
                    "Single Image Super-Resolution Using Multi-scale Convolutional Neural Network.",
                    "A Novel Image Preprocessing Strategy for Foreground Extraction in Person Re-identification.",
                    "Age Estimation via Pose-Invariant 3D Face Alignment Feature in 3 Streams of CNN.",
                    "Face Alignment Using Local Probabilistic Features.",
                    "Multi-modal Emotion Recognition with Temporal-Band Attention Based on LSTM-RNN.",
                    "Multimodal Fusion of Spatial-Temporal Features for Emotion Recognition in the Wild.",
                    "A Fast and General Method for Partial Face Recognition.",
                    "Adaptive Correlation Filter Tracking with Weighted Foreground Representation.",
                    "A Novel Method for Camera Pose Tracking Using Visual Complementary Filtering.",
                    "Trajectory-Pooled 3D Convolutional Descriptors for Action Recognition.",
                    "Temporal Interval Regression Network for Video Action Detection.",
                    "Semantic Sequence Analysis for Human Activity Prediction.",
                    "Motion State Detection Based Prediction Model for Body Parts Tracking of Volleyball Players.",
                    "Adapting Generic Detector for Semi-Supervised Pedestrian Detection.",
                    "StairsNet: Mixed Multi-scale Network for Object Detection.",
                    "A Dual-CNN Model for Multi-label Classification by Leveraging Co-occurrence Dependencies Between Labels.",
                    "Multi-level Semantic Representation for Flower Classification.",
                    "Multi-view Multi-label Learning via Optimal Classifier Chain.",
                    "Tire X-ray Image Impurity Detection Based on Multiple Kernel Learning.",
                    "CRF-Based Reconstruction from Narrow-Baseline Image Sequences.",
                    "Better and Faster, when ADMM Meets CNN: Compressive-Sensed Image Reconstruction.",
                    "Sparsity-Promoting Adaptive Coding with Robust Empirical Mode Decomposition for Image Restoration.",
                    "A Splicing Interpolation Method for Head-Related Transfer Function.",
                    "Structured Convolutional Compressed Sensing Based on Deterministic Subsamplers.",
                    "Blind Speech Deconvolution via Pretrained Polynomial Dictionary and Sparse Representation.",
                    "Multi-lingual Scene Text Detection Based on Fully Convolutional Networks.",
                    "Cloud of Line Distribution for Arbitrary Text Detection in Scene/Video/License Plate Images.",
                    "Affine Collaborative Representation Based Classification for In-Air Handwritten Chinese Character Recognition.",
                    "Overlaid Chinese Character Recognition via a Compact CNN.",
                    "Efficient and Robust Lane Detection Using Three-Stage Feature Extraction with Line Fitting.",
                    "Saliency-GD: A TF-IDF Analogy for Landmark Image Mining.",
                    "An Improved Clothing Parsing Method Emphasizing the Clothing with Complex Texture.",
                    "Detection of Similar Geo-Regions Based on Visual Concepts in Social Photos.",
                    "Unsupervised Concept Learning in Text Subspace for Cross-Media Retrieval.",
                    "Image Stylization for Thread Art via Color Quantization and Sparse Modeling.",
                    "Least-Squares Regulation Based Graph Embedding.",
                    "SSGAN: Secure Steganography Based on Generative Adversarial Networks.",
                    "Generating Chinese Poems from Images Based on Neural Network.",
                    "Detail-Enhancement for Dehazing Method Using Guided Image Filter and Laplacian Pyramid.",
                    "Personalized Micro-Video Recommendation via Hierarchical User Interest Modeling.",
                    "MCTD: Motion-Coordinate-Time Descriptor for 3D Skeleton-Based Action Recognition.",
                    "Dense Frame-to-Model SLAM with an RGB-D Camera.",
                    "Parallax-Robust Hexahedral Panoramic Video Stitching.",
                    "Image Formation Analysis and Light Field Information Reconstruction for Plenoptic Camera 2.0.",
                    "Part Detection for 3D Shapes via Multi-view Rendering.",
                    "Benchmarking Screen Content Image Quality Evaluation in Spatial Psychovisual Modulation Display System.",
                    "A Fast Sample Adaptive Offset Algorithm for H.265/HEVC.",
                    "Blind Quality Assessment for Screen Content Images by Texture Information.",
                    "Assessment of Visually Induced Motion Sickness in Immersive Videos.",
                    "Hybrid Kernel-Based Template Prediction and Intra Block Copy for Light Field Image Coding.",
                    "Asymmetric Representation for 3D Panoramic Video.",
                    "Shallow and Deep Model Investigation for Distinguishing Corn and Weeds.",
                    "Representing Discrimination of Video by a Motion Map.",
                    "Multi-scale Discriminative Patches for Fined-Grained Visual Categorization.",
                    "Chinese Characters Recognition from Screen-Rendered Images Using Inception Deep Learning Architecture.",
                    "Visual Tracking by Deep Discriminative Map.",
                    "Hand Gesture Recognition by Using 3DCNN and LSTM with Adam Optimizer.",
                    "Learning Temporal Context for Correlation Tracking with Scale Estimation.",
                    "Deep Combined Image Denoising with Cloud Images.",
                    "Vehicle Verification Based on Deep Siamese Network with Similarity Metric.",
                    "Style Transfer with Content Preservation from Multiple Images.",
                    "Task-Specific Neural Networks for Pose Estimation in Person Re-identification Task.",
                    "Mini Neural Networks for Effective and Efficient Mobile Album Organization.",
                    "Sweeper: Design of the Augmented Path in Residual Networks.",
                    "Sketch Based Model-Like Standing Style Recommendation.",
                    "Joint L1-L2 Regularisation for Blind Speech Deconvolution.",
                    "Multi-modal Emotion Recognition Based on Speech and Image.",
                    "Analysis of Psychological Behavior of Undergraduates.",
                    "Compression Artifacts Reduction for Depth Map by Deep Intensity Guidance.",
                    "LiPS: Learning Social Relationships in Probe Space.",
                    "The Intelligent Monitoring for the Elderly Based on WiFi Signals.",
                    "Sentiment Analysis for Social Sensor.",
                    "Recovering Overlapping Partials for Monaural Perfect Harmonic Musical Sound Separation Using Modified Common Amplitude Modulation."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2017-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2017 - 18th Pacific-Rim Conference on Multimedia, Harbin, China, September 28-29, 2017, Revised Selected Papers, Part II.",
                "count": 97,
                "papers": [
                    "A Competitive Combat Strategy and Tactics in RTS Games AI and StarCraft.",
                    "Indoor Scene Classification by Incorporating Predicted Depth Descriptor.",
                    "Multiple Thermal Face Detection in Unconstrained Environments Using Fully Convolutional Networks.",
                    "Object Proposal via Depth Connectivity Constrained Grouping.",
                    "Edge-Aware Saliency Detection via Novel Graph Model.",
                    "Multiple Kernel Learning Based on Weak Learner for Automatic Image Annotation.",
                    "An Efficient Feature Selection for SAR Target Classification.",
                    "Fine-Art Painting Classification via Two-Channel Deep Residual Network.",
                    "Automatic Foreground Seeds Discovery for Robust Video Saliency Detection.",
                    "Semantic R-CNN for Natural Language Object Detection.",
                    "Spatio-Temporal Context Networks for Video Question Answering.",
                    "Object Discovery and Cosegmentation Based on Dense Correspondences.",
                    "Semantic Segmentation Using Fully Convolutional Networks and Random Walk with Prediction Prior.",
                    "Multi-modality Fusion Network for Action Recognition.",
                    "Fusing Appearance Features and Correlation Features for Face Video Retrieval.",
                    "A Robust Image Reflection Separation Method Based on Sift-Edge Flow.",
                    "A Fine-Grained Filtered Viewpoint Informed Keypoint Prediction from 2D Images.",
                    "More Efficient, Adaptive and Stable, A Virtual Fitting System Using Kinect.",
                    "Exploiting Sub-region Deep Features for Specific Action Recognition in Combat Sports Video.",
                    "Face Anti-spoofing Based on Motion.",
                    "A Novel Action Recognition Scheme Based on Spatial-Temporal Pyramid Model.",
                    "Co-saliency Detection via Sparse Reconstruction and Co-salient Object Discovery.",
                    "Robust Local Effective Matching Model for Multi-target Tracking.",
                    "Group Burstiness Weighting for Image Retrieval.",
                    "Stereo Saliency Analysis Based on Disparity Influence and Spatial Dissimilarity.",
                    "Object Classification of Remote Sensing Images Based on Rotation-Invariant Discrete Hashing.",
                    "Robust Principal Component Analysis via Symmetric Alternating Direction for Moving Object Detection.",
                    "Driver Head Analysis Based on Deeply Supervised Transfer Metric Learning with Virtual Data.",
                    "Joint Dictionary Learning via Split Bregman Iteration for Large-Scale Image Classification.",
                    "Multi-operator Image Retargeting with Preserving Aspect Ratio of Important Contents.",
                    "Human Action Recognition in Videos of Realistic Scenes Based on Multi-scale CNN Feature.",
                    "Automatic Facial Complexion Classification Based on Mixture Model.",
                    "Spectral Context Matching for Video Object Segmentation Under Occlusion.",
                    "Hierarchical Tree Representation Based Face Clustering for Video Retrieval.",
                    "Improved Key Poses Model for Skeleton-Based Action Recognition.",
                    "Pic2Geom: A Fast Rendering Algorithm for Low-Poly Geometric Art.",
                    "Attention Window Aware Encoder-Decoder Model for Spoken Language Understanding.",
                    "A New Fast Algorithm for Sample Adaptive Offset.",
                    "Motion-Compensated Deinterlacing Based on Scene Change Detection.",
                    "Center-Adaptive Weighted Binary K-means for Image Clustering.",
                    "Aligned Local Descriptors and Hierarchical Global Features for Person Re-Identification.",
                    "A Novel Background Subtraction Method Based on ViBe.",
                    "Layout-Driven Top-Down Saliency Detection for Webpage.",
                    "Saliency Detection by Superpixel-Based Sparse Representation.",
                    "Reading Two Digital Video Clocks for Broadcast Basketball Videos.",
                    "Don't Be Confused: Region Mapping Based Visual Place Recognition.",
                    "An Effective Head Detection Framework via Convolutional Neural Networks.",
                    "Identifying Gambling and Porn Websites with Image Recognition.",
                    "Image-Set Based Collaborative Representation for Face Recognition in Videos.",
                    "Vectorized Data Combination and Binary Search Oriented Reweight for CPU-GPU Based Real-Time 3D Ball Tracking.",
                    "Hot Topic Trend Prediction of Topic Based on Markov Chain and Dynamic Backtracking.",
                    "Fast Circular Object Localization and Pose Estimation for Robotic Bin Picking.",
                    "Local Temporal Coherence for Object-Aware Keypoint Selection in Video Sequences.",
                    "A Combined Feature Approach for Speaker Segmentation Using Convolution Neural Network.",
                    "DDSH: Deep Distribution-Separating Hashing for Image Retrieval.",
                    "An Obstacle Detection Method Based on Binocular Stereovision.",
                    "Target Depth Measurement for Machine Monocular Vision.",
                    "Automatic Background Adjustment for Chinese Paintings Using Pigment Lines.",
                    "Content-Based Image Recovery.",
                    "Integrating Visual Word Embeddings into Translation Language Model for Keyword Spotting on Historical Mongolian Document Images.",
                    "The Analysis for Binaural Signal's Characteristics of a Real Source and Corresponding Virtual Sound Image.",
                    "Primary-Ambient Extraction Based on Channel Pair for 5.1 Channel Audio Using Least Square.",
                    "Multi-scale Similarity Enhanced Guided Normal Filtering.",
                    "Deep Residual Convolution Neural Network for Single-Image Robust Crowd Counting.",
                    "An Efficient Method Using the Parameterized HRTFs for 3D Audio Real-Time Rendering on Mobile Devices.",
                    "Efficient Logo Insertion Method for High-Resolution H.265/HEVC Compressed Video.",
                    "Image Decomposition Based Nighttime Image Enhancement.",
                    "PSNR Estimate for JPEG Compression.",
                    "Speech Intelligibility Enhancement in Strong Mechanical Noise Based on Neural Networks.",
                    "Interactive Temporal Visualization of Collaboration Networks.",
                    "On the Impact of Environmental Sound on Perceived Visual Quality.",
                    "A Novel Texture Exemplars Extraction Approach Based on Patches Homogeneity and Defect Detection.",
                    "Repetitiveness Metric of Exemplar for Texture Synthesis.",
                    "Unsupervised Cross-Modal Hashing with Soft Constraint.",
                    "Scalable Video Coding Based on the User's View for Real-Time Virtual Reality Applications.",
                    "Towards Visual SLAM with Memory Management for Large-Scale Environments.",
                    "Entropy Based Sub-band Deletion for Multispectral Image Compression.",
                    "Automatic Texture Exemplar Extraction Based on a Novel Textureness Metric.",
                    "In Defense of Fully Connected Layers in Visual Representation Transfer.",
                    "Block Cluster Based Dictionary Learning for Image De-noising and De-blurring.",
                    "Content Adaptive Constraint Based Image Upsampling.",
                    "Image Quality Assessment for Video Surveillance System.",
                    "Style Transfer Based on Style Primitive Discovery.",
                    "Construction of Sampling Two-Channel Nonseparable Wavelet Filter Bank and Its Fusion Application for Multispectral Image Pansharpening.",
                    "Data Reconstruction Based on Supervised Deep Auto-Encoder.",
                    "A Novel Fragile Watermarking Scheme for 2D Vector Map Authentication.",
                    "Hybrid Domain Encryption Method of Hyperspectral Remote Sensing Image.",
                    "Anomaly Detection with Passive Aggressive Online Gaussian Model Estimation.",
                    "Multi-scale Convolutional Neural Networks for Non-blind Image Deconvolution.",
                    "Feature-Preserving Mesh Denoising Based on Guided Normal Filtering.",
                    "Visual-Inertial RGB-D SLAM for Mobile Augmented Reality.",
                    "ODD: An Algorithm of Online Directional Dictionary Learning for Sparse Representation.",
                    "A Low Energy Multi-hop Routing Protocol Based on Programming Tree for Large-Scale WSN.",
                    "Sparse Stochastic Online AUC Optimization for Imbalanced Streaming Data.",
                    "Traffic Congestion Level Prediction Based on Video Processing Technology.",
                    "Coarse-to-Fine Multi-camera Network Topology Estimation.",
                    "An Adaptive Tuning Sparse Fast Fourier Transform."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th PCM 2016",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2016-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2016 - 17th Pacific-Rim Conference on Multimedia, Xi'an, China, September 15-16, 2016, Proceedings, Part I.",
                "count": 56,
                "papers": [
                    "Visual Tracking by Local Superpixel Matching with Markov Random Field.",
                    "Saliency Detection Combining Multi-layer Integration Algorithm with Background Prior and Energy Function.",
                    "Facial Landmark Localization by Part-Aware Deep Convolutional Network.",
                    "On Combining Compressed Sensing and Sparse Representations for Object Tracking.",
                    "Leaf Recognition Based on Binary Gabor Pattern and Extreme Learning Machine.",
                    "Sparse Representation Based Histogram in Color Texture Retrieval.",
                    "Improving Image Retrieval by Local Feature Reselection with Query Expansion.",
                    "Sparse Subspace Clustering via Closure Subgraph Based on Directed Graph.",
                    "Robust Lip Segmentation Based on Complexion Mixture Model.",
                    "Visual BFI: An Exploratory Study for Image-Based Personality Test.",
                    "Fast Cross-Scenario Clothing Retrieval Based on Indexing Deep Features.",
                    "3D Point Cloud Encryption Through Chaotic Mapping.",
                    "Online Multi-Person Tracking Based on Metric Learning.",
                    "A Low-Rank Tensor Decomposition Based Hyperspectral Image Compression Algorithm.",
                    "Moving Object Detection with ViBe and Texture Feature.",
                    "Leveraging Composition of Object Regions for Aesthetic Assessment of Photographs.",
                    "Video Affective Content Analysis Based on Protagonist via Convolutional Neural Network.",
                    "Texture Description Using Dual Tree Complex Wavelet Packets.",
                    "Fast and Accurate Image Denoising via a Deep Convolutional-Pairs Network.",
                    "Traffic Sign Recognition Based on Attribute-Refinement Cascaded Convolutional Neural Networks.",
                    "Building Locally Discriminative Classifier Ensemble Through Classifier Fusion Among Nearest Neighbors.",
                    "Retrieving Images by Multiple Samples via Fusing Deep Features.",
                    "A Part-Based and Feature Fusion Method for Clothing Classification.",
                    "Research on Perception Sensitivity of Elevation Angle in 3D Sound Field.",
                    "Tri-level Combination for Image Representation.",
                    "Accurate Multi-view Stereopsis Fusing DAISY Descriptor and Scaled-Neighbourhood Patches.",
                    "Stereo Matching Based on CF-EM Joint Algorithm.",
                    "Fine-Grained Vehicle Recognition in Traffic Surveillance.",
                    "Transductive Classification by Robust Linear Neighborhood Propagation.",
                    "Discriminative Sparse Coding by Nuclear Norm-Driven Semi-Supervised Dictionary Learning.",
                    "Semantically Smoothed Refinement for Everyday Concept Indexing.",
                    "A Deep Two-Stream Network for Bidirectional Cross-Media Information Retrieval.",
                    "Prototyping Methodology with Motion Estimation Algorithm.",
                    "Automatic Image Annotation Using Adaptive Weighted Distance in Improved K Nearest Neighbors Framework.",
                    "One-Shot-Learning Gesture Segmentation and Recognition Using Frame-Based PDV Features.",
                    "Multi-scale Point Set Saliency Detection Based on Site Entropy Rate.",
                    "Facial Expression Recognition with Multi-scale Convolution Neural Network.",
                    "Deep Similarity Feature Learning for Person Re-identification.",
                    "Object Detection Based on Scene Understanding and Enhanced Proposals.",
                    "Video Inpainting Based on Joint Gradient and Noise Minimization.",
                    "Head Related Transfer Function Interpolation Based on Aligning Operation.",
                    "Adaptive Multi-window Matching Method for Depth Sensing SoC and Its VLSI Implementation.",
                    "A Cross-Domain Lifelong Learning Model for Visual Understanding.",
                    "On the Quantitative Analysis of Sparse RBMs.",
                    "An Efficient Solution for Extrinsic Calibration of a Vision System with Simple Laser.",
                    "A Stepped-RAM Reading and Multiplierless VLSI Architecture for Intra Prediction in HEVC.",
                    "A Sea-Land Segmentation Algorithm Based on Sea Surface Analysis.",
                    "Criminal Investigation Oriented Saliency Detection for Surveillance Videos.",
                    "Deep Metric Learning with Improved Triplet Loss for Face Clustering in Videos.",
                    "Characterizing TCP Performance for Chunk Delivery in DASH.",
                    "Where and What to Eat: Simultaneous Restaurant and Dish Recognition from Food Image.",
                    "A Real-Time Gesture-Based Unmanned Aerial Vehicle Control System.",
                    "A Biologically Inspired Deep CNN Model.",
                    "Saliency-Based Objective Quality Assessment of Tone-Mapped Images.",
                    "Sparse Matrix Based Hashing for Approximate Nearest Neighbor Search.",
                    "Piecewise Affine Sparse Representation via Edge Preserving Image Smoothing."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2016-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2016 - 17th Pacific-Rim Conference on Multimedia, Xi'an, China, September 15-16, 2016, Proceedings, Part II.",
                "count": 72,
                "papers": [
                    "A Global-Local Approach to Extracting Deformable Fashion Items from Web Images.",
                    "Say Cheese: Personal Photography Layout Recommendation Using 3D Aesthetics Estimation.",
                    "Speech Enhancement Using Non-negative Low-Rank Modeling with Temporal Continuity and Sparseness Constraints.",
                    "Facial Animation Based on 2D Shape Regression.",
                    "A Deep CNN with Focused Attention Objective for Integrated Object Recognition and Localization.",
                    "An Accurate Measurement System for Non-cooperative Spherical Target Based on Calibrated Lasers.",
                    "Integrating Supervised Laplacian Objective with CNN for Object Recognition.",
                    "Automatic Color Image Enhancement Using Double Channels.",
                    "Deep Ranking Model for Person Re-identification with Pairwise Similarity Comparison.",
                    "Cluster Enhanced Multi-task Learning for Face Attributes Feature Selection.",
                    "Triple-Bit Quantization with Asymmetric Distance for Nearest Neighbor Search.",
                    "Creating Spectral Words for Large-Scale Hyperspectral Remote Sensing Image Retrieval.",
                    "Rapid Vehicle Retrieval Using a Cascade of Interest Regions.",
                    "Towards Drug Counterfeit Detection Using Package Paperboard Classification.",
                    "Dynamic Strategies for Flow Scheduling in Multihoming Video CDNs.",
                    "Homogenous Color Transfer Using Texture Retrieval and Matching.",
                    "Viewpoint Estimation for Objects with Convolutional Neural Network Trained on Synthetic Images.",
                    "Depth Extraction from a Light Field Camera Using Weighted Median Filtering.",
                    "Scale and Topology Preserving SIFT Feature Hashing.",
                    "Hierarchical Traffic Sign Recognition.",
                    "Category Aggregation Among Region Proposals for Object Detection.",
                    "Exploiting Local Feature Fusion for Action Recognition.",
                    "Improving Image Captioning by Concept-Based Sentence Reranking.",
                    "Blind Image Quality Assessment Based on Local Quantized Pattern.",
                    "Sign Language Recognition with Multi-modal Features.",
                    "Heterogeneous Convolutional Neural Networks for Visual Recognition.",
                    "Recognition Oriented Feature Hallucination for Low Resolution Face Images.",
                    "Learning Robust Multi-Label Hashing for Efficient Image Retrieval.",
                    "A Second-Order Approach for Blind Motion Deblurring by Normalized l_1 Regularization.",
                    "Abnormal Event Detection and Localization by Using Sparse Coding and Reconstruction.",
                    "Real-Time Video Dehazing Based on Spatio-Temporal MRF.",
                    "Dynamic Contour Matching for Lossy Screen Content Picture Intra Coding.",
                    "A Novel Hard-Decision Quantization Algorithm Based on Adaptive Deadzone Offset Model.",
                    "Comparison of Information Loss Architectures in CNNs.",
                    "Fast-Gaussian SIFT for Fast and Accurate Feature Extraction.",
                    "An Overview+Detail Surveillance Video Player: Information-Based Adaptive Fast-Forward.",
                    "Recurrent Double Features: Recurrent Multi-scale Deep Features and Saliency Features for Salient Object Detection.",
                    "Key Frame Extraction Based on Motion Vector.",
                    "Haze Removal Technology Based on Physical Model.",
                    "Robust Uyghur Text Localization in Complex Background Images.",
                    "Learning Qualitative and Quantitative Image Quality Assessment.",
                    "An Analysis-Oriented ROI Based Coding Approach on Surveillance Video Data.",
                    "A Stepwise Frontal Face Synthesis Approach for Large Pose Non-frontal Facial Image.",
                    "Nonlinear PCA Network for Image Classification.",
                    "Salient Object Detection in Video Based on Dynamic Attention Center.",
                    "Joint Optimization of a Perceptual Modified Wiener Filtering Mask and Deep Neural Networks for Monaural Speech Separation.",
                    "Automatic Extraction and Construction Algorithm of Overpass from Raster Maps.",
                    "Geometric and Tongue-Mouth Relation Features for Morphology Analysis of Tongue Body.",
                    "Perceptual Asymmetric Video Coding for 3D-HEVC.",
                    "Recognition of Chinese Sign Language Based on Dynamic Features Extracted by Fast Fourier Transform.",
                    "Enhanced Joint Trilateral Up-sampling for Super-Resolution.",
                    "Learning to Recognize Hand-Held Objects from Scratch.",
                    "Audio Bandwidth Extension Using Audio Super-Resolution.",
                    "Jointly Learning a Multi-class Discriminative Dictionary for Robust Visual Tracking.",
                    "Product Image Search with Deep Attribute Mining and Re-ranking.",
                    "A New Rate Control Algorithm Based on Region of Interest for HEVC.",
                    "Deep Learning Features Inspired Saliency Detection of 3D Images.",
                    "No-Reference Quality Assessment of Camera-Captured Distortion Images.",
                    "GIP: Generic Image Prior for No Reference Image Quality Assessment.",
                    "Objective Quality Assessment of Screen Content Images by Structure Information.",
                    "CrowdTravel: Leveraging Heterogeneous Crowdsourced Data for Scenic Spot Profiling and Recommendation.",
                    "Context-Oriented Name-Face Association in Web Videos.",
                    "Social Media Profiler: Inferring Your Social Media Personality from Visual Attributes in Portrait.",
                    "SSFS: A Space-Saliency Fingerprint Selection Framework for Crowdsourcing Based Mobile Location Recognition.",
                    "Multi-view Multi-object Tracking Based on Global Graph Matching Structure.",
                    "Accelerating Large-Scale Human Action Recognition with GPU-Based Spark.",
                    "Adaptive Multi-class Correlation Filters.",
                    "Deep Neural Networks for Free-Hand Sketch Recognition.",
                    "Fusion of Thermal and Visible Imagery for Effective Detection and Tracking of Salient Objects in Videos.",
                    "RGB-D Camera based Human Limb Movement Recognition and Tracking in Supine Positions.",
                    "Scene Parsing with Deep Features and Spatial Structure Learning.",
                    "Semi-supervised Learning for Human Pose Recognition with RGB-D Light-Model."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16. PCM 2015",
        "info": "Gwangju, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2015-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2015 - 16th Pacific-Rim Conference on Multimedia, Gwangju, South Korea, September 16-18, 2015, Proceedings, Part I.",
                "count": 69,
                "papers": [
                    "Internal Generative Mechanism Based Otsu Multilevel Thresholding Segmentation for Medical Brain Images.",
                    "Efficient Face Image Deblurring via Robust Face Salient Landmark Detection.",
                    "Non-uniform Deblur Using Gyro Sensor and Long/Short Exposure Image Pair.",
                    "Object Searching with Combination of Template Matching.",
                    "Two-Step Greedy Subspace Clustering.",
                    "Iterative Collection Annotation for Sketch Recognition.",
                    "Supervised Dictionary Learning Based on Relationship Between Edges and Levels.",
                    "Adaptive Margin Nearest Neighbor for Person Re-Identification.",
                    "Compressed-Domain Based Camera Motion Estimation for Realtime Action Recognition.",
                    "On the Security of Image Manipulation Forensics.",
                    "A Sparse Representation-Based Label Pruning for Image Inpainting Using Global Optimization.",
                    "Interactive RGB-D Image Segmentation Using Hierarchical Graph Cut and Geodesic Distance.",
                    "Face Alignment with Two-Layer Shape Regression.",
                    "3D Panning Based Sound Field Enhancement Method for Ambisonics.",
                    "Multi-target Tracking via Max-Entropy Target Selection and Heterogeneous Camera Fusion.",
                    "Adaptive Multiple Appearances Model Framework for Long-Term Robust Tracking.",
                    "On-line Sample Generation for In-air Written Chinese Character Recognition Based on Leap Motion Controller.",
                    "Progressive Image Segmentation Using Online Learning.",
                    "A Study of Interactive Digital Multimedia Applications.",
                    "Particle Filter with Ball Size Adaptive Tracking Window and Ball Feature Likelihood Model for Ball's 3D Position Tracking in Volleyball Analysis.",
                    "Block-Based Global and Multiple-Reference Scheme for Surveillance Video Coding.",
                    "Global Object Representation of Scene Surveillance Video Based on Model and Feature Parameters.",
                    "A Sparse Error Compensation Based Incremental Principal Component Analysis Method for Foreground Detection.",
                    "Convolutional Neural Networks Features: Principal Pyramidal Convolution.",
                    "Gaze Shifting Kernel: Engineering Perceptually- Aware Features for Scene Categorization.",
                    "Two-Phase Representation Based Classification.",
                    "Deep Feature Representation via Multiple Stack Auto-Encoders.",
                    "Beyond HOG: Learning Local Parts for Object Detection.",
                    "Tuning Sparsity for Face Hallucination Representation.",
                    "Visual Tracking by Assembling Multiple Correlation Filters.",
                    "A Unified Tone Mapping Operation for HDR Images Including Both Floating-Point and Integer Data.",
                    "Implementation of Human Action Recognition System Using Multiple Kinect Sensors.",
                    "Simplification of 3D Multichannel Sound System Based on Multizone Soundfield Reproduction.",
                    "Multi-channel Object-Based Spatial Parameter Compression Approach for 3D Audio.",
                    "A FPGA Based High-Speed Binocular Active Vision System for Tracking Circle-Shaped Target.",
                    "The Extraction of Powerful and Attractive Video Contents Based on One Class SVM.",
                    "Blur Detection Using Multi-method Fusion.",
                    "Motion Vector and Players' Features Based Particle Filter for Volleyball Players Tracking in 3D Space.",
                    "A Novel Edit Propagation Algorithm via L0 Gradient Minimization.",
                    "Improved Salient Object Detection Based on Background Priors.",
                    "Position-Patch Based Face Hallucination via High-Resolution Reconstructed-Weights Representation.",
                    "Real-Time Rendering of Layered Materials with Linearly Filterable Reflectance Model.",
                    "Hybrid Lossless-Lossy Compression for Real-Time Depth-Sensor Streams in 3D Telepresence Applications.",
                    "Marginal Fisher Regression Classification for Face Recognition.",
                    "Temporally Adaptive Quantization Algorithm in Hybrid Video Encoder.",
                    "Semi-automatic Labeling with Active Learning for Multi-label Image Classification.",
                    "A New Multi-modal Technique for Bib Number/Text Detection in Natural Images.",
                    "A New Multi-spectral Fusion Method for Degraded Video Text Frame Enhancement.",
                    "A Robust Video Text Extraction and Recognition Approach Using OCR Feedback Information.",
                    "Color and Active Infrared Vision: Estimate Infrared Vision of Printed Color Using Bayesian Classifier and K-Nearest Neighbor Regression.",
                    "Low Bitrates Audio Bandwidth Extension Using a Deep Auto-Encoder.",
                    "Part-Aware Segmentation for Fine-Grained Categorization.",
                    "Improved Compressed Sensing Based 3D Soft Tissue Surface Reconstruction.",
                    "Constructing Learning Maps for Lecture Videos by Exploring Wikipedia Knowledge.",
                    "Object Tracking via Combining Discriminative Global and Generative Local Models.",
                    "Tracking Deformable Target via Multi-cues Active Contours.",
                    "Person Re-identification via Attribute Confidence and Saliency.",
                    "Light Field Editing Based on Reparameterization.",
                    "Interactive Animating Virtual Characters with the Human Body.",
                    "Fast Graph Similarity Search via Locality Sensitive Hashing.",
                    "Text Localization with Hierarchical Multiple Feature Learning.",
                    "Recognizing Human Actions by Sharing Knowledge in Implicit Action Groups.",
                    "Human Parsing via Shape Boltzmann Machine Networks.",
                    "Depth-Based Stereoscopic Projection Approach for 3D Saliency Detection.",
                    "Revisiting Single Image Super-Resolution Under Internet Environment: Blur Kernels and Reconstruction Algorithms.",
                    "Prediction Model of Multi-channel Audio Quality Based on Multiple Linear Regression.",
                    "Physical Properties of Sound Field Based Estimation of Phantom Source in 3D.",
                    "Non-overlapped Multi-source Surveillance Video Coding Using Two-Layer Knowledge Dictionary.",
                    "Global Motion Information Based Depth Map Sequence Coding."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2015-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2015 - 16th Pacific-Rim Conference on Multimedia, Gwangju, South Korea, September 16-18, 2015, Proceedings, Part II.",
                "count": 69,
                "papers": [
                    "Motion and Depth Assisted Workload Prediction for Parallel View Synthesis.",
                    "Graph Cuts Stereo Matching Based on Patch-Match and Ground Control Points Constraint.",
                    "Synthesized Views Distortion Model Based Rate Control in 3D-HEVC.",
                    "Efficient Depth Map Upsampling Method Using Standard Deviation.",
                    "Orthogonal and Smooth Subspace Based on Sparse Coding for Image Classification.",
                    "Sparse Representation Based Image Quality Assessment with Adaptive Sub-dictionary Selection.",
                    "Single Image Super-Resolution via Iterative Collaborative Representation.",
                    "Influence of Spatial Resolution on State-of-the-Art Saliency Models.",
                    "Depth Map Upsampling via Progressive Manner Based on Probability Maximization.",
                    "Perceptual Quality Improvement for Synthesis Imaging of Chinese Spectral Radioheliograph.",
                    "Real-Life Voice Activity Detection Based on Audio-Visual Alignment.",
                    "Emotion Recognition from EEG Signals by Leveraging Stimulus Videos.",
                    "Twitter Event Photo Detection Using both Geotagged Tweets and Non-geotagged Photo Tweets.",
                    "Weather-Adaptive Distance Metric for Landmark Image Classification.",
                    "Power of Tags: Predicting Popularity of Social Media in Geo-Spatial and Temporal Contexts.",
                    "Recognition of Human Group Activity for Video Analytics.",
                    "An Incremental SRC Method for Face Recognition.",
                    "A Survey on Media Interaction in Social Robotics.",
                    "Recognizing 3D Continuous Letter Trajectory Gesture Using Dynamic Time Warping.",
                    "Rapid 3D Face Modeling from Video.",
                    "Score Level Fusion of Multibiometrics Using Local Phase Array.",
                    "Histogram-Based Near-Lossless Data Hiding and Its Application to Image Compression.",
                    "Hierarchical Learning for Large-Scale Image Classification via CNN and Maximum Confidence Path.",
                    "Single Camera-Based Depth Estimation and Improved Continuously Adaptive Mean Shift Algorithm for Tracking Occluded Objects.",
                    "A Flexible Programmable Camera Control and Data Acquisition Hardware Platform.",
                    "Comparison of Real-time Streaming Performance Between UDP and TCP Based Delivery Over LTE.",
                    "Video Streaming for Multi-cloud Game.",
                    "Performance Analysis of Scaler SoC for 4K Video Signal.",
                    "Deblocking Filter for Depth Videos in 3D Video Coding Extension of HEVC.",
                    "Sparcity-Induced Structured Transform in Intra Video Coding for Screen Contents.",
                    "High-Speed Periodic Motion Reconstruction Using an Off-the-shelf Camera with Compensation for Rolling Shutter Effect.",
                    "Robust Feature Extraction for Shift and Direction Invariant Action Recognition.",
                    "Real-Time Human Action Recognition Using CNN Over Temporal Images for Static Video Surveillance Cameras.",
                    "Scalable Tamper Detection and Localization Scheme for JPEG2000 Codestreams.",
                    "Developing a Visual Stopping Criterion for Image Mosaicing Using Invariant Color Histograms.",
                    "Intelligent Reconstruction and Assembling of Pipeline from Point Cloud Data in Smart Plant 3D.",
                    "A Rotational Invariant Non-local Mean.",
                    "Adaptive Layered Video Transmission with Channel Characteristics.",
                    "An Accurate and Efficient Nonlinear Depth Quantization Scheme.",
                    "Synthesis-Aware Region-Based 3D Video Coding.",
                    "A Paradigm for Dynamic Adaptive Streaming over HTTP for Multi-view Video.",
                    "Adaptive Model for Background Extraction Using Depth Map.",
                    "An Efficient Partition Scheme for Depth-Based Block Partitioning in 3D-HEVC.",
                    "Image Classification with Local Linear Decoding and Global Multi-feature Fusion.",
                    "Hashing with Inductive Supervised Learning.",
                    "Graph Based Visualization of Large Scale Microblog Data.",
                    "Boosting Accuracy of Attribute Prediction via SVD and NMF of Instance-Attribute Matrix.",
                    "Fatigue Detection Based on Fast Facial Feature Analysis.",
                    "A Packet-Layer Model with Content Characteristics for Video Quality Assessment of IPTV.",
                    "Frame Rate and Perceptual Quality for HD Video.",
                    "No-Reference Image Quality Assessment Based on Singular Value Decomposition Without Learning.",
                    "An Improved Brain MRI Segmentation Method Based on Scale-Space Theory and Expectation Maximization Algorithm.",
                    "User-Driven Sports Video Customization System for Mobile Devices.",
                    "Auditory Spatial Localization Studies with Different Stimuli.",
                    "Multichannel Simplification Based on Deviation of Loudspeaker Positions.",
                    "Real-Time Understanding of Abnormal Crowd Behavior on Social Robots.",
                    "Sparse Representation Based Approach for RGB-D Hand Gesture Recognition.",
                    "Eye Gaze Correction for Video Conferencing Using Kinect v2.",
                    "Temporally Consistence Depth Estimation from Stereo Video Sequences.",
                    "A New Low-Complexity Error Concealment Method for Stereo Video Communication.",
                    "Hole Filling Algorithm Using Spatial-Temporal Background Depth Map for View Synthesis in Free View Point Television.",
                    "Pattern Feature Detection for Camera Calibration Using Circular Sample.",
                    "Temporal Consistency Enhancement for Digital Holographic Video.",
                    "Efficient Disparity Map Generation Using Stereo and Time-of-Flight Depth Cameras.",
                    "Super-Resolution of Depth Map Exploiting Planar Surfaces.",
                    "Hierarchical Interpolation-Based Disocclusion Region Recovery for Two-View to N-View Conversion System.",
                    "UEP Network Coding for SVC Streaming.",
                    "Overview on MPEG MMT Technology and Its Application to Hybrid Media Delivery over Heterogeneous Networks.",
                    "A Framework for Extracting Sports Video Highlights Using Social Media."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15. PCM 2014",
        "info": "Kuching, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2014",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2014 - 15th Pacific-Rim Conference on Multimedia, Kuching, Malaysia, December 1-4, 2014, Proceedings.",
                "count": 41,
                "papers": [
                    "Region-Based Interactive Ranking Optimization for Person Re-identification.",
                    "Adaptive Tag Selection for Image Annotation.",
                    "Twitter Food Photo Mining and Analysis for One Hundred Kinds of Foods.",
                    "Improving Color Constancy with Internet Photo Collections.",
                    "A Background Modeling Scheme Based on High Efficiency Motion Classification for Surveillance Video Coding.",
                    "An Adaptive Perceptual Quantization Algorithm Based on Block-Level JND for Video Coding.",
                    "Improved Prediction Estimation Based H.264 to HEVC Intra Transcoding.",
                    "Unified VLSI Architecture of Motion Vector and Boundary Strength Parameter Decoder for 8K UHDTV HEVC Decoder.",
                    "Using Label Propagation to Get Confidence Map for Segmentation.",
                    "Image Region Labeling by Exploring Contextual Information of Visual Spatial and Semantic Concepts.",
                    "Manifold Regularized Multi-view Feature Selection for Web Image Annotation.",
                    "Semantic Concept Annotation of Consumer Videos at Frame-Level Using Audio.",
                    "Text Detection in Natural Scene Images with Stroke Width Clustering and Superpixel.",
                    "Sketch-Based Retrieval Using Content-Aware Hashing.",
                    "Pixel Granularity Template Matching Method for Screen Content Lossless Intra Picture.",
                    "Music Interaction on Mobile Phones.",
                    "Semantically Enhancing Multimedia Lifelog Events.",
                    "Haar-Like and HOG Fusion Based Object Tracking.",
                    "Noise Face Image Hallucination via Data-Driven Local Eigentransformation.",
                    "Lip Segmentation Based on Facial Complexion Template.",
                    "Saliency-Based Deformable Model for Pedestrian Detection.",
                    "Age Estimation Based on Convolutional Neural Network.",
                    "A Curvature Filter and Normal Clustering Based Approach to Detecting Cylinder on 3D Medical Model.",
                    "Image Compositing Based on Hierarchical Weighted Blending.",
                    "Multifold Concept Relationships Metrics.",
                    "A Comparison between Artificial Neural Network and Cascade-Correlation Neural Network in Concept Classification.",
                    "Location-Based Hierarchical Event Summary for Social Media Photos.",
                    "Towards Natural Gestures for Presentation Control Using Microsoft Kinect.",
                    "3D-Spatial-Texture Bilateral Filter for Depth-Based 3D Video.",
                    "A System for Parking Lot Marking Detection.",
                    "Fast Search of Binary Codes with Distinctive Bits.",
                    "Data-Dependent Locality Sensitive Hashing.",
                    "Cosine Distance Metric Learning for Speaker Verification Using Large Margin Nearest Neighbor Method.",
                    "Anchor Shot Detection with Deep Neural Network.",
                    "Adaptation of ANN Based Video Stream QoE Prediction Model.",
                    "Leveraging Color Harmony and Spatial Context for Aesthetic Assessment of Photographs.",
                    "A Multi-exposure Fusion Method Based on Locality Properties.",
                    "Image Abstraction Using Anisotropic Diffusion Symmetric Nearest Neighbor Filter.",
                    "Reduction of Multichannel Sound System Based on Spherical Harmonics.",
                    "Automatic Multichannel Simplification with Low Impacts on Sound Pressure at Ears.",
                    "Acoustic Beamforming with Maximum SNR Criterion and Efficient Generalized Eigenvector Tracking."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14. PCM 2013",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2013",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2013 - 14th Pacific-Rim Conference on Multimedia, Nanjing, China, December 13-16, 2013. Proceedings.",
                "count": 81,
                "papers": [
                    "A Cloud-Based Multi-functional e-Meeting System by Flash-Based Multimedia Technology for Higher Education on the WebELS System.",
                    "Disparity-Constrained Resolution Adaptation for Stereoscopic Images.",
                    "Facial Point Detection with Occlusion Insensitive Visibility-Aware Part Model.",
                    "3-D Geometry Enhanced Superpixels for RGB-D Data.",
                    "Graph-Based Label Propagation with Dissimilarity Regularization.",
                    "Localize and Segment Scene Text.",
                    "Multi-class Cosegmentation with Pairwise Active Learning.",
                    "Cross-View Gait-Based Gender Classification by Transfer Learning.",
                    "Hierarchical Block Size Decision for H.264/AVC Intra Prediction.",
                    "Scale Selection in SIFT Flow for Robust Dense Image Matching.",
                    "Adaptive Weighted Prediction for Scalable Video Coding Based on HEVC.",
                    "Saliency Detection Using DCT Coefficients and Superpixel-Based Segmentation.",
                    "High Quality Image Deblurring Scheme Using the Pyramid Hyper-Laplacian L2 Norm Priors Algorithm.",
                    "Improved Rotating Kernel Transformation Based Contourlet Domain Image Denoising Framework.",
                    "Hand Dorsal Vein Recognition Based on Shape Representation of the Venous Network.",
                    "A Novel Parallel Video Coding Framework for AVS+ Real Time Encoder.",
                    "Video Saliency Detection Algorithm Based on Phase and Amplitude Joint Spectrum Difference.",
                    "Edge-Respecting Image Smoothing via Extrema Interpolation.",
                    "Image Retargeting by Combining Region Warping and Occlusion.",
                    "Automatic 3D Prostate MR Image Segmentation Using Graph Cuts and Level Sets with Shape Prior.",
                    "Improving PMVS Algorithm for 3D Scene Reconstruction from Sparse Stereo Pairs.",
                    "Fast HEVC Encoding with GPU Assisted Reference Picture Selection.",
                    "A Real-Time Mesh Animation Framework Using Kinect.",
                    "Geo-referenced Tourist Attraction Photo Tagging by Mining Community Photo Collections.",
                    "Improving Histogram-Based Image Registration in Video Sequences through Warping.",
                    "Robust Tracking via Hough Forests Based on Weak Classifier Response.",
                    "Saliency-Based Auditory Detection Method Using Energy Linear Superposition.",
                    "Perceptual Based Content Adaptive L 0 Smoothing.",
                    "Fusing Multiple Visual Features for Image Complexity Evaluation.",
                    "An Invisible Gorilla: Is It a Matter of Focus of Attention?",
                    "Fine-Grained Image Classification Using Color Exemplar Classifiers.",
                    "Smart Thumbnail: Automatic Image Cropping by Mining Canonical Query Objects.",
                    "An Efficient Zigzag Scanning and Entropy Coding Architecture Design.",
                    "COGE: A Novel Binary Feature Descriptor Exploring Anisotropy and Non-uniformity.",
                    "A Complementary Aggregation Approach for Local Stereo Matching Using Color and Correlation Cues.",
                    "GhostMesh: Cloud-Based Interactive Mesh Editing.",
                    "Efficient Sketch-Based 3D Shape Retrieval via View Selection.",
                    "Guided Depth Enhancement via Anisotropic Diffusion.",
                    "Stereo GrabCut: Interactive and Consistent Object Extraction for Stereo Images.",
                    "A Novel Hardware-Based UHD Video Up-Scaler Based on Local Structure Estimation.",
                    "Binary Adaptive Luminance Mapping for Motion Estimation.",
                    "Adaptive Video Super-Resolution Based on Superpixel-Guided Auto-Regressive Model.",
                    "Motion Estimation for Video Coding Based on Subspace Pursuit.",
                    "Graph-Guided Fusion Penalty Based Sparse Coding for Image Classification.",
                    "Image Classification by Iterative Semi-Supervised Sparse Coding.",
                    "Cross-Codebook Image Classification.",
                    "Spatio-temporal SURF for Human Action Recognition.",
                    "Human Action Recognition by Mining Discriminative Segment with Novel Skeleton Joint Feature.",
                    "Multi-cue Based Multi-target Tracking with Boosted MHT.",
                    "Haar-Like Feature Based On-Line Boosting Tracking Algorithm with Directional Texture Entropy.",
                    "Robust Object Tracking Using Motion Context in Crowded Scenes.",
                    "Person Re-identification by Smooth Metric Learning.",
                    "Venue Semantics: Multimedia Topic Modeling of Social Media Contents.",
                    "Conditional Random Fields for Image Region Labeling with Global Observation.",
                    "Multi-feature Subspace Learning via Sparse Correlation Fusion and Embedding.",
                    "Auditory Context Recognition Combining Discriminative and Generative Models.",
                    "An Integrated Model for Bayesian Learning of Sparse Representation and Classifier Training.",
                    "Generalized N-Dimensional PCA for Compact Representation of Medical Volumes and Effective Mode Selection by Adaboost.",
                    "Constructing Hierarchical Visual Tree for Discriminative Image Representation and Classification.",
                    "Group Sparse Ensemble Learning for Visual Concept Detection.",
                    "High-Level Video Semantic Concept Detection Based on Multi-level Feature Representations.",
                    "The Impact of Global and Local Features on Multiple Sequence Alignment Clustering-Based Near-Duplicate Video Retrieval.",
                    "Saliency Detection-Based Mixture of Reality and Non-Photorealistic Rendering Effects for Artistic Visualization.",
                    "Hand Tracking with Mid-Level Visual Cues and Ensemble Learning.",
                    "Real-Time Head Pose Estimation by RGB-D Camera.",
                    "Real-Time Multi-pedestrian Tracking Based on Vision and Depth Information Fusion.",
                    "Traffic Sign Detection Based on Camera Imaging Apriority.",
                    "Recommend Social Network Users Favorite Brands.",
                    "Event Representation and Visualization from Social Media.",
                    "Online Web-Video Topic Detection and Tracking with Semi-supervised Learning.",
                    "Temporal Context Analysis for Action Recognition in Multi-agent Scenarios.",
                    "Target Detection Based on Kernel Density Estimation Combined with Correlation Coefficient.",
                    "A Belief Based Correlated Topic Model for Semantic Region Analysis in Far-Field Video Surveillance Systems.",
                    "Weakly Supervised Compressive Tracking with Effective Prediction Model.",
                    "Multiple Hypotheses Based Spatial-Temporal Association for Stable Pedestrian Counting.",
                    "Block-Based Face Recognition Using WLD.",
                    "A Wavelet Model of Ganglion Cells Array and Its Application in Image Representation.",
                    "Thorough Evaluation of the Discriminabilities of Four Voting Schemes in the Generation of Histogram of Orientation.",
                    "Texture Classification via Local Feature Representation of Multi-order Gradients.",
                    "Compact and Robust Image Fingerprints Based on CCA of Local Features.",
                    "A Large Scale Audio Fingerprinting System."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13. PCM 2012",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2012",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2012 - 13th Pacific-Rim Conference on Multimedia, Singapore, December 4-6, 2012. Proceedings.",
                "count": 82,
                "papers": [
                    "Incremental Learning of Patch-Based Bag of Facial Words Representation for Online Face Recognition in Videos.",
                    "Evaluation of Audio Quality Requirements over Extended Periods of Time Using Long Duration Audiovisual Content.",
                    "Hashing with Cauchy Graph.",
                    "Multimedia Event Detection Using Segment-Based Approach for Motion Feature.",
                    "Robust Feature Bundling.",
                    "Colorization for Gray Scale Facial Image by Locality-Constrained Linear Coding.",
                    "New Eye Contact Correction Using Radial Basis Function for Wide Baseline Videoconference System.",
                    "An Integrated Hole-Filling Algorithm for View Synthesis.",
                    "A Real-Time On-Chip Algorithm for IMU-Based Gait Measurement.",
                    "Reducing the Power Consumption of an IMU-Based Gait Measurement System.",
                    "SSIM-Based End-to-End Distortion Modeling for H.264 Video Coding.",
                    "A Videoconferencing-Oriented Hybrid-Domain H.264/SVC to H.264/AVC Spatial Transcoder.",
                    "Robust Noise Estimation Based on Noise Injection.",
                    "Image Quality Assessment Based on Improved Structural SIMilarity.",
                    "Multi-hypothesis Temporal Prediction Using Template Matching Prediction and Block Motion Compensation for High Efficiency Video Coding.",
                    "Leveraging Exemplar and Saliency Model for Image Search Reranking.",
                    "Real-Time Markerless Hand Gesture Recognition with Depth Camera.",
                    "Social Tag Enrichment via Automatic Abstract Tag Refinement.",
                    "\"...It's Orange and Small, and White Stripes...\" - Augmented-Reality System for Fish Species Identification in Aquariums.",
                    "An Adaptive Non Reference Anchor Array Framework for Distant Speech Recognition.",
                    "Real-Time Macroblock Level Bits Allocation for Depth Maps in 3-D Video Coding.",
                    "Least Square Based View Synthesis Prediction for Multi-view Video Coding.",
                    "Zoomable Video Playback on Mobile Devices by Selective Decoding.",
                    "SSIM-Based Error Resilient Video Coding over Packet-Switched Networks.",
                    "De-blocking Filter Design for HEVC and H.264/AVC.",
                    "A Local Texture-Constrained Super-Resolution Method.",
                    "Top-Down Saliency by Multi-scale Contextual Pooling.",
                    "A Robust Watermarking Scheme Based on Dual Quantization of Wavelet Significant Difference.",
                    "Robust Image Content Authentication Using Perceptual Hashing and Watermarking.",
                    "A Secure Semi-fragile Self-recoverable Watermarking Algorithm Using Group-Based Wavelet Quantization.",
                    "Towards Independent Color Space Selection for Human Skin Detection.",
                    "A Novel Smart Multi-license Plate Recognition Method.",
                    "Persistent Object Tracking in Road Panoramic Videos.",
                    "Active Learning for Transferrable Object Classification in Cross-View Traffic Scene Surveillance.",
                    "Laplacian-Based Feature Preserving Mesh Simplification.",
                    "An Image Splicing Detection Based on Interpolation Analysis.",
                    "A Multimodal Approach for Online Estimation of Subtle Facial Expression.",
                    "Just Noticeable Difference for 3D Images with Depth Saliency.",
                    "Improving Image Distance Metric Learning by Embedding Semantic Relations.",
                    "Pose Estimation with Motionlet LLC Coding.",
                    "Transfer Discriminant-Analysis of Canonical Correlations for View-Transfer Action Recognition.",
                    "Personalized Celebrity Video Search Based on Cross-Space Mining.",
                    "Effective Comic-Like Representations with Embedded Regions of Interest.",
                    "Kinect-Based Easy 3D Object Reconstruction.",
                    "Adaptive Rate-Distortion Prediction for Multiple Reference Selection and Inter-mode Decision.",
                    "A New Rate-Quantization Model for H.264/AVC Low-Delay Rate Control.",
                    "Chaos-Based Selective Encryption for AVS Video Coding Standard.",
                    "Q-CSLBP: Compression of CSLBP Descriptor.",
                    "Efficient Partial Decoding Scheme for Intra Frame in H.264/AVC Stream.",
                    "Histopathology Image Streaming.",
                    "Visual Saliency and Distortion Weighting Based Video Quality Assessment.",
                    "A Resource Scheduling Approach for Media Uploading in Video Data Center.",
                    "Fast Intra Prediction for High Efficiency Video Coding.",
                    "A Low Complexity Multiplierless Transform Coding for HEVC.",
                    "Efficient DSP Implementation of Fractional-Pixel Interpolation for AVS.",
                    "Audio-Based Copy Detection in the Large-Scale Internet Videos.",
                    "Automatic User Preference Elicitation for Music Recommendation.",
                    "Interactive Virtual Try-On Based on Real-Time Motion Capture.",
                    "Distant Speaker Verification Using a Combined Family of MVDR Estimates.",
                    "Spatio-temporal Visual Distortion and Rate Optimization for Video Coding.",
                    "View Synthesis Based on Background Update with Gaussian Mixture Model.",
                    "Cloud-Based Image Compression via Subband-Based Reconstruction.",
                    "Image Primitive Coding and Visual Quality Assessment.",
                    "A Flexible Directional Image Representation Using Pseudo Polar Fourier Transform Based DFBs.",
                    "Location and Route Tracking in University from Photos without GPS Information.",
                    "Real-Time Viewfinder Composition Assessment and Recommendation to Mobile Photographing.",
                    "Instance-Level Landmark Labeling via Multi-layer Superpixels.",
                    "Location Based Robust Audio Watermarking Algorithm for Social TV System.",
                    "Combining SIFT and Global Features for Web Image Classification.",
                    "An Interactive Semi-supervised Approach for Automatic Image Annotation.",
                    "Cross-Media Semantics Mining Based on Sparse Canonical Correlation Analysis and Relevance Feedback.",
                    "What Happened Near Big Ben: Event-Driven Landmark Mining from Flickr.",
                    "Image Ranking via Attribute Boosted Hypergraph.",
                    "Structural Context-Aware Cross Media Recommendation.",
                    "Spherical Soft Assignment: Improving Image Representation in Content-Based Image Retrieval.",
                    "Fast Pedestrian Detection Based on Sliding Window Filtering.",
                    "The Research of the Face's Depth Information Generation Technology Based on the Candide Model.",
                    "Action Segmentation in Dance Videos.",
                    "Topology Adaptation Based on Mobile Agent in Unstructured P2P Networks.",
                    "Accurate Pedestrian Counting System Based on Local Features.",
                    "Two Dimensional K-SVD for the Analysis Sparse Dictionary.",
                    "The Method for Constructing Block Sparse Measurement Matrix Based on Orthogonal Vectors."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12. PCM 2011",
        "info": "Sydney, Australia",
        "venues": []
    },
    {
        "year": "2010",
        "name": "11. PCM 2010",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2010-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2010 - 11th Pacific Rim Conference on Multimedia, Shanghai, China, September 21-24, 2010, Proceedings, Part I.",
                "count": 67,
                "papers": [
                    "Composition Based Semantic Scene Retrieval for Ancient Murals.",
                    "Feature-Preserving 3D Thumbnail Creation via Mesh Decomposition and Approximation.",
                    "Correlation-Based Feature Selection and Regression.",
                    "A Simple Content-Based Strategy for Estimating the Geographical Location of a Webcam.",
                    "Improving Video Concept Detection Using Spatio-Temporal Correlation.",
                    "Novel Spectral Descriptor for Object Shape.",
                    "A Multi-layer Scene Model for Video Surveillance Applications.",
                    "Practical Implementation of Super-Resolution Approach for SD-to-HD Video Up-Conversion.",
                    "Image Histogram Constrained SIFT Matching.",
                    "A Method for Music Structure Analysis Using MPEG-4 TwinVQ Audio Compression.",
                    "A Blind Reference-Free Blockiness Measure.",
                    "Learning Contextual Metrics for Automatic Image Annotation.",
                    "Real Time Tunnel Based Video Summarization Using Direct Shift Collision Detection.",
                    "Boosting Multimodal Semantic Understanding by Local Similarity Adaptation and Global Correlation Propagation.",
                    "A New Image Quality Assessment Model Based on the MPEG-7 Descriptor.",
                    "A Complete Visual Hull Representation Using Bounding Edges.",
                    "Discovering Phrase-Level Lexicon for Image Annotation.",
                    "Action Recognition Based on Learnt Motion Semantic Vocabulary.",
                    "Video Summarization with Visual and Semantic Features.",
                    "Scene Categorization Using Boosted Back-Propagation Neural Networks.",
                    "People Detection by Boosting Features in Nonlinear Subspace.",
                    "Multilinear Tensor Supervised Neighborhood Embedding Analysis for View-Based Object Recognition.",
                    "Color Spectrum Normalization: Saliency Detection Based on Energy Re-allocation.",
                    "An Experience Oriented Video Digesting Method Using Heart Activity and Its Applicable Video Types.",
                    "Abnormal Change Detection of Image Quality Metric Series Using Diffusion Process and Stopping Time Theory.",
                    "A Video Text Detection Method Based on Key Text Points.",
                    "Commercial Recognition in TV Streams Using Coarse-to-Fine Matching Strategy.",
                    "Automatic Video Abstraction via the Progress of Story.",
                    "Efficient Foreground Layer Extraction in Video.",
                    "Robust Shape Retrieval through a Novel Statistical Descriptor.",
                    "A New Text Detection Algorithm for Content-Oriented Line Drawing Image Retrieval.",
                    "3D Similarity Search Using a Weighted Structural Histogram Representation.",
                    "A Hybrid Moving Object Detection Method for Aerial Images.",
                    "A Vehicle Color Classification Method for Video Surveillance System Concerning Model-Based Background Subtraction.",
                    "Efficient Temporal Segmentation for Sports Programs with Special Cases.",
                    "An Effective Video Text Tracking Algorithm Based on SIFT Feature and Geometric Constraint.",
                    "A Novel Metrics Based on Information Bottleneck Principle for Face Retrieval.",
                    "On Vocabulary Size in Bag-of-Visual-Words Representation.",
                    "A Determined Binary Level Set Method Based on Mean Shift for Contour Tracking.",
                    "Adaptive Particle Filter Based on Energy Field for Robust Object Tracking in Complex Scenes.",
                    "3D Model Retrieval Using 2D View and Transform-Based Features.",
                    "An Approach to the Compact and Efficient Visual Codebook Based on SIFT Descriptor.",
                    "Adaptive Energy Diffusion for Blind Inverse Halftoning.",
                    "Structuring Sport Video through Audio Event Classification.",
                    "A New Shape Descriptor for Object Recognition and Retrieval.",
                    "Training Strategy of Semantic Concept Detectors Using Support Vector Machine in Naked Image Classification.",
                    "Unifying Content and Context Similarities of the Textual and Visual Information in an Image Clustering Framework.",
                    "Depth Estimation of Face Images Based on the Constrained ICA Model.",
                    "Personalized Content Adaptation Using Multimodal Highlights of Soccer Video.",
                    "SAR Image Segmentation Based on Kullback-Leibler Distance of Edgeworth.",
                    "A Fast Video Copy Detection Approach by Dynamic Programming.",
                    "Two-Stage Localization for Image Labeling.",
                    "Duplication Localization and Segmentation.",
                    "Identifying Steganographic Payload Location in Binary Image.",
                    "Cryptanalysis of an Image Encryption Scheme Using Cellular Automata Substitution and SCAN.",
                    "Improved DE-Based Reversible Watermarking Using Sorting and Histogram Shifting.",
                    "Privacy-Preserving Watch List Screening in Video Surveillance System.",
                    "Hybrid SVD-Based Audio Watermarking Scheme.",
                    "A Novel Multi-size Block Benford's Law Scheme for Printer Identification.",
                    "A Reversible Data Hiding Scheme for JPEG Images.",
                    "Affine Resilient Image Watermarking Based on Trace Transform.",
                    "Histogram-Based Reversible Data Hiding.",
                    "Statistical Analysis of Image Quality Metrics for Watermark Transparency Assessment.",
                    "Scalable and Credible Video Watermarking towards Scalable Video Coding.",
                    "Protecting Biometric Templates Using Authentication Watermarking.",
                    "Non-blind Image Deconvolution with Adaptive Regularization.",
                    "Robust Lip Segmentation Method Based on Level Set Model."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2010-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2010 - 11th Pacific Rim Conference on Multimedia, Shanghai, China, September 2010, Proceedings, Part II.",
                "count": 69,
                "papers": [
                    "High Dimensionality Reduction Using CUR Matrix Decomposition and Auto-encoder for Web Image Classification.",
                    "Large Scale Rich Media Information Search: Challenges and Opportunities.",
                    "Image Annotation by Sparse Logistic Regression.",
                    "The Organization of Mobile Personal Lifelog by Activity.",
                    "Using Scripts for Affective Content Retrieval.",
                    "A Bandwidth Reduction Scheme and Its VLSI Implementation for H.264/AVC Motion Vector Decoding.",
                    "Fast Mode Decision Based on RDO for AVS High Definition Video Encoder.",
                    "Rate-Distortion-Complexity Analysis on AVS Encoder.",
                    "Coding of Motion Capture Data via Temporal-Domain Sampling and Spatial-domain Vector Quantization Techniques.",
                    "A Novel Low-Bit-Rate Image Compression Algorithm.",
                    "Inter Frame Coding with Adaptive Transform.",
                    "Spatiogram Based Fast Mode Decision in Spatial Scalable Video Coding.",
                    "Novel Early Mode Decision Algorithm for Enhancement Layers in H.264 Scalable Video Coding.",
                    "Fast Inter-Mode Decision Based on Rate-Distortion Cost Characteristics.",
                    "A Multi-pass VBR Rate Control Method for Video Plus Depth Based Mobile 3D Video Coding.",
                    "Dimensionality Reduction by Using Sparse Reconstruction Embedding.",
                    "Fast H.264 Encoding Based on Statistical Learning.",
                    "Spatial Bit Allocation with SAQD-Domain Source Models for H.264/SVC.",
                    "A New Spatio-temporal JND Model based on 3D Pyramid Decomposition.",
                    "Unstructured Point Cloud Surface Denoising and Decimation Using Distance RBF K-Nearest Neighbor Kernel.",
                    "Wavelet-Based Eigentransformation for Face Super-Resolution.",
                    "Real-Time Architecture for Inter-layer Prediction of H.264/SVC.",
                    "An Efficient Compressed Domain Spatial Transcoding Scheme for Adaptive Video Content Delivery.",
                    "Mode Decision for High-Quality H.264/AVC Video Downscaling Transcoding.",
                    "A New Shot Change Detection Method Using Information from Motion Estimation.",
                    "Optimization on Motion Estimation and DSP Algorithm Based on AVS Encoding.",
                    "Encoder Adaptable Difference Detection for Low Power Video Compression in Surveillance System.",
                    "Temporal Scalable Decoding Process with Frame Rate Conversion Method for Surveillance Video.",
                    "Video Coding With Key Frames Guided Super-Resolution.",
                    "Low-Complexity and Sampling-Aided Multi-view Video Coding at Low Bitrate.",
                    "A Fast Video Transcoder from Wyner-Ziv to AVS.",
                    "Efficient Coding of Motion Vector Predictor Using Phased-in Code.",
                    "A Content-Adaptive Method for Single Image Dehazing.",
                    "Image Restoration Based on PDEs and a Non-local Algorithm.",
                    "Frame Based Redundant-Macro-Block Error Resilient in Scalable Video Coding.",
                    "A Novel Energy-Minimized Optimization Algorithm for Mobile Image Transmission.",
                    "An Efficient Frame Loss Error Concealment Scheme Based on Tentative Projection for H.264/AVC.",
                    "Content Based Packet Loss Recovery for Classical Music Transmissions over the Internet.",
                    "Rate-Distortion Control with Delay Bound Constraint for Video Streaming over Multi-Hop Networks.",
                    "Interpolation and Zooming Techniques Utilizing Edge-weighted Adaptive Filtering for Color Filter Array.",
                    "Soccer Video Event Detection by Fusing Middle Level Visual Semantics of an Event Clip.",
                    "High Quality Video Acquisition and Segmentation Using Alternate Flashing System.",
                    "Visual Attention Based Motion Object Detection and Trajectory Tracking.",
                    "Human-Computer Collaborative Object Recognition for Intelligent Support.",
                    "Visual Attention Model Based Object Tracking.",
                    "Soft-Constraint Based Online LDA for Community Recommendation.",
                    "Sparse Representation Based on K-Nearest Neighbor Classifier for Degraded Chinese Character Recognition.",
                    "MOSIR: Image and Segment-Based Retrieval for Mobile Phones.",
                    "A Novel ASM-Based Two-Stage Facial Landmark Detection Method.",
                    "Evaluating Human Motion Complexity Based on Un-Correlation and Non-smoothness.",
                    "Noise Resistance Analysis of Wavelet-Based Channel Energy Feature for Breast Lesion Classification on Ultrasound Images.",
                    "Lasso-Based Tag Expansion and Tag-Boosted Collaborative Filtering.",
                    "Face Aging by Sparse Representation.",
                    "LINK2U: Connecting Social Network Users through Mobile Interfaces.",
                    "A Moving Object Detection Scheme in Codestream Domain for Motion JPEG Encoded Movies.",
                    "Improving Computation of Zero-Blocks for Zero-Block Mode Decision Using Prediction Motion Vector.",
                    "Curvelet Entropy for Facial Expression Recognition.",
                    "Video Structured Description: A Novel Solution for Visual Surveillance.",
                    "Key Color Priority Based Image Recoloring for Dichromats.",
                    "A Comprehensive Method for Arabic Video Text Detection, Localization, Extraction and Recognition.",
                    "A Novel Approach for Robust Surveillance Video Content Abstraction.",
                    "Accurate Facial Feature Localization on Expressional Face Images Based on a Graphical Model Approach.",
                    "An Integrated Approach of 3D Sound Rendering Techniques for Sound Externalization.",
                    "Recognizing Human Emotional State Based on the Phase Information of the Two Dimensional Fractional Fourier Transform.",
                    "A Novel Multimedia Educational Speech Therapy System for Hearing Impaired Children.",
                    "Discovering Motion Patterns for Human Action Recognition.",
                    "Semi-supervised Metric Learning for Image Classification.",
                    "Text Detection in Natural Images Based on Character Classification.",
                    "Gaze Data Collection with the Off-the-Shelf Devices."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10. PCM 2009",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2009",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2009, 10th Pacific Rim Conference on Multimedia, Bangkok, Thailand, December 15-18, 2009 Proceedings.",
                "count": 137,
                "papers": [
                    "Kernel Approaches to Unsupervised and Supervised Machine Learning.",
                    "Separation of Professional and Amateur Video in Large Video Collections.",
                    "Intensity Flicker Removal in Digitized Old Films Using Global-Local Histogram Transform.",
                    "Transmission Rate Enhancement for Scalable H.264/AVC Video over MIMO Wireless Systems.",
                    "On Peer Selection and Protection for Reliable Peer-to-Peer Video Streaming.",
                    "An Efficient Upsampling Technique for Images and Videos.",
                    "Metric Learning for Regression Problems and Human Age Estimation.",
                    "Spatiotemporal Phase Congruency Based Invariant Features for Human Behavior Classification.",
                    "An Innovative Weighted 2DLDA Approach for Face Recognition.",
                    "3D Human Body Tracking in Unconstrained Scenes.",
                    "Transfer Discriminative Logmaps.",
                    "A Movement Data Analysis and Synthesis Tool for Museum Visitors' Behaviors.",
                    "Photo Vignetting and Camera Orientation Correction for High Precision Acquisition.",
                    "Chinese Calligraphy Character Image Synthesis Based on Retrieval.",
                    "Stereoscopic Video Conversion of 2D Painting for Tour-Into-Picture.",
                    "Improving Intra Coding in H.264\\AVC by Image Epitome.",
                    "Image Quality Assessment Using Spatial Frequency Component.",
                    "Perception Based Down Sampling for Low Bit Rate Image Coding.",
                    "Adaptive DCT-Domain Down-Sampling and Learning Based Mapping for Low Bit-Rate Image Compression.",
                    "A Learning-Based Framework for Low Bit-Rate Image and Video Coding.",
                    "Generalized Relevance Models for Automatic Image Annotation.",
                    "Sorting Holiday Photos without a GPS: What Can We Expect from Contents-Based Geo-spatial Image Tagging?",
                    "Detecting \"In-Play\" Photos in Sports News Photo Database.",
                    "Structural Context for Object Categorization.",
                    "Saliency Regions for 3D Mesh Abstraction.",
                    "Probability Based Page Data Allocation Scheme in Flash Memory.",
                    "Robust Alignment of Presentation Videos with Slides.",
                    "Forecasting KOSPI Using a Neural Network with Weighted Fuzzy Membership Functions and Technical Indicators.",
                    "A Sound-Directed Cameraman Accommodating Unfettered-Speaking in e-Learning Classrooms.",
                    "Determination of Golf Ball Flight Based on Planar Structure Sensor.",
                    "A Novel Macro-Block Group Based AVS Coding Scheme for Many-Core Processor.",
                    "Automatic Detection of Object of Interest and Tracking in Active Video.",
                    "Human Pose Tracking Using Motion-Based Search.",
                    "Robust Object Tracking Using Particle Filters and Multi-region Mean Shift.",
                    "A Quick Filtering for Similarity Queries in Motion Capture Databases.",
                    "Optimization of Multicast Routing Based on a Reliable Effective Framework in Wireless Mesh Networks.",
                    "QoS Aware Layered Multi-Cast with Network Coding in Lossy Networks.",
                    "A Classified P2P Overlay Scheme Using SVC for Video Streaming.",
                    "Broadcast Encryption-Based P2P DRM without Central License Server.",
                    "Rhythm Speech Lyrics Input for MIDI-Based Singing Voice Synthesis.",
                    "Design of Wireless Sensor Networks with Filtering Duplicate Audio Signals.",
                    "A Neural Network Based Framework for Audio Scene Analysis in Audio Sensor Networks.",
                    "A Robust Audio Content Protection Scheme.",
                    "Dense Depth Map Acquisition System for 3DTV Applications Based on Active Stereo and Structured Light Integration.",
                    "Linear Prediction for Interactivity of Multiview Video Application.",
                    "Non-linear Bi-directional Prediction for Depth Coding.",
                    "Spatio-temporally Consistent Multi-view Video Synthesis for Autostereoscopic Displays.",
                    "Virtual View Interpolation and Prediction Structure for Full Parallax Multi-view Video.",
                    "A Gradient-Based Adaptive Interpolation Filter for Multiple View Synthesis.",
                    "Robust Watermarking in DoG Scale Space Using a Multi-scale JND Model.",
                    "Performance Comparison of Digital Watermarking for Scanned Document in RGB and YCbCr Channels.",
                    "Robust Block and Gray-Level Histogram Based Watermarking Scheme.",
                    "Improved Digital Watermarking Using DWT Masking.",
                    "A Reversible Watermarking Scheme for High-Fidelity Applications.",
                    "RST-Invariant Semi-fragile Image Authentication Based on DWT-Coefficient Quantization.",
                    "Multi-modal Correlation Modeling and Ranking for Retrieval.",
                    "Learning to Retrieve Opinions.",
                    "Adaptive Learning for Multimodal Fusion in Video Search.",
                    "Intelligent Music Playlist Recommendation Based on User Daily Behavior and Music Content.",
                    "A Hierarchical Semantics-Matching Approach for Sports Video Annotation.",
                    "Digital Image Splicing Using Edges.",
                    "Improving a Digital Rights Management Scheme for Video Broadcast.",
                    "Palmprint Recognition Based on Subspace Analysis of Gabor Filter Bank.",
                    "Block Based Video Data Hiding Using Repeat Accumulate Codes and Forbidden Zone Data Hiding.",
                    "Protection of DRM Agent Codes.",
                    "News Topic Tracking and Re-ranking with Query Expansion Based on Near-Duplicate Detection.",
                    "An Effective Audio-Visual Information Based Framework for Extracting Highlights in Basketball Games.",
                    "A Novel Retake Detection Using LCS and SIFT Algorithm.",
                    "Video Shrinking by Auditory and Visual Cues.",
                    "DCT-Based Videoprinting on Saliency-Consistent Regions for Detecting Video Copies with Text Insertion.",
                    "Efficient NCC-Based Image Matching Based on Novel Hierarchical Bounds.",
                    "Copy-Move Forgery Detection in Digital Image.",
                    "Extraction of 2D Barcode Using Keypoint Selection and Line Detection.",
                    "Influence of the Smooth Region on the Structural Similarity Index.",
                    "Structure-Preserving Colorization Based on Quaternionic Phase Reconstruction.",
                    "Image Splicing Detection Using Multi-resolution Histogram.",
                    "Toward Quality Improvement in Location Map Free Reversible Watermarking.",
                    "Motion Consideration in H.264/AVC Compressed Video Watermarking.",
                    "Spatio-temporal Just Noticeable Distortion Model Guided Video Watermarking.",
                    "Crowd Flow Segmentation Using a Novel Region Growing Scheme.",
                    "Surveillance Audio Attention Model Based on Spatial Audio Cues.",
                    "A Novel Role-Based Movie Scene Segmentation Method.",
                    "Soccer Video Shot Classification Based on Color Characterization Using Dominant Sets Clustering.",
                    "Weakly-Supervised Violence Detection in Movies with Audio and Video Based Co-training.",
                    "Concept-Specific Visual Vocabulary Construction for Object Categorization.",
                    "Reducing Manual Feedback in a Distributed CBIR System.",
                    "Fast Computation of Similarity Based on Jaccard Coefficient for Composition-Based Image Retrieval.",
                    "Clustering of Retrieved Images by Integrating Perceptual Signal Features within Keyword-Based Image Search Engines.",
                    "A Graph Based Approach to Speaker Retrieval in Talk Show Videos with Transcript-Based Supervision.",
                    "Anti-shaking Algorithm for the Mobile Phone Camera in Dim Light Conditions.",
                    "Universal Capture through Stereographic Multi-perspective Recording and Scene Reconstruction.",
                    "A Class of Non-redundant Directional Filter Banks.",
                    "A Novel Approach for Bayesian Image Denoising Using a SGLI Prior.",
                    "Digital Image Forensics Using EM Algorithm.",
                    "Minimizing Video Data Using Looping Background Detection Technique.",
                    "Extracting Key Frames for Surveillance Video Based on Color Spatial Distribution Histograms.",
                    "Color Space Transformation from RGB to CIELAB Using Neural Networks.",
                    "MPEG-2 to H.264/AVC Intra Frame Transcoding.",
                    "Multichannel Correlation Model for Efficient Decoding in Wyner-Ziv Video Codec.",
                    "Motion Vector Coding Based on Optimal Predictor Selection.",
                    "Block Adaptive Super Resolution Video Coding.",
                    "An Efficient MB Layer Rate Control for H.264/AVC Based on Adaptive QP Decision.",
                    "Reducing the Motion-Compensated Temporal Interpolation Noise of DVC Side Information by ODWT.",
                    "Persian Viseme Classification for Developing Visual Speech Training Application.",
                    "CampusGenie - A Campus-Life Assistant on the Mobile-Phone.",
                    "Context Aware and Content Adaptation of Template Based Multimedia Presentation on Handset Devices.",
                    "Normalized Cut Based Coherence Measure Construction for Scene Segmentation.",
                    "Edge-Based Algorithm for Shadows and Ghosts Removing.",
                    "Immersive Mixed Media Augmented Reality Applications and Technology.",
                    "BTS Information Signs Analysis Based on Image Compression and Classification for Virtual Blind Man Multimedia Guidance System.",
                    "Evaluating a Multimedia-Based Tele-Ophthalmology System.",
                    "Cost-Effective Wiimote-Based Technology-Enhanced Teaching and Learning Platform.",
                    "A Novel Priority Classification Scheme for Packet Video over DiffServ Networks.",
                    "Nodes Placement for Optimizing Coverage of Visual Sensor Networks.",
                    "Opportunistic Contention-Based Feedback Protocol for Downlink OFDMA Systems with Mixed Traffic.",
                    "Audio-Visual Information Clues about Geographic Data on Mobile Interfaces.",
                    "The Methods for Temporal Scalable Extension of AVS Video.",
                    "Enhancing Video Quality over IEEE 802.11e WLAN Using Cross Layer Design.",
                    "Fast and Effective Interpolation Using Median Filter.",
                    "A New Free Reference Image Quality Index Based on Perceptual Blur Estimation.",
                    "Nonlocal Edge-Directed Interpolation.",
                    "Adaptive Block-Size Transform Based Just-Noticeable Difference Profile for Images.",
                    "Exploiting a Growing Self-organizing Map for Adaptive and Efficient Color Quantization.",
                    "Photorealistic Geometry Image Coding Based on Directional Lifting Wavelet Transform.",
                    "Power Scalable Video Encoding Strategy Based on Game Theory.",
                    "An Adaptive Multiple Reference Frame Motion Estimation for H.264 Video Coding.",
                    "Quality Improvement of Compressed Color Images by Model-Based Chrominance Estimation.",
                    "A Novel Multiple-Description Image Coding on Wavelet.",
                    "Encoding Time Reduction for the Enhancement Layer in the H.264/AVC Extension-Spatial SVC.",
                    "Video Quality Comparison of H.264/AVC and AVS in High Fidelity Profiles.",
                    "A Synthetic Region Selection Strategy for Texture Synthesis Based Video Coding.",
                    "Multi-watermarking Scheme for Copyright Protection and Content Authentication of Digital Audio.",
                    "A High Capacity Reversible Watermarking Scheme Based on an Integer Transform.",
                    "Pixel-Wise Based Digital Watermarking in YCbCr Color Space.",
                    "Reversible Watermarking Based on Statistical Quantity Histogram.",
                    "A Novel Differential Energy Watermarking Scheme Based on FSM Model against Video Time-Space Tampering.",
                    "Secure Domain Architecture for Interoperable Content Distribution."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9. PCM 2008",
        "info": "Tainan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2008",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2008, 9th Pacific Rim Conference on Multimedia, Tainan, Taiwan, December 9-13, 2008. Proceedings.",
                "count": 118,
                "papers": [
                    "Accurate Correlation Modeling for Transform-Domain Wyner-Ziv Video Coding.",
                    "High-Quality Multi-Mode Mipmapping Texture Compression with Alpha Map.",
                    "Combined Prediction Mode for AVS.",
                    "A JND Guided Foveation Video Coding.",
                    "Pitch Shifting of Music Based on Adaptive Order Estimation of Linear Predictor.",
                    "An Efficient Approach for Classification of Speech and Music.",
                    "Speech Emotion Classification on a Riemannian Manifold.",
                    "Toward Multi-modal Music Emotion Classification.",
                    "Using GPU-Based Ray Tracing for Real-Time Composition in the Real Scene.",
                    "Vision-Based Hand Gesture Interactions for Large LCD-TV Display Tabletop Systems.",
                    "Fast Content-Based Mining of Web2.0 Videos.",
                    "An Interactive Painting System by Using Enhanced Auto-positioning and Pattern Matching Techniques.",
                    "VLC Table Prediction Algorithm for CAVLC in H.264 Using the Characteristics of Mode Information.",
                    "Perceptually Motivated Adaptive Quantization Algorithm for Region-of-Interest Coding in H.264.",
                    "Deblocking Filter Algorithm with Low Complexity for H.264 Video Coding.",
                    "Two-Dimensional Map Based Fast Mode Decision for H.264/AVC.",
                    "A Novel Hierarchical Mode Selection Algorithm for P-Slices in H.264/AVC.",
                    "Motion Compensated Interpolation as a New Inter Coding Mode for 8x8 Macroblock Partitions in H.264/AVC B Slices.",
                    "On the Server Placement Problem of P2P Live Media Streaming System.",
                    "Guaranteed Bandwidth Requirement Mechanism for Multimedia Multicast Traffic in MANETs.",
                    "Seamless Handoff Support for Real-Time Multimedia Applications in Nested Mobile Networks.",
                    "Service Differentiation in IEEE 802.11e HCF Access Method.",
                    "Throughput Performance of an IP Differentiated-Services Network for Video Communication.",
                    "Skeleton-Based Recognition of Chinese Calligraphic Character Image.",
                    "A Platform Implementation for Real Time Image Processing.",
                    "Subword Lexical Chaining for Automatic Story Segmentation in Chinese Broadcast News.",
                    "Moving Video Object Edge Detection Using Complex Wavelets.",
                    "Detecting Interesting Regions in Photographs - How Metadata Can Help.",
                    "Learning-Based Image Restoration for Compressed Image through Neighboring Embedding.",
                    "Synopsis Alignment: Importing External Text Information for Multi-model Movie Analysis.",
                    "Objects over the World.",
                    "Detect and Recognize Clock Time in Sports Video.",
                    "Detecting Violent Scenes in Movies by Auditory and Visual Cues.",
                    "Personalized MTV Affective Analysis Using User Profile.",
                    "Sequential Simulated Annealing System for Pattern Detection.",
                    "A Collaborative Bayesian Image Annotation Framework.",
                    "A New Hierarchical Particle Filter Based Tracking System for Soccer Game Analysis.",
                    "Automatic Web Page Classification Using Various Features.",
                    "An Efficient Method for Near-Duplicate Video Detection.",
                    "Affective Space Exploration for Impressionism Paintings.",
                    "Collaborative Video Scene Annotation Based on Tag Cloud.",
                    "A Spatial-Temporal-Scale Registration Approach for Video Copy Detection.",
                    "Vision-Based Semi-supervised Homecare with Spatial Constraint.",
                    "Interaction Reproducing Model: A Model for Giving Supports Appropriate to User State.",
                    "Multi-projector Calibration and Alignment Using Flatness Analysis for Irregular-Shape Surfaces.",
                    "Embedded Tags and Visual Querying for Face Photo Retrieval.",
                    "Illumination Invariant Face Detection Using Classifier Fusion.",
                    "Nonlinear Characterisation of Fronto-Normal Gait for Human Recognition.",
                    "Steganalytic Measures for the Steganography Using Pixel-Value Differencing and Modulus Function.",
                    "Document Forgery Detection with SVM Classifier and Image Quality Measures.",
                    "NAL Level Encryption for Scalable Video Coding.",
                    "Robust Digital Image Watermarking Based on Principal Component Analysis and Discrete Wavelet Transform.",
                    "Tone Adjustment of Underexposed Images Using Dynamic Range Remapping.",
                    "A Novel Video Text Detection and Localization Approach.",
                    "The Influence of Regularization Parameter on Error Bound in Super-Resolution Reconstruction.",
                    "Geometrical Compensation Algorithm of Multiview Image for Arc Multi-camera Arrays.",
                    "A Unified Hierarchical Appearance Model for People Re-identification Using Multi-view Vision Sensors.",
                    "An XML-Based Comic Image Compression.",
                    "Compensated Visual Hull with GPU-Based Optimization.",
                    "Video News Retrieval Incorporating Relevant Terms Based on Distribution of Document Frequency.",
                    "ROISeer: Region-Based Image Retrieval by Hierarchical Feature Filtering.",
                    "High-Performance Image Annotation and Retrieval for Weakly Labeled Images Using Latent Space Learning.",
                    "The Many Facets of Progressive Retrieval for CBIR.",
                    "SemanGist: A Local Semantic Image Representation.",
                    "Analysis of Human Actions for Video Indexing.",
                    "AAML Based Avatar Animation with Personalized Expression for Online Chatting System.",
                    "Exploring Music Video Editing Rules with Dual-Wing Harmonium Model.",
                    "Web-Scale Image Annotation.",
                    "Highlight Ranking for Broadcast Tennis Video Based on Multi-modality Analysis and Relevance Feedback.",
                    "Affective Content Detection by Using Timing Features and Fuzzy Clustering.",
                    "Speaker Clustering Aided by Visual Dialogue Analysis.",
                    "Personalized Multimedia Retrieval in CADAL Digital Library.",
                    "Personalized 3D Caricature Generation Based on PCA Subspace.",
                    "Ontology-Based Inter-concept Relation Fusion for Concept Detection.",
                    "Building Video Concordancer Supported English Online Learning Exemplification.",
                    "A Replication-Aware CDN-P2P Architecture Based on Two-Step Server Selection and Network Coding.",
                    "A Study of Listening Diversity and Speaking for English Learning with Mobile Device Supports.",
                    "The Search Engine for Articles and Multimedia in Blogs.",
                    "Reversible Fragile Watermarking for E-Learning Media.",
                    "A Low Bit Rate Audio Bandwidth Extension Method for Mobile Communication.",
                    "A New Side Information Generation Scheme for Distributed Video Coding.",
                    "Robust TCP Vegas in Wireless Networks.",
                    "A Robust Priority Assignment Mechanism for Video Data over Managed IP Networks.",
                    "An Efficient Method to Reduce Peer-to-Peer Streaming Latency.",
                    "LRM: A Local Band Resource Management System.",
                    "Maximum Traffic Routing Problems in Wireless Mesh Networks.",
                    "An Efficient Broadcasting Scheme with Low Buffer Demand for Video-on-Demand Applications.",
                    "Cross-View Object Tracking by Projective Invariants and Feature Matching.",
                    "Metadata Retrieval Using RTCP for Multimedia Streaming.",
                    "ICam: Maximizes Viewers' Attention on Intended Objects.",
                    "Fast Algorithms for Computer Generated Islamic Patterns of 8-ZOHREH and 8-SILI.",
                    "A Scene Representation Application Implementing LASeR Using Object-Based Timing Model.",
                    "High Performance Hardware Architecture of Linear Filters for Intelligent Video Processing.",
                    "Towards a Universal Friendly P2P Media Streaming Application: An Evaluation Framework.",
                    "Search-Based Automatic Web Image Annotation Using Latent Visual and Semantic Analysis.",
                    "An Ultra Large Area Scanner for Ancient Painting and Calligraphy.",
                    "Exploiting Spatial Locality for Objects Layout in Virtual Environments.",
                    "A Parallax-Map-Based DIBR System to Compromise Visual Quality and Depth Resolution.",
                    "Luminance Adjustment in Image and Video.",
                    "Extracting Facial Features and Face Inpainting.",
                    "A Two-Stage Approach to Highlight Extraction in Sports Video by Using AdaBoost and Multi-modal.",
                    "Local Separability Assessment: A Novel Feature Selection Method for Multimedia Applications.",
                    "Extraction of Perceptual Hue Feature Set for Color Image/Video Segmentation.",
                    "A Robust Active Appearance Models Search Algorithm.",
                    "An SVM-Based Soccer Video Shot Classification Scheme Using Projection Histograms.",
                    "A Robust Feature Extraction Algorithm for Audio Fingerprinting.",
                    "A Novel Original Streaming Video Wavelet Domain Watermarking Algorithm in Copyright Protection.",
                    "A No-Reference Blocking Artifacts Metric Using Selective Gradient and Plainness Measures.",
                    "Intelligent Content-Aware Model-Free Low Power Evoked Neural Signal Compression.",
                    "Adaptive Subclass Discriminant Analysis Color Space Learning for Visual Tracking.",
                    "Loitering Detection Using Bayesian Appearance Tracker and List of Visitors.",
                    "Recognizing Human Action from Videos Using Histograms of Visual Words.",
                    "A Flexible Framework for Audio Semantic Content Detection.",
                    "Highly Efficient Face Detection in Color Images.",
                    "A Robust Denoising Filter with Adaptive Edge Preservation.",
                    "A New Face Recognition Approach to Boosting the Worst-Case Performance.",
                    "A Novel Method for Pencil Drawing Generation in Non-Photo-Realistic Rendering.",
                    "Theoretic Analysis of Inter Frame Dependency in Video Coding."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8. PCM 2007",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2007",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2007, 8th Pacific Rim Conference on Multimedia, Hong Kong, China, December 11-14, 2007, Proceedings.",
                "count": 98,
                "papers": [
                    "FADA: An Efficient Dimension Reduction Scheme for Image Classification.",
                    "Using Camera Settings Templates (\"Scene Modes\") for Image Scene Classification of Photographs Taken on Manual/Expert Settings.",
                    "Modeling User Feedback Using a Hierarchical Graphical Model for Interactive Image Retrieval.",
                    "Graph Cuts in Content-Based Image Classification and Retrieval with Relevance Feedback.",
                    "A Novel Active Learning Approach for SVM Based Web Image Retrieval.",
                    "An End-to-End Application System of AVS: AVS-IPTV in China.",
                    "An AVS Based IPTV System Network Trial.",
                    "Usage of MPEG-2 to AVS Transcoder in IPTV System.",
                    "The Audio and Video Synchronization Method Used in AVS System.",
                    "Expression-Invariant Face Recognition with Accurate Optical Flow.",
                    "Real-Time Facial Feature Point Extraction.",
                    "Local Dual Closed Loop Model Based Bayesian Face Tracking.",
                    "View-Independent Human Action Recognition by Action Hypersphere in Nonlinear Subspace.",
                    "Efficient Adaptive Background Subtraction Based on Multi-resolution Background Modelling and Updating.",
                    "Towards a Stringent Bit-Rate Conformance for Frame-Layer Rate Control in H.264/AVC.",
                    "A Quantized Transform-Domain Motion Estimation Technique for H.264 Secondary SP-Frames.",
                    "Efficient Intra Mode Decision Via Statistical Learning.",
                    "Fast Mode Decision Algorithms for Inter/Intra Prediction in H.264 Video Coding.",
                    "A Novel Fast Motion Estimation Algorithm Based on SSIM for H.264 Video Coding.",
                    "Shot Boundary Detection for H.264/AVC Bitstreams with Frames Containing Multiple Types of Slices.",
                    "A Lexicon-Guided LSI Method for Semantic News Video Retrieval.",
                    "3D Tracking of a Soccer Ball Using Two Synchronized Cameras.",
                    "Object Tracking Based on Parzen Particle Filter Using Multiple Cues.",
                    "Random Convolution Ensembles.",
                    "A Hybrid Content-Based Image Authentication Scheme.",
                    "Implementing DRM over Peer-to-Peer Networks with Broadcast Encryption.",
                    "A New Video Encryption Scheme for H.264/AVC.",
                    "Tattoo-ID: Automatic Tattoo Image Retrieval for Suspect and Victim Identification.",
                    "Auto-Annotation of Paintings Using Social Annotations, Domain Ontology and Transductive Inference.",
                    "Value Combination Technique for Image Authentication.",
                    "A Novel Multiple Description Approach to Predictive Video Coding.",
                    "Video Multicast over Wireless Ad Hoc Networks Using Distributed Optimization.",
                    "Acoustic Features for Estimation of Perceptional Similarity.",
                    "Modeling Uncertain Speech Sequences Using Type-2 Fuzzy Hidden Markov Models.",
                    "A New Adaptation Method for Speaker-Model Creation in High-Level Speaker Verification.",
                    "Dynamic Sound Rendering Based on Ray-Caching.",
                    "Spread-Spectrum Watermark by Synthesizing Texture.",
                    "Design of Secure Watermarking Scheme for Watermarking Protocol.",
                    "Digital Watermarking Based on Stochastic Resonance Signal Processor.",
                    "A DWT Blind Image Watermarking Strategy with Secret Sharing.",
                    "Using Enhanced Shape Distributions to Compare CAD Models.",
                    "Wavelet-Based Salient Region Extraction.",
                    "Color-Based Text Extraction for the Image.",
                    "Text Segmentation in Complex Background Based on Color and Scale Information of Character Strokes.",
                    "Design of a Decentralized Video-on-Demand System with Cooperative Clients in Multicast Environment.",
                    "Low Computing Loop Filter Using Coded Block Pattern and Quantization Index for H .264 Video Coding Standard.",
                    "A Low Complexity Block-Based Video De-interlacing Algorithm for SIMD Processors.",
                    "Fast Normalized Cross Correlation Based on Adaptive Multilevel Winner Update.",
                    "Hierarchical Intra-mode Restriction Technique in H.264/MPEG4-AVC Video.",
                    "A Fast Global Motion Estimation Method for Panoramic Video Coding.",
                    "Bisynchronous Approach for Robust Audio Watermarking Technology.",
                    "Design and Implementation of Steganographic Speech Telephone.",
                    "A Low Complexity Recovery Temporal Synchronization Signals Based on Local Variance Statistics.",
                    "An Efficient Video Watermarking Scheme with Luminance Differential DC Coefficient Modification.",
                    "Real-Time Secure Multimedia Communication System Based on Chaos Theory.",
                    "A Remediable Image Authentication Scheme Based on Feature Extraction and Clustered VQ.",
                    "Segmentation of Human Body Parts in Video Frames Based on Intrinsic Distance.",
                    "A Distributed Remote Rendering Method Based on Awareness Model.",
                    "Signer Adaptation Based on Etyma for Large Vocabulary Chinese Sign Language Recognition.",
                    "The Photo News Flusher: A Photo-News Clustering Browser.",
                    "Multimedia-Learning in a Life Science Workflow Environment.",
                    "Visualization of High-Dimensional Biomedical Image Data.",
                    "Moving Object Segmentation Using the Flux Tensor for Biological Video Microscopy.",
                    "Fusion of Multimedia Information in Biomedicine.",
                    "Channel-Aware Adaptive Multi-RPS Scheme for Video Error Resilient Transmission over Wireless OFDM Channel.",
                    "An Improved Marking Mechanism for Real-Time Video over DiffServ Networks.",
                    "Priority Ordering and Packetization for Scalable Video Multicast with Network Coding.",
                    "Error Concealment for INTRA-Frame Losses over Packet Loss Channels.",
                    "Information Delivery Systems for Car Passengers Without Networking Capabilities.",
                    "Predictable Processing of Multimedia Content, Using MPEG-21 Digital Item Processing.",
                    "A Novel Pipeline Design for H.264 CABAC Decoding.",
                    "Efficient Segment Based Streaming Media Transcoding Proxy for Various Types of Mobile Devices.",
                    "Distributed Streaming for Video on Demand.",
                    "Context Aware Body Area Networks for Telemedicine.",
                    "M-LTW: A Fast and Efficient Non-embedded Intra Video Codec.",
                    "Intra Frame Encoding Using Programmable Graphics Hardware.",
                    "Error Concealment Techniques for Multi-view Video Sequences.",
                    "Consistent-Quality Distributed Video Coding Framework.",
                    "Laplacian Distortion Model (LDM) for Rate Control in Video Coding.",
                    "Acquiring Critical Light Points for Illumination Subspaces of Face Images by Affinity Propagation Clustering.",
                    "Random Subspace Two-Dimensional PCA for Face Recognition.",
                    "Robust Speaking Face Identification for Video Analysis.",
                    "Incremental AAM Using Synthesized Illumination Images.",
                    "Content-Based 3D Model Retrieval Based on the Spatial Geometric Descriptor.",
                    "A Practical Server-Side Transmission Control Method for Multi-channel DTV Streaming System.",
                    "Using Irradiance Environment Map on GPU for Real-Time Composition.",
                    "Ranking Using Multi-features in Blog Search.",
                    "Design and Analysis of a Watermarking System for Care Labels.",
                    "Stroke Correspondence Based on Graph Matching for Detecting Stroke Production Errors in Chinese Character Handwriting.",
                    "Multi-modal Multi-label Semantic Indexing of Images Based on Hybrid Ensemble Learning.",
                    "Content Based Image Hashing Via Wavelet and Radon Transform.",
                    "Effective Corner Matching for Transformed Image Identification.",
                    "Automatic Panel Extraction of Color Comic Images.",
                    "Image Quality Assessment Based on Energy of Structural Distortion.",
                    "SAR Speckle Mitigation by Fusing Statistical Information from Spatial and Wavelet Domains.",
                    "Encoding Independent Sources in Spatially Squeezed Surround Audio Coding.",
                    "Efficient Storage and Progressive Rendering of Multi-resolution Mesh.",
                    "An Improved Three-Step Hierarchical Motion Estimation Algorithm and Its Cost-Effective VLSI Architecture."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7. PCM 2006",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2006",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2006, 7th Pacific Rim Conference on Multimedia, Hangzhou, China, November 2-4, 2006, Proceedings.",
                "count": 116,
                "papers": [
                    "Expressive Speech Recognition and Synthesis as Enabling Technologies for Affective Robot-Child Communication.",
                    "Embodied Conversational Agents: Computing and Rendering Realistic Gaze Patterns.",
                    "DBN Based Models for Audio-Visual Speech Analysis and Recognition.",
                    "An Extensive Method to Detect the Image Digital Watermarking Based on the Known Template.",
                    "Fast Mode Decision Algorithm in H.263+/H.264 Intra Transcoder.",
                    "Binary Erasure Codes for Packet Transmission Subject to Correlated Erasures.",
                    "Image Desynchronization for Secure Collusion-Resilient Fingerprint in Compression Domain.",
                    "A Format-Compliant Encryption Framework for JPEG2000 Image Code-Streams in Broadcasting Applications.",
                    "Euclidean Distance Transform of Digital Images in Arbitrary Dimensions.",
                    "JPEG2000 Steganography Possibly Secure Against Histogram-Based Attack.",
                    "Perceptual Depth Estimation from a Single 2D Image Based on Visual Perception Theory.",
                    "A System for Generating Personalized Virtual News.",
                    "Image Fingerprinting Scheme for Print-and-Capture Model.",
                    "16×16 Integer Cosine Transform for HD Video Coding.",
                    "Heegard-Berger Video Coding Using LMMSE Estimator.",
                    "Real-Time BSD-Driven Adaptation Along the Temporal Axis of H.264/AVC Bitstreams.",
                    "Optimal Image Watermark Decoding.",
                    "Diagonal Discrete Cosine Transforms for Image Coding.",
                    "Synthesizing Variational Direction and Scale Texture on Planar Region.",
                    "Fast Content-Based Image Retrieval Based on Equal-Average K-Nearest-Neighbor Search Schemes.",
                    "Characterizing User Behavior to Improve Quality of Streaming Service over P2P Networks.",
                    "Interacting Activity Recognition Using Hierarchical Durational-State Dynamic Bayesian Network.",
                    "Improving the Image Retrieval Results Via Topic Coverage Graph.",
                    "Relevance Feedback for Sketch Retrieval Based on Linear Programming Classification.",
                    "Hierarchical Motion-Compensated Frame Interpolation Based on the Pyramid Structure.",
                    "Varying Microphone Patterns for Meeting Speech Segmentation Using Spatial Audio Cues.",
                    "Region-Based Sub-pixel Motion Estimation from Noisy, Blurred, and Down-Sampled Sequences.",
                    "Differential Operation Based Palmprint Authentication for Multimedia Security.",
                    "A Broadcast Model for Web Image Annotation.",
                    "An Approach to the Compression of Residual Data with GPCA in Video Coding.",
                    "A Robust Approach for Object Recognition.",
                    "A Novel Method for Spoken Text Feature Extraction in Semantic Video Retrieval.",
                    "A Semantic Image Category for Structuring TV Broadcast Video Streams.",
                    "Markov Chain Monte Carlo Super-Resolution Image Reconstruction with Simultaneous Adaptation of the Prior Image Model.",
                    "Text Detection in Images Using Texture Feature from Strokes.",
                    "Robust Mandarin Speech Recognition for Car Navigation Interface.",
                    "GKDA: A Group-Based Key Distribution Algorithm for WiMAX MBS Security.",
                    "A Watermarking Algorithm for JPEG File.",
                    "SNR Scalability in H.264/AVC Using Data Partitioning.",
                    "A Real-Time XML-Based Adaptation System for Scalable Video Formats.",
                    "Generic, Scalable Multimedia Streaming and Delivery with Example Application for H.264/AVC.",
                    "Shape-Based Image Retrieval in Botanical Collections.",
                    "Macroblock Mode Decision Scheme for Fast Encoding in H.264/AVC.",
                    "A Mathematical Model for Interaction Analysis Between Multiview Video System and User.",
                    "Motion Composition of 3D Video.",
                    "EKM: An Efficient Key Management Scheme for Large-Scale Peer-to-Peer Media Streaming.",
                    "Using Earth Mover's Distance for Audio Clip Retrieval.",
                    "Streaming-Mode MB-Based Integral Image Techniques for Fast Multi-view Video Illumination Compensation.",
                    "A Motion Vector Predictor Architecture for AVS and MPEG-2 HDTV Decoder.",
                    "Inter-camera Coding of Multi-view Video Using Layered Depth Image Representation.",
                    "Optimal Priority Packetization with Multi-layer UEP for Video Streaming over Wireless Network.",
                    "A Multi-channel MAC Protocol with Dynamic Channel Allocation in CDMA Ad Hoc Networks.",
                    "Fuzzy Particle Swarm Optimization Clustering and Its Application to Image Clustering.",
                    "A New Fast Motion Estimation for H.264 Based on Motion Continuity Hypothesis.",
                    "Statistical Robustness in Multiplicative Watermark Detection.",
                    "Adaptive Visual Regions Categorization with Sets of Points of Interest.",
                    "A Publishing Framework for Digitally Augmented Paper Documents: Towards Cross-Media Information Integration.",
                    "Web-Based Semantic Analysis of Chinese News Video.",
                    "A Quality-Controllable Encryption for H.264/AVC Video Coding.",
                    "Texture Synthesis Based on Minimum Energy Cut and Its Applications.",
                    "Unifying Keywords and Visual Features Within One-Step Search for Web Image Retrieval.",
                    "Dynamic Bandwidth Allocation for Stored Video Under Renegotiation Frequency Constraint.",
                    "Online Selection of Discriminative Features Using Bayes Error Rate for Visual Tracking.",
                    "Interactive Knowledge Integration in 3D Cloth Animation with Intelligent Learning System.",
                    "Multi-view Video Coding with Flexible View-Temporal Prediction Structure for Fast Random Access.",
                    "Squeezing the Auditory Space: A New Approach to Multi-channel Audio Coding.",
                    "Video Coding by Texture Analysis and Synthesis Using Graph Cut.",
                    "Multiple Description Coding Using Adaptive Error Recovery for Real-Time Video Transmission.",
                    "An Improved Motion Vector Prediction Scheme for Video Coding.",
                    "Classifying Motion Time Series Using Neural Networks.",
                    "Estimating Intervals of Interest During TV Viewing for Automatic Personal Preference Acquisition.",
                    "Image Annotations Based on Semi-supervised Clustering with Semantic Soft Constraints.",
                    "Photo Retrieval from Personal Memories Using Generic Concepts.",
                    "PanoWalk: A Remote Image-Based Rendering System for Mobile Devices.",
                    "A High Quality Robust Watermarking Scheme.",
                    "An Association Rule Mining Approach for Satellite Cloud Images and Rainfall.",
                    "AVAS: An Audio-Visual Attendance System.",
                    "Improved POCS-Based Deblocking Technique Using Wavelet Transform in Block Coded Image.",
                    "Sketch Case Based Spatial Topological Data Retrieval.",
                    "Providing Consistent Service for Structured P2P Streaming System.",
                    "Adaptive Search Range Scaling for B Pictures Coding.",
                    "Video QoS Monitoring and Control Framework over Mobile and IP Networks.",
                    "Extracting Moving / Static Objects of Interest in Video.",
                    "Building a Personalized Music Emotion Prediction System.",
                    "Video Segmentation Using Joint Space-Time-Range Adaptive Mean Shift.",
                    "EagleRank: A Novel Ranking Model for Web Image Search Engine.",
                    "Color Image Enhancement Using the Laplacian Pyramid.",
                    "3D Mesh Construction from Depth Images with Occlusion.",
                    "An Eigenbackground Subtraction Method Using Recursive Error Compensation.",
                    "Attention Information Based Spatial Adaptation Framework for Browsing Videos Via Mobile Devices.",
                    "Style Strokes Extraction Based on Color and Shape Information.",
                    "Requantization Transcoding of H.264/AVC Bitstreams for Intra 4×4 Prediction Modes.",
                    "Prediction Algorithms in Large Scale VOD Services on Grid Infrastructure.",
                    "A Hierarchical Framework for Fast Macroblock Prediction Mode Decision in H.264.",
                    "Compact Representation for Large-Scale Clustering and Similarity Search.",
                    "Robust Recognition of Noisy and Partially Occluded Faces Using Iteratively Reweighted Fitting of Eigenfaces.",
                    "Pitching Shot Detection Based on Multiple Feature Analysis and Fuzzy Classification.",
                    "Color Changing and Fading Simulation for Frescoes Based on Empirical Knowledge from Artists.",
                    "A Novel Spatial-Temporal Position Prediction Motion-Compensated Interpolation for Frame Rate Up-Conversion.",
                    "Web Image Clustering with Reduced Keywords and Weighted Bipartite Spectral Graph Partitioning.",
                    "An Architecture to Connect Disjoint Multimedia Networks Based on Node's Capacity.",
                    "Quantitative Measure of Inlier Distributions and Contour Matching for Omnidirectional Camera Calibration.",
                    "High-Speed All-in-Focus Image Reconstruction by Merging Multiple Differently Focused Images.",
                    "A Real-Time Video Deinterlacing Scheme for MPEG-2 to AVS Transcoding.",
                    "Persian Text Watermarking.",
                    "Three Dimensional Reconstruction of Structured Scenes Based on Vanishing Points.",
                    "Parallel Processing for Reducing the Bottleneck in Realtime Graphics Rendering.",
                    "Distributed Data Visualization Tools for Multidisciplinary Design Optimization of Aero-crafts.",
                    "An Efficient Clustering and Indexing Approach over Large Video Sequences.",
                    "An Initial Study on Progressive Filtering Based on Dynamic Programming for Query-by-Singing/Humming.",
                    "Measuring Multi-modality Similarities Via Subspace Learning for Cross-Media Retrieval.",
                    "SNR-Based Bit Allocation in Video Quality Smoothing.",
                    "Shadow Removal in Sole Outdoor Image.",
                    "3D Head Model Classification Using KCDA.",
                    "Framework for Pervasive Web Content Delivery.",
                    "Region-Based Semantic Similarity Propagation for Image Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6. PCM 2005",
        "info": "Jeju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2005-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2005, 6th Pacific-Rim Conference on Multimedia, Jeju Island, Korea, November 13-16, 2005, Proceedings, Part I.",
                "count": 88,
                "papers": [
                    "New Panoramic Image Generation Based on Modeling of Vignetting and Illumination Effects.",
                    "Virtual Object Placement in Video for Augmented Reality.",
                    "Realtime Control for Motion Creation of 3D Avatars.",
                    "Environment Matting of Transparent Objects Based on Frequency-Domain Analysis.",
                    "Adaptation of Quadric Metric Simplification to MPEG-4 Animated Object.",
                    "Progressive Lower Trees of Wavelet Coefficients: Efficient Spatial and SNR Scalable Coding of 3D Models.",
                    "An Adaptive Quantization Scheme for Efficient Texture Coordinate Compression in MPEG 3DMC.",
                    "Special Effects: Efficient and Scalable Encoding of the 3D Metamorphosis Animation with .",
                    "Hardware Accelerated Image-Based Rendering with Compressed Surface Light Fields and Multiresolution Geometry.",
                    "Adaptive Vertex Chasing for the Lossless Geometry Coding of 3D Meshes.",
                    "Analysis and Performance Evaluation of Flexible Marcoblock Ordering for H.264 Video Transmission over Packet-Lossy Networks.",
                    "Motion Perception Based Adaptive Quantization for Video Coding.",
                    "Hybrid Deblocking Algorithm for Block-Based Low Bit Rate Coded Images.",
                    "A Cross-Resolution Leaky Prediction Scheme for In-Band Wavelet Video Coding with Spatial Scalability.",
                    "Efficient Intra Prediction Mode Decision for H.264 Video.",
                    "Optimum Quantization Parameters for Mode Decision in Scalable Extension of H.264/AVC Video Codec.",
                    "A Metadata Model for Event Notification on Interactive Broadcasting Service.",
                    "Target Advertisement Service Using TV Viewers' Profile Inference.",
                    "Personalized TV Services and T-Learning Based on TV-Anytime Metadata.",
                    "Metadata Generation and Distribution for Live Programs on Broadcasting-Telecommunication Linkage Services.",
                    "Data Broadcast Metadata Based on PMCP for Open Interface to a DTV Data Server.",
                    "Super-resolution Sharpening-Demosaicking with Spatially Adaptive Total-Variation Image Regularization.",
                    "Gradient Based Image Completion by Solving Poisson Equation.",
                    "Predictive Directional Rectangular Zonal Search for Digital Multimedia Processor.",
                    "Motion Field Refinement and Region-Based Motion Segmentation.",
                    "Motion Adaptive De-interlacing with Horizontal and Vertical Motions Detection.",
                    "All-in-Focus Image Generation by Merging Multiple Differently Focused Images in Three-Dimensional Frequency Domain.",
                    "Free-Hand Stroke Based NURBS Surface for Sketching and Deforming 3D Contents.",
                    "Redeeming Valleys and Ridges for Line-Drawing.",
                    "Interactive Rembrandt Lighting Design.",
                    "Image-Based Generation of Facial Skin Texture with Make-Up.",
                    "Responsive Multimedia System for Virtual Storytelling.",
                    "Communication and Control of a Home Robot Using a Mobile Phone.",
                    "Real-Time Stereo Using Foreground Segmentation and Hierarchical Disparity Estimation.",
                    "Multi-view Video Coding Using Illumination Change-Adaptive Motion Estimation and 2-D Direct Mode.",
                    "Fast Ray-Space Interpolation with Depth Discontinuity Preserving for Free Viewpoint Video System.",
                    "Haptic Interaction with Depth Video Media.",
                    "A Framework for Multi-view Video Coding Using Layered Depth Images.",
                    "A Proxy-Based Distributed Approach for Reliable Content Sharing Among UPnP-Enabled Home Networks.",
                    "Adaptive Distributed Video Coding for Video Applications in Ad-Hoc Networks.",
                    "High Speed JPEG Coder Based on Modularized and Pipelined Architecture with Distributed Control.",
                    "Efficient Distribution of Feature Parameters for Speech Recognition in Network Environments.",
                    "Magnitude-Sign Split Quantization for Bandwidth Scalable Wideband Speech Codec.",
                    "Self-timed Interconnect with Layered Interface Based on Distributed and Modularized Control for Multimedia SoCs.",
                    "Enhanced Downhill Simplex Search for Fast Video Motion Estimation.",
                    "Camera Motion Detection in Video Sequences Using Motion Cooccurrences.",
                    "A Hybrid Motion Compensated 3-D Video Coding System for Blocking Artifacts Reduction.",
                    "Fast Panoramic Image Generation Method Using Morphological Corner Detection.",
                    "Generation of 3D Building Model Using 3D Line Detection Scheme Based on Line Fitting of Elevation Data.",
                    "Segmentation of the Liver Using the Deformable Contour Method on CT Images.",
                    "Radial Projection: A Feature Extraction Method for Topographical Shapes.",
                    "A Robust Text Segmentation Approach in Complex Background Based on Multiple Constraints.",
                    "Specularity-Free Projection on Nonplanar Surface.",
                    "Salient Feature Selection for Visual Concept Learning.",
                    "Contourlet Image Coding Based on Adjusted SPIHT.",
                    "Using Bitstream Structure Descriptions for the Exploitation of Multi-layered Temporal Scalability in H.264/AVC's Base Specification.",
                    "Efficient Control for the Distortion Incurred by Dropping DCT Coefficients in Compressed Domain.",
                    "Kalman Filter Based Error Resilience for H.264 Motion Vector Recovery.",
                    "High Efficient Context-Based Variable Length Coding with Parallel Orientation.",
                    "Texture Coordinate Compression for 3-D Mesh Models Using Texture Image Rearrangement.",
                    "Classification of Audio Signals Using Gradient-Based Fuzzy c-Means Algorithm with Divergence Measure.",
                    "Variable Bit Quantization for Virtual Source Location Information in Spatial Audio Coding.",
                    "The Realtime Method Based on Audio Scenegraph for 3D Sound Rendering.",
                    "Dual-Domain Quantization for Transform Coding of Speech and Audio Signals.",
                    "A Multi-channel Audio Compression Method with Virtual Source Location Information.",
                    "A System for Detecting and Tracking Internet News Event.",
                    "A Video Summarization Method for Basketball Game.",
                    "Improvement of Commercial Boundary Detection Using Audiovisual Features.",
                    "Automatic Dissolve Detection Scheme Based on Visual Rhythm Spectrum.",
                    "A Study on the Relation Between the Frame Pruning and the Robust Speaker Identification with Multivariate t-Distribution.",
                    "Auto-summarization of Multimedia Meeting Records Based on Accessing Log.",
                    "Towards a High-Level Audio Framework for Video Retrieval Combining Conceptual Descriptions and Fully-Automated Processes.",
                    "A New Concept of Security Camera Monitoring with Privacy Protection by Masking Moving Objects.",
                    "Feature Fusion-Based Multiple People Tracking.",
                    "Extracting the Movement of Lip and Tongue During Articulation.",
                    "A Scheme for Ball Detection and Tracking in Broadcast Soccer Video.",
                    "A Shape-Based Retrieval Scheme for Leaf Images.",
                    "Lung Detection by Using Geodesic Active Contour Model Based on Characteristics of Lung Parenchyma Region.",
                    "Improved Automatic Liver Segmentation of a Contrast Enhanced CT Image.",
                    "Automated Detection of Tumors in Mammograms Using Two Segments for Classification.",
                    "Registration of Brain MR Images Using Feature Information of Structural Elements.",
                    "Cyber Surgery: Parameterized Mesh for Multi-modal Surgery Simulation.",
                    "Image Retrieval Based on Co-occurrence Matrix Using Block Classification Characteristics.",
                    "Automatic Generation of the Initial Query Set for CBIR on the Mobile Web.",
                    "Classification of MPEG Video Content Using Divergence Measure with Data Covariance.",
                    "Image Retrieval Using Spatial Color and Edge Detection.",
                    "Understanding Multimedia Document Semantics for Cross-Media Retrieval.",
                    "Multimedia Retrieval from a Large Number of Sources in a Ubiquitous Environment."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2005-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2005, 6th Pacific-Rim Conference on Multimedia, Jeju Island, Korea, November 13-16, 2005, Proceedings, Part II.",
                "count": 93,
                "papers": [
                    "Efficient Cache Management for QoS Adaptive Multimedia Streaming Services.",
                    "An Effective Failure Recovery Mechanism with Pipeline Computing in Clustered-Based VOD Servers.",
                    "Dynamic and Scalable Caching Algorithm of Proxy Server for Multiple Videos.",
                    "Dynamic Adaptive Architecture for Self-adaptation in VideoConferencing System.",
                    "Scalable and Reliable Overlay Multicast Network for Live Media Streaming.",
                    "Apollon: File System Level Support for QoS Augmented I/O.",
                    "Seamless Video Streaming for Video on Demand Services in Vertical Handoff.",
                    "MPEG-4 FGS Video Traffic Model and Its Application in Simulations for Layered Video Multicast.",
                    "Dynamic Voltage Scaling for Real-Time Scheduling of Multimedia Tasks.",
                    "Class Renegotiating Mechanism for Guaranteed End-to-End QoS over DiffServ Networks.",
                    "Secure and Efficient ID-Based Group Key Agreement Fitted for Pay-TV.",
                    "A Method of Generating Table of Contents for Educational Videos.",
                    "Study of Inter-effect and Behavior of Multimedia Traffic in a QoS-Enabled Communication Network.",
                    "Broadcast Synchronizing System Using Audio Watermark.",
                    "Realistic Broadcasting Using Multi-modal Immersive Media.",
                    "Client System for Realistic Broadcasting: A First Prototype.",
                    "Proposal of Cooperative Transmission for the Uplink of TDD-CDMA Systems.",
                    "A Novel Scheduler for 1xEV-DO Type System Supporting Diverse Multimedia Traffics.",
                    "Proposal of Space-Time Block Coded Cooperative Wireless Transmission in Rayleigh Fading Channels.",
                    "Downlink Packet Scheduling Based on Channel Condition for Multimedia Services of Mobile Users in OFDMA-TDD.",
                    "An Efficient Channel Tracking Method for OFDM Based High Mobility Wireless Multimedia System.",
                    "A Novel Key Management and Distribution Solution for Secure Video Multicast.",
                    "A Robust Method for Data Hiding in Color Images.",
                    "A Color Image Encryption Algorithm Based on Magic Cube Transformation and Modular Arithmetic Operation.",
                    "Selective Video Encryption Based on Advanced Video Coding.",
                    "Key Frame Extraction Based on Shot Coverage and Distortion.",
                    "Secret Message Location Steganalysis Based on Local Coherences of Hue.",
                    "Feature-Based Image Watermarking Method Using Scale-Invariant Keypoints.",
                    "Watermarking NURBS Surfaces.",
                    "Digital Watermarking Based on Three-Dimensional Wavelet Transform for Video Data.",
                    "Using Space-Time Coding for Watermarking of Three-Dimensional Triangle Mesh.",
                    "Perceptually Tuned Auto-correlation Based Video Watermarking Using Independent Component Analysis.",
                    "Invertible Watermarking Scheme for Authentication and Integrity.",
                    "Adaptive Congestion Control Scheme Based on DCCP for Wireless/Mobile Access Networks.",
                    "SARS : A Linear Source Model Based Adaptive Rate-Control Scheme for TCP-Friendly Real-Time MPEG-4 Video Streaming.",
                    "Evaluation of a Crossover Router Based QoS Mechanism in Fast Mobile IPv6 Networks.",
                    "Adaptive and QoS Downlink Multimedia Packet Scheduling for Broadband Wireless Systems.",
                    "A Practical Multicast Transmission Control Method for Multi-channel HDTV IP Broadcasting System.",
                    "MEET : Multicast Debugging Toolkit with End-to-End Packet Trace.",
                    "Traffic Management for Video Streaming Service over Diff-Serv.",
                    "Scalable and Adaptive QoS Mapping Control Framework for Packet Video Delivery.",
                    "A Frame-Layer Rate Control Algorithm for H.264 Using Rate-Dependent Mode Selection.",
                    "TCP-Friendly Congestion Control over Heterogeneous Wired/Wireless IP Network.",
                    "A Balanced Revenue-Based Resource Sharing Scheme for Advance and Immediate Reservations.",
                    "Sequential Mesh Coding Using Wave Partitioning.",
                    "Dimension-Reduction Technique for MPEG-7 Audio Descriptors.",
                    "Design of an Asynchronous Switch Based on Butterfly Fat-Tree for Network-on-Chip Applications.",
                    "Adaptive Deinterlacing for Real-Time Applications.",
                    "Adaptive MAP High-Resolution Image Reconstruction Algorithm Using Local Statistics.",
                    "Energy-Efficient Cooperative Image Processing in Video Sensor Networks.",
                    "Mathematical PSNR Prediction Model Between Compressed Normal Maps and Rendered 3D Images.",
                    "Fast Adaptive Skin Detection in JPEG Images.",
                    "Effective Blocking Artifact Reduction Using Classification of Block Boundary Area.",
                    "Adaptive Rate-Distortion Optimization for H.264.",
                    "Directional Lifting-Based Wavelet Transform for Multiple Description Image Coding with Quincunx Segmentation.",
                    "Non-periodic Frame Refreshment Based on the Uncertainty Models of the Reference Frames.",
                    "Color Quantization of Digital Images.",
                    "Directional Feature Detection and Correspondence.",
                    "An Improvement of Dead Reckoning Algorithm Using Kalman Filter for Minimizing Network Traffic of 3D On-Line Games.",
                    "IRED Gun: Infrared LED Tracking System for Game Interface.",
                    "On the Implementation of Gentle Phone's Function Based on PSOLA Algorithm.",
                    "A Novel Blind Equalizer Based on Dual-Mode MCMA and DD Algorithm.",
                    "Robust Secret Key Based Authentication Scheme Using Smart Cards.",
                    "A Dynamically Configurable Multimedia Middleware.",
                    "Adaptive VoIP Smoothing of Pareto Traffic Based on Optimal E-Model Quality.",
                    "Indoor Scene Reconstruction Using a Projection-Based Registration Technique of Multi-view Depth Images.",
                    "Image-Based Relighting in Dynamic Scenes.",
                    "Stippling Technique Based on Color Analysis.",
                    "Photometry Data Coding for Three-Dimensional Mesh Models Using Connectivity and Geometry Information.",
                    "Adaptation of MPEG-4 BIFS Scenes into MPEG-4 LASeR Scenes in MPEG-21 DIA Framework.",
                    "Performance Evaluation of H.264 Mapping Strategies over IEEE 802.11e WLAN for Robust Video Streaming.",
                    "Reducing Spatial Resolution for MPEG-2 to H.264/AVC Transcoding.",
                    "Low-Bitrate Video Quality Enhancement by Frame Rate Up-Conversion and Adaptive Frame Encoding.",
                    "Face Recognition Using Neighborhood Preserving Projections.",
                    "An Efficient Virtual Aesthetic Surgery Model Based on 2D Color Photograph.",
                    "Automatic Photo Indexing Based on Person Identity.",
                    "Bayesian Colorization Using MRF Color Image Modeling.",
                    "An Efficient Player for MPEG-4 Contents on a Mobile Device.",
                    "Conversion Mechanism of XMT into SMIL in MPEG-4 System.",
                    "Two-Channel-Based Noise Reduction in a Complex Spectrum Plane for Hands-Free Communication System.",
                    "An Efficient Classifier Fusion for Face Recognition Including Varying Illumination.",
                    "Illumination Invariant Feature Selection for Face Recognition.",
                    "Specular Removal Using CL-Projection.",
                    "Oriental Color-Ink Model Based Painterly Rendering for Realtime Application.",
                    "An Adjusted-Q Digital Graphic Equalizer Employing Opposite Filters.",
                    "Interactive Transfer of Human Facial Color.",
                    "Panoramic Mesh Model Generation from Multiple Range Data for Indoor Scene Reconstruction.",
                    "A Novel Low Latency Packet Scheduling Scheme for Broadband Networks.",
                    "Creative Cartoon Face Synthesis System for Mobile Entertainment.",
                    "Concept and Construction of the Caddy Robot.",
                    "Rapid Algorithms for MPEG-2 to H.264 Transcoding.",
                    "A New Method for Controlling Smoke's Shape.",
                    "A Scene Change Detection in H.264/AVC Compression Domain."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "5. PCM 2004",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2004-1",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2004, 5th Pacific Rim Conference on Multimedia, Tokyo, Japan, November 30 - December 3, 2004, Proceedings, Part I.",
                "count": 80,
                "papers": [
                    "Categorizing Traditional Chinese Painting Images.",
                    "A Knowledge-Driven Approach for Korean Traditional Costume (Hanbok) Modeling.",
                    "Retrieval of Chinese Calligraphic Character Image.",
                    "Random Channel Allocation Scheme in HIPERLAN/2.",
                    "A Two-Stage Queuing Approach to Support Real-Time QoS Guarantee for Multimedia Services in TDMA Wireless Networks.",
                    "Performance Evaluation of Adaptive Rate Control (ARC) for Multimedia Traffic.",
                    "A Tennis Video Indexing Approach Through Pattern Discovery in Interactive Process.",
                    "Online Play Segmentation for Broadcasted American Football TV Programs.",
                    "Semantic Analysis of Basketball Video Using Motion Information.",
                    "Reach-Through-the-Screen: A New Metaphor for Remote Collaboration.",
                    "Working Documents.",
                    "Immersive Meeting Point: An Approach Towards Immersive Media Portals.",
                    "EnhancedTable: Supporting a Small Meeting in Ubiquitous and Augmented Environment.",
                    "Remote Collaboration on Physical Whiteboards.",
                    "Aggressive Traffic Smoothing for Delivery of Online Multimedia.",
                    "Distributed Video Streaming Using Multicast (DVSM).",
                    "Centralized Peer-to-Peer Streaming with PFGS Video Codec.",
                    "Buffer Level Estimation for Seamless Media Streaming in Mobile IPv6 Networks.",
                    "Dynamic Walks for Searching Streaming Media in Peer-to-Peer Networks.",
                    "An Image Retrieval Scheme Using Multi-instance and Pseudo Image Concepts.",
                    "Representation of Clipart Image Using Shape and Color with Spatial Relationship.",
                    "Automatic Categorization for WWW Images with Applications for Retrieval Navigation.",
                    "Region-Based Image Retrieval with Scale and Orientation Invariant Features.",
                    "SOM-Based Sample Learning Algorithm for Relevance Feedback in CBIR.",
                    "Classification of Digital Photos Taken by Photographers or Home Users.",
                    "Background Modeling Using Phase Space for Day and Night Video Surveillance Systems.",
                    "Sequential Robust Direct Motion Estimation with Equal Projective Basis.",
                    "Generation of 3D Urban Model Using Cooperative Hybrid Stereo Matching.",
                    "Segmentation of Interest Objects Using the Hierarchical Mesh Structure.",
                    "A Rapid Scheme for Slow-Motion Replay Segment Detection.",
                    "Recognition of Very Low-Resolution Characters from Motion Images Captured by a Portable Digital Camera.",
                    "An Effective Anchorperson Shot Extraction Method Robust to False Alarms.",
                    "A Region Based Image Matching Method with Regularized SAR Model.",
                    "Shot Classification and Scene Segmentation Based on MPEG Compressed Movie Analysis.",
                    "Moving Object Segmentation: A Block-Based Moving Region Detection Approach.",
                    "A Multi-view Camera Tracking for Modeling of Indoor Environment.",
                    "Image Registration Using Triangular Mesh.",
                    "Online Learning Objectionable Image Filter Based on SVM.",
                    "Motion Objects Segmentation Using a New Level Set Based Method.",
                    "3-D Shape Analysis of Anatomical Structures Based on an Interactive Multiresolution Approach.",
                    "Integrating Color, Texture, and Spatial Features for Image Interpretation.",
                    "Automatic Video Genre Detection for Content-Based Authoring.",
                    "Face Appeal Model Based on Statistics.",
                    "A Novel Gabor-LDA Based Face Recognition Method.",
                    "Gesture-Based User Interfaces for Handheld Devices Using Accelerometer.",
                    "Face and Gesture Recognition Using Subspace Method for Human-Robot Interaction.",
                    "Spatial Histogram Features for Face Detection in Color Images.",
                    "Correlation Filters for Facial Recognition Login Access Control.",
                    "Easy and Convincing Ear Modeling for Virtual Human.",
                    "A Polyhedral Object Recognition Algorithm for Augmented Reality.",
                    "Spectral Coding of Three-Dimensional Mesh Geometry Information Using Dual Graph.",
                    "Real-Time Free-Viewpoint Video Generation Using Multiple Cameras and a PC-Cluster.",
                    "Framework for Smooth Optical Interaction Using Adaptive Subdivision in Virtual Production.",
                    "Projection-Based Registration Using Color and Texture Information for Virtual Environment Generation.",
                    "Enhanced Synergistic Image Creator: An NPR Method with Natural Curly Brushstrokes.",
                    "An XMT Authoring System Supporting Various Presentation Environments.",
                    "An Adaptive Scene Compositor Model in MPEG-4 Player for Mobile Device.",
                    "JPEG2000 Image Adaptation for MPEG-21 Digital Items.",
                    "An Annotation Method and Application for Video Contents Based on a Semantic Graph.",
                    "An Annotated-Objects Assist Method for Extraction of Ordinary-Objects in a Video Content Generation Support System.",
                    "Free-Viewpoint TV (FTV) System.",
                    "In-Car Speech Recognition Using Distributed Multiple Microphones.",
                    "Development of Advanced Image Processing Technology and Its Application to Computer Assisted Diagnosis and Surgery.",
                    "Discussion Mining: Annotation-Based Knowledge Discovery from Real World Activities.",
                    "Determining Correspondences Between Sensory and Motor Signals.",
                    "Architecture of Authentication Mechanism for Emerging T-commerce Environments.",
                    "Threat Description for Developing Security Countermeasure.",
                    "RPS: An Extension of Reference Monitor to Prevent Race-Attacks.",
                    "SITIS: Scalable Intrusion Tolerance Middleware for Internet Service Survivability.",
                    "On Minimizing Distortion in Secure Data-Hiding for Binary Images.",
                    "Software Design Method Enhanced by Appended Security Requirements.",
                    "On the Disk Layout for Periodical Video Broadcast Services.",
                    "Paged Segment Striping Scheme for the Dynamic Scheduling of Continuous Media Servers.",
                    "A Heuristic Packet Scheduling Algorithm for Media Streaming with Server Diversity.",
                    "Proxy Caching Scheme Based on the Characteristics of Streaming Media Contents on the Internet.",
                    "A Distributed VOD Server Based on VIA and Interval Cache.",
                    "Clustering of Video Packets Using Interactive Refinement by Relevance Feedback.",
                    "Semantic Video Indexing and Summarization Using Subtitles.",
                    "Audio Visual Cues for Video Indexing and Retrieval.",
                    "Key Image Extraction from a News Video Archive for Visualizing Its Semantic Structure."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2004-2",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2004, 5th Pacific Rim Conference on Multimedia, Tokyo, Japan, November 30 - December 3, 2004, Proceedings, Part II.",
                "count": 127,
                "papers": [
                    "Generic Summarization Technology for Consumer Video.",
                    "Movie-in-a-Minute: Automatically Generated Video Previews.",
                    "Automatic Sports Highlights Extraction with Content Augmentation.",
                    "Audio-Assisted Video Browsing for DVD Recorders.",
                    "A Robust Image Watermarking Technique for JPEG Images Using QuadTrees.",
                    "A Fragile Watermarking Technique for Image Authentication Using Singular Value Decomposition.",
                    "Visual Cryptography for Digital Watermarking in Still Images.",
                    "A New Object-Based Image Watermarking Robust to Geometrical Attacks.",
                    "A Selective Image Encryption Scheme Based on JPEG2000 Codec.",
                    "VQ-Based Gray Watermark Hiding Scheme and Genetic Index Assignment.",
                    "Advanced Paper Document in a Projection Display.",
                    "Improving Web Browsing on Small Devices Based on Table Classification.",
                    "A Java-Based Collaborative Authoring System for Multimedia Presentation.",
                    "Object Tracking and Object Change Detection in Desktop Manipulation for Video-Based Interactive Manuals.",
                    "Design of an Integrated Wearable Multimedia Interface for In-Vehicle Telematics.",
                    "Video Scene Retrieval with Sign Sequence Matching Based on Audio Features.",
                    "Architecture and Analysis of Color Structure Descriptor for Real-Time Video Indexing and Retrieval.",
                    "Automatic Salient-Object Extraction Using the Contrast Map and Salient Points.",
                    "Shape-Based Image Retrieval Using Invariant Features.",
                    "Visual Trigger Templates for Knowledge-Based Indexing.",
                    "Browsing and Similarity Search of Videos Based on Cluster Extraction from Graphs.",
                    "Correlation Learning Method Based on Image Internal Semantic Model for CBIR.",
                    "Controlling Concurrent Accesses in Multimedia Databases for Decision Support.",
                    "Image Retrieval by Categorization Using LVQ Network with Wavelet Domain Perceptual Features.",
                    "A Content-Based News Video Browsing and Retrieval System: NewsBR.",
                    "A News Video Browser Using Identical Video Segment Detection.",
                    "Pseudo Relevance Feedback Based on Iterative Probabilistic One-Class SVMs in Web Image Retrieval.",
                    "Robust Video Similarity Retrieval Using Temporal MIMB Moments.",
                    "Complete Performance Graphs in Probabilistic Information Retrieval.",
                    "A New MPEG-7 Standard: Perceptual 3-D Shape Descriptor.",
                    "News Video Summarization Based on Spatial and Motion Feature Analysis.",
                    "SketchIt: Basketball Video Retrieval Using Ball Motion Similarity.",
                    "Implanting Virtual Advertisement into Broadcast Soccer Video.",
                    "Automatic Video Summarization of Sports Videos Using Metadata.",
                    "Classification of Frames from Broadcasted Soccer Video and Applications.",
                    "An Online Learning Framework for Sports Video View Classification.",
                    "A Semantic Description Scheme of Soccer Video Based on MPEG-7.",
                    "Spatio-temporal Pattern Mining in Sports Video.",
                    "Archiving Tennis Video Clips Based on Tactics Information.",
                    "Performance Evaluation of High-Speed TCP Protocols with Pacing.",
                    "Time-Triggered and Message-Triggered Object Architecture for Distributed Real-Time Multimedia Services.",
                    "A Novel Multiple Time Scale Congestion Control Scheme for Multimedia Traffic.",
                    "Dynamic Programming Based Adaptation of Multimedia Contents in UMA.",
                    "Performance Analysis of MAC Protocol for EPON Using OPNET.",
                    "Adaptive FEC Control for Reliable High-Speed UDP-Based Media Transport.",
                    "Efficient Overlay Network for P2P Content Sharing Based on Network Identifier.",
                    "A Forward-Backward Voice Packet Loss Concealment Algorithm for Multimedia over IP Network Services.",
                    "A Delay-Based End-to-End Congestion Avoidance Scheme for Multimedia Networks.",
                    "Dynamic Bandwidth Allocation for Internet Telephony.",
                    "A Broadcasting Technique for Holographic 3D Movie Using Network Streaming.",
                    "Coping with Unreliable Peers for Hybrid Peer-to-Peer Media Streaming.",
                    "Evaluation of Token Bucket Parameters for VBR MPEG Video.",
                    "Perceptual Video Streaming by Adaptive Spatial-temporal Scalability.",
                    "A Proxy Caching System Based on Multimedia Streaming Service over the Internet.",
                    "Simulation and Development of Event-Driven Multimedia Session.",
                    "Applying Linux High-Availability and Load Balancing Servers for Video-on-Demand (VOD) Systems.",
                    "Indexing Issues in Supporting Similarity Searching.",
                    "Efficient Visual Content Retrieval and Mining in Videos.",
                    "Fast and Robust Short Video Clip Search for Copy Detection.",
                    "Mining Large-Scale Broadcast Video Archives Towards Inter-video Structuring.",
                    "Sample Selection Strategies for Relevance Feedback in Region-Based Image Retrieval.",
                    "Comparison of Two Different Approaches to Detect Perceptual Noise for MPEG-4 AAC.",
                    "Optimum End-to-End Distortion Estimation for Error Resilient Video Coding.",
                    "Enhanced Stochastic Bit Reshuffling for Fine Granular Scalable Video Coding.",
                    "High-Performance Motion-JPEG2000 Encoder Using Overlapped Block Transferring and Pipelined Processing.",
                    "Low-Power Video Decoding for Mobile Multimedia Applications.",
                    "Adaptive Macro Motion Vector Quantization.",
                    "Automatic, Effective, and Efficient 3D Face Reconstruction from Arbitrary View Image.",
                    "Recognition and Retrieval of Face Images by Semi-supervised Learning.",
                    "3-D Facial Expression Recognition-Synthesis on PDA Incorporating Emotional Timing.",
                    "Probabilistic Face Tracking Using Boosted Multi-view Detector.",
                    "Face Samples Re-lighting for Detection Based on the Harmonic Images.",
                    "A Dictionary Registration Method for Reducing Lighting Fluctuations in Subspace Face Recognition.",
                    "A 3D-Dialogue System Between Game Characters to Improve Reality in MMORPG.",
                    "A Hybrid Approach to Detect Adult Web Images.",
                    "A Hierarchical Dynamic Bayesian Network Approach to Visual Tracking.",
                    "A Hybrid Architectural Framework for Digital Home Multimedia Multi-modal Collaboration Services.",
                    "E-learning as Computer Games: Designing Immersive and Experiential Learning.",
                    "Event-Based Surveillance System for Efficient Monitoring.",
                    "A Collaborative Multimedia Authoring System Based on the Conceptual Temporal Relations.",
                    "Multimedia Integration for Cooking Video Indexing.",
                    "Teleconference System with a Shared Working Space and Face Mouse Interaction.",
                    "Performance Analysis for Serially Concatenated FEC in IEEE802.16a over Wireless Channels.",
                    "Successive Interference Cancellation for CDMA Wireless Multimedia Services.",
                    "SCORM-Based Contents Collecting Using Mobile Agent in M-Learning.",
                    "Improved Bit-by-Bit Binary Tree Algorithm in Ubiquitous ID System.",
                    "Automatic Synchronized Browsing of Images Across Multiple Devices.",
                    "An Intelligent Handoff Protocol for Adaptive Multimedia Streaming Service in Mobile Computing Environment.",
                    "Platform Architecture for Seamless MMS Service over WLAN and CDMA2000 Networks.",
                    "Make Stable QoS in Wireless Multimedia Ad Hoc Network with Transmission Diversity.",
                    "Gaze from Motion: Towards Natural User Interfaces.",
                    "The Development of MPEG-4 Based RTSP System for Mobile Multimedia Streaming Services.",
                    "Seamless Mobile Service for Pervasive Multimedia.",
                    "Transformation of MPEG-4 Contents for a PDA Device.",
                    "Semantic Retrieval in a Large-Scale Video Database by Using Both Image and Text Feature.",
                    "Performance of Correlation-Based Stereo Algorithm with Respect to the Change of the Window Size.",
                    "Consideration of Illuminant Independence in MPEG-7 Color Descriptors.",
                    "Improvement on Colorization Accuracy by Partitioning Algorithm in CIELAB Color Space.",
                    "Gabor-Kernel Fisher Analysis for Face Recognition.",
                    "Film Line Scratch Detection Using Neural Network.",
                    "A Simplified Half Pixel Motion Estimation Algorithm Based on the Spatial Correlation.",
                    "A New Tracking Mechanism for Semi-automatic Video Object Segmentation.",
                    "A Visual Model for Estimating the Perceptual Redundancy Inherent in Color Images.",
                    "Selective Image Sharpening by Simultaneous Nonlinear-Diffusion Process with Spatially Varying Parameter Presetting.",
                    "Directonal Weighting-Based Demosaicking Algorithm.",
                    "A New Text Detection Algorithm in Images/Video Frames.",
                    "Automatic Video Object Tracking Using a Mosaic-Based Background.",
                    "Semantic Region Detection in Acoustic Music Signals.",
                    "Audio Classification for Radio Broadcast Indexing: Feature Normalization and Multiple Classifiers Decision.",
                    "Dominant Feature Vectors Based Audio Similarity Measure.",
                    "Generative Grammar of Elemental Concepts.",
                    "Learning Image Manifold Using Web Data.",
                    "Novel Concept for Video Retrieval in Life Log Application.",
                    "Content-Based Retrieval of 3D Head Models Using a Single Face View Query.",
                    "Region-Based Image Retrieval with Perceptual Colors.",
                    "Converting DCT Coefficients to H.264/AVC Transform Coefficients.",
                    "An Adaptive Hybrid Mode Decision Scheme for H.264/AVC Video over Unreliable Packet Networks.",
                    "Workload Characterization of the H.264/AVC Decoder.",
                    "An Efficient Traffic Smoothing Method for MPEG-4 Part-10 AVC/H.264 Bitstream over Wireless Network.",
                    "An Error Resilience Scheme for Packet Loss Recover of H.264 Video.",
                    "Key Techniques of Bit Rate Reduction for H.264 Streams.",
                    "Salient Region Detection Using Weighted Feature Maps Based on the Human Visual Attention Model.",
                    "An Attention-Based Decision Fusion Scheme for Multimedia Information Retrieval.",
                    "Approximating Inference on Complex Motion Models Using Multi-model Particle Filter.",
                    "Human Activity Recognition in Archaeological Sites by Hidden Markov Models.",
                    "An HMM Based Gesture Recognition for Perceptual User Interface.",
                    "Vision-Based Sign Language Recognition Using Sign-Wise Tied Mixture HMM."
                ]
            },
            {
                "sub_name_abbr": "conf/pcm/2004-3",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2004, 5th Pacific Rim Conference on Multimedia, Tokyo, Japan, November 30 - December 3, 2004, Proceedings, Part III.",
                "count": 96,
                "papers": [
                    "WARAJI: Foot-Driven Navigation Interfaces for Virtual Reality Applications.",
                    "Time Space Interface Using DV (Digital Video) and GPS (Global Positioning System) Technology - A Study with an Art Project \"Field-Work@Alsace\".",
                    "Action Generation from Natural Language.",
                    "Human-Scale Interaction with a Multi-projector Display and Multimodal Interfaces.",
                    "Entertainment Applications of Human-Scale Virtual Reality Systems.",
                    "Analysis and Synthesis of Latin Dance Using Motion Capture Data.",
                    "Web-Based Telepresence System Using Omni-directional Video Streams.",
                    "Wide View Surveillance System with Multiple Smart Image Sensors and Mirrors.",
                    "Object Tracking and Identification in Video Streams with Snakes and Points.",
                    "Using a Non-prior Training Active Feature Model.",
                    "An Immunological Approach to Raising Alarms in Video Surveillance.",
                    "Sat-Cam: Personal Satellite Virtual Camera.",
                    "A Linear Approximation Based Method for Noise-Robust and Illumination-Invariant Image Change Detection.",
                    "3D Model Similarity Measurement with Geometric Feature Map Based on Phase-Encoded Range Image.",
                    "Automatic Peak Number Detection in Image Symmetry Analysis.",
                    "Image Matching Based on Singular Value Decomposition.",
                    "Image Matching Based on Scale Invariant Regions.",
                    "A Method for Blocking Effect Reduction Based on Optimal Filtering.",
                    "Novel Video Error Concealment Using Shot Boundary Detection.",
                    "Using Only Long Windows in MPEG-2/4 AAC Encoding.",
                    "Frequency Weighting and Selective Enhancement for MPEG-4 Scalable Video Coding.",
                    "Efficient Multiview Video Coding Based on MPEG-4.",
                    "Block Matching Using Integral Frame Attributes.",
                    "Impact of Similarity Threshold on Arbitrary Shaped Pattern Selection Very Low Bit-Rate Video Coding Algorithm.",
                    "A Study on the Quantization Scheme in H.264/AVC and Its Application to Rate Control.",
                    "An Efficient VLSI Implementation for MC Interpolation of AVS Standard.",
                    "Fast Fractal Image Encoder Using Non-overlapped Block Classification and Simplified Isometry Testing Scheme.",
                    "A Fast Downsizing Video Transcoder Based on H.264/AVC Standard.",
                    "Temporal Error Concealment with Block Boundary Smoothing.",
                    "Spatio-temporally Adaptive Regularization for Enhancement of Motion Compensated Wavelet Coded Video.",
                    "ROI and FOI Algorithms for Wavelet-Based Video Compression.",
                    "Adaptive Distributed Source Coding for Multi-view Images.",
                    "Hybrid Multiple Description Video Coding Using SD/MD Switching.",
                    "Clusters-Based Distributed Streaming Services with Fault-Tolerant Schemes.",
                    "Towards SMIL Document Analysis Using an Algebraic Time Net.",
                    "MULTFRC-LERD: An Improved Rate Control Scheme for Video Streaming over Wireless.",
                    "Multi-source Media Streaming for the Contents Distribution in a P2P Network.",
                    "A New Feature for TV Programs: Viewer Participation Through Videoconferencing.",
                    "Application Layer Multicast with Proactive Route Maintenance over Redundant Overlay Trees.",
                    "Real-Time Rate Control Via Variable Frame Rate and Quantization Parameters.",
                    "The Structure of Logically Hierarchical Cluster for the Distributed Multimedia on Demand.",
                    "Image Forensics Technology for Digital Camera.",
                    "Lossless Data Hiding Based on Histogram Modification of Difference Images.",
                    "A Robust Image Watermarking Scheme to Geometrical Attacks for Embedment of Multibit Information.",
                    "Combined Encryption and Watermarking Approaches for Scalable Multimedia Coding.",
                    "Digital Image Watermarking Using Independent Component Analysis.",
                    "Clustering-Based Image Retrieval Using Fast Exhaustive Multi-resolution Search Algorithm.",
                    "Robust Watermarking for Copyright Protection of 3D Polygonal Model.",
                    "Digital Video Scrambling Method Using Intra Prediction Mode.",
                    "Watermark Re-synchronization Using Sinusoidal Signals in DT-CWT Domain.",
                    "The Undeniable Multi-signature Scheme Suitable for Joint Copyright Protection on Digital Contents.",
                    "A Digital Watermarking Scheme for Personal Image Authentication Using Eigenface.",
                    "Cryptanalysis of a Chaotic Neural Network Based Multimedia Encryption Scheme.",
                    "A Secure Steganographic Method on Wavelet Domain of Palette-Based Images.",
                    "Mapping Energy Video Watermarking Algorithm Based on Compressed Domain.",
                    "A Fragile Image Watermarking Based on Mass and Centroid.",
                    "MPEG-21 DIA Testbed for Stereoscopic Adaptation of Digital Items.",
                    "An MPEG-4 Authoring System with Temporal Constraints for Interactive Scene.",
                    "A Method of Digital Camera Work Focused on Players and a Ball: - Toward Automatic Contents Production System of Commentary Soccer Video by Digital Shooting.",
                    "Real-Time Rendering of Watercolor Effects for Virtual Environments.",
                    "Haptic Interaction in Realistic Multimedia Broadcasting.",
                    "Object-Based Stereoscopic Conversion of MPEG-4 Encoded Data.",
                    "Shared Annotation Database for Networked Wearable Augmented Reality System.",
                    "A Study on Image Electronic Money Based on Watermarking Technique.",
                    "A Fully Automated Web-Based TV-News System.",
                    "An Evolutionary Computing Approach for Mining of Bio-medical Images.",
                    "Movie-Based Multimedia Environment for Programming and Algorithms Design.",
                    "An Improvement Algorithm for Accessing Patterns Through Clustering in Interactive VRML Environments.",
                    "MPEG-4 Video Retrieval Using Video-Objects and Edge Potential Functions.",
                    "A Unified Framework Using Spatial Color Descriptor and Motion-Based Post Refinement for Shot Boundary Detection.",
                    "HMM-Based Audio Keyword Generation.",
                    "Video Scene Segmentation Using Sequential Change Detection.",
                    "Feature Extraction and Evaluation Using Edge Histogram Descriptor in MPEG-7.",
                    "Automatic Synthesis of Background Music Track Data by Analysis of Video Contents.",
                    "Picture Quality Improvement in Low Bit Rate Video Coding Using Block Boundary Classification and Simple Adaptive Filter.",
                    "Bit Position Quantization in Scalable Video Coding for Representing Detail of Image.",
                    "A Fast Full Search Algorithm for Multiple Reference Images.",
                    "Preprocessing of Depth and Color Information for Layered Depth Image Coding.",
                    "Selective Motion Estimation for Fast Video Encoding.",
                    "An Efficient VLSI Architecture of the Sample Interpolation for MPEG-4 Advanced Simple Profile.",
                    "Performance Improvement of Vector Quantization by Using Threshold.",
                    "An Efficient Object Based Personal Video Coding System.",
                    "Multiview Video Coding Based on Global Motion Model.",
                    "A Novel Rate-Distortion Model for Leaky Prediction Based FGS Video Coding.",
                    "JPEG Quantization Table Design for Photos with Face in Wireless Handset.",
                    "Effective Drift Reduction Technique for Reduced Bit-Rate Video Adaptation.",
                    "On Implementation of a Scalable Wallet-Size Cluster Computing System for Multimedia Applications.",
                    "An Adaptive LS-Based Motion Prediction Algorithm for Video Coding.",
                    "Embedded Packetization Framework for Layered Multiple Description Coding.",
                    "Semi-fragile Watermarking Based on Dither Modulation.",
                    "An Adaptive Steganography for Index-Based Images Using Codeword Grouping.",
                    "DH-LZW: Lossless Data Hiding Method in LZW Compression.",
                    "Blind Image Data Hiding in the Wavelet Domain.",
                    "Image Watermarking Capacity Analysis Using Hopfield Neural Network.",
                    "Efficient Algorithms in Determining JPEG-Effective Watermark Coefficients.",
                    "A Fragile Watermarking Based on Knapsack Problem."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "3. IEEE Pacific Rim Conference on Multimedia 2002",
        "info": "Hsinchu, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2002",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2002, Third IEEE Pacific Rim Conference on Multimedia, Hsinchu, Taiwan, December 16-18, 2002, Proceedings.",
                "count": 154,
                "papers": [
                    "Leveraging Information Appliances: A Browser Architecture Perspective in the Mobile Multimedia Age.",
                    "Seamless Service Handoff for Ubiquitous Mobile Multimedia.",
                    "Design of Secure Mobile Application on Cellular Phones.",
                    "Ubiquitous Displays for Cellular Phone Based Personal Information Environments.",
                    "Context-Aware Service Delivery to Mobile Users.",
                    "The Design and Implementation of Network Service Platform for Pervasive Computing.",
                    "Improved Error Detection Method for Real-Time Video Communication Using Fragile Watermarking.",
                    "Digital Geographical Map Watermarking Using Polyline Interpolation.",
                    "Watermarking MPEG-4 2D Mesh Animation in Multiresolution Analysis.",
                    "Rotation, Scaling, and Translation Resilient Image Watermarking with Side Information at Encoder.",
                    "A High Capacity Data Hiding Scheme Based on DFT.",
                    "An Algorithm for Data Hiding Using Median Cut Segmentation.",
                    "An Optimized Spatial Data Hiding Scheme Combined with Convolutional Codes and Hilbert Scan.",
                    "Research on Technology of Chaos Secrecy Communications in Digital Watermarking.",
                    "EFBLA: A Two-Phase Matching Algorithm for Fast Motion Estimation.",
                    "A New Adaptive Return Prediction Search Algorithm for Block Matching.",
                    "A 2-Stage Partial Distortion Search Algorithm for Block Motion Estimation.",
                    "A Fast Block-Matching Motion Estimation Algorithm with Motion Modeling and Motion Analysis.",
                    "Video Coding Using Supplementary Block for Reliable Communication.",
                    "A Robust, Efficient, and Fast Global Motion Estimation Method from MPEG Compressed Video.",
                    "Querying Image Database by Video Content.",
                    "An ICA-Based Illumination-Free Texture Model and Its Application to Image Retrieval.",
                    "A Novel Hierarchical Approach to Image Retrieval Using Color and Spatial Information.",
                    "A Semantic Model for Video Description and Retrieval.",
                    "A Texture Segmentation Method Using Hierarchical Correlations of Wavelet Coefficients.",
                    "An Abstraction of Low Level Video Features for Automatic Retrievals of Explosion Scenes.",
                    "A Region-Based Image Retrieval System Using Salient Point Extraction and Image Segmentation.",
                    "Effects of Codebook Sizes, Codeword Dimensions, and Colour Spaces on Retrieval Performance of Image Retrieval Using Vector Quantization.",
                    "A Stochastic Model for Content-Based Image Retrieval.",
                    "Audio Retrieval with Fast Relevance Feedback Based on Constrained Fuzzy Clustering and Stored Index Table.",
                    "Semi-automatic Video Content Annotation.",
                    "Shot Classification of Sports Video Based on Features in Motion Vector Field.",
                    "Movie Content Retrieval and Semi-automatic Annotation Based on Low-Level Descriptions.",
                    "An Index Model for MPEG-2 Streams.",
                    "MORF: A Distributed Multimodal Information Filtering System.",
                    "Personalization of Interactive News through J2EE, XML, XSLT, and SMIL in a Web-Based Multimedia Content Management System.",
                    "Deploy Multimedia-on-Demand Services over ADSL Networks.",
                    "An Experiment on Generic Image Classification Using Web Images.",
                    "An Authoring Tool Generating Various Video Abstractions Semi-automatically.",
                    "Motion Activity Based Semantic Video Similarity Retrieval.",
                    "Content-Based Audio Classification with Generalized Ellipsoid Distance.",
                    "A Motion-Aided Video Shot Segmentation Algorithm.",
                    "MPEG IPMP Concepts and Implementation.",
                    "A Visual Model for Estimating Perceptual Redundancy Inherent in Color Image.",
                    "Simultaneous Color Clipping and Luminance Preserving for High Quality Entertainment Movie Coding.",
                    "A Dynamic Color Palette for Color Images Coding.",
                    "A Two-Stage Switching-Based Median Filter.",
                    "A Fast and Efficient Noise Reduction Method Suitable for Low Noise Density.",
                    "A Cross-Type Peak-and-Valley Filter for Error Prevention and Resilience in Image Communications.",
                    "Adaptive-Hierarchical-Filtering Technique for Image Enhancement.",
                    "A Design Method for Compactly Supported Sampling Function Generator.",
                    "A Smooth Interpolation Method for Nonuniform Samples Based on Sampling Functions Composed of Piecewise Polynomials.",
                    "Motion Vector Based Error Concealment Algorithms.",
                    "A New Steganalysis Approach Based on Both Complexity Estimate and Statistical Filter.",
                    "Quantization Watermarking Schemes for MPEG-4 General Audio Coding.",
                    "Asymptotic Analyses of Visual Distortions: A New Approach to Defining Transparency.",
                    "An Information Hiding Technique for Binary Images in Consideration of Printing Process.",
                    "Image Watermarking Synchronization by Significant MSB Plane Matching.",
                    "Secure Watermark Verification Scheme.",
                    "A Foveation-Based Rate Shaping Mechanism for MPEG Videos.",
                    "A Stereo Image Coding Using Hierarchical Basis.",
                    "A Method on Tracking Unit Pixel Width Line Segments for Function Approximation-Based Image Coding.",
                    "Object Assisted Video Coding for Video Conferencing System.",
                    "Inter-subband Redundancy Prediction Using Neural Network for Video Coding.",
                    "Building the Software Infrastructure for Smart Classroom: From Open Agent Architecture (OAA) to Smart Platform.",
                    "Self-Guided Adaptive and Interactive Hypermedia Courseware System.",
                    "Combining Hybrid Media Tools for Web-Based Education.",
                    "X-WALTZ: The Framework of an Interactive Multimedia Math E-learning.",
                    "Hybrid Learning Schemes for Multimedia Information Retrieval.",
                    "Lecturer Position Detection for Distribution System Using High Resolution Partial Images.",
                    "Boosting Speech/Non-speech Classification Using Averaged Mel-Frequency Cepstrum Coefficients Features.",
                    "Statistical Analysis of Musical Instruments.",
                    "Text-to-Visual Speech Synthesis for General Objects Using Parameter-Based Lip Models.",
                    "Sun-Yuan Kung, Speaker Verification from Coded Telephone Speech Using Stochastic Feature Transformation and Handset Identification.",
                    "Recognition of Visual Speech Elements Using Hidden Markov Models.",
                    "Robust and Inaudible Multi-echo Audio Watermarking.",
                    "Kernel-Based Probabilistic Neural Networks with Integrated Scoring Normalization for Speaker Verification.",
                    "An On-the-Fly Mandarin Singing Voice Synthesis System.",
                    "Popular Song Retrieval Based on Singing Matching.",
                    "Improving Audio Watermark Robustness Using Stretched Patterns against Geometric Distortion.",
                    "A Digital Audio Watermarking Using Two Masking Effects.",
                    "On the Possibility of Only Using Long Windows in MPEG-2 AAC Coding.",
                    "A Call Admission Control Algorithm Based on Stochastic Performance Bound for Wireless Networks.",
                    "Management of Multiple Mobile Routers for Continuous Multimedia in Mobile WLANs.",
                    "VoIP Quality Evaluation in Mobile Wireless Networks.",
                    "Connection Removal Algorithms for Multimedia CDMA Wireless Networks.",
                    "Integration of GPRS and Wireless LANs with Multimedia Applications.",
                    "Adaptive Multimedia System Architecture for Improving QoS in Wireless Networks.",
                    "A New Improvement of JPEG Progressive Image Transmission Using Weight Table of Quantized DCT Coefficient Bits.",
                    "MediaView: A Semantic View Mechanism for Multimedia Modeling.",
                    "The Connection between Pyramidal Algorithm and Wavelet Series.",
                    "A Hybrid Motion Data Manipulation: Wavelet Based Motion Processing and Spacetime Rectification.",
                    "Foreground Segmentation Using Motion Vectors in Sports Video.",
                    "Color Image Segmentation Using Anisotropic Diffusion and Agglomerative Hierarchical Clustering.",
                    "Extraction of Text Regions and Recognition of Characters from Video Inputs.",
                    "Target Tracking via Region-Based Confidence Computation with the CNN-UM.",
                    "Improved Scheme for Object Searching Using Moment Invariants.",
                    "Segmenting People in Meeting Videos Using Mixture Background and Object Models.",
                    "A Framework for Background Detection in Video.",
                    "High Speed Road Boundary Detection with CNN-Based Dynamic Programming.",
                    "A New Error Resilient Coding Scheme for H.263 Video Transmission.",
                    "A Bit-Plane Coding Scheme of MPEG-4 FGS with High Efficiency Based on the Distribution of Significant Coefficients.",
                    "A VBR Rate Control Using MINMAX Criterion for Video Streaming.",
                    "Implementation of Real-Time MPEG-4 FGS Encoder.",
                    "MPEG-4 Video Streaming with Drift-Compensated Bitstream Switching.",
                    "Flexible and Efficient Switching Techniques between Scalable Video Bitstreams.",
                    "Robust Video Transmission Using RSE-Code-Based FEC.",
                    "A Peer-to-Peer Communication System.",
                    "A Project Management Model for Multimedia System Development.",
                    "TCP-Friendly Congestion Control Algorithm on Self-Similar Traffic Network.",
                    "Adaptive Call Admission Control for Mobile Multimedia Network.",
                    "Providing Multimedia Traffic with Predictability.",
                    "Dynamic Service Extensibility through Programmable Network in a Mobility Context.",
                    "The Adaptive Feedback Scheduling Framework for Streaming VBR Videos with Wireless ATM ABR Service.",
                    "Support Vector Machine Learning for Music Discrimination.",
                    "Dynamic Network Adaptation Framework Employing Layered Relative Priority Index for Adaptive Video Delivery.",
                    "Peer-to-Peer Support for File Transfer and Caching Mechanism.",
                    "Exact and Heuristic Algorithms for Multi-constrained Path Selection Problem.",
                    "W-CoSIM (Web-Based Hardware-Software CoSimulator) - A Design-Time Simulation Tool for Estimating the Performance of Online Multimedia Applications.",
                    "Distance Education Based on a Multimedia Mix Provided by a Virtual Organization.",
                    "Media-on-Demand for Agent-Based Collaborative Tutoring Systems on the Web.",
                    "Design a Web-Based Assessment Tool with Multiple Presentation Styles for Language Training.",
                    "Design and Development of a Multimedia Interactive Lab for Distance Learning Applications in the WWW.",
                    "The System Resource Management in a Distributed Web-Based E-learning Platform.",
                    "The Design and Implementation of a Web-Based Discovery-Based Instruction Model.",
                    "A Quantitative Assessment Method with Course Design Model for Distance Learning.",
                    "On (In)security of \"A Robust Image Authentication Method\".",
                    "A Software Protection System for Internet Commerce.",
                    "Design of a New Cryptography System.",
                    "Texture Extraction and Blending without Prior Knowledge of Lighting Conditions.",
                    "Sharp and Dense Disparity Maps Using Multiple Windows.",
                    "Interpolation of CT Slices for 3-D Visualization by Maximum Intensity Projections.",
                    "Responsive Transmission of 3D Scenes over Internet.",
                    "Using Intel Streaming SIMD Extensions for 3D Geometry Processing.",
                    "Multimodal Gumdo Game: The Whole Body Interaction with an Intelligent Cyber Fencer.",
                    "An Enhanced Transmission Service with 3-Priority Queue Management for Real-Time Interaction in Virtual World.",
                    "Enhancing 3D Graphics on Mobile Devices by Image-Based Rendering.",
                    "A Guided Interaction Approach for Architectural Design in a Table-Type VR Environment.",
                    "A Gaze-Direction Controlled Wavelet Packet Based Image Coder.",
                    "Qualitative Camera Motion Classification for Content-Based Video Indexing.",
                    "Feature-Based Object Tracking with an Active Camera.",
                    "A Depth Measurement System Associated with a Mono-Camera and a Rotating Mirror.",
                    "Human Behavior Recognition for an Intelligent Video Production System.",
                    "A Robust Algorithm for Video Based Human Motion Tracking.",
                    "Estimating Head Pose from Spherical Image for VR Environment.",
                    "An Efficient Algorithm for Detecting Faces from Color Images.",
                    "An Illumination-Insensitive Face Matching Algorithm.",
                    "Facial Expression Analysis under Various Head Poses.",
                    "Region-of-Interest Video Coding Based on Face Detection.",
                    "An Error Resilient Scheme for MPEG-4 FGS Video over Packet Erasure Channel That Exhibits Graceful Degradation.",
                    "MPEG4 Compatible Video Browsing and Retrieval over Low Bitrate Channel.",
                    "Multiple Granularity Access to Navigated Hypermedia Documents Using Temporal Meta-information.",
                    "Authoring Temporal Scenarios in Interactive MPEG-4 Contents.",
                    "Implementation of Live Video Transmission in MPEG-4 3D Scene."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "2. IEEE Pacific Rim Conference on Multimedia 2001",
        "info": "Bejing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pcm/2001",
                "sub_name": "Advances in Multimedia Information Processing - PCM 2001, Second IEEE Pacific Rim Conference on Multimedia, Bejing, China, October 24-26, 2001, Proceedings.",
                "count": 157,
                "papers": [
                    "Linux Watch: Hardware Platform for Wearable Computing Research.",
                    "Wearable Computer Application for Open Air Exhibition in EXPO 2005.",
                    "Automatic Summarization of Wearable Video - Indexing Subjective Interest.",
                    "A Novel Video Retrieval Method to Support a User's Recollection of Past Events Aiming for Wearable Information Playing.",
                    "Experience of Immersive Virtual World Using Cellular Phone Interface.",
                    "VizWear: Toward Human-Centered Interaction through Wearable Vision and Visualization.",
                    "Face Indexing and Retrieval in Personal Digital Album.",
                    "An Image Retrieval System Based on Local and Global Color Descriptions.",
                    "A New Shot Boundary Detection Algorithm.",
                    "An Adaptive Index Structure for High-Dimensional Similarity Search.",
                    "Combining Hierarchical Classifiers with Video Semantic Indexing Systems.",
                    "Mismatch MB Retrieval for MPEG-2 to MPEG-4 Transcoding.",
                    "On the Optimal Coding.",
                    "Dynamic Multi-reference Prediction in Video Coding for Improved Error Resilience over Internet.",
                    "Motion-Based Semantic Event Detection for Video Content Description in MPEG-7.",
                    "Fast and Robust Sprite Generation for MPEG-4 Video Coding.",
                    "Fast Motion Estimation Using N-Queen Pixel Decimation.",
                    "Improved MPEG-4 Visual Texture Coding Using Perceptual Dithering for Transparent Image Coding.",
                    "SPEM Rate Control.",
                    "A Real-Time Large Vocabulary Continuous Recognition System for Chinese Sign Language.",
                    "Object Modeling, Coding, and Transmission for Multimedia Communications.",
                    "Live Events Accessing for Multi-users with Free Viewpoints Using Stereo Omni-directional System.",
                    "Unsupervised Analysis of Human Gestures.",
                    "User Modeling for Efficient Use of Multimedia Files.",
                    "A Feature-Based Vehicle Tracking System in Congested Traffic Video Sequences.",
                    "Movie Event Detection by Using Audio Visual Information.",
                    "Double Hierarchical Algorithm for Video Mosaics.",
                    "Automatic Segmentation and Tracking of Moving Objects.",
                    "Text Area Detection from Video Frames.",
                    "Interacting with 3D Graphic Objects in an Image-Based Environment.",
                    "Robust Face Recognition with Light Compensation.",
                    "Robust Head Pose Estimation Using Textured Polygonal Model with Local Correlation Measure.",
                    "A Face Verification Algorithm Integrating Geometrical and Template Features.",
                    "E-Partner: A Photo-Realistic Conversation Agent.",
                    "A Robust and Fast Face Modeling System.",
                    "Automatic Human Face Recognition System Using Fractal Dimension and Modified Hausdorff Distance.",
                    "Similarity Retrieval in Image Databases by Boosted Common Shape Features Among Query Images.",
                    "Combining Configurational and Statistical Approaches in Image Retrieval.",
                    "Digital Image Coding with Hybrid Wavelet Packet Transform.",
                    "Texture Retrieval with Linguistic Descriptions.",
                    "Implementation of the Virtual School: Best Cyber Academy.",
                    "Applying Process Improvement Approach to the Design and Development of a Multimedia-Based Training Management System.",
                    "IP Traffic Monitoring: An Overview and Future Considerations.",
                    "Efficient Dynamic Image Retrieval Using the Á Trous Wavelet Transformation.",
                    "Image Retrieval in Multimedia with Emergence Index.",
                    "Efficient Multimedia Database Indexing Using Structural Join Index Hierarchy.",
                    "Modeling of the HLA-Based Simulation System.",
                    "An End-to-End Delivery Scheme for Robust Video Streaming.",
                    "Customer Identification for MPEG Video Based on Digital Fingerprinting.",
                    "Performance Analysis of Data Hiding.",
                    "Data Encryption Using MRF with an RSA Key.",
                    "Digital Watermarking for Forgery Detection in Printed Materials.",
                    "Improvement and Comments on Image Watermarking Using Complementary Modulation.",
                    "An Eye-Movement Controlled Wavelet Based Image Coder.",
                    "Variable Frame-Rate Video Coding Based on Global Motion Analysis.",
                    "Efficient Blind Image Restoration Based on 1-D Generalized Cross Validation.",
                    "Block Reordering Wavelet Packet SPIHT Image Coding.",
                    "A Motion Activity Descriptor and Its Extraction in Compressed Domain.",
                    "A Fast and Effective Block-Matching Error Concealment Scheme.",
                    "Bit Allocation for Video Coding with Temporal-Spatial Tradeoff.",
                    "An Evaluation of the Robustness of Image Retrieval Based on Vector Quantization.",
                    "Search for Multi-modality Data in Digital Libraries.",
                    "Compressed Domain Summarization of Digital Video.",
                    "Automatic Segmentation of News Items Based on Video and Audio Features.",
                    "Association Feedback: A Novel Tool for Feature Elements Based Image Retrieval.",
                    "Query by Visual Example: Assessing the Usability of Content-Based Image Retrieval System User Interfaces.",
                    "Using Keyblock Statistics to Model Image Retrieval.",
                    "Pitch Tracking and Melody Slope Matching for Song Retrieval.",
                    "Analysis of Environmental Sounds as Indexical Signs in Film.",
                    "A Low Missing Rate Audio Search Technique for Cantonese Radio Broadcast Recording.",
                    "Emotion Detection from Speech to Enrich Multimedia Content.",
                    "Proxy Caching Based on Patching Scheme and Prefetching.",
                    "A Stateless Active Queue Management Scheme for Approximating Fair Bandwidth Allocation and Stabilized Buffer Occupation.",
                    "QoS-Based Checkpoint Protocol for Multimedia Network Systems.",
                    "An Interactive Audio and Video Station over Internet.",
                    "Query by Tapping: A New Paradigm for Content-Based Music Retrieval from Acoustic Input.",
                    "Multi-modal Sign Icon Retrieval for Augmentative Communication.",
                    "Comparison of Word and Subword Indexing Techniques for Mandarin Chinese Spoken Document Retrieval.",
                    "Interactive Web Multimedia Search Using Query-Session-Based Query Expansion.",
                    "Codec Schemes Selection for Wireless Voice over IP (VoIP).",
                    "On the Use of Error Correction Codes in Spread Spectrum Based Image Watermarking.",
                    "Correlation Detection of Asymmetric Watermark.",
                    "Watermarking Music Sheets.",
                    "BCH Coded Watermarks for Error-Prone Transmission of MPEG Video.",
                    "Smart Classroom - An Intelligent Environment for Tele-education.",
                    "Movie Video Hypermedia Authoring System.",
                    "Design Considerations for the Video Analyzer SDK.",
                    "Network-Adaptive Cache Management Schemes for Mixed Media.",
                    "Robust Scalable Image Transmission over Wireless Fading Channel.",
                    "A Dynamic Regulation with Scheduler Feedback Information for Multimedia Networks.",
                    "A New Scheduling Scheme for Multicast True VoD Service.",
                    "Intelligent Multi-hop Video Communications.",
                    "Classification of Facial Images Using Gaussian Mixture Models.",
                    "A Fast Descriptor Matching Algorithm for Exhaustive Search in Large Databases.",
                    "FBCC: An Image Similarity Algorithm Based on Regions.",
                    "A New Digital Watermarking for Text Document Images Using Diagonal Profile.",
                    "Gesture Classification and Recognition Using Principal Component Analysis and HMM.",
                    "A Robust Line-Feature-Based Hausdorff Distance for Shape Matching.",
                    "Copyright Protection for WAV-Table Synthesis Audio Using Digital Watermarking.",
                    "Sign Correlation Detector for Blind Image Watermarking in the DCT Domain.",
                    "Wavelet-Domain Image Watermarking Based on Statistical Metrics.",
                    "Semi Fragile Watermarking Based on Wavelet Transform.",
                    "A Novel Scheme for Securing Image Steganography.",
                    "A Synchronous Fragile Watermarking Scheme for Erroneous Q-DCT Coefficients Detection.",
                    "Shot Change Detection Based on the Reynolds Transport Theorem.",
                    "Automatic Subject Categorization of Query Terms for Filtering Sensitive Queries in Multimedia Search.",
                    "A Color Image Retrieval Method Based on Local Histogram.",
                    "Seeded Semantic Object Generation toward Content-Based Video Indexing.",
                    "Automatic Scene Detection in News Program by Integrating Visual Feature and Rules.",
                    "Shape Retrieval by Hierarchical Evolution.",
                    "A Comparison of Shape Retrieval Using Fourier Descriptors and Short-Time Fourier Descriptors.",
                    "A SMIL Browser with an Enhanced Image, Audio and Video Effect Library for Multimedia Rich Presentations.",
                    "A Method for Photograph Indexing Using Speech Annotation.",
                    "A Fast Anchor Shot Detection Algorithm on Compressed Video.",
                    "Content-Based News Video Retrieval with Closed Captions and Time Alignment.",
                    "Query Similar Music by Correlation Degree.",
                    "Color Content Matching of MPEG-4 Video Objects.",
                    "Multiple-Person Tracking System for Content Analysis.",
                    "Motion Segmentation with Census Transform.",
                    "Efficient Algorithms for Motion Based Video Retireval.",
                    "Content-Based Retrieval on the Compressed Domain of 2nd Generation Image Coding.",
                    "Retrieving Landscape Images Using Scene Structural Matrix.",
                    "Digital Watermarking: A Communications with Side Information Perspective.",
                    "Adaptive Video Watermarking Scheme.",
                    "An Error Resilience Algorithm for H.263++ Based Video Coding.",
                    "A Predictive Connection Admission Control Scheme for QoS Improvement.",
                    "A Multiresolutional Coding Method Based on SPIHT.",
                    "LLEC: An Image Coder with Low-Complexity and Low-Memory Requirement.",
                    "A Generalized Secret Image Sharing and Recovery Scheme.",
                    "New Semi-fragile Authentication Watermarking.",
                    "Performance Analysis of Video Storage Based on Clustered NAS Architecture.",
                    "Modeling Video-on-Demand System in Temporal Logic.",
                    "Adaptive Processing of Tree-Structure Image Representation.",
                    "Blind Watermarking Algorithm Using Complex Block Selection Method.",
                    "MTEACH: A Language-Based Framework for Didactic Multimedia Production.",
                    "Protocol and Buffer Design for Multimedia-on-Demand System.",
                    "Quality Weighted Bit Allocation for Smoother Streaming of Stored FGS Video.",
                    "A Content-Based Multimedia Database Engine: MIR.",
                    "A Flexible Access Control Model for Multimedia Medical Image Security.",
                    "Joint Source/Channel Coding Using Turbo Trellis Codes.",
                    "An Adaptive Optimal Multimedia Network Transmission Control Scheme.",
                    "Effects of Sampling Rate and Pose Error on Volume Reconstruction by Space Carving.",
                    "A Tree-Based Model of Prosodic Phrasing for Chinese Text-to-Speech Systems.",
                    "Detecting Facial Features on Image Sequences Using Cross-Verification Mechanism.",
                    "Rapid Object Tracking on Compressed Video.",
                    "Design and Implementation of the Multimedia Cluster System Based on VIA.",
                    "A Fuzzy Inference System for Simplifying Surfaces with Color.",
                    "Demosaic: Color Filter Array Interpolation for Digital Cameras.",
                    "Object-Based Classification of Mixed-Mode Images.",
                    "A Face-Unlock Screen Saver by Using Face Verification Based on Identity-Specific Subspaces.",
                    "Analysis of Camera Operations in MPEG Compressed Domain Based on Generalized Hough Transform.",
                    "Speech Driven MPEG-4 Based Face Animation via Neural Network.",
                    "Mesh Simplification by Vertex Cluster Contraction.",
                    "Fusion of Biometrics Based on D-S Theory.",
                    "Eyeglasses Verification by Support Vector Machine.",
                    "A GMM-Based Handset Selector for Channel Mismatch Compensation with Applications to Speaker Identification.",
                    "Performance Evaluation of 2D Feature Tracking Based on Bayesian Estimation."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "1. IEEE Pacific Rim Conference on Multimedia 2000",
        "info": "Sydney, Australia",
        "venues": []
    }
]