[
    {
        "year": "2020",
        "name": "28th PG 2020",
        "info": "Wellingtion, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2020s",
                "sub_name": "28th Pacific Conference on Computer Graphics and Applications, PG 2020 - Short Papers, Posters, and Work-in-Progress Papers, Wellington, New Zealand, October 26-29, 2020.",
                "count": 12,
                "papers": [
                    "An Energy-Conserving Hair Shading Model Based on Neural Style Transfer.",
                    "Illumination Space: A Feature Space for Radiance Maps.",
                    "A Deep Learning Based Interactive Sketching System for Fashion Images Design.",
                    "Monocular 3D Fluid Volume Reconstruction Based on a Multilayer External Force Guiding Model.",
                    "A Robust Feature-aware Sparse Mesh Representation.",
                    "Simple Simulation of Curved Folds Based on Ruling-aware Triangulation.",
                    "Using Landmarks for Near-Optimal Pathfinding on the CPU and GPU.",
                    "Interactive Video Completion with SiamMask.",
                    "Reconstructing Monte Carlo Errors as a Blue-noise in Screen Space.",
                    "Day-to-Night Road Scene Image Translation Using Semantic Segmentation.",
                    "RTSDF: Generating Signed Distance Fields in Real Time for Soft Shadow Rendering.",
                    "Stroke Synthesis for Inbetweening of Rough Line Animations."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th PG 2019",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2019s",
                "sub_name": "27th Pacific Conference on Computer Graphics and Applications, PG 2019 - Short Papers, Seoul, South Korea, October 14-17, 2019.",
                "count": 9,
                "papers": [
                    "RegionSketch: Interactive and Rapid Creation of 3D Models with Rich Details.",
                    "Connectivity-preserving Smooth Surface Filling with Sharp Features.",
                    "A Psychophysical Analysis of Fabricated Anisotropic Appearance.",
                    "Gaze Attention and Flow Visualization using the Smudge Effect.",
                    "Towards Biomechanically and Visually Plausible Volumetric Cutting Simulation of Deformable Bodies.",
                    "LPaintB: Learning to Paint from Self-Supervision.",
                    "External Forces Guided Fluid Surface and Volume Reconstruction from Monocular Video.",
                    "Feature Curve Network Extraction via Quadric Surface Fitting.",
                    "3D Human Body Skeleton Extraction from Consecutive Surfaces."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th PG 2018",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2018s",
                "sub_name": "26th Pacific Conference on Computer Graphics and Applications, PG 2018 - Short Papers and Posters, Hong Kong, October 8-11, 2018.",
                "count": 27,
                "papers": [
                    "Extreme Feature Regions for Image Matching.",
                    "A Deep Learned Method for Video Indexing and Retrieval.",
                    "Direct Limit Volumes: Constant-Time Limit Evaluation for Catmull-Clark Solids.",
                    "Gauss-Seidel Progressive Iterative Approximation (GS-PIA) for Loop Surface Interpolation.",
                    "Light-Field DVR on GPU for Streaming Time-Varying Data.",
                    "Robust Material Graphs for Volume Rendering.",
                    "A Visual Analytics Approach for Traffic Flow Prediction Ensembles.",
                    "Progressive 3D Scene Understanding with Stacked Neural Networks.",
                    "3D VAE-Attention Network: A Parallel System for Single-view 3D Reconstruction.",
                    "Modeling Detailed Cloud Scene from Multi-source Images.",
                    "Recovering 3D Indoor Floor Plans by Exploiting Low-cost Spherical Photography.",
                    "Skeleton-based Generalized Cylinder Deformation under the Relative Curvature Condition.",
                    "Anisotropic Spectral Manifold Wavelet Descriptor for Deformable Shape Analysis and Matching.",
                    "InspireMePosing: Learn Pose and Composition from Portrait Examples.",
                    "Tabby: Explorable Design for 3D Printing Textures.",
                    "Mesh Parameterization: a Viewpoint from Constant Mean Curvature Surfaces.",
                    "Efficient Metropolis Path Sampling for Material Editing and Re-rendering.",
                    "Effects of Surface Anisotropy on Perception of Car Body Attractiveness.",
                    "Bottom-up/Top-down Geometric Object Reconstruction with CNN Classification for Mobile Education.",
                    "Robust and Efficient SPH Simulation for High-speed Fluids with the Dynamic Particle Partitioning Method.",
                    "Facial-Expression-Aware Emotional Color Transfer Based On Convolutional Neural Network.",
                    "Shape Interpolation via Multiple Curves.",
                    "Spherical Blue Noise.",
                    "Japanese Kanji Font Style Transfer based on GAN with Unpaired Training.",
                    "TAVE: Template-based Augmentation of Visual Effects to Human Actions in Videos.",
                    "StretchDenoise: Parametric Curve Reconstruction with Guarantees by Separating Connectivity from Residual Uncertainty of Samples.",
                    "GPU-based Real-time Cloth Simulation for Virtual Try-on."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th PG 2017",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2017s",
                "sub_name": "25th Pacific Conference on Computer Graphics and Applications, PG 2017 - Short Papers, Taipei, Taiwan, October 16-19, 2017.",
                "count": 6,
                "papers": [
                    "Adaptive Measurement of Anisotropic Material Appearance.",
                    "Transferring Pose and Augmenting Background Variation for Deep Human Image Parsing.",
                    "Real-time Shadow Removal using a Volumetric Skeleton Model in a Front Projection System.",
                    "Robust Edge-Preserved Surface Mesh Polycube Deformation.",
                    "Computing Restricted Voronoi Diagram on Graphics Hardware.",
                    "Robust Gas Condensation Simulation with SPH based on Heat Transfer."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th PG 2016",
        "info": "Okinawa, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2016s",
                "sub_name": "24th Pacific Conference on Computer Graphics and Applications, PG 2016 - Short Papers, Okinawa, Japan, October 11-14, 2016.",
                "count": 10,
                "papers": [
                    "Icon Set Selection via Human Computation.",
                    "Optimized Route for Crowd Evacuation.",
                    "Modified Filtered Importance Sampling for Virtual Spherical Gaussian Lights.",
                    "Compressing Bidirectional Texture Functions via Tensor Train Decomposition.",
                    "Computational Design of Iris Folding Patterns.",
                    "Reflectance and Shape Estimation for Cartoon Shaded Objects.",
                    "Interactive Multicut Video Segmentation.",
                    "Viewpoint Selection for Taking a good Photograph of Architecture.",
                    "Local Detail Enhancement for Volume Rendering under Global Illumination.",
                    "Dynamic Skin Deformation Simulation Using Musculoskeletal Model and Soft Tissue Dynamics."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd PG 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2015s",
                "sub_name": "23rd Pacific Conference on Computer Graphics and Applications, PG 2015 - Short Papers, Beijing, China, October 7-9, 2015.",
                "count": 14,
                "papers": [
                    "Pairwise Surface Registration Using Local Voxelizer.",
                    "Robust and GPU-friendly Isotropic Meshing Based on Narrow-banded Euclidean Distance Transformation.",
                    "Structure-Preserving Image Smoothing via Phase Congruency-aware Weighted Least Square.",
                    "Modal Space Subdivision for Physically-plausible 4D Shape Sequence Completion from Sparse Samples.",
                    "Incomplete 3D Shape Retrieval via Sparse Dictionary Learning.",
                    "Complex Modulation Computer-Generated Hologram with Occlusion Effect by a Fast Hybrid Point-source/Wave-field Approach.",
                    "Adaptive Hierarchical Shape Matching.",
                    "Efficient Interactive Image Segmentation with Local and Global Consistency.",
                    "Simultaneous Stereo Rectification and Distortion Correction with Application to DoF Synthesis.",
                    "Light-Guided Tree Modeling of Diverse Biomorphs.",
                    "Accelerating Graph-based Path Planning Through Waypoint Clustering.",
                    "Parallel Importing of OBJ Meshes in CUDA.",
                    "Superpixels Generation of RGB-D Images Based on Geodesic Distance.",
                    "A Voronoi based Labeling Approach to Curve Reconstruction and Medial Axis Approximation."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd PG 2014",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2014s",
                "sub_name": "22nd Pacific Conference on Computer Graphics and Applications, PG 2014 - Short Papers, Seoul, South Korea, October 8-10, 2014.",
                "count": 26,
                "papers": [
                    "A Simple Artistic Rendering Method for Stereoscopic Images.",
                    "Sky Browser: Search for HDR Sky Maps.",
                    "Perceptually Optimised Illumination for Seamless Composites.",
                    "Automatic 3D Posing from 2D Hand-Drawn Sketches.",
                    "Parallel BTF Compression with Multi-Level Vector Quantization in OpenCL.",
                    "Visual Analysis of FPS Gameplay Data: From Game Design to Player Behavior.",
                    "PatchMove: Patch-based Fast Image Interpolation with Greedy Bidirectional Correspondence.",
                    "Extraction and Transfer of Facial Expression Wrinkles for Facial Performance Enhancement.",
                    "Example-based Haze Removal with two-layer Gaussian Process Regressions.",
                    "Geometry-Aware Image Completion via Multiple Examples.",
                    "Saliency-driven Depth Compression for 3D Image Warping.",
                    "Quantitative Analysis of Voxel Raytracing Acceleration Structures.",
                    "Data-Driven Fire Synthesis and Design.",
                    "Automatic Aesthetics-based Lighting Design with Global Illumination.",
                    "Album Quickview in Comic-like Layout via Quartet Analysis.",
                    "Finding Feature Similarities Between Geometric Trees.",
                    "Real-time Collision Detection with Two-level Spatial Hashing on GPU.",
                    "Automatic Garment Modeling From Front And Back Images.",
                    "Image Palette: Brushstroke Synthesis-based Style Transfer.",
                    "Random Sparse Coded Aperture for Lensless Imaging.",
                    "Projecting Points onto Planar Parametric Curves by Local Biarc Approximation.",
                    "Surface Mesh Segmentation and Reconstruction with Smooth Boundary Curves.",
                    "Integrating Occlusion Culling into LOD on GPU.",
                    "Visibility Filtering for Producing Indirect Illumination.",
                    "Scene Segmentation and Understanding for Context-Free Point Clouds.",
                    "Incorporating Fiber Controls into FEM Model for Transversely Isotropic Materials."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st PG 2013",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2013s",
                "sub_name": "21st Pacific Conference on Computer Graphics and Applications, PG 2013 - Short Papers, Singapore, October 7-9, 2013.",
                "count": 11,
                "papers": [
                    "Component-aware Semantic Modeling of Architectures from a Single Image.",
                    "Backwards Memory Allocation and Improved OIT.",
                    "Modeling Large Scale Clouds from Satellite Images.",
                    "Video-Realistic Inner Mouth Reanimation.",
                    "An Improved Friction Model for Cloth Simulation.",
                    "Fast Random Sampling of Triangular Meshes.",
                    "Intelligent Interactive Volume Classification.",
                    "Bezier Crust on Quad Subdivision Surface.",
                    "Non-rigid 3D Shape Retrieval via Sparse Representation.",
                    "Exploring Volume Visualization with Whole-hand Multitouch Gestures.",
                    "Interactive Exploration of 4D Geometry with Volumetric Halos."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th PG 2012",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2012s",
                "sub_name": "20th Pacific Conference on Computer Graphics and Applications, PG 2012 - Short Papers, Hong Kong, September 12-14, 2012.",
                "count": 6,
                "papers": [
                    "Bokeh Rendering with a Physical Lens.",
                    "Real-time Particle Fluid Simulation with WCSPH.",
                    "Optimizing Geometry-aware Pants Decomposition.",
                    "Point-wise Adaptive Filtering for Fast Monte Carlo Noise Reduction.",
                    "Ellipsoidal Cube Maps for Accurate Rendering of Planetary-Scale Terrain Data.",
                    "User-Assisted Disparity Maps."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th PG 2011",
        "info": "Kaohsiung, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2011s",
                "sub_name": "19th Pacific Conference on Computer Graphics and Applications, PG 2011 - Short Papers, Kaohsiung, Taiwan, September 21-23, 2011.",
                "count": 19,
                "papers": [
                    "Feature-Aware Mesh for Image Retargeting.",
                    "Two Simple Single-pass GPU methods for Multi-channel Surface Voxelization of Dynamic Scenes.",
                    "Visualizing Local Weather Characteristics Interpreted from Glider GPS Flight Logs.",
                    "Illustrative Line Styles for Flow Visualization.",
                    "Diffusion Tensor Weighted Harmonic Fields for Feature Classification.",
                    "Facial Retargeting by Adding Supplemental Blendshapes.",
                    "Real-time Rendering of Endless Cloud Animation.",
                    "A Fast Simulation Method Using SPH and Wavelet for Sub-Particle-Scale Turbulent Flow.",
                    "Interactive Design of Planar Curved Folding by Reflection.",
                    "Sketch-based Breaking Waves.",
                    "Feature-Aware Reconstruction of Volume Data via Trivariate Splines.",
                    "Feature Adaptive Surfel Set Simplification.",
                    "Virtual City Map Generation using Area Subdivision.",
                    "An Effective and Efficient Contour-based Corner Detector using Simple Triangular Theory.",
                    "Fast Computing Adaptively Sampled Distance Field on GPU.",
                    "An Image-based Hair Styling System Using Layered Texture Pieces.",
                    "Perceptually-based Stroke Pattern Synthesis.",
                    "Fast Level Set Image Segmentation Using New Evolution Indicator Operators.",
                    "Real-time Realistic Voxel-based Rendering."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th PG 2010",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2010",
                "sub_name": "18th Pacific Conference on Computer Graphics and Applications, PG 2010 - Poster Papers, Hangzhou, China, September 25-27, 2010.",
                "count": 16,
                "papers": [
                    "Procedural Modeling of Water Caustics and Foamy Water for Cartoon Animation.",
                    "Representing Progressive Dynamic 3D Meshes and Applications.",
                    "Space-Optimized Texture Atlases for 3D Scenes with Per-polygon Textures.",
                    "Fast Height-Field Rendering under Image-Based Lighting.",
                    "Computing Efficient Matrix-valued Wavelets for Meshes.",
                    "Physically Based Rendering of Rainbows under Various Atmospheric Conditions.",
                    "Synthesizing Subdivision Meshes Using Real Time Tessellation.",
                    "Thread-Based BRDF Rendering on GPU.",
                    "Real-Time Dehazing for Image and Video.",
                    "Rate-Distortion Optimized Progressive 3D Reconstruction from Multi-view Images.",
                    "Salient Region of Textured 3D Model.",
                    "A Simplified Plane-Parallel Scattering Model and Its Application to Hair Rendering.",
                    "High Quality Interactive Rendering of Massive Point Models Using Multi-way kd-Trees.",
                    "GPU-Based Ray Tracing of Splats.",
                    "Sample-Based Synthesis of Illustrative Patterns.",
                    "Prefiltered Cross-Section Occluders."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th PG 2009",
        "info": "Jeju, South Korea",
        "venues": []
    },
    {
        "year": "2008",
        "name": "16th PG 2008",
        "info": "Tokyo, Japan",
        "venues": []
    },
    {
        "year": "2007",
        "name": "15th PG 2007",
        "info": "Maui, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2007",
                "sub_name": "15th Pacific Conference on Computer Graphics and Applications, PG 2007, Maui, HI, USA, October 29 - November 2, 2007.",
                "count": 61,
                "papers": [
                    "Rethinking Algorithms for Games: Towards High-Fidelity Effects in Interactive Environments.",
                    "Geometric Computing in Shape Space.",
                    "Laplacian Guided Editing, Synthesis, and Simulation.",
                    "Communicating 3D Shape Using Lines.",
                    "Multilinear Motion Synthesis with Level-of-Detail Controls.",
                    "Rubber-like Exaggeration for Character Animation.",
                    "Freeform Image.",
                    "Real-time BreakingWaves for Shallow Water Simulations.",
                    "Fast Hydraulic Erosion Simulation and Visualization on GPU.",
                    "Visualization of Dyeing based on Diffusion and Adsorption Theories.",
                    "Interactive Reaction-Diffusion on Surface Tiles.",
                    "Interactive Global Illumination Using Implicit Visibility.",
                    "Global Illumination for Interactive Lighting Design Using Light Path Pre-Computation and Hierarchical Histogram Estimation.",
                    "Image-Based Proxy Accumulation for Real-Time Soft Global Illumination.",
                    "Statistical Hypothesis Testing for Assessing Monte Carlo Estimators: Applications to Image Synthesis.",
                    "Fogshop: Real-Time Design and Rendering of Inhomogeneous, Single-Scattering Media.",
                    "Model Composition from Interchangeable Components.",
                    "A Data-driven Approach to Human-body Cloning Using a Segmented Body Database.",
                    "Papercraft Models using Generalized Cylinders.",
                    "Precomputed Visibility Cuts for Interactive Relighting with Dynamic BRDFs.",
                    "Illumination Brush: Interactive Design of All-Frequency Lighting.",
                    "Image-Space Caustics and Curvatures.",
                    "The Soft Shadow Occlusion Camera.",
                    "The Mental Canvas: A Tool for Conceptual Architectural Design and Analysis.",
                    "Example-Based Cosmetic Transfer.",
                    "Visualization and Simulation of Near-Body Hydrodynamics Using the Semi-Lagrangian Fluid Simulation Method.",
                    "Fast and Faithful Geometric Algorithm for Detecting Crest Lines on Meshes.",
                    "Genus Oblivious Cross Parameterization: Robust Topological Management of Inter-Surface Maps.",
                    "Efficient Spherical Harmonics Representation of 3D Objects.",
                    "Point-Based Minkowski Sum Boundary.",
                    "Contour Correspondence via Ant Colony Optimization.",
                    "A Delaunay Simplification Algorithm for Vector Fields.",
                    "Explicit Control of Vector Field Based Shape Deformations.",
                    "Visualisation of Implicit Algebraic Curves.",
                    "Extending Catmull-Clark Subdivision and PCCM with Polar Structures.",
                    "Exact Evaluation of Non-Polynomial Subdivision Schemes at Rational Parameter Values.",
                    "Abstract Line Drawings from 2D Images.",
                    "Computer-Generated Papercutting.",
                    "Line Drawing as a Dynamic Process.",
                    "Towards Digital Refocusing from a Single Photograph.",
                    "Brightness Adjustment for HDR and Tone Mapped Images.",
                    "Exposure Fusion.",
                    "Radiometric Compensation through Inverse Light Transport.",
                    "Real-Time Approximate Subsurface Scattering on Graphics Hardware.",
                    "Lighting Details Preserving Photon Density Estimation.",
                    "GPU-Based Monte-Carlo Volume Raycasting.",
                    "Practical Global Illumination for Hair Rendering.",
                    "Faceting Artifact Analysis for Computer Graphics.",
                    "Real-time Sound Generation of Spark Discharge.",
                    "Wrestle Alone : Creating Tangled Motions of Multiple Avatars from Individually Captured Motions.",
                    "Transplanting and Editing Animations on Skinned Meshes.",
                    "Soft-Tissue Deformation for In Vivo Volume Animation.",
                    "Developable Strip Approximation of Parametric Surfaces with Global Error Bounds.",
                    "A New Volumetric Implicit Surface Data Structure and Its Triangulation Algorithm Applied to Mesh Integration.",
                    "A Subdivision Arrangement Algorithm for Semi-Algebraic Curves: An Overview.",
                    "QAS: Real-Time Quadratic Approximation of Subdivision Surfaces.",
                    "Cross-Parameterization for Triangular Meshes with Semantic Features.",
                    "Simple and Efficient Mesh Editing with Consistent Local Frames.",
                    "Color Transfer Brush.",
                    "Automatic Natural Video Matting with Depth.",
                    "Integrative Information Visualization of Multimodality Neuroimaging Data."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th PG 2006",
        "info": "Taipei, Taiwan",
        "venues": []
    },
    {
        "year": "2005",
        "name": "13th PG 2005",
        "info": "Macau",
        "venues": []
    },
    {
        "year": "2004",
        "name": "12th PG 2004",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2004",
                "sub_name": "12th Pacific Conference on Computer Graphics and Applications, PG 2004, Seoul, South Korea, October 6-8, 2004.",
                "count": 43,
                "papers": [
                    "A Robust Method for Shape-Based 3D Model Retrieval.",
                    "Swirling-Sweepers: Constant-Volume Modeling.",
                    "Fitting Subdivision Surfaces to Unorganized Point Data Using SDM.",
                    "Unlifted Loop Subdivision Wavelets.",
                    "Accelerated Geometric Queries and Physical Simulation Using Graphics Processors.",
                    "Real-time Voxelization for Complex Polygonal Models.",
                    "Classification for Fourier Volume Rendering.",
                    "Controllable Single-Strip Generation for Triangulated Surfaces.",
                    "Dual Marching Cubes: Primal Contouring of Dual Grids.",
                    "NeuroEnveloping: A Transferable Character Skin Deformation Technique.",
                    "Snaking Across 3D Meshes.",
                    "Mesh Modelling with Curve Analogies.",
                    "Mwedge3: Marker-Free Model Reconstruction and Motion Tracking from 3D Voxel Data.",
                    "Perceptually Based Approach for Planar Shape Morphing.",
                    "Personalised Real-Time Idle Motion Synthesis.",
                    "Glare Generation Based on Wave Optics.",
                    "Interactive Caustics Using Local Precomputed Irradiance.",
                    "Radiosity for Point-Sampled Geometry.",
                    "CSG Tree Rendering for Point-Sampled Objects.",
                    "Simulation and Control of Physical Phenomena in Computer Graphics.",
                    "Multi-Dimensional Transfer Functions for Interactive 3D Flow Visualization.",
                    "Hardware-Accelerated Reconstruction of Polygonal Isosurface Representations on Unstructured Grids.",
                    "Pattern Oriented Remeshing For Celtic Decoration.",
                    "Direct Anisotropic Quad-Dominant Remeshing.",
                    "Modeling Hairy Plants.",
                    "Discontinuous Free Form Deformations.",
                    "GPU-Based Tolerance Volumes for Mesh Processing.",
                    "Real-Time 3D Fluid Simulation on GPU with Complex Obstacles.",
                    "A Data-Driven Approach for Real-Time Clothes Simulation.",
                    "Physically Based Animation and Rendering of Lightning.",
                    "Intelligent Mesh Scissoring Using 3D Snakes.",
                    "Normal Based Estimation of the Curvature Tensor for Triangular Meshes.",
                    "Segmentation of 3D Meshes through Spectral Clustering.",
                    "Density Measure for Line-Drawing Simplification.",
                    "A Versatile Interactive 3D Brush Model.",
                    "Colored Pencil Filter with Custom Colors.",
                    "Non-Photorealistic Real-Time Rendering of Characteristic Faces.",
                    "A Progressive Refinement Approach for Image Magnification.",
                    "Adaptive Real-Time 3D Acquisition and Contour Tracking within a Multiple Structured Light System.",
                    "An Improved N-Bit to N-Bit Reversible Haar-Like Transform.",
                    "Antialiased Rendering of Self-Intersecting Polygons using Polygon Decomposition.",
                    "Accurate Minkowski Sum Approximation of Polyhedral Models.",
                    "Frequency-Based Environment Matting."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th PG 2003",
        "info": "Canmore, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2003",
                "sub_name": "11th Pacific Conference on Computer Graphics and Applications, PG 2003, Canmore, Canada, October 8-10, 2003.",
                "count": 64,
                "papers": [
                    "Realistic Rendering of Surface Appearance Using GPU.",
                    "Computer Graphics in its Fifth Decade: Ferment at the Foundations.",
                    "Machine Learning for Computer Graphics: A Manifesto and Tutorial.",
                    "Freeform Shape Representations for Efficient Geometry Processing.",
                    "Data-Driven Computer Graphics.",
                    "Lightweight Face Relighting.",
                    "Efficient Rendering of Local Subsurface Scattering.",
                    "Interactive Visualization of Complex Real-World Light Sources.",
                    "Variance Invariant Adaptive Temporal Supersampling for Motion Blurring.",
                    "Illustration Watermarks for Vector Graphics.",
                    "Interactive Modeling of Tree Bark.",
                    "G2 Blending of Corners with Piecewise Algebraic Surfaces.",
                    "Skinning Catmull-Clark Subdivision Surfaces with Incompatible Cross-Sectional Curves.",
                    "Interactive 3D Model Acquisition and Registration.",
                    "Dynamic Sculpting and Deformation of Point Set Surfaces.",
                    "Interactive Global and Local Deformations for Virtual Clay.",
                    "A Painting Interface for Interactive Surface Deformations.",
                    "Non-Photorealistic Rendering and Content-Based Image Retrieval.",
                    "Simulating Wax Crayons.",
                    "Computer-Assisted Auto Coloring by Region Matching.",
                    "Enhancing Silhouette-Based Human Motion Capture with 3D Motion Fields.",
                    "Physical Touch-Up of Human Motions.",
                    "Modeling and Deformation of Arms and Legs Based on Ellipsoidal Sweeping.",
                    "Feature-Based Surface Light Field Morphing.",
                    "Shadow Generation Using Discretized Shadow Volume in Angular Coordinates.",
                    "Adaptive Grouping and Subdivision for Simulating Hair Dynamics.",
                    "A Fast Finite Element Solution for Cloth Modelling.",
                    "Virtual Sandbox.",
                    "Hierarchical Least Squares Conformal Map.",
                    "DStrips: Dynamic Triangle Strips for Real-Time Mesh Simplification and Rendering.",
                    "Bounding Recursive Procedural Models Using Convex Optimization.",
                    "Shape-Similarity Comparison of 3D Models Using Alpha Shapes.",
                    "Breaking the Walls: Scene Partitioning and Portal Creation.",
                    "Feature-Based Visibility-Driven CLOD for Terrain.",
                    "Iso-Splatting: A Point-Based Alternative to Isosurface Visualization.",
                    "High-Quality Point-Based Rendering on Modern GPUs.",
                    "Interactive Volume Illustration and Feature Halos.",
                    "RGVis: Region Growing Based Techniques for Volume Visualization.",
                    "Efficient Representation and Extraction of 2-Manifold Isosurfaces Using kd-Trees.",
                    "A State Machine for Real-Time Cutting of Tetrahedral Meshes.",
                    "Remote Interactive Walkthrough of City Models.",
                    "From a Closed Piecewise Geodesic to a Constriction on a Closed Triangulated Surface.",
                    "Surface Reconstruction with Volume Preservation.",
                    "Neural Meshes: Statistical Learning Based on Normals.",
                    "Automatic Animation Skeleton Construction Using Repulsive Force Field.",
                    "Implicitizing Bi-Cubic Toric Surfaces by Dixon? - Resultant Quotients.",
                    "Combining Topological Simplification and Topology Preserving Compression for 2D Vector Fields.",
                    "OPENNPAR: A System for Developing, Programming, and Designing Non-Photorealistic Animation and Rendering.",
                    "Depth-Peeling for Texture-Based Volume Rendering.",
                    "Blending Multiple Polygonal Shapes.",
                    "Physics Motivated Modeling of Volcanic Clouds as a Two Fluids Model.",
                    "Motion Perturbation Based on Simple Neuromotor Control Models.",
                    "Interactive Global Illumination in Dynamic Environments Using Commodity Graphics Hardware.",
                    "Hybrid Control for Interactive Character Animation.",
                    "Interactive Simulation of Burning Objects.",
                    "An Enhanced Framework for Real-Time Hair Animation.",
                    "INSPIRE: An Interactive Image Assisted Non-Photorealistic Rendering System.",
                    "Using Texture Synthesis for Non-Photorealistic Shading from Paint Samples.",
                    "Particle-Based Visual Simulation of Explosive Flames.",
                    "Optimized Construction of Linear Approximations to Image Data.",
                    "View-Dependent Layered Projective Texture Maps.",
                    "Voxelization in Common Sampling Lattices.",
                    "Butterworth Filtering and Implicit Fairing of Irregular Meshes.",
                    "Physiologically-Based Modeling and Visualization of Deformable Lungs."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th PG 2002",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2002",
                "sub_name": "10th Pacific Conference on Computer Graphics and Applications, PG 2002, Beijing, China, October 9-11, 2002.",
                "count": 71,
                "papers": [
                    "Video-Based Rendering.",
                    "The i-Cone? - A Panoramic Display System for Virtual Environments.",
                    "Approximation with Active B-Spline Curves and Surfaces.",
                    "The Next Frontier in Graphics: Unleashing the Computer?s Potential for Communication.",
                    "Dynamics in Monsters, Inc..",
                    "A Simple Layered RGB BRDF Model.",
                    "Estimation of Multiple Directional Light Sources for Synthesis of Mixed Reality Images.",
                    "Analytic Light Transport Approximations for Volumetric Materials.",
                    "Lighting Interpolation by Shadow Morphing Using Intrinsic Lumigraphs.",
                    "Facial Expression Space Learning.",
                    "May I talk to you? : -)\" - Facial Animation from Text.",
                    "Learning Kernel-Based HMMs for Dynamic Sequence Synthesi.",
                    "Combining 2D Feature Tracking and Volume Reconstruction for Online Video-Based Human Motion Capture.",
                    "Roadmap-Based Flocking for Complex Environments.",
                    "The Light Field Oracle.",
                    "Robust Acquisition of 3D Informations from Short Image Sequences.",
                    "Scan Light Field Rendering.",
                    "Blending Multiple Views.",
                    "Geometric Deformation-Displacement Maps.",
                    "A Simple Method for Modeling Wrinkles on Human Skin.",
                    "Painting Folds Using Expansion Textures.",
                    "Pattern-Based Texture Metamorphosis.",
                    "A Practical and Flexible Tiled Display System.",
                    "Fast and Memory Efficient View-Dependent Trimmed NURBS Rendering.",
                    "Interactive Rendering of Translucent Objects.",
                    "Real-Time Consensus-Based Scene Reconstruction Using Commodity Graphics Hardware.",
                    "Computing Distances between Surfaces Using Line Geometry.",
                    "Isosurface Reconstruction with Topology Control.",
                    "On-Line Graphics Recognition.",
                    "Shape-Similarity Search of Three-Dimensional Models Using Parameterized Statistics.",
                    "Discrete Differential Error Metric for Surface Simplification.",
                    "Compressing Hexahedral Volume Meshes.",
                    "A Divide and Conquer Algorithm for Triangle Mesh Connectivity Encoding.",
                    "A Physics-Based Framework for Subdivision Surface Design with Automatic Rules Control.",
                    "Wandering in VR Environments by Estimating Head Pose Using an Omnicam.",
                    "3D Video Recorder.",
                    "A Hybrid Representation of Environment Models in Image-Based Real Time Walkthrough.",
                    "Hierarchical Representation of Time-Varying Volume Data with \"4th-root-of-2\" Subdivision and Quadrilinear B-Spline Wavelets.",
                    "Scalable Self-Orienting Surfaces: A Compact, Texture-Enhanced Representation for Interactive Visualization of 3D Vector Fields.",
                    "ISpace: Interactive Volume Data Classification Techniques Using Independent Component Analysis.",
                    "Augmenting Computer Graphics with Haptics for the Visualization of Vessel Networks.",
                    "Example-Based Caricature Generation with Exaggeration.",
                    "Visualization of Multidimensional, Multivariate Volume Data Using Hardware-Accelerated Non-Photorealistic Rendering Techniques.",
                    "Two Methods for Creating Chinese Painting.",
                    "An Efficient Brush Model for Physically-Based 3D Painting.",
                    "Interval B-Spline Curve Evaluation Bounding Point Cloud.",
                    "Fast Soft Shadow Visualization for Deformable Moving Light Sources Using Adaptively Sampled Light Field Shadow Maps.",
                    "Interactive Construction of Multi-Segment Curved Handles .",
                    "Interactive Simulation of Fire.",
                    "Adaptive Solid Texturing for Web3D Applications.",
                    "A Method of Human Short Hair Modeling and Real Time Animation.",
                    "On the Effects of Haptic Display in Brush and Ink Simulation for Chinese Painting and Calligraphy.",
                    "Soft Shadow Maps for Area Light by Area Approximation.",
                    "Progress in Collision Detection and Response Techniques for Cloth Animation.",
                    "Normal Compression Based on Clustering and Relative Indexing.",
                    "A Morphing with Geometric Continuity between Two Arbitrary Planar Polygons.",
                    "A Mesh Watermarking Approach for Appearance Attributes.",
                    "A Model Based Technique for Realistic Oriental Painting .",
                    "Cartoon Motion Capture by Shape Matching.",
                    "Selective Non-Uniform Subdivision.",
                    "Texture Mapping with a Jacobian-Based Spatially-Variant Filter.",
                    "Shape-Adaptive 3-D Mesh Simplification Based on Local Optimality Measurement.",
                    "Physically Based Simulation of Cracks on Drying 3D Solid.",
                    "Interactive Physically-Based Cloud Simulation.",
                    "A Simple Approach to Interactive Free-Form Shape Deformations.",
                    "Interactive Visualization of Non-Manifold Implicit Surfaces Using Pre-Integrated Volume Rendering .",
                    "Subdivision Surface Simplification.",
                    "Mesh Metamorphosis with Topology Transformations.",
                    "Single-Image Reflectance Estimation for Relighting by Iterative Soft Grouping.",
                    "Lworld: An Animation System Based on Rewriting.",
                    "Interactive Transfer Function Modification for Volume Rendering Using Pre-Shaded Sample Runs."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th PG 2001",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2001",
                "sub_name": "9th Pacific Conference on Computer Graphics and Applications, PG 2001, Tokyo, Japan, October 16-18, 2001.",
                "count": 44,
                "papers": [
                    "3D Geometry Compression - Recent Advances and Challenges.",
                    "Compressing the Property Mapping of Polygon Meshes.",
                    "An Effective Feature-Preserving Mesh Simplification Scheme Based on Face Constriction.",
                    "FastMesh: Efficient View-Dependent Meshing Renato P.",
                    "Correcting Texture Mapping Errors Introduced by Graphics Hardware.",
                    "Morphing Stick Figures Using Optimized Compatible Triangulations.",
                    "Minimizing the Distortion of Affine Spline Motions.",
                    "Multiresolution Interpolation Meshes.",
                    "Explicit Control of Topological Transitions in Morphing Shapes of 3D Meshes.",
                    "Topology Recognition of 3D Closed Freeform Objects Based on Topological Graphs.",
                    "A 3D Voronoi-Based Skeleton and Associated Surface Features.",
                    "Adaptive Reconstruction of Freeform Objects with 3D SOM Neural Network Grids.",
                    "Progressive 3D Reconstruction from a Sketch Drawing .",
                    "On the Numerical Redundancies of Geometric Constraint Systems.",
                    "Dual Brep-CSG Collision Detection for General Polyhedra.",
                    "A Physical 3D Trackball.",
                    "Sharp Features on Multiresolution Subdivision Surfac.",
                    "Fine Tuning: Curve and Surface Deformation by Scaling Derivatives.",
                    "Direct Reconstruction of Displaced Subdivision Surface from Unorganized Points.",
                    "Stream Bubbles for Steady Flow Visualization.",
                    "Dual Mesh Resampling.",
                    "Adaptive Smoothing Tangential Direction Fields on Polygonal Surfaces.",
                    "Integrating Physics-Based Modeling with PDE Solids for Geometric Design.",
                    "Processing and Rendering of Point Sampled Geometry.",
                    "Visualization-Specific Compression of Large Volume Data.",
                    "A Magnification Lens for Interactive Volume Visualization.",
                    "Accurate Surface Voxelization for Manipulating Volumetric Surfaces and Solids with Application in Simulating Musculoskeletal Surgery.",
                    "Progressive Isosurface Extraction from Tetrahedral Meshes.",
                    "Haptic Sculpting of Volumetric Implicit Functions.",
                    "Modeling the Structure of the Sea Anemone and the Sea Star Using Hierarchical Implicit Surfaces.",
                    "Visibility Preprocessing for Urban Scenes using Line Space Subdivision.",
                    "Adaptive Progressive Vertex Tracing in Distributed Environments.",
                    "Modeling Realistic Virtual Hairstyles.",
                    "Streamline Modeling Based on Potential Flow.",
                    "Animating Human Face under Arbitrary Illumination.",
                    "Non-Photorealistic Rendering Using Watercolor Inspired Textures and Illumination.",
                    "Bridging the Gap between 2D and 3D: A Stream of Digital Animation Techniques.",
                    "Simulation of Peeling Using 3D-Surface Cellular Automata.",
                    "Virtual Autumn Coloring System Based on Biological and Fractal Model.",
                    "Advecting Procedural Textures for 2D Flow Animation.",
                    "A Method for Modeling Clouds Based on Atmospheric Fluid Dynamics.",
                    "Efficient Rendering of Optical Effects within Water Using Graphics Hardware.",
                    "Parallel Volume Rendering Using PC Graphics Hardware.",
                    "Efficient Rendering of Lightning Taking into Account Scattering Effects due to Cloud and Atmospheric Particles."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th PG 2000",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/2000",
                "sub_name": "8th Pacific Conference on Computer Graphics and Applications, PG 2000, Hong Kong, October 3-5, 2000.",
                "count": 59,
                "papers": [
                    "Simulating the Aurora Borealis.",
                    "Rendering Iridescent Colors Appearing on Natural Objects.",
                    "Rendering Natural Waters.",
                    "Interactive Rendering Method for Displaying Shafts of Light.",
                    "Handling Dynamic Changes in Hierarchical Radiosity through Interaction Meshes.",
                    "Enhanced Automatic Creation of Multi-Purpose Object Hierarchies.",
                    "A New Adaptive Density Estimator for Particle-Tracing Radiosity.",
                    "Acceleration of Monte Carlo Path Tracing in General Environments.",
                    "Arbitrary Precise Orientation Specification for Layout of Text.",
                    "Line-Art Rendering of 3D-Models.",
                    "Practical Texture Mapping on Free-Form Surfaces.",
                    "Visibility in the Presence of Occluders with Curved Boundaries.",
                    "Interactive Simulation of Surgical Cuts.",
                    "Simulation of FLIR and LADAR Data Using Graphics Animation Software.",
                    "Modeling of Smoke Flow Taking Obstacles into Account.",
                    "The Intersection of Two Ringed Surfaces.",
                    "Interpolating and Approximating Moving Frames Using B-splines.",
                    "Modeling an Isosurface with a Neural Network.",
                    "Blending Pipe Surfaces with Piecewise Algebraic Surfaces.",
                    "FEM-Based Dynamic Subdivision Splines.",
                    "A New Paradigm for Changing Topology during Subdivision Modeling.",
                    "Subdivision Surface Fitting Using QEM-Based Mesh Simplification and Reconstruction of Approximated B-Spline Surfaces.",
                    "Dynamic PDE Surfaces with Flexible and General Geometric Constraints.",
                    "Efficient Processing of Large 3D Meshes.",
                    "Vertex Data Compression for Triangular Meshes.",
                    "Efficient Coding of Non-Triangular Mesh Connectivity.",
                    "Turning Unorganized Points into Contours.",
                    "A Matrix-Based Approach to Reconstruction of 3D Objects from Three Orthographic Views.",
                    "Constrained and Aggregated Half Space Volume Decomposition: Generating Cutting Patches with 'Internal' and 'External' Extending.",
                    "Using Isosurface Methods for Visualizing the Envelope of a Swept Trivariate Solid.",
                    "TEASAR: Tree-Structure Extraction Algorithm for Accurate and Robust Skeletons.",
                    "Compression of Indoor Video Sequences Using Homography-Based Segmentation.",
                    "Cylindrical 3D Video Display Observable from All Directions.",
                    "Voxel-Coding for Tiling Complex Volumetric Objects.",
                    "Automated Texture Registration and Stitching for Real World Models.",
                    "Collision Detection for Clothed Human Animation.",
                    "Collision Adaptive Particle Systems.",
                    "Morphing Using Curves and Shape Interpolation Techniques.",
                    "Control of Feature-Point-Driven Facial Animation Using a Hypothetical Face.",
                    "Low Cost Immersive Displays: The Cubicle of the Future.",
                    "Intuitive Virtual Grasping for Non Haptic Environments.",
                    "The Metric Cursor.",
                    "CubicalPath - Dynamic Potential Fields for Guided Exploration in Virtual Environments.",
                    "Virtual Spectrophotometric Measurements for Biologically and Physically-based Rendering.",
                    "Mathematical Approximation for Real-Time Lighting Rendering Through Participating Media.",
                    "Non-Distorted Texture Mapping Using Variational Interpolation.",
                    "View-Dependent Continuous Level-of-Detail Rendering of Terrain Model.",
                    "Optimized Triangle Mesh Compression using Prediction Trees.",
                    "Progressive Geometry Compression for Meshes.",
                    "An Automatic Modeling Method for Fitting Volumetric Objects with Metacubes.",
                    "Triangular Bézier Clippin.",
                    "A Particle Model based on Measured Mechanical Properties of Woven Cloth.",
                    "Interactive Manipulation Planning for Animated Characters.",
                    "Optimizing Network 3D Data Transmissions for Interactive Applications.",
                    "Implementation of a Graphics Design Framework on the Web.",
                    "Mesh Construction from Non-Uniformly Distributed and Noisy 3D Points Recovered from Image Sequence.",
                    "Interactive Behavioral Update of Large Flocks.",
                    "A Method for Modeling and Rendering Dunes with Wind-Ripples.",
                    "Animation of Human Locomotion Using Sagittal Elevation Angles."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th PG 1999",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/1999",
                "sub_name": "7th Pacific Conference on Computer Graphics and Applications, PG 1999, Seoul, South Korea, October 5-7, 1999.",
                "count": 33,
                "papers": [
                    "Science of Computer Graphics.",
                    "Creating a Precise Panorama from Panned Video Sequence Images.",
                    "Automatic Camera Placement for Image-Based Modeling.",
                    "Automatic Creation of Object Hierarchies for Radiosity Clustering.",
                    "On-line Motion Retargetting.",
                    "A Speech Driven Talking Head System Based on a Single Face Image.",
                    "Motion Generator Approach to Translating Human Motion from Video to Animation.",
                    "Output Sensitive Extraction of Silhouettes from Polygonal Geometry.",
                    "Exact Computation of 4-D Convex Hulls with Perturbation and Acceleration.",
                    "Boundary Determination for Trivariate Solids.",
                    "A Scan Line Algorithm for Rendering Curved Tubular Objects.",
                    "Opportunities for Subdivision-Based Multiresolution Modeling.",
                    "Wavelet Based 3D Compression with Fast Random Access for Very Large Volume Data.",
                    "An Improved TIN Compression Using Delaunay Triangulation.",
                    "Visualization of Optical Phenomena Caused by Multilayer Films with Complex Refractive Indices.",
                    "VISBONE: 3D Visualization of Bone Mineral Density.",
                    "An Efficient Wavelet-Based Compression Method for Volume Rendering.",
                    "Subdivision Surface Fitting to a Range of Points.",
                    "Multiresolution Constraints for Designing Subdivision Surfaces via Local Smoothing.",
                    "Eigenanalysis and Continuity of Non-Uniform Doo-Sabin Surfaces.",
                    "Adaptive Parameterization for Reconstruction of 3D Freeform Objects from Laser-Scanned Data.",
                    "Reconstruction and Simplification of Surfaces from Contours.",
                    "A Multiscale Deformable Model for Extracting Complex Surfaces from Volume Images.",
                    "Modeling and Rendering Methods of Clouds.",
                    "A Distributed Hybrid Rendering Algorithm for Highly Complex Scenes.",
                    "A Panoramic-Based Walkthrough System Using Real Photos.",
                    "A Method to Generate Wet and Broken-up Animal Fur.",
                    "Volumetric Modeling of Colored Pencil Drawing.",
                    "Making 3D Textures Practical.",
                    "A Discrete Spring Model for Generating Fair Curves and Surfaces.",
                    "Network-Centric Feature-Based Modeling.",
                    "Mesh Approximation Using a Volume-Based Metric.",
                    "Local Injectivity Conditions of 2D and 3D Uniform Cubic B-Spline Functions."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th PG 1998",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/1998",
                "sub_name": "6th Pacific Conference on Computer Graphics and Applications, PG 1998, Singapore, October 26-28, 1998.",
                "count": 27,
                "papers": [
                    "Graphics with Shape Property Inheritance.",
                    "Adaptive Hierarchical B-spline Surface Approximation of Large-Scale Scattered Data.",
                    "Tight Bounding Volumes for Subdivision Surfaces.",
                    "Fair Curve and Surface Design System using Tangent Control.",
                    "Toward Urban Model Acquisition from Geo-Located Images.",
                    "Modeling of Clouds from Satellite Images using Metaballs.",
                    "Nonlinear View Interpolation.",
                    "Efficient Image-based Rendering of Volume Data.",
                    "An Analytical Ray Casting of Volume Data.",
                    "Bounded Clustering 3/4 Finding Good Bounds on Clustered Light Transport.",
                    "An Efficient Shadow Algorithm for Area Light Sources using BSP Trees.",
                    "Shape Space from Deformation.",
                    "General Constrained Deformations based on Generalized Metaballs.",
                    "RECODE: An Image-based Collision Detection Algorithm.",
                    "A Nondeterministic Reconstruction Approach for Isotropic Reflectances and Transmittances.",
                    "Image Talk: A Real Time Synthetic Talking Head Using One Single Image with Chinese Text-To-Speech Capability.",
                    "Design and Implementation of the Maya Renderer.",
                    "Gesticulation Behaviors for Virtual Humans.",
                    "An Efficient Control over Human Running Animation with Extension of Planar Hopper.",
                    "Dust and Water Splashing Models for Hopping Figures.",
                    "Interactive Mesh Dragging with Adaptive Remeshing Technique.",
                    "A Camera Control Interface Based on the Visualization of Subspaces of the 6D Motion Space of the Camera.",
                    "An Infrared Image Synthesis Model.",
                    "Representing Spheres and Ellipsoids Using Periodic NURBS Surfaces with Fewer Control Vertices.",
                    "A C2 Interpolant for Spherical Scattered Data.",
                    "A New Approach for Goal-Oriented Defomation of Voxel Models.",
                    "Automatic Feature Extraction and Face Synthesis in Facial Image Coding."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th PG 1997",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/pg/1997",
                "sub_name": "5th Pacific Conference on Computer Graphics and Applications, PG 1997, Seoul, South Korea, October 13-16, 1997.",
                "count": 22,
                "papers": [
                    "Real-time virtual humans.",
                    "Live Participant's Action Recognition for Virtual Reality Interactions.",
                    "Dynamic Process Management for Avoiding the Confliction between the Development of a Program and a Job for Producing Animation Frames.",
                    "A 3-D string figure display system for animating cat's cradle game.",
                    "A practitioners' assessment of light reflection models.",
                    "Rendering in object interference detection on conventional graphics workstations.",
                    "Rendering of spherical light fields.",
                    "Illuminating image-based objects.",
                    "Hierarchical techniques for global illumination computations-recent trends and developments.",
                    "Modification of n-sided patches based on variation of blending functions.",
                    "3D geometric metamorphosis based on harmonic map.",
                    "Novel Multiresolution Metrics for Content-Based Image Retrieval.",
                    "\"Skeleton climbing\": fast isosurfaces with fewer triangles.",
                    "Incremental view-dependent multiresolution triangulation of terrain.",
                    "Template-based rendering of run-length encoded volumes.",
                    "Fast Volume Rendering using Adaptive Block Subdivision.",
                    "Virtual Stage: a scenario-based karaoke system in a virtual environment.",
                    "Fast color fiducial detection and dynamic workspace extension in video see-through self-tracking augmented reality.",
                    "SharedWeb - A Shared Virtual Environment Over World Wide Web.",
                    "A Visualization Environment for Electron Microscopy.",
                    "Multi-Functional Visualization System for Structure Analysis.",
                    "Vortex flow visualization using tetrahedral cell subdivision."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th PG 1996",
        "info": "Taipei, Taiwan",
        "venues": []
    },
    {
        "year": "1995",
        "name": "3rd PG 1995",
        "info": "Seoul, South Korea",
        "venues": []
    },
    {
        "year": "1994",
        "name": "2nd PG 1994",
        "info": "Beijing, China",
        "venues": []
    },
    {
        "year": "1993",
        "name": "1st PG 1993",
        "info": "Seoul, South Korea",
        "venues": []
    }
]