[
    {
        "year": "2020",
        "name": "I3D 2020",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2020",
                "sub_name": "I3D '20: Symposium on Interactive 3D Graphics and Games, San Francisco, CA, USA, September 15-17, 2020.",
                "count": 17,
                "papers": [
                    "Procedural band patterns.",
                    "Stochastic Substitute Trees for Real-Time Global Illumination.",
                    "Real-time Face Video Swapping From A Single Portrait.",
                    "Repurposing a Relighting Network for Realistic Compositions of Captured Scenes.",
                    "DenseGATs: A Graph-Attention-Based Network for Nonlinear Character Deformation.",
                    "Generalized Microscropic Crowd Simulation using Costs in Velocity Space.",
                    "Interactive Inverse Spatio-Temporal Crowd Motion Design.",
                    "Real-time Muscle-based Facial Animation using Shell Elements and Force Decomposition.",
                    "Contour-based 3D Modeling through Joint Embedding of Shapes and Contours.",
                    "User-guided 3D reconstruction using multi-view stereo.",
                    "Progressive Regularization of Satellite-Based 3D Buildings for Interactive Rendering.",
                    "Automatic GPU Data Compression and Address Swizzling for CPUs via Modified Virtual Address Translation.",
                    "On Ray Reordering Techniques for Faster GPU Ray Tracing.",
                    "Computing Centroidal Voronoi Tessellation Using the GPU.",
                    "RANDM: Random Access Depth Map Compression Using Range-Partitioning and Global Dictionary.",
                    "The Effect of Lighting, Landmarks and Auditory Cues on Human Performance in Navigating a Virtual Maze.",
                    "The Role of the Field Dependence-independence Construct on the Flow-performance Link in Virtual Reality."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "I3D 2019",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2019",
                "sub_name": "Proceedings of the ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, I3D 2019, Montreal, QC, Canada, May 21-23, 2019.",
                "count": 16,
                "papers": [
                    "Aura projection for scalable real-time physics.",
                    "Efficient block pivoting for multibody simulations with contact.",
                    "Dual-split trees.",
                    "Incrementally baked global illumination.",
                    "Fast non-uniform radiance probe placement and tracing.",
                    "High-quality object-space dynamic ambient occlusion for characters using Bi-level regression.",
                    "RGBD temporal resampling for real-time occlusion removal.",
                    "Improved geometric specular antialiasing.",
                    "RLFC: random access light field compression using key views and bounded integer sequence encoding.",
                    "3D mesh animation compression based on adaptive spatio-temporal segmentation.",
                    "Real-time hierarchical facial performance capture.",
                    "Adaptive gaussian mixture trajectory model for physical model control using motion capture data.",
                    "Multi-touch 3D positioning with the pantograph technique.",
                    "Adaptive pointcloud segmentation for assisted interactions.",
                    "Increased affect-arousal in VR can be detected from faster body motion with increased heart rate.",
                    "Dendry: a procedural model for dendritic patterns."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "I3D 2018",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2018",
                "sub_name": "Proceedings of the ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, I3D 2018, Montreal, QC, Canada, May 15-18, 2018.",
                "count": 13,
                "papers": [
                    "Coarse pixel shading with temporal supersampling.",
                    "Combining analytic direct illumination and stochastic shadows.",
                    "Learning real-time ambient occlusion from distance representations.",
                    "Bulk-synchronous parallel simultaneous BVH traversal for collision detection on GPUs.",
                    "Montage4D: interactive seamless fusion of multiview video textures.",
                    "Plane-based multi-view inpainting for image-based rendering in large scenes.",
                    "Efficient screen-space rendering of vector features on virtual terrains.",
                    "Fast behavioral locomotion with layered navigation meshes.",
                    "Mutual collision avoidance during walking in real and collaborative virtual environments.",
                    "An emotion evolution based model for collective behavior simulation.",
                    "A framework for simulating agent-based cooperative tasks in crowd simulation.",
                    "Shape-inspired architectural design.",
                    "Transport path precomputation for real-time room reverb."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "I3D 2017",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2017",
                "sub_name": "Proceedings of the 21st ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, I3D 2017, San Francisco, CA, USA, March 4-5, 2017.",
                "count": 22,
                "papers": [
                    "Tiled light trees.",
                    "Real-time global illumination using precomputed light field probes.",
                    "Interactive cage generation for mesh deformation.",
                    "Parallel continuous collision detection for high-performance GPU cluster.",
                    "Real-time fiber-level cloth rendering.",
                    "Responsive real-time grass rendering for general 3D scenes.",
                    "Hashed alpha testing.",
                    "How2Sketch: generating easy-to-follow tutorials for sketching 3D objects.",
                    "Sketch-based guided modeling of 3D buildings from oriented photos.",
                    "Feature-based volumetric terrain generation.",
                    "Computing delaunay refinement using the GPU.",
                    "Real-time high-quality surface rendering for large scale particle-based fluids.",
                    "Compressing color data for voxelized surface geometry.",
                    "MPTC: video rendering for virtual screens using compressed textures.",
                    "Scene-adaptive high dynamic range display for low latency augmented reality.",
                    "Path compression kd-trees with multi-layer parallel construction a case study on ray tracing.",
                    "ANEEME: interactive mesh cutting using 3D snakes for automatic skeletal rigging of scanned character models.",
                    "Animating escape maneuvers for a school of fish.",
                    "Real-time procedural generation of a growing corn model.",
                    "Real-time sound propagation hardware accelerator for immersive virtual reality 3D audio.",
                    "Textured splat based rendering for stylized shading.",
                    "Towards imperceptible redirected walking: integrating a distractor into the immersive experience."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "I3D 2016",
        "info": "Redmond, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2016",
                "sub_name": "Proceedings of the 20th ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, Redmond, WA, USA, February 26-28, 2016.",
                "count": 35,
                "papers": [
                    "SSVDAGs: symmetry-aware sparse voxel DAGs.",
                    "Exploiting coherence in time-varying voxel data.",
                    "Triangle reordering for reduced overdraw in animated scenes.",
                    "Precision: precomputing environment semantics for contact-rich character animation.",
                    "Dynamically balanced and plausible trajectory planning for human-like characters.",
                    "Path patterns: analyzing and comparing real and simulated crowds.",
                    "Real-time hair mesh simulation.",
                    "Ductile fracture for clustered shape matching.",
                    "Adaptive impulse response modeling for interactive sound propagation.",
                    "Interactive modal sound synthesis using generalized proportional damping.",
                    "Barehanded music: real-time hand interaction for virtual piano.",
                    "Augmented reality instruction for object assembly based on markerless tracking.",
                    "Data-driven adaptive history for image editing.",
                    "Accurate analytic approximations for real-time specular area lighting.",
                    "Sequential Monte Carlo instant radiosity.",
                    "Precomputed illuminance composition for real-time global illumination.",
                    "Real-time rendering of procedural multiscale materials.",
                    "A phenomenological scattering model for order-independent transparency.",
                    "Beyond hard shadows: moment shadow maps for single scattering, soft shadows and translucent occluders.",
                    "A multiview and multilayer approach for interactive ray tracing.",
                    "A framework to transform in-core GPU algorithms to out-of-core algorithms.",
                    "A simulation on grass swaying with dynamic wind force.",
                    "A stochastic and scalable approach for real-time global illumination.",
                    "A technique for matching convergence and accommodation in a fixed screen 3D VR HMD.",
                    "Adaptive deferred shading.",
                    "Compact stokes coordinates for cage-based shapes.",
                    "Disocclusion mitigation for point cloud imposters.",
                    "Extended TimeWarp latency compensation for virtual reality.",
                    "Hardware accelerated mesh colors.",
                    "Natural user interface for integral photography of dispersion-rendered diamond.",
                    "Pressure-based touch positioning techniques for 3D objects.",
                    "Progressive photon mapping with sample elimination.",
                    "Progressive streaming of textured 3D models in a web browser.",
                    "RGB-D IBR: rendering indoor scenes using sparse RGB-D images with local alignments.",
                    "Virtually transforming detect: moving a 2-D gamified health assessment to virtual reality."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "I3D 2015",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2015",
                "sub_name": "Proceedings of the 19th Symposium on Interactive 3D Graphics and Games, San Francisco, CA, USA, February 27 - March 01, 2015.",
                "count": 23,
                "papers": [
                    "Moment shadow mapping.",
                    "Frustum-traced raster shadows: revisiting irregular z-buffers.",
                    "Fast, memory-efficient construction of voxelized shadows.",
                    "Dynamic feature-adaptive subdivision.",
                    "Parallel Reyes-style adaptive subdivision with bounded memory usage.",
                    "Interactive continuous collision detection for topology changing models using dynamic clustering.",
                    "Simulation and rendering for millions of grass blades.",
                    "Position-based fluid control.",
                    "Animating 3D vegetation in real-time using a 2D approach.",
                    "Building helper bone rigs from examples.",
                    "Computer-assisted authoring of interactive narratives.",
                    "Procedural window lighting effects for real-time city rendering.",
                    "Compressed coverage masks for path rendering on mobile GPUs.",
                    "Aggregate G-buffer anti-aliasing.",
                    "Real-time depth of field using multi-layer filtering.",
                    "Accelerating k+-buffer using efficient fragment culling.",
                    "Depixelizing pixel art in real-time.",
                    "iHap: towards a vision substitution system for active analysis of facial expressions.",
                    "Isosurface smoothing using marching cubes and PN-triangles.",
                    "Lace curtain: interactive animation of transparent woven fabric based on microfacet BSDF model.",
                    "Rapid photorealistic blendshapes from commodity RGB-D sensors.",
                    "Real-time landscape-size convective clouds simulation.",
                    "Snake locomotion using position-based dynamics."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "I3D 2014",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2014",
                "sub_name": "Symposium on Interactive 3D Graphics and Games, I3D '14, San Francisco, CA, USA - March 14-16, 2014.",
                "count": 24,
                "papers": [
                    "FORK-1S: interactive compliant mechanisms with parallel state computation.",
                    "Fracture animation based on high-dimensional Voronoi diagrams.",
                    "Sound localization and multi-modal steering for autonomous virtual agents.",
                    "Stochastic activity authoring with direct user control.",
                    "Dynamic radial view based culling for continuous self-collision detection.",
                    "A GPU accelerated algorithm for 3D Delaunay triangulation.",
                    "Fast rotation search for real-time interactive point cloud registration.",
                    "A hybrid image-CAD based system for modeling realistic hairstyles.",
                    "Prefiltered single scattering.",
                    "Deep screen space.",
                    "Efficient virtual shadow maps for many lights.",
                    "Adaptive depth bias for shadow maps.",
                    "Sub-pixel shadow mapping.",
                    "Per-triangle shadow volumes using a view-sample cluster hierarchy.",
                    "Objective image quality assessment of texture compression.",
                    "Real-time low-frequency signal modulated texture compression using intensity dilation.",
                    "Splatting lines: an efficient method for illustrating 3D surfaces and volumes.",
                    "k+-buffer: fragment synchronized k-buffer.",
                    "Multi-layer alpha blending.",
                    "Fully parallel kd-tree construction for real-time ray tracing.",
                    "Interactive 3D cloud modelling with a brush painting interface.",
                    "Out-of-core ray batching on a commodity cluster.",
                    "Shadow map silhouette revectorization.",
                    "Texture mapping for 3D painting using geodesic distance."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "I3D 2013",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2013",
                "sub_name": "Symposium on Interactive 3D Graphics and Games, I3D '13, Orlando, FL, USA, March 22-24, 2013.",
                "count": 39,
                "papers": [
                    "ADAPT: the agent development and prototyping testbed.",
                    "Efficient motion retrieval in large motion databases.",
                    "Hybrid long-range collision avoidance for crowd simulation.",
                    "Interactive mesostructures.",
                    "Flip-flop: convex hull construction via star-shaped polyhedron in 3D.",
                    "Fast global illumination for interactive volume visualization.",
                    "A practical analytic model for the radiosity of translucent scenes.",
                    "Toward practical real-time photon mapping: efficient GPU density estimation.",
                    "Fast percentage closer soft shadows using temporal coherence.",
                    "Fast light-map computation with virtual polygon lights.",
                    "Efficient shading of indirect illumination applying reflective shadow maps.",
                    "Hybrid transparency.",
                    "Multi-view ambient occlusion with importance sampling.",
                    "Approximate depth of field effects using few samples per pixel.",
                    "Filtering color mapped textures and surfaces.",
                    "FasTC: accelerated fixed-rate texture encoding.",
                    "Simple and efficient example-based texture synthesis using tiling and deformation.",
                    "Texture brush: an interactive surface texturing interface.",
                    "Volume stylizer: tomography-based volume painting.",
                    "WYSIWYG stereo painting.",
                    "3D recording as enabling technology for serious games and educational roleplaying.",
                    "A motion synthesis system for dance using a tablet.",
                    "A parallel algorithm for improving the maximal property of Poisson disk sampling in R2 and R3.",
                    "A practical model for computing the BRDF of real world materials.",
                    "A simple method for high quality artist-driven lip syncing.",
                    "Creating a large area of trees based on FOREST PRO.",
                    "Displaying large user-generated virtual worlds from the cloud.",
                    "Dynamics based 3D skeletal hand tracking.",
                    "Fast hair collision handling using slice planes.",
                    "From 3D to reality: projector-based sculpture assistance system.",
                    "Integrating occlusion culling with parallel LOD for rendering complex 3D environments on GPU.",
                    "Modeling agent determination of spatial relationships.",
                    "Physical simulation of an embedded surface mesh involving deformation and fracture.",
                    "Physically-based cosmetic rendering.",
                    "Real-time physics-based ink splattering art creation.",
                    "Real-time water drops and flows on glass panes.",
                    "Splatting lines for 3D mesh illustration.",
                    "Volume-based indirect lighting with irradiance decomposition.",
                    "Warping virtual space for low-cost haptic feedback."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "I3D 2012",
        "info": "Costa Mesa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2012",
                "sub_name": "Symposium on Interactive 3D Graphics and Games, I3D '12, Costa Mesa, CA, USA, March 09 - 11, 2012.",
                "count": 39,
                "papers": [
                    "Tabletop Ensemble: touch-enabled virtual percussion instruments.",
                    "Way portals: efficient multi-agent navigation with line-segment goals.",
                    "Dynamic eye convergence for head-mounted displays improves user performance in virtual environments.",
                    "Constant-time all-pairs geodesic distance query on triangle meshes.",
                    "Computing 2D constrained Delaunay triangulation using the GPU.",
                    "Lossless compression of variable-precision floating-point buffers on GPUs.",
                    "Interactive simulation of dynamic crowd behaviors using general adaptation syndrome theory.",
                    "A lightweight, procedural, vector watercolor painting engine.",
                    "Ray tracing visualization toolkit.",
                    "Sleight of hand: perception of finger motion from reduced marker sets.",
                    "Using natural vibrations to guide control for locomotion.",
                    "An example-based motion synthesis technique for locomotion and object manipulation.",
                    "4D parametric motion graphs for interactive animation.",
                    "A framework for rendering complex scattering effects on hair.",
                    "Real-time multiple scattering using light propagation volumes.",
                    "Interactive rendering of acquired materials on dynamic geometry using bandwidth prediction.",
                    "A reconstruction filter for plausible motion blur.",
                    "Decoupled deferred shading for hardware rasterization.",
                    "Rectilinear texture warping for fast adaptive shadow mapping.",
                    "Surface based anti-aliasing.",
                    "Efficient pixel-accurate rendering of curved surfaces.",
                    "Multiresolution attributes for tessellated meshes.",
                    "Real-time bidirectional path tracing via rasterization.",
                    "Delta radiance transfer.",
                    "Fast, effective BVH updates for animated scenes.",
                    "Animal reality.",
                    "Editing and constraining kinematic approximations of dynamic motion.",
                    "Evaluation of a tangible interface for architectural daylighting analysis.",
                    "Feature-based interactively sketched terrain.",
                    "Hardware accelerated construction of SAH-based bounding volume hierarchies for interactive ray tracing.",
                    "Interactive 3D rapid-prototyping models.",
                    "Interactive GPU-based octree generation and traversal.",
                    "Linear compression for spatially-varying BRDFs.",
                    "Modeling small group behaviors in large crowd simulation.",
                    "Postmortem stylization of open-source games.",
                    "Ray casting for collision detection in haptic rendering of volume data.",
                    "Real-time rough refraction via LEAN mapping and Gaussian sum reduction.",
                    "Realtime volume rendering using precomputed photon mapping.",
                    "Texture compression using wavelet decomposition: a preview."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "I3D 2011",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2011",
                "sub_name": "Symposium on Interactive 3D Graphics and Games, I3D '11, San Francisco, CA, USA, February 18-20, 2011.",
                "count": 41,
                "papers": [
                    "A local image reconstruction algorithm for stochastic rendering.",
                    "Subpixel reconstruction antialiasing for deferred shading.",
                    "High quality elliptical texture filtering on GPU.",
                    "Transmittance function mapping.",
                    "Real-time volumetric shadows using 1D min-max mipmaps.",
                    "Real-time volume caustics with adaptive beam tracing.",
                    "Sound synthesis for impact sounds in video games.",
                    "Collision-streams: fast GPU-based collision detection for deformable models.",
                    "Fast continuous collision detection using parallel filter in subspace.",
                    "Shadow caster culling for efficient shadow mapping.",
                    "Colored stochastic shadow maps.",
                    "Sample distribution shadow maps.",
                    "Voxel-based global illumination.",
                    "Real-time rough refraction.",
                    "Screen-space bias compensation for interactive high-quality global illumination with virtual point lights.",
                    "Motion rings for interactive gait synthesis.",
                    "Realtime human motion control with a small number of inertial sensors.",
                    "A modular framework for adaptive agent-based steering.",
                    "Editable polycube map for GPU-based subdivision surfaces.",
                    "GPU curvature estimation on deformable meshes.",
                    "Urban ecosystem design.",
                    "Data management for SSDs for large-scale interactive graphics applications.",
                    "Coherent image-based rendering of real-world objects.",
                    "Slice WIM: a multi-surface, multi-touch interface for overview+detail exploration of volume datasets in virtual reality.",
                    "Behavior authoring for crowd simulations.",
                    "Chronos Tennis: an online tennis game better than Wii.",
                    "Efficient adaptive tiling for programmable rendering.",
                    "Flexible editing of style, identity and content of human motion.",
                    "Footstep navigation for dynamic crowds.",
                    "gHull: a three-dimensional convex hull algorithm for graphics hardware.",
                    "Image-space constraints for controlling camera interpolation.",
                    "Interactive construction of 3D mathematical visualization models.",
                    "Interactive indirect illumination using voxel cone tracing: a preview.",
                    "Level-of-detail and streaming optimized irradiance normal mapping.",
                    "Multi-pass rendering of stereoscopic video on consumer graphics cards.",
                    "Poisson disk ray-marched ambient occlusion.",
                    "Programming by sketch for scientific computing.",
                    "The research and realization of parameterized three-dimensional plant simulation based on fractal theory.",
                    "Stochastic modeling of light-weight floating objects.",
                    "Supporting internal visualization of biomedical datasets via 3D rapid prototypes and sketch-based gestures.",
                    "Using perceptual features to prioritize ray-based image generation."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "SI3D 2010",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2010",
                "sub_name": "Proceedings of the 2010 Symposium on Interactive 3D Graphics, SI3D 2010, February 19-21, 2010, Washington, DC, USA.",
                "count": 47,
                "papers": [
                    "Fast continuous collision detection using deforming non-penetration filters.",
                    "Interactive fluid-particle simulation using translating Eulerian grids.",
                    "Learning skeletons for shape and pose.",
                    "Frankenrigs: building character rigs from multiple sources.",
                    "Synthesis and editing of personalized stylistic human motion.",
                    "Real-time multi-agent path planning on arbitrary surfaces.",
                    "Efficient sparse voxel octrees.",
                    "On-the-fly decompression and rendering of multiresolution terrain.",
                    "FreePipe: a programmable parallel rendering architecture for efficient multi-fragment effects.",
                    "Parallel Banding Algorithm to compute exact distance transform with the GPU.",
                    "Spatio-temporal upsampling on the GPU.",
                    "Cascaded light propagation volumes for real-time indirect illumination.",
                    "Interactive volume caustics in single-scattering media.",
                    "Epipolar sampling for shadows and crepuscular rays in participating media with single scattering.",
                    "Interactive painterly stylization of images, videos and 3D animations.",
                    "Simple data-driven modeling of brushes.",
                    "Radiance Scaling for versatile surface enhancement.",
                    "Volumetric obscurance.",
                    "Stochastic transparency.",
                    "Fourier opacity mapping.",
                    "Assisted texture assignment.",
                    "LEAN mapping.",
                    "Efficient irradiance normal mapping.",
                    "Tiny encryption algorithm for parallel random numbers on the GPU.",
                    "Every last detail: density based level of detail control for crowd rendering.",
                    "Photorealistic real-time rendering of spherical raindrops with hierarchical reflective and refractive maps.",
                    "Real time ray tracing of point-based models.",
                    "An adaptive splitting and transmission control method for rendering point model on mobile devices.",
                    "Procedural texture particles.",
                    "Distance based illumination as a navigational aid.",
                    "A real-time screened-Poisson solver for interactive surface editing.",
                    "Moving crowds: a linear animation system for crowd simulation.",
                    "Spectral simulation of hybrid bodies with deformable and rigid materials.",
                    "Quickly bounding diagonal edge lengths in tessellated bilinear patches.",
                    "Ambient occlusion volumes.",
                    "Fast capacity constrained Voronoi tessellation.",
                    "Toward a machine learning approach for classifying user goals from user interactions.",
                    "Following multiple unpredictable coherent targets among obstacles.",
                    "Asynchronous rendering.",
                    "Voxel-space ambient occlusion.",
                    "Variance soft shadow mapping.",
                    "Feature-preserving deformation of tessellated surfaces.",
                    "Fluid simulation with rigid body triangle accuracy collision using an heterogeneous GPU/CPU hardware system.",
                    "Direct illumination from dynamic area lights with visibility.",
                    "Real-time rendering of river networks.",
                    "Research and application of 3D engine in the simulation of natural scene.",
                    "BoBlossom: modeling growing plants in games."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "SI3D 2009",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2009",
                "sub_name": "Proceedings of the 2009 Symposium on Interactive 3D Graphics, SI3D 2009, February 27 - March 1, 2009, Boston, Massachusetts, USA.",
                "count": 28,
                "papers": [
                    "Multiscale 3D navigation.",
                    "GigaVoxels: ray-guided streaming for efficient and detailed voxel rendering.",
                    "A novel page-based data structure for interactive walkthroughs.",
                    "Terrain sketching.",
                    "Controlling deformable material with dynamic morph targets.",
                    "Automatic linearization of nonlinear skinning.",
                    "Soft irregular shadow mapping: fast, high-quality, and robust soft shadows.",
                    "Hair self shadowing and transparency depth ordering using occupancy maps.",
                    "Approximating dynamic global illumination in image space.",
                    "Multiresolution splatting for indirect illumination.",
                    "Screen space fluid rendering with curvature flow.",
                    "Real-time fluid simulation using discrete sine/cosine transforms.",
                    "Interactive water streams with sphere scan conversion.",
                    "Fast high-quality line visibility.",
                    "Dynamic solid textures for real-time coherent stylization.",
                    "Laplacian lines for real-time shape illustration.",
                    "Real-time view-dependent rendering of parametric surfaces.",
                    "MLS-based scalar fields over triangle meshes and their application in mesh processing.",
                    "Real-time creased approximate subdivision surfaces.",
                    "Granular visibility queries on the GPU.",
                    "Parallel view-dependent refinement of progressive meshes.",
                    "Efficient and practical audio-visual rendering for games using crossmodal perception.",
                    "Flexible registration of human motion data with parameterized motion models.",
                    "Perceptually consistent example-based human motion retrieval.",
                    "Human video textures.",
                    "Crowd patches: populating large-scale virtual environments for real-time applications.",
                    "Egocentric affordance fields in pedestrian steering.",
                    "Multiscale 3D reference visualization."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "SI3D 2008",
        "info": "Redwood City, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2008",
                "sub_name": "Proceedings of the 2008 Symposium on Interactive 3D Graphics, SI3D 2008, February 15-17, 2008, Redwood City, CA, USA.",
                "count": 24,
                "papers": [
                    "Safe 3D navigation.",
                    "ViewCube: a 3D orientation indicator and controller.",
                    "Large document, small screen: a camera driven scroll and zoom control for mobile devices.",
                    "Real-time particle isosurface extraction.",
                    "Interactive volume isosurface rendering using BT volumes.",
                    "Digital inspection: an interactive stage for viewing surface details.",
                    "Fast collision detection for deformable models using representative-triangles.",
                    "Instant mesh deformation.",
                    "Parallel white noise generation on a GPU via cryptographic hash.",
                    "Computing two-dimensional Delaunay triangulation using graphics hardware.",
                    "Hardware-aware analysis and optimization of stable fluids.",
                    "Fast non-linear projections using graphics hardware.",
                    "The epipolar occlusion camera.",
                    "Automatic construction of 3D models from architectural line drawings.",
                    "Simulating interactions of avatars in high dimensional state space.",
                    "Interactive navigation of multiple agents in crowded environments.",
                    "Polypostors: 2D polygonal impostors for 3D crowds.",
                    "Real-time approximate sorting for self shadowing and transparency in hair rendering.",
                    "Hierarchical caustic maps.",
                    "Interactive multiple anisotropic scattering in clouds.",
                    "Maximum mipmaps for fast, accurate, and scalable dynamic height field rendering.",
                    "Indirection mapping for quasi-conformal relief texturing.",
                    "Precise vector textures for real-time 3D rendering.",
                    "Efficient high dynamic range texture compression."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "SI3D 2007",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2007",
                "sub_name": "Proceedings of the 2007 Symposium on Interactive 3D Graphics, SI3D 2007, April 30 - May 2, 2007, Seattle, Washington, USA.",
                "count": 25,
                "papers": [
                    "Geometry engine optimization: cache friendly compressed representation of geometry.",
                    "Rendering from compressed high dynamic range textures on programmable graphics hardware.",
                    "TileTrees.",
                    "Efficient histogram generation using scattering on GPUs.",
                    "Skinning with dual quaternions.",
                    "Real-time ambient occlusion for dynamic character skins.",
                    "Skinning arbitrary deformations.",
                    "Ambient aperture lighting.",
                    "Queried virtual shadow maps.",
                    "Hardware accelerated ambient occlusion techniques on GPUs.",
                    "4D compression and relighting with high-resolution light transport matrices.",
                    "Real-time refraction through deformable objects.",
                    "Multi-fragment effects on the GPU using the k-buffer.",
                    "Example-based model synthesis.",
                    "Efficient multi-viewpoint acquisition of 3D objects undergoing repetitive motions.",
                    "LightShop: interactive light field manipulation and rendering.",
                    "Parametric motion graphs.",
                    "Interactive motion correction and object manipulation.",
                    "Quick transitions with cached multi-way blends.",
                    "Multi-grained level of detail using a hierarchical seamless texture atlas.",
                    "Real-time mesh simplification using the GPU.",
                    "Interactive k-d tree GPU raytracing.",
                    "Real-time procedural volumetric fire.",
                    "Flow simulation with locally-refined LBM.",
                    "Progressive perceptual audio rendering of complex scenes."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "SI3D 2006",
        "info": "Redwood City, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2006",
                "sub_name": "Proceedings of the 2006 Symposium on Interactive 3D Graphics, SI3D 2006, March 14-17, 2006, Redwood City, California, USA.",
                "count": 28,
                "papers": [
                    "View-dependent precomputed light transport using nonlinear Gaussian function approximations.",
                    "Photorealistic lighting with offset radiance transfer mapping.",
                    "Normal mapping for precomputed radiance transfer.",
                    "Human hand modeling from surface anatomy.",
                    "Human motion estimation from a reduced marker set.",
                    "Animating blendshape faces by cross-mapping motion capture data.",
                    "Knowing when to put your foot down.",
                    "Relief mapping of non-height-field surface details.",
                    "Dynamic parallax occlusion mapping with approximate soft shadows.",
                    "Fast scene voxelization and applications.",
                    "Abstract shade trees.",
                    "Approximate ambient occlusion for trees.",
                    "Splatting indirect illumination.",
                    "Interactive sound synthesis for large scale environments.",
                    "Jump flooding in GPU with applications to Voronoi diagram and distance transform.",
                    "Interactive 3D distance field computation using linear factorization.",
                    "Real-time texture-mapped vector glyphs.",
                    "Multi-scale line drawings from 3D meshes.",
                    "The depth discontinuity occlusion camera.",
                    "Interactive refraction on complex static geometry using spherical harmonics.",
                    "Interactive image-space techniques for approximating caustics.",
                    "Variance shadow maps.",
                    "ShowMotion: camera motion based 3D design review.",
                    "Assisted and automatic navigation in black oil reservoir models based on probabilistic roadmaps.",
                    "Two-D or not Two-D: gender implications of visual cognition in electronic games.",
                    "Hardware accelerated multi-resolution geometry synthesis.",
                    "Perceptually driven interactive geometry remeshing.",
                    "Triangle order optimization for graphics hardware computation culling."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "SI3D 2005",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2005",
                "sub_name": "Proceedings of the 2005 Symposium on Interactive 3D Graphics, SI3D 2005, April 3-6, 2005, Washington, DC, USA.",
                "count": 26,
                "papers": [
                    "Spherical blend skinning: a real-time deformation of articulated models.",
                    "Pose-independent simplification of articulated meshes.",
                    "Reducing blendshape interference by selected motion attenuation.",
                    "A general algorithm for output-sensitive visibility preprocessing.",
                    "Ambient occlusion fields.",
                    "Interactive visibility ordering and transparency computations among geometric primitives in complex environments.",
                    "Interest management middleware for networked games.",
                    "A camera-based interface for interaction with mobile handheld computers.",
                    "HoverCam: interactive 3D navigation for proximal object inspection.",
                    "What you see is what you snap: snapping to geometry deformed on the GPU.",
                    "User interfaces for interactive control of physics-based 3D characters.",
                    "Geopostors: a real-time geometry / impostor crowd rendering system.",
                    "Automatic impostor placement for guaranteed frame rates and low memory requirements.",
                    "Volume catcher.",
                    "A lighting model for general participating media.",
                    "Towards space: time light field rendering.",
                    "Real-time reflection mapping with parallax.",
                    "Interactive deformation of light fields.",
                    "Sketching mesh deformations.",
                    "Real-time relief mapping on arbitrary polygonal surfaces.",
                    "Texture sprites: texture elements splatted on surfaces.",
                    "Adaptive sampling of intersectable models exploiting image and object-space coherence.",
                    "Broad-phase collision detection using semi-adjusting BSP-trees.",
                    "Level-of-detail representation of bidirectional texture functions for real-time rendering.",
                    "ZP+: correct Z-pass stencil shadows.",
                    "Reflective shadow maps."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "SI3D 2003",
        "info": "Monterey, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2003",
                "sub_name": "Proceedings of the 2003 Symposium on Interactive 3D Graphics, SI3D 2003, Monterey, California, USA, April 28-30, 2003.",
                "count": 34,
                "papers": [
                    "Cheating, deceit and sleight-of-hand: how to create good character animation.",
                    "Witness to a natural convergence: distributed simulation, persistent worlds, interactive gaming, command, control, and future ops. What's next?",
                    "A general joint component framework for realistic articulation in human characters.",
                    "An automatic modeling of human bodies from sizing parameters.",
                    "Direct manipulation of interactive character skins.",
                    "Incorporating dynamic real objects into immersive virtual environments.",
                    "Interactive navigation in complex environments using path planning.",
                    "Strangers and friends in caves: an exploratory study of collaboration in networked IPT systems for extended periods of time.",
                    "Non-invasive interactive visualization of dynamic architectural environments.",
                    "Matrix radiance transfer.",
                    "Opacity light fields: interactive rendering of surface light fields with view-dependent opacity.",
                    "Large haptic topographic maps: marsview and the proxy graph algorithm.",
                    "Out-of-core construction and visualization of multiresolution surfaces.",
                    "Interactive visibility culling in complex environments using occlusion-switches.",
                    "Perceptually guided simplification of lit, textured meshes.",
                    "User-guided simplification.",
                    "User-controlled creation of multiresolution meshes.",
                    "Budget sampling of parametric surface patches.",
                    "Smooth meshes for sketch-based freeform modeling.",
                    "Interruptible rendering.",
                    "Shear-image order ray casting volume rendering.",
                    "Interactive image-based rendering using feature globalization.",
                    "Detail synthesis for image-based texturing.",
                    "Application of the two-sided depth test to CSG rendering.",
                    "Snap-together motion: assembling run-time animations.",
                    "Specifying interaction surfaces using interaction maps.",
                    "An evaluation of methods for linking 3D views.",
                    "Pattern based procedural textures.",
                    "Game art.",
                    "Does the metaverse start now?",
                    "The MOVES institute's America's army operations game.",
                    "Using \"CaveUT\" to build immersive displays with the unreal tournament engine and a PC cluster.",
                    "Smoke and mirrors.",
                    "Augmented reality user interfaces and techniques for outdoor modelling."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "SI3D 2001",
        "info": "Chapel Hill, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/2001",
                "sub_name": "Proceedings of the 2001 Symposium on Interactive 3D Graphics, SI3D 2001, Chapel Hill, NC, USA, March 26-29, 2001.",
                "count": 32,
                "papers": [
                    "Hands-free multi-scale navigation in virtual environments.",
                    "Interaction techniques for 3D modeling on large displays.",
                    "A projective drawing system.",
                    "Decomposing polygon meshes for interactive applications.",
                    "Semiautomatic simplification.",
                    "Hierarchical face clustering on polygonal surfaces.",
                    "View-dependent adaptive tessellation of spline surfaces.",
                    "Streaming QSplat: a viewer for networked visualization of large, dense models.",
                    "Online model reconstruction for interactive virtual environments.",
                    "The vacuum buffer.",
                    "Functionally based virtual computer art.",
                    "CavePainting: a fully immersive 3D artistic medium and interactive experience.",
                    "Escher sphere construction kit.",
                    "User-guided composition effects for art-based rendering.",
                    "Animating prairies in real-time.",
                    "HLODs for faster display of large static and dynamic environments.",
                    "Occlusion horizons for driving through urban scenery.",
                    "Computational construction kits for geometric modeling and design (Panel Abstract).",
                    "Spatialized normal come hierarchies.",
                    "Shape by example.",
                    "Fast and simple 2D geometric proximity queries using graphics hardware.",
                    "Variable-precision rendering.",
                    "Curved PN triangles.",
                    "Discontinuity edge overdraw.",
                    "Non-invasive, interactive, stylized rendering.",
                    "Virtual clay: a real-time sculpting system with haptic toolkits.",
                    "A system for interactive molecular dynamics simulation.",
                    "Motion path editing.",
                    "Parameterized environment maps.",
                    "Adaptive unwrapping for interactive texture painting.",
                    "Synthesizing natural textures.",
                    "Real-time fur over arbitrary surfaces."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "SI3D 1999",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1999",
                "sub_name": "Proceedings of the 1999 Symposium on Interactive 3D Graphics, SI3D '99, Atlanta, GA, USA, April 26 - May 2, 1999.",
                "count": 26,
                "papers": [
                    "Localized-hierarchy surface splines (LeSS).",
                    "An interface for sketching 3D curves.",
                    "Interactive curve design using digital French curves.",
                    "Interactive technical illustration.",
                    "Geometric algorithms for message filtering in decentralized virtual environments.",
                    "Preprocessing occlusion for real-time selective refinement.",
                    "Fast collision detection using QuOSPO trees.",
                    "Computing bounding volume hierarchies using model simplification.",
                    "Fast and effective stripification of polygonal surface models.",
                    "GAPS: general and automatic polygonal simplification.",
                    "Compression of time-dependent geometry.",
                    "The design of 3D haptic widgets.",
                    "Haptic sculpting of dynamic surfaces.",
                    "Exploring interactive curve and surface manipulation using a bend and twist sensitive input strip.",
                    "Interactive ray tracing.",
                    "Applications of pixel textures in visualization and realistic image synthesis.",
                    "Image precision silhouette edges.",
                    "Voodoo dolls: seamless interaction at multiple scales in virtual environments.",
                    "Using transparent props for interaction with the virtual table.",
                    "Calibration for augmented reality experimental testbeds.",
                    "Toolspaces and glances: storing, accessing, and retrieving objects in 3D desktop applications.",
                    "UniCam - 2D gestural camera controls for 3D environments.",
                    "Interactive arrangement of botanical L-system models.",
                    "Increased photorealism for interactive architectural walkthroughs.",
                    "Image-based objects.",
                    "MMR: an interactive massive model rendering system using geometric and image-based acceleration."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "SI3D 1997",
        "info": "Providence, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1997",
                "sub_name": "Proceedings of the 1997 Symposium on Interactive 3D Graphics, SI3D '97, Providence, RI, USA, April 27-30, 1997.",
                "count": 24,
                "papers": [
                    "Post-rendering 3D warping.",
                    "Time Critical Lumigraph Rendering.",
                    "Navigating Static Environments Using Image-Space Simplification and Morphing.",
                    "An Evaluation of Techniques for Grabbing and Manipulating Remote Objects in Immersive Virtual Environments.",
                    "Image plane interaction techniques in 3D immersive environments.",
                    "Providing a Low Latency User Experience in a High Latency Application.",
                    "Managing Latency in Complex Augmented Reality Systems.",
                    "View-Dependent Culling of Dynamic Systems in Virtual Environments.",
                    "Multi-Pass Pipeline Rendering: Realism for Dynamic Environments.",
                    "Efficient Radiosity Rendering Using Textures and Bicubic Reconstruction.",
                    "Model Simplification Using Vertex-Clustering.",
                    "Real-Time Occlusion Culling for Models with Large Occluders.",
                    "Accelerated Walkthrough of Large Spline Models.",
                    "Fast Backface Culling Using Normal Masks.",
                    "Two-Handed Direct Manipulation on the Responsive Workbench.",
                    "Two Pointer Input for 3D Interaction.",
                    "Attention and Visual Feedback: The Bimanual Frame of Reference.",
                    "Context Sensitive Flying Interface.",
                    "Interactive Vessel Tracing in Volume Data.",
                    "Motion editing with spacetime constraints.",
                    "3D Chainmail: A Fast Algorithm for Deforming Volumetric Objects.",
                    "Consistent Solid and Boundary Representations from Arbitrary Polygonal Data.",
                    "Interactive Generation of Scherk-Collins Sculptures.",
                    "Direct Haptic Rendering of Sculptured Models."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "SI3D 1995",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1995",
                "sub_name": "Proceedings of the 1995 Symposium on Interactive 3D Graphics, SI3D '95, Monterey, CA, USA, April 9-12, 1995.",
                "count": 33,
                "papers": [
                    "Resolving Occlusion in Augmented Reality.",
                    "Surface Modification Tools in a Virtual Environment Interface to a Scanning Probe Microscope.",
                    "Combatting Rendering Latency.",
                    "Underwater Vehicle Control from a Virtual Environment Interface.",
                    "Interactive Design, Analysis, and Illustration of Assemblies.",
                    "Hierarchical and Variational Geometric Modeling with Wavelets.",
                    "Interactive Shape Metamorphosis.",
                    "Shadow Volume BSP Trees for Computation of Shadows in Dynamic Scenes.",
                    "Interactive Display of Large-Scale NURBS Models.",
                    "Real-Time Programmable Shading.",
                    "Interactive Full Spectral Rendering.",
                    "Interactive Volume Visualization on a Heterogeneous Message-Passing Multicomputer.",
                    "The Sort-First Rendering Architecture for High-Performance Graphics.",
                    "RING: A Client-Server System for Multi-User Virtual Environments.",
                    "NPSNET: A Multi-Player 3D Virtual Environment over the Internet.",
                    "Visual Navigation of Large Environments Using Textured Clusters.",
                    "Guided Navigation of Virtual Environments.",
                    "Portals and Mirrors: Simple, Fast Evaluation of Potentially Visible Sets.",
                    "Interactive Playing with Large Synthetic Environments.",
                    "Of Mice and Monkeys: A Specialized Input Device for Virtual Body Animation.",
                    "A Virtual Space Teleconferencing System that Supports Intuitive Interaction for Creative and Cooperative Work.",
                    "Haptic Rendering: Programming Touch Interaction with Virtual Objects.",
                    "Object Associations: A Simple and Practical Approach to Virtual 3D Manipulation.",
                    "CamDroid: A System for Implementing Intelligent Camera Control.",
                    "3D Painting on Scanned Surfaces.",
                    "Volume Sculpting.",
                    "The Tecate Data Space Exploration Utility.",
                    "An Environment for Real-Time Urban Simulation.",
                    "Mathenautics: Using VR to Visit 3-D Manifolds.",
                    "Tracking a Turbulent Spot in an Immersive Environment.",
                    "Behavioral Control for Real-Time Simulated Human Agents.",
                    "Impulse-Based Simulation of Rigid Bodies.",
                    "I-COLLIDE: An Interactive and Exact Collision Detection System for Large-Scale Environments."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "I3D 1992",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1992",
                "sub_name": "Proceedings of the 1992 Symposium on Interactive 3D Graphics, SI3D '92, Cambridge, MA, USA, March 29 - April 1, 1992.",
                "count": 32,
                "papers": [
                    "Escaping Flatland in User Interface Design.",
                    "Management of Large Amounts of Data in Interactive Building Walkthroughs.",
                    "Fast Object-Precision Shadow Generation for Area Light Source.",
                    "Lights from Highlights and Shadows.",
                    "The Effect of Shadow Quality on the Perception of Spatial Relationships in Computer Generated Imagery.",
                    "A Demonstrated Optical Tracker with Scalable Work Area for Head-Hounted Display Systems.",
                    "Interactive Viewpoint Control and Three-Dimensional Operations.",
                    "Device Synchronization Using an Optimal Linear Filter.",
                    "Manipulating the Future: Predictor Based Deedback for Velocity Control in Virtual Environment Navigation.",
                    "CINEMA: A System for Procedural Camera Movements.",
                    "Automatic Viewing Control for 3D Direct Manipulation.",
                    "Hardware Antialiasing of Lines and Polygons.",
                    "Interactive Volume Rendering on a Multicomputer.",
                    "Real-Time Procedural Textures.",
                    "Geometric Manipulation of Tensor Product Surfaces.",
                    "Computer Interactive Sculpture.",
                    "Designing Solid Objects Using Interactive Sketch Interpretation.",
                    "Interactive Graphics for Plastic Surgery: A Task-Level Analysis and Implementation.",
                    "3DM: A Three Dimensional Modeler Using a Head-Mounted Display.",
                    "Volume Seedlings.",
                    "NPSNET: Constructing a 3D Virtual World.",
                    "Networked Virtual Environments.",
                    "A Framework for Dynamic Visual Applications.",
                    "Linear Constraints for Deformable Non-Uniform B-Spline Surfaces.",
                    "Integrating Constraints and Direct Manipulation.",
                    "Interactive Modeling Enhanced with Constraints and Physics with Applications in Molecular Modeling.",
                    "Three-Dimensional Widgets.",
                    "Implementation of Flying, Scaling and Grabbing in Virtual Worlds.",
                    "A Comparison of Head-Tracked and Non-Head-Tracked Steering Modes in the Targeting of Radiotherapy Treatment Beams.",
                    "Interactive Manipulation and Display of Surfaces in Four Dimensions.",
                    "Visualizing Hyperbolic Space: Unusual Uses of 4x4 Matrices.",
                    "Capstone Address: Human Engineering the User Interface to Spaceland."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "I3D 1990",
        "info": "Snowbird, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1990",
                "sub_name": "Proceedings of the 1990 symposium on Interactive 3D graphics, I3D '90, Snowbird, UT, USA, March 1990.",
                "count": 32,
                "papers": [
                    "Interactive dynamics.",
                    "The virtual erector set: dynamic simulation with linear recursive constraint propagation.",
                    "Direct interaction with a 3D volumetric environment.",
                    "Reality built for two: a virtual reality tool.",
                    "Visualizing n-dimensional virtual worlds with n-vision.",
                    "Design for interactive performance in a virtual laboratory.",
                    "Towards image realism with interactive update rates in complex virtual building environments.",
                    "Improving interaction with radiosity-based lighting simulation programs.",
                    "Acceleration techniques for progressive refinement radiosity.",
                    "Real time radiosity through parallel processing and hardware acceleration.",
                    "Automatic illustration of 3D geometric models: lines.",
                    "T-buffer: fast visualization of relativistic effects in space-time.",
                    "Visualization methods and simulation steering for a 3D turbulence model of Lake Erie.",
                    "Real time spline curves from interactively sketched data.",
                    "Interactive techniques for implicit modeling.",
                    "Rational hypersurface display.",
                    "Physical modeling with B-spline surfaces for interactive design and animation.",
                    "Real-time digital of virtual acoustic environments.",
                    "A viewer for mathematical structures and surfaces in 3D.",
                    "The ThingWorld modeling system: virtual sculpting by modal forces.",
                    "A tool for dynamic explorations of color mappings.",
                    "Distributing display lists on a multicomputer.",
                    "Tracing interactive 3D graphics programs.",
                    "Control of a virtual actor: the roach.",
                    "Exploration and virtual camera control in virtual three dimensional environments.",
                    "Computational complexity versus virtual worlds.",
                    "Snap-dragging in three dimensions.",
                    "A real-time optical 3D tracker for head-mounted display systems.",
                    "Gaze-directed volume rendering.",
                    "3D paint.",
                    "Feeling and seeing: issues in force display.",
                    "Interactive real-time articulated figure manipulation using multiple kinematic constraints."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "I3D 1986",
        "info": "Chapel Hill, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/si3d/1986",
                "sub_name": "Proceedings of the 1986 workshop on Interactive 3D graphics, I3D '86, Chapel Hill, North Carolina, USA, 1986.",
                "count": 19,
                "papers": [
                    "Keynote address (summary only).",
                    "Walkthrough - a dynamic graphics system for simulating virtual buildings.",
                    "4-D display of meteorological data.",
                    "The virtual simulator.",
                    "Special purpose computer arrays for graphics and other applications (invited talk) (summary only).",
                    "3D scan-conversion algorithms for voxel-based graphics.",
                    "Virtual environment display system.",
                    "Interactive tools to support animation tasks.",
                    "Constraints in constructive solid geometry.",
                    "Constructing three-dimensional geometric objects defined by constraints.",
                    "Interactive design of 3-D computer-animated legged animal motion.",
                    "Multi-dimensional input techniques and articulated figure positioning by multiple constraints.",
                    "Understanding key constraints governing human-computer interfaces (abstract only).",
                    "Direct manipulation techniques for 3D objects using 2D locator devices.",
                    "Skitters and jacks: interactive 3D positioning tools.",
                    "Vision and the graphical simulation of spatial structure.",
                    "User interfaces for three-dimensional geometric modelling.",
                    "Describing free-form 3D surfaces for animation.",
                    "Semantics of interactive rotations."
                ]
            }
        ]
    }
]