[
    {
        "name": "SIIMS",
        "year": "2021",
        "info": "Volume 14: 2021",
        "count": 63,
        "papers": [
            "Group Sparse Optimization for Images Recovery Using Capped Folded Concave Functions.",
            "Multi-scale Classification for Electrosensing.",
            "Complex-Valued Imaging with Total Variation Regularization: An Application to Full-Waveform Inversion in Visco-acoustic Media.",
            "On Learned Operator Correction in Inverse Problems.",
            "Strong Solutions for PDE-Based Tomography by Unsupervised Learning.",
            "Compressive Sampling for Array Cameras.",
            "Color Image Restoration by Saturation-Value Total Variation Regularization on Vector Bundles.",
            "Patch-Based Holographic Image Sensing.",
            "Fast Imaging of Sources and Scatterers in a Stratified Ocean Waveguide.",
            "Towards Statistically Provable Geometric 3D Human Pose Recovery.",
            "Correlation Based Imaging for Rotating Satellites.",
            "Determinantal Point Processes for Image Processing.",
            "A Coherent Framework for Learning Spatiotemporal Piecewise-Geodesic Trajectories from Longitudinal Manifold-Valued Data.",
            "A Penalty Relaxation Method for Image Processing Using Euler's Elastica Model.",
            "A Regularized Affine-Scaling Trust-Region Method for Parametric Imaging of Dynamic PET Data.",
            "A Variational Model for Spatially Weighting in Image Fusion.",
            "Deep Neural Networks for Inverse Problems with Pseudodifferential Operators: An Application to Limited-Angle Tomography.",
            "On the Asymptotic Equivalence Between the Radon and the Hough Transforms of Digital Images.",
            "New Restricted Isometry Property Analysis for ℓ1-ℓ2 Minimization Methods.",
            "Multiscale Factorization of the Wave Equation with Application to Compressed Sensing Photoacoustic Tomography.",
            "Recovery of Surfaces and Functions in High Dimensions: Sampling Theory and Links to Neural Networks.",
            "Recovering Missing Data in Coherent Diffraction Imaging.",
            "A Class of Second-Order Geometric Quasilinear Hyperbolic PDEs and Their Application in Imaging.",
            "Centering Noisy Images with Application to Cryo-EM.",
            "A Color Elastica Model for Vector-Valued Image Regularization.",
            "Limited-Angle CT Reconstruction via the L1/L2 Minimization.",
            "Learning Consistent Discretizations of the Total Variation.",
            "Choose Your Path Wisely: Gradient Descent in a Bregman Distance Framework.",
            "Multiscale Hierarchical Image Decomposition and Refinements: Qualitative and Quantitative Results.",
            "Variational Densification and Refinement of Registration Maps.",
            "Modes of Homogeneous Gradient Flows.",
            "Surface-Localized Transmission Eigenstates, Super-resolution Imaging, and Pseudo Surface Plasmon Modes.",
            "Microlocal Analysis of Generalized Radon Transforms from Scattering Tomography.",
            "A Direct Sampling Method for the Inversion of the Radon Transform.",
            "Compressed Sensing Photoacoustic Tomography Reduces to Compressed Sensing for Undersampled Fourier Measurements.",
            "A Weighted Difference of Anisotropic and Isotropic Total Variation for Relaxed Mumford-Shah Color and Multiphase Image Segmentation.",
            "Nonlinear Power Method for Computing Eigenvectors of Proximal Operators and Neural Networks.",
            "Improved Recovery Guarantees and Sampling Strategies for TV Minimization in Compressive Imaging.",
            "A Characteristic Function-Based Algorithm for Geodesic Active Contours.",
            "Learning Maximally Monotone Operators for Image Recovery.",
            "Adaptive Mesh Refinement in Deformable Image Registration: A Posteriori Error Estimates for Primal and Mixed Formulations.",
            "Generalized Intersection Algorithms with Fixed Points for Image Decomposition Learning.",
            "Pseudo-monochromatic Imaging in Industrial X-Ray Computed Tomography.",
            "A Stochastic Variance Reduced Primal Dual Fixed Point Method for Linearly Constrained Separable Optimization.",
            "A Doubly Graduated Method for Inference in Markov Random Field.",
            "Regularization by Denoising via Fixed-Point Projection (RED-PRO).",
            "Simultaneous Reconstruction of Conductivity, Boundary Shape, and Contact Impedances in Electrical Impedance Tomography.",
            "Regularized Kaczmarz Algorithms for Tensor Recovery.",
            "Robust CUR Decomposition: Theory and Imaging Applications.",
            "On the Convergence Rate of Projected Gradient Descent for a Back-Projection Based Objective.",
            "Learnable Descent Algorithm for Nonsmooth Nonconvex Image Reconstruction.",
            "An Inexact Semismooth Newton Method on Riemannian Manifolds with Application to Duality-Based Total Variation Denoising.",
            "An Acousto-electric Inverse Source Problem.",
            "A Sufficient Condition of Optimality for the Relative Pose Problem between Cameras.",
            "Imaging in Random Media by Two-Point Coherent Interferometry.",
            "Sparse Inpainting with Smoothed Particle Hydrodynamics.",
            "Shared Prior Learning of Energy-Based Models for Image Reconstruction.",
            "A Variational Approach to Additive Image Decomposition into Structure, Harmonic, and Oscillatory Components.",
            "Convergent Conformal Energy Minimization for the Computation of Disk Parameterizations.",
            "DIP-VBTV: A Color Image Restoration Model Combining a Deep Image Prior and a Vector Bundle Total Variation.",
            "Provably Robust Blind Source Separation of Linear-Quadratic Near-Separable Mixtures.",
            "Diffeomorphic Image Registration with an Optimal Control Relaxation and Its Implementation.",
            "A Stochastic Proximal Alternating Minimization for Nonsmooth and Nonconvex Optimization."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2020",
        "info": "Volume 13: 2020",
        "count": 75,
        "papers": [
            "Adaptive Variational Model for Contrast Enhancement of Low-Light Images.",
            "Bayesian Inference and Uncertainty Quantification for Medical Image Reconstruction with Poisson Data.",
            "Computation of Circular Area and Spherical Volume Invariants via Boundary Integrals.",
            "Automatically Controlled Morphing of 2D Shapes with Textures.",
            "Nonlinear Iterative Hard Thresholding for Inverse Scattering.",
            "Dictionary Learning for Two-Dimensional Kendall Shapes.",
            "N-Dimensional Tensor Completion for Nuclear Magnetic Resonance Relaxometry.",
            "Multigrid Optimization for Large-Scale Ptychographic Phase Retrieval.",
            "Fisher Information Matrix for Single Molecules with Stochastic Trajectories.",
            "Multimodal 3D Shape Reconstruction under Calibration Uncertainty Using Parametric Level Set Methods.",
            "High-Resolution Interferometric Synthetic Aperture Imaging in Scattering Media.",
            "Trading Beams for Bandwidth: Imaging with Randomized Beamforming.",
            "A Variational Model Dedicated to Joint Segmentation, Registration, and Atlas Generation for Shape Analysis.",
            "Novel Proximal Gradient Methods for Nonnegative Matrix Factorization with Sparsity Constraints.",
            "Extended-Sampling-Bayesian Method for Limited Aperture Inverse Scattering Problems.",
            "Simplifying Transforms for General Elastic Metrics on the Space of Plane Curves.",
            "Higher-Order Total Directional Variation: Analysis.",
            "A High-Order Scheme for Image Segmentation via a Modified Level-Set Method.",
            "Numerical Reconstruction of Radiative Sources in an Absorbing and Nondiffusing Scattering Medium in Two Dimensions.",
            "Convergence of the Time Discrete Metamorphosis Model on Hadamard Manifolds.",
            "Explicit Inversion Formulas for the Two-Dimensional Wave Equation from Neumann Traces.",
            "Fixed Point Analysis of Douglas-Rachford Splitting for Ptychography and Phase Retrieval.",
            "A Variational Image Segmentation Model Based on Normalized Cut with Adaptive Similarity and Spatial Regularization.",
            "Reduced Order Model Approach to Inverse Scattering.",
            "Semisupervised Dictionary Learning with Graph Regularized and Active Points.",
            "Microlocal Analysis of a Compton Tomography Problem.",
            "Reconstruction of the High Resolution Phase in a Closed Loop Adaptive Optics System.",
            "Low-Frequency Electromagnetic Imaging Using Sensitivity Functions and Beamforming.",
            "A Gray Level Indicator-Based Regularized Telegraph Diffusion Model: Application to Image Despeckling.",
            "Convexification for a Three-Dimensional Inverse Scattering Problem with the Moving Point Source.",
            "Accelerating Proximal Markov Chain Monte Carlo by Using an Explicit Stabilized Method.",
            "A Wasserstein-Type Distance in the Space of Gaussian Mixture Models.",
            "On Decomposition Models in Imaging Sciences and Multi-time Hamilton-Jacobi Partial Differential Equations.",
            "Spectral Embedding Norm: Looking Deep into the Spectrum of the Graph Laplacian.",
            "Parallelizable Global Conformal Parameterization of Simply-Connected Surfaces via Partial Welding.",
            "Nonnegative Tensor Patch Dictionary Approaches for Image Compression and Deblurring Applications.",
            "Self-Assignment Flows for Unsupervised Data Labeling on Graphs.",
            "Hypergraph Clustering Using a New Laplacian Tensor with Applications in Image Processing.",
            "Cartoon-Texture Image Decomposition using Orientation Characteristics in Patch Recurrence.",
            "Accelerating Sparse Recovery by Reducing Chatter.",
            "A Diffeomorphic Image Registration Model with Fractional-Order Regularization and Cauchy-Riemann Constraint.",
            "Data Driven Tight Frame for Compressed Sensing MRI Reconstruction via Off-the-Grid Regularization.",
            "Differential Tomography of Micromechanical Evolution in Elastic Materials of Unknown Micro/Macrostructure.",
            "Generalized Correlation-Based Imaging for Satellites.",
            "Mathematical Morphology on the Triangular Grid: The Strict Approach.",
            "Overparameterized Models for Vector Fields.",
            "Relaxed Gauss-Newton Methods with Applications to Electrical Impedance Tomography.",
            "A Discriminative Projection and Representation-Based Classification Framework for Face Recognition.",
            "Superresolution in Recovering Embedded Electromagnetic Sources in High Contrast Media.",
            "Reconstruction of Smooth 3D Color Functions from Keypoints: Application to Lossy Compression and Exemplar-Based Generation of Color LUTs.",
            "A New Efficient Algorithm for Volume-Preserving Parameterizations of Genus-One 3-Manifolds.",
            "Multitaper Estimation on Arbitrary Domains.",
            "Multiplicative Noise Removal: Nonlocal Low-Rank Model and Its Proximal Alternating Reweighted Minimization Algorithm.",
            "Exact Recovery of Multichannel Sparse Blind Deconvolution via Gradient Descent.",
            "3D Orientation-Preserving Variational Models for Accurate Image Registration.",
            "A Three-Stage Variational Image Segmentation Framework Incorporating Intensity Inhomogeneity Information.",
            "Solving Jigsaw Puzzles by the Graph Connection Laplacian.",
            "A Sampling Theorem for Deconvolution in Two Dimensions.",
            "Asymptotic Expansions for Higher Order Elliptic Equations with an Application to Quantitative Photoacoustic Tomography.",
            "Curvature Regularized Surface Reconstruction from Point Clouds.",
            "Compressive Computed Tomography Reconstruction through Denoising Approximate Message Passing.",
            "Common Lines Ab Initio Reconstruction of D2-Symmetric Molecules in Cryo-Electron Microscopy.",
            "Maximum Likelihood Estimation of Regularization Parameters in High-Dimensional Inverse Problems: An Empirical Bayesian Approach Part I: Methodology and Experiments.",
            "Maximum Likelihood Estimation of Regularization Parameters in High-Dimensional Inverse Problems: An Empirical Bayesian Approach. Part II: Theoretical Analysis.",
            "Accelerated Optimization in the PDE Framework Formulations for the Active Contour Case.",
            "Higher-Order Total Directional Variation: Imaging Applications.",
            "Image Segmentation with Partial Convexity Shape Prior Using Discrete Conformality Structures.",
            "A Nonlocal Feature-Driven Exemplar-Based Approach for Image Inpainting.",
            "CURE: Curvature Regularization for Missing Data Recovery.",
            "Anisotropic Adapted Meshes for Image Segmentation: Application to Three-Dimensional Medical Data.",
            "Synthetic Aperture Imaging and Motion Estimation Using Tensor Methods.",
            "Imaging with the Elliptic Radon Transform in Three Dimensions from an Analytical and Numerical Perspective.",
            "Optimal Transport Driven CycleGAN for Unsupervised Learning in Inverse Problems.",
            "An Algorithm for Second Order Mumford-Shah Models Based on a Taylor Jet Formulation.",
            "Multiview Clustering of Images with Tensor Rank Minimization via Nonconvex Approach."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2019",
        "info": "Volume 12: 2019",
        "count": 71,
        "papers": [
            "Three-Dimensional Volume Reconstruction Using Two-Dimensional Parallel Slices.",
            "A Hybrid Adaptive Phase Space Method for Reflection Traveltime Tomography.",
            "Online Deconvolution for Industrial Hyperspectral Imaging Systems.",
            "Scalable Bayesian Uncertainty Quantification in Imaging Inverse Problems via Convex Optimization.",
            "Uniqueness and Direct Imaging Method for Inverse Scattering by Locally Rough Surfaces with Phaseless Near-Field Data.",
            "Blind Ptychographic Phase Retrieval via Convergent Alternating Direction Method of Multipliers.",
            "A Greedy Approach to ℓ0, ∞-Based Convolutional Sparse Coding.",
            "A Convex Approach to Superresolution and Regularization of Lines in Images.",
            "Nonconvex Optimization for 3-Dimensional Point Source Localization Using a Rotating Point Spread Function.",
            "Efficient Relaxations for Dense CRFs with Sparse Higher-Order Potentials.",
            "Sparse Bayesian Imaging of Solar Flares.",
            "Angular Accuracy of Steerable Feature Detectors.",
            "Target Reconstruction with a Reference Point Scatterer using Phaseless Far Field Patterns.",
            "SPARCOM: Sparsity Based Super-resolution Correlation Microscopy.",
            "Non-Lipschitz Models for Image Restoration with Impulse Noise Removal.",
            "A Numerical Framework for Efficient Motion Estimation on Evolving Sphere-Like Surfaces Based on Brightness and Mass Conservation Laws.",
            "Whole Brain Susceptibility Mapping Using Harmonic Incompatibility Removal.",
            "Bayesian 3D Reconstruction of Complex Scenes from Single-Photon Lidar Data.",
            "Structural Connectivity Analysis Using Finsler Geometry.",
            "Convexification Method for an Inverse Scattering Problem and Its Performance for Experimental Backscatter Data for Buried Targets.",
            "Efficient Projection onto the ℓ∞, 1 Mixed-Norm Ball Using a Newton Root Search Method.",
            "Fast Multilevel Algorithms for Compressive Principal Component Pursuit.",
            "Revisiting Maximum-A-Posteriori Estimation in Log-Concave Models.",
            "A Variable Density Sampling Scheme for Compressive Fourier Transform Interferometry.",
            "Sinkhorn Algorithm for Lifted Assignment Problems.",
            "Robust Phase Retrieval Algorithm for Time-Frequency Structured Measurements.",
            "Optimal Transport Approximation of 2-Dimensional Measures.",
            "Shape Reconstruction in Inverse Scattering by an Inhomogeneous Cavity with Internal Measurements.",
            "Inverse Obstacle Scattering for Elastic Waves with Phased or Phaseless Far-Field Data.",
            "Multiplicative Noise Removal for Texture Images Based on Adaptive Anisotropic Fractional Diffusion Equations.",
            "Extended Sampling Method for Inverse Elastic Scattering Problems Using One Incident Wave.",
            "Patch Redundancy in Images: A Statistical Testing Framework and Some Applications.",
            "Quantitative Magnetic Resonance Imaging: From Fingerprinting to Integrated Physics-Based Models.",
            "Color Image Restoration by Saturation-Value Total Variation.",
            "A Flexible Space-Variant Anisotropic Regularization for Image Restoration with Automated Parameter Selection.",
            "A Comparative Study of Different Variants of Newton-Krylov PDE-Constrained Stokes-LDDMM Parameterized in the Space of Band-Limited Vector Fields.",
            "A Novel Algorithm for Volume-Preserving Parameterizations of 3-Manifolds.",
            "Sparsity-Inducing Nonconvex Nonseparable Regularization for Convex Image Processing.",
            "A Blind Source Separation Technique for Document Restoration.",
            "Inverse Acoustic Scattering with Phaseless Far Field Data: Uniqueness, Phase Retrieval, and Direct Sampling Methods.",
            "A New Operator Splitting Method for the Euler Elastica Model for Image Smoothing.",
            "A Corrected Tensor Nuclear Norm Minimization Method for Noisy Low-Rank Tensor Completion.",
            "A Learning-Based Method for Solving Ill-Posed Nonlinear Inverse Problems: A Simulation Study of Lung EIT.",
            "Numerical Inversion of Three-Dimensional Geodesic X-Ray Transform Arising from Travel Time Tomography.",
            "Multiple Relaxation Time Lattice Boltzmann Models for Multigrid Phase-Field Segmentation of Tumors in 3D Ultrasound Images.",
            "Intrinsic Isometric Manifold Learning with Application to Localization.",
            "Computing Quasi-Conformal Folds.",
            "A Two-Stage Algorithm for Joint Multimodal Image Reconstruction.",
            "A Low-Rank Approach to Off-the-Grid Sparse Superresolution.",
            "Dynamic Spike Superresolution and Applications to Ultrafast Ultrasound Imaging.",
            "Analysis of Regularized Kantorovich-Rubinstein Metric and Its Application to Inverse Gravity Problems.",
            "The Multiphase Mumford-Shah Problem.",
            "Edge, Ridge, and Blob Detection with Symmetric Molecules.",
            "Issues with Common Assumptions about the Camera Pipeline and Their Impact in HDR Imaging from Multiple Exposures.",
            "Invariant φ-Minimal Sets and Total Variation Denoising on Graphs.",
            "Well-Posedness for Photoacoustic Tomography with Fabry-Perot Sensors.",
            "A New Variational Model for Joint Image Reconstruction and Motion Estimation in Spatiotemporal Imaging.",
            "Entropy-Based Selection of Cluster Representatives for Document Image Compression.",
            "Directional Compactly Supported Tensor Product Complex Tight Framelets with Applications to Image Denoising and Inpainting.",
            "Continuum Limits of Nonlocal p-Laplacian Variational Problems on Graphs.",
            "Analysis of the Block Coordinate Descent Method for Linear Ill-Posed Problems.",
            "Highly Accurate Matching of Weakly Localized Features.",
            "Multivariate Myriad Filters Based on Parameter Estimation of Student-t Distributions.",
            "Proximal Activation of Smooth Functions in Splitting Algorithms for Convex Image Recovery.",
            "Extraction of Digital Wavefront Sets Using Applied Harmonic Analysis and Deep Neural Networks.",
            "Global Optimality in Separable Dictionary Learning with Applications to the Analysis of Diffusion MRI.",
            "Fast Nonoverlapping Block Jacobi Method for the Dual Rudin-Osher-Fatemi Model.",
            "Large-Scale Bayesian Spatial-Temporal Regression with Application to Cardiac MR-Perfusion Imaging.",
            "Lattice Identification and Separation: Theory and Algorithm.",
            "Reconstruction of Domains with Algebraic Boundaries from Generalized Polarization Tensors.",
            "A Generalization of Wirtinger Flow for Exact Interferometric Inversion."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2018",
        "info": "Volume 11: 2018",
        "count": 87,
        "papers": [
            "Reconstructing Fine Details of Small Objects by Using Plasmonic Spectroscopic Data.",
            "Total Variation-Based Phase Retrieval for Poisson Noise Removal.",
            "Variational Phase Retrieval with Globally Convergent Preconditioned Proximal Algorithm.",
            "A Variational Model for Joint Motion Estimation and Image Reconstruction.",
            "An Anisotropic Inf-Convolution BV Type Model for Dynamic Reconstruction.",
            "A Nonlinear Method for Imaging with Acoustic Waves Via Reduced Order Model Backprojection.",
            "Image Reconstruction with Imperfect Forward Models and Applications in Deblurring.",
            "Motion Smoothing Strategies for 2D Video Stabilization.",
            "Self-Calibration and Bilinear Inverse Problems via Linear Least Squares.",
            "Local Image Structure and Procrustes Metrics.",
            "A Graph Framework for Manifold-Valued Data.",
            "Uniqueness Results for Scattering and Inverse Scattering by Infinite Rough Surfaces with Tapered Wave Incidence.",
            "Total Variation Regularization Strategies in Full-Waveform Inversion.",
            "Dense Scale Selection Over Space, Time, and Space-Time.",
            "A Linear Reaction-Diffusion System with Interior Degeneration for Color Image Compression.",
            "Efficient Bayesian Computation by Proximal Markov Chain Monte Carlo: When Langevin Meets Moreau.",
            "Optimal Compressive Imaging of Fourier Data.",
            "Learning Theory of Randomized Sparse Kaczmarz Method.",
            "Indirect Image Registration with Large Diffeomorphic Deformations.",
            "The Averaged Kaczmarz Iteration for Solving Inverse Problems.",
            "Wasserstein Dictionary Learning: Optimal Transport-Based Unsupervised Nonlinear Dictionary Learning.",
            "Coherence Retrieval Using Trace Regularization.",
            "A Reweighted Joint Spatial-Radon Domain CT Image Reconstruction Model for Metal Artifact Reduction.",
            "Topological Sensitivity for Solving Inverse Multiple Scattering Problems in Three-Dimensional Electromagnetism. Part II: Iterative Method.",
            "A Multiple Measurement Vector Approach to Synthetic Aperture Radar Imaging.",
            "A Sub-Riemannian Modular Framework for Diffeomorphism-Based Analysis of Shape Ensembles.",
            "Image Extrapolation for the Time Discrete Metamorphosis Model: Existence and Applications.",
            "Magnetic Resonance Electrical Impedance Tomography (MREIT): Convergence and Reduced Basis Approach.",
            "Analysis and an Interior-Point Approach for TV Image Reconstruction Problems on Smooth Surfaces.",
            "Optimization Methods for In-Line Holography.",
            "A Joint Segmentation/Registration Model Based on a Nonlocal Characterization of Weighted Total Variation and Nonlocal Shape Descriptors.",
            "Deep Convolutional Framelets: A General Deep Learning Framework for Inverse Problems.",
            "(Quasi)Periodicity Quantification in Video Data, Using Topology.",
            "Inexact Half-Quadratic Optimization for Linear Inverse Problems.",
            "Density-Equalizing Maps for Simply Connected Open Surfaces.",
            "PET-MRI Joint Reconstruction by Joint Sparsity Based Tight Frame Regularization.",
            "Multienergy Cone-Beam Computed Tomography Reconstruction with a Spatial Spectral Nonlocal Means Algorithm.",
            "Covering the Space of Tilts. Application to Affine Invariant Image Comparison.",
            "Lamé Parameter Estimation from Static Displacement Field Measurements in the Framework of Nonlinear Inverse Problems.",
            "Multifractal Analysis of Multivariate Images Using Gamma Markov Random Field Priors.",
            "Image Labeling Based on Graphical Models Using Wasserstein Messages and Geometric Assignment.",
            "An Algorithm for Optimal Transport between a Simplex Soup and a Point Cloud.",
            "Spherical Designs and Nonconvex Minimization for Recovery of Sparse Signals on the Sphere.",
            "Theoretical Analysis of Flows Estimating Eigenfunctions of One-Homogeneous Functionals.",
            "Structural Variability from Noisy Tomographic Projections.",
            "Level Set Regularization Using Geometric Flows.",
            "Blind Source Separation with Outliers in Transformed Domains.",
            "Parameterized Joint Reconstruction of the Initial Pressure and Sound Speed Distributions for Photoacoustic Computed Tomography.",
            "First- and Second-Order Methods for Online Convolutional Dictionary Learning.",
            "A Direct Imaging Method for Inverse Scattering by Unbounded Rough Surfaces.",
            "Maximum Volume Inscribed Ellipsoid: A New Simplex-Structured Matrix Factorization Framework via Facet Enumeration and Convex Optimization.",
            "Imaging Extended Reflectors in a Terminating Waveguide.",
            "On Collaborative Compressive Sensing Systems: The Framework, Design, and Algorithm.",
            "A New Optimization Approach to Sparse Reconstruction of Log-Conductivity in Acousto-Electric Tomography.",
            "Total Generalized Variation for Manifold-Valued Data.",
            "Critical Contours: An Invariant Linking Image Flow with Salient Surface Organization.",
            "Truncated Nuclear Norm Minimization Based Group Sparse Representation for Image Restoration.",
            "Morphing of Manifold-Valued Images Inspired by Discrete Geodesics in Image Spaces.",
            "Reconstructing Fine Details of Small Objects by Using Plasmonic Spectroscopic Data. Part II: The Strong Interaction Regime.",
            "Phase-Space Sketching for Crystal Image Analysis Based on Synchrosqueezed Transforms.",
            "Interpolation of the MacAdam Ellipses.",
            "Plug-and-Play Unplugged: Optimization-Free Reconstruction Using Consensus Equilibrium.",
            "Infimal Convolution of Oscillation Total Generalized Variation for the Recovery of Images with Structured Texture.",
            "Cahn-Hilliard Inpainting with the Double Obstacle Potential.",
            "Denoising AMP for MRI Reconstruction: BM3D-AMP-MRI.",
            "Spectral Methods for Passive Imaging: Nonasymptotic Performance and Robustness.",
            "Finding Low-Rank Solutions via Nonconvex Matrix Factorization, Efficiently and Provably.",
            "BinaryRelax: A Relaxation Approach for Training Deep Neural Networks with Quantized Weights.",
            "Enhancing Compressed Sensing 4D Photoacoustic Tomography by Simultaneous Motion Estimation.",
            "The Steerable Graph Laplacian and its Application to Filtering Image Datasets.",
            "Stochastic Image Models from SIFT-Like Descriptors.",
            "A Numerical Method to Solve a Phaseless Coefficient Inverse Problem from a Single Measurement of Experimental Data.",
            "Compensated Convexity Methods for Approximations and Interpolations of Sampled Functions in Euclidean Spaces: Applications to Contour Lines, Sparse Data, and Inpainting.",
            "Benchmark Problems for Phase Retrieval.",
            "A Texture Synthesis Model Based on Semi-Discrete Optimal Transport in Patch Space.",
            "Composite Optimization by Nonconvex Majorization-Minimization.",
            "Primal and Mixed Finite Element Methods for Deformable Image Registration Problems.",
            "Image Denoising with Generalized Gaussian Mixture Model Patch Priors.",
            "Revisiting Deep Structured Models for Pixel-Level Labeling with Gradient-Based Inference.",
            "Fast Randomized Algorithms for t-Product Based Tensor Operations and Decompositions with Applications to Imaging Data.",
            "Variational Image Regularization with Euler's Elastica Using a Discrete Gradient Scheme.",
            "Exact Camera Location Recovery by Least Unsquared Deviations.",
            "Rendition: Reclaiming What a Black Box Takes Away.",
            "Blind Deconvolution by a Steepest Descent Algorithm on a Quotient Manifold.",
            "Analyzing Reconstruction Artifacts from Arbitrary Incomplete X-ray CT Data.",
            "High-Dimensional Mixture Models for Unsupervised Image Denoising (HDMI).",
            "Image Reconstruction in Quantitative Photoacoustic Tomography with the Simplified P2 Approximation."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2017",
        "info": "Volume 10: 2017",
        "count": 76,
        "papers": [
            "Resistivity Tensor Imaging via Network Discretization of Faraday's Law.",
            "A Unified Approach to the Well-Posedness of Some Non-Lambertian Models in Shape-from-Shading Theory.",
            "A Numerical Framework for Sobolev Metrics on the Space of Curves.",
            "Alternating Direction Method of Multipliers for a Class of Nonconvex and Nonsmooth Problems with Applications to Background/Foreground Extraction.",
            "Multiscale Segmentation via Bregman Distances and Nonlinear Spectral Analysis.",
            "Imaging in Random Media with Convex Optimization.",
            "Kernel Density Estimation on Spaces of Gaussian Distributions and Symmetric Positive Definite Matrices.",
            "Motion Estimation and Correction in Photoacoustic Tomographic Reconstruction.",
            "CLEAR: Covariant LEAst-Square Refitting with Applications to Image Restoration.",
            "Maximum-a-Posteriori Estimation with Bayesian Confidence Regions.",
            "A Geodesic Landmark Shooting Algorithm for Template Matching and Its Applications.",
            "On the Absence of Uniform Recovery in Many Real-World Applications of Compressed Sensing and the Restricted Isometry Property and Nullspace Property in Levels.",
            "Filtrated Algebraic Subspace Clustering.",
            "A Nonlocal Denoising Algorithm for Manifold-Valued Images Using Second Order Statistics.",
            "Multiscale Nonrigid Point Cloud Registration Using Rotation-Invariant Sliced-Wasserstein Distance via Laplace-Beltrami Eigenmap.",
            "ADMM in Krylov Subspace and Its Application to Total Variation Restoration of Spatially Variant Blur.",
            "Steerable Principal Components for Space-Frequency Localized Images.",
            "Analytic Inversion of a Conical Radon Transform Arising in Application of Compton Cameras on the Cylinder.",
            "Fast Magnetic Resonance Electrical Impedance Tomography with Highly Undersampled Data.",
            "Most Likely Separation of Intensity and Warping Effects in Image Registration.",
            "Multi-Domain Regularization Based Computed Tomography for High-Speed Rotation Objects.",
            "High Resolution Inverse Scattering in Two Dimensions Using Recursive Linearization.",
            "Resolution Analysis of Passive Synthetic Aperture Imaging of Fast Moving Objects.",
            "A Tale of Two Bases: Local-Nonlocal Regularization on Image Patches with Convolution Framelets.",
            "Analysis of Iterative Methods in Photoacoustic Tomography with Variable Sound Speed.",
            "Langevin Equations for Landmark Image Registration with Uncertainty.",
            "Template Shape Estimation: Correcting an Asymptotic Bias.",
            "The Generalized Linear Sampling Method for Limited Aperture Measurements.",
            "A Bayesian Topological Framework for the Identification and Reconstruction of Subcellular Motion.",
            "Mathematical Framework for Abdominal Electrical Impedance Tomography to Assess Fatness.",
            "A Block Nonlocal TV Method for Image Restoration.",
            "Graph Similarity through Entropic Manifold Alignment.",
            "A Large-Scale Optimization Method Using a Sparse Approximation of the Hessian for Magnetic Resonance Fingerprinting.",
            "Multifrequency Interferometric Imaging with Intensity-Only Measurements.",
            "Layover Analysis in Synthetic Aperture Imagery.",
            "Active Mean Fields for Probabilistic Image Segmentation: Connections with Chan-Vese and Rudin-Osher-Fatemi Models.",
            "A Joint Sparse Recovery Framework for Accurate Reconstruction of Inclusions in Elastic Media.",
            "Template Estimation in Computational Anatomy: Fréchet Means Top and Quotient Spaces Are Not Consistent.",
            "Rapid Solution of the Cryo-EM Reconstruction Problem by Frequency Marching.",
            "Infimal Convolution of Data Discrepancies for Mixed Noise Removal.",
            "Image Denoising via Multiscale Nonlinear Diffusion Models.",
            "Discrete Total Variation: New Definition and Minimization.",
            "Topological Sensitivity for Solving Inverse Multiple Scattering Problems in Three-dimensional Electromagnetism. Part I: One Step Method.",
            "Numerical Computation of Weil-Peterson Geodesics in the Universal Teichmüller Space.",
            "Truncated l1-2 Models for Sparse Recovery and Rank Minimization.",
            "Imaging Polarizable Dipoles.",
            "The Space of Essential Matrices as a Riemannian Quotient Manifold.",
            "Texture Inpainting Using Efficient Gaussian Conditional Simulation.",
            "Theoretical Analysis of Active Contours on Graphs.",
            "Eigenvalues of Random Matrices with Isotropic Gaussian Noise and the Design of Diffusion Tensor Imaging Experiments.",
            "Point Spread Function Field Learning Based on Optimal Transport Distances.",
            "Imaging of Local Rough Surfaces by the Linear Sampling Method with Near-Field Data.",
            "Conservative Scale Recomposition for Multiscale Denoising (The Devil is in the High Frequency Detail).",
            "Nonconvex-TV Based Image Restoration with Impulse Noise Removal.",
            "Low Dimensional Manifold Model for Image Processing.",
            "Total Variation Denoising in l1 Anisotropy.",
            "Cut Pursuit: Fast Algorithms to Learn Piecewise Constant Functions on General Weighted Graphs.",
            "The Mapping-Adaptive Convolution: A Fundamental Theory for Homography or Perspective Invariant Matching Methods.",
            "The Little Engine That Could: Regularization by Denoising (RED).",
            "Sequential Convex Programming for Computing Information-Theoretic Minimal Partitions: Nonconvex Nonsmooth Optimization.",
            "Nonlocal Means and Optimal Weights for Noise Removal.",
            "Reducing Streaking Artifacts in Quantitative Susceptibility Mapping.",
            "Generalized Sinkhorn Iterations for Regularizing Inverse Problems Using Optimal Mass Transport.",
            "Finite Differences in Forward and Inverse Imaging Problems: MaxPol Design.",
            "Joint Multichannel Deconvolution and Blind Source Separation.",
            "A Forward-Adjoint Operator Pair Based on the Elastic Wave Equation for Use in Transcranial Photoacoustic Computed Tomography.",
            "Guidefill: GPU Accelerated, Artist Guided Geometric Inpainting for 3D Conversion of Film.",
            "A Contrario Detection of Faces: A Case Example.",
            "A Factorization Method for Multifrequency Inverse Source Problems with Sparse Far Field Measurements.",
            "Lattice-Based Patterned Fabric Inspection by Using Total Variation with Sparsity and Low-Rank Representations.",
            "Matched-Filter and Correlation-Based Imaging for Fast Moving Objects Using a Sparse Network of Receivers.",
            "Compton Scattering Tomography: Feature Reconstruction and Rotation-Free Modality.",
            "PCM-TV-TFV: A Novel Two-Stage Framework for Image Reconstruction from Fourier Data.",
            "Extending the Power Watershed Framework Thanks to Γ-Convergence.",
            "Interactive Video Colorization Within a Variational Framework.",
            "Volume Reconstruction from Slices."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2016",
        "info": "Volume 9: 2016",
        "count": 73,
        "papers": [
            "Optimization-Based Approach for Joint X-Ray Fluorescence and Transmission Tomographic Inversion.",
            "A New Algorithm Framework for Image Inpainting in Transform Domain.",
            "Synthetic Aperture Imaging of Direction- and Frequency-Dependent Reflectivities.",
            "Superresolution from a Single Noisy Image by the Median Filter Transform.",
            "Collaborative Total Variation: A General Framework for Vectorial TV Models.",
            "Influence of Unknown Exterior Samples on Interpolated Values for Band-Limited Images.",
            "Imaging with Power Controlled Source Pairs.",
            "Sub-Riemannian Mean Curvature Flow for Image Processing.",
            "Geodesics on Shape Spaces with Bounded Variation and Sobolev Metrics.",
            "A Note on the Size of Denoising Neural Networks.",
            "Patch Ordering as a Regularization for Inverse Problems in Image Processing.",
            "A Smoothed Dual Approach for Variational Wasserstein Problems.",
            "Registration of Multiple Shapes using Constrained Optimal Control.",
            "Aspherical Lens Design and Imaging.",
            "Super-Resolution of Positive Sources: The Discrete Setup.",
            "A Theory of Optimal Flutter Shutter for Probabilistic Velocity Models.",
            "A Method of Reduction of Artifacts of Quantitative Susceptibility Mapping.",
            "Erratum: A Continuous Exact ℓ0 Penalty (CEL0) for Least Squares Regularized Problem.",
            "A Wavelet Frame Method with Shape Prior for Ultrasound Video Segmentation.",
            "Exact Inversion of the Cone Transform Arising in an Application of a Compton Camera Consisting of Line Detectors.",
            "An Efficient Algorithm for Video Superresolution Based on a Sequential Model.",
            "Fiber Orientation Distribution Estimation Using a Peaceman-Rachford Splitting Method.",
            "Total Variation on a Tree.",
            "Fast Algorithms and Efficient GPU Implementations for the Radon Transform and the Back-Projection Operator Represented as Convolution Operators.",
            "Asymptotic Performance of Global Denoising.",
            "Direct, Nonlinear Inversion Algorithm for Hyperbolic Problems via Projection-Based Model Reduction.",
            "A Dissipative Time Reversal Technique for Photoacoustic Tomography in a Cavity.",
            "A Hybrid Segmentation and D-Bar Method for Electrical Impedance Tomography.",
            "An Adaptive Directional Haar Framelet-Based Reconstruction Algorithm for Parallel Magnetic Resonance Imaging.",
            "Mathematical Design of a Novel Gesture-Based Instruction/Input Device Using Wave Detection.",
            "Local Linear Convergence of the ADMM/Douglas-Rachford Algorithms without Strong Convexity and Application to Statistical Imaging.",
            "Synchronization of Independently Moving Cameras via Motion Recovery.",
            "A Parallel Douglas-Rachford Algorithm for Minimizing ROF-like Functionals on Images with Values in Symmetric Hadamard Manifolds.",
            "Multiresolution Parameter Choice Method for Total Variation Regularized Tomography.",
            "Diffeomorphic Surface Registration with Atrophy Constraints.",
            "Off-the-Grid Recovery of Piecewise Constant Images from Few Fourier Samples.",
            "On the Continuous Steering of the Scale of Tight Wavelet Frames.",
            "CT Image Reconstruction by Spatial-Radon Domain Data-Driven Tight Frame Regularization.",
            "Multicontrast MRI Reconstruction with Structure-Guided Total Variation.",
            "Sparsity and Nullity: Paradigms for Analysis Dictionary Learning.",
            "Image Reconstruction in Quantitative Susceptibility Mapping.",
            "Efficient Inclusion of Total Variation Type Priors in Quantitative Photoacoustic Tomography.",
            "Constrained H1-Regularization Schemes for Diffeomorphic Image Registration.",
            "Detectable Singularities from Dynamic Radon Data.",
            "Modulus Methods for Nonnegatively Constrained Image Restoration.",
            "Removing Cradle Artifacts in X-Ray Images of Paintings.",
            "A Direct Imaging Method for Electromagnetic Scattering Data without Phase Information.",
            "An Adaptive Correction Approach for Tensor Completion.",
            "Noninvasive Imaging of Three-Dimensional Micro and Nanostructures by Topological Methods.",
            "A Concise Parametrization of Affine Transformation.",
            "Spectral Decompositions Using One-Homogeneous Functionals.",
            "A New Approach for Robust Segmentation of the Noisy or Textured Images.",
            "Digital Affine Shear Transforms: Fast Realization and Applications in Image/Video Processing.",
            "Convergence Study on the Symmetric Version of ADMM with Larger Step Sizes.",
            "Poisson Noise Reduction with Higher-Order Natural Image Prior Model.",
            "The Linearized Inverse Problem in Multifrequency Electrical Impedance Tomography.",
            "A Fast Relaxed Normal Two Split Method and an Effective Weighted TV Approach for Euler's Elastica Image Inpainting.",
            "Spherical Conformal Parameterization of Genus-0 Point Clouds for Meshing.",
            "A D-Bar Algorithm with A Priori Information for 2-Dimensional Electrical Impedance Tomography.",
            "Fast Phase Retrieval from Local Correlation Measurements.",
            "Coherent Imaging without Phases.",
            "Three-Dimensional Image Reconstruction from Compton Camera Data.",
            "Wasserstein Loss for Image Synthesis and Restoration.",
            "Inertial Proximal Alternating Linearized Minimization (iPALM) for Nonconvex and Nonsmooth Problems.",
            "Differentiable Piecewise-Bézier Surfaces on Riemannian Manifolds.",
            "MAGMA: Multilevel Accelerated Gradient Mirror Descent Algorithm for Large-Scale Convex Composite Minimization.",
            "A Single-Lobe Photometric Stereo Approach for Heterogeneous Material.",
            "A Bayesian Nonparametric Model Coupled with a Markov Random Field for Change Detection in Heterogeneous Remote Sensing Images.",
            "TEMPO: Feature-Endowed Teichmüller Extremal Mappings of Point Clouds.",
            "Spectral Synchronization of Multiple Views in SE(3).",
            "Kernel Metrics on Normal Cycles and Application to Curve Matching.",
            "On the Generation of Sampling Schemes for Magnetic Resonance Imaging.",
            "Robust Surface Reconstruction."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2015",
        "info": "Volume 8: 2015",
        "count": 97,
        "papers": [
            "Modelling the Effect of Focusing Detectors in Photoacoustic Sectional Imaging.",
            "Banach-Like Distances and Metric Spaces of Compact Sets.",
            "FLASH: Fast Landmark Aligned Spherical Harmonic Parameterization for Genus-0 Closed Brain Surfaces.",
            "A New Augmented Lagrangian Approach for L1-mean Curvature Image Denoising.",
            "Covariance Matrix Estimation for the Cryo-EM Heterogeneity Problem.",
            "A Mathematical Model for SAR Imaging beyond the First Born Approximation.",
            "Interior Tomography Using 1D Generalized Total Variation. Part I: Mathematical Foundation.",
            "Signal to Noise Ratio Analysis in Virtual Source Array Imaging.",
            "Inverse Obstacle Scattering in Two Dimensions with Multiple Frequency Data and Multiple Angles of Incidence.",
            "Synthetic Aperture Radar Correlation Imaging.",
            "On Iteratively Reweighted Algorithms for Nonsmooth Nonconvex Optimization in Computer Vision.",
            "Space-Time Regularization for Video Decompression.",
            "Scale Invariant Metrics of Volumetric Datasets.",
            "Proximal Heterogeneous Block Implicit-Explicit Method and Application to Blind Ptychographic Diffraction Imaging.",
            "Detection of Long Edges on a Computational Budget: A Sublinear Approach.",
            "Optical Flow on Moving Manifolds.",
            "Indicator Functions for Shape Reconstruction Related to the Linear Sampling Method.",
            "Luminance-Chrominance Model for Image Colorization.",
            "Convergence Rate of Overlapping Domain Decomposition Methods for the Rudin-Osher-Fatemi Model Based on a Dual Formulation.",
            "Recovering a Function from Circular Means or Wave Data on the Boundary of Parabolic Domains.",
            "Measuring the Noise of Digital Imaging Sensors by Stacking Raw Images Affected by Vibrations and Illumination Flickering.",
            "An Accelerated Linearized Alternating Direction Method of Multipliers.",
            "On the Role of Total Variation in Compressed Sensing.",
            "Simultaneous Cartoon and Texture Image Restoration with Higher-Order Regularization.",
            "Imaging of Buried Objects from Experimental Backscattering Time-Dependent Measurements Using a Globally Convergent Inverse Algorithm.",
            "Non-Local Retinex - A Unifying Framework and Beyond.",
            "The Primal-Dual Hybrid Gradient Method for Semiconvex Splittings.",
            "A Bayesian Approach to Sparse Model Selection in Statistical Shape Models.",
            "Reliable Multiscale and Multiwindow Stereo Matching.",
            "A Global Approach for Solving Edge-Matching Puzzles.",
            "Multifrequency Impedance Imaging with Multiple Signal Classification.",
            "A Time Dependent Variational Approach to Image Restoration.",
            "A Kalman Filtering Perspective for Multiatlas Segmentation.",
            "An Inexact Newton-Krylov Algorithm for Constrained Diffeomorphic Image Registration.",
            "Displacement Reconstructions in Ultrasound Elastography.",
            "Structure Tensor Total Variation.",
            "On the Bertozzi-Esedoglu-Gillette-Cahn-Hilliard Equation with Logarithmic Nonlinear Terms.",
            "On the Optimality of Shape and Data Representation in the Spectral Domain.",
            "Enhancing Pure-Pixel Identification Performance via Preconditioning.",
            "Boosting of Image Denoising Algorithms.",
            "Stable Camera Motion Estimation Using Convex Programming.",
            "A Penalization-Regularization-Operator Splitting Method for Eikonal Based Traveltime Tomography.",
            "Robust Geometry Estimation Using the Generalized Voronoi Covariance Measure.",
            "The Process of Data Formation for the Spectrometer/Telescope for Imaging X-rays (STIX) in Solar Orbiter.",
            "A Proximal Strictly Contractive Peaceman-Rachford Splitting Method for Convex Programming with Applications to Imaging.",
            "Bayesian Mixed Effect Atlas Estimation with a Diffeomorphic Deformation Model.",
            "Dual-Domain Filtering.",
            "Discrete Conformal Deformation: Algorithm and Experiments.",
            "Time Discrete Geodesic Paths in the Space of Images.",
            "Video Compressive Sensing for Spatial Multiplexing Cameras Using Motion-Flow Models.",
            "Enhanced Variational Image Dehazing.",
            "Illumination Strategies for Intensity-Only Imaging.",
            "Invertibility and Estimation of Two-Parameter Polynomial and Division Lens Distortion Models.",
            "A Continuous Exact ℓ0 Penalty (CEL0) for Least Squares Regularized Problem.",
            "An Improved Fast Iterative Shrinkage Thresholding Algorithm for Image Deblurring.",
            "Synthetic Aperture Inversion for Statistically Nonstationary Target and Clutter Scenes.",
            "Stability and Resolution Analysis of Topological Derivative Based Localization of Small Electromagnetic Inclusions.",
            "Diffeomorphic Density Matching by Optimal Information Transport.",
            "Generic Half-Quadratic Optimization for Image Reconstruction.",
            "A Weighted Difference of Anisotropic and Isotropic Total Variation Model for Image Processing.",
            "Compressive Imaging and Characterization of Sparse Light Deflection Maps.",
            "Steerable PCA for Rotation-Invariant Image Recognition.",
            "A Coherence Enhancing Penalty for Diffusion MRI: Regularizing Property and Discrete Approximation.",
            "Variational Approach for Restoring Blurred Images with Cauchy Noise.",
            "Signal Recovery and System Calibration from Multiple Compressive Poisson Measurements.",
            "A Variational Model with Barrier Functionals for Retinex.",
            "Joint Segmentation/Registration Model by Shape Alignment via Weighted Total Variation Minimization and Nonlinear Elasticity.",
            "Linear Multiscale Analysis of Similarities between Images on Riemannian Manifolds: Practical Formula and Affine Covariant Metrics.",
            "Analysis of the Magnetoacoustic Tomography with Magnetic Induction.",
            "Alternating Minimization Algorithm with Automatic Relevance Determination for Transmission Tomography under Poisson Noise.",
            "Sparsity Based Methods for Overparameterized Variational Problems.",
            "Analysis and Application of a Nonlocal Hessian.",
            "Lifting for Blind Deconvolution in Random Mask Imaging: Identifiability and Convex Relaxation.",
            "Inertial Proximal ADMM for Linearly Constrained Separable Convex Optimization.",
            "On Convex Finite-Dimensional Variational Methods in Imaging Sciences and Hamilton-Jacobi Equations.",
            "Linearly Constrained Non-Lipschitz Optimization for Image Restoration.",
            "Entropic Approximation of Wasserstein Gradient Flows.",
            "A Fractional Inpainting Model Based on the Vector-Valued Cahn-Hilliard Equation.",
            "Multiscale Reverse-Time-Migration-Type Imaging Using the Dyadic Parabolic Decomposition of Phase Space.",
            "On the p-Laplacian and ∞-Laplacian on Graphs with Applications in Image and Data Processing.",
            "Interior Tomography Using 1D Generalized Total Variation. Part II: Multiscale Implementation.",
            "A Total Fractional-Order Variation Model for Image Restoration with Nonhomogeneous Boundary Conditions and Its Numerical Solution.",
            "Efficient Blind Compressed Sensing Using Sparsifying Transforms with Convergence Guarantees and Application to Magnetic Resonance Imaging.",
            "Is Repeatability an Unbiased Criterion for Ranking Feature Detectors?",
            "Limiting Aspects of Nonconvex TVφ Models.",
            "Estimation of the Noise Level Function Based on a Nonparametric Detection of Homogeneous Image Regions.",
            "A Convex Approach for Image Restoration with Exact Poisson-Gaussian Likelihood.",
            "Passive Synthetic Aperture Imaging.",
            "Preconditioning of a Generalized Forward-Backward Splitting and Application to Optimization on Graphs.",
            "A PDE Approach to Data-Driven Sub-Riemannian Geodesics in SE(2).",
            "Geometric Expansion for Local Feature Analysis and Matching.",
            "A TGV-Based Framework for Variational Image Decompression, Zooming, and Reconstruction. Part I: Analytics.",
            "A TGV-Based Framework for Variational Image Decompression, Zooming, and Reconstruction. Part II: Numerics.",
            "Convex Cardinal Shape Composition.",
            "Wavelet Statistics of Sparse and Self-Similar Images.",
            "Sparse Wavelet Representations of Spatially Varying Blurring Operators.",
            "Resolution Analysis of Imaging with ℓ1 Optimization."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2014",
        "info": "Volume 7: 2014",
        "count": 99,
        "papers": [
            "Best Algorithms for HDR Image Generation. A Study of Performance Bounds.",
            "Phase Retrieval with Polarization.",
            "Fast Solvers for Cahn-Hilliard Inpainting.",
            "A Two-Stage Image Segmentation Method for Blurry Images with Poisson or Multiplicative Gamma Noise.",
            "Robust Image Reconstruction from Multiview Measurements.",
            "2D Empirical Transforms. Wavelets, Ridgelets, and Curvelets Revisited.",
            "Denoising an Image by Denoising Its Curvature Image.",
            "Optimal Transport with Proximal Splitting.",
            "Backpropagation Imaging in Nonlinear Harmonic Holography in the Presence of Measurement and Medium Noises.",
            "A Proof of Convergence of the Horn-Schunck Optical Flow Algorithm in Arbitrary Dimension.",
            "Convex Relaxation of Vectorial Problems with Coupled Regularization.",
            "Geometric Registration of High-Genus Surfaces.",
            "Image Restoration Using One-Dimensional Sobolev Norm Profiles of Noise and Texture.",
            "Teichmuller Mapping (T-Map) and Its Applications to Landmark Matching Registration.",
            "Modeling and Estimation of Shape Deformation for Topology-Preserving Object Tracking.",
            "A New Convex Optimization Model for Multiplicative Noise and Blur Removal.",
            "Synthesizing and Mixing Stationary Gaussian Texture Models.",
            "On Time Reversal in Photoacoustic Tomography for Tissue Similar to Water.",
            "Intensity Nonuniformity Correction for Brain MR Images with Known Voxel Classes.",
            "Numerical Reconstruction of Electromagnetic Inclusions in Three Dimensions.",
            "A Direct Differential Approach to Photometric Stereo with Perspective Viewing.",
            "Processing Stationary Noise: Model and Parameter Selection in Variational Methods.",
            "How Shading Constrains Surface Patches without Knowledge of Light Sources.",
            "Hypoelliptic Diffusion and Human Vision: A Semidiscrete New Twist.",
            "Adjoint State Method for the Identification Problem in SPECT: Recovery of Both the Source and the Attenuation in the Attenuated X-Ray Transform.",
            "Regularized Generalized Inverse Accelerating Linearized Alternating Minimization Algorithm for Frame-Based Poissonian Image Deblurring.",
            "Partially Blind Deblurring of Barcode from Out-of-Focus Blur.",
            "A Nonlocal Variational Model for Pansharpening Image Fusion.",
            "Generalized Alternating Projection for Weighted-퓁2, 1 Minimization with Applications to Model-Based Compressive Sensing.",
            "Bistatic Synthetic Aperture Radar Imaging of Moving Targets Using Ultra-Narrowband Continuous Waveforms.",
            "Near-Field Imaging of Infinite Rough Surfaces in Dielectric Media.",
            "Approximating the Weil-Petersson Metric Geodesics on the Universal Teichmüller Space by Singular Solutions.",
            "Series Expansions of the Reconstruction Kernel of the Radon Transform over a Cormack-Type Family of Curves with Applications in Tomography.",
            "A Variational Approach for Image Decolorization by Variance Maximization.",
            "Single Image Dehazing and Denoising: A Fast Variational Approach.",
            "Tensor Product Complex Tight Framelets with Increasing Directionality.",
            "Weak*-Convergence to Minimum Energy Measure and Dispersed-Dot Halftoning.",
            "An Algorithm for Variable Density Sampling with Block-Constrained Acquisition.",
            "Multiscale Analysis for Images on Riemannian Manifolds.",
            "Self-Similar Prior and Wavelet Bases for Hidden Incompressible Turbulent Motion.",
            "Role of Scattering in Virtual Source Array Imaging.",
            "The Linearized Bregman Method via Split Feasibility Problems: Analysis and Generalizations.",
            "Bijective Mappings of Meshes with Boundary and the Degree in Mesh Processing.",
            "Image Zooming by Curvature Interpolation and Iterative Refinement.",
            "A New Detail-Preserving Regularization Scheme.",
            "Numerical Implementation of Geodesic X-Ray Transforms and Their Inversion.",
            "Imaging Strong Localized Scatterers with Sparsity Promoting Optimization.",
            "iPiano: Inertial Proximal Algorithm for Nonconvex Optimization.",
            "Successive Nonnegative Projection Algorithm for Robust Nonnegative Blind Source Separation.",
            "Efficient Image Segmentation and Restoration Using Parametric Curve Evolution with Junctions and Topology Changes.",
            "Adapted Basis for Nonlocal Reconstruction of Missing Spectrum.",
            "Left-Invariant Riemannian Geodesics on Spatial Transformation Groups.",
            "Image Decompositions Using Spaces of Variable Smoothness and Integrability.",
            "Fast Alternating Direction Optimization Methods.",
            "Simultaneous High Dynamic Range and Superresolution Imaging without Regularization.",
            "Statistical Shape Analysis of Neuroanatomical Structures via Level-Set-based Shape Morphing.",
            "Inverse Problem in Quantitative Susceptibility Mapping.",
            "On Stable Reconstructions from Nonuniform Fourier Measurements.",
            "Primal-Dual Decomposition by Operator Splitting and Applications to Image Deblurring.",
            "Quantitative Photoacoustic Tomography with Piecewise Constant Material Parameters.",
            "Solving 2D Fredholm Integral from Incomplete Measurements Using Compressive Sensing.",
            "Inverse Elastic Scattering for Multiscale Rigid Bodies with a Single Far-Field Pattern.",
            "Fast Partitioning of Vector-Valued Images.",
            "Regularized Discrete Optimal Transport.",
            "Shape Identification and Classification in Echolocation.",
            "Illusory Shapes via Corner Fusion.",
            "A Total Variation Spectral Framework for Scale and Texture Analysis.",
            "Variable Density Sampling with Continuous Trajectories.",
            "Video Inpainting of Complex Scenes.",
            "NMF with Sparse Regularizations in Transformed Domains.",
            "Resolution-Controlled Conductivity Discretization in Electrical Impedance Tomography.",
            "Reweighted and Adaptive Morphology Separation.",
            "Efficient Point-to-Subspace Query in ℓ1 with Application to Robust Object Instance Recognition.",
            "Solving Quasi-Variational Inequalities for Image Restoration with Adaptive Constraint Sets.",
            "A Relaxed Problem of Registration Based on the Saint Venant-Kirchhoff Material Stored Energy for the Mapping of Mouse Brain Gene Expression Data to a Neuroanatomical Mouse Atlas.",
            "Space Variant Blind Image Restoration.",
            "Total Variation Regularization for Manifold-Valued Data.",
            "On Infimal Convolution of TV-Type Functionals and Applications to Video and Image Reconstruction.",
            "Asymptotic Analysis of Inpainting via Universal Shearlet Systems.",
            "A Nonlocal Variational Formulation for the Improvement of Tone Mapped Images.",
            "Landmark- and Intensity-Based Registration with Large Deformations via Quasi-conformal Maps.",
            "On Covariant Derivatives and Their Applications to Image Regularization.",
            "A New Spherical Mixture Model for Head Detection in Depth Images.",
            "Stein Unbiased GrAdient estimator of the Risk (SUGAR) for Multiple Parameter Selection.",
            "A Biclustering Framework for Consensus Problems.",
            "On the Convergence of Primal-Dual Hybrid Gradient Algorithm.",
            "Imaging of Anisotropic Conductivities from Current Densities in Two Dimensions.",
            "Screened Poisson Hyperfields for Shape Coding.",
            "A Measure-Theoretic Variational Bayesian Algorithm for Large Dimensional Problems.",
            "A Compressed Sensing Framework for Magnetic Resonance Fingerprinting.",
            "A Stochastic Algorithm Based on Fast Marching for Automatic Capacitance Extraction in Non-Manhattan Geometries.",
            "Computation of Quasi-Conformal Surface Maps Using Discrete Beltrami Flow.",
            "Numerical Analysis of the Topological Gradient Method for Fourth Order Models and Applications to the Detection of Fine Structures in Imaging.",
            "Near Field Photometric Stereo with Point Light Sources.",
            "Color Bregman TV.",
            "Complex Composite Derivative and Its Application to Edge Detection.",
            "Imaging with Kantorovich-Rubinstein Discrepancy.",
            "Analysis of Image Registration with Tangent Distance.",
            "Second Order Differences of Cyclic Data and Applications in Variational Denoising."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2013",
        "info": "Volume 6: 2013",
        "count": 96,
        "papers": [
            "Processing Terrain Point Cloud Data.",
            "A Hybrid Reconstruction Method for Quantitative PAT.",
            "A Symbol-Based Algorithm for Decoding Bar Codes.",
            "Conformal Mapping with as Uniform as Possible Conformal Factor.",
            "A Unifying Parametric Framework for 2D Steerable Wavelet Transforms.",
            "Two-Dimensional Tomography from Noisy Projections Taken at Unknown Random Directions.",
            "Simultaneous Reconstruction of Outer Boundary Shape and Admittivity Distribution in Electrical Impedance Tomography.",
            "Phase Retrieval via Matrix Completion.",
            "A Low Patch-Rank Interpretation of Texture.",
            "Symmetrizing Smoothing Filters.",
            "Modeling Active Electrolocation in Weakly Electric Fish.",
            "On the Retrieval of the Directional Scattering Matrix from Directional Noise.",
            "Higher-Order Momentum Distributions and Locally Affine LDDMM Registration.",
            "A Two-Stage Image Segmentation Method Using a Convex Variant of the Mumford-Shah Model and Thresholding.",
            "Hough Transform of Special Classes of Curves.",
            "Regularization Properties of Mumford-Shah-Type Functionals with Perimeter and Norm Constraints for Linear Ill-Posed Problems.",
            "Facial Recognition Using Tensor-Tensor Decompositions.",
            "Vessel Segmentation in Medical Imaging Using a Tight-Frame-Based Algorithm.",
            "Total Generalized Variation in Diffusion Tensor Imaging.",
            "Robust Locally Linear Analysis with Applications to Image Denoising and Blind Inpainting.",
            "A Majorize-Minimize Subspace Approach for ℓ2-ℓ0 Image Regularization.",
            "A Novel Dynamic System in the Space of SPD Matrices with Applications to Appearance Tracking.",
            "Uniqueness and Approximation of a Photometric Shape-from-Shading Model.",
            "Implicit Image Differentiation and Filtering with Applications to Image Sharpening.",
            "Constrained Total Variation Deblurring Models and Fast Algorithms Based on Alternating Direction Method of Multipliers.",
            "Analysis of the Wavelet Ginzburg-Landau Energy in Image Applications with Edges.",
            "A Perfect Match Condition for Point-Set Matching Problems Using the Optimal Mass Transport Approach.",
            "A Family of Shape Ellipticity Measures for Galaxy Classification.",
            "Coded Hyperspectral Imaging and Blind Compressive Sensing.",
            "The Flutter Shutter Paradox.",
            "Clustered Sparsity and Separation of Cartoon and Texture.",
            "Two-Level Convex Relaxed Variational Model for Multiplicative Denoising.",
            "Description of the Minimizers of Least Squares Regularized with 퓁0-norm. Uniqueness of the Global Minimizer.",
            "A Bilevel Optimization Approach for Parameter Learning in Variational Models.",
            "Decay Properties of Riesz Transforms and Steerable Wavelets.",
            "SURE Guided Gaussian Mixture Image Denoising.",
            "Stable Image Reconstruction Using Total Variation Minimization.",
            "Augmented 퓁1 and Nuclear-Norm Models with a Globally Linearly Convergent Algorithm.",
            "Signal-to-Noise Ratio Estimation in Passive Correlation-Based Imaging.",
            "Factorization Method for Electromagnetic Inverse Scattering from Biperiodic Structures.",
            "A Patch-Based Approach for Removing Impulse or Mixed Gaussian-Impulse Noise.",
            "Numerical Recovery of Source Singularities via the Radiative Transfer Equation with Partial Data.",
            "A Generalized Forward-Backward Splitting.",
            "Restoration of Images Corrupted by Impulse Noise and Mixed Gaussian Impulse Noise Using Blind Inpainting.",
            "Dual Constrained TV-based Regularization on Graphs.",
            "A Contrario Selection of Optimal Partitions for Image Segmentation.",
            "A Variational Approach for Image Stitching I.",
            "A Variational Approach for Image Stitching II: Using Image Gradients.",
            "The Frobenius Integrability Theorem and the Blind-Spot Problem for Motor Vehicles.",
            "Nonconvex TVq-Models in Image Restoration: Analysis and a Trust-Region Regularization-Based Superlinearly Convergent Solver.",
            "Image Restoration with a New Class of Forward-Backward-Forward Diffusion Equations of Perona-Malik Type with Applications to Satellite Image Enhancement.",
            "Synthetic Aperture Radar Imaging and Motion Estimation via Robust Principal Component Analysis.",
            "Tracking of a Mobile Target Using Generalized Polarization Tensors.",
            "Estimation Method of the Homodyned K-Distribution Based on the Mean Intensity and Two Log-Moments.",
            "Positive Semidefinite Generalized Diffusion Tensor Imaging via Quadratic Semidefinite Programming.",
            "Box Spline Wavelet Frames for Image Edge Analysis.",
            "Scale Invariant Geometry for Nonrigid Shapes.",
            "A Convex Variational Model for Restoring Blurred Images with Multiplicative Noise.",
            "Tight Convex Relaxations for Vector-Valued Labeling.",
            "A Nonlocal Bayesian Image Denoising Algorithm.",
            "Augmented Lagrangian-Based Sparse Representation Method with Dictionary Updating for Image Deblurring.",
            "Convex Variational Image Restoration with Histogram Priors.",
            "A New Semiblind Deconvolution Approach for Fourier-Based Image Restoration: An Application in Astronomy.",
            "A Block Coordinate Descent Method for Regularized Multiconvex Optimization with Applications to Nonnegative Tensor Factorization and Completion.",
            "Morphological Bilateral Filtering.",
            "A Variational Histogram Equalization Method for Image Contrast Enhancement.",
            "Geometric PCA of Images.",
            "Texture Map and Video Compression Using Beltrami Representation.",
            "An MBO Scheme on Graphs for Classification and Image Processing.",
            "Variational Image Denoising Based on Autocorrelation Whiteness.",
            "An A Contrario Model for Matching Interest Points under Geometric and Photometric Constraints.",
            "Synchrosqueezed Wave Packet Transform for 2D Mode Decomposition.",
            "A Method for Finding Structured Sparse Solutions to Nonnegative Least Squares Problems with Applications.",
            "Level Set Estimation from Projection Measurements: Performance Guarantees and Fast Computation.",
            "Sparse Shape Reconstruction.",
            "Compressive Acquisition of Linear Dynamical Systems.",
            "Subspace Correction Methods for a Class of Nonsmooth and Nonadditive Convex Variational Problems with Mixed L1/L2 Data-Fidelity in Image Processing.",
            "Localization, Stability, and Resolution of Topological Derivative Based Imaging Functionals in Elasticity.",
            "Recovering Over-/Underexposed Regions in Photographs.",
            "A Sharp Sufficient Condition for B-Spline Vector Field Invertibility. Application to Diffeomorphic Registration and Interslice Interpolation.",
            "Sparse Representation Prior and Total Variation-Based Image Deblurring under Impulse Noise.",
            "Locating Multiple Multiscale Electromagnetic Scatterers by a Single Far-Field Measurement.",
            "Analysis of Descent-Based Image Registration.",
            "Fast 3D Blind Seismic Deconvolution via Constrained Total Variation and GCV.",
            "Image Registration with Sparse Approximations in Parametric Dictionaries.",
            "Quantitative Fluorescence Photoacoustic Tomography.",
            "Reconstruction of Surface and Stochastic Dynamics from a Planar Projection of Trajectories.",
            "Orientation Determination of Cryo-EM Images Using Least Unsquared Deviations.",
            "Motion Textures: Modeling, Classification, and Segmentation Using Mixed-State Markov Random Fields.",
            "Wavelet Frame Based Multiphase Image Segmentation.",
            "The Varifold Representation of Nonoriented Shapes for Diffeomorphic Registration.",
            "Discrete Geodesic Calculus in Shape Space and Applications in the Space of Viscous Fluidic Objects.",
            "High-Dimension Multilabel Problems: Convex or Nonconvex Relaxation?",
            "Posterior Expectation of the Total Variation Model: Properties and Experiments.",
            "Fidelity-Beltrami-Sparsity Model for Inverse Problems in Multichannel Image Processing.",
            "Selective Imaging of Extended Reflectors in Two-Dimensional Waveguides."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2012",
        "info": "Volume 5: 2012",
        "count": 46,
        "papers": [
            "Image Denoising Using Mean Curvature of Image Surface.",
            "Dictionary Learning for Noisy and Incomplete Hyperspectral Images.",
            "Adaptive Compressed Image Sensing Using Dictionaries.",
            "Fast Algorithms for Image Reconstruction with Application to Partially Parallel MR Imaging.",
            "Convergence Analysis of Primal-Dual Algorithms for a Saddle-Point Problem: From Contraction Perspective.",
            "A Variational Approach for Sharpening High Dimensional Images.",
            "Coherence Pattern-Guided Compressive Sensing with Unresolved Grids.",
            "A Butterfly Algorithm for Synthetic Aperture Radar Imaging.",
            "Almost Local Metrics on Shape Space of Hypersurfaces in n-Space.",
            "Perspective Shape from Shading: Ambiguity Analysis and Numerical Approximations.",
            "Edge Detection Filter based on Mumford-Shah Green Function.",
            "A Total Variation-Based JPEG Decompression Model.",
            "Sectional Curvature in Terms of the Cometric, with Applications to the Riemannian Manifolds of Landmarks.",
            "Approximating Symmetric Positive Semidefinite Tensors of Even Order.",
            "One Shot Inverse Scattering via Rational Approximation.",
            "Multivalued Geodesic Ray-Tracing for Computing Brain Connections Using Diffusion Tensor Imaging.",
            "A Semismooth Newton Method for Nonlinear Parameter Identification Problems with Impulsive Noise.",
            "The Natural Vectorial Total Variation Which Arises from Geometric Measure Theory.",
            "Multistatic Imaging of Extended Targets.",
            "Sobolev Gradients and Image Interpolation.",
            "A Robust Computational Algorithm for Inverse Photomask Synthesis in Optical Projection Lithography.",
            "On Affine Invariant Descriptors Related to SIFT.",
            "A Random Walk on Image Patches.",
            "Shape Reconstruction with A Priori Knowledge Based on Integral Invariants.",
            "Intrinsic Feature Extraction on Hippocampal Surfaces and Its Applications.",
            "Passive Imaging of Moving Targets Using Sparse Distributed Apertures.",
            "Edge Guided Reconstruction for Compressive Imaging.",
            "Multiscale Mining of fMRI Data with Hierarchical Structured Sparsity.",
            "Wavelet Decomposition Method for L2//TV-Image Deblurring.",
            "Nonnegative Sparse Blind Source Separation for NMR Spectroscopy by Data Clustering, Model Reduction, and 1 Minimization.",
            "High-Order Regularized Regression in Electrical Impedance Tomography.",
            "Oracle Inequalities and Minimax Rates for Nonlocal Means and Related Adaptive Kernel-Based Methods.",
            "A Fast Method for Segmenting Images with Additive Intensity Value.",
            "Nonlocal Active Contours.",
            "Photographing Paintings by Image Fusion.",
            "Viewing Direction Estimation in Cryo-EM Using Synchronization.",
            "Erratum: A Formal Gamma-Convergence Approach for the Detection of Points in 2-D Images.",
            "A Convex Approach to Minimal Partitions.",
            "Regions of Backprojection and Comet Tail Artifacts for Pi-Line Reconstruction Formulas in Tomography.",
            "Communications-Inspired Projection Design with Application to Compressive Sensing.",
            "Gauge Fields in Pictorial Space.",
            "Subpixel Point Spread Function Estimation from Two Photographs at Different Distances.",
            "The Generation of Correlated Gamma Distributed Random Fields for the Simulation of Synthetic Aperture Radar Images.",
            "ShearLab: A Rational Design of a Digital Parabolic Scaling Algorithm.",
            "A Convex Max-Flow Approach to Distribution-Based Figure-Ground Separation.",
            "On the Circular Area Signature for Graphs."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2011",
        "info": "Volume 4: 2011",
        "count": 45,
        "papers": [
            "NESTA: A Fast and Accurate First-Order Method for Sparse Recovery.",
            "Tomographic Reconstruction of the Curl and Divergence of 2D Vector Fields Taking Refractions into Account.",
            "Directional Multiscale Amplitude and Phase Decomposition by the Monogenic Curvelet Transform.",
            "Dithering by Differences of Convex Functions.",
            "A New Geometric Metric in the Space of Curves, and Applications to Tracking Deforming Objects by Prediction and Filtering.",
            "Gradient-Based Methods for Sparse Recovery.",
            "Large Scale Bayesian Inference and Experimental Design for Sparse Linear Models.",
            "Local Tomography and the Motion Estimation Problem.",
            "Particle Filtering with Region-based Matching for Tracking of Partially Occluded and Scaled Targets.",
            "A Helmholtz Principle Approach to Parameter Free Change Detection and Coherent Motion Using Exchangeable Random Variables.",
            "An Upwind Finite-Difference Method for Total Variation-Based Image Smoothing.",
            "Integro-Differential Equations Based on (BV, L1) Image Decomposition.",
            "A Fast Algorithm for Euler's Elastica Model Using Augmented Lagrangian Method.",
            "A Total Variation Model for Retinex.",
            "Continuous Primal-Dual Methods for Image Processing.",
            "Local Image Features Resulting from 3-Dimensional Geometric Features, Illumination, and Movement: II.",
            "Locally Parallel Texture Modeling.",
            "On the Illumination Invariance of the Level Lines under Directed Light: Application to Change Detection.",
            "How Accurate Can Block Matches Be in Stereo Vision?",
            "Dual Carrier Probing for Spaceborne SAR Imaging.",
            "Three-Dimensional Structure Determination from Common Lines in Cryo-EM by Eigenvectors and Semidefinite Programming.",
            "An Accelerated Proximal Gradient Algorithm for Frame-Based Image Restoration via the Balanced Approach.",
            "Level Set Based Multispectral Segmentation with Corners.",
            "Parametric Level Set Methods for Inverse Problems.",
            "Total Variation as a Local Filter.",
            "Line Search Multilevel Optimization as Computational Methods for Dense Optical Flow.",
            "Viewing Angle Classification of Cryo-Electron Microscopy Images Using Eigenvectors.",
            "A Bias-Variance Approach for the Nonlocal Means.",
            "Inversion Formulas for a Cylindrical Radon Transform.",
            "Alternating Direction Method for Image Inpainting in Wavelet Domains.",
            "Adaptive Time-Frequency Detection and Filtering for Imaging in Heavy Clutter.",
            "An Efficient Neumann Series-Based Algorithm for Thermoacoustic and Photoacoustic Tomography with Variable Sound Speed.",
            "Image-Driven Parameter Estimation in Absorption-Diffusion Models of Chromoscopy.",
            "Combinatorial Continuous Maximum Flow.",
            "Efficient Deterministic Compressed Sensing for Images with Chirps and Reed-Muller Codes.",
            "Contour Stencils: Total Variation along Curves for Adaptive Image Interpolation.",
            "Image Inpainting Based on Coherence Transport with Adapted Distance Functions.",
            "How to Transform and Filter Images Using Iterated Function Systems.",
            "A Mumford-Shah-Like Method for Limited Data Tomography with an Application to Electron Tomography.",
            "Continuous Multiclass Labeling Approaches and Algorithms.",
            "Transient Wave Imaging with Limited-View Data.",
            "Robust Video Restoration by Joint Sparse and Low Rank Matrix Approximation.",
            "Geometrically Guided Exemplar-Based Inpainting.",
            "Theory of Waveform-Diverse Moving-Target Spotlight Synthetic-Aperture Radar.",
            "Mumford-Shah-Euler Flow with Sphere Constraint and Applications to Color Image Inpainting."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2010",
        "info": "Volume 3: 2010",
        "count": 45,
        "papers": [
            "Multiplicative Noise Removal with Spatially Varying Regularization Parameters.",
            "Higher-Order Feature-Preserving Geometric Regularization.",
            "Optimized Conformal Surface Registration with Shape-based Landmark Matching.",
            "Sensitivity Analysis of Multichannel Images Intended for Instantaneous Imaging Spectrometry Applications.",
            "A Geometric Approach to Joint 2D Region-Based Segmentation and 3D Pose Estimation Using a 3D Shape Prior.",
            "Numerical Algorithms for Polyenergetic Digital Breast Tomosynthesis Reconstruction.",
            "Application of the Topological Gradient Method to Color Image Restoration.",
            "Diffeomorphic Active Contours.",
            "A Semismooth Newton Method for L1 Data Fitting with Automatic Choice of Regularization Parameters and Noise Calibration.",
            "Improved Total Variation-Type Regularization Using Higher Order Edge Detectors.",
            "Bregmanized Nonlocal Regularization for Deconvolution and Sparse Reconstruction.",
            "A Multiphase Image Segmentation Method Based on Fuzzy Region Competition.",
            "Augmented Lagrangian Method, Dual Methods, and Split Bregman Iteration for ROF, Vectorial TV, and High Order Models.",
            "Reconstruction of Thin Tubular Inclusions in Three-Dimensional Domains Using Electrical Impedance Tomography.",
            "Multigrid Algorithm for High Order Denoising.",
            "Reciprocity Theorems for One-Way Wave Fields in Curvilinear Coordinate Systems.",
            "Higher Order Positive Semidefinite Diffusion Tensor Imaging.",
            "Reinterpretation and Enhancement of Signal-Subspace-Based Imaging Methods for Extended Scatterers.",
            "Sparse Signal Reconstruction via Iterative Support Detection.",
            "Total Generalized Variation.",
            "Nonparametric Regression between General Riemannian Manifolds.",
            "Automatic Grid Resolution and Efficient Triangulation of Implicit Vector Field.",
            "A Formal Gamma-Convergence Approach for the Detection of Points in 2-D Images.",
            "Compressed Remote Sensing of Sparse Objects.",
            "Multiscale Photon-Limited Spectral Image Reconstruction.",
            "Learning the Morphological Diversity.",
            "Clifford Bundles: A Common Framework for Image, Vector Field, and Orthonormal Frame Field Regularization.",
            "Stabilization of Flicker-Like Effects in Image Sequences through Local Contrast Correction.",
            "Deblurring of One Dimensional Bar Codes via Total Variation Energy Minimization.",
            "Smoothing Nonlinear Conjugate Gradient Method for Image Restoration Using Nonsmooth Nonconvex Minimization.",
            "Fast Algorithms for Source Identification Problems with Elliptic PDE Constraints.",
            "Cross Correlation and Deconvolution of Noise Signals in Randomly Layered Media.",
            "A Probabilistic Contour Observer for Online Visual Tracking.",
            "Analysis and Generalizations of the Linearized Bregman Method.",
            "KDE Paring and a Faster Mean Shift Algorithm.",
            "Anisotropic Alpha-Kernels and Associated Flows.",
            "Visual Multiple-Secret Sharing by Circle Random Grids.",
            "Bochner Subordination, Logarithmic Diffusion Equations, and Blind Deconvolution of Hubble Space Telescope Imagery and Other Scientific Data.",
            "Image Sharpening via Sobolev Gradient Flows.",
            "A General Framework for a Class of First Order Primal-Dual Algorithms for Convex Optimization in Imaging Science.",
            "Introduction to the Special Section on Optimization in Imaging Sciences.",
            "Global Interactions in Random Field Models: A Potential Function Ensuring Connectedness.",
            "Global Optimization for One-Dimensional Structure and Motion Problems.",
            "Optimization by Stochastic Continuation.",
            "Global Solutions of Variational Models with Convex Regularization."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2009",
        "info": "Volume 2: 2009",
        "count": 49,
        "papers": [
            "Adapted Windows Detection of Moving Objects in Video Scenes.",
            "A New Total Variation Method for Multiplicative Noise Removal.",
            "Smoothing Directional Vector Fields Using Dual Norms.",
            "Nonlinear Inverse Scale Space Methods for Total Variation Blind Deconvolution.",
            "A Curvilinear Search Method for p-Harmonic Flows on Spheres.",
            "On the Nonlinear Statistics of Range Image Patches.",
            "Diffusion Interpretation of Nonlocal Neighborhood Filters for Signal Denoising.",
            "On SAR Imaging through the Earth's Ionosphere.",
            "A Fast Iterative Shrinkage-Thresholding Algorithm for Linear Inverse Problems.",
            "Global Compartmental Pharmacokinetic Models for Spatiotemporal SPECT and PET Imaging.",
            "Linearized Bregman Iterations for Frame-Based Image Deblurring.",
            "Image Deconvolution Using a General Ridgelet and Curvelet Domain.",
            "Brain Connectivity Mapping Using Riemannian Geometry, Control Theory, and PDEs.",
            "The Split Bregman Method for L1-Regularized Problems.",
            "Synthetic Aperture Imaging of Multiple Point Targets in Rician Fading Media.",
            "Classification via Minimum Incremental Coding Length.",
            "Passive Sensor Imaging Using Cross Correlations of Noisy Signals in a Scattering Medium.",
            "ASIFT: A New Framework for Fully Affine Invariant Image Comparison.",
            "Measure-Valued Images, Associated Fractal Transforms, and the Affine Self-Similarity of Images.",
            "Generalized Newton-Type Methods for Energy Formulations in Image Processing.",
            "Total Variation Regularization for Image Denoising, III. Examples.",
            "A Fast Algorithm for Edge-Preserving Variational Multichannel Image Restoration.",
            "Reconstruction of Single-Grain Orientation Distribution Functions for Crystalline Materials.",
            "Estimation of Translation, Rotation, and Scaling between Noisy Images Using the Fourier--Mellin Transform.",
            "On the Use of Start-Stop Approximation for Spaceborne SAR Imaging.",
            "Scale-Space Analysis of Discrete Filtering over Arbitrary Triangulated Surfaces.",
            "Shape and Motion Estimation from Near-Field Echo-Based Sensor Data.",
            "Nested Iterative Algorithms for Convex Constrained Image Recovery Problems.",
            "Field Fluctuations, Imaging with Backscattered Waves, a Generalized Energy Theorem, and the Optical Theorem.",
            "Completion of Visible Contours.",
            "A Nonlinear Elastic Shape Averaging Approach.",
            "Expectation-Maximization Algorithm with Local Adaptivity.",
            "Efficient Beltrami Image Filtering via Vector Extrapolation Methods.",
            "Conditionally Gaussian Hypermodels for Cerebral Source Localization.",
            "A Regularized Visibility-Based Approach to Astronomical Imaging Spectroscopy.",
            "A Statistical Approach to the Matching of Local Features.",
            "Characterization and Analysis of Edges Using the Continuous Shearlet Transform.",
            "Affine Skeletons and Monge--Amp[e-grave]re Equations.",
            "Imaging by Modification: Numerical Reconstruction of Local Conductivities from Corresponding Power Density Measurements.",
            "Incompressible, Quasi-Isometric Deformations of 2-Dimensional Domains.",
            "Statistical Hypothesis Testing for Postreconstructed and Postregistered Medical Images.",
            "On the Application of the Monge--Kantorovich Problem to Image Registration.",
            "Compressive Sensing by Random Convolution.",
            "Cahn--Hilliard Inpainting and a Generalization for Grayvalue Images.",
            "An Efficient Primal-Dual Method for L1TV Image Restoration.",
            "Detection of Intensity and Motion Edges within Optical Flow via Multidimensional Control.",
            "Anisotropic Cheeger Sets and Applications.",
            "Compressive Imaging: An Application.",
            "Compressive Imaging of Subwavelength Structures."
        ]
    },
    {
        "name": "SIIMS",
        "year": "2008",
        "info": "Volume 1: 2008",
        "count": 20,
        "papers": [
            "Message from the Editor-in-Chief.",
            "Efficient Reconstruction of Piecewise Constant Images Using Nonsmooth Nonconvex Minimization.",
            "Topology Preserving Linear Filtering Applied to Medical Imaging.",
            "Cascadic Multiresolution Methods for Image Deblurring.",
            "Edge Illumination and Imaging of Extended Reflectors.",
            "Segmentation under Occlusions Using Selective Shape Prior.",
            "Bregman Iterative Algorithms for \\ell1-Minimization with Applications to Compressed Sensing.",
            "Direct Elastic Imaging of a Small Inclusion.",
            "Combining Image Reconstruction and Image Analysis with an Application to Two-Dimensional Tomography.",
            "Area Distances of Convex Plane Curves and Improper Affine Spheres.",
            "Sparse and Redundant Modeling of Image Content Using an Image-Signature-Dictionary.",
            "A New Alternating Minimization Algorithm for Total Variation Image Reconstruction.",
            "Inpainting by Flexible Haar-Wavelet Shrinkage.",
            "A Nonlinear Inverse Scale Space Method for a Convex Multiplicative Noise Model.",
            "Quantitative Object Reconstruction Using Abel Transform X-Ray Tomography and Mixed Variable Optimization.",
            "Variational Assimilation of Fluid Motion from Image Sequence.",
            "Convex Source Support and Its Application to Electric Impedance Tomography.",
            "Geodesic Evolution Laws---A Level-Set Approach.",
            "Total Variation Regularization for Image Denoising, II. Examples.",
            "A Study of 1PI Algorithms for a General Class of Curves."
        ]
    }
]