[
    {
        "year": "2010",
        "name": "SMI 2010",
        "info": "Aix en Provence, France",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2010",
                "sub_name": "SMI 2010, Shape Modeling International Conference, Aix en Provence, France, June 21-23 2010.",
                "count": 32,
                "papers": [
                    "Direct-Product Volumetric Parameterization of Handlebodies via Harmonic Fields.",
                    "Reconstructing 3D Objects from 2D Sectional Views of Engineering Drawings Using Volume-Based Method.",
                    "Visual Similarity Based 3D Shape Retrieval Using Bag-of-Features.",
                    "Non-rigid Registration in 3D Implicit Vector Space.",
                    "Procedural Function-Based Spatial Microstructures.",
                    "Shape Defined Panoramas.",
                    "Semantic-Preserving Mesh Direct Drilling.",
                    "An Iconography-Based Modeling Approach for the Spatio-Temporal Analysis of Architectural Heritage.",
                    "Single-Cycle Plain-Woven Objects.",
                    "Designing a Topological Modeler Kernel: A Rule-Based Approach.",
                    "Multi-scale Feature Spaces for Shape Processing and Analysis.",
                    "The Projective Linear Transition Map for Constructing Smooth Surfaces.",
                    "The Transition Between Sharp and Rounded Features and the Manipulation of Incompatible Boundary in Filling n-sided Holes.",
                    "RBF Dipole Surface Evolution.",
                    "Precise Construction and Control of Implicit Fillets in the BlobTree.",
                    "Ridge Extraction from Isosurfaces of Volumetric Data Using Implicit B-Splines.",
                    "Sharp Feature Detection in Point Clouds.",
                    "Point Cloud Skeletons via Laplacian Based Contraction.",
                    "Reversely Anisotropic Quad-dominant Remeshing.",
                    "A New Algorithm for the Computation of the Minkowski Difference of Convex Polyhedra.",
                    "Shape Representation of Polynomial Curves with Adjustable Interpolation Points.",
                    "A Face-Based Shape Matching Method for IGES Surface Model.",
                    "Fully-automatic Branching Reconstruction Algorithm: Application to Vascular Trees.",
                    "X-maps: An Efficient Model for Non-manifold Modeling.",
                    "A Benchmark for 3D Mesh Watermarking.",
                    "Paper-Strip Sculptures.",
                    "Hierarchical Spline Approximation of the Signed Distance Function.",
                    "3D Feature Line Detection Based on Vertex Labeling and 2D Skeletonization.",
                    "Surface Deformations Driven by Vector-Valued 1-Forms.",
                    "Local Constraint-Based General Surface Deformation.",
                    "Generalized PolyCube Trivariate Splines.",
                    "Tiling Surfaces with Cylinders Using n-loops."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "SMI 2009",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2009",
                "sub_name": "IEEE International Conference on Shape Modeling and Applications, SMI 2009, Beijing, China, 26-28 June 2009.",
                "count": 28,
                "papers": [
                    "Mesh denoising based on differential coordinates.",
                    "An effective third-order local fitting patch and its application.",
                    "Image based modeling via plane sweep based surface growing.",
                    "Automatic generation of coarse bounding cages from dense meshes.",
                    "Shape isophotic error netric controllable re-sampling for point-sampled surfaces.",
                    "A framework for the objective evaluation of segmentation algorithms using a ground-truth of human segmented 3D-models.",
                    "Approximate shape matching and symmetry detection for 3D shapes with guaranteed error bounds.",
                    "Interpolation over arbitrary topology meshes using Doo-Sabin surfaces.",
                    "Detail-preserving axial deformation using curve pairs.",
                    "Filling holes in triangular meshes by curve unfolding.",
                    "Contributing vertices-based Minkowski sum of a non-convex polyhedron without fold and a convex polyhedron.",
                    "Volumetric texture synthesis of bone micro-structure as a base for scaffold design.",
                    "Parts-based 2D shape decomposition by convex hull.",
                    "On minimal orthographic view covers for polyhedra.",
                    "Shape watermarking based on minimizing the quadric error metric.",
                    "Distance field transform with an adaptive iteration method.",
                    "Curvature normal vector driven interpolatory subdivision.",
                    "Interpolation to C1 boundary conditions by polynomial of degree six.",
                    "An exact representation of polygonal objects by C1-continuous scalar fields based on binary space partitioning.",
                    "Parameterised free-form feature templates.",
                    "Feature sensitive bas relief generation.",
                    "GridMesh: Fast and high quality 2D Mesh generation for interactive 3D shape modeling.",
                    "Haptic rendering using C1 continuous reconstructed distance fields.",
                    "Canonical homotopy class representative using hyperbolic structure.",
                    "Classification of non-manifold singularities from transformations of 2-manifolds.",
                    "On the computation of the minimal ellipse enclosing a set of planar curves.",
                    "Computing Fenchel-Nielsen coordinates in Teichmuller shape Space.",
                    "An edge matching technique for non-planar face intersections in geometric parametric models."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "SMI 2008",
        "info": "Stony Brook, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2008",
                "sub_name": "2008 International Conference on Shape Modeling and Applications (SMI 2008), June 4-6, 2008, Stony Brook, NY, USA.",
                "count": 59,
                "papers": [
                    "Octree skeleton: An efficient tool for shape and topology analysis of digital models.",
                    "Computation and properties of Centroidal Voronoi Tessellation.",
                    "GPU smoothing of quad meshes.",
                    "A global physical method for manifold smoothing.",
                    "GPU-accelerated surface denoising and morphing with lattice Boltzmann scheme.",
                    "Fairing wireframes in industrial surface design.",
                    "Noise in 3D laser range scanner data.",
                    "Time varying surface reconstruction from multiview video.",
                    "Example based skeletonization using harmonic one-forms.",
                    "Segmentation-free skeletonization of grayscale volumes for shape understanding.",
                    "Reeb graph computation based on a minimal contouring.",
                    "Approximate topological matching of quadrilateral meshes.",
                    "Salient local visual features for shape-based 3D model retrieval.",
                    "A 3D face matching framework.",
                    "Optimal bandwidth selection for MLS surfaces.",
                    "Gauss-Newton-type techniques for robustly fitting implicitly defined curves and surfaces to unorganized data points.",
                    "A least-norm approach to flattenable mesh surface processing.",
                    "Surface representations using blossoms and buds.",
                    "Self-organizing primitives for automated shape composition.",
                    "Sculptural forms from hyperbolic tessellations.",
                    "Efficient solution to systems of multivariate polynomials using expression trees.",
                    "GPU-accelerated Adaptively Sampled Distance Fields.",
                    "Anisotropic geodesic distance computation for parametric surfaces.",
                    "A novel method for alignment of 3D models.",
                    "Variational Multilevel Mesh Clustering.",
                    "OCTOR: OCcurrence selecTOR in pattern hierarchies.",
                    "SHape REtrieval Contest (SHREC) 2008.",
                    "SHape REtrieval contest 2008: Stability of watertight models.",
                    "SHape REtrieval contest 2008: Classification of watertight models.",
                    "SHape REtrieval contest 2008: CAD models.",
                    "SHape REtrieval contest 2008: Generic models.",
                    "SHape REtrieval contest 2008: 3D face scans.",
                    "SHREC'08 entry: Multi-view 3D retrieval using multi-scale contour representation.",
                    "SHREC'08 entry: Shape retrieval of noisy watertight models using aMRG.",
                    "SHREC'08 entry: Invariant features for robust shape retrieval.",
                    "SHREC'08 entry: Training set expansion via autotags.",
                    "SHREC'08 entry: Visual based 3D CAD retrieval using Fourier Mellin Transform.",
                    "SHREC - 08 entry: Local 2D visual features for CAD Model retrieval.",
                    "SHREC'08 entry: 3D shape searching using object partitioning.",
                    "SHREC'08 entry: Semi-supervised learning for semantic 3D model retrieval.",
                    "SHREC'08 entry: Local volumetric features for 3D model retrieval.",
                    "SHREC'08 entry: 2D/3D hybrid.",
                    "SHREC'08 entry: 3D model retrieval based on the V system invariant moment.",
                    "SHREC'08 entry: Forward neural network-based 3D model retrieval.",
                    "SHREC'08 entry: Shape based face recognition with a Morphable Model.",
                    "SHREC'08 entry: 3D face recognition using integral shape information.",
                    "SHREC'08 entry: Registration and retrieval of 3D faces using a Point Distribution Model.",
                    "SHREC'08 entry: 3D face recognition using facial contour curves.",
                    "SHREC'08 entry: 3D face recognition using moment invariants.",
                    "Polygonizing skeletal sheets of CT-scanned objects by partitioin of unity approximations.",
                    "Hands on virtual clay.",
                    "Learning 3D Face Models for shape based retrieval.",
                    "Feature suppression based CAD mesh model simplification.",
                    "Robust segmentation of voxel shapes using medial surfaces.",
                    "A memory effective two-phase approach for large scanned surface mesh simplification.",
                    "Shape registration via the wavelet transform.",
                    "Robust curve reconstruction with k-order alpha-shapes.",
                    "Autotagging to improve text search for 3D models.",
                    "Discrete shortest paths on smooth surface representations."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "SMI 2007",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2007",
                "sub_name": "2007 International Conference on Shape Modeling and Applications (SMI 2007), 13-15 June 2007, Lyon, France.",
                "count": 29,
                "papers": [
                    "Multivariate Density-Based 3D Shape Descriptors.",
                    "Augmented Symmetry Transforms.",
                    "Adapting Geometric Attributes for Expression-Invariant 3D Face Recognition.",
                    "Realistic Hair from a Sketch.",
                    "\"Do Like Me\", \"Do Like This\": Creating Animations by Teaching a Virtual Human.",
                    "Knowledge-based extraction of control skeletons for animation.",
                    "Hierarchical Spatial Hashing for Real-time Collision Detection.",
                    "Deforming surface simplification based on dynamic geometry sampling.",
                    "Polyhedral simplification preserving character lines extracted from images.",
                    "GPU-Accelerated Shape Simplification for Mechanical-Based Applications.",
                    "Topological Correction of Hypertextured Implicit Surfaces for Ray Casting.",
                    "Topological Generators and Cut-Graphs of Arbitrary Triangle Meshes.",
                    "Robust Smooth Feature Extraction from Point Clouds.",
                    "Automatic multiview quadruple alignment of unordered range scans.",
                    "A Partition-of-Unity Based Algorithm for Implicit Surface Reconstruction Using Belief Propagation.",
                    "Texture Atlas Generation for Inconsistent Meshes and Point Sets.",
                    "Anisotropic filtering on normal field and curvature tensor field using optimal estimation theory.",
                    "Skeleton-based Hierarchical Shape Segmentation.",
                    "Localized Homology.",
                    "Iterative Methods for Improving Mesh Parameterizations.",
                    "Automatic Generation of Bas-reliefs from 3D Shapes.",
                    "Topology driven 3D mesh hierarchical segmentation.",
                    "Automatic 2D Shape Orientation by Example.",
                    "3D Vascular Shape Segmentation for Fluid-Structure Modeling.",
                    "Preprocessing for Accelerating Convergence of Repulsive-Particle Systems for Sampling Implicit Surfaces.",
                    "Delaunay Meshing of Isosurfaces.",
                    "Meshing Non-uniformly Sampled and Incomplete Data Based on Displaced T-spline Level Sets.",
                    "Certified meshing of families of isosurfaces.",
                    "Color Plates."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "SMI 2006",
        "info": "Matsushima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2006",
                "sub_name": "2006 International Conference on Shape Modeling and Applications (SMI 2006), 14-16 June 2006, Matsushima, Japan.",
                "count": 33,
                "papers": [
                    "Invited Talk: Shape Modeling for Dummies.",
                    "Segmenting Point Sets.",
                    "Mesh Segmentation - A Comparative Study.",
                    "Minimum Ratio Contours on Surface Meshes.",
                    "Smoothing by Example: Mesh Denoising by Averaging with Similarity-Based Weights.",
                    "Hardware Rendering of 3D Geometry with Elevation Maps.",
                    "Curvilinear Spherical Parameterization.",
                    "Laplace-Beltrami Eigenfunctions Towards an Algorithm That \"Understands\" Geometry.",
                    "Spherical Wavelet Descriptors for Content-based 3D Model Retrieval.",
                    "The Generalized Shape Distributions for Shape Matching and Analysis.",
                    "Robust Alignment of Multi-view Range Data to CAD Model.",
                    "Selecting Distinctive 3D Shape Descriptors for Similarity Retrieval.",
                    "Robust 3D Shape Correspondence in the Spectral Domain.",
                    "Length Constrained Multiresolution Deformation for Surface Wrinkling.",
                    "Material-Aware Mesh Deformations.",
                    "A Constrained Least Squares Approach to Interactive Mesh Deformation.",
                    "Shape Modeling ina Homogenized Geometric Paradigm.",
                    "Regular Mesh Construction Algorithms using Regular Handles.",
                    "Degree Reduction for NURBS Symbolic Computation on Curves.",
                    "A Laplacian Based Approach for Free-Form Deformation of Sparse Low-degree IMplicit Surfaces.",
                    "Weak Approximate Implicitization.",
                    "A Fast Particle System Framework for Interactive Implicit Modeling.",
                    "SIMS: a Multi-Level Approach to Surface Reconstruction with Sparse Implicits.",
                    "Semi-Interactive Morphogenesis.",
                    "Enhanced 2D/3D Approaches Based on Relevance Index for 3D-Shape Retrieval.",
                    "Evolution of T-Spline Level Sets with Distance Field Constraints for Geometry Reconstruction and Image Segmentation.",
                    "Curves-on-Surface: A General Shape Comparison Framework.",
                    "Fast Sampling of Implicit Surfaces by Particle Systems.",
                    "Towards Stable and Salient Multi-View Representation of 3D Shapes.",
                    "ReMESH: An Interactive Environment to Edit and Repair Triangle Meshes.",
                    "BSP Shapes.",
                    "Parameterization for Remeshing Over Dynamically Changing Domains.",
                    "Hierarchical Shape Classification Using Bayesian Aggregation."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "SMI 2005",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2005",
                "sub_name": "2005 International Conference on Shape Modeling and Applications (SMI 2005), 15-17 June 2005, Cambridge, MA, USA.",
                "count": 43,
                "papers": [
                    "What's in a Mesh? A Survey of 3D Mesh Representation Schemes.",
                    "Reconstructing B-spline Curves from Point Clouds--A Tangential Flow Approach Using Least Squares Minimization.",
                    "Smooth Adaptive Fitting of 3D Models Using Hierarchical Triangular Splines.",
                    "Visualization of Point-Based Surfaces with Locally Reconstructed Subdivision Surfaces.",
                    "Convection-Driven Dynamic Surface Reconstruction.",
                    "Remeshing Schemes for Semi-Regular Tilings.",
                    "An Accurate Error Measure for Adaptive Subdivision Surfaces.",
                    "Designing with Distance Fields.",
                    "Mesh Editing with an Embedded Network of Curves.",
                    "Minimal-Cut Model Composition.",
                    "Rational Spherical Splines for Genus Zero Shape Modeling.",
                    "Anisotropic Meshing of Implicit Surfaces.",
                    "Interactive Implicit Modeling with Hierarchical Spatial Caching.",
                    "A Programmable Particle System Framework for Shape Modeling.",
                    "Robust Particle Systems for Curvature Dependent Sampling of Implicit Surfaces.",
                    "Subdomain Aware Contour Trees and Contour Evolution in Time-Dependent Scalar Fields.",
                    "Design and Manipulation of Polygonal Models in a Haptic, Stereoscopic Virtual Environment.",
                    "Predicting AE Attenuation in Structures by Geometric Analysis.",
                    "Stochastic Microgeometry for Displacement Mapping.",
                    "Geometry Synthesis by Example.",
                    "Real Time L-System Generated Trees Based on Modern Graphics Hardware.",
                    "Curvature-based Energy for Simulation and Variational Modeling.",
                    "Two-Dimensional Visibility Charts for Continuous Curves.",
                    "Contouring 1- and 2-Manifolds in Arbitrary Dimensions.",
                    "A Tracing Algorithm for Constructing Medial Axis Transform of 3D Objects Bound by Free-Form Surfaces.",
                    "Feature Sensitive Mesh Segmentation with Mean Shift.",
                    "Curvature Maps for Local Shape Comparison.",
                    "Practical Spherical Embedding of Manifold Triangle Meshes.",
                    "Free-Boundary Linear Parameterization of 3D Meshes in the Presence of Constraints.",
                    "Discrete Tensorial Quasi-Harmonic Maps.",
                    "Computational Topology for Reconstruction of Surfaces with Boundary: Integrating Experiments and Theory.",
                    "Maximizing Adaptivity in Hierarchical Topological Models.",
                    "Epsilon-Regular Sets and Intervals.",
                    "Volumetric Data Analysis using Morse-Smale Complexes.",
                    "Fast Processing of Triangle Meshes using Triangle Fans.",
                    "The Half-Edge Tree: A Compact Data Structure for Level-of-Detail Tetrahedral Meshes.",
                    "Calculation and Visualisation of the Thickness of 3D CAD Models.",
                    "Mesh Refinement Based on Euler Encoding.",
                    "Local Mesh Operators: Extrusions Revisited.",
                    "Shape Complexity Based on Mutual Information.",
                    "Manufacturing Classification of CAD Models Using Curvature and SVMs.",
                    "3D Object Retrieval using Many-to-many Matching of Curve Skeletons.",
                    "Radius-Normal Histogram and Hybrid Strategy for 3D Shape Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "SMI 2004",
        "info": "Genova, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2004",
                "sub_name": "2004 International Conference on Shape Modeling and Applications (SMI 2004), 7-9 June 2004, Genova, Italy.",
                "count": 63,
                "papers": [
                    "Dynamic Body Transformation and Matching from Scanned Data.",
                    "A Hybrid Shape Representation for Free-Form Modelling.",
                    "Multi-Scale Reconstruction of Implicit Surfaces with Attributes from Large Unorganized Point Sets.",
                    "3D Scattered Data Approximation with Adaptive Compactly Supported Radial Basis Functions.",
                    "Fitting and Manipulating Freeform Shapes by Extendable Freeform Templates.",
                    "Multi-Minimisations for Shape Control of Fully Free-Form Deformation Features.",
                    "Sweepers: Swept User-Defined Tools for Modeling by Deformation.",
                    "Computing Planar Sections of Surfaces of Revolution with Revolute Quadric Decomposition.",
                    "Nonlinear Polynomial Systems: Multiple Roots and Their Multiplicities.",
                    "Polygonal Decomposition of the 1-Ring Neighborhood of the Catmull-Clark Scheme.",
                    "Semiregular Pentagonal Subdivisions.",
                    "Detail-Preserving Variational Surface Design with Multiresolution Constraints.",
                    "Surface Quality Assessment of Subdivision Surfaces on Programmable Graphics Hardware.",
                    "A Generative Theory of Shape.",
                    "A Survey of Content Based 3D Shape Retrieval Methods.",
                    "Augmented Reeb Graphs for Content-Based Retrieval of 3D Mesh Models.",
                    "The Princeton Shape Benchmark.",
                    "Differential Coordinates for Interactive Mesh Editing.",
                    "Least-Squares Meshes.",
                    "A Fast and Simple Stretch-Minimizing Mesh Parameterization.",
                    "View-Dependent Streaming of Progressive Meshes.",
                    "Constant-Time Navigation in Four-Dimensional Nested Simplicial Meshes.",
                    "Robust Watermarking of Point-Sampled Geometry.",
                    "Approximating Bounded, Non-Orientable Surfaces from Points.",
                    "Evaluation and Visualization of Stress and Strain on Soft Biological Tissues in Contact.",
                    "Mold Accessibility via Gauss Map Analysis.",
                    "Stroke-Input Methods for Immersive Styling Environments.",
                    "A Novel Interface Paradigm for Supporting Product Design.",
                    "Building Shapes by Self-Assembly.",
                    "Contouring Medial Surface of Thin Plate Structure Using Local Marching Cubes.",
                    "Closing Gaps by Clustering Unseen Directions.",
                    "Extension of ISO 10303, the STEP Standard, for the Exchange of Procedural Shape Models.",
                    "AIM@SHAPE Project Presentation.",
                    "Verification of Scanned Engineering Parts with CAD Models Based on Discrete Curvature Estimation.",
                    "Decomposition of Complex Models for Manufacture.",
                    "Using Semi-Implicit Representation of Algebraic Surfaces.",
                    "Procedural Modeling of Cracks and Fractures.",
                    "Generative Parametric Design of Gothic Window Tracery.",
                    "Modeling the Coronary Artery Tree.",
                    "Empirical Analysis of Computational and Accuracy Tradeoffs Using Compactly Supported Radial Basis Functions for Surface Reconstruction.",
                    "Shape Deformations with Meaningful Parameters and Constraints.",
                    "Calibration Issues for Projector-based 3D-Scanning.",
                    "Reeb Graph Representation of Surfaces with Boundary.",
                    "Shape Recovery Using Functionally Represented Constructive Models.",
                    "A Scan-Line Algorithm for Clustering Line Segments.",
                    "A Hybrid Shape Representation for Free-Form Modelling (Figures 7, 9, and 10).",
                    "Detail-Preserving Variational Surface Design with Multiresolution Constraints (Figures 5, 8, and 9).",
                    "Surface Quality Assessment of Subdivision Surfaces on Programmable Graphics Hardware (Figures 7, 8, and 9).",
                    "A Survey of Content Based 3D Shape Retrieval Methods (Figure 5).",
                    "The Princeton Shape Benchmark (Figures 1 and 2).",
                    "Augmented Reeb Graphs for Content-Based Retrieval of 3D Mesh Models (Figures 2 and 15).",
                    "A Fast and Simple Stretch-Minimizing Mesh Parameterization (Figures 1 And 9).",
                    "View-Dependent Streaming of Progressive Meshes (Figure 9).",
                    "Robust Watermarking of Point-Sampled Geometry (Figures 6, 7, 8, 9, 10, 11, 12, 13, and 14).",
                    "Approximating Bounded, Non-Orientable Surfaces from Points (Figures 5, 6, and 7).",
                    "Evaluation and Visualization of Stress and Strain on Soft Biological Tissues in Contact (Figure 7).",
                    "Mold Accessibility via Gauss Map Analysis (Figure 4).",
                    "A Novel Interface Paradigm for Supporting Product Design (Figures 4 and 7).",
                    "Contouring Medial Surface of Thin Plate Structure Using Local Marching Cubes (Figures 15, 16, and 17).",
                    "Closing Gaps by Clustering Unseen Directions (Figures 5, 6, 7, and 8).",
                    "Verification of Scanned Engineering Parts with CAD Models Based on Discrete Curvature Estimation (Figures 1, 2, 3, 4, and 5).",
                    "Modeling the Coronary Artery Tree (Figures 1, 2, 4, and 5).",
                    "Shape Recovery Using Functionally Represented Constructive Models (Figure 2)."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "SMI 2003",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2003",
                "sub_name": "2003 International Conference on Shape Modeling and Applications (SMI 2003), 12-16 May 2003, Seoul, Korea.",
                "count": 29,
                "papers": [
                    "Capturing the Shape of a Dynamic World - Fast!",
                    "Generalized Functional and Decorative Filleting and Blending Operations.",
                    "Interactive Rind Modeling.",
                    "Rough Surface Modeling Using Surface Growth.",
                    "New Results in Signal Processing and Compression of Polygon Meshes.",
                    "Isotropic Surface Remeshing.",
                    "Higher Order Prediction for Geometry Compression.",
                    "Approximate Congruence Detection of Model Features for Reverse Engineering.",
                    "Using Growing Cell Structures for Surface Reconstruction.",
                    "Classification and Solving of Merge Patterns in Geometric Constraint Solving.",
                    "An Intermediate Level Representation Scheme for Secondary Features Recognition and B-rep Model Simplification.",
                    "Freeform Shape Representations for Efficient Geometry Processing.",
                    "Polyhedral Model Retrieval Using Weighted Point Set.",
                    "Skeleton Based Shape Matching and Retrieval.",
                    "An Interpolatory Subdivision for Volumetric Models over Simplicial Complexe.",
                    "A Multi-scale Approach to 3D Scattered Data Interpolation with Compactly Supported Basis Function.",
                    "On Graph Partitioning, Spectral Analysis, and Digital Mesh Processing.",
                    "Modelling and Deformation of Surfaces Defined over Finite Elements.",
                    "Controlled Metamorphosis of Animated Objects.",
                    "In Search of Texton.",
                    "Neural Network Based Geometric Primitive for Airfoil Design.",
                    "Skeleton Extraction of 3D Objects with Radial Basis Functions.",
                    "Watermarking 2D Vector Maps in the Mesh-Spectral Domain.",
                    "Finger Sculpting with Digital Clay: 3D Shape Input and Output through a Computer-Controlled Real Surfac.",
                    "A Topological Entity Matching Technique for Geometric Parametric Models.",
                    "An overview on properties and efficacy of topological skeletons in Shape Modelling.",
                    "High Performance generalized cylinders visualizatio.",
                    "Hardware-accelerated visualization of volume-sampled distance fields.",
                    "Ray Tracing Point Set Surface."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "SMI 2002",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2002",
                "sub_name": "2002 International Conference on Shape Modeling and Applications (SMI 2002), 17-22 May 2002, Banff, Alberta, Canada.",
                "count": 45,
                "papers": [
                    "Geometric Modeling without Coordinates and Indices.",
                    "Local Subdivision Process with Doo-Sabin Subdivision Surfaces.",
                    "A Corner-Cutting Scheme for Hexagonal Subdivision Surfaces.",
                    "Normal Control using N-adic Subdivision Schemes.",
                    "Recursive Subdivision and Hypergeometric Function.",
                    "A Multiresolution Mesh Generation Approach for Procedural Definition of Complex Geometry.",
                    "A Prototype System for Robust, Interactive and User-Friendly Modeling of Orientable 2-Manifold Meshes.",
                    "Wiener Filtering of Meshes.",
                    "Spanning Tree Seams for Reducing Parameterization Distortion of Triangulated Surfaces.",
                    "Mapping Independent Triangulation of Parametric Surfaces.",
                    "Modeling with Spatial Patches.",
                    "Multiresolution Tetrahedral Meshes: An Analysis and a Comparison.",
                    "Bounded Blending Operations.",
                    "Infinite Implicit Replication: Case Study for Voxelizing and Representing Cyclical Parametric Surfaces Implicitly.",
                    "Implicit Surfaces for Dynamic Growth of Digestive System.",
                    "Dynamic Implicit Solids with Constraints for Haptic Sculptin.",
                    "Using Particles to Sample and Control More Complex Implicit Surfaces.",
                    "Implicit Modelling with Skeleton Curves: Controlled Blending in Contact Situation.",
                    "Triquadratic Reconstruction for Interactive Modelling of Potential Fields.",
                    "Processing Irregular Meshes.",
                    "Mapping Conversations: Art and Understanding.",
                    "A Shape Deformation Tool to Model Character Lines in the Early Design Phases.",
                    "Volume Sculpting Using the Level-Set Method.",
                    "A Model Representation for Solid Modelling in a Virtual Reality Environment.",
                    "A Control of Smooth Deformations with Topological Change on Polyhedral Mesh Based on Curves and Loops.",
                    "Morphological Modeling and Deformation of 3D Object.",
                    "Towards Realistic Facial Modeling and Re-Rendering of Human Skin Aging Animation.",
                    "Procedural Approach to Generate Real Time Motions of Cloth.",
                    "Statistical Generation of 3D Facial Animable Models.",
                    "Surface Simplification and Edgebreaker Compression for 2D Cell Animations.",
                    "Simple Manifolds for Surface Modeling and Parameterization.",
                    "Affine-Invariant Skeleton of 3D Shapes.",
                    "Developing Surfaces.",
                    "Shape Matching of 3-D Contours Using Normalized Fourier Descriptors.",
                    "A Multiresolution Mesh Generation Approach for Procedural Definition of Complex Geometry (color plates 1, 2, 3, 4, 5, and 6).",
                    "Spanning Tree Seams for Reducing Parameterization Distortion of Triangulated Surfaces (figures 4, 5, and 6).",
                    "Multiresolution Tetrahedral Meshes: An Analysis and a Comparison (figures 4, 6, and 9).",
                    "Infinite Implicit Replication: Case Study for Voxelizing and Representing Cyclical Parametric Surfaces Implicitly (figures 1 and 2).",
                    "Dynamic Implicit Solids with Constraints for Haptic Sculpting (figure 10.",
                    "Triquadratic Reconstruction for Interactive Modelling of Potential Fields (figures 1 and 2).",
                    "Volume Sculpting Using the Level-Set Method (figure 5).",
                    "A Shape Deformation Tool to Model Character Lines in the Early Design Phases (figures 11, 12, and 13).",
                    "Surface Simplification and Edgebreaker Compression for 2D Cell Animations (figure 1).",
                    "Simple Manifolds for Surface Modeling and Parameterization (figures 3 and 6).",
                    "Affine-Invariant Skeleton of 3D Shapes (color plates 1 and 2)."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "SMI 2001",
        "info": "Genoa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/2001",
                "sub_name": "2001 International Conference on Shape Modeling and Applications (SMI 2001), 7-11 May 2001, Genoa, Italy.",
                "count": 36,
                "papers": [
                    "The 'Thermodynamics' of Shape.",
                    "Recognizing Geometric Patterns for Beautification of Reconstructed Solid Models.",
                    "Parameterization of Freeform Features.",
                    "Handle and Hole Improvement by Using New Corner Cutting Subdivision Scheme with Tension.",
                    "Turning the Approximating Catmull-Clark Subdivision Scheme into a Locally Interpolating Surface Modeling Tool.",
                    "Fairing Recursive Subdivision Surfaces with Curve Interpolation Constraints.",
                    "Implicit Surfaces that Interpolate.",
                    "Dynamic Meshes for Accurate Polygonization of Implicit Surfaces with Sharp Features.",
                    "Subdivision-Curve Primitives: A New Solution for Interactive Implicit Modeling.",
                    "Interpolating Implicit Surfaces from Scattered Surface Data Using Compactly Supported Radial Basis Functions.",
                    "Efficient Lipschitz Function Evaluation for CSG Implicit Surfaces.",
                    "Fast Navigation through an FRep Sculpture Garden.",
                    "Implicit Extrusion Fields: General Concepts and Some Simple Applications.",
                    "Shape Modeling Using Homotopy.",
                    "On Evolute Cusps and Skeleton Bifurcations.",
                    "Re-Meshing Techniques for Topological Analysis.",
                    "Matching 3D Models with Shape Distributions.",
                    "A Geometric Approach to 3D Object Comparison.",
                    "Machining Feature-Based Comparisons of Mechanical Parts.",
                    "Shape Matching: Similarity Measures and Algorithms.",
                    "Mesh Simplification Using Four-Face Clusters.",
                    "Local Control for Mesh Morphing.",
                    "Modeling Subdivision Control Meshes for Creating Cartoon Faces.",
                    "Efficient Processing of Large 3D Meshes.",
                    "A Parametric Solution to Common Tangents.",
                    "Surface Representation Using Second, Fourth and Mixed Order Partial Differential Equations.",
                    "Hierarchical D-NURBS Surfaces and Their Physics-Based Sculpting.",
                    "Automatic Knot Determination of NURBS for Interactive Geometric Design.",
                    "3D Compression Made Simple: Edgebreaker with Zip&Wrap on a Corner-Table.",
                    "Constant-Time Neighbor Finding in Hierarchical Tetrahedral Meshes.",
                    "Marching Intersections: An Efficient Resampling Algorithm for Surface Management.",
                    "Efficient Use of the BlobTree for Rendering Purposes.",
                    "Shape Representation Using Space Filled Sub-Voxel Distance Fields.",
                    "Partition along Characteristic Edges of a Digitized Point Cloud.",
                    "Modelling Flexible Parts for Virtual Reality Assembly Simulations which Interact with Their Environment.",
                    "Mechanically Based Design: Adaptive Refinement for B-Spline Finite Element."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "SMI 1999",
        "info": "Aizu, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/1999",
                "sub_name": "1999 Shape Modeling International (SMI '99), 1-4 March 1999, Aizu, Japan.",
                "count": 32,
                "papers": [
                    "Computational Shape Modeling: Valid vs. Invalid.",
                    "Interactive Design of Smooth Genus N Objects over a Single Domain.",
                    "Guaranteeing 2-Manifold Property for Meshes.",
                    "The Algorithm for Automatic Cutting of Three-Dimensional Polyhedrons of h-Genus.",
                    "Computational Topology for Shape Modeling.",
                    "Skeletal Methods of Shape Manipulation.",
                    "Shape Control Using Primitive Decompositions.",
                    "Interactive Shape Design with Convolution Surfaces.",
                    "Multi-Layer Implicit Garment Models.",
                    "Generalized Distance Functions.",
                    "Modeling and Deformation Method of Human Body Model Based on Range Data.",
                    "Variational Constraints in 3D.",
                    "Cylindrical Coordinate Representations for Modeling Surfaces of the Cornea and Contact Lenses.",
                    "Modeling of Surfaces with Fair Reflection Line Pattern.",
                    "On Reconstruction of Surfaces from their Apparent Contours and the Stationary Phase Observations.",
                    "Intersecting Surfaces of Special Types.",
                    "An Algorithm for Interpolating Intersecting Curves by Recursive Subdivision Surfaces.",
                    "Alpha-spline: A C2 Continuous Spline with Weights and Tension Control.",
                    "Nonlinear Spline Generation with Curve Evolutions Driven by Curvature.",
                    "Generalization of an Interpolant Using Voronoi Diagrams in Two Directions.",
                    "Automatic Knot Placement by a Genetic Algorithm for Data Fitting with a Spline.",
                    "Elastodynamic Shape Modeling in Virtual Medicine.",
                    "Inverse Problem in Geometrical Modeling of the Sources of Medical Signals.",
                    "Modeling Material Behavior: Molecular Dynamics Simulation and Visualization.",
                    "Shape Analysis using High-Performance Computing Techniques.",
                    "Extracting Skeletal Curves from 3D Scattered Data.",
                    "Merging Polyhedral Shapes with Scattered Features.",
                    "Geometrical Analysis of Two Sets of 3D Correspondence Data Patterns.",
                    "Extended Constrained Deformations: A new Sculpturing Tool.",
                    "Shape Signature by Deformation.",
                    "Voxel Volumes Volume-Oriented Visualization System.",
                    "Free-form Shape Modeling by 3D Cellular Automata."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "SMI 1997",
        "info": "Aizu-Wakamatsu, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/smi/1997",
                "sub_name": "Proceedings of 1997 International Conference on Shape Modeling and Applications, Aizu-Wakamatsu, Japan, March 3-6, 1997.",
                "count": 26,
                "papers": [
                    "Topological modelling of disordered cellular structures.",
                    "On cutting a torus.",
                    "Shape abstraction tools for modeling complex objects.",
                    "Bezier normal vector surface and its applications.",
                    "Towards a generic editor for subdivision surfaces.",
                    "Spline interpolation with genetic algorithms.",
                    "Freehand sketch system for 3D geometric modelling.",
                    "The 3D revolution: CAD access for all!",
                    "Ten questions that arose in designing the Djinn API for solid modelling.",
                    "A multiple-view CAD representation for product modelling.",
                    "Context dependent extraction of volumetric features.",
                    "Efficient shape-based algorithms for modeling patient specific anatomy from 3D medical images: applications in virtual endoscopy and surgery.",
                    "Two shape metrics for biomedical outline data: bending energy, Procrustes distance, and the biometrical modeling of shape phenomena.",
                    "Visual modeling of stomach growth on the basis of L-systems.",
                    "Geometrical cloning of 3D objects via simultaneous registration of multiple range images.",
                    "Shape integration of multi stereo images using surveyed points for an archaeological site.",
                    "Hardware implementation of shading models in an application specific integrated circuit.",
                    "Experimental study on acceleration of an exact-arithmetic geometric algorithm.",
                    "Recognizing three-dimensional shapes while measuring them.",
                    "Collaborative visualization and modeling.",
                    "Fast algorithms for ridge detection.",
                    "A unified surface smoothing scheme for automobile body shape modeling design.",
                    "Warping as a modelling tool for CSG/implicit models.",
                    "Homotopic shape deformation.",
                    "Volume invariant metamorphosis for solid and hollow rolled shape.",
                    "3D shape and reflectance morphing."
                ]
            }
        ]
    }
]