[
    {
        "name": "SPIC",
        "year": "2022",
        "info": "2022: Volumes\n100,\n101,\n102,\n103,",
        "count": 59,
        "papers": [
            "Single image super-resolution based on mapping-vector clustering and nonlinear pixel-reconstruction.",
            "A new method for detection and prediction of occluded text in natural scene images.",
            "Pose-guided model for driving behavior recognition using keypoint action learning.",
            "Improved fine-grained object retrieval with Hard Global Softmin Loss objective.",
            "A high throughput hardware architecture for deblocking filter in HEVC.",
            "Hierarchical complementary learning for weakly supervised object localization.",
            "Watermarking schemes for digital images: Robustness overview.",
            "Low-Light Homomorphic Filtering Network for integrating image enhancement and classification.",
            "Optimized feature space learning for generating efficient binary codes for image retrieval.",
            "Blind image deblurring with Gaussian curvature of the image surface.",
            "Region-based adaptive single image dehazing, detail enhancement and pre-processing using auto-colour transfer method.",
            "A multi-focus color image fusion algorithm based on low vision image reconstruction and focused feature extraction.",
            "Deep discriminant generation-shared feature learning for image-based kinship verification.",
            "Rate-constrained learning-based image compression.",
            "No-reference stereoscopic image quality assessment on both complex contourlet and spatial domain via Kernel ELM.",
            "Morphologically dilated convolutional neural network for hyperspectral image classification.",
            "Study of compression statistics and prediction of rate-distortion curves for video texture.",
            "MIRAU-Net: An improved neural network based on U-Net for gliomas segmentation.",
            "DMDN: Degradation model-based deep network for multi-focus image fusion.",
            "A reversible modified least significant bit (LSB) matching revisited method.",
            "Perceiving informative key-points: A self-attention approach for person search.",
            "Parallel multiscale context-based edge-preserving optical flow estimation with occlusion detection.",
            "Screen content image quality assessment using distortion-based directional edge and gradient similarity maps.",
            "A hybrid classification-regression approach for 3D hand pose estimation using graph convolutional networks.",
            "Universal steganalysis of spatial content-independent and content-adaptive steganographic algorithms using normalized feature derived from empirical mode decomposed components.",
            "Underwater image restoration by color compensation and color-line model.",
            "A deep learning network based end-to-end image composition.",
            "A novel multi-focus image fusion method based on joint regularization optimization layering and sparse representation.",
            "Two-dimensional quaternion linear canonical series for color images.",
            "QL-IQA: Learning distance distribution from quality levels for blind image quality assessment.",
            "Data-independent low-complexity KLT approximations for image and video coding.",
            "Joint face detection and Facial Landmark Localization using graph match and pseudo label.",
            "Semi-supervised graph regularized nonnegative matrix factorization with local coordinate for image representation.",
            "FANet: Feature aggregation network for RGBD saliency detection.",
            "Imperceptible-visible watermarking for copyright protection of digital videos based on temporal codes.",
            "Tone mapping high dynamic range images based on region-adaptive self-supervised deep learning.",
            "Residual packet loss rate analysis of 2-D parity forward error correction.",
            "A GAN-based input-size flexibility model for single image dehazing.",
            "Information extraction from scanned invoice images using text analysis and layout features.",
            "Comprehensive edge direction descriptor for fingerprint liveness detection.",
            "Near-field photometric stereo using a ring-light imaging device.",
            "Salient object detection based on global to local visual search guidance.",
            "An ℓ0-overlapping group sparse total variation for impulse noise image restoration.",
            "Twice Mixing: A rank learning based quality assessment approach for underwater image enhancement.",
            "A crosstalk correction method to improve multi-wavelength LEDs imaging quality based on color camera and frame accumulation.",
            "Understanding the perceived quality of video predictions.",
            "A fast parallel batch image encryption algorithm using intrinsic properties of chaos.",
            "Multi-scale visual attention for attribute disambiguation in zero-shot learning.",
            "Multi-task Facial Activity Patterns Learning for micro-expression recognition using Joint Temporal Local Cube Binary Pattern.",
            "Convolutional analysis operator learning for multifocus image fusion.",
            "Learning to compress videos without computing motion.",
            "Robust power line extraction from aerial image using object-based Gaussian-Markov random field with gravity property parameters.",
            "Feature back-projection guided residual refinement for real-time stereo matching network.",
            "Double compression detection in HEVC-coded video with the same coding parameters using picture partitioning information.",
            "MFFNet: Single facial depth map refinement using multi-level feature fusion.",
            "Frequency-domain blind quality assessment of blurred and blocking-artefact images using Gaussian Process Regression model.",
            "Co-saliency-regularized correlation filter for object tracking.",
            "A contrast enhancement framework under uncontrolled environments based on just noticeable difference.",
            "LD-GAN: Learning perturbations for adversarial defense based on GAN structure."
        ]
    },
    {
        "name": "SPIC",
        "year": "2021",
        "info": "2021: Volumes\n90,\n91,\n92,\n93,\n94,\n95,\n96,\n97,\n98,\n99",
        "count": 212,
        "papers": [
            "Occlusion detection and drift-avoidance framework for 2D visual object tracking.",
            "Feature fusion via dual-resolution compressive measurement matrix analysis for spectral image classification.",
            "Video stabilization: Overview, challenges and perspectives.",
            "Restricted Structural Random Matrix for compressive sensing.",
            "Using Deep learning for image watermarking attack.",
            "Enhancing underwater image via color correction and Bi-interval contrast enhancement.",
            "Generating visual story graphs with application to photo album summarization.",
            "Accurate 3D hand pose estimation network utilizing joints information.",
            "LPPM-Net: Local-aware point processing module based 3D hand pose estimation for point cloud.",
            "Gauss-Jordan elimination-based image tampering detection and self-recovery.",
            "Deep edge map guided depth super resolution.",
            "Learning region sparse constraint correlation filter for tracking.",
            "Joint feature weighting and adaptive graph-based matrix regression for image supervised feature Selection.",
            "Multi-scale Multi-attention Network for Moiré Document Image Binarization.",
            "Single-image depth estimation by refined segmentation and consistency reconstruction.",
            "Fast blind deconvolution using a deeper sparse patch-wise maximum gradient prior.",
            "Transfer subspace learning based on structure preservation for JPEG image mismatched steganalysis.",
            "Efficient and robust unsupervised inverse intensity compensation for stereo image registration under radiometric changes.",
            "Robust online tracking via sparse gradient convolution networks.",
            "Fast global SA(2, R) shape registration based on invertible invariant descriptor.",
            "A convex variational method for super resolution of SAR image with speckle noise.",
            "CNN spatiotemporal features and fusion for surveillance video forgery detection.",
            "Blind image quality assessment in the contourlet domain.",
            "Texture analysis-based multi-focus image fusion using a modified Pulse-Coupled Neural Network (PCNN).",
            "Fast image clustering based on compressed camera fingerprints.",
            "Joint image-to-image translation with denoising using enhanced generative adversarial networks.",
            "Context-free grammars to detect straight segments and a novel polygonal approximation method.",
            "Low bit-rate compression of underwater image based on human visual system.",
            "Reversible data hiding scheme for high dynamic range images based on multiple prediction error expansion.",
            "Underwater image processing and analysis: A review.",
            "Pic2PolyArt: Transforming a photograph into polygon-based geometric art.",
            "Multi-layer fusion network for blind stereoscopic 3D visual quality prediction.",
            "Pose-Guided Inflated 3D ConvNet for action recognition in videos.",
            "Reference guided image super-resolution via efficient dense warping and adaptive fusion.",
            "Compressively sampled light field reconstruction using orthogonal frequency selection and refinement.",
            "Saliency4ASD: Challenge, dataset and tools for visual attention modeling for autism spectrum disorder.",
            "Objective quality assessment of synthesized images by local variation measurement.",
            "Detection of transcoded HEVC videos based on in-loop filtering and PU partitioning analyses.",
            "Hyperspectral image classification using an extended Auto-Encoder method.",
            "A modular architecture for high resolution image dehazing.",
            "Generalized zero-shot classification via iteratively generating and selecting unseen samples.",
            "Reversible data hiding based on multiple histograms modification and deep neural networks.",
            "BINet: A binary inpainting network for deep patch-based image compression.",
            "A novel zero-watermarking scheme with enhanced distinguishability and robustness for volumetric medical imaging.",
            "Multi-focus image fusion with joint guided image filtering.",
            "Weighted visual secret sharing for general access structures based on random grids.",
            "Multi-focus image fusion with Geometrical Sparse Representation.",
            "Learning shape and texture progression for young child face aging.",
            "Multi-label semantics preserving based deep cross-modal hashing.",
            "A general model compression method for image restoration network.",
            "Robust people indoor localization with omnidirectional cameras using a Grid of Spatial-Aware Classifiers.",
            "Robust subspace clustering based on inter-cluster correlation reduction by low rank representation.",
            "Machine learning-based offline signature verification systems: A systematic review.",
            "Non-uniform low-light image enhancement via non-local similarity decomposition model.",
            "A non-local propagation filtering scheme for edge-preserving in variational optical flow computation.",
            "Deep supervised hashing using quadratic spherical mutual information for efficient image retrieval.",
            "Image inpainting using scene constraints.",
            "Ambiguity of objective image quality metrics: A new methodology for performance evaluation.",
            "Impact of 2D and 3D display watching on EEG power spectra: A standardized low-resolution tomography (sLORETA) study.",
            "Micro-expression recognition using advanced genetic algorithm.",
            "Spoofed replay attack detection by Multidimensional Fourier transform on facial micro-expression regions.",
            "Real-time video super resolution network using recurrent multi-branch dilated convolutions.",
            "Robust multiple color images encryption using discrete Fourier transforms and chaotic map.",
            "Color correction and restoration based on multi-scale recursive network for underwater optical image.",
            "SVM based approach for complexity control of HEVC intra coding.",
            "On the performance of objective quality metrics for lightfields.",
            "Visual attention prediction for Autism Spectrum Disorder with hierarchical semantic fusion.",
            "An efficient rate-distortion optimization method for dependent view in MV-HEVC based on inter-view dependency.",
            "A new bio-inspired metric based on eye movement data for classifying ASD and typically developing children.",
            "Quality assessment of multiply and singly distorted stereoscopic images via adaptive construction of cyclopean views.",
            "An optimized CNN-based quality assessment model for screen content image.",
            "Past is important: Improved image captioning by looking back in time.",
            "Early detection of children with Autism Spectrum Disorder based on visual exploration of images.",
            "Identify autism spectrum disorder via dynamic filter and deep spatiotemporal feature extraction.",
            "Multi-Level Fusion Net for hand pose estimation in hand-object interaction.",
            "Multi-level feature fusion and multi-loss learning for person Re-Identification.",
            "Predicting ASD diagnosis in children with synthetic and image-based eye gaze data.",
            "Cost-efficient HEVC-based quadtree splitting (HEQUS) for VVC Video Transcoding.",
            "Modelling spatio-temporal ageing phenomena with deep Generative Adversarial Networks.",
            "A progressive CNN in-loop filtering approach for inter frame coding.",
            "Light field image coding with flexible viewpoint scalability and random access.",
            "Sparse signal recovery via infimal convolution based penalty.",
            "A reference-free underwater image quality assessment metric in frequency domain.",
            "Upscaling factor estimation on pre-JPEG compressed images based on difference histogram of spectral peaks.",
            "AFLNet: Adversarial focal loss network for RGB-D salient object detection.",
            "MuRNet: A deep recursive network for super resolution of bicubically interpolated images.",
            "Deep noise estimation and removal for real-world noisy images.",
            "Towards self-similarity consistency and feature discrimination for unsupervised domain adaptation.",
            "The multi-scroll hyper-chaotic coexistence attractors and its application.",
            "Model-based decentralized Bayesian algorithm for distributed compressed sensing.",
            "A reversible extended secret image sharing scheme based on Chinese remainder theorem.",
            "Underwater image enhancement with image colorfulness measure.",
            "Moment-based multi-lane detection and tracking.",
            "Hierarchical visual comfort assessment for stereoscopic image retargeting.",
            "Encode-decode network with fully connected CRF for dynamic objects detection and static maps reconstruction.",
            "Rate-distortion optimization of multi-exposure image coding for high dynamic range image coding.",
            "Photorealistic style transfer for video.",
            "An extended context-based entropy hybrid modeling for image compression.",
            "Editorial of the special issue on Computational Image Editing.",
            "Image encryption based on compressed sensing and DNA encoding.",
            "DewaterNet: A fusion adversarial real underwater image enhancement network.",
            "Adaptive graph-based discriminative nonnegative matrix factorization for image clustering.",
            "Convolution Neural Network based lossy compression of hyperspectral images.",
            "Inter-layer correlation-based adaptive bit allocation for enhancement layer in scalable high efficiency video coding.",
            "Multi-stream pose convolutional neural networks for human interaction recognition in images.",
            "ASPP-DF-PVNet: Atrous Spatial Pyramid Pooling and Distance-Filtered PVNet for occlusion resistant 6D object pose estimation.",
            "Comparative analysis of feature extraction and fusion for blind authentication of digital images using chroma channels.",
            "Reversible data hiding in encrypted images with separability and high embedding capacity.",
            "Image completion with approximate convex hull tensor decomposition.",
            "Parallel spiral search algorithm applied to integer motion estimation.",
            "Efficient local stereo matching algorithm based on fast gradient domain guided image filtering.",
            "Sparse intrinsic decomposition and applications.",
            "Dense-CNN: Dense convolutional neural network for stereo matching using multiscale feature connection.",
            "Identifying tampering operations in image operator chains based on decision fusion.",
            "A blind color digital image watermarking method based on image correction and eigenvalue decomposition.",
            "SiamDA: Dual attention Siamese network for real-time visual tracking.",
            "UIEC^2-Net: CNN-based underwater image enhancement using two color space.",
            "Transmission line detection in aerial images: An instance segmentation approach based on multitask neural networks.",
            "Enhanced wide-activated residual network for efficient and accurate image deblocking.",
            "On visual masking estimation for adaptive quantization using steerable filters.",
            "MFIF-GAN: A new generative adversarial network for multi-focus image fusion.",
            "Bag of shape descriptor using unsupervised deep learning for non-rigid shape recognition.",
            "Bayesian sparse hierarchical model for image denoising.",
            "Visual perception of computer-generated stereoscopic pictures: Toward the impact of image resolution.",
            "Automatic segmentation of left and right ventricles in cardiac MRI using 3D-ASM and deep learning.",
            "Efficient coding of experimental holograms using speckle denoising.",
            "A customized low-rank prior model for structured cartoon-texture image decomposition.",
            "Robust optical flow estimation via edge preserving filtering.",
            "Image deblurring via enhanced local maximum intensity prior.",
            "BGT: A blind image quality evaluator via gradient and texture statistical features.",
            "A neural network-based video bit-rate control algorithm for variable bit-rate applications of versatile video coding standard.",
            "Multi-scale relation reasoning for multi-modal Visual Question Answering.",
            "Frontalization and adaptive exponential ensemble rule for deep-learning-based facial expression recognition system.",
            "Single depth map super-resolution via joint non-local self-similarity modeling and local multi-directional gradient-guided regularization.",
            "A novel convolutional neural network architecture of multispectral remote sensing images for automatic material classification.",
            "Image storage onto synthetic DNA.",
            "Image inpainting using directional wavelet packets originating from polynomial splines.",
            "Synthetic18K: Learning better representations for person re-ID and attribute recognition from 1.4 million synthetic images.",
            "Non-stationary content-adaptive projector resolution enhancement.",
            "An efficient deep sclera recognition framework with novel sclera segmentation, vessel extraction and gaze detection.",
            "A robust hybrid active contour model based on pre-fitting bias field correction for fast image segmentation.",
            "Learning from EPI-Volume-Stack for Light Field image angular super-resolution.",
            "ViSTRA2: Video coding using spatial resolution and effective bit depth adaptation.",
            "Multi-scale selective image texture smoothing via intuitive single clicks.",
            "COVID-19 discrimination framework for X-ray images by considering radiomics, selective information, feature ranking, and a novel hybrid classifier.",
            "Comprehensive performance analysis of objective quality metrics for digital holography.",
            "Double color image encryption based on fractional order discrete improved Henon map and Rubik's cube transform.",
            "Hybrid dual stream blender for wide baseline view synthesis.",
            "Adaptive hypergraph learning with multi-stage optimizations for image and tag recommendation.",
            "A comprehensive theoretical evaluation of the end-to-end performance of SoftCast-based linear video delivery schemes.",
            "RLP-AGMC: Robust label propagation for saliency detection based on an adaptive graph with multiview connections.",
            "Fast pixel-matching for video object segmentation.",
            "A novel binary operator for designing medical and natural image cryptosystems.",
            "Robust depth map inpainting using superpixels and non-local Gauss-Markov random field prior.",
            "CDADNet: Context-guided dense attentional dilated network for crowd counting.",
            "Two-dimensional jointly sparse robust discriminant regression.",
            "Multiple channels local binary pattern for color texture representation and classification.",
            "A novel filtering kernel based on difference of derivative Gaussians with applications to dynamic texture representation.",
            "Coupled adversarial variational autoencoder.",
            "Double constrained bag of words for human action recognition.",
            "A unified framework for damaged image fusion and completion based on low-rank and sparse decomposition.",
            "FD-SSD: An improved SSD object detection algorithm based on feature fusion and dilated convolution.",
            "Depth-aware total variation regularization for underwater image dehazing.",
            "3D image recognition using new set of fractional-order Legendre moments and deep neural networks.",
            "A novel hybrid image encryption-compression scheme by combining chaos theory and number theory.",
            "Coarse registration of point clouds with low overlap rate on feature regions.",
            "PVO-based reversible data hiding using adaptive multiple histogram generation and modification.",
            "Deep learning based HEVC in-loop filter and noise reduction.",
            "Multi-scale spatial convolution algorithm for lane line detection and lane offset estimation in complex road conditions.",
            "Kernel eigenmaps based multiscale sparse model for hyperspectral image classification.",
            "Relative multiscale deep depth from focus.",
            "Cascaded and Recursive ConvNets (CRCNN): An effective and flexible approach for image denoising.",
            "An entropy minimization histogram mergence scheme and its application in image compression.",
            "A systematic evaluation of coding strategies for sparse binary images.",
            "An in-depth analysis of hyperspectral target detection with shadow compensation via LiDAR.",
            "Recursive residual atrous spatial pyramid pooling network for single image deraining.",
            "A low light natural image statistical model for joint contrast enhancement and denoising.",
            "Multiparameter discrete transforms based on discrete orthogonal polynomials and their application to image watermarking.",
            "Temporal modelling of first-person actions using hand-centric verb and object streams.",
            "Image source identification with known post-processed based on convolutional neural network.",
            "STC-Flow: Spatio-temporal context-aware optical flow estimation.",
            "CTU depth decision algorithms for HEVC: A survey.",
            "Pair comparison based progressive subjective quality ranking for underwater images.",
            "Unified quality assessment of natural and screen content images via adaptive weighting on double scales.",
            "Multi-wavelet guided deep mean-shift prior for image restoration.",
            "Segmentation of turbulent computational fluid dynamics simulations with unsupervised ensemble learning.",
            "Unsupervised multi-domain image translation with domain representation learning.",
            "Robust multi-source co-adaptation with adaptive loss minimization.",
            "Micro-expression recognition from local facial regions.",
            "S2-aware network for visual recognition.",
            "Ensemble single image deraining network via progressive structural boosting constraints.",
            "Robust and reversible image watermarking in homomorphic encrypted domain.",
            "A geodesic multipolar parameterization-based representation for 3D face recognition.",
            "Low-light image enhancement via deep Retinex decomposition and bilateral learning.",
            "Enhanced CRC-based correction of multiple errors with candidate validation.",
            "Maritime filtering for images and videos.",
            "Head pose estimation: A survey of the last ten years.",
            "Simplified square to hexagonal lattice conversion based on 1-D multirate processing.",
            "Multiview vision-based human crowd localization for UAV fleet flight safety.",
            "Blind video quality assessment based on multilevel video perception.",
            "Image synthesis via adversarial geometric consistency pursuit.",
            "Deep-NC: A secure image transmission using deep learning and network coding.",
            "Grayscale-inversion and rotation invariant image description with sorted LBP features.",
            "Sub-band coding of hexagonal images.",
            "Novel hyper chaotic color image encryption based on pixel and bit level scrambling with diffusion.",
            "Adaptive direction-guided structure tensor total variation.",
            "Speckle noise removal based on structural convolutional neural networks with feature fusion for medical image.",
            "Real-time 16K video coding on a GPU with complexity scalable BPC-PaCo.",
            "A Regularization by Denoising super-resolution method based on genetic algorithms.",
            "Feedback-based object detection for multi-person pose estimation.",
            "SRNHARB: A deep light-weight image super resolution network using hybrid activation residual blocks.",
            "Multi-focus image fusion via Joint convolutional analysis and synthesis sparse representation."
        ]
    },
    {
        "name": "SPIC",
        "year": "2020",
        "info": "2020: Volumes\n80,\n81,\n82,\n83,\n84,\n85,\n86,\n87,\n88,\n89",
        "count": 168,
        "papers": [
            "High-capacity reversible data hiding in encrypted image based on specific encryption process.",
            "Fast sample adaptive offset algorithm for 360-degree video coding.",
            "Human action recognition based on action relevance weighted encoding.",
            "A vision-based fully automated approach to robust image cropping detection.",
            "Image alignment based perceptual image hash for content authentication.",
            "Effective and efficient indexing in cross-modal hashing-based datasets.",
            "Robust image retrieval by cascading a deep quality assessment network.",
            "Self-learning residual model for fast intra CU size decision in 3D-HEVC.",
            "A simple framework to leverage state-of-the-art single-image super-resolution methods to restore light fields.",
            "Adaptive lossless compression of skeleton sequences.",
            "Multiple-image encryption based on chaotic phase mask and equal modulus decomposition in quaternion gyrator domain.",
            "Blind image blur metric based on orientation-aware local patterns.",
            "Early termination for fast intra mode decision in depth map coding using DIS-inheritance.",
            "A new color image encryption scheme based on DNA encoding and spatiotemporal chaotic system.",
            "An efficient reversible authentication scheme for demosaiced images with improved detectability.",
            "Adaptive model updating for robust object tracking.",
            "Densely connected convolutional network block based autoencoder for panorama map compression.",
            "Fast depth intra coding based on spatial correlation and rate distortion cost in 3D-HEVC.",
            "Grafted network for person re-identification.",
            "Double-layer conditional random fields model for human action recognition.",
            "Novel calibration method for camera array in spherical arrangement.",
            "Inter-class angular margin loss for face recognition.",
            "Visual question answering model based on visual relationship detection.",
            "Mining discriminative spatial cues for aerial image quality assessment towards big data.",
            "Image quality assessment based on adaptive multiple Skyline query.",
            "Face completion with Hybrid Dilated Convolution.",
            "Hedging static saliency models to predict dynamic saliency.",
            "No-reference image quality assessment based on neighborhood co-occurrence matrix.",
            "Deep autoencoders for attribute preserving face de-identification.",
            "A comparative study of CNN-based super-resolution methods in MRI reconstruction and its beyond.",
            "Feature refinement for image-based driver action recognition via multi-scale attention convolutional neural network.",
            "Reversible data hiding based on RSBEMD coding and adaptive multi-segment left and right histogram shifting.",
            "An improved reversible watermarking scheme using weighted prediction and watermarking simulation.",
            "Multi-level rate-constrained successive elimination algorithm tailored to suboptimal motion estimation in HEVC.",
            "An effective fragile watermarking scheme for color image tampering detection and self-recovery.",
            "Perceptual hashing for image authentication: A survey.",
            "Multifeature extracting CNN with concatenation for image denoising.",
            "Robust L1-norm two-dimensional collaborative representation-based projection for dimensionality reduction.",
            "Human-robot interaction based on gesture and movement recognition.",
            "Gesture recognition for human-machine interaction in table tennis video based on deep semantic understanding.",
            "A multi-branch hand pose estimation network with joint-wise feature extraction and fusion.",
            "An ensemble image quality assessment algorithm based on deep feature clustering.",
            "Underwater image enhancement based on conditional generative adversarial network.",
            "Secret image sharing with separate shadow authentication ability.",
            "A nonsubsampled countourlet transform based CNN for real image denoising.",
            "Real-time hand posture recognition using hand geometric features and Fisher Vector.",
            "Correlation Net: Spatiotemporal multimodal deep learning for action recognition.",
            "Advanced deep learning for image super-resolution.",
            "Temporal information based GoP adaptation for linear video delivery schemes.",
            "Multi-frame super-resolution reconstruction based on mixed Poisson-Gaussian noise.",
            "Variational level set method for image segmentation with simplex constraint of landmarks.",
            "Color image zero-watermarking based on fast quaternion generic polar complex exponential transform.",
            "Video quality assessment using space-time slice mappings.",
            "Probabilistic Kalman filter for moving object tracking.",
            "Hand gesture understanding by weakly-supervised fusing shallow/deep image attributes.",
            "An L0 regularized cartoon-texture decomposition model for restoring images corrupted by blur and impulse noise.",
            "Convolutional neural networks for multispectral pedestrian detection.",
            "Classifier shared deep network with multi-hierarchy loss for low resolution face recognition.",
            "AdaBoost neural network and cyclopean view for no-reference stereoscopic image quality assessment.",
            "Improved hybrid layered image compression using deep learning and traditional codecs.",
            "Background foreground boundary aware efficient motion search for surveillance videos.",
            "Detection and localization of forgery using statistics of DCT and Fourier components.",
            "Special Issue on Advances in Statistical Methods-based Visual Quality Assessment.",
            "Multi-modality medical image fusion based on separable dictionary learning and Gabor filtering.",
            "Robust human gesture recognition by leveraging multi-scale feature fusion.",
            "Texture classification using block intensity and gradient difference (BIGD) descriptor.",
            "Global relational reasoning with spatial temporal graph interaction networks for skeleton-based action recognition.",
            "Pre-processing for single image dehazing.",
            "Full-reference IPTV image quality assessment by deeply learning structural cues.",
            "Image quality assessment based on deep learning with FPGA implementation.",
            "Non-reference image quality assessment based on deep clustering.",
            "No-reference video quality evaluation by a deep transfer CNN architecture.",
            "Remote sensing image quality evaluation based on deep support value learning networks.",
            "Robust basketball sports recognition by leveraging motion block estimation.",
            "Hyperspectral image quality evaluation using generalized regression neural network.",
            "Analysis of technical features in basketball video based on deep learning algorithm.",
            "Hyperspectral remote sensing IQA via learning multiple kernels from mid-level features.",
            "Combining synthesis sparse with analysis sparse for single image super-resolution.",
            "Deep Learning for Visual Content Analysis.",
            "Deep quality assessment toward defogged aerial images.",
            "A new challenging image dataset with simple background for evaluating and developing co-segmentation algorithms.",
            "DSiamMFT: An RGB-T fusion tracking method via dynamic Siamese networks using multi-layer feature fusion.",
            "Human action recognition toward massive-scale sport sceneries based on deep multi-model feature fusion.",
            "Multiple instance deep learning for weakly-supervised visual object tracking.",
            "Deeply fusing multi-model quality-aware features for sophisticated human activity understanding.",
            "Vision-aware target recognition toward autonomous robot by Kinect sensors.",
            "Quality-guided lane detection by deeply modeling sophisticated traffic context.",
            "Visibility of quantization errors in reversible JPEG2000.",
            "Learning skeleton information for human action analysis using Kinect.",
            "Glove-type massage feature acquisition by human organ simulators: Feasibility and comparison.",
            "On-line classroom visual tracking and quality evaluation by an advanced feature mining technique.",
            "Adaptive quantization parameter selection for low-delay HEVC via temporal propagation length estimation.",
            "A novel method for lossless image compression and encryption based on LWT, SPIHT and cellular automata.",
            "O3S-MTP: Oriented star sampling structure based multi-scale ternary pattern for texture classification.",
            "Human emotion recognition by optimally fusing facial expression and speech feature.",
            "SDRNet: An end-to-end shadow detection and removal network.",
            "Hyperspectral image super-resolution combining with deep learning and spectral unmixing.",
            "GORFLM: Globally Optimal Robust Fitting for Linear Model.",
            "Comprehensive feature fusion mechanism for video-based person re-identification via significance-aware attention.",
            "SensIR: Towards privacy-sensitive image retrieval in the cloud.",
            "Visual computing resources distribution and balancing by multimodal cat swarm optimization.",
            "Image captioning using DenseNet network and adaptive attention.",
            "Subjective and objective quality assessment for image restoration: A critical survey.",
            "Pan-sharpening via multi-scale and multiple deep neural networks.",
            "Perceptual quality assessment for multimodal medical image fusion.",
            "Sparse analysis for mesoscale convective systems tracking.",
            "Isotropic and anisotropic filtering norm-minimization: A generalization of the TV and TGV minimizations using NESTA.",
            "Video object tracking and segmentation with box annotation.",
            "A signal adaptive diffusion filter for video coding: Mathematical framework and complexity reductions.",
            "Point cloud coding: A privileged view driven by a classification taxonomy.",
            "MLDNet: Multi-level dense network for multi-focus image fusion.",
            "SIRA - An efficient method for retrieving stereo images from anaglyphs.",
            "Description method of Illumination invariant image features.",
            "Single image reflection removal based on structure-texture layering.",
            "Intrinsic image decomposition as two independent deconvolution problems.",
            "Image deblocking via shape-adaptive low-rank prior and sparsity-based detail enhancement.",
            "Segmentation mask guided end-to-end person search.",
            "Effects and solutions of Cover-Source Mismatch in image steganalysis.",
            "Underwater image enhancement with global-local networks and compressed-histogram equalization.",
            "Tri-level optimization-based image rectification for polydioptric cameras.",
            "Conditional Random Field based salient proposal set generation and its application in content aware seam carving.",
            "Video coding for OFDM systems with imperfect CSI: A hybrid digital-analog approach.",
            "An adaptive infrared image segmentation method based on fusion SPCNN.",
            "Level set formulation for automatic medical image segmentation based on fuzzy clustering.",
            "Hierarchical neural network for hand pose estimation.",
            "A novel image retrieval method based on multi-features fusion.",
            "Voronoi-based image representation applied to binary visual cryptography.",
            "Blind S3D image quality prediction using classical and non-classical receptive field models.",
            "Human experts vs. machines in taxa recognition.",
            "Learning discriminative and meaningful samples for generalized zero shot classification.",
            "A novel deep neural network for noise removal from underwater image.",
            "Essential secret image sharing scheme with small and equal sized shadows.",
            "Image super-resolution reconstruction based on sparse representation and deep learning.",
            "Bagging-based saliency distribution learning for visual saliency detection.",
            "Generative image inpainting via edge structure and color aware fusion.",
            "An efficient framework for visible-infrared cross modality person re-identification.",
            "A robust blind watermarking algorithm for depth-image-based rendering 3D images.",
            "2DInpaint: A novel privacy-preserving scheme for image inpainting in an encrypted domain over the cloud.",
            "Comparison between Digital Tone-Mapping Operators and a Focal-Plane Pixel-Parallel Circuit.",
            "Color image watermark decoder by modeling quaternion polar harmonic transform with BKF distribution.",
            "Context prior-based with residual learning for face detection: A deep convolutional encoder-decoder network.",
            "Per-pixel classification of clouds from whole sky HDR images.",
            "EGAN: Non-uniform image deblurring based on edge adversarial mechanism and partial weight sharing network.",
            "A low-complexity psychometric curve-fitting approach for the objective quality assessment of streamed game videos.",
            "Thresholding binary coding for image forensics of weak sharpening.",
            "A novel public dataset for multimodal multiview and multispectral driver distraction analysis: 3MDAD.",
            "Frame level rate control algorithm based on GOP level quality dependency for low-delay hierarchical video coding.",
            "Self-supervised video representation learning by maximizing mutual information.",
            "Re-identification framework for long term visual object tracking based on object detection and classification.",
            "Deep multi query image retrieval.",
            "Contourlet domain locally optimum image watermark decoder using Cauchy mixtures based vector HMT model.",
            "Saliency detection in human crowd images of different density levels using attention mechanism.",
            "An improved 3D shape visibility graph with application to mesh segmentation.",
            "A new Fractal Series Expansion based enhancement model for license plate recognition.",
            "On the use of a scanpath predictor and convolutional neural network for blind image quality assessment.",
            "Learning object-centric complementary features for zero-shot learning.",
            "Diving deeper into underwater image enhancement: A survey.",
            "Video frame interpolation using deep cascaded network structure.",
            "Joint feature representation and classification via adaptive graph semi-supervised nonnegative matrix factorization.",
            "TDFSSD: Top-Down Feature Fusion Single Shot MultiBox Detector.",
            "iPiano-Net: Nonconvex optimization inspired multi-scale reconstruction network for compressed sensing.",
            "Face anti-spoofing detection based on DWT-LBP-DCT features.",
            "CNN-based steganalysis and parametric adversarial embedding: A game-theoretic framework.",
            "A novel selective encryption scheme for H.264/AVC video with improved visual security.",
            "Visual privacy-preserving level evaluation for multilayer compressed sensing model using contrast and salient structural features.",
            "Latency impact on Quality of Experience in a virtual reality simulator for remote control of machines.",
            "A robust JPEG compression detector for image forensics.",
            "Blind compression artifact reduction using dense parallel convolutional neural network."
        ]
    },
    {
        "name": "SPIC",
        "year": "2019",
        "info": "2019: Volumes\n70,\n71,\n72,\n73,\n74,\n75,\n76,\n77,\n78,\n79",
        "count": 198,
        "papers": [
            "CAM-based HDR image reproduction using CA-TC decoupled JCh decomposition.",
            "Temporal stochastic linear encoding networks.",
            "An alternating proximal approach for blind video deconvolution.",
            "Perceptual image quality assessment through spectral analysis of error representations.",
            "Fast detection and segmentation of partial image blur based on discrete Walsh-Hadamard transform.",
            "A framework for computationally efficient video quality assessment.",
            "Multiview Laplacian semisupervised feature selection by leveraging shared knowledge among multiple tasks.",
            "HybridNet: A fast vehicle detection system for autonomous driving.",
            "Combining weighted curvelet accumulation with motion vector duty cycle for nonuniform video deblurring.",
            "Digital blind watermarking based on depth variation prediction map and DWT for DIBR free-viewpoint image.",
            "Signal processing challenges for digital holographic video display systems.",
            "Image dehazing using Moore neighborhood-based gradient profile prior.",
            "Object instance detection with pruned Alexnet and extended training data.",
            "ADMM for image restoration based on nonlocal simultaneous sparse Bayesian coding.",
            "Lossless medical image watermarking method based on significant difference of cellular automata transform coefficient.",
            "Deep learning for printed document source identification.",
            "Fast inter-frame prediction in multi-view video coding based on perceptual distortion threshold model.",
            "A deep learning method for image super-resolution based on geometric similarity.",
            "Methodology for filtering of depth maps based on the MCbR algorithm supported by color, shape and neighboring features.",
            "Ensemble SW image steganalysis: A low dimension method for LSBR detection.",
            "Assessment of perceptual distortion boundary through applying reversible watermarking to brain MR images.",
            "A fast video super resolution for facial image.",
            "Saliency detection via background and foreground null space learning.",
            "A robust background initialization algorithm with superpixel motion detection.",
            "Fast intra mode decision and fast CU size decision for depth video coding in 3D-HEVC.",
            "Automatic blur type classification via ensemble SVM.",
            "Multi-scale adaptive factors video acceleration magnification.",
            "Contrast enhancement by multi-level histogram shape segmentation with adaptive detail enhancement for noise suppression.",
            "Exemplar-based depth inpainting with arbitrary-shape patches and cross-modal matching.",
            "A general progressive secret image sharing construction method.",
            "TS-LSTM and temporal-inception: Exploiting spatiotemporal dynamics for activity recognition.",
            "Towards a blind image quality evaluator using multi-scale second-order statistics.",
            "An effective general-purpose NR-IQA model using natural scene statistics (NSS) of the luminance relative order.",
            "Multiscale Fourier descriptor based on triangular features for shape retrieval.",
            "Multiple moduli prediction error expansion reversible data hiding.",
            "Evaluation of color differences in natural scene color images.",
            "Robust contrast enhancement forensics based on convolutional neural networks.",
            "Variational Bayesian image restoration with multi-structured model of wavelet transform coefficients.",
            "A survey of variational and CNN-based optical flow techniques.",
            "Image super-resolution via feature-augmented random forest.",
            "Guided filter-based multi-focus image fusion through focus region detection.",
            "Local spatial correlation-based stripe non-uniformity correction algorithm for single infrared images.",
            "Super-resolution using neighbourhood regression with local structure prior.",
            "Vehicle joint make and model recognition with multiscale attention windows.",
            "Haze removal algorithm based on single-images with chromatic properties.",
            "Machine vision quality assessment for robust face detection.",
            "Gated CNN for visual quality assessment based on color perception.",
            "Video reconstruction based on Intrinsic Tensor Sparsity model.",
            "Robust detection of median filtering based on combined features of difference image.",
            "Reversible cellular automata image encryption for similarity search.",
            "Editorial to The Special Issue on Tensor Image Processing.",
            "On semi-definiteness and minimal H-eigenvalue of a symmetric space tensor using nonnegative polynomial optimization techniques.",
            "Tensor rank learning in CP decomposition via convolutional neural network.",
            "Double coupled canonical polyadic decomposition of third-order tensors: Algebraic algorithm and relaxed uniqueness conditions.",
            "Linked CP tensor decomposition algorithms for shared and individual feature extraction.",
            "High-order tensor completion via gradient-based optimization under tensor train format.",
            "Laplace function based nonconvex surrogate for low-rank tensor completion.",
            "Multi-filters guided low-rank tensor coding for image inpainting.",
            "Improved structure tensor for fine-grained texture inpainting.",
            "A total variation and group sparsity based tensor optimization model for video rain streak removal.",
            "Facial expression recognition with local prominent directional pattern.",
            "QDF: A face database with varying quality.",
            "Face analysis through semantic face segmentation.",
            "Improving relevant subjective testing for validation: Comparing machine learning algorithms for finding similarities in VQA datasets using objective measures.",
            "An efficient graph reduction framework for interactive texture segmentation.",
            "SSVD: Structural SVD-based image quality assessment.",
            "An Interpolative AMBTC-based high-payload RDH scheme for encrypted images.",
            "A novel secret image sharing with steganography scheme utilizing Optimal Asymmetric Encryption Padding and Information Dispersal Algorithms.",
            "Steerable Fourier number transform with application to image encryption.",
            "Recovering tampered regions in encrypted video using POB number system.",
            "Automatic detection of passable roads after floods in remote sensed and social media data.",
            "Application of rank metric codes in digital image watermarking.",
            "OFF-ApexNet on micro-expression recognition system.",
            "Image denoising via a new anisotropic total-variation-based model.",
            "Learn-select-track: An approach to multi-object tracking.",
            "Spatio-temporal attention mechanisms based model for collective activity recognition.",
            "Low-light image enhancement using Gaussian Process for features retrieval.",
            "Diverse adversarial network for image super-resolution.",
            "HDR Display Quality Evaluation by incorporating Perceptual Component Models into a Machine Learning framework.",
            "Reduced-reference image quality metric based on statistic model in complex wavelet transform domain.",
            "Robust global and local color matching in stereoscopic omnidirectional content.",
            "Prototype adjustment for zero shot classification.",
            "Multi-scale Optimal Fusion model for single image dehazing.",
            "Colorization-based image coding using graph Fourier transform.",
            "A low complexity wavelet-based blind image quality evaluator.",
            "Clustering based one-to-one hypergraph matching with a large number of feature points.",
            "A distortion-agnostic video quality metric based on multi-scale spatio-temporal structural information.",
            "Quality assessment for view synthesis using low-level and mid-level structural representation.",
            "Pan-sharpening via a gradient-based deep network prior.",
            "Towards efficient medical lesion image super-resolution based on deep residual networks.",
            "Motion and appearance based background subtraction for freely moving cameras.",
            "Multiview video quality enhancement without depth information.",
            "An almost complete curvature scale space representation: Euclidean case.",
            "A strategy based on non-extensive statistics to improve frame-matching algorithms under large viewpoint changes.",
            "Efficient reversible data hiding in encrypted images based on multi-stage integer wavelet transform.",
            "Contrast sensitivity in images of natural scenes.",
            "Consistent video projection on curved displays.",
            "Feature augmentation for imbalanced classification with conditional mixture WGANs.",
            "Random grid based color visual cryptography scheme for black and white secret images with general access structures.",
            "Depth acquisition with the combination of structured light and deep learning stereo matching.",
            "Deep compact discriminative representation for unconstrained face recognition.",
            "The optical fringe code modulation and recognition algorithm based on visible light communication using convolutional neural network.",
            "A fast CU partition method based on CU depth spatial correlation and RD cost characteristics for HEVC intra coding.",
            "Face super-resolution via bilayer contextual representation.",
            "Quality-aware dual-modal saliency detection via deep reinforcement learning.",
            "Linking visual saliency deviation to image quality degradation: A saliency deviation-based image quality index.",
            "Two-dimensional dispersion entropy: An information-theoretic method for irregularity analysis of images.",
            "Investigating 3D holoscopic visual content upsampling using super-resolution for cultural heritage digitization.",
            "Special issue on Deep Learning in Image and Video Forensics.",
            "No-reference perceptual quality assessment of stereoscopic images based on binocular visual characteristics.",
            "Blind quality assessment metric and degradation classification for degraded document images.",
            "An adaptive steganographic scheme for H.264/AVC video with distortion optimization.",
            "Neighborhood kinship preserving hashing for supervised learning.",
            "Space-variant blur kernel estimation and image deblurring through kernel clustering.",
            "DCSN-Cast: Deep compressed sensing network for wireless video multicast.",
            "Naturalness- and information-preserving image recoloring for red-green dichromats.",
            "Occlusion expression recognition based on non-convex low-rank double dictionaries and occlusion error model.",
            "An enhanced approach for detecting double JPEG compression with the same quantization matrix.",
            "Adaptive inter CU partitioning based on a look-ahead stage for HEVC.",
            "Novel applications of discrete mereotopology to mathematical morphology.",
            "Distributed video coding using interval overlapped arithmetic coding.",
            "Displaying detail in bright environments: A 10, 000 nit display and its evaluation.",
            "The development of a clinically tested visually lossless Image compression system for capsule endoscopy.",
            "Multiresolution co-clustering for uncalibrated multiview segmentation.",
            "Digital image forensics of non-uniform deblurring.",
            "Hyperspectral image classification using Non-negative Tensor Factorization and 3D Convolutional Neural Networks.",
            "A behaviorally inspired fusion approach for computational audiovisual saliency modeling.",
            "Adaptive local-fitting-based active contour model for medical image segmentation.",
            "A variational image segmentation method exploring both intensity means and texture patterns.",
            "Reference-based local color distribution transformation method and its application to image integration.",
            "Hierarchical residual learning for image denoising.",
            "Texture retrieval using periodically extended and adaptive curvelets.",
            "Vehicle re-identification in still images: Application of semi-supervised learning and re-ranking.",
            "Depth-based color stereo images retrieval using joint multivariate statistical models.",
            "A probabilistic topic model for event-based image classification and multi-label annotation.",
            "Aesthetic guided deep regression network for image cropping.",
            "Generalized compressed sensing with QR-based vision matrix learning for face recognition under natural scenes.",
            "Convolutional sparse coding for demosaicking with panchromatic pixels.",
            "DeepFlash: Turning a flash selfie into a studio portrait.",
            "Depth map upsampling with a confidence-based joint guided filter.",
            "Bio-inspired optimization algorithms for real underwater image restoration.",
            "Fast face detection on mobile devices by leveraging global and local facial characteristics.",
            "Gestalt-grouping based on path analysis for saliency detection.",
            "Robust background generation based on an effective frames selection method and an efficient background estimation procedure (FSBE).",
            "First steps toward CNN based source classification of document images shared over messaging app.",
            "Fusion global and local deep representations with neural attention for aesthetic quality assessment.",
            "No-reference image quality assessment focusing on human facial region.",
            "New discretization of total variation functional for image processing tasks.",
            "A novel correlation filter based on variational calculus.",
            "A statistical evaluation of eye-tracking data of screening mammography: Effects of expertise and experience on image reading.",
            "Learning to remove reflections from windshield images.",
            "Accurate salient object detection via dense recurrent connections and residual-based hierarchical feature integration.",
            "ROI-CSNet: Compressive sensing network for ROI-aware image recovery.",
            "Multi-focus image fusion based on joint sparse representation and optimum theory.",
            "Optimal and suboptimal channel precoding and decoding matrices for linear video coding.",
            "A multi-metric approach for block-level video quality assessment.",
            "Interactive image segmentation using geodesic appearance overlap graph cut.",
            "Multiple classifier-based fast coding unit partition for intra coding in future video coding.",
            "A fast temporal and hybrid SHVC encoder.",
            "Active contour model based on local bias field estimation for image segmentation.",
            "An improved Kernelized Correlation Filter tracking algorithm based on multi-channel memory model.",
            "Learning a multi-level guided residual network for single image deraining.",
            "Enhanced embedding capacity for the SMSD-based data-hiding method.",
            "Contactless approach for heart rate estimation for QoE assessment.",
            "Multi-Scale Gradient Image Super-Resolution for Preserving SIFT Key Points in Low-Resolution Images.",
            "A weighted feature extraction method based on temporal accumulation of optical flow for micro-expression recognition.",
            "Effective quality metric for contrast-distorted images based on SVD.",
            "Wide context learning network for stereo matching.",
            "An optimization framework for inverse tone mapping using a single low dynamic range image.",
            "Unsupervised learning of depth estimation based on attention model and global pose optimization.",
            "Depth perceptual quality assessment for symmetrically and asymmetrically distorted stereoscopic 3D videos.",
            "A framework of tracking by multi-trackers with multi-features in a hybrid cascade way.",
            "Transform with residual rearrangement for HEVC intra coding.",
            "A data hiding scheme based on multidirectional line encoding and integer wavelet transform.",
            "No-reference artifacts measurements based video quality metric.",
            "A metadata-free pure soft broadcast scheme for image and video transmission.",
            "DeepAge: Deep Learning of face-based age estimation.",
            "An effective approach for color video recovery based on balanced tensor.",
            "Content-oriented image quality assessment with multi-label SVM classifier.",
            "Distortion propagation modeling and its applications on frame level quantization control for predictive video coding.",
            "Ghosting-free DCT based multi-exposure image fusion.",
            "A reversible visible watermarking for 2D CAD engineering graphics based on graphics fusion.",
            "Invertible secret image sharing with steganography and authentication for AMBTC compressed images.",
            "Efficient & secure cipher scheme with dynamic key-dependent mode of operation.",
            "Advanced deep learning techniques for image style transfer: A survey.",
            "Image saliency prediction by learning deep probability model.",
            "LLp norm regularization based group sparse representation for image compressed sensing recovery.",
            "A supervised learning to index model for approximate nearest neighbor image retrieval.",
            "Fast inter mode decision exploiting intra-block similarity in HEVC.",
            "Corrigendum to: \"A novel correlation filter based on variational calculus\" [Signal Process.: Image Commun. 78 (2019) 77-85].",
            "Directive local color transfer based on dynamic look-up table.",
            "Single image resolution enhancement by efficient dilated densely connected residual network.",
            "Image encryption using block cipher and chaotic sequences.",
            "A reduced-reference quality assessment metric for super-resolution reconstructed images with information gain and texture similarity.",
            "View-synthesis from uncalibrated cameras and parallel planes.",
            "Quality assessment of images with multiple distortions based on phase congruency and gradient magnitude.",
            "Perception-guided multi-channel visual feature fusion for image retargeting.",
            "Human body reshaping and its application using multiple RGB-D sensors."
        ]
    },
    {
        "name": "SPIC",
        "year": "2018",
        "info": "2018: Volumes\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67,\n68,\n69",
        "count": 157,
        "papers": [
            "Compressive Bayesian K-SVD.",
            "Anomaly detection based on two global grid motion templates.",
            "A multi-scale non-uniformity correction method based on wavelet decomposition and guided filtering for uncooled long wave infrared camera.",
            "Histogram modelling-based no reference blur quality measure.",
            "Bayesian dictionary learning for hyperspectral image super resolution in mixed Poisson-Gaussian noise.",
            "A saliency-based approach to event recognition.",
            "Deep convolutional neural network for latent fingerprint enhancement.",
            "Pseudo-full-space representation based classification for robust face recognition.",
            "An efficient all-zero block detection algorithm for high efficiency video coding with RDOQ.",
            "Multiple rotation symmetry group detection via saliency-based visual attention and Frieze expansion pattern.",
            "Fast computation of the compressive hyperspectral imaging by using alternating least squares methods.",
            "Extracting sub-exposure images from a single capture through Fourier-based optical modulation.",
            "MPEG-4 AVC stream-based saliency detection. Application to robust watermarking.",
            "End-to-end subtitle detection and recognition for videos in East Asian languages via CNN ensemble.",
            "Light field image coding with jointly estimated self-similarity bi-prediction.",
            "Visible watermark removal scheme based on reversible data hiding and image inpainting.",
            "Multi-graph embedding discriminative correlation feature learning for image recognition.",
            "Deep learning assisted robust visual tracking with adaptive particle filtering.",
            "Convolutional neural network with nonlinear competitive units.",
            "Improved block redundancy mining based reversible data hiding using multi-sub-blocking.",
            "A fast inter CU decision algorithm for HEVC.",
            "A Robust method for constructing rotational invariant descriptors.",
            "Semantic-aware blind image quality assessment.",
            "Joint disparity and variable size-block optimization algorithm for stereoscopic image compression.",
            "Robust first quantization matrix estimation based on filtering of recompression artifacts for non-aligned double compressed JPEG images.",
            "Hierarchical secret image sharing scheme in compressed sensing.",
            "A Haar wavelet-based perceptual similarity index for image quality assessment.",
            "Impact of the face registration techniques on facial expressions recognition.",
            "Perceptual quality evaluation of synthetic pictures distorted by compression and transmission.",
            "Hierarchical Multi-scale Attention Networks for action recognition.",
            "Face recognition with Patch-based Local Walsh Transform.",
            "Non-uniform motion deblurring with Kernel grid regularization.",
            "Saliency refinement: Towards a uniformly highlighted salient object.",
            "Fast CU size decision algorithm using machine learning for HEVC intra coding.",
            "Fast lexicographical order-based encoder for lattice vector quantization of Generalized Gaussian sources using pre-computed n-balls cardinalities.",
            "Content-aware contrast ratio measure for images.",
            "A novel reversible data hiding method with image contrast enhancement.",
            "Efficient screen content intra coding based on statistical learning.",
            "Less is more: Micro-expression recognition from video using apex frame.",
            "Highly parallel HEVC decoding for heterogeneous systems with CPU and GPU.",
            "Source-channel coding-based watermarking for self-embedding of JPEG images.",
            "Context multi-task visual object tracking via guided filter.",
            "Probabilistic modelling of printed dots at the microscopic scale.",
            "Label and orthogonality regularized non-negative matrix factorization for image classification.",
            "A regularized tensor decomposition method with adaptive rank adjustment for Compressed-Sensed-Domain background subtraction.",
            "Cryptanalysis of a chaotic image encryption scheme based on permutation-diffusion structure.",
            "Large-scale vocabularies with local graph diffusion and mode seeking.",
            "Image super-resolution via a novel cascaded convolutional neural network framework.",
            "Stabilization of atmospheric turbulence-distorted video containing moving objects using the monogenic signal.",
            "Deep convolutional image retrieval: A general framework.",
            "Visual object tracking with multi-scale superpixels and color-feature guided kernelized correlation filters.",
            "Eye landmarks detection via two-level cascaded CNNs with multi-task learning.",
            "Image reconstruction based on circulant matrices.",
            "Optimized cross-layer transmission for scalable video over DVB-H networks.",
            "Lossless-constraint Denoising based Auto-encoders.",
            "Automatic saturation correction for dynamic range management algorithms.",
            "Optimal Lagrange multipliers for dependent rate allocation in video coding.",
            "Visually lossless coding in HEVC: A high bit depth and 4: 4: 4 capable JND-based perceptual quantisation technique for HEVC.",
            "Repeated review based image captioning for image evidence review.",
            "A novel contrast enhancement forensics based on convolutional neural networks.",
            "Using multiple spatio-temporal features to estimate video quality.",
            "An observation based muscle model for simulation of facial expressions.",
            "Coarse-to-fine salient object detection based on deep convolutional neural networks.",
            "Parameter estimation of image gamma transformation based on zero-value histogram bin locations.",
            "Tailoring reversible data hiding for 3D synthetic images.",
            "Multi-task classification with sequential instances and tasks.",
            "HEVC encoder optimization for HDR video coding based on irregularity concealment effect.",
            "Reversible data hiding in encrypted images using adaptive block-level prediction-error expansion.",
            "Multi-oriented text detection from natural scene images based on a CNN and pruning non-adjacent graph edges.",
            "Assessment of 3DTV-related fatigue with resting-state fMRI.",
            "When correlation filters meet fully-convolutional Siamese networks for distractor-aware tracking.",
            "Counting challenging crowds robustly using a multi-column multi-task convolutional neural network.",
            "Binarized features with discriminant manifold filters for robust single-sample face recognition.",
            "Image self-recovery with watermark self-embedding.",
            "Adaptive Lagrangian Multiplier derivation model for depth map coding.",
            "Joint binocular energy-contrast perception for quality assessment of stereoscopic images.",
            "Image steganography in spatial domain: A survey.",
            "Representing local shape geometry from multi-view silhouette perspective: A distinctive and robust binary 3D feature.",
            "Block unshifting high-accuracy motion estimation: A new method adapted to super-resolution enhancement.",
            "New semi-supervised classification using a multi-modal feature joint L21-norm based sparse representation.",
            "Interactive object segmentation in two phases.",
            "Rate-distortion analysis of structured sensing matrices for block compressive sensing of images.",
            "Bivariate analysis of 3D structure for stereoscopic image quality assessment.",
            "Multi-purpose bi-local CAT-based guidance filter.",
            "Bitrate adaptation for seamless on-demand video streaming over mobile networks.",
            "Improvement of stereo matching algorithm for 3D surface reconstruction.",
            "MVP2P: Layer-dependency-aware live MVC video streaming over peer-to-peer networks.",
            "Towards a tone mapping-robust watermarking algorithm for high dynamic range image based on spatial activity.",
            "Applying stochastic second-order entropy images to multi-modal image registration.",
            "A construction method of (t, k, n)-essential secret image sharing scheme.",
            "Discriminative correlation hashing for supervised cross-modal retrieval.",
            "Weak boundary preserved superpixel segmentation based on directed graph clustering.",
            "On the vulnerability of deep learning to adversarial attacks for camera model identification.",
            "SGCRSR: Sequential gradient constrained regression for single image super-resolution.",
            "An enhanced fragile watermarking scheme to digital image protection and self-recovery.",
            "Robust PRNU estimation from probabilistic raw measurements.",
            "Improving recovered image quality in secret image sharing by simple modular arithmetic.",
            "Learning spatio-temporal context via hierarchical features for visual tracking.",
            "Exploiting variable-length padding bits for decoder performance improvement with its application to compressed video transmission.",
            "Progressive (k, n) secret image sharing schemes based on Boolean operations and covering codes.",
            "Generalized Gaussian scale mixtures: A model for wavelet coefficients of natural images.",
            "Online CNN-based multiple object tracking with enhanced model updates and identity association.",
            "Locating splicing forgery by fully convolutional networks and conditional random field.",
            "Exposing computer generated images by using deep convolutional neural networks.",
            "A nonconvex fractional order variational model for multi-frame image super-resolution.",
            "Visual aesthetic understanding: Sample-specific aesthetic classification and deep activation map visualization.",
            "DCT-domain deep convolutional neural networks for multiple JPEG compression classification.",
            "Low complexity intra prediction mode decision for 3D-HEVC depth coding.",
            "Video analytical coding: When video coding meets video analysis.",
            "Spatial-temporal adaptive feature weighted correlation filter for visual tracking.",
            "Light field super resolution through controlled micro-shifts of light field sensor.",
            "Sparse representation and adaptive mixed samples regression for single image super-resolution.",
            "A deep learning approach to patch-based image inpainting forensics.",
            "Modeling visual and word-conditional semantic attention for image captioning.",
            "Motion descriptors for micro-expression recognition.",
            "Ordinal preserving matrix factorization for unsupervised feature selection.",
            "Paired mini-batch training: A new deep network training for image forensics and steganalysis.",
            "A fast CU partition and mode decision algorithm for HEVC intra coding.",
            "Distribution strategies for very large 3D image deconvolution algorithms.",
            "Adaptive features selection for expert datasets: A cultural heritage application.",
            "Image retargeting quality assessment based on content deformation measurement.",
            "Video quality assessment accounting for temporal visual masking of local flicker.",
            "Fast constrained person identity label propagation in stereo videos using a pruned similarity matrix.",
            "A general scheme for finding the static rate-distortion optimized ordering for the bits of the coefficients of all subbands of an N-level dyadic biorthogonal DWT.",
            "Spatio-temporal super-resolution for multi-videos based on belief propagation.",
            "Visual tracking using Locality-constrained Linear Coding and saliency map for visible light and infrared image sequences.",
            "Mixed Gaussian-impulse noise reduction from images using convolutional neural network.",
            "Digital video stabilization based on multilayer gray projection.",
            "Multispectral target detection based on the space-spectrum structure constraint with the multi-scale hierarchical model.",
            "RevHashNet: Perceptually de-hashing real-valued image hashes for similarity retrieval.",
            "Low rank matrix completion using truncated nuclear norm and sparse regularizer.",
            "Deep unsupervised learning for image super-resolution with generative adversarial network.",
            "Suitability of recent hardware accelerators (DSPs, FPGAs, and GPUs) for computer vision and image processing algorithms.",
            "High dynamic range image tone mapping based on asymmetric model of retinal adaptation.",
            "Construction of efficient and structural chaotic sensing matrix for compressive sensing.",
            "Spatial-scale-regularized blur kernel estimation for blind image deblurring.",
            "A JPEG blocking artifact detector for image forensics.",
            "Source camera model identification based on convolutional neural networks with local binary patterns coding.",
            "Weak-structure-aware visual object tracking with bottom-up and top-down context exploration.",
            "Blind image splicing detection via noise level function.",
            "Holographic representation: Hologram plane vs. object plane.",
            "Two-stage modality-graphs regularized manifold ranking for RGB-T tracking.",
            "Feature-based prediction of streaming video QoE: Distortions, stalling and memory.",
            "A multiplicative video watermarking robust to H.264/AVC compression standard.",
            "Selective capture based high-speed optical vehicular signaling system.",
            "Efficient coding mode and partition decision for screen content intra coding.",
            "Detecting USM image sharpening by using CNN.",
            "Human activity recognition using dynamic representation and matching of skeleton feature sequences from RGB-D images.",
            "A novel superpixel-based saliency detection model for 360-degree images.",
            "Scanpath and saliency prediction on 360 degree images.",
            "The prediction of head and eye movement for 360 degree images.",
            "SalNet360: Saliency maps for omni-directional images with CNN.",
            "Toolbox and dataset for the development of saliency and scanpath models for omnidirectional/360° still images.",
            "360-aware saliency estimation with conventional image saliency predictors.",
            "A feature-based approach for saliency estimation of omni-directional images.",
            "A saliency prediction model on 360 degree images using color dictionary based sparse representation.",
            "GBVS360, BMS360, ProSal: Extending existing saliency prediction models from 2D to omnidirectional images."
        ]
    },
    {
        "name": "SPIC",
        "year": "2017",
        "info": "2017: Volumes\n50,\n51,\n52,\n53,\n54,\n55,\n56,\n57,\n58,\n59",
        "count": 133,
        "papers": [
            "Text detection in scene images based on exhaustive segmentation.",
            "Evaluation of JPEG XT for high dynamic range cameras.",
            "Detail enhancement of image super-resolution based on detail synthesis.",
            "Image retargeting using depth assisted saliency map.",
            "A data hiding scheme using parity-bit pixel value differencing and improved rightmost digit replacement.",
            "Image-based object reconstruction using run-length representation.",
            "A comparative study for feature integration strategies in dynamic saliency estimation.",
            "A model of perceived dynamic range for HDR images.",
            "Low Bit-rate 3D feature descriptors for depth data from Kinect-style sensors.",
            "Visual discomfort prediction on stereoscopic 3D images without explicit disparities.",
            "Bit allocation for 3D video coding based on lagrangian multiplier adjustment.",
            "An image encryption algorithm based on the memristive hyperchaotic system, cellular automata and DNA sequence operations.",
            "Predictive no-reference assessment of video quality.",
            "Variational JPEG artifacts suppression based on high-order MRFs.",
            "Soft decoding algorithms for optimized JPEG 2000 wireless transmission over realistic MIMO-OFDM systems.",
            "A stereoscopic image quality assessment model based on independent component analysis and binocular fusion property.",
            "Optimizing ZNCC calculation in binocular stereo matching.",
            "Individual camera device identification from JPEG images.",
            "A new parallel image cryptosystem based on 5D hyper-chaotic system.",
            "A robust multi-stage information-theoretic approach for registration of partially overlapped hyperspectral aerial imagery and evaluation in the presence of system noise.",
            "Improving reversible color-to-grayscale conversion with halftoning.",
            "New adaptive filters as perceptual preprocessing for rate-quality performance optimization of video coding.",
            "An efficient unsupervised diffusion clustering algorithm with application to shape decomposition based on visibility context.",
            "Image restoration using structured sparse representation with a novel parametric data-adaptive transformation matrix.",
            "Optimal combining fusion on degraded compressed sensing image reconstruction.",
            "Efficient motion estimation methods for fast recognition of activities of daily living.",
            "uAVS2 - Fast encoder for the 2nd generation IEEE 1857 video coding standard.",
            "Curvelet transform with learning-based tiling.",
            "Color correction for large-baseline multiview video.",
            "MIL based visual object tracking with kernel and scale adaptation.",
            "Robust median filtering detection based on local difference descriptor.",
            "Histogram refinement for texture descriptor based image retrieval.",
            "Improving feature matching strategies for efficient image retrieval.",
            "A survey of design and implementation for optical camera communication.",
            "Robust object proposals re-ranking for object detection in autonomous driving using convolutional neural networks.",
            "Multidirectional parabolic prediction-based interpolation-free sub-pixel motion estimation.",
            "Sector-ring HOG for rotation-invariant human detection.",
            "Two-stage filtering of compressed depth images with Markov Random Field.",
            "Chaotic target representation for robust object tracking.",
            "Motion-compensated frame interpolation using patch-based sparseland model.",
            "HDR video past, present and future: A perspective.",
            "Robust contourlet-based blind watermarking for depth-image-based rendering 3D images.",
            "Maximum mean discrepancy regularized sparse reconstruction for robust salient regions detection.",
            "Image quality assessment based on multi-feature extraction and synthesis with support vector regression.",
            "Block compressive sensing of image and video with nonlocal Lagrangian multiplier and patch-based sparse representation.",
            "No-reference stereo image quality assessment based on joint wavelet decomposition and statistical models.",
            "Action Recognition from Still Images Based on Deep VLAD Spatial Pyramids.",
            "Cosine transforms over fields of characteristic 2: Fast computation and application to image encryption.",
            "Novel robust zero-watermarking scheme for digital rights management of 3D videos.",
            "Quadtree coding with adaptive scanning order for space-borne image compression.",
            "Small-block sensing and larger-block recovery in block-based compressive sensing of images.",
            "A combined watermarking approach for securing biometric data.",
            "Pair of projections based on sparse consistence with applications to efficient face recognition.",
            "A statistical analysis of the kernel-based MMSE estimator with application to image reconstruction.",
            "Deblurring of motion blurred images using histogram of oriented gradients and geometric moments.",
            "A new compressive sensing video coding framework based on Gaussian mixture model.",
            "Improved depth coding for HEVC focusing on depth edge approximation.",
            "Optimizing multi-graph learning based salient object detection.",
            "Robust extrinsic calibration from pedestrians.",
            "Fast intra coding unit decision for high efficiency video coding based on statistical information.",
            "Reduced-reference image quality assessment based on distortion families of local perceived sharpness.",
            "Tensor compressed video sensing reconstruction by combination of fractional-order total variation and sparsifying transform.",
            "Appearance-based multiple hypothesis tracking: Application to soccer broadcast videos analysis.",
            "Bayesian adaptive algorithm for fast coding unit decision in the High Efficiency Video Coding (HEVC) standard.",
            "Learning quality assessment of retargeted images.",
            "Improving object proposals with top-down cues.",
            "Superpixel segmentation: A benchmark.",
            "Adaptive Lagrange multiplier estimation algorithm in HEVC.",
            "Dealing with video source identification in social networks.",
            "Detection of operation chain: JPEG-Resampling-JPEG.",
            "Data-driven image completion for complex objects.",
            "Image denoising searching similar blocks along edge directions.",
            "A secure image sharing scheme based on SVD and Fractional Fourier Transform.",
            "Generating random grid-based visual secret sharing with multi-level encoding.",
            "An efficient Lagrangian multiplier selection method based on temporal dependency for rate-distortion optimization in H.265/HEVC.",
            "MSE period based estimation of first quantization step in double compressed JPEG images.",
            "Pose-invariant 3D face recognition using half face.",
            "Combined trajectories for action recognition based on saliency detection and motion boundary.",
            "A review of algorithms for filtering the 3D point cloud.",
            "An improved method for SIFT-based copy-move forgery detection using non-maximum value suppression and optimized J-Linkage.",
            "Naturalness preserving image recoloring method for people with red-green deficiency.",
            "A reversible watermarking for authenticating 2D vector graphics based on bionic spider web.",
            "Quality of experience measurement of compressed multi-view video.",
            "QoE-driven optimization for cloud-assisted DASH-based scalable interactive multiview video streaming over wireless network.",
            "Analysis of HEVC transform throughput requirements for hardware implementations.",
            "A novel framework for compressed sensing based scalable video coding.",
            "Multi-layer strategy and reconstruction model with low rank and local rank regularizations for single image super-resolution.",
            "A visual quality evaluation method for telemedicine applications.",
            "Fast recovery of unknown coefficients in DCT-transformed images.",
            "DCT approximations based on Chen's factorization.",
            "An iterative image super-resolution approach based on Bregman distance.",
            "Cubature Kalman filter-based chaotic synchronization and image encryption.",
            "Scalable secret image sharing scheme with essential shadows.",
            "Pre-/post-processing to improve the coding performance of multiview plus depth map.",
            "Bayesian compressive sensing using wavelet based Markov random fields.",
            "Real-time selective video encryption based on the chaos system in scalable HEVC extension.",
            "A hand gesture recognition system based on canonical superpixel-graph.",
            "Variational framework for low-light image enhancement using optimal transmission map and combined ℓ2 and ℓ2-minimization.",
            "An efficient reversible image authentication method using improved PVO and LSB substitution techniques.",
            "Non-separable four-dimensional integer wavelet transform with reduced rounding noise.",
            "Blur kernel estimation via salient edges and low rank prior for blind image deblurring.",
            "Data embedding in digital images using critical functions.",
            "Power and sub-channel optimization of JPEG 2000 image transmission over OFDM-based cognitive radio networks.",
            "No-reference quality assessment of compressive sensing image recovery.",
            "Illumination and pose variable face recognition via adaptively weighted ULBP_MHOG and WSRC.",
            "An effective histogram modification scheme for image contrast enhancement.",
            "Joint image registration and point spread function estimation for the super-resolution of satellite images.",
            "Towards the design of a consistent image contrast enhancement evaluation measure.",
            "An advanced global point signature for 3D shape recognition and retrieval.",
            "Severe-occluded 3D object identification via region-based descriptions.",
            "Variational single image interpolation with time-varying regularization.",
            "Global sparse gradient guided variational Retinex model for image enhancement.",
            "Video thumbnail extraction for HEVC.",
            "Binocular spatial activity and reverse saliency driven no-reference stereopair quality assessment.",
            "Facial decomposition for expression recognition using texture/shape descriptors and SVM classifier.",
            "Special issue on Medical Image Communication, Computing and Security.",
            "Ultrasound despeckling by anisotropic diffusion and total variation methods for liver fibrosis diagnostics.",
            "Fast medical image registration using bidirectional empirical mode decomposition.",
            "A non-invasive and adaptive CAD system to detect brain tumor from T2-weighted MRIs using customized Otsu's thresholding with prominent features and supervised learning.",
            "Patch-based corner detection for cervical vertebrae in X-ray images.",
            "Segmentation of left ventricle on dynamic MRI sequences for blood flow cancellation in Thermotherapy.",
            "Retinal network characterization through fundus image processing: Significant point identification on vessel centerline.",
            "3D Reconstruction of the proximal femur shape from few pairs of x-ray radiographs.",
            "Assessment of sparse-based inpainting for retinal vessel removal.",
            "Low-power DCT-based compressor for wireless capsule endoscopy.",
            "A method to improve HEVC lossless coding of volumetric medical images.",
            "Big Media Data Analysis.",
            "Deep convolutional hashing using pairwise multi-label supervision for large-scale visual search.",
            "Isometric hashing for image retrieval.",
            "A medical image retrieval method based on texture block coding tree.",
            "Multi-marker tracking for large-scale X-ray stereo video data.",
            "A comprehensive evaluation of local detectors and descriptors.",
            "BNU-LSVED 2.0: Spontaneous multimodal student affect database with multi-dimensional labels."
        ]
    },
    {
        "name": "SPIC",
        "year": "2016",
        "info": "2016: Volumes\n40,\n41,\n42,\n43,\n44,\n45,\n46,\n47,\n48,\n49",
        "count": 115,
        "papers": [
            "Blind image quality assessment by relative gradient statistics and adaboosting neural network.",
            "Geometric structure guided collaborative compressed sensing.",
            "Video fragment format classification using optimized discriminative subspace clustering.",
            "SSIM-based error-resilient cross-layer optimization for wireless video streaming.",
            "A chaotic-cipher-based packet body encryption algorithm for JPEG2000 images.",
            "A full photometric and geometric model for attached webcam/matte screen devices.",
            "Phase preserving Fourier descriptor for shape-based image retrieval.",
            "From stereoscopic images to semi-regular meshes.",
            "Robust image watermarking based on Tucker decomposition and Adaptive-Lattice Quantization Index Modulation.",
            "Denoising and error correction in noisy AES-encrypted images using statistical measures.",
            "Correction and interpolation of depth maps from structured light infrared sensors.",
            "LEDTD: Local edge direction and texture descriptor for face recognition.",
            "Centrality bias measure for high density QR code module recognition.",
            "DFOB: Detecting and describing features by octagon filter bank for fast image matching.",
            "Enhanced pipelined architecture of H.264/AVC intra prediction.",
            "Halftone image watermarking via optimization.",
            "Object retrieval with image graph traversal-based re-ranking.",
            "A relaxation approach to computation of second-order wedgelet transform with application to image compression.",
            "Analysis of the depth-shift distortion as an estimator for view synthesis distortion.",
            "A new chaos-based image encryption system.",
            "Model based variational Bayesian compressive sensing using heavy tailed sparse prior.",
            "Reduction of temporal distortion in video coding based on detection of just-noticeable temporal pumping artifact.",
            "Human action recognition using multi-layer codebooks of key poses and atomic motions.",
            "MVS: A multi-view video synopsis framework.",
            "Texture retrieval using mixtures of generalized Gaussian distribution and Cauchy-Schwarz divergence in wavelet domain.",
            "HEVC-based 3D holoscopic video coding using self-similarity compensated prediction.",
            "CU encoding depth prediction, early CU splitting termination and fast mode decision for fast HEVC intra-coding.",
            "An efficient and secure cipher scheme for images confidentiality preservation.",
            "Profile HMMs for skeleton-based human action recognition.",
            "Using electroencephalography to analyze sleepiness due to low-quality audiovisual stimuli.",
            "No-reference Stereoscopic Image Quality Assessment Using Natural Scene Statistics.",
            "Evaluating the influence of packet loss on visual quality of perception for high bandwidth automotive networks.",
            "Top-down visual attention integrated particle filter for robust object tracking.",
            "A data-fusion approach to motion-stereo.",
            "Optimization-based methodology for training set selection to synthesize composite correlation filters for face recognition.",
            "Single image super resolution using local smoothness and nonlocal self-similarity priors.",
            "VLAD re-ranking: Iteratively estimating the probability of relevance with relationships between dataset images.",
            "Fast intra mode decision algorithm based on texture orientation detection in HEVC.",
            "Fast two-cycle curve evolution with narrow perception of background for object tracking and contour refinement.",
            "Stereo matching based on multi-direction polynomial model.",
            "Visual saliency detection: From space to frequency.",
            "Co-saliency detection via inter and intra saliency propagation.",
            "High capacity reversible data hiding scheme for encrypted images.",
            "On the difficulty of aligning VSS random grids.",
            "An enhanced entropy coding scheme for HEVC.",
            "Multiscale contrast similarity deviation: An effective and efficient index for perceptual image quality assessment.",
            "Geometrically invariant image watermarking based on fast Radial Harmonic Fourier Moments.",
            "A classifier-guided approach for top-down salient object detection.",
            "Robust and hierarchical watermarking of encrypted images based on Compressive Sensing.",
            "Reversible data hiding with contrast enhancement using adaptive histogram shifting and pixel value ordering.",
            "A novel framework method for non-blind deconvolution using subspace images priors.",
            "Texture enhancement for improving single-image super-resolution performance.",
            "Evaluating the true potential of diffusion-based inpainting in a compression context.",
            "Fast content access and retrieval of JPEG compressed images.",
            "Identifying deficits of visual security metrics for images.",
            "Stereoscopic view synthesis based on region-wise rendering and sparse representation.",
            "Visual structural degradation based reduced-reference image quality assessment.",
            "Image compressive sensing via Truncated Schatten-p Norm regularization.",
            "Super-multiview content with high angular resolution: 3D quality assessment on horizontal-parallax lightfield display.",
            "Depth dithering based on texture edge-assisted classification.",
            "New framework for unsupervised universal steganalysis via SRISP-aided outlier detection.",
            "Fast watermarking scheme for real-time spatial scalable video coding.",
            "Low bit-rate compression of underwater imagery based on adaptive hybrid wavelets and directional filter banks.",
            "Digital image stabilization using similarity transformation over constrained Differential-Radon warping vectors.",
            "De-identification for privacy protection in multimedia content: A survey.",
            "Hierarchical modulation for client-driven selective streaming of multi-view video over AWGN channels.",
            "A crypto-watermarking system for ensuring reliability control and traceability of medical images.",
            "Spontaneous subtle expression detection and recognition based on facial strain.",
            "Fast depth map coding based on virtual view quality.",
            "A multi-scaled hierarchical structure model for multispectral image detection.",
            "Semi-supervised classification via discriminative sparse manifold regularization.",
            "A noise-immune no-reference metric for estimating blurriness value of an image.",
            "Reduction of transients during lifting based spatial switching of two-channel filter banks.",
            "Eliminating bandwidth estimation from adaptive video streaming in wireless networks.",
            "On lossless intra coding in HEVC with 3-tap filters.",
            "Data hiding in encrypted images based on predefined watermark embedding before encryption process.",
            "A fast inter coding algorithm for HEVC based on texture and motion quad-tree models.",
            "Comparing visual descriptors and automatic rating strategies for video aesthetics prediction.",
            "Inter-frame video forgery detection and localization using intrinsic effects of double compression on quantization errors of video coding.",
            "Object tracking with temporal prediction and spatial refinement (TPSR).",
            "Adaptive error concealment for temporal-spatial multiple description video coding.",
            "GSWO: A programming model for GPU-enabled parallelization of sliding window operations in image processing.",
            "No-reference Stereoscopic Image Quality Assessment Using Binocular Self-similarity and Deep Neural Network.",
            "Spatial-temporal convolutional neural networks for anomaly detection and localization in crowded scenes.",
            "Two-dimensional reversible data hiding-based approach for intra-frame error concealment in H.264/AVC.",
            "Multi-scale salient object detection using graph ranking and global-local saliency refinement.",
            "Methods for reducing visual discomfort in stereoscopic 3D: A review.",
            "Appearance based background subtraction for PTZ cameras.",
            "Objective and subjective evaluation of High Dynamic Range video compression.",
            "3D holoscopic image coding scheme using HEVC with Gaussian process regression.",
            "Surface reflectance estimation and segmentation from single depth image of ToF camera.",
            "Guest Editors' Introduction: Special issue on deep learning with applications to visual representation and analysis.",
            "Landmark perturbation-based data augmentation for unconstrained face recognition.",
            "FaceHunter: A multi-task convolutional neural network based face detector.",
            "Deep Convolutional Neural Networks for pedestrian detection.",
            "Robust object representation by boosting-like deep learning architecture.",
            "Hierarchical aesthetic quality assessment using deep convolutional neural networks.",
            "A multi-scene deep learning model for image aesthetic evaluation.",
            "Ada-Sal Network: emulate the Human Visual System.",
            "Nrityabodha: Towards understanding Indian classical dance using a deep learning approach.",
            "EEG-based prediction of driver's cognitive performance by deep convolutional neural network.",
            "Hiding color watermarks in halftone images using maximum-similarity binary patterns.",
            "Robust watermarking scheme for color image based on quaternion-type moment invariants and visual cryptography.",
            "Direction-adaptive fixed length discrete cosine transform framework for efficient H.264/AVC video coding.",
            "Support for reduced presentation durations in subjective video quality assessment.",
            "Mixing tone mapping operators on the GPU by differential zone mapping based on psychophysical experiments.",
            "Employing structural and statistical information to learn dictionary(s) for single image super-resolution in sparse domain.",
            "Perceptual quality evaluation for image defocus deblurring.",
            "CSV: Image quality assessment based on color, structure, and visual system.",
            "Enhancing inverse halftoning via coupled dictionary training.",
            "Graph-Boolean Map for salient object detection.",
            "Visual tracking via adaptive multi-task feature learning with calibration and identification.",
            "Image encryption via discrete fractional Fourier-type transforms generated by random matrices.",
            "A group matching pursuit for image reconstruction.",
            "Compressive sensing reconstruction via decomposition."
        ]
    },
    {
        "name": "SPIC",
        "year": "2015",
        "info": "2015: Volumes\n30,\n31,\n32,\n33,\n34,\n35,\n36,\n37,\n38,\n39",
        "count": 133,
        "papers": [
            "Multiview side information creation for efficient Wyner-Ziv video coding: Classifying and reviewing.",
            "Multi-image high dynamic range algorithm using a hybrid camera.",
            "Image database TID2013: Peculiarities, results and perspectives.",
            "Objective image quality assessment of 3D synthesized views.",
            "A parallel H.264/SVC encoder for high definition video conferencing.",
            "Multiview coding and error correction coding for 3D video over noisy channels.",
            "A saliency detection model using aggregation degree of color and texture.",
            "Image and video spatial super-resolution via bandlet-based sparsity regularization and structure tensor.",
            "Space-time super-resolution with patch group cuts prior.",
            "Video human segmentation based on multiple-cue integration.",
            "Stratified gesture recognition using the normalized longest common subsequence with rough sets.",
            "A human action recognition approach with a novel reduced feature set based on the natural domain knowledge of the human figure.",
            "Reducing shadow size in essential secret image sharing by conjunctive hierarchical approach.",
            "Perceptual based SAO rate-distortion optimization method with a simplified JND model for H.265/HEVC.",
            "A fast partial distortion search algorithm for motion estimation based on the multi-traps assumption.",
            "Interfered depth map recovery with texture guidance for multiple structured light depth cameras.",
            "Beyond format-compliant encryption for JPEG image.",
            "An oriented gradient based image quality metric for pedestrian detection performance evaluation.",
            "Robust multi-scale ship tracking via multiple compressed features fusion.",
            "Super-resolution by polar Newton-Thiele's rational kernel in centralized sparsity paradigm.",
            "Spatio-temporal crowd density model in a human detection and tracking framework.",
            "Wavelet based volumetric medical image compression.",
            "Computation-constrained dynamic search range control for real-time video encoder.",
            "A cooperative protocol for video streaming in dense small cell wireless relay networks.",
            "Image watermarking using polar harmonic transform with parameters in SL(2, r).",
            "Disparity based stereo image retrieval through univariate and bivariate models.",
            "Perceptual quality assessment of 3D dynamic meshes: Subjective and objective studies.",
            "Position constraint based face image super-resolution by learning multiple local linear projections.",
            "Adjustable compression method for still JPEG images.",
            "An efficient compression scheme based on adaptive thresholding in wavelet domain using particle swarm optimization.",
            "Context-aware single image super-resolution using sparse representation and cross-scale similarity.",
            "Finding more relevance: Propagating similarity on Markov random field for object retrieval.",
            "Quantifying the importance of preserving video quality in visually important regions at the expense of background content.",
            "Distributed video coding: Assessing the HEVC upgrade.",
            "On the usage of the 2D-AR-model in texture completion scenarios with causal boundary conditions: A tutorial.",
            "Fast TU size decision algorithm for HEVC encoders using Bayesian theorem detection.",
            "Salience computation in images based on perceptual distinctness.",
            "Exploiting entropy masking in perceptual graphic rendering.",
            "Multiview video compression with 1-D transforms.",
            "Informative joints based human action recognition using skeleton contexts.",
            "Towards quality of experience determination for video in augmented binocular vision scenarios.",
            "HEVC backward compatible scalability: A low encoding complexity distributed video coding based approach.",
            "Convexity constrained efficient superpixel and supervoxel extraction.",
            "Facial image clustering in stereoscopic videos using double spectral analysis.",
            "A noise-suppressing and edge-preserving multiframe super-resolution image reconstruction method.",
            "When physics meets signal processing: Image and video denoising based on Ising theory.",
            "A regression-based framework for estimating the objective quality of HEVC coding units and video frames.",
            "Weak label for fast online visual tracking.",
            "Cryptanalysis and improvement of two hyper-chaos-based image encryption schemes.",
            "Difference angle quantization index modulation scheme for image watermarking.",
            "Personalized image annotation via class-specific cross-domain learning.",
            "Encryption of medical images based on the cosine number transform.",
            "Hybrid model-and-object-based real-time conversational video coding.",
            "A fast encoder of frame-compatible format based on content similarity for 3D distribution.",
            "Real-time event classification in field sport videos.",
            "HDR-VQM: An objective quality measure for high dynamic range video.",
            "Undecimated Dual-Tree Complex Wavelet Transforms.",
            "Privacy region protection for H.264/AVC with enhanced scrambling effect and a low bitrate overhead.",
            "Corrigendum to \"Super-resolution by polar Newton-Thiele's rational kernel in centralized sparsity paradigm\" [Signal Processing: Image Communication, 31(2015), pp 86-99].",
            "Two-level sliding-window VBR control algorithm for video on demand streaming.",
            "A case study in identifying acceptable bitrates for human face recognition tasks.",
            "On visual gaze tracking based on a single low cost camera.",
            "Geometric structure-constraint tracking with confident parts.",
            "SIFT-flow-based color correction for multi-view video.",
            "Hyperspectral image compression based on lapped transform and Tucker decomposition.",
            "Noise analysis for lensless compressive imaging.",
            "Image interpolation using shearlet based iterative refinement.",
            "Rate/distortion optimization in multiple description video coding.",
            "A self-synchronized chaotic image encryption scheme.",
            "Feature selection for low bit rate mobile augmented reality applications.",
            "Quaternionic wavelet coefficients modeling for a Reduced-Reference metric.",
            "Iterative particle filter for visual tracking.",
            "Discovering salient objects from videos using spatiotemporal salient region detection.",
            "A face detection and location method based on Feature Binding.",
            "Object tracking using discriminative sparse appearance model.",
            "Approximate message passing-based compressed sensing reconstruction with generalized elastic net prior.",
            "Coarse-to-fine outlier correction with applications in structure from motion.",
            "Inter-prediction methods based on linear embedding for video compression.",
            "Evaluation of the wavelet image two-line coder: A low complexity scheme for image compression.",
            "Special issue on recent advances in saliency models, applications and evaluations.",
            "Image saliency estimation via random walk guided by informativeness and latent signal correlations.",
            "A perceptually based spatio-temporal computational framework for visual saliency estimation.",
            "Video saliency detection incorporating temporal information in compressed domain.",
            "A spatiotemporal weighted dissimilarity-based method for video saliency detection.",
            "A depth perception and visual comfort guided computational model for stereoscopic 3D visual saliency.",
            "A visual attention model for stereoscopic 3D images using monocular cues.",
            "Saliency maps on image hierarchies.",
            "Spatiotemporal saliency detection based on superpixel-level trajectory.",
            "Depth-aware salient object detection using anisotropic center-surround difference.",
            "Weight-based R-λ rate control for perceptual HEVC coding on conversational videos.",
            "Improved image GPS location estimation by mining salient features.",
            "Multi-scale mesh saliency with local adaptive patches for viewpoint selection.",
            "Low-complexity and robust comic fingerprint method for comic identification.",
            "Secure spread-spectrum data embedding with PN-sequence masking.",
            "Single-image super-resolution using iterative Wiener filter based on nonlocal means.",
            "A bibliography of pixel-based blind image forgery detection techniques.",
            "Images steganalysis using GARCH model for feature selection.",
            "Time-varying delay measurement of video capture-to-display components with application to visual servoing.",
            "A generic framework for optimal 2D/3D key-frame extraction driven by aggregated saliency maps.",
            "Multi-channel descriptors and ensemble of Extreme Learning Machines for classification of remote sensing images.",
            "A novel Cooperative Motion Estimation Algorithm based on Particle Swarm Optimization and its multicore implementation.",
            "A new encryption-then-compression algorithm using the rate-distortion optimization.",
            "Breaking an image encryption scheme based on a spatiotemporal chaotic system.",
            "Sequential block-based disparity map estimation algorithm for stereoscopic image coding.",
            "Robust non-local stereo matching for outdoor driving images using segment-simple-tree.",
            "Homographic p-norms: Metrics of homographic image transformation.",
            "Robust coding of encrypted images via structural matrix.",
            "Cascaded probabilistic tracking with supervised dictionary learning.",
            "Encrypted image-based reversible data hiding with public key cryptography from difference expansion.",
            "Reversible data hiding in encrypted images using cross division and additive homomorphism.",
            "Application of reversible denoising and lifting steps to DWT in lossless JPEG 2000 for improved bitrates.",
            "Color image demosaicking using inter-channel correlation and nonlocal self-similarity.",
            "Complexity reduction methods for fast motion estimation in HEVC.",
            "Optimized Predictive Zonal Search (OPZS) for block-based motion estimation.",
            "Dynamic rate adaptation for adaptive video streaming in wireless networks.",
            "Recent advances in vision modeling for image and video processing.",
            "Scene masking is affected by trial blank-screen luminance.",
            "Motion silencing of flicker distortions on naturalistic videos.",
            "What can we expect from a V1-MT feedforward architecture for optical flow estimation?",
            "Color difference weighted adaptive residual preprocessing using perceptual modeling for video compression.",
            "Subjectie evaluation of Super Multi-View compressed contents on high-end light-field 3D displays.",
            "Perceived interest and overt visual attention in natural images.",
            "Temporal resolution vs. visual saliency in videos: Analysis of gaze patterns and evaluation of saliency models.",
            "Goal-oriented top-down probabilistic visual attention model for recognition of manipulated objects in egocentric videos.",
            "Quality of Experience of adaptive video streaming: Investigation in service parameters and subjective quality assessment methodology.",
            "Image retargeting quality assessment based on support vector regression.",
            "Lightweight implementation of No-Reference (NR) perceptual quality assessment of H.264/AVC compression.",
            "An optimization method for penalty-based six-degrees-of-freedom haptic rendering system.",
            "How to predict the global instantaneous feeling induced by a facial picture?",
            "Towards aesthetics of image: A Bayesian framework for color harmony modeling.",
            "An efficient image aesthetic analysis system using Hadoop.",
            "Seam carving based aesthetics enhancement for photos.",
            "Adaptive ranking of perceptual aesthetics."
        ]
    },
    {
        "name": "SPIC",
        "year": "2014",
        "info": "Volume 29: 2014",
        "count": 92,
        "papers": [
            "Perceptually driven video error protection using a distributed source coding approach.",
            "Rate control for unbalanced multiple description video streaming.",
            "Scene content driven FEC allocation for video streaming.",
            "A fast hybrid Jacket-Hadamard matrix based diagonal block-wise transform.",
            "Establishment of linkages across GOP boundaries for reverse playback on compressed video.",
            "Enhancing dynamic videos for surveillance and robotic applications: The robust bilateral and temporal filter.",
            "Chain code lossless compression using move-to-front transform and adaptive run-length encoding.",
            "Multi-symbol QIM video watermarking.",
            "A novel real-time and progressive secret image sharing with flexible shadows based on compressive sensing.",
            "A Scalable Reversible Data Embedding Method with progressive quality degradation functionality.",
            "MPEG-M: A digital media ecosystem for interoperable applications.",
            "Reduced-reference stereoscopic image quality assessment based on view and disparity zero-watermarks.",
            "Linear subspaces for facial expression recognition.",
            "Special issue on advances in high dynamic range video research.",
            "High dynamic range video reconstruction from a stereo camera setup.",
            "A unified framework for multi-sensor HDR video reconstruction.",
            "Enabling stereoscopic high dynamic range video.",
            "Zonal brightness coherency for video tone mapping.",
            "Evaluation of HDR video tone mapping for mobile devices.",
            "Tone mapping based HDR compression: Does it affect visual experience?",
            "Methods for improving the tone mapping for backward compatible high dynamic range image and video coding.",
            "Image quality assessment using a SVD-based structural projection.",
            "SSIM-based error-resilient rate-distortion optimization of H.264/AVC video coding for wireless streaming.",
            "Adaptive depth truncation filter for MVC based compressed depth image.",
            "Content-based group-of-picture size control in distributed video coding.",
            "White and narrow band image compressor based on a new color space for capsule endoscopy.",
            "Compressive image broadcasting in MIMO systems with receiver antenna heterogeneity.",
            "A PVD-based data hiding method with histogram preserving using pixel pair matching.",
            "A novel steganalysis framework of heterogeneous images based on GMM clustering.",
            "MRI and CT image indexing and retrieval using local mesh peak valley edge patterns.",
            "A perceptual scheme for fully automatic video shot boundary detection.",
            "Visual saliency detection based on region descriptors and prior knowledge.",
            "Bayesian salient object detection based on saliency driven clustering.",
            "Joint on-the-fly network coding/video quality adaptation for real-time delivery.",
            "Social video caching.",
            "Game-theoretic solutions through intelligent optimization for efficient resource management in wireless visual sensor networks.",
            "No-reference image quality assessment in curvelet domain.",
            "Joint-adaptive bilateral depth map upsampling.",
            "Video super resolution based on non-local regularization and reliable motion estimation.",
            "Feature integration of EODH and Color-SIFT: Application to image retrieval based on codebook.",
            "Action recognition via structured codebook construction.",
            "Curve normalization for shape retrieval.",
            "Stereo object tracking with fusion of texture, color and disparity information.",
            "Robust vision tracking by online random ferns and template library.",
            "Wireless multicasting of video signals based on distributed compressed sensing.",
            "On the provably secure CEW based on orthogonal decomposition.",
            "An image encryption scheme based on irregularly decimated chaotic maps.",
            "Color image encryption using one-time keys and coupled chaotic systems.",
            "Incentive analysis for cooperative interactive multiview video streaming.",
            "Efficient multi-view video coding using inter-view information.",
            "Estimation of accurate effective loss rate for FEC video transmission.",
            "Blind image blur assessment by using valid reblur range and histogram shape difference.",
            "Edge-preserving Intra mode for efficient depth map coding based on H.264/AVC.",
            "C-DIIVINE: No-reference image quality assessment based on local magnitude and phase statistics of natural scenes.",
            "No-reference image quality assessment using statistical characterization in the shearlet domain.",
            "Reversible data hiding using invariant pixel-value-ordering and prediction-error expansion.",
            "A novel image restoration scheme based on structured side information and its application to image watermarking.",
            "Adaptive weighted fusion with new spatial and temporal fingerprints for improved video copy detection.",
            "Video traffic analysis using scene and vehicle models.",
            "Blind image clustering based on the Normalized Cuts criterion for camera identification.",
            "Reduced reference image quality assessment using regularity of phase congruency.",
            "No-reference image quality assessment based on spatial and spectral entropies.",
            "Texture aided depth frame interpolation.",
            "Video super-resolution based on automatic key-frame selection and feature-guided variational optical flow.",
            "A new hyperchaotic map and its application in an image encryption scheme.",
            "Chaotic image encryption based on circular substitution box and key stream buffer.",
            "Cryptanalyzing a class of image encryption schemes based on Chinese remainder theorem.",
            "Evaluating feedback devices for time-continuous mobile multimedia quality assessment.",
            "Fast intra-encoding algorithm for High Efficiency Video Coding.",
            "Piecewise DC prediction in HEVC.",
            "Fast encoder decision for texture coding in 3D-HEVC.",
            "An adaptive quantization algorithm without side information for depth map coding.",
            "Frame distortion estimation for unequal error protection methods in scalable video coding (SVC).",
            "Visual tracking with randomly projected ferns.",
            "An efficient recursive edge-aware filter.",
            "Secure MQ coder: An efficient way to protect JPEG 2000 images in wireless multimedia sensor networks.",
            "Adaptive bit allocation scheme for rate control in high efficiency video coding with initial quantization parameter determination.",
            "Window-based rate control for video quality optimization with a novel INTER-dependent rate-distortion model.",
            "Fast macroblock encoding algorithm based on rate-distortion activity for multiview video coding.",
            "A gradient-based optimization approach for reduction of blocking artifacts in JPEG images.",
            "Cognitive radio assisted quality compensation for scalable video multicast in cellular networks.",
            "Cross-layer optimization for 3-D video transmission over cooperative relay systems.",
            "Hybrid error concealment method combining exemplar-based image inpainting and spatial interpolation.",
            "Sparse representation-based image quality assessment.",
            "Blind image quality assessment using a reciprocal singular value curve.",
            "Slice groups for post-compression region of interest encryption in H.264/AVC and its scalable extension.",
            "Correlation-and-bit-aware additive spread spectrum data hiding for Laplacian distributed host image signals.",
            "Robust watermarking against print and scan attack through efficient modeling algorithm.",
            "An effective SVD-based image tampering detection and self-recovery using active watermarking.",
            "Curvature preserving image super-resolution with gradient-consistency-anisotropic-regularization prior.",
            "Salient edge and region aware image retargeting.",
            "Stereo matching using cost volume watershed and region merging."
        ]
    },
    {
        "name": "SPIC",
        "year": "2013",
        "info": "Volume 28: 2013",
        "count": 114,
        "papers": [
            "Review of objective video quality metrics and performance comparison using different databases.",
            "Rate control for consistent visual quality of H.264/AVC encoding.",
            "Efficient visual attention based framework for extracting key frames from videos.",
            "A novel video salient object extraction method based on visual attention.",
            "Two-layer average-to-peak ratio based saliency detection.",
            "Watermarking-based image authentication with recovery capability using halftoning technique.",
            "Introduction to the special issue on MPEG-V.",
            "Virtual world control system using sensed information and adaptation engine.",
            "Connecting users to virtual worlds within MPEG-V standardization.",
            "Multi-modal user interaction method based on gaze tracking and gesture recognition.",
            "End-to-end framework for 4-D broadcasting based on MPEG-V standard.",
            "An end-to-end tool chain for Sensory Experience based on MPEG-V.",
            "Construction of a haptic-enabled broadcasting system based on the MPEG-V standard.",
            "Authoring multisensorial content.",
            "Avatar interoperability and control in virtual Worlds.",
            "Objective and subjective evaluation of static 3D mesh compression.",
            "Adaptive transform skipping for improved coding of motion compensated residuals.",
            "Causes and subjective evaluation of blurriness in video frames.",
            "Enhancing perceived quality of compressed images and video with anisotropic diffusion and fuzzy filtering.",
            "Video abstraction based on the visual attention model and online clustering.",
            "Up-sampling oriented frame rate reduction.",
            "Optical flow estimation in cardiac CT images using the steered Hermite transform.",
            "A novel image encryption scheme based on a linear hyperbolic chaotic system of partial differential equations.",
            "A novel chaos-based fragile watermarking for image tampering detection and self-recovery.",
            "Special issue on visual search and augmented reality.",
            "Selection of local features for visual search.",
            "Laplacian embedding and key points topology verification for large scale mobile visual identification.",
            "Rotation-invariant fast features for large-scale recognition and real-time tracking.",
            "An OpenCL-based feature matcher.",
            "Multimedia search and retrieval using multimodal annotation propagation and indexing techniques.",
            "Learning from mobile contexts to minimize the mobile location search latency.",
            "JPSearch: An answer to the lack of standardization in mobile image retrieval.",
            "Joint source and sending rate modeling in adaptive video streaming.",
            "Fast transmission distortion estimation and adaptive error protection for H.264/AVC-based embedded video conferencing systems.",
            "Error concealment via Kalman filter for heavily corrupted videos in H.264/AVC.",
            "A fine-grain distortion and complexity aware parameter tuning model for the H.264/AVC encoder.",
            "A line based pose representation for human action recognition.",
            "Iterative second-order derivative-based deinterlacing algorithm.",
            "Patch-based spatio-temporal super-resolution for video with non-rigid motion.",
            "Accurate image registration for MAP image super-resolution.",
            "Solving a two-colour problem by applying probabilistic approach to a full-colour multi-frame image super-resolution.",
            "Adaptive non-local means filter for image deblocking.",
            "A secure high capacity full-gray-scale-level multi-image information hiding and secret image authentication scheme via Tchebichef moments.",
            "Distributed video coding based on lossy syndromes generated in hybrid pixel/transform domain.",
            "Fast encoding techniques for Multiview Video Coding.",
            "Mode dependent down-sampling and interpolation scheme for high efficiency video coding.",
            "Anaglyph image generation by matching color appearance attributes.",
            "Combining color and shape descriptors for 3D model retrieval.",
            "Context-aware mobile image annotation for media search and sharing.",
            "RARE2012: A multi-scale rarity-based saliency detection with its comparative statistical analysis.",
            "Copy-move forgery detection and localization by means of robust clustering with J-Linkage.",
            "A novel image encryption-compression scheme using hyper-chaos and Chinese remainder theorem.",
            "Parameter analysis of fractal image compression and its applications in image sharpening and smoothing.",
            "Side information creation for efficient Wyner-Ziv video coding: Classifying and reviewing.",
            "Arithmetic coding for image compression with adaptive weight-context classification.",
            "Efficient early direct mode decision for multi-view video coding.",
            "Depth image enlargement using an evolutionary approach.",
            "An efficient framework for image/video inpainting.",
            "Adaptive regularization-based space-time super-resolution reconstruction.",
            "Optimized hierarchical block matching for fast and accurate image registration.",
            "Disparity-based space-variant image deblurring.",
            "Biologically inspired approaches for visual information processing and analysis.",
            "A survey of perceptual image processing methods.",
            "Perceptual video coding based on MB classification and rate-distortion optimization.",
            "Attentional mechanisms driven adaptive quantization and selective bit allocation scheme for H.264/AVC.",
            "Streaming an image through the eye: The retina seen as a dithered scalable image coder.",
            "Subjective evaluation of stereoscopic image quality.",
            "Reduced-reference image quality assessment in reorganized DCT domain.",
            "Assessing quality of experience for high definition video streaming under diverse packet loss patterns.",
            "Visual saliency's modulatory effect on just noticeable distortion profile and its application in image watermarking.",
            "A robust and secure perceptual hashing system based on a quantization step analysis.",
            "Gaze shift behavior on video as composite information foraging.",
            "Bayesian image interpolation using Markov random fields driven by visually relevant image features.",
            "Image classification based on complex wavelet structural similarity.",
            "Spatiotemporal texture synthesis and region-based motion compensation for video compression.",
            "Visual saliency guided video compression algorithm.",
            "Depth map misalignment correction and dilation for DIBR view synthesis.",
            "Multi-projector color structured-light vision.",
            "Virtual camera calibration and stereo correspondence of single-lens bi-prism stereovision system using geometrical approach.",
            "Information permeability for stereo matching.",
            "Automatic system for virtual human reconstruction with 3D mesh multi-texturing and facial enhancement.",
            "Combining texture and stereo disparity cues for real-time face detection.",
            "Joint energy-distortion aware algorithms for cooperative video streaming over LTE networks.",
            "Adaptive multiple description coding for hybrid networks with dynamic PLR and BER.",
            "Full-reference quality assessment of stereopairs accounting for rivalry.",
            "Kernel estimation from salient structure for robust motion deblurring.",
            "Improved image deblurring based on salient-region segmentation.",
            "Retinex based visual identicalness detection for videos corrupted by imaging noise.",
            "Accelerated implementation of adaptive directional lifting-based discrete wavelet transform on GPU.",
            "Special issue on MPEG CCF.",
            "Reconfigurable media coding: An overview.",
            "MPEG Reconfigurable Video Coding: From specification to a reconfigurable implementation.",
            "3D graphics coding in a reconfigurable environment.",
            "Parser description-based bitstream parser generation for MPEG RMC framework.",
            "Methods to explore design space for MPEG RMC codec specifications.",
            "Automated design of networks of transport-triggered architecture processors using dynamic dataflow programs.",
            "A PMC-driven methodology for energy estimation in RVC-CAL video codec specifications.",
            "Secure computing with the MPEG RVC framework.",
            "Cross residual transform for lossless intra-coding for HEVC.",
            "View-spatial-temporal post-refinement for view synthesis in 3D video systems.",
            "Stereo/multiview picture quality: Overview and recent advances.",
            "User assisted disparity remapping for stereo images.",
            "Rate-distortion optimized unequal loss protection for video transmission over packet erasure channels.",
            "Object removal and loss concealment using neighbor embedding methods.",
            "Motion-based object segmentation using hysteresis and bidirectional inter-frame change detection in sequences with moving camera.",
            "Fuzzy quantization based bit transform for low bit-resolution motion estimation.",
            "Superpixel based color contrast and color distribution driven salient object detection.",
            "MLSIM: A Multi-Level Similarity index for image quality assessment.",
            "Perceptually optimized blind repair of natural images.",
            "Statistical texture retrieval in noise using complex wavelets.",
            "Perceptual watermarking using a new Just-Noticeable-Difference model.",
            "A highly robust two-stage Contourlet-based digital image watermarking method.",
            "Image encryption based on the finite field cosine transform.",
            "A family of new complex number chaotic maps based image encryption algorithm."
        ]
    },
    {
        "name": "SPIC",
        "year": "2012",
        "info": "Volume 27: 2012",
        "count": 90,
        "papers": [
            "Hybrid motion estimation scheme for secondary SP-frame coding using inter-frame correlation and FMO.",
            "Cross-band noise model refinement for transform domain Wyner-Ziv video coding.",
            "A new image quality assessment method to detect and measure strength of blocking artifacts.",
            "Analysis of coding risks in progressive transmission.",
            "Learning-based image restoration for compressed images.",
            "Reliable information embedding for image/video in the presence of lossy compression.",
            "A fast online incremental learning method for object detection and pose classification using voting and combined appearance modeling.",
            "Human tracking from a mobile agent: Optical flow and Kalman filter arbitration.",
            "Human action recognition using Pose-based discriminant embedding.",
            "Resilient peer-to-peer streaming of scalable video over hierarchical multicast trees with backup parent pools.",
            "Total-variation based picture reconstruction in multiple description image and video coding.",
            "The chordlet transform with an application to shape compression.",
            "Motion compensation based on tangent distance prediction for video compression.",
            "A new fast motion estimation algorithm based on the loop-epipolar constraint for multiview video coding.",
            "Singular value decomposition based fusion for super-resolution image reconstruction.",
            "Secure transport and adaptation of MC-EZBC video utilizing H.264-based transport protocols.",
            "Machine learning to design full-reference image quality assessment algorithm.",
            "Data-parallel intra decoding for block-based image and video coding on massively parallel architectures.",
            "Global salient information maximization for saliency detection.",
            "A new image encryption scheme based on a chaotic function.",
            "Content-adaptive deblocking for high efficiency video coding.",
            "Special Issue on Modern Media Transport - Dynamic Adaptive Streaming over HTTP (DASH).",
            "An experimental evaluation of rate-adaptive video players over HTTP.",
            "Rate adaptation for dynamic adaptive streaming over HTTP in content distribution network.",
            "Using bandwidth aggregation to improve the performance of quality-adaptive streaming.",
            "Efficient HTTP-based streaming using Scalable Video Coding.",
            "Watching user generated videos with prefetching.",
            "Adaptive encoding of zoomable video streams based on user access pattern.",
            "Special issue on advances in 2D/3D Video Streaming Over P2P Networks.",
            "Peer-to-Peer multimedia sharing based on social norms.",
            "Video streaming over P2P networks: Challenges and opportunities.",
            "Multiple description coded video streaming in peer-to-peer networks.",
            "A study of an hybrid CDN-P2P system over the PlanetLab network.",
            "A Bayesian approach for user aware peer-to-peer video streaming systems.",
            "Peer-to-peer streaming in heterogeneous environments.",
            "Multi-stream 3D video distribution over peer-to-peer networks.",
            "Server-assisted adaptive video replication for P2P VoD.",
            "Redundancy controllable scalable unbalanced multiple description bitstream generation for peer-to-peer video streaming.",
            "A game theoretic approach to minimum-delay scalable video transmission over P2P.",
            "Adaptive streaming of multi-view video over P2P networks.",
            "Robust mobile video streaming in a peer-to-peer system.",
            "A game theoretic approach to video streaming over peer-to-peer networks.",
            "FTV: Free-viewpoint Television.",
            "Depth-based direct mode for multiview video coding.",
            "Perception-oriented video coding based on image analysis and completion: A review.",
            "Adaptation strategies for MGS scalable video streaming.",
            "A family of fast index and redundancy assignments for error resilient multiple description coding.",
            "Unequal channel protection of multiple description codes for wireless broadcast applications.",
            "Lossless compression of HDR color filter array image for the digital camera pipeline.",
            "Ghost detection and removal for high dynamic range images: Recent advances.",
            "Image deblocking via sparse representation.",
            "Facial feature extraction using a probabilistic approach.",
            "A new fuzzy segmentation approach based on S-FCM type 2 using LBP-GCO features.",
            "JPSearch: New international standard providing interoperable framework for image search and sharing.",
            "Scalable video transmission over multi-hop wireless networks with enhanced quality of experience using swarm intelligence.",
            "LMM-based frame-level rate control for H.264/AVC high-definition video coding.",
            "Low-complexity high-quality adaptive deblocking filter for H.264/AVC system.",
            "Directional high-pass filter for blurry image analysis.",
            "Perceptual image quality assessment based on structural similarity and visual masking.",
            "Signal processing: Image communication - Special issue on pervasive mobile multimedia.",
            "Adaptive psychometric scaling for video quality assessment.",
            "Fairness-oriented multi-stream rate adaptation using scalable video coding.",
            "H.264/SVC vs. H.264/AVC video quality comparison under QoE-driven seamless handoff.",
            "Multimedia streaming in Multi-Homed Hybrid Ad Hoc Networks: A model of network connectivity.",
            "Multi-description multipath video streaming in wireless ad hoc networks.",
            "3D wide baseline correspondences using depth-maps.",
            "Mobile multipath cooperative network for real-time streaming.",
            "Objective assessment of the WebP image coding algorithm.",
            "Image quality assessment based on edge preservation.",
            "Uniform query formalization in mobile visual search: From standards to practice.",
            "TV white spaces exploitation for multimedia signal distribution.",
            "Challenges and opportunities in immersive vehicular sensing: Lessons from urban deployments.",
            "Assessing the quality of sensory experience for multimedia presentations.",
            "Location based abstraction of user generated mobile videos.",
            "Next generation of broadcast multimedia services to mobile receivers in urban environments.",
            "Human observer confidence in image quality assessment.",
            "A hybrid system for distortion classification and image quality evaluation.",
            "Lossless video compression based on backward adaptive pixel-based fast motion estimation.",
            "Directional difference chain codes with quasi-lossless compression and run-length encoding.",
            "A generic post-deblocking filter for block based image compression algorithms.",
            "A fuzzy approach to deal with uncertainty in image forensics.",
            "A scalable and format-compliant encryption scheme for H.264/SVC bitstreams.",
            "Matrix encoding for data hiding using multilayer video coding and transcoding solutions.",
            "On the choice of Compressed Sensing priors and sparsifying transforms for MR image reconstruction: An experimental study.",
            "Streaming video over wireless channels: Exploiting reduced-reference quality estimation at the user-side.",
            "A link adaptation scheme optimized for wireless JPEG 2000 transmission over realistic MIMO systems.",
            "Reference frame modification techniques for temporal and spatial scalability.",
            "Image super-resolution by textural context constrained visual vocabulary.",
            "Image reconstruction with locally adaptive sparsity and nonlocal robust regularization.",
            "Human visual system based data embedding method using quadtree partitioning."
        ]
    },
    {
        "name": "SPIC",
        "year": "2011",
        "info": "Volume 26: 2011",
        "count": 51,
        "papers": [
            "A commutative digital image watermarking and encryption method in the tree structured Haar transform domain.",
            "Kurtosis-based no-reference quality assessment of JPEG2000 images.",
            "Evaluation of temporal variation of video quality in packet loss networks.",
            "3D model retrieval using weighted bipartite graph matching.",
            "Collaborative color calibration for multi-camera systems.",
            "Automatic, robust global motion estimation using clustering.",
            "A new distortion measure for motion estimation in motion-compensated hybrid video coding.",
            "High performance fractional motion estimation in h.264/avc based on one-step algorithm and 8×4 element block processing.",
            "A high-throughput ASIC processor for 8×8 transform coding in H.264/AVC.",
            "Congestion control in wireless links based on selective delivery of erroneous packets.",
            "Quantizer offset selection for improved requantization transcoding.",
            "Encoder adaptable difference detection for low power video compression in surveillance system.",
            "Low-complexity unbalanced multiple description coding based on balanced clusters for adaptive peer-to-peer video streaming.",
            "Adaptive Block-size Transform based Just-Noticeable Difference model for images/videos.",
            "A Bayesian network modeling approach for cross media analysis.",
            "Quantized based image watermarking in an independent domain.",
            "Rate controlled redundancy-adaptive multiple description video coding.",
            "Low delay distributed video coding with refined side information.",
            "A framework for error protection of region of interest coded images and videos.",
            "Video denoising using shape-adaptive sparse representation over similar spatio-temporal patches.",
            "A novel watermarking scheme for H.264/AVC video authentication.",
            "Robust image hash in Radon transform domain for authentication.",
            "An efficient VLSI processor chip for variable block size integer motion estimation in H.264/AVC.",
            "Intra-frame loss concealment based on directional extrapolation.",
            "Variable and constant bitrate in a DVC to H.264/AVC transcoder.",
            "Advances in IPTV technologies.",
            "Large-scale measurement experiments of P2P-TV systems insights on fairness and locality.",
            "Discrete quality assessment in IPTV content distribution networks.",
            "Low-complexity 3D-DWT video encoder applicable to IPTV.",
            "From IPTV to synchronous shared experiences challenges in design: Distributed media synchronization.",
            "Client intelligence for adaptive streaming solutions.",
            "Automated age regression for personalized IPTV services.",
            "Reducing channel change delay in IPTV by predictive pre-joining of TV channels.",
            "A practical design of digital video watermarking in H.264/AVC for content authentication.",
            "An integrated visual saliency-based watermarking approach for synchronous image authentication and copyright protection.",
            "A neighborhood elimination approach for block matching in motion estimation.",
            "A fast intra prediction mode decision using DCT and quantization for H.264/AVC.",
            "Tiny block-size coding for energy-efficient image compression and communication in wireless camera sensor networks.",
            "New pixel based approach for reverse play of MPEG video for streaming system.",
            "Detection method and filters for blocking effect reduction of highly compressed images.",
            "Joint optimization coding for level and map information in H.264/AVC.",
            "Color image demosaicking: An overview.",
            "Edge-region information measure based on deformed and displaced pixel for image quality assessment.",
            "Smooth adaptive fitting of 3D face model for the estimation of rigid and nonrigid facial motion in video sequences.",
            "How quantization based schemes can be used in image steganographic context.",
            "Sparse correlation coefficient for objective image quality assessment.",
            "Comparative visibility analysis of advertisement images.",
            "Bimodal fusion of low-level visual features and high-level semantic features for near-duplicate video clip detection.",
            "Reversible data-hiding for progressive image transmission.",
            "Data hiding based quality access control of digital images using adaptive QIM and lifting.",
            "Novel adaptive color space transform and application to image compression."
        ]
    },
    {
        "name": "SPIC",
        "year": "2010",
        "info": "Volume 25: 2010",
        "count": 64,
        "papers": [
            "Filter banks for improved LCD motion.",
            "Secure reversible visible image watermarking with authentication.",
            "Statistical modeling and many-to-many matching for view-based 3D object retrieval.",
            "A study of relative phase in complex wavelet domain: Property, statistics and applications in texture image retrieval and segmentation.",
            "Successive refinement based Wyner-Ziv video compression.",
            "Mutual information-based context quantization.",
            "Iterative joint source-channel decoding of H.264 compressed video.",
            "Early SKIP mode decision for MVC using inter-view correlation.",
            "Flexible distribution of complexity by hybrid predictive-distributed video coding.",
            "Hierarchical quantization indexing for wavelet and wavelet packet image coding.",
            "A refined motion estimation strategy for adaptive interpolation filter.",
            "An asymmetric post-processing for correspondence problem.",
            "An efficient retinex-like brightness normalization method for coding camera flashes and strong brightness variation in videos.",
            "A video error resilience redundant slices algorithm and its performance relative to other fixed redundancy schemes.",
            "The impact of tree structures on the performance of zerotree-based wavelet video codecs.",
            "Secure transcoders for single layer video data.",
            "Hardware design of motion data decoding process for H.264/AVC.",
            "Plane-based external camera calibration with accuracy measured by relative deflection angle.",
            "Requantization transcoding for H.264/AVC video coding.",
            "Variable block-based deblocking filter for H.264/AVC on low-end and low-bit rates terminals.",
            "Sub-pixel motion estimation using kernel methods.",
            "Rate-distortion optimization of scalable video codecs.",
            "A semantic framework for video genre classification and event analysis.",
            "Dynamic replacement of video coding elements.",
            "Special issue on breakthrough architectures for image and video systems.",
            "Multimedia IP architecture trends in the mobile multimedia consumer device.",
            "Architectures for multi-threaded MVC-compliant multi-view video decoding and benchmark tests.",
            "Exploiting three-dimensional (3D) memory stacking to improve image data access efficiency for motion estimation accelerators.",
            "Lossless image compression using adjustable fractional line-buffer.",
            "Algorithmic and software techniques for embedded vision on programmable processors.",
            "An attention controlled multi-core architecture for energy efficient object recognition.",
            "An efficient FPGA-based dynamic partial reconfiguration design flow and environment for image and signal processing IP cores.",
            "A bibliography on blind methods for identifying image forgery.",
            "Lossless 3D steganography based on MST and connectivity modification.",
            "Novel SCAN-CA-based image security system using SCAN and 2-D von Neumann cellular automata.",
            "Hash key-based video encryption scheme for H.264/AVC.",
            "Content-adaptive traffic prioritization of spatio-temporal scalable video for robust communications over QoS-provisioned 802.11e networks.",
            "Scalable object-based video retrieval in HD video databases.",
            "Special issue on Image and Video Quality Assessment.",
            "No-reference image and video quality estimation: Applications and human-motivated design.",
            "Perceptual-based quality assessment for audio-visual services: A survey.",
            "No-reference perceptual image quality metric using gradient profiles for JPEG2000.",
            "Content-partitioned structural similarity index for image quality assessment.",
            "Deblocking filtering method using a perceptual map.",
            "Modelling of spatio-temporal interaction for video quality assessment.",
            "Overt visual attention for free-viewing and quality assessment tasks: Impact of the regions of interest on a video quality metric.",
            "Watermarking two dimensional data object identifier for authenticated distribution of digital multimedia contents.",
            "Reliable JPEG steganalysis based on multi-directional correlations.",
            "A new perceptual quality metric for compressed video based on mean squared error.",
            "Do video coding impairments disturb the visual attention deployment?",
            "Content-based irregularly shaped macroblock partition for inter frame prediction in video coding.",
            "Lossy-to-lossless image compression based on multiplier-less reversible integer time domain lapped transform.",
            "Algorithm analysis and architecture design for rate distortion optimized mode decision in high definition AVS video encoder.",
            "Novel prediction schemes for error resilient video coding.",
            "Rate-distortion driven decoder-side bitplane mode decision for distributed video coding.",
            "Exploiting quantization and spatial correlation in virtual-noise modeling for distributed video coding.",
            "Efficient entropy coding scheme for H.264/AVC lossless video coding.",
            "An efficient macroblock-based diverse and flexible prediction modes selection for hyperspectral images coding.",
            "An improved fast mode decision algorithm for intraprediction in H.264/AVC video coding.",
            "Morphological dilation image coding with context weights prediction.",
            "Multiple description coding of animated meshes.",
            "Attention-based video streaming.",
            "Tag refinement in an image folksonomy using visual similarity and tag co-occurrence statistics.",
            "Video scene detection using graph-based representations."
        ]
    },
    {
        "name": "SPIC",
        "year": "2009",
        "info": "Volume 24: 2009",
        "count": 64,
        "papers": [
            "Special issue on advances in three-dimensional television and video: Guest editorial.",
            "Objective quality assessment in free-viewpoint video production.",
            "3DTV view generation using uncalibrated pure rotating and zooming cameras.",
            "2D/3D freeview video generation for 3DTV system.",
            "Real-time stereo-based view synthesis algorithms: A unified framework and evaluation on commodity GPUs.",
            "View generation with 3D warping using depth information for FTV.",
            "The effects of multiview depth video compression on multiview rendering.",
            "View synthesis prediction for multiview video coding.",
            "MPEG-4 Part 25: A graphics compression framework for XML-based scene graph formats.",
            "Peer-to-peer visualization of very large 3D landscape and city models using MPEG-4.",
            "Depth-image-based rendering for 3DTV service over T-DMB.",
            "On texture and image interpolation using Markov models.",
            "Vision-based production of personalized video.",
            "Frame layer rate control for H.264/AVC with hierarchical B-frames.",
            "Introducing skip mode in distributed video coding.",
            "SVC adaptation: Standard tools and supporting methods.",
            "Flexible forward error correction codes with application to partial media data recovery.",
            "Special issue on AVS and its applications: Guest editorial.",
            "Overview of AVS-video coding standards.",
            "Context-based entropy coding in AVS video coding standard.",
            "Combined adaptive-fixed interpolation with multi-directional filters.",
            "Reconfigurable video coding framework and decoder reconfiguration instantiation of AVS.",
            "AVS trick modes for PVR and VOD services.",
            "Platform-independent MB-based AVS video standard implementation.",
            "An efficient VLSI architecture for CBAC of AVS HDTV decoder.",
            "Robust dual watermarking algorithm for AVS video.",
            "New rate-distortion modeling and efficient rate control for H.264/AVC video coding.",
            "A two-pass rate control algorithm for H.264/AVC high definition video coding.",
            "A low-complexity rate allocation algorithm for joint source-channel video coding.",
            "Low memory implementation of generic hierarchical transforms for parent-children tree (PCT) production and its application in image compression.",
            "On performance of lossless compression for HDR image quantized in color space.",
            "Selective VS-MRF-ME and intra coding in H.264 based on spatiotemporal continuity of motion field.",
            "Special issue on scalable coded media beyond compression.",
            "Designing autonomous layered video coders.",
            "Error-resilient scalable compression based on distributed video coding.",
            "Improved BSDL-based content adaptation for JPEG 2000 and HD Photo (JPEG XR).",
            "Adaptation-aware encryption of scalable H.264/AVC video for content security.",
            "Compressed domain indexing of scalable H.264/SVC streams.",
            "An integrated approach to summarization and adaptation using H.264/MPEG-4 SVC.",
            "An efficient optimisation scheme for scalable surveillance centric video communications.",
            "Reduced-reference metric design for objective perceptual quality assessment in wireless imaging.",
            "Perceivable artifacts in compressed video and their relation to video quality.",
            "Spatiotemporal saliency for video classification.",
            "Farthest point distance: A new shape signature for Fourier descriptors.",
            "Fragile watermarking using finite field trigonometrical transforms.",
            "Semantic video fingerprinting and retrieval using face information.",
            "On the use of hierarchical prediction structures for efficient summary generation of H.264/AVC bitstreams.",
            "Fast motion estimation for H.264.",
            "Video transcoding from H.264/AVC to MPEG-2 with reduced computational complexity.",
            "Models and analysis of streaming video transmission over wireless fading channels.",
            "Joint video/depth rate allocation for 3D video coding based on view synthesis distortion model.",
            "A VLSI-oriented algorithm and its implementation for AVS chroma interpolation.",
            "SVC-based scalable multiple description video coding and optimization of encoding configuration.",
            "Motion-compensated DCT temporal filters for efficient spatio-temporal scalable video coding.",
            "Adaptive two-stage FEC scheme for scalable video transmission over wireless networks.",
            "Lagrange multiplier selection in wavelet-based scalable video coding for quality scalability.",
            "Efficient in-network adaptation of encrypted H.264/SVC content.",
            "Semi-automatic knowledge extraction, representation and context-sensitive intelligent retrieval of video content using collateral context modelling with scalable ontological networks.",
            "An efficient high-dimensional indexing method for content-based retrieval in large image databases.",
            "All phase biorthogonal transform and its application in JPEG-like image compression.",
            "Fast mode-decision for H.264/AVC based on inter-frame correlations.",
            "Object tracking in surveillance videos using compressed domain features from scalable bit-streams.",
            "A secure media streaming mechanism combining encryption, authentication, and transcoding.",
            "Efficient coding of motion vector and mode information for H.264/AVC."
        ]
    },
    {
        "name": "SPIC",
        "year": "2008",
        "info": "Volume 23: 2008",
        "count": 59,
        "papers": [
            "Transform domain texture synthesis.",
            "Cooperation of the partial differential equation methods and the wavelet transform for the segmentation of multivalued images.",
            "B-picture coding in AVS video compression standard.",
            "Directional lifting-based wavelet transform for multiple description image coding.",
            "Layered image resizing in compression domain.",
            "Efficient mode selection for H.264 complexity reduction in a Bayesian framework.",
            "Compact representation of contours using directional grid chain code.",
            "An integrated rate control scheme for TCP-friendly MPEG-4 video transmission.",
            "GOP-level transmission distortion modeling for mobile streaming video.",
            "Region-of-interest video coding based on rate and distortion variations for H.263+.",
            "A fast and low memory image coding algorithm based on lifting wavelet transform and modified SPIHT.",
            "Contourlet-based image adaptive watermarking.",
            "AACS-compatible multimedia joint encryption and fingerprinting: Security issues and some solutions.",
            "Facial feature extraction by a cascade of model-based algorithms.",
            "A general quantitative cryptanalysis of permutation-only multimedia ciphers against plaintext attacks.",
            "Optimal video stream multiplexing through linear programming.",
            "Objective quality assessment of color images based on a generic perceptual reduced reference.",
            "No reference image quality assessment for JPEG2000 based on spatial features.",
            "Evaluating a feedback channel based transform domain Wyner-Ziv video codec.",
            "Error detection and concealment for video transmission using information hiding.",
            "Lossless image compression via predictive coding of discrete Radon projections.",
            "Enhanced MIMO wireless video communication using multiple-description coding.",
            "Special issue on distributed video coding.",
            "Distributed Video Coding: Selecting the most promising application scenarios.",
            "Backward channel aware Wyner-Ziv video coding: A study of complexity, rate, and distortion tradeoff.",
            "Wyner-Ziv coding of video with unsupervised motion vector learning.",
            "Symmetric distributed coding of stereo omnidirectional images.",
            "Rate allocation for robust video streaming based on distributed video coding.",
            "Stereoscopic video coding and disparity estimation for low bitrate applications based on MPEG-4 multiple auxiliary components.",
            "No-reference noticeable blockiness estimation in images.",
            "Wavelet iterative regularization for image restoration with varying scale parameter.",
            "3D binary morphological operations using run-length representation.",
            "Adaptive partition size temporal error concealment for H.264 using weighted double-sided EBME minimization.",
            "Simultaneous coding artifact reduction and sharpness enhancement for block-based compressed images and videos.",
            "Introduction to the special issue on semantic analysis for interactive multimedia services.",
            "A compressed-domain approach for shot boundary detection on H.264/AVC bit streams.",
            "A relevance feedback CBIR algorithm based on fuzzy sets.",
            "The visual keyboard: Real-time feet tracking for the control of musical meta-instruments.",
            "Spatially consistent partial matching for intra- and inter-image prototype selection.",
            "A non-supervised approach for repeated sequence detection in TV broadcast streams.",
            "Integrating multi-modal content analysis and hyperbolic visualization for large-scale news video retrieval and exploration.",
            "Interpretation of complex situations in a semantic-based surveillance framework.",
            "Fast sum of absolute transformed difference based 4×4 intra-mode decision of H.264/AVC video coding standard.",
            "Automatic creation and evaluation of MPEG-7 compliant summary descriptions for generic audiovisual content.",
            "Spatio-chromatic decorrelation for color image compression.",
            "Error resiliency transcoding and decoding solutions using distributed video coding techniques.",
            "A GPU favor representation method for plenoptic-illumination function based on an efficient spherical partition scheme.",
            "M-LTW: A fast and efficient intra video codec.",
            "Rate control algorithm based on quality factor optimization for Dirac video codec.",
            "Stereoscopic 3D from 2D video with super-resolution capability.",
            "H.264/AVC-based multiple description video coding using dynamic slice groups.",
            "An efficient architecture of bitplane coding with high frame rate for VC-1.",
            "An efficient intra-mode selection algorithm for H.264 based on edge classification and rate-distortion estimation.",
            "An efficient spatial domain technique for subpixel image registration.",
            "New pixel-decimation patterns for block matching in motion estimation.",
            "Hierarchical group process representation in multi-agent activity recognition.",
            "Distributed media rate allocation in multipath networks.",
            "Learning articulated appearance models for tracking humans: A spectral graph matching approach.",
            "Dim target detection and tracking based on empirical mode decomposition."
        ]
    },
    {
        "name": "SPIC",
        "year": "2007",
        "info": "Volume 22: 2007",
        "count": 64,
        "papers": [
            "On color transforms and bit allocation for optimal subband image compression.",
            "Recent advances in rate control for video coding.",
            "Rate control based on linear regression for H.264/MPEG-4 AVC.",
            "Structure unanimity multiple description coding.",
            "Accurate packet-by-packet measurement and analysis of video streams across an Internet tight link.",
            "Combined image compression and denoising using wavelets.",
            "Special issue on three-dimensional video and television.",
            "Towards 3-D scene reconstruction from broadcast video.",
            "Graph-cut-based stereo matching using image segmentation with symmetrical treatment of occlusions.",
            "3D scanning-based compression technique for digital hologram video.",
            "End-to-end stereoscopic video streaming with content-adaptive rate and format control.",
            "Signal processing issues in diffraction and holographic 3DTV.",
            "Diffraction field computation from arbitrarily distributed data points in space.",
            "Real-time view synthesis from a sparse set of views.",
            "Point-sampled 3D video of real-world scenes.",
            "Depth map creation and image-based rendering for advanced 3DTV services providing interoperability and scalability.",
            "Guest Editorial.",
            "Real-time multimedia processing in video sensor networks.",
            "Multiple description video coding using coefficients ordering and interpolation.",
            "Perceptually adaptive joint deringing-deblocking filtering for scalable video transmission over wireless networks.",
            "Adaptive error-resilience transcoding using prioritized intra-refresh for video multicast over wireless networks.",
            "Bit-stream allocation methods for scalable video coding supporting wireless communications.",
            "Cross-layer architecture for scalable video transmission in wireless network.",
            "A power-based unequal error protection system for digital cinema broadcasting over wireless channels.",
            "Unequal error protection and progressive decoding for JPEG2000.",
            "Analysis of blind data hiding using discrete cosine transform phase modulation.",
            "Scalable secret image sharing.",
            "Real-time and rate-distortion optimized video streaming with TCP.",
            "Drift controlled scalable wavelet based video coding in the overcomplete discrete wavelet transform domain.",
            "Error-resilient video streaming over wireless networks using combined scalable coding and multiple-description coding.",
            "An efficient complexity-scalable video transcoder with mode refinement.",
            "Modeling the distribution of DCT coefficients for JPEG reconstruction.",
            "Fast multiresolution motion estimation algorithms for wavelet-based scalable video coding.",
            "Noise-proofing the doubly SH-projected coefficients for synthesizing images under environment lighting.",
            "The discrete modal transform and its application to lossy image compression.",
            "Design of frame dependency for VCR streaming videos.",
            "A new semi-fragile image watermarking with robust tampering restoration using irregular sampling.",
            "Rate-distortion based real-time wireless video streaming.",
            "A robust joint source channel coding scheme for image transmission over the ionospheric channel.",
            "Evaluating the performance in automatic image annotation: Example case by adaptive fusion of global image features.",
            "Semantic-associative visual content labelling and retrieval: A multimodal approach.",
            "Modeling human-like intelligent image processing: An information processing perspective and approach.",
            "Adaptive salient block-based image retrieval in multi-feature space.",
            "Signal processing: Image communication, special issue on content-based multimedia indexing and retrieval.",
            "Object based video retrieval with local region tracking.",
            "A heuristic for the retrieval of objects in video in the framework of the rough indexing paradigm.",
            "Inexpensive fusion methods for enhancing feature detection.",
            "Content-driven adaptation of on-line video.",
            "Logotype detection to support semantic-based video annotation.",
            "Analysis and performance evaluation of optical flow features for dynamic texture recognition.",
            "Evaluation of active learning strategies for video indexing.",
            "The ARGOS campaign: Evaluation of video analysis and indexing tools.",
            "Correlation-based approach to color image compression.",
            "H.264 error resilience coding based on multi-hypothesis motion-compensated prediction.",
            "Text detection, localization, and tracking in compressed video.",
            "Inferring facial expressions from videos: Tool and application.",
            "Histogram mining based on Markov chain and its application to image categorization.",
            "CNN-type algorithms for H.264 variable block-size partitioning.",
            "Adaptive bitstream switching of scalable video.",
            "Robust defocus blur identification in the context of blind image quality assessment.",
            "Super-resolution mosaicing from MPEG compressed video.",
            "Bayesian object extraction from uncalibrated image pairs.",
            "Small-diamond-based search algorithm for fast block motion estimation.",
            "Video object segmentation and tracking using region-based statistics."
        ]
    },
    {
        "name": "SPIC",
        "year": "2006",
        "info": "Volume 21: 2006",
        "count": 63,
        "papers": [
            "Partial linear regression for speech-driven talking head application.",
            "A requantization algorithm for the transcoding of JPEG images.",
            "Joint moving cast shadows segmentation and light source detection in video sequences.",
            "On re-composition of motion compensated macroblocks for DCT-based video transcoding.",
            "An asymmetric image watermarking scheme resistant against geometrical distortions.",
            "MPEG-4 constant-quality constant-bit-rate control algorithms.",
            "Error concealment for SNR scalable video coding.",
            "Marker-based image segmentation relying on disjoint set union.",
            "An approach of dynamically forming an acceptable transcoding path by a search algorithm based on a context-free grammar in a MPEG21 DIA.",
            "Spatial error concealment with edge related perceptual considerations.",
            "Embedded wavelet packet object-based image coding based on context classification and quadtree ordering.",
            "Combining visual MPEG tools in the context of video adaptability.",
            "Network traffic demand patterns for video over relative differentiated services networks.",
            "An improved, wavelet-based, stereoscopic image sequence codec with SNR and spatial scalability.",
            "Multimedia adaptation in end-user terminals.",
            "Adaptive available bandwidth estimation for internet video streaming.",
            "Region tracking for non-rigid video objects in a non-parametric MAP framework.",
            "Edge-preserving joint motion-disparity estimation in stereo image sequences.",
            "Distortion variation minimization in real-time video coding.",
            "A simulated annealing restoration algorithm for restoring halftoned color-quantized images.",
            "Hybrid multiple description video coding using optimal DCT coefficient splitting and SD/MD switching.",
            "A variable block size motion estimation algorithm for real-time H.264 video encoding.",
            "A multi-factors approach for image quality assessment based on a human visual system model.",
            "Evaluation of relevance feedback schemes in content-based in retrieval systems.",
            "Gaze tracking for region of interest coding in JPEG 2000.",
            "On the use of independent component analysis for image compression.",
            "Combined turbo coding and hierarchical QAM for unequal error protection of H.264 coded video.",
            "On-demand transmission of 3D models over lossy networks.",
            "Harmonic postprocessing to conceal for transmission errors in DWT transmitted images.",
            "Modelling and combining emotions, visual speech and gestures in virtual head models.",
            "Special issue on multi-view image processing and its application in image-based rendering.",
            "Overview of free viewpoint television.",
            "Rate-distortion analysis for light field coding and streaming.",
            "Multi-view synthesis: A novel view creation approach for free viewpoint video.",
            "Geometry-assisted image-based rendering for facial analysis and synthesis.",
            "3D modeling and rendering from multiple wide-baseline images by match propagation.",
            "Layered light-field rendering with focus measurement.",
            "A perceptually optimised video coding system for sign language communication at low bit rates.",
            "A new method for the characterization of telecine effect in video sequences.",
            "Image coding based on wavelet transform and uniform scalar dead zone quantizer.",
            "Hierarchical ownership and deterministic watermarking of digital images via polynomial interpolation.",
            "Motion estimation and compensation in the redundant-wavelet domain using triangle meshes.",
            "An efficient architecture of deblocking filter with high frame rate for H.264/AVC.",
            "Two-stage multiple description image coders: Analysis and comparative study.",
            "A fast block-matching algorithm based on adaptive search area and its VLSI architecture for H.264/AVC.",
            "Bi-directional error-resilient entropy coding (BEREC).",
            "Cyclostationary error analysis and filter properties in a 3D wavelet coding framework.",
            "A clustering-based color model and integral images for fast object tracking.",
            "Adaptive image replica detection based on support vector classifiers.",
            "Interactive representation of still and dynamic scenes.",
            "On-line, interactive view synthesis and augmentation.",
            "Inverse tensor transfer with applications to novel view synthesis and multi-baseline stereo.",
            "Mosaic-based 3D scene representation and rendering.",
            "Image warping for compressing and spatially organizing a dense collection of images.",
            "Compression of textured surfaces represented as surfel sets.",
            "A novel framework for the interactive transmission of 3D scenes.",
            "Rate-distortion-optimized predictive compression of dynamic 3D mesh sequences.",
            "A sequence-based error-concealment algorithm for an unbalanced multiple description video coding system.",
            "Low-complexity compression of multispectral images based on classified transform coding.",
            "BFlavor: A harmonized approach to media resource adaptation, inspired by MPEG-21 BSDL and XFlavor.",
            "Joint near-lossless compression and watermarking of still images for authentication and tamper localization.",
            "Multi-object image retrieval based on shape and topology.",
            "GPU-friendly rendering for illumination adjustable images."
        ]
    },
    {
        "name": "SPIC",
        "year": "2005",
        "info": "Volume 20: 2005",
        "count": 58,
        "papers": [
            "Unconstrained motion compensated temporal filtering (UMCTF) for efficient and flexible interframe wavelet video coding.",
            "Delay-constrained transmission of fine scalable coded content over P2P networks.",
            "Multi-path selection for multiple description video streaming over overlay networks.",
            "3D reconstruction from stereo images for interactions between real and virtual objects.",
            "Multivariate statistical modeling for image denoising using wavelet transforms.",
            "LBGS: a smart approach for very large data sets vector quantization.",
            "Color image denoising with wavelet thresholding based on human visual system model.",
            "Towards robust image watermarking: combining content-dependent key, moment normalization, and side-informed embedding.",
            "Temporal stabilization of Video Object Segmentation for 3D-TV applications.",
            "An adaptive edge model in the wavelet domain for wavelet image coding.",
            "On decoding MPEG-4 reversible variable length codes.",
            "Geometrically determining the leaky bucket parameters for video streaming over constant bit-rate channels.",
            "A scalable VideoGIS system for GPS-guided vehicles.",
            "A dynamic classifier selection and combination approach to image region labelling.",
            "Object detection using multi-resolution mosaic in image sequences.",
            "Moving object detection in wavelet compressed video.",
            "Joint Motion and Disparity Fields Estimation for Stereoscopic Video Sequences.",
            "A real-time video transport system for the best-effort Internet.",
            "An efficient face segmentation algorithm based on binary partition tree.",
            "Motion and texture rate-allocation for prediction-based scalable motion-vector coding.",
            "Constant quality video coding using video content analysis.",
            "Joint source-channel coding and power adaptation for energy efficient wireless video communications.",
            "Syntax friendly and syntax amendment approaches to error resiliency in the MPEG-4 Simple Scalable Profile.",
            "Effective adaptation of multimedia documents with modality conversion.",
            "Low-complexity GMM-based block quantisation of images using the discrete cosine transform.",
            "Low complexity multiple description coding method for networked video.",
            "Lloyd clustering of Gauss mixture models for image compression and classification.",
            "Compressing the background layer in compound images, using JPEG and data filling.",
            "Motion analysis in 3D DCT domain and its application to video coding.",
            "Spatial and spectral analysis of occluded motions.",
            "Accurate optical flow in noisy image sequences using flow adapted anisotropic diffusion.",
            "Bias minimizing filter design for gradient-based image registration.",
            "Implications of invariance and uncertainty for local structure analysis filter sets.",
            "Estimation of orientation tensors for simple signals by means of second-order filters.",
            "Fast variable-size block motion estimation for efficient H.264/AVC encoding.",
            "Real-time frame-dependent video watermarking in VLC domain.",
            "Objective quality assessment of displayed images by using neural networks.",
            "Just noticeable distortion model and its applications in video coding.",
            "A multi-resolution, geometry-driven error concealment method for corrupted JPEG color images.",
            "Special issue on video networking.",
            "Optimal erasure protection for scalably compressed video streams with limited retransmission on channels with IID and bursty loss characteristics.",
            "Overlay multi-hop FEC scheme for video streaming.",
            "Network-embedded FEC for optimum throughput of multicast packet video.",
            "Peer-to-peer multipoint videoconferencing on the Internet.",
            "Proxy-assisted interactive-video services over networks with large delays.",
            "Congestion-distortion optimized video transmission over ad hoc networks.",
            "Special issue on European projects on visual representation systems and services.",
            "European strategies, approaches, and projects for new media.",
            "Advanced modeling of visual information processing: A multi-resolution directional-oriented image transform based on Gaussian derivatives.",
            "Gradient-driven update lifting for adaptive wavelets.",
            "A complete system for on-line 3D modelling from acoustic images.",
            "Edge registration versus triangular mesh registration, a comparative study.",
            "3D visual reconstruction of large scale natural sites and their fauna.",
            "Combining image and model based rendering of an archaeological site.",
            "A wireless multimedia framework for the management of emergency situations in automotive applications: The AIDER system.",
            "intGuide: A platform for context-aware services featuring augmented-reality, based on the outcome of European Research Projects.",
            "TIRAMISU: A novel approach to content representation and key management for seamless super-distribution of protected media.",
            "From OPIMA to MPEG IPMP-X: A standard's history across R&D projects."
        ]
    },
    {
        "name": "SPIC",
        "year": "2004",
        "info": "Volume 19: 2004",
        "count": 66,
        "papers": [
            "A survey on image-based rendering - representation, sampling and compression.",
            "Performance improvement of the SPIHT coder.",
            "A wavelet implementation of the pioneering block-based disparity compensated predictive coding algorithm for stereo image pair compression.",
            "On the methods and performances of rational downsizing video transcoding.",
            "Unequal error protection for MPEG-2 video transmission over wireless channels.",
            "Mosaics of video sequences with moving objects.",
            "Special issue on objective video quality metrics.",
            "Accuracy and cross-calibration of video quality metrics: new methods from ATIS/T1A1.",
            "Evaluation of objective quality measures for noise reduction in TV-systems.",
            "Video quality assessment based on structural distortion measurement.",
            "A metric for continuous quality evaluation of compressed video with severe distortions.",
            "A new sharpness metric based on local kurtosis, edge and energy information.",
            "Perceptual blur and ringing metrics: application to JPEG2000.",
            "No reference PSNR estimation for compressed pictures.",
            "Defect visibility and content importance: effects on perceived impairment.",
            "A localization/verification scheme for finding text in images and video frames based on contrast independent features and machine learning methods.",
            "A snake model for object tracking in natural sequences.",
            "A multiview sequence CODEC with view scalability.",
            "Downsampling dependent upsampling of images.",
            "An efficient and scalable low bit-rate video coding with virtual SPIHT.",
            "A progressive secret reveal system based on SPIHT image transmission.",
            "Fast motion vector re-estimation for transcoding MPEG-1 into MPEG-4 with lower spatial resolution in DCT-domain.",
            "A novel approach to achieve unequal error protection for video transmission over 3G wireless networks.",
            "A robust image fingerprinting system using the Radon transform.",
            "Rate control using linear rate-ρ model for H.264.",
            "An improved motion-compensated restoration method for damaged color motion picture films.",
            "A highly efficient, low delay architecture for transporting H.264 video over wireless channel.",
            "Superresolution with second generation wavelets.",
            "A fast no search fractal image coding method.",
            "TCP-friendly flow control of wireless multimedia using ECN marking.",
            "Automatic scalable face model design for 2D model-based video coding.",
            "Using MPEG standards for multimedia customization.",
            "Computation reduction for standard-based video encoders based on the energy preservation property of DCT.",
            "Optimum word length allocation of integer DCT and its error analysis.",
            "Rate adaptive video streaming under lossy network conditions.",
            "A locally adaptive algorithm for measuring blocking artifacts in images and videos.",
            "Determination of image bimodality thresholds for different intensity distributions.",
            "FACE: fast active-contour curvature-based evolution.",
            "Efficient disparity vector coding for multiview sequences.",
            "Special issue on subband/wavelet interframe video coding.",
            "Video coding with motion-compensated lifted wavelet transforms.",
            "Motion compensation and scalability in lifting-based video coding.",
            "Advanced motion threading for 3D wavelet video coding.",
            "Enhanced interframe wavelet video coding considering the interrelation of spatio-temporal transform and motion compensation.",
            "Scalable video compression via overcomplete motion compensated wavelet coding.",
            "In-band motion compensated temporal filtering.",
            "Motion information scalability for MC-EZBC.",
            "Automatic video summarization based on MPEG-7 descriptions.",
            "Temporal filtering for restoration of wavelet-compressed motion imagery.",
            "Facial expression recognition and synthesis based on an appearance model.",
            "A compression method for a massive image data set in image-based rendering.",
            "Motion parameters estimation by new propagation approach and time-frequency representations.",
            "Mosaicking images with parallax.",
            "Editorial.",
            "Video coding using the H.264/MPEG-4 AVC compression standard.",
            "Windows Media Video 9: overview and applications.",
            "Interframe wavelet coding - motion picture representation for universal scalability.",
            "Next generation DVD: application requirements and technology.",
            "Economic and other considerations for Digital Cinema.",
            "Data compression on the illumination adjustable images by PCA and ICA.",
            "A linear edge model and its application in lossless image coding.",
            "A probabilistic approach to incorporating domain knowledge for closed-room people monitoring.",
            "A simple and efficient block motion estimation algorithm based on full-search array architecture.",
            "Detail preserving impulsive noise removal.",
            "Importance prioritisation in JPEG 2000 for improved interpretability.",
            "Application of the CIECAM02 colour appearance model to predict the effect of gamma on the colours viewed on CRT monitors."
        ]
    },
    {
        "name": "SPIC",
        "year": "2003",
        "info": "Volume 18: 2003",
        "count": 65,
        "papers": [
            "Iterative key frame selection in the rate-constraint environment.",
            "An efficient 3D mesh compression technique based on triangle fan structure.",
            "Fast motion estimation of arbitrarily shaped video objects in MPEG-4.",
            "Semi-automatic object-based video segmentation with labeling of color segments.",
            "A modular approach to facial feature segmentation on real sequences.",
            "Postprocessing of decoded color images by adaptive linear filtering.",
            "A robust scheme for live detection of human faces in color images.",
            "Eye-movement-controlled transform image coders.",
            "Enhancement of coded video sequences via an adaptive nonlinear post-processing.",
            "A shape-based image retrieval method using salient edges.",
            "Unequal loss protection for robust transmission of motion compensated video over the internet.",
            "Content-based image copy detection.",
            "Rigid and non-rigid 3D motion estimation from multiview image sequences.",
            "High accuracy flashlight scene determination for shot boundary detection.",
            "Frame interpolation scheme using inertia motion prediction.",
            "Special Issue on Image security: secure imaging - is it necessary?",
            "Security of digital entertainment content from creation to consumption.",
            "A guide tour of video watermarking.",
            "Practical watermarking scheme based on wide spread spectrum and game theory.",
            "Optimal decoding for watermarks subject to geometrical attacks.",
            "Application of spectral decomposition to compression and watermarking of 3D triangle mesh geometry.",
            "Bi-directional 2-D mesh representation for video object rendering, editing and superresolution in the presence of occlusion.",
            "Layered coded vs. multiple description coded video over error-prone networks.",
            "Variation of JPEG-LS to low cost rate control and its application in region-of-interest based coding.",
            "Image alignment based on invariant features for palmprint identification.",
            "Motion compensation using backward prediction and prediction refinement.",
            "Fast view interpolation of stereo images using image gradient and disparity triangulation.",
            "Modeling of deformation using NURBS curves as controller.",
            "A novel rate predictor based on quantized DCT indices and its rate control mechanism.",
            "Gray-level-embedded lossless image compression.",
            "A post-processor for reducing temporal busyness in low-bit-rate video applications.",
            "Panoramic view construction.",
            "Analysis of a hybrid fractal-predictive-coding compression scheme.",
            "JPEG2000 over noisy communication channels thorough evaluation and cost analysis.",
            "Neighbors-buffering-based video-on-demand architecture.",
            "Efficient multiplier structure for realization of the discrete cosine transform.",
            "Optimal FEC assignment for scalable video transmission over burst error channel with loss rate feedback.",
            "Wavelet domain residual redundancy-based descriptions.",
            "Group testing for image compression using alternative transforms.",
            "Performance analysis and modeling of errors and losses over 802.11b LANs for high-bit-rate real-time multimedia.",
            "Special issue on multimedia adaptation.",
            "Hybrid DCT/pixel domain architecture for heterogeneous video transcoding.",
            "Efficient transform-domain size and resolution reduction of images.",
            "A rate adaptation transcoding scheme for real-time video transmission over wireless channels.",
            "Fast transcoding architectures for insertion of non-regular shaped objects in the compressed DCT-domain.",
            "The adaptation of 3D stereoscopic video in MPEG-21 DIA.",
            "Mobility characteristics for multimedia service adaptation.",
            "Bitstream syntax description: a tool for multimedia resource adaptation within MPEG-21.",
            "Metadata driven adaptation in the ADMITS project.",
            "Significance map pruning and other enhancements to SPIHT image coding algorithm.",
            "Relevance feedback in content-based image retrieval system by selective region growing in the feature space.",
            "Macroblock classification for complexity management of video encoders.",
            "Using set partitioning in hierarchical trees to authenticate digital images.",
            "Application of nonlinear pre- and post-processing in low bit rate, error resilient image communication.",
            "Rate control for MPEG-2 SNR scalability and stream morphing using codeword estimation and overhead modelling.",
            "Guest Editorial.",
            "Comparison of video protection methods for wireless networks.",
            "Improved rate control for MPEG-4 video transport over wireless channel.",
            "Error concealment aware rate shaping for wireless video transport.",
            "Spatiotemporal error concealment with optimized mode selection and application to H.264.",
            "Multiple description image and video coding for wireless channels.",
            "Clustering source output bits and equalizing bit error sensitivity to improve the quality and robustness of transmitted images over wireless channels.",
            "An integrated application of multiple description transform coding and error concealment for error-resilient video streaming.",
            "A combined multiple-candidate likelihood decoding and error concealment scheme for compressed video transmission over noisy channels.",
            "Robust adaptive transmission of images and video over multiple channels."
        ]
    },
    {
        "name": "SPIC",
        "year": "2002",
        "info": "Volume 17: 2002",
        "count": 58,
        "papers": [
            "JPEG 2000.",
            "An overview of the JPEG 2000 still image compression standard.",
            "Embedded block coding in JPEG 2000.",
            "An overview of quantization in JPEG 2000.",
            "An overview of the visual optimization tools in JPEG 2000.",
            "Region of interest coding in JPEG 2000.",
            "JPEG 2000 performance evaluation and assessment.",
            "File format technology in JPEG 2000 enables flexible use of still and motion sequences.",
            "An automatic algorithm for semantic object generation and temporal tracking.",
            "A real-time algorithm for error recovery in remote video-based surveillance applications.",
            "Rate-distortion model based rate control for real-time VBR video coding and low-delay communications.",
            "Inverse pyramidal decomposition with multiple DCT.",
            "Transform domain LMS-based adaptive prediction for lossless image coding.",
            "Adaptive 3D-DCT compression algorithm for continuous parallax 3D integral imaging.",
            "Facial feature extraction for quick 3D face modeling.",
            "SOAR: System of associative relations.",
            "Design of an improved lossless halftone image compression codec.",
            "Object-based encoding for multi-view sequences of 3D object.",
            "Efficient methodology for hand-coding video algorithms for VLIW-type processors.",
            "Unequally protected SPIHT video codec for low bit rate transmission over highly error-prone mobile channels.",
            "Improved watermark detection based on similarity diagrams.",
            "Hybrid fractal zerotree wavelet image coding.",
            "Special issue on multimedia adaptation.",
            "Adaptive prediction for lossless image compression.",
            "Facial model adaptation from a monocular image sequence using a textured polygonal model.",
            "Least-squares spline resampling to a hexagonal lattice.",
            "Block error-correcting codes for systems with a very high BER: Theoretical analysis and application to the protection of watermarks.",
            "A novel hybrid HVPC/mathematical model rate control for low bit-rate streaming video.",
            "Strip based coding for large images using wavelets.",
            "Modeling and animation of human expressions using NURBS curves based on facial anatomy.",
            "A multiresolutional coding method based on SPIHT.",
            "A new subsampling-based predictive vector quantization for image coding.",
            "Modeling and validation of a psychovisually based image quality evaluator for DCT-based compression.",
            "Content-based video transcoding in compressed domain.",
            "Adaptive and global optimization methods for weighted vector median filters.",
            "Adaptive post-filtering for reducing blocking and ringing artifacts in low bit-rate video coding.",
            "A new rate control scheme for H.263 video transmission.",
            "An interactive authoring system for video object segmentation and annotation.",
            "Data partitioning and coding of DCT coefficients based on requantization for error-resilient transmission of video.",
            "Coarse scale cost-utility approach for efficient unequal loss protection.",
            "Error-resilient video coding using long-term memory prediction and feedback channel.",
            "Analysis of pilot-based synchronization algorithms for watermarking of still images.",
            "An efficient motion compensation algorithm based on double reference frame method.",
            "Special Issue on Recent Advances in Wireless Video SIGNAL PROCESSING: IMAGE COMMUNICATION.",
            "Image processing for 3D imaging.",
            "A solution for facial expression representation and recognition.",
            "Facial animation parameters extraction and expression recognition using Hidden Markov Models.",
            "Improved POCS reconstruction of stereoscopic views.",
            "3D analysis and image-based rendering for immersive TV applications.",
            "Insights into low-level avatar animation and MPEG-4 standardization.",
            "Real-time MPEG-4 facial animation with 3D scalable meshes.",
            "Adaptive rate control algorithms for low bit rate video under networks supporting bandwidth renegotiation.",
            "PVQM - A perceptual video quality measure.",
            "Optimal resynchronization marker positioning method using a novel information measure.",
            "Performance comparison of masking models based on a new psychovisual test method with natural scenery stimuli.",
            "Shape-based image retrieval using generic Fourier descriptor.",
            "A novel adaptive approach to fingerprint enhancement filter design.",
            "Adaptive rate control algorithm based on logarithmic R-Q model for MPEG-1 to MPEG-4 transcoding."
        ]
    },
    {
        "name": "SPIC",
        "year": "2000",
        "info": "Volume 16: 2000/2001",
        "count": 67,
        "papers": [
            "Editorial.",
            "MPEG-7: A standardised description of audiovisual content.",
            "On describing color and shape information in images.",
            "A texture descriptor for browsing and similarity retrieval.",
            "Image retrieval using spatial intensity features.",
            "Motion descriptors for content-based video representation.",
            "Region-based shape descriptor invariant to rotation, scale and translation.",
            "A region-based shape descriptor using Zernike moments.",
            "Description of shape information for 2-D and 3-D objects.",
            "A reliable descriptor for face objects in visual content.",
            "MPEG-7 Videotext description scheme for superimposed text in images and video.",
            "A set of visual feature descriptors and their combination in a low-level description scheme.",
            "Low-level musical descriptors for MPEG-7.",
            "Representation and linking mechanisms for audio in MPEG-7.",
            "Description schemes for video programs, users and devices.",
            "Object-based multimedia content description schemes and applications for MPEG-7.",
            "An overview of the MPEG-7 Description Definition Language (DDL) proposals.",
            "Motion compensation method for moving pictures with binary shape.",
            "Telepresence teaching visual equipment.",
            "A calibration method for continuous video quality (SSCQE) measurements.",
            "Statistical model-based video segmentation and its application to very low bit-rate video coding.",
            "A tunable algorithm to update a reference image.",
            "A new lossless compression scheme based on Huffman coding scheme for image compression.",
            "Motion estimation in the presence of illumination variations.",
            "Lossless acceleration of fractal image encoding via the fast Fourier transform.",
            "Two-channel spatial interpolation of images.",
            "Low computational complexity enhanced zerotree coding for wavelet-based image compression.",
            "Constant modulus algorithm for blind equalization of multipath transmitted video signals in cable networks.",
            "Tree-structured product-codebook vector quantization.",
            "A distributed adaptive block matching algorithm: Dis-ABMA.",
            "Optimisation of multi-level block truncation coding.",
            "Authentication of digital images and video: Generic models and a new contribution.",
            "Temporal video segmentation: A survey.",
            "Designing JPEG quantization tables based on human visual system.",
            "A genetic algorithm approach to image sequence interpolation.",
            "Parsimonious texture representation employing binary Gaussian processes and binomial linear prediction.",
            "Video image transmission over mobile satellite channels.",
            "Approximation of the Karhunen-Loève transformation and its application to colour images.",
            "Spatiotemporal segmentation for compact video representation.",
            "Content-dependent image sampling using mathematical morphology: Application to texture mapping.",
            "A visual analysis/synthesis feedback loop for accurate face tracking.",
            "Content-based and perceptual bit-allocation using matching pursuits.",
            "Motion-compensated video compression with reduced complexity encoding for remote transmission.",
            "Combined Kohonen neural networks and discrete cosine transform method for iterated transformation theory.",
            "Adaptive 3-D median filtering for restoration of an image sequence corrupted by impulse noise.",
            "Wavelet-based moving-picture coding using shift-invariant motion estimation in wavelet domain.",
            "An overview of multimedia content protection in consumer electronics devices.",
            "Editorial.",
            "Embedded video coding using invertible motion compensated 3-D subband/wavelet filter bank.",
            "Scalable video coding with robust mode selection.",
            "Picture quality optimization in ABR video services.",
            "Forward error correction (FEC) codes based multiple description coding for internet video streaming and multicast.",
            "User-aware object-based video transmission over the next generation Internet.",
            "The performance of layered video over an IP network.",
            "Classification and evaluation of filters for wavelet coded videostreams.",
            "A real-time visual postprocessor for MPEG-coded video sequences.",
            "Numerical modeling of transmission errors and video quality of MPEG-2.",
            "Syntax based error concealment.",
            "An illumination invariant algorithm for subpixel accuracy image stabilization and its effect on MPEG-2 video compression.",
            "Biorthogonal nearly coiflet wavelets for image compression.",
            "Loop filtering and post-filtering for low-bit-rates moving picture coding.",
            "Loss resilient H.263+video over the Internet.",
            "Halftone image data hiding with intensity selection and connection selection.",
            "Robust VB 2D-CELP image transmission over CDMA Rayleigh fading channels.",
            "2-D mesh-based video object segmentation and tracking with occlusion resolution.",
            "Moving object localisation using a multi-label fast marching algorithm.",
            "A semi-automatic seeded region growing algorithm for video object localization and tracking."
        ]
    },
    {
        "name": "SPIC",
        "year": "1999",
        "info": "Volume 15: 1999/2000",
        "count": 52,
        "papers": [
            "Packet loss resilient transmission of MPEG video over the Internet.",
            "Optimal intra coding of blocks for robust video communication over the Internet.",
            "Packet loss resilient MPEG-4 compliant video coding for the Internet.",
            "Error concealment in video transmission over packet networks by a sketch-based approach.",
            "Robust Internet video transmission based on scalable coding and unequal error protection.",
            "Scalable Internet video using MPEG-4.",
            "Real-time encoding frame rate control for H.263+ video over the Internet.",
            "Intermedia synchronization for videoconference over IP.",
            "Real-time MPEG-2 delivery based on RTP: Implementation issues.",
            "Quality scalable coding of selected region: : Its modeling and H.263-based implementation.",
            "Subblock sum matching algorithm for block-based interframe coding.",
            "New motion estimation and compensation algorithms for video compression combining global and local motions.",
            "Joint source and channel decoding of compressed still images.",
            "Speed versus quality in low bit-rate still image compression.",
            "Image sequence compression using adapted three-dimensional transform: Application to scintigraphic images.",
            "MPEG-4: Why, what, how and when?",
            "MPEG-4 Systems: Overview.",
            "MPEG-4 Systems: Elementary stream management.",
            "MPEG-4's binary format for scene description.",
            "The delivery layer in MPEG-4.",
            "MPEG-4 natural video coding - An overview.",
            "Face and 2-D mesh animation in MPEG-4.",
            "MPEG-4 natural audio coding.",
            "Synthetic and SNHC audio in MPEG-4.",
            "Profiles and levels in MPEG-4: Approach and overview.",
            "An accurate bit-rate control for real-time MPEG video encoder.",
            "Rate control for MPEG video coding.",
            "Image compression using multiple transforms.",
            "Low-complexity rate-distortion optimal transcoding of MPEG I-frames.",
            "An optimization of finite-state vector quantization for image compression.",
            "On image compression by competitive neural networks and optimal linear predictors.",
            "A new approach to wire-frame tracking for semantic model-based moving image coding.",
            "Special Issue on Shape Coding for Emerging Multimedia Applications.",
            "A contour-based approach to binary shape coding using a multiple grid chain code.",
            "Shape compression of moving objects using context-based arithmetic encoding.",
            "Scan interleaving based scalable binary shape coding.",
            "Error concealment in video coding of arbitrarily shaped objects.",
            "Generalized predictive binary shape coding using polygon approximation.",
            "A new vertex-based binary shape coder for high coding efficiency.",
            "A mathematical model for shape coding with B-splines.",
            "A wavelet multiresolution compression technique for 3D stereoscopic image sequence based on mixed-resolution psychophysical experiments.",
            "A quadratic motion-based object-oriented video codec.",
            "Hybrid image coding based on partial fractal mapping.",
            "Document image segmentation and quality improvement by moiré pattern analysis.",
            "A fast multi-resolution block matching algorithm for motion estimation.",
            "Optimal reconstruction from quantized data.",
            "Image-based rendering and 3D modeling: A complete framework.",
            "Fundamental error analysis and geometric interpretation for block truncation coding techniques.",
            "Blocking effect reduction of compressed images using classification-based constrained optimization.",
            "Wavelet image coding using variable blocksize vector quantization with optimal quadtree segmentation.",
            "Wavelet packets and spatial adaptive intraband coding of images.",
            "Coding of 12-bit video from thermal imaging systems."
        ]
    },
    {
        "name": "SPIC",
        "year": "1998",
        "info": "Volume 14: 1998/1999",
        "count": 54,
        "papers": [
            "Acquisition of sharp depth map from multiple cameras.",
            "Orthographic approach to representing 3-D images and interpolating light rays for 3-D image communication and virtual environment.",
            "Novel scene generation, merging and stitching views using the 2D affine space.",
            "Characteristics of disparity-compensated stereo image pair residuals.",
            "3D area matching with arbitrary multiview geometry.",
            "Flexible 3D motion estimation and tracking for multiview image sequence coding.",
            "Stereoscopic image coding: Effect of disparate image-quality in left- and right-eye views.",
            "Disparity map coding based on adaptive triangular surface modelling.",
            "Autostereoscopic 3D display systems with observer tracking.",
            "A realtime hardware system for stereoscopic videoconferencing with viewpoint adaptation.",
            "Evolution of stereoscopic and three-dimensional video.",
            "Variable tree size fractal compression for wavelet pyramid image coding.",
            "Motion compensation using spatial transformations with forward mapping.",
            "Index compressed tree-structured vector quantisation.",
            "A strategy for satellite data archival. Low noise variable-rate vector quantization with application to AVHRR satellite images: A tutorial review.",
            "MPEG 2 video error resilience experiments: : The importance considering the impact of the systems layer.",
            "Adaptive detection and localization of moving objects in image sequences.",
            "Rate-quality tradeoff MPEG video encoder.",
            "An efficient memory allocation scheme for Huffman coding of multiple sources.",
            "A novel fast fractal decoding algorithm.",
            "Contour simplification for segmented still image and video coding: algorithms and experimental results.",
            "Automatic location and tracking of the facial region in color video sequences.",
            "Pel recursive motion estimation and compensation in subbands.",
            "Embedded SNR scalable MPEG-2 video encoder and its associated error resilience decoding procedures.",
            "Fractal image approximation and orthogonal bases.",
            "Scalable and robust image compression using quadtrees.",
            "Error resilience and concealment performance for MPEG-4 frame-based video coding.",
            "Error concealment algorithms for compressed video.",
            "A low-complexity error-resilient H.263 coder.",
            "Error concealment by data partitioning.",
            "Error resilient video coding schemes for real-time and low-bitrate mobile communications.",
            "Error resilient video coding controlled by backward channel signaling.",
            "Bi-directional motion vector coding using Universal VLC.",
            "A combined source-channel video coding scheme for mobile channels.",
            "Uniform trellis coded quantization for image transmission over noisy channels.",
            "Error robust multiplexing for multimedia applications.",
            "An efficient multiplex architecture for mobile MPEG-4 systems.",
            "Error resilience in the MPEG-2 video coding standard for cell based networks - A review.",
            "Objective and subjective quality of service performance of video-on-demand in ATM-WAN.",
            "Comparison of error concealment techniques for an MPEG-2 video decoder in terrestrial TV-broadcasting.",
            "Binary vector quantizer design using soft centroids.",
            "Variable quality image compression system based on SPIHT.",
            "Analysis of motion compensated filters concerning motion correctness and accuracy.",
            "An interpolative subband coding algorithm for lossless image compression.",
            "Image compression with neural networks - A survey.",
            "Efficient layered video coding using data partitioning.",
            "Model-based analytical FOE determination.",
            "Eye and gaze tracking for visually controlled interactive stereoscopic displays.",
            "A fast quadtree motion segmentation for image sequence coding.",
            "3D object articulation and motion estimation in model-based stereoscopic videoconference image sequence analysis and coding.",
            "Improvement of region-based motion estimation by considering uncovered regions.",
            "Nonlinear vector error tolerant interpolation of intermediate video images by weighted medians.",
            "New prediction schemes for lossless coding of fullband and subband images.",
            "Numerical solutions for orthogonal wavelet filters by Newton method."
        ]
    },
    {
        "name": "SPIC",
        "year": "1998",
        "info": "Volume 13: 1998",
        "count": 18,
        "papers": [
            "Two-dimensional split and merge algorithm for differential vector quantization of images.",
            "The Chebyshev polynomial fitting properties of discrete cosine transform.",
            "Identification of random fields of points.",
            "Transmission error detection and concealment in JPEG images.",
            "Coding for the storage and communication of visualisations of 3D medical data.",
            "Blockwise distortion measure for statistical and structural errors in digital images.",
            "An efficient Huffman table sharing method for memory-constrained entropy coding of multiple sources.",
            "A fast single-pass deterministic video deghoster for terrestrial transmitted video.",
            "Block-matching motion estimation using correlation search algorithm.",
            "A multiresolution adaptive VQ based still image codec with application to progressive image transmission.",
            "Subband VPIC with classified joint vector quantization.",
            "On the computation of warping-based motion compensation in video sequence coding.",
            "Adaptive motion estimation based on spatio-temporal correlation.",
            "Predictive subband image coding with wavelet transform.",
            "Video rate control using a radial basis function estimator for constant bit-rate MPEG coders.",
            "Analysis and design of stereoscopic television systems.",
            "Conversion of articulatory parameters into active shape model coefficients for lip motion representation and synthesis.",
            "Applications of kriging to image sequence coding."
        ]
    },
    {
        "name": "SPIC",
        "year": "1998",
        "info": "Volume 12: 1998",
        "count": 22,
        "papers": [
            "Image compression using modified block truncation coding algorithm.",
            "A vector quantization scheme using prequantizers of human visual effects.",
            "A predictive image coding scheme using a smaller codebook.",
            "Improving the performance of edge localization techniques through error compensation.",
            "Color quantization with genetic algorithms.",
            "Adaptive motion-compensated interpolation based on spatiotemporal segmentation.",
            "Selective prediction error transmission using motion information.",
            "Foreword.",
            "Mobile image transmission using combined source and channel coding with low complexity concealment.",
            "Bandwidth efficient transmission of MPEG-II video over noisy mobile links.",
            "Information theoretical based design of hierarchical channel coding and modulation for mobile radio channels.",
            "Robust mobile image transmission using hierarchical QAM.",
            "Wavelet video transmission over wireless channels.",
            "Effective algorithms for video transmission over wireless channels.",
            "Multi-frame packet reservation multiple access using oscillation-scaled histogram-based Markov modelling of video codecs.",
            "Multipath fading effects on integrated video, voice and data transmisson in hybrid-code BPSK-DS/CDMA systems.",
            "Concept of a wireless indoor video communications system.",
            "A comparison of motion-compensated interlace-to-progressive conversion methods.",
            "A new coding algorithm for arbitrarily shaped image segments.",
            "Fractal coding of subbands with an oriented partition.",
            "Huffman coding of DCT coefficients using dynamic codeword assignment and adaptive codebook selection.",
            "A novel method for automatic face segmentation, facial feature extraction and tracking."
        ]
    },
    {
        "name": "SPIC",
        "year": "1997",
        "info": "Volume 11: 1997/1998",
        "count": 18,
        "papers": [
            "A VBR rate control algorithm for MPEG-2 video coders with perceptually adaptive quantisation and traffic shaping.",
            "A local relaxation method for optical flow estimation.",
            "Image compression using permutative vector quantization.",
            "Circle-tangent interpolation of vertices for measurement value representation and shape approximation in object video coding.",
            "Segmented image coding: Techniques and experimental results.",
            "Empirical multiresolution models applicable to gray-level image processing.",
            "An image coding scheme based on image projections and geometrical VQ.",
            "The influence of residual errors on a digital satellite TV decoder.",
            "A novel interpolative vector quantization scheme.",
            "IDCT output range before clipping in MPEG video coding.",
            "Compression of multispectral images by address-predictive vector quantization.",
            "Morphological spatio-temporal simplification for video image segmentation.",
            "Adaptive multichannel filters for colour image processing.",
            "Reduction of blocking effect in DCT-coded images based on a visual perception criterion.",
            "Edge-based motion compensated classified DCT with quadtree for image sequence coding.",
            "Image compression through projection of wavelet coefficients.",
            "Disparity field and depth map coding for multiview 3D image generation.",
            "Stereo image analysis for multi-viewpoint telepresence applications."
        ]
    },
    {
        "name": "SPIC",
        "year": "1997",
        "info": "Volume 10: 1997",
        "count": 17,
        "papers": [
            "MPEG-4, Part 2: Submitted papers.",
            "Partitions: A taxonomy of types and representations and an overview of coding techniques.",
            "Triangular active mesh for motion estimation.",
            "Efficiency of displacement estimation techniques.",
            "Video coding using motion compensation with polynomial motion vector fields.",
            "Tracking a face for knowledge-based coding of videophone sequences.",
            "A fuzzy logic system for content-based bit-rate allocation.",
            "Towards MPEG4: An improved H.263-based video coder.",
            "Hybrid object-based/block-based coding in video compression at very low bit-rate.",
            "A region-based subband coding scheme.",
            "Basics of stereoscopic video, new compression results with MPEG-2 and a proposal for MPEG-4.",
            "Software architecture for flexible and extensible image decoding.",
            "Error concealment algorithms for robust decoding of MPEG compressed video.",
            "Normalization schemes in a neural network image compression algorithm.",
            "A linear quadtree compression scheme for image encryption.",
            "On the performance bounds of motion-compensated deinterlacing.",
            "Speed-up fractal image compression with a fuzzy classifier."
        ]
    },
    {
        "name": "SPIC",
        "year": "1996",
        "info": "Volume 9: 1996/1997",
        "count": 35,
        "papers": [
            "A comparison of system architectures for intelligent document understanding.",
            "Intermediate view synthesis considering occluded and ambiguously referenced image regions.",
            "Scene segmentation from dense displacement vector fields using randomized Hough transform.",
            "Robust estimation of camera parameters from image sequence for video composition.",
            "Very low bit-rate audio-visual applications.",
            "Vector quantization with compressed codebooks.",
            "Redundancy reducing coding of moving object shapes.",
            "Hybrid cell loss concealment methods for MPEG-II-based packet video.",
            "Coding of video-conference stereo image sequences using 3D models.",
            "Consequences of pixel precision for compression rate and measurement.",
            "Multichannel filters for image processing.",
            "Image transmission over noisy channels using multicarrier modulation.",
            "Editorial.",
            "Shape estimation of articulated 3D objects for object-based analysis-synthesis coding (OBASC).",
            "Automatic adaptation of a face model in a layered coder with an object-based analysis-synthesis layer and a knowledge-based layer.",
            "The use of stereo and motion in a generic object-based coder.",
            "Object-oriented coding for efficient transmission of space-acquired image data.",
            "Tube-based video coding.",
            "Hair image generating algorithm using fractional hair model.",
            "Shape description and representation by ellipsoids.",
            "MPEG-4, part 1: Invited papers.",
            "MPEG-4: Context and objectives.",
            "Subjective evaluation of MPEG-4 video codec proposals: Methodological approach and test procedures.",
            "Tests on MPEG-4 audio codec proposals.",
            "Methodologies used for evaluation of video tools and algorithms in MPEG-4.",
            "MPEG-4 video verification model: A video encoding/decoding algorithm based on content representation.",
            "The MPEG-4 systems and description languages: A way ahead in audio visual information representation.",
            "MPEG-4: Audio/video and synthetic graphics/audio for mixed media.",
            "Where for art thou MPEG-4?",
            "What MPEG-4 means to me.",
            "What does MPEG-4 mean to me.",
            "Step to creation.",
            "What MPEG-4 means to me.",
            "\"What does MPEG-4 mean to me\".",
            "What does MPEG-4 mean to me."
        ]
    },
    {
        "name": "SPIC",
        "year": "1996",
        "info": "Volume 8: 1996",
        "count": 43,
        "papers": [
            "Compression algorithms for software coding of video.",
            "An approach to fast transform coding in software.",
            "Super efficient decoding of color JPEG images on RISC machines.",
            "A low complexity H.261-compatible software video decoder.",
            "A performance comparison of three software video codecs for IBM RISC System/6000 workstations.",
            "Brick-wall structured segmentation for interpolative vector quantization of images.",
            "The use of genetic algorithms in morphological filter design.",
            "A hybrid image compression scheme combining block-based fractal coding and DCT.",
            "HDTV picture quality performance in the presence of random errors, analysis and measures for improvement.",
            "Conditional-entropy-constrained trellis-searched vector quantization for image compression.",
            "Maximum likelihood clustering via normal mixture models.",
            "High-speed moving picture coding using adaptively load balanced multiprocessor system.",
            "The bi-orthogonal decomposition in image processing: Signal analysis and texture segmentation.",
            "Overlapped motion compensation for subband coding of video sequences.",
            "Image coding using generalized optimal subband decomposition and vector quantization.",
            "Video on demand.",
            "A review of fully interactive video on demand.",
            "Development of Columbia's video on demand testbed.",
            "Study of video-on-demand system using narrow band ISDN.",
            "A practical system for MPEG-2-based video-on-demand over ATM packet networks and the WWW.",
            "Pre/post-filter for performance improvement of transform coding.",
            "Binary image representation and coding by a double-recursive morphological algorithm.",
            "Video semantics.",
            "Filmic space-time diagrams for video structure representation.",
            "Detection and description of moving objects by stochastic modelling and analysis of complex scenes.",
            "Efficient automatic analysis of camera work and microsegmentation of video using spatiotemporal images.",
            "Automatic extraction of human facial features.",
            "Efficient representations of video sequences and their applications.",
            "A three-dimensional muscle-based facial expression synthesizer for model-based image coding.",
            "Improved scanning methods for wavelet coefficients of video signals.",
            "Image compression using projection vector quantization with quadtree decomposition.",
            "Drift analysis and drift reduction for multiresolution hybrid video coding.",
            "Error concealment for robust arithmetic decoding in mobile radio environments.",
            "Index compressed image adaptive vector quantisation.",
            "A prequantizer with the human visual effect for the DPCM.",
            "Statistics for variable bit-rate digital television sources.",
            "A novel parallel design of a codec for black and white image compression.",
            "Vector quantization with hierarchical classification of sub-blocks.",
            "Transcoding of MPEG bitstreams.",
            "Multiple shell structured hypercube feature maps for vector quantization of images.",
            "Spatio-temporal segmentation of image sequences for object-oriented low bit-rate image coding.",
            "Block position dithering in DCT-coded sequences.",
            "On the design of a hierarchical BTC-VQ compression system."
        ]
    },
    {
        "name": "SPIC",
        "year": "1995",
        "info": "Volume 7: 1995",
        "count": 36,
        "papers": [
            "Adaptive Huffman coding of 2-D DCT coefficients for image sequence compression.",
            "Frame adaptive finite-state vector quantization for image sequence coding.",
            "Compression of 10-bit video using the tools of MPEG-2.",
            "Facial feature localization and adaptation of a generic face model for model-based coding.",
            "On the transformed entropy-constrained vector quantizers employing Mandala block for image coding.",
            "Error accumulation in hybrid DPCM/DCT video coding.",
            "Differential methods for the identification of 2D and 3D motion models in image sequences.",
            "Stereo image sequence coding based on three-dimensional motion estimation and compensation.",
            "Bayesian algorithms for adaptive change detection in image sequences using Markov random fields.",
            "Permutational model of image texture.",
            "Concealment techniques for data-reduced HDTV recording.",
            "Multistage motion estimation for image interpolation.",
            "MPEG-2 requirements, profiles and performance verification - Framework for developing a generic video coding standard.",
            "Distributed optimization of codebooks.",
            "Motion-compensated prediction based algorithm for medical image sequence compression.",
            "Automatic face location detection and tracking for model-assisted coding of video teleconferencing sequences at low bit-rates.",
            "Exact subband image decomposition and reconstruction in discrete space and discrete frequency domains.",
            "Editorial.",
            "A layered coding system for very low bit rate video coding.",
            "Contour simplification and motion compensated coding.",
            "Morphological shape representation for very low bit-rate video coding.",
            "Very low bit-rate image coding on adaptive multigrids.",
            "Temporal image sequence prediction using motion field interpolation.",
            "Estimation of point light source parameters for object-based coding.",
            "Low complexity shape-adaptive DCT for coding of arbitrarily shaped image segments.",
            "A motion compensated subband coder for very low bit-rates.",
            "Very low bit-rate video coding with DFD segmentation.",
            "Automatic face location detection for model-assisted rate control in H.261-compatible coding of video.",
            "Motion coding of image primitives.",
            "Three-dimensional parameter estimation from stereo image sequences for model-based image coding.",
            "Speed-up trend analysis for H.261 and model-based image coding algorithms using a parallel-pipeline model.",
            "Estimation and compensation of accelerated motion for temporal sequence interpolation.",
            "Video compression using mosaic representations.",
            "ITU standardisation of very low bitrate video coding algorithms.",
            "Motion compensation for very low bit-rate video.",
            "Motion-compensated wavelet transform coder for very low bit-rate visual telephony."
        ]
    },
    {
        "name": "SPIC",
        "year": "1994",
        "info": "Volume 6: 1994",
        "count": 44,
        "papers": [
            "Dynamic finite state VQ of colour images using stochastic learning.",
            "Image sampling structure conversion by morphological filters.",
            "Bit-rate control for digital TV and HDTV codecs.",
            "An alternative method of optoelectronic color analysis for slides.",
            "Evaluation of multiresolution block matching techniques for motion and disparity estimation.",
            "A fast and efficient compression method for binary images.",
            "A comparison of different block truncation coding algorithms for image compression.",
            "3-D spatiotemporal subband decompositions for hierarchical compatible video coding by mathematical morphology.",
            "Detecting the skew angle in document images.",
            "An improved block matching algorithm based on successive refinement of motion vector candidates.",
            "Motion compensation and multiresolution coding.",
            "Object-based analysis-synthesis coding based on the source model of moving rigid 3D objects.",
            "Coding scheme and hardware structure of a high-rate digital HDTV codec with partly error-free encoding.",
            "Real-time software-based moving picture coding (SBMPC) system.",
            "Motion estimation and compensation technologies for standards conversion.",
            "Motion-compensated conversion from interlaced to progressive formats.",
            "Digital video standards conversion in the presence of accelerated motion.",
            "Sub-pixel motion estimation with 3-D recursive search block-matching.",
            "Motion estimation using combined shape and edge matching.",
            "Visually adapted temporal subsampling of motion information.",
            "Motion-compensated TV standards converter using motion vectors computed by an iterative gradient method.",
            "Motion-adaptive standards conversion between formats of similar field rates.",
            "Fourier phase shift location estimation of unfocused optical point spread functions.",
            "A fully adaptive DCT based color image sequence coder.",
            "Inter-block filtering and downsampling in DCT domain.",
            "On the accuracy and convergence of 2-D motion models using minimum MSE motion estimation.",
            "A lip-tracking system based on morphological processing and block matching techniques.",
            "A motion detection scheme for motion adaptive pro-scan conversion.",
            "Change detection and texture analysis for image sequence coding.",
            "Object-oriented scene modeling for interpersonal video communication at very low bit-rate.",
            "A fast nearly optimum equi-spaced 3-level block truncation coding algorithm.",
            "Fractal coding of monochrome images.",
            "A low complexity video subband coder for ATM.",
            "Multiplexing digital television sources on ATM networks.",
            "Content-driven differential encoding of an enhanced image pyramid.",
            "Entropy reduction of symbols by source splitting and its application to video coding.",
            "Image coding on the Phobos space probe.",
            "Image segmentation towards new image representation methods.",
            "Fast competitive learning with classified learning rates for vector quantization.",
            "Global-motion estimation in image sequences of 3-D scenes for coding applications.",
            "MPEG digital storage media (DSM) control command.",
            "On the adaptive three-dimensional transform coding techniques for moving images.",
            "Bit-rate control for MPEG encoders.",
            "Wavelet transform coding for MCP error images using quadtree decomposition and ECVQ."
        ]
    },
    {
        "name": "SPIC",
        "year": "1993",
        "info": "Volume 5: 1993",
        "count": 39,
        "papers": [
            "Preface.",
            "Flexible scalable digital video coding.",
            "Hybrid extended MPEG video coding algorithm for general video applications.",
            "Adaptive frame/field motion compensated video coding.",
            "A VLSI implementation study of a 10 Mbit/s video decoder.",
            "MUPCOS: A multi-purpose coding scheme.",
            "COSMIC: A compatible scheme for moving image coding.",
            "Subband based TV coding.",
            "Video coding algorithm up to 10 Mbit/s.",
            "ISO/IEC JTC1 SC29/WG11; Report on MPEG-2 subjective assessment at Kurihama.",
            "Hierarchical coding scheme of video signal with scalability and compatibility.",
            "Interlaced video coding with field-based multiresolution representation.",
            "An adaptive hybrid DPCM/DCT method for video coding.",
            "VQ on projection domain of image.",
            "Still images retrieval from a remote database: The system Imagine.",
            "Combining DCT and subband coding into an intraframe coder.",
            "A new motion adaptive PAL-codec.",
            "Direct image resampling using block transform coefficients.",
            "Ringing reduction in low bit-rate image subband coding using projection onto a space of paraboloids.",
            "An adaptive BTC-VQ image compression algorithm operating at a fixed bit-rate.",
            "Two-layer coding for videotelephone.",
            "Stereo and motion correspondence in a sequence of stereo images.",
            "Investigations on colour coding in an object-oriented analysis-synthesis coder.",
            "Fractal image compression.",
            "Digital high definition television - Dawning of the new era.",
            "Progress on HDTV broadcasting standards in the United States.",
            "Multicarrier modem for digital HDTV terrestrial broadcasting.",
            "Digital HDTV broadcasting over the CATV distribution system.",
            "Signal processing for a digital HDTV chromakey mixer.",
            "Channel coding scheme for 34 in HDTV digital VCR.",
            "FLC and VLC coding for professional digital HDTV recording - Application to D1-like recorders.",
            "A spatially layered hierarchical approach to video coding.",
            "Possible channel coding and modulation system for the satellite broadcasting of a high-definition television signal.",
            "Block motion compensated coding of interlaced sequences using adaptively deinterlaced fields.",
            "Backward motion compensation for interlaced HDTV.",
            "Variable length coding of interleaved DCT coefficients for digital HDTV.",
            "Very high resolution imaging scheme with multiple different-aperture cameras.",
            "Hierarchical sub-band coding of super high definition image with adaptive block-size multistage VQ.",
            "Estimation and distribution of motion information in image communication networks."
        ]
    },
    {
        "name": "SPIC",
        "year": "1992",
        "info": "Volume 4: 1992",
        "count": 41,
        "papers": [
            "Stereoscopic display for design visualization.",
            "Compatibility issues and selection devices for stereoscopic television.",
            "3D-television: A survey of recent research results on subjective requirements.",
            "A stereoscopic television system (3D-TV) and compatible transmission on a MAC channel (3D-MAC).",
            "Constrained disparity and motion estimators for 3DTV image sequence coding.",
            "A three camera approach for calculating disparity and synthesizing intermediate pictures.",
            "Optimized quantization for image subband coding.",
            "Adaptive algorithms for image coding using vector quantization.",
            "Piecewise linear motion-adaptive interpolation.",
            "Technical features of the JBIG standard for progressive bi-level image compression.",
            "Coded representation of multimedia and hypermedia information objects: Towards the MHEG standard.",
            "The MPEG video compression algorithm.",
            "Requirements for high quality video coding standards.",
            "The MPEG systems coding specification.",
            "Motion estimation and compensation for image sequence coding.",
            "A further reduction of multiplications in Wang's fast DCT algorithm.",
            "Image sequence coding using temporal co-occurrence matrices.",
            "Hierarchical coding of HDTV.",
            "Noise smoothing by a fast K-nearest neighbour algorithm.",
            "Variable bit-rate source modelling of ATM-based video services.",
            "Hierarchical transform and subband coding of video signals.",
            "All-digital high definition television: Dream or reality?",
            "Advanced modulation and channel coding tecniques for digital HDTV via satellite in the 20 GHz range.",
            "Combined multiresolution source coding and modulation for digital broadcast of HDTV.",
            "The digital spectrum-compatible HDTV system.",
            "MPEG++: A robust compression and transport system for digital HDTV.",
            "Motion compensated subband coding schemes for compatible high definition TV coding.",
            "An HDTV bit-rate reduction codec at the STM-1 rate of SDH.",
            "120/140 Mbit/s portable HDTV codec and its transmission performance in a field trial via INTELSAT satellite.",
            "Development of 135 Mbit/s HDTV codec.",
            "A versatile DCT coding system for HDTV with interlaced and progressive scanning.",
            "Digital consumer HDTV recording based on motion-compensated DCT coding of video signals.",
            "How to integrate access control mechanisms into digital HDTV systems?",
            "All-digital super high definition images.",
            "A high resolution video workstation.",
            "Predictive coding of images using an adaptive intra-frame predictor and motion compensation.",
            "Statistical analysis of the 2D-DCT coefficients of the differential signal for images.",
            "Exact image subband decomposition/reconstruction by DCT.",
            "Hierarchical multirate vector quantization for image coding.",
            "A new block-based motion estimation algorithm.",
            "Local motion-adaptive interpolation technique based on block matching algorithms."
        ]
    },
    {
        "name": "SPIC",
        "year": "1991",
        "info": "Volume 3: 1991",
        "count": 27,
        "papers": [
            "Video subband VQ coding at 64 kbit/s using short-kernel filter banks with an improved motion estimation technique.",
            "Object-oriented motion estimation and segmentation in image sequences.",
            "Hybrid coding with pre-buffering and pre-analysis in a software-based codec environment.",
            "Hardware trials for verifying recommendation H.261 on p × 64 kbit/s video codec.",
            "Two-stage multirate coding of color images.",
            "A comparison of vector quantization techniques in transform and subband coding of imagery.",
            "Preface.",
            "HDTV transmission system in an ATM-based network.",
            "Variable bit-rate image sequence coding with adaptive quantization.",
            "A two layers video coding scheme for ATM networks.",
            "A motion vector replenishment video codec for ATM networks.",
            "Universal VBR videocodecs for ATM networks in the Belgian Broadband Experiment.",
            "Modeling activity in VBR video sources.",
            "Two-layer video coding for ATM networks.",
            "Image reconstruction from partial subband images and its application in packet video transmission.",
            "DCT-based embedded coding for packet video.",
            "Filter design for the interpolation of highly subsampled pictures.",
            "A migrating data-driven architecture for multidimensional signal processing.",
            "1.15 Mbit/s coding of video signals including global motion compensation.",
            "Classified block truncation coding-vector quantization: An edge sensitive image compression algorithm.",
            "Preface.",
            "A video coding method considering cell losses in ATM-based networks.",
            "Layered coding for ATM based video distribution systems.",
            "Variable bit-rate coding based on human visual system.",
            "Bit-rate control algorithm on video packet coding and its characteristics.",
            "ATM video signal multiplexer with congestion control function.",
            "An error-correcting code for data broadcasting and its error-correction capability."
        ]
    },
    {
        "name": "SPIC",
        "year": "1990",
        "info": "Volume 2: 1990",
        "count": 32,
        "papers": [
            "On the arithmetic required in the computation of orthonormal transforms.",
            "Extension of the CCITT visual communication coding algorithm for operation in ATM networks.",
            "A simplified motion estimator based on binary correlation.",
            "Considerations on the possibility to exchange temporal against spatial resolution in image coding.",
            "Error-free image decomposition/reconstruction for subband coding schemes.",
            "A differential method for simultaneous estimation of rotation, change of scale and translation.",
            "Encoding of videoconferencing signals using VDPCM.",
            "A hybrid image coder with vector quantizer.",
            "Moving picture coding system for digital storage media using hybrid coding.",
            "Hardware design of a motion video decoder for 1-1.5 Mbps rate applications.",
            "Video coding with motion-compensated interpolation for CD-ROM applications.",
            "DCT coding for motion video storage using adaptive arithmetic coding.",
            "A CCITT compatible coding algorithm for digital recording of moving images.",
            "Adaptation and improvement of CCITT reference model 8 video coding for digital storage media applications.",
            "A low bit rate coding algorithm for full motion video signal.",
            "Subjective assessment of redundancy-reduced moving images for interactive application: Test methodology and report.",
            "Compatible coding of television images, part 1. Coding algorithm.",
            "Compatible coding of television images, part 2. Compatible system.",
            "Compressor function for analogue HDTV component signals.",
            "Single stage 280 Mbit/s coding of HDTV using HDPCM with a vector quantizer based on masking functions.",
            "A bidimensional model of line-shuffling.",
            "Spatio-temporal subsampling and transform coding of HDTV signals.",
            "Wideband MAC-compatible HDTV transmission system.",
            "Adaptive sub-band DCT coding for HDTV signal transmission.",
            "1.2 Gbit/s HDTV digital VTR.",
            "Perfect reconstruction filter banks for HDTV representation and coding.",
            "Time-recursive deinterlacing for IDTV and pyramid coding.",
            "Texture mapping in model-based image coding.",
            "Motion vector replensihment for low bit-rate video coding.",
            "Object-oriented analysis-synthesis coding based on moving two-dimensional objects.",
            "Image sequence coding using oriented edges.",
            "Subband coding of image sequences at low bit rates."
        ]
    },
    {
        "name": "SPIC",
        "year": "1989",
        "info": "Volume 1: 1989",
        "count": 18,
        "papers": [
            "Editorial.",
            "Standardization activities on multimedia coding in ISO.",
            "Standardization activities in HDTV broadcasting.",
            "Digital coding of television signals - CCIR activities for standardization.",
            "Video codec standardization in CCITT study group XV.",
            "Standardization activities in image communication for telematic services.",
            "Image coding using an adaptive sampling technique.",
            "Editorial.",
            "64 kbit/s Video coding algorithm using adaptive gain/shape vector quantization.",
            "A 64 kbit/s Videophone codec with forward analysis and control.",
            "Object-oriented analysis-synthesis coding of moving images.",
            "Model-based analysis synthesis image coding (MBASIC) system for a person's face.",
            "Coding of arbitrarily shaped image segments based on a generalized orthogonal transform.",
            "Foreground/background segmentation in videotelephony.",
            "Motion compensating interpolation considering covered and uncovered background.",
            "An array processor approach for low bit rate video coding.",
            "Low bit rate videophone codec for ISDN applications.",
            "A general architecture of video codec for real time communication at 64 kbit/s."
        ]
    }
]