[
    {
        "year": "2019",
        "name": "24th SPM 2019",
        "info": "Vancouver, BC, Canada",
        "venues": []
    },
    {
        "year": "2018",
        "name": "23rd SPM 2018",
        "info": "Bilbao, Spain",
        "venues": []
    },
    {
        "year": "2017",
        "name": "22nd SPM 2017",
        "info": "Berkeley, California, USA",
        "venues": []
    },
    {
        "year": "2016",
        "name": "21st SPM 2016",
        "info": "Berlin, Germany",
        "venues": []
    },
    {
        "year": "2015",
        "name": "20th SPM 2015",
        "info": "Salt Lake City, Utah, USA",
        "venues": []
    },
    {
        "year": "2014",
        "name": "19th SPM 2014",
        "info": "Hong Kong, SAR, China",
        "venues": []
    },
    {
        "year": "2013",
        "name": "18th SPM 2013",
        "info": "Denver, Colorado, USA",
        "venues": []
    },
    {
        "year": "2012",
        "name": "17th SPM 2012",
        "info": "Dijon, France",
        "venues": []
    },
    {
        "year": "2011",
        "name": "16th SPM 2011",
        "info": "Orlando, Florida, USA",
        "venues": []
    },
    {
        "year": "2010",
        "name": "15th SPM 2010",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2010",
                "sub_name": "ACM Symposium on Solid and Physical Modeling, Proceedings of the 15th ACM Symposium on Solid and Physical Modeling, SPM 2010, Haifa, Israel, September 1-3, 2010.",
                "count": 26,
                "papers": [
                    "Fast and robust retrieval of Minkowski sums of rotating convex polyhedra in 3-space.",
                    "Group morphology with convolution algebras.",
                    "Robust Minkowski sums of polyhedra via controlled linear perturbation.",
                    "A GPU-based voxelization approach to 3D Minkowski sum computation.",
                    "A generalization for stable mixed finite elements.",
                    "Topologically correct reconstruction of tortuous contour forests.",
                    "Point distance and orthogonal range problems with dependent geometric uncertainties.",
                    "Efficient simplex computation for fixture layout design.",
                    "Accurate moment computation using the GPU.",
                    "Using the witness method to detect rigid subsystems of geometric constraints in CAD.",
                    "Adaptive surface reconstruction based on implicit PHT-splines.",
                    "Barycentric interpolation and mappings on smooth convex domains.",
                    "Hyperbolic centroidal Voronoi tessellation.",
                    "Hexahedral shell mesh construction via volumetric polycube map.",
                    "Anisotropic quadrangulation.",
                    "Multi-level grid algorithms for faster molecular energetics.",
                    "Constructing A-spline weight functions for stable WEB-spline finite element methods.",
                    "Uncertain geometry with dependencies.",
                    "Merging and smoothing machining boundaries on cutter location surfaces.",
                    "Conservative swept volume boundary approximation.",
                    "Volume and complexity bounded simplification of solid model represented by binary space partition.",
                    "Multiresolution morse triangulations.",
                    "Polygonizing extremal surfaces with manifold guarantees.",
                    "Hierarchical surface fairing with constraints.",
                    "Piecewise 3D Euler spirals.",
                    "Topologically guaranteed univariate solutions of underconstrained polynomial systems via no-loop and single-component tests."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th SPM 2009",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2009",
                "sub_name": "Proceedings of the 2009 ACM Symposium on Solid and Physical Modeling, San Francisco, California, USA, October 5-8, 2009.",
                "count": 42,
                "papers": [
                    "Robust Voronoi-based curvature and feature estimation.",
                    "Robust mesh reconstruction from unoriented noisy points.",
                    "Repairing and meshing imperfect shapes with Delaunay refinement.",
                    "Log-aesthetic space curve segments.",
                    "On the parameterization of Catmull-Rom curves.",
                    "Tracing ridges on B-Spline surfaces.",
                    "A framework for preservable geometry-centric artifacts.",
                    "SOT: compact representation for tetrahedral meshes.",
                    "Generalized Koebe's method for conformal mapping multiply connected domains.",
                    "Constraint-based model synthesis.",
                    "Treedecomposition of geometric constraint graphs based on computing graph circuits.",
                    "Nonlinear systems solver in floating-point arithmetic using LP reduction.",
                    "Discrete physics using metrized chains.",
                    "Particle-based forecast mechanism for continuous collision detection in deformable environments.",
                    "Mesh cutting during real-time physical simulation.",
                    "A geometric criterion for smooth interpolation of curve networks.",
                    "A symbolic-numerical envelope algorithm using quadratic MOS patches.",
                    "b-morphs between b-compatible curves in the plane.",
                    "Accelerating geometric queries using the GPU.",
                    "Exact Delaunay graph of smooth convex pseudo-circles: general predicates, and implementation for ellipses.",
                    "Testing an axis of rotation for 3D workpiece draining.",
                    "A sketching interface for feature curve recovery of free-form surfaces.",
                    "Configuration products in geometric modeling.",
                    "A dynamic data structure for flexible molecular maintenance and informatics.",
                    "Semantic-based partial retrieval of CAD models for design reuse.",
                    "Stable mesh decimation.",
                    "Hierarchical molecular interfaces and solvation electrostatics.",
                    "Anisotropic resizing of model with geometric textures.",
                    "Gabriel meshes and Delaunay edge flips.",
                    "Mesh clustering by approximating centroidal Voronoi tessellation.",
                    "Solving global geometric constraints on free-form curves.",
                    "Geometric reasoning via internet CrowdSourcing.",
                    "Efficient computation of a near-optimal primary parting line.",
                    "Robust principal curvatures using feature adapted integral invariants.",
                    "Computer aided design and evaluation of new anatomic fixation system on entire pelvic model.",
                    "Extending the A-patch single sheet conditions to enable the tessellation of algebraics.",
                    "Interrogating witnesses for geometric constraint solving.",
                    "An isogeometric BEM for exterior potential-flow problems in the plane.",
                    "Multi-core collision detection between deformable models.",
                    "NURBS based molecular force calculation.",
                    "C∞ smooth freeform surfaces over hyperbolic domains.",
                    "Reliable sweeps."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th SPM 2008",
        "info": "Stony Brook, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2008",
                "sub_name": "Proceedings of the 2008 ACM Symposium on Solid and Physical Modeling, Stony Brook, New York, USA, June 2-4, 2008.",
                "count": 48,
                "papers": [
                    "Geometry of architectural freeform structures.",
                    "Poisson surface reconstruction and its applications.",
                    "Toward superrobust geometric computation.",
                    "Identification of sections from engineering drawings based on evidence theory.",
                    "Interactive continuous collision detection between deformable models using connectivity-based culling.",
                    "A constraint-based dynamic geometry system.",
                    "Computing the Voronoi cells of planes, spheres and cylinders in R3.",
                    "Exact arrangements on tori and Dupin cyclides.",
                    "Voronoi diagram computations for planar NURBS curves.",
                    "Interactive physically-based shape editing.",
                    "Accelerated wave-based acoustics simulation.",
                    "Dynamic spherical volumetric simplex splins with application in biomedical simulation.",
                    "Direct sampling on surfaces for high quality remeshing.",
                    "Surface matching using consistent pants decomposition.",
                    "An incremental approach to feature aligned quad dominant remeshing.",
                    "Geometrically adaptive numerical integration.",
                    "Consistent computation of first- and second-order differential quantities for surface meshes.",
                    "A generic and flexible framework for the geometrical and topological analysis of (algebraic) surfaces.",
                    "Fast mesh segmentation using random walks.",
                    "Multi-component heart reconstruction from volumetric imaging.",
                    "Pattern computation for compression garment.",
                    "Extraction of isosurfaces from multi-material CT volumetric data of mechanical parts.",
                    "Isosurface extraction and interpretation on very large datasets in geophysics.",
                    "Laser brush: a flexible device for 3D reconstruction of indoor scenes.",
                    "Efficient mesh deformation using tetrahedron control mesh.",
                    "Sweeping solids on manifolds.",
                    "Performing efficient NURBS modeling operations on the GPU.",
                    "Volumetric parameterization and trivariate b-spline fitting using harmonic functions.",
                    "Streaming tetrahedral mesh optimization.",
                    "Converting a tetrahedral mesh to a prism-tetrahedral hybrid mesh for FEM accuracy and efficiency.",
                    "Controlled field generation for quad-remeshing.",
                    "Probabilistic model of triangulation.",
                    "Triangulation of hierarchical hexagon meshes.",
                    "Mitered offset of a mesh using QEM and vertex split.",
                    "GPU conversion of quad meshes to smooth surfaces.",
                    "Subdivision surfaces for procedural design of imprint rolls.",
                    "Negotiating design specifications: evolving functional constraints in mechanical assembly design.",
                    "Guarding curvilinear art galleries with edge or mobile guards.",
                    "Visibility-based feature extraction from discrete models.",
                    "Filament tracking and encoding for complex biological networks.",
                    "Solid height-map sets: modeling and visualization.",
                    "Multiresolution sphere packing tree: a hierarchical multiresolution 3D data structure.",
                    "Kinematic convexity of spherical displacements and its application to collision prediction.",
                    "Parametric triangular Bézier surface interpolation with approximate continuity.",
                    "An enlarged-surface based solid model for robust blending.",
                    "User-controllable polycube map for manifold spline construction.",
                    "Technical strategies for massive model visualization.",
                    "Bio-geometry: challenges, approaches, and future opportunities in proteomics and drug discovery."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th SPM 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2007",
                "sub_name": "Proceedings of the 2007 ACM Symposium on Solid and Physical Modeling, Beijing, China, June 4-6, 2007.",
                "count": 54,
                "papers": [
                    "Computational conformal geometry, theories and applications.",
                    "An introduction to persistent homology.",
                    "Multivariate (geometric) constraints solving using subdivision based solvers.",
                    "Random walks for mesh denoising.",
                    "3D triangular mesh optimization in geometry processing for CAD.",
                    "Optimal boundaries for Poisson mesh merging.",
                    "Mesh connectivity compression using convection reconstruction.",
                    "Driving object deformations from internal physical processes.",
                    "Manifold splines with single extraordinary point.",
                    "Solid and physical modeling with chain complexes.",
                    "Shape sensitivity of constructive representations.",
                    "Nonlinear interpolation between slices.",
                    "Harmonic volumetric mapping for solid modeling applications.",
                    "Approximate convex decomposition of polyhedra.",
                    "A real-time and exact implementation of the predicates for the Voronoi diagram of parametric ellipses.",
                    "Weak witnesses for Delaunay triangulations of submanifolds.",
                    "Out-of-core distance transforms.",
                    "C-DIST: efficient distance computation for rigid and articulated models in configuration space.",
                    "Level set based method for simultaneous optimization of material property and topology of functionally graded structures.",
                    "Shape smoothing using double offsets.",
                    "Generating smooth parting lines for mold design for meshes.",
                    "Estimating the impact of large design changes on field problems.",
                    "Feature-preserving non-local denoising of static and time-varying range data.",
                    "Shape modeling and matching in identifying protein structure from low-resolution images.",
                    "Distance between a Catmull-Clark subdivision surface and its limit mesh.",
                    "Polycube splines.",
                    "An exact, complete and efficient computation of arrangements of Bézier curves.",
                    "Sliding windows algorithm for B-spline multiplication.",
                    "Salient critical points for meshes.",
                    "Converting hybrid wire-frames to B-rep models.",
                    "Surface parameterization via aligning optimal local flattening.",
                    "An algebraic spline model of molecular surfaces.",
                    "Ellipsoid-tree construction for solid objects.",
                    "Approximate the swept volume of revolutions along curved trajectories.",
                    "Approximate continuity for parametric Bézier patches.",
                    "An efficient algorithm for three-dimensional beta-complex and beta-shape via a quasi-triangulation.",
                    "Direct evaluation of NURBS curves and surfaces on the GPU.",
                    "Detecting approximate incomplete symmetries in discrete point sets.",
                    "Tracking topological changes in feature models.",
                    "A feature based approach to re-engineering objects of freeform design by exploiting point cloud morphology.",
                    "A two-level topological decomposition for non-manifold simplicial shapes.",
                    "Quality metrics for geologic grid structures.",
                    "Computing an exact spherical visibility map for meshed polyhedra.",
                    "Mathematical representation of the vascular structure and applications.",
                    "A note on morphological development and transformation of Bézier curves based on ribs and fans.",
                    "Computing geodesic spectra of surfaces.",
                    "Cable route planning in complex environments using constrained sampling.",
                    "A conceptual modeling approach actualizing the pencil and paper metaphor.",
                    "Quasi-dynamic splines.",
                    "Voronoi-Delaunay duality and Delaunay meshes.",
                    "A physically-based framework for real-time haptic cutting and interaction with 3D continuum models.",
                    "Validating a cloth simulator for measuring tight-fit clothing pressure.",
                    "Including and optimizing shape parameters in Doo-Sabin subdivision surfaces for interpolation.",
                    "G2 blending of corners by cubic algebraic splines."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th SPM 2006",
        "info": "Cardiff University, Wales, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2006",
                "sub_name": "Proceedings of the ACM Symposium on Solid and Physical Modeling 2006, Cardiff University, Wales, UK, June 6-8, 2006.",
                "count": 24,
                "papers": [
                    "Segmenting reliefs on triangle meshes.",
                    "Feature sensitive mesh segmentation.",
                    "Identifying flat and tubular regions of a shape by unstable manifolds.",
                    "Constructive topological representations.",
                    "Controlled-topology filtering.",
                    "Solving topological constraints for declarative families of objects.",
                    "Geometric and physical modelling in medical image processing: methods, applications and examples.",
                    "Real-time haptic incision simulation using FEM-based discontinuous free form deformation.",
                    "Conformal virtual colon flattening.",
                    "Interactive simulation of one-dimensional flexible parts.",
                    "Computing surface hyperbolic structure and real projective structure.",
                    "Automated mixed dimensional modelling for the finite element analysis of swept and revolved CAD features.",
                    "Holoimages.",
                    "Interactive spline-driven deformation for free-form surface styling.",
                    "Pen-based styling design of 3D geometry using concept sketches and template models.",
                    "Constructing smooth branching surfaces from cross sections.",
                    "Parameterization of mesh-models: theory, implementation and applications.",
                    "Generalized penetration depth computation.",
                    "Geometric constraints solving: some tracks.",
                    "A higher dimensional formulation for robust and interactive distance queries.",
                    "Duplicate-skins for compatible mesh modelling.",
                    "Simultaneous shape decomposition and skeletonization.",
                    "Experience in the exchange of procedural shape models using ISO 10303 (STEP).",
                    "Design for manufacturing feedback at interactive rates."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th SPM 2005",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2005",
                "sub_name": "Proceedings of the Tenth ACM Symposium on Solid and Physical Modeling 2005, Cambridge, Massachusetts, USA, June 13-15, 2005.",
                "count": 31,
                "papers": [
                    "Computational and physical modeling challenges in structural molecular biology and proteomics.",
                    "Making green goop from polygon soup.",
                    "Projection-homeomorphic surfaces.",
                    "Geometric texture synthesis and transfer via geometry images.",
                    "Manifold splines.",
                    "Homotopy-preserving medial axis simplification.",
                    "Precise Voronoi cell extraction of free-form rational planar closed curves.",
                    "An integrating approach to meshing scattered point data.",
                    "NURBS-based Galerkin method and application to skeletal muscle modeling.",
                    "Computational modeling and simulation of heart ventricular mechanics with tagged MRI.",
                    "Bender: a virtual ribbon for deforming 3D shapes in biomedical and styling applications.",
                    "Laplace-spectra as fingerprints for shape matching.",
                    "Tightening: curvature-limiting morphological simplification.",
                    "A small feature suppression/unsuppression system for preparing B-rep models for analysis.",
                    "One-dimensional selections for feature-based data exchange.",
                    "A constructive approach to calculate parameter ranges for systems of geometric constraints.",
                    "Numerical decomposition of geometric constraints.",
                    "An integrated approach to realize multi-resolution of B-rep model.",
                    "Boolean operations on 3D selective Nef complexes: optimized implementation and experiments.",
                    "An efficient, error-bounded approximation algorithm for simulating quasi-statics of complex linkages.",
                    "Multi-representation interaction for physically based modeling.",
                    "Packing a trunk: now with a twist!",
                    "Simplified engineering analysis via medial mesh reduction.",
                    "Regular meshes.",
                    "Clustering method for fast deformation with constraints.",
                    "Fast and robust detection of crest lines on meshes.",
                    "Finding feasible mold parting directions using graphics hardware.",
                    "Layered tetrahedral meshing of thin-walled solids for plastic injection molding FEM.",
                    "Accurate and robust geometric modeling for simulation of IC and MEMS fabrication processes.",
                    "Poisson shape interpolation.",
                    "Benchmarking CAD search techniques."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th SMA 2004",
        "info": "Genova, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2004",
                "sub_name": "Proceedings of the Ninth ACM Symposium on Solid Modeling and Applications, Genova, Italy, June 09-11, 2004.",
                "count": 42,
                "papers": [
                    "Residual iteration and accurate polynomial evaluation for shape-interrogation applications.",
                    "Efficient and robust computation of an approximated medial axis.",
                    "Medial axis extraction and shape manipulation of solid objects using parabolic PDEs.",
                    "Medial axis based solid representation.",
                    "From computer geometry to manufacturing algorithms.",
                    "Multiresolution heterogeneous solid modeling and visualization using trivariate simplex splines.",
                    "Automatic building of structured geological models.",
                    "Spline approximation of general volumetric data.",
                    "Planar parameterization for closed 2-manifold genus-1 meshes.",
                    "A condition for isotopic approximation.",
                    "An effective condition for sampling surfaces with guarantees.",
                    "Optimization techniques for approximation with subdivision surfaces.",
                    "A framework for multi-dimensional adaptive subdivision objects.",
                    "Tolerance envelopes of planar mechanical parts.",
                    "Fast continuous collision detection for articulated models.",
                    "B-rep SE: simplicially enhanced boundary representation.",
                    "Update operations on 3D simplicial decompositions of non-manifold objects.",
                    "Efficient processing of 3D scanned models.",
                    "Integrated feature-based and geometric CAD data exchange.",
                    "Making the most of using depth reasoning to label line drawings of engineering objects.",
                    "Progressive dimension-independent Boolean operations.",
                    "Constraint-based design of B-spline surfaces from curves.",
                    "Reconstruction with 3D geometric bilateral filter.",
                    "Developability-preserved free-form deformation of assembled patches.",
                    "Implicit curve and surface design using smooth unit step functions.",
                    "Stability and homotopy of a subset of the medial axis.",
                    "Tracing surface intersections with validated ODE system solver.",
                    "Topological and geometric beautification of reverse engineered geometric models.",
                    "Connected & manifold Sierpinsky polyhedra.",
                    "Physics-based modelling and simulation of functional cloth for virtual prototyping applications.",
                    "Image based bio-cad modeling and its applications to biomedical and tissue engineering.",
                    "Shape similarity measurement using ray distances for mass customization.",
                    "Using Cayley-Menger determinants for geometric constraint solving.",
                    "History based reactive objects for immersive CAD.",
                    "Shortest circuits with given homotopy in a constellation.",
                    "Contour interpolation with bounded dihedral angles.",
                    "Actual morphing: a physics-based approach to blending.",
                    "Euler operators for stratified objects with incomplete boundaries.",
                    "Handling degeneracies in exact boundary evaluation.",
                    "3D discrete skeleton generation by wave propagation on PR-octree for finite element mesh sizing.",
                    "Compression, segmentation, and modeling of filamentary volumetric data.",
                    "Plumber: a method for a multi-scale decomposition of 3D shapes into tubular primitives and bodies."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8th SMA 2003",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2003",
                "sub_name": "Proceedings of the Eighth ACM Symposium on Solid Modeling and Applications 2003, Seattle, Washington, USA, June 16 - 20, 2003.",
                "count": 46,
                "papers": [
                    "Keynote lecture: shape interrogation.",
                    "Keynote lecture: aesthetic engineering.",
                    "Keynote lecture: a perspective on the future of design.",
                    "Collision prediction for polyhedra under screw motions.",
                    "Fast swept volume approximation of complex polyhedral models.",
                    "Contour generators of evolving implicit surfaces.",
                    "Transforming an under-constrained geometric constraint problem into a well-constrained one.",
                    "Geometric constraint solving via C-tree decomposition.",
                    "Specification of freeform features.",
                    "Any open bounded subset of Rn has the same homotopy type than its medial axis.",
                    "Automating the CAD/CAE dimensional reduction process.",
                    "Approximation by skin surfaces.",
                    "Efficient computation of a simplified medial axis.",
                    "Estimating the in/out function of a surface represented by points.",
                    "Surface reconstruction of freeform objects based on multiresolution volumetric method.",
                    "Tight cocone: a water-tight surface reconstructor.",
                    "Three-dimensional halfspace constructive solid geometry tree construction from implicit boundary representations.",
                    "Discretization of functionally based heterogeneous objects.",
                    "Exploiting self-similarity in geometry for voxel based solid modeling.",
                    "Dynamic remeshing and applications.",
                    "Ambient isotopic approximations for surface reconstruction and interval solids.",
                    "Data-dependent fairing of subdivision surfaces.",
                    "Shape intrinsic fingerprints for free-form object matching.",
                    "Scale-space representation of 3D models and topological matching.",
                    "3D zernike descriptors for content based shape retrieval.",
                    "t-FFD: free-form deformation by using triangular mesh.",
                    "Interactive shape design using volumetric implicit PDEs.",
                    "Free-form skeleton-driven mesh deformations.",
                    "Representation of porous artifacts for bio-medical applications.",
                    "Online sculpting and visualization of multi-dexel volumes.",
                    "Superquadrics with rational and irrational symmetry.",
                    "An architecture for universal CAD data exchange.",
                    "Modelling free-form surfaces using a feature-based approach.",
                    "Graph based topological analysis of tessellated surfaces.",
                    "Approximate medial axis for CAD models.",
                    "Adaptive and quality 3D meshing from imaging data.",
                    "Feature preserving manifold mesh from an octree.",
                    "Direct incremental transmission of boundary representation.",
                    "Representation of non-manifold objects.",
                    "Constrained modifications of non-manifold B-reps.",
                    "Associativity between feature models across domains.",
                    "Automated learning of model classifications.",
                    "Free-form deformations via sketching and manipulating scalar fields.",
                    "Feature preserved volume simplification.",
                    "Cusp modeling for 5-axis surface machining.",
                    "Automatically generating large urban environments based on the footprint data of buildings."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "7th SMA 2002",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2002",
                "sub_name": "Seventh ACM Symposium on Solid Modeling and Applications, Max-Planck-Institut für Informatik, Saarbrücken, Germany, June 17-21, 2002.",
                "count": 46,
                "papers": [
                    "Topological framework for part families.",
                    "A survey of the persistent naming problem.",
                    "ESOLID---A System for Exact Boundary Evaluation.",
                    "A generic approach to free form surface generation.",
                    "Adaptive implicit modeling using subdivision curves and surfaces as skeletons.",
                    "Hierarchical extraction of iso-surfaces with semi-regular meshes.",
                    "CSG-BRep duality and compression.",
                    "Reconstruction of feature volumes and feature suppression.",
                    "Biorthogonal wavelets for subdivision volumes.",
                    "Removal of blends from boundary representation models.",
                    "Solving spatial basic geometric constraint configurations with locus intersection.",
                    "Revisiting decomposition analysis of geometric constraint graphs.",
                    "A local coordinate system on a surface.",
                    "Range-Image segmentation and model reconstruction based on a fit-and-merge strategy.",
                    "A linear bound on the complexity of the delaunay triangulation of points on polyhedral surfaces.",
                    "Smooth surface and triangular mesh: comparison of the area, the normals and the unfolding.",
                    "A multi-resolution topological representation for non-manifold meshes.",
                    "Dual/Primal mesh optimization for polygonized implicit surfaces.",
                    "Interactive sculpting with implicit surfaces.",
                    "Estimating depth from line drawing.",
                    "Cellular-functional modeling of heterogeneous objects.",
                    "Fast volumetric CSG modeling using standard graphics system.",
                    "Interactive sculpturing and visualization of unbounded voxel volumes.",
                    "Web based analysis.",
                    "A new solid subdivision scheme based on box splines.",
                    "Basic components of the DIJA project.",
                    "Interacting with parametrized geometric objects using lambda-terms.",
                    "Deformation of finite element meshes using directly manipulated free-form deformation.",
                    "Constraint-based motion planning for virtual prototyping.",
                    "Subdivision-based multilevel methods for large scale engineering simulation of thin shells.",
                    "Using shape distributions to compare solid models.",
                    "Multiresolution rendering by sewing trimmed NURBS surfaces.",
                    "Edgebreaker: a simple compression for surfaces with handles.",
                    "Sketch- and constraint-based design of B-spline surfaces.",
                    "Multi-resolution and slice-oriented feature extraction and segmentation of digitized data.",
                    "Application of feature technology to modeling and dimensioning the intermediate geometry of automotive powertrain components.",
                    "Reconstruction of feature volumes and feature suppression.",
                    "Directional offset of a 3D curve.",
                    "Cutting 3D freeform objects with genus-n into single boundary surfaces using topological graphs.",
                    "Linear onesided stability of MAT for weakly injective 3D domain.",
                    "Approximate medial axis as a voronoi subcomplex.",
                    "An algorithm for deciding similarities of 3-D objects.",
                    "Discrete models for geometric objects.",
                    "Application of haptic navigation to modify free-form surfaces through specified points and curves.",
                    "A collaborative framework for integrated part and assembly modeling.",
                    "Constraint-based design of optimal transport elements."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "6th SMA 2001",
        "info": "Ann Arbor, Michigan, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/2001",
                "sub_name": "Sixth ACM Symposium on Solid Modeling and Applications, Sheraton Inn, Ann Arbor, Michigan, USA, June 4-8, 2001.",
                "count": 44,
                "papers": [
                    "Geometric constraint solver using multivariate rational spline functions.",
                    "A constraint solving-based approach to analyze 2D geometric problems with interval parometers.",
                    "Use of topological constraints in construction and processing of robust solid models.",
                    "The ellipsoidal skeleton in medical applications.",
                    "Reconstructing occlusal surfaces of teeth using a genetic algorithm with simulated annealing type selection.",
                    "Intelligent balloon: a subdivision-based deformable model for surface reconstruction of arbitrary topology.",
                    "Efficient adaptive meshing of parametric models.",
                    "Three dimensional threaded fastener meshing algorithm.",
                    "Database techniques for archival of solid models.",
                    "Construction of fair surfaces over irregular meshes.",
                    "Blend recognition algorithm and applications.",
                    "Multiresolution curve editing with linear constraints.",
                    "Octree based assembly sequence generation.",
                    "A geometric algorithm for selecting optimal set of cutters for multi-part milling.",
                    "Parallel processing for 2-1/2D machining simulation.",
                    "Analysis of boundary representation model rectification.",
                    "Partial entity structure: a compact non-manifold boundary representation based on partial topological entities.",
                    "Out-of-core build of a topological data structure from polygon soup.",
                    "A laminae approach to constructing geometric feature volumes.",
                    "A graph-based framework for feature recognition.",
                    "Finding approximate shape regularities in reverse engineered solid models bounded by simple surfaces.",
                    "Volumetric multi-texturing for functionally gradient material representation.",
                    "Max-fit biarc fitting to STL models for rapid prototyping processes.",
                    "Representation and extraction of volumetric attributes using trivariate splines: a mathematical framework.",
                    "Approximate symmetry detection for reverse engineering.",
                    "The power crust.",
                    "Is this a quadrisected mesh?",
                    "Automatic adjustment of invalid feature models.",
                    "A geometric algorithm for automated design of multi-stage molds for manufacturing multi-material objects.",
                    "Dynamic segmentation and incremental editing of boundary representations in a collaborative design environment.",
                    "An efficient data structure for random walk algorithms in faceted porous media.",
                    "The swept surface of an elliptic cylinder.",
                    "4-8 factorization of quadrilateral subdivision.",
                    "Topology recognition of 3D closed freeform objects based on topological graphs.",
                    "FRONTIER: fully enabling geometric constraints for feature-based modeling and assembly.",
                    "A geometric algorithm for automated design of multi-piece sacrificial molds.",
                    "Deformation multi-tool combining existing deformation tools.",
                    "FEM-based subdivision solids for dynamic and haptic interaction.",
                    "A solid modeling services architecture for KBE applications.",
                    "Smooth connection of trimmed NURBS surfaces.",
                    "Representation of temporal change in solid models.",
                    "Web-based collaborative feature modeling.",
                    "Constructive modeling of FRep solids using spline volumes.",
                    "The computation of circumcircles of three circles."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "5th SMA 1999",
        "info": "Ann Arbor, Michigan, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/1999",
                "sub_name": "Fifth ACM Symposium on Solid Modeling and Applications, Ann Arbor, Michigan, USA, June 9-11, 1999.",
                "count": 38,
                "papers": [
                    "A computerized design environment for functional modeling of mechanical products.",
                    "Extended variational design technology-foundation for integrated design automation.",
                    "Integrated mechanically based CAE system.",
                    "Matchmaker: manifold BReps for non-manifold r-sets.",
                    "Offsetting operations on non-manifold boundary representation models with simple geometry.",
                    "Grow & fold: compression of tetrahedral meshes.",
                    "Consistent updates in dual representation systems.",
                    "Resolving non-uniqueness in design feature histories.",
                    "Validity maintenance of semantic feature models.",
                    "A tool-centric approach to designing composable feature recognizers.",
                    "Manufacturable feature recognition and its integration with process planning.",
                    "Synthesis of bent sheet metal parts from design features.",
                    "Level set diagrams of polyhedral objects.",
                    "A skeletal-based solid editor.",
                    "Detection of symmetry and primary axes in support of proactive design for assembly.",
                    "Rational bisectors of CSG primitives.",
                    "Computing the Voronoi diagram of a 3-D polyhedron by separate computation of its symbolic and geometric parts.",
                    "Accurate computation of the medial axis of a polyhedron.",
                    "A novel FEM-based dynamic framework for subdivision surfaces.",
                    "Fine level feature editing for subdivision surfaces.",
                    "Blending, smoothing and interpolation of irregular meshes using N-sided Varady patches.",
                    "Surface feature constraint deformation for free-form and interactive design.",
                    "Fast volume-preserving free form deformation using multi-level optimization.",
                    "Three dimensional freeform sculpting via zero sets of scalar trivariate functions.",
                    "Implicit functions with guaranteed differential properties.",
                    "A mathematical model for boundary representations of n-dimensional geometric objects.",
                    "Foundation of a computable solid modeling.",
                    "A coherent sweep plane slicer for layered manufacturing.",
                    "Integrated solid modeler based solutions for machining.",
                    "Generation of swept volumes of toroidal endmills in five-axis motion using space curves.",
                    "Mutationable generative feature-based design with floating datum system.",
                    "Single dimension relationships in relational CAD.",
                    "Error classification and recovery within CAD model reconstruction.",
                    "A volumetic approach to interactive CSG modeling and rendering.",
                    "Conceptual design for mechatronic assemblies.",
                    "Improved constructions of Delaunay based contour surfaces.",
                    "Surface fairing preserving continuity with neighboring surfaces based on wavelet transform.",
                    "Web based collaborative CAAD."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th SMA 1997",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/1997",
                "sub_name": "Proceedings of the Fourth Symposium on Solid Modeling and Applications, Atlanta, Georgia, USA, May 14-16, 1997.",
                "count": 35,
                "papers": [
                    "Structured Topological Complexes: A Feature-Based API for Non-Manifold Topologies.",
                    "Structural Operators for Modeling 3-Manifolds.",
                    "The Generic Geometric Complex (GGC): A Modeling Scheme for Families of Decomposed Pointsets.",
                    "Dependency Maintenance in Declarative Geometry Modelling.",
                    "Efficient and Accurate B-rep Generation of Low Degree Sculptured Solids Using Exact Arithmetic.",
                    "Orthogonal Polyhedra as Geometric Bounds in Constructive Solid Geometry.",
                    "Bridging the Gap Between CSG and Brep via a Triple Ray Representation.",
                    "Feature Operations Using Selective Boolean.",
                    "Modeling with Self Validation Features.",
                    "A Feature-Based Approach for Smooth Surfaces.",
                    "Interactive Feature Extraction for a Form Feature Conversion System.",
                    "Maintaining Multiple Views in Feature Modeling.",
                    "A Kernel for Geometric Features.",
                    "Skeleton-Based Modeling Operations on Solids.",
                    "UNSWEEP: Formulation and Computational Properties.",
                    "A Constraint-Based Manipulator Toolset for Editing 3D Objects.",
                    "Efficient and Precise Solid Modelling Using a 3D Input Device.",
                    "Box-Spline Based CSG Blends.",
                    "Filleting and Rounding Using Trimmed Tensor Product Surfaces.",
                    "NURBS Based B-rep Models for Macromolecules and Their Properties.",
                    "Relating Functional Schematics to Hierarchical Mechanical Assemblies.",
                    "Mathematical Foundation for Representing Propagation of Geometric Tolerances.",
                    "Processing of CAD-Data - Conversion, Verification and Repair.",
                    "A Design/Constraint Model to Capture Design Intent.",
                    "Interactive Constraint System for Solid Modeling Objects.",
                    "Formal Resolution of Geometrical Constraint Systems by Assembling.",
                    "Shape Feature Determination Using the Curvature Region Representation.",
                    "Feature-Based Similarity Assessment of Solid Models.",
                    "On Multiple Interpretations.",
                    "Assessing the Feasibility of a Process Plan: A Study in Variable Interaction.",
                    "An Approach to Modeling Multi-Material Objects.",
                    "Spatial Partitioning of Solids for Solid Freeform Fabrication.",
                    "Fast Monte Carlo Domain Sampling for Discrete Field Value Estimation.",
                    "Generating Swept Solids for NC Verification Using the SEDE Method.",
                    "3D Geometric Simulation of MEMS Fabrication Processes: A Semantic Approach."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd SMA 1995",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/1995",
                "sub_name": "Third ACM SIGGRAPH Symposium on Solid Modeling and Applications, Salt Lake City, Utah, USA, May 17-19, 1995.",
                "count": 42,
                "papers": [
                    "Parametric design and its impact on solid modeling applications.",
                    "Design compilation of feature-based and constraint-based CAD.",
                    "A mechanism for persistently naming topological entities in history-based parametric solid models.",
                    "Geometric modeling: a new fundamental framework and its practical implications.",
                    "What is a parametric family of solids?.",
                    "Conceptual graphs in constraint based re-design.",
                    "Kinematic tolerance analysis.",
                    "Analysis of position uncertainties of parts in an assembly using configuration space in octree representation.",
                    "Assembly sequencing with toleranced parts.",
                    "A relational model for interactive manipulation of form features based on algebraic geometry.",
                    "Multiple-way feature conversion to support concurrent engineering.",
                    "Feature attributes and their role in product modeling.",
                    "Viewer-centred feature recognition.",
                    "A provably correct feature extractor for parts with cylindrical and planar surfaces.",
                    "Manufacturing feature instances: which ones to recognize?.",
                    "Pyramidal simplicial complexes.",
                    "Dimension-independent convex-cell based HPC: representation scheme and implementation issues.",
                    "On the completeness and conversion of ray representations of arbitrary solids.",
                    "Computation of the Medial Axis Transform of 3-D polyhedra.",
                    "Computing the medial surface of a solid from a domain Delaunay triangulation.",
                    "STEP AP203 data exchange study.",
                    "Polyhedral modelling with exact arithmetic.",
                    "Face-based data structure and its application to robust geometric modeling.",
                    "Boundary representation modelling with local tolerances.",
                    "Tracing tangential surface-surface intersections.",
                    "Solving geometric constraints by homotopy.",
                    "Arbitrarily precise computation of Gauss maps and visibility sets for freeform surfaces.",
                    "Rapid previewing via volume-based solid modeling.",
                    "Incremental algorithms for collision detection between solid models.",
                    "The cost of balancing generalized quadtrees.",
                    "Sketching as a solid modeling tool.",
                    "Creating solid models from single 2D sketches.",
                    "A shortest path approach to wireframe to solid model conversion.",
                    "Dynamic manipulation of triangular B-splines.",
                    "Volume-preserving free-form solid.",
                    "Shelling and offsetting bodies.",
                    "Function representation for sweeping by a moving solid.",
                    "Implicit reconstruction of solids from cloud point sets.",
                    "Algebraic sums for deformation of constructive solids.",
                    "Bubble mesh: automated triangular meshing of non-manifold geometry by sphere packing.",
                    "A fast method for estimating discrete field values in early engineering design.",
                    "Large mesh generation from boundary models with parametric face representation."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "2nd SMA 1993",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/1993",
                "sub_name": "ACM Symposium on Solid Modeling Foundations and CAD/CAM Applications, Montreal, Canada, May 19-21, 1993.",
                "count": 64,
                "papers": [
                    "A strategy for the automated design of mechanical parts.",
                    "An introduction to constructive shell representations for free-form surfaces and solids.",
                    "Generalised extrusion of polyhedra.",
                    "Product operator on cell complexes.",
                    "Integration of parametric geometry and non-manifold topology in geometric modeling.",
                    "A model for n-dimensional boundary topology.",
                    "Unified geometric modeling by non-manifold shell operation.",
                    "Continuous skeletons of discrete objects.",
                    "Multiresolution, incremental generation of 3D computer models from video data.",
                    "Generating languages of solid models.",
                    "Error-free boundary evaluation using lazy rational arithmetic: a detailed implementation.",
                    "Resolvable representation of polyhedra.",
                    "Efficient parallel evaluation of CSG tree using fixed number of processors.",
                    "Obtaining robust Boolean set operations for manifold solids by avoiding and eliminating redundancy.",
                    "Computing CSG tree boundaries as algebraic expressions.",
                    "Blending parametric objects by implicit techniques.",
                    "Solving polynomial systems for curve, surface and solid modeling.",
                    "A parametric surface blending method for complex engineering objects.",
                    "Cyclides in solid modelling: recent developments.",
                    "A new offsetting algorithm based on tracing technique.",
                    "Modeling with triangular B-splines.",
                    "An accurate algorithm for rasterizing algebraic curves.",
                    "A constraint-driven solid modeling open environment.",
                    "Interactive constraint-based solid modeling using allowable motion.",
                    "An automated method for the incorporation of functionality in the geometric design of a shell.",
                    "Relaxed parametric design with probabilistic constraints.",
                    "A positioning algorithm for mechanical assemblies with closed.",
                    "Constraint based analysis tools for design.",
                    "Building a general approach to feature recognition of Material Removal.",
                    "Cut and paste based modeling with boundary features.",
                    "Efficient face-based feature recognition.",
                    "Geometric reasoning for machining features using convex decomposition.",
                    "A feature definition language for bridging solids and features.",
                    "A reference kernel model for feature-based CAD systems supported by conditional attributed rewrite systems.",
                    "Tolerancing a solid model with a kinematic formulation.",
                    "Modelling techniques for handling non-geometric information.",
                    "Algebraic interpretation of geometric tolerances for evaluating geometric uncertainties in solid modeling.",
                    "Representing functionality and design intent in product models.",
                    "New concepts for complete product assembly modeling.",
                    "Modeling contacts in a physically based simulation.",
                    "Tool path generation for freeform surface models.",
                    "The design and fabrication of welded tubular joints using solid modelling techniques.",
                    "\"Modeling Primitives\": an object oriented formulation of boundary value problems in a solid geometric modeling context.",
                    "Penetration analysis of solids.",
                    "A computational approach to the design of micromechanical hinged structures.",
                    "Digital manifolds: an intuitive definition and some properties.",
                    "A hierarchical representation for cellular decompositions.",
                    "Reconstructing multishell solids from voxel-based contours.",
                    "Generation of alternative feature-based models and precedence orderings for machining applications.",
                    "Constraint objects: integrating constraint definition and graphical interaction.",
                    "Incremental feature-based modeling.",
                    "Handling geometric objects with free form curves in spatial databases.",
                    "Spatial reasoning to support product design.",
                    "Interaction techniques for a highly interactive 3D geometric modeling system.",
                    "Relation between Boolean operators and Euler operators.",
                    "Surface smoothing control for CFD analysis.",
                    "Boundary evaluation using adaptive polygonization.",
                    "Intelligent form feature interaction management in a cellular modeling scheme.",
                    "Planar intersection, common inscribed sphere and Dupin blending cyclides.",
                    "Application of a surface-and-solid modeler to casting/forging die making and local restoration with a hierarchical non-manifold model.",
                    "Calculating offsets of a Bezier curve.",
                    "Two-dimensional MAT to boundary conversion.",
                    "Solid model representations for rapid prototyping with a milling robot.",
                    "Geometric modeling for cooperative product development."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "1st SMA 1991",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sma/1991",
                "sub_name": "Proceedings of the first ACM Symposium on Solid Modeling Foundations and CAD/CAM Applications, Austin, Texas, USA, June 05-07, 1991.",
                "count": 58,
                "papers": [
                    "Design methodology of boundary data structures.",
                    "Schemata for interrogating solid boundaries.",
                    "BRep-Index: a multidimensional space partitioning tree.",
                    "A boundary representation for form features and non-manifold solid objects.",
                    "An OBJ3 functional specification for boundary representation.",
                    "An algebraic approach to geometric query processing in CAD/CAM applications.",
                    "Octree detection of closed compartments.",
                    "An efficient algorithm for CSG to b-rep conversion.",
                    "An efficient intersection algorithm for polyhedral cellular decompositions.",
                    "Boolean operations on sets using surface data.",
                    "Approximation hierarchies and S-bounds.",
                    "The n-dimensional extended convex differences tree (ECDT) for representing polyhedra.",
                    "A generalized sweeping method for SGC modeling.",
                    "Production ready feature recognition based automatic group technology part coding.",
                    "A feature recognition algorithm for multiply connected depressions and protrusions in 2 1/2 D objects.",
                    "A method for generating volumetric features from surface features.",
                    "A surface intersection algorithm based on loop detection.",
                    "A new approach for surface intersection.",
                    "Combining algebraic rigor with geometric robustness for the detection and calculation of conic sections in the intersection of two natural quadric surfaces.",
                    "On the planar intersection of natural quadrics.",
                    "Utilizing parametric hyperpatch methods for modeling and display of free-form solids.",
                    "The Ray casting engine and Ray representatives.",
                    "Real-time display of quadric on the I.M.O.G.E.N.E. machine.",
                    "Determination of mass properties of polygonal CSG objects in parallel.",
                    "Surface design with minimum energy networks.",
                    "Constructing easily invertible Bezier surfaces that parameterize general quadrics.",
                    "Parametric blending using fanout surfaces.",
                    "An extension of the potential method to higher-order blendings.",
                    "A blending model for parametrically defined geometric objects.",
                    "Deformation of n-dimensional objects.",
                    "Using degrees of freedom analysis to solve geometric constraint systems.",
                    "Automatic dimensioning in design for manufacturing.",
                    "Interaction with constraints in 3D modeling.",
                    "Algebraic solution for geometry from dimensional constraints.",
                    "A concept for a constraint-based representation of functional and geometric design knowledge.",
                    "Algebraic reasoning of position uncertainties of parts in an assembly.",
                    "On good triangulations in three dimensions.",
                    "Domain composition methods for associating geometric modeling with finite element modeling.",
                    "Bounded aspect ration triangulation of smooth solids.",
                    "Domain Delaunay Tetrahedrization of arbitrarily shaped curved polyhedra defined in a solid modeling system.",
                    "Constructing 3-D discrete medial axis.",
                    "Feature generation in concurrent engineering environment.",
                    "Qualitative geometric design.",
                    "Cooled turbine airfoil design with solid modeling at Textron Lycoming.",
                    "Summary of paper: feature & face editing in hybrid solid modeler.",
                    "An efficient and simple polygon intersection algorithm.",
                    "Handling face coincidence in a boolean algorithm for BREPS.",
                    "Solid modeling for geometries with repeated volumes.",
                    "A generalized Euler-Poincare equation.",
                    "NC turning tool path generation from CSG representations using the slab method.",
                    "Non-manifold topology model based on coupling entities.",
                    "Visualization of algebraic solids and surfaces.",
                    "Object model reconstruction from complex planar cross sections.",
                    "Development of a surface-and-modeler for raw material die making.",
                    "An object-oriented implementation of STEP.",
                    "An architecture for conceptual mechanical modeling.",
                    "Product database modeling for adaptive kinematic simulation of planar linkage mechanisms.",
                    "A new VLSI set membership classification algorithm."
                ]
            }
        ]
    }
]