[
    {
        "name": "TVC",
        "year": "2022",
        "info": "Volume 38, 2022",
        "count": 72,
        "papers": [
            "Acknowledgement to Reviewers 2021.",
            "Welcome to the year 2022.",
            "PREFACE (Vol 38, Issue1).",
            "Joint restoration convolutional neural network for low-quality image super resolution.",
            "Probability driven approach for point cloud registration of indoor scene.",
            "Compression of multi-temporal hyperspectral images based on RLS filter.",
            "Patch attention network with generative adversarial model for semi-supervised binocular disparity prediction.",
            "Solving the PnL problem using the hidden variable method: an accurate and efficient solution.",
            "Brain tumor classification based on hybrid approach.",
            "Single-image super-resolution based on local biquadratic spline with edge constraints and adaptive optimization in transform domain.",
            "Retinal vessel segmentation using simple SPCNN model and line connector.",
            "A new feature clustering method based on crocodiles hunting strategy optimization algorithm for classification of MRI images.",
            "A comparative study of single image fog removal methods.",
            "An adaptive and rapid 3D Delaunay triangulation for randomly distributed point cloud data.",
            "Spiking neural network based on joint entropy of optical flow features for human action recognition.",
            "Raw GIS to 3D road modeling for real-time traffic simulation.",
            "Adaptive feature selection in PET scans based on shared information and multi-label learning.",
            "Modality-transfer generative adversarial network and dual-level unified latent representation for visible thermal Person re-identification.",
            "A comprehensive survey on video frame interpolation techniques.",
            "Weber local descriptor for image analysis and recognition: a survey.",
            "Attention to fine-grained information: hierarchical multi-scale network for retinal vessel segmentation.",
            "A corner-clustering method for detection of slab management numbers sprayed on steel slabs.",
            "An improved simplified PCNN model for salient region detection.",
            "A privacy-aware deep learning framework for health recommendation system on analysis of big data.",
            "An improved anchor neighborhood regression SR method based on low-rank constraint.",
            "Visual complexity of shapes: a hierarchical perceptual learning model.",
            "Solving the fluid pressure with an iterative multi-resolution guided network.",
            "A novel bifold-stage shot boundary detection algorithm: invariant to motion and illumination.",
            "Genetic programming-based fusion of HOG and LBP features for fully automated texture classification.",
            "Fast optimal transport regularized projection and application to coefficient shrinkage and filtering.",
            "Reconstruction of adaptive swept surfaces from scanned data for styling design.",
            "An automated and efficient convolutional architecture for disguise-invariant face recognition using noise-based data augmentation and deep transfer learning.",
            "On developing complete character set Meitei Mayek handwritten character database.",
            "Object recognition algorithm based on optimized nonlinear activation function-global convolutional neural network.",
            "Robust, fast and flexible symmetry plane detection based on differentiable symmetry measure.",
            "Techniques for BRDF evaluation.",
            "On extended progressive and iterative approximation for least squares fitting.",
            "A robust nonrigid point set registration framework based on global and intrinsic topological constraints.",
            "Accurate visual tracking via reliable patch.",
            "Fabric defect detection based on low-rank decomposition with structural constraints.",
            "Robust compartmental model fitting in direct emission tomography reconstruction.",
            "Multi-view 3D shape style transformation.",
            "Detection of damaged buildings after an earthquake with convolutional neural networks in conjunction with image segmentation.",
            "Limited-view binary tomography reconstruction assisted by shape centroid.",
            "Visible watermarking in document images using two-stage fuzzy inference system.",
            "Hybrid neural network model for large-scale heterogeneous classification tasks in few-shot learning.",
            "A deep learning computer vision iPad application for Sales Rep optimization in the field.",
            "Contour-aware semantic segmentation network with spatial attention mechanism for medical image.",
            "Image encryption based on roulette cascaded chaotic system and alienated image library.",
            "Distortion-free image dehazing by superpixels and ensemble neural network.",
            "A robust RGBD saliency method with improved probabilistic contrast and the global reference surface.",
            "Fine-grained visual classification via multilayer bilinear pooling with object localization.",
            "Masquerade attack on biometric hashing via BiohashGAN.",
            "K sparse autoencoder-based accelerated reconstruction of magnetic resonance imaging.",
            "Real-time object tracking based on sparse representation and adaptive particle drawing.",
            "HybNet: a hybrid network structure for pain intensity estimation.",
            "Depth map super-resolution based on edge-guided joint trilateral upsampling.",
            "Hierarchical learning with backtracking algorithm based on the Visual Confusion Label Tree for large-scale image classification.",
            "Computer-aided parametric prosthetic socket design based on real-time soft tissue deformation and an inverse approach.",
            "Tracking of moving athlete from video sequences using flower pollination algorithm.",
            "TICS: text-image-based semantic CAPTCHA synthesis via multi-condition adversarial learning.",
            "Blood vessel segmentation in retinal fundus images for proliferative diabetic retinopathy screening using deep learning.",
            "DTR-HAR: deep temporal residual representation for human activity recognition.",
            "On-air English Capital Alphabet (ECA) recognition using depth information.",
            "Color image encryption scheme based on fractional Hartley transform and chaotic substitution-permutation.",
            "Class-discriminative focal loss for extreme imbalanced multiclass object detection towards autonomous driving.",
            "Constructing self-supporting structures in biscale topology optimization.",
            "Dual integrated convolutional neural network for real-time facial expression recognition in the wild.",
            "Clustering and Identification of key body extremities through topological analysis of multi-sensors 3D data.",
            "Multi-path dilated convolution network for haze and glow removal in nighttime images.",
            "Guided MDNet tracker with guided samples.",
            "Facial expression GAN for voice-driven face generation."
        ]
    },
    {
        "name": "TVC",
        "year": "2021",
        "info": "Volume 37, 2021",
        "count": 225,
        "papers": [
            "Preface (Vol 37. Issue 1).",
            "A comparison between expert and beginner learning for motor skill development in a virtual reality serious game.",
            "Effects of prolonged multidimensional fitness training with exergames on the physical exertion levels of older adults.",
            "Looking for Charizard: applying the orienteering problem to location-based games.",
            "Bidirectional long short-term memory networks and sparse hierarchical modeling for scalable educational learning of dance choreographies.",
            "Aerial firefighter radio communication performance in a virtual training system: radio communication disruptions simulated in VR for Air Attack Supervision.",
            "Total generalized variation-based Retinex image decomposition.",
            "Fine-grained talking face generation with video reinterpretation.",
            "Modelling distracted agents in crowd simulations.",
            "Multiple answers to a question: a new approach for visual question answering.",
            "A single-shot multi-level feature reused neural network for object detection.",
            "Multi-level uncorrelated discriminative shared Gaussian process for multi-view facial expression recognition.",
            "Evaluation on visualization methods of dynamic collaborative relationships for project management.",
            "Radiometric compensation for non-rigid surfaces by continuously estimating inter-pixel correspondence.",
            "Image encryption using shuffled Arnold map and multiple values manipulations.",
            "Preface (Vol 37, Issue 2).",
            "Feature selection based on star coordinates plots associated with eigenvalue problems.",
            "Face recognition in unconstrained environment with CNN.",
            "Deep green function convolution for improving saliency in convolutional neural networks.",
            "A multi-phase blending method with incremental intensity for training detection networks.",
            "A rapid vortex identification method using fully convolutional segmentation network.",
            "Deep learned compact binary descriptor with a lightweight network-in-network architecture for visual description.",
            "Meitei Mayek handwritten dataset: compilation, segmentation, and character recognition.",
            "GenSSS: a genetic algorithm for measured subsurface scattering representation.",
            "A structural-constraint 3D point clouds segmentation adversarial method.",
            "DART: a visual analytics system for understanding dynamic association rule mining.",
            "Privacy-preserving video fall detection using visual shielding information.",
            "Abrupt-motion-aware lightweight visual tracking for unmanned aerial vehicles.",
            "An intelligent and blind image watermarking scheme based on hybrid SVD transforms using human visual system characteristics.",
            "A simplified ICA-based local similarity stereo matching.",
            "Preface (Vol 37, Issue 3).",
            "Restricted Boltzmann machine as an aggregation technique for binary descriptors.",
            "A semi-supervised deep learning approach for circular hole detection on composite parts.",
            "2D-human face recognition using SIFT and SURF descriptors of face's feature regions.",
            "A review, framework, and R toolkit for exploring, evaluating, and comparing visualization methods.",
            "Multi-level and multi-perspective visual correlation analysis between general courses and program courses.",
            "A personalized active method for 3D shape classification.",
            "Fabric defect detection based on information entropy and frequency domain saliency.",
            "Multi-level progressive parallel attention guided salient object detection for RGB-D images.",
            "A new one-dimensional cosine polynomial chaotic map and its use in image encryption.",
            "A low-cost, practical acquisition and rendering pipeline for real-time free-viewpoint video communication.",
            "A robust tracking algorithm with on online detector and high-confidence updating strategy.",
            "Partial tracking method based on siamese network.",
            "Dynamic human body reconstruction and motion tracking with low-cost depth cameras.",
            "Subspace-based multi-view fusion for instance-level image retrieval.",
            "Estimating the fractal dimension of images using pixel range calculation technique.",
            "Acknowledgement to Reviewers 2020.",
            "Preface (Vol 37, Issue 4).",
            "Block dictionary learning-driven convolutional neural networks for fewshot face recognition.",
            "Dissimilarity-based nearest neighbor classifier for single-sample face recognition.",
            "FLAG: feature learning with additional guidance for person search.",
            "An effective recognition approach for contactless palmprint.",
            "MLK-SVD, the new approach in deep dictionary learning.",
            "Combining heterogeneous digital human simulations: presenting a novel co-simulation approach for incorporating different character animation technologies.",
            "Character motion in function space.",
            "3D skull and face similarity measurements based on a harmonic wave kernel signature.",
            "Matching a composite sketch to a photographed face using fused HOG and deep feature models.",
            "Computational design of polyomino puzzles.",
            "A skyline-based approach for mobile augmented reality.",
            "YOLO-face: a real-time face detector.",
            "A self-supervised method of single-image depth estimation by feeding forward information using max-pooling layers.",
            "Efficient object tracking using hierarchical convolutional features model and correlation filters.",
            "Modified artificial bee colony algorithms for solving multiple circle detection problem.",
            "Correction to: Automated recognition of 3D pipelines from point clouds.",
            "Correction to: Robust and blind image watermarking via circular embedding and bidimensional empirical mode decomposition.",
            "Correction to: Low-dose CT lung images denoising based on multiscale parallel convolution neural network.",
            "Preface (Vol 37, issue 5).",
            "Structure revealing of low-light images using wavelet transform based on fractional-order denoising and multiscale decomposition.",
            "Robust adaptive learning with Siamese network architecture for visual tracking.",
            "Optical effects on HDR calibration via a multiple exposure noise-based workflow.",
            "$\\hbox {C}^{2}$Net: a complementary co-saliency detection network.",
            "Back-projection-based progressive growing generative adversarial network for single image super-resolution.",
            "Image-selective segmentation model for multi-regions within the object of interest with application to medical disease.",
            "Automatic filter coefficient calculation in lifting scheme wavelet transform for lossless image compression.",
            "Compression of geometry videos by 3D-SPECK wavelet coder.",
            "A survey on online learning for visual tracking.",
            "Understanding deep face anti-spoofing: from the perspective of data.",
            "Correlation tracking with implicitly extending search region.",
            "3D human body skeleton extraction from consecutive surfaces using a spatial-temporal consistency model.",
            "Simple and fast image superpixels generation with color and boundary probability.",
            "Automatic 3D virtual fitting system based on skeleton driving.",
            "Online multi-object tracking with pedestrian re-identification and occlusion processing.",
            "FRNet: an end-to-end feature refinement neural network for medical image segmentation.",
            "Divided Voxels: an efficient algorithm for interactive cutting of deformable objects.",
            "Parametric fur from an image.",
            "A high-discriminative facial recognition method based on shape and grey-level appearances using landmark-points.",
            "Review of automated emotion-based quantification of facial expression in Parkinson's patients.",
            "A novel application framework for self-supporting topology optimization.",
            "Fuzzy local intensity clustering (FLIC) model for automatic medical image segmentation.",
            "Discriminative object tracking with subspace representation.",
            "Recognizing art work image from natural type: a deep adaptive depiction fusion method.",
            "Fast exposure fusion of detail enhancement for brightest and darkest regions.",
            "Preface (Vol 37, issue 6).",
            "Automatic classification of retinal blood vessels based on multilevel thresholding and graph propagation.",
            "Real-time multimodal ADL recognition using convolution neural networks.",
            "Real-time saliency detection for greyscale and colour images.",
            "Improving the tactile perception of image textures based on adjustable amplitude, frequency, and waveform.",
            "What we see in a photograph: content selection for image captioning.",
            "Improved human action recognition approach based on two-stream convolutional neural network model.",
            "Automatic detection of pulmonary nodules in CT images based on 3D Res-I network.",
            "Local binary hexagonal extrema pattern (LBHXEP): a new feature descriptor for fake iris detection.",
            "Radiometric model for plenoptic image formation.",
            "Automated recognition of 3D pipelines from point clouds.",
            "Novel approach for multimodal feature fusion to generate cancelable biometric.",
            "Multi-frame feature-fusion-based model for violence detection.",
            "Adaptive estimation of Hodge star operator on simplicial surfaces.",
            "Benchmarking commercial emotion detection systems using realistic distortions of facial image datasets.",
            "A contour self-compensated network for salient object detection.",
            "Extended visual cryptography-based copyright protection scheme for multiple images and owners using LBP-SURF descriptors.",
            "Underwater image compression using energy based adaptive block compressive sensing for IoUT applications.",
            "An improved landmark-driven and spatial-channel attentive convolutional neural network for fashion clothes classification.",
            "Instance-vote-based motion detection using spatially extended hybrid feature space.",
            "A new construction of an image edge detection mask based on Caputo-Fabrizio fractional derivative.",
            "Detection of defects in voltage-dependent resistors using stacked-block-based convolutional neural networks.",
            "(SARN)spatial-wise attention residual network for image super-resolution.",
            "Effects of individual's emotions on saliency and visual search.",
            "Efficient image dataset classification difficulty estimation for predicting deep-learning accuracy.",
            "Preface (vol 37, issue 7).",
            "Learning wavelet coefficients for face super-resolution.",
            "Overlapping region reconstruction in nuclei image segmentation.",
            "Text and graphics segmentation of newspapers printed in Gurmukhi script: a hybrid approach.",
            "Arbitrarily shaped Point Spread Function (PSF) estimation for single image blind deblurring.",
            "Auxiliary criterion conversion via spatiotemporal semantic encoding and feature entropy for action recognition.",
            "The improved image inpainting algorithm via encoder and similarity constraint.",
            "Remote sensing image colorization using symmetrical multi-scale DCGAN in YUV color space.",
            "RGB-D-based gaze point estimation via multi-column CNNs and facial landmarks global optimization.",
            "Instance-level 3D shape retrieval from a single image by hybrid-representation-assisted joint embedding.",
            "A new one-dimensional chaotic map and its application in a novel permutation-less image encryption scheme.",
            "Trajectory and image-based detection and identification of UAV.",
            "Language-invariant novel feature descriptors for handwritten numeral recognition.",
            "Semantic-aware label placement for augmented reality in street view.",
            "Two-stream spatiotemporal feature fusion for human action recognition.",
            "A deep neural network model for content-based medical image retrieval with multi-view classification.",
            "Single image deraining via deep shared pyramid network.",
            "A blind image watermarking scheme combining spatial domain and frequency domain.",
            "Interest points reduction using evolutionary algorithms and CBIR for face recognition.",
            "Low-rank decomposition on transformed feature maps domain for image denoising.",
            "Adaptive cropping and deskewing of scanned documents based on high accuracy estimation of skew angle and cropping value.",
            "A survey of modeling, rendering and animation of clouds in computer graphics.",
            "Keyframe-based multi-contact motion synthesis.",
            "Paradigm shifts in super-resolution techniques for remote sensing applications.",
            "A novel method for reconstructing general 3D curves from stereo images.",
            "A framework for facial age progression and regression using exemplar face templates.",
            "FPGA-based infrared image deblurring using angular position of IR detector.",
            "Preface (Vol 37, issue 8).",
            "Physically inspired technique for modeling wet absorbent materials.",
            "Salient object detection from low contrast images based on local contrast enhancing and non-local feature learning.",
            "Deep learning-based image de-raining using discrete Fourier transformation.",
            "A secure visual secret sharing (VSS) scheme with CNN-based image enhancement for underwater images.",
            "A presentation and retrieval hash scheme of images based on principal component analysis.",
            "Scale and density invariant head detection deep model for crowd counting in pedestrian crowds.",
            "VEFP: visual evaluation of flight procedure in airport terminal.",
            "Computer-aided diagnostic network for brain tumor classification employing modulated Gabor filter banks.",
            "Enhanced holoentropy-based encoding via whale optimization for highly efficient video coding.",
            "Three-view generation based on a single front view image for car.",
            "Measurement and rendering of complex non-diffuse and goniochromatic packaging materials.",
            "Background segmentation in multicolored illumination environments.",
            "Skeleton extraction from point clouds of trees with complex branches via graph contraction.",
            "Self-supervised deep subspace clustering network for faces in videos.",
            "The relationship between curvilinear structure enhancement and ridge detection methods.",
            "$\\hbox {S}^2\\hbox {RGAN}$: sonar-image super-resolution based on generative adversarial network.",
            "An investigation of the influence of age on eye fatigue and hand operation performance in a virtual environment.",
            "Facial emotion recognition using subband selective multilevel stationary wavelet gradient transform and fuzzy support vector machine.",
            "The application of interactive methods under swarm computing and artificial intelligence in image retrieval and personalized analysis.",
            "Learning color space adaptation from synthetic to real images of cirrus clouds.",
            "A color watermarking scheme in frequency domain based on quaternary coding.",
            "Dual adaptive deep convolutional neural network for video forgery detection in 3D lighting environment.",
            "DSHPoolF: deep supervised hashing based on selective pool feature map for image retrieval.",
            "Fundus image-based cataract classification using a hybrid convolutional and recurrent neural network.",
            "Low-dose CT lung images denoising based on multiscale parallel convolution neural network.",
            "Joint information fusion and multi-scale network model for pedestrian detection.",
            "Preface the visual computer (vol 37 issues 09-11).",
            "Tetrahedra of varying density and their applications.",
            "Stripped halfedge data structure for parallel computation of arrangements of segments.",
            "Handling gaps for vector graphics coloring.",
            "Variational progressive-iterative approximation for RBF-based surface reconstruction.",
            "Binary space partitioning visibility tree for polygonal and environment light rendering.",
            "Denoising Monte Carlo renderings via a multi-scale featured dual-residual GAN.",
            "Towards Stereoscopic On-vehicle AR-HUD.",
            "Efficient real-time dynamic diffuse global illumination using signed distance fields.",
            "Automatic embroidery texture synthesis for garment design and online display.",
            "Self-supervised monocular depth estimation based on image texture detail enhancement.",
            "Real-time simulation of accommodation and low-order aberrations of the human eye using light-gathering trees.",
            "Edge-based procedural textures.",
            "A flux-interpolated advection scheme for fluid simulation.",
            "Physically based modeling and rendering of avalanches.",
            "Real-time simulation of violent boiling in concentrated sulfuric acid dilution.",
            "LetterVis: a letter-space view of clinic letters.",
            "GPSD: generative parking spot detection using multi-clue recovery model.",
            "Multi-domain collaborative feature representation for robust visual object tracking.",
            "Analysis of charisma, comfort and realism in CG characters from a gender perspective.",
            "3D hand reconstruction from a single image based on biomechanical constraints.",
            "Residual connection-based graph convolutional neural networks for gait recognition.",
            "Be water my friend: mesh assimilation.",
            "Real-time surface manipulation with C1 continuity through simple and efficient physics-based deformations.",
            "A practical and efficient model for intensity calibration of multi-light image collections.",
            "Fast occlusion-based point cloud exploration.",
            "Toward virtual stair walking.",
            "Underwater sound propagation for virtual environments.",
            "Spherical panorama compositing through depth estimation.",
            "Evaluating virtual reality locomotion interfaces on collision avoidance task with a virtual character.",
            "A novel robust zero-watermarking algorithm for medical images.",
            "Unsupervised face super-resolution via gradient enhancement and semantic guidance.",
            "Camera focal length from distances in a single image.",
            "Denoising with discrete Morse theory.",
            "Generative character inpainting guided by structural information.",
            "Adaptive semantic attribute decoupling for precise face image editing.",
            "Preface the visual computer (Vol 37 issues 12).",
            "A new renaissance for creativity in technology and the arts in the context of virtual worlds.",
            "Image and video processing on mobile devices: a survey.",
            "FORSETI: a visual analysis environment for authoring autopsy reports in extended legal medicine mark-up language.",
            "Grid-induced bounding volume hierarchy for ray tracing dynamic scenes.",
            "The effect of geometry and illumination on appearance perception of different material categories.",
            "Formalization of Kublai Khan's globalization using Kunii's incrementally modular abstraction hierarchy.",
            "Image recoloring for color vision deficiency compensation: a survey.",
            "Can a humanoid social robot stimulate the interactivity of cognitively impaired elderly? A thorough study based on computer vision methods.",
            "Visual analysis of geospatial multivariate data for investigating radioactive deposition processes.",
            "Fast and faithful scale-aware image filters.",
            "Human factors evaluation in VR-based shunting training.",
            "A history of crowd simulation: the past, evolution, and new perspectives.",
            "Detection and segmentation of image anomalies based on unsupervised defect reparation.",
            "Color2Hatch: conversion of color to hatching for low-cost printing.",
            "Multi-agent reinforcement learning for character control.",
            "Directional selectivity in panoramic and pantophonic interfaces: Flashdark, Narrowcasting for Stereoscopic Photospherical Cinemagraphy, Akabeko Ensemble.",
            "Efficient ray casting polygonized isosurface of binary volumes."
        ]
    },
    {
        "name": "TVC",
        "year": "2020",
        "info": "Volume 36, 2020",
        "count": 183,
        "papers": [
            "Welcome to the year 2020.",
            "Preface.",
            "3D indirect shape retrieval based on hand interaction.",
            "A block-based RDWT-SVD image watermarking method using human visual system characteristics.",
            "Learning a convolutional neural network for propagation-based stereo image segmentation.",
            "Automatic procedural model generation for 3D object variation.",
            "Image enhancement with naturalness preservation.",
            "Surface defect saliency of magnetic tile.",
            "Fast facial expression recognition using local binary features and shallow neural networks.",
            "Preparation and enhancement of 3D laser scanner data for realistic coloured BIM models.",
            "A machine learning framework for full-reference 3D shape quality assessment.",
            "Adversarial learning for modeling human motion.",
            "Geometric statistics-based descriptor for 3D ear recognition.",
            "A novel approach for scale and rotation adaptive estimation based on time series alignment.",
            "Tight lower bound on transmission for single image dehazing.",
            "Calipso: physics-based image and video editing through CAD model proxies.",
            "Correction to: Wire cut of double-sided minimal surfaces.",
            "Correction to: DeepLight: light source estimation for augmented reality using deep learning.",
            "Acknowledgement to reviewers 2019.",
            "Preface.",
            "Light field variational estimation using a light field formation model.",
            "Search inliers based on redundant geometric constraints.",
            "A microfacet-based BRDF for the accurate and efficient rendering of high-definition specular normal maps.",
            "Pattern recognition based on compound complex shape-invariant Radon transform.",
            "Endpoint fusing method of online freehand-sketched polyhedrons.",
            "Joint learning of image detail and transmission map for single image dehazing.",
            "Photographic style transfer.",
            "Texture-guided depth upsampling using Bregman split: a clustering graph-based approach.",
            "Building hierarchical structures for 3D scenes with repeated elements.",
            "A practical methodology for computer-aided design of custom 3D printable casts for wrist fractures.",
            "Facial expression recognition with convolutional neural networks via a new face cropping and rotation strategy.",
            "Using CNN for facial expression recognition: a study of the effects of kernel size and number of filters on accuracy.",
            "Four points: one-pass geometrical camera calibration algorithm.",
            "Long-term correlation tracking via spatial-temporal context.",
            "Preface.",
            "Micro-expression recognition: an updated review of current trends, challenges and solutions.",
            "Joint learning of visual and spatial features for edit propagation from a single image.",
            "Facial expression recognition algorithm based on parameter adaptive initialization of CNN and LSTM.",
            "Deep convolutional BiLSTM fusion network for facial expression recognition.",
            "Part-based visual tracking with spatially regularized correlation filters.",
            "Facial emotion detection using modified eyemap-mouthmap algorithm on an enhanced image and classification with tensorflow.",
            "Data compression for measured heterogeneous subsurface scattering via scattering profile blending.",
            "Classification of basic artistic media based on a deep convolutional approach.",
            "Dynamic texture recognition using local tetra pattern - three orthogonal planes (LTrP-TOP).",
            "Candidate-based matching of 3-D point clouds with axially switching pose estimation.",
            "Crowd anomaly detection and localization using histogram of magnitude and momentum.",
            "Skeleton-based action recognition by part-aware graph convolutional networks.",
            "Face detection and tracking using hybrid margin-based ROI techniques.",
            "NLME: a nonlinear motion estimation-based compression method for animated mesh sequence.",
            "Preface.",
            "An automatic 3D registration method for rock mass point clouds based on plane detection and polygon matching.",
            "A robust visual tracking method via local feature extraction and saliency detection.",
            "Real-time object tracking based on an adaptive transition model and extended Kalman filter to handle full occlusion.",
            "Simultaneous segmentation and correction model for color medical and natural images with intensity inhomogeneity.",
            "Multidimensional virtual reality-MVR method: a new method of visualization of multidimensional worlds.",
            "Dual-modality spatiotemporal feature learning for spontaneous facial expression recognition in e-learning using hybrid deep neural network.",
            "Kinetic locally minimal triangulation: theoretical evaluation and combinatorial analysis.",
            "Three-dimensional salient point detection based on the Laplace-Beltrami eigenfunctions.",
            "Maximum spatial-temporal isometric cluster for dynamic surface correspondence.",
            "Transformation of portraits to Picasso's cubism style.",
            "Hybrid 3D mass-spring system for simulation of isotropic materials with any Poisson's ratio.",
            "Robust dense correspondence using deep convolutional features.",
            "Salient object detection via hybrid upsampling and hybrid loss computing.",
            "Compact and intuitive data-driven BRDF models.",
            "Preface.",
            "Glioma extraction from MR images employing Gradient Based Kernel Selection Graph Cut technique.",
            "ISPH-PBD: coupled simulation of incompressible fluids and deformable bodies.",
            "CityCraft: 3D virtual city creation from a single image.",
            "Interactive influences of color attributes on color perception bias.",
            "A new multi-secret image sharing scheme based on DCT.",
            "4D facial expression recognition using multimodal time series analysis of geometric landmark-based deformations.",
            "Noise-tolerant texture feature extraction through directional thresholded local binary pattern.",
            "Segmentation of crowd flow by trajectory clustering in active contours.",
            "Air-writing recognition system for Persian numbers with a novel classifier.",
            "Using pseudo voxel octree to accelerate collision between cutting tool and deformable objects modeled as linked voxels.",
            "Compressing animated meshes with fine details using local spectral analysis and deformation transfer.",
            "Survey of cube mapping methods in interactive computer graphics.",
            "A review of monocular visual odometry.",
            "A comprehensive survey on automatic facial action unit analysis.",
            "Preface.",
            "Cancelable multi-biometric recognition system based on deep learning.",
            "HDR image retrieval by using color-based descriptor and tone mapping operator.",
            "DTW-CNN: time series-based human interaction prediction in videos using CNN-extracted features.",
            "Pattern understanding and synthesis based on layout tree descriptor.",
            "Fast and sub-pixel precision target tracking algorithm for intelligent dual-resolution camera.",
            "Visual tracking tracker via object proposals and co-trained kernelized correlation filters.",
            "Fast two-stage segmentation model for images with intensity inhomogeneity.",
            "A personalized traffic simulation integrating emotion using a driving simulator.",
            "End-to-end deep metric network for visual tracking.",
            "Deep motion templates and extreme learning machine for sign language recognition.",
            "Physics-preserving fluid reconstruction from monocular video coupling with SFS and SPH.",
            "Correction to: Physics-preserving fluid reconstruction from monocular coupling with SFS and SPH.",
            "3D RANs: 3D Residual Attention Networks for action recognition.",
            "Integrating global and local image features for enhanced loop closure detection in RGB-D SLAM systems.",
            "Classification of priors and regularization techniques appurtenant to single image super-resolution.",
            "Preface.",
            "Automatic semantic style transfer using deep convolutional neural networks and soft masks.",
            "Learning semantic dependencies with channel correlation for multi-label classification.",
            "Literature Explorer: effective retrieval of scientific documents through nonparametric thematic topic detection.",
            "Image saliency detection via multi-scale iterative CNN.",
            "Automatic darkest filament detection (ADFD): a new algorithm for crack extraction on two-dimensional pavement images.",
            "Deep generative smoke simulator: connecting simulated and real data.",
            "3D human pose estimation by depth map.",
            "Depth image upsampling based on guided filter with low gradient minimization.",
            "Saliency bagging: a novel framework for robust salient object detection.",
            "Human position and head direction tracking in fisheye camera using randomized ferns and fisheye histograms of oriented gradients.",
            "Action matching network: open-set action recognition using spatio-temporal representation matching.",
            "Support vector regression-based 3D-wavelet texture learning for hyperspectral image compression.",
            "OP-MR: the implementation of order picking based on mixed reality in a smart warehouse.",
            "Tracking and frame-rate enhancement for real-time 2D human pose estimation.",
            "Fuzzy weighted sparse reconstruction error-steered semi-supervised learning for face recognition.",
            "Video-based social behavior recognition based on kernel relevance analysis.",
            "GSPnP: simple and geometric solution for PnP problem.",
            "Gestural flick input-based non-touch interface for character input.",
            "Single-image super-resolution via patch-based and group-based local smoothness modeling.",
            "Blind motion deblurring with cycle generative adversarial networks.",
            "High-performance intra-mode accelerator for HEVC.",
            "Two-attribute e-commerce image classification based on a convolutional neural network.",
            "Improved curriculum learning using SSM for facial expression recognition.",
            "Generation of crowd arrival and destination locations/times in complex transit facilities.",
            "Latent transformations neural network for object view synthesis.",
            "Structured dictionary learning using mixed-norms and group-sparsity constraint.",
            "Bilateral counting network for single-image object counting.",
            "Recent advances in shape correspondence.",
            "Preface.",
            "Point set registration based on feature point constraints.",
            "Computer-aided superimposition via reconstructing and matching 3D faces to 3D skulls for forensic craniofacial identifications.",
            "Effect of layer-wise fine-tuning in magnification-dependent classification of breast cancer histopathological image.",
            "Fine-grained action recognition using multi-view attentions.",
            "A new TLD target tracking method based on improved correlation filter and adaptive scale.",
            "DRCDN: learning deep residual convolutional dehazing networks.",
            "Weakly supervised deep network for spatiotemporal localization and detection of human actions in wild conditions.",
            "Robust salient object detection for RGB images.",
            "Video stitching based on multi-view spatiotemporal feature points and grid-based matching.",
            "Multi-level colored directional motif histograms for content-based image retrieval.",
            "An integrated approach for medical abnormality detection using deep patch convolutional neural networks.",
            "A novel deep network and aggregation model for saliency detection.",
            "Residual feature pyramid networks for salient object detection.",
            "An improved correlation filter tracking method with occlusion and drift handling.",
            "Correction to: An improved correlation filter tracking method with occlusion and drift handling.",
            "Preface the Visual Computer (vol 36 issues 10-12).",
            "Immersive analysis of user motion in VR applications.",
            "Unveiling the implicit knowledge, one scenario at a time.",
            "Immersive visual scripting based on VR software design patterns for experiential training.",
            "LinSSS: linear decomposition of heterogeneous subsurface scattering for real-time screen-space rendering.",
            "Rasterisation-based progressive photon mapping.",
            "Simulation of multi-solvent stains on textile.",
            "Structure-preserving image smoothing with semantic cues.",
            "Constant-time energy-normalization for the Phong specular BRDFs.",
            "Position-based augmented reality platform for aiding construction and inspection of offshore plants.",
            "Collaborative SLAM and AR-guided navigation for floor layout inspection.",
            "SafeXR: alerting walking persons to obstacles in mobile XR environments.",
            "A new storytelling genre: combining handicraft elements and storytelling via mixed reality technology.",
            "Accurate estimation of feature points based on individual projective plane in video sequence.",
            "Unsupervised video-to-video translation with preservation of frame modification tendency.",
            "Audio-visual object removal in 360-degree videos.",
            "Deep color transfer using histogram analogy.",
            "Feature-attention module for context-aware image-to-image translation.",
            "Neural reflectance transformation imaging.",
            "Shading-aware shadow detection and removal from a single image.",
            "Simplified non-locally dense network for single-image dehazing.",
            "Robust and blind image watermarking via circular embedding and bidimensional empirical mode decomposition.",
            "Real-time dense 3D reconstruction and camera tracking via embedded planes representation.",
            "3D hand mesh reconstruction from a monocular RGB image.",
            "A fast solution for Chinese calligraphy relief modeling from 2D handwriting image.",
            "Modeling rocky scenery using implicit blocks.",
            "AutoBiomes: procedural generation of multi-biome landscapes.",
            "Real-time hyper-amplification of planets.",
            "Robust turbulence simulation for particle-based fluids using the Rankine vortex model.",
            "A density-accurate tracking solution for smoke upresolution.",
            "A completely parallel surface reconstruction method for particle-based fluids.",
            "OLBVH: octree linear bounding volume hierarchy for volumetric meshes.",
            "Relaxing topological surfaces in four dimensions.",
            "Valence optimization and angle improvement for molecular surface remeshing.",
            "ST Sequence Miner: visualization and mining of spatio-temporal event sequences.",
            "Visual simulation of weathering coated metallic objects.",
            "AestheticNet: deep convolutional neural network for person identification from visual aesthetic.",
            "PGCNet: patch graph convolutional network for point cloud segmentation of indoor scenes.",
            "Segmentation of unbalanced and in-homogeneous point clouds and its application to 3D scanned trees.",
            "STA-GCN: two-stream graph convolutional network with spatial-temporal attention for hand gesture recognition.",
            "Feel the inside: A haptic interface for navigating stress distribution inside objects.",
            "Shape correspondence based on Kendall shape space and RAG for 2D animation.",
            "Dense feature pyramid network for cartoon dog parsing."
        ]
    },
    {
        "name": "TVC",
        "year": "2019",
        "info": "Volume 35, 2019",
        "count": 141,
        "papers": [
            "Welcome to the year 2019.",
            "Preface.",
            "No reference noise estimation in digital images using random conditional selection and sampling theory.",
            "Cubic norm and kernel-based bi-directional PCA: toward age-aware facial kinship verification.",
            "A human-computer interface for wrist rehabilitation: a pilot study using commercial sensors to detect wrist movements.",
            "Role of normalization of breast thermogram images and automatic classification of breast cancer.",
            "3D object recognition using scale-invariant features.",
            "Structure-preserving image completion with multi-level dynamic patches.",
            "A self-calibrated photo-geometric depth camera.",
            "Color image denoising via monogenic matrix-based sparse representation.",
            "Handling pure camera rotation in semi-dense monocular SLAM.",
            "Patch-based self-adaptive matting for high-resolution image and video.",
            "Preface.",
            "Wavelet frame-based image restoration using sparsity, nonlocal, and support prior of frame coefficients.",
            "Inverse appearance modeling of interwoven cloth.",
            "GeoBrick: exploration of spatiotemporal data.",
            "WpmDecolor: weighted projection maximum solver for contrast-preserving decolorization.",
            "Procedural modeling of rivers from single image toward natural scene production.",
            "Multiple feature subspaces analysis for single sample per person face recognition.",
            "An efficient stereo matching based on fragment matching.",
            "Deep 3D semantic scene extrapolation.",
            "Effective NC machining simulation with OptiX ray tracing engine.",
            "Motion rank: applying page rank to motion data search.",
            "Preface.",
            "Real-time ultra-high definition multiview glasses-free 3D display system.",
            "3D color homography model for photo-realistic color transfer re-coding.",
            "Camera-trap images segmentation using multi-layer robust principal component analysis.",
            "Online learning and detection of faces with low human supervision.",
            "Objectness-based smoothing stochastic sampling and coherence approximate nearest neighbor for visual tracking.",
            "SSG: superpixel segmentation and GrabCut-based salient object segmentation.",
            "Cascading classifier with discriminative multi-features for a specific 3D object real-time detection.",
            "A novel point-line duality feature for trajectory classification.",
            "Video style transfer by consistent adaptive patch sampling.",
            "A survey on deep neural network-based image captioning.",
            "Preface.",
            "Scene classification-oriented saliency detection via the modularized prescription.",
            "Histograms of Gaussian normal distribution for 3D feature matching in cluttered scenes.",
            "Action snapshot with single pose and viewpoint.",
            "Patch-based detection of dynamic objects in CrowdCam images.",
            "Emotion information visualization through learning of 3D morphable face model.",
            "A draw call-oriented approach for visibility of static and dynamic scenes with large number of triangles.",
            "Fast example searching for input-adaptive data-driven dehazing with Gaussian process regression.",
            "An optimized source term formulation for incompressible SPH.",
            "Improving bag-of-poses with semi-temporal pose descriptors for skeleton-based action recognition.",
            "Importance-based approach for rough drawings.",
            "Preface.",
            "Efficient multi-plane extraction from massive 3D points for modeling large-scale urban scenes.",
            "Cost-effective printing of 3D objects with self-supporting property.",
            "Caricature synthesis with feature deviation matching under example-based framework.",
            "TOP-SIFT: the selected SIFT descriptor based on dictionary learning.",
            "Image classification by combining local and global features.",
            "Correction of overexposure utilizing haze removal model and image fusion technique.",
            "Photon mapping with visible kernel domains.",
            "Automatic identification and behavioral analysis of phlebotomine sand flies using trajectory features.",
            "Visualizing large graphs by layering and bundling graph edges.",
            "Convolutional neural networks for crowd behaviour analysis: a survey.",
            "Preface (Vol 35, Issue 6, 7, 8).",
            "Expressive facial style transfer for personalized memes mimic.",
            "Joint bilateral propagation upsampling for unstructured multi-view stereo.",
            "Image-based translucency transfer through correlation analysis over multi-scale spatial color distribution.",
            "Stereoscopic image stitching with rectangular boundaries.",
            "Multiresolution visualization of massive black oil reservoir models.",
            "Interactive animation generation of virtual characters using single RGB-D camera.",
            "Real-time simulation of electrocautery procedure using meshfree methods in laparoscopic cholecystectomy.",
            "DeepLight: light source estimation for augmented reality using deep learning.",
            "AniCode: authoring coded artifacts for network-free personalized animations.",
            "Acquiring periodic tilings of regular polygons from images.",
            "Image-driven unsupervised 3D model co-segmentation.",
            "Minkowski sum computation for planar freeform geometric models using $$G^1$$ G 1 -biarc approximation and interior disk culling.",
            "Huber- L1-based non-isometric surface registration.",
            "A lightweight methodology of 3D printed objects utilizing multi-scale porous structures.",
            "Generating signed distance fields on the GPU with ray maps.",
            "Retrieval of spatial-temporal motion topics from 3D skeleton data.",
            "Weighted superpixel segmentation.",
            "Deep binocular tone mapping.",
            "TimeCluster: dimension reduction applied to temporal data for visual analytics.",
            "Depth-aware image vectorization and editing.",
            "Density-based label placement.",
            "Processing images for red-green dichromats compensation via naturalness and information-preservation considered recoloring.",
            "The Visual SuperTree: similarity-based multi-scale visualization.",
            "Blind image deblurring with reinforced use of edges.",
            "Effective shadow removal via multi-scale image decomposition.",
            "Building anatomically realistic jaw kinematics model from data.",
            "CrowdEst: a method for estimating (and not simulating) crowd evacuation parameters in generic environments.",
            "Precomputed optimal one-hop motion transition for responsive character animation.",
            "Efficient convolutional hierarchical autoencoder for human motion prediction.",
            "Stylistic scene enhancement GAN: mixed stylistic enhancement generation for 3D indoor scenes.",
            "Deep similarity network fusion for 3D shape classification.",
            "Example-based rapid generation of vegetation on terrain via CNN-based distribution learning.",
            "Intelligent Chinese calligraphy beautification from handwritten characters for robotic writing.",
            "Preface.",
            "ASPIRE: Automatic scanner position reconstruction.",
            "Physically based modeling and animation of landslides with MPM.",
            "The novel part-based cascaded regression algorithm research combining with pose estimation.",
            "User-centric QoE model of visual perception for mobile videos.",
            "A novel deep hashing method for fast image retrieval.",
            "Double chaotic image encryption algorithm based on optimal sequence solution and fractional transform.",
            "Real-time smoke simulation based on vorticity preserving lattice Boltzmann method.",
            "Optimized minimal path selection (OMPS) method for automatic and unsupervised crack segmentation within two-dimensional pavement images.",
            "Optimal mass transport based brain morphometry for patients with congenital hand deformities.",
            "NIR and VW iris image recognition using ensemble of patch statistics features.",
            "Preface.",
            "Two-dimensional line segment-triangle intersection test: revision and enhancement.",
            "Multi-label image classification with recurrently learning semantic dependencies.",
            "A local image descriptor based on radial and angular gradient intensity histogram for blurred image matching.",
            "Fingerprint liveness detection using local quality features.",
            "Human motions and emotions recognition inspired by LMA qualities.",
            "Disparity estimation in stereo video sequence with adaptive spatiotemporally consistent constraints.",
            "Revisiting correlation-based filters for low-resolution and long-term visual tracking.",
            "Mandible and skull segmentation in cone beam computed tomography using super-voxels and graph clustering.",
            "Construction of a flexible and scalable 4D light field camera array using Raspberry Pi clusters.",
            "Augmenting photographs with textures using the Laplacian pyramid.",
            "Preface.",
            "An enhanced sweep and prune algorithm for multi-body continuous collision detection.",
            "Development and evaluation of a self-training system for tennis shots with motion feature assessment and visualization.",
            "Locally controllable neural style transfer on mobile devices.",
            "Low-rank and sparse matrix decomposition via the truncated nuclear norm and a sparse regularizer.",
            "PolarViz: a discriminating visualization and visual analytics tool for high-dimensional data.",
            "MSANet: multimodal self-augmentation and adversarial network for RGB-D object recognition.",
            "A unified model for human activity recognition using spatial distribution of gradients and difference of Gaussian kernel.",
            "Unified convolutional neural network for direct facial keypoints detection.",
            "Rolling bilateral filter-based text image deblurring.",
            "Object tracking based on Huber loss function.",
            "Modeling coverage with semantic embedding for image caption generation.",
            "Hand-drawn grayscale image colorful colorization based on natural image.",
            "A novel multi-graph framework for salient object detection.",
            "Preface.",
            "Description generation of open-domain videos incorporating multimodal features and bidirectional encoder.",
            "A gait skeleton model extraction method based on the fusion between vision and tactility.",
            "Emotion-based diversity crowd behavior simulation in public emergency.",
            "An efficient FLIP and shape matching coupled method for fluid-solid and two-phase fluid simulations.",
            "Super-resolution image reconstruction using fractional-order total variation and adaptive regularization parameters.",
            "Motion energy image for evaluation of video stabilization.",
            "Weighted two-step aggregated VLAD for image retrieval.",
            "Linearized kernel dictionary learning with group sparse priors for action recognition.",
            "On the use of local ray termination for efficiently constructing qualitative BSPs, BIHs and (S)BVHs.",
            "An asynchronous method for cloud-based rendering.",
            "Point sets joint registration and co-segmentation.",
            "Visual simulation of a capsizing ship in stormy weather condition.",
            "A unified framework for interactive image segmentation via Fisher rules.",
            "Total generalized variation and wavelet frame-based adaptive image restoration algorithm."
        ]
    },
    {
        "name": "TVC",
        "year": "2018",
        "info": "Volume 34, 2018",
        "count": 140,
        "papers": [
            "Welcome to the year 2018.",
            "Preface.",
            "A fast voxelization algorithm for trilinearly interpolated isosurfaces.",
            "Multimodal non-rigid image registration based on elastodynamics.",
            "Motion normalization method based on an inverted pendulum model for clustering.",
            "Coupled-layer based visual tracking via adaptive kernelized correlation filters.",
            "Point-pattern matching based on point pair local topology and probabilistic relaxation labeling.",
            "Superpixel-based color-depth restoration and dynamic environment modeling for Kinect-assisted image-based rendering systems.",
            "Constant time texture filtering.",
            "A survey on algorithms of hole filling in 3D surface reconstruction.",
            "Real-time dissection of organs via hybrid coupling of geometric metaballs and physics-centric mesh-free method.",
            "Compressed sensing image reconstruction via adaptive sparse nonlocal regularization.",
            "Acknowledgments to reviewers 2017.",
            "Preface.",
            "Detection of complex video events through visual rhythm.",
            "An evaluation of power transfer functions for HDR video compression.",
            "Anubhav: recognizing emotions through facial expression.",
            "Correspondence-free pose estimation for 3D objects from noisy depth data.",
            "Hand tracking with physiological constraints.",
            "Classification of gait anomalies from kinect.",
            "Distance field guided $$L_1$$ L 1 -median skeleton extraction.",
            "Grasp planning via hand-object geometric fitting.",
            "New advances for haptic rendering: state of the art.",
            "A survey on face modeling: building a bridge between face analysis and synthesis.",
            "Preface.",
            "Local-to-global mesh saliency.",
            "Real-time dynamic reflections for realistic rendering of 3D scenes.",
            "Animating pictures of water scenes using video retrieval.",
            "Style-based biped walking control.",
            "3D reconstruction framework via combining one 3D scanner and multiple stereo trackers.",
            "Motion keypoint trajectory and covariance descriptor for human action recognition.",
            "Evaluation of X-ray visualization techniques for vertical depth judgments in underground exploration.",
            "Space-time image layout.",
            "Content-aware image resizing using quasi-conformal mapping.",
            "Approximations for the distribution of microflake normals.",
            "Preface.",
            "Physics-inspired approach to realistic and stable water spray with narrowband air particles.",
            "Salient object detection via compactness and objectness cues.",
            "Detecting and inferring repetitive elements with accurate locations and shapes from façades.",
            "Efficient oriented particle arrangements for position-based dynamics simulation.",
            "Reflection reprojection using temporal coherence.",
            "Uncertainty visualization for variable associations analysis.",
            "Adaptive rendering based on robust principal component analysis.",
            "INPAC: INdependent PAss Coding algorithm for robust image data transmission through low SNR channels.",
            "Natural image noise level estimation based on local statistics for blind noise reduction.",
            "Removing Monte Carlo noise using a Sobel operator and a guided image filter.",
            "Preface.",
            "PhotoSketch: a photocentric urban 3D modeling system.",
            "Robust cost function for optimizing chamfer masks.",
            "Exploring hidden coherency of Ray-Tracing for heterogeneous systems using online feedback methodology.",
            "Salient object detection based on Laplacian similarity metrics.",
            "A self-adaptive segmentation method for a point cloud.",
            "Single image dehazing using second-generation wavelet transforms and the mean vector L2-norm.",
            "A modified ZS thinning algorithm by a hybrid approach.",
            "Rotation-invariant object detection using Sector-ring HOG and boosted random ferns.",
            "A novel unconditionally stable explicit integration method for finite element method.",
            "Multi-class indoor semantic segmentation with deep structured model.",
            "Preface (Vol 34, Issue 6, 7, 8).",
            "Real-time 3D scene reconstruction with dynamically moving object using a single depth camera.",
            "A framework for developing and benchmarking sampling and denoising algorithms for Monte Carlo rendering.",
            "Implicit surfaces from polygon soup with compactly supported radial basis functions.",
            "3D braid guide hair reconstruction using electroluminescent wires.",
            "Evaluating physical and rendered material appearance.",
            "An image-based method for animated stroke rendering.",
            "Point-based rendering enhancement via deep learning.",
            "Multiple importance sampling characterization by weighted mean invariance.",
            "Hybrid Lighting for faster rendering of scenes with many lights.",
            "Incremental Voronoi sets for instant stippling.",
            "A detailed study of ray tracing performance: render time and energy cost.",
            "Time-scaled interactive object-driven multi-party VR.",
            "Real-time camera pose estimation via line tracking.",
            "A VR-based user study on the effects of vision impairments on recognition distances of escape-route signs in buildings.",
            "Navigation in AR based on digital replicas.",
            "Deformation simulation based on model reduction with rigidity-guided sampling.",
            "Locally refinable gradient meshes supporting branching and sharp colour transitions - Towards a more versatile vector graphics primitive.",
            "Robust normal estimation in unstructured 3D point clouds by selective normal space exploration.",
            "Offsetting spherical curves in vector and raster form.",
            "Wire cut of double-sided minimal surfaces.",
            "Efficiently consistent affinity propagation for 3D shapes co-segmentation.",
            "Carve in, carve out: a bimodal carving through voxelization and functional partitioning.",
            "Rigid registration of noisy point clouds based on higher-dimensional error metrics.",
            "Visual attention prediction for images with leading line structure.",
            "Dual-Path Adversarial Learning for Fully Convolutional Network (FCN)-Based Medical Image Segmentation.",
            "Hand joints-based gesture recognition for noisy dataset using nested interval unscented Kalman filter with LSTM network.",
            "Efficient image super-resolution integration.",
            "Learning to restore deteriorated line drawing.",
            "Cross-table linking and brushing: interactive visual analysis of multiple tabular data sets.",
            "Contrast preserving image decolorization combining global features and local semantic features.",
            "Direction estimation of moving pedestrian groups for intelligent vehicles.",
            "Perceptual evaluation of maneuvering motion illusion for virtual pedestrians.",
            "MCAEM: mixed-correlation analysis-based episodic memory for companion-user interactions.",
            "Preface.",
            "Detail-preserved real-time hand motion regression from depth.",
            "Lens flare prediction based on measurements with real-time visualization.",
            "DepthCut: improved depth edge estimation using multiple unreliable channels.",
            "3D cartoon face rigging from sparse examples.",
            "VIAL: a unified process for visual interactive labeling.",
            "Visual analysis of retinal changes with optical coherence tomography.",
            "Making machine intelligence less scary for criminal analysts: reflections on designing a visual comparative case analysis tool.",
            "Is gender encoded in the smile? A computational framework for the analysis of the smile driven dynamic face for gender recognition.",
            "Virtual reality's effect on parameter optimisation for crowd-sourced procedural animation.",
            "FiVES: an aspect-oriented approach for shared virtual environments in the web.",
            "Preface.",
            "Automatic skinning and weight retargeting of articulated characters using extended position-based dynamics.",
            "Video abstraction using density-based clustering algorithm.",
            "Multi-scale counting and difference representation for texture classification.",
            "Point-wise saliency detection on 3D point clouds via covariance descriptors.",
            "Propagation-based marching cubes algorithm using open boundary loop.",
            "Poisson noise removal of images on graphs using tight wavelet frames.",
            "Reassembly of fractured objects using surface signature.",
            "Stroke-based splatting: an efficient multi-resolution point cloud visualization technique.",
            "A robust non-rigid point set registration method based on inhomogeneous Gaussian mixture models.",
            "Intermediate shadow maps for interactive many-light rendering.",
            "Extremal curves and surfaces in symmetric tensor fields.",
            "3D reconstruction system based on incremental structure from motion using a camera with varying parameters.",
            "Learning deep facial expression features from image and optical flow sequences using 3D CNN.",
            "Preface.",
            "An interpolation method for strong barrel lens distortion.",
            "A generic tool for interactive complex image editing.",
            "Reconstructing three-dimensional models of objects using a Kinect sensor.",
            "Automatic identification of butterfly species based on HoMSC and GLCMoIB.",
            "Spatial pyramid face feature representation and weighted dissimilarity matching for improved face recognition.",
            "Multi-view photometric stereo using surface deformation.",
            "A PDE patch-based spectral method for progressive mesh compression and mesh denoising.",
            "2DIGH: a polar invariant local image descriptor based on joint histogram.",
            "A new two-stage mesh surface segmentation method.",
            "Review on the effects of age, gender, and race demographics on automatic face recognition.",
            "Preface.",
            "An improved topology extraction approach for vectorization of sketchy line drawings.",
            "Estimation of differential quantities using Hermite RBF interpolation.",
            "Natural image noise removal using nonlocal means and hidden Markov models in transform domain.",
            "Early diagnosis of cirrhosis via automatic location and geometric description of liver capsule.",
            "Deeper cascaded peak-piloted network for weak expression recognition.",
            "How do deep convolutional features affect tracking performance: an experimental study.",
            "Explicit design of transfer functions for volume-rendered images by combining histograms, thumbnails, and sketch-based interaction.",
            "Style-based motion analysis for dance composition.",
            "Continuous wavelet transform-based no-reference quality assessment of deblocked images.",
            "Direct visualization of cryptographic keys for enhanced security.",
            "Co-segmentation for space-time co-located collections.",
            "Efficient spectral reconstruction using a trichromatic camera via sample optimization."
        ]
    },
    {
        "name": "TVC",
        "year": "2017",
        "info": "Volume 33, 2017",
        "count": 133,
        "papers": [
            "Welcome to the year 2017.",
            "Preface.",
            "Adaptive highlights stencils for modeling of multi-axial BRDF anisotropy - An alternative to analytical anisotropic BRDF modeling.",
            "A comprehensive framework for modeling heterogeneous objects.",
            "Artistic relighting of paintings and drawings.",
            "An experimental study on the effects of shading in 3D perception of volumetric models.",
            "Customization and fabrication of the appearance for humanoid robot.",
            "Interactive visualization of multi-layered clothing.",
            "Fluid re-simulation based on physically driven model from video.",
            "Cortex-inspired multilayer hierarchy based object detection system using PHOG descriptors and ensemble classification.",
            "Scene text detection using adaptive color reduction, adjacent character model and hybrid verification strategy.",
            "Preface.",
            "RayPortals: a light transport editing framework.",
            "Optimally Redundant, Seek-Time Minimizing Data Layout for Interactive Rendering.",
            "Automatic estimation and segmentation of partial blur in natural images.",
            "A two-level clustering approach for multidimensional transfer function specification in volume visualization.",
            "A new sparse representation-based object segmentation framework.",
            "Diminished reality for augmented reality interior design.",
            "Saliency detection via Boolean and foreground in a dynamic Bayesian framework.",
            "A novel local derivative quantized binary pattern for object recognition.",
            "Object tracking by color distribution fields with adaptive hierarchical structure.",
            "Blind inpainting using the fully convolutional neural network.",
            "Preface.",
            "A visual-numeric approach to clustering and anomaly detection for trajectory data.",
            "Mass spring models with adjustable Poisson's ratio.",
            "A novel spatial-temporal optical flow method for estimating the velocity fields of a fluid sequence.",
            "A meshless strategy for shape diameter analysis.",
            "Joint-scale LBP: a new feature descriptor for texture classification.",
            "Volume enhancement with externally controlled anisotropic diffusion.",
            "Fire synthesis using basis fires and design.",
            "Intrinsic image estimation using near-L0 sparse optimization.",
            "Interactive directional subsurface scattering and transport of emergent light.",
            "Shape-controllable geometry completion for point cloud models.",
            "Preface to the special issue on VS-Games 2015.",
            "Visuohaptic augmented feedback for enhancing motor skills acquisition.",
            "Affective level design for a role-playing videogame evaluated by a brain-computer interface and machine learning methods.",
            "LiverDefense: how to employ a tower defense game as a customisable research tool.",
            "Generating various composite human faces from real 3D facial images.",
            "Webcam-based detection of emotional states.",
            "Designed emotions: challenges and potential methodologies for improving multisensory cues to enhance user engagement in immersive systems.",
            "Communication system and team situation awareness in a multiplayer real-time learning environment: application to a virtual operating room.",
            "Hand gesture-based interactive puppetry system to assist storytelling for children.",
            "EEG correlates of video game experience and user profile in motor-imagery-based brain-computer interaction.",
            "Preface.",
            "Persistent homology to analyse 3D faces and assess body weight gain.",
            "View selection for sketch-based 3D model retrieval using visual part shape description.",
            "A geometric control of fire motion editing.",
            "A novel surface tension formulation for SPH fluid simulation.",
            "Two-dimensional shape retrieval using the distribution of extrema of Laplacian eigenfunctions.",
            "Focused augmented mirror based on human visual perception.",
            "Tactile modeling and rendering image-textures based on electrovibration.",
            "Hierarchical feature concatenation-based kernel sparse representations for image categorization.",
            "An evolutionary learning based fuzzy theoretic approach for salient object detection.",
            "Erratum to: A model for adapting 3D graphics based on scalable coding, real-time simplification and remote rendering.",
            "Erratum to: Multi-camera systems use for dental arch shape measurement.",
            "CGI 2017 Editorial (TVCJ).",
            "Adaptive rendering based on a weighted mixed-order estimator.",
            "Analysis of reported error in Monte Carlo rendered images.",
            "Adaptive sparse polynomial regression for camera lens simulation.",
            "High-dynamic-range image recovery from flash and non-flash image pairs.",
            "Robust upright adjustment of 360 spherical panoramas.",
            "High-speed video generation with an event camera.",
            "Feature-preserving procedural texture.",
            "Multi-scale inherent variation features-based texture filtering.",
            "Data-driven subspace enrichment for elastic deformations with collisions.",
            "Medial-axis-driven shape deformation with volume preservation.",
            "Cloth compression using local cylindrical coordinates.",
            "Adaptive compression of animated meshes by exploiting orthogonal iterations.",
            "Blue noise sampling using an N-body simulation-based method.",
            "Forced Random Sampling: fast generation of importance-guided blue-noise samples.",
            "Adaptive multiple importance sampling for general functions.",
            "Guided point cloud denoising via sharp feature skeletons.",
            "Interactive GPU-based generation of solvent-excluded surfaces.",
            "Incremental collision-free feathering for animated surfaces.",
            "Consistent as-similar-as-possible non-isometric surface registration.",
            "A heuristic convexity measure for 3D meshes.",
            "Marbling-based creative modelling.",
            "Semantic 3D indoor scene enhancement using guide words.",
            "Robust and accurate computation of geometric distance for Lipschitz continuous implicit curves.",
            "Cross section-based hollowing and structural enhancement.",
            "Scanning and animating characters dressed in multiple-layer garments.",
            "Encoder-decoder recurrent network model for interactive character animation generation.",
            "Interactive facial expression editing based on spatio-temporal coherency.",
            "Toward accurate real-time marker labeling for live optical motion capture.",
            "Coherent multi-layer landscape synthesis.",
            "Data-driven modeling and animation of outdoor trees through interactive approach.",
            "Visual simulation of fire-flakes synchronized with flame.",
            "Glass half full: sound synthesis for fluid-structure coupling using added mass operator.",
            "Rank-based voting with inclusion relationship for accurate image search.",
            "Stacked fully convolutional networks with multi-channel learning: application to medical image segmentation.",
            "Ordered small multiple treemaps for visualizing time-varying hierarchical pesticide residue data.",
            "Preface.",
            "Local stereo matching algorithm with efficient matching cost and adaptive guided image filter.",
            "Multiple cues-based active contours for target contour tracking under sophisticated background.",
            "Scalable texture compression using the wavelet transform.",
            "Denoising of natural images through robust wavelet thresholding and genetic programming.",
            "Aggregating complementary boundary contrast with smoothing for salient region detection.",
            "Structural sparse representation-based semi-supervised learning and edge detection proposal for visual tracking.",
            "Line-based initialization method for mobile augmented reality in aircraft assembly.",
            "Reconstruction of underlying curves with styling radius corners.",
            "Video-based fluid reconstruction and its coupling with SPH simulation.",
            "Preface.",
            "Indoor scene modeling from a single image using normal inference and edge features.",
            "Storytelling by the StoryCake visualization.",
            "Intersection workspace visualization of multi-finger hands.",
            "Combining hidden Markov model and fuzzy neural network for continuous recognition of complex dynamic gestures.",
            "Joint entropy-based motion segmentation for 3D animations.",
            "Illustrative multilevel focus+context visualization along snaking paths.",
            "Modeling and dynamics simulation for deformable objects of orthotropic materials.",
            "Real-time 3D rendering with hatching.",
            "A time-integration method for stable simulation of extremely deformable hyperelastic objects.",
            "Bayesian graph-cut optimization for wall surfaces reconstruction in indoor environments.",
            "Kinetic depth images: flexible generation of depth perception.",
            "Preface.",
            "Hybrid image noise reduction algorithm based on genetic ant colony and PCNN.",
            "Sprite tree: an efficient image-based representation for networked virtual environments.",
            "Computing object-based saliency via locality-constrained linear coding and conditional random fields.",
            "Salient object detection in complex scenes via D-S evidence theory based region classification.",
            "GPU-accelerated SPH fluids surface reconstruction using two-level spatial uniform grids.",
            "Artistic stylization of face photos based on a single exemplar.",
            "Biologically inspired simulation of livor mortis.",
            "A nonlocal L0 model with regression predictor for saliency detection and extension.",
            "Illumination-insensitive features for face recognition.",
            "Preface.",
            "Full and partial shape similarity through sparse descriptor reconstruction.",
            "Multiple-process procedural texture.",
            "Percentage of human-occupied areas for fall detection from two views.",
            "Inverse kinematics using dynamic joint parameters: inverse kinematics animation synthesis learnt from sub-divided motion micro-segments.",
            "Non-redundant rendering for efficient multi-view scene discretization.",
            "Scalable 3D shape retrieval using local features and the signature quadratic form distance.",
            "Learning aggregated features and optimizing model for semantic labeling.",
            "Fast algorithm for 2D fragment assembly based on partial EMD.",
            "Single image dehazing via an improved atmospheric scattering model."
        ]
    },
    {
        "name": "TVC",
        "year": "2016",
        "info": "Volume 32, 2016",
        "count": 140,
        "papers": [
            "Welcome to the year 2016.",
            "From inspired modeling to creative modeling.",
            "Visual mining of time series using a tubular visualization.",
            "A novel optimization framework for salient object detection.",
            "Feature-aware natural texture synthesis.",
            "Volume preserving viscoelastic fluids with large deformations using position-based velocity corrections.",
            "GPU-based radial view-based culling for continuous self-collision detection of deformable surfaces.",
            "Laban descriptors for gesture recognition and emotional analysis.",
            "Fog effect for photography using stereo vision.",
            "Depth incorporating with color improves salient object detection.",
            "A visual attention-based method to address the midas touch problem existing in gesture-based interaction.",
            "Haze editing with natural transmission.",
            "Editorial.",
            "Procedure-based component and architecture modeling from a single image.",
            "Separable soft shadow mapping.",
            "Large-scale three-dimensional measurement based on LED marker tracking.",
            "Animating with style: defining expressive semantics of motion.",
            "Robust motion flow for mesh tracking of freely moving actors.",
            "Retrieval and classification methods for textured 3D models: a comparative study.",
            "Spatio-temporal segmentation for the similarity measurement of deforming meshes.",
            "A robust spatio-temporal scheme for dynamic 3D facial expression retrieval.",
            "Erratum to: Geometry-shader-based real-time voxelization and applications.",
            "Preface.",
            "Region saliency detection via multi-feature on absorbing Markov chain.",
            "A comprehensive survey of human action recognition with spatio-temporal interest point (STIP) detector.",
            "Visual tracking with semi-supervised online weighted multiple instance learning.",
            "Preface to the special issue on Cyberworlds 2014.",
            "Interactive multilevel focus+context visualization framework.",
            "Dynamic social formations of pedestrian groups navigating and using public transportation in a virtual city.",
            "Real-time EEG-based emotion monitoring using stable features.",
            "CUDA-based real-time hand gesture interaction and visualization for CT volume dataset using leap motion.",
            "Animated visualization of spatial-temporal trajectory data for air-traffic analysis.",
            "Example-based caricature generation with exaggeration control.",
            "Hybridizing mesh adaptive search algorithm and artificial immune systems for discrete rational Bézier curve approximation.",
            "EnergyViz: an interactive system for visualization of energy systems.",
            "Preface.",
            "Efficient robust filtering technique for blocking artifacts reduction.",
            "Modeling 3D synthetic view dissimilarity.",
            "Image-based styling.",
            "Visual inspection of multivariate volume data based on multi-class noise sampling.",
            "Similarity metric learning for face verification using sigmoid decision function.",
            "Artistic Low Poly rendering for images.",
            "Text-aware balloon extraction from manga.",
            "Interactive mesh cloning driven by boundary loop.",
            "Fast SPH simulation for gaseous fluids.",
            "Adaptive sparse coding on PCA dictionary for image denoising.",
            "Preface.",
            "A fast modal space transform for robust nonrigid shape retrieval.",
            "Inner engraving for the creation of a balanced LEGO sculpture.",
            "An enhanced depth map based rendering method with directional depth filter and image inpainting.",
            "Robust PCA-based solution to image composition using augmented Lagrange multiplier (ALM).",
            "Automatic segmentation of point clouds from multi-view reconstruction using graph-cut.",
            "A generalized nonlocal mean framework with object-level cues for saliency detection.",
            "A robust hybrid image-based modeling system.",
            "Water simulation using a responsive surface tracking for flow-type changes.",
            "Adaptive transmission compensation via human visual system for efficient single image dehazing.",
            "Camera re-calibration after zooming based on sets of conics.",
            "CGI 2016 Editorial (TVCJ).",
            "Fast capture of textured full-body avatar with RGB-D cameras.",
            "Multiscale descriptors and metric learning for human body shape retrieval.",
            "Automatic alignment for virtual fitting using 3D garment stretching and human body relocation.",
            "3D cartoon face generation by local deformation mapping.",
            "Realistic hair modeling from a hybrid orientation field.",
            "Hybrid fur rendering: combining volumetric fur with explicit hair strands.",
            "An inclusive Conformal Geometric Algebra GPU animation interpolation and deformation algorithm.",
            "Examining the effect of body ownership in immersive virtual and augmented reality environments.",
            "Inverse lighting design using a coverage optimization strategy.",
            "Lighting-driven voxels for memory-efficient computation of indirect illumination.",
            "Direct raytracing of a closed-form fluid meniscus.",
            "Adaptive undersampling for efficient mobile ray tracing.",
            "Deformable strokes towards temporally coherent video painting.",
            "A study on user preference of high dynamic range over low dynamic range video.",
            "Adaptive transfer functions - Improved multiresolution visualization of medical models.",
            "ITEA - interactive trajectories and events analysis: exploring sequences of spatio-temporal events in movement data.",
            "Visual analytics and rendering for tunnel crack analysis - A methodological approach for integrating geometric and attribute data.",
            "Physics-inspired controllable flame animation.",
            "An efficient layered simulation workflow for snow imprints.",
            "A simulation on grass swaying with dynamic wind force.",
            "Dynamic lapped texture for fluid simulations.",
            "Texture filtering based physically plausible image dehazing.",
            "Involving multiple fingers in exploring a haptic surface: an evaluation study.",
            "Layered shape grammars for procedural modelling of buildings.",
            "Incremental reconstruction of planar B-Rep models from multiple point clouds.",
            "Texture map generation for 3D reconstructed scenes.",
            "Parallel mesh simplification using embedded tree collapsing.",
            "Parallel BVH construction using k-means clustering.",
            "View synthesis with 3D object segmentation-based asynchronous blending and boundary misalignment rectification.",
            "A spatio-temporal wavelet-based descriptor for dynamic 3D facial expression retrieval and recognition.",
            "Light mixture intrinsic image decomposition based on a single RGB-D image.",
            "Expressive chromatic accumulation buffering for defocus blur.",
            "Multi-class anisotropic blue noise sampling for discrete element pattern generation.",
            "Toward semantic image similarity from crowdsourced clustering.",
            "Colocalization structures and eigenvalue spectra for colour image comparison.",
            "Editorial.",
            "Generalized rational Bézier curves for the rigid body motion design.",
            "A new fast normal-based interpolating subdivision scheme by cubic Bézier curves.",
            "Harmonic mean normalized Laplace-Beltrami spectral descriptor.",
            "Least square geometric iterative fitting method for generalized B-spline curves with two different kinds of weights.",
            "Mesh saliency detection via double absorbing Markov chain in feature space.",
            "Chro-Ring: a time-oriented visual approach to represent writer's history.",
            "A 3D model perceptual feature metric based on global height field.",
            "Fisher discrimination-based l2, 1-norm sparse representation for face recognition.",
            "Retiling scheme: a novel approach of direct anisotropic quad-dominant remeshing.",
            "Image morphing with conformal welding.",
            "eSphere: extracting spheres from unorganized point clouds - How to extract multiple spheres accurately and simultaneously.",
            "A lighting robust fitting approach of 3D morphable model for face reconstruction.",
            "A radiance cache method for highly glossy surfaces.",
            "An implicit skeleton-based method for the geometry reconstruction of vasculatures.",
            "Repeatable texture sampling with interchangeable patches.",
            "Consistent color and detail transfer from multiple source images for video and images.",
            "Preface to the special section on Cyberworlds 2015.",
            "Interactive 3D content modeling for Digital Earth.",
            "Real-time haptic interaction with RGBD video streams.",
            "Where are you going? Using human locomotion models for target estimation.",
            "Semantics-driven annotation of patient-specific 3D data: a step to assist diagnosis and treatment of rheumatoid arthritis.",
            "Retrieval of clothing images based on relevance feedback with focus on collar designs.",
            "Erratum to: Preface.",
            "Preface.",
            "Real-time stress assessment using thermal imaging.",
            "Robust tracking via monocular active vision for an intelligent teaching system.",
            "Action recognition by learning temporal slowness invariant features.",
            "Parametric editing of clothed 3D avatars.",
            "Visual saliency guided textured model simplification.",
            "Lossy volume compression using Tucker truncation and thresholding.",
            "VizAssist: an interactive user assistant for visual data mining.",
            "Real-time simulation techniques for augmented learning in science and engineering.",
            "Virtual annotations of the surgical field through an augmented reality transparent display.",
            "Dynamic 3-D computer graphics for designing a diagnostic tool for patients with schizophrenia.",
            "Erratum to: From inspired modeling to creative modeling.",
            "Preface.",
            "Correspondence estimation for non-rigid point clouds with automatic part discovery.",
            "Facial age estimation by using stacked feature composition and selection.",
            "Two-level joint local laplacian texture filtering.",
            "Image stylization using anisotropic reaction diffusion.",
            "2D Vector field approximation using linear neighborhoods.",
            "Real-time rendering of refracting transmissive objects with multi-scale rough surfaces.",
            "Obfuscated volume rendering.",
            "3D reconstruction for featureless scenes with curvature hints.",
            "Efficient decolorization preserving dominant distinctions.",
            "Multi-layer local energy patterns for texture representation and classification."
        ]
    },
    {
        "name": "TVC",
        "year": "2015",
        "info": "Volume 31, 2015",
        "count": 132,
        "papers": [
            "Welcome to the year 2015.",
            "Crowd simulation based on constrained and controlled group formation.",
            "Learning human shape model from multiple databases with correspondence considering kinematic consensus.",
            "Automated human motion segmentation via motion regularities.",
            "An efficient approach for 2D to 3D video conversion based on structure from motion.",
            "High-quality tree structures modelling using local convolution surface approximation.",
            "Robust and efficient adaptive direct lighting estimation.",
            "An image-space algorithm for immersive views in 3-manifolds and orbifolds.",
            "Adaptive cluster rendering via regression analysis.",
            "Preface.",
            "GPU-based polygonization and optimization for implicit surfaces.",
            "Non-blind deblurring of structured images with geometric deformation.",
            "Visualisation of complex functions on Riemann sphere.",
            "Content-aware model resizing with symmetry-preservation.",
            "Differential geometric methods for examining the dynamics of slow-fast vector fields.",
            "Geodesic bifurcation on smooth surfaces.",
            "Subimage sensitive eigenvalue spectra for image comparison - Can one hear what's painted on a drum?",
            "Interactive partial 3D shape matching with geometric distance optimization.",
            "Triangular mesh simplification on the GPU.",
            "Unsupervised kernel learning for abnormal events detection.",
            "Color correction based on point clouds alignment in the logarithmic RGB space.",
            "Automatic vehicle recognition in multiple cameras for video surveillance.",
            "Real-time obstacle detection with motion features using monocular vision.",
            "Global diffusion method for smoothing triangular mesh.",
            "Invariant shape descriptor for 3D video encoding.",
            "Animation of trees in wind using sparse motion capture data.",
            "Motion capture: capturing interaction between human and animal.",
            "Saliency detection with color contrast based on boundary information and neighbors.",
            "Erratum to: Spectral caustic rendering of a homogeneous caustic object based on wavelength clustering and eye sensitivity.",
            "Optimized recognition with few instances based on semantic distance.",
            "Continuous collision detection for deformable objects using permissible clusters.",
            "Multi-scale region perpendicular local binary pattern: an effective feature for interest region description.",
            "Optimizing line-of-sight using simplified regular terrains.",
            "A human-like learning control for digital human models in a physics-based virtual environment.",
            "Model-driven multicomponent volume exploration.",
            "Multi-resolution terrain rendering with GPU tessellation.",
            "Real-time multi-scale tracking based on compressive sensing.",
            "Deformable mesh simulation for virtual laparoscopic cholecystectomy training.",
            "Adaptive motion synthesis for virtual characters: a survey.",
            "Recent advances in facial soft biometrics.",
            "A framework for generating anatomically detailed subject-specific human facial models for biomechanical simulations.",
            "Velocity-based modeling of physical interactions in dense crowds.",
            "Multiple reconstruction and dynamic modeling of 3D digital objects using a morphing approach - Application to kidney animation and tumor tracking.",
            "Robust tracking via discriminative sparse feature selection.",
            "Layered modeling and generation of Pollock's drip style.",
            "Fast Bokeh effects using low-rank linear filters.",
            "Reconstruction of three-dimensional flame with color temperature.",
            "Restoring images of ancient color postcards.",
            "Efficient kernel discriminative common vectors for classification.",
            "An adaptive edge-preserving image denoising technique using tetrolet transforms.",
            "A response time model for abrupt changes in binocular disparity.",
            "Real-time accumulation of occlusion-based snow.",
            "Inter-frame constrained coding based on superpixel for tracking.",
            "A vectorization framework for constant and linear gradient filled regions.",
            "Automatic blur-kernel-size estimation for motion deblurring.",
            "Editorial.",
            "Procedural floor plan generation from building sketches.",
            "Learning best views of 3D shapes from sketch contour.",
            "A fast approach for perceptually-based fitting strokes into elliptical arcs.",
            "Layer the sphere - For accurate and additive voxelation by integer operation.",
            "Adaptive voids - Primal and dual adaptive cellular structures for additive manufacturing.",
            "Comparison of three bounding regions with cubic convergence to planar freeform curves.",
            "Modeling fruits and their internal structure using parametric 3Gmap L-systems.",
            "Virtual cutting of deformable objects based on efficient topological operations.",
            "Real-time collision-free linear trajectory generation on GPU for crowd simulations.",
            "A novel simulation framework based on information asymmetry to evaluate evacuation plan.",
            "A path-based multi-agent navigation model.",
            "Adaptive locomotion on slopes and stairs using pelvic rotation.",
            "Human motion control with physically plausible foot contact models.",
            "Efficient multi-constrained optimization for example-based synthesis.",
            "Virtual ball player - Synthesizing character animation to control a virtual ball from motion data using interaction patterns.",
            "DTW-based kernel and rank-level fusion for 3D gait recognition using Kinect.",
            "Generating animated paper pop-ups from the motion of articulated characters.",
            "Novel adaptive SPH with geometric subdivision for brittle fracture animation of anisotropic materials.",
            "Metaballs-based physical modeling and deformation of organs for virtual surgery.",
            "Incompressibility-preserving deformation for fluid flows using vector potentials.",
            "Graph-based deformable matching of 3D line with application in protein fitting.",
            "Global optimal searching for textureless 3D object tracking.",
            "Extended surface distance for local evaluation of 3D medical image segmentations.",
            "Visual importance-based adaptive photon tracing.",
            "Simplification of meshes with digitized radiance.",
            "Real-time adaptive content retargeting for live multi-view capture and light field display.",
            "Texture advection on discontinuous flows.",
            "GPGPU-Perf: efficient, interval-based DVFS algorithm for mobile GPGPU applications.",
            "Interactive interaction plot - Supporting parameter space exploration in a design phase.",
            "TimeClassifier: a visual analytic system for the classification of multi-dimensional time series data.",
            "DynaMoVis: visualization of dynamic models for urban modeling.",
            "Optimal exposure compression for high dynamic range content.",
            "Sparse pixel sampling for appearance edit propagation.",
            "Effective structure restoration for image completion using internet resources.",
            "Structure-aware QR Code abstraction.",
            "Efficient EMD and Hilbert spectra computation for 3D geometry processing and analysis via space-filling curve.",
            "3D shape creation by style transfer.",
            "Connectivity-preserving geometry images.",
            "Modelling character motions on infinite-dimensional manifolds.",
            "Region contrast and supervised locality-preserving projection-based saliency detection.",
            "Effects of sound on visual realism perception and task performance.",
            "A novel multi-image super-resolution reconstruction method using anisotropic fractional order adaptive norm.",
            "The three-dimensional cube and scale cube skeleton.",
            "3D entity-based stereo matching with ground control points and joint second-order smoothness prior.",
            "Supporting presentation and discussion of visualization results in smart meeting rooms.",
            "Conceptual knowledge-based modeling of interactive 3D content.",
            "Robust object tracking with active context learning.",
            "Robust object tracking via multi-feature adaptive fusion based on stability: contrast analysis.",
            "Elastic moduli of simple mass spring models.",
            "Interpolation and parallel adjustment of center-sampled trees with new balancing constraints.",
            "Direct blue noise resampling of meshes of arbitrary topology.",
            "Augmenting bag-of-words: a robust contextual representation of spatiotemporal interest points for action recognition.",
            "Real-time multiply recursive reflections and refractions using hybrid rendering.",
            "Unique people count from monocular videos.",
            "Iris recognition based on a novel variation of local binary pattern.",
            "A parallelized 4D reconstruction algorithm for vascular structures and motions based on energy optimization.",
            "An iterated randomized search algorithm for large-scale texture synthesis and manipulations.",
            "Surface carving-based automatic volume data reduction.",
            "On spatio-temporal feature point detection for animated meshes.",
            "Computation of point inversion and ray-surface intersection through tracing along the base surface.",
            "Multi-camera systems use for dental arch shape measurement.",
            "Rendering chamfering structures of sharp edges.",
            "Motion capture data recovery using skeleton constrained singular value thresholding.",
            "Estimation of crowd density by clustering motion cues.",
            "A parametric reflectance approximation for rendering Japanese lacquerware and Maki-e.",
            "Erratum to: Optical illusion shape texturing using repeated asymmetric patterns.",
            "Erratum to: Graph-based deformable matching of 3D line segments with application in protein fitting.",
            "Correlation-optimized time warping for motion.",
            "Compressive environment matting.",
            "Spectral caustic rendering of a homogeneous caustic object based on wavelength clustering and eye sensitivity.",
            "Example-guided anthropometric human body modeling.",
            "Moving object tracking based on multi-independent features distribution fields with comprehensive spatial feature similarity.",
            "Hidden message in a deformation-based texture.",
            "A performance and energy evaluation of many-light rendering algorithms.",
            "Learning to pool high-level features for face representation.",
            "Fast depth from defocus from focal stacks."
        ]
    },
    {
        "name": "TVC",
        "year": "2014",
        "info": "Volume 30, 2014",
        "count": 117,
        "papers": [
            "Welcome all to the year 2014.",
            "A co-boost framework for learning object categories from Google Images with 1st and 2nd order features.",
            "Three robust features extraction approaches for facial gender classification.",
            "Feature extraction using bionic particle swarm tracing for transfer function design in direct volume rendering.",
            "Racking focus and tracking focus on live video streams: a stereo solution.",
            "Discriminative Hough context model for object detection.",
            "Application of artificial neural network for automatic detection of butterfly species using color and texture features.",
            "Real-time simulation of lightweight rigid bodies.",
            "Ray geometry in non-pinhole cameras: a survey.",
            "3D gradient enhancement.",
            "A practical framework for generating volumetric meshes of subject-specific soft tissue.",
            "Forward non-rigid motion tracking for facial MoCap.",
            "Structuring urban data.",
            "Object joint detection and tracking using adaptive multiple motion models.",
            "3D face sparse reconstruction based on local linear fitting.",
            "GPU-based parallel construction of compact visual hull meshes.",
            "Sketching human character animations by composing sequences from large motion database.",
            "Weighted attentional blocks for probabilistic object tracking.",
            "Audio-visual speech recognition techniques in augmented reality environments.",
            "Silhouette-based human action recognition using SAX-Shapes.",
            "Solid texture synthesis for heterogeneous translucent materials.",
            "New grouping and fitting methods for interactive overtraced sketches.",
            "Grey conversion via perceived-contrast.",
            "A nonlinear level set model for image deblurring and denoising.",
            "Geometry-shader-based real-time voxelization and applications.",
            "Real-time stent and balloon simulation for stenosis treatment.",
            "Robust object tracking using enhanced random ferns.",
            "Low-resolution face recognition: a review.",
            "Particle swarm optimized bi-histogram equalization for contrast enhancement and brightness preservation of images.",
            "Transform invariant text extraction.",
            "Vision-based all-in-one solution for augmented reality and its storytelling applications.",
            "Optimizing neighborhood projection with relaxation factor for inextensible cloth simulation.",
            "SalientShape: group saliency in image collections.",
            "Depth manipulation using disparity histogram analysis for stereoscopic 3D.",
            "Design and enhancement of painting interface for room lights.",
            "Multilevel mesh simplification.",
            "Vehicle object retargeting from dynamic traffic videos for real-time visualisation.",
            "Physiological inverse tone mapping based on retina response.",
            "Camera self-calibration with varying intrinsic parameters by an unknown three-dimensional scene.",
            "Ice melting simulation with water flow handling.",
            "Hole-based traffic sign detection method for traffic signs with red rim.",
            "1D sweep-and-prune self-collision detection for deforming cables.",
            "Editorial.",
            "Rotation invariance for dense features inside regions of interest.",
            "Optimal acceleration thresholds for non-holonomic agents.",
            "AB3D: action-based 3D descriptor for shape analysis.",
            "Fast sorting for exact OIT of complex scenes.",
            "Macro 64-regions for uniform grids on GPU.",
            "Blending using ODE swept surfaces with shape control and $$C^1$$ C 1 continuity.",
            "Optimizing redundant-data clustering for interactive walkthrough applications.",
            "Dynamic 3D facial expression modeling using Laplacian smooth and multi-scale mesh matching.",
            "Fast high-quality non-blind deconvolution using sparse adaptive priors.",
            "Parametric meta-filter modeling from a single example pair.",
            "Color face image decomposition under complex lighting conditions.",
            "Ray tracing via GPU rasterization.",
            "Effective mobile mapping of multi-room indoor structures.",
            "Real-time rendering of glossy materials with regular sampling.",
            "An adaptive octree grid for GPU-based collision detection of deformable objects.",
            "Multimodal composition of the digital patient: a strategy for the knee articulation.",
            "Sparse approximation of 3D shapes via spectral graph wavelets.",
            "Hybrid tree reconstruction from inhomogeneous point clouds.",
            "Efficient triangulation of Poisson-disk sampled point sets.",
            "Dynamic BFECC Characteristic Mapping method for fluid simulations.",
            "Real-time simulating and rendering of layered dust.",
            "Optical illusion shape texturing using repeated asymmetric patterns.",
            "ESLPV: enhanced subsurface light propagation volumes.",
            "Stereoscopic image completion and depth recovery.",
            "Spatial temporal pyramid matching using temporal sparse representation for human motion retrieval.",
            "Estimation of Kinect depth confidence through self-training.",
            "Shift-invariant ring feature for 3D shape.",
            "Efficient texture synthesis of aggregate solid material.",
            "Computer-generated iron filing art.",
            "Hand-held 3D light field photography and applications.",
            "Modelling and animation of impact and damage with Smoothed Particle Hydrodynamics.",
            "Part-to-part morphing for planar curves.",
            "Pairwise matching of 3D fragments using fast fourier transform.",
            "3D segmentation and labeling of fractured bone from CT images.",
            "Hierarchical level of detail for varied animated crowds.",
            "Erratum to: Dynamic BFECC Characteristic Mapping method for fluid simulations.",
            "Preface.",
            "Artistic preprocessing for painterly rendering and image stylization.",
            "Jacobians and Hessians of mean value coordinates for closed triangular meshes.",
            "Procedural approach to volumetric terrain generation.",
            "Procedural architecture using deformation-aware split grammars.",
            "Online robust action recognition based on a hierarchical model.",
            "Mono-spectrum marker: an AR marker robust to image blur and defocus.",
            "Railroad online: acquiring and visualizing route panoramas of rail scenes.",
            "Situation awareness of cancelable biometric system.",
            "Erratum to: Color face image decomposition under complex lighting conditions.",
            "Erratum to: AB3D: action-based 3D descriptor for shape analysis.",
            "Retraction Note: Texture-guided volumetric deformation and visualization using 3D moving least squares.",
            "Editorial.",
            "Progressive 3D mesh compression using MOG-based Bayesian entropy coding and gradual prediction.",
            "A framework for implicit human-centered image tagging inspired by attributed affect.",
            "XKin: an open source framework for hand pose and gesture recognition using kinect.",
            "VideoGraph: a non-linear video representation for efficient exploration.",
            "Real-time and robust hand tracking with a single depth camera.",
            "Structure-aware error-diffusion approach using entropy-constrained threshold modulation.",
            "Depth map enhancement based on color and depth consistency.",
            "Image copy-and-paste with optimized gradient.",
            "Artistic rendering enhancing global structure.",
            "Editorial.",
            "Computer vision-based object recognition for the visually impaired in an indoors environment: a survey.",
            "An effective scheme for image texture classification based on binary local structure pattern.",
            "A sparse coding approach for local-to-global 3D shape description.",
            "3D shape retrieval and classification using multiple kernel learning on extended Reeb graphs.",
            "Pose normalization of 3D models via reflective symmetry on panoramic views.",
            "Selecting stable keypoints and local descriptors for person identification using 3D face scans.",
            "A benchmark of simulated range images for partial shape retrieval.",
            "Erratum to: Editorial.",
            "Optimum inpainting for depth map based on L 0 total variation.",
            "Dual joints for 3D-structures - Producing skins for skeletons by exploring duality.",
            "Detecting siblings in image pairs.",
            "Constrained quadratic errors-in-variables fitting.",
            "Extracting shared subspace incrementally for multi-label image classification.",
            "A survey on information visualization: recent advances and challenges.",
            "Action recognition by hidden temporal models."
        ]
    },
    {
        "name": "TVC",
        "year": "2013",
        "info": "Volume 29, 2013",
        "count": 118,
        "papers": [
            "Welcome all to the year 2013.",
            "Real-time marker prediction and CoR estimation in optical motion capture.",
            "Fast level set image and video segmentation using new evolution indicator operators.",
            "Rendering realistic spectral bokeh due to lens stops and aberrations.",
            "Feature correspondences using Morse Smale complex.",
            "An efficient multi-resolution framework for high quality interactive rendering of massive point clouds using multi-way kd-trees.",
            "Optimization-based key frame extraction for motion capture animation.",
            "Preface to special issue on Cyberworlds 2011.",
            "Bombs, fish, and coral reefs - The role of in-game explanations and explorative game behavior on comprehension.",
            "An empirical evaluation of different haptic feedback for shape and texture recognition.",
            "A multi-modal approach for high-dimensional feature recognition.",
            "Real-time feature-based image morphing for memory-efficient impostor rendering and animation on GPU.",
            "From real cities to virtual worlds using an open modular architecture.",
            "Improved mean shift integrating texture and color features for robust real time object tracking.",
            "Latent motion spaces for full-body motion editing.",
            "Shape aware normal interpolation for curved surface shading from polyhedral approximation.",
            "Skeleton growing: an algorithm to extract a curve skeleton from a pseudonormal vector field.",
            "Object cloning using constrained mean value interpolation.",
            "Nonlinear scrambling-based reversible watermarking for 2D-vector maps.",
            "Foreword to the special issue of CAD/Graphics 2011.",
            "Skeleton-driven surface deformation through lattices for real-time character animation.",
            "Cylindrical panoramic mosaicing from a pipeline video through MRF based optimization.",
            "Modeling and animation of fracture of heterogeneous materials based on CUDA.",
            "Perception-motivated visualization for 3D city scenes.",
            "Opacity volume based halo generation and depth-dependent halos.",
            "Illustrative uncertainty visualization of DTI fiber pathways.",
            "Robust image metamorphosis immune from ghost and blur.",
            "An immersive multi-agent system for interactive applications.",
            "Image-driven virtual simulation of arthroscopy.",
            "Complex line bundle Laplacians.",
            "Filtering noise in progressive stochastic ray tracing - Four optimizations to improve speed and robustness.",
            "Automatic cage construction for retargeted muscle fitting.",
            "Saliency for image manipulation.",
            "Internet visual media processing: a survey with graphics and vision applications.",
            "Image retargeting with multifocus fisheye transformation.",
            "Recovering shape and motion by a dynamic system for low-rank matrix approximation in L 1 norm.",
            "Virtual reality and haptics for dental surgery: a personal review.",
            "Segmentation of discrete point clouds using an extensible set of templates.",
            "Erratum to: An empirical evaluation of different haptic feedback for shape and texture recognition.",
            "Editorial.",
            "Lit-Sphere extension for artistic rendering.",
            "SPOID: a system to produce spot-the-difference puzzle images with difficulty.",
            "Spatial consistency of dense features within interest regions for efficient landmark recognition.",
            "Parallel adaptive sampling and reconstruction using multi-scale and directional analysis.",
            "A multiresolution descriptor for deformable 3D shape retrieval.",
            "Image warping for retargeting garments among arbitrary poses.",
            "Mona Lisa alive - Create self-moving objects using hollow-face illusion.",
            "Shape-aware skeletal deformation for 2D characters.",
            "Content-based 3D model retrieval using a single depth image from a low-cost 3D camera.",
            "Accurate and efficient cross-domain visual matching leveraging multiple feature representations.",
            "An efficient and collision-free hole-filling algorithm for orthodontics.",
            "Co-segmentation of 3D shapes via multi-view spectral clustering.",
            "Intent-aware image cloning.",
            "Textured mesh surface reconstruction of large buildings with multi-view stereo.",
            "Feature line extraction from unorganized noisy point clouds using truncated Fourier series.",
            "Multi-level hermite variational interpolation and quasi-interpolation.",
            "NUMA-aware image compositing on multi-GPU platform.",
            "Generalized Hermitian Radial Basis Functions Implicits from polygonal mesh constraints.",
            "Constraint-aware interior layout exploration for pre-cast concrete-based buildings.",
            "Representational image generation for 3D objects.",
            "Attention-Aware Disparity Control in interactive environments.",
            "3D point of interest detection via spectral irregularity diffusion.",
            "Probabilistic illumination-aware filtering for Monte Carlo rendering.",
            "Triangle mesh compression along the Hamiltonian cycle.",
            "Abstracting images into continuous-line artistic styles.",
            "Efficient collision detection for composite finite element simulation of cuts in deformable bodies.",
            "Automated sampling and control of gaseous simulations.",
            "Scalar field visualization via extraction of symmetric structures.",
            "Interactive chromaticity mapping for multispectral images.",
            "Video retargeting combining warping and summarizing optimization.",
            "The wise cursor: assisted selection in 3D serious games.",
            "Visibility-driven PET-CT visualisation with region of interest (ROI) segmentation.",
            "An empirical study on the effects of translucency on photometric stereo.",
            "Three-dimensional reconstruction using multiresolution photoclinometry by deformation.",
            "Model-based hand pose estimation via spatial-temporal hand parsing and 3D fingertip localization.",
            "Visibility-driven progressive volume photon tracing.",
            "SimLocator: robust locator of similar objects in images.",
            "Let's keep in touch online: a Facebook aware virtual human interface.",
            "A novel, integrated smoke simulation design method supporting local projection and guiding control over adaptive grids.",
            "Opening up the \"black box\" of medical image segmentation with statistical shape models.",
            "Extracting curve-skeletons from digital shapes using occluding contours.",
            "Dual space directional occlusion.",
            "Inserting virtual pedestrians into pedestrian groups video with behavior consistency.",
            "Hybrid particle-grid fluid animation with enhanced details.",
            "Pose analysis using spectral geometry.",
            "Markov-Type Vector Field for endless surface animation of water stream.",
            "Automatic visual speech segmentation and recognition using directional motion history images and Zernike moments.",
            "A survey on activity recognition and behavior understanding in video surveillance.",
            "A novel image decomposition approach and its applications.",
            "Preface to the Special Issue on Cyberworlds 2012.",
            "Interactive free-form shape modeling in cyberworlds.",
            "Extending a distributed virtual reality system with exchangeable rendering back-ends - Techniques, applications, experiences.",
            "Enhanced waypoint graph for surface and volumetric path planning in virtual worlds.",
            "Stable adaptive algorithm for Six Degrees-of-Freedom haptic rendering in a dynamic environment.",
            "Easy-to-use authoring system for Noh (Japanese traditional) dance animation and its evaluation.",
            "Augmented reality supporting user-centric building information management.",
            "A new method for camera stratified self-calibration under circular motion.",
            "Affective image adjustment with a single word.",
            "Three-dimensional cartoon facial animation based on art rules.",
            "A geometric strategy for computing intersections of two spatial parametric curves.",
            "Smoothness perception - Investigation of beat rate effect on frame rate perception.",
            "A framework for interactive image color editing.",
            "Deformable model for estimating clothed and naked human shapes from a single image.",
            "Basis image decomposition of outdoor time-lapse videos.",
            "Find where you are: a new try in place recognition.",
            "A bag-of-semantics model for image clustering.",
            "Texture mapping subdivision surfaces with hard constraints.",
            "Preface.",
            "Matrix based cyclic spectral estimator for fast and robust texture classification.",
            "An improved system for 3D individualized modeling of the artificial femoral head.",
            "Human emotion recognition from videos using spatio-temporal and audio features.",
            "Right of way - Asymmetric agent interactions in crowds.",
            "Visual simulation of turbulent fluids using MLS interpolation profiles.",
            "Ting tools: interactive and procedural modeling of Chinese ting.",
            "Key-components: detection of salient regions on 3D meshes.",
            "Automatic facial expression recognition in real-time from dynamic sequences of 3D face scans.",
            "3D object retrieval via range image queries in a bag-of-visual-words context.",
            "3D object retrieval in an atlas of neuronal structures."
        ]
    },
    {
        "name": "TVC",
        "year": "2012",
        "info": "Volume 28, 2012",
        "count": 102,
        "papers": [
            "Welcome all to the year 2012.",
            "3D medial axis point approximation using nearest neighbors and the normal field.",
            "Automatic cage generation by improved OBBs for mesh deformation.",
            "Automatic and interactive evolution of vector graphics images with genetic algorithms.",
            "Video matting via opacity propagation.",
            "Approximate straightest path computation and its application in parameterization.",
            "3D model retrieval based on color + geometry signatures.",
            "Building long-term relationships with virtual and robotic characters: the role of remembering.",
            "LOTUS: composing a multi-user interactive tiled display virtual environment.",
            "Continuous point projection to planar freeform curves using spiral curves.",
            "Noiseless GPU rendering of isotropic BRDF surfaces.",
            "Rate-distortion optimization for progressive compression of 3D mesh with color attributes.",
            "Surface reconstruction with higher-order smoothness.",
            "A variational model for normal computation of point clouds.",
            "Unsupervised learning of spatial structures shared among images.",
            "A clustering-based system to automate transfer function design for medical image visualization.",
            "Segmentation of cam-type femurs from CT scans.",
            "Markov-type velocity field for efficiently animating water stream.",
            "Volume-preserving FFD for programmable graphics hardware.",
            "Displacement patches for view-dependent rendering.",
            "Uncertainty visualization using HDR volume rendering.",
            "Web-image driven best views of 3D shapes.",
            "Efficient screen-space approach to high-quality multiscale ambient occlusion.",
            "Reeb graph path dissimilarity for 3D object matching and retrieval.",
            "Weighted pose space editing for facial animation.",
            "Approximating global illumination on mesostructure surfaces with height gradient maps.",
            "Birefringence: calculation of refracted ray paths in biaxial crystals.",
            "Hybrid inverse motion control for virtual characters interacting with sound synthesis - Application to percussion motion.",
            "A new approach to combine texture compression and filtering.",
            "Fast hierarchical animated object decomposition using approximately invariant signature.",
            "Creating building ground plans via robust K-way union - A step toward large-scale simulation in urban environment.",
            "Animating rising up from various lying postures and environments.",
            "Fluid simulation with adaptively sharpening and embedded boundary conditions.",
            "Incorporating stochastic turbulence in particle-based fluid simulation.",
            "Certified meshing of Radial Basis Function based isosurfaces.",
            "Detail-preserving exposure fusion using subband architecture.",
            "Matching sequences of salient contour points characterized by Voronoi region features.",
            "Using surface variability characteristics for segmentation of deformable 3D objects with application to piecewise statistical deformable model.",
            "Combinatorial mesh optimization.",
            "Editorial.",
            "Connecting geodesics on smooth surfaces.",
            "Structure revealing techniques based on parallel coordinates plot.",
            "Fast optimization-based elasticity parameter estimation using reduced models.",
            "An efficient diffusion model for viscous fingering.",
            "Controllable C1 continuous blending of time-dependent parametric surfaces.",
            "Eigen deformation of 3D models.",
            "Controlling shapes of air bubbles in a multi-phase fluid simulation.",
            "Mixing Monte Carlo and progressive rendering for improved global illumination.",
            "KD-tree based parallel adaptive rendering.",
            "Accumulation of local maximum intensity for feature enhanced volume rendering.",
            "Adaptive mesh subdivision for efficient light baking.",
            "Realistically rendering polluted water.",
            "Automatic generation of accentuated pencil drawing with saliency map and LIC.",
            "Unified spray, foam and air bubbles for particle-based fluids.",
            "Multiple kernels noise for improved procedural texturing.",
            "Real-time controllable fire using textured forces.",
            "Real-time rendering of deformable heterogeneous translucent objects using multiresolution splatting.",
            "Fast image dehazing using guided joint bilateral filter.",
            "Interactive two-scale color-to-gray.",
            "Adaptive tone-preserved image detail enhancement.",
            "An improved image analogy method based on adaptive CUDA-accelerated neighborhood matching framework.",
            "Compressing repeated content within large-scale remote sensing images.",
            "Physical simulation of wet clothing for virtual humans.",
            "Feature-varying skeletonization - Intuitive control over the target feature size and output skeleton topology.",
            "Local T-spline surface skinning.",
            "Tangible user interfaces for physically-based deformation: design principles and first prototype.",
            "Procedural generation of villages on arbitrary terrains.",
            "Adaptive coding of generic 3D triangular meshes based on octree decomposition.",
            "Virtual subdivision for GPU based collision detection of deformable objects using a uniform grid.",
            "All-hexahedral mesh generation via inside-out advancing front based on harmonic fields.",
            "Topology preserved shape deformation.",
            "Realistic animation of interactive trees.",
            "Procedural models for cartoon cracks and fractures animations.",
            "StoryWizard: a framework for fast stylized story illustration.",
            "More realistic, flexible, and expressive social crowds using transactional analysis.",
            "Preface to Special Issue on 3DOR 2011.",
            "Evaluation of 3D interest point detection techniques via human-generated ground truth.",
            "Comparing local shape descriptors.",
            "Combination of bag-of-words descriptors for robust partial shape retrieval.",
            "Non-rigid 3D object retrieval using topological information guided by conformal factors.",
            "Preface.",
            "Efficient computation of 3D Morse-Smale complexes and persistent homology using discrete Morse theory.",
            "Conic-like subdivision curves on surfaces.",
            "Texturing 3D models from sequential photos.",
            "A method for clipping splats on sharp edges and corners.",
            "Volume rendering of unstructured hexahedral meshes.",
            "Generating optimal drawings of physically realizable symbol maps with integer programming.",
            "Class-specific metrics for multidimensional data projection applied to CBIR.",
            "Crowd simulation: applying mobile grids to the social force model.",
            "A robust confirmable watermarking algorithm for 3D mesh based on manifold harmonics analysis.",
            "Using Normalized Compression Distance for image similarity measurement: an experimental study.",
            "Robust two-stage face recognition approach using global and local features.",
            "A pipeline virtual environment architecture for multicore processor systems.",
            "Analytical solutions for sketch-based convolution surface modeling on the GPU.",
            "A framework for digital sunken relief generation based on 3D geometric models.",
            "Time-of-flight sensor and color camera calibration for multi-view acquisition.",
            "Detail-replicating shape stretching.",
            "Robust super resolution of compressed video.",
            "Combining color and depth for enhanced image segmentation and retargeting.",
            "A gradient-domain-based edge-preserving sharpen filter.",
            "Parallelized egocentric fields for autonomous navigation.",
            "Algorithms for computing diffuse reflection paths in polygons."
        ]
    },
    {
        "name": "TVC",
        "year": "2011",
        "info": "Volume 27, 2011",
        "count": 100,
        "papers": [
            "Editorial.",
            "Rapid scalar value classification and volume clipping for interactive 3D medical image visualization.",
            "Graph-based multi-space semantic correlation propagation for video retrieval.",
            "Some applications of Loop-subdivision wavelet tight frames to the processing of 3D graphics.",
            "Width-bounded geodesic strips for surface tiling.",
            "Maintaining frame rate perception in interactive environments by exploiting audio-visual cross-modal interaction.",
            "GPGPU computation and visualization of three-dimensional cellular automata.",
            "Editorial.",
            "A GPU framework for parallel segmentation of volumetric images using discrete deformable models.",
            "A fast hybrid computation model for rectum deformation.",
            "A visualization framework for the analysis of neuromuscular simulations.",
            "Combined MR imaging towards subject-specific knee contact analysis.",
            "YaDiV - an open platform for 3D visualization and 3D segmentation of medical data.",
            "Comparison of statistical models performance in case of segmentation using a small amount of training datasets.",
            "Subject-specific knee joint model: Design of an experiment to validate a multi-body finite element model.",
            "Evaluation of a geometry-based knee joint compared to a planar knee joint.",
            "Impact of hand-assisted viewing on user performance and learning patterns in virtual environments.",
            "Selective image abstraction.",
            "Skeleton-based control of fluid animation.",
            "Ellipse-based principal component analysis for self-intersecting curve reconstruction from noisy point sets.",
            "Erratum to: Ellipse-based principal component analysis for self-intersecting curve reconstruction from noisy point sets.",
            "Photon streaming for interactive global illumination in dynamic scenes.",
            "Realistic simulation of mixing fluids.",
            "Special issue on Cyberworlds 2010.",
            "Informed character pose and proportion design.",
            "Skeleton-aware size variations in digital mannequins.",
            "An action selection process to simulate the human behavior in virtual humans with real personality.",
            "A framework to meet didactical requirements for serious game design.",
            "Fractal dimension based neurofeedback in serious games.",
            "An interactive whiteboard for immersive telecollaboration.",
            "Function-based approach to mixed haptic effects rendering.",
            "A deformation model to reduce the effect of expressions in 3D face recognition.",
            "Image-based rendering of intersecting surfaces for dynamic comparative visualization.",
            "An iterative/subdivision hybrid algorithm for curve/curve intersection.",
            "Homotopy-based surface reconstruction with application to acoustic signals.",
            "Weak-perspective structure from motion by fast alternation.",
            "Versatile surface detail editing via Laplacian coordinates.",
            "Editorial.",
            "Shrinkage, wrinkling and ablation of burning cloth and paper.",
            "Multi-scale anisotropic heat diffusion based on normal-driven shape representation.",
            "3D flow features visualization via fuzzy clustering.",
            "Procedural and interactive icicle modeling.",
            "Dynamic Voronoi diagram of complex sites.",
            "Interactive deformable models with quadratic bases in Bernstein-Bézier-form.",
            "Genetic B-Spline approximation on combined B-reps.",
            "Partition of unity parametrics: a framework for meta-modeling.",
            "Parallel and efficient Boolean on polygonal solids.",
            "Robust interactive cutting based on an adaptive octree simulation mesh.",
            "Evaluation of Boolean operations between free-form solids using extended simplicial chains and PN triangles.",
            "Registration of point clouds using sample-sphere and adaptive distance restriction.",
            "Modeling with blocks.",
            "3D model alignment based on minimum projection area.",
            "Local shape blending using coherent weighted regions.",
            "Automatic skinning and animation of skeletal models.",
            "Performance-based control interfaces using mixture of factor analyzers.",
            "An interactive design system for pop-up cards with a physical simulation.",
            "Biomechanics-based reaching optimization.",
            "An evaluation of 3-D scene exploration using a multiperspective image framework.",
            "Visualizing combinatorial auctions.",
            "A hyper elasticity method for interactive virtual design of hearing aids - A parallel method for general non-linear hyper elasticity modeling.",
            "Adaptive records for volume irradiance caching.",
            "Efficient multi-view ray tracing using edge detection and shader reuse.",
            "Shape-enhanced maximum intensity projection.",
            "Separating semantics from rendering: a scene graph based architecture for graphics applications.",
            "Grid-based SAH BVH construction on a GPU.",
            "Robust image segmentation against complex color distribution.",
            "Attention-based high dynamic range imaging.",
            "Distance-based tractography in high angular resolution diffusion MRI.",
            "Environment-Sensitive cloning in images.",
            "Video dehazing with spatial and temporal coherence.",
            "Image-space hierarchical coherence buffer.",
            "R-D optimized progressive compression of 3D meshes using prioritized gate selection and curvature prediction.",
            "Joint reversible watermarking and progressive compression of 3D meshes.",
            "Visualization of level-of-detail meshes on the GPU.",
            "A robust feature-preserving semi-regular remeshing method for triangular meshes.",
            "Interactive building and augmentation of piecewise planar environments using the intersection lines.",
            "Landmark-free posture invariant human shape correspondence.",
            "Saliency-driven scaling optimization for image retargeting.",
            "Painterly rendering with content-dependent natural paint strokes.",
            "Preface.",
            "Illustrating volume data sets and layered models with importance-aware composition.",
            "Template-based quadrilateral mesh generation from imaging data.",
            "Stereo music visualization through manifold harmonics.",
            "Geodesic-driven visual effects over complex surfaces.",
            "A fast hybrid method for apparent ridges.",
            "Fast and versatile texture-based wireframe rendering.",
            "Preface to special issue on 3DOR 2010.",
            "Interpolated eigenfunctions for volumetric shape processing.",
            "Harris 3D: a robust extension of the Harris operator for interest point detection on 3D meshes.",
            "Data-driven approach for automatic orientation of 3D shapes.",
            "Part-in-whole 3D shape matching and docking.",
            "Spectral feature selection for shape characterization and classification.",
            "3D facial expression recognition using SIFT descriptors of automatically detected keypoints.",
            "Editorial introduction to the special issue.",
            "Building look & feel concept models from color combinations - With applications in image classification, retrieval, and color transfer.",
            "Automated cell classification and visualization for analyzing remyelination therapy.",
            "Latent topic model-based group activity discovery.",
            "Tracing specular light paths in point-based scenes.",
            "Reconstruction of high contrast images for dynamic scenes.",
            "Simultaneous tracking and action recognition for single actor human actions."
        ]
    },
    {
        "name": "TVC",
        "year": "2010",
        "info": "Volume 26, 2010",
        "count": 135,
        "papers": [
            "Editorial.",
            "Multi-camera tele-immersion system with real-time model driven data compression.",
            "Error-bounded lossy compression of floating-point color buffers using quadtree decomposition.",
            "Reconstruction of B-spline skinning surface from generalized cylinder mesh.",
            "Image-based face illumination transferring using logarithmic total variation models.",
            "Differential geometry images: remeshing and morphing with local shape preservation.",
            "Protrusion-oriented 3D mesh segmentation.",
            "Detail-driven digital hologram generation.",
            "Selective rendering for efficient ray traced stereoscopic images.",
            "Good-visibility maps visualization.",
            "High quality surface remeshing with equilateral triangle grid.",
            "A simple method for interpolating meshes of arbitrary topology by Catmull-Clark surfaces.",
            "Segmenting animated objects into near-rigid components.",
            "Lazy texture selection based on active learning.",
            "Coherent radiance capture of scenes under changing illumination conditions for relighting applications.",
            "Boundary fitting for 2D curve reconstruction.",
            "An intuitive polygon morphing.",
            "Grouped photon mapping.",
            "A camera on-line recalibration framework using SIFT.",
            "Editorial.",
            "Real-time adaptive fluid simulation with complex boundaries.",
            "High quality solid texture synthesis using position and index histogram matching.",
            "Fast multi-scale joint bilateral texture upsampling.",
            "Polynomial splines over general T-meshes.",
            "Some notes on maximal arc intersection of spherical polygons: its NP\\mathcal{NP} -hardness and approximation algorithms.",
            "Editor's introduction to special issue of TVC on Cyberworlds 2009.",
            "Designing and modeling cyberworlds using the incrementally modular abstraction hierarchy based on homotopy theory.",
            "A color-based face tracking algorithm for enhancing interaction with mobile devices.",
            "Cyclic animation using partial differential equations.",
            "Generating animation from natural language texts and semantic analysis for motion search and scheduling.",
            "The Cortexionist architecture: behavioural intelligence of artificial creatures.",
            "Analysis of an efficient rule-based motion planning system for simulating human crowds.",
            "A new technique for the calculation and 3D visualisation of magnetic complexities on solar satellite images.",
            "Editorial.",
            "Real-time computation of photic extremum lines (PELs).",
            "Adaptive voxels: interactive rendering of massive 3D models.",
            "Color juxtaposition for pointillism based on an artistic color model and a statistical analysis.",
            "Perceptual-saliency extremum lines for 3D shape illustration.",
            "Real-time coherent stylization for augmented reality.",
            "GPU rendering for tiled multi-projector autostereoscopic display based on chromium.",
            "Live path: adaptive agent navigation in the interactive virtual world.",
            "Combined X-ray and facial videos for phoneme-level articulator dynamics.",
            "Real-time data driven deformation with affine bones.",
            "One step at a time: animating virtual characters based on foot placement.",
            "From sentence to emotion: a real-time three-dimensional graphics metaphor of emotions extracted from text.",
            "A Virtual World Grammar for automatic generation of virtual worlds.",
            "A high dynamic range rendering pipeline for interactive applications.",
            "Animation rendering with Population Monte Carlo image-plane sampler.",
            "Realistic rendering of bokeh effect based on optical aberrations.",
            "A hybrid approach to interactive global illumination and soft shadows.",
            "Environmental lighting on dynamic objects using hemicube bit masks.",
            "Real-time single scattering inside inhomogeneous materials.",
            "A graph-based representation of game scenarios; methodology for minimizing anomalies in computer game.",
            "3D-freehand-pose initialization based on operator's cognitive behavioral models.",
            "Usability evaluation of virtual reality interaction techniques for positioning and manoeuvring in reduced, manipulation-oriented environments.",
            "Camera movement for chasing a subject with unknown behavior based on real-time viewpoint goodness evaluation.",
            "Collaborative telemedicine for interactive multiuser segmentation of volumetric medical images.",
            "The physiological mirror - a system for unconscious control of a virtual environment through physiological activity.",
            "Curling and clumping fur represented by texture layers.",
            "Inverse lighting and photorealistic rendering for augmented reality.",
            "Fast indirect illumination using Layered Depth Images.",
            "Volumetric ambient occlusion for volumetric models.",
            "A novel terrain rendering algorithm based on quasi Delaunay triangulation.",
            "A SIMD-efficient 14 instruction shader program for high-throughput microtriangle rasterization.",
            "Content-aware copying and pasting in images.",
            "Example-based contrast enhancement by gradient mapping.",
            "Contrast prescription for multiscale image editing.",
            "Optimal multiple-seams search for image resizing with smoothness and shape prior.",
            "Local albedo-insensitive single image dehazing.",
            "Nonhomogeneous scaling optimization for realtime image resizing.",
            "Monge mapping using hierarchical NURBS.",
            "Filling n-sided regions with G1 triangular Coons B-spline patches.",
            "An additional branch free algebraic B-spline curve fitting method.",
            "Constructing up to G2 continuous curve on freeform surface.",
            "Generating B-spline curves with points, normals and curvature constraints: a constructive approach.",
            "Shape enhancement for rapid prototyping.",
            "Subdivision depth computation for n-ary subdivision curves/surfaces.",
            "A fully geometric approach for developable cloth deformation simulation.",
            "Solving the Shallow Water equations using 2D SPH particles for interactive applications.",
            "Multilevel vorticity confinement for water turbulence simulation.",
            "Visual simulation of mixed-motion avalanches with interactions between snow layers.",
            "A nonsmooth nonlinear conjugate gradient method for interactive contact force problems.",
            "Multi-rate coupling of physical simulations for haptic interaction with deformable objects.",
            "Noise- and compression-robust biological features for texture classification.",
            "Real-time foveation filtering using nonlinear Mipmap interpolation.",
            "Example-based painting guided by color features.",
            "A GPU-based matting Laplacian solver for high resolution image matting.",
            "Periodic pattern of texture analysis and synthesis based on texels distribution.",
            "Highlights on weathering effects.",
            "A PDE method for patchwise approximation of large polygon meshes.",
            "Perceptually-motivated shape exaggeration.",
            "Prior model evaluation from Null Space Compensation perspective with application to surface reconstruction from single images.",
            "Precise Hausdorff distance computation for planar freeform curves using biarcs and depth buffer.",
            "Fusion of disconnected mesh components with branching shapes.",
            "Cage-free local deformations using green coordinates.",
            "View-dependent exploration of massive volumetric models on large-scale light field displays.",
            "Direct raycasting of unstructured cell-centered data by discontinuity Roe-average computation.",
            "An efficient clustering method for fast rendering of time-varying volumetric medical data.",
            "Interactive 3D visualization for wireless sensor networks.",
            "Wavefront raycasting using larger filter kernels for on-the-fly GPU gradient reconstruction.",
            "TF-DF indexing for mocap data segments in measuring relevance based on textual search queries.",
            "A novel semi-blind-and-semi-reversible robust watermarking scheme for 3D polygonal models.",
            "Streaming compression of hexahedral meshes.",
            "Seamless video composition using optimized mean-value cloning.",
            "A new image-based CAPTCHA using the orientation of the polygonally cropped sub-images.",
            "Scalable real-time planar targets tracking for digilog books.",
            "Editorial.",
            "A realistic elastic rod model for real-time simulation of minimally invasive vascular interventions.",
            "Color invariant chroma keying and color spill neutralization for dynamic scenes and cameras.",
            "An improved data hiding approach for polygon meshes.",
            "Natural steering behaviors for virtual pedestrians.",
            "Video-realistic image-based eye animation via statistically driven state machines.",
            "Geometry-based control of fire simulation.",
            "An MLS-based cartoon deformation.",
            "Erratum to: Real-time data driven deformation with affine bones.",
            "Preface.",
            "A versatile framework for shape description.",
            "The bag of words approach for retrieval and categorization of 3D objects.",
            "Partial matching of real textured 3D objects using color cubic higher-order local auto-correlation features.",
            "SkelTre - Robust skeleton extraction from imperfect point clouds.",
            "3D articulated object retrieval using a graph-based representation.",
            "3D relevance feedback via multilevel relevance judgements.",
            "Interactive motion photography from a single image.",
            "Color-to-gray conversion using ISOMAP.",
            "The multi-LREP decomposition of solids and its application to a point-in-polyhedron inclusion test.",
            "Urban flood risk analysis for determining optimal flood protection levels based on digital terrain model and flood spreading model.",
            "Guiding flows for controlling crowds.",
            "A lightweight approach to repairing digitized polygon meshes.",
            "Evaluation of texture registration by epipolar geometry.",
            "Segmenting point-sampled surfaces.",
            "Volumetric stereo and silhouette fusion for image-based modeling.",
            "A comparative study of existing metrics for 3D-mesh segmentation evaluation.",
            "Interactive evolutionary 3D fractal modeling.",
            "Delaunay deformable mesh for the weathering and erosion of 3D terrain.",
            "Layered occlusion map for soft shadow generation."
        ]
    },
    {
        "name": "TVC",
        "year": "2009",
        "info": "Volume 25, 2009",
        "count": 104,
        "papers": [
            "Editorial.",
            "Acoustic OFDM system and its extension.",
            "Toward a higher-level visual representation for object-based image retrieval.",
            "Mobile phone-based mixed reality: the Snap2Play game.",
            "Video collage: presenting a video sequence using a single image.",
            "A distance measure for repeated takes of one scene.",
            "Distributed Video Coding using Turbo Trellis Coded Modulation.",
            "Editorial note from the Editor-in-Chief.",
            "A model for real-time on-surface flows.",
            "Simulation of interface dynamics: a diffuse-interface model.",
            "Real-time exploration and photorealistic reconstruction of large natural environments.",
            "A new feature-preserving mesh-smoothing algorithm.",
            "Extension of half-edges for the representation of multiresolution subdivision surfaces.",
            "3Gmap L-systems: an application to the modelling of wood.",
            "From obscurances to ambient occlusion: A survey.",
            "Seamless patches for GPU-based terrain rendering.",
            "Coherent multiresolution isosurface ray tracing.",
            "Splitting cubes: a fast and robust technique for virtual cutting.",
            "Dendritic stylization.",
            "Fur simulation with spring continuum.",
            "Hierarchical aggregation for efficient shape extraction.",
            "Implicit modeling from polygon soup using convolution.",
            "Robust detection of perceptually salient features on 3D meshes.",
            "Image-based tree modeling from a few images with very narrow viewing range.",
            "Moving objects forecast in image sequences using autoregressive algorithms.",
            "Dependency graph approach to load balancing distributed volume visualization.",
            "Interactive HDR lighting of dynamic participating media.",
            "Biorthogonal wavelet construction for hybrid quad/triangle meshes.",
            "Sense and sidedness in the graphics pipeline via a passage through a separable space.",
            "Editorial.",
            "Incorporating object-centered sampling and Delaunay tetrahedrization for visual hull reconstruction.",
            "Creating MPU implicit surfaces from unoriented point sets with orientation inference.",
            "Variational tetrahedral mesh generation from discrete volume data.",
            "Streaming surface sampling using Gaussian epsilon-nets.",
            "Maximal independent set graph partitions for representations of body-centered cubic lattices.",
            "An improved belief propagation method for dynamic collage.",
            "Automatic view selection through depth-based view stability analysis.",
            "An information theoretic approach to camera control for crowded scenes.",
            "Pick-by-vision: augmented reality supported order picking.",
            "Realistic real-time sound re-synthesis and processing for interactive virtual worlds.",
            "Fragment-based responsive character motion for interactive games.",
            "Real time falling animation with active and protective responses.",
            "Efficient motion data indexing and retrieval with local similarity measure of motion strings.",
            "Motion constraint.",
            "Fluid-based hatching for tone mapping in line illustrations.",
            "An extended GPU radiosity solver.",
            "High-quality brightness enhancement functions for real-time reverse tone mapping.",
            "Towards multi-perspective rasterization.",
            "Fast real-time caustics from height fields.",
            "Compact real-time modeling of seated humans by video sprite sequence quantization.",
            "Feature-rich distance-based terrain synthesis.",
            "Feature enhancement by volumetric unsharp masking.",
            "Adaptive smooth surface fitting with manifolds.",
            "Dual-RBF based surface reconstruction.",
            "Mr-SDM: a novel statistical deformable model for object deformation.",
            "Generating anatomical substructures for physically-based facial animation. Part 1: A methodology for skull fitting.",
            "Interactive skeletonization of intensity volumes.",
            "Light source estimation of outdoor scenes for mixed reality.",
            "Inherent limitations on specular highlight analysis.",
            "Automatic registration of multiple range images based on cycle space.",
            "Salient spectral geometric features for shape matching and retrieval.",
            "An efficient two steps algorithm for wide baseline image matching.",
            "Physically based simulation of thin-shell objects' burning.",
            "Real-time multi-band synthesis of ocean water with new iterative up-sampling technique.",
            "Simulation of swirling bubbly water using bubble particles.",
            "Interchangeable SPH and level set method in multiphase fluids.",
            "A fast method for simulating destruction and the generated dust and debris.",
            "Preface.",
            "Robust fitting of implicitly defined surfaces using Gauss-Newton-type techniques.",
            "Curvature-based anisotropic geodesic distance computation for parametric and implicit surfaces.",
            "Parallel smoothing of quad meshes.",
            "Approximate topological matching of quad meshes.",
            "Multi-Fourier spectra descriptor and augmentation with spectral clustering for 3D shape retrieval.",
            "A GPU Tile-Load-Map architecture for terrain rendering: theory and applications.",
            "Editorial.",
            "Real-time guidewire simulation in complex vascular models.",
            "A subject-specific software solution for the modeling and the visualization of muscles deformations.",
            "Anatomically-based musculoskeletal modeling: prediction and validation of muscle deformation during walking.",
            "In vivo interactive visualization of four-dimensional blood flow patterns.",
            "Consistent parameterization and statistical analysis of human head scans.",
            "Motion study of the hip joint in extreme postures.",
            "An interactive 3D medical visualization system based on a light field display.",
            "Editorial.",
            "Editorial.",
            "3D face computational photography using PCA spaces.",
            "Shape-sensitive MLS deformation.",
            "Visual analysis of image collections.",
            "3D virtual mosaics: Opus Palladium and mixed styles.",
            "Performance analysis of a parallel multi-view rendering architecture using light fields.",
            "A reduced unconstrained system for the cloth dynamics solver.",
            "Real-time saliency-aware video abstraction.",
            "Visual simulation of thermal fluid dynamics in a pressurized water reactor.",
            "Video stabilization based on a 3D perspective camera model.",
            "A study of locomotion paradigms for immersive medical simulation environments.",
            "High-quality cardiac image dynamic visualization with feature enhancement and virtual surgical tool inclusion.",
            "Creation and control of rain in virtual environments.",
            "Special issue on Serious Games and Virtual Worlds.",
            "Living virtual history.",
            "Modelling deformations in car crash animation.",
            "Development of a sensory gate-ball game system for the aged people.",
            "Optimising engagement for stroke rehabilitation using serious games.",
            "Towards high-fidelity multi-sensory virtual environments.",
            "Multimodal augmented reality tangible gaming.",
            "Framework for context-aware smartphone applications."
        ]
    },
    {
        "name": "TVC",
        "year": "2008",
        "info": "Volume 24, 2008",
        "count": 102,
        "papers": [
            "Curvature-based stroke rendering.",
            "Building highly realistic facial modeling and animation: a survey.",
            "A natural human hand model.",
            "Efficient contrast invariant stereo correspondence using dynamic programming with vertical constraint.",
            "Improved 2D mass-spring-damper model with unstructured triangular meshes.",
            "GPU-based rendering of point-sampled water surfaces.",
            "Material-aware differential mesh deformation using sketching interface.",
            "GPU-based rendering for deformable translucent objects.",
            "Highly stylised animation.",
            "High frequency geometric detail manipulation and editing for point-sampled surfaces.",
            "A GPU persistent grid mapping for terrain rendering.",
            "Enhancing 3D mesh topological skeletons with discrete contour constrictions.",
            "Virtual world explorations by using topological and semantic knowledge.",
            "Solving nonlinear polynomial systems in the barycentric Bernstein basis.",
            "Shape from shading based on needle map and cellular automata.",
            "A survey of partial differential equations in geometric design.",
            "Guest editor's foreword.",
            "A distance template for octree traversal in CPU-based volume ray casting.",
            "Interactive GPU-based adaptive cartoon-style rendering.",
            "Consistent mesh partitioning and skeletonisation using the shape diameter function.",
            "Continuous collision detection for adaptive simulation of articulated bodies.",
            "Enriching a motion database by analogous combination of partial human motions.",
            "Digital shallow depth-of-field adapter for photographs.",
            "Three-dimensional surface reconstruction using meshing growing neural gas (MGNG).",
            "Realization of Seurat's pointillism via non-photorealistic rendering.",
            "Lattice Boltzmann based PDE solver on the GPU.",
            "Particle-based non-photorealistic volume visualization.",
            "Minimizing probable collision pairs searched in interactive animation authoring.",
            "Reconstructing regular meshes from points.",
            "Markerless human body motion capture using Markov random field and dynamic graph cuts.",
            "Editorial.",
            "Hierarchical part-type segmentation using voxel-based curve skeletons.",
            "Topological correction of hypertextured implicit surfaces for ray casting.",
            "Delaunay meshing of isosurfaces.",
            "Augmented planar reflective symmetry transform.",
            "Evolution of T-spline level sets for meshing non-uniformly sampled and incomplete data.",
            "Spline-based feature curves from point-sampled geometry.",
            "Editorial.",
            "Efficient product sampling using hierarchical thresholding.",
            "Determination of camera parameters for character motions using motion area.",
            "Caustic spot light for rendering caustics.",
            "Shape deformation with tunable stiffness.",
            "An improved contrast enhancing approach for color-to-grayscale mappings.",
            "Perspective-aware texture analysis and synthesis.",
            "Self adaptive animation based on user perspective.",
            "Adaptive particles for incompressible fluid simulation.",
            "Adjacency-based culling for continuous collision detection.",
            "Efficient reconstruction from non-uniform point sets.",
            "Real-time editing and relighting of homogeneous translucent materials.",
            "3D Hair sketching for real-time dynamic & key frame animations.",
            "Motion synthesis with decoupled parameterization.",
            "Contextual motion field-based distance for video analysis.",
            "Real-time modeling and rendering of raining scenes.",
            "3D mosaics with variable-sized tiles.",
            "Inversion handling for stable deformable modeling.",
            "Visibility volumes for interactive path optimization.",
            "A GPU-based light hierarchy for real-time approximate illumination.",
            "Fast collision detection using the A-buffer.",
            "1001 Acquisition viewpoints: efficient and versatile view-dependent modeling of real-world scenes.",
            "A new feature-based method for robust and efficient rigid-body registration of overlapping point clouds.",
            "GPU-based point radiation for interactive volume sculpting and segmentation.",
            "Vortex methods for incompressible flow simulations on the GPU.",
            "Video enhancement using reference photographs.",
            "Visual creation of inhabited 3D environments.",
            "Real-time feature-aware video abstraction.",
            "System architecture for semantic annotation and adaptation in content sharing environments.",
            "Sketching freeform meshes using graph rotation functions.",
            "A virtual painting knife.",
            "Example-driven animation synthesis.",
            "Mesh massage.",
            "Spectral mesh deformation.",
            "A single-pass GPU ray casting framework for interactive out-of-core rendering of massive volumetric datasets.",
            "Generating vast varieties of realistic leaves with parametric 2Gmap L-systems.",
            "Importance sampling of products from illumination and BRDF using spherical radial basis functions.",
            "A virtual 3D mobile guide in the INTERMEDIA project.",
            "User-centric universal multimedia access in home networks.",
            "Services surround you.",
            "Special issue on Cyberworlds'2007.",
            "Real-time crowd motion planning.",
            "Function-based visualization and haptic rendering in shared virtual spaces.",
            "A model for adapting 3D graphics based on scalable coding, real-time simplification and remote rendering.",
            "Automatic spatial analysis and pedestrian flow control for real-time crowd simulation in an urban environment.",
            "Multilayered visuo-haptic hair simulation.",
            "Haptic two-finger contact with textiles.",
            "Visual-haptic perception of compliant objects in artificially generated environments.",
            "Editorial to Special Issue INTUITION.",
            "Future scenarios of mixed reality: the INTUITION roadmap scenarios.",
            "A dynamically reconfigurable stereoscopic/panoramic vision mobile robot head controlled from a virtual environment.",
            "Towards interactive simulation in automotive design.",
            "Automatic speech grammar generation during conceptual modelling of virtual environments.",
            "Estimation of mechanical parameters of deformable solids from videos.",
            "Contact identification for assembly-disassembly simulation with a haptic device.",
            "Character emotion experience in virtual environments.",
            "Augmented & Virtual Reality applications in the field of logistics.",
            "Sensorimotor coordination aftereffects of exposure to a virtual environment.",
            "Editorial.",
            "A framework for GPU-based application-independent 3D interactions.",
            "Twofold adaptive partition of unity implicits.",
            "Modeling on triangulations with geodesic curves.",
            "Pathline predicates and unsteady flow structures.",
            "Interactive visual analysis of time-series microarray data.",
            "Nonuniform bilateral filtering for point sets and surface attributes."
        ]
    },
    {
        "name": "TVC",
        "year": "2007",
        "info": "Volume 23, 2007",
        "count": 98,
        "papers": [
            "Editorial.",
            "PTK: A novel depth buffer-based shape descriptor for three-dimensional object retrieval.",
            "Acceleration of direct volume rendering with programmable graphics hardware.",
            "Enhancing computer graphics through machine learning: a survey.",
            "Isotopic meshing of implicit surfaces.",
            "An efficient caching-based rendering of translucent materials.",
            "Physically-based deformations: copy and paste.",
            "Fair webs.",
            "Guest editorial.",
            "A vibrotactile approach to tactile rendering.",
            "A wearable system for mobility improvement of visually impaired people.",
            "Interactive deformable geometry maps.",
            "From measured physical parameters to the haptic feeling of fabric.",
            "Generating compact representations of static scenes by means of 3D object hierarchies.",
            "Ray casting implicit fractal surfaces with reduced affine arithmetic.",
            "Ray-driven dynamic working set rendering.",
            "A generic formalism for the semantic modeling and representation of architectural elements.",
            "An ontology of virtual humans.",
            "Generation of view dependent models using free form deformation.",
            "Editorial.",
            "Touch and design: novel haptic interfaces for the generation of high quality surfaces for industrial design.",
            "High performance haptic device for force rendering in textile exploration.",
            "Novel devices and interaction techniques for human-scale haptics.",
            "Tactile interfaces: technologies, applications and challenges.",
            "Haptics in telerobotics.",
            "A novel framework for physically based sculpting and animation of free-form solids.",
            "Editorial.",
            "Simulation and interaction of fluid dynamics.",
            "Automatic composition and simulation system for ballet sequences.",
            "Presence and interaction in mixed reality environments.",
            "Visual spatio-temporal function-based querying.",
            "RTR-trees for space robotics behavior simulation and visualization.",
            "The red and black semantics: a fuzzy language.",
            "Improvement on the accuracy of the polynomial form extrapolation model in distributed virtual environment.",
            "On stochastic methods for surface reconstruction.",
            "Point-and-edge model for edge-preserving splatting.",
            "Enhancing the experience of 3D virtual worlds with a cartographic generalization approach.",
            "A new image prediction model based on spatio-temporal techniques.",
            "A unified method for appearance and geometry completion of point set surfaces.",
            "Automatic generation of colorful patterns with wallpaper symmetries from dynamics.",
            "Guest editorial.",
            "Spatially varying image based lighting by light probe sequences.",
            "A framework for inverse tone mapping.",
            "The photon pipeline revisited.",
            "Optimization techniques for curved path computing.",
            "Polygon visibility ordering via Voronoi diagrams.",
            "Dynamics-based analysis and synthesis of human locomotion.",
            "Automatic expressive deformations for implying and stylizing motion.",
            "Fast and simple hardware accelerated voxelizations using simplicial coverings.",
            "Interactive wireless virtual colonoscopy.",
            "Real time simulation of a tornado.",
            "Description and visualization of graminaceous plants with an organ-based 3D architectural model, exemplified for spring barley ( Hordeum vulgare L.).",
            "Survey of semi-regular multiresolution models for interactive terrain rendering.",
            "A new image registration scheme based on curvature scale space curve matching.",
            "Editorial.",
            "Projective texture atlas construction for 3D photography.",
            "Deformation-based interactive texture design using energy optimization.",
            "High dynamic range image tone mapping and retexturing using fast trilateral filtering.",
            "The progressive mesh compression based on meaningful segmentation.",
            "Handling degenerate cases in exact geodesic computation on triangle meshes.",
            "Stop-and-go cloth draping.",
            "A combustion-based technique for fire animation and visualization.",
            "A simple footskate removal method for virtual reality applications.",
            "A fast rendering method for clouds illuminated by lightning taking into account multiple scattering.",
            "Reusing view-dependent animation.",
            "An adaptive steganographic algorithm for 3D polygonal meshes.",
            "Block-based image inpainting in the wavelet domain.",
            "Visualizing shape transformation between chimpanzee and human braincases.",
            "Motion learning-based framework for unarticulated shape animation.",
            "Brush up your painting skills.",
            "Exact, robust and efficient full visibility computation in Plücker space.",
            "Conservative voxelization.",
            "A topological approach for surface reconstruction from sample points.",
            "Estimating curvatures and their derivatives on meshes of arbitrary topology from sampling directions.",
            "Perceptually meaningful image editing.",
            "Sensory state machines for physically-based animation.",
            "Image completion based on views of large displacement.",
            "Haptic feedback in mixed-reality environment.",
            "GPU-based particle simulation with inter-collisions.",
            "Displacement modeling: Hardware-accelerated interactive feature modeling on subdivision surfaces.",
            "Three-dimensional oil painting reconstruction with stroke based rendering.",
            "Contextual void patching for digital elevation models.",
            "Selection of the most efficient tile size in tile-based cylinder panoramic video coding and transmission.",
            "Normalpaint: an interactive tool for painting normal maps.",
            "3D reconstruction from 2D images with hierarchical continuous simplices.",
            "A new vector field distance transform and its application to mesh processing from 3D scanned data.",
            "From dust till drawn.",
            "Anti-aliased and real-time rendering of scenes with light scattering effects.",
            "Ribbons.",
            "Improving the sketch-based interface.",
            "Editorial.",
            "Registration of CAD mesh models with CT volumetric model of assembly of machine parts.",
            "Dynamic Delaunay tetrahedralisation of a deforming surface.",
            "A robust hole-filling algorithm for triangular mesh.",
            "Computing shortest cycles using universal covering space.",
            "Improved error estimate for extraordinary Catmull-Clark subdivision surface patches.",
            "3D shape metamorphosis based on T-spline level sets.",
            "Surface modeling with polynomial splines over hierarchical T-meshes."
        ]
    },
    {
        "name": "TVC",
        "year": "2006",
        "info": "Volume 22, 2006",
        "count": 96,
        "papers": [
            "Editorial.",
            "Morphological and stance interpolations in database for simulating bipedalism of virtual humans.",
            "Algorithmic Painter: a NPR method to generate various styles of painting.",
            "Multiresolution free-form deformation with subdivision surface of arbitrary topology.",
            "3D face authentication and recognition based on bilateral symmetry analysis.",
            "An efficient and low-error mesh simplification method based on torsion detection.",
            "Guest editorial.",
            "Low damped cloth simulation.",
            "Rapid pairwise intersection tests using programmable GPUs.",
            "Haptic interaction and volume modeling techniques for realistic dental simulation.",
            "Mesh analysis using geodesic mean-shift.",
            "Perspective silhouette of a general swept volume.",
            "Domain connected graph: the skeleton of a closed 3D shape for animation.",
            "Punctuated simplification of man-made objects.",
            "Mean shift denoising of point-sampled surfaces.",
            "Decision trees for accelerating unimodal, hybrid and multimodal rendering models.",
            "Surface completion for shape and appearance.",
            "Hierarchical mesh segmentation based on fitting primitives.",
            "Robust on-line adaptive footplant detection and enforcement for locomotion.",
            "A dynamic balanced flow for filtering point-sampled geometry.",
            "Penumbra masks.",
            "A wavelet-based framework for acquired radiometric quantity representation and accurate physical rendering.",
            "Synthesizing trees by plantons.",
            "Integration of volume decompression and out-of-core iso-surface extraction from irregular volume data.",
            "Mesh fusion using functional blending on topologically incompatible sections.",
            "SUSAN structure preserving filtering for mesh denoising.",
            "Preface.",
            "Guest editors' introduction: multimedia modelling.",
            "Characterizing human shape variation using 3D anthropometric data.",
            "Real-time snowing simulation.",
            "Spherical parameterization and geometry image-based 3D shape similarity estimation (CGS 2004 special issue).",
            "Device-based decision-making for adaptation of three-dimensional content.",
            "Detection and classification of topological evolution for linear metamorphosis.",
            "A novel multi-resolution video representation scheme based on kernel PCA.",
            "Guest Editorial.",
            "Single-strips for fast interactive rendering.",
            "Least-squares fitting of multiple M-dimensional point sets.",
            "Dynamic obstacle avoidance for real-time character animation.",
            "Natural-looking strokes for drawing applications.",
            "View-dependent refinement of multiresolution meshes using programmable graphics hardware.",
            "A collision resolution algorithm for clump-free fast moving cloth.",
            "Single view metrology of wide-angle lens images.",
            "View-dependent textured splatting.",
            "Combining estimators for Monte Carlo volume rendering with shading.",
            "Shape-based detail-preserving exaggeration of extremely accurate 3D faces.",
            "Multi-level differential surface representation based on local transformations.",
            "Methods and data structures for virtual world exploration.",
            "Compression and rendering of iso-surfaces and point sampled geometry.",
            "The conformal alpha shape filtration.",
            "Accelerating subsurface scattering using Cholesky factorization.",
            "Spectral volume rendering using GPU-based raycasting.",
            "Snake terrestrial locomotion synthesis in 3D virtual environments.",
            "Platform independent optimisation of multi-resolution 3D content to enable universal media access.",
            "Editorial.",
            "Surface reconstruction by layer peeling.",
            "Surface mosaics.",
            "Variational sphere set approximation for solid objects.",
            "Interactive multi-scale exploration for volume classification.",
            "Interactive 3D video editing.",
            "Dynamic stills and clip trailers.",
            "2D shape deformation using nonlinear least squares optimization.",
            "Object-based vectorization for interactive image editing.",
            "Interactive image completion with perspective correction.",
            "Real-time triple product relighting using spherical local-frame parameterization.",
            "Correlated visibility sampling for direct illumination.",
            "A practical and fast rendering algorithm for dynamic scenes using adaptive shadow fields.",
            "Spherical harmonics scaling.",
            "Estimation of missing markers in human motion capture.",
            "Segmenting a deforming mesh into near-rigid components.",
            "Geometrically based potential energy for simulating deformable objects.",
            "Interactive continuous collision detection for non-convex polyhedra.",
            "Real-time animation of spark discharge.",
            "R-LODs: fast LOD-based ray tracing of massive models.",
            "Interactive ray tracing of skinned animations.",
            "Probabilistic silhouette based importance toward line-art non-photorealistic rendering.",
            "Rendering stylized highlights using projective textures.",
            "A unified scheme for adaptive stroke-based rendering.",
            "Paper craft models from meshes.",
            "SnapPaste: an interactive technique for easy mesh composition.",
            "A high-capacity steganographic approach for 3D polygonal meshes.",
            "Fast GPU computation of the mass properties of a general shape and its application to buoyancy simulation.",
            "Similarity based interpolation using Catmull-Clark subdivision surfaces.",
            "Efficient wavelet construction with Catmull-Clark subdivision.",
            "Surface remeshing in arbitrary codimensions.",
            "Interactive aesthetic curve segments.",
            "Quadratic approximation to plane parametric curves and its application in approximate implicitization.",
            "Fast example-based surface texture synthesis via discrete optimization.",
            "Real-time structured texture synthesis and editing using image-mesh analogies.",
            "Completion-based texture design using deformation.",
            "Guest editor's introduction.",
            "Cyberworlds: architecture and modeling by an incrementally modular abstraction hierarchy.",
            "Online and off-line visualization of meeting information and meeting support.",
            "Function-defined shape metamorphoses in visual cyberworlds.",
            "Storing user experiences in mixed reality using hypermedia.",
            "Adaptable visual presentation of 2D and 3D learning materials in web-based cyberworlds.",
            "Cybercampuses: design issues and future directions."
        ]
    },
    {
        "name": "TVC",
        "year": "2005",
        "info": "Volume 21, 2005",
        "count": 89,
        "papers": [
            "Editorial.",
            "Plus curves and surfaces.",
            "Solid modelling in a virtual reality environment.",
            "Collision detection with relative screw motion.",
            "Surface modeling with ternary interpolating subdivision.",
            "A comparison of algorithms for vertex normal computation.",
            "A new implicit blending technique for volumetric modelling.",
            "Surround video: a multihead camera approach.",
            "An alternative method of curve interpolation.",
            "Aerial image processing and object recognition.",
            "Compressed shadow maps.",
            "Free-form deformation with weighted T-spline.",
            "The Evolution of a WILDLAND Forest FIRE FRONT.",
            "Subdivision method to create furcating object with multibranches.",
            "Level-of-detail for cognitive real-time characters.",
            "Photogrammetric reconstruction of free-form objects with curvilinear structures.",
            "Textures revisited.",
            "Making Doo-Sabin surface interpolation always work over irregular meshes.",
            "Polygonization of implicit surfaces with sharp features by edge-spinning.",
            "Increasing the predictability of tissue subsurface scattering simulations.",
            "Interactive shape modeling using Lagrangian surface flow.",
            "Simulating the task-level control of human motion: a methodology and framework for implementation.",
            "A survey on participating media rendering techniques.",
            "The FL-system: a functional L-system for procedural geometric modeling.",
            "Conformal self-organizing map for a genus-zero manifold.",
            "Mirror MoCap: Automatic and efficient capture of dense 3D facial motion parameters from video.",
            "Artificial mosaics.",
            "An almost distribution-independent incremental Delaunay triangulation algorithm.",
            "Real-time visualization of animated trees.",
            "Layer-based decomposition of solids and its applications.",
            "Curve reconstruction based on an interval B-spline curve.",
            "1D and 2D structured mass-spring models with preload.",
            "Interactive rendering of globally illuminated scenes including anisotropic and inhomogeneous participating media.",
            "Volumetric texture synthesis for non-photorealistic volume rendering of medical data.",
            "Controllable motion synthesis in a gaseous medium.",
            "Virtual marionettes: a system and paradigm for real-time 3D animation.",
            "Preface.",
            "From early draping to haute couture models: 20 years of research.",
            "Computer graphics - more than beautiful images.",
            "Generating unified model for dressed virtual humans.",
            "Key Probe: a technique for animation keyframe extraction.",
            "Sweep-based human deformation.",
            "Character animation creation using hand-drawn sketches.",
            "Capturing and rendering geometry details for BTF-mapped surfaces.",
            "Intersection fields for interactive global illumination.",
            "Geocube - GPU accelerated real-time rendering of transparency and translucency.",
            "Interactive fragment tracing.",
            "Video completion using tracking and fragment merging.",
            "Compression of multiple depth maps for IBR.",
            "Minimizing user intervention in registering 2D images to 3D models.",
            "Scalable 3D video of dynamic scenes.",
            "Single view compositing with shadows.",
            "Mesh segmentation using feature point and core extraction.",
            "Mesh segmentation driven by Gaussian curvature.",
            "Geometry completion and detail generation by texture synthesis.",
            "Topology-preserving simplification of 2D nonmanifold meshes with embedded structures.",
            "Quadrilateral and tetrahedral mesh stripification using 2-factor partitioning of the dual graph.",
            "Detail control in line drawings of 3D meshes.",
            "An improved scheme of an interactive finite element model for 3D soft-tissue cutting and deformation.",
            "Modeling cracks and fractures.",
            "Real-time simulation of physically based on-surface flow.",
            "Fast rendering of foveated volumes in wavelet-based representation.",
            "Volume cutout.",
            "GPU-based 3D wavelet reconstruction with tileboarding.",
            "Building 3D surface networks from 2D curve networks with application to anatomical modeling.",
            "Shell radiance texture functions.",
            "Texture mapping on surfaces of arbitrary topology using norm preserving-based optimization.",
            "Real-time geometric deformation displacement maps using programmable hardware.",
            "Uniform texture synthesis and texture mapping using global parameterization.",
            "Expressive line selection by example.",
            "Interactive sketch generation.",
            "Fitting unorganized point clouds with active implicit B-spline curves.",
            "What's in an image?",
            "Efficient spectral watermarking of large meshes with orthogonal basis functions.",
            "Smooth spline surface generation over meshes of irregular topology.",
            "Semantic-oriented 3d shape retrieval using relevance feedback.",
            "Connectivity compression in an arbitrary dimension.",
            "Improved perspective visibility ordering for object-order volume rendering.",
            "Relaxation of spherical parameterization meshes.",
            "A new approach to line and line segment clipping in homogeneous coordinates.",
            "Mesh blending.",
            "Feature- and region-based auto painting for 2D animation.",
            "Computing hierarchical curve-skeletons of 3D objects.",
            "Editorial.",
            "The genesis of \"The Visual Computer\".",
            "My personal history in the early explorations of computer graphics.",
            "Progress in scientific visualization.",
            "Shape complexity.",
            "Virtual humans: thirty years of research, what next?"
        ]
    },
    {
        "name": "TVC",
        "year": "2004",
        "info": "Volume 20, 2004",
        "count": 49,
        "papers": [
            "Editoria.",
            "A greedy Delaunay-based surface reconstruction algorithm.",
            "Computing curvature-adaptive surface triangulations of three-dimensional image data.",
            "Efficient method of adaptive sign detection for 4 ast 4 determinants using a standard arithmetic processing unit.",
            "Scalar-field-guided adaptive shape deformation and animation.",
            "A real-time terrain visualization algorithm using wavelet-based compression.",
            "Animating visible speech and facial expressions.",
            "A hybrid-based texture synthesis approach.",
            "Constructive sculpting of heterogeneous volumetric objects using trivariate B-splines.",
            "The Marching Intersections algorithm for merging range images.",
            "Real-time knot-tying simulation.",
            "v2 Subdivision for quadrilateral meshes.",
            "Blending surface generation using a fast and accurate analytical solution of a fourth-order PDE with three shape control parameters.",
            "Special Section on the Fourth Israel-Korea Bi-National Conference on Geometric Modeling and Computer Graphics.",
            "Parameterization-free active contour models with topology control.",
            "Polygonal space carving with geometric anti-aliasing.",
            "Adaptive extraction and visualization of silhouette curves from volumetric datasets.",
            "Constrained synthesis of textural motion for articulated characters.",
            "Finding and defining the generators of genus-n objects for constructing topological and cut graphs.",
            "From curve design algorithms to the design of rigid body motions.",
            "Point in solid test for free-form solids defined with triangular Bézier patches.",
            "Painting canvas synthesis.",
            "Feature sensitive multiscale editing on surfaces.",
            "A weighted mean approach to smooth parametric representation of polygon meshes.",
            "Editorial for the special section on implicit surfaces.",
            "Shrinkwrap: An efficient adaptive algorithm for triangulating an iso-surface.",
            "Combining CSG modeling with soft blending using Lipschitz-based implicit surfaces.",
            "Implicit surface reconstruction from contours.",
            "An inverse kinematics architecture enforcing an arbitrary number of strict priority levels.",
            "Interpolatory, solid subdivision of unstructured hexahedral meshes.",
            "Trimming implicit surfaces.",
            "Triangular mesh intersection.",
            "Biconic subdivision of surfaces of revolution and its applications in intersection problems.",
            "Sampling-sensitive multiresolution hierarchy for irregular meshes.",
            "A hand-held approach to 3D reconstruction using light stripe projections onto a cube frame.",
            "Delphi: geometry-based connectivity prediction in triangle mesh compression.",
            "Achieving developability of a polygonal surface by minimum deformation: a study of global and local optimization approaches.",
            "An efficient classification and rendering method using tagged distance maps.",
            "Efficient 6DOF tools for free-form surface modelling.",
            "Adjusting degree of visual complexity: an interactive approach for exploring four-dimensional polytopes.",
            "Reverse engineering approach to appearance-based design of metallic and pearlescent paints.",
            "Occlusion culling and z-fail for soft shadow volume algorithms.",
            "A hybrid method for real-time animation of trees swaying in wind fields.",
            "A data management scheme for effective walkthrough in large-scale virtual environments.",
            "Reactive pedestrian path following from examples.",
            "Texture evolution: 3D texture synthesis from single 2D growable texture pattern.",
            "Visualization of hypersurfaces and multivariable (objective) functions by partial global optimization.",
            "Interactive design using higher order PDEs.",
            "A hand-held approach to 3D reconstruction using light stripe projections onto a cube frame."
        ]
    },
    {
        "name": "TVC",
        "year": "2003",
        "info": "Volume 19, 2003",
        "count": 48,
        "papers": [
            "Multi-tuple interpolation using Fourier descriptors.",
            "Edge-preserving texture filtering for real-time rendering.",
            "Optimized triangle mesh reconstruction from unstructured points.",
            "Polygonal extrusion.",
            "The synthesis of rust in seawater.",
            "Rendering traditional mosaics.",
            "Special issue: shape modeling and applications, SMI2001.",
            "Polygonal mesh regularization for subdivision surfaces interpolating meshes of curves.",
            "Implicit modeling using subdivision curves.",
            "Differential coordinates for local mesh morphing and deformation.",
            "Dynamic mesh optimization for polygonized implicit surfaces with sharp features.",
            "Shape understanding by contour-driven retiling.",
            "Towards shape representation using trihedral mesh projections.",
            "Structural simulation of tree growth and response.",
            "Efficient collision detection for models deformed by morphing.",
            "Arbitrary shaped deformations with DOGME.",
            "A sweeping algorithm for cluster hair rendering.",
            "Efficient view-dependent refinement of 3D meshes using sqrt{3}-subdivision.",
            "Motion retargeting and evaluation for VR-based training of free motions.",
            "A fast 3D seed-filling algorithm.",
            "Interference colours of soap bubbles.",
            "Optimized Edgebreaker encoding for large and regular triangle meshes.",
            "Special issue on CGS 2001.",
            "Combining deformable- and rigid-body mechanics simulation.",
            "An improved finite-element contact model for anatomical simulations.",
            "Dynamically refining animated triangle meshes for rendering.",
            "Composition of novel views through an efficient image warping.",
            "A cinematic-based framework for scene boundary detection in video.",
            "Guessing by neighbors: an efficient reconstruction method for transmitting image progressively.",
            "Computational video.",
            "Combining vision and computer graphics for video motion capture.",
            "A semi-direct approach to structure from motion.",
            "Plenoptic video geometry.",
            "Omnidirectional video.",
            "Vanishing points and three-dimensional lines from omni-directional video.",
            "Automatic surface reconstruction with alpha-shape method.",
            "Implementing lattice Boltzmann computation on graphics hardware.",
            "Segmentation and adaptive assimilation for detail-preserving display of high-dynamic range images.",
            "Two-level hierarchical Z-buffer with compression technique for 3D graphics hardware.",
            "Directed mean Hausdorff distance of parameterized freeform shapes in 3D: a case study.",
            "Hierarchical topology-preserving simplification of terrains.",
            "Tunnel-free voxelisation of rational Bézier surfaces.",
            "Convex contouring of volumetric data.",
            "On the modified conjugate gradient method in cloth simulation.",
            "Parallel Delaunay triangulation in E 3: make it simple.",
            "An approach to surface retouching and mesh smoothing.",
            "Manifold-guaranteed out-of-core simplification of large meshes with controlled topological type.",
            "Analysis of numerical methods for the simulation of deformable models."
        ]
    },
    {
        "name": "TVC",
        "year": "2002",
        "info": "Volume 18, 2002",
        "count": 39,
        "papers": [
            "Controlling a camera in a virtual environment.",
            "Real-time visualisation of fibre networks.",
            "A JPEG-like texture compression with adaptive quantization for 3D graphics application.",
            "A numerically efficient and stable algorithm for animating water waves.",
            "Compressing isosurfaces generated with marching cubes.",
            "Modeling a Murex cabritii sea shell with a structured implicit surface modeler.",
            "Dynamic sculpting and animation of free-form subdivision solids.",
            "Automated generation of control skeletons for use in animation.",
            "HyperMask - projecting a talking head onto a real object.",
            "Detection of human faces in a compressed domain for video stratification.",
            "Realistic rendering of an organ surface in real-time for laparoscopic surgery simulation.",
            "Hands on a virtually elastic object.",
            "An algorithm for blob hierarchy layout.",
            "Acquiring, stitching and blending diffuse appearance attributes on 3D models.",
            "Editorial to the Special Issue on WSCG'01.",
            "Exploiting the Hessian matrix for content-based retrieval of volume-data features.",
            "Transformation of dynamic facial image sequences using static 2D prototypes.",
            "Hypertexturing complex volume objects.",
            "Visualization and pre-processing of independent finite-element meshes for car crash simulations.",
            "Taxonomy of interpolation constraints on recursive subdivision curves.",
            "Surface skinning revisited.",
            "Editorial to the Special Issue on subdivision 2001.",
            "Interactive rendering of Catmull/Clark surfaces with crease edges.",
            "Evaluation of piecewise smooth subdivision surfaces.",
            "Bounded curvature triangle mesh subdivision with the convex hull property.",
            "Analysis and design of Hermite subdivision schemes.",
            "A subdivision scheme for hexahedral meshes.",
            "Detecting and reconstructing subdivision connectivity.",
            "A feature-based approach for individualized human head modeling.",
            "Taxonomy of interpolation constraints on recursive subdivision surfaces.",
            "A projectively invariant intersection test for polyhedra.",
            "Smooth multiple B-spline surface fitting with Catmull%ndash; Clark subdivision surfaces for extraordinary corner patches.",
            "Minimal area for surface reconstruction from cross sections.",
            "Image-based animation of facial expressions.",
            "A volume-preserving approach for modeling and animating water flows generated by metaballs.",
            "Texture-based volume rendering of adaptive mesh refinement data.",
            "B-spline free-form deformation of polygonal object as trimmed Bézier surfaces.",
            "Optimistic parallel Delaunay triangulation.",
            "Convolution surfaces for arcs and quadratic curves with a varying kernel."
        ]
    },
    {
        "name": "TVC",
        "year": "2001",
        "info": "Volume 17, 2001",
        "count": 42,
        "papers": [
            "Parametric Gn blending of curves and surfaces.",
            "Experimenting with nonintrusive motion capture in a virtual environment.",
            "Surface scratches: measuring, modeling and rendering.",
            "Shigeki Yokoi, A technique for precise depth representation in stereoscopic display.",
            "Visualization of time-dependent data with feature tracking and event detection.",
            "Computer graphics bibliograohic search on the Internet.",
            "Computer Graphics Society Issue.",
            "Rendering optimal solar shadows with plural sunlight depth buffers.",
            "Human motion coordination: a juggler as an example.",
            "Visualization of optical phenomena caused by multilayer films based on wave optics.",
            "Simulation of postoperative 3D facial morphology using a physics-based head model.",
            "Editorial.",
            "Reconstructing 2D images with natural neighbour interpolation.",
            "An efficient animation of wrinkled cloth with approximate implicit integration.",
            "An improved articulated model of the human hand.",
            "d-Dimensional parametric models for dynamic animation of deformable objects.",
            "Two methods for cloud visualisation from weather simulation data.",
            "Multiresolution volume visualization with a texture-based octree.",
            "Robust and efficient surface reconstruction from contours.",
            "The normal of a fractal surface.",
            "Towards cognitive evaluation of computer-drawn sketches.",
            "Extension of the Nicholls-Lee-Nichols algorithm to three dimensions.",
            "Binary volume rendering using Slice-based Binary Shell.",
            "Functionally based virtual embossing.",
            "Editorial - Special Issue: Computer Graphics International 2000.",
            "Enabling cuts on multiresolution representation.",
            "Crack pattern simulation based on 3D surface cellular automata.",
            "Visualization of eclipses and planetary conjunction events. The interplay between model coherence, scaling and animation.",
            "Orientation lightmaps for photon tracing in complex environments.",
            "Reparameterization of piecewise rational Bezier curves and its applications.",
            "Improved quadratic normal vector interpolation for realistic shading.",
            "Parameterization for reconstruction of 3D freeform objects from laser-scanned data based on a PDE method.",
            "Direct manipulation of FFD: efficient explicit solutions and decomposible multiple point constraints.",
            "Multicriteria-optimized triangulations.",
            "Volume-based three-dimensional metamorphosis using sphere-guided region correspondence.",
            "Joining polyhedral objects using implicitly defined surfaces.",
            "A spectrally based framework for realistic image synthesis.",
            "The normalform of a space curve and its application to surface design.",
            "Layered animation of captured data.",
            "A method for generating pavement textures using the square packing technique.",
            "Efficiently simulating scattering of light by leaves.",
            "Virtual spectrophotometric measurements for biologically and physically based rendering."
        ]
    },
    {
        "name": "TVC",
        "year": "2000",
        "info": "Volume 16, 2000",
        "count": 37,
        "papers": [
            "Editorial.",
            "Interpolating meshes of boundary intersecting curves by subdivision surfaces.",
            "Extracting skeletal curves from 3D scattered data.",
            "Merging polyhedral shapes with scattered features.",
            "Curvilinear displacement of free-form-based deformation.",
            "Shape similarity by homotopic deformation.",
            "High-performance computing for surface modelling and analysis.",
            "On latency compensation and its effects on head-motion trajectories in virtual environments.",
            "Image representation by self-organizing conformal network.",
            "Wavelet shape blending.",
            "Multilevel sensitive reconstruction of polyhedral surfaces from parallel slices.",
            "Skinning-surface generation based on spine-curve control.",
            "Editorial: Shape modeling and processing.",
            "Discrete fairing and variational subdivision for freeform surface design.",
            "Interactive mesh dragging with an adaptive remeshing technique.",
            "General matrix representations for B-splines.",
            "Existence and computation of spherical rational quartic curves for Hermite interpolation.",
            "Ray tracing deformed generalized cylinders.",
            "Polygonal boundary approximation for a 2D general sweep based on envelope and boolean operations.",
            "Fast and intuitive generation of geometric shape transitions.",
            "Creating and retargetting motion by the musculoskeletal human body model.",
            "A case study towards validation of global illumination algorithms: progressive hierarchical radiosity with clustering.",
            "Computer-assisted coloring by matching line drawings.",
            "Special issue for CGI '98.",
            "Anatomic modeling of deformable human bodies.",
            "A component-based system for storing and manipulating graphics objects of different representations.",
            "Construction of multiresolution triangular B-spline surfaces using hexagonal filters.",
            "Hierarchical tetrahedral-octahedral subdivision for volume visualization.",
            "Simulation of three-dimensional cracks.",
            "Ray tracing four spheres at the vertices of a regular tetrahedron.",
            "Surface approximation to scanned data.",
            "Using vanishing points for camera calibration and coarse 3D reconstruction from a single image.",
            "Whole-body modelling of people from multiview images to populate virtual worlds.",
            "A hybrid elastic model for real-time cutting, deformations, and force feedback for surgery training and simulation.",
            "Cost-effective shadowing method using the ED-buffer on an adaptive light cube.",
            "Practical volumetric sculpting.",
            "Radiosity for scenes with many mirror reflections."
        ]
    },
    {
        "name": "TVC",
        "year": "1999",
        "info": "Volume 15, 1999",
        "count": 40,
        "papers": [
            "An approximate method for generating draft on a free-form surface.",
            "Fast triangular mesh approximation of surface data using wavelet coefficients.",
            "Hierarchical generalized triangle strips.",
            "Triage polygonization of rounded polyhedra.",
            "PolyFormes: software for the declarative modelling of polyhedra.",
            "Filling n-sided regions with NURBS patches.",
            "A constrained finite element method for modeling cloth deformation.",
            "Real-time exploration of regular volume data by adaptive reconstruction of isosurfaces.",
            "Balance control and mass centre adjustment of articulated figures in interactive environments.",
            "Motion and behaviour modelling: state of art and new trends.",
            "Artificial planets with fractal feature specification.",
            "A system of 3D hair style synthesis based on the wisp model.",
            "Kernel functions in convolution surfaces: a comparative analysis.",
            "Simulating wrinkles and skin aging.",
            "A comparison of invariant energies for free-form surface construction.",
            "Chaotic attractors with the symmetry of the dodecahedron.",
            "RMAP: a system for visualizing data in multidimensional relevance space.",
            "Triangulated spatial models and neighbourhood search: an experimental comparison with quadtrees.",
            "The scanline principle: efficient conversion of display algorithms into scanline mode.",
            "Guarding the walls of an art gallery.",
            "A formal specification of geometric refinements.",
            "Compacting oriental fonts by optimizing parametric elements.",
            "Editorial.",
            "VHD: a system for directing real-time virtual actors.",
            "User evaluation: Synthetic talking faces for interactive services.",
            "Modeling 3D scenes from video.",
            "Non-linear dynamical system approach to behavior modeling.",
            "Fast generation of curved perspectives for ultra-wide-angle lenses in VR applications.",
            "Synthetic motion capture: Implementing an interactive virtual marine world.",
            "DeepMatrix - An open technology based virtual environment system.",
            "A constrained inverse kinematics technique for real-time motion capture animation.",
            "Computergraphics society Special Issue: Editorial.",
            "Computer-generated still images composited with panned/zoomed landscape video sequences.",
            "Efficient rendering of multiresolution meshes with guaranteed image quality.",
            "Interactive surface decomposition for polyhedral morphing.",
            "Using metaballs to modeling and animate clouds from satellite images.",
            "C2 - Local convexity-preserving interpolation through the control point form method.",
            "Animating bird flight using aerodynamics.",
            "Diffusive smoothing of polygonal meshes with bias and tension controls.",
            "Preserving attribute values on simplified meshes by resampling detail textures."
        ]
    },
    {
        "name": "TVC",
        "year": "1998",
        "info": "Volume 14, 1998",
        "count": 39,
        "papers": [
            "Surface subdivision for generating superquadrics.",
            "A system subdivision approach for large radiosity computation.",
            "Fast algorithms for clipping lines and line segments in E2.",
            "Virtual sculpting and virtual woodcut printing.",
            "Computer-aided illusions: ambiguity, perspective and motion.",
            "Recursive algebraic curve fitting and rendering.",
            "Shadow generation for volumetric data sets.",
            "A marching method for the triangulation of surfaces.",
            "Nested radiosity for plant canopies.",
            "Generation of crack patterns with a physical model.",
            "CGS special issue.",
            "Collaborative environments of IntelligentBox for distributed 3D graphics applications.",
            "Resolving occlusion in image sequence made easy.",
            "Three-dimensional geometric metamorphosis based on harmonic maps.",
            "Continuous-resolution-level constraints in variational design of multiresolution shapes.",
            "Sensor-based synthetic actors in a tennis game simulation.",
            "Editorial.",
            "Variational design of curves and surfaces using multiresolution constraints.",
            "Direct manipulation of generalized cylinders based on B-spline motion.",
            "Vertex representations and their applications in computer graphics.",
            "Transformation of functionally defined shapes by extended space mappings.",
            "CFFD: a tool for designing flexible shapes.",
            "Motion planning for flexible shapes (systems with many degrees of freedom): a survey.",
            "Three-dimensional skeleton and centerline generation based on an approximate minimum distance field.",
            "A shift of playground for geometric processing from euclidean to homogeneous.",
            "An intuitive and device-independent method of generating color atlases for electronic displays.",
            "A four-sided approach for interpolating B-spline curves by subdivision surfaces.",
            "Processes and events.",
            "Special issue on morphing.",
            "Image morphing: a survey.",
            "Three-dimensional metamorphosis: a survey.",
            "A work minimization approach to image morphing.",
            "Image interpolation using unions of spheres.",
            "Self-intersection elimination in metamorphosis of two-dimensional curves.",
            "Polyhedron realization for shape transformation.",
            "Right-triangular subdivision for texture mapping ray-traced objects.",
            "Adaptive polygonization of geometrically constrained surfaces.",
            "Hierarchical approximation and localization.",
            "A texture controller."
        ]
    },
    {
        "name": "TVC",
        "year": "1997",
        "info": "Volume 13, 1997",
        "count": 34,
        "papers": [
            "A parallel scaled conjugate-gradient algorithm for the solution phase of gathering radiosity on hypercubes.",
            "Automatic motion synthesis for 3D mass-spring models.",
            "Some basic geometric test conditions in terms of Plücker coordinates and Plücker coefficients.",
            "Convex polyhedron-line intersection detection using dual representation.",
            "High-performance texture decompression hardware.",
            "Boundary representation of polyhedral heterogeneous solids in the context of a graphic object algebra.",
            "Ruled tracing.",
            "Performance of advancing front algorithms for triangulating radiosity meshes.",
            "Semiglobal deformation and correction of free- form surfaces using a mechanical alternative.",
            "A note on geometric representations of Gaussian rational numbers.",
            "Algebras and formal specifications in geometric modelling.",
            "Perception of images using cylindrical mapping.",
            "Integrating gestures into the user-interface management system.",
            "Exact antialiasing of textured terrain models.",
            "Representation and visualization of terrain surfaces at variable resolution.",
            "A new antialiasing approach for image compositing.",
            "Multiresolution decimation based on global error.",
            "Epipolar plane space subdivision method in stereoscopic ray tracing.",
            "Ray tracing of spline surfaces: Bézier clipping, Chebyshev boxing, and bounding volume hierarchy - a critical comparison with new results.",
            "Carving: a novel method of visibility preprocessing for unrestricted three-dimensional environments.",
            "Scattered data fitting with simplex splines in two and three dimensional spaces.",
            "Variable-radius blending by constrained spine generation.",
            "A view interpolation technique taking into account diffuse and specular inter-reflections.",
            "A note on computing the saddle values in isosurface polygonization.",
            "Fast volume render techniques for interactive analysis.",
            "Stream arrows: enhancing the use of stream surfaces for the visualization of dynamical systems.",
            "Approaches to uncertainty visualization.",
            "An efficiency enhanced isosurface generation algorithm for volume visualization.",
            "Acute shapes preserved by constructing arc-line-arc splines for machining.",
            "Automatic synthesis of image details based on multiresolution coherence.",
            "Error-bound wavelength selection for spectral rendering.",
            "Coarse-to-fine design of feedback controllers for dynamic locomotion.",
            "Computer generation of eroded valley and mountain terrains.",
            "Warp-guided object-space morphing."
        ]
    },
    {
        "name": "TVC",
        "year": "1996",
        "info": "Volume 12, 1996",
        "count": 42,
        "papers": [
            "An approach to computer-supported cartooning.",
            "alpha-B-spline: a linear singular blending B-spline.",
            "An optimal parallel algorithm for volume ray casting.",
            "Line diffusion: a parallel error diffusion algorithm for digital halftoning.",
            "Global multipath Monte Carlo algorithms for radiosity.",
            "Representation and realistic rendering of natural phenomena with cyclic CSG graphs.",
            "A semi-automatic system for edge tracking with snakes.",
            "Aerodynamic force models for animating cloth motion in air flow.",
            "Bilinear interpolation for facial expression and metamorphosis in real-time animation.",
            "Superscalar RISC machines, straight-line programs, and graphics.",
            "Construction and application of fractal interpolation surfaces.",
            "A parallel polygon-clipping algorithm.",
            "Use of potential functions in 3D rendering of fractal images from complex functions.",
            "Computing spanning line segments in three dimensions.",
            "G2 interpolation and blending on surfaces.",
            "Detection of rotational and involutional symmetries and congruity of polyhedra.",
            "Homogeneous bounding boxes as tools for intersection algorithms of rational bézier curves and surfaces.",
            "Design and performance evaluation of a pixel cache implemented within application- specific integrated circuits.",
            "Collision avoidance in cloth animation.",
            "A new parallel ray-tracing system based on object decomposition.",
            "Constructing a 3D individualized head model from two orthogonal views.",
            "Graphical objects.",
            "Interactive real-time motion blur.",
            "Object management in a programming-by-example, parametric, computer-aided-design system.",
            "A comparison of four visibility acceleration techniques for radiosity.",
            "Multiresolution models for topographic surface description.",
            "Kepler, von Neumann and God (More rounding-off error visualizations).",
            "A functional presentation of Fourier series convergence.",
            "The relationship between a rectangle and a triangle.",
            "Quasiconvolutional smoothing of polyhedra.",
            "A Monte Carlo approach for Galerkin radiosity.",
            "A type-merging algorithm for extracting an isosurface from volumetric data.",
            "Ratioquadrics: an alternative model for superquadrics.",
            "Hamiltonian triangulations for fast rendering.",
            "A note on a linear time algorithm for constructing adjacency graphs of 3D FEA data.",
            "A note on visualizing the Omega Prism.",
            "Shape transformation in space-time.",
            "Surface design via deformation of periodically swept surfaces.",
            "Fast massively parallel algorithms for shortest path within planar figures.",
            "A texture-mapping approach for the compression of colored 3D triangulations.",
            "An efficient volume- rendering algorithm with an analytic approach.",
            "Sphere tracing: a geometric method for the antialiased ray tracing of implicit surfaces."
        ]
    },
    {
        "name": "TVC",
        "year": "1995",
        "info": "Volume 11, 1995",
        "count": 35,
        "papers": [
            "A scalable high-performance graphics processor: GVIP.",
            "Horizon computation on a hierarchical triangulated terrain model.",
            "Color set selection for nominal coding by Hopfield networks.",
            "Computing caustic effects by backward beam tracing.",
            "Fast generation of spherical slicing surfaces for irregular volume rendering.",
            "Fractal pattern for a butterfly wing.",
            "Laying out objects with geometric and physical constraints.",
            "Adaptive marching cubes.",
            "Computer generation of harmonic equihue color scales.",
            "Abstraction paradigms for computer graphics.",
            "A cellular automaton model of particle motions and its applications.",
            "Quadric and cubic bitetrahedral patches.",
            "Nonlinear ray tracing: visualizing strange worlds.",
            "Dynamic contour: a texture approach and contour operations.",
            "Line illustrations in computer graphics.",
            "Ray-cast volume rendering accelerated by incremental trilinear interpolation and cell templates.",
            "Is the fractal Golden Curlicue cold?",
            "Synthetic coloring of fractal terrains and triangular automata.",
            "Data-parallel, volume-rendering algorithms.",
            "Three-dimensional reconstruction of geoscientific objects from serial sections.",
            "Approximate conversion of a rational boundary Gregory patch to a nonuniform B-spline surface.",
            "Random number generators: pretty good ones are easy to find.",
            "Towards object-oriented modelling of euclidean geometry.",
            "Are autostereograms useful for computer graphics and scientific visualization?",
            "Rational bicubic simple quadrilateral mesh surfaces.",
            "Feature matching and affine transformation for 2D cell animation.",
            "Function representation in geometric modeling: concepts, implementation and applications.",
            "Creativity and simplicity.",
            "Algorithms for rendering realistic terrain image sequences and their parallel implementation.",
            "Ray tracing: a quantitative analysis and a new practical algorithm.",
            "Tracing rays with the Area Sampling Machine.",
            "Fast collision detection between complex solids using rasterizing graphics hardware.",
            "Variable-radius blending of parametric surfaces.",
            "Data partitioning for parallel solid modelling.",
            "Fast interference detection between geometric models."
        ]
    },
    {
        "name": "TVC",
        "year": "1993",
        "info": "Volume 10, 1993/1994",
        "count": 42,
        "papers": [
            "A graphical editor and process visualization system for man-machine interfaces of dynamic systems.",
            "Efficient, complete radiosity ray tracing using a shadow-coherence method.",
            "Using a cooperative hypermedia editing tool to enhance group communication and productivity.",
            "Exploiting spatial coherence to accelerate radiosity.",
            "Visual coding by optimal graph-coloring.",
            "Short communication Center-cut for color-image quantization.",
            "Volume rendering for vector fields.",
            "An efficient hierarchical-traversal algorithm for ray tracing.",
            "A physically based model for icicle growth.",
            "Cutting cubes - visualizing implicit surfaces by adaptive polygonization.",
            "A fast display method for volumetric data.",
            "Stereoscopic ray-tracing.",
            "Visualization of multidimensional image data sets using a neural network.",
            "SIMD algorithm for curved object recognition using Grimson and Lozano-Pérez matching.",
            "Short communication Lava lamps in the 21st century.",
            "Solid spaces and inverse particle systems for controlling the animation of gases and fluids.",
            "Displacement constraints for interactive modeling and animation of articulated structures.",
            "Space-efficient region filling in raster graphics.",
            "Interrogation of differential geometry properties for design and manufacture.",
            "Two 2D postprocessing tools and their applications to the improvement of 3D pictures.",
            "Casting shadows with approximated object space accuracy by means of a modified Z-buffer.",
            "Algorithm for constained delaunay triangulation.",
            "Computational methods for evaluating swept object boundaries.",
            "DigiDürer - a digital engraving system.",
            "Generating a smooth voxel-based model from an irregular polygon mesh.",
            "Solid sweeping in image space - application in NC simulation.",
            "Performance of scanline algorithms for direct display of CSG.",
            "Shadows on bump-mapped surfaces in ray tracing.",
            "View binding and user enhanceable systems.",
            "Short communication A note on two-sided holes in implicit quadric spline surfaces.",
            "A modified look-up table for implicit disambiguation of Marching Cubes.",
            "3D representation of the Mandelbrot set.",
            "Ray tracing general parametric surfaces using interval arithmetic.",
            "A heuristic triangulation algorithm for multiple planar contours using an extended double branching procedure.",
            "Multimouth surfaces for synthetic actor animation.",
            "2D line and polygon clipping based on space subdivision.",
            "Algorithms for computing the center of area of a convex polygon.",
            "An algorithm for recognizing palm polygons.",
            "An efficient algorithm for identifying objects using robot probes.",
            "The Superman problem.",
            "External watchman routes.",
            "Clamping a polygon."
        ]
    },
    {
        "name": "TVC",
        "year": "1992",
        "info": "Volume 9, 1992/1993",
        "count": 41,
        "papers": [
            "Digital circles with non-lattice point centers.",
            "A comparison of three shadow volume algorithms.",
            "Tracing a ray through uniformly subdivided n-dimensional space.",
            "Chinese lattice designs and parametric shape grammars.",
            "An efficient multi-resolution edge detector employing a wide range of scales.",
            "A visual environment to define composition of interacting graphical objects.",
            "Canopy surface technique for parametric blending.",
            "Interval Ray Tracing - a divide and conquer strategy for realistic computer graphics.",
            "Short communication Mobilevision.",
            "Images of the rose.",
            "Components of the visual computer: a review of relevant technologies.",
            "Color specification by visual interaction.",
            "Visual cues and pictorial limitations for computer generated photo-realistic images.",
            "Short communication Cleopatra's necklace and the aesthetics of osculatory growth.",
            "An adaptive, error-free computation based on the 4 x 4 determinant method.",
            "Adaptive generation of surfaces in volume data.",
            "Modeling and animating turbulent gaseous phenomena using spectral synthesis.",
            "Piero della Francesca and the computer: analysis, reconstruction, and inheritance.",
            "Short communication Mandalas, screws, pears, and Klein bottles.",
            "Artistic design with fractal matrices.",
            "Simplifying interactive design of solid models: a hypertext approach.",
            "Halftoning of image sequences.",
            "Representation of arbitrary shapes using implicit quadrics.",
            "Improved explicit radiosity method for calculating non-Lambertian reflections.",
            "Short communication A Note on integer subdivision of NURBS.",
            "The ARGOSI application demonstrator.",
            "The modelling of images for communication in multimedia environments and the evolution from the image signal to the image document.",
            "Impact of gigabit network research on scientific visualization.",
            "Cooperative HyperMedia an enabling paradigm for cooperative work.",
            "GTI, a graphical telephone interface.",
            "Scientific and artistic investigation of multi-dimensional fractals on the AT&T Pixel Machine.",
            "Mistral-3: parallel solid modelling.",
            "Parallel processing of incremental ray tracing on a shared-memory multiprocessor.",
            "Using visualisation as a tool for model-based recognition.",
            "Data parallel volume-rendering algorithms for interactive visualization.",
            "Walk-through animation in three-dimensional scenes on massively parallel systems.",
            "Interactive volume rendering of large fields.",
            "Visualizing and modeling unstructured data.",
            "Pursuing interactive visualization of irregular grids.",
            "Interactive control of biomechanical animation.",
            "Interactive evolution of equations for procedural models."
        ]
    },
    {
        "name": "TVC",
        "year": "1991",
        "info": "Volume 8, 1991/1992",
        "count": 30,
        "papers": [
            "The Globall Hyperatlas: a development proposal.",
            "Harthong-Reeb analysis and digital circles.",
            "Display techniques and boundary evaluation of a Sweep-CSG modeller.",
            "Step length in forward differencing for curved surface display.",
            "Surface intersection by switching from recursive subdivision to iterative refinement.",
            "Short communication Visualizing steepest descent.",
            "A bootstrap approach to visual user-interface design and development.",
            "Environment for rapidly creating interactive design tools.",
            "QUICK: a tool for graphical user-interface construction by non-programmers.",
            "A visual tool for user-interface development.",
            "Integer subdivision algorithm for rendering NURBS curves.",
            "A surface-scanning algorithm for displaying generalized cylinders.",
            "Using multivariate resultants to find the implicit equation of a rational surface.",
            "Accelerating ARTS.",
            "Orientation-based unique representation for planar curves and shapes.",
            "Short communication A simple algorithm giving an interesting Mandelbrot set.",
            "Fast algorithms and parallel structures for form factor evaluation.",
            "Application of morphological filters to tackle discretisation artefacts.",
            "On the aesthetics of inversion and osculation.",
            "Geometric modeling of curves using weighted linear and circular segments.",
            "Surface modeling method by polygonal primitives for visualizing three-dimensional volume data.",
            "A physically-based particle model of woven cloth.",
            "Normal estimation in 3D discrete space.",
            "Cutaways and ghosting: satisfying visibility constraints in dynamic 3D illustrations.",
            "Fast solutions to physical equilibrium and interpolation problems.",
            "Precise rendering method for exact anti-aliasing and highlighting.",
            "Visualising two-dimensional vector fields using directed halftone cells.",
            "Theory of contact for geometric continuity of parametric curves.",
            "Image processing and synthesis for extended depth of field of optical microscopes.",
            "Visualization resources and strategies for remote subsea exploration."
        ]
    },
    {
        "name": "TVC",
        "year": "1991",
        "info": "Volume 7, 1991",
        "count": 28,
        "papers": [
            "Semi-globalization of stochastic spectral synthesis.",
            "Using color-image maps to study collisions in the three-body problem.",
            "An efficient algorithm for line and polygon clipping.",
            "An iterative approach to dynamic simulation of 3-D rigid-body motions for real-time interactive computer animation.",
            "Designing parametric blends: surface model and geometric correspondence.",
            "A localized method for intersecting plane algebraic curve segments.",
            "The homotopy model: a generalized model for smooth surface generation from cross sectional data.",
            "Boolean operations for solids with free-form surfaces through polyhedral approximation.",
            "Drawing human hair using the Wisp model.",
            "Volume tracing of atmospheric environments.",
            "Composition of multiple figure sequences for dance and animation.",
            "A software architecture for integrating modeling with kinematic and dynamic animation.",
            "Reliability of computer graphic images for visual assessment.",
            "A flexible quantitative method for NC machining verification using a space-division based solid model.",
            "Recent developments in molecular graphics: visualization of chemical structures and properties.",
            "A computational method for simulating growth patterns in unicell propagation.",
            "Stochastic Ray Tracing Using SIMD Processor Arrays.",
            "Diffuse interreflections - Techniques for form-factor computation: a survey.",
            "Animation of fracture by physical modeling.",
            "Short communication Algorithm visualization using tree graphs.",
            "Halftoning without dither or edge enhancement.",
            "Photorealistic image synthesis for outdoor scenery under various atmospheric conditions.",
            "A simple method for rendering penumbrae caused by sunlight.",
            "A scanline algorithm for displaying trimmed surfaces by using Bézier clipping.",
            "Efficient triangulation of simple polygons.",
            "A geometry-based investigation of the tool path generation for zigzag pocket machining.",
            "Interactive design of 3D models with geometric constraints.",
            "A model for integrating multimedia information around 3D graphics hierarchies."
        ]
    },
    {
        "name": "TVC",
        "year": "1990",
        "info": "Volume 6, 1990",
        "count": 33,
        "papers": [
            "Volume rendering by adaptive refinement.",
            "Ray tracing voxel data via biquadratic local surface interpolation.",
            "Real time discrete shading.",
            "3D Visualization of tomographic volume data using the generalized voxel model.",
            "Brain peeling: viewing the inside of a laminar three-dimensional solid.",
            "Interactive garment design.",
            "A highly flexible multiprocessor solution for ray tracing.",
            "Scaling low-resolution bitmaps fonts using linear feature extraction.",
            "An object-oriented architecture for a computer animation system.",
            "Computer image generation for flight simulators: the Gabor approach.",
            "A technique for motion specification in computer animation.",
            "Who invented ray tracing?",
            "Ray-bound tracing for perfect and efficient anti-aliasing.",
            "Improved techniques for ray tracing parametric surfaces.",
            "Heuristics for ray tracing using space subdivision.",
            "Efficient traversal of well-behaved hierarchical trees of extents for ray-tracing complex scenes.",
            "Approximating CSG trees of moving objects.",
            "Improving computer interfaces by animation from videodisc.",
            "Evaluation of true 3D display systems for visualizing medical volume data.",
            "A note on inverted Mandelbrot sets.",
            "Vu: visual user-interface design.",
            "Using hand position for virtual object placement.",
            "Low-cost hardware platform for developing realtime 3D graphics.",
            "Two data structures for building tetrahedralizations.",
            "Graph-directed modelling from serial sections.",
            "Adaptive polygonization of parametric surfaces.",
            "Polygon-based post-process motion blur.",
            "A case study: the making of Pencil Test.",
            "Singularity theoretical modeling and animation of garment wrinkle formation processes.",
            "Facial image synthesis using skin texture recording.",
            "A global human walking model with real-time kinematic personification.",
            "Directing an animated scene with autonomous actors.",
            "A picture of a butter-fly with diffusion-shaped wings."
        ]
    },
    {
        "name": "TVC",
        "year": "1989",
        "info": "Volume 5, 1989",
        "count": 30,
        "papers": [
            "Quaternion calculus as a basic tool in computer graphics.",
            "Sampling point setting on cubic splines for computer animation.",
            "Dynamics and unification of animation control.",
            "Design, transformation and animation of human faces.",
            "Constructive picture description with Euclidean geometry.",
            "Applications of Euclidean constructions to computer graphics.",
            "On geodesic properties of polygons relevant to linear time triangulation.",
            "Field functions for implicit surfaces.",
            "Generalized symmetry and its application to 3D shape generation.",
            "Skeleton-based image warping.",
            "Static load balancing for a parallel ray tracing on a MIMD hypercube.",
            "A VLSI system architecture for high-speed radiative transfer 3D image synthesis.",
            "Quadratic blending surfaces for complex corners.",
            "Display of profiled sweep objects.",
            "Vector interpolation for surface normal calculation.",
            "Smooth appearance for polygonal surfaces.",
            "Coding and generating complex periodic patterns.",
            "The originality of Kandinsky's compositions.",
            "The electronic design notebook: performing medium and processing medium.",
            "The electronic sketch book of Tibetan Thangka painting.",
            "Hindu temples: models of a fractal universe.",
            "Apex: two architectures for generating parametric curves and surfaces.",
            "On the geometry of Dupin cyclides.",
            "Feature based object decomposition for finite element meshing.",
            "Geometry-defining processors for engineering design and analysis.",
            "An analysis of assembly.",
            "Approximate methods for simulation and verification of numerically controlled machining programs.",
            "A comparison of the space requirements of multi-dimensional quadtree-based file structures.",
            "Representation of piecewise continuous algebraic surface in terms of B-splines.",
            "Visualization of time-discrete dynamical systems."
        ]
    },
    {
        "name": "TVC",
        "year": "1988",
        "info": "Volume 4, 1988",
        "count": 29,
        "papers": [
            "Limitations of the computer as a tool for the fine artist.",
            "Computer-generated images and traditional printmaking.",
            "The computer: liberator or jailor of the creative spirit.",
            "Cybernetic jewelry: ornament for the information age.",
            "The computer - a new tool for visual art.",
            "The Mona Lisa identification: evidence from a computer analysis.",
            "Octree creation via C.S.G. definition.",
            "Analysis of an algorithm for fast ray tracing using uniform space subdivision.",
            "Visibility problems for orthogonal objects in two- or three-dimensions.",
            "Visual interaction using an iconic system.",
            "Horizon mapping: shadows for bump-mapped surfaces.",
            "Two algorithms for taking advantage of temporal coherence in ray tracing.",
            "Hierarchical structure to winged-edge structure: a conversion algorithm.",
            "Symmetry, beauty and chaos in Chebyshev's paradise.",
            "TSL - a Texture Synthesis Language.",
            "An approach for the integration of general purpose graphics systems and window management.",
            "Applications of the 4 x 4 determinant method and the POLYGON ENGINE.",
            "Multiprocessing for ray tracing: a hierarchical self-balancing approach.",
            "Load balancing strategies for a parallel ray-tracing system based on constant subdivision.",
            "The CUBE Workstation - a 3-D voxel-based graphics environment.",
            "Mechatronics engineering education and dissemination program.",
            "Chaotic behavior of the transcendental mapping (z cosh(z) + µ).",
            "Parallel, overlapped, and intersected digital straight lines.",
            "GeomstoneFire: adaptive dispersive ray tracing of polyhedrons.",
            "The use of image processing techniques in rendering maps with deterministic chaos.",
            "Dynamic animation: interaction and control.",
            "Mixed methods for complex kinematic constraints in dynamic figure animation.",
            "Deformable models.",
            "The behavioral test-bed: obtaining complex behavior from simple rules."
        ]
    },
    {
        "name": "TVC",
        "year": "1987",
        "info": "Volume 3, 1987/1988",
        "count": 35,
        "papers": [
            "A practical method of constructing surface in three-dimensional digitized space.",
            "Parallel processing of an object space for image synthesis using ray tracing.",
            "Animation with fractals from variations on the Mandelbrot set.",
            "Surface representations based on triangular grids.",
            "Image synthesis and 3-D computer animation: a new approach for strategic analysis.",
            "The simulation of natural features using cone tracing.",
            "An application of algebraic topology to solid modeling in molecular biology.",
            "Automating map production of the 1981 Census data for Brighton and Hove, England.",
            "Theoretical foundations for the 4 x 4 determinant method in computer graphics and geometric modelling.",
            "A new space subdivision method for ray tracing CSG modelled scenes.",
            "The mathematics of computer graphics.",
            "Lens effect on synthetic image generation based on light particle theory.",
            "Reconstruction and semi-transparent display method for observing inner structure of an object consisting of multiple surfaces.",
            "A geometric study of parameters for the recursive midpoint subdivision.",
            "B 2-splines: a local representation for cubic spline interpolation.",
            "Real time virtual window management for bit mapped raster graphics.",
            "An algorithm for visible-line and visible-surface display of CSG models.",
            "Texture modelling applications.",
            "Data structures and the time complexity of ray tracing.",
            "Tolerances in computer-aided geometric design.",
            "Translation separability of sets of polygons.",
            "Box Sort, a multidimensional binary sorting method for rectangular boxes, used for quick range searching.",
            "Human body animation: a survey.",
            "Human skin model capable of natural shape variation.",
            "Animation of a B-Spline figure.",
            "Animating speech: an automated approach using speech synthesised by rules.",
            "Abstract muscle action procedures for human face animation.",
            "VISYR: a simulation tool for mobile robots using vision sensors.",
            "Planning collision-free trajectories in time-varying environments: a two-level hierarchy.",
            "Computing the volume of the union of spheres.",
            "Hidden-surface removal in polyhedral cross-sections.",
            "Recognizing polygons, or how to spy.",
            "Solving visibility and separability problems on a Mesh-of-Processors.",
            "Parallel algorithms for shortest path problems in polygons.",
            "Fast algorithms for computing the diameter of a finite planar set."
        ]
    },
    {
        "name": "TVC",
        "year": "1986",
        "info": "Volume 2, 1986",
        "count": 37,
        "papers": [
            "Dispersive refraction in ray tracing.",
            "Experimental CSG environment for modelling solid.",
            "A menu generator for audio visual networks.",
            "Clustering methods for geometric objects and applications to design problems.",
            "Optical clustering.",
            "A linear algorithm for eliminating hidden-lines from a polygonal cylinder.",
            "Graphics interface tool development in a problem solving environment.",
            "Video-graphic query facility for database retrieval.",
            "CrossoverNet: A computer graphics/video crossover LAN system.",
            "Three-dimensional display of X-ray CT image.",
            "Automatic dyschromatopsia test.",
            "Production of artistic images with \"ART PROCESSOR\".",
            "Techniques in computer art.",
            "A formalization for the specification and systematic generation of computer graphics systems.",
            "Digital media: Bridges between data particles and artifacts.",
            "Intimate machine interaction.",
            "Atoms to astronomy: Computer graphics at the Jet Propulsion Laboratory.",
            "Doraemon as an artistic image processor.",
            "Interactive manipulation of three dimensional binary scenes.",
            "G-quadtree: A hierarchical representation of gray-scale digital images.",
            "Data structure for soft objects.",
            "Animating soft objects.",
            "Pixelated structures as a compositional medium.",
            "Computer artist's color naming system.",
            "A characterization of illumination models and shading techniques.",
            "Tutorial on color science.",
            "Radiosity: A method for computing global illumination.",
            "The back-buffer algorithm: An extension of the radiosity method to dynamic environments.",
            "Rendering gems with asterism or chatoyancy.",
            "Texture mapping and distortion in digital graphics.",
            "The visual simulation of amorphous phenomena.",
            "Automated generation of simply connected solid objects from wire-frame data using operations on graphs.",
            "Visibility between two edges of a simple polygon.",
            "Database support for solid modeling.",
            "Grid stage modelling functions and molecular vector graphics.",
            "Caustics and specular reflection models for spherical objects and lenses.",
            "A \"lifegame\" approach to surface modeling and rendering."
        ]
    },
    {
        "name": "TVC",
        "year": "1985",
        "info": "Volume 1, 1985",
        "count": 24,
        "papers": [
            "A functional model for constructive solid geometry.",
            "Area, spline-based and structural models for generating and animating 3D characters and logos.",
            "A viewing pipeline for discrete solid modeling.",
            "Optimal algorithms for symmetry detection in two and three dimensions.",
            "Chemical ideograms and molecular computer graphics.",
            "The plane with parallel coordinates.",
            "Automatic surface generation in computer aided design.",
            "Some applications of resultants to problems in computational geometry.",
            "Surface representation for the graphical display of structured data.",
            "Minimum area circumscribing Polygons.",
            "A simple linear algorithm for intersecting convex polygons.",
            "A unifying approach for a class of problems in the computational geometry of polygons.",
            "Voronoi diagrams with barriers and on polyhedra for minimal path planning.",
            "Generative design in architecture using an expert system.",
            "Detection of cardiac wall motion asynchrony by computer analysis techniques.",
            "How map designers can represent their ideas in thematic maps.",
            "Hologram-like transmission of pictures.",
            "Color spaces and color contrast.",
            "Positioning and animating human figures in a task-oriented environment.",
            "Algorithms for brush movement.",
            "The dynamics of articulated rigid bodies for purposes of animation.",
            "A model for the three-dimensional reconstruction and animation of the human heart.",
            "Towards an integrated view of 3-D Computer animation.",
            "Interactive animation of parametric models."
        ]
    }
]