[
    {
        "name": "AEI",
        "year": "2022",
        "info": "2022 Volumes:\n51,",
        "count": 78,
        "papers": [
            "3D CAD model retrieval based on sketch and unsupervised variational autoencoder.",
            "A multi-fidelity surrogate modeling approach for incorporating multiple non-hierarchical low-fidelity data.",
            "Highly accurate energy consumption forecasting model based on parallel LSTM neural networks.",
            "Data science and reinforcement learning for price forecasting and raw material procurement in petrochemical industry.",
            "Multi-class fuzzy support matrix machine for classification in roller bearing fault diagnosis.",
            "The multi-user computer-aided design collaborative learning framework.",
            "Heterogeneous star graph attention network for product attributes prediction.",
            "A novel directional object detection method for piled objects using a hybrid region-based convolutional neural network.",
            "Multi-ontology fusion and rule development to facilitate automated code compliance checking using BIM and rule-based reasoning.",
            "Drone mapping of damage information in GPS-Denied disaster sites.",
            "Modelling the impacts of crowds on occupants in the built environment - A static, rule-based approach to human perception and movement.",
            "A fuzzy rough number extended AHP and VIKOR for failure mode and effects analysis under uncertainty.",
            "Teaching generative construction scheduling: Proposed curriculum design and analysis of student learning for the Tri-Constraint Method.",
            "Computer vision-based approach for smart traffic condition assessment at the railroad grade crossing.",
            "Soccer shoe recommendation system based on multitechnology integration for digital transformation.",
            "An integrated framework of user experience-oriented smart service requirement analysis for smart product service system development.",
            "Digital twin-driven clamping force control for thin-walled parts.",
            "Investigating hazard recognition in augmented virtuality for personalized feedback in construction safety education and training.",
            "Digital twin-driven surface roughness prediction and process parameter adaptive optimization.",
            "Deep-learning-based anomaly detection for lace defect inspection employing videos in production line.",
            "Deep learning driven real time topology optimisation based on initial stress learning.",
            "Interactive defect quantification through extended reality.",
            "Applications of machine learning to BIM: A systematic literature review.",
            "Wayfinding behaviour in a multi-level building: A comparative study of HMD VR and Desktop VR.",
            "Developing an integrated platform to enable hardware-in-the-loop for synchronous VR, traffic simulation and sensor interactions.",
            "Design of digital twin applications in automated storage yard scheduling.",
            "SplineLearner: Generative learning system of design constraints for models represented using B-spline surfaces.",
            "Bilateral slot exchange and co-allocation for liner alliance carriers of containerized maritime logistics.",
            "A reinforcement ensemble deep transfer learning network for rolling bearing fault diagnosis with Multi-source domains.",
            "Implementation path and reference framework for Industrial Internet Platform (IIP) in product service system using industrial practice investigation method.",
            "Long-time gap crowd prediction using time series deep learning models with two-dimensional single attribute inputs.",
            "Sensor placement for robust burst identification in water systems: Balancing modeling accuracy, parsimony, and uncertainties.",
            "Application of covering rough granular computing model in collaborative filtering recommendation algorithm optimization.",
            "Feature-based modeling for industrial processes in the context of digital twins: A case study of HVOF process.",
            "Towards a unifying domain model of construction safety, health and well-being: SafeConDM.",
            "A collaborative design platform for new alloy material development.",
            "Collaborative optimization for loading operation planning and vessel traffic scheduling in dry bulk ports.",
            "Extracting structural components of concrete buildings from laser scanning point clouds from construction sites.",
            "Machine identification of potential manufacturing process failure modes based on process constituent elements.",
            "Integration of parametric modelling in web-based knowledge-based engineering applications.",
            "Edge-cloud cooperation driven self-adaptive exception control method for the smart factory.",
            "Achieving Knowledge-as-a-Service in IIoT-driven smart manufacturing: A crowdsourcing-based continuous enrichment method for Industrial Knowledge Graph.",
            "Automated system for construction specification review using natural language processing.",
            "Improved similarity assessment and spectral clustering for unsupervised linking of data extracted from bridge inspection reports.",
            "Ensemble-learning approach for the classification of Levels Of Geometry (LOG) of building elements.",
            "A review of augmented reality visualization methods for subsurface utilities.",
            "Development and evaluation of BCI for operating VR flight simulator based on desktop VR equipment.",
            "Editorial Notes: Emerging intelligent automation and optimisation methods for adaptive decision making.",
            "3D point cloud data processing with machine learning for construction and infrastructure applications: A comprehensive review.",
            "A novel function-structure concept network construction and analysis method for a smart product design system.",
            "An automatic energy saving strategy for a water dispenser based on user behavior.",
            "A design method for an intelligent manufacturing and service system for rehabilitation assistive devices and special groups.",
            "An approach to capturing and reusing tacit design knowledge using relational learning for knowledge graphs.",
            "Research on optimizing-assembly and optimizing-adjustment technologies of aero-engine fan rotor blades.",
            "Recovery planning of industrial robots based on semantic information of failures and time-dependent utility.",
            "DRLSTM: A dual-stage deep learning approach driven by raw monitoring data for dam displacement prediction.",
            "Graph-based reinforcement learning for discrete cross-section optimization of planar steel frames.",
            "Maximum margin Riemannian manifold-based hyperdisk for fault diagnosis of roller bearing with multi-channel fusion covariance matrix.",
            "Feature modeling for configurable and adaptable modular buildings.",
            "A knowledge graph-based data representation approach for IIoT-enabled cognitive manufacturing.",
            "Counterfactual inference to predict causal knowledge graph for relational transfer learning by assimilating expert knowledge -Relational feature transfer learning algorithm.",
            "Promoting employee health in smart office: A survey.",
            "Non-invasive embedded system hardware/firmware anomaly detection based on the electric current signature.",
            "Development and validation of a confined space rescue training prototype based on an immersive virtual reality serious game.",
            "Investigation of the relationship between Ironworker's gait stability and different types of load carrying using wearable sensors.",
            "An integrated framework for blockchain-enabled supply chain trust management towards smart manufacturing.",
            "Multi-attribute negotiation mechanism for manufacturing service allocation in smart manufacturing.",
            "Advanced computing methods and related technologies for constructing smart cities.",
            "Intelligent decision-making model in preventive maintenance of asphalt pavement based on PSO-GRU neural network.",
            "Lot-sizing decisions for material requirements planning with hybrid uncertainties in a smart factory.",
            "Evolution pathways of robotic technologies and applications in construction.",
            "A hybrid hierarchical agent-based simulation approach for buildings indoor layout evaluation based on the post-earthquake evacuation.",
            "Upper-body haptic system for snake robot teleoperation in pipelines.",
            "Revealing the dual importance and Kano type of attributes through customer review analytics.",
            "Highly imbalanced fault diagnosis of mechanical systems based on wavelet packet distortion and convolutional neural networks.",
            "Solving the vehicle routing problem with drone for delivery services using an ant colony optimization algorithm.",
            "Engineering knowledge formalization and proposition for informatics development towards a CAD-integrated DfX system for product design.",
            "Corrigendum to \"A review of augmented reality visualization methods for subsurface utilities\" [Adv. Eng. Inf. 51 (2022) 101498]."
        ]
    },
    {
        "name": "AEI",
        "year": "2021",
        "info": "2021 Volumes:\n47,\n48,\n49,\n50",
        "count": 197,
        "papers": [
            "Methods for the Automated Assignment and Comparison of Building Damage Geometries.",
            "Introduction of a time series machine learning methodology for the application in a production system.",
            "Modeling dynamic construction work template from existing scheduling records via sequential machine learning.",
            "Automatic classification of wall and door BIM element subtypes using 3D geometric deep neural networks.",
            "Advancing post-earthquake structural evaluations via sequential regression-based predictive mean matching for enhanced forecasting in the context of missing data.",
            "The use of decision tree based predictive models for improving the culvert inspection process.",
            "A cooperative game theory based user-centered medical device design decision approach under uncertainty.",
            "Bottom-up image detection of water channel slope damages based on superpixel segmentation and support vector machine.",
            "Automatic defect detection of metro tunnel surfaces using a vision-based inspection system.",
            "Cognitive factors of the transfer of empirical engineering knowledge: A behavioral and fNIRS study.",
            "A target-oriented DEA model for regional construction productive efficiency improvement in China.",
            "Evolutionary digital twin: A new approach for intelligent industrial product development.",
            "Online monitoring and collaborative scheduling method for wheelset cyber-physical production system: A wheelset manufacturing system case study from a Chinese high-speed train enterprise.",
            "Modified OFS-RDS bat algorithm for IFS encoding of bitmap fractal binary images.",
            "Multi-modal transportation planning for multi-commodity rebalancing under uncertainty in humanitarian logistics.",
            "Container storage space assignment problem in two terminals with the consideration of yard sharing.",
            "Digital Twin as a Service (DTaaS) in Industry 4.0: An Architecture Reference Model.",
            "A framework of pavement management system based on IoT and big data.",
            "An integrated emotional and physiological assessment for VR-based active shooter incident experiments.",
            "Design gene based secure mechanism for collaborative product development.",
            "A context-aware approach to automated negotiation using reinforcement learning.",
            "Sparse kernel regression technique for self-cleansing channel design.",
            "Validating model-based data interpretation methods for quantification of reserve capacity.",
            "Performance Evaluation Indicator (PEI): A new paradigm to evaluate the competence of machine learning classifiers in predicting rockmass conditions.",
            "A case study comparing the completeness and expressiveness of two industry recognized ontologies.",
            "Optimizing 3D Irregular Object Packing from 3D Scans Using Metaheuristics.",
            "Part-of-speech tagging of building codes empowered by deep learning and transformational rules.",
            "A Building Information Model enabled Multiple Traveling Salesman Problem for building interior patrols.",
            "Ambient acoustic event assistive framework for identification, detection, and recognition of unknown acoustic events of a residence.",
            "Character-based hazard warning mechanics: A network of networks approach.",
            "Kansei evaluation for group of users: A data-driven approach using dominance-based rough sets.",
            "An information entropy and latent Dirichlet allocation approach to noise patent filtering.",
            "Corrigendum to \"Intelligent collaborative patent mining using excessive topic generation\" [Adv. Eng. Inf. 42 (2019) 100955].",
            "Semantic enrichment of building and city information models: A ten-year review.",
            "A systematic literature review on intelligent automation: Aligning concepts from theory, practice, and future perspectives.",
            "Data driven supplier selection as a circular economy enabler: A Taguchi capability index for manufactured products with asymmetric tolerances.",
            "The role of user-centered AR instruction in improving novice spatial cognition in a high-precision procedural task.",
            "Scalable multi-process inter-server collaborative design synthesis in the Internet distributed resource environment.",
            "Modeling berth allocation and quay crane assignment considering QC driver cost and operating efficiency.",
            "Intelligent fault diagnosis for rolling bearings based on graph shift regularization with directed graphs.",
            "SMD LED chips defect detection using a YOLOv3-dense model.",
            "A small samples training framework for deep Learning-based automatic information extraction: Case study of construction accident news reports analysis.",
            "Adaptive feature-conserving compression for large scale point clouds.",
            "Semantic information alignment of BIMs to computer-interpretable regulations using ontologies and deep learning.",
            "Fusing data, engineering knowledge and artificial intelligence for the built environment.",
            "A convolutional neural network based degradation indicator construction and health prognosis using bidirectional long short-term memory network for rolling bearings.",
            "Competitive substitution and technological diffusion for semiconductor foundry firms.",
            "A process knowledge representation approach for decision support in design of complex engineered systems.",
            "Knowledge-based integrated product design framework towards sustainable low-carbon manufacturing.",
            "Investigating the influence of route turning angle on compliance behaviors and evacuation performance in a virtual-reality-based experiment.",
            "Feature-based ontological framework for semantic interoperability in product development.",
            "Common design structures and substitutable feature discovery in CAD databases.",
            "Supporting resilient conceptual design using functional decomposition and conflict resolution.",
            "Automated composition and execution of web-based simulation systems through knowledge designing and reasoning.",
            "A knowledge transfer framework to support rapid process modeling in aerosol jet printing.",
            "Autoencoder-based anomaly detection for surface defect inspection.",
            "Unmanned aerial vehicle based low carbon monitoring planning.",
            "The optimization of warehouse location and resources distribution for emergency rescue under uncertainty.",
            "Optimizing parcel sorting process of vertical sorting system in e-commerce warehouse.",
            "Driver behavior detection via adaptive spatial attention mechanism.",
            "Assessing future landscapes using enhanced mixed reality with semantic segmentation by deep learning.",
            "Many-to-many comprehensive relative importance analysis and its applications to analysis of semiconductor electrical testing parameters.",
            "A rough set-based interval-valued intuitionistic fuzzy conceptual design decision approach with considering diverse customer preference distribution.",
            "Quay crane scheduling in automated container terminal for the trade-off between operation efficiency and energy consumption.",
            "Smart dispatching and optimal elevator group control through real-time occupancy-aware deep learning of usage patterns.",
            "A better estimation of wave arrival time in water distribution networks using WAvelet kNEe (WANE).",
            "Ontology and rule-based natural language processing approach for interpreting textual regulations on underground utility infrastructure.",
            "Dynamic ensemble wind speed prediction model based on hybrid deep reinforcement learning.",
            "An intelligent content-based image retrieval methodology using transfer learning for digital IP protection.",
            "Scheduling of collaborative operations of yard cranes and yard trucks for export containers using hybrid approaches.",
            "Measuring accessibility of urban scales: A trip-based interaction potential model.",
            "A holistic method of complex product development based on a neural network-aided technological evolution system.",
            "An automatic real-time bus schedule redesign method based on bus arrival time prediction.",
            "Systematic selection of field response measurements for excavation back analysis.",
            "A review of digital twin in product design and development.",
            "Immersive technology-driven investigations on influence factors of cognitive load incurred in construction site hazard recognition, analysis and decision making.",
            "An integrated optimization method for tactical-level planning in liner shipping with heterogeneous ship fleet and environmental considerations.",
            "Logistics service provider selection decision making for healthcare industry based on a novel weighted density-based hierarchical clustering.",
            "A systematic data-mining-based methodology for product family design and product configuration.",
            "Visitor-artwork network analysis using object detection with image-retrieval technique.",
            "Advancing formative assessment in MCAD education: The visual analytics of parametric feature-based solid models.",
            "A synthetical development approach for rehabilitation assistive smart product-service systems: A case study.",
            "Automatic modeling and fault diagnosis of car production lines based on first-principle qualitative mechanics and semantic web technology.",
            "Using footstep-induced vibrations for occupant detection and recognition in buildings.",
            "Weld-seam identification and model reconstruction of remanufacturing blade based on three-dimensional vision.",
            "Pavement crack detection using hessian structure propagation.",
            "Customer complaints monitoring with customer review data analytics: An integrated method of sentiment and statistical process control analyses.",
            "Digital twin modeling for loaded contact pattern-based grinding of spiral bevel gears.",
            "A heuristic optimization approach for multi-vehicle and one-cargo green transportation scheduling in shipbuilding.",
            "Assessment and prioritization method of key engineering characteristics for complex products based on cloud rough numbers.",
            "Ordering and transferring model of dual-channel supply chain with delivery time difference.",
            "High-speed train fault detection with unsupervised causality-based feature extraction methods.",
            "From regional sensitivity to intra-sensitivity for parametric analysis of free-form shapes: Application to ship design.",
            "Intelligent fault recognition framework by using deep reinforcement learning with one dimension convolution and improved actor-critic algorithm.",
            "Transdisciplinary systems approach to realization of digital transformation.",
            "AFCM-LSMA: New intelligent model based on Lévy slime mould algorithm and adaptive fuzzy C-means for identification of COVID-19 infection from chest X-ray images.",
            "A predictive maintenance system for multi-granularity faults based on AdaBelief-BP neural network and fuzzy decision making.",
            "A relational framework for smart information delivery manual (IDM) specifications.",
            "A newly-designed fault diagnostic method for transformers via improved empirical wavelet transform and kernel extreme learning machine.",
            "Automatic representation and detection of fault bearings in in-wheel motors under variable load conditions.",
            "Research on economic benefits of multi-city logistics development based on data-driven analysis.",
            "Green logistics oriented tug scheduling for inland waterway logistics.",
            "Development of Industry 4.0 predictive maintenance architecture for broadcasting chain.",
            "A human-centred approach based on functional near-infrared spectroscopy for adaptive decision-making in the air traffic control environment: A case study.",
            "Digital Twins for the built environment: learning from conceptual and process models in manufacturing.",
            "Context-aware sequence labeling for condition information extraction from historical bridge inspection reports.",
            "Integrated scheduling and flexible maintenance in deteriorating multi-state single machine system using a reinforcement learning approach.",
            "Enhanced customer requirement classification for product design using big data and improved Kano model.",
            "Intelligent workload balance control of the assembly process considering condition-based maintenance.",
            "Building surrogate models for engineering problems by integrating limited simulation data and monotonic engineering knowledge.",
            "Data-driven shuttle service design for sustainable last mile transportation.",
            "A decision-making model for knowledge collaboration and reuse through scientific workflow.",
            "Automation and optimization in crane lift planning: A critical review.",
            "Research on group awareness of networked collaboration within the design team and between teams.",
            "Dynamic parameter inverse analysis of concrete dams based on Jaya algorithm with Gaussian processes surrogate model.",
            "Sustainable innovation pathway for mechanical products by inducing characteristic parameters.",
            "Diagnostic test decision for suppliers in cruise-building supply chain with information asymmetry.",
            "Virtual reality-based evaluation of indoor earthquake safety actions for occupants.",
            "A function-oriented biologically analogical approach for constructing the design concept of smart product in Industry 4.0.",
            "Evaluating the attitudes of different trainee groups towards eye tracking enhanced safety training methods.",
            "Converting detailed estimates to primary estimates with data augmentation.",
            "On-site text classification and knowledge mining for large-scale projects construction by integrated intelligent approach.",
            "Recognition of pedestrian trajectories and attributes with computer vision and deep learning techniques.",
            "Evaluating the effectiveness of biometric sensors and their signal features for classifying human experience in virtual environments.",
            "Predicting workers' inattentiveness to struck-by hazards by monitoring biosignals during a construction task: A virtual reality experiment.",
            "Deep reinforcement learning-based safe interaction for industrial human-robot collaboration using intrinsic reward function.",
            "Product redesign using functional backtrack with digital twin.",
            "Improving traffic prediction using congestion propagation patterns in smart cities.",
            "Forecasting building energy consumption: Adaptive long-short term memory neural networks driven by genetic algorithm.",
            "Teaching and Learning Crystal structures through Virtual Reality based systems.",
            "Feasibility of augmented reality technology for communication in the construction industry.",
            "A method for the analysis of the interaction between users and objects in 3D navigational space.",
            "An individual-based spatio-temporal travel demand mining method and its application in improving rebalancing for free-floating bike-sharing system.",
            "Integrating and navigating engineering design decision-related knowledge using decision knowledge graph.",
            "Increasing occupant localization precision through identification of footstep-contact dynamics.",
            "Unraveling the capabilities that enable digital transformation: A data-driven methodology and the case of artificial intelligence.",
            "Data-driven order correlation pattern and storage location assignment in robotic mobile fulfillment and process automation system.",
            "An IIoT-driven and AI-enabled framework for smart manufacturing system based on three-terminal collaborative platform.",
            "Crowdsourcing the perceived urban built environment via social media: The case of underutilized land.",
            "A semi-supervised learning detection method for vision-based monitoring of construction sites by integrating teacher-student networks and data augmentation.",
            "A customer-involved design concept evaluation based on multi-criteria decision-making fusing with preference and design values.",
            "Applying incremental Deep Neural Networks-based posture recognition model for ergonomics risk assessment in construction.",
            "Lifting path planning of mobile cranes based on an improved RRT algorithm.",
            "Greenness assessment of supply chains via intuitionistic fuzzy based approaches.",
            "Risk of fire emergency evacuation in complex construction sites: Integration of 4D-BIM, social force modeling, and fire quantitative risk assessment.",
            "The impact of CCT on driving safety in the normal and accident situation: A VR-based experimental study.",
            "An enhanced 3D model and generative adversarial network for automated generation of horizontal building mask images and cloudless aerial photographs.",
            "Simulation and optimization of automated masonry construction using cable robots.",
            "A new Feature-Fusion method based on training dataset prototype for surface defect recognition.",
            "A real-time vehicle detection and a novel vehicle tracking systems for estimating and monitoring traffic flow on highways.",
            "A context-aware concept evaluation approach based on user experiences for smart product-service systems design iteration.",
            "A digital twin-driven approach towards traceability and dynamic control for processing quality.",
            "A multi-head neural network with unsymmetrical constraints for remaining useful life prediction.",
            "Machine learning method for CPTu based 3D stratification of New Zealand geotechnical database sites.",
            "A framework for semi-automatically identifying fully occluded objects in 3D models: Towards comprehensive construction design review in virtual reality.",
            "Identifying shoplifting behaviors and inferring behavior intention based on human action detection and sequence analysis.",
            "Computer vision and long short-term memory: Learning to predict unsafe behaviour in construction.",
            "Robustness analysis framework for computations associated with building performance models and immersive virtual experiments.",
            "Cooperative surveillance systems and digital-technology enabler for a real-time standard terminal arrival schedule displacement.",
            "Post disaster adaptation management in airport: A coordination of runway and hangar resources for relief cargo transports.",
            "A survey of modeling for prognosis and health management of industrial equipment.",
            "Combining empirical mode decomposition and deep recurrent neural networks for predictive maintenance of lithium-ion battery.",
            "An improved convolutional neural network with an adaptable learning rate towards multi-signal fault diagnosis of hydraulic piston pump.",
            "A novel deep learning prediction model for concrete dam displacements using interpretable mixed attention mechanism.",
            "An approach to user knowledge acquisition in product design.",
            "A parameter-extended case-based reasoning method based on a functional basis for automated experiential reasoning in mechanical product designs.",
            "Exploring augmented reality for worker assistance versus training.",
            "VR-Electricians: Immersive storytelling for attracting students to the electrical construction industry.",
            "Research on construction and application of gene network model for form design based on consumer's preference.",
            "Hierarchical control for cornering stability of dual-motor RWD vehicles with electronic differential system using PSO optimized SOSMC method.",
            "Artificial intelligence for BIM content management and delivery: Case study of association rule mining for construction detailing.",
            "Reno-Inst: An ontology to support renovation projects planning and renovation products installation.",
            "Bridge inspection named entity recognition via BERT and lexicon augmented machine reading comprehension neural model.",
            "An application of metadata-based image retrieval system for facility management.",
            "Two hybrid meta-heuristic algorithms for a dual-channel closed-loop supply chain network design problem in the tire industry under uncertainty.",
            "Context-aware cognitive design assistant: Implementation and study of design rules recommendations.",
            "Graph-based algorithmic design and decision-making framework for district heating and cooling plant positioning and network planning.",
            "Virtual restoration of the colored paintings on weathered beams in the Forbidden City using multiple deep learning algorithms.",
            "Integrating crowd-/service-sourcing into digital twin for advanced manufacturing service innovation.",
            "Impact of information display on worker performance for wood frame wall assembly using AR HMD under different task conditions.",
            "Supplier selection with different risk preferences and attribute sets: An innovative study based on generalized linguistic term sets.",
            "INTERVALES: INTERactive Virtual and Augmented framework for industriaL Environment and Scenarios.",
            "Conceptual design evaluation considering the ambiguity semantic variables fusion with conflict beliefs: An integrated Dempster-Shafer evidence theory and intuitionistic fuzzy -VIKOR.",
            "Understanding digital transformation in advanced manufacturing and engineering: A bibliometric analysis, topic modeling and research trend discovery.",
            "Toward AI-enabled augmented reality to enhance the safety of highway work zones: Feasibility, requirements, and challenges.",
            "Effectiveness of VR-based training on improving construction workers' knowledge, skills, and safety behavior in robotic teleoperation.",
            "Enhancing human indoor cognitive map development and wayfinding performance with immersive augmented reality-based navigation systems.",
            "Research on hybrid feature selection method of power transformer based on fuzzy information entropy.",
            "Uncertainty-aware soft sensor using Bayesian recurrent neural networks.",
            "Reassessment of climate zones for high-level pavement analysis using machine learning algorithms and NASA MERRA-2 data.",
            "Educational impact of an Augmented Reality (AR) application for teaching structural systems to non-engineering students.",
            "A screening-based gradient-enhanced Gaussian process regression model for multi-fidelity data fusion.",
            "Mass Personalisation as a Service in Industry 4.0: A Resilient Response Case Study.",
            "Mass personalization strategy under Industrial Internet of Things: A case study on furniture production.",
            "Living labs as an opportunity for experiential learning in building engineering education.",
            "An end-to-end tabular information-oriented causality event evolutionary knowledge graph for manufacturing documents.",
            "Measuring the impact of blockchain and smart contracts on construction supply chain visibility."
        ]
    },
    {
        "name": "AEI",
        "year": "2020",
        "info": "2020 Volumes:\n43,\n44,\n45,\n46",
        "count": 147,
        "papers": [
            "Computer vision for behaviour-based safety in construction: A review and future directions.",
            "BIM-based task-level planning for robotic brick assembly through image-based 3D modeling.",
            "Deep learning-based extraction of construction procedural constraints from construction regulations.",
            "Soldering defect detection in automatic optical inspection.",
            "Memetic improved cuckoo search algorithm for automatic B-spline border approximation of cutaneous melanoma from macroscopic medical images.",
            "Application of industrial pipelines data generator in the experimental analysis: Pipe spooling optimization problem definition, formulation, and testing.",
            "Smart work packaging-enabled constraint-free path re-planning for tower crane in prefabricated products assembly process.",
            "Convolutional neural networks for object detection in aerial imagery for disaster response and recovery.",
            "Smart concept design based on recessive inheritance in complex electromechanical system.",
            "Integrated parametric multi-level information and numerical modelling of mechanised tunnelling projects.",
            "Improvement of transportation cost estimation for prefabricated construction using geo-fence-based large-scale GPS data feature extraction and support vector regression.",
            "Guidelines for applied machine learning in construction industry - A case of profit margins estimation.",
            "An operation synchronization model for distribution center in E-commerce logistics service.",
            "Dynamic BIM component recommendation method based on probabilistic matrix factorization and grey model.",
            "Photo-realistic visualization of seismic dynamic responses of urban building clusters based on oblique aerial photography.",
            "Information requirements for multi-level-of-development BIM using sensitivity analysis for energy performance.",
            "Intelligent compilation of patent summaries using machine learning and natural language processing techniques.",
            "An integrated decision-making method for product design scheme evaluation based on cloud model and EEG data.",
            "Benchmark value determination of energy efficiency indexes for coal-fired power units based on data mining methods.",
            "Ensemble data mining modeling in corrosion of concrete sewer: A comparative study of network-based (MLPNN & RBFNN) and tree-based (RF, CHAID, & CART) models.",
            "Smart control of the assembly process with a fuzzy control system in the context of Industry 4.0.",
            "Two-stage stochastic programming model for generating container yard template under uncertainty and traffic congestion.",
            "Data mining for recognition of spatial distribution patterns of building heights using airborne lidar data.",
            "Onset detection of ultrasonic signals for the testing of concrete foundation piles by coupled continuous wavelet transform and machine learning algorithms.",
            "Saliency detection analysis of collective physiological responses of pedestrians to evaluate neighborhood built environments.",
            "Design a personalised product service system utilising a multi-agent system.",
            "A smart surface inspection system using faster R-CNN in cloud-edge computing environment.",
            "An improved iterative stochastic multi-objective acceptability analysis method for robust alternative selection in new product development.",
            "Healthcare service configuration based on project scheduling.",
            "Do people follow the crowd in building emergency evacuation? A cross-cultural immersive virtual reality-based study.",
            "Stakeholder-oriented systematic design methodology for prognostic and health management system: Stakeholder expectation definition.",
            "How sustainable is smart PSS? An integrated evaluation approach based on rough BWM and TODIM.",
            "IoT-enabled smart appliances under industry 4.0: A case study.",
            "IoT edge computing-enabled collaborative tracking system for manufacturing resources in industrial park.",
            "Ontological emergence scheme in self-organized and emerging systems.",
            "Constructing an exactly periodic subspace for enhancing SSVEP based BCI.",
            "SAFE: An EEG dataset for stable affective feature selection.",
            "Psychophysiological evaluation of seafarers to improve training in maritime virtual simulator.",
            "Appearance-driven conversion of polygon soup building models with level of detail control for 3D geospatial applications.",
            "Agent-based management of support systems for distributed brainstorming.",
            "An elastic manifold learning approach to beat-to-beat interval estimation with ballistocardiography signals.",
            "Deep learning-based method for vision-guided robotic grasping of unknown objects.",
            "Predictive maintenance using cox proportional hazard deep learning.",
            "A novel architecture: Using convolutional neural networks for Kansei attributes automatic evaluation and labeling.",
            "SNA-based multi-criteria evaluation of multiple construction equipment: A case study of loaders selection.",
            "Prediction of interface yield stress and plastic viscosity of fresh concrete using a hybrid machine learning approach.",
            "Deep neural network based framework for complex correlations in engineering metrics.",
            "A virtual speller system using SSVEP and electrooculogram.",
            "Automated text classification of near-misses from safety reports: An improved deep learning approach.",
            "Review visual attention and spatial memory in building inspection: Toward a cognition-driven information system.",
            "Dynamic probabilistic analysis of accidents in construction projects by combining precursor data and expert judgments.",
            "Editorial Notes: Design innovation of Smart PSS.",
            "Real-time detection of wildfire risk caused by powerline vegetation faults using advanced machine learning techniques.",
            "Real-time anomaly detection framework using a support vector regression for the safety monitoring of commercial aircraft.",
            "Automated discovery of scientific concepts: Replicating three recent discoveries in mechanics.",
            "A decision-support method for information inconsistency resolution in direct modeling of CAD models.",
            "From form features to semantic features in existing MCAD: An ontological approach.",
            "A novel axle temperature forecasting method based on decomposition, reinforcement learning optimization and neural network.",
            "AICF: Attention-based item collaborative filtering.",
            "Daily plan-do-check-act (PDCA) cycles with level of development (LOD) 400 objects for foremen.",
            "Transfer learning for long-interval consecutive missing values imputation without external features in air pollution time series.",
            "A BIM-based simulation framework for fire safety management and investigation of the critical factors affecting human evacuation performance.",
            "A global supply chain risk management framework: An application of text-mining to identify region-specific supply chain risks.",
            "Do you need a blockchain in construction? Use case categories and decision framework for DLT design options.",
            "Prediction of product design decision Making: An investigation of eye movements and EEG features.",
            "Structured authoring for AR-based communication to enhance efficiency in remote diagnosis for complex equipment.",
            "Reinforcement learning based optimizer for improvement of predicting tunneling-induced ground responses.",
            "Multi-material structural topology optimization with decision making of stiffness design criteria.",
            "A new integrated approach for engineering characteristic prioritization in quality function deployment.",
            "Real-time smart video surveillance to manage safety: A case study of a transport mega-project.",
            "Predictive model-based quality inspection using Machine Learning and Edge Cloud Computing.",
            "A field implementation of linear prediction for leak-monitoring in water distribution networks.",
            "Deep learning-based classification of work-related physical load levels in construction.",
            "Anomaly detection of defects on concrete structures with the convolutional autoencoder.",
            "Beyond BCI - Validating a wireless, consumer-grade EEG headset against a medical-grade system for evaluating EEG effects of a test anxiety intervention in school.",
            "Vagueness visualization in building models across different design stages.",
            "Customer requirement-driven design method and computer-aided design system for supporting service innovation conceptualization handling.",
            "An immersive virtual reality serious game to enhance earthquake behavioral responses and post-earthquake evacuation preparedness in buildings.",
            "Evolutionary design framework for Smart PSS: Service engineering approach.",
            "Intelligent trademark similarity analysis of image, spelling, and phonetic features using machine learning methodologies.",
            "CLOI-NET: Class segmentation of industrial facilities' point cloud datasets.",
            "A research agenda for augmented and virtual reality in architecture, engineering and construction.",
            "A rule-based method for automated surrogate model selection.",
            "Design entropy theory: A new design methodology for smart PSS development.",
            "An integrated online pick-to-sort order batching approach for managing frequent arrivals of B2B e-commerce orders under both fixed and variable time-window batching.",
            "Failure mode classification and bearing capacity prediction for reinforced concrete columns based on ensemble machine learning algorithm.",
            "Integrating a constraint-based optimization approach into the design of oil & gas structures.",
            "New hybrid data mining model for credit scoring based on feature selection algorithm and ensemble classifiers.",
            "Automated segmentation of RGB-D images into a comprehensive set of building components using deep learning.",
            "Fault-tolerant control of variable speed limits for freeway work zone using likelihood estimation.",
            "A knowledge-based process planning framework for wire arc additive manufacturing.",
            "Enriching standards-based digital thread by fusing as-designed and as-inspected data using knowledge graphs.",
            "An evaluation of pose-normalization algorithms for point clouds introducing a novel histogram-based approach.",
            "Towards a customizable immersive virtual reality serious game for earthquake emergency training.",
            "Ensemble deep learning based semi-supervised soft sensor modeling method and its application on quality prediction for coal preparation process.",
            "BIM-to-IGA: A fully automatic design-through-analysis workflow for segmented tunnel linings.",
            "Integrated rough VIKOR for customer-involved design concept evaluation combining with customers' preferences and designers' perceptions.",
            "Anomaly detection and critical attributes identification for products with multiple operating conditions based on isolation forest.",
            "Fine-grained occupant activity monitoring with Wi-Fi channel state information: Practical implementation of multiple receiver settings.",
            "Ontology-based requirement verification for complex systems.",
            "A marker-less assembly stage recognition method based on segmented projection contour.",
            "An intelligent fault diagnosis method for rotor-bearing system using small labeled infrared thermal images and enhanced CNN transferred from CAE.",
            "Comparison of different machine learning techniques on location extraction by utilizing geo-tagged tweets: A case study.",
            "Hazard analysis: A deep learning and text mining framework for accident prevention.",
            "A neurophysiological approach to assess training outcome under stress: A virtual reality experiment of industrial shutdown maintenance using Functional Near-Infrared Spectroscopy (fNIRS).",
            "An optimized combination prediction model for concrete dam deformation considering quantitative evaluation and hysteresis correction.",
            "How to identify promising chances for technological innovation: Keygraph-based patent analysis.",
            "A two-phased SEM-neural network approach for consumer preference analysis.",
            "Inter-subject transfer learning for EEG-based mental fatigue recognition.",
            "Metaization concepts for monitoring-related information.",
            "CRAFT: Comprehensive Resilience Assessment Framework for Transportation Systems in Urban Areas.",
            "A new ensemble deep learning approach for exchange rates forecasting and trading.",
            "Augmenting a deep-learning algorithm with canal inspection knowledge for reliable water leak detection from multispectral satellite images.",
            "Spatial zoning for better structural topology design and performance.",
            "A hybrid intelligence approach for sustainable service innovation of smart and connected product: A case study.",
            "Ontology-based knowledge representation for industrial megaprojects analytics using linked data and the semantic web.",
            "IPC: Resource and network cost-aware distributed stream scheduling on skewed streams.",
            "Defective wafer detection using a denoising autoencoder for semiconductor manufacturing processes.",
            "The impact of engineering information format on task performance: Gaze scanning pattern analysis.",
            "An approach of checking an exit sign system based on navigation graph networks.",
            "Development of an unwanted-feature removal system for Structure from Motion of repetitive infrastructure piers using deep learning.",
            "Intuitive robot teleoperation for civil engineering operations with virtual reality and deep learning scene reconstruction.",
            "State of the art in damage information modeling for RC bridges - A literature review.",
            "A neuro-wavelet based approach for diagnosing bearing defects.",
            "A context-augmented deep learning approach for worker trajectory prediction on unstructured and dynamic construction sites.",
            "Dynamical mining of ever-changing user requirements: A product design and improvement perspective.",
            "The roles of conceptual modelling in improving construction simulation studies: A comprehensive review.",
            "Fault detection for non-condensing boilers using simulated building automation system sensor data.",
            "Convolutional long short-term memory model for recognizing construction workers' postures from wearable inertial measurement units.",
            "Corrigendum to \"Defective wafer detection using a denoising autoencoder for semiconductor manufacturing processes\" [Adv. Eng. Informat. 46 (2020) 101166].",
            "Quantitative similarity assessment of construction projects using WBS-based metrics.",
            "A CNN-based personalized system for attention detection in wayfinding tasks.",
            "The use of PCA and signal processing techniques for processing time-based construction settlement data of road embankments.",
            "Survey on performance of deep learning models for detecting road damages using multiple dashcam image resources.",
            "Research on recommendation and interaction strategies based on resource similarity in the manufacturing ecosystem.",
            "Deep residual U-net with input of static structural responses for efficient U* load transfer path analysis.",
            "Quick energy prediction and comparison of options at the early design stage.",
            "A statistically based fault detection and diagnosis approach for non-residential building water distribution systems.",
            "A unified view on planning, scheduling and dispatching for a factory.",
            "Choice of loading clusters in container terminals.",
            "EEG-based approach for recognizing human social emotion perception.",
            "A methodology of risk assessment, management, and coping actions for nuclear power plant (NPP) hit by high-explosive warheads.",
            "Using stepwise backward elimination to specify terms related to tactile sense for product design.",
            "Bi-level programming enabled design of an intelligent maritime search and rescue system.",
            "A building regulation question answering system: A deep learning methodology.",
            "A knowledge support approach for the preliminary design of platform-based products in Engineering-To-Order manufacturing.",
            "A novel construction cost prediction model using hybrid natural and light gradient boosting."
        ]
    },
    {
        "name": "AEI",
        "year": "2019",
        "info": "2019 Volumes:\n39,\n40,\n41,\n42",
        "count": 119,
        "papers": [
            "Modeling and simulation of complex manufacturing phenomena using sensor signals from the perspective of Industry 4.0.",
            "Yard crane scheduling problem in a container terminal considering risk caused by uncertainty.",
            "A knowledge discovery and reuse method for time estimation in ship block manufacturing planning using DEA.",
            "A new distributed time series evolution prediction model for dam deformation based on constituent elements.",
            "Assessing the influence of repeated exposures and mental stress on human wayfinding performance in indoor environments using virtual reality technology.",
            "A design for disassembly tool oriented to mechatronic product de-manufacturing and recycling.",
            "A non-centralized adaptive method for dynamic planning of construction components storage areas.",
            "A novel approach for capturing and evaluating dynamic consumer requirements in open design.",
            "Seismic loss assessment for buildings with various-LOD BIM data.",
            "Virtual engineering of cyber-physical automation systems: The case of control logic.",
            "Multi-view feature modeling for design-for-additive manufacturing.",
            "Framework for prioritizing geospatial data processing tasks during extreme weather events.",
            "A deep learning-based approach for mitigating falls from height with computer vision: Convolutional neural network.",
            "BA-PNN-based methods for power transformer fault diagnosis.",
            "A multi-criteria decision framework to support measurement-system design for bridge load testing.",
            "Towards an automatic engineering change management in smart product-service systems - A DSM-based learning approach.",
            "Using blockmodeling for capturing knowledge: The case of energy analysis in the construction phase of oil and gas facilities.",
            "BIM-enabled facilities operation and maintenance: A review.",
            "Optimal decisions for a two-echelon supply chain with capacity and demand information.",
            "Degradation evaluation of lateral story stiffness using HLA-based deep learning networks.",
            "A framework for data-driven informatization of the construction company.",
            "Sensitivity analysis of artificial neural networks for just-suspension speed prediction in solid-liquid mixing systems: Performance comparison of MLPNN and RBFNN.",
            "Ontology-based approach for the provision of simulation knowledge acquired by Data and Text Mining processes.",
            "Applications of 3D point cloud data in the construction industry: A fifteen-year review from 2004 to 2018.",
            "Healthcare process modularization using design structure matrix.",
            "On the role of generating textual description for design intent communication in feature-based 3D collaborative design.",
            "Enabling metrology-oriented specification of geometrical variability - A categorical approach.",
            "Empty container repositioning strategy in intermodal transport with demand switching.",
            "Automated BIM data validation integrating open-standard schema with visual programming language.",
            "Data-driven operational risk analysis in E-Commerce Logistics.",
            "Risk assessment of China-Pakistan Fiber Optic Project (CPFOP) in the light of Multi-Criteria Decision Making (MCDM).",
            "Convolutional neural network: Deep learning-based classification of building quality problems.",
            "Mathematical modeling of yard template regeneration for multiple container terminals.",
            "Cross-border e-commerce commodity risk assessment using text mining and fuzzy rule-based reasoning.",
            "Maximum variation analysis based analytical target cascading for multidisciplinary robust design optimization under interval uncertainty.",
            "Multi-objective optimization design of a complex building based on an artificial neural network and performance evaluation of algorithms.",
            "Image processing based automatic recognition of asphalt pavement patch using a metaheuristic optimized machine learning approach.",
            "A Relative Entropy Weibull-SAX framework for health indices construction and health stage division in degradation modeling of multivariate time series asset data.",
            "A meta-model approach for formal specification and consistent management of multi-LOD building models.",
            "A structural service innovation approach for designing smart product service systems: Case study of smart beauty service.",
            "Corrigendum to \"Automatic engineering change management in smart product-service systems - A DSM-based learning approach\" [Adv. Eng. Inform. 39 (2019) 203-213].",
            "Editorial on 3rd ICCBEI 2017.",
            "Inferring workplace safety hazards from the spatial patterns of workers' wearable data.",
            "Development of an IoT-based big data platform for day-ahead prediction of building heating and cooling demands.",
            "Locating electric vehicle charging stations with service capacity using the improved whale optimization algorithm.",
            "Corrigendum to \"A structural service innovation approach for designing smart product service systems: Case study of smart beauty service\" [Adv. Eng. Inform. 40 (2019) 154-167].",
            "A CNN-based 3D patch registration approach for integrating sequential models in support of progress monitoring.",
            "Fostering the transfer of empirical engineering knowledge under technological paradigm shift: An experimental study in conceptual design.",
            "A shared ontology for integrated highway planning.",
            "A novel inverse data driven modelling approach to performance-based building design during early stages.",
            "A metamodel for cyber-physical systems.",
            "Improving reconstruction of tunnel lining defects from ground-penetrating radar profiles by multi-scale inversion and bi-parametric full-waveform inversion.",
            "A novel approach for sand liquefaction prediction via local mean-based pseudo nearest neighbor algorithm and its engineering application.",
            "A directed failure causality network (DFCN) based method for function components risk prioritization under interval type-2 fuzzy environment.",
            "Xgboost application on bridge management systems for proactive damage estimation.",
            "An integrated highly synchronous, high resolution, real time eye tracking system for dynamic flight movement.",
            "Automated classification of building information modeling (BIM) case studies by BIM use based on natural language processing (NLP) and unsupervised learning.",
            "One class based feature learning approach for defect detection using deep autoencoders.",
            "Proactive mental fatigue detection of traffic control operators using bagged trees and gaze-bin analysis.",
            "Coordinating patient preferences through automated negotiation: A multiagent systems model for diagnostic services scheduling.",
            "A hypernetwork-based approach to collaborative retrieval and reasoning of engineering design knowledge.",
            "Intelligent collaborative patent mining using excessive topic generation.",
            "Agent evaluation based on multi-source heterogeneous information table using TOPSIS.",
            "An automatic literature knowledge graph and reasoning network modeling framework based on ontology and natural language processing.",
            "Differential received signal strength based RFID positioning for construction equipment tracking.",
            "Three-dimensional (3D) reconstruction of structures and landscapes: A new point-and-line fusion method.",
            "Onsite video mining for construction hazards identification with visual relationships.",
            "Risk-aware supply chain intelligence: AI-enabled supply chain and logistics management considering risk mitigation.",
            "A methodological framework with rough-entropy-ELECTRE TRI to classify failure modes for co-implementation of smart PSS.",
            "A service-oriented multi-player maintenance grouping strategy for complex multi-component system based on game theory.",
            "A user-centric smart product-service system development approach: A case study on medication management for the elderly.",
            "A novel data-driven graph-based requirement elicitation framework in the smart product-service system context.",
            "Edge-cloud orchestration driven industrial smart product-service systems solution design based on CPS and IIoT.",
            "Cloud based cyber-physical systems: Network evaluation study.",
            "Smart robotic mobile fulfillment system with dynamic conflict-free strategies considering cyber-physical integration.",
            "Smart product-service systems in interoperable logistics: Design and implementation prospects.",
            "Production service system enabled by cloud-based smart resource hierarchy for a highly dynamic synchronized production process.",
            "The design of an IoT-based route optimization system: A smart product-service system (SPSS) approach.",
            "Registering georeferenced photos to a building information model to extract structures of interest.",
            "Road pothole extraction and safety evaluation by integration of point cloud and images derived from mobile mapping sensors.",
            "Developing a conceptual framework of smart work packaging for constraints management in prefabrication housing production.",
            "Method for digital evaluation of existing production systems adequacy to changes in product engineering in the context of the automotive industry.",
            "Hybrid data-driven vigilance model in traffic control center using eye-tracking data and context data.",
            "A multi-objective reliability-based decision support system for incorporating decision maker utilities in the design of infrastructure.",
            "Deep topology network: A framework based on feedback adjustment learning rate for image classification.",
            "Detection of correlation characteristics between financial time series based on multi-resolution analysis.",
            "Times-series data augmentation and deep learning for construction equipment activity recognition.",
            "Untangling parameters: A formalized framework for identifying overlapping design parameters between two disciplines for creating an interdisciplinary parametric model.",
            "A novelty detection patent mining approach for analyzing technological opportunities.",
            "Research on multi-objective decision-making under cloud platform based on quality function deployment and uncertain linguistic variables.",
            "Topological semantics for lumped parameter systems modeling.",
            "Parametric modelling and evolutionary optimization for cost-optimal and low-carbon design of high-rise reinforced concrete buildings.",
            "An asymmetric and optimized encryption method to protect the confidentiality of 3D mesh model.",
            "State of the art in big data applications in microgrid: A review.",
            "Automatic generation of fabrication drawings for façade mullions and transoms through BIM models.",
            "A genuine smile is indeed in the eyes - The computer aided non-invasive analysis of the exact weight distribution of human smiles across the face.",
            "BIM reconstruction from 3D point clouds: A semantic registration approach based on multimodal optimization and architectural design knowledge.",
            "An augmented self-adaptive parameter control in evolutionary computation: A case study for the berth scheduling problem.",
            "Dynamic modelling of customer preferences for product design using DENFIS and opinion mining.",
            "A survey of smart product-service systems: Key aspects, challenges and future perspectives.",
            "Detecting, locating, and characterizing voids in disaster rubble for search and rescue.",
            "Estimation of the degree of hydration of concrete through automated machine learning based microstructure analysis - A study on effect of image magnification.",
            "Spatial prediction of shallow landslide using Bat algorithm optimized machine learning approach: A case study in Lang Son Province, Vietnam.",
            "Intelligent fault diagnosis for rotating machinery using deep Q-network based health state classification: A deep reinforcement learning approach.",
            "A lattice-based approach for navigating design configuration spaces.",
            "Recognizing people's identity in construction sites with computer vision: A spatial and temporal attention pooling network.",
            "Deep convolutional learning for general early design stage prediction models.",
            "Template-based configuration and execution of decision workflows in design of complex engineered systems.",
            "A framework for brain learning-based control of smart structures.",
            "Construction automation and robotics for high-rise buildings over the past decades: A comprehensive review.",
            "Unsupervised extraction of patterns and trends within highway systems condition attributes data.",
            "Sensor data reconstruction using bidirectional recurrent neural network with application to bridge monitoring.",
            "Smartphone customer segmentation based on the usage pattern.",
            "High-quality as-is 3D thermal modeling in MEP systems using a deep convolutional network.",
            "A method of automatic extraction of parameters of multi-LoD BIM models for typical components in wooden architectural-heritage structures.",
            "Classification of brain signal (EEG) induced by shape-analogous letter perception.",
            "Crowdsourced reliable labeling of safety-rule violations on images of complex construction scenes for advanced vision-based workplace safety.",
            "A high performance hybrid SSVEP based BCI speller system.",
            "An Internet of Things-enabled BIM platform for modular integrated construction: A case study in Hong Kong."
        ]
    },
    {
        "name": "AEI",
        "year": "2018",
        "info": "2018 Volumes:\n35,\n36,\n37,\n38",
        "count": 101,
        "papers": [
            "Short-term electricity demand forecasting with MARS, SVR and ARIMA models using aggregated demand data in Queensland, Australia.",
            "Change propagation analysis for system modeling using Semantic Web technology.",
            "Agent-based evacuation modeling with multiple exits using NeuroEvolution of Augmenting Topologies.",
            "A deep learning-based method for detecting non-certified work on construction sites.",
            "Semantic BMS: Allowing usage of building automation data in facility benchmarking.",
            "Special issue on EG-ICE 2016.",
            "Topological mapping and assessment of multiple settlement time series in deep excavation: A complex network perspective.",
            "A new wind power prediction method based on ridgelet transforms, hybrid feature selection and closed-loop forecasting.",
            "Comparison of multi-objective evolutionary algorithms in hybrid Kansei engineering system for product form design.",
            "Sine-square embedded fuzzy sets versus type-2 fuzzy sets.",
            "Robust sensor placement for pipeline monitoring: Mixed integer and greedy optimization.",
            "Guess your size: A hybrid model for footwear size recommendation.",
            "Quantitative lifecycle risk analysis of the development of a just-in-time transportation network system.",
            "Toolbox for super-structured and super-structure free multi-disciplinary building spatial design optimisation.",
            "A simulation methodology for a system of product life cycle systems.",
            "Soft sensor based on stacked auto-encoder deep neural network for air preheater rotor deformation prediction.",
            "Consumer driven product technology function deployment using social media and patent mining.",
            "Integrated BIM, game engine and VR technologies for healthcare design: A case study in cancer hospital.",
            "Research on static service BOM transformation for complex products.",
            "Systematic design space exploration using a template-based ontological method.",
            "Developing final as-built BIM model management system for owners during project closeout: A case study.",
            "A subspace learning-based feature fusion and open-set fault diagnosis approach for machinery components.",
            "Automatic classification of fine-grained soils using CPT measurements and Artificial Neural Networks.",
            "Tender calls search using a procurement product named entity recogniser.",
            "Automated residential building detection from airborne LiDAR data with deep neural networks.",
            "Strategic information revelation in collaborative design.",
            "Benchmarking thermoception in virtual environments to physical environments for understanding human-building interactions.",
            "Understanding building occupant activities at scale: An integrated knowledge-based and data-driven approach.",
            "A large-scale evaluation of automated metadata inference approaches on sensors from air handling units.",
            "Personalized method for self-management of trunk postural ergonomic hazards in construction rebar ironwork.",
            "A BIM-based visualization and warning system for fire rescue.",
            "IFC Monitor - An IFC schema extension for modeling structural health monitoring systems.",
            "An adaptive clustering-based genetic algorithm for the dual-gantry pick-and-place machine optimization.",
            "Distress classification of class-imbalanced inspection data via correlation-maximizing weighted extreme learning machine.",
            "Integrating multi-granularity model and similarity measurement for transforming process data into different granularity knowledge.",
            "Crowd simulation-based knowledge mining supporting building evacuation design.",
            "Scan-to-BIM for 'secondary' building components.",
            "Automated detection of workers and heavy equipment on construction sites: A convolutional neural network approach.",
            "Detecting healthy concrete surfaces.",
            "A review of 3D reconstruction techniques in civil engineering and their applications.",
            "Decentralized damage detection of seismically-excited buildings using multiple banks of Kalman estimators.",
            "A methodology for brand feature establishment based on the decomposition and reconstruction of a feature curve.",
            "Automated continuous construction progress monitoring using multiple workplace real time 3D scans.",
            "Semantic weldability prediction with RSW quality dataset and knowledge construction.",
            "BIMification: How to create and use BIM for retrofitting.",
            "Real-time validation of vision-based over-height vehicle detection system.",
            "Deep-learning neural-network architectures and methods: Using component-based models in building-design energy prediction.",
            "Fault diagnosis of rolling bearing based on optimized soft competitive learning Fuzzy ART and similarity evaluation technique.",
            "Machine learning and BIM visualization for maintenance issue classification and enhanced data collection.",
            "Balancing homogeneity and heterogeneity in design exploration by synthesizing novel design alternatives based on genetic algorithm and strategic styling decision.",
            "A foundational ontology for the modelling of manufacturing systems.",
            "Enhanced predictive modelling process of broadband services adoption based on time series data.",
            "Data based complex network modeling and analysis of shield tunneling performance in metro construction.",
            "A multi-level 3D data registration approach for supporting reliable spatial change classification of single-pier bridges.",
            "Automated thermal 3D reconstruction based on a robot equipped with uncalibrated infrared stereovision cameras.",
            "Automatic code compliance with multi-dimensional data fitting in a BIM context.",
            "Community detection in national-scale high voltage transmission networks using genetic algorithms.",
            "Crowdsourcing with online quantitative design analysis.",
            "Supporting connectivism in knowledge based engineering with graph theory, filtering techniques and model quality assurance.",
            "Collaborative engineering decision-making for building information channels and improving Web visibility of product manufacturers.",
            "Modeling of transdisciplinary engineering assets using the design platform approach for improved customization ability.",
            "Selecting manufacturing partners in push and pull-type smart collaborative networks.",
            "Capacitated closed-loop supply chain network design under uncertainty.",
            "BIM-based modeling and management of design options at early planning phases.",
            "An integrated framework for multi-criteria optimization of thin concrete shells at early design stages.",
            "Cloud-based ubiquitous object sharing platform for heterogeneous logistics system integration.",
            "Feature-based intelligent system for steam simulation using computational fluid dynamics.",
            "BIM-based investigation of total energy consumption in delivering building products.",
            "A novel CRDT-based synchronization method for real-time collaborative CAD systems.",
            "A vision-based statistical methodology for automatically modeling continuous urban traffic flows.",
            "Quantifying the physical intensity of construction workers, a mechanical energy approach.",
            "A comprehensive review on identification of the geomaterial constitutive model using the computational intelligence method.",
            "Knowledge-driven intelligent quality problem-solving system in the automotive industry.",
            "Overlay Design Methodology for virtual environment design within digital games.",
            "Reconstruction of edges in digital building models.",
            "Semi-automated site equipment selection and configuration through formal knowledge representation and inference.",
            "Game-based crowdsourcing to support collaborative customization of the definition of sustainability.",
            "Automated ergonomic risk monitoring using body-mounted sensors and machine learning.",
            "Visual analysis of asphalt pavement for detection and localization of potholes.",
            "Generation and visualization of earthquake drill scripts for first responders using ontology and serious game platforms.",
            "Improving construction industry process interoperability with Industry Foundation Processes (IFP).",
            "Real-time collaborative reconstruction of digital building models with mobile devices.",
            "A decision approach with multiple interactive qualitative objectives for product conceptual schemes based on noncooperative-cooperative game theory.",
            "Prediction of soil compression coefficient for urban housing project using novel integration machine learning approach of swarm intelligence and Multi-layer Perceptron Neural Network.",
            "Point cloud occlusion recovery with shallow feedforward neural networks.",
            "CA-FCM: Towards a formal representation of expert's causal judgements over construction project changes.",
            "Traffic signal optimization through discrete and continuous reinforcement learning with robustness analysis in downtown Tehran.",
            "Intelligent computing in Architecture, Engineering and Construction.",
            "A case based heuristic for container stacking in seaport terminals.",
            "Prototyping virtual reality serious games for building earthquake preparedness: The Auckland City Hospital case study.",
            "Fall risk assessment of construction workers based on biomechanical gait stability parameters using wearable insole pressure system.",
            "Participatory decision-support model in the context of building structural design embedding BIM with QFD.",
            "A generative design technique for exploring shape variations.",
            "Random generation of industrial pipelines' data using Markov chain model.",
            "OntoProg: An ontology-based model for implementing Prognostics Health Management in mechanical machines.",
            "The effects of augmented reality on improving spatial problem solving for object assembly.",
            "Modelling residual value risk through ontology to address vulnerability of PPP project system.",
            "A psychometric user experience model based on fuzzy measure approaches.",
            "Automated 3D volumetric reconstruction of multiple-room building interiors for as-built BIM.",
            "Utilizing text mining and Kansei Engineering to support data-driven design automation at conceptual design stage.",
            "Multi-source data analytics for AM energy consumption prediction."
        ]
    },
    {
        "name": "AEI",
        "year": "2017",
        "info": "2017 Volumes:\n31,\n32,\n33,\n34",
        "count": 78,
        "papers": [
            "Computing advances applied for building design, operation, retrofit and supply chain information processing.",
            "Bridging qualitative spatial constraints and feature-based parametric modelling: Expressing visibility and movement constraints.",
            "Combining visual natural markers and IMU for improved AR based indoor navigation.",
            "Application of clustering for the development of retrofit strategies for large building stocks.",
            "BIMTag: Concept-based automatic semantic annotation of online BIM product resources.",
            "Reference tag supported RFID tracking using robust support vector regression and Kalman filter.",
            "A real-time automatic pavement crack and pothole recognition system for mobile Android-based devices.",
            "A variable fidelity information fusion method based on radial basis function.",
            "Measurement system design for civil infrastructure using expected utility.",
            "A quantitative approach to design alternative evaluation based on data-driven performance prediction.",
            "Data analysis for metropolitan economic and logistics development.",
            "A rule-based servicescape design support system from the design patterns of theme parks.",
            "Research on a knowledge modelling methodology for fault diagnosis of machine tools based on formal semantics.",
            "Private local automation clouds built by CPS: Potential and challenges for distributed reasoning.",
            "Self-corrective knowledge-based hybrid tracking system using BIM and multimodal sensors.",
            "Intelligent fault diagnosis of rolling bearing using hierarchical convolutional network based health state classification.",
            "An error correction framework for sequences resulting from known state-transition models in Non-Intrusive Load Monitoring.",
            "The documentation of product configuration systems: A framework and an IT solution.",
            "Heuristic approach for solving employee bus routes in a large-scale industrial factory.",
            "Inspection equipment study for subway tunnel defects by grey-scale image processing.",
            "3D parametric human face modeling for personalized product design: Eyeglasses frame design case.",
            "Selection of target LEED credits based on project information and climatic factors using data mining techniques.",
            "A function-based computational method for design concept evaluation.",
            "Signage visibility analysis and optimization system using BIM-enabled virtual reality (VR) environments.",
            "Multi-class US traffic signs 3D recognition and localization via image-based point cloud model using color candidate extraction and texture-based recognition.",
            "Crowd-based velocimetry for surface flows.",
            "Fast convergence optimization model for single and multi-purposes reservoirs using hybrid algorithm.",
            "A descriptive semantics of modelling process catering for whole product parametric.",
            "A functional feature modeling method.",
            "A user requirement driven framework for collaborative design knowledge management.",
            "A two-phase approach to mine short-period high-utility itemsets in transactional databases.",
            "Analyzing engineering change of aircraft assembly tooling considering both duration and resource consumption.",
            "A machine learning approach for characterizing soil contamination in the presence of physical site discontinuities and aggregated samples.",
            "A performance benchmark over semantic rule checking approaches in construction industry.",
            "A novel approach for precipitation forecast via improved K-nearest neighbor algorithm.",
            "Restoration of the distorted color to detect the discoloration status of a steel bridge coating using digital image measurements.",
            "Current research trends and application areas of fuzzy and hybrid methods to the risk assessment of construction projects.",
            "A novel change feature-based approach to predict the impact of current proposed engineering change.",
            "Dynamic neural network method-based improved PSO and BR algorithms for transient probabilistic analysis of flexible mechanism.",
            "A method for clustering unlabeled BIM objects using entropy and TF-IDF with RDF encoding.",
            "Model-based space planning for temporary structures using simulation-based multi-objective programming.",
            "Information Quality Assessment for Facility Management.",
            "Advanced design, analysis, and implementation of pervasive and smart collaborative systems enabled with knowledge modelling and big data analytics.",
            "A review of essential standards and patent landscapes for the Internet of Things: A key enabler for Industry 4.0.",
            "Leveraging existing occupancy-related data for optimal control of commercial office buildings: A review.",
            "Platform as a service gateway for the Fog of Things.",
            "Evaluation of quality of service provisioning in large-scale pervasive and smart collaborative wireless sensor and actor networks.",
            "Metamodeling of Smart Environments: from design to implementation.",
            "Knowledge-based design for assembly in agile manufacturing by using Data Mining methods.",
            "Modularized design-oriented systematic inventive thinking approach supporting collaborative service innovations.",
            "A collaborative system for capturing and reusing in-context design knowledge with an integrated representation model.",
            "A framework to design a human-centred adaptive manufacturing system for aging workers.",
            "Integrating affective features with engineering features to seek the optimal product varieties with respect to the niche segments.",
            "A collaborative web-based platform for the prescription of Custom-Made Insoles.",
            "An encryption approach for product assembly models.",
            "Extracting failure time data from industrial maintenance records using text mining.",
            "A string-wise CRDT algorithm for smart and large-scale collaborative editing systems.",
            "Are you a human or a humanoid: Predictive user modelling through behavioural analysis of online gameplay data.",
            "2015 edition of the Workshop of European Group for Intelligent Computing in Engineering (EG-ICE).",
            "Assessment and weighting of meteorological ensemble forecast members based on supervised machine learning with application to runoff simulations and flood warning.",
            "The generation of hierarchic structures via robust 3D topology optimisation.",
            "Recognition of process patterns for BIM-based construction schedules.",
            "An IFC schema extension and binary serialization format to efficiently integrate point cloud data into building models.",
            "Hypergraphs and extremal optimization in 3D integrated circuit design automation.",
            "Using graph rewriting methods for the semi-automatic generation of parametric infrastructure models.",
            "Robust normal estimation and region growing segmentation of infrastructure 3D point cloud models.",
            "Long-term knowledge evolution modeling for empirical engineering knowledge.",
            "Location-based measurement and visualization for interdependence network on construction sites.",
            "Data-driven approaches for measurement interpretation: analysing integrated thermal and vehicular response in bridge structural health monitoring.",
            "Dynamic rolling strategy for multi-vessel quay crane scheduling.",
            "An assessment model for RFID impacts on prevention and visibility of inventory inaccuracy presence.",
            "Stream flow predictions using nature-inspired Firefly Algorithms and a Multiple Model strategy - Directions of innovation towards next generation practices.",
            "Mobile augmented reality for teaching structural analysis.",
            "Storage yard management based on flexible yard template in container terminal.",
            "Semantic as-built 3D modeling of structural elements of buildings based on local concavity and convexity.",
            "Wood defects classification using laws texture energy measures and supervised learning approach.",
            "A study of patent analysis of LED bicycle light by using modified DEMATEL and life span.",
            "Development of ergonomic posture recognition technique based on 2D ordinary camera for construction hazard prevention through view-invariant features in 2D skeleton motion."
        ]
    },
    {
        "name": "AEI",
        "year": "2016",
        "info": "Volume 30: 2016",
        "count": 53,
        "papers": [
            "A Kansei evaluation approach based on the technique of computing with words.",
            "Product design concept evaluation using rough sets and VIKOR method.",
            "Combination of improved cosine similarity and patent attribution probability method to judge the attribution of related patents of hydrolysis substrate fabrication process.",
            "Extending IFC to incorporate information of RFID tags attached to building elements.",
            "Information requirements for earthquake damage assessment of structural walls.",
            "Interior models of earthquake damaged buildings for search and rescue.",
            "An ontological framework for knowledge modeling and decision support in cyber-physical systems.",
            "Visualization environment for reviewing and experimenting with compaction equipment trajectories in context.",
            "Fast algorithms for mining high-utility itemsets with various discount strategies.",
            "Evaluating predictive performance of sensor configurations in wind studies around buildings.",
            "Improving process conformance with Industry Foundation Processes (IFP).",
            "Identification of representative operating conditions of HVAC systems in passenger rail vehicles based on sampling virtual train trips.",
            "A framework for fully integrated building information models in a federated environment.",
            "Ontology-based semantic approach for construction-oriented quantity take-off from BIM models in the light-frame building industry.",
            "Corrigendum to \"A review on computer vision based defect detection and condition assessment of concrete and asphalt civil infrastructure\" [Advanced Engineering Informatics 29(2) (2015) 196-210].",
            "Extended modeling procedure based on the projected sample for forecasting short-term electricity consumption.",
            "Rapid data quality oriented laser scan planning for dynamic construction environments.",
            "An efficient algorithm to mine high average-utility itemsets.",
            "Ontology-assisted provenance visualization for supporting enterprise search of engineering and business files.",
            "Evacuation path optimization based on quantum ant colony algorithm.",
            "BIM-oriented indoor network model for indoor and outdoor combined route planning.",
            "An active learning metamodeling approach by sequentially exploiting difference information from variable-fidelity models.",
            "Parametric as-built model generation of complex shapes from point clouds.",
            "Towards generation of as-damaged BIM models using laser-scanning and as-built BIM: First estimate of as-damaged locations of reinforced concrete frame members in masonry infill structures.",
            "Vision-based action recognition of construction workers using dense trajectories.",
            "An ontologist feedback driven ontology evolution with an adaptive multi-agent system.",
            "An ontology-based approach for developing data exchange requirements and model views of building information modeling.",
            "Tree-Structure Ensemble General Regression Neural Networks applied to predict the molten steel temperature in Ladle Furnace.",
            "Exploring and weighting features for financially distressed construction companies using Swarm Inspired Projection algorithm.",
            "Berth allocation and quay crane assignment in a container terminal for the trade-off between time-saving and energy-saving.",
            "Multi-modal augmented-reality assembly guidance based on bare-hand interface.",
            "A data mining based load forecasting strategy for smart electrical grids.",
            "Selecting a semantic similarity measure for concepts in two different CAD model data ontologies.",
            "Automated experiential engineering knowledge acquisition through Q&A contextualization and transformation.",
            "Wavelet-morphology based detection of incipient linear cracks in asphalt pavements from RGB camera imagery and classification using circular Radon transform.",
            "Big Data in the construction industry: A review of present status, opportunities, and future trends.",
            "Capturing, structuring and accessing design rationale in integrated product design and manufacturing processes.",
            "Hybrid approach for selective delivery of information streams in data-intensive monitoring systems.",
            "Data-driven train operation models based on data mining and driving experience for the diesel-electric locomotive.",
            "Ontology and CBR based automated decision-making method for the disassembly of mechanical products.",
            "Automated transformation of design text ROM diagram into SysML models.",
            "Z-number DEA: A new possibilistic DEA in the context of Z-numbers.",
            "A multidimensional data model design for building energy management.",
            "Evaluation of a design property network-based change propagation routing approach for mechanical product development.",
            "Semantic scan planning for indoor structural elements of buildings.",
            "A people-centric sensing approach to detecting sidewalk defects.",
            "An electrical network for evaluating monitoring strategies intended for hydraulic pressurized networks.",
            "MMOY: Towards deriving a metallic materials ontology from Yago.",
            "Communicating behavior of systems with the COMBOS-method.",
            "Product design-optimization integration via associative optimization feature modeling.",
            "A MPN-based scheduling model for IoT-enabled hybrid flow shop manufacturing.",
            "Enhanced context-based document relevance assessment and ranking for improved information retrieval to support environmental decision making.",
            "An ontology-based semantic retrieval approach for heterogeneous 3D CAD models."
        ]
    },
    {
        "name": "AEI",
        "year": "2015",
        "info": "Volume 29: 2015",
        "count": 86,
        "papers": [
            "Model-Tree Ensembles for noise-tolerant system identification.",
            "Efficient updating of discovered high-utility itemsets for transaction deletion in dynamic databases.",
            "BIM extension for the sustainability appraisal of conceptual steel design.",
            "An integrated neuro-genetic approach incorporating the Taguchi method for product design.",
            "Yard crane scheduling in a container terminal for the trade-off between efficiency and energy consumption.",
            "Parametric shape modification and application in a morphological biomimetic design.",
            "Dynamic shading of a building envelope based on rotating polarized film system controlled by one-dimensional cellular automata in regular tessellations (triangular, square and hexagonal).",
            "Model-based fault localization in bottling plants.",
            "A research on intelligent fault diagnosis of wind turbines based on ontology and FMECA.",
            "Technology-driven roadmaps for identifying new product/market opportunities: Use of text mining and quality function deployment.",
            "Optimal inventory control in a multi-period newsvendor problem with non-stationary demand.",
            "Infrastructure computer vision.",
            "Automated as-built 3D reconstruction of civil infrastructure using computer vision: Achievements, opportunities, and challenges.",
            "State of research in automatic as-built modelling.",
            "As-built data acquisition and its use in production monitoring and automated layout of civil infrastructure: A survey.",
            "3D as-is building energy modeling and diagnostics: A review of the state-of-the-art.",
            "A review on computer vision based defect detection and condition assessment of concrete and asphalt civil infrastructure.",
            "Construction performance monitoring via still images, time-lapse photos, and video streams: Now, tomorrow, and the future.",
            "Status quo and open challenges in vision-based sensing and tracking of temporary resources on infrastructure construction sites.",
            "Computer vision techniques for construction safety and health monitoring.",
            "Augmented reality visualization: A review of civil infrastructure system applications.",
            "Knowledge centric service engineering for value chain management and sustainable network development.",
            "A case-based method for service-oriented value chain and sustainable network design.",
            "Service design for intelligent parking based on theory of inventive problem solving and service blueprint.",
            "A method for identification of automation potential through modelling of engineering processes and quantification of information waste.",
            "Schedule design for sustainable container supply chain networks with port time windows.",
            "Collaborative mechanisms for berth allocation.",
            "Simulation-based heuristic method for container supply chain network optimization.",
            "Cloud asset for urban flood control.",
            "Semantic relation based personalized ranking approach for engineering document retrieval.",
            "Joint probability for evaluating the schedule and cost of stochastic simulation models.",
            "Information modeling of earthquake-damaged reinforced concrete structures.",
            "An integrated AHP and VIKOR for design concept evaluation based on rough number.",
            "Defect detection in multi-crystal solar cells using clustering with uniformity measures.",
            "A two-level parser for patent claim parsing.",
            "Collision detection between point clouds using an efficient k-d tree implementation.",
            "Dynamic equipment workspace generation for improving earthwork safety using real-time location system.",
            "Developing taxonomy for the domain ontology of construction contractual semantics: A case study on the AIA A201 document.",
            "Style synthesis and analysis of car designs for style quantification based on product appearance similarities.",
            "A formal ontology-based spatiotemporal mereotopology for integrated product design and assembly sequence planning.",
            "A high-level electrical energy ontology with weighted attributes.",
            "Supporting engineering design communication using a custom-built social media tool - PartBook.",
            "Data-source interoperability service for heterogeneous information integration in ubiquitous enterprises.",
            "A fast updated algorithm to maintain the discovered high-utility itemsets for transaction modification.",
            "Integrating heterogeneous engineering knowledge and tools for efficient industrial simulation model support.",
            "Terrestrial laser scanning and continuous wavelet transform for controlling surface flatness in construction - A first investigation.",
            "Requirements for computational rule checking of requests for proposals (RFPs) for building designs in South Korea.",
            "Estimation of aircraft component production cost using knowledge based engineering techniques.",
            "A hybrid cost estimation framework based on feature-oriented data mining approach.",
            "Efficient algorithms for mining up-to-date high-utility patterns.",
            "A study that applies aesthetic theory and genetic algorithms to product form optimization.",
            "Automatic quality estimation in blending using a 3D stockpile management model.",
            "An organizational approach to designing an intelligent knowledge-based system: Application to the decision-making process in design projects.",
            "Performance comparison of reduced models for leak detection in water distribution networks.",
            "Rough set and PSO-based ANFIS approaches to modeling customer satisfaction for affective product design.",
            "Toward robust and quantifiable automated IFC quality validation.",
            "Collective intelligence modeling, analysis, and synthesis for innovative engineering decision making.",
            "Product concept evaluation and selection using data mining and domain ontology in a crowdsourcing environment.",
            "An evaluation methodology for crowdsourced design.",
            "Collective intelligence applied to legal e-discovery: A ten-year case study of Australia franchise and trademark litigation.",
            "A two-level advanced production planning and scheduling model for RFID-enabled ubiquitous manufacturing.",
            "Automatic questionnaire survey by using the collective message over the Internet.",
            "Applying artificial immune systems to collaborative filtering for movie recommendation.",
            "Special Issue: ICCBEI 2013.",
            "TIN generation and point-cloud compression for vehicle-based mobile mapping systems.",
            "Improved digital photogrammetry technique for crack monitoring.",
            "Laboratory experiment of the structural sensing method using the accurate artificial vibrator.",
            "Construction equipment activity recognition for simulation input modeling using mobile sensors and machine learning classifiers.",
            "Formulation and analysis of dynamic supply chain of backfill in construction waste management using agent-based modeling.",
            "Formalized knowledge of construction sequencing for visual monitoring of work-in-progress via incomplete point clouds and low-LoD 4D BIMs.",
            "Exploration and evaluation of AR, MPCA and KL anomaly detection techniques to embankment dam piezometer data.",
            "Graphical causal inference and copula regression model for apple keywords by text mining.",
            "Automated registration of multi-view point clouds using sphere targets.",
            "An ontology-based analysis of the industry foundation class schema for building information model exchanges.",
            "BIM perspective definition metadata for interworking facility management data.",
            "Ontology-based facility data model for energy management.",
            "An ontology-based knowledge framework for engineering material selection.",
            "An approach to combine progressively captured point clouds for BIM update.",
            "Construction-specific spatial information reasoning in Building Information Models.",
            "Image-based retro-reflectivity measurement of traffic signs in day time.",
            "Planning-based semantic web service composition in factory automation.",
            "Integrate multi-agent planning in hinterland transport: Design, implementation and evaluation.",
            "A new method for expiration code detection and recognition using gabor features based collaborative representation.",
            "An active inference approach to on-line agent monitoring in safety-critical systems.",
            "Robust system identification and model predictions in the presence of systematic uncertainty.",
            "Automated generation of multiphysics simulation models to support multidisciplinary design optimization."
        ]
    },
    {
        "name": "AEI",
        "year": "2014",
        "info": "Volume 28: 2014",
        "count": 42,
        "papers": [
            "Classification of major construction materials in construction environments using ensemble classifiers.",
            "Supporting the design process with hypergraph genetic operators.",
            "Freedom through constraints: User-oriented architectural design.",
            "Vision-based material recognition for automated monitoring of construction progress and generating building information modeling from unordered site image collections.",
            "Development of workspace conflict visualization system using 4D object of work schedule.",
            "Automatic design and planning of scaffolding systems using building information modeling.",
            "Comparison of genetic algorithm to particle swarm for constrained simulation-based optimization of a geothermal power plant.",
            "A semantic knowledge management system for laminated composites.",
            "Artificial neural networks as speech recognisers for dysarthric speech: Identifying the best-performing set of MFCC parameters and studying a speaker-independent approach.",
            "3D shape acquisition and integral compact representation using optical scanning and enhanced shape parameterization.",
            "A distributed data collection and management framework for tracking construction operations.",
            "Automatic clustering method for real-time construction simulation.",
            "A knowledge centric methodology for dental implant technology assessment using ontology based patent analysis and clinical meta-analysis.",
            "Shape mining: A holistic data mining approach for engineering design.",
            "Multiview modeling for mechatronic design.",
            "Perspectives on hierarchical modeling in mechatronic design.",
            "Describing the design space of mechanical computational design synthesis problems.",
            "A multi-agent methodology for multi-level modeling of mechatronic systems.",
            "A SysML-based methodology for mechatronic systems architectural design.",
            "A co-modelling method for solving incompatibilities during co-design of mechatronic devices.",
            "Survey on mechatronic engineering: A focus on design methods and product models.",
            "Advanced computational assistance for planning, designing, constructing, and managing the built environment.",
            "Collaborative planning of inner-city-railway-tracks: A generic description of the geographic context and its dynamic integration in a collaborative multi-scale geometry modelling environment.",
            "Processing of Topological BIM Queries using Boundary Representation Based Methods.",
            "Exploring approaches to improve the performance of autonomous monitoring with imperfect data in location-aware wireless sensor networks.",
            "An information fusion approach for filtering GNSS data sets collected during construction operations.",
            "An unsupervised hierarchical clustering based heuristic algorithm for facilitated training of electricity consumption disaggregation systems.",
            "A domain-specific knowledge-based heuristic for the Blocks Relocation Problem.",
            "A personalized query expansion approach for engineering document retrieval.",
            "Automated 3D compliance checking in pipe spool fabrication.",
            "Using semantic web technologies to access soft AEC data.",
            "Using ontology-based text classification to assist Job Hazard Analysis.",
            "Operations on network-based space layouts for modeling multiple space views of buildings.",
            "Augmenting simulations of airflow around buildings using field measurements.",
            "A mobile robot based system for fully automated thermal 3D mapping.",
            "An ideation method for generating new product ideas using TRIZ, concept mapping, and fuzzy linguistic evaluation techniques.",
            "A boundary condition based algorithm for locating construction site objects using RFID and GPS.",
            "A negotiation methodology for multidisciplinary collaborative product design.",
            "A representation scheme for digital product service system definitions.",
            "Synchronous collaborative tunnel design based on consistency-preserving multi-scale models.",
            "Disassembly sequence planning using a Simplified Teaching-Learning-Based Optimization algorithm.",
            "A quantitative approach for assessment of creativity in product design."
        ]
    },
    {
        "name": "AEI",
        "year": "2013",
        "info": "Volume 27: 2013",
        "count": 55,
        "papers": [
            "Modeling, extraction, and transformation of semantics in computer aided engineering systems.",
            "Meaning- and ontology-based technologies for high-precision language an information-processing computational systems.",
            "A semantic representation model for design rationale of products.",
            "A model based transformation paradigm for cross-language collaborations.",
            "An ontology-driven framework towards building enterprise semantic information layer.",
            "Disparate attributes algorithm for semantic assembly design rule management.",
            "Proactive search enabled context-sensitive knowledge supply situated in computer-aided engineering.",
            "Ontology-based feature mapping and verification between CAD systems.",
            "Quality control engineering in automated ceramic tile production using a signal information content approach.",
            "Information lifecycle management with RFID for material control on construction sites.",
            "A Self-adaptive ASIFT-SH method.",
            "An ISM, DEI, and ANP based approach for product family development.",
            "Corrigendum to \"Complex flow simulation in natural aquifer\" [Adv. Eng. Inform. 23 (2009) 288-293]: An algorithm for parallel flow simulations in the finite element framework.",
            "Editorial.",
            "Editorial for special issue: Cloud computing and distributed data management in the AEC - Architecture, Engineering and Construction industry.",
            "Cloud-Marketplaces: Distributed e-procurement for the AEC sector.",
            "A cloud approach to unified lifecycle data management in architecture, engineering, construction and facilities management: Integrating BIMs and SNS.",
            "The IFC-based path planning for 3D indoor spaces.",
            "Linking building data in the cloud: Integrating cross-domain building data using linked data.",
            "Supporting communication and cooperation in distributed representation for adaptive design.",
            "Design with shape grammars and reinforcement learning.",
            "Knowledge-based navigation system for building health diagnosis.",
            "Model falsification diagnosis and sensor placement for leak detection in pressurized pipe networks.",
            "Optimized selection of key frames for monocular videogrammetric surveying of civil infrastructure.",
            "Geometric modeling of geospatial data for visualization-assisted excavation.",
            "Evaluating and improving the effectiveness and efficiency of design process communication.",
            "Advanced knowledge engineering related to innovation, intellectual property and patent analysis.",
            "Automatic extraction of function-behaviour-state information from patents.",
            "Searching in Cooperative Patent Classification: Comparison between keyword and concept-based search.",
            "Constructing a dental implant ontology for domain specific clustering and life span analysis.",
            "Analyzing a firm's international portfolio of technological knowledge: A declarative ontology-based OWL approach for patent documents.",
            "Exploring technology evolution and transition characteristics of leading countries: A case of fuel cell field.",
            "A semiotic framework to understand how signs in construction process simulations convey information.",
            "Product form design using customer perception evaluation by a combined superellipse fitting and ANN approach.",
            "An automated vision-based method for rapid 3D energy performance modeling of existing buildings using thermal and digital imagery.",
            "Advanced computing for the built environment.",
            "Graph-based retrieval of building information models for supporting the early design stages.",
            "Automated design studies: Topology versus One-Step Evolutionary Structural Optimisation.",
            "BIMQL - An open query language for building information models.",
            "Building simulation approaches for the training of automated data analysis tools in building energy management.",
            "A videogrammetric as-built data collection method for digital fabrication of sheet metal roof panels.",
            "Towards automated appliance recognition using an EMF sensor in NILM platforms.",
            "Support vector regression for anomaly detection from measurement histories.",
            "Extending the information delivery manual approach to identify information requirements for performance analysis of HVAC systems.",
            "SimCrane 3D+: A crane simulator with kinesthetic and stereoscopic vision.",
            "Input variable selection in time-critical knowledge integration applications: A review, analysis, and recommendation paper.",
            "Knowledge representation framework for interactive capture and management of reflection process in product concepts development.",
            "AIERO: An algorithm for identifying engineering relationships in ontologies.",
            "Localization of RFID-equipped assets during the operation phase of facilities.",
            "A Social Media framework to support Engineering Design Communication.",
            "A simulation optimization method for internal trucks sharing assignment among multiple container terminals.",
            "Data mining and knowledge discovery in materials science and engineering: A polymer nanocomposites case study.",
            "A migration-based approach towards resource-efficient wireless structural health monitoring.",
            "Extended Process to Product Modeling (xPPM) for integrated and seamless IDM and MVD development.",
            "Vision-based action recognition of earthmoving equipment using spatio-temporal features and support vector machine classifiers."
        ]
    },
    {
        "name": "AEI",
        "year": "2012",
        "info": "Volume 26: 2012",
        "count": 77,
        "papers": [
            "Editorial.",
            "Network and supply chain system integration for mass customization and sustainable behavior.",
            "A critical review of Knowledge-Based Engineering: An identification of research challenges.",
            "A quality-time-cost-oriented strategy for product conceptualization.",
            "A patent quality analysis for innovative technology and product development.",
            "Human-centric design personalization of 3D glasses frame in markerless augmented reality.",
            "Production risk management system with demand probability distribution.",
            "Transparency in complex dynamic food supply chains.",
            "Decision support in the quotation process of engineered-to-order products.",
            "MicroPort: A general simulation platform for seaport container terminals.",
            "Plane-based registration of construction laser scans with 3D/4D building models.",
            "Construction industry offsite production: A virtual reality interactive training environment prototype.",
            "Coarse head pose estimation of construction equipment operators to formulate dynamic blind spots.",
            "A global modular framework for automotive diagnosis.",
            "Configuration of control system for damage tolerance of a tensegrity bridge.",
            "Erratum to 'A computational framework for authoring and searching product design specifications'.",
            "Knowledge based engineering to support complex product design.",
            "Knowledge based engineering: Between AI and CAD. Review of a language based technology to support engineering design.",
            "Flexible and robust CAD models for design automation.",
            "Enabling control software generation by using mechatronics modeling primitives.",
            "The implementation of a knowledge-based framework for the aerodynamic optimization of a morphing wing device.",
            "A framework for management of Knowledge-Based Engineering applications as software services: Enabling personalization and codification.",
            "Adaptable methodology for automation application development.",
            "The retrieval of structured design rationale for the re-use of design knowledge with an integrated representation.",
            "Visual language and graph-based structures in conceptual design.",
            "Process planning for collaborative product development with CD-DSM in optoelectronic enterprises.",
            "Assessment of a Product Range Model concept to support design reuse using rule based systems and case based reasoning.",
            "Disassembly sequence structure graphs: An optimal approach for multiple-target selective disassembly sequence planning.",
            "General system architecture for BIM: An integrated approach for design and analysis.",
            "ONTO-PDM: Product-driven ONTOlogy for Product Data Management interoperability within manufacturing process environment.",
            "A concept-based information retrieval approach for engineering domain-specific technical documents.",
            "Floor plan design using block algebra and constraint satisfaction.",
            "Comparing the effectiveness of face to face and computer mediated collaboration.",
            "Improving lifting motion planning and re-planning of cranes with consideration for safety and efficiency.",
            "Semantics of model views for information exchanges using the industry foundation class schema.",
            "Developing an analytical model for planning systems verification, validation and testing processes.",
            "Real-time construction worker posture analysis for ergonomics training.",
            "Latent Semantic Engineering - A new conceptual user-centered design approach.",
            "Special Issue: Evolvability of complex systems.",
            "Experiences in evolvability research.",
            "Structured workflow approach to support evolvability.",
            "Improving evolvability of a patient communication control system using state-based supervisory control synthesis.",
            "A retrospective analysis of Teletext: An interoperability standard evolving already over 30 years.",
            "A process simulation based method for scheduling product design change propagation.",
            "Parametric feature constraint modeling and mapping in product development.",
            "Designing evolvable systems in a framework of robust, resilient and sustainable engineering analysis.",
            "A taxonomy of reasoning mechanisms and data synchronization framework for road excavation productivity monitoring.",
            "Development of a data mining-based analysis framework for multi-attribute construction project information.",
            "Hybrid particle swarm optimization and differential evolution for optimal design of water distribution systems.",
            "A constraint satisfaction approach to resolving product configuration conflicts.",
            "Arc-elasticity and hierarchical exploration of the neighborhood of solutions in mechanical design.",
            "Design Scenarios: Enabling transparent parametric design spaces.",
            "Development of user interface for tele-operated cranes.",
            "Editorial.",
            "Advances in architectural, engineering and construction informatics.",
            "Systems modelling for sustainable building design.",
            "Generation and use of sparse navigation graphs for microscopic pedestrian simulation models.",
            "New visual languages supporting design of multi-storey buildings.",
            "An automated stabilisation method for spatial to structural design transformations.",
            "ICA3D - Intelligent computer-aided ancient Chinese architecture design.",
            "Comparative study of multiple criteria decision making methods for building design.",
            "Construction processes configuration using process patterns.",
            "A genetic algorithm-based method for look-ahead scheduling in the finishing phase of construction projects.",
            "An integrated data collection and analysis framework for remote monitoring and planning of construction operations.",
            "\"Models, methods and tools in modern concurrent engineering\".",
            "Simulation based process design: Modeling and applications.",
            "Decision-making support for sustainable product creation.",
            "An approach to assessing virtual environments for synchronous and remote collaborative design.",
            "A distributed agent-based approach for simulation-based optimization.",
            "Supporting Urban Search and Rescue with digital assessments of structures and requests of response resources.",
            "Rapid entropy-based detection and properties measurement of concrete spalling with machine vision for post-earthquake safety assessments.",
            "Knowledge-based support in Non-Destructive Testing for health monitoring of aircraft structures.",
            "Automated FMEA based diagnostic symptom generation.",
            "Automatic execution of workflows on laser-scanned data for extracting bridge surveying goals.",
            "Querying a building information model for construction-specific spatial information.",
            "Traceability in Systems Engineering - Review of industrial practices, state-of-the-art technologies and new research solutions.",
            "A collaborative model for controlling the green supply network in the motorcycle industry."
        ]
    },
    {
        "name": "AEI",
        "year": "2011",
        "info": "Volume 25: 2011",
        "count": 70,
        "papers": [
            "Editorial Volume 25, issue 1.",
            "Special issue on RFID and sustainable value chains.",
            "Optimal layout and deployment for RFID systems.",
            "Applying back propagation network to cold chain temperature monitoring.",
            "A model for quantifying the value of RFID-enabled equipment tracking in hospitals.",
            "A comprehensive multi-factor analysis on RFID localization capability.",
            "Design and implementation of RFID based air-cargo monitoring system.",
            "Using patent data for technology forecasting: China RFID patent analysis.",
            "Systems for sustainability and transparency of food supply chains - Current status and challenges.",
            "Rule-based recursive selective disassembly sequence planning for green design.",
            "Integration of channel decisions in a decentralized reverse production system with retailer collection under deterministic non-stationary demands.",
            "An RFID-based Shopping Service System for retailers.",
            "Editorial for the special issue of information mining and retrieval in design.",
            "Knowledge-based part similarity measurement utilizing ontology and multi-criteria decision making technique.",
            "Semantic-based information retrieval in support of concept design.",
            "A methodology for building a semantically annotated multi-faceted ontology for product family modelling.",
            "Ontology-based customer preference modeling for concept generation.",
            "A semantic file system for integrated product data management.",
            "Semantic methods supporting engineering design innovation.",
            "Case reuse based product fuzzy configuration.",
            "RFID-facilitated construction materials management (RFID-CMM) - A case study of water-supply project.",
            "Development of a 3D virtual environment for improving public participation: Case study - The Yuansantze Flood Diversion Works Project.",
            "A review and outlook for a 'Building Information Model' (BIM): A multi-standpoint framework for technological development.",
            "Pre-processing parallel and orthogonally positioned structural design elements to be used within the finite element method.",
            "Stochastic model of near-periodic vertical loads due to humans walking.",
            "How semantics can improve engineering processes: A case of units of measure and quantities.",
            "Enabling the development of base domain ontology through extraction of knowledge from engineering domain handbooks.",
            "An approach to distributed building modeling on the basis of versions and changes.",
            "Towards intelligent agent based software for building related decision support.",
            "Intelligent decision support for structural design analysis.",
            "Mining building performance data for energy-efficient operation.",
            "Comparative evaluation of Received Signal-Strength Index (RSSI) based indoor localization techniques for construction jobsites.",
            "Assessing the performance of naturally day-lit buildings using data mining.",
            "A density-based spatial clustering approach for defining local indicators of drinking water distribution pipe breakage.",
            "Can we grow buildings? Concepts and requirements for automated nano- to meter-scale building.",
            "Kenneth Preiss. In memoriam.",
            "Engineering informatics in port operations and logistics.",
            "A distributed agent system for port planning and scheduling.",
            "A job grouping approach for planning container transfers at automated seaport container terminals.",
            "A satellite navigation system to improve the management of intermodal drayage.",
            "Integrated intelligent techniques for remarshaling and berthing in maritime terminals.",
            "Berth allocation planning in Seville inland port by simulation and optimisation.",
            "An investigation into knowledge-based yard crane scheduling for container terminals.",
            "Dynamic yard crane dispatching in container terminals with predicted vehicle arrival information.",
            "Developing a dynamic rolling-horizon decision strategy for yard crane scheduling.",
            "Evaluating two model-free data interpretation methods for measurements that are influenced by temperature.",
            "Pothole detection in asphalt pavement images.",
            "A computational framework for authoring and searching product design specifications.",
            "Performance-based evaluation of RFID-based indoor location sensing solutions for the built environment.",
            "Sustainable building technology knowledge representation: Using Semantic Web techniques.",
            "Role-based access to facilities lifecycle information on RFID tags.",
            "Advances and challenges in computing in civil and building engineering.",
            "Digital buildings - Challenges and opportunities.",
            "A distributed multi-model-based Management Information System for simulation and decision-making on construction projects.",
            "Designing a BIM-based serious game for fire safety evacuation simulations.",
            "Identification and representation of information resources for construction firms.",
            "Quality assessment of coupled civil engineering applications.",
            "Integration of infrastructure based positioning systems and inertial navigation for ubiquitous context-aware engineering applications.",
            "Design explorations of performance driven geometry in architectural design using parametric modeling and genetic algorithms.",
            "Phi-array: A novel method for fitness visualization and decision making in evolutionary design optimization.",
            "Virtual sensors for estimation of energy consumption and thermal comfort in buildings with underfloor heating.",
            "Network-level optimization of pavement maintenance renewal strategies.",
            "Automated vision tracking of project related entities.",
            "Automated computation of the fundamental matrix for vision based construction site applications.",
            "A performance evaluation of vision and radio frequency tracking methods for interacting workforce.",
            "An ontology based approach for operational process modeling.",
            "Automated sparse 3D point cloud generation of infrastructure using its distinctive visual features.",
            "Learning and classifying actions of construction workers and equipment using Bag-of-Video-Feature-Words and Bayesian network models.",
            "Intelligent machine agent architecture for adaptive control optimization of manufacturing processes.",
            "Don Grierson."
        ]
    },
    {
        "name": "AEI",
        "year": "2010",
        "info": "Volume 24: 2010",
        "count": 49,
        "papers": [
            "Editorial.",
            "Informatics for cognitive robots.",
            "Architectural paradigms for robotics applications.",
            "Bridging the sense-reasoning gap: DyKnow - Stream-based middleware for knowledge processing.",
            "Engineering intelligent information-processing systems with CAST.",
            "Ikaros: Building cognitive models for robots.",
            "BRAHMS: Novel middleware for integrated systems computation.",
            "Programming multirobot applications using the ThinkingCap-II Java framework.",
            "Integrating high-level cognitive systems with sensorimotor control.",
            "PQONT: A domain ontology for electrical power quality.",
            "Management and forecast of dynamic customer needs: An artificial immune and neural system approach.",
            "Automated recognition of 3D CAD model objects in laser scans and calculation of as-built dimensions for dimensional compliance control in construction.",
            "Enabling technologies for collaborative design.",
            "CLAF: Solving intention violation of step-wise operations in CAD groupware.",
            "Acquiring knowledge on business processes from stakeholders' stories.",
            "A semantics-based approach for collaborative aircraft tooling design.",
            "Product design knowledge management based on design structure matrix.",
            "A model-driven approach to multidisciplinary collaborative simulation for virtual product development.",
            "Supporting the designer's and the user's perspectives in computer-aided architectural design.",
            "Collaboration in scientific visualization.",
            "Systems integration and collaboration in architecture, engineering, construction, and facilities management: A review.",
            "Towards a collaborative modeling and simulation platform on the Internet.",
            "Generations of knowledge management in the architecture, engineering and construction industry: An evolutionary perspective.",
            "A process-view approach for cross-organizational workflows management.",
            "The cognitive factory.",
            "Putting the crowd to work in a knowledge-based factory.",
            "Design-to-fabrication automation for the cognitive machine shop.",
            "Enabling cognitive manufacturing through automated on-machine measurement planning and feedback.",
            "A Semantic Web Services-based approach for production systems control.",
            "A holistic approach for the cognitive control of production systems.",
            "Automated plan assessment in cognitive manufacturing.",
            "Human cognition in manual assembly: Theories and applications.",
            "A skill-based approach towards hybrid assembly.",
            "Federating information portals through an ontology-centred approach: A feasibility study.",
            "Interactive visualisation: A support for system identification.",
            "Estimating correspondence between arbitrarily selected points in two widely-separated views.",
            "Special issue on construction informatics.",
            "Bridge construction schedule generation with pattern-based construction methods and constraint-based simulation.",
            "Knowledge-based schedule generation and evaluation.",
            "Data management for animation of construction processes.",
            "Task network-based project dynamic scheduling and schedule coordination.",
            "Tracking multiple workers on construction sites using video cameras.",
            "Modeling and monitoring of construction supply chains.",
            "Toward automated generation of parametric BIMs based on hybrid video and laser scanning data.",
            "Multi-dimensional building performance data management for continuous commissioning.",
            "A three-stage framework for introducing a 4D tool in large consulting firms.",
            "An intelligent localization algorithm using read time of RFID system.",
            "A flexible and dynamic algorithm for assessment and optimization of utility sectors.",
            "Ontological product modeling for collaborative design."
        ]
    },
    {
        "name": "AEI",
        "year": "2009",
        "info": "Volume 23: 2009",
        "count": 47,
        "papers": [
            "Semi-automated model matching using version difference.",
            "Component-oriented decomposition for multidisciplinary design optimization in building design.",
            "Specification and implementation of directional operators in a 3D spatial query language for building information models.",
            "Slow coherency and Angle Modulated Particle Swarm Optimization based islanding of large-scale power systems.",
            "Implementing information systems with project teams using ethnographic-action research.",
            "Qualitative design support for engineering and architecture.",
            "Improvement of a computer-based surveyor-training tool using a user-centered approach.",
            "Towards automated progress assessment of workpackage components in construction projects using computer vision.",
            "A formal mapping-based approach for distributed schedule coordination on projects.",
            "Time series classification based on qualitative space fragmentation.",
            "Electronic communication systems effects on the success of construction projects in United Arab Emirates.",
            "Advanced engineering informatics editorial.",
            "Editorial: Human-centered product design and development.",
            "Design Contribution Square.",
            "Human-centric product conceptualization using a design space framework.",
            "An ontological approach to designers' idea explanation style: Towards supporting the sharing of kansei-ideas in textile design.",
            "Product design evaluation model of child car seat using gray relational analysis.",
            "Designing for other people's strengths and motivations: Three cases using context, visions, and experiential prototypes.",
            "Macro-informatics of cognition and its application for design.",
            "A vision-oriented approach for innovative product design.",
            "A stakeholder-oriented innovative product conceptualization strategy based on fuzzy integrals.",
            "An integrated component design approach to the development of a design information system for customer-oriented product design.",
            "A rough set based QFD approach to the management of imprecise design information in product development.",
            "What did you learn from practice today? Exploring experiences from a Danish R&D effort in digital construction.",
            "A meta-level evolutionary strategy for many-criteria design: Application to improving tracking filters.",
            "A flexible tolerance genetic algorithm for optimal problems with nonlinear equality constraints.",
            "Multi criteria analyses for managing motorway company facilities: The decision support system SINERGIE.",
            "Complex flow simulations in natural aquifer.",
            "Understanding design activities through computer simulation.",
            "Incremental state based diagnosis.",
            "Improving communication barriers for on-site information flow: An exploratory study.",
            "Component-based records: A novel method to record transaction design work.",
            "A neural network classifier with rough set-based feature selection to classify multiclass IC package products.",
            "Editorial for special issue - Civil engineering informatics.",
            "Reasoning about designs through frequent patterns mining.",
            "Topological analysis of 3D building models using a spatial query language.",
            "An investigation of the option space in conceptual building design for advanced building simulation.",
            "Modeling and visualization of lifecycle building performance assessment.",
            "Modeling blast wave propagation using artificial neural network methods.",
            "Configuring and enhancing measurement systems for damage identification.",
            "The Analytical Hierarchy Process for contaminated land management.",
            "Intelligent finite element method: An evolutionary approach to constitutive modeling.",
            "Personnel tracking on construction sites using video cameras.",
            "Systematic procedure of determining an ideal color scheme on 4D models.",
            "Problem-dependent search for optimal parameter instantiation order in design spaces.",
            "High-precision identification of contextual information in location-aware engineering applications.",
            "Facilitating design learning through faceted classification of in-service information."
        ]
    },
    {
        "name": "AEI",
        "year": "2008",
        "info": "Volume 22: 2008",
        "count": 46,
        "papers": [
            "Editorial.",
            "Intelligent computing in engineering and architecture.",
            "Towards the next generation of artificial neural networks for civil engineering.",
            "Management and analysis of unstructured construction data types.",
            "Challenges, approaches and architecture for distributed process integration in heterogeneous environments.",
            "A nature-inspired decentralized trust model to reduce information unreliability in complex disaster relief operations.",
            "Generation of energy-efficient architecture solutions applying GENE_ARCH: An evolution-based generative design system.",
            "Constructing design representations using a sortal approach.",
            "General-purpose modular hardware and software framework for mobile outdoor augmented reality applications in engineering.",
            "Performance of KNN and SVM classifiers on full word Arabic articles.",
            "Investigating ontology development for engineering design support.",
            "Model-free data interpretation for continuous monitoring of complex structures.",
            "Guest editor's introduction: Special Issue on network methods in engineering.",
            "Using linear graph theory and the principle of orthogonality to model multibody, multi-domain systems.",
            "Combinatorial synthesis approach employing graph networks.",
            "A codimension-zero approach to discretizing and solving field problems.",
            "Make-to-order or make-to-stock decision by a novel hybrid approach.",
            "Soft computing in engineering design - A review.",
            "An approach to accessing product data across system and software revisions.",
            "A Bayesian support tool for morphological design.",
            "A geometric modelling framework for conceptual structural design from early digital architectural models.",
            "Building information modelling - Experts' views on standardisation and industry deployment.",
            "Special Issue on collaborative design and manufacturing.",
            "Special section: CSCWD2006 web service-oriented manufacturing resource applications for networked product development.",
            "A cooperative universal data model platform for the data-centric electronic system-level design.",
            "Special section: CSCWD 2006 interfacing heterogeneous PDM systems using the PLM Services.",
            "Federated integration of networked manufacturing service platforms.",
            "Multi-model driven collaborative development platform for service-oriented e-Business systems.",
            "A collaborative face-to-face design support system based on sketching and gesturing.",
            "Enabling the creation of domain-specific reference collections to support text-based information retrieval experiments in the architecture, engineering and construction industries.",
            "Virus coevolution partheno-genetic algorithms for optimal sensor placement.",
            "Pareto multi-criteria decision making.",
            "Retrieving 3D CAD model by freehand sketches for design reuse.",
            "Spatial to kinematically determined structural transformations.",
            "Compression of small text files.",
            "PLM challenges.",
            "An evaluation of the time-varying extended logistic, simple logistic, and Gompertz models for forecasting short product lifecycles.",
            "Supporting collaborative engineering using an intelligent web service middleware.",
            "A DEA benchmarking methodology for project planning and management of new product development under decentralized profit-center business model.",
            "Supporting management and maintenance of manufacturing knowledge in design automation systems.",
            "IT-based approach for effective management of project changes: A change management system (CMS).",
            "An intelligent method for selecting optimal materials and its application.",
            "Evaluating interface designs for user-system interaction media in buildings.",
            "Automated construction activity monitoring system.",
            "An investigation into the applicability of building information models in geospatial environment in support of site selection and fire response management processes.",
            "Credibility and applicability of virtual reality models in design and construction."
        ]
    },
    {
        "name": "AEI",
        "year": "2007",
        "info": "Volume 21: 2007",
        "count": 37,
        "papers": [
            "Advanced Engineering Informatics.",
            "Evolutionary algorithms in multiply-specified engineering. The MOEAs and WCES strategies.",
            "Kumbang: A domain ontology for modelling variability in software product families.",
            "Fuzzy compatibility structures in new product development.",
            "An intelligent hybrid system for wafer lot output time prediction.",
            "Visual knowledge specification for conceptual design: Definition and tool support.",
            "A multi-objective scatter search for a mixed-model assembly line sequencing problem.",
            "A new concept of compatibility structure in new product development.",
            "Ontology of systems and software engineering.",
            "Toward a formal research framework for ontological analyses.",
            "Scientific research ontology to support systematic review in software engineering.",
            "Towards the design of intelligent CAD systems: An ontological approach.",
            "Classifying architectural constraints as a basis for software quality assessment.",
            "Special Issue on techniques to support collaborative engineering environments.",
            "An abstract knowledge based approach to diagnosis and recovery of plan failure in multi-agent systems.",
            "Exploring the CSCW spectrum using process mining.",
            "To support multidisciplinary communication in VR-based virtual prototyping of mechatronic systems.",
            "Conflicts classification and solving for collaborative feature modeling.",
            "A p2p based service flow system with advanced ontology-based service profiles.",
            "CPM: A collaborative process modeling for cooperative manufacturers.",
            "Applications eligible for data mining.",
            "Mining data from intensive care patients.",
            "Inference of power plant quake-proof information based on interactive data mining approach.",
            "MICF: An effective sanitization algorithm for hiding sensitive patterns on data mining.",
            "Building contextual classifiers by integrating fuzzy rule based classification technique and k-nn method for credit scoring.",
            "Applying knowledge engineering techniques to customer analysis in the service industry.",
            "A hybrid system for SPC concurrent pattern recognition.",
            "Incremental development of CBR strategies for computing project cost probabilities.",
            "Anxiety-based affective communication for implicit human-machine interaction.",
            "Improved Decision Neural Network (IDNN) based consensus method to solve a multi-objective group decision making problem.",
            "Special Section on RFID applications in engineering.",
            "Radio-Frequency Identification (RFID) applications: A brief introduction.",
            "Life-cycle data management of engineered-to-order components using radio frequency identification.",
            "A proximity-based method for locating RFID tagged objects.",
            "Dynamic mobile RFID-based supply chain control and management system in construction.",
            "Local search optimisation applied to the minimum distance problem.",
            "A language for functional interpretation of model based simulation."
        ]
    },
    {
        "name": "AEI",
        "year": "2006",
        "info": "Volume 20: 2006",
        "count": 37,
        "papers": [
            "20th Anniversary.",
            "Artificial intelligence in engineering: Personal reflections.",
            "A hybrid real-parameter genetic algorithm for function optimization.",
            "Computer based pedestrian landscape design using decision tree templates.",
            "Topologies of agents interactions in knowledge intensive multi-agent systems for networked information services.",
            "Multi-Level modeling and access control for data sharing in collaborative design.",
            "Multi-agent robot systems as distributed autonomous systems.",
            "An ontological engineering approach for integrating CAD and GIS in support of infrastructure management.",
            "An information value based approach to design procedure capture.",
            "Special issue on engineering informatics for eco-design.",
            "A systematic approach to eco-innovative product design based on life cycle planning.",
            "A simulation system to support the establishment of circulated business.",
            "Intelligent evaluation approach for electronic product recycling via case-based reasoning.",
            "A knowledge-based approximate life cycle assessment system for evaluating environmental impacts of product design alternatives in a collaborative design environment.",
            "Grammatical rules for specifying information for automated product data modeling.",
            "Design issues for assistive robotics for the elderly.",
            "Construction informatics: Definition and ontology.",
            "Crowded comparison operators for constraints handling in NSGA-II for optimal design of the compensation system in electrical distribution networks.",
            "Application of a noisy data classification technique to determine the occurrence of flashover in compartment fires.",
            "Design of complex adaptive systems: Introduction.",
            "Evolutionary approach for solving cell-formation problem in cell manufacturing.",
            "Emergent synthesis in supply network tool management.",
            "Capability-based emerging organization of autonomous agents for flexible production control.",
            "Emergent short-term forecasting through ant colony engineering in coordination and control systems.",
            "Reinforcement learning in a distributed market-based production control system.",
            "Correlations between emergent synthesis classes: Due date based control and planning of job shops.",
            "A homogeneous mobile robot team that is fault-tolerant.",
            "Emergence out of interaction: Developing evolutionary technology for design innovation.",
            "Temporal co-creation between self and others with multi-sensory inputs.",
            "A human-assisted knowledge extraction method for machining operations.",
            "Improving the tutoring of software design using case-based reasoning.",
            "Floor shape optimization for green building design.",
            "Integration of fuzzy logic, genetic algorithms and neural networks in collaborative parametric design.",
            "A computational framework for retrieval of document fragments based on decomposition schemes in engineering information management.",
            "Applications of agent-based systems in intelligent manufacturing: An updated review.",
            "Optimal delay estimation using complete bipartite graph method for VoIP over WLAN environments.",
            "Construction site image retrieval based on material cluster recognition."
        ]
    },
    {
        "name": "AEI",
        "year": "2005",
        "info": "Volume 19: 2005",
        "count": 31,
        "papers": [
            "Editorial.",
            "In Memoriam: András Márkus (1949-2005).",
            "An object-oriented framework for simulation-based green building design optimization with genetic algorithms.",
            "Composition of engineering web services with distributed data-flows and computations.",
            "Comparison among five evolutionary-based optimization algorithms.",
            "Recurrent neuro-fuzzy system for fault detection and isolation in nuclear reactors.",
            "Bounded optimization of resource allocation among multiple agents using an organizational decision model.",
            "Special issue on collaborative environments for design and manufacturing.",
            "Designing with ethnography: An integrative approach to CSCW design.",
            "TRINETR: An architecture for collaborative intrusion detection and knowledge-based alert evaluation.",
            "Ontology based semantic conflicts resolution in collaborative editing of design documents.",
            "COE: A collaborative ontology editor based on a peer-to-peer framework.",
            "An autonomous agent development environment for engineering applications.",
            "Manufacturing planning and predictive process model integration using software agents.",
            "Composition of mismatched web services in distributed service oriented design activities.",
            "A collaborative approach to assembly sequence planning.",
            "A cooperative virtual prototyping system for mechatronic solution elements based assembly.",
            "Obituary for Professor Rob Milne.",
            "A concise introduction to autonomic computing.",
            "Autonomic communications and the reflex unified fault management architecture.",
            "Self-adaptive middleware: Supporting business process priorities and service level agreements.",
            "Usable autonomic computing systems: The system administrators' perspective.",
            "A hayekian self-organization approach to service allocation in computing systems.",
            "e-Forensics steganography system for secret information retrieval.",
            "AMUN-autonomic middleware for ubiquitous environments applied to the smart doorplate project.",
            "Introduction.",
            "A hybrid intelligent genetic algorithm.",
            "Interactive visualisation for decision support and evaluation of robustness - in theory and in practice.",
            "A machine learning approach for the support of preliminary structural design.",
            "Data mining techniques for improving the reliability of system identification.",
            "Monitoring bridge health using fuzzy case-based reasoning."
        ]
    },
    {
        "name": "AEI",
        "year": "2004",
        "info": "Volume 18: 2004",
        "count": 21,
        "papers": [
            "Neural network model adaptation and its application to process control.",
            "Handwritten Indian numerals recognition system using probabilistic neural networks.",
            "Estimating the productivity of cyclic construction operations using case-based reasoning.",
            "A new approach to self-organizing multi-layer fuzzy polynomial neural networks based on genetic optimization.",
            "Ant colony optimization techniques for the vehicle routing problem.",
            "Perspectors: composable, reusable reasoning modules to construct an engineering view from other engineering views.",
            "Guest editor's preface.",
            "Building a project ontology with extreme collaboration and virtual design and construction.",
            "Use of design patterns in analogy-based design.",
            "Physical concept ontology for the knowledge intensive engineering framework.",
            "Deployment of an ontological framework of functional design knowledge.",
            "An adaptive website system to improve efficiency with web mining techniques.",
            "Hierarchical representation of complex systems for supporting human decision making.",
            "Inter-agent cooperation and communication for agent-based robust dynamic scheduling in steel production.",
            "A Web-enabled virtual repository for supporting distributed automotive component development.",
            "Enterprise modelling and system support.",
            "Interoperability in enterprise modelling: requirements and roadmap.",
            "Enterprise architecture modelling--the issue of integration.",
            "Process thinking in support of system specification and selection.",
            "Framework for releasing preliminary information in product development.",
            "Improving enterprise system support - a case-based approach."
        ]
    },
    {
        "name": "AEI",
        "year": "2003",
        "info": "Volume 17: 2003",
        "count": 14,
        "papers": [
            "N* - an agent-based negotiation algorithm for dynamic scheduling andn rescheduling.",
            "A generic feature-driven activity-based cost estimation process.",
            "Assisting conceptual design of building structures by an interactive description logic based planner.",
            "Determining the optimal cross-section of beams.",
            "Transforming engineering problems through graph representations.",
            "Using A-Teams to optimize automatic insertion of electronic components.",
            "Editorial.",
            "Watchdog Agent - an infotronics-based prognostics approach for product performance degradation assessment and prediction.",
            "Robust performance degradation assessment methods for enhanced rolling element bearing prognostics.",
            "Enhanced diagnostic certainty using information entropy theory.",
            "A new effective heuristic for the intelligent management of the preventive maintenance tasks of the distributed systems.",
            "Development of an e-Diagnostics/Maintenance framework for semiconductor factories with security considerations.",
            "Using cost based FMEA to enhance reliability and serviceability.",
            "Research issues on product lifecycle management and information tracking using smart embedded systems."
        ]
    },
    {
        "name": "AEI",
        "year": "2002",
        "info": "Volume 16: 2002",
        "count": 23,
        "papers": [
            "Editorial.",
            "The introduction of a design heuristics extraction method.",
            "Developing intelligent tensegrity structures with stochastic search.",
            "Matching computational strategies to task complexity and user requirements.",
            "A performance-based approach to wheelchair accessible route analysis.",
            "Industrial neural vision system for underground railway station platform surveillance.",
            "Behavior-based intelligent mobile robot using an immunized reinforcement adaptive learning mechanism.",
            "Solving vehicle routing problems by maximum neuron model.",
            "Estimate design intent: a multiple genetic programming and multivariate analysis based approach.",
            "Dynamic structuring of distributed manufacturing systems.",
            "Graph-based induction and its applications.",
            "A functional concept ontology and its application to automatic identification of functional structures.",
            "A comparison of Kernel methods for instantiating case based reasoning systems.",
            "Probabilistic inference with maximum entropy for prediction of flashover in single compartment fire.",
            "Constraint-handling in genetic algorithms through the use of dominance-based tournament selection.",
            "An Evolutionary Parallel Tabu Search approach for distribution systems reinforcement planning.",
            "Optimal control of ship unloaders using reinforcement learning.",
            "A strategy for acquiring customer requirement patterns using laddering technique and ART2 neural network.",
            "Artificial neural networks for job shop simulation.",
            "Implicit rule-based fuzzy-neural networks using the identification algorithm of GA hybrid scheme based on information granulation.",
            "Learning in multi-agent systems: a case study of construction claims negotiation.",
            "A question answering system for project management applications.",
            "Path planning in construction sites: performance evaluation of the Dijkstra, A*, and GA search algorithms."
        ]
    },
    {
        "name": "AEI",
        "year": "2001",
        "info": "Volume 15: 2001",
        "count": 35,
        "papers": [
            "Editorial comment.",
            "Letter to the Editor.",
            "Animal-like adaptive behavior.",
            "FuREAP: a Fuzzy-Rough Estimator of Algae Populations.",
            "Taguchi-tuned radial basis function with application to high precision motion control.",
            "ECA rule-based support for workflows.",
            "Dynamic space ordering at a topological level in space planning.",
            "Time-series prediction based on pattern classification.",
            "A genetic algorithm based method for bidding strategy coordination in energy and spinning reserve markets.",
            "Conceptual modeling in design.",
            "Phenomenologial foundations of conceptual product modelling in architecture, engineering and construction.",
            "Incremental modelling of ambiguous geometric ideas (I-MAGI): representation and maintenance of vague geometry.",
            "Some conceptual issues in component-assembly modelling.",
            "Design ontology in context - a situated cognition approach to conceptual modelling.",
            "Knowledge level model of an individual designer as an agent in collaborative distributed design.",
            "Knowledge modeling for design decisions.",
            "Conceptual modeling for configuration of mass-customizable products.",
            "Development of a maintenance management model based on IAI standards.",
            "A model-driven approach to the development of an architectural object model.",
            "Conceptual modeling from natural language functional specifications.",
            "Generating code for engineering design systems using software patterns.",
            "Adaptive reconstruction of bone geometry from serial cross-sections.",
            "Analysis of artificial neural network models for freeway ramp metering control.",
            "Incorporating machine intelligence in a parameter-based control system: a neural-fuzzy approach.",
            "A low-cost internet-based telerobotic system for access to remote laboratories.",
            "Heuristic methods for vehicle routing problem with time windows.",
            "Stabilization control of series-type double inverted pendulum systems using the SIRMs dynamically connected fuzzy inference model.",
            "An ant colony optimization approach to addressing a JIT sequencing problem with multiple objectives.",
            "Emergent Synthesis.",
            "Synthesis and emergence - research overview.",
            "Understanding design fundamentals: how synthesis and analysis drive creativity, resulting in emergence.",
            "Pheromone based emergent shop floor control system for flexible flow shops.",
            "Emergent synthesis of motion patterns for locomotion robots.",
            "Simulating behaviors of human situation awareness under high workloads.",
            "Concept of self-reconfigurable modular robotic system."
        ]
    },
    {
        "name": "AEI",
        "year": "2000",
        "info": "Volume 14: 2000",
        "count": 29,
        "papers": [
            "Indexing and retrieval in machining process planning using case-based reasoning.",
            "Automatic generation of control sequences for manufacturing systems based on partial order planning techniques.",
            "Modified adaptive discrete control system containing neural estimator and neural controller.",
            "A neural network approach for selection of powder metallurgy materials and process parameters.",
            "Application of a support system to the design of wastewater treatment plants.",
            "Information extraction from documents for automating software testing.",
            "Knowledge decomposition for a product design blackboard expert system.",
            "An object-oriented knowledge based Petri net approach to intelligent integration of design and assembly planning.",
            "3D arm movement recognition using syntactic pattern recognition.",
            "Operational issues of sequencing with elastic nets.",
            "Fault diagnosis competitive neural network with prioritized modification rule of connection weights.",
            "A GA-based search method for the tolerance allocation problem.",
            "Rule-based system application for a technical problem in inventory issue.",
            "Stabilization fuzzy control of inverted pendulum systems.",
            "Design of the speed controller for sensorless electric drives based on AI techniques: a comparative study.",
            "A neural network approach for a robot task sequencing problem.",
            "Development of expert systems for stream sampling in mineral processing plants.",
            "Dear Professors G. Rzevski, I. Smith and T. Tomiyama.",
            "Collaborative and concurrent engineering in the construction industry.",
            "CAIRO: a concurrent engineering meeting environment for virtual design teams.",
            "Telepresence in concurrent lifecycle design and construction.",
            "SEED-Config: a tool for conceptual structural design in a collaborative building design environment.",
            "Versioning and configuration management in design using CAD and complex wrapped objects.",
            "Constraint-based support for negotiation in collaborative design.",
            "Issues in the performance measurement of constraint-satisfaction techniques.",
            "Routing in computer networks using artificial neural networks.",
            "Prediction of the bulking phenomenon in wastewater treatment plants.",
            "A genetic algorithm for generating optimal assembly plans.",
            "Debugging VHDL designs using model-based reasoning."
        ]
    },
    {
        "name": "AEI",
        "year": "1999",
        "info": "Volume 13: 1999",
        "count": 38,
        "papers": [
            "Representing user preference in engineering design domains using an enhanced weighted fuzzy reasoning algorithm.",
            "A factorisation model of robotic tasks.",
            "A toolset for construction of hybrid intelligent forecasting systems: application for water demand prediction.",
            "A verification method for systolic arrays using induction-based theorem provers.",
            "Review of the applications of neural networks in chemical process control - simulation and online implementation.",
            "Efficient planning for a miniature assembly line.",
            "A new method for diagnostic problem solving based on a fuzzy abductive inference model and the tabu search approach.",
            "The structure of a physical behaviour description facility.",
            "Training Elman and Jordan networks for system identification using genetic algorithms.",
            "Self-tuning fuzzy controller design using genetic optimisation and neural network modelling.",
            "An extended Kalman filter and neural network cascade fault diagnosis strategy for the glutamic acid fermentation process.",
            "Autonomous agent based on reinforcement learning and adaptive shadowed network.",
            "Adaptive navigation of autonomous vehicles using evolutionary algorithms.",
            "Model switching in intelligent control systems.",
            "Artificial neural networks as applied to long-term demand forecasting.",
            "A knowledge based database system for engineering correlations.",
            "Genetic algorithms for designing multihop lightwave network topologies.",
            "Function approximations by coupling neural networks and genetic programming trees with oblique decision trees.",
            "A knowledge-based dynamic job-scheduling in low-volume/high-variety manufacturing.",
            "Automatic design synthesis with artificial intelligence techniques.",
            "Evaluating machine learning models for engineering problems.",
            "Graph theory representations of engineering systems and their embedded knowledge.",
            "Combined analytical and empirical learning framework for branch and bound algorithms: the knapsack problem.",
            "Fast training algorithm for feedforward neural networks: application to crowd estimation at underground stations.",
            "Identification of plant inverse dynamics using neural networks.",
            "Rule-base content verification using a digraph-based modelling approach.",
            "Guest editorial.",
            "Trend detection based on a fuzzy temporal profile model.",
            "Unsupervised neural method for temperature forecasting.",
            "Recognising humans by gait via parametric canonical space.",
            "Automatic diagnosis with genetic algorithms and case-based reasoning.",
            "Speech understanding and speech translation by maximum a-posteriori semantic decoding.",
            "Neural network modeling of active devices for use in MMIC design.",
            "A robotic system based on neural network controllers.",
            "A genetic algorithm for minimizing the makespan in the case of scheduling identical parallel machines.",
            "Linearizing control of a binary distillation column based on a neuro-estimator.",
            "On-line control chart pattern detection and discrimination - a neural network approach.",
            "The development of a connectionist expert system for compensation of color deviation in offset lithographic printing."
        ]
    },
    {
        "name": "AEI",
        "year": "1998",
        "info": "Volume 12: 1998",
        "count": 34,
        "papers": [
            "An intelligent database for engineering applications.",
            "Cross breeding in genetic optimisation and its application to fuzzy logic controller design.",
            "Probabilistic reasoning and multiple-expert methodology for correlated objective data.",
            "Fault detection and diagnosis using statistical control charts and artificial neural networks.",
            "Hybrid production control approach for JIT scheduling.",
            "A new approach to fault diagnosis in electrical distribution networks using a genetic algorithm.",
            "Selecting tools and techniques for model-based diagnosis.",
            "Recognizing patterns in information retrieval: a memory-based classifier for inferring relevancy.",
            "The role of explanations in an intelligent assistant system.",
            "Artificial intelligence approaches to determination of CNC machining parameters in manufacturing: a review.",
            "Dynamic weight estimation using an artificial neural network.",
            "The intelligent approach to register-transfer level synthesis.",
            "Space layout planning using an evolutionary approach.",
            "Evolving design genes in space layout planning problems.",
            "Principled negotiation between intelligent agents: a model for air traffic management.",
            "Democracy in pattern classifications: combinations of votes from various pattern classifiers.",
            "Intelligent tutoring systems for training of operators for thermal power plants.",
            "A real-time recurrent learning network structure for data reconciliation.",
            "A predictor based on adaptive resonance theory.",
            "Intelligent tool wear estimation system through artificial neural networks and fuzzy modeling.",
            "Robust estimation of discrete hidden Markov model parameters using the entropy-based feature-parameter weighting and source-quantization modeling.",
            "Fuzzy logic in a blackboard system for controlling plasma deposition processes.",
            "Operator guidance system for coal washing.",
            "Intelligent control of wastewater treatment plants.",
            "A case study on the use of model-based systems for electronic fault diagnosis.",
            "Solution reuse for model generation in numerical simulation.",
            "A knowledge-based guidance system for multi-attribute decision making.",
            "Reasoning about function and its applications to engineering.",
            "More than just shape: a representation for functionality.",
            "Introducing deviations and multiple abstraction levels in the functional diagnosis of fluid transfer systems.",
            "Failure modes and effects analysis of complex engineering systems using functional models.",
            "Component-ontological representation of function for reasoning about devices.",
            "Functional modeling for enabling adaptive design of devices for new environments.",
            "Function-directed electrical design analysis."
        ]
    },
    {
        "name": "AEI",
        "year": "1997",
        "info": "Volume 11: 1997",
        "count": 48,
        "papers": [
            "Guest editorial.",
            "Subdefinite mathematics and novel scheduling technology.",
            "Application of subdefinite models in engineering.",
            "Engineering theories as a basis for integrating deep engineering knowledge.",
            "Knowledge-based tools for development of engineering theories.",
            "Information technology for forecasting geological processes and phenomena.",
            "An expert system for design of spacecraft attitude control systems.",
            "Case-based reasoning in design: M. L. Maher, M. B. Balachandran & D. M. Zhang, Lawrence Erlbaum Associates, Mahwah, NJ, 1995, ISBN 0-8058-1832-4, 246 pp.",
            "Text analysis for constructing design representations.",
            "Libra: a high fidelity knowledge-based system for recommending scheduling programs.",
            "A distributed constraint-based scheduler.",
            "A case-based approach to planar linkage design.",
            "A belief framework for order-of-magnitude reasoning and other qualitative relations.",
            "Using ART2 networks to deduce flow velocities.",
            "Quantitative knowledge based approach for preliminary design of tall buildings.",
            "Neural network design based on evolutionary programming.",
            "An IDSS development environment based on consistent language.",
            "Applying case-based reasoning to engine oil design.",
            "Symbolic propagation and sensitivity analysis in Gaussian Bayesian networks with application to damage assessment.",
            "Rule inferencing and object-orientation for boundary elements mesh design.",
            "An expert system to generate associativity data for layout design.",
            "CAD method for industrial assembly - Concurrent Design of Products, Equipment and Control Systems: Edited by A. Delchambre. John Wiley & Sons, Chichester, UK, 1996, ISBN 0-471-96261-9, 279 pages.",
            "Guest editorial.",
            "A causal modelling framework for the simulation and explanation of the behaviour of structures.",
            "Application of intelligent CAD paradigms to preliminary structural design.",
            "An agent-based paradigm for building intelligent CAD systems.",
            "Reconstructive memory in case-based design.",
            "Decision support for conceptual bridge design.",
            "Conceptual modelling of building regulation knowledge.",
            "Guest editorial.",
            "An exploration into evolutionary models for non-routine design.",
            "A genetic algorithm for continuous design space search.",
            "Placing computations by adaptive procedures.",
            "Co-evolution and emergence in design.",
            "Learning and re-using information in space layout planning problems using genetic engineering.",
            "Working from blueprints: evolutionary learning for design.",
            "Guest editorial.",
            "Modular modelling of an evaporator for long-range prediction.",
            "Data reconciliation for simulated flotation process.",
            "Identification and predictive control of a melter unit used in the sugar industry.",
            "Neural networks for steady state modelling of an extruder.",
            "Estimation of inaccessible fermentation states with variable inoculum sizes.",
            "Modelling pressure drop in water treatment.",
            "Modelling of coagulant dosage in a water treatment plant.",
            "A feedforward control strategy for distillation columns.",
            "Extraction of structures from turbulent signals.",
            "Synthesis of reinforcement learning, neural networks and PI control applied to a simulated heating coil.",
            "Neural and adaptive controllers for a non-minimum phase varying time-delay system."
        ]
    },
    {
        "name": "AEI",
        "year": "1996",
        "info": "Volume 10: 1996",
        "count": 35,
        "papers": [
            "A new system identification technique using Kaiman filtering and multilayer neural networks.",
            "Classification of plastics materials.",
            "Application of a neural network machine learning model in the selection system of sheet metal bending tooling.",
            "Adaptive control of a robot arm using driver programs.",
            "A high school project on artificial intelligence in robotics.",
            "Symbolic pattern manipulation of Karnaugh-Veitch maps for pneumatic circuits.",
            "A multirate sampling structure for adaptive robot control using a neurocompensator.",
            "An artificial intelligence approach for generating assembly sequences in CAD/CAM.",
            "A representation language for mechanical behavior.",
            "A neural network position independent multiple pattern recogniser.",
            "An evolutionary approach for configuring economical packet switched computer networks.",
            "Realisation of neural network controllers in integrated process supervision.",
            "Artificial evolution of neural networks and its application to feedback control.",
            "Describing process plans as the formal semantics of a language of shape.",
            "CADRE: case-based geometric design.",
            "Knowledge acquisition method for conceptual design based on value engineering and axiomatic design theory.",
            "Neural network modelling and control for underwater vehicles.",
            "Neural network applications in naval architecture and marine engineering.",
            "Model based object recognition - the role of affine invariants.",
            "Component selection using non-monotonic reasoning.",
            "An integrated approach for range image segmentation and representation.",
            "Constraint logic programming for structure-based reasoning about dynamic physical systems.",
            "Rule-based versus probabilistic approaches to the diagnosis of faults in wastewater treatment processes.",
            "DAI-DEPUR: an integrated and distributed architecture for wastewater treatment plants supervision.",
            "Guest editorial.",
            "Mobile robot fuzzy control optimization using genetic algorithm.",
            "Research into models and algorithms of artificial life.",
            "A fuzzy neural network and its application to controls.",
            "A real-time expert control system.",
            "Obstacle detection and environment modeling based on multisensor fusion for robot navigation.",
            "A parallel distributed knowledge-based system for turbine generator fault diagnosis.",
            "An effective method for identifying small objects on a complicated background.",
            "An intelligent multi-blackboard CAD system.",
            "A model of inexact reasoning in mechanical design evaluation.",
            "A new laser-scanning sensing technique for underwater engineering inspection."
        ]
    },
    {
        "name": "AEI",
        "year": "1994",
        "info": "Volume 9: 1994/1995",
        "count": 26,
        "papers": [
            "A constraint-system shell to support concurrent engineering approaches to design.",
            "A knowledge base for finite element mesh design.",
            "Rule-based control of a telecommunications network using the blackboard model.",
            "Multi-agent collaboration in time-constrained domains.",
            "A comparison of design and nondesign problem spaces.",
            "Genetic algorithm optimization of multi-peak problems: studies in convergence and robustness.",
            "Training the neocognitron network using design of experiments.",
            "Generation of operation sequences for accident restoration of primary substations based on a re-usable knowledge base.",
            "Diagnosing continuous systems with qualitative dynamic models.",
            "Highway design by constraint specification.",
            "Back-propagation neural networks for modeling complex systems.",
            "An investigation of an expert system for hydraulic circuit design with learning.",
            "A neural network PI controller tuner.",
            "Introduction to TIPS: a theory for creative design.",
            "Dealing with physical quantities in object-oriented database.",
            "Human-machine cooperative control for ethylene production.",
            "A novel application of artificial neural networks to structural analysis.",
            "Integrating constraint management into an AI planner.",
            "Multiagent coordination and cooperation in a distributed dynamic environment with limited resources.",
            "Guest editorial.",
            "Integration of multiple knowledge representation for classification problems.",
            "Knowledge-level analysis for eliciting composable scheduling knowledge.",
            "Implementation and refinement of decision trees using neural networks for hybrid knowledge acquisition.",
            "Case-based knowledge acquisition for schedule optimization.",
            "Blackboard scheduler control knowledge for diagnostic problem-solving.",
            "Building object-oriented systems: An introduction from concepts to implementation in c++: R. E. Callan, Computational Mechanics Publications, Southampton, UK, 1994, ISBN 1-85312-340-4, 304 pp."
        ]
    },
    {
        "name": "AEI",
        "year": "1993",
        "info": "Volume 8: 1993",
        "count": 28,
        "papers": [
            "Intelligent control of external software systems.",
            "An application of qualitative analysis of ordinary differential equations to azeotropic batch distillation.",
            "Evolutionary processing of design knowledge using message delegation.",
            "Advisory expert system for flexible pavement design.",
            "A prototype expert system for embodiment design of mechanisms and articulated systems.",
            "Identification of linear and nonlinear dynamic systems using recurrent neural networks.",
            "Data and knowledge integration through the feature-based approach.",
            "Using interval algebras to model order of magnitude reasoning.",
            "Genetic algorithm representations for laminate layups.",
            "The knowledge-based factory.",
            "AI methods for life-cycle serviceability design of mechanical systems.",
            "A model of aesthetic judgment in design.",
            "Guest editorial.",
            "Machine learning in artificial intelligence.",
            "New roles for machine learning in design.",
            "Customised perspectives of past designs from automated group rationalisations.",
            "Supporting drug design using an incremental learning approach.",
            "The development of Bridger: A methodological study of research on the use of machine learning in design.",
            "An imperative language for task-level planning: Definition in temporal logic.",
            "Temporal logic programming for assembly sequence planning.",
            "Large engineering knowledge bases.",
            "Approximate methods of structural analysis and design in a knowledge-based system environment.",
            "An algorithm for automatic rule induction.",
            "EXPERT-MM: A knowledge-based system for maintenance management.",
            "Qualitatively modelling the effects of electrical circuit faults.",
            "Decopan Design: a knowledge-based system for industrial controlgear panels design.",
            "Safety-critical neural computing: explanation and verification in knowledge augmented neural networks.",
            "Neural network learning and expert systems: Stephen I. Gallant, MIT Press, Cambridge, MA, ISBN 0-262-071-452."
        ]
    },
    {
        "name": "AEI",
        "year": "1992",
        "info": "Volume 7: 1992",
        "count": 16,
        "papers": [
            "Prismm: A novel intelligent supervisory controller for automated guided vehicles.",
            "Design method based on linguistics and logic.",
            "Towards a decision-support framework for the embodiment phase of mechanical design.",
            "Expert systems in conceptual phase of mechanical engineering design.",
            "Prototype-oriented representation of engineering design knowledge.",
            "Frame-based architectures for manufacturing planning and control.",
            "Detecting and resolving conflicts among cooperating human and machine-based design agents.",
            "Qualitative simulation in the limit.",
            "Multi-level qualitative reasoning applied to CMOS digital circuits.",
            "Model-based traffic control.",
            "Prolog versus Kee - A case study.",
            "On extending the quantity space in qualitative reasoning.",
            "Constraint logic programming: Applications and implications.",
            "Temporal duration reasoning in qualitative simulation.",
            "Frames, quantification, perspectives, and negotiation in constraint networks for life-cycle engineering.",
            "The PCP: A predictive model for satisfying conflicting objectives in scheduling problems."
        ]
    },
    {
        "name": "AEI",
        "year": "1991",
        "info": "Volume 6: 1991",
        "count": 19,
        "papers": [
            "Intelligent front-ends for engineering applications.",
            "Intelligent interfaces: The IMPACT survey.",
            "Multi-level cooperative dialogue in intelligent front-ends.",
            "Deriving principles for generating co-operative responses - an experiment.",
            "Development of an intelligent front-end for a computational fluid dynamics package.",
            "An intelligent front-end for computer-aided building design.",
            "Intelligent front-ends and product models.",
            "A survey of constraint based scheduling systems using an artificial intelligence approach.",
            "An expert system for formulating lubricating oils.",
            "A probabilistic model-based method for diagnosis.",
            "Aspects of constraint processing.",
            "A distributed asynchronous system for predictive and reactive scheduling.",
            "A knowledge-based expert system for rolling-element bearing selection in mechanical engineering design.",
            "Simulating both dynamic and kinematic behaviors of mechanical mechanisms.",
            "Focusing candidate generation.",
            "Knowledge based floor plan design by space partitioning: A logic programming approach.",
            "Formal description and comparison of interactive design strategies.",
            "Temporally distributed symptoms in a diagnostic application.",
            "Intelligent programs and methodological procedures for debugging of the complex machines."
        ]
    },
    {
        "name": "AEI",
        "year": "1990",
        "info": "Volume 5: 1990",
        "count": 19,
        "papers": [
            "Design shells: A formalism for prototype refinement in knowledge-based design systems.",
            "Spatial applications of neural networks in computer-aided design.",
            "Representing knowledge in two distinct descriptions: Extensional vs. intensional.",
            "AIDECS: An AI-based, distributed environmental control system for self-sustaining habitats.",
            "Modeling advanced manufacturing systems using concurrent logic programming.",
            "Editorial.",
            "Does intelligent CAD exist?",
            "A conceptual framework for knowledge-based design research at Sydney University's design computing unit.",
            "Design as intelligent behaviour: An AI in design research programme.",
            "Applications of AI in design research at Carnegie Mellon University's EDRC.",
            "Paradigms for knowledge-based systems in industrial engineering.",
            "Structures, hypergraphs, and knowledge representation in chemical engineering science. I - Problem formulation.",
            "An inspectable qualitative model builder for distribution networks - An example in power distribution systems.",
            "Descriptive simulation: Combining symbolic and numerical methods in the analysis of chemical reaction mechanisms.",
            "Event-based architecture for diagnosis in control advisory systems.",
            "Reasoning with geometry: Predicting stress concentration factors.",
            "CAQ: A machine learning tool for engineering.",
            "A framework for cooperative work: An approach based on the intentionality.",
            "A constraint programming language for Life-Cycle Engineering."
        ]
    },
    {
        "name": "AEI",
        "year": "1989",
        "info": "Volume 4: 1989",
        "count": 16,
        "papers": [
            "Causal modelling of semiconductor fabrication.",
            "Reasoning about the kinematics of mechanical devices.",
            "Knowledge-based automatic dimensioning.",
            "A predicate-logical method for modelling design objects.",
            "Interactive engineering systems design: A study for artificial intelligence applications.",
            "Integrated knowledge systems.",
            "Causal models for diagnostic reasoning.",
            "A methodology for knowledge engineering using an interactive graphical tool for knowledge modelling.",
            "Order-of-magnitude reasoning with O[M].",
            "A rule-based control method for a multi-loop production system.",
            "Task dependent tools for intelligent automation.",
            "Pattern directed extraction and characterization of defect configurations in solid log models.",
            "Intelligent gateway troubleshooter.",
            "Conflict resolution in cooperative design.",
            "Automated reuse of design plans.",
            "An inference mechanism for selection, and its application to polymers."
        ]
    },
    {
        "name": "AEI",
        "year": "1988",
        "info": "Volume 3: 1988",
        "count": 27,
        "papers": [
            "An object-based representation method for a manufacturing cell controller.",
            "Applications of deep knowledge.",
            "'Generate & test and rectify' - A plan synthesis tactic for automatic process planning.",
            "Coupling of symbolic and numerical computations on a microcomputer.",
            "Design of a knowledge based system for inventory control, an OPS5 implementation.",
            "Discussion.",
            "An overview of contract research at the Turing Institute.",
            "Editorial.",
            "A system for knowledge-based process planning.",
            "Scheduling via reinforcement.",
            "SONIA: A knowledge-based scheduling system.",
            "A model of reaction for planning in dynamic environments.",
            "Integrated planning and execution control for an autonomous mobile robot.",
            "A meta-planning model for diminishing resource problems.",
            "Issues and directions in qualitative physics: special editions from the 1987 workshop.",
            "A logical framework for commonsense predictions of solid object behaviour.",
            "HELIX: A helicopter diagnostic system based on qualitative physics.",
            "Qualitative analysis by piecewise linear approximation.",
            "Mathematical aspects of qualitative reasoning.",
            "The qualitative calculus is sound but incomplete: A reply to Peter Struss.",
            "Choices for comparative analysis: DQ analysis or exaggeration?",
            "Continued monitoring of the state of qualitative physics.",
            "Qualitative simulation using time-scale abstraction.",
            "Causes to clauses: Managing assumptions in qualitative medical diagnosis.",
            "QPE: Using assumption-based truth maintenance for qualitative simulation.",
            "Assembling a device.",
            "Intelligent engineering software research at the Tallinn Institute of Cybernetics."
        ]
    },
    {
        "name": "AEI",
        "year": "1987",
        "info": "Volume 2: 1987",
        "count": 20,
        "papers": [
            "Learning design rules from decisions and performances.",
            "A foundation for a knowledge-base computer integrated manufacturing system.",
            "GEOTOX: a knowledge-based system for hazardous site evaluation.",
            "ULYSSES - a knowledge-based VLSI design environment.",
            "Artificial Intelligence Applications Institute (AIAI).",
            "Artificial intelligence.",
            "IDABES: An expert system for the preliminary stages of conceptual design of building energy systems.",
            "An introduction to QSIM and qualitative simulation.",
            "An expert system which constrains designs.",
            "CODAR: General purpose design tool for rule-based engineering expert systems.",
            "Implementation of a knowledge base for interpreting and driving integrated circuit floorplanning algorithms.",
            "Basic research on artificial intelligence at Mitsubishi Electric.",
            "A framework for real-time fault detection and diagnosis using temporal data.",
            "Guest Editorial.",
            "Toward an engineering science of knowledge-based design.",
            "A knowledge-based system for the analysis and redesign of digital circuit networks.",
            "Bibliography - Artificial intelligence in design.",
            "ALL-RISE: A case study in constraint-based design.",
            "An object-based representation for the evolution of VLSI designs.",
            "RoadLab - A constraint based laboratory for road design."
        ]
    },
    {
        "name": "AEI",
        "year": "1986",
        "info": "Volume 1: 1986",
        "count": 16,
        "papers": [
            "Knowledge based standards processing.",
            "On a mechanical reasoning about causal relations.",
            "Dominic: A Domain-Independent Program for Mechanical Engineering Design.",
            "Implementation of a knowledge based seismic risk evaluation system on microcomputers.",
            "EDISON: An engineering design invention system operating naively.",
            "Process planning formalization in an AI framework.",
            "Machine intelligence in machine design: Workshop summary.",
            "Guest editorial.",
            "An environment for rule-based blackboards and distributed problem solving.",
            "Transactional blackboards.",
            "Application of the BB1 blackboard control architecture to arrangement-assembly tasks.",
            "Blackboard architectures in computer aided engineering.",
            "A distributed control architecture for an autonomous mobile robot.",
            "DESTINY: A model for integrated structural design.",
            "A blackboard architecture for plastics design.",
            "Artificial intelligence news letter."
        ]
    }
]