[
    {
        "year": "2021",
        "name": "28th APSEC 2021",
        "info": "Virtual Event, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2021",
                "sub_name": "28th Asia-Pacific Software Engineering Conference, APSEC 2021, Taipei, Taiwan, December 6-9, 2021.",
                "count": 71,
                "papers": [
                    "Learn To Align: A Code Alignment Network For Code Clone Detection.",
                    "TraceRefiner: An Automated Technique for Refining Coarse-Grained Requirement-to-Class Traces.",
                    "NameChecker: Detecting Inconsistency between Method Names and Method Bodies.",
                    "Thread-Sensitive Data Race Detection for Java.",
                    "Behavioral classification of Android applications using system calls.",
                    "Categorizing npm Packages by Analyzing the Text Information in Software Repositories.",
                    "Tree-based Mining of Fine-grained Code Changes to Detect Unknown Change Patterns.",
                    "PGraph: A Graph-based Structure for Interactive Event Exploration on Social Media.",
                    "Effective Bug Triage Based on a Hybrid Neural Network.",
                    "Monitoring Negative Sentiment-Related Events in Open Source Software Projects.",
                    "DeepRelease: Language-agnostic Release Notes Generation from Pull Requests of Open-source Software.",
                    "Detecting Duplicate Questions in Stack Overflow via Semantic and Relevance Approaches.",
                    "Interaction Modelling for IoT.",
                    "Design of Software Architecture for Neural Network Cooperation: Case of Forgery Detection.",
                    "PyTraceBugs: A Large Python Code Dataset for Supervised Machine Learning in Software Defect Prediction.",
                    "Data Flow Testing for PLC Programs via Dynamic Symbolic Execution.",
                    "Mining API Constraints from Library and Client to Detect API Misuses.",
                    "An Empirical Study on the Usage and Evolution of Identifier Styles in Practice.",
                    "A Research Landscape of Software Engineering Education.",
                    "CHIS: A Novel Hybrid Granularity Identifier Splitting Approach.",
                    "IconChecker: Anomaly Detection of Icon-Behaviors for Android Apps.",
                    "Fine-grained Pseudo-code Generation Method via Code Feature Extraction and Transformer.",
                    "Improving Semantic Consistency of Variable Names with Use-Flow Graph Analysis.",
                    "Bayesian propensity score matching in automotive embedded software engineering.",
                    "Towards Continuous Data Collection from In-service Products: Exploring the Relation Between Data Dimensions and Collection Challenges.",
                    "Program Verification Enhanced Precise Analysis of Interrupt-Driven Program Vulnerabilities.",
                    "Verification Assisted Gas Reduction for Smart Contracts.",
                    "Critical Understanding of Security Vulnerability Detection Plugin Evaluation Reports.",
                    "Pandemic Software Development: The Student Experiences from Developing a COVID-19 Information Dashboard.",
                    "Concepts and Models of Environment of Self-Adaptive Systems: A Systematic Literature Review.",
                    "Automated Construction of Continuous Delivery Pipelines from Architecture Models.",
                    "Automatic Performance Testing for Image Displaying in Android Apps.",
                    "Ranking Warnings of Static Analysis Tools Using Representation Learning.",
                    "A Multi-factor Approach for Flaky Test Detection and Automated Root Cause Analysis.",
                    "Empirical Evaluation of Minority Oversampling Techniques in the Context of Android Malware Detection.",
                    "How Do Programmers Express High-Level Concepts using Primitive Data Types?",
                    "S2 LMMD: Cross-Project Software Defect Prediction via Statement Semantic Learning and Maximum Mean Discrepancy.",
                    "A Novel Architectural Design for Solving Lost-Link Problems in UAV Collaboration.",
                    "Metamorphic Testing for Reliability in System of Systems.",
                    "Understanding Metrics Team-Stakeholder Communication in Agile Metrics Service Delivery.",
                    "Degree doesn't Matter: Identifying the Drivers of Interaction in Software Development Ecosystems.",
                    "Comparing Automated Reuse of Scripted Tests and Model-Based Tests for Configurable Software.",
                    "Context-Aware Regression Test Selection.",
                    "Exposing Vulnerable Paths: Enhance Static Analysis with Lightweight Symbolic Execution.",
                    "NeoMycelia: A software reference architecturefor big data systems.",
                    "On the Impact of ML use cases on Industrial Data Pipelines.",
                    "Scalable Fault Detection Based on Precise Access Path.",
                    "Survey on Pains and Best Practices of Code Review.",
                    "API parameter recommendation based on language model and program analysis.",
                    "Finding repeated strings in code repositories and its applications to code-clone detection.",
                    "Probabilistic testing of asynchronously communicating systems.",
                    "PNPEq: Verification of Scheduled Conditional Behavior in Embedded Software using Petri Nets.",
                    "Applying Multi-Objective Genetic Algorithm for Efficient Selection on Program Generation.",
                    "The Role of User Reviews in App Updates: A Preliminary Investigation on App Release Notes.",
                    "Detecting Functional Differences using Automatic Test Generation for Automated Assessment in Programming Education.",
                    "Does Domain Change the Opinion of Individuals on Human Values? A Preliminary Investigation on eHealth Apps End-users.",
                    "Runtime models and evolution graphs for the version management of microservice architectures.",
                    "Framework for Recommending Data Residency Compliant Application Architecture.",
                    "AWaRE2-MM: A Meta-Model for Goal-Driven, Contract-Mediated, Team-Centric Autonomous Middleware Frameworks for Antifragility.",
                    "Towards Accurate File Tracking Based on AST Differences.",
                    "Literature Review on Log Anomaly Detection Approaches Utilizing Online Parsing Methodology.",
                    "Smart Contract Vulnerability Detection Using Code Representation Fusion.",
                    "Applying Problem Frames in Behavior-Driven Development for Smart Cone System.",
                    "Towards a Dynamic Visualization of Complex Reverse-Engineered Object Collaboration.",
                    "Extracting a Micro State Transition Table Using the KLEE Symbolic Execution Engine.",
                    "Topic Trends in Issue Tracking System of Extended Reality Frameworks.",
                    "An Exploration Study On the Dependency Among Vulnerabilities and Bugs.",
                    "A Learning-to-Rank Based Approach for Improving Regression Test Case Prioritization.",
                    "Automated Fault Tree generation in Open-PSA from UML Models.",
                    "Static Analysis of Resource Usage Bounds for Imperative Programs.",
                    "Automated Feedback Generation for Multiple Function Programs."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2021w",
                "sub_name": "28th Asia-Pacific Software Engineering Conference Workshops, APSEC Workshops 2021, Taipei, Taiwan, December 6-9, 2021.",
                "count": 11,
                "papers": [
                    "FAILS: a tool for assessing risk in ML systems.",
                    "Landscape of Requirements Engineering for Machine Learning-based AI Systems.",
                    "How Data Plays in the Requirements of Face Recognition System: A Concern Driven Systematic Literature Review.",
                    "Goal-Centralized Metamodel Based Requirements Integration for Machine Learning Systems.",
                    "Reference Model for Agile Development of Machine Learning-based Service Systems.",
                    "Qunomon: A FAIR testbed of quality evaluation for machine learning models.",
                    "Generation of Oracles using Natural Language Processing.",
                    "An Imbalanced Deep Learning Model for Bug Localization.",
                    "Discovering Authorship of Vulnerabilities in Open Source Software.",
                    "Detecting Permission Crashes of Android Apps using Crawling and Revoke Operation Injections.",
                    "Constructing Speech Emotion Recognition Model Based on Convolutional Neural Network."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2021quasoq",
                "sub_name": "Joint Proceedings of SEED 2021 & QuASoQ 2021 co-located with 28th Asia Pacific Software Engineering Conference 2021, Taipei [Virtual], December 6, 2021.",
                "count": 10,
                "papers": [
                    "Introducing Software System Course to Engineering Undergraduate Students - An Experience Report.",
                    "Mining and Detecting Bugs in Introductory Programs.",
                    "Teaching Software Engineering Virtually during COVID-19 Pandemic Era: Lessons Learned.",
                    "The Perceived Effects of Introducing Coaching on the Development of Student's Soft Skills Managing Software Quality.",
                    "Applying Software Engineering to Teach Online Project-Based Software Engineering Courses.",
                    "Report on the the 9th International Workshop on Quantitative Approaches to Software Quality.",
                    "The Impacts of Requirements Relationships Knowledge on Requirements Quality and Software Development Project Success.",
                    "Predicting Requirements Volatility: An Industry Case Study.",
                    "Towards a Catalog of Refactoring Solutions for Enterprise Architecture Smells.",
                    "A Condition Coverage-Based Black Hole Inspired Meta-Heuristic for Test Data Generation."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2021resosy",
                "sub_name": "First International Interdisciplinary Workshop on Requirements Engineering for Sociotechnical Systems (RESOSY) co-located 28th Asia Pacific Software Engineering Conference (APSEC 2021), Virtual event, Taipei, Taiwan, 12 8-9, 2021.",
                "count": 8,
                "papers": [
                    "Continuous Requirements Engineering in Sociotechnical Systems: Challenges and Solutions.",
                    "Requirements engineering for sociotechnical systems that may include mixed initiative interactions between humans and machines.",
                    "Towards an approach for designing socio-technical business processes.",
                    "Emotion-oriented AOM: A case study.",
                    "An ideal physical activity app for adults - what should it be like? Requirements of adult users.",
                    "Requirements elicitation and repeatable processes - interdisciplinary collaboration between software engineering and design.",
                    "Requirements engineering for sociotechnical systems: Case study of an Airline Operations Control Center.",
                    "Transitioning from motivational goal models to user stories within user-centred software design."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "27th APSEC 2020",
        "info": "Virtual Event, Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2020",
                "sub_name": "27th Asia-Pacific Software Engineering Conference, APSEC 2020, Singapore, December 1-4, 2020.",
                "count": 63,
                "papers": [
                    "SAT-Based Automata Construction for LTL over Finite Traces.",
                    "Fault Diagnosis of Simplified Fault Trees using State Transition Diagrams.",
                    "Lemma Weakening for State Machine Invariant Proofs.",
                    "Examining the Relationship of Code and Architectural Smells with Software Vulnerabilities.",
                    "An Empirical Study of Code Deobfuscations on Detecting Obfuscated Android Piggybacked Apps.",
                    "A Generalized Notion of Non-interference for Flow Security of Sequential and Concurrent Programs.",
                    "DependLoc: A Dependency-based Framework For Bug Localization.",
                    "Understanding the Non-Repairability Factors of Automated Program Repair Techniques.",
                    "Software Defect Prediction and Localization with Attention-Based Models and Ensemble Learning.",
                    "Clusters of Faulty States for Debugging Behavioural Models.",
                    "Software Engineering for Autonomous Robot: Challenges, Progresses and Opportunities.",
                    "Synthesizing Cooperative Controllers from Global Tasks of Multi-robot Systems.",
                    "Testing Microservices Architecture-Based Applications: A Systematic Mapping Study.",
                    "UML-based Modeling and Analysis of 5G Service Orchestration.",
                    "An Integrated Framework for the Formal Analysis of Critical Interactive Systems.",
                    "Formal Verification of Memory Isolation for the TrustZone-based TEE.",
                    "A Coloured Petri Nets Based Attack Tolerance Framework.",
                    "Model Checking of Spatial Logic.",
                    "An Asset-Based Assistance for Secure by Design.",
                    "A Knowledge Graph-based Sensitive Feature Selection for Android Malware Classification.",
                    "Modeling and Verifying Data Access Mechanism of NLSR Trust Model.",
                    "An Empirical Study on Developing Secure Mobile Health Apps: The Developers' Perspective.",
                    "A Benchmark Study of the Contemporary Toxicity Detectors on Software Engineering Interactions.",
                    "Technical Lag of Dependencies in Major Package Managers.",
                    "Sia-RAE: A Siamese Network based on Recursive AutoEncoder for Effective Clone Detection.",
                    "Dockerfile Changes in Practice: A Large-Scale Empirical Study of 4, 110 Projects on GitHub.",
                    "Floating Point Accuracy Testing in Deep Neural Network Computations via Hypothesis Testing.",
                    "An Empirical Study on Robustness of DNNs with Out-of-Distribution Awareness.",
                    "Improving Machine Learning-Based Code Smell Detection via Hyper-Parameter Optimization.",
                    "Structural Similarity of Boundary Conditions and an Efficient Local Search Algorithm for Goal Conflict Identification.",
                    "An education model for project-based learning using ability map in various target products.",
                    "Understanding Build Errors in Agile Software Development Project-Based Learning.",
                    "Process Debt: a First Exploration.",
                    "Pattern-based Analysis of Interaction Failures in Systems-of-Systems: a Case Study on Platooning.",
                    "A Modeling Method for Model-based Analysis and Design of a System-of-Systems.",
                    "Towards Automated Detection of Data Pipeline Faults.",
                    "A divide & conquer approach to testing concurrent programs with JPF*.",
                    "SmartFuzz: An Automated Smart Fuzzing Approach for Testing SmartThings Apps.",
                    "Don't Trust Me, Test Me: 100% Code Coverage for a 3rd-party Android App.",
                    "Federated Learning Systems: Architecture Alternatives.",
                    "AI Deployment Architecture: Multi-Case Study for Key Factor Identification.",
                    "Principles for Re-architecting Software for Heterogeneous Platforms.",
                    "Multiform Logical Time & Space for Mobile Cyber-Physical System With Automated Driving Assistance System.",
                    "An Empirical Study on the Influence of Social Interactions for the Acceptance of Answers in Stack Overflow.",
                    "Mining Customer Satisfaction on B2B Online Platforms using Service Quality and Web Usage Metrics.",
                    "How Weak Reference is Used in Java Projects?",
                    "Automatically Identifying Requirements-Oriented Reviews Using a Top-Down Feature Extraction Approach.",
                    "CLIONE: Clone Modification Support for Pull Request Based Development.",
                    "Identification of Misleading Location Information in Compiler Diagnoses.",
                    "A Formal Model for Behavior Trees Based on Context - Free Grammar.",
                    "A Preliminary Study on Sensitive Information Exposure Through Logging.",
                    "A Mahalanobis Distance-Based Integration of Suspicious Scores For Bug Localization.",
                    "Asynchronous test equivalence for probabilistic processes.",
                    "Model Driven Inputs to aid Athlete's Decision Making.",
                    "An Attentive Deep Supervision based Semantic Matching Framework For Tag Recommendation in Software Information Sites.",
                    "Ori: A Greybox Fuzzer for SOME/IP Protocols in Automotive Ethernet.",
                    "Automated Assessment and Evaluation of Contribution of Collaborative Software Engineering Development Process.",
                    "Requirements Risk Estimation Using TOPSIS Method.",
                    "A Program Simplification Method for Generating Test Input Values Using Symbolic Execution.",
                    "Towards tracking the development process of the server ecosystems using open-source data.",
                    "Feature Combination to Alleviate Hubness Problem of Source Code Representation for Bug Localization.",
                    "Source Code Obfuscation for Smart Contracts.",
                    "A Context Based Approach for Recommending Move Class Refactoring."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2020quasoq",
                "sub_name": "Proceedings of the 8th International Workshop on Quantitative Approaches to Software Quality co-located with 27th Asia-Pacific Software Engineering Conference (APSEC 2020), Singapore (virtual), December 1, 2020.",
                "count": 11,
                "papers": [
                    "Report on the the 8th International Workshop on Quantitative Approaches to Software Quality.",
                    "Augmenting Window Contents with Transfer Learning for Effort Estimation.",
                    "On the Evolutionary Properties of Fix Inducing Changes.",
                    "Using Rule Mining for Automatic Test Oracle Generation.",
                    "An Industrial Case Study on Fault Detection Effectiveness of Combinatorial Robustness Testing.",
                    "An Evaluation of Machine Learning Methods for Predicting Flaky Tests.",
                    "Towards the Identification of Process Anti-Patterns in Enterprise Architecture Models.",
                    "Evaluating the Impact of Inter Process Communication in Microservice Architectures.",
                    "Understanding the Involvement of Developers in Missing Link Community Smell: An exploratory Study on Apache Projects.",
                    "Detection and Correction of Android-specific Code Smells and Energy Bugs: An Android Lint Extension.",
                    "Comparison of Code Smells in iOS and Android Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2020iwesq",
                "sub_name": "Proceedings of the 2nd International Workshop on Experience with SQuaRE Series and Its Future Direction (IWESQ 2020) co-located with 27th Asia-Pacific Software Engineering Conference (APSEC 2020), Singapore, Dec 1, 2020.",
                "count": 10,
                "papers": [
                    "Quality Characteristics of Artificially Intelligent Systems.",
                    "Establishing International Standards for Systems and Software Quality Requirements and Evaluation.",
                    "Coverage Analysis Method Using Quality Characteristics.",
                    "Quality Evaluation and Testing Method of Industrial Application Based on ISO/IEC 25000 SQuaRE Standard.",
                    "ISO/IEC 25000 Quality Measures for A.I.: A Geometrical Approach (short paper).",
                    "Possible extension of ISO/IEC 25000 Quality Models to Artificial Intelligence in the Context of an International Governance (short paper).",
                    "Quality in Use -Issues and Proposal- (short paper).",
                    "Retrofitting Quality (short paper).",
                    "About the Framework of Quality Evaluation Using SQuaRE.",
                    "Analysis for Blockchain Application Quality."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2020seed",
                "sub_name": "Joint Proceedings of SEED & NLPaSE co-located with 27th Asia Pacific Software Engineering Conference 2020, Singapore [Virtual], December 1, 2020.",
                "count": 8,
                "papers": [
                    "A lightweight collaborative approach for teaching software project labs with industry partners.",
                    "A G-READY model to support subject design for Software Engineering.",
                    "Conducting a Fully Online Education of a Software Engineering Course with a Web Application Development Component due to the COVID-19 Pandemic and its Evaluation.",
                    "Programming Project in an Undergraduate Software Engineering in the New Normal: Challenges and Proposed Solutions.",
                    "A Report on the First Workshop on Natural Language Processing Advancements for Software Engineering (NLPaSE) co-located with APSEC 2020 (short paper).",
                    "Reducing Regression Test Suites using the Word2Vec Natural Language Processing Tool.",
                    "Recording Software Design Decisions on the Fly.",
                    "Humpback: Code Completion System for Dockerfile Based on Language Models (short paper)."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "26th APSEC 2019",
        "info": "Putrajaya, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2019",
                "sub_name": "26th Asia-Pacific Software Engineering Conference, APSEC 2019, Putrajaya, Malaysia, December 2-5, 2019.",
                "count": 65,
                "papers": [
                    "BLINKER: A Blockchain-Enabled Framework for Software Provenance.",
                    "SoReady: An Extension of the Test and Defect Coverage-Based Analytics Model for Pull-Based Software Development.",
                    "A Domain Experts Centric Approach to Formal Requirements Modeling and V&V of Embedded Control Software.",
                    "Enhancing Unsupervised Requirements Traceability with Sequential Semantics.",
                    "MBRP: Model-Based Requirements Prioritization Using PageRank Algorithm.",
                    "Exploring Semantics of Software Artifacts to Improve Requirements Traceability Recovery: A Hybrid Approach.",
                    "Towards the Mechanized Semantics and Refinement of UML Class Diagrams.",
                    "Formalizing Architectural Rules with Ontologies - An Industrial Evaluation.",
                    "Adaptive Random Testing for XSS Vulnerability.",
                    "Multiple Program Analysis Techniques Enable Precise Check for SEI CERT C Coding Standard.",
                    "VISION: Evaluating Scenario Suitableness for DNN Models by Mirror Synthesis.",
                    "Integrating Static Program Analysis Tools for Verifying Cautions of Microcontroller.",
                    "A Mutation-Based Approach for Assessing Weight Coverage of a Path Planner.",
                    "Verification of CTL_BDI Properties by Symbolic Model Checking.",
                    "Semi-Automatic Repair of Over-Constrained Models for Combinatorial Robustness Testing.",
                    "A Prioritization Method for SPL Pairwise Testing Based on User Profiles.",
                    "History Coupling Space: A New Model to Represent Evolutionary Relations.",
                    "Mercem: Method Name Recommendation Based on Call Graph Embedding.",
                    "Quality Assessment for Large-Scale Industrial Software Systems: Experience Report at Alibaba.",
                    "Multi-Objective Configuration Sampling for Performance Ranking in Configurable Systems.",
                    "A Cloud-Based Solution for Testing Applications' Compatibility and Portability on Fragmented Android Platform.",
                    "Version-Based Microservice Analysis, Monitoring, and Visualization.",
                    "Generating Mock Skeletons for Lightweight Web-Service Testing.",
                    "An Algebraic Approach to Modeling and Verifying Policy-Driven Smart Devices in IoT Systems.",
                    "Automatic Identifying Interaction Components in Collaborative Cyber-Physical Systems.",
                    "Dam: A Practical Scheme to Mitigate Data-Oriented Attacks with Tagged Memory Based on Hardware.",
                    "Statistical Verification Framework for Platooning System of Systems with Uncertainty.",
                    "SHML: Stochastic Hybrid Modeling Language for CPS Behavior.",
                    "A Framework for Internet of Things Search Engines Engineering.",
                    "Inferring Faults in Business Specifications Extracted from Source Code.",
                    "Deep Semantic Feature Learning with Embedded Static Metrics for Software Defect Prediction.",
                    "DeepTLE: Learning Code-Level Features to Predict Code Performance before It Runs.",
                    "Achieving Abstract Machine Reachability with Learning-Based Model Fulfilment.",
                    "Necessity and Capability of Flow, Context, Field and Quasi Path Sensitive Points-to Analysis.",
                    "Class Imbalance Data-Generation for Software Defect Prediction.",
                    "How Compact Will My System Be? A Fully-Automated Way to Calculate LoC Reduced by Clone Refactoring.",
                    "Understanding Source Code Variability in Cloned Android Families: An Empirical Study on 75 Families.",
                    "Towards Non-Invasive Recognition of Developers' Flow States with Computer Interaction Traces.",
                    "Teaching Software Process Models to Software Engineering Students: An Exploratory Study.",
                    "Automatic Classifying Self-Admitted Technical Debt Using N-Gram IDF.",
                    "Decisions and Their Making in OSS Development: An Exploratory Study Using the Hibernate Developer Mailing List.",
                    "Towards a Formal Approach to Defining and Computing the Complexity of Component Based Software.",
                    "RBML: A Refined Behavior Modeling Language for Safety-Critical Hybrid Systems.",
                    "A Coloured Petri Net Approach to Model and Analyze Safety-Critical Interactive Systems.",
                    "Formal Modelling and Verification of Spinlocks at Instruction Level.",
                    "Using Bayesian Networks for a Cyberattacks Propagation Analysis in Systems-of-Systems.",
                    "Model-Driven Engineering for Delta-Oriented Software Product Lines.",
                    "CLASC: A Changelog Based Automatic Code Source Classification Method for Operating System Packages.",
                    "Automatic Identification of Assumptions from the Hibernate Developer Mailing List.",
                    "Influence, Information and Team Outcomes in Large Scale Software Development.",
                    "More Secure Collaborative APIs Resistant to Flush+Reload and Flush+Flush Attacks on ARMv8-A.",
                    "SGXPy: Protecting Integrity of Python Applications with Intel SGX.",
                    "A Language-Based Multi-View Approach for Combining Functional and Security Models.",
                    "Witness: Detecting Vulnerabilities in Android Apps Extensively and Verifiably.",
                    "Run-Time Safety Monitoring Framework for AI-Based Systems: Automated Driving Cases.",
                    "Anatomizing Android Malwares.",
                    "Reinforcement Learning of Code Search Sessions.",
                    "SIF: A Framework for Solidity Contract Instrumentation and Analysis.",
                    "Jact: A Playground Tool for Comparison of JavaScript Frameworks.",
                    "SolAnalyser: A Framework for Analysing and Testing Smart Contracts.",
                    "Investigating Cross-Repository Socially Connected Teams on GitHub.",
                    "Class Name Recommendation Based on Graph Embedding of Program Elements.",
                    "Detecting Duplicate Questions in Stack Overflow via Deep Learning Approaches.",
                    "Understanding the Effect of Developer Sentiment on Fix-Inducing Changes: An Exploratory Study on GitHub Pull Requests.",
                    "Neural Comment Generation for Source Code with Auxiliary Code Classification Task."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2019quasoq",
                "sub_name": "Proceedings of the 7th International Workshop on Quantitative Approaches to Software Quality co-located with 26th Asia-Pacific Software Engineering Conference (APSEC 2019), Putrajaya, Malaysia, December 2, 2019.",
                "count": 7,
                "papers": [
                    "Preface of the the 7th International Workshop on Quantitative Approaches to Software Quality.",
                    "Empirical Study of Fault Introduction Focusing on the Similarity among Local Variable Names.",
                    "An Empirical Study on Progressive Sampling for Just-in-Time Software Defect Prediction.",
                    "A Code Clone Curation - Towards Scalable and Incremental Clone Detection -.",
                    "An Experiment to Compare Combinatorial Testing in the Presence of Invalid Values.",
                    "Studying Multifaceted Collaboration of OSS Developers and its Impact on their Bug Fixing Performance.",
                    "Prioritization of EA Debts Facilitating Portfolio Theory."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2019iwesq",
                "sub_name": "Proceedings of the 1st International Workshop on Experience with SQuaRE Series and Its Future Direction co-located with 26th Asia-Pacific Software Engineering Conference, IWESQ@APSEC 2019, Putrajaya, Malaysia, Dec 2, 2019.",
                "count": 8,
                "papers": [
                    "Study Group Report on SQuaRE Future Direction (invited paper).",
                    "Revisiting the Quality in Use Model (short paper).",
                    "Examples of Practical Use of ISO/IEC 25000 (short paper).",
                    "Quality Consideration for e-Learning System Based on ISO/IEC 25000 Quality Standard.",
                    "Usability in Software Development Process -Proposal of Society/Stakeholder Centered Design (SCD)- (short paper).",
                    "Test Management Based on Quality Characteristics (short paper).",
                    "Research on Quality Model of Industrial Application Software (short paper).",
                    "Hidden-use Case for Eliciting Quality in Use (short paper)."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2019seed",
                "sub_name": "Proceedings of the 2nd Software Engineering Education Workshop 2019 co-located with 26th Asia Pacific Software Engineering Conference, SEED@APSEC 2019, Putrajaya, Malaysia, December 2, 2019.",
                "count": 6,
                "papers": [
                    "Understanding the Decision-Making of Students in Requirements Engineering Course Projects.",
                    "Toward Industry Oriented Software Engineering Project Course: A Pilot Study.",
                    "Teaching Object-Oriented Modeling as a Part of Programming Courses.",
                    "Collaborative Learning Strategies in Software Engineering Course.",
                    "Literature Reviews on Applying Artificial Intelligence/Machine Learning to Software Engineering Research Problems: Preliminary.",
                    "Report on the 2nd Software Engineering Education Workshop (SEED 2019) co-located with APSEC 2019."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "25th APSEC 2018",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2018",
                "sub_name": "25th Asia-Pacific Software Engineering Conference, APSEC 2018, Nara, Japan, December 4-7, 2018.",
                "count": 95,
                "papers": [
                    "The OIRE Method - Overview and Initial Validation.",
                    "A Bird's Eye View on Requirements Engineering and Machine Learning.",
                    "Tool Support for Restricted Use Case Specification: Findings from a Controlled Experiment.",
                    "Actual Use of Architectural Patterns in Microservices-Based Open Source Projects.",
                    "Development of a User-Interactive Agent Simulation System with the Blackboard Architectural Pattern.",
                    "Architecture Patterns, Quality Attributes, and Design Contexts: How Developers Design with Them.",
                    "Automatically Generating API Usage Patterns from Natural Language Queries.",
                    "A JavaScript Transpiler for Escaping from Complicated Usage of Cloud Services and APIs.",
                    "SLAMPA: Recommending Code Snippets with Statistical Language Model.",
                    "Formal Specification and Model Checking of the Walter-Welch-Vaidya Mutual Exclusion Protocol for Ad Hoc Mobile Networks.",
                    "Specification and Verification of Invariant Properties of Transition Systems.",
                    "Accelerated Finite State Machine Test Execution Using GPUs.",
                    "A Thread Modularity Approach for Verification Concurrent Software Based on Abstract Interpretation.",
                    "Scalable Verification Framework for C Program.",
                    "End-to-End Automated Verification for OS Kernels.",
                    "Visualizing Test Diversity to Support Test Optimisation.",
                    "A Dynamic Fitness Function Based on Branch Hardness for Search Based Software Testing.",
                    "Finding a Boundary between Valid and Invalid Regions of the Input Space.",
                    "On the Use of Automated Log Clustering to Support Effort Reduction in Continuous Engineering.",
                    "NotOnlyLog: Mining Patch-Log Associations from Software Evolution History to Enhance Failure Diagnosis Capability.",
                    "Power-Aware Allocation of Fault-Tolerant Multirate AUTOSAR Applications.",
                    "A Review on Software Architectures for Heterogeneous Platforms.",
                    "Running OS Kernel in Separate Domains: A New Architecture for Applications and OS Services Quarantine.",
                    "PyReload: Dynamic Updating of Python Programs by Reloading.",
                    "Relax: Automatic Contention Detection and Resolution for Configuration Related Performance Tuning.",
                    "A Multi-Goal Oriented Approach for Adaptation Rules Generation.",
                    "An Empirical Study of SDK Credential Misuse in iOS Apps.",
                    "Accelerating Automated Android GUI Exploration with Widgets Grouping.",
                    "ELEGANT: Towards Effective Location of Fragmentation-Induced Compatibility Issues for Android Apps.",
                    "BCFinder: A Lightweight and Platform-Independent Tool to Find Third-Party Components in Binaries.",
                    "Scalable and Extensible Static Memory Safety Analysis with Summary over Access Path.",
                    "Codifying Hidden Dependencies in Legacy J2EE Applications.",
                    "Are Smell-Based Metrics Actually Useful in Effort-Aware Structural Change-Proneness Prediction? An Empirical Study.",
                    "Analyzing Code Comments to Boost Program Comprehension.",
                    "A Top-k Learning to Rank Approach to Cross-Project Software Defect Prediction.",
                    "Categorizing and Predicting Invalid Vulnerabilities on Common Vulnerabilities and Exposures.",
                    "A Comparison of Nano-Patterns vs. Software Metrics in Vulnerability Prediction.",
                    "Malicious JavaScript Code Detection Based on Hybrid Analysis.",
                    "Predicting Which Pull Requests Will Get Reopened in GitHub.",
                    "How Are Issue Units Linked? Empirical Study on the Linking Behavior in GitHub.",
                    "Why Did This Reviewed Code Crash? An Empirical Study of Mozilla Firefox.",
                    "Multi-Discussing across Issues in GitHub: A Preliminary Study.",
                    "Detecting Duplicate Bug Reports with Convolutional Neural Networks.",
                    "STAR: A Specialized Tagging Approach for Docker Repositories.",
                    "Understanding the Reputation Differences between Women and Men on Stack Overflow.",
                    "SOQDE: A Supervised Learning Based Question Difficulty Estimation Model for Stack Overflow.",
                    "Assumptions in OSS Development: An Exploratory Study through the Hibernate Developer Mailing List.",
                    "Improving Development Practices through Experimentation: An Industrial TDD Case.",
                    "What Do Agile Teams Find Important for Their Success?",
                    "Multi-Objective Iteration Planning in Agile Development.",
                    "What Aspects Do Non-Functional Requirements in App User Reviews Describe? An Exploratory and Comparative Study.",
                    "Kurtosis and Skewness Adjustment for Software Effort Estimation.",
                    "Adopting MBSE in Construction Equipment Industry: An Experience Report.",
                    "Migration to Software Product Line Development of Automotive Body Parts by Architectural Refinement with Feature Analysis.",
                    "Model-Based Personalized Visualization System for Monitoring Evolving Industrial Cyber-Physical System.",
                    "A Design Method for Domain-Specific Models of Software Requirements Specification Based on Stakeholders' Concerns.",
                    "MatGap: A Systematic Approach to Perform Match and Gap Analysis among SBVR-Based Domain Specific Business Rules.",
                    "Team Composition and Team Factors in Software Engineering: An Interview Study of Project-Based Organizations.",
                    "Extracting Candidates of Microservices from Monolithic Application Code.",
                    "Providing Technical Software Documentation as a Service - An Industrial Experience Report.",
                    "Transitioning from Manual to Automated Software Regression Testing: Experience from the Banking Domain.",
                    "A Quality Model and Its Quantitative Evaluation Method for Web APIs.",
                    "Software and Infrastructure Log-Based Framework for Identifying the Causes of System Faults.",
                    "unjQuerify: Migration of jQuery Snippets to Modern Vanilla JavaScript APIs.",
                    "An Automatic Approach to Validating Log Levels in Java.",
                    "DeepGraph: A PyCharm Tool for Visualizing and Understanding Deep Learning Models.",
                    "lpt: A Tool for Tuning the Level of Parallelism of Spark Applications.",
                    "Applying Gamification and Posing to Software Development.",
                    "A Doc2Vec-Based Assessment of Comments and Its Application to Change-Prone Method Analysis.",
                    "Program Analysis and Graph Pattern Matching to Reveal Modularity and Potential for Parallelism.",
                    "An Investigation of the Relationship between Extract Method and Change Metrics: A Case Study of JEdit.",
                    "LSRepair: Live Search of Fix Ingredients for Automated Program Repair.",
                    "Automated Code-Based Test Selection for Software Product Line Regression Testing.",
                    "ICAT: An IoT Device Compatibility Testing Tool.",
                    "Multilingual Detection of Code Clones Using ANTLR Grammar Definitions.",
                    "Verification of CPS Based on Control Loop Using Model Checking.",
                    "xSHS: An Executable Domain-Specific Modeling Language for Modeling Stochastic and Hybrid Behaviors of Cyber-Physical Systems.",
                    "Large-Scale Evaluation of the Efficiency of Runtime-Verification Tools in the Wild.",
                    "Hybrid Testing Environment of Execution Testing and Model Checking for Product Line Approach.",
                    "A Visualization System of the Contribution of Learners in Software Development PBL Using GitHub.",
                    "kGenProg: A High-Performance, High-Extensibility and High-Portability APR System.",
                    "Investigating Vector-Based Detection of Code Clones Using BigCloneBench.",
                    "Automatic Extraction of Reorganization Impact Focusing on Derivation Relationship of Analogous Actor Terms in Requirements Specification.",
                    "Improving Bug Localization with Character-Level Convolutional Neural Network and Recurrent Neural Network.",
                    "Automated Repair of Data Faults in Templated Spreadsheets.",
                    "Fuse: An Architecture for Smart Contract Fuzz Testing Service.",
                    "Text-Based Testing Environment for Voice-Based Services.",
                    "Automatic Generation of Pseudocode with Attention Seq2seq Model.",
                    "Minimising Changes When Refactoring Applications to Run Multiple Threads.",
                    "An Empirical Study on the Reliability of the Web API Document.",
                    "A Preprocessing Method of Test Input Generation by Symbolic Execution for Enterprise Application.",
                    "Importance Measurement for the Integration of Construction CALS Systems in South Korea.",
                    "Reducing Redundant Checking for Visual Regression Testing.",
                    "An Exploratory Study to Identify Similar Patches: A Case Study in Modern Code Review.",
                    "Recommending Similar Bug Reports: A Novel Approach Using Document Embedding Model."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2018quasoq",
                "sub_name": "Proceedings of the 6th International Workshop on Quantitative Approaches to Software Quality co-located with 25th Asia-Pacific Software Engineering Conference (APSEC 2018), Nara, Japan, December 4, 2018.",
                "count": 8,
                "papers": [
                    "Cross-Sub-Project Just-in-Time Defect Prediction on Multi-Repo Projects.",
                    "Boost Symbolic Execution Using Dynamic State Merging and Forking.",
                    "A Case Study on Robustness Fault Characteristics for Combinatorial Testing - Results and Challenges.",
                    "What Do We Know about Software Security Evaluation? A Preliminary Study.",
                    "Generation of Mimic Software Project Data Sets for Software Engineering Research.",
                    "Implementing Value Stream Mapping in a Scrum-based project - An Experience Report.",
                    "Prioritization in Automotive Software Testing: Systematic Literature Review.",
                    "Use-Relationship Based Classification for Software Components."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2018wespr",
                "sub_name": "Proceedings of the International Workshop on Evidence-based Security and Privacy in the Wild and the 1st International Workshop on Machine Learning Systems Engineering co-located with 25th Asia-Pacific Software Engineering Conference (APSEC 2018), Nara, Japan, December 4, 2018.",
                "count": 9,
                "papers": [
                    "Report of WESPr-18: the International Workshop on Evidence-based Security and Privacy in the Wild.",
                    "Report of iMLSE-18: the 1st International Workshop on Machine Learning Systems Engineering.",
                    "An Assurance Case Approach for Software Code Security.",
                    "An Assurance Case Approach for Software Code Security.",
                    "Restructuring Attack Trees to Identify Incorrect or Missing Relationships between Nodes.",
                    "Using a variety of patterns in a secure software development methodology.",
                    "Towards Testing of Deep Learning Systems.",
                    "Simplified Influence Evaluation of Additional Training on Deep Neural Networks.",
                    "Guaranteeing Deep Neural Network Outputs in a Feasible Region (short paper)."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "24th APSEC 2017",
        "info": "Nanjing, Jiangsu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2017",
                "sub_name": "24th Asia-Pacific Software Engineering Conference, APSEC 2017, Nanjing, China, December 4-8, 2017.",
                "count": 93,
                "papers": [
                    "Symbolic Execution with Value-Range Analysis for Floating-Point Exception Detection.",
                    "Efficient Global Search for Inputs Triggering High Floating-Point Inaccuracies.",
                    "A Framework for Array Invariants Synthesis in Induction-Loop Programs.",
                    "Cultural Factors Influencing International Collaborative Software Engineering Education in China.",
                    "Text-Mining Techniques and Tools for Systematic Literature Reviews: A Systematic Literature Review.",
                    "A Mapping Study on Mining Software Process.",
                    "Extracting Traceability between Predicates in Event-B Refinement.",
                    "How PHP Releases Are Adopted in the Wild?",
                    "An Improved Approach to Traceability Recovery Based on Word Embeddings.",
                    "Application of LSSVM and SMOTE on Seven Open Source Projects for Predicting Refactoring at Class Level.",
                    "CCSharp: An Efficient Three-Phase Code Clone Detector Using Modified PDGs.",
                    "Detecting Full Initialization Points of Objects to Support Code Refactorings.",
                    "A Cloud-Based Trust Evaluation Scheme Using a Vehicular Social Network Environment.",
                    "Noff: A Novel Extendible Parallel Library for High-Performance Network Traffic Monitoring.",
                    "A Reusable Framework for Modeling and Verifying In-Vehicle Networking Systems in the Presence of CAN and FlexRay.",
                    "Using Branch Frequency Spectra to Evaluate Operational Coverage.",
                    "Cost-Effective Regression Testing Using Bloom Filters in Continuous Integration Development Environments.",
                    "A Regression Test Case Prioritization Algorithm Based on Program Changes and Method Invocation Relationship.",
                    "A Degree-Driven Approach to Design Pattern Mining Based on Graph Matching.",
                    "Correlation between the Frequent Use of Gang-of-Four Design Patterns and Structural Complexity.",
                    "Method Level Text Summarization for Java Code Using Nano-Patterns.",
                    "The Accompanying Behavior Model and Implementation Architecture of Autonomous Robot Software.",
                    "Flexible Components for Development of Embedded Systems with GPUs.",
                    "A Dual-Loop Control Model and Software Framework for Autonomous Robot Software.",
                    "Exniffer: Learning to Prioritize Crashes by Assessing the Exploitability from Memory Dump.",
                    "Modeling and Verifying Identity Authentication Security of HDFS Using CSP.",
                    "Transfer Learning for Cross-Platform Software Crowdsourcing Recommendation.",
                    "Value-Based Decision-Making Using a Web-Based Tool: A Multiple Case Study.",
                    "A Goal-Driven Framework in Support of Knowledge Management.",
                    "Extracting Insights from the Topology of the JavaScript Package Ecosystem.",
                    "Boundary Spanners in Open Source Software Development: A Study of Python Email Archives.",
                    "An Empirical Study on Downstream Workarounds for Cross-Project Bugs.",
                    "Exploring Metadata in Bug Reports for Bug Localization.",
                    "Improving Bug Localization with an Enhanced Convolutional Neural Network.",
                    "An Empirical Study on Real Bugs for Machine Learning Programs.",
                    "Analysis of the Textual Content of Mined Open Source Usability Defect Reports.",
                    "Mining API Type Specifications for JavaScript.",
                    "Mining Handover Process in Open Source Development: An Exploratory Study.",
                    "Identifying Security Requirements Based on Linguistic Analysis and Machine Learning.",
                    "Modeling OSEK/VDX OS Requirements in C.",
                    "An Analysis Method of Safety Requirements for Automotive Software Systems.",
                    "Domain-Specific Language Facilitates Scheduling in Model Checking.",
                    "Formalization and Verification of the PSTM Architecture.",
                    "Synthesizing Pareto Optimal Decision for Autonomic Clouds Using Stochastic Games Model Checking.",
                    "On Adequate Behavior-Based Architecture Conformance Checks.",
                    "From Abstract to Concrete Repairs of Model Inconsistencies: An Automated Approach.",
                    "From Monolith to Microservices: A Dataflow-Driven Approach.",
                    "Scalable and Obfuscation-Resilient Android App Repackaging Detection Based on Behavior Birthmark.",
                    "A Comprehensive Evaluation of Software Reliability Modeling Based on Marshall-Olkin Type Fault-Detection Time Distribution.",
                    "Failure Prediction in Crowdsourced Software Development.",
                    "What-If Model Construction and Validation of Web Systems Based on Log Mining.",
                    "Automatic Test Generation of Large Boolean Expressions in Computer Based Interlocking System.",
                    "An Empirical Study to Revisit Productivity across Different Programming Languages.",
                    "A Systematic Review of Logging Practice in Software Engineering.",
                    "Identifying Terms in Open Source Software License Texts.",
                    "SoS GaP Slicer: Slicing SoS Goal and PRISM Models for Change-Responsive Verification of SoS.",
                    "Steiner Tree Based Recommendation System for Combination of APIs and IoT Devices.",
                    "Software Optimizations of Multiple Sets Intersection via SIMD Instructions.",
                    "Multi-Perspective Visualization to Assist Code Change Review.",
                    "tgp: A Task-Granularity Profiler for the Java Virtual Machine.",
                    "An Exploratory Experiment on Metamodel-Transformation Co-Evolution.",
                    "Feature Evolution and Reuse - An Exploratory Study of Eclipse.",
                    "iLSE: An Intelligent Web-Based System for Log Structuring and Extraction.",
                    "How Do Programmers Maintain Concurrent Code?",
                    "Formal Definitions for Design Spaces and Traces.",
                    "Generating Equality Loop Invariants with Functions Based on Random Testing, Constraint Solving and Verification.",
                    "Characterising Sound Visualisations of Specifications Using Micro-Charts and Refinement.",
                    "Writing Concurrent Java Programs Based on CafeOBJ Specifications.",
                    "An Evaluation of Selection Methods for Time-Aware Effort Estimation.",
                    "Impact of the Distribution Parameter of Data Sampling Approaches on Software Defect Prediction Models.",
                    "Identifying Textual Features of High-Quality Questions: An Empirical Study on Stack Overflow.",
                    "Facilitating Scenario-Based Program Comprehension with Topic Models.",
                    "How Do Code Refactoring Activities Impact Software Developers' Sentiments? - An Empirical Investigation Into GitHub Commits.",
                    "CCFinderSW: Clone Detection Tool with Flexible Multilingual Tokenization.",
                    "Automatic Generation of Monitoring Code for Model Based Analysis of Runtime Behaviour.",
                    "Code Suggestion of Method Call Statements Using a Source Code Corpus.",
                    "On the Use of Mined Stack Traces to Improve the Soundness of Statically Constructed Call Graphs.",
                    "Test Environment Construction Method Using Parameterized Test Environments.",
                    "Optimized Test Data Generation for RESTful Web Service.",
                    "Towards an Improvement of Bisection-Based Adaptive Random Testing.",
                    "A Novel Tool for Automatic GUI Layout Testing.",
                    "Multi-Process Runtime Verification for Android.",
                    "Toward Detection of Abnormal Behaviors in Timing and Security Requirements.",
                    "An Ontological Approach to Elicit Safety Requirements.",
                    "Towards Semantic-Aware Collaborations in Systems Engineering.",
                    "Automated Analysis of Multi-View Software Architectures.",
                    "Structuring the Knowledge for Software Process Appraisal towards Semi-Automated Support.",
                    "Factors Influencing Productivity of Agile Software Development Teamwork: A Qualitative System Dynamics Approach.",
                    "Clockwerk: A Predictable and Efficient Extension of Logical Execution Time Model.",
                    "A Simulation Model of Kanban Software Process.",
                    "Interface Driven Code Clone Detection.",
                    "Retrieving Self-Executable and Functionally Correct Code to Improve Source Code Search.",
                    "Knowledge Based Optimization for Distributed Real-Time Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2017w",
                "sub_name": "24th Asia-Pacific Software Engineering Conference Workshops, APSEC Workshops 2017, Nanjing, China, December 4-8, 2017.",
                "count": 23,
                "papers": [
                    "AHWCI: A Prototype Tool for Identifying High-Level Workflow Changes.",
                    "Characterising Sound Visualisations of Specifications Using Micro-Charts and Refinement.",
                    "Understanding Quality Attributes in Microservice Architecture.",
                    "An Optimal Opportunistic Scheduling Algorithm for Parallel Tasks in a Cloudlet.",
                    "Microservices Architecture in DevOps.",
                    "Exploring the Relationships between Software Architecture and Source Code.",
                    "Systematic Review of Success Factors for Scaling Agile Methods in Global Software Development Environment: A Client-Vendor Perspective.",
                    "Regression Testing Goals - View of Practitioners and Researchers.",
                    "Developer Teams on Bug Resolution: An Empirical Study on Mozilla Firefox and Eclipse JDT Projects.",
                    "Time Distribution of Software Stage Effort.",
                    "An Overview of Practical Impacts of Functional Programming.",
                    "Including Pervasive Web Content in Evidence-Based Software Engineering: A Case Study.",
                    "An Analysis of Library Rollbacks: A Case Study of Java Libraries.",
                    "Topic Detection from Microblogs Using T-LDA and Perplexity.",
                    "Mining Software Engineering Team Project Work Logs to Generate Formative Assessment.",
                    "Sentiments Analysis in GitHub Repositories: An Empirical Study.",
                    "Entropy-Based Dynamic Complexity Metrics for Service-Oriented Systems.",
                    "Assessing Change Proneness at the Architecture Level: An Empirical Validation.",
                    "What is the Further Evidence about UML? - A Systematic Literature Review.",
                    "Framework Information Based Java Software Architecture Recovery.",
                    "Extracting Software Security Concerns of Problem Frames Based on a Mapping Study.",
                    "An Exploratory Study on Interface Similarities in Code Clones.",
                    "Decentralization of Control Loop for Self-Adaptive Software through Reinforcement Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2017quasoq",
                "sub_name": "Proceedings of the 5th International Workshop on Quantitative Approaches to Software Quality co-located with 24th Asia-Pacific Software Engineering Conference (APSEC 2017), Nanjing, Jiangsu, China, December 4, 2017.",
                "count": 9,
                "papers": [
                    "Static and Dynamic Architecture Conformance Checking: A Systematic, Case Study-Based Analysis on Tradeoffs and Synergies.",
                    "Towards a Quality Framework for Enterprise Architecture Models.",
                    "Multi-Level Compliance Measurements for Software Process Appraisal.",
                    "Towards the Re-engineering of Readiness Review Process with R2P2 Lifecycle Model.",
                    "A Web Application to Manage and Improve Software Development Projects by SEMAT Essence.",
                    "Investigating the Effectiveness of Greedy Algorithm on Open Source Software Systems for Determining Refactoring Sequence.",
                    "Automatically Identifying Dead Fields in Test Code by Resolving Method Call and Field Dependency.",
                    "Detecting Technical Debt through Issue Trackers.",
                    "Estimating Web Service Quality of Service Parameters using Source Code Metrics and LSSVM."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "23rd APSEC 2016",
        "info": "Hamilton, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2016",
                "sub_name": "23rd Asia-Pacific Software Engineering Conference, APSEC 2016, Hamilton, New Zealand, December 6-9, 2016.",
                "count": 58,
                "papers": [
                    "Find your Open Source License Now!",
                    "Task Recommendation with Developer Social Network in Software Crowdsourcing.",
                    "What Influences Usability Defect Reporting? - A Survey of Software Development Practitioners.",
                    "EXPSOL: Recommending Online Threads for Exception-Related Bug Reports.",
                    "Retrieving Design Pattern Usage Examples using Domain Matching.",
                    "LibSift: Automated Detection of Third-Party Libraries in Android Applications.",
                    "Does the Role Matter? An Investigation of the Code Quality of Casual Contributors in GitHub.",
                    "Does the \"Project Manager\" Still Exist in Agile Software Development Projects?",
                    "Does it Fit Me Better? User Segmentation in Requirements Engineering.",
                    "A Model Checking Based Approach for Containment Checking of UML Sequence Diagrams.",
                    "Model-Based Continuous Verification.",
                    "Model Driven Software Security Architecture of Systems-of-Systems.",
                    "Analytical Study of Cognitive Layered Approach for Understanding Security Requirements Using Problem Domain Ontology.",
                    "An Empirical Analysis of Vulnerabilities in OpenSSL and the Linux Kernel.",
                    "Projected Control Graph for Accurate and Efficient Analysis of Safety and Security Vulnerabilities.",
                    "Examination of Coding Violations Focusing on Their Change Patterns over Releases.",
                    "Splitting Commits via Past Code Changes.",
                    "An Empirical Study into the Relationship Between Class Features and Test Smells.",
                    "A Model for Defining Coupling Metrics.",
                    "A Map of Threats to Validity of Systematic Literature Reviews in Software Engineering.",
                    "The Introduction of Technical Debt Tracking in Large Companies.",
                    "Heterogeneous Cross-Company Effort Estimation through Transfer Learning.",
                    "An Algorithmic-Based Change Effort Estimation Model for Software Development.",
                    "Filter-INC: Handling Effort-Inconsistency in Software Effort Estimation Datasets.",
                    "Achieving High Code Coverage in Android UI Testing via Automated Widget Exercising.",
                    "Testing Android Apps via Guided Gesture Event Generation.",
                    "Effectively Manifesting Concurrency Bugs in Android Apps.",
                    "Model-Based API-Call Constraint Checking for Automotive Control Software.",
                    "An Incremental V-Model Process for Automotive Development.",
                    "Minimalist Qualitative Models for Model Checking Cyber-Physical Feature Coordination.",
                    "Toward Developer-like Automated Program Repair - Modification Comparisons between GenProg and Developers.",
                    "CURE: Automated Patch Generation for Dynamic Software Update.",
                    "Improving Reliability of Dynamic Software Updating Using Runtime Recovery.",
                    "The Floating-Point Extension of Symbolic Execution Engine for Bug Detection.",
                    "Compositional Symbolic Execution: Incremental Solving Revisited.",
                    "Masking Soft Errors with Static Bitwise Analysis.",
                    "Integrating Goal Model into Rule-Based Adaptation.",
                    "Dataset Coverage for Testing Machine Learning Computer Programs.",
                    "Automated Test Sequence Generation for Function Block Diagram Programs.",
                    "Mind the Gap: Addressing Behavioural Inconsistencies with Formal Methods.",
                    "Formalization and Verification of the Powerlink Protocol Using CSP.",
                    "Automated Deployment of Data Collection Policies over Heterogeneous Shared Sensing Infrastructures.",
                    "Schemata, Acculturation, and Cognition: Expatriates in Japan's Software Industry.",
                    "A Review of Six Years of Asia-Pacific Software Engineering Conference.",
                    "Identifying Practitioners' Arguments and Evidence in Blogs: Insights from a Pilot Study.",
                    "An Empirical Investigation into Code Smell Elimination Sequences for Energy Efficient Software.",
                    "Combatting Use Case Points' Limitations with COCOMO(R) II and Relative Difficulty.",
                    "The Improvement of the Trustworthiness of Android App Stores in China.",
                    "Detecting and Localizing Visual Inconsistencies in Web Applications.",
                    "Developers Expertise and Roles on Software Technologies.",
                    "Adoption and Suitability of Software Development Methods and Practices.",
                    "Predictive Tool for Software Team Performance.",
                    "Our Journey to Becoming Agile: Experiences with Agile Transformation in Samsung Electronics.",
                    "Design and Implementation of Training Course for Software Process Improvement Engineers.",
                    "History-Based Test Case Prioritization for Failure Information.",
                    "System Product Line Engineering for Small Appliances with Driver Derivation.",
                    "Guiding Identification of Missing Scenarios for Dynamic Feature Location.",
                    "RE_PROV: Modeling Requirement Provenance with PROV."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2016quasoq",
                "sub_name": "Joint Proceedings of the 4th International Workshop on Quantitative Approaches to Software Quality (QuASoQ 2016) and 1st International Workshop on Technical Debt Analytics (TDA 2016) co-located with the 23rd Asia-Pacific Software Engineering Conference (APSEC 2016), Hamilton, New Zealand, December 6, 2016.",
                "count": 15,
                "papers": [
                    "Report on the 4th International Workshop on Quantitative Approaches to Software Quality (QuASoQ 2016).",
                    "Local Variables with Compound Names and Comments as Signs of Fault-Prone Java Methods.",
                    "Sustainability Profiling of Long-living Software Systems.",
                    "Towards improved Adoption: Effectiveness of Research Tools in the Real World.",
                    "Predicting Quality of Service (QoS) Parameters using Extreme Learning Machines with Various Kernel Methods.",
                    "Improving Recall in Code Search by Indexing Similar Codes under Proper Terms.",
                    "Code Coverage Analysis of Combinatorial Testing.",
                    "Trying to Increase the Mature Use of Agile Practices by Group Development Psychology Training - An Experiment.",
                    "Report on the First International Workshop on Technical Debt Analytics (TDA 2016).",
                    "When, Why and for Whom do Practitioners Detect Technical Debt? An Experience Report.",
                    "Using Analytics to Quantify Interest of Self-Admitted Technical Debt.",
                    "Rework Effort Estimation of Self-admitted Technical Debt.",
                    "Minimizing Refactoring Effort through Prioritization of Classes based on Historical, Architectural and Code Smell Information.",
                    "Co-Existence of the 'Technical Debt' and 'Software Legacy' Concepts.",
                    "Perspectives on Managing Technical Debt: A Transition Point and Roadmap from Dagstuhl."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "22nd APSEC 2015",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2015",
                "sub_name": "2015 Asia-Pacific Software Engineering Conference, APSEC 2015, New Delhi, India, December 1-4, 2015.",
                "count": 56,
                "papers": [
                    "Evolving Critical Systems.",
                    "Trends in Automation and Control Systems Needing Efficient Software Engineering.",
                    "Building an Open Identity Platform for India.",
                    "Building Enterprise-Grade Internet of Things Applications.",
                    "Software Defined Storage Technology.",
                    "Evaluation and Measurement of Software Testing Process Quality Applicable to Software Testing Laboratory.",
                    "CSP Bounded Model Checking of Preprocessed CTL Extended with Events Using Answer Set Programming.",
                    "PowerPoint Add-in Tool Support for Informal and Semi-Formal Specification Animation.",
                    "High Productivity Programmers Use Effective Task Processes in Unit-Testing.",
                    "Generating Hierarchical Reference Process Model Using Fragments Clustering.",
                    "Versioning Distributed Transactions for Dynamic Component Reconfiguration.",
                    "TBIL: A Tagging-Based Approach to Identity Linkage Across Software Communities.",
                    "From LTL Formulae to Büchi Automata: A Direct Translation Using On-the-Fly De-Generalization.",
                    "Automatic Selection of System Functional Scenarios for Formal Specification Animation.",
                    "Exploiting Annotations to Test Break-off Branches.",
                    "The Impacts of Supporting Materials on Code Reading: A Controlled Experiment.",
                    "Eye-Tracking Metrics in Software Engineering.",
                    "Designing Distributed Systems w.r.t. Conformance.",
                    "Risks, Challenges and Issues in a Possible Scrum and COBIT Marriage.",
                    "Role Distribution and Transformation in Open Source Software Project Teams.",
                    "Efficient and Scalable Collection of Dynamic Metrics Using MapReduce.",
                    "Surveying the Corpus of Model Resolution Strategies for Metamodel Evolution.",
                    "Verifying Automotive Systems in EAST-ADL/Stateflow Using UPPAAL.",
                    "Can We Detect Bug Report Duplication with Unfinished Bug Reports?",
                    "Towards a Formal Approach to Modeling and Verifying the Design of Dynamic Software Updates.",
                    "Improing Screen Power Usage Model on Android Smartphones.",
                    "Hybrid Marte.",
                    "ABC: Accelerated Building of C/C++ Projects.",
                    "Bug Localization Based on Code Change Histories and Bug Reports.",
                    "A Third-Party Extension Support Framework Using Patterns.",
                    "EFSPredictor: Predicting Configuration Bugs with Ensemble Feature Selection.",
                    "Abstract Accountability Language: Translation, Compliance and Application.",
                    "Incremental Variability Management in Conceptual Data Models of Software Product Lines.",
                    "Software Architecture and Specification Model for Customizable Code Inspection Tools.",
                    "Quality Assessment of Web Services Using Multivariate Adaptive Regression Splines.",
                    "Input-Driven Active Testing of Multi-threaded Programs.",
                    "Specifying Cyber Physical System Safety Properties with Metric Temporal Spatial Logic.",
                    "Using Examples for Teaching Software Design: An Experiment Using a Repository of UML Class Diagrams.",
                    "Quality Based Software Project Staffing and Scheduling with Cost Bound.",
                    "From Goal Models to Feature Models: A Rule-Based Approach for Software Product Lines.",
                    "A Learning to Rank Framework for Developer Recommendation in Software Crowdsourcing.",
                    "Discovering User-Defined Event Handlers in Presence of JavaScript Libraries.",
                    "Decomposing Automatic Train Control Verification System with Projection.",
                    "How Do Python Programs Use Inheritance? A Replication Study.",
                    "Managing Availability of web services in service oriented systems.",
                    "Inferring State Models Using Feedback Directed Random Testing.",
                    "Layout Validation Using Graph Grammar and Generation of Yard Specific Safety Properties for Railway Interlocking Verification.",
                    "Development of Project Outcome Prediction System for an IT Vendor.",
                    "Optimal Reasoning of Goals in the i* Framework.",
                    "Labeling Feature-Oriented Software Clusters for Software Visualization Application.",
                    "A Concurrent Feedback Development Method and Its Application to Automotive Software Development.",
                    "Measuring Business Logic Complexity in Software Systems.",
                    "Application Layer Encryption for Cloud.",
                    "Timing Analysis of Safety-Critical Automotive Software: The AUTOSAFE Tool Flow.",
                    "Assessing the Quality of Software Requirements Specifications for Automotive Software Systems.",
                    "Citizen's Charter Driven Service Area Improvement."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2015quasoq",
                "sub_name": "Joint Proceedings of the 3rd International Workshop on Quantitative Approaches to Software Quality (QuASoQ), the Workshop on Alternate Workforces for Software Engineering (WAWSE) and the 1st International Workshop on Case Method for Computing Education (CMCE) co-located with APSEC 2015, New Delhi, India, December 1, 2015.",
                "count": 17,
                "papers": [
                    "An Industrial Case Study on Improving Quality in Integrated Software Product using defect dependency.",
                    "Automatic Recommendation of Software Design Patterns Using Anti-patterns in the Design Phase: A Case Study on Abstract Factory.",
                    "Correctness of Semantic Code Smell Detection Tools.",
                    "A Decision Support Platform for Guiding a Bug Triage for Resolver Recommendation Using Textual and Non-Textual Features.",
                    "The Way Ahead for Bug-fix time Prediction.",
                    "Crowdsourcing for API documentation: A Preliminary Investigation.",
                    "Simulation of Consensus Based Approaches to Mitigate the Challenges in Crowdsourcing.",
                    "An Exploratory Study of Ethical problems in Digital Service and Engineering Project Management.",
                    "People Management Issues in Scrum from COBIT Perspective.",
                    "Case Study of Project Outcome Prediction for an IT Vendor.",
                    "Crowdsourced Testing for Enterprises: Experiences.",
                    "Quality Based Software Project Staffing and Scheduling with Budget and Deadline.",
                    "Teaching by Case Method in Computing Education.",
                    "Anukarna: A Software Engineering Simulation Game for Teaching Practical Decision Making in Peer Code Review.",
                    "A Case Study on Teaching Software Engineering Concepts using a Case-Based Learning Environment.",
                    "A Case Study based Software Engineering Education using Open Source Tools.",
                    "Case Method for Computing Education (CMCE): A Strategy for Teaching Software Engineering."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "21st APSEC 2014",
        "info": "Jeju, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2014-1",
                "sub_name": "21st Asia-Pacific Software Engineering Conference, APSEC 2014, Jeju, South Korea, December 1-4, 2014. Volume 1: Research Papers.",
                "count": 58,
                "papers": [
                    "A Test Scenario Design Methodology Based on Business Context Modeling and Its Evaluation.",
                    "Test Scenario Generation for Reliability Tactics from UML Sequence Diagram.",
                    "Test Case Prioritization Based on Information Retrieval Concepts.",
                    "User Guided Automation for Testing Mobile Apps.",
                    "Modeling and Testing of GUIs Using IOLTS.",
                    "Improving Testing Coverage for Safety-Critical System by Mutated Specification.",
                    "A Framework for Distributed Testing of Timed Composite Systems.",
                    "SAT-Based Bounded Software Model Checking for Embedded Software: A Case Study.",
                    "Model Checking of Software Product Lines in Presence of Nondeterminism and Probabilities.",
                    "Effect of Model Based Software Development on Productivity of Enhancement Tasks - An Industrial Study.",
                    "pIML - An Interrupt Program Modelling Language for Real-Time and Embedded Systems.",
                    "Formal Modeling and Analyzing the Reliability for Service Composition.",
                    "Early Experience with Model-Driven Development of MapReduce Based Big Data Application.",
                    "Modeling Web Attachment Storage for Web Applications.",
                    "A Context-Role Based Modeling Framework for Engineering Adaptive Software Systems.",
                    "A Model-Driven Approach to Generate Mobile Applications for Multiple Platforms.",
                    "Predicting Next Changes at the Fine-Grained Level.",
                    "Synchronization Error Detection of MPI Programs by Symbolic Execution.",
                    "Guidelines for the Use of Function Block Diagram in Reactor Protection Systems.",
                    "Traceability-Driven System Development and its Application to Automotive System Development.",
                    "A Lifecycle-Based Design Methodology of the Lightweight Ontology and Its Application to Cultivating High Quality Mandarin Orange.",
                    "Handling Emergency Mode Switch for Component-Based Systems.",
                    "Interactive Scalable Abstraction of Reverse Engineered UML Class Diagrams.",
                    "Context Sensitive Dynamic Slicing of Concurrent Aspect-Oriented Programs.",
                    "An Efficient Application-Device Matching Method for the Mobile Software Ecosystem.",
                    "Experience on a Microservice-Based Reference Architecture for Measurement Systems.",
                    "Run-Time Monitoring-Based Evaluation and Communication Integrity Validation of Software Architectures.",
                    "Customer Requirements Validation Method Based on Mental Models.",
                    "Outliers and Replication in Software Engineering.",
                    "An Empirical Study on the Adequacy of Testing in Open Source Projects.",
                    "A Novel Developer Ranking Algorithm for Automatic Bug Triage Using Topic Model and Developer Relations.",
                    "Recovery of Object Oriented Features from C++ Binaries.",
                    "Process Cube for Software Defect Resolution.",
                    "Improving Fuzzy Analogy Based Software Development Effort Estimation.",
                    "Runtime Verification by Convergent Formula Progression.",
                    "Reviewing Formal Specification for Validation Using Animation and Trace Links.",
                    "A Symbolic Partial Order Method for Verifying SystemC.",
                    "A Probabilistic Neural Network-Based Approach for Related Software Changes Detection.",
                    "Using Genetic Algorithms to Repair JUnit Test Cases.",
                    "Evaluation of Maude as a Test Generation Engine for Automotive Operating Systems.",
                    "Learning Summaries of Recursive Functions.",
                    "A Tool to Suggest Similar Program Element Modifications.",
                    "GAIN: GPU-Based Constraint Checking for Context Consistency.",
                    "Factors Affecting the Project Performance of Information Systems Development: Comparison of Organizational Cultures.",
                    "Who Should Review this Pull-Request: Reviewer Recommendation to Expedite Crowd Collaboration.",
                    "A Exploratory Study of @-Mention in GitHub's Pull-Requests.",
                    "Predicting Time Range of Development Based on Generalized Software Reliability Model.",
                    "Verifying Secure Interface Composition for Component-Based System Designs.",
                    "Security Weaknesses Detection by Symbolic Analysis of Scenarios.",
                    "Formal Design and Verification of Zone Controller.",
                    "Mining Developer Mailing List to Predict Software Defects.",
                    "SHAP: Suppressing the Detection of Inconsistency Hazards by Pattern Learning.",
                    "Automatic Classification of UML Class Diagrams from Images.",
                    "Runtime Checking for Paired Functions in Device Drivers.",
                    "BP-Miner: Mining Paired Functions from the Binary Code of Drivers for Error Handling.",
                    "Data Flow Based Integration Testing for Embedded System Using Interaction Model.",
                    "An Efficient Method for Assessing the Impact of Refactoring Candidates on Maintainability Based on Matrix Computation.",
                    "A Proved Approach for Building Correct Instances of UML Associations: Multiplicities Satisfaction."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2014-2",
                "sub_name": "21st Asia-Pacific Software Engineering Conference, APSEC 2014, Jeju, South Korea, December 1-4, 2014. Volume 2: Industry, Short, and QuASoQ Papers.",
                "count": 17,
                "papers": [
                    "Reducing False Alarms from an Industrial-Strength Static Analyzer by SVM.",
                    "Concolic Testing Framework for Industrial Embedded Software.",
                    "A Goal-Oriented Design Methodology of IT-Driven Business Architecture.",
                    "SYNCEYE: An Availability Measurement Tool for Embedded Systems.",
                    "SW FMEA for ISO-26262 Software Development.",
                    "Software Quality Control via Exit Criteria Methodology: An Industrial Experience Report.",
                    "API Document Quality for Resolving Deprecated APIs.",
                    "What Community Contribution Pattern Says about Stability of Software Project?",
                    "Migrated Question Prediction on StackExchange.",
                    "An Empirical Study on Interaction Factors Influencing Bug Reopenings.",
                    "Initial Industrial Experience of GQM-Based Product-Focused Project Monitoring with Trend Patterns.",
                    "Lessons Learned on Systematic Metric System Development at a Large IT Service Provider.",
                    "Empirical Analysis of Fault-Proneness in Methods by Focusing on their Comment Lines.",
                    "Quality Ranking of Features in Software Product Line Engineering.",
                    "A CMMI-Based Automated Risk Assessment Framework.",
                    "Continuous Product-Focused Project Monitoring with Trend Patterns and GQM.",
                    "Towards an Architecture Quality Index for the Behavior of Software Systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "20th APSEC 2013",
        "info": "Ratchathewi, Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2013-1",
                "sub_name": "20th Asia-Pacific Software Engineering Conference, APSEC 2013, Ratchathewi, Bangkok, Thailand, December 2-5, 2013 - Volume 1.",
                "count": 75,
                "papers": [
                    "On the Use of Software Quality Standard ISO/IEC9126 in Mobile Environments.",
                    "System Quality Improvement Including Software and Infrastructure Based on Software Metrics Approach.",
                    "Refining the Pointer Analysis by Exploiting Constraints on the CFL-Paths.",
                    "Samekana: A Browser Extension for Including Relevant Web Links in Issue Tracking System Discussion Forum.",
                    "Factors Influencing Research Contributions and Researcher Interactions in Software Engineering: An Empirical Study.",
                    "Can Control-Component Libraries Reduce the Costs of Developing Control Engineering-Based Self-Adaptive Systems?",
                    "Packaged Software Implementation Requirements Engineering by Small Software Enterprises.",
                    "Modeling Security Threat Patterns to Derive Negative Scenarios.",
                    "QoS-Based Service Composition under Various QoS Requirements.",
                    "TETRABox - A Generic White-Box Testing Framework for Model Transformations.",
                    "Facilitating Verification in Program Loops by Identification of Static Iteration Patterns.",
                    "Selecting Highly Efficient Sets of Subdomains for Mutation Adequacy.",
                    "A Value Weighting Method for Pair-wise Testing.",
                    "Fault-Prone Module Prediction Using a Prediction Model and Manual Inspection.",
                    "Can We Trust Our Results? A Mapping Study on Data Quality.",
                    "Evaluating Performance of Network Metrics for Bug Prediction in Software.",
                    "Effects of Organizational Changes on Product Metrics and Defects.",
                    "Analyzing Early Requirements of Cyber-physical Systems through Structure and Goal Modeling.",
                    "Towards Requirements Change Decision Support.",
                    "Automating Inference of OCL Business Rules from User Scenarios.",
                    "Problem Frames Construction from Feature Models.",
                    "Diagnosis-Oriented Alarm Correlations.",
                    "Identifying More Equivalent Mutants via Code Similarity.",
                    "An Approach to Generate Safety Validation Test Cases from UML Activity Diagram.",
                    "Executable Program Documentation Based on Debugging Break Points.",
                    "A Controlled Experiment to Assess the Effectiveness of Eight Use Case Templates.",
                    "Connecting Interaction Models and Application Logic for Model-Driven Generation of Web-Based Graphical User Interfaces.",
                    "Mining Attribute Lifecycle to Predict Faults and Incompleteness in Database Applications.",
                    "Software Quality Requirements: A Systematic Mapping Study.",
                    "Entity Disambiguation in Natural Language Text Requirements.",
                    "Reasoning about Stakeholder Groups for Requirements Negotiation Based on Power Relationships.",
                    "Distributed Online Test Generation for Model-Based Testing.",
                    "On Detecting Concurrency Defects Automatically at the Design Level.",
                    "Data-Race-Freedom of Concurrent Programs.",
                    "Semantic Document Adaptation with OCL Annotations.",
                    "Visualization of Defect Inflow and Resolution Cycles: Before, During and After Transfer.",
                    "Detecting Program Changes from Edit History of Source Code.",
                    "SMT-Based Bounded Model Checking for OSEK/VDX Applications.",
                    "Preserving Correctness of Requirements Evolution through Refinement in Event-B.",
                    "A Formal Coloured Petri Net Model for Hazard Detection in Large Event Flows.",
                    "Handling Database Schema Variability in Software Product Lines.",
                    "An Extended Orthogonal Variability Model for Metadata-Driven Multitenant Cloud Services.",
                    "Constraint Checking in Distributed Product Configuration of Multi Product Lines.",
                    "Harnessing SMT-Based Bounded Model Checking through Stateless Explicit-State Exploration.",
                    "Towards a Hybrid Framework for Detecting Input Manipulation Vulnerabilities.",
                    "A SystemC Semantics in Guarded Assignment Systems and Its Applications with VERDS.",
                    "Integrating Software Process Reuse and Automation.",
                    "Safe Substitution of Components in Self-Adaptive Web Applications.",
                    "Run-Time Monitoring and Real-Time Visualization of Software Architectures.",
                    "Handling Multiple Mode Switch Scenarios in Component-Based Multi-mode Systems.",
                    "Schedulability Analysis with CCSL Specifications.",
                    "Linking the Semantics of BPEL Using Maude.",
                    "A Systematic Review of Model-Driven Security.",
                    "Quality Driven Design of Program Frameworks for Intelligent Sensor Applications.",
                    "Automated Management of Dynamic Component Dependency for Runtime System Reconfiguration.",
                    "Service Brick Composition Framework for Smartphones.",
                    "An Action-Oriented Programming Model for Pervasive Computing in a Device Cloud.",
                    "Extracting and Visualizing Implementation Structure of Features.",
                    "Tool Integration Models.",
                    "Visualizations as a Basis for Agile Software Process Improvement.",
                    "Scrum Anti-Patterns - An Empirical Study.",
                    "Strategies for Aligning Variability Model and Architecture.",
                    "A Method for Early Detection of Mismatches between Framework Architecture and Execution Scenarios.",
                    "Architecture Security Evaluation Method Based on Security of the Components.",
                    "A New Scheduling Strategy for Risk Mitigation.",
                    "Designing User Experience for Mobile Apps: Long-Term Product Owner Perspective.",
                    "Improving Analogy-Based Software Cost Estimation through Probabilistic-Based Similarity Measures.",
                    "Multi-core Model Checking Algorithms for LTL Verification with Fairness Assumptions.",
                    "Null Dereference Detection via a Backward Analysis.",
                    "Results for Compositional Timed Testing.",
                    "Model Checking Liveness Properties under Fairness & Anti-fairness Assumptions.",
                    "JeB: Safe Simulation of Event-B Models in JavaScript.",
                    "Lehman's Laws and the Productivity of Increments: Implications for Productivity.",
                    "On Security Issues in Web Applications through Cross Site Scripting (XSS).",
                    "Sky-MCSP-R: An Efficient Graph-Based Web Service Composition Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2013",
                "sub_name": "20th Asia-Pacific Software Engineering Conference, APSEC 2013, Ratchathewi, Bangkok, Thailand, December 2-5, 2013 - Volume 2.",
                "count": 32,
                "papers": [
                    "Patch Reviewer Recommendation in OSS Projects.",
                    "A Study of the Characteristics of Developers' Activities in GitHub.",
                    "Classifying Bug Reports to Bugs and Other Requests Using Topic Modeling.",
                    "How Much Do Code Repositories Include Peripheral Modifications?",
                    "Grouping Objects for Execution Trace Analysis Based on Design Patterns.",
                    "Seamless Code Reuse with Source Code Corpus.",
                    "0-1 Programming Model-Based Method for Planning Code Review Using Bug Fix History.",
                    "Calibrating Productivity Drivers for Software Customisation Projects.",
                    "Bidirectional Translation between OCL and JML for Round-Trip Engineering.",
                    "A Study of the Effect of Data Normalization on Software and Information Quality Assessment.",
                    "Modeling Code Analyzability at Method Level in J2EE Applications.",
                    "Identification of Inaccurate Effort Estimates in Agile Software Development.",
                    "History and Lessons Learnt from a Metrics Program at a CMMI Level 3 Company.",
                    "Requirements Engineering Based on REBOK (Requirements Engineering Body Of Knowledge) and Its Practice.",
                    "Model-Based Transition from Requirements to High-Level Software Design.",
                    "SAT and SMT: Their Algorithm Designs and Applications.",
                    "Software Reuse Based on Business Processes and Requirements.",
                    "Practitioner-Oriented Visualization in an Interactive Search-Based Software Test Creation Tool.",
                    "An Automated Testing Tool for Java Application Using Symbolic Execution Based Test Case Generation.",
                    "Business-Driven Acceptance Testing Methodology and Its Practice for E-Government Software Systems.",
                    "Suggesting Extract Class Refactoring Opportunities by Measuring Strength of Method Interactions.",
                    "Experiences During Extraction of Variability Models for Warehouse Management Systems.",
                    "Software Engineering Education Program for Software Professionals of High Competency at DENSO.",
                    "Large Scale Model-Driven Engineering for a Multi-site Team - Experience Report.",
                    "A Software and Integration Process Model for Offshore Vessels.",
                    "A Practical Study of Debugging Using Model Checking.",
                    "Cloud Service Brokers: An Emerging Trend in Cloud Adoption and Migration.",
                    "A Case Study: Verification of Specifications of an Embedded System and Generation of Verification Items Using Pairwise Testing.",
                    "Testing of Timing Properties in Real-Time Systems: Verifying Clock Constraints.",
                    "A Hybrid Approach for Control Flow Graph Construction from Binary Code.",
                    "Mining GitHub: Why Commit Stops - Exploring the Relationship between Developer's Commit Pattern and File Version Evolution.",
                    "SamikshaUmbra: Contribution and Performance Assessment of Software Maintenance Professionals by Mining Software Repositories."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "19th APSEC 2012",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2012",
                "sub_name": "19th Asia-Pacific Software Engineering Conference, APSEC 2012, Hong Kong, China, December 4-7, 2012.",
                "count": 122,
                "papers": [
                    "A Context-Based Integrity Framework.",
                    "Integration of Safety Verification with Conformance Testing in Real-Time Reactive System.",
                    "Modular Heap Abstraction-Based Memory Leak Detection for Heap-Manipulating Programs.",
                    "A CSP-theoretic Framework of Checking Conformance of Business Processes.",
                    "Applying Recommendation Systems for Composing Dynamic Services for Mobile Devices.",
                    "Towards an Adaptive Service Degradation Approach for Handling Server Overload.",
                    "A Preference and Honesty Aware Trust Model for Web Services.",
                    "Trust-Based Service Composition and Optimization.",
                    "A Trust Impact Analysis Model for Composite Service Evolution.",
                    "Modeling and Verification of Context-Aware Systems.",
                    "The Case for Using Simulation to Validate Event-B Specifications.",
                    "Semi-Automated Verification of Defense against SQL Injection in Web Applications.",
                    "Discovering Early Aspects through Goals Interactions.",
                    "Automated Functional Scenarios-Based Formal Specification Animation.",
                    "DRE-specific Wikis for Distributed Requirements Engineering: A Review.",
                    "Service-Driven Migrating of Enterprise Information Systems: A Case Study.",
                    "Supporting Awareness during Collaborative and Distributed Configuration of Multi Product Lines.",
                    "Leveraging CVL to Manage Variability in Software Process Lines.",
                    "Relationships Formalization for Model-Based Product Lines.",
                    "Debugging Model-to-Model Transformations.",
                    "Model-Checking C Programs against JML-like Specification Language.",
                    "Resynchronizing Model-Based Self-Adaptive Systems with Environments.",
                    "Software-Based Online Monitoring of Cache Contents on Platforms without Coherence Fabric.",
                    "An Experimentation Platform for the Automatic Parallelization of R Programs.",
                    "Discovering Domain Concepts and Hyponymy Relations by Text Relevance Classifying Based Iterative Web Searching.",
                    "Semi-static Detection of Runtime Type Errors in Component-Based Java Programs.",
                    "Protego: In-Memory Version Control System in the Cloud.",
                    "An Empirical Study on Improving Severity Prediction of Defect Reports Using Feature Selection.",
                    "Linking Functions and Quality Attributes for Software Evolution.",
                    "Bug Prediction Metrics Based Decision Support for Preventive Software Maintenance.",
                    "An Approach to Generate Actor-Oriented Activity Charts from Use Case Requirements.",
                    "Process Model of Software Method Transition.",
                    "A Design Pattern to Build Executable DSMLs and Associated V&V Tools.",
                    "Evaluation Metric for Multiple-Bug Localization with Simple and Complex Predicates.",
                    "Dependency Based Approach for Software Analysis Web Services Replacement.",
                    "Testing of Component-Based Systems.",
                    "Precise Analysis of Large Industry Code.",
                    "An Experience Report on Analyzing Industrial Software Systems Using Code Clone Detection Techniques.",
                    "Enhancing Symbolic Execution to Test the Compatibility of Re-engineered Industrial Software.",
                    "Test Case Selection Based on Path Condtions of Symbolic Execution.",
                    "The NORMAP Methodology: Lightweight Engineering of Non-functional Requirements for Agile Processes.",
                    "Automated Analysis of Textual Use-Cases: Does NLP Components and Pipelines Matter?",
                    "Empirical Analysis of the Impact of Requirements Traceability Quality to the Productivity of Enterprise Applications Development.",
                    "SaaS Application Framework Using Information Gateway Enabling Cloud Service with Data Confidentiality.",
                    "Towards Accurate Monitoring of Extra-Functional Properties in Real-Time Embedded Systems.",
                    "Implementing Virtual Agent as an Interface for Smart Home Voice Control.",
                    "Determining and Selecting the Optimal Sets of Risk Treatments under Project Constraints.",
                    "Validating the Effectiveness of Object-Oriented Metrics over Multiple Releases for Predicting Fault Proneness.",
                    "An Empirical Study of Reliability Growth of Open versus Closed Source Software through Software Reliability Growth Models.",
                    "An Empirical Analysis of the Impact of Comment Statements on Fault-Proneness of Small-Size Module.",
                    "Diffusion of Software Features: An Exploratory Study.",
                    "Incorporating Expert Judgment into Regression Models of Software Effort Estimation.",
                    "A Model-Driven Prototype Evaluation to Elicit Requirements for a Sensemaking Support Tool.",
                    "Software Development Practices in New Zealand.",
                    "An Exploratory Study of API Usage Examples on the Web.",
                    "An Overview of Software Defect Density: A Scoping Study.",
                    "Software Requirements Triage and Selection: State-of-the-Art and State-of-Practice.",
                    "Software Architecture Matching by Meta-model Extension and Refinement.",
                    "Efficient Modelling of Embedded Software Systems and their Formal Verification.",
                    "Model Transformation Patterns for Introducing Suitable Information Systems.",
                    "A Problem Oriented Approach to Modeling Feedback Loops for Self-Adaptive Software Systems.",
                    "Capturing Strategic Business Requirements: An Exploratory Study.",
                    "An Integrated Risk Analysis Method Using Spatial Interpolation.",
                    "Who is Accountable for Asynchronous Exceptions?",
                    "Pattern-Based Model Transformation Using QVT.",
                    "Behavioural Analysis for Distributed Simulations.",
                    "Extending Linden Scripting Language on OpenSim.",
                    "Architecture Based Development with DYNACOMM: Incorporating Dynamic Reconfiguration and Hierarchical Design into CommUnity.",
                    "Calculating Preconditions for Parallel Workflows.",
                    "A Formal Approach for the Iterative Design of Behavioural Models.",
                    "Invariant-preserved Transformation of State Machines from Equations into Rewrite Rules.",
                    "Comparison of Seven Bug Report Types: A Case-Study of Google Chrome Browser Project.",
                    "Javelus: A Low Disruptive Approach to Dynamic Software Updates.",
                    "Pattern-Based Dynamic Maintenance of Software Systems.",
                    "Software Feature Location Based on Topic Models.",
                    "A Verification Method of Elicited Software Requirements Using Requirements Ontology.",
                    "Permission Assurance for Semantic Aspects of Design Patterns.",
                    "Software Project Team Characteristics and Team Performance: Team Motivation as a Moderator.",
                    "An Approach to Estimating Cost of Running Cloud Applications Based on AWS.",
                    "A Case Study on Specifying Quality Requirements Using a Quality Model.",
                    "A Change Impact Analysis Approach for the Software Development Phase.",
                    "Studying the Understandability of Aspect State Machines through the Weaving Activity.",
                    "Towards Tool Integration through Artifacts and Roles.",
                    "On Accelerating SMT-based Bounded Model Checking of HSTM Designs.",
                    "Hybrid Interface Automata.",
                    "Parametric Transformations for Flexible Analysis.",
                    "Using Monterey Phoenix to Formalize and Verify System Architectures.",
                    "An Approach to Low-fidelity Prototyping Based on SOFL Informal Specification.",
                    "An Algebraic Approach to Formal Analysis of Dynamic Software Updating Mechanisms.",
                    "Proving Liveness Property under Fairness Requirements.",
                    "Debug Concurrent Programs with Visualization and Inference of Event Structure.",
                    "Importance Sampling of Runtime Interference.",
                    "Model-Based Software Architecture Evolution and Evaluation.",
                    "Proactive Enforcement of Data Consistency by Business Processes.",
                    "Syntax Map: A Modeling Language for Capturing Requirements of Graphical DSML.",
                    "Understanding OSS Peer Review Roles in Peer Review Social Network (PeRSoN).",
                    "Toward Comprehension of Side Effects in Framework Applications as Feature Interactions.",
                    "Mining Software Revision History Using Advanced Social Network Analysis.",
                    "Empowering Non-conservative Parallelizing Refactoring by Non-monotonic Reasoning.",
                    "A Guided Mashup Framework for Rapid Software Analysis Service Composition.",
                    "Factorising the Multiple Fault Localization Problem: Adapting Single-Fault Localizer to Multi-fault Programs.",
                    "A Visualization Technique for Metrics-Based Hierarchical Quality Models.",
                    "A Stochastic Simulation Model for Risk Management Process.",
                    "Automated Comparison of Process Improvement Reference Models Based on Similarity Metrics.",
                    "Execution Plan for Software Engineering Education in Taiwan.",
                    "Analysis of Adaptive Policy-Based Approach to Avoid Policy Conflicts.",
                    "Assessing Platform Suitability for Achieving Quality in Guest Applications.",
                    "Augmenting Product Lines.",
                    "Towards a Better Understanding of Testing if Conditionals.",
                    "Search Based Combinatorial Testing.",
                    "Modeling Executable Test Actors: Exploratory Study Done in Executable and Translatable UML.",
                    "PBDDR: Probe-Based Deadlock Detection and Recovery Strategy for Component-Based Systems.",
                    "A Graph-Based Approach to Web Service Matchmaking.",
                    "BuOA: An Achitecture Style for Modular Web Applications.",
                    "Assessing the Representativeness of Open Source Projects in Empirical Software Engineering Studies.",
                    "Investigating the Use of Duration-Based Moving Windows to Improve Software Effort Prediction.",
                    "Classification of Software Transfers.",
                    "A Heuristic Rule Reduction Approach to Software Fault-proneness Prediction.",
                    "Automated Insertion of Exception Handling for Key and Referential Constraints.",
                    "Data Depedency Based Trust Evaluation for BPEL Processes.",
                    "Engineering an Open-Web Educational Game Design Environment.",
                    "Web Platform API Design Principles and Service Contract."
                ]
            },
            {
                "sub_name_abbr": "conf/apsec/2012w",
                "sub_name": "19th Asia-Pacific Software Engineering Conference - Workshops, APSEC 2012, Hong Kong, China, December 4-7, 2012.",
                "count": 25,
                "papers": [
                    "Software Development Team Dynamics in SPI: A VSE Context.",
                    "Metrics for Measuring the Quality of Modularization of Scala Systems.",
                    "Software Quality Construction: Empirical Study on the Role of Requirements, Stakeholders and Resources.",
                    "Constructing Traceability between Features and Requirements for Software Product Line Engineering.",
                    "Relating Requirement and Design Variabilities.",
                    "Supporting Maintenance of Web Applications Using User-Centered Technique.",
                    "Experimental Study of Quantitative Analysis of Maintenance Effort Using Program Slicing-Based Metrics.",
                    "On Accuracy-Performance Tradeoff Frameworks for Energy Saving: Models and Review.",
                    "Quality-Aware Academic Research Tool Development.",
                    "Light-Weight Test Oracles for Resource Leaks Based on Finalizers.",
                    "Exploring an Approach to Model-Based Testing from Behavior Trees.",
                    "Generation of Character Test Input Data Using GA for Functional Testing.",
                    "Memory Modeling-Based Automatic Test Data Generation for String-Manipulating Programs.",
                    "Understanding the Effects of Code Clones on Modularity in Software Systems.",
                    "An Investigation on Software Bug-Fix Prediction for Open Source Software Projects - A Case Study on the Eclipse Project.",
                    "Preprocessing of Metrics Measurement Based on Simplifying Program Structures.",
                    "Design Patterns Based Pre-processing of Source Code for Plagiarism Detection.",
                    "An Interval-Based Model for Detecting Software Defect Using Alias Analysis.",
                    "A survey of domain engineering.",
                    "Requirements Engineering Based on REBOK (Requirements Engineering Body Of Knowledge) and Its Practical Guide.",
                    "Product Line Requirements Reuse Based on Variability Management.",
                    "A Two-Level Prioritization Approach for Regression Testing of Web Applications.",
                    "Query by Drawing Examples of UML Model.",
                    "A Memory-Based Abstraction Approach to Handle Obfuscation in Polymorphic Virus.",
                    "Towards Generating Local High-Coverage Tests for Evolving Software."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "18th APSEC 2011",
        "info": "Ho Chi Minh City, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2011",
                "sub_name": "18th Asia Pacific Software Engineering Conference, APSEC 2011, Ho Chi Minh, Vietnam, December 5-8, 2011.",
                "count": 49,
                "papers": [
                    "A Simultaneous Project Scheduling and Resource Binding Method Based on the Load-Capacity Model.",
                    "Optimal Scheduling of Software Projects Using Reinforcement Learning.",
                    "Assessing Teamwork Performance in Software Engineering Education: A Case in a Software Engineering Undergraduate Course.",
                    "Proving Non-interference on Reachability Properties: A Refinement Approach.",
                    "Memory Leak Detection Based on Memory State Transition Graph.",
                    "Techniques for Analysing PDF Malware.",
                    "Derivation and Formal Verification of a Mode Logic for Layered Control Systems.",
                    "Stepwise Validation of Formal Specifications.",
                    "Use Cases Modeling for Scalable Model-Checking.",
                    "A \"Vibration\" Method for Automatically Generating Test Cases Based on Formal Specifications.",
                    "Formal Verification of Software Designs in Hierarchical State Transition Matrix with SMT-based Bounded Model Checking.",
                    "Intrusive Test Automation with Failed Test Case Clustering.",
                    "An Automated Analysis of Errors for BPM Processes Modeled Using an In-house Infosys Tool.",
                    "Architecture-Centric Model-Driven Web Engineering.",
                    "Executable and Translatable UML - How Difficult Can it Be?",
                    "Towards a Framework for the Application of Model-Driven Development in Situational Method Engineering.",
                    "VisTML: A Visual Modeling Language for Model Transformation.",
                    "Extraction of Attribute Dependency Graph from Database Applications.",
                    "Applying Fellegi-Sunter (FS) Model for Traceability Link Recovery between Bug Databases and Version Archives.",
                    "Toward Inconsistency Awareness in Collaborative Software Development.",
                    "A Concept Lattice for Recognition of User Problems in Real User Monitoring.",
                    "RobusTest: A Framework for Automated Testing of Software Robustness.",
                    "STVL: Improve the Precision of Static Defect Detection with Symbolic Three-Valued Logic.",
                    "Integrating Model-Based Testing in Model-Driven Web Engineering.",
                    "Verification of Distributed Embedded Real-Time Systems and their Low-Level Implementations Using Timed CSP.",
                    "An Architecture of Dynamically Adaptive PHP-based Web Applications.",
                    "A Design Methodology for Real-Time Distributed Software Architecture Based on the Behavioral Properties and Its Application to Advanced Automotive Software.",
                    "Eliciting Unitary Constraints from Timed Sequence Diagram with Symbolic Techniques: Application to Testing.",
                    "A Case Study of Measuring Degeneration of Software Architectures from a Defect Perspective.",
                    "CMCD: Count Matrix Based Code Clone Detection.",
                    "AADL-based Modeling and TPN-based Verification of Reconfiguration in Integrated Modular Avionics.",
                    "Conformance Testing for OSEK/VDX Operating System Using Model Checking.",
                    "Automated Verification of Load Tests Using Control Charts.",
                    "Evotec: Evolving the Best Testing Strategy for Contract-Equipped Programs.",
                    "A Design Map for Recording Precise Architecture Decisions.",
                    "Aspects and Annotations for Controlling the Roles Application Classes Play for Design Patterns.",
                    "Object Oriented Software Clustering Based on Community Structure.",
                    "A Method to Derive Software Architectures from Quality Requirements.",
                    "Recommending Proper API Code Examples for Documentation Purpose.",
                    "Understanding Source Code Differences by Separating Refactoring Effects.",
                    "Using Variability Models to Reduce Verification Effort of Train Station Models.",
                    "Requirements Maturation Analysis by Accessibility and Stability.",
                    "Illusions and Perceptions of Transparency in Software Engineering.",
                    "A State Machine Analysis Support System Based on the Problem Frames.",
                    "Modeling Timing Requirements in Problem Frames Using CCSL.",
                    "DREX: Developer Recommendation with K-Nearest-Neighbor Search and Expertise Ranking.",
                    "Value-Risk Trade-off Analysis for Iteration Planning in Extreme Programming.",
                    "Causal Factors, Benefits and Challenges of Test-Driven Development: Practitioner Perceptions.",
                    "Towards a Tool-Supported Approach for Collaborative Process Modeling and Enactment."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "17th APSEC 2010",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2010",
                "sub_name": "17th Asia Pacific Software Engineering Conference, APSEC 2010, Sydney, Australia, November 30 - December 3, 2010.",
                "count": 49,
                "papers": [
                    "Changes in the Software Development Profession to Meet the Need for Innovation from Businesses and Government.",
                    "The Data Deluge -- How Software Engineering Can Help.",
                    "Enhancing Domain Knowledge for Requirements Elicitation with Web Mining.",
                    "A Method for Exception Scenarios Generation Using Templates of Exceptions.",
                    "A Formalism for Extending the NFR Framework to Support the Composition of the Goal Trees.",
                    "SQ^(2)E: An Approach to Requirements Validation with Scenario Question.",
                    "Quantitative Analysis of Requirements Evolution across Multiple Versions of an Industrial Software Product.",
                    "A Model and Architecture of REBOK (Requirements Engineering Body of Knowledge) and Its Evaluation.",
                    "Evaluating Cloud Platform Architecture with the CARE Framework.",
                    "Genetic Approach to Software Architecture Synthesis with Work Allocation Scheme.",
                    "Rule-Based Composition Behaviors in Dynamic Plug-In Systems.",
                    "ESAD: An Intensive Retreat Program for Embedded System Architect Developing.",
                    "Integrating Non-functional Requirement Modeling into Model Driven Development Method.",
                    "Detailed Real-Time Software Platform Modeling.",
                    "The Analysis of Sequence Diagram with Time Properties in Qualitative and Quantitative Aspects by Model Transformation.",
                    "Supporting Flexible Reification of Design Patterns.",
                    "Quality Attributes Assessment for Feature-Based Product Configuration in Software Product Line.",
                    "Approaching Non-functional Properties of Software Product Lines: Learning from Products.",
                    "Supporting Change Propagation in the Maintenance and Evolution of Service-Oriented Architectures.",
                    "Model-Based Methods for Linking Web Service Choreography and Orchestration.",
                    "Aspect Oriented Approach to Building Secure Service Composition.",
                    "Assessing the Impact of Refactoring on Security-Critical Object-Oriented Designs.",
                    "Bridging the Gap between Fault Trees and UML State Machine Diagrams for Safety Analysis.",
                    "Evaluating the Reliability of Web Services Based on BPEL Code Structure Analysis and Run-Time Information Capture.",
                    "Formal Transformation from Sequence Diagrams to Coloured Petri Nets.",
                    "A Formal Framework to Optimise Component Dependency Resolution.",
                    "A Formal Model for Supporting Frameworks of Dynamic Service Update Based on OSGi.",
                    "Lazy Runtime Verification for Constraints on Interacting Objects.",
                    "An Interaction-Pattern-Based Approach to Prevent Performance Degradation of Fault Detection in Service Robot Software.",
                    "Testing Inter-layer and Inter-task Interactions in RTES Applications.",
                    "An Automatic Testing Approach for Compiler Based on Metamorphic Testing Technique.",
                    "Combinatorial Testing with Shielding Parameters.",
                    "A Hierarchical Model for Regression Test Selection and Cost Analysis of Java Programs.",
                    "Evaluating Mutation Testing Alternatives: A Collateral Experiment.",
                    "Customization of Scrum Methodology for Outsourced E-Commerce Projects.",
                    "SCRUM-PSP: Embracing Process Agility and Discipline.",
                    "Towards Tool Support for Situational Engineering of Agile Methodologies.",
                    "The Qualitas Corpus: A Curated Collection of Java Code for Empirical Studies.",
                    "Quantitative Analysis for Non-linear System Performance Data Using Case-Based Reasoning.",
                    "A Systematic Review of Studies of Open Source Software Evolution.",
                    "Detecting Duplicate Bug Report Using Character N-Gram-Based Features.",
                    "Statements versus Predicates in Spectral Bug Localization.",
                    "Sentence-to-Code Traceability Recovery with Domain Ontologies.",
                    "Variants of Risk and Opportunity.",
                    "Software Configuration Management in Global Software Development: A Systematic Map.",
                    "Using Faults-Slip-Through Metric as a Predictor of Fault-Proneness.",
                    "A Software Tag Generation System to Realize Software Traceability.",
                    "Quantitative Analysis of Best Practices Models in the Software Domain.",
                    "A Case Study on Usage of a Software Process Management Tool in China."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16th APSEC 2009",
        "info": "Batu Ferringhi, Penang, Malaysia",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2009",
                "sub_name": "16th Asia-Pacific Software Engineering Conference, APSEC 2009, 1-3 December 2009, Batu Ferringhi, Penang, Malaysia.",
                "count": 63,
                "papers": [
                    "Improving the Accuracy of Software Effort Estimation Based on Multiple Least Square Regression Models by Estimation Error-Based Data Partitioning.",
                    "Hierarchical Understandability Assessment Model for Large-Scale OO System.",
                    "On the Relationship between Different Size Measures in the Software Life Cycle.",
                    "Investigating the Effect of Refactoring on Software Testing Effort.",
                    "Extracting High-Level Functional Design from Software Requirements.",
                    "Identifying Fragments to be Extracted from Long Methods.",
                    "A Graph Based Approach to Detecting Causes of Implied Scenarios under the Asynchronous and Synchronous Communication Styles.",
                    "Extracting Environmental Constraints to Make Reactive System Specifications Realizable.",
                    "Monitoring Composite Services with Universal Modal Sequence Diagrams.",
                    "Critical Barriers for Offshore Software Development Outsourcing Vendors: A Systematic Literature Review.",
                    "Re-defining the Requirements Engineering Process Improvement Model.",
                    "Insights into Domain Knowledge Sharing in Software Development Practice in SMEs.",
                    "The Context Dynamics Matrix (CDM): An Approach to Modeling Context.",
                    "An Empirical Study of Software Architects' Concerns.",
                    "Attribute-Based Architecture Patterns for Lightweight Service-Oriented Architectures.",
                    "Tool Support for Component-Based Software Architectures.",
                    "Web Services Composition by I/O Data Structure Correspondences.",
                    "Search-Based Testing Guidance Using Dominances vs. Control Dependencies.",
                    "Analysis of the OLSR Protocol by Using Formal Passive Testing.",
                    "Variable Strength Interaction Testing with an Ant Colony System Approach.",
                    "Spectral Debugging with Weights and Incremental Ranking.",
                    "Improve Analogy-Based Software Effort Estimation Using Principal Components Analysis and Correlation Weighting.",
                    "Investigating the Effect of Pair Programming and Software Size on Software Quality and Programmer Productivity.",
                    "Describing Pattern Languages for Checking Design Models.",
                    "An Efficient Context-Based User Interface by Exploiting Temporality of Attributes.",
                    "Aspect Oriented Programming Made Easy: An Embedded Pointcut Language.",
                    "Composition Analysis of Multiple Aspects in Aspect-Oriented Programs.",
                    "Elicit the Requirements on Software Dependability: A Knowledge-Based Approach.",
                    "Modeling Access Control Requirements in Feature Model.",
                    "Performing Projection in Problem Frames Using Scenarios.",
                    "A Light-Weight Formal Approach for Modeling, Verifying and Integrating Role-Based Access Control Requirements.",
                    "Contribution-Based Call Stack Abstraction and Its Application in Pointer Analysis of AspectJ Programs.",
                    "Program Sifting: Select Property-Related Functions for Language-Based Static Analysis.",
                    "Avoiding Some Common Preprocessing Pitfalls with Feature Queries.",
                    "Sequence Diagram Slicing.",
                    "Test Coverage Metric for Two-Staged Language with Abstract Interpretation.",
                    "Analysis of Problems in Testing Practices.",
                    "Unit Testing Approaches for BPEL: A Systematic Review.",
                    "Scheduling Test Execution of WBEM Applications.",
                    "Incomplete Software Requirements and Assumptions Made by Software Engineers.",
                    "Requirements Identification and Representation in Software Product Line.",
                    "Propagating Requirement Change into Software High Level Designs towards Resilient Software Evolution.",
                    "Model-Driven Automatic Generation of Verified BPEL Code for Web Service Composition.",
                    "Problematic Code Clones Identification Using Multiple Detection Results.",
                    "Code Clone Graph Metrics for Detecting Diffused Code Clones.",
                    "Assessing and Estimating Corrective, Enhancive, and Reductive Maintenance Tasks: A Controlled Experiment.",
                    "Identifying Stagnation Periods in Software Evolution by Replaying Editing Operations.",
                    "Fault Localization Based on Multi-level Similarity of Execution Traces.",
                    "Directed Test Suite Augmentation.",
                    "Checking Model Consistency Using Data-Flow Testing.",
                    "An Effective Path Selection Strategy for Mutation Testing.",
                    "Investigating the State of User Involvement in Practice.",
                    "Extracting Development Organization from Open Source Software.",
                    "Project Management Using Risk Identification Architecture Pattern (RIAP) Model: A Case Study on a Web-Based Application.",
                    "Risk Identification and Mitigation Processes for Using Scrum in Global Software Development: A Conceptual Framework.",
                    "An Automatic Compliance Checking Approach for Software Processes.",
                    "A Push for Software Process Improvement in Thailand.",
                    "Applying a Systematic Approach to Link Requirements and Testing: A Case Study.",
                    "A Formal Framework to Integrate Timed Security Rules within a TEFSM-Based System Specification.",
                    "Towards Automated Verification of Distributed Consensus Protocols.",
                    "A Method for Modeling and Analyzing Fault-Tolerant Service Composition.",
                    "Modular Checking of C Programs Using SAT-Based Bounded Model Checker.",
                    "Selecting Usability Evaluation Methods for Software Process Descriptions."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15th APSEC 2008",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2008",
                "sub_name": "15th Asia-Pacific Software Engineering Conference (APSEC 2008), 3-5 December 2008, Beijing, China.",
                "count": 68,
                "papers": [
                    "Using Abstraction to Verify Arbitrary Temporal Properties.",
                    "Beyond Agile: Smart.",
                    "Service Refinement.",
                    "Early Filtering of Polluting Method Calls for Mining Temporal Specifications.",
                    "DRACULA: Detector of Data Races in Signals Handlers.",
                    "Detection of Diverse Design Pattern Variants.",
                    "An Empirical Study of Unused Design Decisions in Open Source Java Software.",
                    "A Dynamic Model of Software Product Generative Process.",
                    "A Case Retrieval Method for Knowledge-Based Software Process Tailoring Using Structural Similarity.",
                    "Software Process Simulation Modeling: Facts, Trends and Directions.",
                    "An Investigation on Performance of Software Enhancement Projects in China.",
                    "A Nonlinear Approach to Modeling of Software Aging in a Web Server.",
                    "Towards Unanticipated Runtime Adaptation of Java Applications.",
                    "Correctness of Request Executions in Online Updates of Concurrent Object Oriented Programs.",
                    "Risks and Risk Management in Software Architecture Evolution: An Industrial Survey.",
                    "A Technique to Check the Implementability of Behavioral Specifications with Frameworks.",
                    "Execution Semantics for rCOS.",
                    "A Heap Model for Java Bytecode to Support Separation Logic.",
                    "Flexible Generation of Pervasive Web Services Using OSGi Declarative Services and OWL Ontologies.",
                    "Jata: A Language for Distributed Component Testing.",
                    "Specification-Based Approach to Select Regression Test Suite to Validate Changed Software.",
                    "A Novel Optimum Data Duplication Approach for Soft Error Detection.",
                    "Providing the Guideline of Determining Quality Checklists Priorities Based on Evaluation Records of Software Products.",
                    "SimPL A Simple Software Production Line for End User Development.",
                    "Measuring Non-Functional Properties in Software Product Line for Product Derivation.",
                    "Scheduling Product Line Features for Effective Roadmapping.",
                    "AORE (Aspect-Oriented Requirements Engineering) Methodology for Automotive Software Product Lines.",
                    "Documenting and Evaluating Scattered Concerns for Framework Usability: A Case Study.",
                    "Inferring Specifications of Object Oriented APIs from API Source Code.",
                    "A Comparison of the Reliability Growth of Open Source and In-House Software.",
                    "A Source-Code Based Extraction Way for Micro Processes Influencing Software Complexity.",
                    "Mining Individual Performance Indicators in Collaborative Development Using Software Repositories.",
                    "Towards Analysing Information Management Requirements in New Zealand Genetic Services.",
                    "Modeling and Analysis of WS-BPEL Business Processes Based on ServiceNet.",
                    "Emergent Properties in Reactive Systems.",
                    "Detection of a Set of States in Distributed Systems.",
                    "A Measurement-Driven Process Model for Managing Inconsistent Software Requirements.",
                    "Behavioral Specification of Real-Time Requirements.",
                    "Jackson's JSP-Like Method for State Transition Design.",
                    "Software Engineering Education Toolkit for Embedded Software Architecture Design Methodology Using Robotic Systems.",
                    "Investigating Pair Programming in a Software Engineering Course in an Asian Setting.",
                    "Extending PSC for Monitoring the Timed Properties in Composite Services.",
                    "Formalization and Consistency Checking of Changes of Software System Configurations Using Alloy.",
                    "Modeling and Verifying Web Browser Interactions.",
                    "Deadlock-Detection in Java-Library Using Static-Analysis.",
                    "Iterative Model Fixing with Counterexamples.",
                    "Model Checking Process with Goal Oriented Requirements Analysis.",
                    "A Verification Framework for FBD Based Software in Nuclear Power Plants.",
                    "Resource-Oriented Architecture for Business Processes.",
                    "A Design Quality Model for Service-Oriented Architecture.",
                    "SA@Work A Field Study of Software Architecture and Software Quality at Work.",
                    "Service Identification Using Goal and Scenario in Service Oriented Architecture.",
                    "Using ES Based Automated Software Clustering Approach to Achieve Consistent Decompositions.",
                    "Component-Based Software Update Process in Collaborative Software Development.",
                    "Security-Aware Refactoring Alerting its Impact on Code Vulnerabilities.",
                    "Detecting Occurrences of Refactoring with Heuristic Search.",
                    "G2Way A Backtracking Strategy for Pairwise Test Data Generation.",
                    "Test Case Prioritization Based on Analysis of Program Structure.",
                    "Modular Conformance Testing and Assume-Guarantee Verification for Evolving Component-Based Software.",
                    "Early Estimate the Size of Test Suites from Use Cases.",
                    "Theoretical Maximum Prediction Accuracy for Analogy-Based Software Cost Estimation.",
                    "The Use of a Meta-Model to Support Multi-Project Process Measurement.",
                    "A Complexity Metric for Web Applications Based on the Entropy Theory.",
                    "Automated Support for Software Cost Estimation Using Web-CoBRA.",
                    "Aspect-Oriented Programming for Web Controller Layer.",
                    "Flexible Aspect-Oriented Design Model Checking.",
                    "Management of Composites in Software Engineering Environments.",
                    "Domain Specific Engineering Environments."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14th APSEC 2007",
        "info": "Nagoya, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2007",
                "sub_name": "14th Asia-Pacific Software Engineering Conference (APSEC 2007), 5-7 December 2007, Nagoya, Japan.",
                "count": 92,
                "papers": [
                    "Specialising in Software Engineering.",
                    "Evaluating Product Line Architectures: Methods and Techniques.",
                    "The Problem Frames Approach to Software Engineering.",
                    "Aligning the Map Requirements Modelling with the B-method for Formal Software Development.",
                    "Extraction of Viewpoints for Eliciting Customer's Requirements based on Analysis of Specification Change Records.",
                    "A Methodological Framework for SysML: a Problem Frames-based Approach.",
                    "Using Genetic Algorithms to Aid Test-Data Generation for Data-Flow Coverage.",
                    "Finding a Test Order using Object-Oriented Slicing Technique.",
                    "Function Call Flow based Fitness Function Design in Evolutionary Testing.",
                    "Secure Behavior of Web Browsers to Prevent Information Leakages.",
                    "Realizability of Collaboration-based Service Specifications.",
                    "The Validation and Verification of WSCDL.",
                    "Figure Out the Current Software Requirements Engineering - What Practitioners Expect to Requirements Engineering? -.",
                    "A Method for Early Requirements Triage and Selection Utilizing Product Strategies.",
                    "Pseudo Software: a New Concept for Iterative Requirement Development and Validation.",
                    "Enterprise Assets Security Requirements Construction from ESRMG Grammar based on Security Patterns.",
                    "Construction Method of a High-Order Markov Chain Usage Model.",
                    "Static Call Graph Generator for C++ using Debugging Information.",
                    "Improving Data Integrity with a Java Mutability Analysis.",
                    "Field Escape Analysis for Data Confidentiality in Java Components.",
                    "Coordination-Policy Based Composed System Behavior Derivation.",
                    "Approximation Algorithms for Software Component Selection Problem.",
                    "Towards Instant Automatic Model Refinement Based on OCL.",
                    "Modeling and Learning Interaction-based Accidents for Safety-Critical Software Systems.",
                    "Conformance Checking of Running Programs in Dynamic Aspect-Oriented Systems.",
                    "Toward Efficient Aspect Mining for Linux.",
                    "Using B to Verify the Weaving of Aspects.",
                    "E-AoSAS++ and its Software Development Environment.",
                    "Visualization for Software Evolution Based on Logical Coupling and Module Coupling.",
                    "Optimising Project Feature Weights for Analogy-Based Software Cost Estimation using the Mantel Correlation.",
                    "Are Size Measures Better Than Expert Judgment? An Industrial Case Study on Requirements Volatility.",
                    "An Empirical Study of Class Sizes for Large Java Systems.",
                    "A Middleware-based Approach to Model Refactoring at Runtime.",
                    "Applying a Code Clone Detection Method to Domain Analysis of Device Drivers.",
                    "Simultaneous Modification Support based on Code Clone Analysis.",
                    "Incentive Compatible Mechanisms for Group Ticket Allocation in Software Maintenance Services.",
                    "Statechart-based Verification of Object-Oriented Design Models.",
                    "Compositional Verification of UML Dynamic Models.",
                    "Requirements Engineering for Reactive Systems: Coloured Petri Nets for an Elevator Controller.",
                    "An Executable UML with OCL-based Action Semantics Language.",
                    "Injecting security as aspectable NFR into Software Architecture.",
                    "An Investigation into Concurrency Control Mechanisms in Data Service Layers.",
                    "Enhancing the ESIM (Embedded Systems Improving Method) by Combining Information Flow Diagram with Analysis Matrix for Efficient Analysis of Unexpected Obstacles in Embedded Software.",
                    "Developing an Insulin Pump System Using the SOFL Method.",
                    "Aspect-Oriented Modeling for Embedded Software Design.",
                    "Automatic Extraction and Verification of Page Transitions in aWeb Application.",
                    "Disk Based Software Verification via Bounded Model Checking.",
                    "A Synchronization Flow Analysis of Concurrent Objects in AIBO OPEN-R Programs Based on Communicating Processes.",
                    "A Process Pattern Language for Agile Methods.",
                    "Deriving Software Process Simulation Model from SPEM-based Software Process Model.",
                    "Definition of an Executable SPEM 2.0.",
                    "Experiment-Driven Approach to Building Support for Distributed Agile Teams.",
                    "An Approach to Probabilistic Effort Estimation for Military Avionics Software Maintenance by Considering Structural Characteristics.",
                    "A Large-Scale Empirical Comparison of Object-Oriented Cohesion Metrics.",
                    "An Approach for Specifying Access Control Policy in J2EE Applications.",
                    "Early Validation and Verification of a Distributed Role-Based Access Control Model.",
                    "Reducing Unnecessary Conservativeness in Access Rights Analysis with String Analysis.",
                    "A Six Sigma Framework for Software Process Improvements and its Implementation.",
                    "Methodology Support for the Model Driven Architecture.",
                    "Use of Agile Methods and Practices in the Philippines.",
                    "A Survey on the Business Relationship between Chinese Outsourcing Software Suppliers and Their Outsourcers.",
                    "Identifying Key Requirements for a New Product Line.",
                    "Tailoring the Domain Engineering Process of the PLUS Method.",
                    "Deriving Product Line Requirements: the RED-PL Guidance Approach.",
                    "ezContract: Using Marker Library and Bytecode Instrumentation to Support Design by Contract in Java.",
                    "MKtrace: An Innovative Debugging Tool for Multi-Threaded Programs on Multiprocessor Systems.",
                    "Checking Distributed Programs with Partially Ordered Atoms.",
                    "Quantitative Analysis of Value-Based Software Processes Using Decision-Based Stochastic Object Petri-Nets.",
                    "Improving Effort Estimation Accuracy by Weighted Grey Relational Analysis During Software Development.",
                    "A Novel Approach of Prioritizing Use Case Scenarios.",
                    "Accountability and Traceability in Global Software Engineering (ATGSE2007).",
                    "The First International Workshop on Management and Economics of Software Product Lines (MESPUL07).",
                    "1st International Workshop on Software Patterns and Quality (SPAQu'07).",
                    "Workshop on Service Oriented Architecture.",
                    "Education Workshop: Bridging the University/Industry Gap.",
                    "SPACE 2007 - 1st International Workshop on Software Productivity Analysis and Cost Estimation.",
                    "\"Robust and Flexible Software Inspection model\" for Software Re-Engineering Process: Abstraction phase.",
                    "Architectural Naming, a Secret of Agile Thinking.",
                    "Time-Quality Metric Model for Quality Measurement of Web-Based Systems.",
                    "Analyzing the Service Level of Software Debugging System through Simulation-based Queuing Approach.",
                    "Distributed Collaborative Modeling Support System for UML diagrams.",
                    "The TASM Language and the Hi-Five Framework: Specification, Validation, and Verification of Embedded Real-Time Systems.",
                    "UCSI Towards a User-Centric Service Integration Approach.",
                    "Formal Model-Driven Engineering of Distributed Simulation Systems based on Architecture-Centric Domain-Specific Approach.",
                    "DFTL: a Description Language for Transformation of Data Formats.",
                    "Email and Trouble Report Analysis for Revealing Context with the Project Replayer.",
                    "PORD: a Reversible Debugging Tool using Dynamic Binary Translation.",
                    "Non-Functional Requirements Elicitation and Incorporation into Functional Models.",
                    "Validating Software Reliability by Binary Translation.",
                    "Project Management Practices on Building Management Information System in IBM Global Business Service.",
                    "MEtaGile: An Agile Domain-Specific Modeling Environment.",
                    "Analysis of the Factors of Influencing Parent's Confidence on the Internet by Associating Rules Mining."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13th APSEC 2006",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2006",
                "sub_name": "13th Asia-Pacific Software Engineering Conference (APSEC 2006), 6-8 December 2006, Bangalore, India.",
                "count": 58,
                "papers": [
                    "Secrobat: Secure and Robust Component-based Architectures.",
                    "A precise estimation technique for test coverage of components in object-oriented frameworks.",
                    "An Approach Based on Modeling Dynamic Behavior of the System to Assess the Impact of COTS Upgrades.",
                    "Component composition through architectural patterns for problem frames.",
                    "Component-based Development of MILLS: A Case Study in the development of an Inter-library Loan Software System.",
                    "Adopting Model-Driven Development for Integrated Services and Appliances in Home Network Systems.",
                    "Efficient Component Based Software Engineering using the TCEM Methodology and the TCET Tool.",
                    "Toward a Code Search Engine Based on the State-of-Art and Practice.",
                    "Security-Oriented Service Composition and Evolution.",
                    "A Coupling-based Complexity Metric for Remote Component-based Software Systems Toward Maintainability Estimation.",
                    "A Formal Framework for Component Pr otocols Behavioural Compatibility.",
                    "A Portable Interceptor Mechanism on SOAP for Continuous Audit.",
                    "A Practical Estimation Method for Complex RE.",
                    "Software Requirements Retrieval Using Use Case Terms and Structure Similarity Computation.",
                    "Goal Oriented Requirement Engineering: A Critical Study of Techniques.",
                    "Integrating Stateful Services in Workflow.",
                    "Value-Based Dynamic Composition of Web Services.",
                    "A Comparative Study of Interface Design Approaches for Service-Oriented Software.",
                    "Using Operational Architecture to Model Embedded Software.",
                    "A Method for Detecting and Measuring Architectural Layering Violations in Source Code.",
                    "Towards a Model-driven Approach to Develop Applications based on Physical Active Objects.",
                    "A systematic approach to connecting standalone theorem provers to formal development environments.",
                    "Constructing Behavioral State Machine using Interface Protocol Specification.",
                    "Timing Verification of UML Activity Diagram Based Code Block Level Models for Real Time Multiprocessor System-on-Chip Applications.",
                    "Modeling and Customization of Fault Tolerant Architecture using Object-Z/XVCL.",
                    "A Pattern based Model Evolution Approach.",
                    "Safety Analysis for Dynamic Update of Object Oriented Programs.",
                    "Strengthening Method Contracts for Objects.",
                    "Testing of Timer Function Blocks in FBD.",
                    "Generating interoperability tests for networked media devices.",
                    "Interaction Testing in Model-Based Development: Effect on Model-Coverage.",
                    "Detecting Duplications in Sequence Diagrams Based on Suffix Trees.",
                    "Towards Interactive Fault Localization Using Test Information.",
                    "A framework for software product engineering.",
                    "Genericity - a \"Missing in Action\" Key to Software Simplification and Reuse.",
                    "An Empirical Study of Factors and their Relationships in Outsourced Software Maintenance.",
                    "An Accurate and Convenient Undo Mechanism for Refactorings.",
                    "Efficient and Accurate Software Pattern Detection.",
                    "Evaluation of Source Code Updates in Software Development Based on Component Rank.",
                    "An Experience With Design by Contract.",
                    "Usage Patterns of the Java Standard API.",
                    "A case study of an empirical approach to component requirements in developing a plagiarism detection tool.",
                    "Building Scalable Failure-proneness Models Using Complexity Metrics for Large Scale Software Systems.",
                    "An Approach of a Technique for Effort Estimation of Iterations in Software Projects.",
                    "Cycle Time Reduction.",
                    "A Process Model Design and Tool Development for Supplier Agreement Management of CMMI: Capability Level 2.",
                    "A Theoretical Perspective on Knowledge Based Organizational Learning.",
                    "A Systematic Approach to Process Enactment Analysis as Input to Software Process Improvement or Tailoring.",
                    "Inter-Model Consistency in UML Based on CPN Formalism.",
                    "Introducing MDA in a large IT consultancy organization.",
                    "Applying Formal Approach to Core Asset Instantiation in Product Line Engineering.",
                    "A Versioning Scheme for Consistent Evolution of OO Applications.",
                    "A Knowledge-based Approach for Safety Analysis Using System Interactions.",
                    "Project Replayer with Email Analysis - Revealing Contexts in Software Development.",
                    "Cohesion Analysis in Linux Kernel.",
                    "Visualizing Clone Cohesion and Coupling.",
                    "Implementation and Evaluation of Teaching an Introductory Software Engineering Course Framed in Cognitive Apprenticeship.",
                    "Security: Bridging the Academia-Industry Gap Using a Case Study."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12th APSEC 2005",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2005",
                "sub_name": "12th Asia-Pacific Software Engineering Conference (APSEC 2005), 15-17 December 2005, Taipei, Taiwan.",
                "count": 106,
                "papers": [
                    "Conference Chairs' Message.",
                    "Program Chairs' Message.",
                    "Steering Committee.",
                    "Program Committee.",
                    "Goal-Oriented Requirements Engineering.",
                    "The Essential Components of Software Architecture Design and Analysis.",
                    "Vision, Strategy, and Practice of Software Research & Development in Industry.",
                    "AD2US: An Automated Approach to Generating Usage Scenarios from UML Activity Diagrams.",
                    "Systematic Use Case Interviews for Specification of Automotive Systems.",
                    "Enhancement of a Use Cases based Requirements Engineering approach with Scenarios.",
                    "Accommodating Software Development Collaboration.",
                    "A Temporal Logic for Input Output Symbolic Transition Systems.",
                    "Model Checking Interrupt-Dependent Software.",
                    "A Lightweight Integration of Theorem Proving and Model Checking for System Verification.",
                    "Model Checking Class Specifications forWeb Applications.",
                    "Model-Driven Semantic Web Service Composition.",
                    "Client Profiling for QoS-Based Web Service Recommendation.",
                    "A Framework for Application Server Based Web Services Management.",
                    "On Simulation of BPEL4WS/UML Descriptions.",
                    "Integrating an Idea Generation Method into a Goal-Oriented Analysis Method for Requirements Elicitation.",
                    "An Incremental Analysis to Workflow Specifications.",
                    "Role and Owner based Business Domain Analysis.",
                    "Race-free Scenarios of Message Sequence Charts.",
                    "An Alternative Approach to Handling Nondeterminism in Model-Oriented Data-Refinement.",
                    "Analysis of the Suzuki-Kasami Algorithm with the Maude Model Checker.",
                    "Supporting Predictive Change Impact Analysis: A Control Call Graph Based Technique.",
                    "Improvements Towards Formalizing UML State Diagrams in CSP.",
                    "An Approach to Ensure Service Behavior Consistency in OSGi.",
                    "Agile Development of Web Application by Supporting Process Execution and Extended UML Model.",
                    "Feature Analysis for Service-Oriented Reengineering.",
                    "Recommendation of Software Technologies Based on Collaborative Filtering.",
                    "A Service-Oriented Architecture for Design and Development of Middleware.",
                    "A Loose Interaction Pattern for Asynchronous Components.",
                    "Developing Object Oriented Designs from Component and Connector Architectures.",
                    "Ad Hoc System : a Software Architecture for Ubiquitous Environment.",
                    "An Industrial Case Study on Requirements Volatility Measures.",
                    "A Qualitative Method for Measuring the Structural Complexity of Software Systems Based on Complex Networks.",
                    "Metrics for Analyzing Module Interactions in Large Software Systems.",
                    "On Traceability for Safety Critical Systems Engineering.",
                    "A Formal Semantics of Timed Activity Diagrams and its PROMELA Translation.",
                    "Call-Ordering Constraints.",
                    "A Minimum Proportional Time Redundancy based Checkpoint Selection Strategy for Dynamic Verification of Fixed-time Constraints in Grid Workflow Systems.",
                    "A Bipartite Graph Approach to Generate Optimal Test Sequences for Protocol Conformance Testing using the Wp-method.",
                    "Bio-ontology Construction Using Object-oriented Paradigm.",
                    "Transforming Functional Signatures of Algebraic Specifications Into Object-Oriented Class Signatures.",
                    "An Easy-to-Use Extension Mechanism Using XML for an Integrated Development Environment.",
                    "Computation of Dynamic Slices for Object-Oriented Concurrent Programs.",
                    "On Archiving Architecture Documents.",
                    "Exception Handling: An Architecture Model and Utility Support.",
                    "Architectural Style - Based Modeling and Simulation of Complex Software Systems.",
                    "An Approach to Validation of Software Architecture Model.",
                    "Using Adaptive Agents to Automatically Generate Test Scenarios from the UML Activity Diagrams.",
                    "Dealing with Non-Determinism in Testing Concurrent Java Components.",
                    "An Approach for Test Suite Selection to Validate Applications on Deployment of COTS Upgrades.",
                    "Simulation-based Validation and Defect Localization for Evolving, Semi-Formal Requirements Models.",
                    "Increasing the Efficiency of Fault Detection in Modified Code.",
                    "Integrating Generalized Weibull-type Testing-Effort Function and Multiple Change-Points into Software Reliability Growth Models.",
                    "Identifying Error Proneness in Path Strata with Genetic Algorithms.",
                    "An Analysis Method with Failure Scenario Matrix for Specifying Unexpected Obstacles in Embedded Systems.",
                    "Conformance Testing of BDI Properties in Agent-based Software Systems.",
                    "A Tools Environment for Developing and Reasoning about Ontologies.",
                    "User Intention Satisfaction for Agent-Based Semantic Web Services Systems.",
                    "Ontology-based Active Requirements Engineering Framework.",
                    "A Systematic Method for Scoping Core Assets in Product Line Engineering.",
                    "An Extension of Problem Frame Notation for Software Product Lines.",
                    "Supporting Product Line Development through Traceability.",
                    "A Repository Framework for Self-Growing Robot Software.",
                    "Evolutionary Testing of Unstructured Programs in the Presence of Flag Problems.",
                    "Proposal of a Method to Support Testing for Java Programs with UML.",
                    "Data Abstraction and Constraint Solving for Conformance Testing.",
                    "Describing and Verifying Integrated Services of Home Network Systems.",
                    "A Passive Test Oracle Using a Component's API.",
                    "A Dynamic Optimization Strategy for Evolutionary Testing.",
                    "An Integrated Solution for Testing and Analyzing Java Applications in an Industrial Setting.",
                    "A Parametric Model Checking Approach for Real-Time Systems Design.",
                    "Consistency and Interoperability Checking for Component Interaction Rules.",
                    "An Incremental and Practical Approach to Enable the Component Run-time Evolution.",
                    "Regression Testing for Component-based Software Systems by Enhancing Change Information.",
                    "Early Stage Software Reliability and Design Assessment.",
                    "Integrating Safety and Security Requirements into Design of an Embedded System.",
                    "Monitoring with Behavior View Diagrams for Debugging.",
                    "Automatic Classification of Web Pages based on the Concept of Domain Ontology.",
                    "ADDIE Instruction Design and Cognitive Apprenticeship for Project-based Software Engineering Education in MIS.",
                    "Lightweight Detection of Program Refactorings.",
                    "Automated Refactoring of Objects for Application Partitioning.",
                    "Development of a Business Process Modeling Methodology and a Tool for Sharing Business Processes.",
                    "Personal Software Process (PSP) Assistant.",
                    "A Tool for Constructing Syntax-Directed Editors.",
                    "A User Evaluation of Synchronous Collaborative Software Engineering Tools.",
                    "Tool Support for Invariant Based Programming.",
                    "Tool Support for Statistical Testing of Software Components.",
                    "Microcomponent-Based Component Controllers: A Foundation for Component Aspects.",
                    "AECM: an Aspect Enabled Component Model.",
                    "Aspect-Oriented Modularization of Assertion Crosscutting Objects.",
                    "Improving Agile Software Development using eXtreme AOCE and Aspect-Oriented CVS.",
                    "Towards Aspect-Oriented Class Diagrams.",
                    "Providing Quality Measurement for Aspect-Oriented Software Development.",
                    "A Survey on Early Separation of Concerns.",
                    "Using Dynamic Aspects for Delegating Fine-Grained Access Rights.",
                    "Bugdel: An Aspect-Oriented Debugging System.",
                    "Aspect Refinement and Bounding Quantification in Incremental Designs.",
                    "Dimensions and Forms of Knowledge Collaboration in Software Development.",
                    "Please STeP_IN: A Socio-Technical Platform for in situ Networking.",
                    "CoxR: Open Source Development History Search System.",
                    "Understanding the Nature of Collaboration in Open-Source Software Development.",
                    "Supporting Knowledge Collaboration Using Social Networks in a Large-Scale Online Community of Software Development Projects."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11th APSEC 2004",
        "info": "Busan, Kora",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2004",
                "sub_name": "11th Asia-Pacific Software Engineering Conference (APSEC 2004), 30 November - 3 December 2004, Busan, Korea.",
                "count": 99,
                "papers": [
                    "Quality Attribute Scenario Based Architectural Modeling for Self-Adaptation Supported by Architecture-Based Reflective Middleware.",
                    "An Empirical Evaluation of Architectural Alternatives for J2EE and Web Services.",
                    "Extending a Graphic Modeling Language to Support Partial and Evolutionary Specification.",
                    "Dynamic Verification of Temporal Constraints on-the-fly for Workflow Systems.",
                    "An Improved Repository System for Effective and Efficient Reuse of Formal Verification Efforts.",
                    "Reasoning about Semantic Web in Isabelle/HOL.",
                    "Project Management Capability Levels: An Empirical Study.",
                    "Quality Improvements by Integrating Development Processes.",
                    "The Design of Evolutionary Process Modeling Languages.",
                    "How to Have a Successful Free Software Project.",
                    "A Systematic Method to Instantiate Core Assets in Product Line Engineering.",
                    "Tool Supported Development of Service-Based Systems.",
                    "An Infinite Server Queueing Approach for Describing Software Reliability Growth - Unified Modeling and Estimation Framework.",
                    "A Taxonomy of Call Ordering Problems.",
                    "A Case Study in Specification and Implementation Testing.",
                    "Modeling the Impact of a Learning Phase on the Business Value of a Pair Programming Project.",
                    "An Integrated Model of ISO 9001: 2000 and CMMI for ISO Registered Organizations.",
                    "Tool and Guidelines Support for Capability Maturity Model's Software Subcontract Management.",
                    "A Method and Tool Support for Variant Requirements Analysis: Goal and Scenario Based Approach.",
                    "Experiences Adopting Software Product Line Development without a Product Line Architecture.",
                    "MUDABlue: An Automatic Categorization System for Open Source Repositories.",
                    "Incubating Services in Legacy Systems for Architectural Migration.",
                    "Automatic Detecting Code Cooperation.",
                    "Flexible Fine-grained Version Control for Software Documents.",
                    "An Exploratory Study of Groupware Support for Distributed Software Architecture Evaluation Process.",
                    "Towards Synchronous Collaborative Software Engineering.",
                    "A Dual-Mode Exerciser for a Collaborative Computing Environment.",
                    "UML CASE Tool Supporting OLE Compound Document.",
                    "Using Integrated Metamodeling to Define OO Design Patterns with Object-Z and UML.",
                    "A Systematic Study of UML Class Diagram Constituents for their Abstract and Precise Recovery.",
                    "An Approach to Detecting Domain Errors Using Formal Specification-Based Testing.",
                    "Generating Test Cases from UML Activity Diagram based on Gray-Box Method.",
                    "Adaptive Random Testing by Localization.",
                    "Computing Optimal Scheduling Policies for Software Projects.",
                    "Assigning Tasks in a 24-Hour Software Development Model.",
                    "A Project Management Support Tool using Communication for Agile Software Development.",
                    "Accurate Call Graph Extraction of Programs with Function Pointers Using Type Signatures.",
                    "Binary-Level Lightweight Data Integration to Develop Program Understanding Tools for Embedded Software in C.",
                    "Performing High Efficiency Source Code Static Analysis with Intelligent Extensions.",
                    "Property-Oriented Testing of Real-Time Systems.",
                    "An Execution Slice and Inter-Block Data Dependency-Based Approach for Fault Localization.",
                    "JAOUT: Automated Generation of Aspect-Oriented Unit Test.",
                    "Design of an Automatic Annotation Framework for Corporate Web Content.",
                    "A Nested Invocation Suppression Mechanism for Cctive Replicated SOAP Systems.",
                    "Requirements Engineering Practice in Pharmaceutical and Healthcare Manufacturing.",
                    "Requirements Engineering for e-Business Systems: Integrating Jackson Problem Diagrams with Goal Modeling and BPM.",
                    "Weaving Multiple Viewpoint Specifications in Goal Oriented Requirements Analysis.",
                    "Embedded Program Testing in Untestable Mobile Environment: Embedded Program Testing in Untestable Mobile Environment.",
                    "Testing Java Interrupts and Timed Waits.",
                    "Constructing a Usage Model for Statistical Testing with Source Code Generation Methods.",
                    "An Agent Design Pattern Classification Scheme: Capturing the Notions of Agency in Agent Design Patterns.",
                    "Scenario Mechanism in Agent-Oriented Programming.",
                    "Dynamic Community: A New Conceptual Framework for Supporting Knowledge Collaboration in Software Development.",
                    "Use Case Refactoring: A Tool and a Case Study.",
                    "A Transformation Method of Scenarios from Different Viewpoints.",
                    "Requirements Engineering Pattern Structure.",
                    "Empirical Evaluation of Orthogonality of Class Mutation Operators.",
                    "Using Hypergraph as Modeling Language for Generating Test Cases On Demand.",
                    "Systematic Operational Profile Development for Software Components.",
                    "A Systematic Method to Identify Software Components.",
                    "Modeling COTS-Based Development and Related Selection Methods Processes with MAP.",
                    "Relationship between PLS-Dependent Organizations and PLSE-Capable Software Houses.",
                    "Reusable Formal Specification for Embedded Systems.",
                    "Product Line Based Component Unification and Exploiting Unified Components in FORM.",
                    "A PLSE Environment in 80s - International Workshop on Adopting Product Line Software Engineering.",
                    "What Should Software Practitioners Know for Adopting Product Line Software Engineering?.",
                    "Software Product Line and Open Source Software.",
                    "Problems and Suggestion for Adopting Product Line Software Engineering from Modification Style Development.",
                    "Change Control for Product Line Software Engineering.",
                    "Scenarios, Quality Attributes, and Patterns: Capturing and Using their Synergistic Relationships for Product Line Architectures.",
                    "Feature Modeling from Holistic Viewpoints in Product Line Engineering.",
                    "A Step by Step Approach for Adopting PLSE.",
                    "Feature-Oriented Analysis and Aspect-Oriented Product Line Assets Development.",
                    "Goal and Scenario Driven Product Line Development.",
                    "An Approach To Developing Core Assets in Product Line.",
                    "Issues on Adopting Software Product Line.",
                    "JCMP: Linking Architecture with Component Building.",
                    "Comparison of Scenario-Based Software Architecture Evaluation Methods.",
                    "Handling Nonfunctional and Conflicting Requirements with Design Patterns.",
                    "Partitioning of Java Applications to Support Dynamic Updates.",
                    "Monitored Software Components - A Novel Software Engineering Approach.",
                    "Partial Bindings of Components - Any Harm?.",
                    "A Comparative Analysis of Architecture Frameworks.",
                    "An Architecture Model for Dynamically Converting Components into Web Services.",
                    "A Software Framework for Component-Based Embedded Applications.",
                    "Architecture Modeling Language based on UML2.0.",
                    "An Architectural Model to Support Adaptive Software Systems for Sensor Networks.",
                    "Analysing Reusability Aspects in Java Connector Architecture.",
                    "An Embedded Software Approach for the Development of SIP-Based VoIP Server.",
                    "Top-Down Approach Toward Building Ubiquitous Sensor Network Applications.",
                    "Implementation-Based Approach for Designing Practical Sensor Network Systems.",
                    "A Network Oriented Simple Device and its Application in a Service Mobility Environment.",
                    "Context-sensitive Content Representation for Static Document.",
                    "Agent-Based Web Services Evolution for Pervasive Computing.",
                    "MDC-Based Grey-Box Component Modeling and Prediction Analysis.",
                    "Towards Situation-Aware Cross-Platform Ubi-Game Development.",
                    "Dynamic Enclose Cell Routing in Mobile Sensor Networks.",
                    "SA-RFID: Situation-Aware RFID Architecture Analysis in Ubiquitous Computing.",
                    "Self Adaptive Software Technology for Robotics."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10th APSEC 2003",
        "info": "Chiang Mai, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2003",
                "sub_name": "10th Asia-Pacific Software Engineering Conference (APSEC 2003), 10-12 December 2003, Chiang Mai, Thailand.",
                "count": 61,
                "papers": [
                    "Science of Software Changes.",
                    "Blueprint for Real Progress in Software Engineering.",
                    "Is There a Happy Marriage between Software Engineering and Knowledge Engineering?",
                    "Matching Software Practitioner Needs to Researcher Activities.",
                    "PAORE: Package Oriented Requirements Elicitation.",
                    "Generalising the Z Schema Calculus: Database Schemas and Beyond.",
                    "An Analysis of Backward Simulation Data-Refinement for Partial Relation Semantics.",
                    "Academia and industry meet: Some experiences of formal methods in practice.",
                    "Discovering Use Cases from Source Code using the Branch-Reserving Call Graph.",
                    "Understanding How the Requirements Are Implemented in Source Code.",
                    "Regression Test Selection Based on Version Changes of Components.",
                    "Towards a Sound Modular Model Checking of Collaboration-Based Software Designs.",
                    "Controllability Mechanism for Object-Oriented Software Testing.",
                    "Generating Test Oracle for Role Binding in Multi-Agent Systems.",
                    "An XVCL Approach to Handling Variants: A KWIC Product Line Example.",
                    "A Domain Analysis Method for Software Product Lines Based on Scenarios, Goals and Features.",
                    "Facilitating Reuse of Software Components using Repository Technology.",
                    "Developing Relational Navigation to Effectively Understand Software.",
                    "Re-documenting, Visualizing and Understanding Software System Using DocLike Viewer.",
                    "The Software Concordance: Using a Uniform Document Model to Integrate Program Analysis and Hypermedia.",
                    "Implementing Angelic Nondeterminism.",
                    "Rigorous EBNF-based Definition for a Graphic Modeling Language.",
                    "Modular refinement in novel schema calculi.",
                    "A Two-Level Hierarchy Software Architecture Framework for the Manufacturing Industry.",
                    "DRC: A Dependence Relationships Based Cohesion Measure for Classes.",
                    "A Method of Implementing UML Virtual Machines With Some Constraints Based on Abstract State Machines.",
                    "A Ontology-based Process Modelling for XP.",
                    "Modeling and Enacting Software Processes Using VRPML.",
                    "A SCM Workflow Model for CMM Organizations.",
                    "Implementing the PostgreSQL Query Optimizer within the OPT++ Framework.",
                    "Application method for process frame-work.",
                    "Awareness Support in Group-based Software Engineering Education System.",
                    "An Extensible Framework for Collaborative Software Engineering.",
                    "JINI/J2EE Bridge for Large-scale IP Phone Services.",
                    "Fault tolerant web service.",
                    "Tool Support for Generating Passive C++ Test Oracles from Object-Z Specifications.",
                    "Testing Criteria for Data Flow Software.",
                    "Challenging Formal Specifications by Mutation: a CSP security example.",
                    "COTS Characterization Model in a COTS-Based Development Environment.",
                    "An Environment for Evolutionary Prototyping Java Programs based on Abstract Interpretation.",
                    "Case study: Reconnaissance techniques to support feature location using RECON2.",
                    "Modeling Complex Systems by A Set of Interacting Finite-State Models.",
                    "Specifying Roles within Agent-Oriented Software Engineering.",
                    "XSLT Template Design for Generating the Web Presentation Layer.",
                    "Automated Test Generation from Object-Oriented Specifications of Real-Time Reactive Systems.",
                    "Formal Verification of Type Flaw Attacks in Security Protocols.",
                    "Reasoning about Pointers in Refinement Calculus.",
                    "Ensuring Compatible Interactions within Component-based Software Systems.",
                    "Specification matching of state-based modular components.",
                    "Selecting Components: a Process for Context-Driven Evaluation.",
                    "Software Engineering Methods for Neural Networks.",
                    "Security-Critical System Development with Extended Use Cases.",
                    "Developing Secure Networked Web-Based Systems Using Model-based Risk Assessment and UMLsec.",
                    "Exploring the Relationship between Experience and Group Performance in Software Review.",
                    "Utilizing Specification Testing in Review Task Trees for Rigorous Review of Formal Specification.",
                    "An Extension of the Behavioral Theory of Group Performance in Software Development Technical Reviews.",
                    "Extending the theory of Owicki and Gries with asynchronous message passing.",
                    "Psachno: A Dynamic and Generic Discovery Framework within a Peer-to-Peer Network Model.",
                    "Evaluating Semantic Warnings in VoIP Programmable Services with Open Source Environment.",
                    "Implementing Exception Handling Policies for Workflow Management System.",
                    "An Extended Policy Language for Role Resolution in Project-Oriented Workflow."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th APSEC 2002",
        "info": "Gold Coast, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2002",
                "sub_name": "9th Asia-Pacific Software Engineering Conference (APSEC 2002), 4-6 December 2002, Gold Coast, Queensland, Australia.",
                "count": 61,
                "papers": [
                    "A Study of the Impact of Requirements Volatility on Software Project Performance.",
                    "Integrating Use-Case Analysis and Task Analysis for Interactive Systems.",
                    "A Feasible User Story Tool for Agile Software Development?",
                    "Results on Formal Stepwise Design in Z.",
                    "Refining Exceptions Using King and Morgan's exit Construct.",
                    "Refining Object-Oriented Invariants and Dynamic Constraints.",
                    "Using Components to Increase Maintainability in a Large Telecommunication System.",
                    "Evaluating the Scalability of Enterprise JavaBeans Technology.",
                    "Performance of SOAP in Web Service Environment Compared to CORBA.",
                    "Towards a Taxonomy for Guiding Multimedia Application Development.",
                    "Extracting threads from concurrent objects for the design of embedded systems.",
                    "A nested invocation suppression mechanism for active replication fault-tolerant CORBA.",
                    "Formal Verification of mu-Charts.",
                    "Animation of Data Refinements.",
                    "Symbolic Simulation of Hybrid Systems.",
                    "Embedding XML Processing Toolkit on General Purpose Programming Language.",
                    "A Software Engineering Approach to Constraint Programming Systems.",
                    "A Virtual File System for Source Program Editing.",
                    "A Quality Doctrine for Software: Do It Right the First Time.",
                    "iBistro: A Learning Environment for Knowledge Construction in Distributed Software Engineering Courses.",
                    "An Account and Appraisal of the Ongoing Development of the Software Engineering Volume of CC2001 and its International Applicability.",
                    "Behavioural Analysis of Component Framework with Multi-Valued Transition System.",
                    "Abstraction and Flow Analysis for Model Checking Open Asynchronous Systems.",
                    "Automatic Filling in a Form by an Agent for Web Applications.",
                    "A Recommendation System for Software Function Discovery.",
                    "Lessons Learned in Framework-Based Software Process Improvement.",
                    "e-Science Experiences: Software Engineering Practice and the EU DataGrid.",
                    "On Aspect-Oriented Software Architecture: It Implies a Process as Well as a Product.",
                    "An Approach to Software Architecture Evaluation with the 4+1 View Model of Architecture.",
                    "Contextual Matching of Software Library Components.",
                    "Computer-aided programming using formally specified design templates.",
                    "Finite-State Modeling in Software Design: Some Fundamental Techniques.",
                    "On Detection of Gapped Code Clones using Gap Locations.",
                    "An Automated Refactoring Approach to Design Pattern-Based Program Transformations in Java Programs.",
                    "Quality Driven Transformation Compositions for Object Oriented Migration.",
                    "Tool Interfacing Mechanisms for Programming-for-the-Large and Programming-for-the-Small.",
                    "The Real World Software Process.",
                    "A Metal Model Approach using UML for Task Assignment Policy in Software Process.",
                    "Feature Logics and Refinement.",
                    "Formal Synthesis and Code Generation of Real-Time Embedded Software using Time-Extended Quasi-Static Scheduling.",
                    "Specifying and Reasoning about Generic Architecture in TCOZ.",
                    "XML Web Services Automation: A Software Engineering Approach.",
                    "Defining Attribute Templates for Descriptions of Distributed Services.",
                    "A Predictive Performance Model to Evaluate the Contention Cost in Application Servers.",
                    "Software Engineering Professionalism: Is There a Global Dimension To This?",
                    "Deriving Verification Conditions and Program Assertions to Support Software Inspection.",
                    "An Interaction Testing Technique between Hardware and Software in Embedded Systems.",
                    "Data Coverage Testing.",
                    "Proposal of a Supporting Method for Diagrams Generation with the Transformation Rules in UML.",
                    "Design of Rules for Transforming UML Sequence Diagrams into Java code.",
                    "Integration of UML and B Specification Techniques: Systematic Transformation from OCL Expressions into B.",
                    "The Java Metrics Reporter- An Extensible Tool for 00 Software Analysis.",
                    "A Measurement Based Comparative Evaluation of Effectiveness of Object-Oriented Versus Conventional Procedural Programming Techniques and Languages.",
                    "Issues in the construction of new measures within the discipline of Open Systems.",
                    "Has Twenty-five Years of Empirical Software Engineering Made a Difference?",
                    "Theme-Based Literate Programming.",
                    "Production and Maintenance of System Documentation: What, Why, When and How Tools Should Support the Practice.",
                    "A communication workload estimation model based on relationships among shared works for software development projects.",
                    "Using Process Simulation to Compare Scheduling Strategies for Software Projects.",
                    "An Agent-Based Framework for Petroleum Information Services from Distributed Heterogeneous Data Resources.",
                    "A Process-Centred Experience Repository for a Small Software Organisation."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th APSEC 2001",
        "info": "Macau, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2001",
                "sub_name": "8th Asia-Pacific Software Engineering Conference (APSEC 2001), 4-7 December 2001, Macau, China.",
                "count": 57,
                "papers": [
                    "Model Checking Value-Passing Processes.",
                    "Using TCOZ for Modeling Web Caching.",
                    "Formalization and 'Literate' Programming.",
                    "A Run-Time Deadlock Detector for Concurrent Java Programs.",
                    "XML Rule Based Source Code Generator for UML CASE Tool.",
                    "Automatic Translation of a Timed Process Algebra into Dynamic State Graphs.",
                    "Formal Verification of Embedded Real-Time Software in Component-Based Application Frameworks.",
                    "Component Identification Method with Coupling and Cohesion.",
                    "The Canonical Functional Design Based on the Domination-Relationship among Data.",
                    "Aspect-Oriented Implementation of Software Health Indicators.",
                    "Specification of Distributed Systems with a Combination of Graphica and Formal Languages.",
                    "Architectural Design for Evolution by Analyzing Requirements on Quality Attributes.",
                    "A Formal Framework to Build Software Agents.",
                    "Trading-Assisting Service Discovery Architecture.",
                    "Using Default Reasoning to Discover Inconsistencies in Natural Language Requirements.",
                    "A Model for Navigating Interview Processes in Requirements Elicitation.",
                    "An Empirical Study of Requirements Engineering in Distributed Software Projects: Is Distance Negotiation More Effective?",
                    "Formalizing Models and Meta-models for System Development.",
                    "Operational Semantics for Verilog.",
                    "Formal Specification of Mixed Components with Korrigan.",
                    "Deriving Operational Semantics from Denotational Semantics for Verilog.",
                    "Scheduling Software Projects to Minimize the Development Time and Cost with a Given Staff.",
                    "Improving the Testing Process by Program Static Analysis.",
                    "Tailoring and Verifying Software Process.",
                    "A Rigorous Method for Testing Real-Time Reactive Systems.",
                    "The Design and Implementation of Automata-based Testing Environment for Java Multi-thread Programs.",
                    "An Effective Testing Technique for Component Composition in EJBs.",
                    "On Path-Wise Automatic Generation of Test Data for Both White-Box and Black-Box Testing.",
                    "On the Implementation of Catalysis Frameworks in COM.",
                    "A Requirements Description Metamodel for Use Cases.",
                    "Formal Object-Oriented Analysis and Design of an Online Ticketing System.",
                    "Applying Mutation Analysis for Object-Oriented Programs Using a Reflective Approach.",
                    "A Slicing Method for Object-Oriented Programs Using Lightweight Dynamic Information.",
                    "Expert Maintainers' Strategies and Needs when Understanding Software: A Case Study Approach.",
                    "The Steam Boiler in a Unified Theory of Z and CSP.",
                    "Formal Framework for a Generic Combination of a Process Algebra with an Algebraic Specification Language.",
                    "Orchestrating Computations on the World-Wide Web.",
                    "Partitioning Program into Hardware and Software.",
                    "A Probabilistic Approach to Automatic Verification of Concurrent Systems.",
                    "A Theory of Combinational Programs.",
                    "Quality Requirement Elicitation for the Architecture Evaluation of Process Computer Systems.",
                    "Architectural Issues in Mobile Augmented Reality Systems: A Prototyping Case Study.",
                    "Development of Session Management Mechanism for Cellular Phone with WWW Connection.",
                    "Cost Analysis of Games, Using Program Logic.",
                    "Compilation of Specifications.",
                    "Model Checking UML Statecharts.",
                    "Automatic Synthesis of the DC Specifications of Lip Synchronisation Protocol.",
                    "Identifying Candidate Objects Using Hierarchical Clustering Analysis.",
                    "A Framework for Migrating Procedural Code to Object-Oriented Platforms.",
                    "An Automatic Restructuring Approach Preserving the Behavior of Object-Oriented Designs.",
                    "A Component-Based Framework and Reusability in Garment.",
                    "Component Metrics to Measure Component Quality.",
                    "Knowledge Scouts: Reducing Communication Barriers in a Distributed Software Development Project.",
                    "Framework for Third Party Testing of Component Software.",
                    "Z User Studio: An Integrated Support Tool for Z Specifications.",
                    "Model Checking Object-Z Classes: Some Experiments with FDR.",
                    "An XML/XSL Approach to Visualize and Animate TCOZ."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "7th APSEC 2000",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/2000",
                "sub_name": "7th Asia-Pacific Software Engineering Conference (APSEC 2000), 5-8 December 2000, Singapore.",
                "count": 66,
                "papers": [
                    "Advanced OO Modeling: Metamodels and Notations.",
                    "Beyond RUP.",
                    "Survivability Analysis of Networked Systems .",
                    "Co-development of real-time systems and their simulation environments.",
                    "Reasoning about real-time programs using idle-invariant assertions.",
                    "Pareto-based soft real-time task scheduling in multiprocessor systems.",
                    "Transatlantic project courses in a university environment.",
                    "Supporting collaboration in distributed software engineering teams.",
                    "Bloodshot eyes: workload issues in computer science project courses.",
                    "The LAST project: development of a formal method for IS-specification and of a CASE-tool for IS-design.",
                    "A process logic for distributed system synthesis .",
                    "Unifying theories of healthiness condition.",
                    "Verification of a wireless ATM medium-access protocol.",
                    "Monitoring facilities in languages supporting development of concurrent self-measurement programs.",
                    "Evaluation of inspectors' defect estimation accuracy for a requirements document after individual inspection.",
                    "The concept of path-closed subsets and its use in software functional design.",
                    "Pragmatic data modelling and design for end users.",
                    "Requirements engineering and strategic decision exploration: an area for interdisciplinary research.",
                    "Building Formal Models for Software Requirements.",
                    "Analysis of the impact of reading technique and inspector capability on individual inspection performance.",
                    "Deriving test cases using class vectors.",
                    "Checking compositions of UML sequence diagrams for timing inconsistency.",
                    "Consistency checks for UML.",
                    "The support tool for highly reliable component-based software development.",
                    "Formal specification of Catalysis frameworks.",
                    "A distributed component architecture for a large telecommunication application.",
                    "Accessing software component documentation during design: an observational study.",
                    "A framework of requirements tracing using UML.",
                    "Service-based software: the future for flexible software.",
                    "Translating descriptions of a viewpoint among different representations.",
                    "Fuzzy concepts and formal methods: some illustrative examples.",
                    "An integrated framework with UML and Object-Z for developing a precise and understandable specification: the light control case study.",
                    "A semantic model of a small typed functional language using Object-Z.",
                    "mu-Charts and Z: examples and extensions.",
                    "Fusing ambiguous domain knowledge slices in a reverse engineering process.",
                    "A formal approach to program modification.",
                    "A comparative evaluation of techniques for syntactic level source code analysis.",
                    "A case study of horizontal reuse in a project-driven organisation.",
                    "PMF/GRIP a framework for the development and implementation of reuse models.",
                    "An adaptive distributed workflow system framework.",
                    "Goal based agent-oriented software modeling.",
                    "Issues in object orienting the ST Microelectronics manufacturing model.",
                    "Extending Statecharts with ad lib and multi-thread features.",
                    "Enterprise modeling using class and instance models.",
                    "CIMO - Component Integration MOdel.",
                    "Component-based application development on architecture of a model, UI and components.",
                    "Tailoring test process by using the component-based development paradigm and the XML technology.",
                    "Reusable integrated components of inter-related patterns for software development.",
                    "Component-based software engineering: technologies, development frameworks, and quality assurance schemes.",
                    "Experiences in Systems Evolution: Practical Aspects and Cautionary Tales.",
                    "Selecting an object-oriented process for student analysts.",
                    "An education support system of information system design and implementation and lessons learned from its application.",
                    "Implementation of a software engineering course for computer science students.",
                    "A preliminary comparison of computer mediated training tools.",
                    "Behavioral specification of GOF design patterns with LOTOS.",
                    "Combining case-based and model-based reasoning: a formal specification.",
                    "A GUI and testing tool for SOFL.",
                    "Third generation OO processes: a critique of RUP and OPEN from a project management perspective.",
                    "Creating a process for transitioning to object technology.",
                    "A framework for risk analysis in software engineering.",
                    "Virtual worlds for Web site visualisation.",
                    "Predicting class libraries interface evolution: an investigation into machine learning approaches.",
                    "Coherence equals cohesion-or does it?",
                    "Visualising the influence of data structure choice on the performance of a distributed database system.",
                    "Platforms for agent-oriented software engineering.",
                    "A study on static analysis in network of synchronizing FSMs."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6th APSEC 1999",
        "info": "Takamatsu, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1999",
                "sub_name": "6th Asia-Pacific Software Engineering Conference (APSEC '99), 7-10 December 1999, Takamatsu, Japan.",
                "count": 73,
                "papers": [
                    "Empirical Observations on Object Evolution.",
                    "An Approach for Measuring Software Evolution Using Source Code Features.",
                    "Software Development Based on Software Pattern Evolution.",
                    "Application of CBSE to Projects with Evolving Requirements - A Lesson-Learned.",
                    "An Operational Component Specification Method.",
                    "Connector Modeling Method for Component Extraction.",
                    "COMO: A UML-Based Component Development Methodology.",
                    "Development of an Intelligent Web Interface to Online Library Catalog Databases.",
                    "Design of a Framework for Dynamic Content Adaptation to Web-Enabled Terminals and Enterprise Applications.",
                    "Evaluation of Process Scheduling Mechanism for a Web Server Based on Its Behavior while Executing.",
                    "Automatic Selecting of Required NetNews Articles.",
                    "A Formal Specification of the Concurrency Control in Real-Time Databases.",
                    "Visualization of Formal Specifications.",
                    "Interactive Layout Method for Object Diagrams of OMT.",
                    "A Visual Programming Method for Developing Sequence Controller Programs.",
                    "A Study of Productivity and Efficiency for Object-Oriented Methods and Languages.",
                    "Strongly Formative Pilot Studies on Constraints in Early Life-Cycle Work.",
                    "Factor Analysis of Comprehension States in the Learning Phases of a Programming Language.",
                    "A Straightforward Approach to Effort Estimation for Updating Programs in Object-Oriented Prototyping Development.",
                    "Intelligent Search Agent for Software Components.",
                    "Inter-Class Test Technique Between Black-Box-Class and White-Box-Class for Component Customization Failures.",
                    "SMARTS: A Smart CORBA Trader Service.",
                    "An Object-Oriented Framework for Content-Based Image Retrieval Based on 5-Tier Architecture .",
                    "Evolution of Business Processes and a Process Simulation Tool.",
                    "An Event, Activity and Process Based Methodology for Requirements Elicitation and Its Application to an Educational Information System.",
                    "An Integrated Framework of Supply Chain Management System.",
                    "Software Support for Distributed Business Processes.",
                    "A Detecting and Interpreting Method of the Inconsistency of Software Requirements Specifications.",
                    "Using Multiple Graphs of Programs to Modify Specifications.",
                    "Conducting Requirements Evolution by Replacing Components in the Current System.",
                    "On Aspect-Oriented Design: An Approach to Designing Quality Attributes.",
                    "Towards a Broader View on Software Architecture Analysis of Flexibility.",
                    "A Reusable Distributed Software Architecture Driven by Metadata.",
                    "Analysis and Verification of Multi-Agent Interaction Protocols.",
                    "Bee-gent: Bonding and Encapsulation Enhancement Agent Framework for Development of Distributed Systems.",
                    "Design and Implementation of Multi-Agent for Intelligent Software.",
                    "Executable C++ Program Generation from the Structured Object-Oriented Design Diagrams.",
                    "Experience with Porting a Unix Version CASE Tool to the Corresponding Java Version.",
                    "chi-SUDS-SDL: A Tool for Diagnosis and Understanding Software Specifications.",
                    "A Formal Basis for Object-Oriented Patterns.",
                    "A Source Code Generation Support System Using Design Pattern Documents Based on SGML.",
                    "Pattern Based Software Re-engineering: A Case Study.",
                    "Reusing Use Case Descriptions for Requirements Specification: Towards Use Case Patterns.",
                    "Agent-Oriented Software Modeling.",
                    "Reusable Strategies for Software Agents via the Subsumption.",
                    "An Evolutional Cooperative Computation Based on Adaptation to Environment.",
                    "Slicing Methods Using Static and Dynamic Analysis Information.",
                    "Extracting Code Fragment that Implements Functionality.",
                    "VRML Program Slicing.",
                    "Deriving Program Physical Structures Using Bond Energy Algorithm.",
                    "Specifying Constraints with Message Sequence Specifications.",
                    "Enhancing the Object Constraint Language for More Expressive Specifications.",
                    "Improving Object Oriented Analysis by Explicit Change Analysis.",
                    "Object-Oriented Essential Modeling.",
                    "Feature-Oriented Engineering of PBX Software.",
                    "Applying SOFL to Develop a University Information System.",
                    "Software Creation: Detail of Human Design Knowledge and Its Application to Automatic Software Design.",
                    "A Systematic Approach to Software Safety.",
                    "Towards an Algorithmic Debugging for Distributed Programs.",
                    "On the Practical Static Checker of Semantic Run-Time Errors.",
                    "A System Dependence Net Generator for Ada Programs.",
                    "The Quest for Correct Systems: Model Checking of Diagrams and Datatypes.",
                    "Simply Observable Behavioral Specification.",
                    "Sequence Operators: Specifying Behavioral Interfaces of Smalltalk Blocks.",
                    "Manipulating Software Semantics with Unified Computational Model and Software Quark Model.",
                    "Expanding Small Example into Large Scale Real-Time Control System.",
                    "Proposal of a Support System for Device Driver Generation.",
                    "Interactive Variable Classification Technique to Support the Maintenance of COBOL Business Application Systems.",
                    "Maintenance with Reuse: An Integrated Approach Based on Software Configuration Management.",
                    "Maintainability Myth Causes Performance Problems in SMP Application.",
                    "Enhancing Object-Based System Composition through Per-Object Mixins.",
                    "Testing, Reliability, and Interoperability Issues in the CORBA Programming Paradigm.",
                    "Capturing Periodic Concurrent Interactions of Mission Computer Tasks."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "5th APSEC 1998",
        "info": "Taipei, Taiwan, ROC",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1998",
                "sub_name": "5th Asia-Pacific Software Engineering Conference (APSEC '98), 2-4 December 1998, Taipei, Taiwan, ROC.",
                "count": 43,
                "papers": [
                    "Optimization of Multi-way Clustering and Retrieval using Genetic Algorithms in Reusable Class Library.",
                    "Experiment of Component-Based Software Development on Multiple Distributed Object Environments.",
                    "An Enhanced Reflective Architecture for Adaptation of the Object-Oriented Language/Software.",
                    "Why Is It So Hard to Define Software Architecture?",
                    "How to Reconcile Formal Specifications and Automatic Programming: The Descartes System.",
                    "Integration of Software Analysis and Design Methods with Formal Description Techniques.",
                    "Automatically Generating C++ Programs from LOTOS Behavior Specifications.",
                    "A Refinement Calculus for the Development of Real-Time Systems.",
                    "A Software Metric Combination Model for Software Reuse.",
                    "Static and Dynamic Metrics for Effective Object Clustering.",
                    "On The Danger Of Developing Measures Without Clarifying Concepts.",
                    "A Reuse Case Perspective on Documenting Frameworks.",
                    "wwHww : An Application Framework of Distributed Systems for Enduser-Initiative Development.",
                    "A Comprehensive Interface Definition Framework for Software Components.",
                    "CTAG Software Generator Model for Constructing Network Applications.",
                    "Computer-Assisted Analysis and Refinement of Informal Software Requirements Documents.",
                    "Explicit Representation of Business Policies.",
                    "Liaison: A Workflow Model for Novel Applications.",
                    "High Performance Technique for Ultrareliable Execution of Tasks Under Both Hardware and Software Faults.",
                    "Specification-Based Class Testing with ClassBench.",
                    "Mutation-Based Inter-Class Testing.",
                    "A Technique for Analyzing and Testing Object-Oriented Software Using Colored Petri Nets.",
                    "Reusing UML Specifications in a Constrained Application Domain.",
                    "Techniques for Systematically Generating Framework Diagram based on UML.",
                    "A UML-Based Object-Oriented Framework Development Methodology.",
                    "An Experience Report Related to Restructuring OODesigner: A CASE Tool for OMT.",
                    "Customizable Software Engineering Environments for Flexible Distributed Software Teams.",
                    "Component and Data Distribution in a Distributed Workflow Management System.",
                    "Verifying Model Oriented Specifications through Animation.",
                    "Design and Implementation of Test-Case Generation for Concurrent Programs.",
                    "An Automatic Test Case Generator Derived from State-Based Testing.",
                    "A Scaleable and Modular Approach to Verification of ATM Switching System Using Reverse Specification.",
                    "Interpreting the Object Constraint Language.",
                    "Unification and Consistency Verification of Object-Oriented Analysis Models.",
                    "Change Impact Analysis for A Class Hierarchy.",
                    "A Computing Model for Distributed Processing Systems and Its Application.",
                    "Partitioning and Allocation of Objects in Heterogeneous Distributed Environments Using the Niched Pareto Genetic-Algorithm.",
                    "COPEN: A CORBA-Based Intelligent Push Engine.",
                    "CSMonitor: A Visual Client/Server Monitor for CORBA-Based Distributed Applications.",
                    "The CACTUS Object Server: Design and Implementation Issues.",
                    "Constructing a Toolset for Software Maintenance with OOAG.",
                    "A Difference-Based Version Model for OODBMS.",
                    "Method of User-Customizable GUI Generation and Its Evaluation."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "4th APSEC / 4th ICSC 1997",
        "info": "Clear Water Bay, Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1997",
                "sub_name": "4th Asia-Pacific Software Engineering and International Computer Science Conference (APSEC '97 / ICSC '97), 2-5 December 1997, Clear Water Bay, Hong Kong.",
                "count": 68,
                "papers": [
                    "Quality and Reuse in Industrial Software Engineering.",
                    "Quality assurance certification: adoption by Australian software developers and its association with capability maturity.",
                    "Criticality Models using SDL Metrics Set.",
                    "Measuring Class Coupling and Cohesion: A Formal Metamodel Approach.",
                    "Possum: An Animator for the SUM Specification Language.",
                    "A Formal Operational Semantics for SOFL.",
                    "Multi-Plan Attribute Grammars.",
                    "Denotational Semantics for JSD.",
                    "A distributed constraint-based search architecture for bus timetabling and duty assignment.",
                    "Discovery of Cases for Case-Based Reasoning in Engineering.",
                    "Reducing Uncertainties in Data Mining.",
                    "HKBCN - A Hybrid Intelligent System for Knowledge Revising.",
                    "A methodology for object-oriented constraint programming.",
                    "The Development of an Object-Oriented, Discrete-Event Simulation Language Using Java.",
                    "Towards Constructing a Class Evolution Model.",
                    "Modular reasoning in Object-Z.",
                    "Finite Symbolic Reachability Graphs for High-Level Petri Nets.",
                    "A Tool-Suite for Reachability Analysis of Concurrent Object-Oriented Programs.",
                    "Mapping Ada Source Code into an Abstract Program Space.",
                    "Client location tracking with k-step prediction and cache policy in ubiquitous information service network.",
                    "An Architecture and a Framework for IP Applications.",
                    "Using Extended Event Traces to Describe Communication in Software Architectures.",
                    "Design by Contract for Python.",
                    "A Reverse Engineering Method and Experiences for Industrial COBOL System.",
                    "Software Engineering Research: A Methodological Analysis.",
                    "Petri nets based proofs of Ada 95 solution for preference control.",
                    "About the Suitability of Petri Nets for Describing, Validating and Evaluating SA-RT Specifications.",
                    "Integrating safety analysis and requirements engineering.",
                    "Detecting Common Mode Failures in N-Version Software Using Weakest Precondition Analysis.",
                    "Software Development as a Workflow Process.",
                    "An Approach to Software Process Management Based on Formal Process Modeling and Analysis.",
                    "Genericity in method construction.",
                    "Legacy Systems Migration : A Method and its Tool-Kit Framework.",
                    "Object-oriented Web application architectures and development strategies.",
                    "Scenario reuse: a technique for complementing scenario-based requirements engineering approaches.",
                    "A Design Framework for System Re-Engineering.",
                    "Cognitive Deficiencies in Software Library Design.",
                    "A Theory of Interactions and Scenes for User Centered Systems Specification and Verification.",
                    "Specifying the UQ* user-interface with Object-Z.",
                    "Compacting regression-suites on-the-fly.",
                    "Slicing Object-Oriented Programs.",
                    "On the Criteria of Allocating Test Cases under Uncertainty.",
                    "Translating Object-Z Specifications to Object-Oriented Test Oracles.",
                    "DOOD: Distributed Object-Oriented Software Development Environment.",
                    "MetaBuilder: a Generic CASE Tool Builder.",
                    "JB-OODBT: An Object-Oriented Database Toolkit for JB/CASE.",
                    "Conditional Evaluation in Simple Multi-Visit Attribute-Grammar Evaluators.",
                    "A Formal Model of Concurrency for Distributed Object-Oriented Systems.",
                    "TPAL: A Timed-Probabilistic Model for Concurrent Processes.",
                    "A Test-case Generation Method for Concurrent Programs Including Task-types.",
                    "Design of Protocols in Timed CSP for Highly Reliable and Available Client-Server System.",
                    "A Z Specification of Use Cases: A Preliminary Report.",
                    "LOODS: a new learning-based object-oriented system development environment.",
                    "Integration of Application Systems by Modelling Information Shared Among Applications.",
                    "A visual programming environment for Z specifications.",
                    "Software Metrics and Application Domain Complexity.",
                    "An Approach to Software Testability Measurement.",
                    "Not Whether Java but How Java.",
                    "Conceptual Issues of an Object-Centered Process Model.",
                    "Software Requirements Definition for Specification Database.",
                    "Component-Based Software Development-A New Paradigm in Software Engineering?",
                    "Exploiting the advantages of object oriented programming in the implementation of a database design environment.",
                    "Software Assisted Handover of Mobile Clients in Heterogeneous Wireless Computing Environments.",
                    "An Overview of Legacy System Migration.",
                    "Tutorial: organizing, managing and optimizing software testing.",
                    "Design Patterns-Essentials, Experience, Java Case Study.",
                    "OPEN-MeNtOR: a third generation OO methodology-advanced tasks and techniques.",
                    "Design and Implementation of Coordination and Workflow Management Technology."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "3rd APSEC 1996",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1996",
                "sub_name": "3rd Asia-Pacific Software Engineering Conference (APSEC '96), December 4-7, 1996, Seoul, South Korea.",
                "count": 43,
                "papers": [
                    "The Need For New Software Technology: Have We Overcome the Software Crisis?",
                    "Verification via Digitized Models of Real-Time Hybrid Systems.",
                    "Formalization and Verification of Safety Properties of Statechart Specifications.",
                    "Object-Oriented Metrics.",
                    "Revisiting Measurement of Software Complexity.",
                    "Module Coupling: A Design Metric.",
                    "Classification of and Experimentation on Tool Interfacing in Software Development Environments.",
                    "An Interaction Support Mechanism in Software Development.",
                    "Assessing and Restructuring of Classes Based on Cohesion.",
                    "Improving the Quality of Classification Trees via Restructuring.",
                    "A Modified Inheritance Mechanism Enhancing Reusability and Maintainability in Object-Oriented Languages.",
                    "A Class Testing Technique Based on Data Bindings.",
                    "Towards a Learner-Centred Approach to Teaching Object-Oriented Design.",
                    "A Framework of Generating Software Process Including Milestones for Object-Oriented Development Method.",
                    "Simulation Model of Overlapping Development Process Based on Progress of Activities.",
                    "Analysis of Software Process Improvement Experience Using the Project Visibility Index.",
                    "Industrial Application of Object-Oriented Technology.",
                    "Principles of Software Evolution.",
                    "New Software Components with an Autonomous Changing Mechanism.",
                    "The Derivation of Functional Specifications from Source Code.",
                    "Safety Analysis Using Coloured Petri Nets.",
                    "An Extended Semantic Foundation For Object-Z.",
                    "A Method of Checking Errors and Consistency in the Process of Object-Oriented Analysis.",
                    "A Case Study Using SAM - Safety Analysis of PES.",
                    "Towards a Practical Formal Method for Object Oriented Modelling.",
                    "Formal Methods Pilot Project.",
                    "Formal Modeling of Large Domains.",
                    "A dynamic Extension for the Specification of Distributed Systems.",
                    "The Telephone Directory Enquiry System of Hong Kong.",
                    "Design and Implementation of Dynamically Reconstructing System Software.",
                    "Architectural Abstractions and Language Mechanisms.",
                    "Resonance Interface: Proposal of a Framework for Design Environment.",
                    "A Dialog-Oriented User Interface Generation Mechanism.",
                    "Formalisation of Interaction Diagrams.",
                    "If Software Reuse Can Lead IT, How?",
                    "Common Sense Reuse.",
                    "Keynote Address: Auditing Informal Software Testing and Analysis Processes.",
                    "Software Testing and Metrics for Concurrent Computation.",
                    "A Prototype of a Concurrent Behavior Monitoring Tool for Testing of Concurrent Programs.",
                    "A Method for Structural Testing of Ada Concurrent Programs Using the Event Interactions Graph.",
                    "M-base : An Application Development Environment for End-user Computing based on Message Flow.",
                    "Real-Time System Design Tools for RTO.e (Real-Time Object.extended).",
                    "MENTOR : An Environment Supporting the Construction of Methods."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "2nd APSEC 1995",
        "info": "Brisbane, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1995",
                "sub_name": "2nd Asia-Pacific Software Engineering Conference (APSEC '95), December 6-9, 1995, Brisbane, Queensland, Australia.",
                "count": 60,
                "papers": [
                    "Software Systems Engineering-From Domain Analysis Via Requirements Capture to Software Architectures.",
                    "Communication, Collaboration, and Cooperation in Software Development-How Should We Support Group Work in Software Development?",
                    "Dynamic Data Flow Analysis for C++.",
                    "Event Interactions Graph for Test-case Generation of Concurrent Programs.",
                    "A Criticism on the Capture-and-Recapture Method for Software Reliability Assurance.",
                    "From Scenarios to Timed Automata: Building Specifications from Users Requirements.",
                    "Expressing Inter-Perspective Relationships: A Logical Approach.",
                    "Building the Structure of Specification Documents from Utterances of Requirements Elicitation Meetings.",
                    "Two Dimensional Concurrent Program Debugging.",
                    "Reasoning about Concurrent Objects.",
                    "An Efficient Debugging Method for Message-based Parallel Programs using Static Analysis Information.",
                    "Class Exerciser: A Basic CASE Tool for Object-Oriented Development.",
                    "A Reorganization Framework of the Object-Oriented Class Hierarchy.",
                    "Complexity Measures for Object-Oriented Program Based on the Entropy.",
                    "A Survey of Experiences amongst Object-Oriented Practitioners.",
                    "Software Engineering Education - Adding Process to Projects Theory, Practice and Experience.",
                    "Management of Distributed Concurrent Development for Large-Scale Software Systems.",
                    "Development of Distributed Applications with Separation of Concerns.",
                    "A Hierarchical Framework for Designing Reliable Distributed Systems.",
                    "Evolutional Agents: Field Oriented Programming Language, Flage.",
                    "Architectural Abstractions for Real-Time Software.",
                    "Toward Software Metrics for Distributed Software.",
                    "On the Analysis of Subdomain Testing Strategies.",
                    "An Enhanced Zero-One Optimal Path Set Selection Method.",
                    "Testing of Object-Oriented Programs Based on Finite State Machines.",
                    "Test Suite Generation Methods for Concurrent Systems Based on Colored Petri Nets.",
                    "An Integrated Support Environment for Distributed Software Development based on Unified Program Representations.",
                    "Software Environment Support for Integrated Formal Program Specification and Development.",
                    "Modelling Systems that Integrate Programming Language and Environment Mechanisms.",
                    "Providing Configuration Management Support in Software Engineering Environments.",
                    "Animating Z: Interactivity, Transparency and Equivalence.",
                    "Living with Free Type and Class Union.",
                    "Systematic Development of the Human Interface.",
                    "An Approach to Reverse Quality Assurance with Data-Oriented Program Analysis.",
                    "Teaching Software Quality and Leadership: Experiences and Successes.",
                    "An Empirical Study on Software Error Detection: Voting, Instrumentation, and Fagan Inspection.",
                    "Deriving Programs by Combining and Adapting Refinement Scripts.",
                    "Knowledge Acquisition and Integration on Specification Change-A Method for Systematic Reuse.",
                    "Relationship Between Query Interface and Profiles in Reuse Support System.",
                    "Prototyping the Structured Specification as Logic Programs.",
                    "A Maintenance Support System based on High-Level Control-Flow and Data Dependency.",
                    "Flexible Module Operation Scheme in Formal Specification Process.",
                    "An Environment for the Reverse Engineering of Executable Programs.",
                    "CARD: An Environment for Software Requirements Definition.",
                    "Design and Implementation of a Method Base Management System for a Situational CASE Environment.",
                    "A Simple Configuration Management System for CASE Repository.",
                    "Re-engineering 4GL-based Information System Applications.",
                    "An Integrated Approach to IS modeling.",
                    "Integration of Software Process Management and Development History Recording.",
                    "Soft Typing of General First-Order Languages.",
                    "Reasoning about Object-Z Specifications.",
                    "Limitations of Formal Methods and an Approach to Improvement.",
                    "Software Process Improvement Paradigms.",
                    "Software Process Improvement Paradigms for IT Industry: Why the Bottom-Up Approach Fits Best.",
                    "The Ericsson's Approach to Software Improvements.",
                    "Are Formal Methods Relevant?",
                    "Is Software Engineering Really Engineering?",
                    "Is Software Engineering Really Engineering?",
                    "Is Software Engineering Really Engineering?",
                    "Software Engineering Research Validation."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "1st APSEC 1994",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apsec/1994",
                "sub_name": "First Asia-Pacific Software Engineering Conference, APSEC 1994, Tokyo, Japan, December 7-9, 1994.",
                "count": 44,
                "papers": [
                    "Analysis in software engineering.",
                    "Requirements engineering: a review and research agenda.",
                    "Applying object-oriented construction to fault tolerant systems.",
                    "An adaptive user navigation mechanism and its evaluation.",
                    "Developing distributed applications by semantics-based automatic replication.",
                    "A TAHG model based software generator system.",
                    "Proprietary vs. \"open systems\" options in the construction of knowledge-based software reengineering environments.",
                    "A software maintenance survey.",
                    "Guiding the requirements engineering process.",
                    "Constraint-centered descriptions for automated tool invocation.",
                    "Software documents, their relationships and properties.",
                    "Supporting user-analyst interaction in functional requirements elicitation.",
                    "A model-based MICOM application software development method.",
                    "Object and domain policies specification.",
                    "A knowledge-based approach to regression testing.",
                    "Integrating data flow and domain testing.",
                    "Automated class testing: methods and experience.",
                    "From the software process to software quality: BOOTSTRAP and ISO 9000.",
                    "BOOTSTRAP: a software process assessment and improvement methodology.",
                    "Software process representation to support multiple views.",
                    "Dynamic evolution of distributed systems specifications using reflective language.",
                    "A mapping system from Object-Z to C++.",
                    "Reversing concurrent systems into formal specifications.",
                    "Ordered sequence testing criteria for concurrent programs and the support tool.",
                    "Reachability testing: an approach to testing concurrent software.",
                    "Fall-in C: a software tool for pitfall detection in C programs.",
                    "Producing and managing software objects in the process programming environment OPM.",
                    "Analysis and enactment of a distributed software process model: the AttNet model.",
                    "Process-sensitive software engineering environments: an object-oriented view.",
                    "Generating data access programs from PCTE schemas with constraints.",
                    "An analysis of the effects and evaluation of upper CASE tools for embedded microprocessors in Japan and the US.",
                    "Scalability for graph based CASE tools.",
                    "PARTS-a temporal logic-based real-time software specification method supporting multiple-viewpoints.",
                    "Formal definitions of behavioural compatibility for active and passive objects.",
                    "The Cogito methodology and system.",
                    "The Cogito Repository Manager.",
                    "A sentential function mapping method for object-oriented analysis and design.",
                    "When to inherit and when not to.",
                    "Object-oriented analysis and design support system using algebraic specification techniques.",
                    "A hybrid program knowledge base for static program analyzers.",
                    "Software Information Management System based on the entity-relationship model.",
                    "Prescriptive metrics for software quality assurance.",
                    "An approach to predict software maintenance cost based on ripple complexity.",
                    "Optimal release policies for hyper-geometric distribution software reliability growth model with scheduled delivery time."
                ]
            }
        ]
    }
]