[
    {
        "year": "2021",
        "name": "19th ATVA 2021",
        "info": "Gold Coast, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2021",
                "sub_name": "Automated Technology for Verification and Analysis - 19th International Symposium, ATVA 2021, Gold Coast, QLD, Australia, October 18-22, 2021, Proceedings.",
                "count": 24,
                "papers": [
                    "Linear Temporal Logic - From Infinite to Finite Horizon.",
                    "Determinization and Limit-Determinization of Emerson-Lei Automata.",
                    "Automatic Discovery of Fair Paths in Infinite-State Transition Systems.",
                    "Certifying DFA Bounds for Recognition and Separation.",
                    "AALpy: An Active Automata Learning Library.",
                    "Learning Linear Temporal Properties from Noisy Data: A MaxSAT-Based Approach.",
                    "Mining Interpretable Spatio-Temporal Logic Properties for Spatially Distributed Systems.",
                    "A Formal Semantics of the GraalVM Intermediate Representation.",
                    "A Verified Decision Procedure for Orders in Isabelle/HOL.",
                    "PJBDD: A BDD Library for Java and Multi-Threading.",
                    "Live Synthesis.",
                    "Faster Pushdown Reachability Analysis with Applications in Network Verification.",
                    "Verifying Verified Code.",
                    "Probabilistic Causes in Markov Chains.",
                    "TEMPEST - Synthesis Tool for Reactive Systems and Shields in Probabilistic Environments.",
                    "AQUA: Automated Quantized Inference for Probabilistic Programs.",
                    "Proving SIFA Protection of Masked Redundant Circuits.",
                    "Verification by Gambling on Program Slices.",
                    "Runtime Enforcement of Hyperproperties.",
                    "Compositional Synthesis of Modular Systems.",
                    "Event-B Refinement for Continuous Behaviours Approximation.",
                    "Incorporating Monitors in Reactive Synthesis Without Paying the Price.",
                    "pyNeVer: A Framework for Learning and Verification of Neural Networks.",
                    "Property-Directed Verification and Robustness Certification of Recurrent Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "18th ATVA 2020",
        "info": "Hanoi, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2020",
                "sub_name": "Automated Technology for Verification and Analysis - 18th International Symposium, ATVA 2020, Hanoi, Vietnam, October 19-23, 2020, Proceedings.",
                "count": 34,
                "papers": [
                    "First-Order Timed Runtime Verification Using BDDs.",
                    "Verified Textbook Algorithms - A Biased Survey.",
                    "Verifying Recurrent Neural Networks Using Invariant Inference.",
                    "NeuralExplorer: State Space Exploration of Closed Loop Control Systems Using Neural Networks.",
                    "DeepAbstract: Neural Network Abstraction for Accelerating Verification.",
                    "Faithful and Effective Reward Schemes for Model-Free Reinforcement Learning of Omega-Regular Objectives.",
                    "Practical \"Paritizing\" of Emerson-Lei Automata.",
                    "Complexity of Verification and Synthesis of Threshold Automata.",
                    "On (I/O)-Aware Good-For-Games Automata.",
                    "Urgent Partial Order Reduction for Extended Timed Automata.",
                    "Eliminating Message Counters in Threshold Automata.",
                    "Context-Aware Temporal Logic for Probabilistic Systems.",
                    "Multi-head Monitoring of Metric Dynamic Logic.",
                    "Faster Algorithms for Quantitative Analysis of MCs and MDPs with Small Treewidth.",
                    "Robustness Verification for Classifier Ensembles.",
                    "Verification of Indefinite-Horizon POMDPs.",
                    "Verification of a Generative Separation Kernel.",
                    "A Decision Procedure for Path Feasibility of String Manipulating Programs with Integer Data Type.",
                    "From Checking to Inference: Actual Causality Computations as Optimization Problems.",
                    "Boosting Sequential Consistency Checking Using Saturation.",
                    "Parallel Graph-Based Stateless Model Checking.",
                    "Model Checking Branching Properties on Petri Nets with Transits.",
                    "Explainable Reactive Synthesis.",
                    "Robust Controller Synthesis for Duration Calculus.",
                    "Dependency-Based Compositional Synthesis.",
                    "Proving Non-inclusion of Büchi Automata Based on Monte Carlo Sampling.",
                    "Probabilistic Hyperproperties of Markov Decision Processes.",
                    "Minimal Witnesses for Probabilistic Timed Automata.",
                    "Probabilistic Hyperproperties with Nondeterminism.",
                    "ReachNN*: A Tool for Reachability Analysis of Neural-Network Controlled Systems.",
                    "RVX - A Tool for Concolic Testing of Embedded Binaries Targeting RISC-V Platforms.",
                    "Peregrine 2.0: Explaining Correctness of Population Protocols Through Stage Graphs.",
                    "DG: Analysis and Slicing of LLVM Bitcode.",
                    "RTAMT: Online Robustness Monitors from STL."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th ATVA 2019",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2019",
                "sub_name": "Automated Technology for Verification and Analysis - 17th International Symposium, ATVA 2019, Taipei, Taiwan, October 28-31, 2019, Proceedings.",
                "count": 31,
                "papers": [
                    "A Note on Game Theory and Verification.",
                    "Lazy Abstraction-Based Controller Synthesis.",
                    "Truth Assignments as Conditional Autarkies.",
                    "Can We Trust Autonomous Systems? Boundaries and Risks.",
                    "Teaching Stratego to Play Ball: Optimal Synthesis for Continuous Space MDPs.",
                    "Using Symmetry Transformations in Equivariant Dynamical Systems for Their Safety Verification.",
                    "Parametric Timed Model Checking for Guaranteeing Timed Opacity.",
                    "Adaptive Online First-Order Monitoring.",
                    "Multi-head Monitoring of Metric Temporal Logic.",
                    "An Efficient Algorithm for Computing Causal Trace Sets in Causality Checking.",
                    "Conditional Testing - Off-the-Shelf Combination of Test-Case Generators.",
                    "Enhancing Symbolic Execution of Heap-Based Programs with Separation Logic for Test Input Generation.",
                    "BUBEN: Automated Library Abstractions Enabling Scalable Bug Detection for Large Programs with I/O and Complex Environment.",
                    "KLUZZER: Whitebox Fuzzing on Top of LLVM.",
                    "Automatic Generation of Moment-Based Invariants for Prob-Solvable Loops.",
                    "Chain-Free String Constraints.",
                    "Synthesizing Efficient Low-Precision Kernels.",
                    "New Optimizations and Heuristics for Determinization of Büchi Automata.",
                    "Approximate Automata for Omega-Regular Languages.",
                    "DEQ: Equivalence Checker for Deterministic Register Automata.",
                    "ltl3tela: LTL to Small Deterministic or Nondeterministic Emerson-Lei Automata.",
                    "Efficient Trace Encodings of Bounded Synthesis for Asynchronous Distributed Systems.",
                    "Reactive Synthesis of Graphical User Interface Glue Code.",
                    "Semantic Labelling and Learning for Parity Game Solving in LTL Synthesis.",
                    "Program Repair for Hyperproperties.",
                    "Generic Emptiness Check for Fun and Profit.",
                    "Deciding Fast Termination for Probabilistic VASS with Nondeterminism.",
                    "Are Parametric Markov Chains Monotonic?",
                    "Efficient Information-Flow Verification Under Speculative Execution.",
                    "Model Checking Data Flows in Concurrent Network Updates.",
                    "Performance Evaluation of the NDN Data Plane Using Statistical Model Checking."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th ATVA 2018",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2018",
                "sub_name": "Automated Technology for Verification and Analysis - 16th International Symposium, ATVA 2018, Los Angeles, CA, USA, October 7-10, 2018, Proceedings.",
                "count": 35,
                "papers": [
                    "DeepSafe: A Data-Driven Approach for Assessing Robustness of Neural Networks.",
                    "Formal Specification for Deep Neural Networks.",
                    "Optimal Proofs for Linear Temporal Logic on Lasso Words.",
                    "What's to Come is Still Unsure - Synthesizing Controllers Resilient to Delayed Interaction.",
                    "A Formally Verified Motion Planner for Autonomous Vehicles.",
                    "Robustness Testing of Intermediate Verifiers.",
                    "Simulation Algorithms for Symbolic Automata.",
                    "Quantitative Projection Coverage for Testing ML-enabled Autonomous Systems.",
                    "Recursive Online Enumeration of All Minimal Unsatisfiable Subsets.",
                    "Synthesis in pMDPs: A Tale of 1001 Parameters.",
                    "Temporal Logic Verification of Stochastic Systems Using Barrier Certificates.",
                    "Bisimilarity Distances for Approximate Differential Privacy.",
                    "A Symbolic Algorithm for Lazy Synthesis of Eager Strategies.",
                    "Modular Verification of Concurrent Programs via Sequential Model Checking.",
                    "Quantifiers on Demand.",
                    "Signal Convolution Logic.",
                    "Efficient Symbolic Representation of Convex Polyhedra in High-Dimensional Spaces.",
                    "Accelerated Model Checking of Parametric Markov Chains.",
                    "Continuous-Time Markov Decisions Based on Partial Exploration.",
                    "A Fragment of Linear Temporal Logic for Universal Very Weak Automata.",
                    "Quadratic Word Equations with Length Constraints, Counter Systems, and Presburger Arithmetic with Divisibility.",
                    "Round-Bounded Control of Parameterized Systems.",
                    "PSense: Automatic Sensitivity Analysis for Probabilistic Programs.",
                    "Information Leakage in Arbiter Protocols.",
                    "Neural State Classification for Hybrid Systems.",
                    "Bounded Synthesis of Reactive Programs.",
                    "Maximum Realizability for Linear Temporal Logic Specifications.",
                    "Ranking and Repulsing Supermartingales for Reachability in Probabilistic Programs.",
                    "Bounded Synthesis of Register Transducers.",
                    "EthIR: A Framework for High-Level Analysis of Ethereum Bytecode.",
                    "MGHyper: Checking Satisfiability of HyperLTL Formulas Beyond the \\exists ^*\\forall ^* ∃ ∗ ∀ ∗ Fragment.",
                    "Verifying Rust Programs with SMACK.",
                    "S BIP 2.0: Statistical Model Checking Stochastic Real-Time Systems.",
                    "Owl: A Library for ω-Words, Automata, and LTL.",
                    "EVE: A Tool for Temporal Equilibrium Analysis."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th ATVA 2017",
        "info": "Pune, India",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2017",
                "sub_name": "Automated Technology for Verification and Analysis - 15th International Symposium, ATVA 2017, Pune, India, October 3-6, 2017, Proceedings.",
                "count": 30,
                "papers": [
                    "Proving Absence of Starvation by Means of Abstract Interpretation and Model Checking.",
                    "Precise Null Pointer Analysis Through Global Value Numbering.",
                    "May-Happen-in-Parallel Analysis with Returned Futures.",
                    "JTDec: A Tool for Tree Decompositions in Soot.",
                    "Fixing the State Budget: Approximation of Regular Languages with Small DFAs.",
                    "An Equivalence Checking Framework for Array-Intensive Programs.",
                    "Loop Quasi-Invariant Chunk Detection.",
                    "SamaTulyata: An Efficient Path Based Equivalence Checking Tool.",
                    "Tests and Refutation.",
                    "The Density of Linear-Time Properties.",
                    "HyLeak: Hybrid Analysis Tool for Information Leakage.",
                    "Compositional Safety Refutation Techniques.",
                    "Gradient-Based Variable Ordering of Decision Diagrams for Systems with Structural Units.",
                    "Model Checking of C and C++ with DIVINE 4.",
                    "Dealing with Priorities and Locks for Concurrent Programs.",
                    "Knowledge Transfer and Information Leakage in Protocols.",
                    "Concurrent Program Verification with Invariant-Guided Underapproximation.",
                    "Maximum Resilience of Artificial Neural Networks.",
                    "Formal Verification of Piece-Wise Linear Feed-Forward Neural Networks.",
                    "Liquid Types for Array Invariant Synthesis.",
                    "Lifting CDCL to Template-Based Abstract Domains for Program Verification.",
                    "Synthesizing Invariants by Solving Solvable Loops.",
                    "Exploiting Partial Knowledge for Efficient Model Analysis.",
                    "A Language-Theoretic View on Network Protocols.",
                    "Efficient Strategy Iteration for Mean Payoff in Markov Decision Processes.",
                    "Finding Polynomial Loop Invariants for Probabilistic Programs.",
                    "Synthesis of Optimal Resilient Control Strategies.",
                    "ForFET: A Formal Feature Evaluation Tool for Hybrid Systems.",
                    "Attacking the V: On the Resiliency of Adaptive-Horizon MPC.",
                    "The Reach-Avoid Problem for Constant-Rate Multi-mode Systems."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "14th ATVA 2016",
        "info": "Chiba, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2016",
                "sub_name": "Automated Technology for Verification and Analysis - 14th International Symposium, ATVA 2016, Chiba, Japan, October 17-20, 2016, Proceedings.",
                "count": 32,
                "papers": [
                    "Synthesizing and Completely Testing Hardware Based on Templates Through Small Numbers of Test Patterns.",
                    "Approximate Policy Iteration for Markov Decision Processes via Quantitative Adaptive Aggregations.",
                    "Optimizing the Expected Mean Payoff in Energy Markov Decision Processes.",
                    "Parameter Synthesis for Markov Models: Faster Than Ever.",
                    "Bounded Model Checking for Probabilistic Programs.",
                    "How Hard is It to Verify Flat Affine Counter Systems with the Finite Monoid Property?",
                    "Solving Language Equations Using Flanked Automata.",
                    "Spot 2.0 - A Framework for LTL and \\omega -Automata Manipulation.",
                    "MoChiBA: Probabilistic LTL Model Checking Using Limit-Deterministic Büchi Automata.",
                    "Synchronous Products of Rewrite Systems.",
                    "Specifying and Verifying Secrecy in Workflows with Arbitrarily Many Agents.",
                    "Lazy Sequentialization for the Safety Verification of Unbounded Concurrent Programs.",
                    "Parallel SMT-Based Parameter Synthesis with Application to Piecewise Multi-affine Systems.",
                    "On Finite Domains in First-Order Linear Temporal Logic.",
                    "Decidability Results for Multi-objective Stochastic Games.",
                    "A Decision Procedure for Separation Logic in SMT.",
                    "Solving Mean-Payoff Games on the GPU.",
                    "Synthesizing Skeletons for Reactive Systems.",
                    "Observational Refinement and Merge for Disjunctive MTSs.",
                    "Equivalence-Based Abstraction Refinement for \\mu HORS Model Checking.",
                    "Greener Bits: Formal Analysis of Demand Response.",
                    "Heuristics for Checking Liveness Properties with Partial Order Reductions.",
                    "Partial-Order Reduction for GPU Model Checking.",
                    "Efficient Verification of Program Fragments: Eager POR.",
                    "Skolem Functions for DQBF.",
                    "STL Model Checking of Continuous and Hybrid Systems.",
                    "Clause Sharing and Partitioning for Cloud-Based SMT Solving.",
                    "Symbolic Model Checking for Factored Probabilistic Models.",
                    "A Sketching-Based Approach for Debugging Using Test Cases.",
                    "Polynomial Invariants by Linear Algebra.",
                    "Certified Symbolic Execution.",
                    "Tighter Loop Bound Analysis."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "13th ATVA 2015",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2015",
                "sub_name": "Automated Technology for Verification and Analysis - 13th International Symposium, ATVA 2015, Shanghai, China, October 12-15, 2015, Proceedings.",
                "count": 35,
                "papers": [
                    "Probabilistic Programming: A True Verification Challenge.",
                    "Machines Reasoning About Machines: 2015.",
                    "Using SMT for Solving Fragments of Parameterised Boolean Equation Systems.",
                    "Unfolding-Based Process Discovery.",
                    "Improving Interpolants for Linear Arithmetic.",
                    "A Mechanically Checked Generation of Correlating Programs Directed by Structured Syntactic Differences.",
                    "On Automated Lemma Generation for Separation Logic with Inductive Definitions.",
                    "Severity Levels of Inconsistent Code.",
                    "Learning the Language of Error.",
                    "Explicit Model Checking of Very Large MDP Using Partitioning and Secondary Storage.",
                    "Model Checking Failure-Prone Open Systems Using Probabilistic Automata.",
                    "Optimal Continuous Time Markov Decisions.",
                    "Spanning the Spectrum from Safety to Liveness.",
                    "Marimba: A Tool for Verifying Properties of Hidden Markov Models.",
                    "ParaVerifier: An Automatic Framework for Proving Parameterized Cache Coherence Protocols.",
                    "ASSA-PBN: An Approximate Steady-State Analyser of Probabilistic Boolean Networks.",
                    "EviCheck: Digital Evidence for Android.",
                    "Lazy-CSeq-SP: Boosting Sequentialization-Based Verification of Multi-threaded C Programs via Symbolic Pruning of Redundant Schedules.",
                    "A Contextual Equivalence Checker for IMJ ∗.",
                    "Trace Diagnostics Using Temporal Implicants.",
                    "Test Case Generation of Actor Systems.",
                    "Lattice-Based Semantics for Combinatorial Model Evolution.",
                    "Effective Verification of Replicated Data Types Using Later Appearance Records (LAR).",
                    "TSO-to-TSO Linearizability Is Undecidable.",
                    "Formal Verification of Infinite-State BIP Models.",
                    "PBMC: Symbolic Slicing for the Verification of Concurrent Programs.",
                    "On the Complexity of Model-Checking Branching and Alternating-Time Temporal Logics in One-Counter Systems.",
                    "Hierarchical Information Patterns and Distributed Strategy Synthesis.",
                    "Cooperative Reactive Synthesis.",
                    "Game Semantic Analysis of Equivalence in IMJ.",
                    "Looking at Mean-Payoff Through Foggy Windows.",
                    "Bounded Verification with On-the-Fly Discrepancy Computation.",
                    "Formal Verification of Simulink/Stateflow Diagrams.",
                    "Decidability of the Reachability for a Family of Linear Vector Fields.",
                    "Stochastic Local Search for Falsification of Hybrid Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "12th ATVA 2014",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2014",
                "sub_name": "Automated Technology for Verification and Analysis - 12th International Symposium, ATVA 2014, Sydney, NSW, Australia, November 3-7, 2014, Proceedings.",
                "count": 29,
                "papers": [
                    "Verifying Communicating Multi-pushdown Systems via Split-Width.",
                    "Booster: An Acceleration-Based Verification Framework for Array Programs.",
                    "A Bounded Model Checker for SPARK Programs.",
                    "Acceleration of Affine Hybrid Transformations.",
                    "A Mechanized Proof of Loop Freedom of the (Untimed) AODV Routing Protocol.",
                    "Quantitative Verification of Weighted Kripke Structures.",
                    "Formal Safety Assessment via Contract-Based Design.",
                    "Verification of Markov Decision Processes Using Learning Algorithms.",
                    "Test Coverage Estimation Using Threshold Accepting.",
                    "On Time with Minimal Expected Cost!",
                    "Fast Debugging of PRISM Models.",
                    "ACME: Automata with Counters, Monoids and Equivalence.",
                    "Modelling and Analysis of Markov Reward Automata.",
                    "Extensional Crisis and Proving Identity.",
                    "Deciding Entailments in Inductive Separation Logic with Tree Automata.",
                    "Liveness Analysis for Parameterised Boolean Equation Systems.",
                    "Rabinizer 3: Safraless Translation of LTL to Small Deterministic Automata.",
                    "PeCAn: Compositional Verification of Petri Nets Made Easy.",
                    "The Context-Freeness Problem Is coNP-Complete for Flat Counter Systems.",
                    "Efficiently and Completely Verifying Synchronized Consistency Models.",
                    "Symmetry Reduction in Infinite Games with Finite Branching.",
                    "Incremental Encoding and Solving of Cardinality Constraints.",
                    "Formal Verification of Skiplists with Arbitrary Many Levels.",
                    "Using Flow Specifications of Parameterized Cache Coherence Protocols for Verifying Deadlock Freedom.",
                    "A Game-Theoretic Approach to Simulation of Data-Parameterized Systems.",
                    "Nested Reachability Approximation for Discrete-Time Markov Chains with Univariate Parameters.",
                    "Symbolic Memory with Pointers.",
                    "Trace Abstraction Refinement for Timed Automata.",
                    "Statistically Sound Verification and Optimization for Complex Systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "11th ATVA 2013",
        "info": "Hanoi, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2013",
                "sub_name": "Automated Technology for Verification and Analysis - 11th International Symposium, ATVA 2013, Hanoi, Vietnam, October 15-18, 2013. Proceedings.",
                "count": 45,
                "papers": [
                    "Acceleration for Petri Nets.",
                    "Automated Verification and Strategy Synthesis for Probabilistic Systems.",
                    "SMT-Based Software Model Checking - Explicit Scheduler, Symbolic Threads.",
                    "Effective Translation of LTL to Deterministic Rabin Automata: Beyond the (F, G)-Fragment.",
                    "Improved Upper and Lower Bounds for Büchi Disambiguation.",
                    "Time-Bounded Reachability for Monotonic Hybrid Automata: Complexity and Fixed Points.",
                    "An Automatic Technique for Checking the Simulation of Timed Systems.",
                    "Synthesis of Bounded Integer Parameters for Parametric Timed Reachability Games.",
                    "Kleene Algebras and Semimodules for Energy Problems.",
                    "Looking at Mean-Payoff and Total-Payoff through Windows.",
                    "Weighted Safety.",
                    "A Framework for Ranking Vacuity Results.",
                    "Synthesizing Masking Fault-Tolerant Systems from Deontic Specifications.",
                    "Verification of a Dynamic Management Protocol for Cloud Applications.",
                    "Compact Symbolic Execution.",
                    "Multi-threaded Explicit State Space Exploration with State Reconstruction.",
                    "Verification of Heap Manipulating Programs with Ordered Data by Extended Forest Automata.",
                    "Integrating Policy Iterations in Abstract Interpreters.",
                    "Interpolation Properties and SAT-Based Model Checking.",
                    "Analysis of Message Passing Programs Using SMT-Solvers.",
                    "An Expressive Framework for Verifying Deadlock Freedom.",
                    "Expected Termination Time in BPA Games.",
                    "Precise Cost Analysis via Local Reasoning.",
                    "Control Flow Refinement and Symbolic Computation of Average Case Bound.",
                    "Termination and Cost Analysis of Loops with Concurrent Interleavings.",
                    "Linear Ranking for Linear Lasso Programs.",
                    "Merge and Conquer: State Merging in Parametric Timed Automata.",
                    "An Automata-Theoretic Approach to Reasoning about Parameterized Systems and Specifications.",
                    "Pushdown Systems with Stack Manipulation.",
                    "Robustness Analysis of String Transducers.",
                    "Manipulating LTL Formulas Using Spot 1.0.",
                    "Rabinizer 2: Small Deterministic Automata for LTL ∖ GU.",
                    "LTL Model Checking with Neco.",
                    "Solving Parity Games on the GPU.",
                    "PyEcdar: Towards Open Source Implementation for Timed Systems.",
                    "CCMC: A Conditional CSL Model Checker for Continuous-Time Markov Chains.",
                    "NLTOOLBOX: A Library for Reachability Computation of Nonlinear Dynamical Systems.",
                    "CELL: A Compositional Verification Framework.",
                    "VCS: A Verifier for Component-Based Systems.",
                    "SmacC: A Retargetable Symbolic Execution Engine.",
                    "MoTraS: A Tool for Modal Transition Systems and Their Extensions.",
                    "Cunf: A Tool for Unfolding and Verifying Petri Nets with Read Arcs.",
                    "SAT Based Verification of Network Data Planes.",
                    "A Theory for Control-Flow Graph Exploration.",
                    "The Quest for Precision: A Layered Approach for Data Race Detection in Static Analysis."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "10th ATVA 2012",
        "info": "Thiruvananthapuram, India",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2012",
                "sub_name": "Automated Technology for Verification and Analysis - 10th International Symposium, ATVA 2012, Thiruvananthapuram, India, October 3-6, 2012. Proceedings.",
                "count": 32,
                "papers": [
                    "Verification of Computer Switching Networks: An Overview.",
                    "Dynamic Bayesian Networks: A Factored Model of Probabilistic Dynamics.",
                    "Interpolant Automata - (Invited Talk).",
                    "Approximating Deterministic Lattice Automata.",
                    "Tight Bounds for the Determinisation and Complementation of Generalised Büchi Automata.",
                    "A Succinct Canonical Register Automaton Model for Data Domains with Binary Relations.",
                    "Rabinizer: Small Deterministic Automata for LTL(F, G).",
                    "The Unary Fragments of Metric Interval Temporal Logic: Bounded versus Lower Bound Constraints.",
                    "On Temporal Logic and Signal Processing.",
                    "Improved Single Pass Algorithms for Resolution Proof Reduction.",
                    "Model Checking Systems and Specifications with Parameterized Atomic Propositions.",
                    "Reachability Analysis of Polynomial Systems Using Linear Programming Relaxations.",
                    "Linear-Time Model-Checking for Multithreaded Programs under Scope-Bounding.",
                    "Accurate Invariant Checking for Programs Manipulating Lists and Arrays with Infinite Data.",
                    "A Verifier for Functional Properties of Sequence-Manipulating Programs.",
                    "Accelerating Interpolants.",
                    "FunFrog: Bounded Model Checking with Interpolation-Based Function Summarization.",
                    "Synthesis of Succinct Systems.",
                    "Controllers with Minimal Observation Power (Application to Timed Systems).",
                    "Counterexample Guided Synthesis of Monitors for Realizability Enforcement.",
                    "Parallel Assertions for Architectures with Weak Memory Models.",
                    "Improved Multi-Core Nested Depth-First Search.",
                    "An Experiment on Parallel Model Checking of a CTL Fragment.",
                    "Variable Probabilistic Abstraction Refinement.",
                    "Pareto Curves for Probabilistic Model Checking.",
                    "Verification of Partial-Information Probabilistic Systems Using Counterexample-Guided Refinements.",
                    "The COMICS Tool - Computing Minimal Counterexamples for DTMCs.",
                    "Computing Minimal Separating DFAs and Regular Invariants Using SAT and SMT Solvers.",
                    "ALLQBF Solving by Computational Learning.",
                    "Equivalence of Games with Probabilistic Uncertainty and Partial-Observation Games.",
                    "A Probabilistic Kleene Theorem.",
                    "Higher-Order Approximations for Verification of Stochastic Hybrid Systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "9th ATVA 2011",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2011",
                "sub_name": "Automated Technology for Verification and Analysis, 9th International Symposium, ATVA 2011, Taipei, Taiwan, October 11-14, 2011. Proceedings.",
                "count": 41,
                "papers": [
                    "Statistical Model Checking for Cyber-Physical Systems.",
                    "Max and Sum Semantics for Alternating Weighted Automata.",
                    "Making Software Verification Tools Really Work.",
                    "Synthesizing, Verifying, and Debugging SoC with FSM-Based Specification of On-Chip Communication Protocols.",
                    "Automated Analysis of Industrial Embedded Software.",
                    "Nondeterministic Update of CTL Models by Preserving Satisfaction through Protections.",
                    "Type-Based Automated Verification of Authenticity in Asymmetric Cryptographic Protocols.",
                    "Formalization of Finite-State Discrete-Time Markov Chains in HOL.",
                    "An Alternative Definition for Timed Automata Composition.",
                    "Model Checking EGF on Basic Parallel Processes.",
                    "Measuring Permissiveness in Parity Games: Mean-Payoff Parity Games Revisited.",
                    "Algorithms for Synthesizing Priorities in Component-Based Systems.",
                    "Trust Metrics for the SPKI/SDSI Authorisation Framework.",
                    "Antichain-Based QBF Solving.",
                    "A Hierarchical Approach for the Synthesis of Stabilizing Controllers for Hybrid Systems.",
                    "Formal Analysis of Online Algorithms.",
                    "Modal Transition Systems: Composition and LTL Model Checking.",
                    "Efficient Inclusion Checking on Explicit and Semi-symbolic Tree Automata.",
                    "Assembling Sessions.",
                    "Parametric Modal Transition Systems.",
                    "Policy Iteration within Logico-Numerical Abstract Domains.",
                    "Small Strategies for Safety Games.",
                    "Multi-core Nested Depth-First Search.",
                    "Self-Loop Aggregation Product - A New Hybrid Approach to On-the-Fly LTL Model Checking.",
                    "A Lightweight Approach for Loop Summarization.",
                    "A Succinct Canonical Register Automaton Model.",
                    "Parallel Nested Depth-First Searches for LTL Model Checking.",
                    "Evaluating LTL Satisfiability Solvers.",
                    "McAiT - A Timing Analyzer for Multicore Real-Time Software.",
                    "MIO Workbench: A Tool for Compositional Design with Modal Input/Output Interfaces.",
                    "The Buck Stops Here: Order, Chance, and Coordination in Distributed Control.",
                    "Symbolic Verification and Test Generation for a Network of Communicating FSMs.",
                    "Hierarchical Counterexamples for Discrete-Time Markov Chains.",
                    "Efficient Loop Navigation for Symbolic Execution.",
                    "An Efficient Algorithm for Learning Event-Recording Automata.",
                    "Discretizing Affine Hybrid Automata with Uncertainty.",
                    "What's Decidable about Weighted Automata?",
                    "Widening with Thresholds for Programs with Complex Control Graphs.",
                    "Linear Hybrid System Falsification through Local Search.",
                    "Learning-Based Compositional Verification for Synchronous Probabilistic Systems.",
                    "An Algorithmic Framework for Synthesis of Concurrent Programs."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "8th ATVA 2010",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2010",
                "sub_name": "Automated Technology for Verification and Analysis - 8th International Symposium, ATVA 2010, Singapore, September 21-24, 2010. Proceedings.",
                "count": 33,
                "papers": [
                    "Probabilistic Automata on Infinite Words: Decidability and Undecidability Results.",
                    "Abstraction Learning.",
                    "Synthesis: Words and Traces.",
                    "Promptness in omega-Regular Automata.",
                    "Using Redundant Constraints for Refinement.",
                    "Methods for Knowledge Based Controlling of Distributed Systems.",
                    "Composing Reachability Analyses of Hybrid Systems for Safety and Stability.",
                    "The Complexity of Codiagnosability for Discrete Event and Timed Systems.",
                    "On Scenario Synchronization.",
                    "Compositional Algorithms for LTL Synthesis.",
                    "What's Decidable about Sequences?",
                    "A Study of the Convergence of Steady State Probabilities in a Closed Fork-Join Network.",
                    "Lattice-Valued Binary Decision Diagrams.",
                    "A Specification Logic for Exceptions and Beyond.",
                    "Non-monotonic Refinement of Control Abstraction for Concurrent Programs.",
                    "An Approach for Class Testing from Class Contracts.",
                    "Efficient On-the-Fly Emptiness Check for Timed Büchi Automata.",
                    "Reachability as Derivability, Finite Countermodels and Verification.",
                    "LTL Can Be More Succinct.",
                    "Automatic Generation of History-Based Access Control from Information Flow Specification.",
                    "Auxiliary Constructs for Proving Liveness in Compassion Discrete Systems.",
                    "Symbolic Unfolding of Parametric Stopwatch Petri Nets.",
                    "Recursive Timed Automata.",
                    "Probabilistic Contracts for Component-Based Design.",
                    "Model-Checking Web Applications with Web-TLR.",
                    "GAVS: Game Arena Visualization and Synthesis.",
                    "CRI: Symbolic Debugger for MCAPI Applications.",
                    "MCGP: A Software Synthesis Tool Based on Model Checking and Genetic Programming.",
                    "ECDAR: An Environment for Compositional Design and Analysis of Real Time Systems.",
                    "Developing Model Checkers Using PAT.",
                    "YAGA: Automated Analysis of Quantitative Safety Specifications in Probabilistic B.",
                    "COMBINE: A Tool on Combined Formal Methods for Bindingly Verification.",
                    "Rbminer: A Tool for Discovering Petri Nets from Transition Systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "7th ATVA 2009",
        "info": "Macao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2009",
                "sub_name": "Automated Technology for Verification and Analysis, 7th International Symposium, ATVA 2009, Macao, China, October 14-16, 2009. Proceedings.",
                "count": 29,
                "papers": [
                    "Verifying VLSI Circuits.",
                    "3-Valued Abstraction for (Bounded) Model Checking.",
                    "Local Search in Model Checking.",
                    "Exploring the Scope for Partial Order Reduction.",
                    "State Space Reduction of Linear Processes Using Control Flow Reconstruction.",
                    "A Data Symmetry Reduction Technique for Temporal-epistemic Logic.",
                    "TAPAAL: Editor, Simulator and Verifier of Timed-Arc Petri Nets.",
                    "CLAN: A Tool for Contract Analysis and Conflict Discovery.",
                    "UnitCheck: Unit Testing and Model Checking Combined.",
                    "LTL Model Checking of Time-Inhomogeneous Markov Chains.",
                    "Statistical Model Checking Using Perfect Simulation.",
                    "Quantitative Analysis under Fairness Constraints.",
                    "A Decompositional Proof Scheme for Automated Convergence Proofs of Stochastic Hybrid Systems.",
                    "Memory Usage Verification Using Hip/Sleek.",
                    "Solving Parity Games in Practice.",
                    "Automated Analysis of Data-Dependent Programs with Dynamic Memory.",
                    "On-the-fly Emptiness Check of Transition-Based Streett Automata.",
                    "On Minimal Odd Rankings for Büchi Complementation.",
                    "Specification Languages for Stutter-Invariant Regular Properties.",
                    "Incremental False Path Elimination for Static Software Analysis.",
                    "A Framework for Compositional Verification of Multi-valued Systems via Abstraction-Refinement.",
                    "Don't Know for Multi-valued Systems.",
                    "Logahedra: A New Weakly Relational Domain.",
                    "Synthesis of Fault-Tolerant Distributed Systems.",
                    "Formal Verification for High-Assurance Behavioral Synthesis.",
                    "Dynamic Observers for the Synthesis of Opaque Systems.",
                    "Symbolic CTL Model Checking of Asynchronous Systems Using Constrained Saturation.",
                    "LTL Model Checking for Recursive Programs.",
                    "On Detecting Regular Predicates in Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "6th ATVA 2008",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2008",
                "sub_name": "Automated Technology for Verification and Analysis, 6th International Symposium, ATVA 2008, Seoul, Korea, October 20-23, 2008. Proceedings.",
                "count": 36,
                "papers": [
                    "Tests, Proofs and Refinements.",
                    "Formal Verification and Biology.",
                    "Trust and Automation in Verification Tools.",
                    "CTLModel-Checking with Graded Quantifiers.",
                    "Genetic Programming and Model Checking: Synthesizing New Mutual Exclusion Algorithms.",
                    "Computation Tree Regular Logic for Genetic Regulatory Networks.",
                    "Compositional Verification for Component-Based Systems and Application.",
                    "A Direct Algorithm for Multi-valued Bounded Model Checking.",
                    "Model Checking Recursive Programs with Exact Predicate Abstraction.",
                    "Loop Summarization Using Abstract Transformers.",
                    "Dynamic Model Checking with Property Driven Pruning to Detect Race Conditions.",
                    "Automating Algebraic Specifications of Non-freely Generated Data Types.",
                    "Interpolants for Linear Arithmetic in SMT.",
                    "SAT Modulo ODE: A Direct SAT Approach to Hybrid Systems.",
                    "SMELS: Satisfiability Modulo Equality with Lazy Superposition.",
                    "Controllable Test Cases for the Distributed Test Architecture.",
                    "Goanna: Syntactic Software Model Checking.",
                    "A Dynamic Assertion-Based Verification Platform for Validation of UML Designs.",
                    "CheckSpec: A Tool for Consistency and Coverage Analysis of Assertion Specifications.",
                    "DiVinE Multi-Core - A Parallel LTL Model-Checker.",
                    "Alaska.",
                    "NetQi: A Model Checker for Anticipation Game.",
                    "Component-Based Design and Analysis of Embedded Systems with UPPAAL PORT.",
                    "Time-Progress Evaluation for Dense-Time Automata with Concave Path Conditions.",
                    "Decidable Compositions of O-Minimal Automata.",
                    "On the Applicability of Stochastic Petri Nets for Analysis of Multiserver Retrial Systems with Different Vacation Policies.",
                    "Model Based Importance Analysis for Minimal Cut Sets.",
                    "Approximate Invariant Property Checking Using Term-Height Reduction for a Subset of First-Order Logic.",
                    "Tree Pattern Rewriting Systems.",
                    "Deciding Bisimilarity of Full BPA Processes Locally.",
                    "Optimal Strategy Synthesis in Request-Response Games.",
                    "Authentication Revisited: Flaw or Not, the Recursive Authentication Protocol.",
                    "Impartial Anticipation in Runtime-Verification.",
                    "Run-Time Monitoring of Electronic Contracts.",
                    "Practical Efficient Modular Linear-Time Model-Checking.",
                    "Passive Testing of Timed Systems."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "5th ATVA 2007",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2007",
                "sub_name": "Automated Technology for Verification and Analysis, 5th International Symposium, ATVA 2007, Tokyo, Japan, October 22-25, 2007, Proceedings.",
                "count": 40,
                "papers": [
                    "Policies and Proofs for Code Auditing.",
                    "Recent Trend in Industry and Expectation to DA Research.",
                    "Toward Property-Driven Abstraction for Heap Manipulating Programs.",
                    "Branching vs. Linear Time: Semantical Perspective.",
                    "Mind the Shapes: Abstraction Refinement Via Topology Invariants.",
                    "Complete SAT-Based Model Checking for Context-Free Processes.",
                    "Bounded Model Checking of Analog and Mixed-Signal Circuits Using an SMT Solver.",
                    "Model Checking Contracts - A Case Study.",
                    "On the Efficient Computation of the Minimal Coverability Set for Petri Nets.",
                    "Analog/Mixed-Signal Circuit Verification Using Models Generated from Simulation Traces.",
                    "Automatic Merge-Point Detection for Sequential Equivalence Checking of System-Level and RTL Descriptions.",
                    "Proving Termination of Tree Manipulating Programs.",
                    "Symbolic Fault Tree Analysis for Reactive Systems.",
                    "Computing Game Values for Crash Games.",
                    "Timed Control with Observation Based and Stuttering Invariant Strategies.",
                    "Deciding Simulations on Probabilistic Automata.",
                    "Mechanizing the Powerset Construction for Restricted Classes of omega -Automata.",
                    "Verifying Heap-Manipulating Programs in an SMT Framework.",
                    "A Generic Constructive Solution for Concurrent Games with Expressive Constraints on Strategies.",
                    "Distributed Synthesis for Alternating-Time Logics.",
                    "Timeout and Calendar Based Finite State Modeling and Verification of Real-Time Systems.",
                    "Efficient Approximate Verification of Promela Models Via Symmetry Markers.",
                    "Latticed Simulation Relations and Games.",
                    "Providing Evidence of Likely Being on Time: Counterexample Generation for CTMC Model Checking.",
                    "Assertion-Based Proof Checking of Chang-Roberts Leader Election in PVS.",
                    "Continuous Petri Nets: Expressive Power and Decidability Issues.",
                    "Quantifying the Discord: Order Discrepancies in Message Sequence Charts.",
                    "A Formal Methodology to Test Complex Heterogeneous Systems.",
                    "A New Approach to Bounded Model Checking for Branching Time Logics.",
                    "Exact State Set Representations in the Verification of Linear Hybrid Systems with Large Discrete State Space.",
                    "A Compositional Semantics for Dynamic Fault Trees in Terms of Interactive Markov Chains.",
                    "3-Valued Circuit SAT for STE with Automatic Refinement.",
                    "Bounded Synthesis.",
                    "Formal Modeling and Verification of High-Availability Protocol for Network Security Appliances.",
                    "A Brief Introduction to THOTL.",
                    "On-the-Fly Model Checking of Fair Non-repudiation Protocols.",
                    "Model Checking Bounded Prioritized Time Petri Nets.",
                    "Using Patterns and Composite Propositions to Automate the Generation of LTL Specifications.",
                    "Pruning State Spaces with Extended Beam Search.",
                    "Using Counterexample Analysis to Minimize the Number of Predicates for Predicate Abstraction."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "4th ATVA 2006",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2006",
                "sub_name": "Automated Technology for Verification and Analysis, 4th International Symposium, ATVA 2006, Beijing, China, October 23-26, 2006.",
                "count": 38,
                "papers": [
                    "Analysis of Recursive Probabilistic Models.",
                    "Verification Challenges and Opportunities in the New Era of Microprocessor Design.",
                    "Automated Abstraction of Software.",
                    "Symmetry Reduction for Probabilistic Model Checking Using Generic Representatives.",
                    "Eager Markov Chains.",
                    "A Probabilistic Learning Approach for Counterexample Guided Abstraction Refinement.",
                    "A Fine-Grained Fullness-Guided Chaining Heuristic for Symbolic Reachability Analysis.",
                    "Model Checking Timed Systems with Urgencies.",
                    "Whodunit? Causal Analysis for Counterexamples.",
                    "On the Membership Problem for Visibly Pushdown Languages.",
                    "On the Construction of Fine Automata for Safety Properties.",
                    "On the Succinctness of Nondeterminism.",
                    "Efficient Algorithms for Alternating Pushdown Systems with an Application to the Computation of Certificate Chains.",
                    "Compositional Reasoning for Hardware/Software Co-verification.",
                    "Learning-Based Symbolic Assume-Guarantee Reasoning with Automatic Decomposition.",
                    "On the Satisfiability of Modular Arithmetic Formulae.",
                    "Selective Approaches for Solving Weak Games.",
                    "Controller Synthesis and Ordinal Automata.",
                    "Effective Contraction of Timed STGs for Decomposition Based Timed Circuit Synthesis.",
                    "Synthesis for Probabilistic Environments.",
                    "Branching-Time Property Preservation Between Real-Time Systems.",
                    "Automatic Verification of Hybrid Systems with Large Discrete State Space.",
                    "Timed Unfoldings for Networks of Timed Automata.",
                    "Symbolic Unfoldings for Networks of Timed Automata.",
                    "Ranked Predicate Abstraction for Branching Time: Complete, Incremental, and Precise.",
                    "Timed Temporal Logics for Abstracting Transient States.",
                    "Predicate Abstraction of Programs with Non-linear Computation.",
                    "A Fresh Look at Testing for Asynchronous Communication.",
                    "Proactive Leader Election in Asynchronous Shared Memory Systems.",
                    "A Semantic Framework for Test Coverage.",
                    "Monotonic Set-Extended Prefix Rewriting and Verification of Recursive Ping-Pong Protocols.",
                    "Analyzing Security Protocols in Hierarchical Networks.",
                    "Functional Analysis of a Real-Time Protocol for Networked Control Systems.",
                    "Symbolic Semantics for the Verification of Security Properties of Mobile Petri Nets.",
                    "Sigref- A Symbolic Bisimulation Tool Box.",
                    "Towards a Model-Checker for Counter Systems.",
                    "The Implementation of Mazurkiewicz Traces in POEM.",
                    "Model-Based Tool-Chain Infrastructure for Automated Analysis of Embedded Systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "3rd ATVA 2005",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2005",
                "sub_name": "Automated Technology for Verification and Analysis, Third International Symposium, ATVA 2005, Taipei, Taiwan, October 4-7, 2005, Proceedings.",
                "count": 36,
                "papers": [
                    "Ranking Abstraction as a Companion to Predicate Abstraction, .",
                    "Termination and Invariance Analysis of Loops.",
                    "Some Perspectives of Infinite-State Verification.",
                    "Verifying Very Large Industrial Circuits Using 100 Processes and Beyond.",
                    "A New Reachability Algorithm for Symmetric Multi-processor Architecture.",
                    "Comprehensive Verification Framework for Dependability of Self-optimizing Systems.",
                    "Exploiting Hub States in Automatic Verification.",
                    "An Approach for the Verification of SystemC Designs Using AsmL.",
                    "Decomposition-Based Verification of Cyclic Workflows.",
                    "Guaranteed Termination in the Verification of LTL Properties of Non-linear Robust Discrete Time Hybrid Systems.",
                    "Computation Platform for Automatic Analysis of Embedded Software Systems Using Model Based Approach.",
                    "Quantitative and Qualitative Analysis of Temporal Aspects of Complex Activities.",
                    "Automatic Test Case Generation with Region-Related Coverage Annotations for Real-Time Systems.",
                    "Selective Search in Bounded Model Checking of Reachability Properties.",
                    "Predicate Abstraction of RTL Verilog Descriptions Using Constraint Logic Programming.",
                    "State Space Exploration of Object-Based Systems Using Equivalence Reduction and the Sweepline Method.",
                    "Syntactical Colored Petri Nets Reductions.",
                    "Algorithmic Algebraic Model Checking II: Decidability of Semi-algebraic Model Checking and Its Applications to Systems Biology.",
                    "A Static Analysis Using Tree Automata for XML Access Control.",
                    "Reasoning About Transfinite Sequences.",
                    "Semi-automatic Distributed Synthesis.",
                    "A New Graph of Classes for the Preservation of Quantitative Temporal Constraints.",
                    "Comparison of Different Semantics for Time Petri Nets.",
                    "Introducing Dynamic Properties with Past Temporal Operators in the B Refinement.",
                    "Approximate Reachability for Dead Code Elimination in Esterel.",
                    "Synthesis of Interface Automata.",
                    "Multi-valued Model Checking Games.",
                    "Model Checking Prioritized Timed Automata.",
                    "An MTBDD-Based Implementation of Forward Reachability for Probabilistic Timed Automata.",
                    "An EFSM-Based Intrusion Detection System for Ad Hoc Networks.",
                    "Modeling and Verification of a Telecommunication Application Using Live Sequence Charts and the Play-Engine Tool.",
                    "Formal Construction and Verification of Home Service Robots: A Case Study.",
                    "Model Checking Real Time Java Using Java PathFinder.",
                    "Using Parametric Automata for the Verification of the Stop-and-Wait Class of Protocols.",
                    "Flat Acceleration in Symbolic Model Checking.",
                    "Flat Counter Automata Almost Everywhere!"
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "2nd ATVA 2004",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/atva/2004",
                "sub_name": "Automated Technology for Verification and Analysis: Second International Conference, ATVA 2004, Taipei, Taiwan, ROC, October 31-November 3, 2004. Proceedings.",
                "count": 45,
                "papers": [
                    "Games for Formal Design and Verification of Reactive Systems.",
                    "Evolution of Model Checking into the EDA Industry.",
                    "Abstraction Refinement.",
                    "Tools for Automated Verification of Web Services.",
                    "Theorem Proving Languages for Verification.",
                    "An Automated Rigorous Review Method for Verifying and Validating Formal Specifications.",
                    "Toward Unbounded Model Checking for Region Automata.",
                    "Search Space Partition and Case Basis Exploration for Reducing Model Checking Complexity.",
                    "Synthesising Attacks on Cryptographic Protocols.",
                    "Büchi Complementation Made Tighter.",
                    "SAT-Based Verification of Safe Petri Nets.",
                    "Disjunctive Invariants for Numerical Systems.",
                    "Validity Checking for Quantifier-Free First-Order Logic with Equality Using Substitution of Boolean Formulas.",
                    "Fair Testing Revisited: A Process-Algebraic Characterisation of Conflicts.",
                    "Exploiting Symmetries for Testing Equivalence in the Spi Calculus.",
                    "Using Block-Local Atomicity to Detect Stale-Value Concurrency Errors.",
                    "Abstraction-Based Model Checking Using Heuristical Refinement.",
                    "A Global Timed Bisimulation Preserving Abstraction for Parametric Time-Interval Automata.",
                    "Design and Evaluation of a Symbolic and Abstraction-Based Model Checker.",
                    "Component-Wise Instruction-Cache Behavior Prediction.",
                    "Validating the Translation of an Industrial Optimizing Compiler.",
                    "Composition of Accelerations to Verify Infinite Heterogeneous Systems.",
                    "Hybrid System Verification Is Not a Sinecure: The Electronic Throttle Control Case Study.",
                    "Providing Automated Verification in HOL Using MDGs.",
                    "Specification, Abduction, and Proof.",
                    "Introducing Structural Dynamic Changes in Petri Nets: Marked-Controlled Reconfigurable Nets.",
                    "Typeness for omega-Regular Automata.",
                    "Partial Order Reduction for Detecting Safety and Timing Failures of Timed Circuits.",
                    "Mutation Coverage Estimation for Model Checking.",
                    "Modular Model Checking of Software Specifications with Simultaneous Environment Generation.",
                    "Rabin Tree and Its Application to Group Key Distribution.",
                    "Using Overlay Networks to Improve VoIP Reliability.",
                    "Integrity-Enhanced Verification Scheme for Software-Intensive Organizations.",
                    "RCGES: Retargetable Code Generation for Embedded Systems.",
                    "Verification of Analog and Mixed-Signal Circuits Using Timed Hybrid Petri Nets.",
                    "First-Order LTL Model Checking Using MDGs.",
                    "Localizing Errors in Counterexample with Iteratively Witness Searching.",
                    "Verification of WCDMA Protocols and Implementation.",
                    "Efficient Representation of Algebraic Expressions.",
                    "Development of RTOS for PLC Using Formal Methods.",
                    "Reducing Parametric Automata: A Multimedia Protocol Service Case Study.",
                    "Synthesis of State Feedback Controllers for Parameterized Discrete Event Systems.",
                    "Solving Box-Pushing Games via Model Checking with Optimizations.",
                    "CLP Based Static Property Checking.",
                    "A Temporal Assertion Extension to Verilog."
                ]
            }
        ]
    }
]