[
    {
        "name": "CL",
        "year": "2018",
        "info": "2018: Volumes\n51,\n52,\n53,\n54",
        "count": 48,
        "papers": [
            "FP-ABC: Fuzzy-Pareto dominance driven artificial bee colony algorithm for many-objective software module clustering.",
            "A flexible framework for studying trace-based just-in-time compilation.",
            "Exploration of modularity and reusability of domain-specific languages: an expression DSL in MetaMod.",
            "μ-DSU: A Micro-Language Based Approach to Dynamic Software Updating.",
            "An object model for dynamic mixins.",
            "Domain-specific languages in Prolog for declarative expert knowledge in rules and ontologies.",
            "Usability driven DSL development with USE-ME.",
            "Effective Implementation of Matrix-Vector Multiplication on Intel's AVX multicore Processor.",
            "Towards a completely extensible dynamic geometry software with metadata.",
            "Dragonfly: A multi-platform parallel toolbox for MATLAB/Octave.",
            "Systematic mapping study of template-based code generation.",
            "Special issue on Trends in Functional Programming 2013/14.",
            "Call Arity.",
            "Type generic observation of intermediate data structures for debugging lazy functional programs.",
            "Aspect composition for multiple target languages using LARA.",
            "A two-phase software reliability modeling involving with software fault dependency and imperfect fault removal.",
            "A process-oriented modeling approach for graphical development of mobile business apps.",
            "Automatic assessment of Java code.",
            "How do developers use dynamic features? The case of Ruby.",
            "Automated modelling assistance by integrating heterogeneous information sources.",
            "MMFilter : A CHR-Based Solver for Generation of Executions under Weak Memory Models.",
            "Data access skipping for recursive partitioning methods.",
            "Supercombinator set acquired from context-free grammar samples.",
            "Using the local context for the definition and implementation of visual languages.",
            "Design and implementation of DeepDSL: A DSL for deep learning.",
            "SAwUML - UML-based, contractual software architectures and their formal analysis using SPIN.",
            "CIaaS - computational intelligence as a service with Athena.",
            "Coding Ants: Optimization of GPU code using ant colony optimization.",
            "Concern-oriented language development (COLD): Fostering reuse in language engineering.",
            "Automatized integration of a contextual model into a process with data variability.",
            "Attributed and n-ary relations in OWL for knowledge modeling.",
            "On domain driven design using annotation-based domain specific language.",
            "QoSMOS: QoS metrics management tool suite.",
            "REDOSPLAT: A readable domain-specific language for timetabling requirements definition.",
            "On transparent value-sensitive run-time monitoring for information flow policies.",
            "An Event-B-based approach to hybrid systems engineering and its application to a hemodialysis machine case study.",
            "FLANDM: a development framework of domain-specific languages for data mining democratisation.",
            "Automatic production of end user documentation for DSLs.",
            "A scalable model based approach for data model evolution: Application to space missions data models.",
            "Software language engineering in the large: towards composing and deriving languages.",
            "SDAC: A model for analysis of the execution semantics of data processing framework in cloud.",
            "A change-aware per-file analysis to compile configurable systems with #ifdefs.",
            "Personalized recommender systems for product-line configuration processes.",
            "Special issue on quality in Model-Driven Engineering.",
            "Achieving model quality through model validation, verification and exploration.",
            "Frame conditions in the automatic validation and verification of UML/OCL models: A symbolic formulation of modifies only statements.",
            "Case studies on automated verification with slope boundaries for block diagrams.",
            "Improving formal analysis of state machines with particular emphasis on and-cross transitions."
        ]
    },
    {
        "name": "CL",
        "year": "2017",
        "info": "2017: Volumes\n47,\n48,\n49,\n50",
        "count": 41,
        "papers": [
            "Special issue on the 16th International Conference on Verification, Model Checking, and Abstract Interpretation.",
            "Horn clause verification with convex polyhedral abstraction and tree automata-based refinement.",
            "A hierarchy of proof rules for checking positive invariance of algebraic and semi-algebraic sets.",
            "Automatic synthesis of k-inductive piecewise quadratic invariants for switched affine control programs.",
            "Effective abstractions for verification under relaxed memory models.",
            "Inference of ranking functions for proving temporal properties by abstract interpretation.",
            "An array content static analysis based on non-contiguous partitions.",
            "Optimisation of language-integrated queries by query unnesting.",
            "Special issue on search-based techniques and their hybridizations in software engineering.",
            "Harmony search based remodularization for object-oriented software systems.",
            "Refinement of structural heuristics for model checking of concurrent programs through data mining.",
            "Evolutionary robust optimization for software product line scoping: An explorative study.",
            "Empirical analysis of search based algorithms to identify change prone classes of open source software.",
            "Special Issue on the 2015 International Conference on Generative Programming: Concepts & Experiences (GPCE).",
            "Facilitating the development of cross-platform software via automated code synthesis from web-based programming resources.",
            "Leveraging variability modeling to address metamodel revisions in Model-based Software Product Lines.",
            "Modular interpreters with implicit context propagation.",
            "SafeGPU: Contract- and library-based GPGPU for object-oriented languages.",
            "Generative software product line development using variability-aware design patterns.",
            "Formal specification and integration of distributed security policies.",
            "Model-based analysis of Java EE web security misconfigurations.",
            "Implementing a performant scheme interpreter for the web in asm.js.",
            "Temporal constrained objects: Application and implementation.",
            "Customizing host IDE for non-programming users of pure embedded DSLs: A case study.",
            "Seamless requirements.",
            "An approach to build XML-based domain specific languages solutions for client-side web applications.",
            "A domain-specific language for model mutation and its application to the automated generation of exercises.",
            "Special issue on Flexible Model Driven Engineering.",
            "Safe model polymorphism for flexible modeling.",
            "A text-based visual notation for the unit testing of model-driven tools.",
            "Constraint programming for type inference in flexible model-driven engineering.",
            "Synthesizing test scenarios in UML activity diagram using a bio-inspired approach.",
            "Amake: cached builds of top-level targets.",
            "Financial information description language and visualization/analysis tools.",
            "CL_ARRAY: A new generic library of multidimensional containers for c++ compilers with extension for OpenCL framework.",
            "Atomistic Galois insertions for flow sensitive integrity.",
            "On different LL and LR parsers used in LLLR parsing.",
            "Model driven approach for real-time requirement analysis of multi-agent systems.",
            "Special issue on model-driven engineering of multi-agent systems in theory and practice.",
            "Agent-oriented model-driven development for JADE with the JADEL programming language.",
            "User-story driven development of multi-agent systems: A process fragment for agile methods."
        ]
    },
    {
        "name": "CL",
        "year": "2016",
        "info": "2016: Volumes\n45,\n46",
        "count": 22,
        "papers": [
            "Implementing design patterns as parametric aspects using ParaAJ: The case of the singleton, observer, and decorator design patterns.",
            "Language components for modular DSLs using traits.",
            "Ontological approach for DSL development.",
            "Statistical model checking of Timed Rebeca models.",
            "Programming with event loops and control loops - From actors to agents.",
            "Revisiting actor programming in C++.",
            "Domains: Sharing state in the communicating event-loop actor model.",
            "Special issue on the 3rd and 4th ACM SIGPLAN workshops on programming based on actors, agents, and decentralized control (AGERE! 2013/2014).",
            "Special issue on the programming languages track at the 30th ACM symposium on applied computing.",
            "Ann: A domain-specific language for the effective design and validation of Java annotations.",
            "Lightweight runtime checking of C programs with RTC.",
            "A semantic approach for automated test oracle generation.",
            "Over-exposed classes in Java: An empirical study.",
            "Specification and static enforcement of scheduler-independent noninterference in a middleweight Java.",
            "Recording concerns in source code using annotations.",
            "Lightweight and static verification of UML executable models.",
            "Efficient determinization of visibly and height-deterministic pushdown automata.",
            "Design pattern oriented development of model transformations.",
            "A framework for early design and prototyping of service-oriented applications with design patterns.",
            "Detection of redundant expressions: A precise, efficient, and pragmatic algorithm in SSA.",
            "Mapping stream programs onto multicore platforms by local search and genetic algorithm.",
            "Leveraging Software Product Lines Engineering in the development of external DSLs: A systematic literature review."
        ]
    },
    {
        "name": "CL",
        "year": "2015",
        "info": "2015: Volumes\n41,\n42,\n43,\n44",
        "count": 33,
        "papers": [
            "A type-safe embedding of SQL into Java using the extensible compiler framework J%.",
            "A methodology for speeding up loop kernels by exploiting the software information and the memory architecture.",
            "An analysis of metamodeling practices for MOF and OCL.",
            "Special issue on the Programming languages track at the 29th ACM symposium on applied computing.",
            "A formal semantics of nested atomic sections with thread escape.",
            "Fully abstract trace semantics for protected module architectures.",
            "An on-the-fly grammar modification mechanism for composing and defining extensible languages.",
            "Neverlang: A framework for feature-oriented language development.",
            "The abstract domain of Trapezoid Step Functions.",
            "A DSL for modeling application-specific functionalities of business applications.",
            "Automatic validation for binary translation.",
            "Grammar-based model transformations: Definition, execution, and quality properties.",
            "Model-driven engineering: A survey supported by the unified conceptual model.",
            "Special Issue on the 6th and 7th International Conferences on Software Language Engineering (SLE 2013 and SLE 2014).",
            "Declarative rewriting through circular nonterminal attributes.",
            "Evaluating and comparing language workbenches: Existing results and benchmarks for the future.",
            "Symbolic execution based on language transformation.",
            "Intra- and interdiagram consistency checking of behavioral multiview models.",
            "Practical domain-specific debuggers using the Moldable Debugger framework.",
            "Bounded seas.",
            "Editorial of Special Issue Trends in Functional Programming 2011/12.",
            "Combining deep and shallow embedding of domain-specific languages.",
            "Derivation and inference of higher-order strictness types.",
            "Generative and accumulative recursion made fun for beginners.",
            "Approaches to interpreter composition.",
            "On the verification of architectural reconfigurations.",
            "Flexary connectives in Mizar.",
            "Compiling and verifying SC-SystemJ programs for safety-critical reactive systems.",
            "A lightweight approach to component-level exception mechanism for robust android apps.",
            "Concepts and evaluation of the extended entity-relationship approach to database design in a multi-paradigm information system modeling tool.",
            "DSML4CP: A Domain-specific Modeling Language for Concurrent Programming.",
            "The intelligent memory allocator selector.",
            "Supporting comprehensible presentation of clone candidates through two-dimensional maximisation."
        ]
    },
    {
        "name": "CL",
        "year": "2014",
        "info": "Volume 40, 2014",
        "count": 10,
        "papers": [
            "Special issue on the Programming Languages track at the 28th ACM Symposium on Applied Computing.",
            "@Java: Bringing a richer annotation model to Java.",
            "Reliable scalable symbolic computation: The design of SymGridPar2.",
            "Just-in-time value specialization.",
            "A model driven architecture for the development of smart card software.",
            "Model checking XSL transformations.",
            "A sparse evaluation technique for detailed semantic analyses.",
            "AmbientTalk: programming responsive mobile peer-to-peer applications with actors.",
            "Bounded memory protocols.",
            "Refinement of worst-case execution time bounds by graph pruning."
        ]
    },
    {
        "name": "CL",
        "year": "2013",
        "info": "Volume 39, 2013",
        "count": 10,
        "papers": [
            "Declarative secure distributed information systems.",
            "Elimination of parallel copies using code motion on data dependence graphs.",
            "Verifying pointer and string analyses with region type systems.",
            "Monaco - A domain-specific language solution for reactive process control programming with hierarchical components.",
            "A test-suite reduction approach to improving fault-localization effectiveness.",
            "Noninterference in a predicative polymorphic calculus for access control.",
            "Special issue on the Programming Languages track at the 27th ACM Symposium on Applied Computing.",
            "Context-sensitive trace inlining for Java.",
            "Regular corecursion in Prolog.",
            "Binary trees as a computational framework."
        ]
    },
    {
        "name": "CL",
        "year": "2012",
        "info": "Volume 38, 2012",
        "count": 16,
        "papers": [
            "Object swapping challenges: An evaluation of imageSegment.",
            "Spy: A flexible code profiling framework.",
            "A language to bridge the gap between component-based design and implementation.",
            "Ring: A unifying meta-model and infrastructure for Smalltalk source code analysis tools.",
            "Linguistic style checking with program checking tools.",
            "Java supervenience.",
            "Cyclic reference counting by typed reference fields.",
            "TaKo: Providing transparent collaboration on single-user applications.",
            "Abstract interpretation of database query languages.",
            "Maintaining distributed logic programs incrementally.",
            "Program equivalence in a simple language with state.",
            "Towards a programming model for context-aware applications.",
            "Core FOBS: A hybrid functional and object-oriented language.",
            "First-order reasoning for higher-order concurrency.",
            "Data-bound variables for WS-BPEL executable processes.",
            "Construct specific coupling measurement for C++ software."
        ]
    },
    {
        "name": "CL",
        "year": "2011",
        "info": "Volume 37, 2011",
        "count": 11,
        "papers": [
            "QoS-enabled and self-adaptive connectors for Web Services composition and coordination.",
            "Widening and narrowing operators for abstract interpretation.",
            "A transactional model for automatic exception handling.",
            "Memory-optimal evaluation of expression trees involving large objects.",
            "Transforming XSLT stylesheets into XQuery expressions and vice versa.",
            "Dependent vector types for data structuring in multirate Faust.",
            "Reconciling method overloading and dynamically typed scripting languages.",
            "Design and implementation of domain-specific language easytime.",
            "Reducing memory space consumption through dataflow analysis.",
            "Programming with partially specified aggregates in Java.",
            "Improving performance through deep value profiling and specialization with code transformation."
        ]
    },
    {
        "name": "CL",
        "year": "2010",
        "info": "Volume 36, 2010",
        "count": 16,
        "papers": [
            "Feedback-directed specialization of code.",
            "Component-based LR parsing.",
            "Cost-driven autonomous mobility.",
            "Towards proving type safety of C#.",
            "The dependence condition graph: Precise conditions for dependence between program points.",
            "Extending object-oriented languages with backward error recovery integrated support.",
            "Flexibility and coordination in event-based, loosely coupled, distributed systems.",
            "An investigation in parallel execution of answer set programs on distributed memory platforms: Task sharing and dynamic scheduling.",
            "A platform for the automatic generation of attribute evaluation hardware systems.",
            "Program transformations for information personalization.",
            "On minimizing register usage of linearly scheduled algorithms with uniform dependencies.",
            "Isolating untrusted software extensions by custom scoping rules.",
            "An approach for non-intrusively adding malleable fork/join parallelism into ordinary JavaBean compliant applications.",
            "SystemJ: A GALS language for system level design.",
            "Customizing a functional programming language for web development.",
            "Non-repudiation analysis using LySa with annotations."
        ]
    },
    {
        "name": "CL",
        "year": "2009",
        "info": "Volume 35, 2009",
        "count": 26,
        "papers": [
            "Guest Editor Introduction.",
            "Traits at work: The design of a new trait-based stream library.",
            "Transactional memory in a dynamic language.",
            "Forward chaining in HALO: An implementation strategy for history-based logic pointcuts.",
            "Practical, pluggable types for a dynamic language.",
            "Taking an object-centric view on dynamic information with object flow analysis.",
            "Linguistic symbiosis between event loop actors and threads.",
            "Class invariants as abstract interpretation of trace semantics.",
            "Applying model-checking to solve queries on semistructured data.",
            "Comparison and evaluation of back-translation algorithms for static single assignment forms.",
            "Efficient reconfigurable embedded parsers.",
            "jLab: Integrating a scripting interpreter with Java technology for flexible and efficient scientific computation.",
            "Zero - a blend of static typing and dynamic metaprogramming.",
            "Dynamic reordering of alternatives for definite logic programs.",
            "Optimizing the stack size of recursive functions.",
            "Safety shell for specification-PEARL oriented UML real-time projects.",
            "Generic operations and capabilities in the JR concurrent programming language.",
            "Ferret: Programming language support for multiple dynamic classification.",
            "A transformational language for mutant description.",
            "A higher-order strategy for eliminating common subexpressions.",
            "A monotone framework for CCS.",
            "Software composition with Linda.",
            "Utility-driven solution for optimal resource allocation in computational grid.",
            "Query generation for retrieving data from distributed semistructured documents using a metadata interface.",
            "The Green language type system.",
            "A framework for attaching personal assistants to existing applications."
        ]
    },
    {
        "name": "CL",
        "year": "2008",
        "info": "Volume 34, 2008",
        "count": 14,
        "papers": [
            "Mechanisms for improved covariant type-checking.",
            "PPL: A whole-image processing language.",
            "A generic, formal language-based methodology for hierarchical floorplanning-placement.",
            "Preface.",
            "Unanticipated partial behavioral reflection: Adapting applications at runtime.",
            "Application-specific models and pointcuts using a logic metalanguage.",
            "Stateful traits and their formalization.",
            "Creating sophisticated development tools with OmniBrowser.",
            "Foundations of a simple and unified component-oriented language.",
            "Preface.",
            "Automatic synthesis and verification of real-time embedded software for mobile and ubiquitous systems.",
            "Efficient exception handling in Java bytecode-to-C ahead-of-time compiler for embedded systems.",
            "A new code generation algorithm for 2-offset producer order queue computation model.",
            "CASL: A rapid-prototyping language for modern micro-architectures."
        ]
    },
    {
        "name": "CL",
        "year": "2007",
        "info": "Volume 33, 2007",
        "count": 10,
        "papers": [
            "Parallel resource co-allocation for the computational grid.",
            "Extending movilog for supporting Web services.",
            "Security types preserving compilation.",
            "Multiple dispatch in reflective runtime environment.",
            "Introduction to the special issue on semantics and costs models for high-level parallel programming.",
            "A calculus for parallel computations over multidimensional dense arrays.",
            "A bulk-synchronous parallel process algebra.",
            "Costing stepwise refinements of parallel programs.",
            "Re-scheduling invocations of services for RPC grids.",
            "Skeleton-based parallel programming: Functional and parallel semantics in a single shot."
        ]
    },
    {
        "name": "CL",
        "year": "2006",
        "info": "Volume 32, 2006",
        "count": 11,
        "papers": [
            "Orthogonal parallel processing in vector Pascal.",
            "A minimalist approach to objects.",
            "Tailorable language for behavioral composition and configuration of software components.",
            "Introduction to the Smalltalk special issue.",
            "Open Aspects.",
            "Inter-language reflection: A conceptual model and its implementation.",
            "Runtime bytecode transformation for Smalltalk.",
            "Co-evolving code and design with intensional views: A case study.",
            "A point based model of the Gregorian Calendar.",
            "Access Enhancement Objects for data management in Smalltalk.",
            "The Green language."
        ]
    },
    {
        "name": "CL",
        "year": "2005",
        "info": "Volume 31, 2005",
        "count": 12,
        "papers": [
            "Incremental programming language development.",
            "JavaLog: a framework-based integration of Java and Prolog for agent-oriented programming.",
            "A study of best-fit memory allocators.",
            "On the prediction of reduction goals: a deterministic approach.",
            "A type system for static and dynamic checking of C++ pointers.",
            "Introduction.",
            "Classboxes: controlling visibility of class extensions.",
            "Design, implementation, and evaluation of the Resilient Smalltalk embedded platform.",
            "Uniform and safe metaclass composition.",
            "Parcels: A fast and feature-rich binary deployment technology.",
            "Delving source code with formal concept analysis.",
            "Language support for adaptive object-models using metaclasses."
        ]
    },
    {
        "name": "CL",
        "year": "2004",
        "info": "Volume 30, 2004",
        "count": 13,
        "papers": [
            "Editorial: Smalltalk Language.",
            "MudPie: layers in the ball of mud.",
            "Language-independent detection of object-oriented design patterns.",
            "Induced intentional software views.",
            "Safe metaclass composition using mixin-based inheritance.",
            "Unanticipated integration of development tools using the classification model.",
            "A browser for incremental programming.",
            "Special issue of VMCAI'03.",
            "Employing symmetry reductions in model checking.",
            "Model checking and abstraction to the aid of parameterized systems (a survey).",
            "Reasoning about layered message passing systems.",
            "Nesting analysis of mobile ambients.",
            "Verifying persistent security properties."
        ]
    },
    {
        "name": "CL",
        "year": "2003",
        "info": "Volume 29, 2003",
        "count": 4,
        "papers": [
            "Data-race and concurrent-write freedom are undecidable.",
            "Bidirectional data flow analysis for type inferencing.",
            "Logic programs as compact denotations.",
            "DesCaRTeS: a run-time system with SR-like functionality for programming a network of embedded systems."
        ]
    },
    {
        "name": "CL",
        "year": "2002",
        "info": "Volume 28, 2002",
        "count": 14,
        "papers": [
            "Computer languages and security.",
            "Information flow for Algol-like languages.",
            "Orderly communication in the Ambient Calculus.",
            "Behavioural typing for safe ambients.",
            "Security boundaries in mobile ambients.",
            "Distributed call-tracking for security.",
            "ALua: flexibility for parallel programming.",
            "An optimal data structure to handle dynamic environments in non-deterministic computations.",
            "An attribute-grammar framework for specifying the accessibility in Java programs.",
            "A study of dynamic memory management in C++ programs.",
            "On the applicability of the longest-match rule in lexical analysis.",
            "Unified selection from lists, arrays, and objects.",
            "SIR: inter-program concurrency support for SR programs.",
            "Fairness in shared invocation servicing."
        ]
    },
    {
        "name": "CL",
        "year": "2001",
        "info": "Volume 27, 2001",
        "count": 9,
        "papers": [
            "Introduction by the guest editor.",
            "Languages for formalizing, visualizing and verifying software architectures.",
            "Object-oriented modelling and specification using SHE.",
            "Visualising business processes.",
            "Argos: an automaton-based synchronous language.",
            "Visual temporal logic as a rapid prototyping tool.",
            "Automatic synthesis of SDL from MSC and its applications in forward and reverse engineering.",
            "LAILA: a language for coordinating abductive reasoning among logic agents.",
            "State inference for dynamically changing interfaces."
        ]
    },
    {
        "name": "CL",
        "year": "2000",
        "info": "Volume 26, 2000",
        "count": 7,
        "papers": [
            "Semantics of well-moded input-consuming logic programs.",
            "Lenient evaluation and parallelism.",
            "Lenient evaluation is neither strict nor lazy.",
            "Iteration constructs in data-flow visual programming languages.",
            "Associative definition of programming languages.",
            "A declarative coordination language.",
            "NP-SPEC: an executable specification language for solving all problems in NP."
        ]
    },
    {
        "name": "CL",
        "year": "1999",
        "info": "Volume 25, 1999",
        "count": 14,
        "papers": [
            "A Sketch-Based Technique for the Derivation of Self-Interpreters.",
            "Extending Temporal Query Languages to Handle Imprecise Time Intervals.",
            "Compositional Petri net models of advanced tasking in Ada-95.",
            "Optimizing floating point operations in Scheme.",
            "Review: Countdown Y2K; Peter de Jager, Richard Bergeon. John Wiley & Sons, Inc. ISBN: 0-471-32734-4.",
            "Review: Mobile Processing in Distributed and Open Environments; Peter Sapaty. John Wiley and Sons, Inc. ISBN: 0-471-19572-3.",
            "Review: Building Microsoft SQL Server 7 Applications with COM; By Sanjiv Purba. John Wiley & Sons, Inc. ISBN: 0-471-19233-3.",
            "Review: Building N-Tier Applications with COM And Visual Basic 6.0; Ash Rofail, Tony Martin. John Wiley & Sons, Inc. ISBN: 0-471-29549-3.",
            "Review: 3-Tier Client/Server at Work Revised Edition; By Jeri Edwards. John Wiley & Sons, Inc. ISBN: 0-471-31502-8.",
            "An execution scheme for interactive problem-solving in concurrent constraint logic programming languages.",
            "A finest partitioning algorithm for attribute grammars.",
            "Synchronization abstraction in the BETA programming language.",
            "Simulating multiple inheritance and generics in Java.",
            "Dynamic composition of parameterised logic modules."
        ]
    },
    {
        "name": "CL",
        "year": "1998",
        "info": "Volume 24, 1998",
        "count": 11,
        "papers": [
            "SequenceL Provides a Different Way to View Programming.",
            "Scheduling Expression DAGs for Minimal Register Need.",
            "Evaluating Inlining Techniques.",
            "LR Techniques for Handling Syntax Errors.",
            "Formal Semantics of Visual Occam.",
            "Design and Implementation of a Parallel Cellular Language for MIMD Architectures.",
            "Branching-Time Logic Programming: The Language Cactus and its Applications.",
            "Preference Logic Grammars.",
            "Grammar Partitioning and Modular Deterministic Parsing.",
            "Active Objects as Atomic Control Structures in BaLinda K.",
            "New Mechanisms for Invocation Handling in Concurrent Programming Languages."
        ]
    },
    {
        "name": "CL",
        "year": "1997",
        "info": "Volume 23, 1997",
        "count": 8,
        "papers": [
            "Visual Occam: Syntax and Sematics.",
            "Object Logic Integration: A Multiparadigm Design Methodology and a Programming Language.",
            "Practical Exception Handling and Resolution in Concurrent Programs.",
            "Lazy Narrowing with Simplification.",
            "DRL: A Distributed Real-Time Logic Language.",
            "Towards the Uniform Implementation of Declarative Languages.",
            "On goal-directed provability in classical logic.",
            "Program Separation and Definitional Higher Order Programming."
        ]
    },
    {
        "name": "CL",
        "year": "1996",
        "info": "Volume 22, 1996",
        "count": 17,
        "papers": [
            "An Executable Specification Language for Fast Prototyping Parallel Responsive Systems.",
            "Synchronisation, Concurrent Object-Oriented Programming and the Inheritance Anomaly.",
            "Mealy Machines are a Better Model of Lexical Analyzers.",
            "Engineering Quicksort.",
            "Towards Resource Handling in Logic Programming: The PPL Framework and its Semantics.",
            "A Proposal to Merge Multiple Tuple Spaces, Object Orientation, and Logic Programming.",
            "Rule-Based Coordination of Logic Programs.",
            "Improving the Efficiency of Nondeterministic Independent and-Parallel Systems.",
            "Relating Data-Parallelism and (and-) Parallelism in Logic Programs.",
            "Design and Implementation of 8_½: A Declarative Data-Parallel Language.",
            "Assembling a Resolution Multiprocessor from Interface Programming and Distributed Processing Components.",
            "Fail-Safety Techniques and their Extensions to Concurrent Systems.",
            "BaLinda Lisp: Design and Implementation.",
            "Polymorphic Type-Checking in Scheme.",
            "Building Efficient Incremental LL Parsers by Augmenting LL Tables and Threading Parse Trees.",
            "Distributed Logic Objects.",
            "Inter-Entry Selection Control Mechanisms: Implementation and Evaluation."
        ]
    },
    {
        "name": "CL",
        "year": "1995",
        "info": "Volume 21, 1995",
        "count": 12,
        "papers": [
            "A Grammatical Specification of Human-Computer Dialogue.",
            "Semantic Issues in the Design of Languages for Debugging.",
            "Extracting Program Structure for Packaging in a Component-Based Environment.",
            "Scheduling Expression Trees with Reusable Registers on Delayed-Load Architectures.",
            "A Complete Semantics for SMALLTALK-80.",
            "I+: A Multiparadigm Language for Object-Oriented Declarative Programming.",
            "GRAS: A General Framework for Combining Automatic Code Generation and Register Allocation.",
            "Generating Optimal Contiguous Evaluations for Expression DAGs.",
            "Side-Effect Free Functions in Object-Oriented Languages.",
            "Conversations of Objects.",
            "Carla: A Rule Language for Specifying Communications Architectures.",
            "Design of an Arabic Programming Language (ARABLAN)."
        ]
    },
    {
        "name": "CL",
        "year": "1994",
        "info": "Volume 20, 1994",
        "count": 17,
        "papers": [
            "RT-CDL: A Distributed Real-Time Design Language and Its Operational Semantics.",
            "Implementing Polymorphic Typing in a Logic Programming Language.",
            "Parallel Recognition and Parsing on Mesh Connected Computers with Multiple Broadcasting.",
            "First-Class Stores and Partial Continuations in a Programming Language and Environment.",
            "Exception Handling: Expecting the Unexptected.",
            "Grammar Transformations for Optimizing Backtrack Parsers.",
            "A Practical Approach to Type-Sensitive Parsing.",
            "Access Control for Private Declarations in Ada.",
            "An Empirical Study of the Run-Time Behavior of Quicksort, Shellsort and Mergesort for Medium to Large Size Data.",
            "An Automatic Parallelization Framework for Multicomputers.",
            "Parallel Incremental LR Parsing.",
            "Experiments wiht Destructive Updates in a Lazy Functional Language.",
            "Discrete Loops and Worst Case Performance.",
            "Algebraic Tools for Language Processing.",
            "A Practical Minimum Distance Method for Syntax Error Handling.",
            "A Process Oriented Semantics of the PRAM-Language FORK.",
            "Parallel Arithmetic Expression Evaluation on Reconfigurable Meshes."
        ]
    },
    {
        "name": "CL",
        "year": "1993",
        "info": "Volume 19, 1993",
        "count": 19,
        "papers": [
            "List Processing Primitives for Parallel Computation.",
            "A Denotational Approach for Type-Checking in Object-Oriented Programming Languages.",
            "A Primitive-Based Strategy for Producing Efficient Code for Very High Level Programs.",
            "Distributed termination of concurrent processes in Occam.",
            "Introduction to the Special Issue on ICCL '92.",
            "Static Analysis of PostScript Code.",
            "On the Power of Abstract Interpretation.",
            "Optimizing Structural Recursion in Functional Programs.",
            "A Methodology for Procedure Cloning.",
            "Designing Programming Languages for the Analyzability of Pointer Data Structures.",
            "Program Structure as Basis for the Parallelization of Global Register Allocation.",
            "The Denotational Semantics of a Functional Tree-Manipulation Language.",
            "Heuristic Chaining in Directed Acyclic Graphs.",
            "Concurrency and Backtracking in VPL.",
            "Run-Time Behavior of SASL Programs: A Performance Study.",
            "Action Semantics-Directed Prototyping.",
            "A Controlling Scheme for Prolog Through Count Terms.",
            "Error Handling in a Parallel LR Substring Parser.",
            "Time-Based Operators for Relational Algebra Query Languages."
        ]
    },
    {
        "name": "CL",
        "year": "1993",
        "info": "Volume 18, 1993",
        "count": 16,
        "papers": [
            "Recursive Ascent-Descent Parsing.",
            "A Portable Implementation of Unity on Von Neumann Machines.",
            "A Proposal for a Genuinely-Lazy Streams Facility for Ada.",
            "Altering and Applying Predicates.",
            "Real-Time Constraints in a Rapid Prototyping Language.",
            "Parametric Composable Modules in a Logic Programming Language.",
            "Linda Sub System on Transputers.",
            "Partial Evaluation Grammars.",
            "Structuring Conversation in Operation/Procedure Oriented Programming Languages.",
            "Constraint-Driven Programming in Strongly-Typed Object-Oriented Languages.",
            "A Survey of Parlog and Concurrent Prolog: The Integration of Logic and Parallelism.",
            "Array Representation in Symbolic Execution.",
            "An Operational Semantics for Icon: Implementation of a Procedural Goal-Directed Language.",
            "A Synthesis of Type-Checking and Parsing.",
            "Facet Grammars: Towards Static Semantic Analysis by Context-Free Parsing.",
            "An Abstract Programming Language and Correctness Proofs."
        ]
    },
    {
        "name": "CL",
        "year": "1992",
        "info": "Volume 17, 1992",
        "count": 18,
        "papers": [
            "From Babbage to Babel and Beyond: A Brief History of Programming Languages.",
            "A Continuation-Based Language Embedded in Scheme.",
            "Activity Simulation in Modula-2: An Exercise in Language Extension.",
            "Context-Free Parsing on O(n) Processors.",
            "On Open Arrays and Variable Number of Parameters.",
            "Specification and Testing of Abstract Data Types.",
            "Orthogonal Languages: A Framework for Program Development.",
            "A Relational Model for the Specification of Data Types.",
            "Sublist Assertions for Listless and Lazy Evaluation.",
            "Interface Type Checking of Large C Applications.",
            "Inheritance of Theory in the Adabtpl Language.",
            "A Language for Automated Programming of Mathematical Applications.",
            "A Relational-Calculus Query Language for Historical Databases.",
            "MDL (Methodology Definition Language): A Language for Defining and Automating Software Development Processes.",
            "Parallel Programming with Logic Languages: A Survey.",
            "Removing Partial Parametrization for Efficient Implementation of Functional Languages.",
            "Closure Generation Based on Viewing Lambda as Epsilon Plus Compile.",
            "Inter-Entry Selection: Non-Determinism and Explicit Control Mechanisms."
        ]
    },
    {
        "name": "CL",
        "year": "1991",
        "info": "Volume 16, 1991",
        "count": 17,
        "papers": [
            "Introduction: Computer Languages: A Perspective.",
            "ConC: A Language for Concurrent Programming.",
            "Language Aspects of Envisager: An Object-Oriented Environment for the Specification of Real-Time Systems.",
            "Protob: An Object Oriented Methodology for Developing Discrete Event Dynamic Systems.",
            "Flex: Towards Flexible Real-Time Programs.",
            "The Equational Specification of Efficient Compiler Code Generation.",
            "TXL: A Rapid Prototyping System for Programming Language Dialects.",
            "Introduction: Development of Computer Languages and Software.",
            "Black-Box Specification in Spec.",
            "Distributed Programming with Shared Data.",
            "A Layered, Operational Model of Data Control in Programming Languages.",
            "A Unifying Model for Lookahead LR Parsing.",
            "Intermediate Container Removal.",
            "An Environment for Prototyping Distributed Applications.",
            "The Lynx Distributed Programming Language: Motivation, Design and Experience.",
            "The Multiparadigm Language G.",
            "Modular Verification of Ada Generics."
        ]
    },
    {
        "name": "CL",
        "year": "1990",
        "info": "Volume 15, 1990",
        "count": 17,
        "papers": [
            "The Hierarchical Development of a Generic Type Mechanism for Functional Languages.",
            "On Display Optimization for Algol-Like Languages.",
            "A Stream Data Type That Supports Goal-Directed Pattern Matching on Unbounded Sequences of Values.",
            "Towards a Facility for Lexically Scoped, Dynamic Mutual Recursion in Scheme.",
            "An Extension of SQL for Querying Graph Relations.",
            "A Usually Linear Algorithm for Register Assignment Using Edge Placement of Load and Store Instructions.",
            "Integrating Emerald into a System for Mixed-Language Programming.",
            "Multi-Way Streams in Scheme.",
            "Efficient Retargetable Code Generation Using Bottom-up Tree Pattern Matching.",
            "Programmer-Defined Control Abstractions in Modula-2.",
            "The Notion of Priority in Real-Time Programming Languages.",
            "An Exception Handling Mechanism for SR.",
            "Exception Handling in RT-CDL.",
            "Incremental Recursive Descent Parsing.",
            "Incremental Generation of LR Parsers.",
            "C-Flavours: A Scheme-Based Flavour System with Coroutines and its Application to the Design of Object-Oriented Simulation Software.",
            "Functional Semantics of Programs with Exceptions."
        ]
    },
    {
        "name": "CL",
        "year": "1989",
        "info": "Volume 14, 1989",
        "count": 21,
        "papers": [
            "Performance Issues in C Language Fault-Tolerant Software.",
            "Creating Efficient Programs by Exchanging Data for Procedures.",
            "Semantic Predicates in Parser Generators.",
            "A Logical Basis for Nested Array Data Structures.",
            "Arabic Text Formatter: Comments and Implementation.",
            "Integrating Relational Databases and Constraint Languages.",
            "Language Features for Prototyping and Simulation Support of the Software Life Cycle.",
            "Automatically Generating SL Parsers From LL(1) Grammars.",
            "On Context-Free Programmed Grammars.",
            "Engines From Continuations.",
            "A Probabilistic Analysis of Loop Programs.",
            "C++: Solving C's Shortcomings?",
            "First-Class Patterns for Icon.",
            "Prosper: A Language for Specification by Prototyping.",
            "What About the Natural Numbers?",
            "Prolog Based Retargetable Code Generation.",
            "Translator Inversion.",
            "Incremental Attribute Evaluation Through Recursive Procedures.",
            "A Parallel Implementation of the Scan Language.",
            "An SR Approach to Multiway Rendezvous.",
            "Symbolic Execution of Concurrent Systems Using Petri Nets."
        ]
    },
    {
        "name": "CL",
        "year": "1988",
        "info": "Volume 13, 1988",
        "count": 12,
        "papers": [
            "A Compiler Writing System Based on Affix Grammars.",
            "Seque: A Programming Language for Manipulating Sequences.",
            "On String Pattern Matching: A Quantitative Analysis and a Proposal.",
            "Broadcasting Buffering Communication.",
            "A To Z: C Language Shortcomings.",
            "SL Parses The LR Languages.",
            "Register Assignment Using Code Placement Techniques.",
            "A Critique of Occam Channel Types.",
            "Program Complexity Using Hierarchical Abstract Computers.",
            "Design of a Graphics Interface for Computer-Based Biomedical Applications.",
            "RASP - A Language with Operations on Fuzzy Set.",
            "String Pattern-Matching in Prolog."
        ]
    },
    {
        "name": "CL",
        "year": "1987",
        "info": "Volume 12, 1987",
        "count": 14,
        "papers": [
            "Computationally Extended Logic Programming.",
            "Logical Programming for the Telegram Analysis Problem.",
            "Two Implementation Models of Abstract Data Types.",
            "Occam - A Programming Language for Multiprocessor Systems.",
            "Language Features for Discrete Simulation.",
            "Using Closures for Code Generation.",
            "G: A Functional Language with Generic Abstract Data Types.",
            "Structured Program Lookahead.",
            "Abstracting Timed Preemption with Engines.",
            "A Formal Design of an Arabic Text Formatter for Microcomputers.",
            "Performance Evaluation Methodologies for Abstract Data Type Implementation Techniques.",
            "Overloading in the Ada Language: Is ist Too Restrictive?",
            "An Algebraic Model for Programming Languages.",
            "Reflections on Landins's J-Operator: A Partly Historical Note."
        ]
    },
    {
        "name": "CL",
        "year": "1986",
        "info": "Volume 11, 1986",
        "count": 13,
        "papers": [
            "An Interpreter for SLIPS - An Applicative Language Based on Lambda-Calculus.",
            "Case Study: The Paisley Approach Applied to Its Own Software Tools.",
            "A Closer Look at Export and Import Statements.",
            "Parsing in Parallel.",
            "Structuring FP-Style Functional Programs.",
            "A Constraint Language and Its Interpreter.",
            "Interpreters From Functions and Grammars.",
            "Language- and Machine-Independent Global Optimization on Intermediate Code.",
            "Static Checking of Variable Handling in Dijkstra's Guarded Commands Language.",
            "Obtaining Coroutines with Continuations.",
            "On Processes, Synchronization and Redundant Code in Communicating Sequential Processes.",
            "Program Derivation in Type Theory: A Partitioning Problem.",
            "Two-Level Grammar as an Implementable Metalanguage for Axiomatic Semantics."
        ]
    },
    {
        "name": "CL",
        "year": "1985",
        "info": "Volume 10, 1985",
        "count": 14,
        "papers": [
            "The Design of Apple - A Language for Modular Programs.",
            "A Programming Language Engineered for Beginners.",
            "Experience with a Dataflow Datatype.",
            "Modeling the Ada Task System by Petri Nets.",
            "Program Testing by Specification Mutation.",
            "Procedural Operators Considered as Fundamental Programming Devices.",
            "Prograph: A Preliminary Report.",
            "A Portable Syntax Analyzer for Microcomputers.",
            "Deriving a Compiler From an Operational Semantics Written in VDL.",
            "Generalized Query-By-Rule: A Heterogeneous Database Query Language.",
            "The Use of Forth Language in Process Control.",
            "The Ada Task System and Real-Time Applications: An Implementation Schema.",
            "Efficient Combinator Code.",
            "An Algorithm for Generating Abstract Syntax Trees."
        ]
    },
    {
        "name": "CL",
        "year": "1984",
        "info": "Volume 9, 1984",
        "count": 14,
        "papers": [
            "Supporting Control Definition in Programming Languages.",
            "Using FP As a Query Language for Relational Data-Bases.",
            "A New Programming Environment With a Multi-Display Terminal and Early Experiences With It.",
            "A Survey on Syntactic Error Recovery and Repair.",
            "A Proposal for Comparison of Types in Pascal and Associated Semantic Models.",
            "Anatomy of a Text Analysis Package.",
            "DFL: A Data Flow Language.",
            "An Outline of the Programming Language Simula.",
            "Computation of Logical Effort in High Level Languages.",
            "An Intermediate Language to Define Dynamic Semantics.",
            "HUHU: The Hebrew University Hebrew Understander.",
            "Reverse Execution in a Generalized Control Regime.",
            "Implementation of CSP-S for Description of Distributed Algorithms.",
            "A Measure of Program Complexity."
        ]
    },
    {
        "name": "CL",
        "year": "1983",
        "info": "Volume 8, 1983",
        "count": 11,
        "papers": [
            "Result Sequences.",
            "The Contraction of Control Implementations.",
            "The Use of Combinators in Translating A Purely Functional Language to Low-Level Data-Flow Graphs.",
            "A Distributed Synchronization Mechanism for Interacting Processes.",
            "Concurrent Applicative Implementations of Nondeterministic Algorithms.",
            "Characterization of Program Loops in Code Optimization.",
            "Implementing SNOBOL4 Pattern Matching in Icon.",
            "Message Oriented Programming - A Resource Based Methodology.",
            "A Familial Specification Language for Database Application Systems.",
            "Some Proposals for Improving Pascal.",
            "Design and Implementation of an Adaptable Software Environment."
        ]
    },
    {
        "name": "CL",
        "year": "1982",
        "info": "Volume 7, 1982",
        "count": 13,
        "papers": [
            "Interactive Development of Object Handling Programs.",
            "Language Constructs for Real-Time Distributed Systems.",
            "Concurrency in Ada and Multicomputers.",
            "A Text Editing Interface: Definition and Use.",
            "Optimal Code From Flow Graphs.",
            "Constructors for Composed Objects.",
            "Binding Strategies and Scope Rules Are Independent.",
            "An Implementation of Generators in C.",
            "A Mechanism for Exception Handling and Its Verification Rules.",
            "Query Language Feature Analysis by Usability.",
            "LASS: A Language for Stochastic Systems.",
            "A Measure of Logical Complexity of Programs.",
            "Choosing an Implementation Language for Automatic Translation."
        ]
    },
    {
        "name": "CL",
        "year": "1981",
        "info": "Volume 6, 1981",
        "count": 11,
        "papers": [
            "Methods for Specifying Static Semantics.",
            "Optimization of Hierarchical Directed Graphs.",
            "Formal Integration: A Program Transformation Technique.",
            "Register Allocation Via Coloring.",
            "The Effect of Operators on Parsing and Evaluation in APL.",
            "DISPEL: A Run-Time Debugging Language.",
            "An LR Parsing Technique for Extended Context-Free Grammars.",
            "Interprocedural Test Path Evaluation.",
            "Abstractions for Distributed Programming.",
            "Implementation of Language Enhancements.",
            "Design and Implementation of a Chinese Terminal Controller."
        ]
    },
    {
        "name": "CL",
        "year": "1980",
        "info": "Volume 5, 1980",
        "count": 11,
        "papers": [
            "Mechanical Proof Testing.",
            "A New Approach to Code Motion and its Application to Hoisting.",
            "A Formal Notation for Specifying Static Semantic Rules.",
            "Formal: A Language with a Macro-Oriented Extension Facility.",
            "Toward Modular Verifiable Exception Handling.",
            "SIMPLE: A Program Development System.",
            "Generation of Node Lists Using Segment Analysis.",
            "On the Role of Error Productions in Syntactic Error Correction.",
            "Structural Analysis: A New Approch to Flow Analysis in Optimizing Compilers.",
            "Generic Procedures: An Implementation and an Undecidability Result.",
            "Concur: A Language for Continuous, Concurrent Processes."
        ]
    },
    {
        "name": "CL",
        "year": "1979",
        "info": "Volume 4, 1979",
        "count": 13,
        "papers": [
            "A semantic view of ALGOL 68.",
            "EQL: a Language for Numerical Computation.",
            "An Approach to Software System Behavior Description.",
            "An Approach to Software System Modelling and Analysis.",
            "Parallel Developments in Programming Languages and Operating Systems.",
            "Inference for Transition Network Grammars.",
            "High Level Data Structure - the Grid.",
            "Approximate Techniques for Modeling the Performance of Complex Systems.",
            "Constant Folding Within an Expression by Semantic Attributes.",
            "Multiple Views and Abstractions with an Extended-Entity-Relationship Model.",
            "Testing and Verification Aspects of Pascal-Like Languages.",
            "Semantic Specification Using Two-Level Grammars: Blocks, Procedures and Parameters.",
            "Deep and Shallow Binding: the Assignment Operation."
        ]
    },
    {
        "name": "CL",
        "year": "1978",
        "info": "Volume 3, 1978",
        "count": 20,
        "papers": [
            "Elements of Style Among Machine-Generated Cobol Flowcharts.",
            "Formal Semantics of a SNOBOL4 Subset.",
            "Functional Combination.",
            "Recent Developments in the Theory of Data Structures.",
            "A Solution of the Syntactical Induction-Inference Problem for Regular Languages.",
            "Implementing a Data Definition Facility Driven by Graph Grammars.",
            "Parallel Compilation: A Design and Its Application to SIMULA 67.",
            "Making Macrospace Effective.",
            "Three Simple Node List Algorithms.",
            "An Improved Version of the Cocke-Younger-Kasami Algorithm.",
            "Arthur G. Duncan: Data Structures and Program Correctness: Bridging the Gap.",
            "The Question Answering System on Mathematical Models (QAS): Description of the Language.",
            "A Proposal for a Generalized \"FOR\" Statement.",
            "Use-Definition Chains with Applications.",
            "Data Structures in SL5.",
            "SOLMAR - A Computer Language for Utilizing Sonar Models.",
            "Structured Flowcharts for Multiprocessing.",
            "A Statistical Analysis of Syntax Errors.",
            "Compiling Lambda-Expressions Using Continuations and Factorizations.",
            "Copyright Protection for Computer Programs and Other Computer Readable Works."
        ]
    },
    {
        "name": "CL",
        "year": "1976",
        "info": "Volume 2, 1976/1977",
        "count": 13,
        "papers": [
            "An Animation Description Language.",
            "Structured Syntax Diagrams.",
            "What Programmers Should Know.",
            "DILOG - Digitaled Intelligence Logic Machine.",
            "An Empirical Study of APL Programs.",
            "High Level Definition of Abstract Domains in a Relational Data Base System.",
            "SESPOOL, A Language for Systems Programming.",
            "Units of Measure as a Data Attribute.",
            "Elements of a Distributed Programming System.",
            "Pointers and Data Abstractions in High Level Languages - I: Language Proposals.",
            "Pointers and Data Abstractions in High Level Languages - II: Correctness Proofs.",
            "A Comparison of Cobol, Fortran, PL-I and Spitbol.",
            "Why Automatic Error Correctors Fail."
        ]
    },
    {
        "name": "CL",
        "year": "1976",
        "info": "Volume 1, 1976",
        "count": 20,
        "papers": [
            "Very High-Level Language Design: A Viewpoint.",
            "Direct Microprogrammed Execution of the Intermediate Text from a High-Level Language Compiler.",
            "Extending Pl/I for Structured Programming.",
            "List and Execute Forms of Macros.",
            "STAPLE, An Experimental Structured Programming Language.",
            "Mechanizing Bankers' Morality.",
            "The Precise Handling of Qualitative Relationships.",
            "Elimination of Single Productions and Merging Nonterminal Symbols of LR(1) Grammars.",
            "The Formal Definition of Semantics by String Automata.",
            "Source Statement Libraries and IBM System/370.",
            "Parallel Programming: An Axiomatic Approach.",
            "Optimization of Very High Level Languages - I. Value Transmission and Its Corollaries.",
            "Optimization of Very High Level Languages - II. Deducing Relationships of Inclusion and Membership.",
            "On the Power of Programming Features.",
            "Syntax Optimization for and Parsing of Patterns.",
            "A Structured Approach to Language Design.",
            "Some Steps Towards a Better Pascal.",
            "A Lambda-Calculus Model of Programming Languages - I. Simple Constructs.",
            "A Lambda-Calculus Model of Programming Languages - II. Jumps and Procedures.",
            "High Level Iterators and a Method for Automatically Designing Data Structure Representation."
        ]
    }
]