[
    {
        "year": "2021",
        "name": "27th CP 2021",
        "info": "Montpellier, France (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2021",
                "sub_name": "27th International Conference on Principles and Practice of Constraint Programming, CP 2021, Montpellier, France (Virtual Conference), October 25-29, 2021.",
                "count": 60,
                "papers": [
                    "The Bi-Objective Long-Haul Transportation Problem on a Road Network (Invited Talk).",
                    "Constrained-Based Differential Privacy (Invited Talk).",
                    "Learning in Local Branching (Invited Talk).",
                    "Filtering Isomorphic Models by Invariants (Short Paper).",
                    "Improving Local Search for Structured SAT Formulas via Unit Propagation Based Construct and Cut Initialization (Short Paper).",
                    "Unit Propagation with Stable Watches (Short Paper).",
                    "Towards Better Heuristics for Solving Bounded Model Checking Problems (Short Paper).",
                    "Integrating Tree Decompositions into Decision Heuristics of Propositional Model Counters (Short Paper).",
                    "Failure Based Variable Ordering Heuristics for Solving CSPs (Short Paper).",
                    "Generating Magical Performances with Constraint Programming (Short Paper).",
                    "Vehicle Dynamics in Pickup-And-Delivery Problems Using Electric Vehicles.",
                    "Building High Strength Mixed Covering Arrays with Constraints.",
                    "On How Turing and Singleton Arc Consistency Broke the Enigma Code.",
                    "Combining Monte Carlo Tree Search and Depth First Search Methods for a Car Manufacturing Workshop Scheduling Problem.",
                    "Practical Bigraphs via Subgraph Isomorphism.",
                    "The Hybrid Flexible Flowshop with Transportation Times.",
                    "CLR-DRNets: Curriculum Learning with Restarts to Solve Visual Combinatorial Games.",
                    "An Interval Constraint Programming Approach for Quasi Capture Tube Validation.",
                    "Exhaustive Generation of Benzenoid Structures Sharing Common Patterns.",
                    "Combining VSIDS and CHB Using Restarts in SAT.",
                    "On the Tractability of Explaining Decisions of Classifiers.",
                    "A Collection of Constraint Programming Models for the Three-Dimensional Stable Matching Problem with Cyclic Preferences.",
                    "Bounds on Weighted CSPs Using Constraint Propagation and Super-Reparametrizations.",
                    "Parallel Model Counting with CUDA: Algorithm Engineering for Efficient Hardware Utilization.",
                    "Complications for Computational Experiments from Modern Processors.",
                    "A Job Dispatcher for Large and Heterogeneous HPC Systems Running Modern Applications.",
                    "The Dungeon Variations Problem Using Constraint Programming.",
                    "Refined Core Relaxation for Core-Guided MaxSAT Solving.",
                    "A Linear Time Algorithm for the k-Cutset Constraint.",
                    "A k-Opt Based Constraint for the TSP.",
                    "The Seesaw Algorithm: Function Optimization Using Implicit Hitting Sets.",
                    "Reasoning Short Cuts in Infinite Domain Constraint Satisfaction: Algorithms and Lower Bounds for Backdoors.",
                    "Learning TSP Requires Rethinking Generalization.",
                    "SAT Modulo Symmetries for Graph Generation.",
                    "Counterfactual Explanations via Inverse Constraint Programming.",
                    "Utilizing Constraint Optimization for Industrial Machine Workload Balancing.",
                    "Minimizing Cumulative Batch Processing Time for an Industrial Oven Scheduling Problem.",
                    "Combining Clause Learning and Branch and Bound for MaxSAT.",
                    "Improving Local Search for Minimum Weighted Connected Dominating Set Problem by Inner-Layer Local Search.",
                    "Automatic Generation of Declarative Models For Differential Cryptanalysis.",
                    "A Bound-Independent Pruning Technique to Speeding up Tree-Based Complete Search Algorithms for Distributed Constraint Optimization Problems.",
                    "Data Driven VRP: A Neural Network Model to Learn Hidden Preferences for VRP.",
                    "Statistical Comparison of Algorithm Performance Through Instance Selection.",
                    "Enabling Incrementality in the Implicit Hitting Set Approach to MaxSAT Under Changing Weights.",
                    "Solving the Non-Crossing MAPF with CP.",
                    "Positive and Negative Length-Bound Reachability Constraints.",
                    "Evaluating the Hardness of SAT Instances Using Evolutionary Optimization Algorithms.",
                    "Optimising Training for Service Delivery.",
                    "Human-Centred Feasibility Restoration.",
                    "SAT-Based Approach for Learning Optimal Decision Trees with Non-Binary Features.",
                    "Pseudo-Boolean Optimization by Implicit Hitting Sets.",
                    "An Algorithm-Independent Measure of Progress for Linear Constraint Propagation.",
                    "Differential Programming via OR Methods.",
                    "Learning Max-CSPs via Active Constraint Acquisition.",
                    "Parallelizing a SAT-Based Product Configurator.",
                    "Solution Sampling with Random Table Constraints.",
                    "Making Rigorous Linear Programming Practical for Program Analysis.",
                    "Engineering an Efficient PB-XOR Solver.",
                    "Automated Random Testing of Numerical Constrained Types.",
                    "The Effect of Asynchronous Execution and Message Latency on Max-Sum."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th CP 2020",
        "info": "Louvain-la-Neuve, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2020",
                "sub_name": "Principles and Practice of Constraint Programming - 26th International Conference, CP 2020, Louvain-la-Neuve, Belgium, September 7-11, 2020, Proceedings.",
                "count": 55,
                "papers": [
                    "Dashed Strings and the Replace(-all) Constraint.",
                    "Combinatorial Search in CP-Based Iterated Belief Propagation.",
                    "Replication-Guided Enumeration of Minimal Unsatisfiable Subsets.",
                    "Solving Satisfaction Problems Using Large-Neighbourhood Search.",
                    "Quantum-Accelerated Global Constraint Filtering.",
                    "Pure MaxSAT and Its Applications to Combinatorial Optimization via Linear Local Search.",
                    "Tractable Fragments of Temporal Sequences of Topological Information.",
                    "Strengthening Neighbourhood Substitution.",
                    "Effective Encodings of Constraint Programming Models to SMT.",
                    "Watched Propagation of 0-1 Integer Linear Constraints.",
                    "Bounding Linear Programs by Constraint Propagation: Application to Max-SAT.",
                    "On Relation Between Constraint Propagation and Block-Coordinate Descent in Linear Programs.",
                    "DPMC: Weighted Model Counting by Dynamic Programming on Project-Join Trees.",
                    "Aggregation and Garbage Collection for Online Optimization.",
                    "Treewidth-Aware Quantifier Elimination and Expansion for QCSP.",
                    "A Time Leap Challenge for SAT-Solving.",
                    "Breaking Symmetries with RootClique and LexTopSort.",
                    "Towards Faster Reasoners by Using Transparent Huge Pages.",
                    "The Argmax Constraint.",
                    "Certifying Solvers for Clique and Maximum Common (Connected) Subgraph Problems.",
                    "Phase Transition Behavior in Knowledge Compilation.",
                    "A Faster Exact Algorithm to Count X3SAT Solutions.",
                    "Visualizations to Summarize Search Behavior.",
                    "Parallelization of TSP Solving in CP.",
                    "Using Resolution Proofs to Analyse CDCL Solvers.",
                    "Core-Guided Model Reformulation.",
                    "Filtering Rules for Flow Time Minimization in a Parallel Machine Scheduling Problem.",
                    "MaxSAT-Based Postprocessing for Treedepth.",
                    "Perturbing Branching Heuristics in Constraint Solving.",
                    "Finding the Hardest Formulas for Resolution.",
                    "HADDOCK: A Language and Architecture for Decision Diagram Compilation.",
                    "Towards a Generic Interval Solver for Differential-Algebraic CSP.",
                    "abstractXOR: A global constraint dedicated to differential cryptanalysis.",
                    "In Pursuit of an Efficient SAT Encoding for the Hamiltonian Cycle Problem.",
                    "Large Neighborhood Search for Temperature Control with Demand Response.",
                    "Solving the Group Cumulative Scheduling Problem with CPO and ACO.",
                    "A Branch-and-bound Algorithm to Rigorously Enclose the Round-Off Errors.",
                    "Leveraging Reinforcement Learning, Constraint Programming and Local Search: A Case Study in Car Manufacturing.",
                    "Computing the Local Aromaticity of Benzenoids Thanks to Constraint Programming.",
                    "Using Constraint Programming to Generate Benzenoid Structures in Theoretical Chemistry.",
                    "RobTest: A CP Approach to Generate Maximal Test Trajectories for Industrial Robots.",
                    "A Two-Phase Constraint Programming Model for Examination Timetabling at University College Cork.",
                    "Exact Approaches to the Multi-agent Collective Construction Problem.",
                    "The Confidence Constraint: A Step Towards Stochastic CP Solvers.",
                    "Parity (XOR) Reasoning for the Index Calculus Attack.",
                    "Constraint-Based Software Diversification for Efficient Mitigation of Code-Reuse Attacks.",
                    "Pushing Data into CP Models Using Graphical Model Learning and Solving.",
                    "Generating Random Logic Programs Using Constraint Programming.",
                    "Towards Formal Fairness in Machine Learning.",
                    "Verifying Equivalence Properties of Neural Networks with ReLU Activation Functions.",
                    "Learning the Satisfiability of Pseudo-Boolean Problem with Graph Neural Networks.",
                    "A Machine Learning Based Splitting Heuristic for Divide-and-Conquer Solvers.",
                    "Theoretical and Experimental Results for Planning with Learned Binarized Neural Network Transition Models.",
                    "Omissions in Constraint Acquisition.",
                    "Computing Optimal Decision Sets with SAT."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th CP 2019",
        "info": "Stamford, CT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2019",
                "sub_name": "Principles and Practice of Constraint Programming - 25th International Conference, CP 2019, Stamford, CT, USA, September 30 - October 4, 2019, Proceedings.",
                "count": 44,
                "papers": [
                    "Instance Generation via Generator Instances.",
                    "Automatic Detection of At-Most-One and Exactly-One Relations for Improved SAT Encodings of Pseudo-Boolean Constraints.",
                    "Exploring Declarative Local-Search Neighbourhoods with Constraint Programming.",
                    "Vehicle Routing by Learning from Historical Solutions.",
                    "On Symbolic Approaches for Computing the Matrix Permanent.",
                    "Towards the Characterization of Max-Resolution Transformations of UCSs by UP-Resilience.",
                    "Logic-Based Benders Decomposition for Super Solutions: An Application to the Kidney Exchange Problem.",
                    "Exploiting Glue Clauses to Design Effective CDCL Branching Heuristics.",
                    "Industrial Size Job Shop Scheduling Tackled by Present Day CP Solvers.",
                    "Dual Hashing-Based Algorithms for Discrete Integration.",
                    "Techniques Inspired by Local Search for Incomplete MaxSAT and the Linear Algorithm: Varying Resolution and Solution-Guided Search.",
                    "A Join-Based Hybrid Parameter for Constraint Satisfaction.",
                    "An Incremental SAT-Based Approach to the Graph Colouring Problem.",
                    "Constraint-Based Techniques in Stochastic Local Search MaxSAT Solving.",
                    "Trimming Graphs Using Clausal Proof Optimization.",
                    "Improved Job Sequencing Bounds from Decision Diagrams.",
                    "Integration of Structural Constraints into TSP Models.",
                    "Representing Fitness Landscapes by Valued Constraints to Understand the Complexity of Local Search.",
                    "Estimating the Number of Solutions of Cardinality Constraints Through \\texttt range and \\texttt roots Decompositions.",
                    "Understanding the Empirical Hardness of Random Optimisation Problems.",
                    "Guarded Constraint Models Define Treewidth Preserving Reductions.",
                    "Automatic Streamlining for Constrained Optimisation.",
                    "Compiling Conditional Constraints.",
                    "Training Binarized Neural Networks Using MIP and CP.",
                    "Models for Radiation Therapy Patient Scheduling.",
                    "Constraint Programming-Based Job Dispatching for Modern HPC Applications.",
                    "Scheduling of Mobile Robots Using Constraint Programming.",
                    "Decomposition and Cut Generation Strategies for Solving Multi-Robot Deployment Problems.",
                    "An Improved GPU-Based SAT Model Counter.",
                    "Reducing Bias in Preference Aggregation for Multiagent Soft Constraint Problems.",
                    "A Cube Distribution Approach to QBF Solving and Certificate Minimization.",
                    "Functional Synthesis with Examples.",
                    "SolverCheck: Declarative Testing of Constraints.",
                    "Encodings for Enumeration-Based Program Synthesis.",
                    "Lemma Synthesis for Automating Induction over Algebraic Data Types.",
                    "Modeling Pattern Set Mining Using Boolean Circuits.",
                    "Differential Privacy of Hierarchical Census Data: An Optimization Approach.",
                    "Generic Constraint-Based Block Modeling Using Constraint Programming.",
                    "Reward Potentials for Planning with Learned Neural Network Transition Models.",
                    "Exploiting Counterfactuals for Scalable Stochastic Optimization.",
                    "Structure-Driven Multiple Constraint Acquisition.",
                    "Towards Robust Scenarios of Spatio-Temporal Renewable Energy Planning: A GIS-RO Approach.",
                    "Peak-Hour Rail Demand Shifting with Discrete Optimisation.",
                    "Functional Significance Checking in Noisy Gene Regulatory Networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th CP 2018",
        "info": "Lille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2018",
                "sub_name": "Principles and Practice of Constraint Programming - 24th International Conference, CP 2018, Lille, France, August 27-31, 2018, Proceedings.",
                "count": 47,
                "papers": [
                    "Automatic Discovery and Exploitation of Promising Subproblems for Tabulation.",
                    "Propagating Regular Membership with Dashed Strings.",
                    "A Constraint-Based Encoding for Domain-Independent Temporal Planning.",
                    "Decremental Consistency Checking of Temporal Constraints: Algorithms for the Point Algebra and the ORD-Horn Class.",
                    "Domain Reduction for Valued Constraints by Generalising Methods from CSP.",
                    "Solver-Independent Large Neighbourhood Search.",
                    "Solution-Based Phase Saving for CP: A Value-Selection Heuristic to Simulate Local Search Behavior in Complete Solvers.",
                    "An SMT Approach to Fractional Hypertree Width.",
                    "On the Non-degeneracy of Unsatisfiability Proof Graphs Produced by SAT Solvers.",
                    "Sequential Precede Chain for Value Symmetry Elimination.",
                    "An Incremental SAT-Based Approach to Reason Efficiently on Qualitative Constraint Networks.",
                    "Clause Learning and New Bounds for Graph Coloring.",
                    "Portfolio-Based Algorithm Selection for Circuit QBFs.",
                    "Making Compact-Table Compact.",
                    "Approximation Strategies for Incomplete MaxSAT.",
                    "A Novel Graph-Based Heuristic Approach for Solving Sport Scheduling Problem.",
                    "Augmenting Stream Constraint Programming with Eventuality Conditions.",
                    "A Complete Tolerant Algebraic Side-Channel Attack for AES with CP.",
                    "Evaluating QBF Solvers: Quantifier Alternations Matter.",
                    "Quantified Valued Constraint Satisfaction Problem.",
                    "MLIC: A MaxSAT-Based Framework for Learning Interpretable Classification Rules.",
                    "Objective as a Feature for Robust Search Strategies.",
                    "PW-AC: Extending Compact-Table to Enforce Pairwise Consistency on Table Constraints.",
                    "Automatic Generation and Selection of Streamlined Constraint Models via Monte Carlo Search on a Model Lattice.",
                    "Efficient Methods for Constraint Acquisition.",
                    "A Circuit Constraint for Multiple Tours Problems.",
                    "Towards Semi-Automatic Learning-Based Model Transformation.",
                    "Finding Solutions by Finding Inconsistencies.",
                    "The Effect of Structural Measures and Merges on SAT Solver Performance.",
                    "Learning-Sensitive Backdoors with Restarts.",
                    "Process Plant Layout Optimization: Equipment Allocation.",
                    "A Constraint Programming Approach for Solving Patient Transportation Problems.",
                    "Unifying Reserve Design Strategies with Graph Theory and Constraint Programming.",
                    "Self-configuring Cost-Sensitive Hierarchical Clustering with Recourse.",
                    "User's Constraints in Itemset Mining.",
                    "On Maximal Frequent Itemsets Mining with Constraints.",
                    "A Parallel SAT-Based Framework for Closed Frequent Itemsets Mining.",
                    "Towards Effective Deep Learning for Constraint Satisfaction Problems.",
                    "Extending the Capacity of 1 / f Noise Generation.",
                    "Securely and Automatically Deploying Micro-services in an Hybrid Cloud Infrastructure.",
                    "Improving Energetic Propagations for Cumulative Scheduling.",
                    "A Fast and Scalable Algorithm for Scheduling Large Numbers of Devices Under Real-Time Pricing.",
                    "Balancing Asymmetry in Max-sum Using Split Constraint Factor Graphs.",
                    "A Large Neighboring Search Schema for Multi-agent Optimization.",
                    "Distributed Constrained Search by Selfish Agents for Efficient Equilibria.",
                    "Metamorphic Testing of Constraint Solvers.",
                    "Algebraic Fault Attack on SHA Hash Functions Using Programmatic SAT Solvers."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd CP 2017",
        "info": "Melbourne, VIC, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2017",
                "sub_name": "Principles and Practice of Constraint Programming - 23rd International Conference, CP 2017, Melbourne, VIC, Australia, August 28 - September 1, 2017, Proceedings.",
                "count": 45,
                "papers": [
                    "A Novel Approach to String Constraint Solving.",
                    "Generating Linear Invariants for a Conjunction of Automata Constraints.",
                    "among Implied Constraints for Two Families of Time-Series Constraints.",
                    "Solving Constraint Satisfaction Problems Containing Vectors of Unknown Size.",
                    "An Efficient SMT Approach to Solve MRCPSP/max Instances with Tight Constraints on Resources.",
                    "Conjunctions of Among Constraints.",
                    "Clique Cuts in Weighted Constraint Satisfaction.",
                    "Arc Consistency via Linear Programming.",
                    "Combining Nogoods in Restart-Based Search.",
                    "All or Nothing: Toward a Promise Problem Dichotomy for Constraint Problems.",
                    "Kernelization of Constraint Satisfaction Problems: A Study Through Universal Algebra.",
                    "Defining and Evaluating Heuristics for the Compilation of Constraint Networks.",
                    "A Tolerant Algebraic Side-Channel Attack on AES Using CP.",
                    "On Maximum Weight Clique Algorithms, and How They Are Evaluated.",
                    "MDDs: Sampling and Probability Constraints.",
                    "An Incomplete Constraint-Based System for Scheduling with Renewable Resources.",
                    "Rotation-Based Formulation for Stable Matching.",
                    "Preference Elicitation for DCOPs.",
                    "Extending Compact-Table to Basic Smart Tables.",
                    "Constraint Programming Applied to the Multi-Skill Project Scheduling Problem.",
                    "An Optimization Model for 3D Pipe Routing with Flexibility Constraints.",
                    "Optimal Torpedo Scheduling.",
                    "Constraint Handling in Flight Planning.",
                    "NightSplitter: A Scheduling Tool to Optimize (Sub)group Activities.",
                    "Time-Aware Test Case Execution Scheduling for Cyber-Physical Systems.",
                    "Integrating ILP and SMT for Shortwave Radio Broadcast Resource Allocation and Frequency Assignment.",
                    "Constraint-Based Fleet Design Optimisation for Multi-compartment Split-Delivery Rich Vehicle Routing.",
                    "Integer and Constraint Programming for Batch Annealing Process Planning.",
                    "Minimum-Width Confidence Bands via Constraint Optimization.",
                    "Constraint Programming for Multi-criteria Conceptual Clustering.",
                    "A Declarative Approach to Constrained Community Detection.",
                    "Combining Stochastic Constraint Optimization and Probabilistic Programming - From Knowledge Compilation to Constraint Solving.",
                    "Learning the Parameters of Global Constraints Using Branch-and-Bound.",
                    "CoverSize: A Global Constraint for Frequency-Based Itemset Mining.",
                    "A Column-Generation Algorithm for Evacuation Planning with Elementary Paths.",
                    "Job Sequencing Bounds from Decision Diagrams.",
                    "Branch-and-Check with Explanations for the Vehicle Routing Problem with Time Windows.",
                    "Solving Multiobjective Discrete Optimization Problems with Propositional Minimal Model Generation.",
                    "Analyzing Lattice Point Feasibility in UTVPI Constraints.",
                    "A Constraint Composite Graph-Based ILP Encoding of the Boolean Weighted CSP.",
                    "Reduced Cost Fixing in MaxSAT.",
                    "Weight-Aware Core Extraction in SAT-Based MaxSAT Solving.",
                    "Optimizing SAT Encodings for Arithmetic Constraints.",
                    "Constraint-Based Synthesis of Datalog Programs.",
                    "Search Strategies for Floating Point Constraint Systems."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd CP 2016",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2016",
                "sub_name": "Principles and Practice of Constraint Programming - 22nd International Conference, CP 2016, Toulouse, France, September 5-9, 2016, Proceedings.",
                "count": 54,
                "papers": [
                    "Exploiting Short Supports for Improved Encoding of Arbitrary Constraints into SAT.",
                    "Systematic Derivation of Bounds and Glue Constraints for Time-Series Constraints.",
                    "An Adaptive Parallel SAT Solver.",
                    "Improved Linearization of Constraint Programming Models.",
                    "Impact of SAT-Based Preprocessing on Core-Guided MaxSAT Solving.",
                    "Multiobjective Optimization by Decision Diagrams.",
                    "Dependency Schemes in QBF Calculi: Semantics and Soundness.",
                    "The Multirate Resource Constraint.",
                    "The Dichotomy for Conservative Constraint Satisfaction is Polynomially Decidable.",
                    "Propagation via Kernelization: The Vertex Cover Constraint.",
                    "Breaking Symmetries in Graphs: The Nauty Way.",
                    "Extending Broken Triangles and Enhanced Value-Merging.",
                    "A Bounded Path Propagator on Directed Graphs.",
                    "Compact-Table: Efficiently Filtering Table Constraints with Reversible Sparse Bit-Sets.",
                    "Interval Constraints with Learning: Application to Air Traffic Control.",
                    "Backdoors to Tractable Valued CSP.",
                    "Monte-Carlo Tree Search for the Maximum Satisfiability Problem.",
                    "A New Approach to Checking the Dynamic Consistency of Conditional Simple Temporal Networks.",
                    "On Finding Minimum Satisfying Assignments.",
                    "Towards a Dynamic Decomposition of CSPs with Separators of Bounded Size.",
                    "Constraint Programming for Strictly Convex Integer Quadratically-Constrained Problems.",
                    "A Global Constraint for Closed Frequent Pattern Mining.",
                    "Clique and Constraint Models for Maximum Common (Connected) Subgraph Problems.",
                    "Tightening McCormick Relaxations for Nonlinear Programs via Dynamic Multivariate Partitioning.",
                    "Parallel Strategies Selection.",
                    "Learning Parameters for the Sequence Constraint from Solutions.",
                    "The PPSZ Algorithm for Constraint Satisfaction Problems on More Than Two Colors.",
                    "Explaining Producer/Consumer Constraints.",
                    "Learning from Learning Solvers.",
                    "On Incremental Core-Guided MaxSAT Solving.",
                    "Modelling and Solving Multi-mode Resource-Constrained Project Scheduling.",
                    "A Nearly Exact Propagation Algorithm for Energetic Reasoning in \\mathcal O(n^2 \\log n).",
                    "Efficient Filtering for the Unary Resource with Family-Based Transition Times.",
                    "A Constraint Programming Approach to Multi-Robot Task Allocation and Scheduling in Retirement Homes.",
                    "Optimal Performance Tuning in Real-Time Systems Using Multi-objective Constrained Optimization.",
                    "SABIO: An Implementation of MIP and CP for Interactive Soccer Queries.",
                    "Constraint Programming Models for Chosen Key Differential Cryptanalysis.",
                    "Solving a Supply-Delivery Scheduling Problem with Constraint Programming.",
                    "Four-Bar Linkage Synthesis Using Non-convex Optimization.",
                    "Using Constraint Programming for the Urban Transit Crew Rescheduling Problem.",
                    "Optimizing Shortwave Radio Broadcast Resource Allocation via Pseudo-Boolean Constraint Solving and Local Search.",
                    "Availability Optimization in Cloud-Based In-Memory Data Grids.",
                    "Online HVAC-Aware Occupancy Scheduling with Adaptive Temperature Control.",
                    "Behavior Identification in Two-Stage Games for Incentivizing Citizen Science Exploration.",
                    "Constraining Redundancy to Improve Protein Docking.",
                    "Guaranteed Weighted Counting for Affinity Computation: Beyond Determinism and Structure.",
                    "Finding Alternative Musical Scales.",
                    "Assisted Lead Sheet Composition Using FlowComposer.",
                    "Enforcing Structure on Temporal Sequences: The Allen Constraint.",
                    "Constraint Programming Approach to the Problem of Generating Milton Babbitt's All-Partition Arrays.",
                    "A Dynamic Programming-Based MCMC Framework for Solving DCOPs with GPUs.",
                    "Morphing Between Stable Matching Problems.",
                    "Using Graph-Based CSP to Solve the Address Translation Problem.",
                    "Finding Unsatisfiable Cores of a Set of Polynomials Using the Gröbner Basis Algorithm."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st CP 2015",
        "info": "Cork, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2015",
                "sub_name": "Principles and Practice of Constraint Programming - 21st International Conference, CP 2015, Cork, Ireland, August 31 - September 4, 2015, Proceedings.",
                "count": 49,
                "papers": [
                    "Encoding Linear Constraints with Implication Chains to CNF.",
                    "Anytime Hybrid Best-First Search with Tree Decomposition for Weighted CSP.",
                    "Improved Constraint Propagation via Lagrangian Decomposition.",
                    "Strengthening Convex Relaxations with Bound Tightening for Power Network Optimization.",
                    "Broken Triangles Revisited.",
                    "A Microstructure-Based Family of Tractable Classes for CSPs.",
                    "The Unary Resource with Transition Times.",
                    "A Global Constraint for a Tractable Class of Temporal Optimization Problems.",
                    "Exploiting GPUs in Solving (Distributed) Constraint Optimization Problems with Dynamic Programming.",
                    "Conflict Ordering Search for Scheduling Problems.",
                    "Simple and Scalable Time-Table Filtering for the Cumulative Constraint.",
                    "General Bounding Mechanism for Constraint Programs.",
                    "Smallest MUS Extraction with Minimal Hitting Set Dualization.",
                    "Upper and Lower Bounds on the Time Complexity of Infinite-Domain CSPs.",
                    "Generalized Totalizer Encoding for Pseudo-Boolean Constraints.",
                    "Smaller Selection Networks for Cardinality Constraints Encoding.",
                    "PREFIX-PROJECTION Global Constraint for Sequential Pattern Mining.",
                    "On Tree-Preserving Constraints.",
                    "Modeling and Solving Project Scheduling with Calendars.",
                    "Deterministic Estimation of the Expected Makespan of a POS Under Duration Uncertainty.",
                    "A Parallel, Backjumping Subgraph Isomorphism Algorithm Using Supplemental Graphs.",
                    "Automated Auxiliary Variable Elimination Through On-the-Fly Propagator Generation.",
                    "Automatically Improving SAT Encoding of Constraint Problems Through Common Subexpression Elimination in Savile Row.",
                    "Exact Sampling for Regular and Markov Constraints with Belief Propagation.",
                    "Randomness as a Constraint.",
                    "Quasipolynomial Simulation of DNNF by a Non-determinstic Read-Once Branching Program.",
                    "MiniSearch: A Solver-Independent Meta-Search Language for MiniZinc.",
                    "Two Clause Learning Approaches for Disjunctive Scheduling.",
                    "Bounding an Optimal Search Path with a Game of Cop and Robber on Graphs.",
                    "Restricted Path Consistency Revisited.",
                    "Machine Learning of Bayesian Networks Using Constraint Programming.",
                    "Hybridization of Interval CP and Evolutionary Algorithms for Optimizing Difficult Problems.",
                    "A General Framework for Reordering Agents Asynchronously in Distributed CSP.",
                    "Automatically Generating Streamlined Constraint Models with Essence and Conjure.",
                    "Constraint-Based Local Search for Finding Node-Disjoint Bounded-Paths in Optical Access Networks.",
                    "Open Packing for Facade-Layout Synthesis Under a General Purpose Solver.",
                    "Power Capping in High Performance Computing Systems.",
                    "A Constraint-Based Approach to the Differential Harvest Problem.",
                    "Constrained Minimum Sum of Squares Clustering by Constraint Programming.",
                    "A Constraint Programming Approach for Non-preemptive Evacuation Scheduling.",
                    "Solving Segment Routing Problems with Hybrid Constraint Programming Techniques.",
                    "Modeling Universal Instruction Selection.",
                    "Optimizing the Cloud Service Experience Using Constraint Programming.",
                    "Find Your Way Back: Mobility Profile Mining with Constraints.",
                    "Joint Vehicle and Crew Routing and Scheduling.",
                    "Constructing Sailing Match Race Schedules: Round-Robin Pairing Lists.",
                    "Design and Evaluation of a Constraint-Based Energy Saving and Scheduling Recommender System.",
                    "Scheduling Running Modes of Satellite Instruments Using Constraint-Based Local Search.",
                    "Erratum to: Modeling Universal Instruction Selection."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th CP 2014",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2014",
                "sub_name": "Principles and Practice of Constraint Programming - 20th International Conference, CP 2014, Lyon, France, September 8-12, 2014. Proceedings.",
                "count": 71,
                "papers": [
                    "A Modular Architecture for Hybrid Planning with Theories.",
                    "Teaching Constraint Programming.",
                    "One Problem, Two Structures, Six Solvers, and Ten Years of Personnel Scheduling.",
                    "Concurrent Constraint Programming Research Programmes - Redux.",
                    "On Broken Triangles.",
                    "Using CP in Automatic Test Generation for ABB Robotics' Paint Control System.",
                    "On Compiling CNF into Decision-DNNF.",
                    "A Complete Solver for Constraint Games.",
                    "Encoding Linear Constraints into SAT.",
                    "Efficient Application of Max-SAT Resolution on Inconsistent Subsets.",
                    "Sequential Time Splitting and Bounds Communication for a Portfolio of Optimization Solvers.",
                    "Scoring-Based Neighborhood Dominance for the Subgraph Isomorphism Problem.",
                    "Linking Prefixes and Suffixes for Constraints Encoded Using Automata with Accumulators.",
                    "The Propagation Depth of Local Consistency.",
                    "The Balance Constraint Family.",
                    "Experimental Comparison of BTD and Intelligent Backtracking: Towards an Automatic Per-instance Algorithm Selector.",
                    "Solving Intensional Weighted CSPs by Incremental Optimization with BDDs.",
                    "On Backdoors to Tractable Constraint Languages.",
                    "Nested Constraint Programs.",
                    "Beyond Consistency and Substitutability.",
                    "Subexponential Time Complexity of CSP with Global Constraints.",
                    "A New Characterization of Relevant Intervals for Energetic Reasoning.",
                    "A Declarative Paradigm for Robust Cumulative Scheduling.",
                    "Improving DPOP with Branch Consistency for Solving Distributed Constraint Optimization Problems.",
                    "Constraint-Based Lagrangian Relaxation.",
                    "Loop Untangling.",
                    "Discriminating Instance Generation for Automated Constraint Model Selection.",
                    "Aggregating CP-nets with Unfeasible Outcomes.",
                    "The StockingCost Constraint.",
                    "Scalable Parallel Numerical CSP Solver.",
                    "Tree-Decompositions with Connected Clusters for Solving Constraint Networks.",
                    "CIP and MIQP Models for the Load Balancing Nurse-to-Patient Assignment Problem.",
                    "On the Erdős Discrepancy Problem.",
                    "Towards Practical Infinite Stream Constraint Programming: Applications and Implementation.",
                    "An Increasing-Nogoods Global Constraint for Symmetry Breaking During Search.",
                    "Memory-Efficient Tree Size Prediction for Depth-First Search in Graphical Models.",
                    "Higher-Order Consistencies through GAC on Factor Variables.",
                    "Incremental QBF Solving.",
                    "Incremental Cardinality Constraints for MaxSAT.",
                    "Reducing the Branching in a Branch and Bound Algorithm for the Maximum Clique Problem.",
                    "Core-Guided MaxSAT with Soft Cardinality Constraints.",
                    "The IntSat Method for Integer Linear Programming.",
                    "Automatically Improving Constraint Models in Savile Row through Associative-Commutative Common Subexpression Elimination.",
                    "Improving GAC-4 for Table and MDD Constraints.",
                    "Improvement of the Embarrassingly Parallel Search for Data Centers.",
                    "Stochastic MiniZinc.",
                    "Decomposing Utility Functions in Bounded Max-Sum for Distributed Constraint Optimization.",
                    "Insights into Parallelism with Intensive Knowledge Sharing.",
                    "The Non-overlapping Constraint between Objects Described by Non-linear Inequalities.",
                    "Improving Relational Consistency Algorithms Using Dynamic Relation Partitioning.",
                    "Domain Views for Constraint Programming.",
                    "Global Constraints in Distributed CSP: Concurrent GAC and Explanations in ABT.",
                    "The Impact of Wireless Communication on Distributed Constraint Satisfaction.",
                    "Adaptive Parameterized Consistency for Non-binary CSPs by Counting Supports.",
                    "Proactive Workload Dispatching on the EURORA Supercomputer.",
                    "Scheduling B2B Meetings.",
                    "Solving a Judge Assignment Problem Using Conjunctions of Global Cost Functions.",
                    "Worst-Case Scheduling of Software Tasks - A Constraint Optimization Model to Support Performance Testing.",
                    "Continuous Casting Scheduling with Constraint Programming.",
                    "Case Study: Constraint Programming in a System Level Synthesis Framework.",
                    "Scheduling Agents Using Forecast Call Arrivals at Hydro-Québec's Call Centers.",
                    "Deployment of Mobile Wireless Sensor Networks for Crisis Management: A Constraint-Based Local Search Approach.",
                    "Air Traffic Controller Shift Scheduling by Reduction to CSP, SAT and SAT-Related Problems.",
                    "Optimization Bounds from Binary Decision Diagrams - (Extended Abstract).",
                    "Reformulation Based MaxSAT Robustness - (Extended Abstract).",
                    "Probabilistic Constraints for Nonlinear Inverse Problems - (Extended Abstract).",
                    "Multivalued Decision Diagrams for Sequencing Problems - (Extended Abstract).",
                    "Robustness and Stability in Constraint Programming under Dynamism and Uncertainty - (Extended Abstract).",
                    "Monotone Temporal Planning: Tractability, Extensions and Applications - (Extended Abstract).",
                    "Anytime AND/OR Depth-First Search for Combinatorial Optimization - (Extended Abstract).",
                    "View-Based Propagator Derivation - (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th CP 2013",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2013",
                "sub_name": "Principles and Practice of Constraint Programming - 19th International Conference, CP 2013, Uppsala, Sweden, September 16-20, 2013. Proceedings.",
                "count": 64,
                "papers": [
                    "Optimization for Policy Making: The Cornerstone for an Integrated Approach.",
                    "Answer Set Programming: Boolean Constraint Solving for Knowledge Representation and Reasoning.",
                    "Those Who Cannot Remember the Past Are Condemned to Repeat It.",
                    "Decide Different!",
                    "The Objective-CP Optimization System.",
                    "Parallel Discrepancy-Based Search.",
                    "Bin Packing with Linear Usage Costs - An Application to Energy Management in Data Centres.",
                    "Filtering AtMostNValue with Difference Constraints: Application to the Shift Minimisation Personnel Task Scheduling Problem.",
                    "A Parametric Approach for Smaller and Better Encodings of Cardinality Constraints.",
                    "To Encode or to Propagate? The Best Choice for Each Constraint in SAT.",
                    "Automated Symmetry Breaking and Model Selection in Conjure.",
                    "Improving WPM2 for (Weighted) Partial MaxSAT.",
                    "MinSAT versus MaxSAT for Optimization Problems.",
                    "Adaptive Parameterized Consistency.",
                    "Global Inverse Consistency for Interactive Constraint Satisfaction.",
                    "Counting Spanning Trees to Guide Search in Constrained Spanning Tree Problems.",
                    "On the Reduction of the CSP Dichotomy Conjecture to Digraphs.",
                    "A Scalable Approximate Model Counter.",
                    "Dominance Driven Search.",
                    "Tractable Combinations of Global Constraints.",
                    "Postponing Optimization to Speed Up MAXSAT Solving.",
                    "Dead-End Elimination for Weighted CSP.",
                    "Solving Weighted CSPs by Successive Relaxations.",
                    "Constraint-Based Program Reasoning with Heaps and Separation.",
                    "Model Combinators for Hybrid Optimization.",
                    "Modelling Destructive Assignments.",
                    "An Improved Search Algorithm for Min-Perturbation.",
                    "Explaining Propagators for Edge-Valued Decision Diagrams.",
                    "A Simple and Effective Decomposition for the Multidimensional Binpacking Constraint.",
                    "Maintaining Soft Arc Consistencies in BnB-ADOPT + during Search.",
                    "Solving String Constraints: The Case for Constraint Programming.",
                    "Blowing Holes in Various Aspects of Computational Problems, with Applications to Constraint Satisfaction.",
                    "Solving QBF with Free Variables.",
                    "Globalizing Constraint Models.",
                    "A New Propagator for Two-Layer Neural Networks in Empirical Model Learning.",
                    "Bandit-Based Search for Constraint Programming.",
                    "Focused Random Walk with Configuration Checking and Break Minimum for Satisfiability.",
                    "Multi-Objective Constraint Optimization with Tradeoffs.",
                    "Multidimensional Bin Packing Revisited.",
                    "A Parametric Propagator for Discretely Convex Pairs of Sum Constraints.",
                    "Breaking Symmetry with Different Orderings.",
                    "Time-Table Extended-Edge-Finding for the Cumulative Constraint.",
                    "Revisiting the Cardinality Reasoning for BinPacking Constraint.",
                    "Value Interchangeability in Scenario Generation.",
                    "Embarrassingly Parallel Search.",
                    "Multi-Objective Large Neighborhood Search.",
                    "Scheduling Optional Tasks with Explanation.",
                    "Residential Demand Response under Uncertainty.",
                    "Lifting Structural Tractability to CSP with Global Constraints.",
                    "Empirical Study of the Behavior of Conflict Analysis in CDCL Solvers.",
                    "Primal and Dual Encoding from Applications into Quantified Boolean Formulas.",
                    "Asynchronous Forward Bounding Revisited.",
                    "Optimizing STR Algorithms with Tuple Compression.",
                    "Describing and Generating Solutions for the EDF Unit Commitment Problem with the ModelSeeker.",
                    "Solving the Agricultural Land Allocation Problem by Constraint-Based Local Search.",
                    "Constraint-Based Approaches for Balancing Bike Sharing Systems.",
                    "Constraint Based Computation of Periodic Orbits of Chaotic Dynamical Systems.",
                    "Laser Cutting Path Planning Using CP.",
                    "Atom Mapping with Constraint Programming.",
                    "Beyond Feasibility: CP Usage in Constrained-Random Functional Hardware Verification.",
                    "Stochastic Local Search Based Channel Assignment in Wireless Mesh Networks.",
                    "Automatic Generation and Delivery of Multiple-Choice Math Quizzes.",
                    "Constrained Wine Blending.",
                    "The Berth Allocation and Quay Crane Assignment Problem Using a CP Approach."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th CP 2012",
        "info": "Québec City, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2012",
                "sub_name": "Principles and Practice of Constraint Programming - 18th International Conference, CP 2012, Québec City, QC, Canada, October 8-12, 2012. Proceedings.",
                "count": 71,
                "papers": [
                    "Constraint Programming and a Usability Quest.",
                    "Optimization Challenges in Smart Grid Operations.",
                    "Where Are the Interesting Problems?",
                    "A Generic Method for Identifying and Exploiting Dominance Relations.",
                    "Scheduling Scientific Experiments on the Rosetta/Philae Mission.",
                    "Max-Sur-CSP on Two Elements.",
                    "An Optimal Arc Consistency Algorithm for a Chain of Atmost Constraints with Cardinality.",
                    "Conflict Directed Lazy Decomposition.",
                    "Improving SAT-Based Weighted MaxSAT Solvers.",
                    "Distributed Tree Decomposition with Privacy.",
                    "Refining Restarts Strategies for SAT and UNSAT.",
                    "Boosting Local Consistency Algorithms over Floating-Point Numbers.",
                    "A Model Seeker: Extracting Global Constraint Models from Positive Examples.",
                    "On Computing Minimal Equivalent Subformulas.",
                    "Including Soft Global Constraints in DCOPs.",
                    "The Weighted Average Constraint.",
                    "Weibull-Based Benchmarks for Bin Packing.",
                    "Space-Time Tradeoffs for the Regular Constraint.",
                    "Inter-instance Nogood Learning in Constraint Programming.",
                    "Solving Temporal Problems Using SMT: Strong Controllability.",
                    "A Characterisation of the Complexity of Forbidding Subproblems in Binary Max-CSP.",
                    "Optimisation Modelling for Software Developers.",
                    "Adaptive Bisection of Numerical CSPs.",
                    "Resource Constrained Shortest Paths with a Super Additive Objective Function.",
                    "Relating Proof Complexity Measures and Practical Hardness of SAT.",
                    "The SeqBin Constraint Revisited.",
                    "Eigenvector Centrality in Industrial SAT Instances.",
                    "Classifying and Propagating Parity Constraints.",
                    "Consistencies for Ultra-Weak Solutions in Minimax Weighted CSPs Using the Duality Principle.",
                    "Propagating Soft Table Constraints.",
                    "WCSP Integration of Soft Neighborhood Substitutability.",
                    "Increasing Symmetry Breaking by Preserving Target Symmetries.",
                    "A Scalable Sweep Algorithm for the cumulative Constraint.",
                    "A New Encoding from MinSAT into MaxSAT.",
                    "Solving Minimal Constraint Networks in Qualitative Spatial and Temporal Reasoning.",
                    "Containment, Equivalence and Coreness from CSP to QCSP and Beyond.",
                    "An Optimal Filtering Algorithm for Table Constraints.",
                    "Parallel SAT Solver Selection and Scheduling.",
                    "Constraint Satisfaction over Bit-Vectors.",
                    "Towards Solver-Independent Propagators.",
                    "Interactive Algorithm for Multi-Objective Constraint Optimization.",
                    "Focus : A Constraint for Concentrating High Costs.",
                    "Refining Abstract Interpretation Based Value Analysis with Constraint Programming Techniques.",
                    "Time-Dependent Simple Temporal Networks.",
                    "Improved Bounded Max-Sum for Distributed Constraint Optimization.",
                    "A Hybrid MIP/CP Approach for Multi-activity Shift Scheduling.",
                    "Contributions to the Theory of Practical Quantified Boolean Formula Solving.",
                    "Breaking Variable Symmetry in Almost Injective Problems.",
                    "Understanding, Improving and Parallelizing MUS Finding Using Model Rotation.",
                    "Revisiting Neighborhood Inverse Consistency on Binary CSPs.",
                    "Syntactically Characterizing Local-to-Global Consistency in ORD-Horn.",
                    "A Hybrid Paradigm for Adaptive Parallel Search.",
                    "A Constraint Programming Approach for the Traveling Purchaser Problem.",
                    "Constraint-Based Register Allocation and Instruction Scheduling.",
                    "Maximising the Net Present Value of Large Resource-Constrained Projects.",
                    "Comparing Solution Methods for the Machine Reassignment Problem.",
                    "A Boolean Model for Enumerating Minimal Siphons and Traps in Petri Nets.",
                    "Cardinality Reasoning for Bin-Packing Constraint: Application to a Tank Allocation Problem.",
                    "The Offshore Resources Scheduling Problem: Detailing a Constraint Programming Approach.",
                    "Computational Protein Design as a Cost Function Network Optimization Problem.",
                    "A Filtering Technique for Fragment Assembly- Based Proteins Loop Modeling with Constraints.",
                    "A Branch and Prune Algorithm for the Computation of Generalized Aspects of Parallel Robots.",
                    "The Semigroups of Order 10.",
                    "Exploring Chemistry Using SMT.",
                    "A Pseudo-Boolean Set Covering Machine.",
                    "Finding a Nash Equilibrium by Asynchronous Backtracking.",
                    "Reasoning over Biological Networks Using Maximum Satisfiability.",
                    "Properties of Energy-Price Forecasts for Scheduling.",
                    "Aggregating Conditionally Lexicographic Preferences on Multi-issue Domains.",
                    "Constraint Programming for Path Planning with Uncertainty - Solving the Optimal Search Path Problem.",
                    "Feature Term Subsumption Using Constraint Programming with Basic Variable Symmetry."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th CP 2011",
        "info": "Perugia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2011",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2011 - 17th International Conference, CP 2011, Perugia, Italy, September 12-16, 2011. Proceedings.",
                "count": 61,
                "papers": [
                    "Orchestrating Satisfiability Engines.",
                    "Operations Research and Constraint Programming at Google.",
                    "Solving Problems with CP: Four Common Pitfalls to Avoid.",
                    "A Constraint Seeker: Finding and Ranking Global Constraints from Examples.",
                    "Bin Repacking Scheduling in Virtualized Datacenters.",
                    "Route Finder: Efficiently Finding k Shortest Paths Using Constraint Programming.",
                    "The Design of Cryptographic S-Boxes Using CSPs.",
                    "Optimal Carpet Cutting.",
                    "A Hybrid Approach for Solving Real-World Nurse Rostering Problems.",
                    "Constraint Programming for Controller Synthesis.",
                    "Neuron Constraints to Model Complex Real-World Problems.",
                    "A Constraint Based Approach to Cyclic RCPSP.",
                    "An Efficient Light Solver for Querying the Semantic Web.",
                    "On Guaranteeing Polynomially Bounded Search Tree Size.",
                    "A Framework for Decision-Based Consistencies.",
                    "Hierarchically Nested Convex VCSP.",
                    "Tractable Triangles.",
                    "On Minimal Weighted Clones.",
                    "Solving MAXSAT by Solving a Sequence of Simpler SAT Instances.",
                    "Filtering Algorithms for Discrete Cumulative Problems with Overloads of Resource.",
                    "Synthesis of Search Algorithms from High-Level CP Models.",
                    "Revisiting the tree Constraint.",
                    "Half Reification and Flattening.",
                    "The Parameterized Complexity of Local Consistency.",
                    "Symmetry Breaking in Numeric Constraint Problems.",
                    "On Minimal Constraint Networks.",
                    "Structural Tractability of Constraint Optimization.",
                    "Models and Strategies for Variants of the Job Shop Scheduling Problem.",
                    "MaxRPC Algorithms Based on Bitwise Operations.",
                    "Grid-Based SAT Solving with Iterative Partitioning and Clause Learning.",
                    "Large Neighborhood Search for Dial-a-Ride Problems.",
                    "On Deciding MUS Membership with QBF.",
                    "On the Relative Efficiency of DPLL and OBDDs with Axiom and Join.",
                    "Min CSP on Four Elements: Moving beyond Submodularity.",
                    "Algorithm Selection and Scheduling.",
                    "Incorporating Variance in Impact-Based Search.",
                    "A Quadratic Edge-Finding Filtering Algorithm for Cumulative Resource Constraints.",
                    "A CSP Solver Focusing on fac Variables.",
                    "Constraint Reasoning and Kernel Clustering for Pattern Decomposition with Scaling.",
                    "Solving Qualitative Constraints Involving Landmarks.",
                    "Searching for Doubly Self-orthogonal Latin Squares.",
                    "QCSP on Partially Reflexive Forests.",
                    "The Computational Complexity of Disconnected Cut and 2K 2-Partition.",
                    "Reducing the Search Space of Resource Constrained DCOPs.",
                    "Proving Symmetries by Model Transformation.",
                    "Value Ordering for Finding All Solutions: Interactions with Adaptive Variable Ordering.",
                    "Boolean Equi-propagation for Optimized SAT Encoding.",
                    "CP Models for Maximum Common Subgraph Problems.",
                    "Kangaroo: An Efficient Constraint-Based Local Search System Using Lazy Propagation.",
                    "Pseudo-Tree-Based Incomplete Algorithm for Distributed Constraint Optimization with Quality Bounds.",
                    "A More Efficient BDD-Based QBF Solver.",
                    "Constraint Propagation for Efficient Inference in Markov Logic.",
                    "Octagonal Domains for Continuous Constraints.",
                    "A Θ(n) Bound-Consistency Algorithm for the Increasing Sum Constraint.",
                    "Automatic Generation of Constraints for Partial Symmetry Breaking.",
                    "Beyond QCSP for Solving Control Problems.",
                    "On Mini-Buckets and the Min-fill Elimination Ordering.",
                    "Search Combinators.",
                    "Variable Independence and Resolution Paths for Quantified Boolean Formulas.",
                    "Pruning Rules for Constrained Optimisation for Conditional Preferences.",
                    "Checking and Filtering Global Set Constraints."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th CP 2010",
        "info": "St. Andrews, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2010",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2010 - 16th International Conference, CP 2010, St. Andrews, Scotland, UK, September 6-10, 2010. Proceedings.",
                "count": 50,
                "papers": [
                    "SAT Modulo Theories: Getting the Best of SAT and Global Constraint Filtering.",
                    "Constraint-Directed Search in Computational Finance and Economics.",
                    "Constraints, Graphs, Algebra, Logic, and Complexity.",
                    "Testing Expressibility Is Hard.",
                    "Applying Constraint Programming to Identification and Assignment of Service Professionals.",
                    "Computing the Density of States of Boolean Formulas.",
                    "Towards Parallel Non Serial Dynamic Programming for Solving Hard Weighted CSP.",
                    "Making Adaptive an Interval Constraint Propagation Algorithm Exploiting Monotonicity.",
                    "Improving the Performance of maxRPC.",
                    "Checking-Up on Branch-and-Check.",
                    "Spatial, Temporal, and Hybrid Decompositions for Large-Scale Vehicle Routing with Time Windows.",
                    "Decomposition of the NValue Constraint.",
                    "Propagating the Bin Packing Constraint Using Linear Programming.",
                    "Sweeping with Continuous Domains.",
                    "A New Hybrid Tractable Class of Soft Constraint Problems.",
                    "A Propagator for Maximum Weight String Alignment with Arbitrary Pairwise Dependencies.",
                    "Using Learnt Clauses in maxsat.",
                    "Domain Consistency with Forbidden Values.",
                    "Generating Special-Purpose Stateless Propagators for Arbitrary Constraints.",
                    "Including Ordinary Differential Equations Based Constraints in the Standard CP Framework.",
                    "Structural Tractability of Enumerating CSP Solutions.",
                    "Diversification and Intensification in Parallel SAT Solving.",
                    "A Systematic Approach to MDD-Based Constraint Programming.",
                    "A Complete Multi-valued SAT Solver.",
                    "Exact Cover via Satisfiability: An Empirical Study.",
                    "On the Complexity and Completeness of Static Constraints for Breaking Row and Column Symmetry.",
                    "Ensemble Classification for Constraint Solver Configuration.",
                    "On Testing Constraint Programs.",
                    "On the Containment of Forbidden Patterns Problems.",
                    "Improving the Floating Point Addition and Subtraction Constraints.",
                    "The Lattice Structure of Sets of Surjective Hyper-Operations.",
                    "Constraint Based Scheduling to Deal with Uncertain Durations and Self-Timed Execution.",
                    "Local Consistency and SAT-Solvers.",
                    "Heuristics for Planning with SAT.",
                    "Value-Ordering Heuristics: Search Performance vs. Solution Diversity.",
                    "A New O(n2logn) Not-First/Not-Last Pruning Algorithm for Cumulative Resource Constraints.",
                    "A Generic Visualization Platform for CP.",
                    "Database Constraints and Homomorphism Dualities.",
                    "A Box-Consistency Contractor Based on Extremal Functions.",
                    "Exponential Propagation for Set Variables.",
                    "An Empirical Study of Optimization for Maximizing Diffusion in Networks.",
                    "An Integrated Modelling, Debugging, and Visualisation Environment for G12.",
                    "Global Constraints on Feature Models.",
                    "Constraint Programming for Mining n-ary Patterns.",
                    "An Integrated Business Rules and Constraints Approach to Data Centre Capacity Management.",
                    "Context-Sensitive Call Control Using Constraints and Rules.",
                    "Load Balancing and Almost Symmetries for RAMBO Quorum Hosting.",
                    "Testing Continuous Double Auctions with a Constraint-Based Oracle.",
                    "A Safe and Flexible CP-Based Approach for Velocity Tuning Problems.",
                    "Contingency Plans for Air Traffic Management."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "15th CP 2009",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2009",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2009, 15th International Conference, CP 2009, Lisbon, Portugal, September 20-24, 2009, Proceedings.",
                "count": 64,
                "papers": [
                    "Constraint-Based Schedulers, Do They Really Work?",
                    "Challenges for Constraint Reasoning and Optimization in Computational Sustainability.",
                    "Observations on Symmetry Breaking.",
                    "Generating Optimal Stowage Plans for Container Vessel Bays.",
                    "Real-Time Tabu Search for Video Tracking Association.",
                    "Pin Assignment Using Stochastic Local Search Constraint Programming.",
                    "Modelling Equidistant Frequency Permutation Arrays: An Application of Constraints to Mathematics.",
                    "Scheduling the CB1000 Nanoproteomic Analysis System with Python, Tailor, and Minion.",
                    "Solving Nurse Rostering Problems Using Soft Global Constraints.",
                    "Online Selection of Quorum Systems for RAMBO Reconfiguration.",
                    "A Hybrid Constraint Model for the Routing and Wavelength Assignment Problem.",
                    "Memoisation for Constraint-Based Local Search.",
                    "On the Structure of Industrial SAT Instances.",
                    "A Gender-Based Genetic Algorithm for the Automatic Configuration of Algorithms.",
                    "Filtering Numerical CSPs Using Well-Constrained Subsystems.",
                    "Minimising Decision Tree Size as Combinatorial Optimisation.",
                    "Hull Consistency under Monotonicity.",
                    "A Constraint on the Number of Distinct Vectors with Application to Localization.",
                    "Approximating Weighted Max-SAT Problems by Compensating for Relaxations.",
                    "Confidence-Based Work Stealing in Parallel Constraint Programming.",
                    "Minimizing the Maximum Number of Open Stacks by Customer Search.",
                    "Using Relaxations in Maximum Density Still Life.",
                    "Constraint-Based Graph Matching.",
                    "Constraint Representations and Structural Tractability.",
                    "Asynchronous Inter-Level Forward-Checking for DisCSPs.",
                    "From Model-Checking to Temporal Logic Constraint Solving.",
                    "Exploiting Problem Structure for Solution Counting.",
                    "Solving a Location-Allocation Problem with Logic-Based Benders' Decomposition.",
                    "Lazy Clause Generation Reengineered.",
                    "The Proper Treatment of Undefinedness in Constraint Languages.",
                    "Search Spaces for Min-Perturbation Repair.",
                    "Snake Lex: An Alternative to Double Lex.",
                    "Closing the Open Shop: Contradicting Conventional Wisdom.",
                    "Reasoning about Optimal Collections of Solutions.",
                    "Constraints of Difference and Equality: A Complete Taxonomic Characterisation.",
                    "Synthesizing Filtering Algorithms for Global Chance-Constraints.",
                    "An Interpolation Method for CLP Traversal.",
                    "Same-Relation Constraints.",
                    "Dialectic Search.",
                    "Restricted Global Grammar Constraints.",
                    "Conflict Resolution.",
                    "Propagator Groups.",
                    "Efficient Generic Search Heuristics within the EMBP Framework.",
                    "Failed Value Consistencies for Constraint Satisfaction.",
                    "A Precedence Constraint Posting Approach for the RCPSP with Time Lags and Variable Durations.",
                    "SOGgy Constraints: Soft Open Global Constraints.",
                    "Exploiting Problem Decomposition in Multi-objective Constraint Optimization.",
                    "Search Space Extraction.",
                    "Coalition Structure Generation Utilizing Compact Characteristic Function Representations.",
                    "Compiling All Possible Conflicts of a CSP.",
                    "On the Power of Clause-Learning SAT Solvers with Restarts.",
                    "Slice Encoding for Constraint-Based Planning.",
                    "Evolving Parameterised Policies for Stochastic Constraint Programming.",
                    "Maintaining State in Propagation Solvers.",
                    "Cost-Driven Interactive CSP with Constraint Relaxation.",
                    "Weakly Monotonic Propagators.",
                    "Constraint-Based Optimal Testing Using DNNF Graphs.",
                    "Why Cumulative Decomposition Is Not as Bad as It Sounds.",
                    "On Decomposing Knapsack Constraints for Length-Lex Bounds Consistency.",
                    "Realtime Online Solving of Quantified CSPs.",
                    "Constraint-Based Local Search for the Automatic Generation of Architectural Tests.",
                    "Edge Finding Filtering Algorithm for Discrete Cumulative Resources in O(kn log n){\\mathcal O}(kn {\\rm log} n).",
                    "Evaluation of Length-Lex Set Variables.",
                    "The Complexity of Valued Constraint Models."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th CP 2008",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2008",
                "sub_name": "Principles and Practice of Constraint Programming, 14th International Conference, CP 2008, Sydney, Australia, September 14-18, 2008. Proceedings.",
                "count": 57,
                "papers": [
                    "Back to the Complexity of Universal Programs.",
                    "A Constraint Programming Approach for Allocation and Scheduling on the CELL Broadband Engine.",
                    "Planning and Scheduling the Operation of a Very Large Oil Pipeline Network.",
                    "Search Strategies for Rectangle Packing.",
                    "Solving a Telecommunications Feature Subscription Configuration Problem.",
                    "Protein Structure Prediction with Large Neighborhood Constraint Programming Search.",
                    "An Application of Constraint Programming to Superblock Instruction Scheduling.",
                    "Classes of Submodular Constraints Expressible by Graph Cuts.",
                    "Optimization of Simple Tabular Reduction for Table Constraints.",
                    "Universal Booleanization of Constraint Models.",
                    "Flow-Based Propagators for the SEQUENCE and Related Global Constraints.",
                    "Guiding Search in QCSP+ with Back-Propagation.",
                    "A New Framework for Sharp and Efficient Resolution of NCSP with Manifolds of Solutions.",
                    "A Branch and Bound Algorithm for Numerical MAX-CSP.",
                    "A Geometric Constraint over k-Dimensional Objects and Shapes Subject to Business Rules.",
                    "Cost-Based Domain Filtering for Stochastic Constraint Programming.",
                    "Dichotomic Search Protocols for Constrained Optimization.",
                    "Length-Lex Bounds Consistency for Knapsack Constraints.",
                    "A Framework for Hybrid Tractability Results in Boolean Weighted Constraint Satisfaction Problems.",
                    "From High Girth Graphs to Hard Instances.",
                    "Switching among Non-Weighting, Clause Weighting, and Variable Weighting in Local Search for SAT.",
                    "CPBPV: A Constraint-Programming Framework for Bounded Program Verification.",
                    "Exploiting Common Subexpressions in Numerical CSPs.",
                    "A Soft Constraint of Equality: Complexity and Approximability.",
                    "Structural Tractability of Propagated Constraints.",
                    "Connecting ABT with Arc Consistency.",
                    "Elicitation Strategies for Fuzzy Constraint Problems with Missing Preferences: Algorithms and Experimental Studies.",
                    "Reformulating Positive Table Constraints Using Functional Dependencies.",
                    "Relaxations for Compiled Over-Constrained Problems.",
                    "Approximate Compilation of Constraints into Multivalued Decision Diagrams.",
                    "Quantified Constraint Optimization.",
                    "Exploiting Decomposition in Constraint Optimization Problems.",
                    "A Coinduction Rule for Entailment of Recursively Defined Properties.",
                    "Maintaining Generalized Arc Consistency on Ad Hoc r-Ary Constraints.",
                    "Perfect Constraints Are Tractable.",
                    "Efficiently Solving Problems Where the Solutions Form a Group.",
                    "Approximate Solution Sampling (and Counting) on AND/OR Spaces.",
                    "Model Restarts for Structural Symmetry Breaking.",
                    "An Elimination Algorithm for Functional Constraints.",
                    "Crossword Puzzles as a Constraint Problem.",
                    "Recent Hybrid Techniques for the Multi-Knapsack Problem.",
                    "Edge Matching Puzzles as Hard SAT/CSP Benchmarks.",
                    "Test Strategy Generation Using Quantified CSPs.",
                    "Perfect Derived Propagators.",
                    "Refined Bounds for Instance-Based Search Complexity of Counting and Other #P Problems.",
                    "Transforming Inconsistent Subformulas in MaxSAT Lower Bound Computation.",
                    "Semi-automatic Generation of CHR Solvers for Global Constraints.",
                    "Stochastic Local Search for the Optimal Winner Determination Problem in Combinatorial Auctions.",
                    "Revisiting the Upper Bounding Process in a Safe Branch and Bound Algorithm.",
                    "Computing All Optimal Solutions in Satisfiability Problems with Preferences.",
                    "On the Efficiency of Impact Based Heuristics.",
                    "Probabilistically Estimating Backbones and Variable Bias: Experimental Overview.",
                    "A New Empirical Study of Weak Backdoors.",
                    "Adding Search to Zinc.",
                    "Experimenting with Small Changes in Conflict-Driven Clause Learning Algorithms.",
                    "Search Space Reduction for Constraint Optimization Problems.",
                    "Engineering Stochastic Local Search for the Low Autocorrelation Binary Sequence Problem."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th CP 2007",
        "info": "Providence, RI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2007",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2007, 13th International Conference, CP 2007, Providence, RI, USA, September 23-27, 2007, Proceedings.",
                "count": 67,
                "papers": [
                    "Caching in Backtracking Search.",
                    "Of Mousetraps and Men: A Cautionary Tale.",
                    "Estimation of the Minimal Duration of an Attitude Change for an Autonomous Agile Earth-Observing Satellite.",
                    "Solving an Air Conditioning System Problem in an Embodiment Design Context Using Constraint Satisfaction Techniques.",
                    "Solving the Salinity Control Problem in a Potable Water System.",
                    "Exploring Different Constraint-Based Modelings for Program Verification.",
                    "An Application of Constraint Programming to Generating Detailed Operations Schedules for Steel Manufacturing.",
                    "An Efficient Model and Strategy for the Steel Mill Slab Design Problem.",
                    "Constraint-Based Temporal Reasoning for E-Learning with LODE.",
                    "Scheduling for Cellular Manufacturing.",
                    "A Constraint Store Based on Multivalued Decision Diagrams.",
                    "GAC Via Unit Propagation.",
                    "Solution Directed Backjumping for QCSP.",
                    "Reformulating CSPs for Scalability with Application to Geospatial Reasoning.",
                    "A Generic Geometrical Constraint Kernel in Space and Time for Handling Polymorphic k-Dimensional Objects.",
                    "Local Symmetry Breaking During Search in CSPs.",
                    "Encodings of the Sequence Constraint.",
                    "On Inconsistent Clause-Subsets for Max-SAT Solving.",
                    "An Abstract Interpretation Based Combinator for Modelling While Loops in Constraint Programming.",
                    "Tradeoffs in the Complexity of Backdoor Detection.",
                    "Model-Driven Visualizations of Constraint-Based Local Search.",
                    "Dealing with Incomplete Preferences in Soft Constraint Problems.",
                    "Efficient Computation of Minimal Point Algebra Constraints by Metagraph Closure.",
                    "MUST: Provide a Finer-Grained Explanation of Unsatisfiability.",
                    "An Integrated White+Black Box Approach for Designing and Tuning Stochastic Local Search.",
                    "Limitations of Restricted Branching in Clause Learning.",
                    "Dynamic Management of Heuristics for Solving Structured CSPs.",
                    "A Compression Algorithm for Large Arity Extensional Constraints.",
                    "Valid Inequality Based Lower Bounds for WCSP.",
                    "Advisors for Incremental Propagation.",
                    "Breaking Symmetry of Interchangeable Variables and Values.",
                    "Path Consistency by Dual Consistency.",
                    "Exploiting Past and Future: Pruning by Inconsistent Partial State Dominance.",
                    "Scheduling Conditional Task Graphs.",
                    "Towards Robust CNF Encodings of Cardinality Constraints.",
                    "AND/OR Multi-valued Decision Diagrams for Constraint Optimization.",
                    "Parallelizing Constraint Programs Transparently.",
                    "MiniZinc: Towards a Standard CP Modelling Language.",
                    "Propagation = Lazy Clause Generation.",
                    "Boosting Probabilistic Choice Operators.",
                    "A Multi-engine Solver for Quantified Boolean Formulas.",
                    "Decomposing Global Grammar Constraints.",
                    "Structural Relaxations by Variable Renaming and Their Compilation for Solving MinCostSAT.",
                    "Bound-Consistent Deviation Constraint.",
                    "Constructive Interval Disjunction.",
                    "An LP-Based Heuristic for Optimal Planning.",
                    "A Cost-Based Model and Algorithms for Interleaving Solving and Elicitation of CSPs.",
                    "On Universal Restart Strategies for Backtracking Search.",
                    "Hierarchical Hardness Models for SAT.",
                    ": The Design and Analysis of an Algorithm Portfolio for SAT.",
                    "Filtering for Subgraph Isomorphism.",
                    "Solution Counting Algorithms for Constraint-Centered Search Heuristics.",
                    "Min-Domain Ordering for Asynchronous Backtracking.",
                    "Answer Set Optimization for and/or Composition of CP-Nets: A Security Scenario.",
                    "Uncertainty in Bipolar Preference Problems.",
                    "An Analysis of Slow Convergence in Interval Propagation.",
                    "The Expressive Power of Valued Constraints: Hierarchies and Collapses.",
                    "Eligible and Frozen Constraints for Solving Temporal Qualitative Constraint Networks.",
                    "The Log-Support Encoding of CSP into SAT.",
                    "Groupoids and Conditional Symmetry.",
                    "Sampling Strategies and Variable Selection in Weighted Degree Heuristics.",
                    "A Case for Simple SAT Solvers.",
                    "CP-Based Local Branching.",
                    "Strong Controllability of Disjunctive Temporal Problems with Uncertainty.",
                    "Exploiting Single-Cycle Symmetries in Branch-and-Prune algorithms.",
                    "Constraint Symmetry for the Soft CSP.",
                    "Breaking Value Symmetry."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "12th CP 2006",
        "info": "Nantes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2006",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2006, 12th International Conference, CP 2006, Nantes, France, September 25-29, 2006, Proceedings.",
                "count": 67,
                "papers": [
                    "Global Optimization of Probabilistically Constrained Linear Programs.",
                    "Algorithms and Constraint Programming.",
                    "Interval Analysis and Robotics.",
                    "Constraint Based Resilience Analysis.",
                    "Infinite Qualitative Simulations by Means of Constraint Programming.",
                    "Algorithms for Stochastic CSPs.",
                    "Graph Properties Based Filtering.",
                    "The ROOTS Constraint.",
                    "CoJava: Optimization Modeling by Nondeterministic Simulation.",
                    "An Algebraic Characterisation of Complexity for Valued Constraint.",
                    "Typed Guarded Decompositions for Constraint Satisfaction.",
                    "Propagation in CSP and SAT.",
                    "The Minimum Spanning Tree Constraint.",
                    "Impact of Censored Sampling on the Performance of Restart Strategies.",
                    "Watched Literals for Constraint Propagation in Minion.",
                    "Inner and Outer Approximations of Existentially Quantified Equality Constraints.",
                    "Performance Prediction and Automated Tuning of Randomized and Parametric Algorithms.",
                    "Adaptive Clause Weight Redistribution.",
                    "Localization of an Underwater Robot Using Interval Constraint Propagation.",
                    "Approximability of Integer Programming with Generalised Constraints.",
                    "When Constraint Programming and Local Search Solve the Scheduling Problem of Electricité de France Nuclear Power Plant Outages.",
                    "Generalized Arc Consistency for Positive Table Constraints.",
                    "Stochastic Allocation and Scheduling for Conditional Task Graphs in MPSoCs.",
                    "Boosting Open CSPs.",
                    "Compiling Constraint Networks into AND/OR Multi-valued Decision Diagrams (AOMDDs).",
                    "Distributed Constraint-Based Local Search.",
                    "High-Level Nondeterministic Abstractions in.",
                    "A Structural Characterization of Temporal Dynamic Controllability.",
                    "When Interval Analysis Helps Inter-block Backtracking.",
                    "Randomization in Constraint Programming for Airline Planning.",
                    "Towards an Efficient SAT Encoding for Temporal Reasoning.",
                    "Decomposition of Multi-operator Queries on Semiring-Based Graphical Models.",
                    "Dynamic Lex Constraints.",
                    "Generalizing AllDifferent: The SomeDifferent Constraint.",
                    "Mini-bucket Elimination with Bucket Propagation.",
                    "Constraint Satisfaction with Bounded Treewidth Revisited.",
                    "Preprocessing QBF.",
                    "The Theory of Grammar Constraints.",
                    "Constraint Programming Models for Graceful Graphs.",
                    "A Simple Distribution-Free Approach to the Max k-Armed Bandit Problem.",
                    "Generating Propagators for Finite Set Constraints.",
                    "Compiling Finite Linear CSP into SAT.",
                    "Differentiable Invariants.",
                    "Revisiting the Sequence Constraint.",
                    ": A Bottom-Up Approach for Solving Quantified CSPs.",
                    "General Symmetry Breaking Constraints.",
                    "Inferring Variable Conflicts for Local Search.",
                    "Reasoning by Dominance in Not-Equals Binary Constraint Networks.",
                    "Distributed Stable Matching Problems with Ties and Incomplete Lists.",
                    "Soft Arc Consistency Applied to Optimal Planning.",
                    "A Note on Low Autocorrelation Binary Sequences.",
                    "Relaxations and Explanations for Quantified Constraint Satisfaction Problems.",
                    "Static and Dynamic Structural Symmetry Breaking.",
                    "The Modelling Language Zinc.",
                    "A Filter for the Circuit Constraint.",
                    "A New Algorithm for Sampling CSP Solutions Uniformly at Random.",
                    "Sports League Scheduling: Enumerative Search for Prob026 from CSPLib.",
                    "Dynamic Symmetry Breaking Restarted.",
                    "The Effect of Constraint Representation on Structural Tractability.",
                    "Failure Analysis in Backtrack Search for Constraint Satisfaction.",
                    "Heavy-Tailed Runtime Distributions: Heuristics, Models and Optimal Refutations.",
                    "An Extension of Complexity Bounds and Dynamic Heuristics for Tree-Decompositions of CSP.",
                    "Clique Inference Process for Solving Max-CSP.",
                    "Global Grammar Constraints.",
                    "Constraint Propagation for Domain Bounding in Distributed Task Scheduling.",
                    "Interactive Distributed Configuration.",
                    "Retroactive Ordering for Dynamic Backtracking."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th CP 2005",
        "info": "Sitges (Barcelona), Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2005",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2005, 11th International Conference, CP 2005, Sitges, Spain, October 1-5, 2005, Proceedings.",
                "count": 121,
                "papers": [
                    "Search and Inference in AI Planning.",
                    "OWL: A Description Logic Based Ontology Language.",
                    "Preference Reasoning.",
                    "The G12 Project: Mapping Solver Independent Models to Efficient Solutions.",
                    "Symmetry Definitions for Constraint Satisfaction Problems.",
                    "Dynamic Ordering for Asynchronous Backtracking on DisCSPs.",
                    "Incremental Algorithms for Local Search from Existential Second-Order Logic.",
                    "Inter-distance Constraint: An Extension of the All-Different Constraint for Scheduling Equal Length Jobs.",
                    "Mind the Gaps: A New Splitting Strategy for Consistency Techniques.",
                    "Graph Invariants as Necessary Conditions for Global Constraints.",
                    "Allocation and Scheduling for MPSoCs via Decomposition and No-Good Generation.",
                    "Sub-optimality Approximations.",
                    "A Linear-Logic Semantics for Constraint Handling Rules.",
                    "Distributed Stable Matching Problems.",
                    "Beyond Hypertree Width: Decomposition Methods Without Decompositions.",
                    "Ad-hoc Global Constraints for Life.",
                    "Tractable Clones of Polynomials over Semigroups.",
                    "CP(Graph): Introducing a Graph Computation Domain in Constraint Programming.",
                    "Interval Analysis in Scheduling.",
                    "Assumption-Based Pruning in Conditional CSP.",
                    "Conditional Symmetry Breaking.",
                    "Symmetry and Consistency.",
                    "Solving the MOLR and Social Golfers Problems.",
                    "Advances in Polytime Isomorph Elimination for Configuration.",
                    "Planning and Scheduling to Minimize Tardiness.",
                    "Search Heuristics and Heavy-Tailed Behaviour.",
                    "2-Way vs. d-Way Branching for CSP.",
                    "Maintaining Longest Paths in Cyclic Graphs.",
                    "Applying Constraint Programming to Rigid Body Protein Docking.",
                    "Maximum Constraint Satisfaction on Diamonds.",
                    "Exploiting Unit Propagation to Compute Lower Bounds in Branch and Bound Max-SAT Solvers.",
                    "Generalized Conflict Learning for Hybrid Discrete/Linear Optimization.",
                    "Parallel Local Search in Comet.",
                    "Generating Corrective Explanations for Interactive Constraint Satisfaction.",
                    "SPREAD: A Balancing Constraint Based on Statistics.",
                    "Automatic Detection of Variable and Value Symmetries.",
                    "Breaking All Value Symmetries in Surjection Problems.",
                    "AC-*: A Configurable, Generic and Adaptive Arc Consistency Algorithm.",
                    "Maintaining Arc Consistency Algorithms During the Search Without Additional Space Cost.",
                    "Weak Composition for Qualitative Spatial and Temporal Reasoning.",
                    "Boosting Distributed Constraint Satisfaction.",
                    "Depth-First Mini-Bucket Elimination.",
                    "Using SAT in QBF.",
                    "Tree Decomposition with Function Filtering.",
                    "On Solving Soft Temporal Constraints Using SAT Techniques.",
                    "Eplex: Harnessing Mathematical Programming Solvers for Constraint Logic Programming.",
                    "Caching Search States in Permutation Problems.",
                    "Repair-Based Methods for Quantified CSPs.",
                    "Handling Implication and Universal Quantification Constraints in FLUX.",
                    "Solving Simple Planning Problems with More Inference and No Search.",
                    "Solving Large-Scale Nonlinear Programming Problems by Constraint Partitioning.",
                    "Factor Analytic Studies of CSP Heuristics.",
                    "Lookahead Saturation with Restriction for SAT.",
                    "Evolving Variable-Ordering Heuristics for Constrained Optimisation.",
                    "Multi-point Constructive Search.",
                    "Bounds of Graph Characteristics.",
                    "Acquiring Parameters of Implied Global Constraints.",
                    "Integrating Benders Decomposition Within Constraint Programming.",
                    "Using Boolean Constraint Propagation for Sub-clauses Deduction.",
                    "Extending Systematic Local Search for Job Shop Scheduling Problems.",
                    "Interactive Reconfiguration in Power Supply Restoration.",
                    "Neighbourhood Clause Weight Redistribution in Local Search for SAT.",
                    "Computing and Exploiting Tree-Decompositions for Solving Constraint Networks.",
                    "Encoding Requests to Web Service Compositions as Constraints.",
                    "Test Instance Generation for MAX 2SAT.",
                    "Consistency for Quantified Constraint Satisfaction Problems.",
                    "Alternate Modeling in Sport Scheduling.",
                    "Approximations in Distributed Optimization.",
                    "Extremal CSPs.",
                    "Beyond Finite Domains: The All Different and Global Cardinality Constraints.",
                    "Views and Iterators for Generic Constraint Implementations.",
                    "Approximated Consistency for the Automatic Recording Problem.",
                    "Towards an Optimal CNF Encoding of Boolean Cardinality Constraints.",
                    "Approximate Constrained Subgraph Matching.",
                    "Distributed Constraints for Large-Scale Scheduling Problems.",
                    "Solving Over-Constrained Problems with SAT.",
                    "A Constraint Based Agent for TAC-SCM.",
                    "Solving the Car-Sequencing Problem as a Non-binary CSP.",
                    "Dimensioning an Inbound Call Center Using Constraint Programming.",
                    "Methods to Learn Abstract Scheduling Models.",
                    "Automated Search for Heuristic Functions.",
                    "Constraint-Based Inference: A Bridge Between Constraint Processing and Probability Inference.",
                    "Scheduling Social Tournaments.",
                    "Domain Reduction for the Circuit Constraint.",
                    "Using Constraint Programming for Solving Distance CSP with Uncertainty.",
                    "Improved Algorithm for Finding (a, b)-Super Solutions.",
                    "Local Consistency in Weighted CSPs and Inference in Max-SAT.",
                    "Modeling Constraint Programs with Software Technology Standards.",
                    "Solution Equivalent Subquadrangle Reformulations of Constraint Satisfaction Problems.",
                    "Mechanism Design for Preference Aggregation over Coalitions.",
                    "LP as a Global Search Heuristic Across Different Constrainedness Regions.",
                    "Consistency for Partially Defined Constraints.",
                    "Subnet Generation Problem: A New Network Routing Problem.",
                    "Partial Redundant Modeling.",
                    "AND/OR Branch-and-Bound for Solving Mixed Integer Linear Programming Problems.",
                    "Weak Symmetries in Problem Formulations.",
                    "Towards the Systematic Generation of Channelling Constraints.",
                    "AND/OR Search Spaces and the Semantic Width of Constraint Networks.",
                    "Statistical Modelling of CSP Solving Algorithms Performance.",
                    "Probabilistic Arc Consistency.",
                    "GOOSE - A Generic Object-Oriented Search Environment.",
                    "Randomization for Multi-agent Constraint Optimization.",
                    "Uncertainty in Soft Constraint Problems.",
                    "Speeding Up Constrained Path Solvers with a Reachability Propagator.",
                    "From Linear Relaxations to Global Constraint Propagation.",
                    "Encoding HTN Planning as a Dynamic CSP.",
                    "Specialised Constraints for Stable Matching Problems.",
                    "Bounds-Consistent Local Search.",
                    "Robust Constraint Solving Using Multiple Heuristics.",
                    "Scheduling with Uncertain Start Dates.",
                    "The Role of Redundant Clauses in Solving Satisfiability Problems.",
                    "Applying Decomposition Methods to Crossword Puzzle Problems.",
                    "Asymmetric Distributed Constraints Satisfaction Problems.",
                    "Full Arc Consistency in WCSP and in Constraint Hierarchies with Finite Domains.",
                    "CoJava: A Unified Language for Simulation and Optimization.",
                    "Programming with TOY(FD).",
                    "Computing Super-Schedules.",
                    "Proterv-II: An Integrated Production Planning and Scheduling System.",
                    "The Comet Programming Language and System.",
                    "Random Stimuli Generation for Functional Hardware Verification as a CP Application.",
                    "A BDD-Based Interactive Configurator for Modular Systems."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th CP 2004",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2004",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2004, 10th International Conference, CP 2004, Toronto, Canada, September 27 - October 1, 2004, Proceedings.",
                "count": 97,
                "papers": [
                    "Constraints in Program Analysis and Verification.",
                    "Constraint Programming Next Challenge: Simplicity of Use.",
                    "Algorithmic Adventures at the Interface of Computer Science, Statistical Physics, and Combinatorics.",
                    "Challenges for Constraint Programming in Networking.",
                    "Consistency and Random Constraint Satisfaction Models with a High Constraint Tightness.",
                    "Statistical Regimes Across Constrainedness Regions.",
                    "Constraint-Based Combinators for Local Search.",
                    "Unary Resource Constraint with Optional Activities.",
                    "Constraint Propagation as a Proof System.",
                    "Backtrack-Free Search for Real-Time Constraint Satisfaction.",
                    "Deriving Filtering Algorithms from Constraint Checkers.",
                    "Leveraging the Learning Power of Examples in Automated Constraint Acquisition.",
                    "Disjoint, Partition and Intersection Constraints for Set and Multiset Variables.",
                    "Decomposition and Learning for a Hard Real Time Task Allocation Problem.",
                    "Quantified Constraint Satisfaction and 2-Semilattice Polymorphisms.",
                    "(Smart) Look-Ahead Arc Consistency and the Pursuit of CSP Tractability.",
                    "Heuristic Selection for Stochastic Search Optimization: Modeling Solution Quality by Extreme Value Theory.",
                    "A Complete Characterization of Complexity for Boolean Constraint Optimization Problems.",
                    "Financial Portfolio Optimisation.",
                    "Bounding the Resource Availability of Partially Ordered Events with Constant Resource Impact.",
                    "Monotone Literals and Learning in QBF Reasoning.",
                    "Streamlined Constraint Reasoning.",
                    "A Domain Consistency Algorithm for the Stretch Constraint.",
                    "A Hybrid Method for Planning and Scheduling.",
                    "Counting-Based Look-Ahead Schemes for Constraint Satisfaction.",
                    "Completable Partial Solutions in Constraint Programming and Constraint-Based Scheduling.",
                    "Set Domain Propagation Using ROBDDs.",
                    "Global Constraints for Integer and Set Value Precedence.",
                    "Quality of LP-Based Approximations for Highly Combinatorial Problems.",
                    "Constraint Satisfaction in Semi-structured Data Graphs.",
                    "Strategies for Global Optimization of Temporal Preferences.",
                    "ID Walk: A Candidate List Strategy with a Simple Diversification Device.",
                    "Understanding Random SAT: Beyond the Clauses-to-Variables Ratio.",
                    "Symbolic Decision Procedures for QBF.",
                    "Propagation Guided Large Neighborhood Search.",
                    "A Regular Language Membership Constraint for Finite Sequences of Variables.",
                    "Generating Robust Partial Order Schedules.",
                    "Full Dynamic Substitutability by SAT Encoding.",
                    "Improved Bound Computation in Presence of Several Clique Constraints.",
                    "Improved Algorithms for the Global Cardinality Constraint.",
                    "Impact-Based Search Strategies for Constraint Programming.",
                    "The Cardinality Matrix Constraint.",
                    "Controllability of Soft Temporal Constraint Problems.",
                    "Hybrid Set Domains to Strengthen Constraint Propagation and Reduce Symmetries.",
                    "Speeding Up Constraint Propagation.",
                    "Theoretical Foundations of CP-Based Lagrangian Relaxation.",
                    "A Constraint for Bin Packing.",
                    "Solving Non-clausal Formulas with DPLL Search.",
                    "A Hyper-arc Consistency Algorithm for the Soft Alldifferent Constraint.",
                    "Efficient Strategies for (Weighted) Maximum Satisfiability.",
                    "Preprocessing Techniques for Distributed Constraint Optimization.",
                    "Variable Ordering Heuristics Show Promise.",
                    "The Tractability of Global Constraints.",
                    "Support Inference for Generic Filtering.",
                    "Strong Cost-Based Filtering for Lagrange Decomposition Applied to Network Design.",
                    "The Impact of AND/OR Search Spaces on Constraint Satisfaction and Counting.",
                    "A General Extension of Constraint Propagation for Constraint Optimization.",
                    "How Much Backtracking Does It Take to Color Random Graphs? Rigorous Results on Heavy Tails.",
                    "Solving the Crane Scheduling Problem Using Intelligent Search Schemes.",
                    "Algorithms for Quantified Constraint Satisfaction Problems.",
                    "Improving the Applicability of Adaptive Consistency: Preliminary Results.",
                    "On-Demand Bound Computation for Best-First Constraint Optimization.",
                    "A New Algorithm for Maintaining Arc Consistency After Constraint Retraction.",
                    "Computing the Frequency of Partial Orders.",
                    "On Tightness of Constraints.",
                    "Concurrent Dynamic Backtracking for Distributed CSPs.",
                    "Set Variables and Local Search.",
                    "N-Kings for Dynamic Systems.",
                    "Relation Variables in Qualitative Spatial Reasoning.",
                    "Synchronous, Asynchronous and Hybrid Algorithms for DisCSP.",
                    "Long-Term Learning for Algorithm Control.",
                    "Solution Extraction with the \"Critical Path\" in Graphplan-Based Optimal Temporal Planning.",
                    "Machine Learning for Portfolio Selection Using Structure at the Instance Level.",
                    "Local Search with Maximal Independent Sets.",
                    "A Dynamic Restart Strategy for Randomized BT Search.",
                    "A BDD-Based Approach to Interactive Configuration.",
                    "Extending Super-solutions.",
                    "Choosing Efficient Representations of Abstract Variables.",
                    "A Hypergraph Separator Based Variable Ordering Heuristic for Solving Real World SAT.",
                    "Exploiting Symmetries via Permutations for PC Board Manufacturing.",
                    "Iterative Forward Search Algorithm: Combining Local Search with Maintaining Arc Consistency and a Conflict-Based Statistics.",
                    "Programming Robotic Devices with a Timed Concurrent Constraint Language.",
                    "Heuristics for the Distributed Breakout Algorithm.",
                    "Explanations and Numeric CSPs.",
                    "Softly Constrained CP Nets.",
                    "Online Constraint Solving and Rectangle Packing.",
                    "Modelling Chemical Reactions Using Constraint Programming and Molecular Graphs.",
                    "Constraining Special-Purpose Domain Types.",
                    "PLASMA: A Constraint Based Planning Architecture.",
                    "Applying Constraint Satisfaction Techniques to 3D Camera Control.",
                    "Adaptive Enterprise Optimization Framework: AEO Server and AEO Studio.",
                    "CRE2: A CP Application for Reconfiguring a Power Distribution Network for Power Losses Reduction.",
                    "A Constraint-Based Planner Applied to Data Processing Domains.",
                    "CLab: A C++ Library for Fast Backtrack-Free Interactive Product Configuration..",
                    "A Constraint-Based System for Hiring and Managing Graduate Teaching Assistants.",
                    "A Web-Based Meeting Scheduling Solver With Privacy Guarantees, Without Trusted Servers.",
                    "A Constraint-Based Graphics Library for B-Prolog."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th CP 2003",
        "info": "Kinsale, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2003",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2003, 9th International Conference, CP 2003, Kinsale, Ireland, September 29 - October 3, 2003, Proceedings.",
                "count": 126,
                "papers": [
                    "Ten Challenges Redux: Recent Progress in Propositional Reasoning and Search.",
                    "Automated Mechanism Design: A New Application Area for Search Algorithms.",
                    "Languages versus Packages for Constraint Problem Solving.",
                    "Constraint Patterns.",
                    "Control Abstractions for Local Search.",
                    "Improved Algorithms for Counting Solutions in Constraint Satisfaction Problems.",
                    "Boosting Chaff's Performance by Incorporating CSP Heuristics.",
                    "Efficient CNF Encoding of Boolean Cardinality Constraints.",
                    "A Two-Stage Hybrid Algorithm for Pickup and Delivery Vehicle Routing Problems with Time Windows.",
                    "Solving Finite Domain Constraint Hierarchies by Local Consistency and Tree Search.",
                    "HIBISCUS: A Constraint Programming Application to Staff Scheduling in Health Care.",
                    "Constraint-Based Optimization with the Minimax Decision Criterion.",
                    "An Algebraic Approach to Multi-sorted Constraints.",
                    "Periodic Constraint Satisfaction Problems: Polynomial-Time Algorithms.",
                    "Box Constraint Collections for Adhoc Constraints.",
                    "Propagation Redundancy in Redundant Modelling.",
                    "Soft Constraints: Complexity and Multimorphisms.",
                    "Constraint Satisfaction Differential Problems.",
                    "A Wealth of SAT Distributions with Planted Assignments.",
                    "Redundant Modeling for the QuasiGroup Completion Problem.",
                    "Open Constraint Optimization.",
                    "Constraints for Breaking More Row and Column Symmetries.",
                    "Generic SBDD Using Computational Group Theory.",
                    "Using Stochastic Local Search to Solve Quantified Boolean Formulae.",
                    "Solving Max-SAT as Weighted CSP.",
                    "Constraint Reasoning over Strings.",
                    "Tractability by Approximating Constraint Languages.",
                    "A Hybrid Constraint Programming and Semidefinite Programming Approach for the Stabe Set Problem.",
                    "A Constraint-Aided Conceptual Design Environment for Autodesk Inventor.",
                    "Fast Bound Consistency for the Global Cardinality Constraint.",
                    "Propagating N-Ary Rigid-Body Constraints.",
                    "Solving 'Still Life' with Soft Constraints and Bucket Elimination.",
                    "Exploiting Multidirectionality in Coarse-Grained Arc Consistency Algorithms.",
                    "Local-Search Techniques for Propositional Logic Extended with Cardinality Constraints.",
                    "Discrepancy-Based Additive Bounding for the AllDifferent Constraint.",
                    "A Synthesis of Constraint Satisfaction and Constraint Solving.",
                    "Maintaining Longest Paths Incrementally.",
                    "Resolution and Constraint Satisfaction.",
                    "Generating High Quality Schedules for a Spacecraft Memory Downlink Problem.",
                    "Symmetry Breaking Using Stabilizers.",
                    "An Efficient Bounds Consistency Algorithm for the Global Cardinality Constraint.",
                    "Solving Existentially Quantified Constraints with One Equality and Arbitrarily Many Inequalities.",
                    "Using Constraint Programming to Solve the Maximum Clique Problem.",
                    "Greater Efficiency for Conditional Constraint Satisfaction.",
                    "Incremental Computation of Resource-Envelopes in Producer-Consumer Models.",
                    "Approximated Consistency for Knapsack Constraints.",
                    "Cost-Based Filtering for Shorter Path Constraints.",
                    "Bounded Backtracking for the Valued Constraint Satisfaction Problems.",
                    "Consistency and Propagation with Multiset Constraints: A Formal Viewpoint.",
                    "Pruning while Sweeping over Task Intervals.",
                    "Improving Backtrack Search for Solving the TCSP.",
                    "Certainty Closure: A Framework for Reliable Constraint Reasoning with Uncertainty.",
                    "clp(pdf(y)): Constraints for Probabilistic Reasoning in Logic Programming.",
                    "To Be or Not to Be ... a Global Constraint.",
                    "Constraint Programming for Modelling and Solving Modal Satisfability.",
                    "Distributed Forward Checking.",
                    "A New Classs of Binary CSPs for which Arc-Constistency Is a Decision Procedure.",
                    "Semi-automatic Modeling by Constraint Acquisition.",
                    "Structured vs. Unstructured Large Neighborhood Search: A Case Study on Job-Shop Scheduling Problems with Earliness and Tardiness Costs.",
                    "Using the Breakout Algorithm to Identify Hard and Unsolvable Subproblems.",
                    "Toy(FD): Sketch of Operational Semantics.",
                    "Scheduling in the Face of Uncertain Resource Consumption and Utility.",
                    "Supertree Construction with Constraint Programming.",
                    "(In)Effectiveness of Look-Ahead Techniques in a Modern SAT Solver.",
                    "Reduce and Assign: A Constraint Logic Programming and Local Search Integration Framework to Solve Combinatorial Search Problems.",
                    "A Canonicity Test for Configuration.",
                    "Improved Algorithms for Max-restricted Path Consistency.",
                    "CP-IP Techniques for the Bid Evaluation in Combinatorial Auctions.",
                    "A Two-Level Search Strategy for Packing Unequal Circles into a Circle Container.",
                    "Unrestricted Nogood Recording in CSP Search.",
                    "Constraints over Ontologies.",
                    "Using Constraints for Exploring Catalogs.",
                    "Intermediate (Learned) Consistencies.",
                    "Semi-independent Partitioning: A Method for Bounding the Solution to COP's.",
                    "Boosting as a Metaphor for Algorithm Design.",
                    "An Efficient Filtering Algorithm for Disjunction of Constraints.",
                    "INCOP: An Open Library for INcomplete Combinatorial OPtimization.",
                    "A Composition Algorithm for Very Hard Graph 3-Colorability Instances.",
                    "Efficient Represenation of Discrete Sets for Constraint Programming.",
                    "Applying Interchangeability Techniques to the Distributed Breakout Algorithm.",
                    "Symmetry Breaking in Graceful Graphs.",
                    "Tree Local Search.",
                    "A SAT-Based Approach to Multiple Sequence Alignment.",
                    "Maintaining Dominance Consistency.",
                    "Terminating Decision Algorithms Optimally.",
                    "Scene Reconstruction Based on Constraints: Details on the Equation System Decomposition.",
                    "A New Approach to Solving SAT-Encoded Binary CSPs.",
                    "FeReRA: A Multi-agent Approach to Constraint Satisfaction.",
                    "Semantic Decomposition for Solving Distance Constraints.",
                    "Using Constraint Programming and Simulation for Execution Monitoring and On-Line Rescheduling with Uncertainty.",
                    "On the Enhancement of the Informed Backtracking Algorithm.",
                    "Extending CLP with Metaheuristics.",
                    "Self Configuring Constraint Programming Systems.",
                    "Interactive Tradeoff Generation.",
                    "Introducing ESRA, a Relational Language for Modelling Combinatorial Problems.",
                    "Abstracting Constraints Using Constraints.",
                    "Sensitivity Analysis in CSPs.",
                    "Solution Stability in Constraint Satisfaction Problems.",
                    "distn: An Euclidean Distance Global Constraint.",
                    "Algorithmic Mechanism Design and Constraints.",
                    "Preference Constraints: New Global Soft Constraints Dedicated to Preference Binary Relations.",
                    "Optimising the Representation and Evaluation of Semiring Combination Constraints.",
                    "Symmetry Breaking Ordering Constraints.",
                    "Observation of Constraint Programs.",
                    "Search Programming.",
                    "Exploiting Microstructure in CSPs.",
                    "Using Case-Based Reasoning to Write Constraint Programs.",
                    "Reformulation Techniques for a Class of Permutation Problems.",
                    "NuSBDS: An Easy to Use Symmetry Breaking System.",
                    "Interactivity in Constraint Programming.",
                    "Identifying Inconsistent CSPs by Relaxation.",
                    "Useful Explanations.",
                    "Teacher and Learner Profiles for Constraint Acquisition.",
                    "Comparison of Symmetry Breaking Methods.",
                    "Improved Branch and Bound Algorithms for Max-2-SAT and Weighted Max-2-SAT.",
                    "Search for Mathematical Objects.",
                    "Explanations for Global Constraints.",
                    "Watching Clauses in Quantified Boolean Formulae.",
                    "Distributed Constraint-Based Railway Simulation.",
                    "Dynamic Step Size Adjustment in Iterative Deepening Search.",
                    "Learning Good Variable Orderings.",
                    "An Adaptive Controller for Real-Time Resolution of the Vehicle Routing Problem.",
                    "alpha-Dynamic Controllability of Simple Temporal Problems with Preferences and Uncertainty.",
                    "Computing Explanations for Global Scheduling Constraints.",
                    "Restart Strategies: Analysis and Simulation.",
                    "OpenSolver: A Coordination-Enabled Abstract Branch-and-Prune Tree Search Engine."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "8th CP 2002",
        "info": "Ithaca, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2002",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2002, 8th International Conference, CP 2002, Ithaca, NY, USA, September 9-13, 2002, Proceedings.",
                "count": 83,
                "papers": [
                    "Reduced Cost-Based Ranking for Generating Promising Subproblems.",
                    "Integrating Constraint and Integer Programming for the Orthogonal Latin Squares Problem.",
                    "On Optimal Correction of Inconsistent Linear Constraints.",
                    "Temporal Planning through Mixed Integer Programming: A Preliminary Report.",
                    "A New Multi-resource cumulatives Constraint with Negative Heights.",
                    "On the Sum Constraint: Relaxation and Applications.",
                    "Global Constraints for Lexicographic Orderings.",
                    "A Global Filtering Algorithm for Handling Systems of Quadratic Equations and Inequations.",
                    "Amplification of Search Performance through Randomization of Heuristics.",
                    "Computing the Envelope for Stepwise-Constant Resource Allocations.",
                    "Local Probing Applied to Scheduling.",
                    "A Hybrid Approach for SAT.",
                    "Recovering and Exploiting Structural Knowledge from CNF Formulas.",
                    "Towards a Symmetric Treatment of Satisfaction and Conflicts in Quantified Boolean Formula Evaluation.",
                    "Accelerating Random Walks.",
                    "Scaling and Probabilistic Smoothing: Efficient Dynamic Local Search for SAT.",
                    "Learning and Solving Soft Temporal Constraints: An Experimental Study.",
                    "Opportunistic Specialization in Russian Doll Search.",
                    "Range-Based Algorithm for Max-CSP.",
                    "Resolution Complexity of Random Constraints.",
                    "Constraint Satisfaction, Bounded Treewidth, and Finite-Variable Logics.",
                    "Determining the Number of Solutions to Binary CSP Instances.",
                    "Consistency Checking for Qualitative Spatial Reasoning with Cardinal Directions.",
                    "Open Constraint Satisfaction.",
                    "Beyond NP: Arc-Consistency for Quantified Constraints.",
                    "Secure Distributed Constraint Satisfaction: Reaching Agreement without Revealing Private Information.",
                    "A Dual Graph Translation of a Problem in 'Life'.",
                    "Groups and Constraints: Symmetry Breaking during Search.",
                    "Partial Symmetry Breaking.",
                    "Symmetry Breaking Revisited.",
                    "Breaking Row and Column Symmetries in Matrix Models.",
                    "Solving the Kirkman's Schoolgirl Problem in a Few Seconds.",
                    "Inferring Constraint Types in Constraint Programming.",
                    "Model-Based Programming: Controlling Embedded Systems by Reasoning About Hidden State.",
                    "The Adaptive Constraint Engine.",
                    "Indexical-Based Solver Learning.",
                    "Learning the Empirical Hardness of Optimization Problems: The Case of Combinatorial Auctions.",
                    "Restart Policies with Dependence among Runs: A Dynamic Programming Approach.",
                    "Visopt ShopFloor: On the Edge of Planning and Scheduling.",
                    "Constraint Programming Contribution to Benders Decomposition: A Case Study.",
                    "Modeling Camera Control with Constrained Hypertubes.",
                    "Robust and Parallel Solving of a Network Design Problem.",
                    "Connections Reservation with Rerouting for ATM Networks: A Hybrid Approach with Constraints.",
                    "Communication and Computation in Distributed CSP Algorithms.",
                    "Continuous First-Order Constraint Satisfactionwith Equality and Disequality Constraints.",
                    "A Relaxation of the Cumulative Constraint.",
                    "Improving GSAT Using 2SAT.",
                    "A Relational Constraint Solver for Model-Based Engineering.",
                    "Conflict-Based Repair Techniques for Solving Dynamic Scheduling Problems.",
                    "Scaling Properties of Pure Random Walk on Random 3-SAT.",
                    "Criticality and Parallelism in Structured SAT Instances.",
                    "Characterizing SAT Problems with the Row Convexity Property.",
                    "Interchangeability in Soft CSPs.",
                    "On Constraint Problems with Incompleteor Erroneous Data.",
                    "Heuristic Constraint Propagation.",
                    "An Arc-Consistency Algorithm for the Minimum Weight All Different Constraint.",
                    "Algebraic Properties of CSP Model Operators.",
                    "AC-3d an Efficient Arc-Consistency Algorithm with a Low Space-Complexity.",
                    "Integrating Search Objects in Asynchronous Constraint Solving.",
                    "Distributed Constraint-Based Railway Simulation.",
                    "Symmetry Breaking in Peaceably Coexisting Armies of Queens.",
                    "Batch Processing with Sequence Dependent Setup Times.",
                    "Interactive Heuristic Search Algorithm.",
                    "On Constraint Problems with Incomplete or Erroneous Data.",
                    "Design of a New Metaheuristic for MAXSAT Problems.",
                    "Disjunctive and Continuous Constraint Satisfaction Problems.",
                    "Tuning Randomization in Backtrack Search SAT Algorithms.",
                    "Constraint Solving in Test-Data Generation.",
                    "Improving Cost Calculations for Global Constraints in Local Search.",
                    "A Modeling Framework for Constraints.",
                    "A Linear Programming Based Satisfiability Solver Using a New Horn-Driven Search Tree Design.",
                    "A Concurrent Constraint Programming Approach for Trajectory Determination of Autonomous Vehicles.",
                    "Using Constraint Propagation to Accelerate Column Generation in Aircraft Scheduling.",
                    "Solving and Learning Soft Temporal Constraints; Ceteris Paribus Statements Represented as Soft Constraints Problems.",
                    "A Partially Solved Form for Heterogeneous Constraints in Disjunctive Normal Form.",
                    "Models of Injection Problems.",
                    "Partial Symmetry Breaking.",
                    "Automatic Generation of Implied Clauses for SAT.",
                    "Bridging the Gap between SAT and CSP.",
                    "Reducing Symmetry in Matrix Models.",
                    "Studying Interchangeability in Constraint Satisfaction Problems.",
                    "Constraint Modeling in the Context of Academic Task Assignment.",
                    "Design Tradeoffs for Autonomous Trading Agents."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7th CP 2001",
        "info": "Paphos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2001",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2001, 7th International Conference, CP 2001, Paphos, Cyprus, November 26 - December 1, 2001, Proceedings.",
                "count": 84,
                "papers": [
                    "Hybrid Benders Decomposition Algorithms in Constraint Logic Programming.",
                    "Branch-and-Check: A Hybrid Framework Integrating Mixed Integer Programming and Constraint Logic Programming.",
                    "Towards Inductive Constraint Solving.",
                    "Collaborative Learning for Constraint Solving.",
                    "Towards Stochastic Constraint Programming: A Study of Online Multi-choice Knapsack with Deadlines.",
                    "Global Cut Framework for Removing Symmetries.",
                    "Symmetry Breaking.",
                    "The Non-existence of (3, 1, 2)-Conjugate Orthogonal Idempotent Latin Square of Order 10.",
                    "Random 3-SAT and BDDs: The Plot Thickens Further.",
                    "Capturing Structure with Satisfiability.",
                    "Phase Transitions and Backbones of 3-SAT and Maximum 3-SAT.",
                    "Solving Non-binary CSPs Using the Hidden Variable Encoding.",
                    "A Filtering Algorithm for the Stretch Constraint.",
                    "Network Flow Problems in Constraint Programming.",
                    "Pruning for the Minimum Constraint Family and for the Number of Distinct Values Constraint Family.",
                    "A Constraint Programming Approach to the Stable Marriage Problem.",
                    "Components for State Restoration in Tree Search.",
                    "Adaptive Constraint Handling with CHR in Java.",
                    "Consistency Maintenance for ABT.",
                    "Constraint-Based Verification of Client-Server Protocols.",
                    "A Temporal Concurrent Constraint Programming Calculus.",
                    "Lower Bounds for Non-binary Constraint Optimization Problems.",
                    "New Lower Bounds of Constraint Violations for Over-Constrained Problems.",
                    "A General Scheme for Multiple Lower Bound Computation in Constraint Optimization.",
                    "Solving Disjunctive Constraints for Interactive Graphical Applications.",
                    "Sweep as a Generic Pruning Technique Applied to the Non-overlapping Rectangles Constraint.",
                    "Non-overlapping Constraints between Convex Polytopes.",
                    "Formal Models of Heavy-Tailed Behavior in Combinatorial Search.",
                    "The Phase Transition of the Linear Inequalities Problem.",
                    "In Search of a Phase Transition in the AC-Matching Problem.",
                    "Specific Filtering Algorithms for Over-Constrained Problems.",
                    "Specializing Russian Doll Search.",
                    "A CLP Approach to the Protein Side-Chain Placement Problem.",
                    "Fast, Constraint-Based Threading of HP-Sequences to Hydrophobic Cores.",
                    "One Flip per Clock Cycle.",
                    "Solving Constraints over Floating-Point Numbers.",
                    "Optimal Pruning in Parametric Differential Equations.",
                    "Interaction of Constraint Programming and Local Search for Optimisation Problems.",
                    "Partition-k-AC: An Efficient Filtering Technique Combining Domain Partition and Arc Consistency.",
                    "Neighborhood-Based Variable Ordering Heuristics for the Constraint Satisfaction Problem.",
                    "The Expressive Power of Binary Linear Programming.",
                    "Constraint Generation via Automated Theory Formation.",
                    "The Traveling Tournament Problem Description and Benchmarks.",
                    "Deriving Explanations and Implications for Constraint Satisfaction Problems.",
                    "Generating Tradeoffs for Interactive Constraint-Based Configuration.",
                    "Structural Constraint-Based Modeling and Reasoning with Basic Configuration Cells.",
                    "Composition Operators for Constraint Propagation: An Application to Choco.",
                    "Solving Boolean Satisfiability Using Local Search Guided by Unit Clause Elimination.",
                    "GAC on Conjunctions of Constraints.",
                    "Dual Models of Permutation Problems.",
                    "Boosting Local Search with Artificial Ants.",
                    "Fast Optimal Instruction Scheduling for Single-Issue Processors with Arbitrary Latencies.",
                    "Evaluation of Search Heuristics for Embedded System Scheduling Problems.",
                    "Interpreting Sloppy Stick Figures with Constraint-Based Subgraph Matching.",
                    "Selecting and Scheduling Observations for Agile Satellites: Some Lessons from the Constraint Reasoning Community Point of View.",
                    "A Dynamic Distributed Constraint Satisfaction Approach to Resource Allocation.",
                    "A Constraint Optimization Framework for Mapping a Digital Signal Processing Application onto a Parallel Architecture.",
                    "iOpt: A Software Toolkit for Heuristic Search Methods.",
                    "AbsCon: A Prototype to Solve CSPs with Abstraction.",
                    "A Constraint Engine for Manufacturing Process Planning.",
                    "On the Dynamic Detection of Interchangeability in Finite Constraint Satisfaction Problems.",
                    "Automatic Generation of Implied Clauses for SAT.",
                    "Verification of Infinite-State Systems by Specialization of CLP Programs.",
                    "Partially Ordered Constraint Optimization Problems.",
                    "Translations for Comparing Soft Frameworks.",
                    "Counting Satisfiable k-CNF Formulas.",
                    "High-Level Modelling and Reformulation of Constraint Satisfaction Problems.",
                    "Distributed Constraint Satisfaction as a Computational Model of Negotiation via Argumentation.",
                    "Aircraft Assignment Using Constraint Programming.",
                    "Labelling Heuristics for CSP Application Domains.",
                    "Improving SAT Algorithms by Using Search Pruning Techniques.",
                    "Optimum Symmetry Breaking in CSPs Using Group Theory.",
                    "Distributed Dynamic Backtracking.",
                    "Constraint Programming for Distributed Resource Allocation.",
                    "Exploiting the CSP Structure by Interchangeability.",
                    "Constraint Processing Techniques for Model-Based Reasoning about Dynamic Systems.",
                    "Distributed Constraint Satisfaction with Cooperating Asynchronous Solvers.",
                    "Building Negative Reduced Cost Paths Using Constraint Programming.",
                    "An Incremental and Non-binary CSP Solver: The Hyperpolyhedron Search Algorithm.",
                    "Partial Stable Generated Models of Generalized Logic Programs with Constraints.",
                    "Heterogeneous Constraint Problems.",
                    "Comparing SAT Encodings for Model Checking.",
                    "Asynchronous Search for Numeric DisCSPs.",
                    "Temporal Concurrent Constraint Programming."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th CP 2000",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/2000",
                "sub_name": "Principles and Practice of Constraint Programming - CP 2000, 6th International Conference, Singapore, September 18-21, 2000, Proceedings.",
                "count": 47,
                "papers": [
                    "Constraint-Based Agents: The ABC's of CBA's.",
                    "Constraints for Interactive Graphical Applications.",
                    "Meta-complexity Theorems: Talk Abstract.",
                    "Automatic Generation of Propagation Rules for Finite Domains.",
                    "Extending Forward Checking.",
                    "Global Constraints as Graph Properties on a Structured Network of Elementary Constraints of the Same Type.",
                    "Universally Quantified Interval Constraints.",
                    "Constraint Propagation for Soft Constraints: Generalization and Termination Conditions.",
                    "Constraints, Inference Channels and Secure Databases.",
                    "Refinements and Independence: A Simple Method for Identifying Tractable Disjunctive Constraints.",
                    "A Language for Audiovisual Template Specification and Recognition.",
                    "Random 3-SAT: The Plot Thickens.",
                    "New Tractable Classes from Old.",
                    "Expressiveness of Full First Order Constraints in the Algebra of Finite or Infinite Trees.",
                    "Cutting Planes in Constraint Programming: A Hybrid Approach.",
                    "A Constraint-Based Framework for Prototyping Distributed Virtual Applications.",
                    "A Scalable Linear Constraint Solver for User Interface Construction.",
                    "A Constraint Programming Approach for Solving Rigid Geometric Systems.",
                    "Maintaining Arc-Consistency within Dynamic Backtracking.",
                    "New Search Heuristics for Max-CSP.",
                    "Analysis of Random Noise and Random Walk Algorithms.",
                    "Boosting Search with Variable Elimination.",
                    "Faster Algorithms for Bound-Consistency of the Sortedness and the Alldifferent Constraint.",
                    "Practical Investigation of Constraints with Graph Views.",
                    "A Hybrid Search Architecture Applied to Hard Random 3-SAT and Low-Autocorrelation Binary Sequences.",
                    "Singleton Consistencies.",
                    "Linear Formulation of Constraint Programming Models and Hybrid Solvers.",
                    "A Global Constraint Combining a Sum Constraint and Difference Constraints.",
                    "Efficient Querying of Periodic Spatiotemporal Objects.",
                    "Arc Consistency for Soft Constraints.",
                    "Optimal Anytime Constrained Simulated Annealing for Constrained Global Optimization.",
                    "SAT v CSP.",
                    "Instruction Scheduling with Timing Constraints on a Single RISC Processor with 0/1 Latencies.",
                    "Arc Consistency on n-ary Monotonic and Linear Constraints.",
                    "Some Observations on Durations, Scheduling and Allen's Algebra.",
                    "Using Randomization and Learning to Solve Hard Real-World Instances of Satisfiability.",
                    "Finding Minimal Unsatisfiable Subformulae in Satisfiability Instances.",
                    "Branching Constraint Satisfaction Problems for Solutions Robust under Likely Changes.",
                    "Constraint Propagation: Between Abstract Models and ad hoc Strategies.",
                    "How to Model and Verify Concurrent Algorithms for Distributed CSPs.",
                    "The Phase Transition in Distributed Constraint Satisfaction Problems: Fist Results.",
                    "Cooperating Constraint Solvers.",
                    "An Empirical Study of Probabilistic Arc Consistency.",
                    "On Dual Encodings for Non-binary Constraint Satisfaction Problems.",
                    "Algebraic Simplification Techniques for Propositional Satisfiability.",
                    "An Original Constraint Based Approach for Solving over Constrained Problems.",
                    "An Efficient Approximate Algorithm for Winner Determination in Combinatorial Auctions."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "5th CP 1999",
        "info": "Alexandria, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/1999",
                "sub_name": "Principles and Practice of Constraint Programming - CP'99, 5th International Conference, Alexandria, Virginia, USA, October 11-14, 1999, Proceedings.",
                "count": 41,
                "papers": [
                    "The Rough Guide to Constraint Propagation.",
                    "Non-Binary Constraints.",
                    "The Theory of Discrete Lagrange Multipliers for Nonlinear Discrete Optimization.",
                    "Operational Equivalence of CHR Programs and Constraints.",
                    "Automatic Generation of Constraint Propagation Algorithms for Small Finite Domains.",
                    "Excluding Symmetries in Constraint-Based Search.",
                    "On Forward Checking for Non-binary Constraint Satisfaction.",
                    "Enforcing Arc Consistency on Global Constraints by Solving Subproblems on the Fly.",
                    "Exploiting Bipartiteness to Identify Yet Another Tractable Subclass of CSP.",
                    "Towards a Complete Classification of Tractability in Point Algebras for Nonlinear Time.",
                    "A Meta-Heuristic Factory for Vehicle Routing Problems.",
                    "Closure Functions and Width 1 Problems.",
                    "An Overview of HAL.",
                    "Cost-Based Domain Filtering.",
                    "Resource Allocation and Constraint Satisfaction Techniques.",
                    "Optimal Distributed Arc-Consistency.",
                    "The Goldilocks Problem.",
                    "Multistep Filtering Operators for Ordinary Differential Equations.",
                    "A Framework for Constraint Programming Based Column Generation.",
                    "Improving a Heuristic Repair Method for Large-Scale School Timetabling Problems.",
                    "Applying Constraint Programming to Protein Structure Determination.",
                    "Partition-Based Lower Bound for Max-CSP.",
                    "Constraint Diagram Reasoning.",
                    "Automatic Generation of Music Programs.",
                    "Search Procedures and Parallelism in Constraint Programming.",
                    "Ensuring a Relevant Visiting Order of the Leaf Nodes during a Tree Search.",
                    "Tight Cooperation and Its Application in Piecewise Linear Optimization.",
                    "Arc Consistency for Global Cardinality Constraints with Costs.",
                    "The Brélaz Heuristic and Optimal Static Orderings.",
                    "A Fixpoint Definition of Dynamic Constraint Satisfaction.",
                    "Solving Satisfiability Problems on FPGAs Using Experimental Unit Propagation.",
                    "On the Behavior and Application of Constraint Weighting.",
                    "Simulated Annealing with Asymptotic Convergence for Nonlinear Constrained Global Optimization.",
                    "On SAT01 Problem.",
                    "An Interval Constraint Approach to Handle Parametric Ordinary Differential Equations for Decision Support.",
                    "CSPLIB: A Benchmark Library for Constraints.",
                    "Validated Constraint Compilation.",
                    "Automated Theorem Proving with Disjunctive Constraints.",
                    "Rewriting Numeric Constraint Satisfaction Problems for Consistency Algorithms.",
                    "Intelligent Domain Splitting for CSPs with Ordered Domains.",
                    "Frequency Assignment for Cellular Mobile Systems Using Constraint Satisfaction Techniques."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "4th CP 1998",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/1998",
                "sub_name": "Principles and Practice of Constraint Programming - CP98, 4th International Conference, Pisa, Italy, October 26-30, 1998, Proceedings.",
                "count": 47,
                "papers": [
                    "Open Constraint Programming.",
                    "Constructing Constraints.",
                    "The Dynamics of Dynamic Variable Ordering Heuristics.",
                    "On Completion of Constraint Handling Rules.",
                    "Error-Correcting Source Code.",
                    "Optimized Q-pivot for Exact Linear Solvers.",
                    "Constraint Techniques for Solving the Protein Structure Prediction Problem.",
                    "Global Constraints for Partial CSPs: A Case-Study of Resource and Due Date Constraints.",
                    "Using Graph Decomposition for Solving Continuous CSPs.",
                    "Anytime Lower Bounds for Constraint Violation Minimization Problems.",
                    "Introducing External Functions in Constraint Query Languages.",
                    "A Note on Partial Consistencies over Continuous Domains.",
                    "Consistency Techniques in Ordinary Differential Equations.",
                    "Early Projection in CLP(R).",
                    "Suggestion Strategies for Constraint-Based Matchmaker Agents.",
                    "Compiling Semiring-Based Constraints with clp (FD, S).",
                    "Combining Topological and Qualitative Size Constraints for Spatial Reasoning.",
                    "Constraint Representation for Propagation.",
                    "A Unified Framework for Interval Constraints and Interval Arithmetic.",
                    "Constrained-Based Problem Decomposition for a Key Configuration Problem.",
                    "Fuzzifying the Constraint Hierarchies Framework.",
                    "Constraints for Object Recognition in Aerial Images - Handling of Unobserved Features.",
                    "SALSA: A Language for Search Algorithms.",
                    "Random Constraint Satisfaction: Theory Meets Practice.",
                    "A Tableau Based Constraint Solving Toolkit for Interactive Graphical Applications.",
                    "Safe Datalog Queries with Linear Constraints.",
                    "Non-systematic Search and Learning: An Empirical Study.",
                    "A Generic Model and Hybrid Algorithm for Hoist Scheduling Problems.",
                    "Linear Concurrent Constraint Programming over Reals.",
                    "Using Constraint Programming and Local Search Methods to Solve Vehicle Routing Problems.",
                    "A Polynomial Time Local Propagation Algorithm for General Dataflow Constraint Problems.",
                    "Stable Solutions for Dynamic Constraint Satisfaction Problems.",
                    "Generation of Test Patterns for Differential Diagnosis of Digital Circuits.",
                    "Combine and Conquer: Genetic Algorithm and CP for Optimization.",
                    "Some Experiments on Learning Soft Constraints.",
                    "Scheduling Multi-capacitated Resources Under Complex Temporal Constraints.",
                    "Implementing Global Constraints with Index-Sets and Constraint Templates.",
                    "Generating Feasible Schedules for a Pick-Up and Delivery Problem.",
                    "An Impartial Efficiency Comparison of FD Constraint Systems.",
                    "Optimizing with Constraints: A Case Study in Scheduling Maintenance of Electric Power Units.",
                    "Some Surprising Regularities in the Behaviour of Stochastic Local Search.",
                    "Modelling CSP Solution Algorithms with Petri Decision Nets.",
                    "A Framework for Assertion-Based Debugging in Constraint Logic Programming.",
                    "Parallel Execution Models for Constraint Propagation.",
                    "Using Blocks for Constraint Satisfaction.",
                    "Adaptive Solving of Equations over Rational Trees.",
                    "Optimal Placement of Base Stations in Wireless Indoor Telecommunication."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "3rd CP 1997",
        "info": "Linz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/1997",
                "sub_name": "Principles and Practice of Constraint Programming - CP97, Third International Conference, Linz, Austria, October 29 - November 1, 1997, Proceedings.",
                "count": 42,
                "papers": [
                    "A Modeling Language for Constraint Programming.",
                    "Narrowing a Block of Sortings in Quadratic Time.",
                    "Solving Various Weighted Matching Problems with Constraints.",
                    "A Filtering Algorithm for Global Sequencing Constraints.",
                    "Semantics and Expressive Power of a Timed Concurrent Constraint Language.",
                    "Solving Classes of Set Constraints with Tree Automata.",
                    "The Logic of Search Algorithms: Theory and Applications.",
                    "Verification of Parallel Systems using Constraint Programming.",
                    "Random Constraint Satisfaction: A More Accurate Picture.",
                    "Heavy-Tailed Distributions in Combinatorial Search.",
                    "Counting, Structure Identification and Maximum Consistency for Binary Constraint Satisfaction Problems.",
                    "Statistical Analysis of Backtracking on Inconsistent CSPs.",
                    "Using Constraint Propagation for Complex Scheduling Problems: Managing Size, Complex Resources and Travel.",
                    "Understanding and Improving the MAC Algorithm.",
                    "Modelling Exceptionally Hard Constraint Satisfaction Problems.",
                    "Tabu Search for Maximal Constraint Satisfaction Problems.",
                    "Reconfigurable Architectures: A New Vision for Optimization Problems.",
                    "Distributed Partial Constraint Satisfaction Problem.",
                    "Localizer: A Modeling Language for Local Search.",
                    "Operational Semantics and Confluence of Constraint Propagation Rules.",
                    "AC-Unification of Higher-Order Patterns.",
                    "On the Complexity of Unification and Disunification in Commutative Idempotent Semigroups.",
                    "Ordering Constraints over Feature Trees.",
                    "From Restricted Path Consistency to Max-Restricted Path Consistency.",
                    "The Constrainedness of Arc Consistency.",
                    "Look-Ahead Versus Look-Back for Satisfiability Problems.",
                    "Why Adding More Constraints Makes a Problem Easier for Hill-climbing Algorithms: Analyzing Landscapes of CSPs.",
                    "Interval Methods for Non-linear Constraints.",
                    "Configurable Solvers: Tailoring General Methods to Specific Applications.",
                    "Constraint Propagation and Decomposition Techniques for Highly Disjunctive and Highly Cumulative Project Scheduling Problems.",
                    "Five Pitfalls of Empirical Scheduling Research.",
                    "Bounding the Optimum of Constraint Optimization Problems.",
                    "GENIUS-CP: a Generic Single-Vehicle Routing Algorithm.",
                    "Satisfiability of Quantitative Temporal Constraints with Multiple Granularities.",
                    "Tractable Recursion over Geometric Data.",
                    "Finding Solvable Subsets of Constraint Graphs.",
                    "Tractable Disjunctive Constraints.",
                    "Compiling Constraint Solving using Projection.",
                    "Oscillation, Heuristic Ordering and Pruning in Neighborhood Search.",
                    "Programming Constraint Inference Engines.",
                    "NeMo+: Object-Oriented Constraint Programming Environment Based on Subdefinite Models.",
                    "Set Constraints: A Pearl in Research on Constraints."
                ]
            },
            {
                "sub_name_abbr": "conf/cdb/1997",
                "sub_name": "Constraint Databases and Their Applications, Second International Workshop on Constraint Database Systems, CDB '97, Delphi, Greece, January 11-12, 1997, CP '96 Workshop on Constraints and Databases, Cambridge, MA, USA, August 19, 1996, Selected Papers.",
                "count": 21,
                "papers": [
                    "Planar Topological Queries.",
                    "An Informal Introduction to Constraint Database Systems.",
                    "Query Evaluation as Constraint Search; An Overview of Early Results.",
                    "Computing the Well-Founded Semantics for Constraint Extensions of Datalog.",
                    "Decomposition and Lossless Join in Constraint Databases.",
                    "A Rule-Based CQL for 2-Dimensional Tables.",
                    "On the Expressiveness of Query Languages with Linear Constraints; Capturing Desirable Spatial Properties.",
                    "On Expressing Topological Connectivity in Spatial Datalog.",
                    "The C3 Constraint Object-Oriented Database System: An Overview.",
                    "Integrity Constraint Checking in Chimera.",
                    "SICSDD: Techniques and Implementation.",
                    "A Temporal Constraint System for Object-Oriented Databases.",
                    "Using Database Versions to Implement Temporal Integrity Constraints.",
                    "Genomic Database Applications in DISCO.",
                    "Constraint Databases and Program Analysis Using Abstract Interpretation.",
                    "Querying Indexed Files.",
                    "On the Complexity of BV-tree Updates.",
                    "Implementing Index Data Structures Using Constraint Logic Programming.",
                    "Problem Solving in the DISCO Constraint Database System.",
                    "Interval Domain Library for ECLiPSe and Its Application.",
                    "A Semantic Query Optimization Algorithm for Object-Oriented Databases."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "2nd CP 1996",
        "info": "Cambridge, Massachusetts",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/1996",
                "sub_name": "Proceedings of the Second International Conference on Principles and Practice of Constraint Programming, Cambridge, Massachusetts, USA, August 19-22, 1996.",
                "count": 61,
                "papers": [
                    "On Confluence of Constraint Handling Rules.",
                    "A Labelling Arc Consistency Method for Functional Constraints.",
                    "Constraint Satisfaction in Optical Routing for Passive Wavelength-Routed Networks.",
                    "Using CSP Look-Back Techniques to Solve Exceptionally Hard SAT Instances.",
                    "MAC and Combined Heuristics: Two Reasons to Forsake FC (and CBJ?) on Hard Problems.",
                    "The Independence Property of a Class of Set Constraints.",
                    "Speeding Up Constraint Propagation By Redundant Modeling.",
                    "A Constraint-Based Interactive Train Rescheduling Tool.",
                    "Local Search and the Number of Solutions.",
                    "Derivation of Constraints and Database Relations.",
                    "Constraint Programming: an Efficient and Practical Approach to Solving the Job-Shop Problem.",
                    "An Instance of Adaptive Constraint Propagation.",
                    "An Empirical Study of Dynamic Variable Ordering Heuristics for the Constraint Satisfaction Problem.",
                    "Empirical Studies of Heuristic Local Search for Constraint Solving.",
                    "Defeasibility in CLP(Q) through Generalized Slack Variables.",
                    "Inference Duality as a Basis for Secitivity Analysis.",
                    "Generalized Local Propagation: A Framework for Solving Constraint Hierarchies.",
                    "Transformations Between HCLP and PCSP.",
                    "A test for Tractability.",
                    "Combination of Constraint Systems II: Rational Amalgamation.",
                    "Tractable Disjunctions of Linear Constraints.",
                    "Exploiting the Use of DAC in MAX-CSP.",
                    "A New Approach for Weighted Constraint Satisfaction: Theoretical and Computational Results.",
                    "Towards a More Efficient Stochastic Constraint Solver.",
                    "A View of Local Search in Constraint Programming.",
                    "From Quasi-Solutions to Solution: An Evolutionary Algorithm to Solve CSP.",
                    "Existential Variables and Local Consistency in Finite Domain Constraint Problems.",
                    "Logical Semantics of Concurrent Constraint Programming.",
                    "Solving Non-binary Convez CSPs in Continous Domains.",
                    "An Eperimental Comparison of Three Modified DeltaBlue Algorithms.",
                    "Constraint Logic Programming over Unions of Constraint Theories.",
                    "Analysis of Hybrid Systems in CLP(R).",
                    "On Query Languages for Linear Queries Definable with Polynomial Constraints.",
                    "Analysis of Heuristic Methods for Partial Constraint Satisfaction Problems.",
                    "Solving Satisfiability Problems Using Field Programmable Gate Arrays: First Results.",
                    "A Constraint Program for Solving the Job-Shop Problem.",
                    "PSAP - A Planning System for Aircraft Production (Extended Abstract).",
                    "Using Partial Arc Consistency in a Database Environment.",
                    "Functional Constrain Hierarchies in CLP.",
                    "Towards an Open Finite Domain Constraint Solver.",
                    "Efficient Constraint Propagation With Good Space Complexity.",
                    "Anytime Temporal Reasoning: Preliminary Report (Extended Abstract).",
                    "From Constraint Minimization to Goal Optimization in CLP Languages.",
                    "Looking at Full Looking Ahead.",
                    "The Arc and Path Consistency Phase Transitions.",
                    "Experiences with Combining Constraint Programming and Discrete Event Simulation.",
                    "Hill-Climbing with Local Consistency for Solving Distributed CSPs.",
                    "Appriximate Algorithms for Maximum Utility Problems.",
                    "A Meta Constraint Logic Programming Architecture (Extended Abstract).",
                    "N-Ary Consistencies and Constraint-Based Backtracking.",
                    "Global Behaviour for Complex Constraints.",
                    "To Guess or to Think? Hybrid Algorithms for SAT (Extended Abstract).",
                    "A Local Simplification Scheme for cc Programs.",
                    "From Evaluating Upper Bounds of the Complexity of Solving CSPs to Finding All the Solutions of CSPs.",
                    "Modeling and Solving Distributed Constraint Satisfaction Problems (DCSPs).",
                    "Scheduling an Asynchronously Shared Resource.",
                    "The Generalized Railroad Crossing: Its Symbolic Analysis in CLP(R).",
                    "A Stochastic Approach to Solving Fuzzy Constraint Satisfaction Problems.",
                    "Branch-and-Price for Solving Integer Programs with a Huge Number of Variables: Methods and Applications (Abstract).",
                    "Constraint Databases.",
                    "Complexity-Theoretic Aspects for Programming Language Design."
                ]
            },
            {
                "sub_name_abbr": "conf/cp/1995w",
                "sub_name": "Over-Constrained Systems.",
                "count": 15,
                "papers": [
                    "A Brief Overview of Over-Constrained Systems.",
                    "Constraint Hierarchies.",
                    "Partial Constraint Satisfaction.",
                    "Semiring-Based CSPs and Valued CSPs: Basic Properties and Comparison.",
                    "Defeasible Constraint Solving.",
                    "Transforming Ordered Constraint Hierarchies into Ordinary Constraint Systems.",
                    "A Composistional Theory of Constraint Hierarchies.",
                    "Heuristic Methods for Over-Constrained Constraint Satisfaction Problems.",
                    "Cascaded Directed Arc Consistency and No-Good Learning for the Maximal Constraint Satisfaction Problem.",
                    "Partial Arc Consistency.",
                    "Dynamic Constraint Satisfaction with Conflict Management in Design.",
                    "Specifying Over-Constrained Problems in Default Logic.",
                    "Implementing Constraint Relaxation over Finite Domains Using Assumption-Based Truth Maintenance Systems.",
                    "Experiences in Solving Constraint Relaxation Networks with Boltzmann Machines.",
                    "Solving Over-Constrained CSPs Using Weighted OBDDs."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "1st CP 1995",
        "info": "Cassis, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cp/1995",
                "sub_name": "Principles and Practice of Constraint Programming - CP'95, First International Conference, CP'95, Cassis, France, September 19-22, 1995, Proceedings.",
                "count": 43,
                "papers": [
                    "Complete Solving of Linear Diophantine Equations and Inequations without Adding Variables.",
                    "From Elliott-MacMahon to an Algorithm for General Linear Constraints on Naturals.",
                    "The Progressive Party Problem: Integer Linear Programming and Constraint Programming Compared.",
                    "From Local to Global Consistency in Temporal Constraint Networks.",
                    "Scaling Effects in the CSP Phase Transition.",
                    "Asynchronous Weak-commitment Search for Solving Distributed Constraint Satisfaction Problems.",
                    "Optimization-based Heuristics for Maximal Constraint Satisfaction.",
                    "First-order Definability over Constraint Databases.",
                    "On Similarity Queries for Time-Series Data: Constraint Specification and Implementation.",
                    "Safe Stratified Datalog with Integer Order Programs.",
                    "Constrained Dependencies.",
                    "Solving Linear, Min and Max Constraint Systems Using CLP based on Relational Interval Arithmetic.",
                    "Debugging Constraint Programs.",
                    "An Optimizing Compiler for CLP(R).",
                    "Local and Global Relational Consistency.",
                    "Dynamic Variable Ordering in CSPs.",
                    "A Unifying Framework for Tractable Constraints.",
                    "On the Forward Checking Algorithm.",
                    "A Confluent Calculus for Concurrent Constraint Programming with Guarded Choice.",
                    "Situated Simplification.",
                    "Guarded Constructive Disjunction: Angel or Demon?",
                    "Domain Independent Ask Approximation in CCP.",
                    "On the Combination of Symbolic Constraints, Solution Domains, and Constraint Solvers.",
                    "Constraint Propagation in Model Generation.",
                    "Normalizing Narrowing for Weakly Terminating and Confluent Systems.",
                    "On Termination of Constraint Logic Programs.",
                    "Modelling Producer/Consumer Constraints.",
                    "A Constraint-Based Approach to Diagnosing Software Problems in Computer Networks.",
                    "Solving Crew Scheduling Problems bu Constraint Programming.",
                    "A Visual Constraint-Programming Environment.",
                    "Polynomial Restrictions of SAT: What Can Be Done with an Efficient Implementation of the Davis and Putnam's Procedure?",
                    "Improved Branch and Bound in Constraint Logic Programming.",
                    "Reducing Domains for Search in CLP(FD) and Its Application to Job-Shop Scheduling.",
                    "What Is Symbolic Computation?",
                    "Constraint Solving for Combinatorial Search Problems: A Tutorial.",
                    "The Concurrent Constraint Programming Research Programmes.",
                    "Automatic Generation of Invariants and Assertions.",
                    "The OTI Constraint Solver: A Constraint Library for Constructing Interactive Graphical User Interfaces.",
                    "Model-Based Computing: Using Concurrent Constraint Programming for Modeling and Model Compilation.",
                    "CLP in ECRC.",
                    "Constraint Programming and Industrial Applications.",
                    "The CHIP System and Its Applications.",
                    "Applications of Constraint Programming."
                ]
            }
        ]
    }
]