[
    {
        "name": "DMKD",
        "year": "2022",
        "info": "Volume 36, 2022",
        "count": 15,
        "papers": [
            "Cost-sensitive ensemble learning: a unifying framework.",
            "End-to-end deep representation learning for time series clustering: a comparative study.",
            "Inferring range of information diffusion based on historical frequent items.",
            "Mint: MDL-based approach for Mining INTeresting Numerical Pattern Sets.",
            "Topic change point detection using a mixed Bayesian model.",
            "Matrix sketching for supervised classification with imbalanced classes.",
            "Generalized core maintenance of dynamic bipartite graphs.",
            "Temporal state change Bayesian networks for modeling of evolving multivariate state sequences: model, structure discovery and parameter estimation.",
            "Expected passes.",
            "Controlling hallucinations at word level in data-to-text generation.",
            "An efficient procedure for mining egocentric temporal motifs.",
            "Mining sequences with exceptional transition behaviour of varying order using quality measures based on information-theoretic scoring functions.",
            "Sequential stratified regeneration: MCMC for large state spaces with an application to subgraph count estimation.",
            "Strengthening ties towards a highly-connected world.",
            "A recurrent neural network architecture to model physical activity energy expenditure in older people."
        ]
    },
    {
        "name": "DMKD",
        "year": "2021",
        "info": "Volume 35, 2021",
        "count": 82,
        "papers": [
            "A survey of community detection methods in multilayer networks.",
            "A survey of deep network techniques all classifiers can adopt.",
            "Online summarization of dynamic graphs using subjective interestingness for sequential data.",
            "Recency-based sequential pattern mining in multiple event sequences.",
            "For real: a thorough look at numeric attributes in subgroup discovery.",
            "The network-untangling problem: from interactions to activity timelines.",
            "An exemplar-based clustering using efficient variational message passing.",
            "Natural language techniques supporting decision modelers.",
            "Mining explainable local and global subgraph patterns with surprising densities.",
            "SMILE: a feature-based temporal abstraction framework for event-interval sequence classification.",
            "The great multivariate time series classification bake off: a review and experimental evaluation of recent algorithmic advances.",
            "Detecting singleton spams in reviews via learning deep anomalous temporal aspect-sentiment patterns.",
            "Variational auto-encoder based Bayesian Poisson tensor factorization for sparse and imbalanced count data.",
            "Social explorative attention based recommendation for content distribution platforms.",
            "User preference and embedding learning with implicit feedback for recommender systems.",
            "A framework for deep constrained clustering.",
            "Learning tractable probabilistic models for moral responsibility and blame.",
            "Mining communities and their descriptions on attributed graphs: a survey.",
            "Deep graph similarity learning: a survey.",
            "Detecting virtual concept drift of regressors without ground truth values.",
            "ForestDSH: a universal hash design for discrete probability distributions.",
            "Recurring concept memory management in data streams: exploiting data stream concept evolution to improve performance and transparency.",
            "FuseRec: fusing user and item homophily modeling with temporal recommender systems.",
            "Time series motifs discovery under DTW allows more robust discovery of conserved structure.",
            "Word-class embeddings for multiclass text classification.",
            "Dataset2Vec: learning dataset meta-features.",
            "Sparse randomized shortest paths routing with Tsallis divergence regularization.",
            "Time series extrinsic regression.",
            "Multi-label learning with missing and completely unobserved labels.",
            "Sequential recommendation with metric models based on frequent sequences.",
            "Tackling ordinal regression problem for heterogeneous data: sparse and deep multi-task learning approaches.",
            "Homophily outlier detection in non-IID categorical data.",
            "Mining full, inner and tail periodic patterns with perfect, imperfect and asynchronous periodicity simultaneously.",
            "Widening: using parallel resources to improve model quality.",
            "Streaming changepoint detection for transition matrices.",
            "Correction to: Streaming changepoint detection for transition matrices.",
            "Pseudoinverse graph convolutional networks.",
            "Fast computation of Katz index for efficient processing of link prediction queries.",
            "A deep multimodal model for bug localization.",
            "Extending greedy feature selection algorithms to multiple solutions.",
            "Efficient set-valued prediction in multi-class classification.",
            "Smoothed dilated convolutions for improved dense prediction.",
            "Relational Learning Analysis of Social Politics using Knowledge Graph Embedding.",
            "What's in a name? - gender classification of names with character based machine learning models.",
            "Handling imbalance in hierarchical classification problems using local classifiers approaches.",
            "Correlations between random projections and the bivariate normal.",
            "An overlap sensitive neural network for class imbalanced data.",
            "CrashNet: an encoder-decoder architecture to predict crash test outcomes.",
            "Guest editorial: Special issue on mining for health.",
            "Adversarial balancing-based representation learning for causal effect inference with observational data.",
            "Affinity analysis for studying physicians' prescription behavior.",
            "Feature extraction from unequal length heterogeneous EHR time series via dynamic time warping and tensor decomposition.",
            "Predictive modeling of infant mortality.",
            "Effective social post classifiers on top of search interfaces.",
            "Fake review detection on online E-commerce platforms: a systematic literature review.",
            "AURORA: A Unified fRamework fOR Anomaly detection on multivariate time series.",
            "Hyperbolic node embedding for temporal networks.",
            "TSK-Streams: learning TSK fuzzy systems for regression on data streams.",
            "An alternating nonmonotone projected Barzilai-Borwein algorithm of nonnegative factorization of big matrices.",
            "Data-driven detection of counterpressing in professional football.",
            "Differentially Private Distance Learning in Categorical Data.",
            "Structure learning for relational logistic regression: an ensemble approach.",
            "Attention based adversarially regularized learning for network embedding.",
            "Selego: robust variate selection for accurate time series forecasting.",
            "Link prediction in dynamic networks using random dot product graphs.",
            "K-plex cover pooling for graph neural networks.",
            "Boosting house price predictions using geo-spatial network embedding.",
            "Social media as author-audience games.",
            "Isolation kernel: the X factor in efficient and effective large scale online kernel learning.",
            "Implicit consensus clustering from multiple graphs.",
            "A Lagrangian-based score for assessing the quality of pairwise constraints in semi-supervised clustering.",
            "Time series clustering in linear time complexity.",
            "Chebyshev approaches for imbalanced data streams regression models.",
            "Continuous treatment effect estimation via generative adversarial de-confounding.",
            "Characterizing attitudinal network graphs through frustration cloud.",
            "Introduction to the special issue of the ECML PKDD 2021 journal track.",
            "BROCCOLI: overlapping and outlier-robust biclustering through proximal stochastic gradient descent.",
            "Early abandoning and pruning for elastic distances including dynamic time warping.",
            "MultiETSC: automated machine learning for early time series classification.",
            "CURIE: a cellular automaton for concept drift detection.",
            "VFC-SMOTE: very fast continuous synthetic minority oversampling for evolving data streams.",
            "Unsupervised domain adaptation with non-stochastic missing data."
        ]
    },
    {
        "name": "DMKD",
        "year": "2020",
        "info": "Volume 34, 2020",
        "count": 60,
        "papers": [
            "A semi-supervised model for knowledge graph embedding.",
            "Interactive visual data exploration with subjective feedback: an information-theoretic approach.",
            "A drift detection method based on dynamic classifier selection.",
            "Topical network embedding.",
            "Grafting for combinatorial binary model using frequent itemset mining.",
            "A comparative study of data-dependent approaches without learning in measuring similarities of data objects.",
            "Matching code and law: achieving algorithmic fairness with optimal transport.",
            "Deep multi-task learning for individuals origin-destination matrices estimation from census data.",
            "FastEE: Fast Ensembles of Elastic Distances for time series classification.",
            "A survey and benchmarking study of multitreatment uplift modeling.",
            "On normalization and algorithm selection for unsupervised outlier detection.",
            "SIAS-miner: mining subjectively interesting attributed subgraphs.",
            "Identifying exceptional (dis)agreement between groups.",
            "Mining relaxed functional dependencies from data.",
            "Parameterized low-rank binary matrix approximation.",
            "Integer programming ensemble of temporal relations classifiers.",
            "NegPSpan: efficient extraction of negative sequential patterns with embedding constraints.",
            "Relaxing the strong triadic closure problem for edge strength inference.",
            "MasterMovelets: discovering heterogeneous movelets for multiple aspect trajectory classification.",
            "Model-based exception mining for object-relational data.",
            "Robust and sparse multigroup classification by the optimal scoring approach.",
            "TS-CHIEF: a scalable and accurate forest algorithm for time series classification.",
            "An efficient K-means clustering algorithm for tall data.",
            "Discrete-time survival forests with Hellinger distance decision trees.",
            "Computing exact P-values for community detection.",
            "ptype: probabilistic type inference.",
            "Guided sampling for large graphs.",
            "The Swiss army knife of time series data mining: ten useful things you can do with the matrix profile and ten lines of code.",
            "Counting frequent patterns in large labeled graphs: a hypergraph-based approach.",
            "Matrix profile goes MAD: variable-length motif and discord discovery in data series.",
            "struc2gauss: Structural role preserving network embedding via Gaussian embedding.",
            "An ultra-fast time series distance measure to allow data mining in more complex real-world deployments.",
            "TEAGS: time-aware text embedding approach to generate subgraphs.",
            "ABBA: adaptive Brownian bridge-based symbolic aggregation of time series.",
            "Efficient mining of the most significant patterns with permutation testing.",
            "Introduction to the special issue of the ECML PKDD 2020 journal track.",
            "Delayed labelling evaluation for data streams.",
            "Exceptional spatio-temporal behavior mining through Bayesian non-parametric modeling.",
            "Fair-by-design matching.",
            "TEASER: early and accurate time series classification.",
            "Scalable attack on graph data by injecting vicious nodes.",
            "Treant: training evasion-aware decision trees.",
            "Large-scale network motif analysis using compression.",
            "ROCKET: exceptionally fast and accurate time series classification using random convolutional kernels.",
            "Active learning for hierarchical multi-label classification.",
            "Deep soccer analytics: learning an action-value function for evaluating soccer players.",
            "Simple and effective neural-free soft-cluster embeddings for item cold-start recommendations.",
            "CrawlSN: community-aware data acquisition with maximum willingness in online social networks.",
            "ColluEagle: collusive review spammer detection using Markov random fields.",
            "Comparison of novelty detection methods for multispectral images in rover-based planetary exploration missions.",
            "Gaussian bandwidth selection for manifold learning and classification.",
            "Introducing time series snippets: a new primitive for summarizing long time series.",
            "Credible seed identification for large-scale structural network alignment.",
            "Visualizing image content to explain novel image discovery.",
            "Challenges in benchmarking stream learning algorithms with real-world data.",
            "MIDIA: exploring denoising autoencoders for missing data imputation.",
            "Bayesian mean-parameterized nonnegative binary matrix factorization.",
            "InceptionTime: Finding AlexNet for time series classification.",
            "DeepTable: a permutation invariant neural network for table orientation classification.",
            "Correction to: A unified view of density-based methods for semi-supervised clustering and classification."
        ]
    },
    {
        "name": "DMKD",
        "year": "2019",
        "info": "Volume 33, 2019",
        "count": 62,
        "papers": [
            "Estimating sequence similarity from read sets for clustering next-generation sequencing data.",
            "Sampling online social networks by random walk with indirect jumps.",
            "Modeling location-based social network data with area attraction and neighborhood competition.",
            "Domain agnostic online semantic segmentation for multi-dimensional time series.",
            "Ranking evolution maps for Satellite Image Time Series exploration: application to crustal deformation and environmental monitoring.",
            "Learning edge weights in file co-occurrence graphs for malware detection.",
            "Group recommender system for store product placement.",
            "Robust classification of graph-based data.",
            "Exact mean computation in dynamic time warping spaces.",
            "Multi-target prediction: a unifying view on problems and methods.",
            "A tutorial on statistically sound pattern discovery.",
            "A review on distance based time series classification.",
            "Interpretable multiple data streams clustering with clipped streams representation for the improvement of electricity consumption forecasting.",
            "Noise-free latent block model for high dimensional data.",
            "DeepRank: improving unsupervised node ranking via link discovery.",
            "Model-free inference of diffusion networks using RKHS embeddings.",
            "Algorithms for approximate subtropical matrix factorization.",
            "An effective and versatile distance measure for spatiotemporal trajectories.",
            "Proximity Forest: an effective and scalable distance-based classifier for time series.",
            "Modeling and elucidation of housing price.",
            "EACD: evolutionary adaptation to concept drifts in data streams.",
            "Guest Editorial - Special Issue on Data Mining for Geosciences.",
            "Editor's Note.",
            "Spatial autocorrelation and entropy for renewable energy forecasting.",
            "The spatial leave-pair-out cross-validation method for reliable AUC estimation of spatial classifiers.",
            "Dynamic detection of anomalous regions within distributed acoustic sensing data streams using locally stationary wavelet time series.",
            "Concept drift over geological times: predictive modeling baselines for analyzing the mammalian fossil record.",
            "Setting decision thresholds when operating conditions are uncertain.",
            "Automatic discovery of adverse reactions through Chinese social media.",
            "Unsupervised dimensionality reduction versus supervised regularization for classification from sparse data.",
            "Deep learning for time series classification: a review.",
            "Algorithmic cache of sorted tables for feature selection - Speeding up methods based on consistency and information theory measures.",
            "A new class of metrics for learning on real-valued and structured data.",
            "The decomposed normalized maximum likelihood code-length criterion for selecting hierarchical latent variable models.",
            "Clustering for heterogeneous information networks with extended star-structure.",
            "Subjectively interesting connecting trees and forests.",
            "Efficiently mining cohesion-based patterns and rules in event sequences.",
            "Interpretable time series classification using linear models and multi-resolution multi-domain symbolic representations.",
            "Introduction to the special issue for the ECML PKDD 2019 journal track.",
            "FURL: Fixed-memory and uncertainty reducing local triangle counting for multigraph streams.",
            "Counts-of-counts similarity for prediction and search in relational data.",
            "Mining skypatterns in fuzzy tensors.",
            "Temporal density extrapolation using a dynamic basis approach.",
            "Robust active attacks on social graphs.",
            "Multi-location visibility query processing using portion-based transactional modeling and pattern mining.",
            "Finding lasting dense subgraphs.",
            "Deeply supervised model for click-through rate prediction in sponsored search.",
            "Classification with label noise: a Markov chain sampling framework.",
            "A unifying view of explicit and implicit feature maps of graph kernels.",
            "HHMF: hidden hierarchical matrix factorization for recommender systems.",
            "Efficient mixture model for clustering of sparse high dimensional binary data.",
            "More for less: adaptive labeling payments in online labor markets.",
            "A probabilistic classifier ensemble weighting scheme based on cross-validated accuracy estimates.",
            "Dynamics reconstruction and classification via Koopman features.",
            "Extending inverse frequent itemsets mining to generate realistic datasets: complexity, accuracy and emerging applications.",
            "SAZED: parameter-free domain-agnostic season length estimation in time series data.",
            "Wrangling messy CSV files by detecting row and type patterns.",
            "catch22: CAnonical Time-series CHaracteristics - Selected through highly comparative time-series analysis.",
            "Contextual bandits with hidden contexts: a focused data capture from social media streams.",
            "A unified view of density-based methods for semi-supervised clustering and classification.",
            "Attributed network embedding via subspace discovery.",
            "Correction to: Domain agnostic online semantic segmentation for multi-dimensional time series."
        ]
    },
    {
        "name": "DMKD",
        "year": "2018",
        "info": "Volume 32, 2018",
        "count": 59,
        "papers": [
            "Noise-tolerance matrix completion for location recommendation.",
            "Imbalanced classification in sparse and large behaviour datasets.",
            "Time series joins, motifs, discords and shapelets: a unifying view that exploits the matrix profile.",
            "BSig: evaluating the statistical significance of biclustering solutions.",
            "Fast and accurate mining of correlated heavy hitters.",
            "Selective harvesting over networks.",
            "The inner and outer approaches to the design of recursive neural architectures.",
            "Toward online node classification on streaming networks.",
            "Model-based and actual independence for fairness-aware classification.",
            "Do your friends make you buy this brand? - Modeling social recommendation with topics and brands.",
            "Exploiting the roles of aspects in personalized POI recommender systems.",
            "Self-monitoring for maintenance of vehicle fleets.",
            "Infinite ensemble clustering.",
            "Bounding the difference between RankRC and RankSVM and application to multi-level rare class kernel ranking.",
            "An improvement of the parameterized frequent directions algorithm.",
            "Robust graph regularized nonnegative matrix factorization for clustering.",
            "Fast analytical methods for finding significant labeled graph motifs.",
            "Efficient geometric-based computation of the string subsequence kernel.",
            "Online estimation of discrete, continuous, and conditional joint densities using classifier chains.",
            "Anytime discovery of a diverse set of patterns with Monte Carlo tree search.",
            "An optimization model for collaborative recommendation using a covariance-based regularizer.",
            "Kernel mixture model for probability density estimation in Bayesian classifiers.",
            "Provenance Network Analytics - An approach to data analytics using data provenance.",
            "Editor's Note: Special Section on Data Mining for Smart Cities.",
            "Targeted interest-driven advertising in cities using Twitter.",
            "Mining urban events from the tweet stream through a probabilistic mixture model.",
            "Data-driven generation of spatio-temporal routines in human mobility.",
            "Structural robustness and service reachability in urban settings.",
            "Interpretation of text patterns.",
            "Labeled Phrase Latent Dirichlet Allocation and its online learning algorithm.",
            "Graph sampling with applications to estimating the number of pattern embeddings and the parameters of a statistical relational model.",
            "SICA: subjectively interesting component analysis.",
            "Speeding up similarity search under dynamic time warping by pruning unpromising alignments.",
            "Cluster-based trajectory segmentation with local noise.",
            "Anomaly detection in spatiotemporal data via regularized non-negative tensor analysis.",
            "Optimizing dynamic time warping's window width for time series data mining applications.",
            "Anytime parallel density-based clustering.",
            "Introduction to the special issue for the ECML PKDD 2018 journal track.",
            "Analyzing concept drift and shift from sample data.",
            "Exploring variable-length time series motifs in one hundred million length scale.",
            "Fast schemes for online record linkage.",
            "Efficiently summarizing attributed diffusion networks.",
            "Linear regression for uplift modeling.",
            "Temporal stability in predictive process monitoring.",
            "ColdRoute: effective routing of cold questions in stack exchange sites.",
            "Using core-periphery structure to predict high centrality nodes in time-varying networks.",
            "Dynamic graph summarization: a tensor decomposition approach.",
            "Social centrality using network hierarchy and community structure.",
            "Explaining anomalies in groups with characterizing subspace rules.",
            "ParCorr: efficient parallel methods to identify similar time series pairs across sliding windows.",
            "Robust finite mixture regression for heterogeneous targets.",
            "Scalable and exact sampling method for probabilistic generative graph models.",
            "An adaptive algorithm for anomaly and novelty detection in evolving data streams.",
            "A probabilistic stop and move classifier for noisy GPS trajectories.",
            "Constrained distance based clustering for time-series: a comparative and experimental study.",
            "A kernel-based trend pattern tracking system for portfolio optimization.",
            "Unsupervised meta-path selection for text similarity measure based on heterogeneous information networks.",
            "Extreme-value-theoretic estimation of local intrinsic dimensionality.",
            "Exact variable-length anomaly detection algorithm for univariate and multivariate time series."
        ]
    },
    {
        "name": "DMKD",
        "year": "2017",
        "info": "Volume 31, 2017",
        "count": 61,
        "papers": [
            "Generalizing DTW to the multi-dimensional case requires an adaptive approach.",
            "Hierarchical evolving Dirichlet processes for modeling nonlinear evolutionary traces in temporal data.",
            "TBM, a transformation based method for microaggregation of large volume mixed data.",
            "Adversarial classification using signaling games with an application to phishing detection.",
            "Outlying property detection with numerical attributes.",
            "Evidence-based uncertainty sampling for active learning.",
            "Efficient histogram dictionary learning for text/image modeling and classification.",
            "Reliable early classification of time series based on discriminating the classes over time.",
            "SimUSF: an efficient and effective similarity measure that is invariant to violations of the interval scale assumption.",
            "Active learning: an empirical study of common baselines.",
            "Graph summarization with quality guarantees.",
            "Unsupervised group matching with application to cross-lingual topic matching without alignment information.",
            "Comparison of local outlier detection techniques in spatial multivariate data.",
            "Discovering rare categories from graph streams.",
            "Survey on using constraints in data mining.",
            "Multiple Bayesian discriminant functions for high-dimensional massive data classification.",
            "Modeling user interests from web browsing activities.",
            "Outlier detection using binary decision diagrams.",
            "Detecting cooperative and organized spammer groups in micro-blogging community.",
            "The great time series classification bake off: a review and experimental evaluation of recent algorithmic advances.",
            "On classifier behavior in the presence of mislabeling noise.",
            "Tiers for peers: a practical algorithm for discovering hierarchy in weighted networks.",
            "Visualizing the behavior and some symmetry properties of Bayesian confirmation measures.",
            "Explaining clusterings of process instances.",
            "On searching and indexing sequences of temporal intervals.",
            "Improving time series similarity measures by integrating preprocessing steps.",
            "Reducing uncertainty of dynamic heterogeneous information networks: a fusing reconstructing approach.",
            "FitMine: automatic mining for time-evolving signals of cardiotocography monitoring.",
            "Retrieving geometric information from images: the case of hand-drawn diagrams.",
            "Scalable density-based clustering with quality guarantees using random projections.",
            "Discrimination of Alzheimer's Disease using longitudinal information.",
            "Enhancing social collaborative filtering through the application of non-negative matrix factorization and exponential random graph models.",
            "Measuring discrimination in algorithmic decision making.",
            "The PRIMPING routine - Tiling through proximal alternating linearized minimization.",
            "Robust unsupervised cluster matching for network data.",
            "Introduction to the special issue dedicated to the Journal Track of ECML PKDD 2017.",
            "Tour recommendation for groups.",
            "Micro-review synthesis for multi-entity summarization.",
            "Social regularized von Mises-Fisher mixture model for item recommendation.",
            "Classification of high-dimensional evolving data streams via a resource-efficient online ensemble.",
            "Flexible constrained sampling with guarantees for pattern mining.",
            "On temporal-constrained sub-trajectory cluster analysis.",
            "Lagrangian relaxations for multiple network alignment.",
            "MixedTrails: Bayesian hypothesis comparison on heterogeneous sequential data.",
            "Identifying consistent statements about numerical data with dispersion-corrected subgroup discovery.",
            "The best privacy defense is a good privacy offense: obfuscating a search engine user's profile.",
            "Local community detection in multilayer networks.",
            "Measuring and moderating opinion polarization in social networks.",
            "Ensemble-based community detection in multilayer networks.",
            "Differentially private nearest neighbor classification.",
            "Guest editorial: Special issue on sports analytics.",
            "Regimes in baseball players' career data.",
            "Adjusting for scorekeeper bias in NBA box scores.",
            "Archetypoid analysis for sports analytics.",
            "Activity recognition in beach volleyball using a Deep Convolutional Neural Network - Leveraging the potential of Deep Learning in sports.",
            "Classification and legality analysis of bowling action in the game of cricket.",
            "A Markov Game model for valuing actions, locations, and team performance in ice hockey.",
            "Comparing dynamics of fluency and inter-limb coordination in climbing activities using multi-scale Jensen-Shannon embedding and clustering.",
            "Visual analysis of pressure in football.",
            "Discovering recurring activity in temporal networks.",
            "Sports analytics for professional speed skating."
        ]
    },
    {
        "name": "DMKD",
        "year": "2016",
        "info": "Volume 30, 2016",
        "count": 49,
        "papers": [
            "Decomposition-by-normalization (DBN): leveraging approximate functional dependencies for efficient CP and tucker decompositions.",
            "Exceptional Model Mining - Supervised descriptive local pattern mining with complex target concepts.",
            "On detecting maximal quasi antagonistic communities in signed graphs.",
            "Link prediction using time series of neighborhood-based node similarity scores.",
            "Sampling frequent and minimal boolean patterns: theory and application in classification.",
            "A computational approach inspired by simulated annealing to study the stability of protein interaction networks in cancer and neurological disorders.",
            "Accelerating the discovery of unsupervised-shapelets.",
            "Using dynamic time warping distances as features for improved time series classification.",
            "Instance-level accuracy versus bag-level accuracy in multi-instance learning.",
            "General factorization framework for context-aware recommendations.",
            "Efficient temporal mining of micro-blog texts and its application to event discovery.",
            "Classification of streaming time series under more realistic assumptions.",
            "Fast approximation of betweenness centrality through sampling.",
            "Time series representation and similarity based on local autopatterns.",
            "Active exploration for large graphs.",
            "Exploiting link structure for web page genre identification.",
            "Parameter learning in hybrid Bayesian networks using prior knowledge.",
            "Enhancing aggregation phase of microaggregation methods for interval disclosure risk minimization.",
            "MINAS: multiclass learning algorithm for novelty detection in data streams.",
            "Syndromic surveillance of Flu on Twitter using weakly supervised temporal topic models.",
            "Fast exhaustive subgroup discovery with numerical target concepts.",
            "Evaluating discrete choice prediction models when the evaluation data is corrupted: analytic results and bias corrections for the area under the ROC.",
            "Identifying correlated heavy-hitters in a two-dimensional data stream.",
            "SONIC: streaming overlapping community detection.",
            "Binarised regression tasks: methods and evaluation metrics.",
            "On the evaluation of unsupervised outlier detection: measures, datasets, and an empirical study.",
            "Mining significant association rules from uncertain data.",
            "Characterizing concept drift.",
            "Guest editors' introduction to the EcmlPkdd 2016 journal track special issue of Machine Learning.",
            "Irrevocable-choice algorithms for sampling from a stream.",
            "A distributed approach for graph mining in massive networks.",
            "Generalized random shapelet forests.",
            "Skopus: Mining top-k sequential patterns under leverage.",
            "Using regression makes extraction of shared variation in multiple datasets easy.",
            "Top-k overlapping densest subgraphs.",
            "Bayesian Wishart matrix factorization.",
            "Ensembles of label noise filters: a ranking approach.",
            "Locating the contagion source in networks with partial timestamps.",
            "Mining rooted ordered trees under subtree homeomorphism.",
            "Scalable time series classification.",
            "C-BiLDA extracting cross-lingual topics from non-parallel texts by distinguishing shared from unshared content.",
            "ClusPath: a temporal-driven clustering to infer typical evolution paths.",
            "An efficient exact algorithm for triangle listing in large graphs.",
            "Exact and efficient top-K inference for multi-target prediction by querying separable linear relational models.",
            "Optimizing network robustness by edge rewiring: a general framework.",
            "Exemplar learning for extremely efficient anomaly detection in real-valued time series.",
            "Generalized Gini Correlation and its Application in Data-Mining.",
            "Online route prediction based on clustering of meaningful velocity-change areas.",
            "Discovering outlying aspects in large datasets."
        ]
    },
    {
        "name": "DMKD",
        "year": "2015",
        "info": "Volume 29, 2015",
        "count": 62,
        "papers": [
            "Editorial.",
            "Clustering categorical data in projected spaces.",
            "Ensemble anomaly detection from multi-resolution trajectory features.",
            "Summarizing numeric spatial data streams by trend cluster discovery.",
            "Sequential network change detection with its applications to ad impact relation analysis.",
            "Very fast decision rules for classification in data streams.",
            "Link prediction in heterogeneous data via generalized coupled tensor factorization.",
            "To tune or not to tune: rule evaluation for metaheuristic-based sequential covering algorithms.",
            "Visualizing multi-dimensional decision boundaries in 2D.",
            "Erratum to: Unsupervised interaction-preserving discretization of multivariate data.",
            "Addressing the cold-start problem in location recommendation using geo-social correlations.",
            "Exemplar-based low-rank matrix decomposition for data clustering.",
            "Using the minimum description length to discover the intrinsic cardinality and dimensionality of time series.",
            "Learning a symbolic representation for multivariate time series classification.",
            "Inhibiting diffusion of complex contagions in social networks: theoretical and experimental results.",
            "A framework for dissimilarity-based partitioning clustering of categorical time series.",
            "Labeled directed acyclic graphs: a generalization of context-specific independence in directed graphical models.",
            "Survey on distance metric learning and dimensionality reduction in data mining.",
            "Time series classification with ensembles of elastic distance measures.",
            "CenKNN: a scalable and effective text classifier.",
            "Graph based anomaly detection and description: a survey.",
            "Detecting anomaly collections using extreme feature ranks.",
            "On measuring similarity for sequences of itemsets.",
            "Evolutionary soft co-clustering: formulations, algorithms, and applications.",
            "Multi-period classification: learning sequent classes from temporal domains.",
            "Evaluation measures for hierarchical classification: a unified view and novel approaches.",
            "Guest editorial: Special issue on data mining for medicine and healthcare.",
            "Classification-driven temporal discretization of multivariate time series.",
            "On mining latent treatment patterns from electronic medical records.",
            "Probabilistic change detection and visualization methods for the assessment of temporal stability in biomedical data quality.",
            "Mining strong relevance between heterogeneous entities from unstructured biomedical data.",
            "Generative modeling of repositories of health records for predictive tasks.",
            "Data mining for censored time-to-event data: a Bayesian network model for predicting cardiovascular risk from electronic health record data.",
            "A relative similarity based method for interactive patient risk prediction.",
            "Constrained elastic net based knowledge transfer for healthcare information exchange.",
            "Guest editors introduction: special issue of the ECMLPKDD 2015 journal track.",
            "Mining outlying aspects on numeric data.",
            "Dynamic inference of social roles in information cascades.",
            "Finding the longest common sub-pattern in sequences of temporal intervals.",
            "MassExodus: modeling evolving networks in harsh environments.",
            "Beyond rankings: comparing directed acyclic graphs.",
            "Tractome: a visual data mining tool for brain connectivity analysis.",
            "DRESS: dimensionality reduction for efficient sequence search.",
            "Ranking episodes using a partition model.",
            "Clustering Boolean tensors.",
            "Multiscale event detection in social media.",
            "Efficient and effective community search.",
            "Assessing the impact of a health intervention via user-generated Internet content.",
            "Generalization of clustering agreements and distances for overlapping clusters and network communities.",
            "Knowledge base completion by learning pairwise-interaction differentiated embeddings.",
            "The BOSS is concerned with time series classification in the presence of noise.",
            "Ensemble methods for uplift modeling.",
            "Cluster validity functions for categorical data: a solution-space perspective.",
            "Weakly supervised nonnegative matrix factorization for user-driven clustering.",
            "A general framework for never-ending learning from time series streams.",
            "Quadratic regularization projected Barzilai-Borwein method for nonnegative matrix factorization.",
            "Learning sequential classifiers from long and noisy discrete-event sequences efficiently.",
            "A general framework for predictive tensor modeling with domain knowledge.",
            "Discrimination- and privacy-aware patterns.",
            "Multi-relational pattern mining over data streams.",
            "Properties of the sample estimators used for statistical normalization of feature vectors.",
            "Size matters: choosing the most informative set of window lengths for mining patterns in event sequences."
        ]
    },
    {
        "name": "DMKD",
        "year": "2014",
        "info": "Volume 28, 2014",
        "count": 49,
        "papers": [
            "On constrained spectral clustering and its applications.",
            "Hierarchical co-clustering: off-line and incremental approaches.",
            "The effect of homogeneity on the computational complexity of combinatorial data anonymization.",
            "Training and assessing classification rules with imbalanced data.",
            "Generalized Dirichlet priors for Naïve Bayesian classifiers with multinomial models in document classification.",
            "Anomaly detection in large-scale data stream networks.",
            "Local outlier detection reconsidered: a generalized view on locality with applications to spatial, video, and network outlier detection.",
            "A statistical significance testing approach to mining the most informative set of patterns.",
            "Ensemble-based noise detection: noise ranking and visual performance evaluation.",
            "Adaptive evolutionary clustering.",
            "G-Tries: a data structure for storing and finding subgraphs.",
            "Conditional ordinal random fields for structured ordinal-valued label prediction.",
            "Repeated labeling using multiple noisy labelers.",
            "Affinity-driven blog cascade analysis and prediction.",
            "Aggregative quantification for regression.",
            "Exploiting domain knowledge to detect outliers.",
            "Generating multiple alternative clusterings via globally optimal subspaces.",
            "Para Miner: a generic pattern mining algorithm for multi-core architectures.",
            "CID: an efficient complexity-invariant distance for time series.",
            "GA-TVRC-Het: genetic algorithm enhanced time varying relational classifier for evolving heterogeneous networks.",
            "A reference based analysis framework for understanding anomaly detection techniques for symbolic sequences.",
            "Subspace clustering of high-dimensional data: a predictive approach.",
            "A time-efficient breadth-first level-wise lattice-traversal algorithm to discover rare itemsets.",
            "Interesting pattern mining in multi-relational data.",
            "Classification of time series by shapelet transformation.",
            "Semi-supervised projected model-based clustering.",
            "Feature selection for k-means clustering stability: theoretical analysis and an algorithm.",
            "Mining trajectories of moving dynamic spatio-temporal regions in sensor datasets.",
            "Behavior-based clustering and analysis of interestingness measures for association rule mining.",
            "Discovering episodes with compact minimal windows.",
            "Multiple instance learning via Gaussian processes.",
            "Assessing the quality of multilevel graph clustering.",
            "Guest editors' introduction: special issue of the ECML/PKDD 2014 journal track.",
            "Learning about meetings.",
            "Generalization-based privacy preservation and discrimination prevention in data publishing and mining.",
            "Approximating the crowd.",
            "Ontology of core data mining entities.",
            "Leveraging the power of local spatial autocorrelation in geophysical interpolative clustering.",
            "Preserving worker privacy in crowdsourcing.",
            "Self-organizing maps by difference of convex functions optimization.",
            "Unsupervised interaction-preserving discretization of multivariate data.",
            "Uncovering the plot: detecting surprising coalitions of entities in multi-relational schemas.",
            "Discovering bands from graphs.",
            "Invariant time-series factorization.",
            "Detecting localized homogeneous anomalies over spatio-temporal data.",
            "A peek into the black box: exploring classifiers by randomization.",
            "Confidence bands for time series data.",
            "Classy: fast clustering streams of call-graphs.",
            "Overlapping community detection in labeled graphs."
        ]
    },
    {
        "name": "DMKD",
        "year": "2013",
        "info": "Volume 27, 2013",
        "count": 21,
        "papers": [
            "Preface: Intelligent interactive data visualization.",
            "On studying a 3D user interface for OLAP.",
            "Cartogram visualization for nonlinear manifold learning models.",
            "A visual analytics framework for spatio-temporal analysis and modelling.",
            "A regularized graph layout framework for dynamic network visualization.",
            "Generic visual analysis for multi- and hyperspectral image data.",
            "Visualizing dimensionality reduction of systems biology data.",
            "Using coarse information for real valued prediction.",
            "How to \"alternatize\" a clustering algorithm.",
            "Discovery of extreme events-related communities in contrasting groups of physical system networks.",
            "Cluster ensemble selection based on relative validity indexes.",
            "Guest editor's introduction: special issue of the ECML PKDD 2013 journal track.",
            "ABACUS: frequent pAttern mining-BAsed Community discovery in mUltidimensional networkS.",
            "Activity preserving graph simplification.",
            "A framework for semi-supervised and unsupervised optimal extraction of clusters from hierarchies.",
            "Growing a list.",
            "What distinguish one from its peers in social networks?",
            "Fast sequence segmentation using log-linear models.",
            "Guest editors' introduction: special section of selected papers from ECML-PKDD 2012.",
            "An efficiently computable subgraph pattern support measure: counting independent observations.",
            "Nearly exact mining of frequent trees in large networks."
        ]
    },
    {
        "name": "DMKD",
        "year": "2013",
        "info": "Volume 26, 2013",
        "count": 19,
        "papers": [
            "A single pass algorithm for clustering evolving data streams based on swarm intelligence.",
            "A preconditioned conjugate gradient algorithm for GeneRank with application to microarray data mining.",
            "Regularized nonnegative shared subspace learning.",
            "Exploiting unlabeled data to enhance ensemble diversity.",
            "Summarizing categorical data by clustering attributes.",
            "Score-based methods for learning Markov boundaries by searching in constrained spaces.",
            "Erratum to: Mining local and tail dependence structures based on pointwise mutual information.",
            "Parameter-less co-clustering for star-structured heterogeneous data.",
            "Active hashing and its application to image and text retrieval.",
            "Experimental comparison of representation methods and distance measures for time series data.",
            "Using derivatives in time series classification.",
            "A survey on enhanced subspace clustering.",
            "Enhanced spatiotemporal relational probability trees and forests.",
            "Solving non-negative matrix factorization by alternating least squares with a modified strategy.",
            "Projective clustering ensembles.",
            "Dependence maps, a dimensionality reduction with dependence distance for high-dimensional data.",
            "Representations for multi-document event clustering.",
            "Topic model for analyzing purchase data with price information.",
            "Closed and noise-tolerant patterns in n-ary relations."
        ]
    },
    {
        "name": "DMKD",
        "year": "2012",
        "info": "Volume 25, 2012",
        "count": 23,
        "papers": [
            "Community detection via heterogeneous interaction analysis.",
            "Mining closed strict episodes.",
            "Discovering injective episodes with general partial orders.",
            "FRaC: a feature-modeling approach for semi-supervised and unsupervised anomaly detection.",
            "A practical approximation algorithm for optimal k-anonymity.",
            "Guest Editors' Introduction: special issue of selected papers from ECML PKDD 2011.",
            "Comparing apples and oranges: measuring differences between exploratory data mining results.",
            "Diverse subgroup set discovery.",
            "Finding density-based subspace clusters in graphs with feature vectors.",
            "Actively learning to infer social ties.",
            "Tensor factorization using auxiliary information.",
            "Fast support vector machines for convolution tree kernels.",
            "Fast projections onto mixed-norm balls with applications.",
            "Network regression with predictive clustering trees.",
            "Guest editorial: special issue on data mining technologies for computational social science.",
            "Simultaneous classification and community detection on heterogeneous network data.",
            "Clustering large attributed information networks: an efficient incremental computing approach.",
            "Clustering daily patterns of human activities in the city.",
            "Learning influence from heterogeneous social networks.",
            "Scalable influence maximization for independent cascade model in large-scale social networks.",
            "Mining blackhole and volcano patterns in directed graphs: a general approach.",
            "Using EmotiBlog to annotate and analyse subjectivity in the new textual genres.",
            "Behavioral event data and their analysis."
        ]
    },
    {
        "name": "DMKD",
        "year": "2012",
        "info": "Volume 24, 2012",
        "count": 24,
        "papers": [
            "Using trees to mine multirelational databases.",
            "Efficient prediction algorithms for binary decomposition techniques.",
            "Mining local and tail dependence structures based on pointwise mutual information.",
            "DHCC: Divisive hierarchical clustering of categorical data.",
            "Hellinger distance decision trees are robust and skew-insensitive.",
            "Mining spatial colocation patterns: a different framework.",
            "Data mining from a patient safety database: the lessons learned.",
            "Projection approaches to process mining using region-based techniques.",
            "An inductive database system based on virtual mining views.",
            "Entropy on covers.",
            "Introduction to data mining for sustainability.",
            "Descriptive matrix factorization for sustainability Adopting the principle of opposites.",
            "Mining periodic behaviors of object movements for animal and biological sustainability studies.",
            "Tracing Evolving Subspace Clusters in Temporal Climate Data.",
            "Estimating the risk of fire outbreaks in the natural environment.",
            "Greener aviation with virtual sensors: a case study.",
            "Guest editorial: special issue on a decade of mining the Web.",
            "Survey on mining subjective data on the web.",
            "Community detection in Social Media - Performance and application considerations.",
            "A generalized taxonomy of explanations styles for traditional and social recommender systems.",
            "Customer relationship management and Web mining: the next frontier.",
            "Mining the Semantic Web - Statistical learning for next generation knowledge bases.",
            "Web log analysis: a review of a decade of studies about information acquisition, inspection and interpretation of user interaction.",
            "More than modelling and hiding: towards a comprehensive view of Web mining and privacy."
        ]
    },
    {
        "name": "DMKD",
        "year": "2011",
        "info": "Volume 23, 2011",
        "count": 15,
        "papers": [
            "Mixed-membership naive Bayes models.",
            "Improving constrained pattern mining with first-fail-based heuristics.",
            "An efficient and effective similarity measure to enable data mining of petroglyphs.",
            "Learning model trees from evolving data streams.",
            "Krimp: mining itemsets that compress.",
            "Summarizing transactional databases with overlapped hyperrectangles.",
            "Mining frequent itemsets over distributed data streams by continuously maintaining a global synopsis.",
            "Matching samples of multiple views.",
            "Sequence classification via large margin hidden Markov models.",
            "Fast density-weighted low-rank approximation spectral clustering.",
            "Publishing anonymous survey rating data.",
            "Maximum entropy models and subjective interestingness: an application to tiles in binary databases.",
            "Leveraging social media networks for classification.",
            "Measuring the component overlapping in the Gaussian mixture model.",
            "All normalized anti-monotonic overlap graph measures are bounded."
        ]
    },
    {
        "name": "DMKD",
        "year": "2011",
        "info": "Volume 22, 2011",
        "count": 17,
        "papers": [
            "Selective sampling techniques for feedback-based data retrieval.",
            "A survey of hierarchical classification across different application domains.",
            "A disk-aware algorithm for time series motif discovery.",
            "Learning Bayesian networks by hill climbing: efficient methods based on progressive restriction of the neighborhood.",
            "Time series shapelets: a novel technique that allows accurate, interpretable and fast classification.",
            "Web robot detection techniques: overview and limitations.",
            "Tree pattern expression for extracting information from syntactically parsed text corpora.",
            "Identifying predictive multi-dimensional time series motifs: an application to severe weather prediction.",
            "Detecting and ordering salient regions.",
            "Classifier evaluation and attribute selection against active adversaries.",
            "Guest editorial: special issue on data mining with matrices, graphs and tensors.",
            "Manifold elastic net: a unified framework for sparse dimension reduction.",
            "Matrix-variate and higher-order probabilistic projections.",
            "Learning bidirectional asymmetric similarity for collaborative filtering via matrix factorization.",
            "Nonnegative tensor factorization as an alternative Csiszar-Tusnady procedure: algorithms, convergence, probabilistic interpretations and novel probabilistic tensor latent variable analysis algorithms.",
            "Hierarchical visual event pattern mining and its applications.",
            "Community discovery using nonnegative matrix factorization."
        ]
    },
    {
        "name": "DMKD",
        "year": "2010",
        "info": "Volume 21, 2010",
        "count": 22,
        "papers": [
            "Guest Editorial: Global modeling using local patterns.",
            "Optimal constraint-based decision tree induction from itemset lattices.",
            "ENDER: a statistical framework for boosting decision rules.",
            "Ensembles of jittered association rule classifiers.",
            "Learning in parallel universes.",
            "Hierarchical document clustering using local patterns.",
            "Using interesting sequences to interactively build Hidden Markov Models.",
            "Guest editors' introduction: special issue of selected papers from ECML PKDD 2010.",
            "A game-theoretic framework to identify overlapping communities in social networks.",
            "Accelerating spectral clustering with partial supervision.",
            "Maximal exceptions with minimal descriptions.",
            "Three naive Bayes approaches for discrimination-free classification.",
            "Using background knowledge to rank itemsets.",
            "Mining top-K frequent itemsets through progressive sampling.",
            "Predicting labels for dyadic data.",
            "Density-based semi-supervised clustering.",
            "Re-examination of interestingness measures in pattern mining: a unified framework.",
            "A weighted voting summarization of SOM ensembles.",
            "A clustering comparison measure using density profiles and its application to the discovery of alternate clusterings.",
            "Frequent subgraph mining in outerplanar graphs.",
            "Exact indexing for massive time series databases under time warping distance.",
            "Erratum to: A link mining algorithm for earnings forecast and trading."
        ]
    },
    {
        "name": "DMKD",
        "year": "2010",
        "info": "Volume 20, 2010",
        "count": 17,
        "papers": [
            "SCALE: a scalable framework for efficiently clustering transactional data.",
            "Binary matrix factorization for analyzing gene expression data.",
            "Progressive refinement for support vector machines.",
            "Extracting influential nodes on a social network for information diffusion.",
            "Eigenvectors of directed graphs and importance scores: dominance, T-Rank, and sink remedies.",
            "An incremental clustering scheme for data de-duplication.",
            "Outlier detection special issue.",
            "COG: local decomposition for rare class analysis.",
            "Spatial neighborhood based anomaly detection in sensor datasets.",
            "A fast outlier detection strategy for distributed high-dimensional data sets with mixed attributes.",
            "Distance-based outlier queries in data streams: the novel task and algorithms.",
            "Guest Editorial: Special Issue on impacting patient care by mining medical data.",
            "A real-time temporal Bayesian architecture for event surveillance and its application to patient-specific multiple disease outbreak detection.",
            "Temporal pattern discovery in longitudinal electronic patient records.",
            "Time to CARE: a collaborative engine for practical disease prediction.",
            "ECM-aware cell-graph mining for bone tissue modeling and classification.",
            "Medical data mining: insights from winning two competitions."
        ]
    },
    {
        "name": "DMKD",
        "year": "2009",
        "info": "Volume 19, 2009",
        "count": 18,
        "papers": [
            "Document analysis and visualization with zero-inflated poisson.",
            "iSAX: disk-aware mining and indexing of massive time series datasets.",
            "Global and componentwise extrapolations for accelerating training of Bayesian networks and conditional random fields.",
            "Flexible decision tree for data stream classification in the presence of concept change, noise and missing values.",
            "A novel hash-based approach for mining frequent itemsets over data streams requiring less memory space.",
            "Guest editors' introduction: special issue of selected papers from ECML PKDD 2009.",
            "Identifying the components.",
            "RTG: a recursive realistic graph generator using random typing.",
            "On subgroup discovery in numerical domains.",
            "Taxonomy-driven lumping for sequence mining.",
            "Harnessing the strengths of anytime algorithms for constant data streams.",
            "Two-way analysis of high-dimensional collinear data.",
            "A fast ensemble pruning algorithm based on pattern mining process.",
            "FURIA: an algorithm for unordered fuzzy rule induction.",
            "Subsea: an efficient heuristic algorithm for subgraph isomorphism.",
            "Solving large p-median clustering problems by primal-dual variable neighborhood search.",
            "Fast incremental mining of web sequential patterns with PLWAP tree.",
            "Fast incremental mining of web sequential patterns with PLWAP tree."
        ]
    },
    {
        "name": "DMKD",
        "year": "2009",
        "info": "Volume 18, 2009",
        "count": 16,
        "papers": [
            "CONTOUR: an efficient algorithm for discovering discriminating subsequences.",
            "Transaction aggregation as a strategy for credit card fraud detection.",
            "Scalable pattern mining with Bayesian networks as background knowledge.",
            "FRAPP: a framework for high-accuracy privacy-preserving mining.",
            "Controlled experiments on the web: survey and practical guide.",
            "Alternative prior assumptions for improving the performance of naïve Bayesian classifiers.",
            "A global optimization method for semi-supervised clustering.",
            "Using instance-level constraints in agglomerative hierarchical clustering: theoretical and empirical results.",
            "Active learning for object classification: from exploration to exploitation.",
            "Sourcerer: mining and searching internet-scale software repositories.",
            "DECODE: a new method for discovering clusters of different densities in spatial data.",
            "Harmony K-means algorithm for document clustering.",
            "A divide-and-conquer recursive approach for scaling up instance selection algorithms.",
            "A link mining algorithm for earnings forecast and trading.",
            "Ethological data mining: an automata-based approach to extract behavioral units and rules.",
            "Incremental sequence-based frequent query pattern mining from XML queries."
        ]
    },
    {
        "name": "DMKD",
        "year": "2008",
        "info": "Volume 17, 2008",
        "count": 21,
        "papers": [
            "Guest Editors' Introduction: Special issue of Selected Papers from ECML PKDD 2008.",
            "Finding reliable subgraphs from large probabilistic graphs.",
            "A space efficient solution to the frequent string mining problem for many databases.",
            "The Boolean column and column-row matrix decompositions.",
            "SkyGraph: an algorithm for important subgraph discovery in relational graphs.",
            "Mining conjunctive sequential patterns.",
            "Adequate condensed representations of patterns.",
            "Two heads better than one: pattern discovery in time-evolving multi-aspect data.",
            "Guest editorial: special issue on utility-based data mining.",
            "Cost-sensitive learning with conditional Markov networks.",
            "Quantifying counts and costs via classification.",
            "PRIE: a system for generating rulelists to maximize ROC performance.",
            "Automatically countering imbalance and its empirical relationship to cost.",
            "Maximizing classifier utility when there are data acquisition and modeling costs.",
            "Pessimistic cost-sensitive active learning of decision trees for profit maximizing targeting campaigns.",
            "Classification trees and decision-analytic feedforward control: a case study from the video game industry.",
            "Efficiently finding unusual shapes in large image databases.",
            "Efficient algorithms for segmentation of item-set time series.",
            "Learning to hash: forgiving hash functions and applications.",
            "Parallell interacting MCMC for learning of topologies of graphical models.",
            "An integrated, generic approach to pattern mining: data mining template library."
        ]
    },
    {
        "name": "DMKD",
        "year": "2008",
        "info": "Volume 16, 2008",
        "count": 13,
        "papers": [
            "Guest editorial: special issue on temporal data mining: theory, algorithms and applications.",
            "Mining spatio-temporal patterns in object mobility databases.",
            "Web usage mining: extracting unexpected periods from web logs.",
            "A dynamic bibliometric model for identifying online communities.",
            "Correlating burst events on streaming stock market data.",
            "Collusion set detection using graph clustering.",
            "A recursive search algorithm for statistical disclosure assessment.",
            "Mining functional dependencies from data.",
            "Effective elimination of redundant association rules.",
            "A framework for condensation-based anonymization of string data.",
            "Bipartite isoperimetric graph partitioning for data co-clustering.",
            "Using association rules to mine for strong approximate dependencies.",
            "Fast mining of distance-based outliers in high-dimensional datasets."
        ]
    },
    {
        "name": "DMKD",
        "year": "2007",
        "info": "Volume 15, 2007",
        "count": 17,
        "papers": [
            "Editorial.",
            "On data mining, compression, and Kolmogorov complexity.",
            "Toward knowledge-rich data mining.",
            "Exploratory mining in cube space.",
            "Frequent pattern mining: current status and future directions.",
            "Future trends in data mining.",
            "Data mining and knowledge discovery 1996 to 2005: overcoming the hype and moving from \"university\" to \"business\" and \"analytics\".",
            "Experiencing SAX: a novel symbolic representation of time series.",
            "Mining process models with non-free-choice constructs.",
            "Efficient mining of understandable patterns from multivariate interval time series.",
            "Data mining with Temporal Abstractions: learning rules from time series.",
            "Relational peculiarity-oriented mining.",
            "Detecting inconsistency in biological molecular databases using ontologies.",
            "Classification of multi class dataset using wavelet power spectrum.",
            "CrossClus: user-guided multi-relational clustering.",
            "Tree-Traversing Ant Algorithm for term clustering based on featureless similarities.",
            "Mining for trigger events with survival analysis."
        ]
    },
    {
        "name": "DMKD",
        "year": "2007",
        "info": "Volume 14, 2007",
        "count": 13,
        "papers": [
            "An efficient approach to external cluster assessment with an application to martian topography.",
            "The complexity of non-hierarchical clustering with instance and cluster level constraints.",
            "Locally adaptive metrics for clustering high dimensional data.",
            "Compression-based data mining of sequential data.",
            "Privacy-preserving boosting.",
            "Non-derivable itemset mining.",
            "Two topographic maps for data visualisation.",
            "Evaluation of ordinal attributes at value level.",
            "Genetic process mining: an experimental evaluation.",
            "Duplicate detection in adverse drug reaction surveillance.",
            "Differential prioritization in feature selection and classifier aggregation for multiclass microarray datasets.",
            "A fast and effective method to find correlations among attributes in databases.",
            "Using metarules to organize and group discovered association rules."
        ]
    },
    {
        "name": "DMKD",
        "year": "2006",
        "info": "Volume 13, 2006",
        "count": 16,
        "papers": [
            "DOMpro: Protein Domain Prediction Using Profiles, Secondary Structure, Relative Solvent Accessibility, and Recursive Neural Networks.",
            "A Bit Level Representation for Time Series Data Mining with Shape Based Similarity.",
            "Information Preserving Time Decompositions of Time Stamped Documents*.",
            "A Rule-Based Approach for Process Discovery: Dealing with Noise and Imbalance in Process Logs.",
            "On the use of Human-Computer Interaction for Projected Nearest Neighbor Search.",
            "VizRank: Data Visualization Guided by Machine Learning.",
            "A Model-Based Frequency Constraint for Mining Associations from Transaction Data.",
            "A systematic approach to the assessment of fuzzy association rules.",
            "Mining top-K frequent itemsets from data streams.",
            "Hyperclique pattern discovery.",
            "Support measures for graph data.",
            "Mining in Anticipation for Concept Change: Proactive-Reactive Prediction in Data Streams.",
            "Accelerated EM-based clustering of large data sets.",
            "Learning Semi-Structured Document Categorization Using Bounded-Length Spectrum Sub-Sequence Kernels.",
            "Characteristic-Based Clustering for Time Series Data.",
            "Scalable Clustering Algorithms with Balancing Constraints."
        ]
    },
    {
        "name": "DMKD",
        "year": "2006",
        "info": "Volume 12, 2006",
        "count": 14,
        "papers": [
            "Structural Periodic Measures for Time-Series Data.",
            "Computing LTS Regression for Large Data Sets.",
            "Data Clustering with Partial Supervision.",
            "Structural Hidden Markov Models Using a Relation of Equivalence: Application to Automotive Designs.",
            "A Mathematical Morphology Based Scale Space Method for the Mining of Linear Features in Geographic Data.",
            "An Erratum on \"Pushing Convertible Constraints in Frequent Itemset Mining\".",
            "Mining Multiple Data Sources: Local Pattern Analysis.",
            "Organizing Multiple Data Sources for Developing Intelligent e-Business Portals.",
            "Sequential Pattern Mining in Multi-Databases via Multiple Alignment.",
            "Discovering Classification from Data of Multiple Sources.",
            "Fast Distributed Outlier Detection in Mixed-Attribute Data Sets.",
            "Reinforcing Web-object Categorization Through Interrelationships.",
            "Mining Adaptive Ratio Rules from Distributed Data Sources.",
            "Bridging Local and Global Data Cleansing: Identifying Class Noise in Large, Distributed Data Datasets."
        ]
    },
    {
        "name": "DMKD",
        "year": "2005",
        "info": "Volume 11, 2005",
        "count": 14,
        "papers": [
            "Automatic Subspace Clustering of High Dimensional Data.",
            "Neural and Wavelet Network Models for Financial Distress Classification.",
            "Mining Customer Value: From Association Rules to Direct Marketing.",
            "Data Mining for Inventory Item Selection with Cross-Selling Considerations.",
            "Privacy in Data Mining.",
            "A Framework for Evaluating Privacy Preserving Data Mining Algorithms.",
            "Preserving the Confidentiality of Categorical Statistical Data Bases When Releasing Information for Association Rules.",
            "Probabilistic Information Loss Measures in Confidentiality Protection of Continuous Microdata.",
            "Ordinal, Continuous and Heterogeneous k-Anonymity Through Microaggregation.",
            "Accurate Prediction of Protein Disordered Regions by Mining Protein Structure Data.",
            "GenMax: An Efficient Algorithm for Mining Maximal Frequent Itemsets.",
            "Finding Frequent Patterns in a Large Sparse Graph*.",
            "Using Generalized Estimating Equation to Learn Decision Tree with Multivariate Responses.",
            "Making SVMs Scalable to Large Data Sets using Hierarchical Cluster Indexing."
        ]
    },
    {
        "name": "DMKD",
        "year": "2005",
        "info": "Volume 10, 2005",
        "count": 9,
        "papers": [
            "Mining Web Log Sequential Patterns with Position Coded Pre-Order Linked WAP-Tree.",
            "K-Optimal Rule Discovery.",
            "Efficient Algorithms for Mining and Incremental Update of Maximal Frequent Sequences.",
            "On the Use of Wavelet Decomposition for String Classification.",
            "Hierarchical Clustering Algorithms for Document Datasets.",
            "Sequential Activity Profiling: Latent Dirichlet Allocation of Markov Chains.",
            "Finding Frequent Patterns Using Length-Decreasing Support Constraints.",
            "HIL-Tree: A Hierarchical Structure for Guiding Search into Test and Measurement Data Archives.",
            "On High Dimensional Projected Clustering of Data Streams."
        ]
    },
    {
        "name": "DMKD",
        "year": "2004",
        "info": "Volume 9, 2004",
        "count": 11,
        "papers": [
            "A Subsequence Matching Algorithm that Supports Normalization Transform in Time-Series Databases.",
            "Hypergraph Models and Algorithms for Data-Pattern-Based Clustering.",
            "Mining GPS Traces for Map Refinement.",
            "Incremental Maintenance on the Border of the Space of Emerging Patterns.",
            "On Leveraging User Access Patterns for Topic Specific Crawling.",
            "Enhancing Product Recommender Systems on Sparse Binary Data.",
            "Outlier Detection and Data Cleaning in Multivariate Non-Normal Samples: The PAELLA Algorithm.",
            "Mining Surprising Periodic Patterns.",
            "Mining Non-Redundant Association Rules.",
            "Efficient Mining of Frequent Patterns Using Ascending Frequency Ordered Prefix-Tree.",
            "Using Convex Sets for Exploratory Data Analysis and Visualization."
        ]
    },
    {
        "name": "DMKD",
        "year": "2004",
        "info": "Volume 8, 2004",
        "count": 13,
        "papers": [
            "Editorial.",
            "Building an Association Rules Framework to Improve Product Assortment Decisions.",
            "Tree Structures for Mining Association Rules.",
            "Mining Frequent Patterns without Candidate Generation: A Frequent-Pattern Tree Approach.",
            "Editorial.",
            "Efficient Multisplitting Revisited: Optima-Preserving Elimination of Partition Candidates.",
            "Fast and Robust General Purpose Clustering Algorithms.",
            "Ratio Selection for Classification Models.",
            "Communication-Efficient Distributed Mining of Association Rules.",
            "Maximum and Minimum Likelihood Hebbian Learning for Exploratory Projection Pursuit.",
            "Pushing Convertible Constraints in Frequent Itemset Mining.",
            "Building Association-Rule Based Sequential Classifiers for Web-Document Prediction.",
            "On-Line Unsupervised Outlier Detection Using Finite Mixtures with Discounting Learning Algorithms."
        ]
    },
    {
        "name": "DMKD",
        "year": "2003",
        "info": "Volume 7, 2003",
        "count": 18,
        "papers": [
            "Free-Sets: A Condensed Representation of Boolean Data for the Approximation of Frequency Queries.",
            "XTRACT: Learning Document Type Descriptors from XML Document Collections.",
            "Cluster Detection in Databases: The Adaptive Matched Filter Algorithm and Implementation.",
            "A Taxonomy of Dirty Data.",
            "Data Squashing by Empirical Likelihood.",
            "Using Self-Similarity to Cluster Large Data Sets.",
            "Extracting Share Frequent Itemsets with Infrequent Subsets.",
            "Building Decision Trees with Constraints.",
            "Sampling and Subsampling for Cluster Analysis in Data Mining: With Applications to Sky Survey Data.",
            "Guest Editorial.",
            "DualMiner: A Dual-Pruning Algorithm for Itemsets with Constraints.",
            "Analysis of Pattern Discovery in Sequences Using a Bayes Error Framework.",
            "A Sequential Monte Carlo Method for Bayesian Analysis of Massive Datasets.",
            "Customer Lifetime Value Models for Decision Support.",
            "Guest Editorial.",
            "On the Need for Time Series Data Mining Benchmarks: A Survey and Empirical Demonstration.",
            "Bursty and Hierarchical Structure in Streams.",
            "Model-Based Clustering and Visualization of Navigation Patterns on a Web Site."
        ]
    },
    {
        "name": "DMKD",
        "year": "2002",
        "info": "Volume 6, 2002",
        "count": 16,
        "papers": [
            "Web Mining.",
            "Discovery of Web Robot Sessions Based on their Navigational Patterns.",
            "Using Site Semantics to Analyze, Visualize, and Support Navigation.",
            "Discovery and Evaluation of Aggregate Usage Profiles for Web Personalization.",
            "Efficient Adaptive-Support Association Rule Mining for Recommender Systems.",
            "On Issues of Instance Selection.",
            "Adaptive Sampling Methods for Scaling Up Knowledge Discovery Algorithms.",
            "Advances in Instance Selection for Instance-Based Learning Algorithms.",
            "Likelihood-Based Data Squashing: A Modeling Approach to Instance Construction.",
            "A Unifying View on Instance Selection.",
            "Cubegrades: Generalizing Association Rules.",
            "Support Vector Machines and the Bayes Rule in Classification.",
            "Automated Remote Sensing with Near Infrared Reflectance Spectra: Carbonate Recognition.",
            "Techniques of Cluster Algorithms in Data Mining.",
            "High-Performance Commercial Data Mining: A Multistrategy Machine Learning Application.",
            "Discretization: An Enabling Technique."
        ]
    },
    {
        "name": "DMKD",
        "year": "2001",
        "info": "Volume 5, 2001",
        "count": 15,
        "papers": [
            "Applications of Data Mining to Electronic Commerce.",
            "Personalization of Supermarket Product Recommendations.",
            "Expert-Driven Validation of Rule-Based User Models in Personalization Applications.",
            "Visualization and Analysis of Clickstream Data of Online Stores for Understanding Web Merchandising.",
            "Data Mining for Measuring and Improving the Success of Web Sites.",
            "E-Commerce Recommendation Applications.",
            "Statistical Models for Data Mining.",
            "Signature-Based Methods for Data Streams.",
            "Association Models for Web Mining.",
            "Scaling Kernel-Based Systems to Large Data Sets.",
            "Detecting Group Differences: Mining Contrast Sets.",
            "iDiff: Informative Summarization of Differences in Multidimensional Aggregates.",
            "Extensible Parallel Query Processing for Exploratory Geoscientific Data Mining.",
            "Knowledge Discovery in Grammatically Analysed Corpora.",
            "Deterministic Generative Models for Fast Feature Discovery."
        ]
    },
    {
        "name": "DMKD",
        "year": "2000",
        "info": "Volume 4, 2000",
        "count": 14,
        "papers": [
            "Guest Editorial: Statistical Mining and Data Visualization in Atmospheric Sciences.",
            "Euclidean Distance Based Permutation Methods in Atmospheric Science.",
            "Bootstrapping to Assess and Improve Atmospheric Prediction Models.",
            "Using Linked Micromap Plots to Characterize Omernik Ecoregions.",
            "Visual Data Mining In Atmospheric Science Data.",
            "Guest Editorial.",
            "Integrating Association Rule Mining with Relational Database Systems: Alternatives and Implications.",
            "RainForest - A Framework for Fast Decision Tree Construction of Large Datasets.",
            "Scalable Techniques for Mining Causal Structures.",
            "Spatial Data Mining: Database Primitives, Algorithms and Efficient DBMS Support.",
            "Constraint-Based Rule Mining in Large, Dense Databases.",
            "Discovering Interesting Patterns for Investment Decision Making with GLOWER - A Genetic Learner Overlaid with Entropy Reduction.",
            "Informix under CONTROL: Online Query Processing.",
            "PUBLIC: A Decision Tree Classifier that Integrates Building and Pruning."
        ]
    },
    {
        "name": "DMKD",
        "year": "1999",
        "info": "Volume 3, 1999",
        "count": 17,
        "papers": [
            "Editorial.",
            "Discovery of Frequent DATALOG Patterns.",
            "Feature Construction with Inductive Logic Programming: A Study of Quantitative Predictions of Biological Activity Aided by Structural Attributes.",
            "Scaling Up Inductive Logic Programming by Learning from Interpretations.",
            "A Study of Two Sampling Methods for Analyzing Large Datasets with ILP.",
            "A Survey of Methods for Scaling Up Inductive Algorithms.",
            "A Scalable Parallel Algorithm for Self-Organizing Maps with Applications to Sparse Data Mining Problems.",
            "Partitioning Nominal Attributes in Decision Trees.",
            "CHAMP: A Prototype for Automated Cellular Churn Prediction.",
            "Editorial.",
            "Parallel Formulations of Decision-Tree Classification Algorithms.",
            "A Fast Parallel Clustering Algorithm for Large Spatial Databases.",
            "Effect of Data Distribution in Parallel Mining of Associations.",
            "Parallel Learning of Belief Networks in Large and Difficult Domains.",
            "DMajor-Application Programming Interface for Database Mining.",
            "MSQL: A Query Language for Database Mining.",
            "The Role of Occam's Razor in Knowledge Discovery."
        ]
    },
    {
        "name": "DMKD",
        "year": "1998",
        "info": "Volume 2, 1998",
        "count": 17,
        "papers": [
            "Editorial.",
            "Real-world Data is Dirty: Data Cleansing and The Merge/Purge Problem.",
            "Beyond Market Baskets: Generalizing Association Rules to Dependence Rules.",
            "Discovering Robust Knowledge from Databases that Change.",
            "Brief Application Description. Neural Networks Based Forecasting Techniques for Inventory Control Applications.",
            "Editorial.",
            "A Tutorial on Support Vector Machines for Pattern Recognition.",
            "Density-Based Clustering in Spatial Databases: The Algorithm GDBSCAN and Its Applications.",
            "An Extension to SQL for Mining Association Rules.",
            "Editorial.",
            "Is Sampling Useful in Data Mining? A Case in the Maintenance of Discovered Association Rules.",
            "On the Complexity of Mining Quantitative Association Rules.",
            "Extensions to the k-Means Algorithm for Clustering Large Data Sets with Categorical Values.",
            "A Microeconomic View of Data Mining.",
            "Principal Direction Divisive Partitioning.",
            "Automatic Construction of Decision Trees from Data: A Multi-Disciplinary Survey.",
            "Mining Pharmacy Data Helps to Make Profits."
        ]
    },
    {
        "name": "DMKD",
        "year": "1997",
        "info": "Volume 1, 1997",
        "count": 18,
        "papers": [
            "Statistical Themes and Lessons for Data Mining.",
            "Data Cube: A Relational Aggregation Operator Generalizing Group-by, Cross-Tab, and Sub Totals.",
            "On Bias, Variance, 0/1-Loss, and the Curse-of-Dimensionality.",
            "Bayesian Networks for Data Mining.",
            "Advanced Scout: Data Mining and Knowledge Discovery in NBA Data.",
            "BIRCH: A New Data Clustering Algorithm and Its Applications.",
            "Mathematical Programming in Data Mining.",
            "A Simple Constraint-Based Algorithm for Efficiently Mining Observational Databases for Causal Relationships.",
            "Visual Data Mining: Recognizing Telephone Calling Fraud.",
            "Levelwise Search and Borders of Theories in Knowledge Discovery.",
            "Discovery of Frequent Episodes in Event Sequences.",
            "Adaptive Fraud Detection.",
            "On Comparing Classifiers: Pitfalls to Avoid and a Recommended Approach.",
            "Editorial.",
            "Parallel Algorithms for Discovery of Association Rules.",
            "A Distributed Algorithm for Content Based Indexing of Images by Projections on Ritz Primary Images.",
            "High Performance OLAP and Data Mining on Parallel Computers.",
            "Halo World: Tools for Parallel Cluster Finding in Astrophysical N-body Simulations."
        ]
    }
]