[
    {
        "year": "2021",
        "name": "25th EASE 2021",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2021",
                "sub_name": "EASE 2021: Evaluation and Assessment in Software Engineering, Trondheim, Norway, June 21-24, 2021.",
                "count": 51,
                "papers": [
                    "Facebook's Cyber-Cyber and Cyber-Physical Digital Twins.",
                    "How Do Agile Practitioners Interpret and Foster \"Technical Excellence\"?",
                    "Mining Dependencies in Large-Scale Agile Software Development Projects: A Quantitative Industry Study.",
                    "Tell me: Am I going to Heaven? A Diagnosis Instrument of Continuous Software Engineering Practices Adoption.",
                    "A Machine Learning Based Ensemble Method for Automatic Multiclass Classification of Decisions.",
                    "Influence of Roles in Decision-Making during OSS Development - A Study of Python.",
                    "Analytics Mistakes that Derail Software Startups.",
                    "Relationships between Personality Traits and Productivity in a Multi-platform Development Context.",
                    "Development and Application of Sentiment Analysis Tools in Software Engineering: A Systematic Literature Review.",
                    "Assessing Developer Expertise from the Statistical Distribution of Programming Syntax Patterns.",
                    "Towards a corpus for credibility assessment in software practitioner blog articles.",
                    "A Large-scale Study of Security Vulnerability Support on Developer Q&A Websites.",
                    "How Should Developers Respond to App Reviews? Features Predicting the Success of Developer Responses.",
                    "CCMC: Code Completion with a Memory Mechanism and a Copy Mechanism.",
                    "Self-Claimed Assumptions in Deep Learning Frameworks: An Exploratory Study.",
                    "Modernizing Legacy Systems with Microservices: A Roadmap.",
                    "Human-level Ordinal Maintainability Prediction Based on Static Code Metrics.",
                    "Test Smell Detection Tools: A Systematic Mapping Study.",
                    "Detection and Elimination of Systematic Labeling Bias in Code Reviewer Recommendation Systems.",
                    "Measurement-based Experiments on the Mobile Web: A Systematic Mapping Study.",
                    "On the Nature of Issues in Five Open Source Microservices Systems: An Empirical Study.",
                    "From Blackboard to the Office: A Look Into How Practitioners Perceive Software Testing Education.",
                    "DABT: A Dependency-aware Bug Triaging Method.",
                    "Challenges when Applying Repertory Grid Technique for Software Practices.",
                    "Storytelling in human-centric software engineering research.",
                    "Adversarial Machine Learning: On the Resilience of Third-party Library Recommender Systems.",
                    "Towards offensive language detection and reduction in four Software Engineering communities.",
                    "SLGPT: Using Transfer Learning to Directly Generate Simulink Model Files and Find Bugs in the Simulink Toolchain.",
                    "Empirical Findings on BDD Story Parsing to Support Consistency Assurance between Requirements and Artifacts.",
                    "Open Data-driven Usability Improvements of Static Code Analysis and its Challenges.",
                    "DebtHunter: A Machine Learning-based Approach for Detecting Self-Admitted Technical Debt.",
                    "Evaluating the Effectiveness of Problem Frames for Contextual Modeling of Cyber-Physical Systems: a Tool Suite with Adaptive User Interfaces.",
                    "A Reference Architecture for Validating Security Across Multi-Cloud Computing Systems.",
                    "The Connection between the Sustainability Impacts of Software Products and the Role of Software Engineers.",
                    "Supporting sustainability design through agile software development.",
                    "Dynamic Vulnerability Detection on Smart Contracts Using Machine Learning.",
                    "GDPR-Compliant Use of Blockchain for Secure Usage Logs.",
                    "HFContractFuzzer: Fuzzing Hyperledger Fabric Smart Contracts for Vulnerability Detection.",
                    "DID-eFed: Facilitating Federated Learning as a Service with Decentralized Identities.",
                    "On Implicit Assumptions Underlying Software Engineering Research.",
                    "A Classification for Managing Software Engineering Knowledge.",
                    "Towards an Automated Classification Approach for Software Engineering Research.",
                    "Towards a More Structured Peer Review Process with Empirical Standards.",
                    "If you want better empirical research, value your theory: On the importance of strong theories for progress in empirical software engineering research.",
                    "Benchmarking as Empirical Standard in Software Engineering Research.",
                    "About the Assessment of Grey Literature in Software Engineering.",
                    "Towards a Reliability Prediction Model based on Internal Structure and Post-Release Defects Using Neural Networks.",
                    "Fog Based Energy Efficient Process Framework for Smart Building.",
                    "System and Software Processes in Practice: Insights from Chinese Industry.",
                    "Empirical Investigation of Code Quality Rule Violations in HPC Applications.",
                    "Recommender Systems for Software Project Managers."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "24th EASE 2020",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2020",
                "sub_name": "EASE '20: Evaluation and Assessment in Software Engineering, Trondheim, Norway, April 15-17, 2020.",
                "count": 69,
                "papers": [
                    "A Multiple Case Study of Artificial Intelligent System Development in Industry.",
                    "A Bigram-based Inference Model for Retrieving Abbreviated Phrases in Source Code.",
                    "An Experimental Evaluation of Imbalanced Learning and Time-Series Validation in the Context of CI/CD Prediction.",
                    "Agile Islands in a Waterfall Environment: Challenges and Strategies in Automotive.",
                    "Mining Questions Asked about Continuous Software Engineering: A Case Study of Stack Overflow.",
                    "Automatic Identification of Decisions from the Hibernate Developer Mailing List.",
                    "Combining Network Analysis with Structural Matching for Design Pattern Detection.",
                    "A Multinomial Naïve Bayesian (MNB) Network to Automatically Recommend Topics for GitHub Repositories.",
                    "Observations on the Linear Order of Program Code Reading Patterns in Programmers with Dyslexia.",
                    "Feature Terms Prediction: A Feasible Way to Indicate the Notion of Features in Software Product Line.",
                    "Exploring the Characteristics of Spectra Distribution and Their Impacts on Fault Localization.",
                    "Using the Lexicon from Source Code to Determine Application Domain.",
                    "Assessing software defection prediction performance: why using the Matthews correlation coefficient matters.",
                    "Publication Bias: A Detailed Analysis of Experiments Published in ESEM.",
                    "Reasoning about Uncertainty in Empirical Results.",
                    "Studying Onboarding in Distributed Software Teams: A Case Study and Guidelines.",
                    "Which Software Faults Are Tests Not Detecting?",
                    "Is Exceptional Behavior Testing an Exception?: An Empirical Assessment Using Java Automated Tests.",
                    "Caveats in Eliciting Mobile App Requirements.",
                    "Investigating the Correlation between Performance Scores and Energy Consumption of Mobile Web Apps.",
                    "Mining Decision-Making Processes in Open Source Software Development: A Study of Python Enhancement Proposals (PEPs) using Email Repositories.",
                    "Surveying Software Practitioners on Technical Debt Payment Practices and Reasons for not Paying off Debt Items.",
                    "How Do FOSS Communities Decide to Accept Pull Requests?",
                    "A Better Set of Object-Oriented Design Metrics for Within-Project Defect Prediction.",
                    "Actionable Software Metrics: An Industrial Perspective.",
                    "Documentation of Quality Requirements in Agile Software Development.",
                    "Collaborative Modelling: Chatbots or On-Line Tools? An Experimental Study.",
                    "Quality Assessment of Online Automated Privacy Policy Generators: An Empirical Study.",
                    "Tricking Johnny into Granting Web Permissions.",
                    "An Empirical Investigation on Software Practices in Growth Phase Startups.",
                    "Themes and Difficulties in Distributed Agile Email Activity: A Qualititative Team-Based Study.",
                    "Heterogeneous Tailoring Approach Using the Spotify Model.",
                    "A Qualitative Study of the Background, Skill Acquisition, and Learning Preferences of Software Testers.",
                    "Visualizing Inter-Team Coordination.",
                    "A Practical Concolic Execution Technique for Large Scale Software Systems.",
                    "An Exploratory Study Towards Understanding Lambda Expressions in Python.",
                    "How Can I Contribute?: A Qualitative Analysis of Community Websites of 25 Unix-Like Distributions.",
                    "On the Understanding of Experimentation Usage in Light of Lean Startup in Software Development Context.",
                    "How features in iOS App Store Reviews can Predict Developer Responses.",
                    "MLCQ: Industry-Relevant Code Smell Data Set.",
                    "Agility is responsiveness to change: An essential definition.",
                    "Formal vs. Case-Study-Based Approaches for the Identification of Cultural Influences in Requirements Engineering.",
                    "Achieving \"Good Enough\" Software Security: The Role of Objectivity.",
                    "Explainable Priority Assessment of Software-Defects using Categorical Features at SAP HANA.",
                    "Making Software Measurement Standards Understandable.",
                    "Characteristic Traits of Software Testers.",
                    "Experiences from an Interpretative Case Study of Innovative Public Procurement of Digital Systems in the Norwegian Public Sector.",
                    "TMMI Integration with Agile and Test Process.",
                    "Exploring and improving industry-academia communication in software engineering.",
                    "Blockchain Applications in Human Resources Management: Opportunities and Challenges.",
                    "The Minimum Hybrid Contract (MHC): Combining Legal and Blockchain Smart Contracts.",
                    "Exploring the Challenges of Developing and Operating Consortium Blockchains: A Case Study.",
                    "On the Evaluation of the Security Usability of Bitcoin's APIs.",
                    "RMDevOps: A Road Map for Improvement in DevOps Activities in Context of Software Organizations.",
                    "Generative Ranking based Sequential Recommendation in Software Crowdsourcing.",
                    "Towards Process Improvement in DevOps: A Systematic Literature Review.",
                    "Cross-Project Software Fault Prediction Using Data Leveraging Technique to Improve Software Quality.",
                    "Towards continues code recommendation and implementation system: An Initial Framework.",
                    "Towards successful global software development.",
                    "Software Security Specifications and Design: How Software Engineers and Practitioners Are Mixing Things up.",
                    "Towards a Hypothetical Framework to Secure DevOps Adoption: Grounded Theory Approach.",
                    "SIOT-RIMM: Towards Secure IOT-Requirement Implementation Maturity Model.",
                    "Secure V2X Environment using Blockchain Technology.",
                    "Automated Identification of Security Requirements: A Machine Learning Approach.",
                    "PrivDRM: A Privacy-preserving Secure Digital Right Management System.",
                    "The State of the Art on Secure Software Engineering: A Systematic Mapping Study.",
                    "Towards Efficient and Secure Global Software Development using Blockchain.",
                    "A Comparison Study of Available Sofware Security Ontologies.",
                    "What Norwegian Developers Want and Need From Security-Directed Program Analysis Tools: A Survey."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "23rd EASE 2019",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2019",
                "sub_name": "Proceedings of the Evaluation and Assessment on Software Engineering, EASE 2019, Copenhagen, Denmark, April 15-17, 2019.",
                "count": 43,
                "papers": [
                    "Open Tools for Software Engineering: Validation of a Theory of Openness in the Automotive Industry.",
                    "Espresso vs. EyeAutomate: An Experiment for the Comparison of Two Generations of Android GUI Testing.",
                    "An Analysis of Inheritance Hierarchy Evolution.",
                    "Model-Integrated Queries for the Analysis of Runtime Events: A Controlled Experiment.",
                    "Dealing with Uncertainty in Binary Logistic Regression Fault-proneness Models.",
                    "Practitioner Evaluations on Software Testing Tools.",
                    "A Review of Meta-ethnographies in Software Engineering.",
                    "Automated Classification of Class Role-Stereotypes via Machine Learning.",
                    "Preliminary Evaluation of an Ontology-Based Contextualized Learning System for Software Security.",
                    "Features that Predict the Acceptability of Java and JavaScript Answers on Stack Overflow.",
                    "Comparing the Effectiveness of Using Design and Code Measures in Software Faultiness Estimation.",
                    "Monitoring Technical Debt in an Industrial Setting.",
                    "Problems with Statistical Practice in Human-Centric Software Engineering Experiments.",
                    "A Self-assessment Instrument for Assessing Test Automation Maturity.",
                    "Integrating Agile Practices into Architectural Assumption Management: An Industrial Survey.",
                    "Perceived Relevance of Automatic Code Inspection in End-User Development: A Study on VBA.",
                    "Coding-Data Portability in Systematic Literature Reviews: a W3C's Open Annotation Approach.",
                    "Is the Stack Distance Between Test Case and Method Correlated With Test Effectiveness?",
                    "Evaluation of Open-Source IDE Plugins for Detecting Security Vulnerabilities.",
                    "How do empirical software engineering researchers assess the credibility of practitioner-generated blog posts?",
                    "A Demand-Side Viewpoint to Software Vulnerabilities in WordPress Plugins.",
                    "A Systematic Approach for Identifying Requirement Change Management Challenges: Preliminary Results.",
                    "Use of Personality Tests in Empirical Software Engineering Studies A Review of Ethical Issues.",
                    "A Conceptual Replication on Predicting the Severity of Software Vulnerabilities.",
                    "Towards an Automated Unified Framework to Run Applications for Combinatorial Interaction Testing.",
                    "Attention Please: Consider Mockito when Evaluating Newly Proposed Automated Program Repair Techniques.",
                    "An Empirical Usability Analysis of the Google Authentication API.",
                    "Use of Software Process in Research Software Development: A Survey.",
                    "Understanding the Most In-demand Soft Skills in Requirements Engineering Practice: Insights from Two Focus Groups.",
                    "Do software engineering practitioners cite software testing research in their online articles?: A larger scale replication.",
                    "Eliciting Requirements for Demand Response Service Design to Households: A Pilot Study.",
                    "Contextualizing Research Evidence through Knowledge Translation in Software Engineering.",
                    "Experiences of studying Attention through EEG in the Context of Review Tasks.",
                    "Enabling heterogeneous recommendations in OSS development: what's done and what's next in CROSSMINER.",
                    "A Preliminary Comparison of Using Variability Modeling Approaches to Represent Experiment Families.",
                    "Modern code reviews - Preliminary results of a systematic mapping study.",
                    "Applying the Single Responsibility Principle in Industry: Modularity Benefits and Trade-offs.",
                    "Drivers of Customer Satisfaction in Outsourced Software Development Projects.",
                    "Towards Better Effort Estimation with Cross-Project Defect Prediction Approaches.",
                    "Game of Codes: Towards Learning Java by an Educational Mobile Game Adapted to Female Programming Novices.",
                    "Agile Practices and Motivation: A quantitative study with Brazilian software developers.",
                    "Application of Ensemble Techniques in Predicting Object-Oriented Software Maintainability.",
                    "Fault Aware Software Engineering (FASE): Reducing Code Faults by Controlling Developer Characteristics."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "22nd EASE 2018",
        "info": "Christchurch, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2018",
                "sub_name": "Proceedings of the 22nd International Conference on Evaluation and Assessment in Software Engineering, EASE2018, Christchurch, New Zealand, June 28-29, 2018.",
                "count": 26,
                "papers": [
                    "Interrelating Use Cases and Associated Requirements by Links: An Eye Tracking Study on the Impact of Different Linking Variants on the Reading Behavior.",
                    "Construct Validity in Software Engineering Research and Software Metrics.",
                    "The Role of Rapid Reviews in Supporting Decision-Making in Software Engineering Practice.",
                    "On Different Search Methods for Systematic Literature Reviews and Maps: Experiences from a Literature Search on Validation and Verification of Emergent Behavior.",
                    "Using reasoning markers to select the more rigorous software practitioners' online content when searching for grey literature.",
                    "DevOps Capabilities, Practices, and Challenges: Insights from a Case Study.",
                    "Can you tell me if it smells?: A study on how developers discuss code smells and anti-patterns in Stack Overflow.",
                    "Linking User Requests, Developer Responses and Code Changes: Android OS Case Study.",
                    "Using Bayesian Network to estimate the value of decisions within the context of Value-Based Software Engineering.",
                    "Bug Localization with Semantic and Structural Features using Convolutional Neural Network and Cascade Forest.",
                    "Satisfaction, Practices, and Influences in Agile Software Development.",
                    "Task Interruption in Software Development Projects: What Makes some Interruptions More Disruptive than Others?",
                    "Evolving Project based Learning to Suit Diverse Student Cohorts.",
                    "An Inception Architecture-Based Model for Improving Code Readability Classification.",
                    "How do Secondary Studies in Software Engineering report Automated Searches?: A Preliminary Analysis.",
                    "Do software engineering practitioners cite research on software testing in their online articles?: A preliminary survey.",
                    "Power and Politics of User Involvement in Software Development.",
                    "A Systematic Mapping Study On Software Startups Education.",
                    "A Process for Evidence-Based Engineering of Domain-Specific Languages.",
                    "Two Sides of the Same Coin: Software Developers' Perceptions of Task Switching and Task Interruption.",
                    "Toward Understanding IoT Developers in Chinese Startups.",
                    "Usability Evaluation Framework for Mobile Apps using Code Analysis.",
                    "Assessing the Effect of Device-Based Test Scheduling on Heterogeneous Test Suite Execution.",
                    "Leveraging the Mob Mentality: An Experience Report on Mob Programming.",
                    "Why Johnny Can't Store Passwords Securely?: A Usability Evaluation of Bouncycastle Password Hashing.",
                    "Why developers cannot embed privacy into software systems?: An empirical investigation."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "21st EASE 2017",
        "info": "Karlskrona, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2017",
                "sub_name": "Proceedings of the 21st International Conference on Evaluation and Assessment in Software Engineering, EASE 2017, Karlskrona, Sweden, June 15-16, 2017.",
                "count": 50,
                "papers": [
                    "On the Use of Ontologies in Software Process Assessment: A Systematic Literature Review.",
                    "Software Interoperability Analysis in Practice: A Survey.",
                    "Choosing the Right Test Automation Tool: a Grey Literature Review of Practitioner Sources.",
                    "Operationalizing the Experience Factory for Effort Estimation in Agile Processes.",
                    "On the Evaluation of Effort Estimation Models.",
                    "Effort and Cost in Software Engineering: A Comparison of Two Industrial Data Sets.",
                    "Change Prediction through Coding Rules Violations.",
                    "What industry wants from academia in software testing?: Hearing practitioners' opinions.",
                    "Hands-Free Research Workflow.",
                    "Defect Triage Meetings: Challenges and Lessons Learned: Extended Abstract.",
                    "A Comparative Study of Model-Driven Approaches For Scoping and Planning Experiments.",
                    "ConfTest: Generating Comprehensive Misconfiguration for System Reaction Ability Evaluation.",
                    "Effectiveness Assessment of an Early Testing Technique using Model-Level Mutants.",
                    "Attributes that Predict which Features to Fix: Lessons for App Store Mining.",
                    "A Machine Learning Approach for Semi-Automated Search and Selection in Literature Studies.",
                    "Reporting Statistical Validity and Model Complexity in Machine Learning based Computational Studies.",
                    "Exploring the outsourcing relationship in software startups: A multiple case study.",
                    "Evaluating Software Architecture Evaluation Methods: An Internal Replication.",
                    "On the Benefits/Limitations of Agile Software Development: An Interview Study with Brazilian Companies.",
                    "How are Conceptual Models used in Industrial Software Development?: A Descriptive Survey.",
                    "Experience-based guidelines for effective and efficient data extraction in systematic reviews in software engineering.",
                    "Crowdsourced Knowledge on Stack Overflow: A Systematic Mapping Study.",
                    "A Method for Assessing Class Change Proneness.",
                    "Easier Said Than Done: Diagnosing Misconfiguration via Configuration Constraints Analysis: A Study of the Variance of Configuration Constraints in Source Code.",
                    "An Exploratory Study of Functionality and Learning Resources of Web APIs on ProgrammableWeb.",
                    "ASM.br: A Template for Specifying Indicators.",
                    "Using Metrics to Track Code Review Performance.",
                    "Industry-academia collaborations in software engineering: An empirical analysis of challenges, patterns and anti-patterns in research projects.",
                    "Interactive Posters: An Alternative to Collect Practitioners' Experience.",
                    "Exploring Automatic Search in Digital Libraries: A Caution Guide for Systematic Reviewers.",
                    "Towards Confidence with Capture-recapture Estimation: An Exploratory Study of Dependence within Inspections.",
                    "Guidelines for utilizing change impact analysis when estimating effort in agile software development.",
                    "Comparing Communication Effort within the Scrum, Scrum with Kanban, XP, and Banana Development Processes.",
                    "A quasi-experiment to evaluate the impact of mental fatigue on study selection process.",
                    "How to Reduce Software Development Cost with Personnel Assignment Optimization: Exemplary Improvement on the Hungarian Algorithm.",
                    "Toward the use of blog articles as a source of evidence for software engineering research.",
                    "Investigating developers' email discussions during decision-making in Python language evolution.",
                    "The Links Between Agile Practices, Interpersonal Conflict, and Perceived Productivity.",
                    "Revisiting Assert Use in GitHub Projects.",
                    "On Using Active Learning and Self-training when Mining Performance Discussions on Stack Overflow.",
                    "Cataloging GitHub Repositories.",
                    "Preliminary Study on Applying Semi-Supervised Learning to App Store Analysis.",
                    "On the Unhappiness of Software Developers.",
                    "Alignment of Stakeholder Expectations about User Involvement in Agile Software Development.",
                    "Automatic Classification of Non-Functional Requirements from Augmented App User Reviews.",
                    "What Do We Know about Alignment of Requirements Engineering and Software Testing?",
                    "A systematic review on the use of Definition of Done on agile software development projects.",
                    "A Two-staged Survey on Release Readiness.",
                    "Adopting Continuous Delivery and Deployment: Impacts on Team Structures, Collaboration and Responsibilities.",
                    "Motivation and Autonomy in Global Software Development: An Empirical Study."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "20th EASE 2016",
        "info": "Limerick, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2016",
                "sub_name": "Proceedings of the 20th International Conference on Evaluation and Assessment in Software Engineering, EASE 2016, Limerick, Ireland, June 01 - 03, 2016.",
                "count": 43,
                "papers": [
                    "The impact of agile methods on the development of an agile culture: research proposal: [the agile evolution].",
                    "Towards a better understanding of simplicity in Agile software development projects.",
                    "Episodic volunteering in open source communities.",
                    "Remedying knowledge loss in free/libre open source software.",
                    "Using different characteristics of machine learners to identify different defect families.",
                    "Integrating evidence from systematic reviews with software engineering practice through evidence briefings.",
                    "A study of the state-of-the-art of PaaS interoperability.",
                    "Personalised technical support for text-based interactions: a validation study.",
                    "Quantifying the ramp-up problem in software projects.",
                    "Evaluating random mutant selection at class-level in projects with non-adequate test suites.",
                    "Slope-based fault-proneness thresholds for software engineering measures.",
                    "The jinx on the NASA software defect data sets.",
                    "A critical analysis of studies that address the use of text mining for citation screening in systematic reviews.",
                    "Second-generation systematic literature studies using snowballing.",
                    "Benefits and limitations of job rotation in software organizations: a systematic literature review.",
                    "Evidence-based software portfolio management: a tool description and evaluation.",
                    "A review-based comparative study of bad smell detection tools.",
                    "An empirical study on independence-driven data selection for improving capture-recapture estimation.",
                    "An integrated tool environment for experimentation in domain specific language engineering.",
                    "Improvements in the StArt tool to better support the systematic review process.",
                    "Beyond the spreadsheet: reflections on tool support for literature studies.",
                    "Validating software measures using action research a method and industrial experiences.",
                    "TDTool: threshold derivation tool.",
                    "Using the SCAS strategy to perform the initial selection of studies in systematic reviews: an experimental study.",
                    "The need for multivocal literature reviews in software engineering: complementing systematic literature reviews with grey literature.",
                    "Improving vulnerability detection measurement: [test suites and software security assurance].",
                    "The power of single and error annotations in category partition testing: an experimental evaluation.",
                    "IBM's smarter care: challenges and strategies.",
                    "What we have learnt adopting evidence-based software engineering for industrial practice.",
                    "An exploratory study on the effects of perceived value and stakeholder satisfaction on software projects.",
                    "A systematic mapping study on requirements scoping.",
                    "Approaches for prioritizing feature improvements extracted from app reviews.",
                    "Characteristics of decision-making during coding.",
                    "Capturing cost avoidance through reuse: systematic literature review and industrial evaluation.",
                    "Practice and perception of team code ownership.",
                    "An empirical analysis of reopened bugs based on open source projects.",
                    "Reporting usability defects: do reporters report what software developers need?",
                    "Usage, usefulness and quality of defect reports: an industrial case study.",
                    "A replication study on the effects of weighted moving windows for software effort estimation.",
                    "Realistic assessment of software effort estimation models.",
                    "Improving expert prediction of issue resolution time.",
                    "Exploring decision-making processes in Python.",
                    "Social theory for software engineering research."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "19th EASE 2015",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2015",
                "sub_name": "Proceedings of the 19th International Conference on Evaluation and Assessment in Software Engineering, EASE 2015, Nanjing, China, April 27-29, 2015.",
                "count": 34,
                "papers": [
                    "Robust statistical methods: why, what and how: keynote.",
                    "Selecting research methods for studying a participatory culture in software development: keynote.",
                    "Supporting architecture documentation: a comparison of two ontologies for knowledge retrieval.",
                    "An empirical analysis of the utilization of multiple programming languages in open source projects.",
                    "Strategies for consistency checking on software product lines: a mapping study.",
                    "Predicting concurrency bugs: how many, what kind and where are they?",
                    "A cross-platform analysis of bugs and bug-fixing in open source projects: desktop vs. Android vs. iOS.",
                    "Applying clustering to analyze opinion diversity.",
                    "Problems and challenges of user involvement in software development: an empirical study.",
                    "Fault density analysis of object-oriented classes in presence of code clones.",
                    "On the effects of traceability links in differently sized software systems.",
                    "Effort estimation in agile software development: a survey on the state of the practice.",
                    "Development of flexible software process lines with variability operations: a longitudinal case study.",
                    "Quality assessment of systematic reviews in software engineering: a tertiary study.",
                    "The adoption of capture-recapture in software engineering: a systematic literature review.",
                    "A controlled experiment for the empirical evaluation of safety analysis techniques for safety-critical software.",
                    "Experiences from using snowballing and database searches in systematic literature studies.",
                    "Analyzing confidentiality and privacy concerns: insights from Android issue logs.",
                    "Case consistency: a necessary data quality property for software engineering data sets.",
                    "An empirical assessment of Bellon's clone benchmark.",
                    "Software metrics for measuring the understandability of architectural structures: a systematic mapping study.",
                    "Support mechanisms to conduct empirical studies in software engineering: a systematic mapping study.",
                    "Systematic review toolbox: a catalogue of tools to support systematic reviews.",
                    "SESRA: a web-based automated tool to support the systematic literature review process.",
                    "On the effects of programming and testing skills on external quality and productivity in a test-driven development context.",
                    "Tools to support systematic reviews in software engineering: a cross-domain survey using semi-structured interviews.",
                    "Analyzing program readability based on WordNet.",
                    "Understanding differences in process perspectives between developers and acquirers in off-the-shelf-based custom software projects undertaken in Indonesia.",
                    "The impact of students' skills and experiences on empirical results: a controlled experiment with undergraduate and graduate students.",
                    "Environment modeling in model-based testing: concepts, prospects and research challenges: a systematic literature review.",
                    "Identifying the factors that influence task allocation in global software development: preliminary results.",
                    "Using blind analysis for software engineering experiments.",
                    "Towards an automation of the traceability of bugs from development logs: a study based on open source software.",
                    "Customer satisfaction feedback in an IT outsourcing company: a case study on the insigma Hengtian company."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "18th EASE 2014",
        "info": "London, England, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2014",
                "sub_name": "18th International Conference on Evaluation and Assessment in Software Engineering, EASE '14, London, England, United Kingdom, May 13-14, 2014.",
                "count": 59,
                "papers": [
                    "Practitioners' and researchers' expectations on design space exploration for multicore systems in the automotive and avionics domains: a survey.",
                    "Survey on research synthesis in software engineering.",
                    "In quest for requirements engineering oracles: dependent variables and measurements for (good) RE.",
                    "A visual analysis approach to update systematic reviews.",
                    "A systematic literature review for agile development processes and user centred design integration.",
                    "UML consistency rules: a systematic mapping study.",
                    "How do software developers experience team performance in lean and agile environments?",
                    "Automatic extraction of developer expertise.",
                    "Evaluating software merge quality.",
                    "An empirical investigation of the factors affecting agile usage.",
                    "Knowledge sharing for common understanding of technical specifications through artifactual culture.",
                    "Cross- vs. within-company cost estimation studies revisited: an extended systematic review.",
                    "Tools to support systematic reviews in software engineering: a feature analysis.",
                    "Systematic mapping study on software engineering for sustainability (SE4S).",
                    "A systematic mapping study on serious game quality.",
                    "A systematic literature review of traceability approaches between software architecture and source code.",
                    "An empirical assessment of polyglot-ism in GitHub.",
                    "Replication types: towards a shared taxonomy.",
                    "Crowdsourcing software evaluation.",
                    "An empirical investigation on MPI open source applications.",
                    "Concerns in software development: a systematic mapping study.",
                    "Conformance factor in test-driven development: initial results from an enhanced replication.",
                    "A controlled experiment to evaluate the effectiveness and the efficiency of four static program analysis tools for Java programs.",
                    "Evidence of the presence of bias in subjective metrics: analysis within a family of experiments.",
                    "Essence reflection meetings: field study.",
                    "Using logistic regression to estimate the number of faulty software modules.",
                    "Investigating a conceptual construct for software context.",
                    "Communication of software cost estimates.",
                    "Software paradigms, assessment types and non-functional requirements in model-based integration testing: a systematic literature review.",
                    "Agile practices in practice: a mapping study.",
                    "Outcomes of a community workshop to identify and rank barriers to the systematic literature review process.",
                    "Exploring the relationships between the understandability of components in architectural component models and component level metrics.",
                    "Investigating code reading techniques for novice inspectors: an industrial case study.",
                    "Software structure evolution and relation to system defectiveness.",
                    "Quality control practice based on design artifacts categories: results from a case study.",
                    "Assembling multiple-case studies: potential, principles and practical considerations.",
                    "Investigations about replication of empirical studies in software engineering: preliminary findings from a mapping study.",
                    "Guidelines for snowballing in systematic literature studies and a replication in software engineering.",
                    "Code ownership in open-source software.",
                    "Is there a place for qualitative studies when identifying effort predictors?: a case in web effort estimation.",
                    "Walk before you run: using heuristic evaluation to assess a training tool prototype.",
                    "Artifacts of software reference architectures: a case study.",
                    "Preliminary comparison of techniques for dealing with imbalance in software defect prediction.",
                    "Modelling software engineering research with RSML.",
                    "Personality profiles of global software developers.",
                    "Controlled experiments comparing fault-tree-based safety analysis techniques.",
                    "Perspective based risk analysis - a controlled experiment.",
                    "Dealing with identifiers and comments in source code comprehension and maintenance: results from an ethnographically-informed study with students and professionals.",
                    "On the effect of using SysML requirement diagrams to comprehend requirements: results from two controlled experiments.",
                    "An experimental evaluation of test driven development vs. test-last development with industry professionals.",
                    "Identifying performance issues based on method invocation patterns of an API.",
                    "Understanding collaboration in the open-source arena: the cases of WebKit and OpenStack.",
                    "Research proposal: objective evaluation of object oriented design quality.",
                    "Feature weighting for case-based reasoning software project effort estimation.",
                    "An empirically derived personalisation framework for technical support.",
                    "Together we are stronger: facilitating the conduction of distributed human-oriented experiments.",
                    "On collecting and validating UML consistency rules: a research proposal.",
                    "Software evaluation via users' feedback at runtime.",
                    "Towards a novel testing approach for holonic agents."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "17th EASE 2013",
        "info": "Porto de Galinhas, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2013",
                "sub_name": "17th International Conference on Evaluation and Assessment in Software Engineering, EASE '13, Porto de Galinhas, Brazil, April 14-16, 2013.",
                "count": 31,
                "papers": [
                    "Applying theory of reasoned action in the context of software development practices: insights into team intention and behavior.",
                    "Realising web effort estimation: a qualitative investigation.",
                    "Evaluating usage and quality of technical software documentation: an empirical study.",
                    "What do game developers expect from development and design tools?",
                    "A case study on effectively identifying technical debt.",
                    "An exploratory study to investigate the impact of conceptualization in god class detection.",
                    "Are forward designed or reverse-engineered UML diagrams more helpful for code maintenance?: a controlled experiment.",
                    "An externally replicated experiment to evaluate software testing methods.",
                    "A novel approach for discovering barriers in using automatic static analysis.",
                    "A conceptual model to address threats to validity in controlled experiments.",
                    "A review of research on risk analysis methods for IT systems.",
                    "Evidence in software architecture, a systematic literature review.",
                    "A systematic review of design diversity-based solutions for fault-tolerant SOAs.",
                    "Sustained agile usage: a systematic literature review.",
                    "User involvement in software development and system success: a systematic literature review.",
                    "Using CBR and CART to predict maintainability of relational database-driven software applications.",
                    "Empirical studies for innovation dissemination: ten years of experience.",
                    "Ontologies supporting the distributed software development: a systematic mapping study.",
                    "A mapping study on method engineering: first results.",
                    "Data quality in empirical software engineering: a targeted review.",
                    "A tertiary study: experiences of conducting systematic literature reviews in software engineering.",
                    "Naming the pain in requirements engineering: design of a global family of surveys and first results from Germany.",
                    "Towards understanding software change request assignment: a survey with practitioners.",
                    "An empirical study on investigating the role of KMS in promoting trust within GSD teams.",
                    "Towards high performance software teamwork.",
                    "An ecological perspective towards the evolution of quantitative studies in software engineering.",
                    "A strong focus on low price when selecting software providers increases the likelihood of failure in software outsourcing projects.",
                    "The true role of active communicators: an empirical study of Jazz core developers.",
                    "Adopting softer approaches in the study of repository data: a comparative analysis.",
                    "Reflexivity, Raymond, and the success of open source software development: a SourceForge empirical study.",
                    "Cloud testing framework."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "16th EASE 2012",
        "info": "Ciudad Real, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2012",
                "sub_name": "16th International Conference on Evaluation & Assessment in Software Engineering, EASE 2012, Ciudad Real, Spain, May 14-15, 2012. Proceedings.",
                "count": 38,
                "papers": [
                    "Empirical models: Towards a science of software engineering.",
                    "Systematic literature reviews in global software development: A tertiary study.",
                    "Preliminary results of a systematic review on requirements evolution.",
                    "Causes of requirement change - A systematic literature review.",
                    "Sustainability in software engineering: A systematic literature review.",
                    "A systematic mapping study on the open source software development process.",
                    "A study on Risk Management for software engineering.",
                    "A systematic review on the effectiveness of web usability evaluation methods.",
                    "A mapping study of the definitions used for Service Oriented Architecture.",
                    "An initial evaluation of requirements dependency types in change propagation analysis.",
                    "Towards an explanatory theory of motivation in software engineering: A qualitative case study of a government organization.",
                    "Understanding Lack of Trust in Distributed Agile Teams: A grounded theory study.",
                    "Maturity of software modelling and model driven engineering: A survey in the Italian industry.",
                    "Evaluating methods and technologies in software engineering with Respect to Developers' skill level.",
                    "Evaluation of traceability recovery in context: A taxonomy for information retrieval tools.",
                    "The influence of human aspects on software process improvement: Qualitative research findings and comparison to previous studies.",
                    "Mapping study completeness and reliability - a case study.",
                    "Pattern-based guideline to empirically analyse software development processes.",
                    "On integrating student empirical software engineering studies with research and teaching goals.",
                    "Reporting guidelines for simulation-based studies in software engineering.",
                    "Towards a unified checklist for empirical research in software engineering: first proposal.",
                    "GlobReq: A framework for improving requirements engineering in global software development projects: Preliminary results.",
                    "Towards evidence-based ontology for supporting Systematic Literature Review.",
                    "Using ethnography in empirical software engineering.",
                    "An experimental setup to assess design diversity of functionally equivalent services.",
                    "Using the ISO/IEC 9126 product quality model to classify defects: A controlled experiment.",
                    "A study of the effectiveness of two threshold definition techniques.",
                    "Software effort estimation with a generalized robust linear regression technique.",
                    "First impressions in software development effort estimation: Easy to create and difficult to neutralize.",
                    "Test case quality in test driven development: A study design and a pilot experiment.",
                    "Does the use of Fibonacci numbers in planning poker affect effort estimates?",
                    "Risks of off-the-shelf-based software acquisition and development: A systematic mapping study and a survey.",
                    "Risk Management in software engineering: A scoping study.",
                    "Aspect-oriented software maintenance metrics: A systematic mapping study.",
                    "Maintainability prediction of relational database-driven applications: A systematic review.",
                    "A mapping study of software code cloning.",
                    "Development of maturity models: A systematic literature review.",
                    "What agile ERP consultants think of requirements engineering for inter-organizational ERP Systems: Insights from a Focus Group in BeNeLux."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "15th EASE 2011",
        "info": "Durham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2011",
                "sub_name": "15th International Conference on Evaluation & Assessment in Software Engineering, EASE 2011, Durham, UK, 11-12 April 2011, Proceedings.",
                "count": 20,
                "papers": [
                    "Personality in software engineering: Preliminary findings from a systematic literature review.",
                    "Adopting software product lines: A systematic mapping study.",
                    "Systematic literature review: Teaching novices programming using robots.",
                    "Linked data approach for selection process automation in systematic reviews.",
                    "Comparative analysis of meta-analysis methods: When to use which?",
                    "Repeatability of systematic literature reviews.",
                    "An empirical assessment of a systematic search process for systematic reviews.",
                    "Using background colors to support program comprehension in software product lines.",
                    "On the effectiveness of the UML object diagrams: A replicated experiment.",
                    "Systematic analysis of the incremental process as a base for comparison with the Agile process.",
                    "Software engineering researchers' attitudes on case studies and experiments: An exploratory survey.",
                    "The misuse of the NASA metrics data program data sets for automated software defect prediction.",
                    "A case study on the application of an artefact-based requirements engineering approach.",
                    "An empirical evaluation of requirement engineering techniques for collaborative systems.",
                    "Designing human benchmark experiments for testing software agents.",
                    "Further thoughts on precision.",
                    "An extended systematic review of software process improvement in small and medium Web companies.",
                    "An empirical validation of FindBugs issues related to defects.",
                    "Motivation in software engineering: A systematic review update.",
                    "Security at software architecture level: A systematic mapping study."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "14th EASE 2010",
        "info": "Keele University, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2010",
                "sub_name": "14th International Conference on Evaluation and Assessment in Software Engineering, EASE 2010, Keele University, UK, 12-13 April 2010.",
                "count": 17,
                "papers": [
                    "Field Study on Requirments Engineering Artefacts and Patterns.",
                    "Requirements Management for Continuous Software Product Development.",
                    "Investigating effort prediction of web-based applications using CBR on the ISBSG dataset.",
                    "The value of mapping studies - A participant-observer case study.",
                    "An Approach Based on Visual Text Mining to Support Categorization and Classification in the Systematic Mapping.",
                    "Experiences Conducting Systematic Reviews from Novices' Perspective.",
                    "Evaluating Tools that Support Pair Programming in a Distributed Engineering Environment.",
                    "Alignment of Software Product Quality Goals in Two Outsourcing Relationships.",
                    "Models and Tools for Managing Distributed Software Development: A Systematic Literature Review.",
                    "Software Development Outsourcing Relationships Trust: A Systematic Literature Review Protocol.",
                    "The Effect of Reasoning Strategies on Success in Early Learning of Programming: Lessons Learned from an External Experiment Replication.",
                    "Identifying Architectural Patterns Used in Open Source Software: Approaches and Challenges.",
                    "A Controlled Experiment on Team Meeting Style in Software Architecture Evaluation.",
                    "On Searching Relevant Studies in Software Engineering.",
                    "A Systematic Review of Research on Open Source Software in Commercial Software Product Development.",
                    "SCRUM and Productivity in Software Projects: A Systematic Literature Review.",
                    "Towards an Evidence-Based Understanding of Electronic Data Sources."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "13th EASE 2009",
        "info": "Durham University, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2009",
                "sub_name": "13th International Conference on Evaluation and Assessment in Software Engineering, EASE 2009, Durham University, UK, 20-21 April 2009.",
                "count": 16,
                "papers": [
                    "Empirical Support for Two Refactoring Studies Using Commercial C# Software.",
                    "Investigating the Use of Chronological Splitting to Compare Software Cross-company and Single-company Effort Predictions: A Replicated Study.",
                    "Empirical Validation of a Requirements Engineering Process Guide.",
                    "Reference-based search strategies in systematic reviews.",
                    "Building an Expert-based Web Effort Estimation Model using Bayesian Networks.",
                    "Does an 80: 20 rule apply to Java coupling?",
                    "An Evaluation of Quality Checklist Proposals - A participant-observer case study.",
                    "Preliminary Reporting Guidelines for Experience Papers.",
                    "Factors Explaining External Quality in 54 Case Studies of Software Development Projects.",
                    "Using systematic reviews and evidence-based software engineering with masters students.",
                    "Harmfulness of Code Duplication - A Structured Review of the Evidence.",
                    "An assessment of published evaluations of requirements management tools.",
                    "A Literature Review of Expert Problem Solving using Analogy.",
                    "A Status Report on the Evaluation of Variability Management Approaches.",
                    "A Quality Checklist for Technology-Centred Testing Studies.",
                    "Using Process Mining Metrics to Measure Noisy Process Fidelity."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "12th EASE 2008",
        "info": "University of Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2008",
                "sub_name": "12th International Conference on Evaluation and Assessment in Software Engineering, EASE 2008, University of Bari, Italy, 26-27 June 2008.",
                "count": 18,
                "papers": [
                    "Impact of Experience and Team Size on the Quality of Scenarios for Architecture Evaluation.",
                    "An Evaluation of Function Point Counting Based on Measurement-Oriented Models.",
                    "Maximizing data retention from the ISBSG repository.",
                    "Comparing Inspection Methods using Controlled Experiments.",
                    "Using a Protocol Template for Case Study Planning.",
                    "Flexibility in Research Designs in Empirical Software Engineering.",
                    "Empirical WebGen; A Web-Based Environment for the Automatic Generation of Surveys and Experiments.",
                    "Systematic Mapping Studies in Software Engineering.",
                    "A follow-up empirical evaluation of evidence based software engineering by undergraduate students.",
                    "Lessons from a cross domain investigation of empirical practices.",
                    "Patterns of Evolution in the Practice of Distributed Software Development: Quantitative Results from a Systematic Review.",
                    "Lessons learnt Undertaking a Large-scale Systematic Literature Review.",
                    "Adopting Curvilinear Component Analysis to Improve Software Cost Estimation Accuracy Model, Application Strategy, and an Experimental Verification.",
                    "A Preliminary Study of Sequence Effects in Judgment-based Software Development Work-Effort Estimation.",
                    "Investigating the Use of Chronological Splitting to Compare Software Cross-company and Single-company Effort Predictions.",
                    "Evaluating Structural Criteria for Testing Mobile Code.",
                    "Assessment of a Framework for Designing and Evaluating Security Sensitive Architecture.",
                    "A Correlational Study on Four Measures of Requirements Volatility."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11th EASE 2007",
        "info": "Keele University, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ease/2007",
                "sub_name": "11th International Conference on Evaluation and Assessment in Software Engineering, EASE 2007, Keele University, UK, 2-3 April 2007.",
                "count": 11,
                "papers": [
                    "Experimental Comparison of the Comprehensibility of a UML-based Formal Specification versus a Textual One.",
                    "Assessment of a Framework for Comparing Software Architecture Analysis Methods.",
                    "Feature Selection and Clustering in Software Quality Prediction.",
                    "Predicting Short-Term Defect Inflow in Large Software Projects - An Initial Evaluation.",
                    "An Experiment Measuring the Effects of Maintenance Tasks on Program Knowledge.",
                    "Outsourcing and Knowledge Management in Software Testing.",
                    "Preliminary results of a study of the completeness and clarity of structured abstracts.",
                    "A Framework for Effort Management in Software Projects.",
                    "Predicting Web Development Effort Using a Bayesian Network.",
                    "Systematic Review of Statistical Process Control: An Experience Report.",
                    "Motivators of Software Process Improvement: An Analysis of Vietnamese Practitioners' Views."
                ]
            }
        ]
    }
]