[
    {
        "name": "EJIS",
        "year": "2021",
        "info": "Volume 30: 2021",
        "count": 37,
        "papers": [
            "The way forward.",
            "Digital M&A, digital innovation, and firm performance: an empirical investigation.",
            "Using susceptibility claims to motivate behaviour change in IT security.",
            "Taking the human body seriously.",
            "Adjusting to epidemic-induced telework: empirical insights from teleworkers in France.",
            "Productive and connected while working from home: what client-facing remote workers can learn from telenurses about 'belonging through technology'.",
            "When your data has COVID-19: how the changing context disrupts data collection and what to do about it.",
            "The show must go on - virtualisation of sport events during the COVID-19 pandemic.",
            "Transformative rare events: Leveraging digital affordance actualisation.",
            "Designing for the future in the age of pandemics: a future-ready design research (FRDR) process.",
            "Preventing the digital scars of COVID-19.",
            "Partnering for prosperity: small IT vendor partnership formation and the establishment of partner pools.",
            "Curbing cyberloafing: studying general and specific deterrence effects with field evidence.",
            "Complementor dedication in platform ecosystems: rule adequacy and the moderating role of flexible and benevolent practices.",
            "Bitcoin investment: a mixed methods study of investment motivations.",
            "A proposal for minimum reusability evaluation of design principles.",
            "Introducing platform ecosystem resilience: leveraging mobility platforms and their ecosystems for the new normal during COVID-19.",
            "Impact of mobile connectivity and freedom on fake news propensity during the COVID-19 pandemic: a cross-country empirical examination.",
            "Accounting for social media effects to improve the accuracy of infection models: combatting the COVID-19 pandemic and infodemic.",
            "Is there a shift from positivity to negativity about technology in the field of IS?",
            "Small business digital transformation in the context of the pandemic.",
            "Combating COVID-19 fake news on social media through fact checking: antecedents and consequences.",
            "Privacy concerns and digital government: exploring citizen willingness to adopt the COVIDSafe app.",
            "Smartphone Addiction and Conflict: An Incentive-Sensitisation Perspective of Addiction for Information Systems.",
            "Ownership and governance, scope, and empowerment: how does context affect enterprise systems implementation in organisations in the Arab World?",
            "Sustainability Design Principles for a Wildlife Management Analytics System: An Action Design Research.",
            "EJIS moving up in the rankings.",
            "Improving the state-tracking ability of corona dashboards.",
            "Validating the coevolutionary principles of business and IS alignment via agent-based modeling.",
            "IT architecture flexibility and IT governance decentralisation as drivers of IT-enabled dynamic capabilities and competitive performance: The moderating effect of the external environment.",
            "Design principles for learning analytics information systems in higher education.",
            "From semantics to pragmatics: where IS can lead in Natural Language Processing (NLP) research.",
            "Exposing patterns of adult solicitor behaviour: towards a theory of control within the cybersexual abuse of youth.",
            "Knowledge sharing in two cultures: the moderating effect of national culture on perceived knowledge quality in online communities.",
            "Complementary Technology Traces in Software Practice: A Retrospective Reflection over Sixteen Years of Evolution at Ericsson.",
            "Instrumental aspects of play at work in information technology organisations.",
            "Digital transformation in family-owned Mittelstand firms: A dynamic capabilities perspective."
        ]
    },
    {
        "name": "EJIS",
        "year": "2020",
        "info": "Volume 29: 2020",
        "count": 45,
        "papers": [
            "Artificial intelligence as digital agency.",
            "Advancing a NeuroIS research agenda with four areas of societal contributions.",
            "IT value creation in public sector: how IT-enabled capabilities mitigate tradeoffs in public organisations.",
            "Conceptualisation and validation of system use reduction as a self-regulatory IS use behaviour.",
            "Building on shaky foundations? Lack of falsification and knowledge contestation in IS theories, methods, and practices.",
            "IT-based reminders for medication adherence: systematic review, taxonomy, framework and research directions.",
            "Artefactual and empirical contributions in information systems research.",
            "Feedback at scale: designing for accurate and timely practical digital skills evaluation.",
            "The impact of control styles and control modes on individual-level outcomes: a first test of the integrated IS project control theory.",
            "Gamifying knowledge sharing in humanitarian organisations: a design science journey.",
            "The complementarity of autonomy and control in mobile work.",
            "Detection of early warning signals for overruns in IS projects: linguistic analysis of business case language.",
            "Information systems in the age of pandemics: COVID-19 and beyond.",
            "Building a complementary agenda for business process management and digital innovation.",
            "Architectural alignment of process innovation and digital infrastructure in a high-tech hospital.",
            "Digital transformation and the new logics of business process management.",
            "Examining the interplay between big data analytics and contextual factors in driving process innovation capabilities.",
            "What drives unverified information sharing and cyberchondria during the COVID-19 pandemic?",
            "A multi-level influence model of COVID-19 themed cybercrime.",
            "IT-enabled innovation in the public sector: introduction to the special issue.",
            "Efficiency creep and shadow innovation: enacting ambidextrous IT Governance in the public sector.",
            "Exploring smartness in public sector innovation - creating smart public services with the Internet of Things.",
            "Enabling collaboration and innovation in Denver's smart city through a living lab: a social capital perspective.",
            "Chasing John Snow: data analytics in the COVID-19 era.",
            "Information Technology and the pandemic: a preliminary multinational analysis of the impact of mobile tracking technology on the COVID-19 contagion control.",
            "One app to trace them all? Examining app specifications for mass acceptance of contact-tracing apps.",
            "An affordance perspective of team collaboration and enforced working from home during COVID-19.",
            "The evolution of software development orchestration: current state and an agenda for future research.",
            "Understanding how DevOps aligns development and operations: a tripartite model of intra-IT alignment.",
            "Orchestrating automation and sharing in DevOps teams: a revelatory case of job satisfaction factors, risk and work conditions.",
            "Ideological shifts in open source orchestration: examining the influence of licence choice and organisational participation on open source project outcomes.",
            "Effects of peers and network position on user participation in a firm-hosted software community: the moderating role of network centrality.",
            "Contact-tracing apps and alienation in the age of COVID-19.",
            "Virtually in this together - how web-conferencing systems enabled a new virtual togetherness during the COVID-19 crisis.",
            "Resilience against crises: COVID-19 and lessons from natural disasters.",
            "Containing COVID-19 through physical distancing: the impact of real-time crowding information.",
            "Desperately seeking the artefacts and the foundations of native theory in gamification research: why information systems researchers can play a legitimate role in this discourse and how they can better contribute.",
            "From Elements to Structures: An Agenda for Organisational Gamification.",
            "Capturing the complexity of gamification elements: a holistic approach for analysing existing and deriving novel gamification designs.",
            "Choose your own training adventure: designing a gamified SETA artefact for improving information security and privacy through interactive storytelling.",
            "Ingredients for successful badges: evidence from a field experiment in bike commuting.",
            "Effects of structural and trait competitiveness stimulated by points and leaderboards on user engagement and performance growth: A natural experiment with gamification in an informal learning environment.",
            "Digital contact-tracing adoption in the COVID-19 pandemic: IT governance for collective action at the societal level.",
            "Does the end justify the means?Information systems and control society in the age of pandemics.",
            "Exploitation and exploration of IT in times of pandemic: from dealing with emergency to institutionalising crisis practices."
        ]
    },
    {
        "name": "EJIS",
        "year": "2019",
        "info": "Volume 28: 2019",
        "count": 36,
        "papers": [
            "Stimulating academic discourse: a call for response.",
            "An elaborated action design research process model.",
            "Elaborating ADR while drifting away from its essence: A commentary on Mullarkey and Hevner.",
            "A study of information systems issues, practices, and leadership in Europe.",
            "Directions for research on gender imbalance in the IT profession.",
            "Representing instances: the case for reengineering conceptual modelling grammars.",
            "A nomological network of customers' privacy perceptions: linking artifact design to shopping efficiency.",
            "Thanks to Reviewers.",
            "Being Promethean.",
            "Understanding the role of social networking sites in the subjective well-being of users: a diary study.",
            "The paradoxical effects of digital artefacts on innovation practices.",
            "Social media empowerment in social movements: power activation and power accrual in digital activism.",
            "Critical review of organisation-technology sensemaking: towards technology materiality, discovery, and action.",
            "A generic cloud migration process model.",
            "An affordance lens for wearable information systems.",
            "Arousal, valence, and volume: how the influence of online review characteristics differs with respect to utilitarian and hedonic products.",
            "Determinants and heterogeneity of switching costs in IT outsourcing: estimates from firm-level data.",
            "Designed entrepreneurial legitimacy: the case of a Swedish crowdfunding platform.",
            "How does online interactional unfairness matter for patient-doctor relationship quality in online health consultation? The contingencies of professional seniority and disease severity.",
            "Information as a difference: toward a subjective theory of information.",
            "Assessing the long-term fragmentation of information systems research with a longitudinal multi-network analysis.",
            "Are social bots a real threat? An agent-based model of the spiral of silence to analyse the impact of manipulative actors in social networks.",
            "Enabling service co-production: a theory-building case study.",
            "A multilevel investigation on antecedents for employees' exploration of enterprise systems.",
            "Exploring the impact of IS function maturity and IS planning process on IS planning success: an ACE analysis.",
            "How long can this party last? What the rise and fall of OR/MS can teach us about the future of business analytics.",
            "Technostress and the hierarchical levels of personality: a two-wave study with multiple data samples.",
            "A critical perspective of engagement in online health communities.",
            "Creating \"informating\" systems using Agile development practices: an action research study.",
            "Abductive innovations in information security policy development: an ethnographic study.",
            "Impact of IT offerings strategies and IT integration capability on IT vendor value creation.",
            "Information technology and innovation outcomes: is knowledge recombination the missing link?",
            "Governmental intervention in Hospital Information Exchange (HIE) diffusion: a quasi-experimental ARIMA interrupted time series analysis of monthly HIE patient penetration rates.",
            "IT-leveraged network value cocreation: a case study of the value cocreation process and value capture in the South Korean broadcast advertising industry.",
            "How quickly do we learn conceptual models?",
            "The case for classes and instances - a response to representing instances: the case for reengineering conceptual modelling grammars."
        ]
    },
    {
        "name": "EJIS",
        "year": "2018",
        "info": "Volume 27: 2018",
        "count": 39,
        "papers": [
            "Going through changes.",
            "Knowledge exchange roles and EKR performance impact: extending the theory of knowledge reuse.",
            "Intention-behaviour misalignment at B2C websites: when the horse brings itself to water, will it drink?",
            "Adding background music as new stimuli of interest to information systems research.",
            "Online health communities: how do community members build the trust required to adopt information and form close relationships?",
            "Assessing the robustness of meta-analytic results in information systems: publication bias and outliers.",
            "Thanks to Reviewers.",
            "Whither design science research?",
            "Design science research genres: introduction to the special issue on exemplars and criteria for applicable design science research.",
            "Aesthetics in design science research.",
            "Considering the social impacts of artefacts in information systems design science research.",
            "Design and evaluation of a model-driven decision support system for repurposing electric vehicle batteries.",
            "ERP prototype with built-in task and process support.",
            "Modeling interferences in information systems design for cyberphysical systems: Insights from a smart grid application.",
            "Design principles for sensemaking support systems in environmental sustainability transformations.",
            "An information system design theory for the comparative judgement of competences.",
            "Philosophy and information systems: where are we and where should we go?",
            "The IT artifact and its spirit: a nexus of human values, affordances, symbolic expressions, and IT features.",
            "What's in a face? Making sense of tangible information systems in terms of Peircean semiotics.",
            "A critical realist script for creative theorising in information systems.",
            "From sovereign IT governance to liberal IT governmentality? A Foucauldian analogy.",
            "Phronesis, argumentation and puzzle solving in IS research: illustrating an approach to phronetic IS research practice.",
            "Philosophical foundations for informing the future(S) through IS research.",
            "Being critical is good, but better with philosophy! From digital transformation and values to the future of IS research.",
            "User response to mandatory IT use: a coping theory perspective.",
            "Stakeholders' enactment of competing logics in IT governance: polarization, compromise or synthesis?",
            "Reversed loss aversion in crowdsourcing contest.",
            "Disaggregation of the IT capital effects on firm performance: Empirical evidence from an IT asset portfolio perspective.",
            "The insider on the outside: a novel system for the detection of information leakers in social networks.",
            "Conceptualizing business-to-thing interactions - A sociomaterial perspective on the Internet of Things.",
            "Transparency in literature reviews: an assessment of reporting practices across review types and genres in top IS journals.",
            "The effects of relative and criticism-based performance appraisals on task-level escalation in an IT project: a laboratory experiment.",
            "\"How does tech make you feel?\" a review and examination of negative affective responses to technology use.",
            "Understanding social networking site (SNS) identity from a dual systems perspective: an investigation of the dark side of SNS use.",
            "Taking on sacred cows: openness, fair critique, and retaining value when revising classics.",
            "Opinion seeking in a social network-enabled product review website: a study of word-of-mouth in the era of digital social networks.",
            "Feedback, task performance, and interface preferences.",
            "Designing an Internet-of-Things (IoT) and sensor-based in-home monitoring system for assisting diabetes patients: iterative learning from two case studies.",
            "Population targeted requirements acquisition."
        ]
    },
    {
        "name": "EJIS",
        "year": "2017",
        "info": "Volume 26: 2017",
        "count": 35,
        "papers": [
            "Information systems security policy implementation in practice: from best practices to situated practices.",
            "Mixed results in strategic IT alignment research: a synthesis and empirical study.",
            "Examining the intended and unintended consequences of organisational privacy safeguards.",
            "Useful business cases: value creation in IS projects.",
            "Supporting the design of data integration requirements during the development of data warehouses: a communication theory-based approach.",
            "The concept of mindfulness in information systems research: a multi-dimensional analysis.",
            "The public procurement of information systems: dialectics in requirements specification.",
            "Variable use of standards-based IOS enabling technologies in Australian SMEs: an examination of deliberate and emergent decision making processes.",
            "Interorganizational dependence, information transparency in interorganizational information systems, and supply chain performance.",
            "Conflicts and complements between eastern cultures and agile methods: an empirical investigation.",
            "Digital natives and immigrant editors, and special issues.",
            "Alternative genres in information systems research.",
            "The limits to language in doing systems design.",
            "A narrative approach to publishing information systems research: inspiration from the French New Novel tradition.",
            "\"What else is there...?\": reporting meditations in experiential computing.",
            "A half-moon on my skin: a memoir on life with an activity tracker.",
            "Once upon a time: Crafting allegories to analyze and share the cultural complexity of strategic alignment.",
            "Crowdsourcing of information systems research.",
            "Information quality, user satisfaction, and the manifestation of workarounds: a qualitative and quantitative study of enterprise content management system users.",
            "The funeral industry and the Internet: on the historical emergence and destabilization of strategic paths.",
            "It's complicated: explaining the relationship between trust, distrust, and ambivalence in online transaction relationships using polynomial regression analysis and response surface analysis.",
            "Online product review as an indicator of users' degree of innovativeness and product adoption time: a longitudinal analysis of text reviews.",
            "Constraint-based and dedication-based mechanisms for encouraging online self-disclosure: Is personalization the only thing that matters?",
            "Service robots in hospitals: new perspectives on niche evolution and technology affordances.",
            "Balancing exploration and exploitation of IT resources: the influence of Digital Business Intensity on perceived organizational performance.",
            "Impact of executive compensation on the execution of IT-based environmental strategies under competition.",
            "The role of context in IT assimilation: A multi-method study of a SaaS platform in the US nonprofit sector.",
            "Stimulating dialog between information systems research and practice.",
            "Why security and privacy research lies at the centre of the information systems (IS) artefact: proposing a bold research agenda.",
            "Which phish get caught? An exploratory study of individuals′ susceptibility to phishing.",
            "Taking stock of organisations' protection of privacy: categorising and assessing threats to personally identifiable information in the USA.",
            "Organizational information security policies: a review and research framework.",
            "Antecedents and outcomes of information privacy concerns in a peer context: An exploratory study.",
            "An empirical study on the susceptibility to social engineering in social networking sites: the case of Facebook.",
            "Adverse consequences of access to individuals' information: an analysis of perceptions and the scope of organisational influence."
        ]
    },
    {
        "name": "EJIS",
        "year": "2016",
        "info": "Volume 25: 2016",
        "count": 32,
        "papers": [
            "Twenty years of the European information systems academy at ECIS: emergent trends and research topics.",
            "Economic decision criteria for the migration to cloud storage.",
            "How to get the most from a business intelligence application during the post implementation phase? Deep structure transformation at a U.K. retail bank.",
            "Understanding champion behaviour in a health-care information system development project - how multiple champions and champion behaviours build a coherent whole.",
            "Transforming healthcare: policy discourses of IT and patient-centred care.",
            "FEDS: a Framework for Evaluation in Design Science Research Open.",
            "Factors influencing the intention to comply with data protection regulations in hospitals: based on gender differences in behaviour and deterrence.",
            "Representing small business web presence content: the web presence pyramid model.",
            "Effectiveness of top management support in enterprise systems success: a contingency perspective of fit between leadership style and system life-cycle.",
            "Mindful revolution or mindless trend? Examining agile development as a management fashion.",
            "Handle mergers and acquisitions with care: the fragility of trust between the IT-service provider and end-users.",
            "Measuring eGovernment success: a public value approach.",
            "Achieving dynamic capabilities with cloud computing: an empirical investigation.",
            "Dispositional and situational factors: influences on information security policy violations.",
            "Web assurance seal services, trust and consumers' concerns: an investigation of e-commerce transaction intentions across two nations.",
            "Why different trust relationships matter for information systems users.",
            "Utilizing big data analytics for information systems research: challenges, promises and guidelines.",
            "The inner and the outer model in explanatory design theory: the case of designing electronic feedback systems.",
            "Work routines as an object of resistance during information systems implementations: theoretical foundation and empirical evidence.",
            "Identity metamorphoses in digital disruption: a relational theory of identity.",
            "How users perceive and respond to security messages: a NeuroIS research agenda and empirical study.",
            "The impact of media on how positive, negative, and neutral communicated affect influence unilateral concessions during negotiations.",
            "An empirical analysis of the factors and measures of Enterprise Architecture Management success.",
            "Untangling the complex role of guilt in rational decisions to discontinue the use of a hedonic Information System.",
            "A process explanation of the effects of institutional distance between parties in outsourced information systems development projects.",
            "Four common multicommunicating misconceptions.",
            "Contextualization and problematization, gamification and affordance: a traveler's reflections on EJIS.",
            "Triggered essential reviewing: the effect of technology affordances on service experience evaluations.",
            "Contextualizing the twin concepts of systematicity and transparency in information systems literature reviews.",
            "Fragmentation or cohesion? Visualizing the process and consequences of information system diversity, 1993-2012.",
            "Collaborative partner or opponent: How the messenger influences the deaf effect in IT projects.",
            "Alignment in an inter-organisational network: the case of ARC transistance."
        ]
    },
    {
        "name": "EJIS",
        "year": "2015",
        "info": "Volume 24: 2015",
        "count": 41,
        "papers": [
            "Challenges in learning and improving continuously.",
            "Associating consumer perceived value with business models for digital services.",
            "Adopting IS process innovations in organizations: the role of IS leaders' individual factors and technology perceptions in decision making.",
            "Managing the introduction of information security awareness programmes in organisations.",
            "The roles of psychological climate, information management capabilities, and IT support on knowledge-sharing: an MOA perspective.",
            "Forming an intention to act on recommendations given via online social networks.",
            "Learning and self-disclosure behavior on social networking sites: the case of Facebook users.",
            "Distinguishing and contrasting two strategies for design science research.",
            "Information system integration in mergers and acquisitions: research ahead.",
            "Learning to acquire: how serial acquirers build organisational knowledge for information systems integration.",
            "When IT capabilities are not scale-free in merger and acquisition integrations: how do capital markets react to IT capability asymmetries between acquirer and target?",
            "The roles of contextual elements in post-merger common platform development: an empirical investigation.",
            "Discovery paths: exploring emergence and IT evolutionary design in cross-border M&As. Analysing grupo Santander's acquisition of abbey (2004-2009).",
            "Knowledge-acquisitions and post-acquisition innovation performance: a comparative hazards model.",
            "Discovery paths: exploring emergence and IT evolutionary design in cross-border M&As. Analysing Grupo Santander's acquisition of Abbey (2004-2009).",
            "Cross-cultural IS research: perspectives from Eastern and Western traditions.",
            "The realignment of offshoring frame disputes (OFD): an ethnographic 'cultural' analysis.",
            "Toward a theory of perceived benefits, affective commitment, and continuance intention in social virtual worlds: cultural values (indulgence and individualism) matter.",
            "Knowledge sharing intention in the United States and China: a cross-cultural study.",
            "A legitimacy challenge of a cross-cultural interorganizational information system.",
            "The effect of culture on requirements: a value-based view of prioritization.",
            "Cross-national differences in individual knowledge-seeking patterns: a climato-economic contextualization.",
            "An espoused cultural perspective to understand continued intention to use mobile applications: a four-country study of mobile social media application usability.",
            "Current issue and future submissions, contextualized.",
            "A unified model of IT continuance: three complementary perspectives and crossover effects.",
            "Five-factor model personality traits as predictors of perceived and actual usage of technology.",
            "The effect of online social value on satisfaction and continued use of social media.",
            "Examining the antecedents of user gratification and its effects on individuals' social network services usage: the moderating role of habit.",
            "Quitting the use of a habituated hedonic information system: a theoretical model and empirical examination of Facebook users.",
            "Giving too much social support: social overload on social networking sites.",
            "Six types of IT-business strategic alignment: an investigation of the constructs and their measurement.",
            "Time and information technology in teams: a review of empirical research and future research directions.",
            "Determinants of software piracy under risk aversion: a model with empirical evidence.",
            "Using quantitative data in mixed-design grounded theory studies: an enhanced path to formal grounded theory in information systems.",
            "Publishing and getting published in EJIS: marshaling contributions for a diversity of genres.",
            "The effective promotion of informal control in information systems offshoring projects.",
            "Personal information management effectiveness of knowledge workers: conceptual development and empirical validation.",
            "The impact of decision support system features on user overconfidence and risky behavior.",
            "The role of privacy assurance mechanisms in building trust and the moderating role of privacy concern.",
            "Flexible generification: ICT standardization strategies and service innovation in health care.",
            "Theoretical perspectives in IS research: from variance and process to conceptual latitude and conceptual fit."
        ]
    },
    {
        "name": "EJIS",
        "year": "2014",
        "info": "Volume 23: 2014",
        "count": 43,
        "papers": [
            "Interpretive accounts and fairy tales: a critical polemic against the empiricist bias in interpretive IS research.",
            "Empiricism in interpretive IS research: a response to Stahl.",
            "Who do you think you are? A review of the complex interplay between information systems, identification and identity.",
            "Users' willingness to pay for web identity management systems.",
            "Interrelationships of identity and technology in IT assimilation.",
            "Organizational identity and information systems: how organizational ICT reflect who an organization is.",
            "Performing embodied identity in virtual worlds.",
            "Why would we care about privacy?",
            "Cultural and generational influences on privacy concerns: a qualitative study in seven European countries.",
            "A systematic methodology for privacy impact assessments: a design science approach.",
            "A process model for analyzing and managing flexibility in information systems.",
            "Understanding online customers' ties to merchants: the moderating influence of trust on the relationship between switching costs and e-loyalty.",
            "Using organizational influence processes to overcome IS implementation barriers: lessons from a longitudinal case study of SPI implementation.",
            "Board-level IT governance and organizational performance.",
            "What literature review is not: diversity, boundaries and recommendations.",
            "Towards mindful case study research in IS: a critical analysis of the past ten years.",
            "Rethinking the place of the artefact in IS using Heidegger's analysis of equipment.",
            "Guidelines for improving the contextual relevance of field surveys: the case of information security policy violations.",
            "Do you see what I see? The search for consensus among executives' perceptions of IT business value.",
            "IT capability and organizational performance: the roles of business process agility and environmental factors.",
            "Blending bureaucratic and collaborative management styles to achieve control ambidexterity in IS projects.",
            "Why end-users move to the cloud: a migration-theoretic analysis.",
            "An empirical evaluation of existing IS change theories for the case of IOIS evolution.",
            "Integrated clinical pathway management for medical quality improvement - based on a semiotically inspired systems architecture Open.",
            "Information sharing and interoperability: the case of major incident management.",
            "Transforming decision-making processes: a research agenda for understanding the impact of business analytics on organisations.",
            "Design matters for decision makers: Discovering IT investment alternatives.",
            "Developing information processing capability for operational agility: implications from a Chinese manufacturer.",
            "The role of GPS-enabled information in transforming operational decision making: an exploratory study.",
            "When mobile is the norm: researching mobile information systems and mobility as post-adoption phenomena.",
            "Changing information retrieval behaviours: an empirical investigation of users' cognitive processes in the choice of location-based services.",
            "Mobile technology in mobile work: contradictions and congruencies in activity systems.",
            "Mobile information systems and organisational control: beyond the panopticon metaphor?",
            "Working with connective flow: how smartphone use is evolving in practice.",
            "An organizational perspective on m-business: usage factors and value determination.",
            "Insufficient theoretical contribution: a conclusive rationale for rejection?",
            "Paradigm lost ... paradigm gained: a hermeneutical rejoinder to Banville and Landry's 'Can the Field of MIS be Disciplined?'.",
            "The competitive impact of information technology: can commodity IT contribute to competitive performance?",
            "No time to waste: the role of timing and complementarity of alignment practices in creating business value in IT projects.",
            "A 'sweet spot' change strategy for a least developed country: leveraging e-Government in Bangladesh.",
            "An empirical investigation of Technology Readiness among medical staff based in Greek hospitals.",
            "The longitudinal impact of enterprise system users' pre-adoption expectations and organizational support on post-adoption proficient usage.",
            "Internet adoption by the elderly: employing IS technology acceptance theories for understanding the age-related digital divide Open."
        ]
    },
    {
        "name": "EJIS",
        "year": "2013",
        "info": "Volume 22: 2013",
        "count": 43,
        "papers": [
            "Grounded theory method in information systems research: its nature, diversity and opportunities.",
            "Grounded theorizing for electronically mediated social contexts.",
            "The use of ethnography and grounded theory in the development of a management information system.",
            "Using grounded theory as a method for rigorously reviewing literature.",
            "Enriching our theoretical repertoire: the role of evolutionary psychology in technology acceptance.",
            "Everyday power struggles: living in an IOIS project.",
            "Using a grounded theory approach to study online collaboration behaviors.",
            "Profiling grounded theory approaches in information systems research.",
            "Research opportunities in information technology funding and system justification.",
            "Revisiting IS business value research: what we already know, what we still need to know, and how we can get there.",
            "Shareholder reaction to firm investments in the capability maturity model: an event study.",
            "Adapting funding processes for agile IT projects: an empirical investigation.",
            "Effects of time-inconsistent preferences on information technology infrastructure investments with growth options.",
            "E-government adoption in public administration organizations: integrating institutional theory perspective and resource-based view.",
            "Effective ERP adoption processes: the role of project activators and resource investments.",
            "Embracing diversity through mixed methods research.",
            "Digital business reporting standards: mapping the battle in France.",
            "Top management support in multiple-project environments: an in-practice view.",
            "Information privacy and correlates: an empirical attempt to bridge and distinguish privacy-related concepts.",
            "Sympathy or strategy: social capital drivers for collaborative contributions to the IS community.",
            "A method for taxonomy development and its application in information systems.",
            "Can we have fun @ work? The role of intrinsic motivation for utilitarian systems.",
            "'Datafication': making sense of (big) data in a complex world.",
            "Information technology offshoring in India: a postcolonial perspective.",
            "Leveraging the IT competence of non-IS workers: social exchange and the good corporate citizen.",
            "The role of online seller reviews and product price on buyers' willingness-to-pay: a risk perspective.",
            "Towards integrating acceptance and resistance research: evidence from a telecare case study.",
            "Trust dynamics in a large system implementation: six theoretical propositions.",
            "How a professionally qualified doctoral student bridged the practice-research gap: a confessional account of Collaborative Practice Research.",
            "Governing IT in inter-organizational relationships: Issues and future research.",
            "Creating value through governing IT deployment in a public/private-sector inter-organisational context: a human agency perspective.",
            "Inter-firm IT governance in power-imbalanced buyer-supplier dyads: exploring how it works and why it lasts.",
            "The mediating role of psychological contract breach in IS outsourcing: inter-firm governance perspective.",
            "Exploring the impact of operating model choice on the governance of inter-organizational workflow: the U.S. e-prescribing network.",
            "Exploring value networks: theorising the creation and capture of value with open source software.",
            "Journals and conferences in discourse.",
            "IS integration and knowledge sharing in multi-unit firms: the winner's curse.",
            "Why the first provider takes it all: the consequences of a low trust culture on pricing and ratings in online sourcing markets.",
            "The pursuit of trust in ad hoc virtual teams: how much electronic portrayal is too much?",
            "Does risk matter? Disengagement from risk management practices in information systems projects.",
            "How user risk and requirements risk moderate the effects of formal and informal control on the process performance of IT projects.",
            "Empirical investigation of the usefulness of Gateway constructs in process models.",
            "Longitudinal use of method rationale in method configuration: an exploratory study."
        ]
    },
    {
        "name": "EJIS",
        "year": "2012",
        "info": "Volume 21: 2012",
        "count": 45,
        "papers": [
            "Some considerations for articles introducing new and/or novel quantitative methods to IS researchers.",
            "Towards the improved treatment of generalization of knowledge claims in IS research: drawing general conclusions from samples.",
            "Conceptualizing models using multidimensional constructs: a review and guidelines for their use.",
            "Quantitative approaches to content analysis: identifying conceptual drift across publication outlets.",
            "Latent Semantic Analysis: five methodological recommendations.",
            "Designing IS service strategy: an information acceleration approach.",
            "Analysing quadratic effects of formative constructs by means of variance-based structural equation modelling.",
            "Qualitative methods research in information systems: motivations, themes, and contributions.",
            "The teaching of qualitative research methods in information systems: an explorative study utilizing learning theory.",
            "Pragmatism vs interpretivism in qualitative information systems research.",
            "The action research vs design science debate: reflections from an intervention in eGovernment.",
            "Improving validity and reliability in longitudinal case study timelines.",
            "Information systems development as situated socio-technical change: a process approach.",
            "Reconsidering deconstruction in information systems research.",
            "Responsible research and innovation in information systems.",
            "A case study of the legitimation process undertaken to gain support for an information system in a Chinese university.",
            "Negotiating language barriers - a methodology for cross-organisational conceptual modelling.",
            "A balanced scorecard for item-level RFID in the retail sector: a Delphi study.",
            "Reviewing Enterprise Content Management: a functional framework.",
            "An empirical study of IS architectures in French SMEs: integration approaches.",
            "Towards an understanding of assimilation in virtual worlds: the 3C approach.",
            "Online game addiction among adolescents: motivation and prevention factors.",
            "What's communication got to do with IT?",
            "A profile of information systems research in the Mediterranean region.",
            "Institutionalized computer workaround practices in a Mediterranean country: an examination of two organizations.",
            "The impact of IT-business strategic alignment on firm performance in a developing country setting: exploring moderating roles of environmental uncertainty and strategic orientation.",
            "Escaping 'localisms' in IT sourcing: tracing changes in institutional logics in an Italian firm.",
            "The impact of geocollaborative portals on group decision making for trip planning.",
            "Conversation as a source of satisfaction and continuance in a question-and-answer site.",
            "The effect of colors of e-commerce websites on consumer mood, memorization and buying intention.",
            "Toward a richer diversity of genres in information systems research: new categorization and guidelines.",
            "Information systems as a discipline in the making: comparing EJIS and MISQ between 1995 and 2008.",
            "To share or not to share: a critical research perspective on knowledge management systems.",
            "The benefits and dangers of enjoyment with social networking websites.",
            "Everywhere and nowhere: nearshore software development in the context of globalisation.",
            "Mediating the intersections of organizational routines during the introduction of a health IT system.",
            "Sociomateriality and boundary objects in information systems development.",
            "Reviving the IT in the IS.",
            "Conceptualising improvisation in information systems security.",
            "Trans-situated use of integrated information systems.",
            "Willing to pay for quality personalization? Trade-off between quality and privacy.",
            "Understanding overbidding behavior in C2C auctions: an escalation theory perspective.",
            "Information technology, the organizational capability of proactive corporate environmental strategy and firm performance: a resource-based analysis.",
            "Toward a better understanding of behavioral intention and system usage constructs.",
            "Bridging the work/social divide: the emotional response to organizational social networking sites."
        ]
    },
    {
        "name": "EJIS",
        "year": "2011",
        "info": "Volume 20: 2011",
        "count": 53,
        "papers": [
            "The inflation of academic intellectual capital: the case for design science research in Europe.",
            "Memorandum on design-oriented information systems research.",
            "A response to the design-oriented information systems research memorandum.",
            "How do IT capabilities create strategic value? Toward greater integration of insights from reductionistic and holistic approaches.",
            "Requirements engineering blinders: exploring information systems developers' black-boxing of the emergent character of requirements.",
            "Alignment within the corporate IT unit: an analysis of software testing and development.",
            "Usage and impact of technology enabled job learning.",
            "IT professional identity: needs, perceptions, and belonging.",
            "Information system personnel career anchor changes leading to career changes.",
            "How website socialness leads to website use.",
            "'Hey professor, why are you teaching this class?' Reflections on the relevance of IS research for undergraduate students.",
            "Exploring the impact of instant messaging on subjective task complexity and user satisfaction.",
            "A new perspective on de-individuation via computer-mediated communication.",
            "Outcomes and success factors of enterprise IT architecture management: empirical insight from the international financial services industry.",
            "From transactional user to VIP: how organizational and cognitive factors affect ERP assimilation at individual level.",
            "A framework for stakeholder oriented mindfulness: case of RFID implementation at YCH Group, Singapore.",
            "Satisfaction with employee relationship management systems: the impact of usefulness on systems quality perceptions.",
            "A theory-grounded framework of Open Source Software adoption in SMEs.",
            "Individual information systems as a research arena.",
            "Us and them: a social capital perspective on the relationship between the business and IT departments.",
            "The influence of the informal social learning environment on information privacy policy compliance efficacy and intention.",
            "Scalable growth in IT-enabled service provisioning: a sensemaking perspective.",
            "Guest Editorial.",
            "The digital divide and t-government in the United States: using the technology acceptance model to understand usage.",
            "Priorities, policies and practice of e-government in a developing country context: ICT infrastructure and diffusion in Jamaica.",
            "Online tax payment systems as an emergent aspect of governmental transformation.",
            "Open innovation and public administration: transformational typologies and business model impacts.",
            "Information design.",
            "Focus groups and critical social IS research: how the choice of method can promote emancipation of respondents and researchers.",
            "An historically grounded critical analysis of research articles in IS.",
            "Special issue on the Kleinian approach to information system research - foreword.",
            "The scholarly influence of Heinz Klein: ideational and social measures of his impact on IS research and IS scholars.",
            "Doing critical information systems research - arguments for a critical research methodology.",
            "Is information systems a discipline? Foucauldian and Toulminian insights.",
            "Enabling a Kleinian integration of interpretivist and socio-critical IS research: the contribution of Dooyeweerd's philosophy.",
            "Towards a greater diversity in writing styles, argumentative strategies and genre of manuscripts.",
            "Inter-organizational information systems adoption - a configuration analysis approach.",
            "Decision support or support for situated choice: lessons for system design from effective manual systems.",
            "Managing e-Government system implementation: a resource enactment perspective.",
            "Is traditional, open-source, or on-demand first choice? Developing an AHP-based framework for the comparison of different software models in office suites selection.",
            "Coping with rapid information technology change in different national cultures.",
            "Illusions of control and social domination strategies in knowledge mapping system use.",
            "Opening the black box of system usage: user adaptation to disruptive IT.",
            "Investigating the reliability of second-order formative measurement in information systems research.",
            "Quality changes.",
            "Development of an IS change reason-IS change type combinations matrix.",
            "A review and analysis of deterrence theory in the IS security literature: making sense of the disparate findings.",
            "Does ethical ideology affect software piracy attitude and behaviour? An empirical investigation of computer users in China.",
            "Building contextual ambidexterity in a software company to improve firm-level coordination.",
            "Moderating a discourse on the moderating effects in the study of top management support.",
            "Assessing moderating effect in meta-analysis: a re-analysis of top management support studies and suggestions for researchers.",
            "Top management support and IS implementation: further support for the moderating role of task interdependence.",
            "Coping with rapid information technology change in different national cultures."
        ]
    },
    {
        "name": "EJIS",
        "year": "2010",
        "info": "Volume 19: 2010",
        "count": 48,
        "papers": [
            "Third-degree conflicts: information warfare.",
            "The effects of infrastructure and policy on e-business in Latin America and Sub-Saharan Africa.",
            "Dressage, control, and enterprise systems: the case of NASA's Full Cost initiative.",
            "When is an information infrastructure? Investigating the emergence of public sector information infrastructures.",
            "Eliciting tacit knowledge about requirement analysis with a Grammar-targeted Interview Method (GIM).",
            "User experience, satisfaction, and continual usage intention of IT.",
            "Continued use of process modeling grammars: the impact of individual difference factors.",
            "Expectations and outcomes in electronic identity management: the role of trust and public value.",
            "My social networking profile: copy, resemblance, or simulacrum? A poststructuralist interpretation of social information systems.",
            "A motivational model for technology-supported cross-organizational and cross-border collaboration.",
            "Competing pressures of risk and absorptive capacity potential on commitment and information sharing in global supply chains.",
            "Evaluating cross-organizational impacts of information technology - an empirical analysis.",
            "Building a successful relationship in business process outsourcing: an exploratory study.",
            "Proposing the online community self-disclosure model: the case of working professionals in France and the U.K. who use online communities.",
            "Business strategic conflict in computer-mediated communication.",
            "The impact of the nature of globally distributed work arrangement on work-life conflict and valence: the Indian GSD professionals' perspective.",
            "Team leader strategies for enabling collaboration technology adaptation: team technology knowledge to improve globally distributed systems development work.",
            "The strategic value of supply chain visibility: increasing the ability to reconfigure.",
            "Getting pragmatic.",
            "How well do shopbots represent online markets? A study of shopbots' vendor coverage strategy.",
            "Project failure en masse: a study of loose budgetary control in ISD projects.",
            "Influencing the effectiveness of IT governance practices through steering committees and communication policies.",
            "Software process improvement with weak management support: an analysis of the dynamics of intra-organizational alliances in IS change initiatives.",
            "Control patterns in a health-care network.",
            "Customers' preference of online store visit strategies: an investigation of demographic variables.",
            "Developing a unified framework of the business model concept.",
            "Dressage, control, and enterprise systems: the case of NASA's Full Cost initiative.",
            "Loose Change.",
            "Using the theory of the professions to understand the IS identity crisis.",
            "The enactment of significance: a unified conception of information, systems and technology.",
            "The infological equation extended: towards conceptual clarity in the relationship between data, information and knowledge.",
            "Managing as designing: 'opportunity knocks' for the IS field?",
            "Guest Editorial: Theme of the Special Issue - IS in interorganizational networks.",
            "Flexible decision support in dynamic inter-organisational networks.",
            "Valuing worldwide diversity in a European spirit: being more critical and open.",
            "The ontological deficiencies of process modeling in practice.",
            "Perspectives on challenges facing women in IS: the cognitive gender gap.",
            "Toward an 'IT Conflict-Resistance Theory': action research during IT pre-implementation.",
            "User experience of museum technologies: the phenomenological scales.",
            "Do organisational and environmental factors moderate the effects of Internet-based interorganisational systems on firm performance?",
            "Proactive or reactive IT leaders? A test of two competing hypotheses of IT innovation and environment alignment.",
            "Reconceptualizing the concept of business and IT alignment: from engineering to agriculture.",
            "User resistance determinants and the psychological contract in enterprise system implementations.",
            "Analysing IOIS adoption through structural contradictions.",
            "Government website service quality: a study of the Irish revenue online service.",
            "Effects of visual and textual information in online product presentations: looking for the best combination in website design.",
            "Guest Editorial: Contrarian information systems studies.",
            "Same technology, different outcome? Reinterpreting Barley's Technology as an Occasion for Structuring."
        ]
    },
    {
        "name": "EJIS",
        "year": "2009",
        "info": "Volume 18: 2009",
        "count": 48,
        "papers": [
            "The EJIS editorial organisation and submissions.",
            "Rethinking organisational size in IS research: meaning, measurement and redevelopment.",
            "When users are IT experts too: the effects of joint IT competence and partnership on satisfaction with enterprise-level systems implementation.",
            "Information capability and value creation strategy: advancing revenue management through mobile ticketing technologies.",
            "Information infrastructure, governance, and socio-economic development in developing countries.",
            "Information systems and the allure of organisational integration: a cautionary tale from the Irish financial services sector.",
            "Combining the rational and relational perspectives of electronic trading.",
            "An institutional analysis on the dynamics of the interaction between standardizing and scaling processes: a case study from Ethiopia.",
            "Behavioral and policy issues in information systems security: the insider threat.",
            "Protection motivation and deterrence: a framework for security policy compliance in organisations.",
            "What levels of moral reasoning and values explain adherence to information security rules? An empirical study.",
            "Frame misalignment: interpreting the implementation of information systems security certification in an organization.",
            "If someone is watching, I'll do what I'm asked: mandatoriness, control, and information security.",
            "Improving multiple-password recall: an empirical study.",
            "Threat or coping appraisal: determinants of SMB executives' decision to adopt anti-malware software.",
            "What is published in our journals cannot change unless we do.",
            "Contemplating public policy in HIV/AIDS online content, then where is the technology spirit?",
            "Understanding online customer repurchasing intention and the mediating role of trust - an empirical investigation in two developed countries.",
            "The impacts of competence-trust and openness-trust on interorganizational systems.",
            "Factors considered when outsourcing an IS system: an empirical examination of the impacts of organizational size, strategy and the object of a decision.",
            "A longitudinal analysis of trajectory changes in the software industry: the case of the content management application segment.",
            "Understanding web site redesigns in small- and medium-sized enterprises (SMEs): a U.K.-based study on the applicability of e-commerce Stage Models.",
            "'Lots done, more to do': the current state of agile systems development research.",
            "Assessing the relative contribution of the facets of agility to distributed systems development success: an Analytic Hierarchy Process approach.",
            "Exploring agile values in method configuration.",
            "Simulating mixed agile and plan-based requirements prioritization strategies: proof-of-concept and practical implications.",
            "A framework for adapting agile development methodologies.",
            "Acceptance of software process innovations - the case of extreme programming.",
            "Role of collective ownership and coding standards in coordinating expertise in software project teams.",
            "The role of project management in ineffective decision making within Agile software development projects.",
            "Progress in information systems research.",
            "Understanding the influence of multiple levels of governments on the development of inter-organizational systems.",
            "Identifying and overcoming the challenges of implementing a project management office.",
            "Boundary factors and contextual contingencies: configuring electronic templates for healthcare professionals.",
            "Business Process Outsourcing: an event study on the nature of processes and firm valuation.",
            "Meeting the demand for IT workers: A call for research.",
            "Why college undergraduates choose IT: a multi-theoretical perspective.",
            "Retaining women in the U.S. IT workforce: theorizing the influence of organizational factors.",
            "Another road to IT turnover: the entrepreneurial path.",
            "Preparing for evidence-based management.",
            "Challenges associated with RFID tag implementations in supply chains.",
            "Managing RFID projects in organizations.",
            "Consumer acceptance of RFID-enabled services: a model of multiple attitudes, perceived system characteristics and individual traits.",
            "Managerial problem-solving in the adoption of Radio Frequency Identification Technologies.",
            "RFID-enabled item-level product information revelation.",
            "Evaluation of RFID applications for logistics: a framework for identifying, forecasting and assessing benefits.",
            "Understanding the value of integrated RFID systems: a case study from apparel retail.",
            "A contingency model for creating value from RFID supply chain network projects in logistics and manufacturing environments."
        ]
    },
    {
        "name": "EJIS",
        "year": "2008",
        "info": "Volume 17: 2008",
        "count": 57,
        "papers": [
            "Changing the challenge: measure what makes you better and be better at what you measure.",
            "The role of perceived enjoyment and social norm in the adoption of technology with network externalities.",
            "The economics and psychology of consumer trust in intermediaries in electronic markets: the EM-Trust Framework.",
            "Resilience of super users' mental models of enterprise-wide systems.",
            "An exploratory study on meta skills in software development teams: antecedent cooperation skills and personality for shared mental models.",
            "The post mortem paradox: a Delphi study of IT specialist perceptions.",
            "Explaining changes in learning and work practice following the adoption of online learning: a human agency perspective.",
            "Editorial.",
            "Stakeholder management in IOS projects: analysis of an attempt to implement an electronic patient file.",
            "A multiple narrative approach to information systems failure: a successful system that failed.",
            "Beyond organisational agendas: using boundary critique to facilitate the inclusion of societal concerns in information systems planning.",
            "Information system development activities and inquiring systems: an integrating framework.",
            "For better or worse: how we apply journal ranking lists.",
            "The journal list and its use: motivation, perceptions, and reality.",
            "The ranking of top IS journals: a perspective from the London School of Economics.",
            "Expert evaluation vs bibliometric evaluation: experiences from Finland.",
            "Time to stop researching the important things?",
            "Strategies, systems, and technologies.",
            "IT employment prospects: beyond the dotcom bubble.",
            "Rapid business and IT change: drivers for strategic information systems planning?",
            "Knowledge management orientation: construct development and empirical validation.",
            "Measuring information systems success: models, dimensions, measures, and interrelationships.",
            "Enacting computer workaround practices within a medication dispensing system.",
            "An institutional analysis on the dynamics of the interaction between standardizing and scaling processes: a case study from Ethiopia.",
            "The dynamics of IT boundary objects, information infrastructures, and organisational identities: the introduction of 3D modelling technologies into the architecture, engineering, and construction industry.",
            "Interactive innovation of technology for mobile work.",
            "Research quality, project failure, and privacy threats: spitting, yelling, and cussing.",
            "Measuring research quality: the United Kingdom Government's Research Assessment Exercise.",
            "A discipline for a stage? A Shakespearean reflection on the research plot and performance of the Information Systems field.",
            "Creating social entrepreneurship in local government.",
            "The moderating role of customer-technology contact on attitude towards technology-based services.",
            "Improving the impact of IT development projects: the benefits realization capability model.",
            "Strategic scanning project failure and abandonment factors: lessons learned.",
            "Personality traits and concern for privacy: an empirical study in the context of location-based services.",
            "Re-examining the causal structure of information technology impact research.",
            "The effect of flaming on computer-mediated negotiations.",
            "What design science is not.",
            "The only duty we owe to history is to rewrite it: reflections on Bob Galliers' article 'A discipline for a stage?'.",
            "Defining information systems as work systems: implications for the IS field.",
            "Guest Editorial.",
            "Client as designer in collaborative design science research projects: what does social science design theory tell us?",
            "On theory development in design science research: anatomy of a research project.",
            "Design of emerging digital services: a taxonomy.",
            "Designing enterprise integration solutions: effectively.",
            "Secure activity resource coordination: empirical evidence of enhanced security awareness in designing secure business processes.",
            "Essence: facilitating software innovation.",
            "Editorial.",
            "Knowledge portals in Chinese consulting firms: a task-technology fit perspective.",
            "Software architectures: Blueprint, Literature, Language or Decision?",
            "Explaining information systems change: a punctuated socio-technical change model.",
            "Contextual dynamics during health information systems implementation: an event-based actor-network approach.",
            "The Influence of workspace awareness on group intellective decision effectiveness.",
            "User satisfaction with business-to-employee portals: conceptualization and scale development.",
            "Doing the politics of technological decision making: due process and the debate about identity cards in the U.K.",
            "Profile of IS research published in the European Journal of Information Systems.",
            "Introduction to the Opinion Paper: Bryant's 'The future of information systems'.",
            "The future of information systems - Thinking Informatically."
        ]
    },
    {
        "name": "EJIS",
        "year": "2007",
        "info": "Volume 16: 2007",
        "count": 66,
        "papers": [
            "Change strikes back.",
            "The European Information Systems Academy.",
            "What sort of community is the European Conference on Information Systems? A social network analysis 1993-2005.",
            "Vive les differences? Developing a profile of European information systems research as a basis for international comparisons.",
            "Analyzing IS research productivity: an inclusive approach to global IS scholarship.",
            "Perceived network externalities and communication technology acceptance.",
            "External Web content and its influence on organizational performance.",
            "Applying TAM across cultures: the need for caution.",
            "Identifying healthcare actors involved in the adoption of information systems.",
            "e-Government: past, present and future.",
            "Remote electronic voting systems: an exploration of voters' perceptions and intention to use.",
            "Collaborative e-Government: impediments and benefits of information-sharing projects in the public sector.",
            "e-Government information systems: Evaluation-led design for public value and client trust.",
            "A comprehensive analysis of U.S. counties' e-Government portals: development status and functionalities.",
            "Understanding e-Government project trajectories from an actor-network perspective.",
            "Towards an e-Government efficiency agenda: the impact of information and communication behaviour on e-Reverse auctions in public sector procurement.",
            "Challenges to information systems: time to change.",
            "Editorial.",
            "Does Domberger's theory of 'The Contracting Organization' explain why organizations outsource IT and the levels of satisfaction achieved?",
            "Effects of interaction richness on consumer attitudes and behavioral intentions in e-commerce: some experimental results.",
            "Perceived critical mass and the adoption of a communication technology.",
            "Prioritization of e-Government strategies using a SWOT-AHP analysis: the case of Turkey.",
            "Changing the challenge: To challenge makes you larger and being challenged makes you small.",
            "Ranking journals in business and management: a statistical analysis of the Harzing data set.",
            "Why the old world cannot publish? Overcoming challenges in publishing high-impact IS research.",
            "Electronic transformation of government in the U.K.: a research agenda.",
            "The conundrum of IT management.",
            "Guest Editorial.",
            "Special Section Articles.",
            "Platform ontologies for the model-driven architecture.",
            "Model-driven multidimensional modeling of secure data warehouses.",
            "Towards agent-oriented model-driven architecture.",
            "From requirements to implementations: a model-driven approach for web development.",
            "Towards improving the navigability of Web applications: a model-driven approach.",
            "Model-driven component adaptation in the context of Web Engineering.",
            "Managing strategic contradictions in hybrid teams.",
            "Distributed leadership in the development of a knowledge sharing system.",
            "Charismatic leadership and user acceptance of information technology.",
            "A survey of critical success factors in e-Banking: an organisational perspective.",
            "Changeover and celebrating change: 20 reasons for celebrating 20 years.",
            "Guest Editorial.",
            "Concepts of Product Software.",
            "Questioning the IT artefact: user practices that can, could, and cannot be supported in packaged-software designs.",
            "Deciding to upgrade packaged software: a comparative case study of motives, contingencies and dependencies.",
            "An assessment of package-organisation misalignment: institutional and ontological structures.",
            "Implementing packaged enterprise software in multi-site firms: intensification of organizing and learning.",
            "Applying ontology-based rules to conceptual modeling: a reflection on modeling decision making.",
            "Focusing the research agenda on burnout in IT: social representations of burnout in the profession.",
            "Manchester United Football Club: developing a Network Orchestration Model.",
            "A programme management approach for ensuring curriculum coherence in IS (higher) education.",
            "Introducing Masculinity Studies to Information Systems Research: the case of Gaydar.",
            "Time for a change.",
            "Guest Editorial.",
            "Special Section Articles.",
            "An organizational learning perspective on the assimilation of electronic medical records among small physician practices.",
            "An epidemic of pain in an Australian radiology practice.",
            "An exploratory study of radio frequency identification (RFID) adoption in the healthcare industry.",
            "Physicians' resistance toward healthcare information technology: a theoretical model and empirical test.",
            "The role of industry infrastructure in telehealth innovations: a multi-level analysis of a telestroke program.",
            "An empirical examination of patient-physician portal acceptance.",
            "ALTAR: achieving learning through action research.",
            "ALTAR in action: knowledge management.",
            "Online consumer retention: contingent effects of online shopping habit and online shopping experience.",
            "Impediments to requirements engineering during global software development.",
            "Realising B2B e-commerce benefits: the link with IT maturity, evaluation practices, and B2BEC adoption readiness.",
            "The potential of hermeneutics in information systems research."
        ]
    },
    {
        "name": "EJIS",
        "year": "2006",
        "info": "Volume 15: 2006",
        "count": 67,
        "papers": [
            "Changing issues: sixes and specials.",
            "Reflecting on action in language, organisations and information systems.",
            "Activity-based design.",
            "A genealogical study of boundary-spanning IS design.",
            "Action-oriented group learning in the implementation of information technologies: results from three case studies.",
            "Acting with genres: discursive-ethical concepts for reflecting on and legitimating genres.",
            "A language-mapping approach to action-oriented development of information systems.",
            "Combining method engineering with activity theory: theoretical grounding of the method component concept.",
            "Process models representing knowledge for action: a revised quality framework.",
            "Artful planning.",
            "Business agility and diffusion of information technology.",
            "Enterprise agility and the enabling role of information technology.",
            "Change factors requiring agility and implications for IT.",
            "Agility through scenario development and continuous implementation: a global aftermarket logistics case.",
            "Enabling agile adoption practices through network organizations.",
            "Agile improvement practices in software organizations.",
            "Information system development agility as organizational learning.",
            "Customising agile methods to software practices at Intel Shannon.",
            "The shaping of I.T. trajectories: evidence from the U.K. public sector.",
            "A framework for understanding how a unique and local IS development method emerges in practice.",
            "Views, change and changing views.",
            "An opportunity for editors of I.S. journals to relate their experiences and offer advice. The editorial view of David Avison Guy Fitzgerald and Philip Powell, Editors: of the Information Systems Journal: Second in a series.",
            "An opportunity for editors of I.S. Journals to relate their experiences and offer advice. The editorial view of Frantz Rowe, Editor in Chief: of Systèmes d'Information et Management. Third in a series - On dissemination, national language and interacting with practitioners.",
            "Introduction to the special issue on mobile user behaviour.",
            "Is mobile email functional or dysfunctional? Two perspectives on mobile email usage.",
            "Contextual influences on user satisfaction with mobile computing: findings from two healthcare organizations.",
            "Switching behavior of mobile users: do users' relational investments and demographics matter?",
            "Enacting new temporal boundaries: the role of mobile phones.",
            "Exploring the influence of reference situations and reference pricing on mobile service user behaviour.",
            "Mobile computing: a user study on hedonic/utilitarian mobile device usage.",
            "Secondary user relations in emerging mobile computing environments.",
            "The dynamics of control and mobile computing in distributed activities.",
            "Doing interpretive research.",
            "Team adaptation to electronic communication media: evidence of compensatory adaptation in new product development teams.",
            "Organizational and ethical issues in the information society.",
            "Resist, comply or workaround? An examination of different facets of user engagement with information systems.",
            "Are norms enough? The role of collaborative norms in promoting organizational knowledge seeking.",
            "Being an 'it' in IT: gendered identities in IT work.",
            "Haven or hell? Telework, flexibility and family in the e-society: a Marxist analysis.",
            "Privacy calculus model in e-commerce - a study of Italy and the United States.",
            "Opportunities for computer crime: considering systems risk from a criminological perspective.",
            "What drives netsourcing decisions? An empirical analysis.",
            "Adding clicks to bricks: a case study of e-commerce adoption by a Catalan small retailer.",
            "Offshoring Information Technology.",
            "Facilitating - or inhibiting - knowing in practice.",
            "The role of imagination in the organizing of knowledge.",
            "Commentary on Karl E. Weick's 'The role of imagination in the organizing of knowledge'.",
            "Commentary on Karl E. Weick's 'The role of imagination in the organizing of knowledge'.",
            "Material knowing: the scaffolding of human knowledgeability.",
            "Commentary on Wanda Orlikowski's 'Material knowing: the scaffolding of human knowledgeability'.",
            "Commentary on Wanda Orlikowski's 'Material knowing: the scaffolding of human knowledgeability'.",
            "The incompatibility of knowledge regimes: consequences of the material world for cross-domain work.",
            "Using informal notes for sharing corporate technology know-how.",
            "Dynamic capabilities and the role of organizational knowledge: an exploration.",
            "Business customer communities and knowledge sharing: exploratory study of critical issues.",
            "Making the changes.",
            "An empirical study on Web-based services and customer loyalty.",
            "Perceived risk and trust associated with purchasing at electronic marketplaces.",
            "An exploration of factors that impact individual performance in an ERP environment: an analysis using multiple analytical techniques.",
            "A re-conceptualization of the interpretive flexibility of information technologies: redressing the balance between the social and the technical.",
            "Model-based software configuration: patterns and languages.",
            "Innovation diffusion in global contexts: determinants of post-adoption digital transformation of European companies.",
            "New frontiers for information systems research: computer art as an information system.",
            "Characterizing the evolving research on enterprise content management.",
            "A conceptual framework for the implementation of enterprise information portals in large organizations.",
            "Implementing enterprise content management: from evolution through strategy to contradictions out-of-the-box.",
            "Electronic Brains: Stories from the Dawn of the Computer Age."
        ]
    },
    {
        "name": "EJIS",
        "year": "2005",
        "info": "Volume 14: 2005",
        "count": 65,
        "papers": [
            "From technical to socio-technical change: tackling the human and organizational aspects of systems development projects.",
            "Contextual influences on technology use mediation: a comparative analysis of electronic medical record systems.",
            "The surface of emergence in systems development: agency, institutions, and large-scale information systems.",
            "Social ties, knowledge sharing and successful collaboration in globally distributed system development projects.",
            "The social and political construction of technological frames.",
            "Towards the development of a social capital approach to evaluating change management interventions.",
            "The ability of information systems development project teams to respond to business and technology changes: a study of flexibility measures.",
            "Information systems development as emergent socio-technical change: a practice approach.",
            "EJIS special issue on making enterprise systems work.",
            "Understanding enterprise systems-enabled integration.",
            "Developing an integration architecture for process portals.",
            "Managing user acceptance towards enterprise resource planning (ERP) systems - understanding the dissonance between user expectations and managerial policies.",
            "Investigating enterprise systems adoption: uncertainty avoidance, intrinsic motivation, and the technology acceptance model.",
            "Integrating ERP using EAI: a model for post hoc evaluation.",
            "Investigating success factors in enterprise application integration: a case-driven analysis.",
            "The future of inter-organisational system linkages: findings of an international Delphi study.",
            "Editorial.",
            "Editor's View: an opportunity for editors of IS journals to relate their experiences and offer advice. The Editorial View of Ray J. Paul. First in a series.",
            "Linking knowledge transformation to Information Systems evaluation.",
            "A critical approach to evaluation.",
            "The turnaround of the London Ambulance Service Computer-Aided Despatch system (LASCAD).",
            "Making ERPs work: accountants and the introduction of ERP systems.",
            "Designing consumer interfaces for experiential tasks: an empirical investigation.",
            "Understanding Web home page perception.",
            "An analysis of the traditional IS security approaches: implications for research and practice.",
            "Information systems research in the Asia Pacific region.",
            "Understanding misalignment and cascading change of ERP implementation: a stage view of process analysis.",
            "A framework for designing the balanced supply chain scorecard.",
            "Factors and measures of business process modelling: model building through a multiple case study.",
            "User involvement and user satisfaction with information-seeking activity.",
            "The management of cross-functional inter-dependencies in ERP implementations: emergent coordination patterns.",
            "A methodology for construct development in MIS research.",
            "Governance lessons from the experience of telecentres in Kerala.",
            "A framework to assess the factors affecting success or failure of the implementation of government-supported regional e-marketplaces for SMEs.",
            "Editorial.",
            "Portraits of Claudio: the butterfly, the dragon and the marmot.",
            "A portrait of a scientist.",
            "Fake!",
            "A brief glimpse of Claudio.",
            "The heresy and the sport of information systems.",
            "Bricolage in system design and trust in cooperation.",
            "ItAIS (the Italian chapter of AIS) remembers Claudio.",
            "Claudio Ciborra: his life as a formative context.",
            "Remembering Claudio: a note from his friends at Universities of Naples and Catanzaro.",
            "Claudio Ciborra: convenor of information systems October 2000 to February 2005.",
            "A grand master and an exceptional mind.",
            "From Italy to East London.",
            "The spirit never dies.",
            "Ciborra disclosed: aletheia in the life and scholarship of Claudio Ciborra.",
            "Drifting with Claudio.",
            "Visiting the red-light zones with Claudio.",
            "What do Claudio Ciborra and Sandro Botticelli have in common? On the renaissance of la Primavera.",
            "From Milan to Mann Gulch: reflections on the intellectual contributions of Professor Claudio Ciborra.",
            "The obituary as bricolage: the Mann Gulch disaster and the problem of heroic rationality.",
            "Governance, architecture and action: Claudio's Shih.",
            "Imagining Claudio Ciborra's next research agenda.",
            "Eureka moments in the works of Claudio Ciborra.",
            "Let's be baroque!",
            "Bricolage as a way of life - improvisation and irony in information systems.",
            "Taking care of invisible technology.",
            "Beyond risk and boredom: reflections on Claudio Ciborra and sociology.",
            "Claudio Ciborra's way of being: authenticity and the world of information systems.",
            "Do penguins eat scallops?",
            "Challenging wisdom.",
            "The Labyrinths of Information: Challenging the Wisdom of Systems."
        ]
    },
    {
        "name": "EJIS",
        "year": "2004",
        "info": "Volume 13: 2004",
        "count": 28,
        "papers": [
            "An Editor's Values.",
            "Implications of space and time for distributed work: an interpretive study of US-Norwegian systems development teams.",
            "Potential of critical e-applications for engaging SMEs in e-business: a provider perspective.",
            "How organizations adopt information system process innovations: a longitudinal analysis.",
            "Computer-mediated knowledge sharing and individual user differences: an exploratory study.",
            "Electronic trading and the process of globalization in traditional futures exchanges: a temporal perspective.",
            "Action-oriented conceptual modelling.",
            "Time, experience and change.",
            "Configuring peer-to-peer software: an empirical study of how users react to the regulatory features of software.",
            "Broadband development in South Korea: institutional and cultural factors.",
            "Technological switchbacks: the transition to Western information systems in privatised firms of the former East Germany.",
            "Organizational determinants of IT adoption in the pharmaceutical distribution sector.",
            "A model of electronic commerce adoption by small voluntary organizations.",
            "Time, change and beliefs.",
            "Special issue on \"interpretive\" approaches to information systems and computing.",
            "\"Interpretive\" mobility, IS and computing.",
            "Possibilities for cross-fertilization between interpretive approaches and other methods for analyzing information systems.",
            "Ethnography, ethnomethodology and the problem of generalisation in design.",
            "Taking technomethodology seriously: hybrid change in the ethnomethodology-design relationship.",
            "Hermeneutics, information and representation.",
            "The ontological screening of contemporary life: a phenomenological analysis of screens.",
            "Can Thomas Kuhn's paradigms help us understand software engineering?",
            "Time, change and EJIS.",
            "Decision support systems evolution: framework, case study and research agenda.",
            "Regulation as a barrier to electronic commerce in Europe: the case of the European fund management industry.",
            "Strategic aspirations for net-enabled business.",
            "User participation in decision support systems development: Influencing system outcomes.",
            "A research framework for analysing eBusiness models."
        ]
    },
    {
        "name": "EJIS",
        "year": "2003",
        "info": "Volume 12: 2003",
        "count": 40,
        "papers": [
            "Theory with everything?",
            "SMEs, co-opetition and knowledge sharing: the role of information systems.",
            "Rethinking competence systems for knowledge-based organizations.",
            "Consumer search in electronic markets: an experimental analysis of travel services.",
            "Understanding online purchase intentions: contributions from technology and trust perspectives.",
            "The business model concept: theoretical underpinnings and empirical illustrations.",
            "Are European IS Journals under-rated? An answer based on citation analysis.",
            "Review: Electronic Commerce: B2C Strategies and Models.",
            "Review: Knowledge Management Systems.",
            "Review: Information Systems Outsourcing: Enduring Themes, Emergent Patterns and Future Directions.",
            "Time, change and paradoxes.",
            "A contingency perspective on Internet adoption and competitive advantage.",
            "Development of a measure for the information technology infrastructure construct.",
            "Technology-driven and model-driven approaches to group decision support: focus, research philosophy, and key concepts.",
            "Using resource-based theory to interpret the successful adoption and use of information systems and technology in manufacturing small and medium-sized enterprises.",
            "Modeling use of enterprise resource planning systems: a path analytic study.",
            "Review: Knowledge and Business Process Management.",
            "Review: The Relationship Advantage: Information Technologies, Sourcing, and Management.",
            "Review: Visualizing Argumentation: Software Tools for Collaborative and Educational Sense-making.",
            "Review: Information Systems Outsourcing: Enduring Themes, Emergent Patterns and Future Directions.",
            "More changes and responses.",
            "Business use of Internet-based information systems: the case of Korea.",
            "Identifying software project risks in Nigeria: an International Comparative Study.",
            "Structure and analysis of IS decision-making processes.",
            "Determinants of ASP choice: an integrated perspective.",
            "Information systems: a subject with a particular perspective, no more, no less.",
            "Is IS an intellectual subject?",
            "(IS)4: is information systems interesting in itself?",
            "Disciplining Information Systems: Truth and its Regimes.",
            "Review: A computer called LEO.",
            "Review: Information Systems: an Introduction to Informatics in Organisations.",
            "Review: Information Systems and the Economics of Innovation.",
            "Review: Designing Collaborative Systems. A Practical Guide to Ethnography.",
            "Special section on managing e-business transformation.",
            "Electronic business adoption by European firms: a cross-country assessment of the facilitators and inhibitors.",
            "Managing e-transformation in the public sector: an e-government study of the Inland Revenue Authority of Singapore (IRAS).",
            "The role of dynamic capabilities in e-business transformation.",
            "Assessing the benefits from e-business transformation through effective enterprise management.",
            "Electronic window dressing: impression management with Websites.",
            "Review: E-business applications: technologies for tomorrow's solutions."
        ]
    },
    {
        "name": "EJIS",
        "year": "2002",
        "info": "Volume 11: 2002",
        "count": 29,
        "papers": [
            "Editorial Volume 11, Issue 1.",
            "Exploring relationships in information technology outsourcing: the interaction approach.",
            "Women in the information technology profession: a literature review, synthesis and research agenda.",
            "Vicious and virtuous cycles in ERP implementation: a case study of interrelations between critical success factors.",
            "The role of boundaries in knowledge processes.",
            "Patterns of software quality management in TickIT certified firms.",
            "Developing a frame of reference for ex-ante IT/IS investment evaluation.",
            "Review: Qualitative Research in IS: Issues and Trends.",
            "Review: Information Security Management: Global Changes in the New Millennium.",
            "Editorial.",
            "Pre-project partnering impact on an information system project, project team and project manager.",
            "Role of GSS on collaborative problem-based learning: a study on knowledge externalisation.",
            "IT alignment in small firms.",
            "Requirements engineering - exploring the influence of power and Thai values.",
            "The organisational learning effects of management accounting information under advanced manufacturing technology.",
            "Culture, power and politics in ICT outsourcing in higher education institutions.",
            "(IS)3: Is Information Systems an intellectual subject?",
            "For the Special Issue on 'Personal Aspects of E-Business'.",
            "Personality traits and effectiveness of presentation of product information in e-business systems.",
            "Online auctions, messaging, communication and social facilitation: a simulation and experimental evidence.",
            "Managing document categories in e-commerce environments: an evolution-based approach.",
            "The development of two tools for measuring the easiness and usefulness of transactional Web sites.",
            "Editorial.",
            "Re-conceptualising failure: social shaping meets IS research.",
            "The Golden Circle: a way of arguing and acting about technology in the London Ambulance Service.",
            "Benchmarking information technology practices in small firms.",
            "Do I really have to? User acceptance of mandated technology.",
            "Knowledge Management and Business Model Innovation.",
            "Information Systems and Global Diversity."
        ]
    },
    {
        "name": "EJIS",
        "year": "2001",
        "info": "Volume 10: 2001",
        "count": 30,
        "papers": [
            "Editorial Volume 10, Issue 1.",
            "From contexts to constructs: the use of grounded theory in operationalising contingent process models.",
            "Outsourcing information systems: drawing lessons from a banking case study.",
            "Information systems strategies in knowledge-based SMEs: the role of core competencies.",
            "Design and delivery of information.",
            "Transforming failure into success through organisational learning: an analysis of a manufacturing information system.",
            "Oracle8i Data Warehousing.",
            "Measuring Information Technology Investment Payoff: a Contemporary Approach.",
            "Handbook on Electronic Commerce.",
            "Editorial.",
            "Transfer of knowledge in knowledge management systems: unexplored issues and suggested studies.",
            "What is knowledge and can it be managed?",
            "Crossing boundaries and conscripting participation: representing and integrating knowledge in a paper machinery project.",
            "Knowledge management and the politics of knowledge: illustrations from complex products and systems.",
            "'Memories are made of this': explicating organisational knowledge and memory.",
            "Exploring the supply-side of IT outsourcing: evaluating the emerging role of application service providers.",
            "Organisational learning - a critical systems thinking discipline.",
            "An investigation of the factors affecting the successful treatment of organisational issues in systems development projects.",
            "The process of global knowledge integration: a case study of a multinational investment bank's Y2K program.",
            "Model-based design and evaluation of interactive applications.",
            "Handbook of Action Research Participative Inquiry and Practice.",
            "Managing Electronic Services; A Public Sector Perspective.",
            "The Component-based Business: Plug and Play.",
            "Market-oriented Technology Management - Innovating for Profit in Entrepreneurial Times.",
            "Managing Industrial Knowledge; Creation, Transfer and Utilization.",
            "Information systems evaluation: past, present and future.",
            "Understanding IS evaluation as a complex social process: a case study of a UK local authority.",
            "A framework for the ex-ante evaluation of ERP software.",
            "ERP software implementation: an integrative framework.",
            "The impact of information technology on financial performance: the importance of strategic choice."
        ]
    },
    {
        "name": "EJIS",
        "year": "2000",
        "info": "Volume 9: 2000",
        "count": 37,
        "papers": [
            "Editorial.",
            "Information systems planning in a turbulent environment.",
            "Stimulating power games as a part of systems development.",
            "The adoption and design methodologies of component-based enterprise systems.",
            "An analysis of expert systems for business decision making at different levels and in different roles.",
            "Packaged software: implications of the differences from custom approaches to software development.",
            "Editorial.",
            "Paradigmatic analysis as a means of eliciting knowledge to assist multimedia methodological development.",
            "Business environment and internet commerce benefit - a small business perspective.",
            "'Requirements-Uncertainty': Is it best formulated as a latent, aggregate or profile construct?",
            "Perceived critical mass effect on groupware acceptance.",
            "The 'Soft Information Systems and Technologies Methodology' (SISTeM): an actor network contingency approach to integrated development.",
            "Requirements engineering: A good practice.",
            "Software process improvement: Concepts and practices.",
            "Process improvement and organisational learning: The role of collaboration technologies.",
            "An introduction to qualitative research.",
            "Beyond the productivity paradox.",
            "IT investments in developing countries: An assessment and practical guide.",
            "Editorial.",
            "Operationalising the implementation puzzle: an argument for eclecticism in research and in practice.",
            "The reorganization of the information systems of the US Naval Construction Forces: an action research project.",
            "CEO and CIO perceptions of information systems strategy: evidence from Hong Kong.",
            "Binary trading relations and the limits of EDI standards: the Procrustean bed of standards.",
            "Book review/viewpoint on Ian Angell's book - 'The New Barbarian Manifesto: How to Survive in the Information Age'.",
            "Doing research in Business and Management: An Introduction to process and method.",
            "Future organizational design: the scope for IT-based enterprise.",
            "The IT value quest: How to capture the business value of IT-based infrastructure.",
            "System development: A strategic framework.",
            "Bringing global information systems into business.",
            "Information technology standards and standardization: A global perspective.",
            "Editorial.",
            "Open source movements as a model for organising.",
            "Bundling strategy in base-supplemental goods markets: the case of Microsoft.",
            "Identifying and classifying processes (traditional and soft factors) that support COTS component selection: a case study.",
            "Structured-case: a methodological framework for building theory in information systems research.",
            "A theory of industry-level activity for understanding the adoption of interorganizational systems.",
            "Towards an enterprise architecture for public administration using a top-down approach."
        ]
    }
]