[
    {
        "year": "2021",
        "name": "15th ESEM 2021",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2021",
                "sub_name": "ESEM '21: ACM / IEEE International Symposium on Empirical Software Engineering and Measurement, Bari, Italy, October 11-15, 2021.",
                "count": 38,
                "papers": [
                    "How Empirical Research Supports Tool Development: A Retrospective Analysis and new Horizons.",
                    "Measurement Challenges for Cyber Cyber Digital Twins: Experiences from the Deployment of Facebook's WW Simulation System.",
                    "A Model of Software Prototyping based on a Systematic Map.",
                    "A Survey-Based Qualitative Study to Characterize Expectations of Software Developers from Five Stakeholders.",
                    "A comparative study of vulnerability reporting by software composition analysis tools.",
                    "An Empirical Analysis of Practitioners' Perspectives on Security Tool Integration into DevOps.",
                    "An Empirical Examination of the Impact of Bias on Just-in-time Defect Prediction.",
                    "An Empirical Study of Rule-Based and Learning-Based Approaches for Static Application Security Testing.",
                    "An Empirical Study on Refactoring-Inducing Pull Requests.",
                    "An Exploratory Study on Dead Methods in Open-source Java Desktop Applications.",
                    "Barriers to Shift-Left Security: The Unique Pain Points of Writing Automated Tests Involving Security Controls.",
                    "Characteristics and Challenges of Low-Code Development: The Practitioners' Perspective.",
                    "Characterizing and Predicting Good First Issues.",
                    "Continuous Software Bug Prediction.",
                    "Evaluating the Impact of Java Virtual Machines on Energy Consumption.",
                    "Facing the Giant: a Grounded Theory Study of Decision-Making in Microservices Migrations.",
                    "Promises and Perils of Inferring Personality on GitHub.",
                    "Public Software Development Activity During the Pandemic.",
                    "Security Smells Pervade Mobile App Servers.",
                    "Tackling Consistency-related Design Challenges of Distributed Data-Intensive Systems: An Action Research Study.",
                    "Testing Smart Contracts: Which Technique Performs Best?",
                    "The Existence and Co-Modifications of Code Clones within or across Microservices.",
                    "Towards a Human Values Dashboard for Software Development: An Exploratory Study.",
                    "What Evidence We Would Miss If We Do Not Use Grey Literature?",
                    "Who are Vulnerability Reporters?: A Large-scale Empirical Study on FLOSS.",
                    "Why Do Organizations Adopt Agile Scaling Frameworks?: A Survey of Practitioners.",
                    "A Rubric to Identify Misogynistic and Sexist Texts from Software Developer Communications.",
                    "Contextual Understanding and Improvement of Metamorphic Testing in Scientific Software Development.",
                    "Important Experimentation Characteristics: An Expert Survey.",
                    "Inclusion and Exclusion Criteria in Software Engineering Tertiary Studies: A Systematic Mapping and Emerging Framework.",
                    "Python Crypto Misuses in the Wild.",
                    "Semantic Slicing of Architectural Change Commits: Towards Semantic Design Review.",
                    "Study of the Utility of Text Classification Based Software Architecture Recovery Method RELAX for Maintenance.",
                    "Towards Sustainability of Systematic Literature Reviews.",
                    "Towards a Methodology for Participant Selection in Software Engineering Experiments: A Vision of the Future.",
                    "Vision for an Artefact-based Approach to Regulatory Requirements Engineering.",
                    "Web Application Testing: Using Tree Kernels to Detect Near-duplicate States in Automated Model Inference.",
                    "Why Some Bug-bounty Vulnerability Reports are Invalid?: Study of bug-bounty reports and developing an out-of-scope taxonomy model."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "14th ESEM 2020",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2020",
                "sub_name": "ESEM '20: ACM / IEEE International Symposium on Empirical Software Engineering and Measurement, Bari, Italy, October 5-7, 2020.",
                "count": 43,
                "papers": [
                    "A large-scale comparative analysis of Coding Standard conformance in Open-Source Data Science projects.",
                    "A Survey on the Interplay between Software Engineering and Systems Engineering during SoS Architecting.",
                    "Adoption and Effects of Software Engineering Best Practices in Machine Learning.",
                    "An Empirical Study of Software Exceptions in the Field using Search Logs.",
                    "An Empirical Validation of Cognitive Complexity as a Measure of Source Code Understandability.",
                    "Case Survey Studies in Software Engineering Research.",
                    "Challenges in Docker Development: A Large-scale Study Using Stack Overflow.",
                    "Characterizing Energy Consumption of Third-Party API Libraries using API Utilization Profiles.",
                    "DevOps in an ISO 13485 Regulated Environment: A Multivocal Literature Review.",
                    "funcGNN: A Graph Neural Network Approach to Program Similarity.",
                    "Effect of Technical and Social Factors on Pull Request Quality for the NPM Ecosystem.",
                    "Learning Features that Predict Developer Responses for iOS App Store Reviews.",
                    "Long-Term Evaluation of Technical Debt in Open-Source Software.",
                    "On Reducing the Energy Consumption of Software: From Hurdles to Requirements.",
                    "On the adoption, usage and evolution of Kotlin features in Android development.",
                    "Perf-AL: Performance Prediction for Configurable Software through Adversarial Learning.",
                    "Quest for the Golden Approach: An Experimental Evaluation of Duplicate Crowdtesting Reports Detection.",
                    "Spectrum-Based Log Diagnosis.",
                    "Study on Patterns and Effect of Task Diversity in Software Crowdsourcing.",
                    "Teamwork Quality and Team Success in Software Development: A Non-exact Replication Study.",
                    "TopFilter: An Approach to Recommend Relevant GitHub Topics.",
                    "Understanding The Impact of Solver Choice in Model-Based Test Generation.",
                    "Using Extremely Simplified Functional Size Measures for Effort Estimation: an Empirical Study.",
                    "What Industry Wants from Requirements Engineers in China?: An Exploratory and Comparative Study on RE Job Ads.",
                    "Why Research on Test-Driven Development is Inconclusive?",
                    "Work Practices and Perceptions from Women Core Developers in OSS Communities.",
                    "Using Situational and Narrative Analysis for Investigating the Messiness of Software Security.",
                    "The Impact of a Proposal for Innovation Measurement in the Software Industry.",
                    "Bug! Falha! Bachi! Fallo! Défaut! 程序错误!: What about Internationalization Testing in the Software Industry?",
                    "How long do Junior Developers take to Remove Technical Debt Items?",
                    "Trustworthiness Perceptions in Code Review: An Eye-tracking Study.",
                    "Avoiding Plagiarism in Systematic Literature Reviews: An Update Concern.",
                    "Cohort Studies in Software Engineering: A Vision of the Future.",
                    "Automatic Identification of Code Smell Discussions on Stack Overflow: A Preliminary Investigation.",
                    "Web Frameworks for Desktop Apps: an Exploratory Study.",
                    "GASSER: Genetic Algorithm for teSt Suite Reduction.",
                    "Beyond Accuracy: ROI-driven Data Analytics of Empirical Data.",
                    "Profiling Developers Through the Lens of Technical Debt.",
                    "On the use of C# Unsafe Code Context: An Empirical Study of Stack Overflow.",
                    "Java Cryptography Uses in the Wild.",
                    "What Makes Agile Test Artifacts Useful?: An Activity-Based Quality Model from a Practitioners' Perspective.",
                    "A Taste of the Software Industry Perception of Technical Debt and its Management in Uruguay: A survey in software industry.",
                    "Getting Started with Chaos Engineering - design of an implementation framework in practice."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "13th ESEM 2019",
        "info": "Porto de Galinhas, Recife, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2019",
                "sub_name": "2019 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM 2019, Porto de Galinhas, Recife, Brazil, September 19-20, 2019.",
                "count": 48,
                "papers": [
                    "Framework Code Samples: How Are They Maintained and Used by Developers?",
                    "Initial findings on the evaluation of a model-based testing tool in the test design process.",
                    "Do Research and Practice of Code Smell Identification Walk Together? A Social Representations Analysis.",
                    "Multivocal literature reviews in software engineering: Preliminary findings from a tertiary study.",
                    "Software Engineering Research Community Viewpoints on Rapid Reviews.",
                    "Characterizing Attacker Behavior in a Cybersecurity Penetration Testing Competition.",
                    "What should I document? A preliminary systematic mapping study into API documentation knowledge.",
                    "A Case Study on Automated Fuzz Target Generation for Large Codebases.",
                    "Quality Requirements: Analysis of Utilization in the Systems of a Financial Institution.",
                    "Continuous Integration Theater.",
                    "The Impact of Software Security Practices on Development Effort: An Initial Survey.",
                    "Boosting Agile by Using User-Centered Design and Lean Startup: A Case Study of the Adoption of the Combined Approach in Software Development.",
                    "Enhancing Python Compiler Error Messages via Stack.",
                    "A Large-Scale Empirical Study on Control Flow Identification of Smart Contracts.",
                    "Understanding Development Process of Machine Learning Systems: Challenges and Solutions.",
                    "Comprehending Energy Behaviors of Java I/O APIs.",
                    "Towards a Holistic Definition of Requirements Debt.",
                    "Thoth: A Web-based Tool to Support Systematic Reviews.",
                    "Temporal Discounting in Software Engineering: A Replication Study.",
                    "Practical experiences and value of applying software analytics to manage quality.",
                    "Detecting and Reporting Object-Relational Mapping Problems: An Industrial Report.",
                    "An Evaluation of Knowledge Translation in Software Engineering.",
                    "A Method to Evaluate Knowledge Resources in Agile Software Development.",
                    "Plan-Driven Approaches Are Alive and Kicking in Agile Global Software Development.",
                    "An Empirical Study on Technical Debt in a Finnish SME.",
                    "Testability First!",
                    "Land of Lost Knowledge: An Initial Investigation into Projects Lost Knowledge.",
                    "How Different Is It Between Machine-Generated and Developer-Provided Patches? : An Empirical Study on the Correct Patches Generated by Automated Program Repair Techniques.",
                    "Predicting Merge Conflicts in Collaborative Software Development.",
                    "Towards Standardizing and Improving Classification of Bug-Fix Commits.",
                    "Do Higher Incentives Lead to Better Performance? - An Exploratory Study on Software Crowdsourcing.",
                    "PopCon: Mining Popular Software Configurations from Community.",
                    "On the Impact of Refactoring on the Relationship between Quality Attributes and Design Metrics.",
                    "Revisiting and Improving SZZ Implementations.",
                    "Diversity and Inclusion in Open Source Software (OSS) Projects: Where Do We Stand?",
                    "Usability Technical Debt in Software Projects: A Multi-Case Study.",
                    "On the abandonment and survival of open source projects: An empirical investigation.",
                    "Evaluating data-flow coverage in spectrum-based fault localization.",
                    "A Quantitative Study on Characteristics and Effect of Batch Refactoring on Code Smells.",
                    "The Impact of Developer Experience in Using Java Cryptography.",
                    "Affiliated Participation in Open Source Communities.",
                    "An Exploratory Study of How Specialists Deal with Testing in Data Stream Processing Applications.",
                    "Why is Developing Machine Learning Applications Challenging? A Study on Stack Overflow Posts.",
                    "A Function Point Formulation for the Software Release Planning Problem.",
                    "Effective team onboarding in Agile software development: techniques and goals.",
                    "Investigating the Validity of Ground Truth in Code Reviewer Recommendation Studies.",
                    "On the Relationship Between Coupling and Refactoring: An Empirical Viewpoint.",
                    "Ethical Interviews in Software Engineering."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "12th ESEM 2018",
        "info": "Oulu, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2018",
                "sub_name": "Proceedings of the 12th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM 2018, Oulu, Finland, October 11-12, 2018.",
                "count": 58,
                "papers": [
                    "Architecture, technologies and challenges for cyber-physical systems in industry 4.0: a systematic mapping study.",
                    "Are 20% of files responsible for 80% of defects?",
                    "Are mutants really natural?: a study on how \"naturalness\" helps mutant selection.",
                    "Assessing the effect of data transformations on test suite compilation.",
                    "The birth, growth, death and rejuvenation of software maintenance communities.",
                    "Building a collaborative culture: a grounded theory of well succeeded devops adoption in practice.",
                    "Calibrating use case points using bayesian analysis.",
                    "Comparing techniques for aggregating interrelated replications in software engineering.",
                    "The effect of noise on software engineers' performance.",
                    "An empirical investigation of transferring research to software technology innovation: a case of data-driven national security software.",
                    "An empirical study of design discussions in code review.",
                    "An empirical study of inadequate and adequate test suite reduction approaches.",
                    "An empirical study of WIP in kanban teams.",
                    "An exploratory study of software sustainability dimensions and characteristics: end user perspectives in the kingdom of Saudi Arabia (KSA).",
                    "Identifying unmaintained projects in github.",
                    "Improving problem identification via automated log clustering using dimensionality reduction.",
                    "Is there a \"golden\" feature set for static warning identification?: an experimental evaluation.",
                    "A longitudinal cohort study on the retainment of test-driven development.",
                    "Needs and challenges for a platform to support large-scale requirements engineering: a multiple-case study.",
                    "No search allowed: what risk modeling notation to choose?",
                    "Prediction of relatedness in stack overflow: deep learning vs. SVM: a reproducibility study.",
                    "Relationship between geographical location and evaluation of developer contributions in github.",
                    "Revisiting the size effect in software fault prediction models.",
                    "Simultaneous measurement of program comprehension with fMRI and eye tracking: a case study.",
                    "Software analytics in continuous delivery: a case study on success factors.",
                    "Speeding up mutation testing via the cloud: lessons learned for further optimisations.",
                    "A scalable and efficient approach for compiling and analyzing commit history.",
                    "Understanding the software development practices of blockchain projects: a survey.",
                    "Using experience sampling to link software repositories with emotions and work well-being.",
                    "What do concurrency developers ask about?: a large-scale study using stack overflow.",
                    "Applying pattern-driven maintenance: a method to prevent latent unhandled exceptions in web applications.",
                    "Automatic topic classification of test cases using text mining at an Android smartphone vendor.",
                    "Computer games are serious business and so is their quality: particularities of software testing in game development from the perspective of practitioners.",
                    "Decision making and visualizations based on test results.",
                    "Defining, measuring and monitoring IT service goals and strategies: preliminary results and pitfalls from a qualitative study with IT service managers.",
                    "Development processes and practices in a small but growing software industry: a practitioner survey in New Zealand.",
                    "An empirical study of process policies and metrics to manage productivity and quality for maintenance of critical software systems at the jet propulsion laboratory.",
                    "Implementing agile practices: the experience of TSol.",
                    "The most common causes and effects of technical debt: first results from a global family of industrial surveys.",
                    "Software quality assessment in practice: a hypothesis-driven framework.",
                    "Understanding what industry wants from requirements engineers: an exploration of RE jobs in Canada.",
                    "Vulnerable open source dependencies: counting those that matter.",
                    "Can app changelogs improve requirements classification from app reviews?: an exploratory study.",
                    "Comparing the effectiveness of goal-oriented languages: results from a controlled experiment.",
                    "An empirical perspective on security challenges in large-scale agile software development.",
                    "Experimental validation of the suitability of virtualization-based replication for fault tolerance in real-time control of electric grids.",
                    "Maintaining systematic literature reviews: benefits and drawbacks.",
                    "Measuring human values in software engineering.",
                    "Measuring LDA topic stability from clusters of replicated runs.",
                    "On the use of emoticons in open source software development.",
                    "A preliminary study of agility in business and production: cases of early-stage hardware startups.",
                    "What if a bug has a different origin?: making sense of bugs without an explicit bug introducing change.",
                    "When and who leaves matters: emerging results from an empirical study of employee turnover.",
                    "Measuresoftgram: a future vision of software product quality.",
                    "Standards of validity and the validity of standards in behavioral software engineering research: the perspective of psychological test theory.",
                    "Domain-specific modelware: to make the machine learning model reusable and reproducible.",
                    "Identifying bug-inducing changes for code additions.",
                    "Using semantic frames to identify related textual requirements: an initial validation."
                ]
            },
            {
                "sub_name_abbr": "conf/esem/2018megsus",
                "sub_name": "Proceedings of the 4th International Workshop on Measurement and Metrics for Green and Sustainable Software Systems co-located with Empirical Software Engineering International Week (ESEIW 2018), Oulu, Finland, - October 9, 2018.",
                "count": 7,
                "papers": [
                    "Conceptual modeling of goals and metrics to visualize the measurement of sustainability (Invited Talk).",
                    "An introduction to persuasive systems design for sustainability (Invited Talk).",
                    "A focus group for operationalizing software sustainability with the MEASURE platform.",
                    "Classifying the measures of software sustainability according to the current perceptions.",
                    "Characterizing a source code model with energy measurements.",
                    "End-user perceptions on social sustainability in context-aware applications: Validation of an experiment design.",
                    "Towards green metrics integration in the MEASURE platform."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "11th ESEM 2017",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2017",
                "sub_name": "2017 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM 2017, Toronto, ON, Canada, November 9-10, 2017.",
                "count": 61,
                "papers": [
                    "Are One-Time Contributors Different? A Comparison to Core and Periphery Developers in FLOSS Repositories.",
                    "Code Churn: A Neglected Metric in Effort-Aware Just-in-Time Defect Prediction.",
                    "Security Vulnerabilities in Categories of Clones and Non-Cloned Code: An Empirical Study.",
                    "Early Phase Cost Models for Agile Software Processes in the US DoD.",
                    "Automatic Building of Java Projects in Software Repositories: A Study on Feasibility and Challenges.",
                    "Characterizing Developer Behavior in Cloud Based IDEs.",
                    "An Empirical Examination of the Relationship between Code Smells and Merge Conflicts.",
                    "On the Influence of Human Factors for Identifying Code Smells: A Multi-Trial Empirical Study.",
                    "What if I Had No Smells?",
                    "Would You Like to Motivate Software Testers? Ask Them How.",
                    "Characterizing Software Developers by Perceptions of Productivity.",
                    "Beyond Continuous Delivery: An Empirical Investigation of Continuous Deployment Challenges.",
                    "Where Is the Road for Issue Reports Classification Based on Text Mining?",
                    "Predicting the Vector Impact of Change - An Industrial Case Study at Brightsquid.",
                    "Managing Hidden Dependencies in OO Software: A Study Based on Open Source Projects.",
                    "STRESS: A Semi-Automated, Fully Replicable Approach for Project Selection.",
                    "Change-Aware Build Prediction Model for Stall Avoidance in Continuous Integration.",
                    "Delta-Bench: Differential Benchmark for Static Analysis Security Testing Tools.",
                    "An Ontology-Based Approach to Automate Tagging of Software Artifacts.",
                    "REACT: An Approach for Capturing Rationale in Chat Messages.",
                    "Using a Visual Abstract as a Lens for Communicating and Promoting Design Science Research in Software Engineering.",
                    "Member Checking in Software Engineering Research: Lessons Learned from an Industrial Case Study.",
                    "Investigating the Use of a Hybrid Search Strategy for Systematic Reviews.",
                    "Notifying and Involving Users in Experimentation: Ethical Perceptions of Software Practitioners.",
                    "Reporting Ethics Considerations in Software Engineering Publications.",
                    "Describing What Experimental Software Engineering Experts Do When They Design Their Experiments - A Qualitative Study.",
                    "Analysis of the Understanding of the Concepts of Task and Skill Variety by Software Engineering Professionals.",
                    "Understanding the Heterogeneity of Contributors in Bug Bounty Programs.",
                    "Autonomy in Software Engineering: A Preliminary Study on the Influence of Education Level and Professional Experience.",
                    "Team Maturity in Software Engineering Teams.",
                    "Towards an Approach to Prevent Social Loafing in Software Development Teams.",
                    "Estimating Energy Impact of Software Releases and Deployment Strategies: The KPMG Case Study.",
                    "Graphical vs. Tabular Notations for Risk Models: On the Role of Textual Labels and Complexity.",
                    "The Influence of Requirements in Software Model Development in an Industrial Environment.",
                    "An Industry Perspective to Comparing the SQALE and Quamoco Software Quality Models.",
                    "Formative Evaluation of a Tool for Managing Software Quality.",
                    "The Impact of Coverage on Bug Density in a Large Industrial Software Project.",
                    "Quantifying the Transition from Python 2 to 3: An Empirical Study of Python Applications.",
                    "Which Version Should Be Released to App Store?",
                    "Mining Logs to Model the Use of a System.",
                    "File-Level Defect Prediction: Unsupervised vs. Supervised Models.",
                    "Training Data Selection for Cross-Project Defection Prediction: Which Approach Is Better?",
                    "The Significant Effects of Data Sampling Approaches on Software Defect Prioritization and Classification.",
                    "Eliciting Strategies for the GQM+Strategies Approach in IT Service Measurement Initiatives.",
                    "Looking for Peace of Mind? Manage Your (Technical) Debt: An Exploratory Field Study.",
                    "Characterizing Software Engineering Work with Personas Based on Knowledge Worker Actions.",
                    "Common Bug-Fix Patterns: A Large-Scale Observational Study.",
                    "Mining Version Control System for Automatically Generating Commit Comment.",
                    "House of Cards: Code Smells in Open-Source C# Repositories.",
                    "How Does Machine Translated User Interface Affect User Experience? A Study on Android Apps.",
                    "On Software Productivity Analysis with Propensity Score Matching.",
                    "An Exploratory Analysis of a Hybrid OSS Company's Forum in Search of Sales Leads.",
                    "What the Job Market Wants from Requirements Engineers? An Empirical Analysis of Online Job Ads from the Netherlands.",
                    "Agile Quality Requirements Engineering Challenges: First Results from a Case Study.",
                    "Issues and Opportunities for Human Error-Based Requirements Inspections: An Exploratory Study.",
                    "Assessing the Intuitiveness of Qualitative Contribution Relationships in Goal Models: An Exploratory Experiment.",
                    "Identifying Software Decays: A System Usage Perspective.",
                    "An Empirical Study of Open Source Virtual Reality Software Projects.",
                    "Beyond Boxes and Lines: Creating and Empirically Evaluating Alternative Visualizations for Requirements Conceptual Models.",
                    "A Comparison of Dictionary Building Methods for Sentiment Analysis in Software Engineering Text.",
                    "Structured Synthesis Method: The Evidence Factory Tool."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "10th ESEM 2016",
        "info": "Ciudad Real, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2016",
                "sub_name": "Proceedings of the 10th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM 2016, Ciudad Real, Spain, September 8-9, 2016.",
                "count": 58,
                "papers": [
                    "Is there a Future for Empirical Software Engineering?",
                    "What about the Benefits?: A Missing Perspective in Software Engineering.",
                    "An External Replication on the Effects of Test-driven Development Using a Multi-site Blind Analysis Approach.",
                    "A Study of Documentation in Agile Software Projects.",
                    "Strategies for doing Agile in a non-Agile Environment.",
                    "Towards Effectively Test Report Classification to Assist Crowdsourced Testing.",
                    "The Innovative Behaviour of Software Engineers: Findings from a Pilot Case Study.",
                    "Who Should Take This Task?: Dynamic Decision Support for Crowd Workers.",
                    "A Pilot Case Study on Innovative Behaviour: Lessons Learned and Directions for Future Work.",
                    "Preliminary Findings about the Nature of Work in Software Engineering: An Exploratory Survey.",
                    "Monitoring Software Quality by Means of Simulation Methods.",
                    "So You Need More Method Level Datasets for Your Software Defect Prediction?: Voilà!",
                    "Moving to Stack Overflow: Best-Answer Prediction in Legacy Developer Forums.",
                    "Mining Technology Landscape from Stack Overflow.",
                    "Software Project Managers' Perceptions of Productivity Factors: Findings from a Qualitative Study.",
                    "Software Development Practices, Barriers in the Field and the Relationship to Software Quality.",
                    "Experiences from Measuring Learning and Performance in Large-Scale Distributed Software Development.",
                    "Virtual Team Configurations that Promote Better Product Quality.",
                    "Sustainable Software Development through Overlapping Pair Rotation.",
                    "Towards a Substantive Theory of Decision-Making in Software Project Management: Preliminary Findings from a Qualitative Study.",
                    "How Are Discussions Associated with Bug Reworking?: An Empirical Study on Open Source Projects.",
                    "Predicting Defectiveness of Software Patches.",
                    "An Empirical Study on Performance Bugs for Highly Configurable Software Systems.",
                    "Evaluating Bug-Fixing in Software Product Lines: an Industrial Case Study.",
                    "Static Analysis and Penetration Testing from the Perspective of Maintenance Teams.",
                    "Is Newer Always Better?: The Case of Vulnerability Prediction Models.",
                    "Release Readiness Classification: An Explorative Case Study.",
                    "Identifying Thresholds for Software Faultiness via Optimistic and Pessimistic Estimations.",
                    "Predicting Crashing Releases of Mobile Applications.",
                    "Detection of Requirement Errors and Faults via a Human Error Taxonomy: A Feasibility Study.",
                    "Diagram Size vs. Layout Flaws: Understanding Quality Factors of UML Diagrams.",
                    "Do Models Improve the Understanding of Safety Compliance Needs?: Insights from a Pilot Experiment.",
                    "Advantages and Disadvantages of using Shared code from the Developers Perspective: A qualitative study.",
                    "Using Eye Tracking to Investigate Reading Patterns and Learning Styles of Software Requirement Inspectors to Enhance Inspection Team Outcome.",
                    "DIGS: A Framework for Discovering Goals for Security Requirements Engineering.",
                    "Energy Efficiency of ORM Approaches: an Empirical Evaluation.",
                    "A Study on the Influence of Software and Hardware Features on Program Energy.",
                    "Clustering Mobile Apps Based on Mined Textual Features.",
                    "Understanding the Contribution of Non-source Documents in Improving Missing Link Recovery: An Empirical Study.",
                    "Semantic Coupling Between Classes: Corpora or Identifiers?",
                    "Social Diversity and Growth Levels of Open Source Software Projects on GitHub.",
                    "Perceived Benefits of Adopting Continuous Delivery Practices.",
                    "Continuous Integration Beyond the Team: A Tooling Perspective on Challenges in the Automotive Industry.",
                    "The Intersection of Continuous Deployment and Architecting Process: Practitioners' Perspectives.",
                    "Bottom-up Adoption of Continuous Delivery in a Stage-Gate Managed Software Organization.",
                    "Building an Ensemble for Software Defect Prediction Based on Diversity Selection.",
                    "The Impact of Task Granularity on Co-evolution Analyses.",
                    "Function Point Analysis for Software Maintenance.",
                    "Staffing Strategies for Maintenance of Critical Software Systems at the Jet Propulsion Laboratory.",
                    "Using Software Non-Functional Assessment Process to Complement Function Points for Software Maintenance.",
                    "The Obscure Process of Innovation Assessment: A Report of an Industrial Survey.",
                    "Worse Than Spam: Issues In Sampling Software Developers.",
                    "Using Forward Snowballing to update Systematic Reviews in Software Engineering.",
                    "Is effectiveness sufficient to choose an intervention?: Considering resource use in empirical software engineering.",
                    "Surveys in Software Engineering: Identifying Representative Samples.",
                    "How Practitioners Perceive the Relevance of ESEM Research.",
                    "Evidence Briefings: Towards a Medium to Transfer Knowledge from Systematic Reviews to Practitioners.",
                    "Survey Guidelines in Software Engineering: An Annotated Review."
                ]
            },
            {
                "sub_name_abbr": "conf/esem/2016megsus",
                "sub_name": "Proceedings of the 3rd International Workshop on Measurement and Metrics for Green and Sustainable Software Systems, MeGSuS 2016, co-located with 10th International Symposium on Empirical Software Engineering and Measurement (ESEM 2016), Ciudad Real, Spain, September 7, 2016.",
                "count": 5,
                "papers": [
                    "Indicators for Green in IT Audits: A Systematic Mapping Study.",
                    "A Learning based approach for Green Software Measurements.",
                    "An Effort Allocation Method to Optimal Code Sanitization for Quality-Aware Energy Efficiency Improvement.",
                    "Measuring Green Software Engineering In the MEASURE ITEA 3 Project.",
                    "How Sustainable are Model Software Artifacts in the Context of Model Driven Software Engineering."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "9th ESEM 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2015",
                "sub_name": "2015 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM 2015, Beijing, China, October 22-23, 2015.",
                "count": 36,
                "papers": [
                    "Noises in Interaction Traces Data and Their Impact on Previous Research Studies.",
                    "An Empirical Study on the Patterns of Eye Movement during Summarization Tasks.",
                    "Retrieving Diverse Opinions from App Reviews.",
                    "An Empirical Study of Design Degradation: How Software Projects Get Worse over Time.",
                    "Code Bad Smell Detection through Evolutionary Data Mining.",
                    "Empirical Analysis of Change-Proneness in Methods Having Local Variables with Long Names and Comments.",
                    "An Exploratory Study on the Evolution of C Programming in the Unix Operating System.",
                    "Language Matters.",
                    "Award vs. Worker Behaviors in Competitive Crowdsourcing Tasks.",
                    "The Importance of Being Isolated: An Empirical Study on Chromium Reviews.",
                    "Energy Consumption Analysis of Algorithms Implementations.",
                    "An Exploratory Study on Technology Transfer in Software Engineering.",
                    "Ramp-Up Journey of New Hires: Tug of War of Aids and Impediments.",
                    "In Quest for Proper Mediums for Technology Transfer in Software Engineering.",
                    "Investigation on Common Software Process Weaknesses in Automotive.",
                    "Investigating Samples Representativeness for an Online Experiment in Java Code Search.",
                    "An Analysis of Software Engineering Experiments Using Human Subjects.",
                    "Replication of Empirical Studies in Software Engineering: An Update of a Systematic Mapping Study.",
                    "Citation and Topic Analysis of the ESEM Papers.",
                    "Using Citation Behavior to Rethink Academic Impact in Software Engineering.",
                    "Does Quality of Requirements Specifications Matter? Combined Results of Two Empirical Studies.",
                    "Aggregating Empirical Evidence about the Benefits and Drawbacks of Software Reference Architectures.",
                    "How to Specify Non-Functional Requirements to Support Seamless Modeling? A Study Design and Preliminary Results.",
                    "On the Benefits and Barriers When Adopting Software Modelling and Model Driven Techniques - An External, Differentiated Replication.",
                    "How to Make Best Use of Cross-Company Data for Web Effort Estimation?",
                    "Pricing via Functional Size - A Case Study of a Company's Portfolio of 77 Outsourced Projects.",
                    "Introducing a Ripple Effect Measure: A Theoretical and Empirical Validation.",
                    "Identifying Metrics' Biases When Measuring or Approximating Size in Heterogeneous Languages.",
                    "Using Trac for Empirical Data Collection and Analysis in Developing Small and Medium-Sized Enterprise Systems.",
                    "Will This Bug-Fixing Change Break Regression Testing?",
                    "Navigate, Understand, Communicate: How Developers Locate Performance Bugs.",
                    "A Mapping Study of Software Causal Factors for Improving Maintenance.",
                    "Improving Performance and Maintainability of Object Cloning with Lazy Clones: An Empirical Evaluation.",
                    "Don't Call Us, We'll Call You: Characterizing Callbacks in Javascript.",
                    "An Empirical Study on C++ Concurrency Constructs.",
                    "Assessing Semistructured Merge in Version Control Systems: A Replicated Experiment."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "8th ESEM 2014",
        "info": "Torino, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2014",
                "sub_name": "2014 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM '14, Torino, Italy, September 18-19, 2014.",
                "count": 72,
                "papers": [
                    "What do game developers test in their products?",
                    "The impact of test ownership and team structure on the reliability and effectiveness of quality test runs.",
                    "A systematic mapping study on testing technique experiments: has the situation changed since 2000?",
                    "Evaluating the TESTAR tool in an industrial case study.",
                    "How is exploratory testing used? A state-of-the-practice survey.",
                    "The effect of evolutionary coupling on software defects: an industrial case study on a legacy system.",
                    "Empirical and face validity of software maintenance defect models used at the jet propulsion laboratory.",
                    "A replicated study on duplicate detection: using apache lucene to search among Android defects.",
                    "Evaluating capture and replay and model-based performance testing tools: an empirical comparison.",
                    "Impact of process conformance on the effects of test-driven development.",
                    "On knowledge transfer skill in pair programming.",
                    "Networking in a large-scale distributed agile project.",
                    "Sampling improvement in software engineering surveys.",
                    "Comparing and contrasting model-driven engineering at three large companies.",
                    "Productivity for proof engineering.",
                    "An UML-based approach to software development cost estimation.",
                    "A controlled experiment to evaluate the effects of mindfulness in software engineering.",
                    "Improving requirements glossary construction via clustering: approach and industrial case studies.",
                    "Engineering of quality requirements as perceived by near-shore development centers' architects in eastern Europe: the hole in the whole.",
                    "Evaluation in practice: artifact-based requirements engineering and scenarios in smart mobility domains.",
                    "On the impact of passive voice requirements on domain modelling.",
                    "Using templates to elicit implied security requirements from functional requirements - a controlled experiment.",
                    "Discovering buffer overflow vulnerabilities in the wild: an empirical study.",
                    "Security triage: an industrial case study on the effectiveness of a lean methodology to identify security requirements.",
                    "FixerCache: unsupervised caching active developers for diverse bug triage.",
                    "What's in a bug report?",
                    "Effect of temporal collaboration network, maintenance activity, and experience on defect exposure.",
                    "Debsources: live and historical views on macro-level software evolution.",
                    "A qualitative analysis of software build system changes and build ownership styles.",
                    "Patterns of folder use and project popularity: a case study of github repositories.",
                    "A replication case study to measure the architectural quality of a commercial system.",
                    "Motivated software engineers are engaged and focused, while satisfied ones are happy.",
                    "Impact of developer reputation on code review outcomes in OSS projects: an empirical investigation.",
                    "Software population pyramids: the current and the future of OSS development communities.",
                    "Estimation of student's programming expertise.",
                    "How do code refactorings affect energy usage?",
                    "Impacts of design pattern decay on system quality.",
                    "Evolution of design patterns: a replication study.",
                    "Design pattern decay: the case for class grime.",
                    "Mining energy traces to aid in software development: an empirical case study.",
                    "Measuring shared understanding in software project teams using pathfinder networks.",
                    "ISBSG variables most frequently used for software effort estimation: a mapping review.",
                    "Simple empirical software effort estimation model.",
                    "An approach for effort estimation in incremental software development using cosmic function points.",
                    "Evaluating strategies for study selection in systematic literature studies.",
                    "Writing for synthesis of evidence in empirical software engineering.",
                    "Using qualitative metasummary to synthesize empirical findings in literature reviews.",
                    "Towards a framework to support large scale sampling in software engineering surveys.",
                    "Towards a semantic knowledge base on threats to validity and control actions in controlled experiments.",
                    "Support mechanisms to conduct empirical studies in software engineering.",
                    "Tracing back the history of commits in low-tech reviewing environments: a case study of the Linux kernel.",
                    "Bridging the gap: SE technology transfer into practice: study design and preliminary results.",
                    "The use of systematic reviews in evidence based software engineering: a systematic mapping study.",
                    "What we have learned about the value of software assurance.",
                    "The role of mentoring and project characteristics for onboarding in open source software projects.",
                    "An empirical simulation-based study of real-time speech translation for multilingual global project teams.",
                    "Process mining can be applied to software too!",
                    "Where do we stand in requirements engineering improvement today?: first results from a mapping study.",
                    "Forking and coordination in multi-platform development: a case study.",
                    "Monitoring bottlenecks in achieving release readiness: a retrospective case study across ten OSS projects.",
                    "Factors impacting rapid releases: an industrial case study.",
                    "Industrial evaluation of the impact of quality-driven release planning.",
                    "Empirical analysis of comments and fault-proneness in methods: can comments point to faulty methods?",
                    "Studying abbreviated vs. full-word identifier names when dealing with faults: an external replication.",
                    "Classification of project team patterns for benchmarking.",
                    "Function point structure and applicability validation using the ISBSG dataset: a replicated study.",
                    "Enriching source code by empirical metadata.",
                    "Tracking line changes in source code repositories.",
                    "Cooperation between information system development and operations: a literature review.",
                    "VCS-analyzer for software evolution empirical analysis.",
                    "Reviewing technical approaches for sharing and preservation of experimental data.",
                    "Process simulation for software engineering education."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "7th ESEM 2013",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2013",
                "sub_name": "2013 ACM / IEEE International Symposium on Empirical Software Engineering and Measurement, Baltimore, Maryland, USA, October 10-11, 2013.",
                "count": 56,
                "papers": [
                    "High Impact Research: Blending Basic and Applied Methods.",
                    "Towards Understanding Replication of Software Engineering Experiments.",
                    "An Empirical Study of API Usability.",
                    "Real Challenges in Mobile App Development.",
                    "Tracing Requirements and Source Code during Software Development: An Empirical Study.",
                    "Automatic Checking of Conformance to Requirement Boilerplates via Text Chunking: An Industrial Case Study.",
                    "Learning from Open-Source Projects: An Empirical Study on Defect Prediction.",
                    "An Empirical Study of Client-Side JavaScript Bugs.",
                    "When a Patch Goes Bad: Exploring the Properties of Vulnerability-Contributing Commits.",
                    "Have Agile Techniques been the Silver Bullet for Software Development at Microsoft?",
                    "ScrumBut, But Does it Matter? A Mixed-Method Study of the Planning Process of a Multi-team Scrum Organization.",
                    "Obstacles to Efficient Daily Meetings in Agile Development Projects: A Case Study.",
                    "A Replicated Experiment on the Effectiveness of Test-First Development.",
                    "How Significant is the Effect of Fault Interactions on Coverage-Based Fault Localizations?",
                    "Expectations and Achievements: A Longitudinal Study on an Offshoring Strategy.",
                    "Impact of Peer Code Review on Peer Impression Formation: A Survey.",
                    "Lessons from Conducting a Distributed Quasi-experiment.",
                    "Using Meta-ethnography to Synthesize Research: A Worked Example of the Relations between Personality and Software Team Processes.",
                    "An Experimental Comparison of Two Risk-Based Security Methods.",
                    "Using Ensembles for Web Effort Estimation.",
                    "Benchmarking Usability and Performance of Multicore Languages.",
                    "DevNet: Exploring Developer Collaboration in Heterogeneous Networks of Bug Repositories.",
                    "Identifying Barriers to the Systematic Literature Review Process.",
                    "Identifying Experimental Incidents in Software Engineering Replications.",
                    "Experimental Comparison of Two Safety Analysis Methods and Its Replication.",
                    "Replication Data Management: Needs and Solutions - An Initial Evaluation of Conceptual Approaches for Integrating Heterogeneous Replication Study Data.",
                    "IR in Software Traceability: From a Bird's Eye View.",
                    "Impact of Triage: A Study of Mozilla and Gnome.",
                    "On the Use of Input/Output Queries for Code Search.",
                    "An Embedded Multiple-Case Study on OSS Design Quality Assessment across Domains.",
                    "Evaluating Software Product Metrics with Synthetic Defect Data.",
                    "The Case for Knowledge Translation.",
                    "Understanding the Impact of Artefact-Based RE - Design of a Replication Study.",
                    "An Empirical Validation of Coupling Metrics Using Automated Refactoring.",
                    "Using Amazon's Mechanical Turk for User Studies: Eight Things You Need to Know.",
                    "Would Sociable Software Engineers Observe Better?",
                    "Incremental Estimation of Project Failure Risk with Naive Bayes Classifier.",
                    "Classification of Language Interactions.",
                    "CCM: A Tool for Measuring Combinatorial Coverage of System State Space.",
                    "Motivation to Perform Systematic Reviews and their Impact on Software Engineering Practice.",
                    "Tools to Support Systematic Literature Reviews in Software Engineering: A Mapping Study.",
                    "Can Automated Text Classification Improve Content Analysis of Software Project Data?",
                    "Combinatorial Testing Tool Learnability in an Industrial Environment.",
                    "Recommendations to the Adoption of New Software Practices: A Case Study of Team Intention and Behavior in Three Software Companies.",
                    "Application of Statistical Process Control to Software Defect Metrics: An Industry Experience Report.",
                    "Evaluating the FITTEST Automated Testing Tools: An Industrial Case Study.",
                    "Cost Effectiveness of Unit Testing: A Case Study in a Financial Institution.",
                    "The Impact of Agile Principles and Practices on Large-Scale Software Development Projects: A Multiple-Case Study of Two Projects at Ericsson.",
                    "Constructing Defect Predictors and Communicating the Outcomes to Practitioners.",
                    "Towards a Metric Suite Proposal to Quantify Confirmation Biases of Developers.",
                    "The Value of Certifying Software Release Readiness: An Exploratory Study of Certification for a Critical System at JPL.",
                    "Debugging Revisited: Toward Understanding the Debugging Needs of Contemporary Software Developers.",
                    "Message from the IDoESE 2013 Doctoral Symposium Chairs.",
                    "Message from the PROMISE 2013 Chairs.",
                    "Message from the RESER 2013 Workshop Chairs.",
                    "Message from the MTD 2013 Workshop Chairs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "6th ESEM 2012",
        "info": "Lund, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2012",
                "sub_name": "2012 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement, ESEM '12, Lund, Sweden - September 19 - 20, 2012.",
                "count": 45,
                "papers": [
                    "Dynamic adaptive search based software engineering.",
                    "Challenges of applying ethnography to study software practices.",
                    "What works for whom, where, when, and why?: on the role of context in empirical software engineering.",
                    "Systematic literature studies: database searches vs. backward snowballing.",
                    "On the definition of dynamic software measures.",
                    "Experimental assessment of software metrics using automated refactoring.",
                    "Characterizing the roles of classes and their fault-proneness through change metrics.",
                    "Analyzing differences in risk perceptions between developers and acquirers in OTS-based custom software projects using stakeholder analysis.",
                    "Using a follow-on survey to investigate why use of the visitor, singleton & facade patterns is controversial.",
                    "Empirical analysis of user data in game software development.",
                    "Handling categorical variables in effort estimation.",
                    "Discretization methods for NBC in effort estimation: an empirical comparison based on ISBSG projects.",
                    "Questioning software maintenance metrics: a comparative case study.",
                    "Evolution of features and their dependencies - an explorative study in OSS.",
                    "A hybrid release planning method and its empirical justification.",
                    "Plat_Forms 2011: finding emergent properties of web application development platforms.",
                    "Dispersion, coordination and performance in global software teams: a systematic review.",
                    "Survey on agile and lean usage in finnish software industry.",
                    "Analyzing inspection data for heuristic effectiveness.",
                    "Further analysis on the validation of a usability inspection method for model-driven web development.",
                    "Lessons learned from evaluating a checklist for reporting experimental and observational research.",
                    "A study of reusability, complexity, and reuse design principles.",
                    "Seamless integration of order processing in MS outlook using smartoffice: an empirical evaluation.",
                    "Visualizing the invisible - symbols and metaphors in software engineering?",
                    "Method-level bug prediction.",
                    "Studying volatility predictors in open source software.",
                    "Predicting defect numbers based on defect state transition models.",
                    "Recommender systems for manual testing: deciding how to assign tests in a test team.",
                    "Testing highly complex system of systems: an industrial case study.",
                    "Application of kusumoto cost-metric to evaluate the cost effectiveness of software inspections.",
                    "Effects of four distances on communication processes in global software projects.",
                    "Inter-team coordination in large-scale globally distributed scrum: do scrum-of-scrums really work?",
                    "Alignment of business, architecture, process, and organisation in a software development context.",
                    "Software quality modeling experiences at an oil company.",
                    "Managing technical debt in practice: an industrial report.",
                    "Assessing the impact of real-time machine translation on requirements meetings: a replicated experiment.",
                    "Does the prioritization technique affect stakeholders' selection of essential software product features?",
                    "How can open source software development help requirements management gain the potential of open innovation: an exploratory study.",
                    "Towards a model to support in silico studies of software evolution.",
                    "On the role of composition code properties on evolving programs.",
                    "The effect of branching strategies on software quality.",
                    "How many individuals to use in a QA task with fixed total effort?",
                    "The impact of process maturity on defect density.",
                    "Language interaction and quality issues: an exploratory study.",
                    "A comparison of database fault detection capabilities using mutation testing."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "5th ESEM 2011",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2011",
                "sub_name": "Proceedings of the 5th International Symposium on Empirical Software Engineering and Measurement, ESEM 2011, Banff, AB, Canada, September 22-23, 2011.",
                "count": 58,
                "papers": [
                    "Empirical Software Engineering Research - The Good, The Bad, The Ugly.",
                    "On the Effectiveness of Contracts as Test Oracles in the Detection and Diagnosis of Race Conditions and Deadlocks in Concurrent Object-Oriented Software.",
                    "Measuring the Efficacy of Code Clone Information in a Bug Localization Task: An Empirical Study.",
                    "A Qualitative Study of Open Source Software Development: The Open EMR Project.",
                    "How Simple is It to Measure Software Size and Complexity for an IT Practitioner?",
                    "A Survey of Metrics Use in Finnish Software Companies.",
                    "An Empirical Study on the Use of Team Building Criteria in Software Projects.",
                    "The Risk of Using the Q Heterogeneity Estimator for Software Engineering Experiments.",
                    "Using Visual Text Mining to Support the Study Selection Activity in Systematic Literature Reviews.",
                    "An Empirical Investigation of Systematic Reviews in Software Engineering.",
                    "One Technique is Not Enough: A Comparison of Vulnerability Discovery Techniques.",
                    "A Systematic Mapping Study on Software Engineering Testbeds.",
                    "A Case Study of Concolic Testing Tools and their Limitations.",
                    "Exploring Software Measures to Assess Program Comprehension.",
                    "How Good is Your Comment? A Study of Comments in Java Programs.",
                    "End-User Programmers and their Communities: An Artifact-based Analysis.",
                    "An Experimental Evaluation of the Impact of System Sequence Diagrams and System Operation Contracts on the Quality of the Domain Model.",
                    "Experimental Analysis of Textual and Graphical Representations for Software Architecture Design.",
                    "How Humans Merge UML-Models.",
                    "Supporting Online Updates of Software Product Lines: A Controlled Experiment.",
                    "Survey Reproduction of Defect Reporting in Industrial Software Development.",
                    "Mining Static Code Metrics for a Robust Prediction of Software Defect-Proneness.",
                    "Network Versus Code Metrics to Predict Defects: A Replication Study.",
                    "Measuring Architectural Change for Defect Estimation and Localization.",
                    "A Current Assessment of Software Development Effort Estimation.",
                    "Handling Estimation Uncertainty with Bootstrapping: Empirical Evaluation in the Context of Hybrid Prediction Methods.",
                    "How to Find Relevant Data for Effort Estimation?",
                    "Size Estimation of Cloud Migration Projects with Cloud Migration Point (CMP).",
                    "Recommended Steps for Thematic Synthesis in Software Engineering.",
                    "Quantitative Determination of the Relationship between Internal Validity and Bias in Software Engineering Experiments: Consequences for Systematic Literature Reviews.",
                    "The Structure of Design Theories, and an Analysis of their Use in Software Engineering Experiments.",
                    "Inferring Skill from Tests of Programming Performance: Combining Time and Quality.",
                    "Preserving Aspects via Automation: A Maintainability Study.",
                    "Design of an Empirical Study for Comparing the Usability of Concurrent Programming Languages.",
                    "Categories of Source Code in Industrial Systems.",
                    "Empirical Research in Software Process Modeling: A Systematic Literature Review.",
                    "Case Studies Synthesis: Brief Experience and Challenges for the Future.",
                    "A Knowledge Mapping Technique for Project-level Knowledge Flow Analysis.",
                    "Identifying Strategies for Study Selection in Systematic Reviews and Maps.",
                    "Common Agile Practices in Software Processes.",
                    "A Preliminary Study on Factors Affecting Software Testing Team Performance.",
                    "Scaling Scrum in a Large Distributed Project.",
                    "Software Engineers' Perceptions of Factors in Motivation: The Work, People, Obstacles.",
                    "Preliminary Findings from a Survey on the MD State of the Practice.",
                    "Modeling the Number of Active Software Users.",
                    "Towards Measurement of Confidence in Safety Cases.",
                    "The Cost of the Build Tax in Scientific Software.",
                    "What are Problem Causes of Software Projects? Data of Root Cause Analysis at Four Software Companies.",
                    "US DoD Application Domain Empirical Software Cost Analysis.",
                    "A Preliminary Survey on Subjective Measurements and Personal Insights into Factors of Perceived Future Project Success.",
                    "Predicting Development Effort from User Stories.",
                    "Formulation and Empirical Validation of a GQM Based Measurement Framework.",
                    "Goal-Driven Development Method for Managing Embedded System Projects: An Industrial Experience Report.",
                    "Composite Release Values for Normalized Product-level Metrics.",
                    "\"Is It Really a Defect?\" An Empirical Study on Measuring and Improving the Process of Software Defect Reporting.",
                    "Analyzing the Impact of Beliefs in Software Project Practices.",
                    "Obtaining Thresholds for the Effectiveness of Business Process Mining.",
                    "Scrum + Engineering Practices: Experiences of Three Microsoft Teams."
                ]
            },
            {
                "sub_name_abbr": "conf/esem/2011metrisec",
                "sub_name": "Third International Workshop on Security Measurements and Metrics, Metrisec@ESEM 2011, Banff, Alberta, Canada, September 21, 2011.",
                "count": 14,
                "papers": [
                    "Security Risk Management by Qualitative Vulnerability Analysis.",
                    "An Empirical Study of the Evolution of PHP Web Application Security.",
                    "Cyber Security Alert Warning System: A Socio-techinal Coordinate System Proposal.",
                    "An Enhanced Threat Identification Approach for Collusion Threats.",
                    "Quantifying the Effects of More Timely Certificate Revocation on Lightweight Mobile Devices.",
                    "Measuring Privacy Compliance with Process Specifications.",
                    "Performance Evaluation of Oracle VM Server Virtualization Software 64 Bit Linux Environment.",
                    "A Framework for Security Metrics Based on Operational System Attributes.",
                    "A Testbed for the Evaluation of Web Intrusion Prevention Systems.",
                    "Authentication Protocol for Preventing Damage by Loss and Theft of Smartphone.",
                    "A Cause and Effect Approach towards Risk Analysis.",
                    "Performance Measurement in Cross-Organizational Security Settings.",
                    "Experiences from Using Indicators to Validate Expert Judgments in Security Risk Analysis.",
                    "Are Vulnerability Disclosure Deadlines Justified?"
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "4th ESEM 2010",
        "info": "Bolzano/Bozen, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2010",
                "sub_name": "Proceedings of the International Symposium on Empirical Software Engineering and Measurement, ESEM 2010, 16-17 September 2010, Bolzano/Bozen, Italy.",
                "count": 68,
                "papers": [
                    "Synthesizing evidence in software engineering research.",
                    "Can we evaluate the quality of software engineering experiments?",
                    "Replications types in experimental disciplines.",
                    "Understanding the impact of code and process metrics on post-release defects: a case study on the Eclipse project.",
                    "An effective fault aware test case prioritization by incorporating a fault localization technique.",
                    "A machine learning approach for text categorization of fixing-issue commits on CVS.",
                    "Object oriented design pattern decay: a taxonomy.",
                    "Building empirical support for automated code smell detection.",
                    "Strengthening the empirical analysis of the relationship between Linus' Law and software security.",
                    "Test case selection and prioritization: risk-based or design-based?",
                    "An empirical investigation into a large-scale Java open source code repository.",
                    "A survey of scientific software development.",
                    "Transition from a plan-driven process to Scrum: a longitudinal case study on software quality.",
                    "Are developers complying with the process: an XP study.",
                    "Perceived productivity threats in large agile development projects.",
                    "An empirical study of specification by example in a software engineering tool.",
                    "On the effectiveness of screen mockups in requirements engineering: results from an internal replication.",
                    "A comprehensive characterization of NLP techniques for identifying equivalent requirements.",
                    "Evaluating a model of software managers' information needs: an experiment.",
                    "Utilizing GQM+Strategies for business value analysis: an approach for evaluating business goals.",
                    "Improving industrial adoption of software engineering research: a comparison of open and closed source software.",
                    "The effects of neuroticism on pair programming: an empirical study in the higher education context.",
                    "Trust dynamics in global software engineering.",
                    "Investigating the use of tags in collaborative development environments: a replicated study.",
                    "Introducing the evaluation of complexity in functional size measurement: a UML-based approach.",
                    "Categorization of real-time software components for code size estimation.",
                    "Evaluating the suitability of a measurement repository for statistical process control.",
                    "Gender differences and programming environments: across programming populations.",
                    "A qualitative study of animation programming in the wild.",
                    "Usability evaluation of multi-device/platform user interfaces generated by model-driven engineering.",
                    "Data accumulation and software effort prediction.",
                    "Stakeholder perceptions of software project outcomes: an industry case study.",
                    "A critical appraisal of systematic reviews in software engineering from the perspective of the research questions asked in the reviews.",
                    "Towards the conception of scientific workflows for in silico experiments in software engineering.",
                    "Exploring the use of crowdsourcing to support empirical studies in software engineering.",
                    "Predicting OSS trustworthiness on the basis of elementary code assessment.",
                    "An empirical study on the relationship between the use of agile practices and the success of Scrum projects.",
                    "Using virtual machines for collaborative research.",
                    "A conceptual model of client-driven agile requirements prioritization: results of a case study.",
                    "On the effort of augmenting use cases with screen mockups: results from a preliminary empirical study.",
                    "The influence of environmental parameters on concurrency fault exposures: an exploratory study.",
                    "Evaluation of optimized staffing for feature development and bug fixing.",
                    "A focus group study on inter-organizational ERP requirements engineering practices.",
                    "Continued involvement in software development: motivational factors.",
                    "Is GQM+Strategies really applicable as is to non-software development domains?",
                    "Obtaining valid safety data for software safety measurement and process improvement.",
                    "Impact analysis by means of unstructured knowledge in the context of bug repositories.",
                    "The usual suspects: a case study on delivered defects per developer.",
                    "Evaluating the usefulness of a functional size measurement procedure to detect defects in MDD models.",
                    "Impact of maintainability defects on code inspections.",
                    "Impact analysis of SCRs using single and multi-label machine learning classification.",
                    "A controlled experiment for assessing the contribution of design pattern documentation on software maintenance.",
                    "Comparing two communication media in use case modeling: results from a controlled experiment.",
                    "Towards to the validation of a usability evaluation method for model-driven web development.",
                    "Are Heroes common in FLOSS projects?",
                    "Adaptability performance trade-off: a controlled experiment.",
                    "EXPRE: a repository for managing software data and experience.",
                    "Agile security issues: an empirical study.",
                    "Detecting missing thrown exceptions in enterprise systems: an empirical study.",
                    "Characteristics of high performing testers: a case study.",
                    "Applying MDA to complex multi-tier enterprise architectures.",
                    "Effects of the number of developers on code quality in open source software: a case study.",
                    "CodeVizard: a tool to aid the analysis of software evolution.",
                    "Traceable complexity metric from requirements to code.",
                    "An event-based empirical process analysis framework.",
                    "Influencing factors of defect removal: an empirical study based on industrial data.",
                    "Quantitative software security measurement in an engineering service bus platform.",
                    "Preliminary analysis of the effects of confirmation bias on software defect density."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "3rd ESEM 2009",
        "info": "Lake Buena Vista, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2009",
                "sub_name": "Proceedings of the Third International Symposium on Empirical Software Engineering and Measurement, ESEM 2009, October 15-16, 2009, Lake Buena Vista, Florida, USA.",
                "count": 70,
                "papers": [
                    "Productivity trends in incremental and iterative software development.",
                    "Challenges in enterprise software integration: An industrial study using repertory grids.",
                    "Effect of staffing pattern on software project: An empirical analysis.",
                    "A detailed examination of the correlation between imports and failure-proneness of software components.",
                    "A probability-based approach for measuring external attributes of software artifacts.",
                    "Does explanation improve the acceptance of decision support for product release planning?",
                    "Impact of the visitor pattern on program comprehension and maintenance.",
                    "Understanding the use of inheritance with visual patterns.",
                    "Strong dependencies between software components.",
                    "Using function points to measure and estimate real-time and embedded software: Experiences and guidelines.",
                    "Applying moving windows to software effort estimation.",
                    "Scope error detection and handling concerning software estimation models.",
                    "What do we know about perspective-based reading? An approach for quantitative aggregation in software engineering.",
                    "Cognitive factors in perspective-based reading (PBR): A protocol analysis study.",
                    "Does aspect-oriented programming increase the development speed for crosscutting code? An empirical study.",
                    "We need more coverage, stat! classroom experience with the software ICU.",
                    "Fitting a workflow model to captured development data.",
                    "Applying support vector regression for web effort estimation using a cross-company dataset.",
                    "Personality and the nature of collaboration in pair programming.",
                    "An empirical study of the effects of personality in pair programming using the five-factor model.",
                    "An interpretation of the results of the analysis of pair programming during novices integration in a team.",
                    "Gauging acceptance of software metrics: Comparing perspectives of managers and developers.",
                    "Empirical results from the transformation of a large commercial technical computing environment.",
                    "Balancing software product investments.",
                    "Evaluation of model-based testing techniques selection approaches: An external replication.",
                    "Test case prioritization based on data reuse an experimental study.",
                    "Test coverage and post-verification defects: A multiple case study.",
                    "The role of software process simulation modeling in software risk management: A systematic review.",
                    "Tool supported detection and judgment of nonconformance in process execution.",
                    "Exploring language in software process elicitation: A grounded theory approach.",
                    "The impact of limited search procedures for systematic literature reviews A participant-observer case study.",
                    "Systematic literature reviews in software engineering: Preliminary results from interviews with researchers.",
                    "Using differences among replications of software engineering experiments to gain knowledge.",
                    "A systematic review of software maintainability prediction and metrics.",
                    "Using concept mapping for maintainability assessments.",
                    "The evolution and impact of code smells: A case study of two open source systems.",
                    "Context in industrial software engineering research.",
                    "An empirical study on software engineers motivational factors.",
                    "Building the linkage between project managers' personality and success of software projects.",
                    "Action research use in software engineering: An initial survey.",
                    "Software risk management barriers: An empirical study.",
                    "Transactions and paths: Two use case based metrics which improve the early effort estimation.",
                    "Usability testing with total-effort metrics.",
                    "Modifiability measurement from a task complexity perspective: A feasibility study.",
                    "Predicting defects with program dependencies.",
                    "Optimized assignment of developers for fixing bugs an initial evaluation for eclipse projects.",
                    "The curse of copy&paste Cloning in requirements specifications.",
                    "An empirical quality model for web service ontologies to support mobile devices.",
                    "An empirical study on bug assignment automation using Chinese bug data.",
                    "Analyzing video data: A study of programming behavior under two software engineering paradigms.",
                    "Towards logistic regression models for predicting fault-prone code across software projects.",
                    "Quality models in practice: A preliminary analysis.",
                    "On the effectiveness of dynamic modeling in UML: Results from an external replication.",
                    "Simulation of the defect removal process with queuing theory.",
                    "Reducing false alarms in software defect prediction by decision threshold optimization.",
                    "An empirical study of security problem reports in Linux distributions.",
                    "Progress report on the experimental evaluation of security inspection guidance.",
                    "Software testing sizing in incremental development: A case study.",
                    "How do testers do it? An exploratory study on manual testing practices.",
                    "The QualOSS open source assessment model measuring the performance of open source communities.",
                    "A systematic mapping study on empirical evaluation of software requirements specifications techniques.",
                    "An experiment to observe the impact of UML diagrams on the effectiveness of software requirements inspections.",
                    "A comparison of software cost, duration, and quality for waterfall vs. iterative and incremental development: A systematic review.",
                    "An analysis of CVSS version 2 vulnerability scoring.",
                    "Vulnerability analysis for a quantitative security evaluation.",
                    "Improving CVSS-based vulnerability prioritization and response with context information.",
                    "Security of open source web applications.",
                    "Measuring the interplay of security principles in software architectures.",
                    "Using security metrics coupled with predictive modeling and simulation to assess security processes.",
                    "Quantitative analysis of information security interdependency between industrial sectors."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "2nd ESEM 2008",
        "info": "Kaiserslautern, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2008",
                "sub_name": "Proceedings of the Second International Symposium on Empirical Software Engineering and Measurement, ESEM 2008, October 9-10, 2008, Kaiserslautern, Germany.",
                "count": 62,
                "papers": [
                    "Using empirical methods to improve industrial technology transfer.",
                    "Socio-technical congruence: a framework for assessing the impact of technical and work dependencies on software development productivity.",
                    "A multiple case study investigating the interaction between manufacturing and development organizations in automotive software engineering.",
                    "Empirical evaluations of regression test selection techniques: a systematic review.",
                    "Capture-recapture in software unit testing: a case study.",
                    "On establishing a benchmark for evaluating static analysis alert prioritization and classification techniques.",
                    "Comparative studies of the model evaluation criterions mmre and pred in software cost estimation research.",
                    "Phase distribution of software development effort.",
                    "Combining regression and estimation by analogy in a semi-parametric model for software cost estimation.",
                    "An industrial case study of architecture conformance.",
                    "A survey into the rigor of UML use and its perceived impact on quality and productivity.",
                    "Model-based functional size measurement.",
                    "Empirical challenges in ultra large scale systems.",
                    "Problems in agile trenches.",
                    "Pair programming: what's in it for me?",
                    "Why do programmers avoid metrics?",
                    "The impact of time controlled reading on software inspection effectiveness and efficiency: a controlled experiment.",
                    "Defect categorization: making use of a decade of widely varying historical data.",
                    "Evaluation of capture-recapture models for estimating the abundance of naturally-occurring defects.",
                    "Some lessons learned in conducting software engineering surveys in china.",
                    "Strength of evidence in systematic reviews in software engineering.",
                    "Refining the axiomatic definition of internal software attributes.",
                    "Quantitative analysis of faults and failures with multiple releases of softpm.",
                    "Iterative identification of fault-prone binaries using in-process metrics.",
                    "A constrained regression technique for cocomo calibration.",
                    "Reducing biases in individual software effort estimations: a combining approach.",
                    "Any other cost estimation inhibitors?",
                    "Empirical results from using custom-made software project control centers in industrial environments.",
                    "A survey on software cost estimation in the chinese software industry.",
                    "A survey of software project managers on software process change.",
                    "A pilot study of comparative customer comprehension between extreme x-machine and uml models.",
                    "Enhancing predictive models using principal component analysis and search based metric selection: a comparative study.",
                    "Evaluating the usefulness of software visualization in supporting software comprehension activities.",
                    "A hybrid faulty module prediction using association rule mining and logistic regression analysis.",
                    "Mining software code repositories and bug databases using survival analysis models.",
                    "Adding planned design to xp might help novices' productivity (or might not): two controlled experiments.",
                    "Using students as subjects - an empirical evaluation.",
                    "Empirical study of how personality, team processes and task characteristics relate to satisfaction and software quality.",
                    "Empirical evaluation of analogy-x for software cost estimation.",
                    "Improving application and understanding of experience packages through learning spaces.",
                    "Does the use of stereotypes improve the comprehension of UML sequence diagrams?",
                    "Web application fault classification - an exploratory study.",
                    "Exposure model for prediction of number of customer reported defects.",
                    "Analysis of the reliability of a subset of change metrics for defect prediction.",
                    "An over-sampling method for analogy-based software effort estimation.",
                    "An empirical model to predict security vulnerabilities using code complexity metrics.",
                    "Ensemble of software defect predictors: a case study.",
                    "Managing software quality through a hybrid defect content and effectiveness model.",
                    "Surveying model based testing approaches characterization attributes.",
                    "Statistical process control for software: a systematic approach.",
                    "Issues and effort in integrating data from heterogeneous software repositories and corporate databases.",
                    "A defect-driven process for software quality improvement.",
                    "IMPS: an experimentation based investigation of a nationwide software development reference model.",
                    "Using the ProdFlow(TM) approach to address the myth of productivity in r&d organizations.",
                    "A mapping study on empirical evidence related to the models and forms used in the uml.",
                    "Software process simulation over the past decade: trends discovery from a systematic review.",
                    "An empirical investigation of scenarios gained and lost in architecture evaluation meetings.",
                    "Are good code reviewers also good at design review?",
                    "Understandability measurement in an early usability evaluation for model-driven development: an empirical study.",
                    "Automatic extraction of the main terminology used in empirical software engineering through text mining techniques.",
                    "Exploring effort distribution in RUP projects.",
                    "Fit data selection for software effort estimation models."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "1st ESEM 2007",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/esem/2007",
                "sub_name": "Proceedings of the First International Symposium on Empirical Software Engineering and Measurement, ESEM 2007, September 20-21, 2007, Madrid, Spain.",
                "count": 71,
                "papers": [
                    "A Critical Analysis of Empirical Research in Software Testing.",
                    "Helping End-User Programmers \"Engineer\" Software: an Opportunity for Empirical Researchers.",
                    "Proposal of a Complete Life Cycle In-Process Measurement Model Based on Evaluation of an In-Process Measurement Experiment Using a Standardized Requirement Definition Process.",
                    "Observing Software Testing Practice from the Viewpoint of Organizations and Knowledge Management.",
                    "Relevant Information Sources for Successful Technology Transfer: A Survey Using Inspections as an Example.",
                    "Assessing, Comparing, and Combining Statechart- based testing and Structural testing: An Experiment.",
                    "Test Inspected Unit or Inspect Unit Tested Code?",
                    "Defect Detection Efficiency: Test Case Based vs. Exploratory Testing.",
                    "Comparing Model Generated with Expert Generated IV&V Activity Plans.",
                    "Requirement and Design Trade-offs in Hackystat: An In-Process Software Engineering Measurement and Analysis System.",
                    "Tuning anonymity level for assuring high data quality: an empirical study.",
                    "Filtering, Robust Filtering, Polishing: Techniques for Addressing Quality in Software Data.",
                    "An Estimation Model for Test Execution Effort.",
                    "Cognitive Limits of Software Cost Estimation.",
                    "Impact Analysis of Missing Values on the Prediction Accuracy of Analogy-based Software Effort Estimation Method AQUA.",
                    "Static Members and Cycles in Java Software.",
                    "Usability Evaluation Based on Web Design Perspectives.",
                    "An Empirical Study of the Effects of Gestalt Principles on Diagram Understandability.",
                    "A Comparative Study of Aspect-Oriented Requirements Engineering Approaches.",
                    "Toward Reducing Fault Fix Time: Understanding Developer Behavior for the Design of Automated Fault Detection Tools.",
                    "Evaluating the Impact of Adaptive Maintenance Process on Open Source Software Quality.",
                    "The Effects of Over and Under Sampling on Fault-prone Module Detection.",
                    "Generalizing fault contents from a few classes.",
                    "Developing Search Strategies for Detecting Relevant Experiments for Systematic Reviews.",
                    "Applying Systematic Reviews to Diverse Study Types: An Experience Report.",
                    "Using Context Distance Measurement to Analyze Results across Studies.",
                    "A Visual Text Mining approach for Systematic Reviews.",
                    "Usage and Perceptions of Agile Software Development in an Industrial Context: An Exploratory Study.",
                    "A Replicate Empirical Comparison between Pair Development and Software Development with Inspection.",
                    "A Comparative Case Study on the Impact of Test-Driven Development on Program Design and Test Coverage.",
                    "An Experimental Evaluation of the Effectiveness and Efficiency of the Test Driven Development.",
                    "Fine-Grained Software Metrics in Practice.",
                    "Conceptual Differences Among Functional Size Measurement Methods.",
                    "Evaluating Software Project Control Centers in Industrial Environments.",
                    "Comparing Size Measures for Predicting Web Application Development Effort: A Case Study.",
                    "A Comparison of Techniques for Web Effort Estimation.",
                    "Effort Prediction in Iterative Software Development Processes - Incremental Versus Global Prediction Models.",
                    "Mining Software Evolution to Predict Refactoring.",
                    "Using Software Dependencies and Churn Metrics to Predict Field Failures: An Empirical Case Study.",
                    "Fault-Prone Filtering: Detection of Fault-Prone Modules Using Spam Filtering Technique.",
                    "Is This Cost Estimate Reliable? - The Relationship between Homogeneity of Analogues and Estimation Reliability.",
                    "Building Software Cost Estimation Models using Homogenous Data.",
                    "Comparing Local and Global Software Effort Estimation Models - Reflections on a Systematic Review.",
                    "Characterizing Software Architecture Changes: An Initial Study.",
                    "The Impact of Group Size on Software Architecture Evaluation: A Controlled Experiment.",
                    "Evaluating the Usefulness and Ease of Use of a Groupware Tool for the Software Architecture Evaluation Process.",
                    "An Approach to Global Sensitivity Analysis: FAST on COCOMO.",
                    "An Approach to Outlier Detection of Software Measurement Data using the K-means Clustering Method.",
                    "A cost effectiveness indicator for software development.",
                    "How Software Designs Decay: A Pilot Study of Pattern Evolution.",
                    "Estimating the Quality of Widely Used Software Products Using Software Reliability Growth Modeling: Case Study of an IBM Federated Database Project.",
                    "Correlation between bug notifications, messages and participants in Debian's bug tracking system.",
                    "Investigating Test Teams' Defect Detection in Function test.",
                    "Comparison of Outlier Detection Methods in Fault-proneness Models.",
                    "\"Talking tests\": a Preliminary Experimental Study on Fit User Acceptance Tests.",
                    "A Survey of the Practice of Design - Code Correspondence amongst Professional Software Engineers.",
                    "Assessing the Quality Impact of Design Inspections.",
                    "A Controlled Experiment on the Effects of Synchronicity in Remote Inspection Meetings.",
                    "A Survey of Enterprise Software Development Risks in a Flat World.",
                    "Checklists for Software Engineering Case Study Research.",
                    "Evidence relating to Object-Oriented software design: A survey.",
                    "A Snapshot of the State of Practice in Software Development for Medical Devices.",
                    "GQM+ Strategies - Aligning Business Strategies with Software Measurement.",
                    "Automated Information Extraction from Empirical Software Engineering Literature: Is that possible?",
                    "Value-Based Empirical Research Plan Evaluation.",
                    "Decision Support with EMPEROR.",
                    "An Empirical Study on MBASE and LeanMBASE.",
                    "Evaluation of Feature Extraction Methods on Software Cost Estimation.",
                    "A Controlled Experiment for Selecting Transformations based on Quality Attributes in the context of MDA.",
                    "Agile Software Assurance: An Empirical Study.",
                    "Approaching the ERP Project Cost Estimation Problem: an Experiment."
                ]
            }
        ]
    }
]