[
	{
		"year": "2019",
		"name": "FM 2019",
		"info": "Porto, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2021",
				"sub_name": "Formal Methods - 24th International Symposium, FM 2021, Virtual Event, November 20-26, 2021, Proceedings.",
				"count": 46,
				"papers": [
					"Combining Forces: How to Formally Verify Informally Defined Embedded Systems.",
					"Model Checking for Verification of Quantum Circuits.",
					"Verifying Secure Speculation in Isabelle/HOL.",
					"Two Mechanisations of WebAssembly 1.0.",
					"Probabilistic Verification of Neural Networks Against Group Fairness.",
					"BanditFuzz: Fuzzing SMT Solvers with Multi-agent Reinforcement Learning.",
					"Formally Verified Safety Net for Waypoint Navigation Neural Network Controllers.",
					"Model-Free Reinforcement Learning for Lexicographic Omega-Regular Objectives.",
					"Efficient Algorithms for Omega-Regular Energy Games.",
					"Generalizing Non-punctuality for Timed Temporal Logic with Freeze Quantifiers.",
					"Verified Quadratic Virtual Substitution for Real Arithmetic.",
					"Business Processes Meet Spatial Concerns: The sBPMN Verification Framework.",
					"Owicki-Gries Reasoning for C11 Programs with Relaxed Dependencies.",
					"Integrating ADTs in KeY and Their Application to History-Based Reasoning.",
					"Identifying Overly Restrictive Matching Patterns in SMT-Based Program Verifiers.",
					"Rely/Guarantee Reasoning for Multicopy Atomic Weak Memory Models.",
					"Hybrid System Falsification for Multiple-Constraint Parameter Synthesis: A Gas Turbine Case Study.",
					"Gaussian Process-Based Confidence Estimation for Hybrid System Falsification.",
					"Formal Verification of Intelligent Hybrid Systems that are Modeled with Simulink and the Reinforcement Learning Toolbox.",
					"Hybrid Systems Verification with Isabelle/HOL: Simpler Syntax, Better Models, Faster Proofs.",
					"Z3str4: A Multi-armed String Solver.",
					"Concise Outlines for a Complex Logic: A Proof Outline Checker for TaDA.",
					"Formal Verification of a JavaCard Virtual Machine with Frama-C.",
					"Verification of the Incremental Merkle Tree Algorithm with Dafny.",
					"Congruence Relations for Büchi Automata.",
					"Featured Team Automata.",
					"From Partial to Global Assume-Guarantee Contracts: Compositional Realizability Analysis in FRET.",
					"Fingerprinting Bluetooth Low Energy Devices via Active Automata Learning.",
					"Trace Abstraction-Based Verification for Uninterpreted Programs.",
					"HStriver: A Very Functional Extensible Tool for the Runtime Verification of Real-Time Event Streams.",
					"Cabean 2.0: Efficient and Efficacious Control of Asynchronous Boolean Networks.",
					"Dynamic Reconfiguration via Typed Modalities.",
					"On Lexicographic Proof Rules for Probabilistic Termination.",
					"Fuel in Markov Decision Processes (FiMDP): A Practical Approach to Consumption.",
					"HyperProb: A Model Checker for Probabilistic Hyperproperties.",
					"The Probabilistic Termination Tool Amber.",
					"Model Checking Collision Avoidance of Nonlinear Autonomous Vehicles.",
					"Formal Verification of Complex Data Paths: An Industrial Experience.",
					"Some Lessons Learned in the Industrialization of Formal Methods for Financial Algorithms.",
					"Two Decades of Formal Methods in Industrial Products at BTC Embedded Systems.",
					"Formal Analysis of Neural Network-Based Systems in the Aircraft Domain.",
					"Formal Verification of Consensus in the Taurus Distributed Database.",
					"Combined Online Checking and Control Synthesis: A Study on a Vehicle Platoon Testbed.",
					"Formally Guaranteed Tight Dynamic Future Occupancy of Autonomous Vehicles.",
					"Divide et Impera: Efficient Synthesis of Cyber-Physical System Architectures from Formal Contracts.",
					"Apply Formal Methods in Certifying the SyberX High-Assurance Kernel."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-2111-07538",
				"sub_name": "Proceedings First Workshop on Applicable Formal Methods, AppFM@FM 2021, virtual, 23rd November 2021.",
				"count": 6,
				"papers": [
					"Is CADP an Applicable Formal Method?",
					"Developing a Prototype of a Mechanical Ventilator Controller from Requirements to Code with ASMETA.",
					"A Maude Implementation of Rewritable Petri Nets: a Feasible Model for Dynamically Reconfigurable Systems.",
					"F-IDEs with Features and VCs Designed to Assist Human Reasoning When Verification Fails.",
					"Experience Report: Teaching Code Analysis and Verification Using Frama-C.",
					"Exploring Usable Security to Improve the Impact of Formal Verification: A Research Agenda."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "FM 2019",
		"info": "Porto, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2019",
				"sub_name": "Formal Methods - The Next 30 Years - Third World Congress, FM 2019, Porto, Portugal, October 7-11, 2019, Proceedings.",
				"count": 46,
				"papers": [
					"The Human in Formal Methods.",
					"Successes in Deployed Verified Software (and Insights on Key Social Factors).",
					"Provably Correct Floating-Point Implementation of a Point-in-Polygon Algorithm.",
					"Formally Verified Roundoff Errors Using SMT-based Certificates and Subdivisions.",
					"Mechanically Verifying the Fundamental Liveness Property of the Chord Protocol.",
					"On the Nature of Symbolic Execution.",
					"GR(1)*: GR(1) Specifications Extended with Existential Guarantees.",
					"Counterexample-Driven Synthesis for Probabilistic Program Sketches.",
					"Synthesis of Railway Signaling Layout from Local Capacity Specifications.",
					"Pegasus: A Framework for Sound Continuous Invariant Generation.",
					"A Parametric Rely-Guarantee Reasoning Framework for Concurrent Reactive Systems.",
					"Verifying Correctness of Persistent Concurrent Data Structures.",
					"Compositional Verification of Concurrent Systems by Combining Bisimulations.",
					"Towards a Model-Checker for Circus.",
					"Circus2CSP: A Tool for Model-Checking Circus Using FDR.",
					"How Hard Is Finding Shortest Counter-Example Lassos in Model Checking?",
					"From LTL to Unambiguous Büchi Automata via Disambiguation of Alternating Automata.",
					"Generic Partition Refinement and Weighted Tree Automata.",
					"Equilibria-Based Probabilistic Model Checking for Concurrent Stochastic Games.",
					"Abstract Execution.",
					"Static Analysis for Detecting High-Level Races in RTOS Kernels.",
					"Parallel Composition and Modular Verification of Computer Controlled Systems in Differential Dynamic Logic.",
					"An Axiomatic Approach to Liveness for Differential Equations.",
					"Local Consistency Check in Synchronous Dataflow Models.",
					"Gray-Box Monitoring of Hyperproperties.",
					"Quantitative Verification of Numerical Stability for Kalman Filters.",
					"Concolic Testing Heap-Manipulating Programs.",
					"Formal Semantics Extraction from Natural Language Specifications for ARM.",
					"GOSPEL - Providing OCaml with a Formal Specification Language.",
					"Unification in Matching Logic.",
					"Embedding High-Level Formal Specifications into Applications.",
					"Value-Dependent Information-Flow Security on Weak Memory Models.",
					"Reasoning Formally About Database Queries and Updates.",
					"Abstraction and Subsumption in Modular Verification of C Programs.",
					"IELE: A Rigorously Designed Language and Tool Ecosystem for the Blockchain.",
					"APML: An Architecture Proof Modeling Language.",
					"Learning Deterministic Variable Automata over Infinite Alphabets.",
					"L*-Based Learning of Markov Decision Processes.",
					"Star-Based Reachability Analysis of Deep Neural Networks.",
					"SOA and the Button Problem.",
					"Controlling Large Boolean Networks with Temporary and Permanent Perturbations.",
					"Formal Methods Applicability on Space Applications Specification and Implementation Using MORA-TSP.",
					"Industrial Application of Event-B to a Wayside Train Monitoring System: Formal Conceptual Data Analysis.",
					"Property-Driven Software Analysis - (Extended Abstract).",
					"Practical Application of SPARK to OpenUxAS.",
					"Adopting Formal Methods in an Industrial Setting: The Railways Case."
				]
			},
			{
				"sub_name_abbr": "conf/fm/2019-w1",
				"sub_name": "Formal Methods. FM 2019 International Workshops - Porto, Portugal, October 7-11, 2019, Revised Selected Papers, Part I.",
				"count": 36,
				"papers": [
					"Experiences with Streamlining Formal Methods Tools.",
					"The Bourgeois Gentleman, Engineering and Formal Methods.",
					"SEB-CG: Code Generation Tool with Algorithmic Refinement Support for Event-B.",
					"Compiling C and C++ Programs for Dynamic White-Box Analysis.",
					"Model Checking in a Development Workflow: A Study on a Concurrent C++ Hash Table.",
					"Addressing Usability in a Formal Development Environment.",
					"Formal Modelling and Verification as Rigorous Review Technology: An Inspiration from INSPEX.",
					"Validation of a Simulation Algorithm for Safety-Critical Human Multitasking.",
					"An Ontology-Based Approach to Support Formal Verification of Concurrent Systems.",
					"How to Look Next? A Data-Driven Approach for Scanpath Prediction.",
					"\"Know Thyself\" How Personal Music Tastes Shape the Last.Fm Online Social Network.",
					"Gender Recognition in the Wild with Small Sample Size - A Dictionary Learning Approach.",
					"An Instrumented Mobile Language Learning Application for the Analysis of Usability and Learning.",
					"Analysis and Visualization of Performance Indicators in University Admission Tests.",
					"Anomaly Detection from Log Files Using Unsupervised Deep Learning.",
					"Formalisation and Implementation of Road Junction Rules on an Autonomous Vehicle Modelled as an Agent.",
					"CriSGen: Constraint-Based Generation of Critical Scenarios for Autonomous Vehicles.",
					"Verification of Fair Controllers for Urban Traffic Manoeuvres at Intersections.",
					"Temporal Logic Semantics for Teleo-Reactive Robotic Agent Programs.",
					"A Mission Definition, Verification and Validation Architecture.",
					"Smart Contracts: Application Scenarios for Deductive Program Verification.",
					"Deductive Proof of Industrial Smart Contracts Using Why3.",
					"Verifying Smart Contracts with Cubicle.",
					"Call Me Back, I Have a Type Invariant.",
					"Statistical Model Checking of RANDAO's Resilience to Pre-computed Reveal Strategies.",
					"A Distributed Blockchain Model of Selfish Mining.",
					"Towards a Verified Model of the Algorand Consensus Protocol in Coq.",
					"Mi-Cho-Coq, a Framework for Certifying Tezos Smart Contracts.",
					"Smart Contract Interactions in Coq.",
					"Formal Specification of a Security Framework for Smart Contracts.",
					"Examples of the Application of Formal Methods to Interactive Systems.",
					"Modelling Human Reasoning in Practical Behavioural Contexts Using Real-Time Maude.",
					"A Survey of Papers from Formal Methods for Interactive Systems (FMIS) Workshops.",
					"Formal Modelling of Safety-Critical Interactive Devices Using Coloured Petri Nets.",
					"Model-Based Testing of Post-WIMP Interactions Using Object Oriented Petri-Nets.",
					"Fortune Nets for Fortunettes: Formal, Petri Nets-Based, Engineering of Feedforward for GUI Widgets."
				]
			},
			{
				"sub_name_abbr": "conf/fm/2019-w2",
				"sub_name": "Formal Methods. FM 2019 International Workshops - Porto, Portugal, October 7-11, 2019, Revised Selected Papers, Part II.",
				"count": 34,
				"papers": [
					"Flow Diagrams, Assertions, and Formal Methods.",
					"The School of Squiggol - A History of the Bird-Meertens Formalism.",
					"Reasoning About Shared-Variable Concurrency: Interactions Between Research Threads.",
					"Specification with Class: A Brief History of Object-Z.",
					"Formal Specifications and Software Testing, a Fruitful Convergence.",
					"From Manuscripts to Programming Languages: An Archivist Perspective.",
					"What Have Formal Methods Ever Done for Us? An Audience Discussion.",
					"Combination of Boxes and Polyhedra Abstractions for Constraint Solving.",
					"An Abstract Domain for Objects in Dynamic Programming Languages.",
					"A Survey of Learning Methods in Open Source Software.",
					"A Calculus of Chaos in Stochastic Compilation - Engineering in the Cause of Mathematics.",
					"Runtime Verification of Linux Kernel Security Module.",
					"Open and Interactive Learning Resources for Algorithmic Problem Solving.",
					"Challenges Faced by Students in an Open Source Software Undergraduate Course.",
					"Open Source Software as a Learning Tool for Computer Science Students.",
					"Exploring Human Behaviour in Cyber-Physical Systems with Multi-modelling and Co-simulation.",
					"Migrating the INTO-CPS Application to the Cloud.",
					"Towards a Static Check of FMUs in VDM-SL.",
					"ViennaDoc: An Animatable and Testable Specification Documentation Tool.",
					"A Map of Asynchronous Communication Models.",
					"An Abstract Semantics of Speculative Execution for Reasoning About Security Vulnerabilities.",
					"Weakening Correctness and Linearizability for Concurrent Objects on Multicore Processors.",
					"Towards a Method for the Decomposition by Refinement in Event-B.",
					"Transformations for Generating Type Refinements.",
					"Comparing Correctness-by-Construction with Post-Hoc Verification - A Qualitative User Study.",
					"Reversible Programs Have Reversible Semantics.",
					"Two-Way Quantum and Classical Automata with Advice for Online Minimization Problems.",
					"Quotients and Atoms of Reversible Languages.",
					"Bayesian Verification of Chemical Reaction Networks.",
					"Nested Event Representation for Automated Assembly of Cell Signaling Network Models.",
					"PrideMM: Second Order Model Checking for Memory Consistency Models.",
					"Fkcc: The Farkas Calculator.",
					"Handling Heap Data Structures in Backward Symbolic Execution.",
					"AuthCheck: Program-State Analysis for Access-Control Vulnerabilities."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2019",
				"sub_name": "Tests and Proofs - 13th International Conference, TAP@FM 2019, Porto, Portugal, October 9-11, 2019, Proceedings.",
				"count": 12,
				"papers": [
					"When Are Software Verification Results Valid for Approximate Hardware?",
					"Testing Robots Using CSP.",
					"Constraints in Dynamic Symbolic Execution: Bitvectors or Integers?",
					"Fast, Automatic, and Nearly Complete Structural Unit-Test Generation Combining Genetic Algorithms and Formal Methods.",
					"Coverage-Based Testing with Symbolic Transition Systems.",
					"BTestBox: A Tool for Testing B Translators and Coverage of B Models.",
					"Predicting and Testing Latencies with Deep Learning: An IoT Case Study.",
					"Learning Communicating State Machines.",
					"Repairing Timed Automata Clock Guards through Abstraction and Testing.",
					"Proving a Non-blocking Algorithm for Process Renaming with TLA ^+ +.",
					"Tame Your Annotations with MetAcsl: Specifying, Testing and Proving High-Level Properties.",
					"Property-Based Test Case Generators for Free."
				]
			},
			{
				"sub_name_abbr": "conf/utp/2019",
				"sub_name": "Unifying Theories of Programming - 7th International Symposium, UTP 2019, Dedicated to Tony Hoare on the Occasion of His 85th Birthday, Porto, Portugal, October 8, 2019, Proceedings.",
				"count": 10,
				"papers": [
					"A Calculus of Space, Time, and Causality: Its Algebra, Geometry, Logic.",
					"A Testing Perspective on Algebraic, Denotational, and Operational Semantics.",
					"Whither Specifications as Programs.",
					"Connecting Fixpoints of Computations with Strict Progress.",
					"Probabilistic Semantics for RoboChart - A Weakest Completion Approach.",
					"Unified Graphical Co-modelling of Cyber-Physical Systems Using AADL and Simulink/Stateflow.",
					"Hybrid Relations in Isabelle/UTP.",
					"The Inner and Outer Algebras of Unified Concurrency.",
					"Developing an Algebra for Rely/Guarantee Concurrency: Design Decisions and Challenges.",
					"UTP Semantics of a Calculus for Mobile Ad Hoc Networks."
				]
			},
			{
				"sub_name_abbr": "conf/tfm/2019",
				"sub_name": "Formal Methods Teaching - Third International Workshop and Tutorial, FMTea 2019, Held as Part of the Third World Congress on Formal Methods, FM 2019, Porto, Portugal, October 7, 2019, Proceedings.",
				"count": 15,
				"papers": [
					"Logic, Algebra, and Geometry at the Foundation of Computer Science.",
					"Teaching Deductive Verification Through Frama-C and SPARK for Non Computer Scientists.",
					"Using Krakatoa for Teaching Formal Verification of Java Programs.",
					"Teaching Deductive Verification in Why3 to Undergraduate Students.",
					"Teaching Formal Methods to Future Engineers.",
					"The Computational Relevance of Formal Logic Through Formal Proofs.",
					"Teaching Formal Methods: From Software in the Small to Software in the Large.",
					"On Teaching Applied Formal Methods in Aerospace Engineering.",
					"Teaching Concurrency with the Disappearing Formal Method.",
					"Teaching Discrete Mathematics to Computer Science Students.",
					"Principled and Pragmatic Specification of Programming Languages.",
					"Managing Heterogeneity and Bridging the Gap in Teaching Formal Methods.",
					"Teaching Introductory Formal Methods and Discrete Mathematics to Software Engineers: Reflections on a Modelling-Focussed Approach.",
					"Teaching Formal Methods: Lessons Learnt from Using Event-B.",
					"You Already Used Formal Methods but Did Not Know It."
				]
			},
			{
				"sub_name_abbr": "conf/dali/2019",
				"sub_name": "Dynamic Logic. New Trends and Applications - Second International Workshop, DaLí 2019, Porto, Portugal, October 7-11, 2019, Proceedings.",
				"count": 14,
				"papers": [
					"Mechanizing Bisimulation Theorems for Relation-Changing Logics in Coq.",
					"Behavioural and Abstractor Specifications for a Dynamic Logic with Binders and Silent Transitions.",
					"The Logic of AGM Learning from Partial Observations.",
					"A Dynamic Epistemic Logic Analysis of the Equality Negation Task.",
					"A Logical Analysis of the Interplay Between Social Influence and Friendship Selection.",
					"A Four-Valued Hybrid Logic with Non-dual Modal Operators.",
					"Persuasive Argumentation and Epistemic Attitudes.",
					"The Trace Modality.",
					"Iterative Division in the Distributive Full Non-associative Lambek Calculus.",
					"Resource Separation in Dynamic Logic of Propositional Assignments.",
					"Stit Semantics for Epistemic Notions Based on Information Disclosure in Interactive Settings.",
					"Bringing Belief Base Change into Dynamic Epistemic Logic.",
					"A Dynamic Logic for QASM Programs.",
					"On the Construction of Multi-valued Concurrent Dynamic Logics."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1912-09611",
				"sub_name": "Proceedings Fifth Workshop on Formal Integrated Development Environment, F-IDE@FM 2019, Porto, Portugal, 7th October 2019.",
				"count": 8,
				"papers": [
					"Experience Report: Towards Moving Things with Types - Helping Logistics Domain Experts to Control Cyber-Physical Systems with Type-Based Synthesis.",
					"Automated Deductive Verification for Ladder Programming.",
					"Deeply Integrating C11 Code Support into Isabelle/PIDE.",
					"A Component-Based Formal Language Workbench.",
					"An Integrated Development Environment for the Prototype Verification System.",
					"The TLA+ Toolbox.",
					"Simulation under Arbitrary Temporal Logic Constraints.",
					"Tool Support for Validation of Formal System Models: Interactive Visualization and Requirements Traceability."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "22nd FM 2018",
		"info": "Oxford, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2018",
				"sub_name": "Formal Methods - 22nd International Symposium, FM 2018, Held as Part of the Federated Logic Conference, FloC 2018, Oxford, UK, July 15-17, 2018, Proceedings.",
				"count": 46,
				"papers": [
					"Processing Text for Privacy: An Information Flow Perspective.",
					"20 Years of Real Real Time Model Validation.",
					"Deadlock Detection for Actor-Based Coroutines.",
					"An Algebraic Approach for Reasoning About Information Flow.",
					"Towards 'Verifying' a Water Treatment System.",
					"FSM Inference from Long Traces.",
					"A Weakness Measure for GR(1) Formulae.",
					"Producing Explanations for Rich Logics.",
					"The Compound Interest in Relaxing Punctuality.",
					"IPL: An Integration Property Language for Multi-model Cyber-physical Systems.",
					"Timed Epistemic Knowledge Bases for Social Networks.",
					"Optimal and Robust Controller Synthesis - Using Energy Timed Automata with Uncertainty.",
					"Encoding Fairness in a Synchronous Concurrent Program Algebra.",
					"A Wide-Spectrum Language for Verification of Programs on Weak Memory Models.",
					"Operational Semantics of a Weak Memory Model with Channel Synchronization.",
					"Stepwise Development and Model Checking of a Distributed Interlocking System - Using RAISE.",
					"Resource-Aware Design for Reliable Autonomous Applications with Multiple Periods.",
					"Verifying Auto-generated C Code from Simulink - An Experience Report in the Automotive Domain.",
					"QFLan: A Tool for the Quantitative Analysis of Highly Reconfigurable Systems.",
					"Modular Verification of Programs with Effects and Effect Handlers in Coq.",
					"Combining Tools for Optimization and Analysis of Floating-Point Computations.",
					"A Formally Verified Floating-Point Implementation of the Compact Position Reporting Algorithm.",
					"Formal Verification of Automotive Simulink Controller Models: Empirical Technical Challenges, Evaluation and Recommendations.",
					"Multi-robot LTL Planning Under Uncertainty.",
					"Vector Barrier Certificates and Comparison Systems.",
					"Timed Vacuity.",
					"Falsification of Cyber-Physical Systems Using Deep Reinforcement Learning.",
					"Dynamic Symbolic Verification of MPI Programs.",
					"To Compose, or Not to Compose, That Is the Question: An Analysis of Compositional State Space Generation.",
					"View Abstraction for Systems with Component Identities.",
					"Compositional Reasoning for Shared-Variable Concurrent Programs.",
					"Statistical Model Checking of LLVM Code.",
					"SDN-Actors: Modeling and Verification of SDN Programs.",
					"CompoSAT: Specification-Guided Coverage for Model Finding.",
					"Approximate Partial Order Reduction.",
					"A Lightweight Deadlock Analysis for Programs with Threads and Reentrant Locks.",
					"Formal Specification and Verification of Dynamic Parametrized Architectures.",
					"From Formal Requirements to Highly Assured Software for Unmanned Aircraft Systems.",
					"Interlocking Design Automation Using Prover Trident.",
					"Model-Based Testing for Avionics Systems.",
					"On Software Safety, Security, and Abstract Interpretation.",
					"Variant Analysis with QL.",
					"Object-Oriented Security Proofs.",
					"Z3 and SMT in Industrial R&D.",
					"Evidential and Continuous Integration of Software Verification Tools.",
					"Disruptive Innovations for the Development and the Deployment of Fault-Free Software."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1810-08739",
				"sub_name": "Proceedings 18th Refinement Workshop, Refine@FM 2018, Oxford, UK, 18th July 2018.",
				"count": 6,
				"papers": [
					"A Theory of Lazy Imperative Timing.",
					"Some Challenges of Specifying Concurrent Program Components.",
					"Ordering Strict Partial Orders to Model Behavioral Refinement.",
					"Programming Without Refining.",
					"Correctness of Concurrent Objects under Weak Memory Models.",
					"Refining Santa: An Exercise in Efficient Synchronization."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1811-09014",
				"sub_name": "Proceedings 4th Workshop on Formal Integrated Development Environment, F-IDE@FLoC 2018, Oxford, England, 14 July 2018.",
				"count": 8,
				"papers": [
					"Lightweight Interactive Proving inside an Automatic Program Verifier.",
					"User Support for the Combinator Logic Synthesizer Framework.",
					"AsmetaF: A Flattener for the ASMETA Framework.",
					"Improving the Visualization of Alloy Instances.",
					"Experience Report on Formally Verifying Parts of OpenJDK's API with KeY.",
					"Isabelle/jEdit as IDE for Domain-specific Formal Languages and Informal Text Documents.",
					"A Notebook Format for the Holistic Design of Embedded Systems (Tool Paper).",
					"Integrating User Design and Formal Models within PVSio-Web."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "21st FM 2016",
		"info": "Limassol, Cyprus",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2016",
				"sub_name": "FM 2016: Formal Methods - 21st International Symposium, Limassol, Cyprus, November 9-11, 2016, Proceedings.",
				"count": 50,
				"papers": [
					"Industrial-Strength Model-Based Testing of Safety-Critical Systems.",
					"Counter-Example Guided Program Verification.",
					"Tighter Reachability Criteria for Deadlock-Freedom Analysis.",
					"Compositional Parameter Synthesis.",
					"Combining Mechanized Proofs and Model-Based Testing in the Formal Analysis of a Hypervisor.",
					"A Model Checking Approach to Discrete Bifurcation Analysis.",
					"State-Space Reduction of Non-deterministically Synchronizing Systems Applicable to Deadlock Detection in MPI.",
					"Formal Verification of Multi-Paxos for Distributed Consensus.",
					"Validated Simulation-Based Verification of Delayed Differential Dynamics.",
					"Towards Learning and Verifying Invariants of Cyber-Physical Systems by Code Mutation.",
					"From Electrical Switched Networks to Hybrid Automata.",
					"Danger Invariants.",
					"Local Planning of Multiparty Interactions with Bounded Horizons.",
					"Finding Suitable Variability Abstractions for Family-Based Analysis.",
					"Recovering High-Level Conditions from Binary Programs.",
					"Upper and Lower Amortized Cost Bounds of Programs Expressed as Cost Relations.",
					"Exploring Model Quality for ACAS X.",
					"Learning Moore Machines from Input-Output Traces.",
					"Modal Kleene Algebra Applied to Program Correctness.",
					"Mechanised Verification Patterns for Dafny.",
					"Formalising and Validating the Interface Description in the FMI Standard.",
					"An Algebra of Synchronous Atomic Steps.",
					"Error Invariants for Concurrent Traces.",
					"An Executable Formalisation of the SPARCv8 Instruction Set Architecture: A Case Study for the LEON3 Processor.",
					"Hybrid Statistical Estimation of Mutual Information for Quantifying Information Flow.",
					"A Generic Logic for Proving Linearizability.",
					"Refactoring Refinement Structure of Event-B Machines.",
					"Towards Concolic Testing for Hybrid Systems.",
					"Explaining Relaxed Memory Models with Program Transformations.",
					"SpecCert: Specifying and Verifying Hardware-Based Security Enforcement.",
					"Automated Verification of Timed Security Protocols with Clock Drift.",
					"Dealing with Incompleteness in Automata-Based Model Checking.",
					"Equivalence Checking of a Floating-Point Unit Against a High-Level C Model.",
					"Battery-Aware Scheduling in Low Orbit: The GomX-3 Case.",
					"Discounted Duration Calculus.",
					"Sound and Complete Mutation-Based Program Repair.",
					"An Implementation of Deflate in Coq.",
					"Decoupling Abstractions of Non-linear Ordinary Differential Equations.",
					"Regression Verification for Unbalanced Recursive Functions.",
					"Automated Mutual Explicit Induction Proof in Separation Logic.",
					"Finite Model Finding Using the Logic of Equality with Uninterpreted Functions.",
					"GPUexplore 2.0: Unleashing GPU Explicit-State Model Checking.",
					"Approximate Bisimulation and Discretization of Hybrid CSP.",
					"A Linear Programming Relaxation Based Approach for Generating Barrier Certificates of Hybrid Systems.",
					"Model-Based Design of an Energy-System Embedded Controller Using Taste.",
					"Simulink to UPPAAL Statistical Model Checker: Analyzing Automotive Industrial Systems.",
					"Safety-Assured Formal Model-Driven Design of the Multifunction Vehicle Bus Controller.",
					"Taming Interrupts for Verifying Industrial Multifunction Vehicle Bus Controllers.",
					"Rule-Based Incremental Verification Tools Applied to Railway Designs and Regulations.",
					"RIVER: A Binary Analysis Framework Using Symbolic Execution and Reversible x86 Instructions."
				]
			},
			{
				"sub_name_abbr": "journals/corr/DuboisMM17",
				"sub_name": "Proceedings of the Third Workshop on Formal Integrated Development Environment, F-IDE@FM 2016, Limassol, Cyprus, November 8, 2016.",
				"count": 7,
				"papers": [
					"Evaluation of Formal IDEs for Human-Machine Interface Design and Analysis: The Case of CIRCUS and PVSio-web.",
					"Predicting SMT Solver Performance for Software Verification.",
					"Industrial Experience Report on the Formal Specification of a Packet Filtering Language Using the K Framework.",
					"Extending a User Interface Prototyping Tool with Automatic MISRA C Code Generation.",
					"The KeYmaera X Proof IDE - Concepts on Usability in Hybrid Systems Theorem Proving.",
					"Interfacing Automatic Proof Agents in Atelier B: Introducing \"iapa\".",
					"User Assistance Characteristics of the USE Model Checking Tool."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "20th FM 2015",
		"info": "Oslo, Norway",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2015",
				"sub_name": "FM 2015: Formal Methods - 20th International Symposium, Oslo, Norway, June 24-26, 2015, Proceedings.",
				"count": 43,
				"papers": [
					"Resource Analysis: From Sequential to Concurrent and Distributed Programs.",
					"AVACS: Automatic Verification and Analysis of Complex Systems Highlights and Lessons Learned.",
					"Automated Circular Assume-Guarantee Reasoning.",
					"Towards Formal Verification of Orchestration Computations Using the 핂 Framework.",
					"Narrowing Operators on Template Abstract Domains.",
					"Detection of Design Flaws in the Android Permission Protocol Through Bounded Verification.",
					"Privacy by Design in Practice: Reasoning about Privacy Properties of Biometric System Architectures.",
					"A Specification Language for Static and Runtime Verification of Data and Control Properties.",
					"Certificates for Parameterized Model Checking.",
					"Safety, Liveness and Run-Time Refinement for Modular Process-Aware Information Systems with Dynamic Sub Processes.",
					"Verifying Opacity of a Transactional Mutex Lock.",
					"A Framework for Correctness Criteria on Weak Memory Models.",
					"Semantics-Preserving Simplification of Real-World Firewall Rule Sets.",
					"Parameter Synthesis Through Temporal Logic Specifications.",
					"Trace-Length Independent Runtime Monitoring of Quantitative Policies in LTL.",
					"Probabilistic Bisimulation for Realistic Schedulers.",
					"QPMC: A Model Checker for Quantum Programs and Protocols.",
					"Automated Verification of RPC Stub Code.",
					"Property-Driven Fence Insertion Using Reorder Bounded Model Checking.",
					"Verifying the Safety of a Flight-Critical System.",
					"Proving Safety with Trace Automata and Bounded Model Checking.",
					"Verifying Parameterized Timed Security Protocols.",
					"Abstraction of Elementary Hybrid Systems by Variable Transformation.",
					"Using Real-Time Maude to Model Check Energy Consumption Behavior.",
					"Static Differential Program Analysis for Software-Defined Networks.",
					"A Fully Verified Container Library.",
					"Counterexamples for Expected Rewards.",
					"The Semantics of Cardinality-Based Feature Models via Formal Languages.",
					"Axiomatization of Typed First-Order Logic.",
					"Model-Based Problem Solving for University Timetable Validation and Improvement.",
					"Certified Reasoning with Infinity.",
					"Direct Formal Verification of Liveness Properties in Continuous and Hybrid Dynamical Systems.",
					"Rigorous Estimation of Floating-Point Round-off Errors with Symbolic Taylor Expansions.",
					"Static Optimal Scheduling for Synchronous Data Flow Graphs with Model Checking.",
					"Eliminating Static Analysis False Positives Using Loop Abstraction and Bounded Model Checking.",
					"Autofunk: An Inference-Based Formal Model Generation Framework for Production Systems.",
					"Software Development and Authentication for Arms Control Information Barriers.",
					"Analyzing the Restart Behavior of Industrial Control Applications.",
					"Case Study: Static Security Analysis of the Android Goldfish Kernel.",
					"Practices for Formal Models as Documents: Evolution of VDM Application to \"Mobile FeliCa\" IC Chip Firmware.",
					"Formal Virtual Modelling and Data Verification for Supervision Systems.",
					"Using Simulink Design Verifier for Automatic Generation of Requirements-Based Tests.",
					"Formalizing the Concept Phase of Product Development."
				]
			},
			{
				"sub_name_abbr": "conf/fm/2015fmseet",
				"sub_name": "Proceedings of the First Workshop on Formal Methods in Software Engineering Education and Training, FMSEE&T 2015, co-located with 20th International Symposium on Formal Methods (FM 2015), Oslo, Norway, June 23, 2015.",
				"count": 9,
				"papers": [
					"Why, how and what should be taught about Formal Methods?",
					"Helping Programmers to Adopt Set-Based Specifications.",
					"The Role of Modelling in Teaching Formal Methods for Software Engineering.",
					"Foundations of Semantics and Model Checking in a Software Engineering Course.",
					"Making Formal Methods Popular: The Crux is Math Education!",
					"Keys and Roles of Formal Methods Education for Industry: 10 Year Experience with Top SE Program.",
					"Separation of Considerations in Event-B Refinement toward Industrial Use.",
					"Well-defined Software Process as Vehicle to Understand Effectiveness of Formal Methods.",
					"Evaluation of Formal Reasoning Abilities Using a Concept Inventory."
				]
			},
			{
				"sub_name_abbr": "journals/corr/DuboisMM15",
				"sub_name": "Proceedings Second International Workshop on Formal Integrated Development Environment, F-IDE 2015, Oslo, Norway, June 22, 2015.",
				"count": 7,
				"papers": [
					"Building an IDE for the Calculational Derivation of Imperative Programs.",
					"Towards Enabling Overture as a Platform for Formal Notation IDEs.",
					"An experimental Study using ACSL and Frama-C to formulate and verify Low-Level Requirements from a DO-178C compliant Avionics Project.",
					"The AutoProof Verifier: Usability by Non-Experts and on Standard Code.",
					"Formal Reasoning Using an Iterative Approach with an Integrated Web IDE.",
					"A Holistic Approach in Embedded System Development.",
					"Software Architecture of Code Analysis Frameworks Matters: The Frama-C Example."
				]
			},
			{
				"sub_name_abbr": "journals/corr/DerrickBR16",
				"sub_name": "Proceedings 17th International Workshop on Refinement, Refine@FM 2015, Oslo, Norway, 22nd June 2015.",
				"count": 9,
				"papers": [
					"Formal refinement of extended state machines.",
					"Big Data Refinement.",
					"Unifying Theories of Mobile Channels.",
					"A logic for n-dimensional hierarchical refinement.",
					"Program Derivation by Correctness Enhacements.",
					"SCJ-Circus: a refinement-oriented formal notation for Safety-Critical Java.",
					"Programming Language Features for Refinement.",
					"Towards linking correctness conditions for concurrent objects and contextual trace refinement.",
					"A Theory of Service Dependency."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "19th FM 2014",
		"info": "Singapore",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2014",
				"sub_name": "FM 2014: Formal Methods - 19th International Symposium, Singapore, May 12-16, 2014. Proceedings.",
				"count": 49,
				"papers": [
					"Validity Checking of Putback Transformations in Bidirectional Programming.",
					"Proof Engineering Considered Essential.",
					"Engineering UToPiA - Formal Semantics for CML.",
					"40 Years of Formal Methods - Some Obstacles and Some Possibilities?",
					"A Refinement Based Strategy for Local Deadlock Analysis of Networks of CSP Processes.",
					"Algebraic Principles for Rely-Guarantee Style Concurrency Verification Tools.",
					"Definition, Semantics, and Analysis of Multirate Synchronous AADL.",
					"TrustFound: Towards a Formal Foundation for Model Checking Trusted Computing Platforms.",
					"The VerCors Tool for Verification of Concurrent Programs.",
					"Knowledge-Based Automated Repair of Authentication Protocols.",
					"A Simplified Z Semantics for Presentation Interaction Models.",
					"Log Analysis for Data Protection Accountability.",
					"Automatic Compositional Synthesis of Distributed Systems.",
					"Automated Real Proving in PVS via MetiTarski.",
					"Quiescent Consistency: Defining and Verifying Relaxed Linearizability.",
					"Temporal Precedence Checking for Switched Models and Its Application to a Parallel Landing Protocol.",
					"Contracts in Practice.",
					"When Equivalence and Bisimulation Join Forces in Probabilistic Automata.",
					"Precise Predictive Analysis for Discovering Communication Deadlocks in MPI Programs.",
					"Proof Patterns for Formal Methods.",
					"Efficient Runtime Monitoring with Metric Temporal Logic: A Case Study in the Android Operating System.",
					"iscasMc: A Web-Based Probabilistic Model Checker.",
					"Invariants, Well-Founded Statements and Real-Time Program Algebra.",
					"Checking Liveness Properties of Presburger Counter Systems Using Reachability Analysis.",
					"A Symbolic Algorithm for the Analysis of Robust Timed Automata.",
					"Revisiting Compatibility of Input-Output Modal Transition Systems.",
					"Co-induction Simply - Automatic Co-inductive Proofs in a Program Verifier.",
					"Management of Time Requirements in Component-Based Systems.",
					"Compositional Synthesis of Concurrent Systems through Causal Model Checking and Learning.",
					"Formal Verification of Operational Transformation.",
					"Verification of a Transactional Memory Manager under Hardware Failures and Restarts.",
					"SCJ: Memory-Safety Checking without Annotations.",
					"Refactoring, Refinement, and Reasoning - A Logical Characterization for Hybrid Systems.",
					"Object Propositions.",
					"Flexible Invariants through Semantic Collaboration.",
					"Efficient Tight Field Bounds Computation Based on Shape Predicates.",
					"A Graph-Based Transformation Reduction to Reach UPPAAL States Faster.",
					"Computing Quadratic Invariants with Min- and Max-Policy Iterations: A Practical Comparison.",
					"Efficient Self-composition for Weakest Precondition Calculi.",
					"Towards a Formal Analysis of Information Leakage for Signature Attacks in Preferential Elections.",
					"Analyzing Clinical Practice Guidelines Using a Decidable Metric Interval-Based Temporal Logic.",
					"A Modular Theory of Object Orientation in Higher-Order UTP.",
					"Formalizing and Verifying a Modern Build Language.",
					"The Wireless Fire Alarm System: Ensuring Conformance to Industrial Standards through Formal Verification.",
					"Formally Verifying Graphics FPU - An Intel® Experience.",
					"MDP-Based Reliability Analysis of an Ambient Assisted Living System.",
					"Diagnosing Industrial Business Processes: Early Experiences.",
					"Formal Verification of Lunar Rover Control Software Using UPPAAL.",
					"Formal Verification of a Descent Guidance Control Program of a Lunar Lander."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "18th FM 2012",
		"info": "Paris, France",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2012",
				"sub_name": "FM 2012: Formal Methods - 18th International Symposium, Paris, France, August 27-31, 2012. Proceedings.",
				"count": 38,
				"papers": [
					"Software Security: A Formal Perspective - (Notes for a Talk).",
					"Formal Methods in the Wild: Trains, Planes, & Automobile.",
					"Who Are We, and What Are We Doing Here?",
					"Automata Learning through Counterexample Guided Abstraction Refinement.",
					"Julienne: A Trace Slicer for Conditional Rewrite Theories.",
					"IMITATOR 2.5: A Tool for Analyzing Robustness in Scheduling Problems.",
					"Maximal and Compositional Pattern-Based Loop Invariants.",
					"A Formal Approach to Autonomous Vehicle Coordination.",
					"Quantified Event Automata: Towards Expressive and Efficient Runtime Monitors.",
					"Decentralised LTL Monitoring.",
					"Measles Epidemics and PEPA: An Exploration of Historic Disease Dynamics Using Process Algebra.",
					"A Certified Constraint Solver over Finite Domains.",
					"Collaborative Verification and Testing with Explicit Assumptions.",
					"TLA + Proofs.",
					"The Modal Transition System Control Problem.",
					"When Structural Refinement of Components Keeps Temporal Properties over Reconfigurations.",
					"Error Invariants.",
					"Correctness of Pointer Manipulating Algorithms Illustrated by a Verified BDD Construction.",
					"A Formal Framework for Modelling Coercion Resistance and Receipt Freeness.",
					"Using Time to Add Order to Distributed Testing.",
					"A Verification Toolkit for Numerical Transition Systems - Tool Paper.",
					"Satellite Rendezvous and Conjunction Avoidance: Case Studies in Verification of Nonlinear Hybrid Systems.",
					"Executing Formal Semantics with the K Tool.",
					"Automatic Compositional Verification of Timed Systems.",
					"Applying Software Model Checking Techniques for Behavioral UML Models.",
					"Reachability Analysis of the HTML5 Parser Specification and Its Application to Compatibility Testing.",
					"Theory and Techniques for Synthesizing Efficient Breadth-First Search Algorithms.",
					"Improved BDD-Based Discrete Analysis of Timed Systems.",
					"Experience Report on Designing and Developing Control Components Using Formal Methods.",
					"Automatic Dimensional Analysis of Cyber-Physical Systems.",
					"Validating B, Z and TLA + Using ProB and Kodkod.",
					"From Hoare Logic to Matching Logic Reachability.",
					"Distribution of Modal Transition Systems.",
					"Efficient Malware Detection Using Model-Checking.",
					"Formalization of Incremental Simplex Algorithm by Stepwise Refinement.",
					"VMC: A Tool for Product Variability Analysis.",
					"Specification-Based Test Repair Using a Lightweight Formal Method.",
					"A \"Hybrid\" Approach for Synthesizing Optimal Controllers of Hybrid Systems: A Case Study of the Oil Pump Industrial Example."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "17th FM 2011",
		"info": "Limerick, Ireland",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2011",
				"sub_name": "FM 2011: Formal Methods - 17th International Symposium on Formal Methods, Limerick, Ireland, June 20-24, 2011. Proceedings.",
				"count": 32,
				"papers": [
					"Model Integration and Cyber Physical Systems: A Semantics Perspective.",
					"Some Thoughts on Behavioral Programming.",
					"The Only Way Is Up.",
					"Does It Pay to Extend the Perimeter of a World Model?",
					"System Verification through Program Verification.",
					"Adaptive Cruise Control: Hybrid, Distributed, and Now Formally Verified.",
					"TraceContract: A Scala DSL for Trace Analysis.",
					"Using Debuggers to Understand Failed Verification Attempts.",
					"Sampling-Based Runtime Verification.",
					"Specifying and Verifying the SYNERGY Reconfiguration Protocol with LOTOS NT and CADP.",
					"Formal Development of a Tool for Automated Modelling and Verification of Relay Interlocking Systems.",
					"Relational Reasoning via SMT Solving.",
					"Building VCL Models and Automatically Generating Z Specifications from Them.",
					"The 1st Verified Software Competition: Experience Report.",
					"Validated Compilation through Logic.",
					"Certification of Safe Polynomial Memory Bounds.",
					"Relational Verification Using Product Programs.",
					"Specifying Confidentiality in Circus.",
					"Formally Verifying Isolation and Availability in an Idealized Model of Virtualization.",
					"The Safety-Critical Java Memory Model: A Formal Account.",
					"Failure-Divergence Refinement of Compensating Communicating Processes.",
					"Termination without \\checkmark\\checkmark in CSP.",
					"Timed Migration and Interaction with Access Permissions.",
					"From a Community of Practice to a Body of Knowledge: A Case Study of the Formal Methods Community.",
					"Verifying Linearisability with Potential Linearisation Points.",
					"Refinement-Based Verification of Local Synchronization Algorithms.",
					"Simulating Concurrent Behaviors with Worst-Case Cost Bounds.",
					"Automatically Refining Partial Specifications for Program Verification.",
					"Structured Specifications for Better Verification of Heap-Manipulating Programs.",
					"Verification of Unloadable Modules.",
					"A Multi-encoding Approach for LTL Symbolic Satisfiability Checking.",
					"On Combining State Space Reductions with Global Fairness Assumptions."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1106-3488",
				"sub_name": "Proceedings 15th International Refinement Workshop, Refine@FM 2011, Limerick, Ireland, 20th June 2011.",
				"count": 11,
				"papers": [
					"Discovery of Invariants through Automated Theory Formation.",
					"Bigraphical Refinement.",
					"Building a refinement checker for Z.",
					"Refinement by interpretation in π-institutions.",
					"Refinement-based verification of sequential implementations of Stateflow charts.",
					"Refinement for Probabilistic Systems with Nondeterminism.",
					"Model exploration and analysis for quantitative safety refinement in probabilistic B.",
					"Formalising the Continuous/Discrete Modeling Step.",
					"A CSP Account of Event-B Refinement.",
					"Perspicuity and Granularity in Refinement.",
					"Concurrent Scheduling of Event-B Models."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "FM 2009",
		"info": "Eindhoven, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2009",
				"sub_name": "FM 2009: Formal Methods, Second World Congress, Eindhoven, The Netherlands, November 2-6, 2009. Proceedings.",
				"count": 53,
				"papers": [
					"Formal Methods for Privacy.",
					"What Can Formal Methods Bring to Systems Biology?",
					"Guess and Verify - Back to the Future.",
					"Verification, Testing and Statistics.",
					"Security, Probability and Nearly Fair Coins in the Cryptographers' Café.",
					"Recursive Abstractions for Parameterized Systems.",
					"Abstract Model Checking without Computing the Abstraction.",
					"Three-Valued Spotlight Abstractions.",
					"Fair Model Checking with Process Counter Abstraction.",
					"Systematic Development of Trustworthy Component Systems.",
					"Partial Order Reductions Using Compositional Confluence Detection.",
					"A Formal Method for Developing Provably Correct Fault-Tolerant Systems Using Partial Refinement and Composition.",
					"Abstract Specification of the UBIFS File System for Flash Memory.",
					"Inferring Mealy Machines.",
					"Formal Management of CAD/CAM Processes.",
					"Translating Safe Petri Nets to Statecharts in a Structure-Preserving Way.",
					"Symbolic Predictive Analysis for Concurrent Programs.",
					"On the Difficulties of Concurrent-System Design, Illustrated with a 2×2 Switch Case Study.",
					"Sums and Lovers:  Case Studies in Security, Compositionality and Refinement.",
					"Iterative Refinement of Reverse-Engineered Models by Model-Based Testing.",
					"Model Checking Linearizability via Refinement.",
					"It's Doomed; We Can Prove It.",
					"\"Carbon Credits\" for Resource-Bounded Computations Using Amortised Analysis.",
					"Field-Sensitive Value Analysis by Field-Insensitive Analysis.",
					"Making Temporal Logic Calculational: A Tool for Unification and Discovery.",
					"A Tableau for CTL.",
					"Certifiable Specification and Verification of C Programs.",
					"Formal Reasoning about Expectation Properties for Continuous Random Variables.",
					"The Denotational Semantics of slotted-Circus.",
					"Unifying Probability with Nondeterminism.",
					"Towards an Operational Semantics for Alloy.",
					"A Robust Semantics Hides Fewer Errors.",
					"Analysis of a Clock Synchronization Protocol for Wireless Sensor Networks.",
					"Formal Verification of Avionics Software Products.",
					"Formal Verification of Curved Flight Collision Avoidance Maneuvers: A Case Study.",
					"Connecting UML and VDM++ with Open Tool Support.",
					"Language and Tool Support for Class and State Machine Refinement in UML-B.",
					"Dynamic Classes: Modular Asynchronous Evolution of Distributed Concurrent Objects.",
					"Abstract Object Creation in Dynamic Logic.",
					"Reasoning about Memory Layouts.",
					"A Smooth Combination of Linear and Herbrand Equalities for Polynomial Time Must-Alias Analysis.",
					"On the Complexity of Synthesizing Relaxed and Graceful Bounded-Time 2-Phase Recovery.",
					"Verifying Real-Time Systems against Scenario-Based Requirements.",
					"Formal Specification of a Cardiac Pacing System.",
					"Automated Property Verification for Large Scale B Models.",
					"Reduced Execution Semantics of MPI: From Theory to Practice.",
					"A Metric Encoding for Bounded Model Checking.",
					"An Incremental Approach to Scope-Bounded Checking Using a Lightweight Formal Method.",
					"Verifying Information Flow Control over Unbounded Processes.",
					"Specification and Verification of Web Applications in Rewriting Logic.",
					"Verifying the Microsoft Hyper-V Hypervisor with VCC.",
					"Industrial Practice in Formal Methods: A Review.",
					"Model-Based GUI Testing Using Uppaal at Novo Nordisk."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "15th FM 2008",
		"info": "Turku, Finland",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2008",
				"sub_name": "FM 2008: Formal Methods, 15th International Symposium on Formal Methods, Turku, Finland, May 26-30, 2008, Proceedings.",
				"count": 32,
				"papers": [
					"Aspects and Formal Methods.",
					"Getting Formal Verification into Design Flow.",
					"Lessons in the Weird and Unexpected: Some Experiences from Checking Large Real Systems.",
					"Simulation, Orchestration and Logical Clocks.",
					"CoVaC: Compiler Validation by Program Analysis of the Cross-Product.",
					"Lazy Behavioral Subtyping.",
					"Checking Well-Formedness of Pure-Method Specifications.",
					"Verifying Dynamic Pointer-Manipulating Threads.",
					"Proofs and Refutations for Probabilistic Refinement.",
					"Assume-Guarantee Verification for Interface Automata.",
					"Automated Verification of Dense-Time MTL Specifications Via Discrete-Time Approximation.",
					"A Model Checking Language for Concurrent Value-Passing Systems.",
					"Verification of Mondex Electronic Purses with KIV: From a Security Protocol to Verified Code.",
					"Incremental Development of a Distributed Real-Time Model of a Cardiac Pacing System Using VDM.",
					"Industrial Use of Formal Methods for a High-Level Security Evaluation.",
					"Secret Ninja Formal Methods.",
					"Specification and Checking of Software Contracts for Conditional Information Flow.",
					"JML Runtime Assertion Checking: Improved Error Reporting and Efficiency Using Strong Validity.",
					"Provably Correct Runtime Monitoring.",
					"A Schedulerless Semantics of TLM Models Written in SystemC Via Translation into LOTOS.",
					"A Rigorous Approach to Networking: TCP, from Implementation to Protocol to Service.",
					"Constraint Prioritization for Efficient Analysis of Declarative Models.",
					"Finding Minimal Unsatisfiable Cores of Declarative Specifications.",
					"Precise Interval Analysis vs. Parity Games.",
					"Introducing Objects through Refinement.",
					"Masking Faults While Providing Bounded-Time Phased Recovery.",
					"Towards Consistent Specifications of Product Families.",
					"Formal Methods for Trustworthy Skies: Building Confidence in the Security of Aircraft Assets Distribution.",
					"An Industrial Case: Pitfalls and Benefits of Applying Formal Methods to the Development of a Network-Centric RTOS.",
					"Software Engineering with Formal Methods: Experiences with the Development of a Storm Surge Barrier Control System.",
					"Application of a Formal Specification Language in the Development of the \"Mobile FeliCa\" IC Chip Firmware for Embedding in Mobile Phone.",
					"Safe and Reliable Metro Platform Screen Doors Control/Command Systems."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "14th FM 2006",
		"info": "Hamilton, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2006",
				"sub_name": "FM 2006: Formal Methods, 14th International Symposium on Formal Methods, Hamilton, Canada, August 21-27, 2006, Proceedings.",
				"count": 45,
				"papers": [
					"The Embedded Systems Design Challenge.",
					"The Mondex Challenge: Machine Checked Proofs for an Electronic Purse.",
					"Interactive Verification of Medical Guidelines.",
					"Certifying Airport Security Regulations Using the Focal Environment.",
					"Proving Safety Properties of an Aircraft Landing Protocol Using I/O Automata and the PVS Theorem Prover: A Case Study.",
					"Validating the Microsoft Hypervisor.",
					"Interface Input/Output Automata.",
					"Properties of Behavioural Model Merging.",
					"Automatic Translation from Circus to Java.",
					"Quantitative Refinement and Model Checking for the Analysis of Probabilistic Systems.",
					"Modeling and Validating Distributed Embedded Real-Time Systems with VDM++.",
					"Towards Modularized Verification of Distributed Time-Triggered Systems.",
					"A Story About Formal Methods Adoption by a Railway Signaling Manufacturer.",
					"Partially Introducing Formal Methods into Object-Oriented Development: Case Studies Using a Metrics-Driven Approach.",
					"Compositional Class Refinement in Object-Z.",
					"A Proposal for Records in Event-B.",
					"Pointfree Factorization of Operation Refinement.",
					"A Formal Template Language Enabling Metaproof.",
					"Dynamic Frames: Support for Framing, Dependencies and Sharing Without Restrictions.",
					"Type-Safe Two-Level Data Transformation.",
					"Feature Algebra.",
					"Using Domain-Independent Problems for Introducing Formal Methods.",
					"Compositional Binding in Network Domains.",
					"Formal Modeling of Communication Protocols by Graph Transformation.",
					"Feature Specification and Static Analysis for Interaction Resolution.",
					"A Fully General Operational Semantics for UML 2.0 Sequence Diagrams with Potential and Mandatory Choice.",
					"Towards Automatic Exception Safety Verification.",
					"Enforcer - Efficient Failure Injection.",
					"Automated Boundary Test Generation from JML Specifications.",
					"Formal Reasoning About Non-atomic Java Card Methods in Dynamic Logic.",
					"Formal Verification of a C Compiler Front-End.",
					"A Memory Model Sensitive Checker for C#.",
					"Changing Programs Correctly: Refactoring with Specifications.",
					"Mechanical Verification of Recursive Procedures Manipulating Pointers Using Separation Logic.",
					"Model-Based Variable and Transition Orderings for Efficient Symbolic Model Checking.",
					"Exact and Approximate Strategies for Symmetry Reduction in Model Checking.",
					"Monitoring Distributed Controllers: When an Efficient LTL Algorithm on Sequences Is Needed to Model-Check Traces.",
					"PSL Model Checking and Run-Time Verification Via Testers.",
					"Formal Methods for Security: Lightweight Plug-In or New Engineering Discipline.",
					"Formal Methods in the Security Business: Exotic Flowers Thriving in an Expanding Niche.",
					"Connector-Based Software Development: Deriving Secure Protocols.",
					"Model-Based Security Engineering for Real.",
					"Cost Effective Software Engineering for Security.",
					"Formal Methods and Cryptography.",
					"Verified Software Grand Challenge."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "FM 2005",
		"info": "Newcastle upon Tyne, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2005",
				"sub_name": "FM 2005: Formal Methods, International Symposium of Formal Methods Europe, Newcastle, UK, July 18-22, 2005, Proceedings.",
				"count": 40,
				"papers": [
					"Formal Aids for the Growth of Software Systems.",
					"Formal Methods and Testing: Hypotheses, and Correctness Approximations.",
					"The Natural History of Bugs: Using Formal Methods to Analyse Software Related Failures in Space Missions.",
					"Modular Verification of Static Class Invariants.",
					"Decoupling in Object Orientation.",
					"Controlling Object Allocation Using Creation Guards.",
					"Symbolic Animation of JML Specifications.",
					"Certified Memory Usage Analysis.",
					"Compositional Specification and Analysis of Cost-Based Properties in Probabilistic Programs.",
					"Formally Defining and Verifying Master/Slave Speculative Parallelization.",
					"Systematic Implementation of Real-Time Models.",
					"Timing Tolerances in Safety-Critical Software.",
					"Timed Testing with TorX.",
					"Automatic Verification and Conformance Testing for Validating Safety Properties of Reactive Systems.",
					"Adding Conflict and Confusion to CSP.",
					"Combining CSP and B for Specification and Property Verification.",
					"Operational Semantics for Model Checking Circus.",
					"Control Law Diagrams in Circus.",
					"Verification of a Signature Architecture with HOL-Z.",
					"End-to-End Integrated Security and Performance Analysis on the DEGAS Choreographer Platform.",
					"Formal Verification of Security Properties of Smart Card Embedded Source Code.",
					"A Formal Model of Addressing for Interoperating Networks.",
					"An Approach to Unfolding Asynchronous Communication Protocols.",
					"Semantics of BPEL4WS-Like Fault and Compensation Handling.",
					"On Some Galois Connection Based Abstractions for the Mu-Calculus.",
					"Retrenching the Purse: Finite Sequence Numbers, and the Tower Pattern.",
					"Strategic Term Rewriting and Its Application to a VDMSL to SQL Conversion.",
					"Synthesis of Distributed Processes from Scenario-Based Specifications.",
					"Verifying Scenario-Based Aspect Specifications.",
					"An MDA Approach Towards Integrating Formal and Informal Modeling Languages.",
					"Model-Checking of Specifications Integrating Processes, Data and Time.",
					"Automatic Symmetry Detection for Model Checking Using Computational Group Theory.",
					"On Partitioning and Symbolic Model Checking.",
					"Dynamic Component Substitutability Analysis.",
					"Floating-Point Verification.",
					"Preliminary Results of a Case Study: Model Checking for Advanced Automotive Applications.",
					"Model-Based Testing in Practice.",
					"Testing Concurrent Object-Oriented Systems with Spec Explorer.",
					"ASD Case Notes: Costs and Benefits of Applying Formal Methods to Industrial Control Software.",
					"The Informal Nature of Systems Engineering."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "FME 2003",
		"info": "Pisa, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2003",
				"sub_name": "FME 2003: Formal Methods, International Symposium of Formal Methods Europe, Pisa, Italy, September 8-14, 2003, Proceedings.",
				"count": 49,
				"papers": [
					"Looking Back to the Future: Thoughts on Paradigm Shift in Software Development.",
					"Past, Present, and Future of SRA Implementation of CafeOBJ: Annex.",
					"On Failures and Faults.",
					"Trends in Software Verification.",
					"Event Based Sequential Program Development: Application to Constructing a Pointer Program.",
					"Proving the Shalls.",
					"Adaptable Translator of B Specifications to Embedded C Programs.",
					"Integrating Model-Checking Architectural Analysis and Validation in a Real Software Life-Cycle.",
					"Lessons Learned from a Successful Implementation of Formal Methods in an Industrial Project.",
					"Determining the Specification of a Control System from That of Its Environment.",
					"Managerial Issues for the Consideration and Use of Formal Methods.",
					"Verifying Emulation of Legacy Mission Computer Systems.",
					"Improving Safety Assessment of Complex Systems: An Industrial Case Study.",
					"Compositional Verification of an ATM Protocol.",
					"Proving the Correctness of Simpson's 4-Slot ACM Using an Assertional Rely-Guarantee Proof Method.",
					"Synthesis and Verification of Constraints in the PGM Protocol.",
					"Mapping Statecharts to Verilog for Hardware/Software Co-specification.",
					"A Strategy for Compiling Classes, Inheritance, and Dynamic Binding.",
					"A Semantic Foundation for TCOZ in Unifying Theories of Programming.",
					"Refinement and Verification of Synchronized Component-Based Systems.",
					"Certifying and Synthesizing Membership Equational Proofs.",
					"Team Automata Satisfying Compositionality.",
					"Composing Invariants.",
					"Java Applet Correctness: A Developer-Oriented Approach.",
					"Improving JML: For a Safer and More Effective Language.",
					"Using Abstractions for Heuristic State Space Exploration of Reactive Object-Oriented Systems.",
					"A Formal Framework for Modular Synchronous System Design.",
					"Generating Counterexamples for Multi-valued Model-Checking.",
					"Combining Real-Time Model-Checking and Fault Tree Analysis.",
					"Model-Checking TRIO Specifications in SPIN.",
					"Computing Meta-transitions for Linear Transition Systems with Polynomials.",
					"Translation-Based Compositional Reasoning for Software Systems.",
					"Watchdog Transformations for Property-Oriented Model-Checking.",
					"A Circus Semantics for Ravenscar Protected Objects.",
					"Constructing Deadlock Free Event-Based Applications: A Rely/Guarantee Approach.",
					"A General Approach to Deadlock Freedom Verification for Software Architectures.",
					"Taking Alloy to the Movies.",
					"Interacting State Machines for Mobility.",
					"Composing Temporal-Logic Specifications with Machine Assistance.",
					"Model Checking FTA.",
					"Program Checking with Certificates: Separating Correctness-Critical Code.",
					"Reification of Executable Test Scripts in Formal Specicifation-Based Test Generation: The Java Card Transaction Mechanism Case Study.",
					"Checking and Reasoning about Semantic Web through Alloy.",
					"Structuring Retrenchments in B by Decomposition.",
					"Design of an Automatic Prover Dedicated to the Refinement of Database Applications.",
					"ProB: A Model Checker for B.",
					"SAT-Based Model-Checking of Security Protocols Using Planning Graph Analysis.",
					"Correctness of Source-Level Safety Policies.",
					"A Topological Characterization of TCP/IP Security."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "FM 2002",
		"info": "Copenhagen, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2002",
				"sub_name": "FME 2002: Formal Methods - Getting IT Right, International Symposium of Formal Methods Europe, Copenhagen, Denmark, July 22-24, 2002, Proceedings.",
				"count": 34,
				"papers": [
					"Little Engines of Proof.",
					"Automated Boundary Testing from Z and B.",
					"Improvements in Coverability Analysis.",
					"Heuristic-Driven Test Case Selection from Formal Specifications. A Case Study.",
					"UniTesK Test Suite Architecture.",
					"Hoare Logic for NanoJava: Auxiliary Variables, Side Effects, and Virtual Methods Revisited.",
					"Do Not Read This.",
					"Safeness of Make-Based Incremental Recompilation.",
					"An Algorithmic Approach to Design Exploration.",
					"Mechanical Abstraction of CSPZ Processes.",
					"Verifying Erlang Code: A Resource Locker Case-Study.",
					"Towards an Integrated Model Checker for Railway Signalling Data.",
					"Correctness by Construction: Integrating Formality into a Commercial Development Process.",
					"VAlloy - Virtual Functions Meet a Relational Language.",
					"Verification Using Test Generation Techniques.",
					"Formal Specification and Static Checking of Gemplus' Electronic Purse Using ESC/Java.",
					"Development of an Embedded Verifier for Java Card Byte Code Using Formal Methods.",
					"Deriving Cryptographically Sound Implementations Using Composition and Formally Verified Bisimulation.",
					"Interference Analysis for Dependable Systems Using Refinement and Abstraction.",
					"The Formal Classification and Verification of Simpson's 4-Slot Asynchronous Communication Mechanism.",
					"Timing Analysis of Assembler Code Control-Flow Paths.",
					"Towards OCL/RT.",
					"On Combining Functional Verification and Performance Evaluation Using CADP.",
					"The Next 700 Synthesis Calculi.",
					"Synthesizing Certified Code.",
					"Refinement in Circus.",
					"Forward Simulation for Data Refinement of Classes.",
					"A Formal Basis for a Program Compilation Proof Tool.",
					"Property Dependent Abstraction of Control Structure for Software Verification.",
					"Closing Open SDL-Systems for Model Checking with DTSpin.",
					"A Generalised Sweep-Line Method for Safety Properties.",
					"Supplementing a UML Development Process with B.",
					"Semantic Web for Extending and Linking Formalisms.",
					"A Language for Describing Wireless Mobile Applications with Dynamic Establishment of Multi-way Synchronization Channels."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "FME 2001",
		"info": "Berlin, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/2001",
				"sub_name": "FME 2001: Formal Methods for Increasing Software Productivity, International Symposium of Formal Methods Europe, Berlin, Germany, March 12-16, 2001, Proceedings.",
				"count": 35,
				"papers": [
					"Lightweight Formal Methods.",
					"Reformulation: A Way to Combine Dynamic Properties and B Refinement.",
					"Mechanized Analysis of Behavioral Conformance in the Eiffel Base Libraries.",
					"Proofs of Correctness of Cache-Coherence Protocols.",
					"Model-Checking over Multi-valued Logics.",
					"How to Make FDR Spin LTL Model Checking of CSP by Refinement.",
					"Avoiding State Explosion for Distributed Systems with Timestamps.",
					"Secrecy-Preserving Refinement.",
					"Information Flow Control and Applications - Bridging a Gap.",
					"A Rigorous Approach to Modeling and Analyzing E-Commerce Architectures.",
					"A Formal Model for Reasoning about Adaptive QoS-Enabled Middleware.",
					"A Programming Model for Wide-Area Computing.",
					"A Formal Model of Object-Oriented Design and GoF Design Patterns.",
					"Validation of UML Models Thanks to Z and Lustre.",
					"Components, Contracts, and Connectors for the Unified Modelling Language UML.",
					"An Integrated Approach to Specification and Validation of Real-Time Systems.",
					"Real-Time Logic Revisited.",
					"Improvements in BDD-Based Reachability Analysis of Timed Automata.",
					"Serialising Parallel Processes in a Hardware/Software Partitioning Context.",
					"Verifying Implementation Relations.",
					"An Adequate Logic for Full LOTOS.",
					"Towards a Topos Theoretic Foundation for the Irish School of Constructive Mathematics.",
					"Faithful Translations among Models and Specifications.",
					"Composing Contracts: An Adventure in Financial Engineering.",
					"From Complex Specifications to a Working Prototype. A Protocol Engineering Case Study.",
					"Coverage Directed Generation of System-Level Test Cases for the Validation of a DSP System.",
					"Using Formal Verification Techniques to Reduce Simulation and Test Effort.",
					"Transacted Memory for Smart Cards.",
					"Houdini, an Annotation Assistant for ESC/Java.",
					"A Heuristic for Symmetry Reductions with Scalarsets.",
					"View Updatability Based on the Models of a Formal Specification.",
					"Grammar Adaptation.",
					"Test-Case Calculation through Abstraction.",
					"A Modular Approach to the Specification and Validation of an Electrical Flight Control System.",
					"A Combined Testing and Verification Approach for Software Reliability."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "FM 1999",
		"info": "Toulouse, France",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1999-1",
				"sub_name": "FM'99 - Formal Methods, World Congress on Formal Methods in the Development of Computing Systems, Toulouse, France, September 20-24, 1999, Proceedings, Volume I.",
				"count": 50,
				"papers": [
					"Theories of Programming: Top-Down and Bottom-Up and Meeting in the Middle.",
					"Scientific Decisions which Characterize VDM.",
					"Mechanized Formal Methods: Where Next?",
					"Integration, the Price of Success.",
					"The Role of Formalism in Method.",
					"Formal Design for Automatic Coding and Testing: The ESSI/SPACES Project.",
					"A Business Process Design Language.",
					"Refinement of Pipe-and-Filter Architectures.",
					"A Formalization of Software Architecture.",
					"Component and Interface Refinement in Closed-System Specifications.",
					"Semantics of First Order Parametric Specifications.",
					"A Perfect Verification: Combining Model Checking with Deductive Analysis to Verify Real-Life Software.",
					"Error Detection with Directed Symbolic Model Checking.",
					"Formal Modeling and Analysis of Hybrid Systems: A Case Study in Multi-robot Coordination.",
					"On-the-Fly Controller Synthesis for Discrete and Dense-Time Systems.",
					"On-the-Fly Verification of Linear Temporal Logic.",
					"Symbolic Model Checking with Fewer Fixpoint Computations.",
					"Formula Based Abstractions of Transition Systems for Real-Time Model Checking.",
					"IF: An Intermediate Representation and Validation Environment for Timed Asynchronous Systems.",
					"Automatic Verification of Pointer Data-Structure Systems for All Numbers of Processes.",
					"The Use of the B Formal Method for the Design and the Validation of the Transaction Mechanism for Smart Card Applications.",
					"Météor: A Successful Application of B in a Large Project.",
					"Formal Development of Databases in ASSO and B.",
					"Interpreting the B-Method in the Refinement Calculus.",
					"Compositional Symmetric Sharing in B.",
					"Structural Embeddings: Mechanization with Method.",
					"The Safe Machine: A New Specification Construct for B.",
					"csp2B: A Practical Approach to Combining CSP and B.",
					"Test Criteria Definition for B Models.",
					"Bunches for Object-Oriented, Concurrent, and Real-Time Specification.",
					"Applications of Structural Synthesis of Programs.",
					"Towards a Compositional Approach to the Design and Verification of Distributed Systems.",
					"Formal Modeling in a Commercial Setting: A Case Study.",
					"KVEST: Automated Generation of Test Suites from Formal Specifications.",
					"Feature Interaction Detection Using Testing and Model-Checking Experience Report.",
					"Emma: Developing an Industrial Reachability Analyser for SDL.",
					"Correctness Proof of the Standardized Algorithm for ABR Conformance.",
					"Verifying a Distributed Database Lookup Manager Written in Erlang.",
					"Secure Interoperation of Secure Distributed Databases.",
					"A Formal Security Model for Microprocessor Hardware.",
					"Abstraction and Testing.",
					"Formal Analysis of a Secure Communication Channel: Secure Core-Email Protocol.",
					"Probabilistic Polynomial-Time Equivalence and Security Analysis.",
					"A Uniform Approach for the Definition of Security Properties.",
					"Group Principals and the Formalization of Anonymity.",
					"Developing BON as an Industrial-Strength Formal Method.",
					"On the Expressive Power of OCL.",
					"A Systematic Approach to Transform OMT Diagrams to a B Specification.",
					"Verifying Consistency and Validity of Formal Specifications by Testing.",
					"A GSM-MAP Protocol Experiment Using Passive Testing."
				]
			},
			{
				"sub_name_abbr": "conf/fm/1999-2",
				"sub_name": "FM'99 - Formal Methods, World Congress on Formal Methods in the Development of Computing Systems, Toulouse, France, September 20-24, 1999, Proceedings, Volume II.",
				"count": 62,
				"papers": [
					"From Informal Requirements to COOP: A Concurrent Automata Approach.",
					"A Framework for Defining Object-Calculi.",
					"A Translation of Statecharts to Esterel.",
					"An Operational Semantics for Timed RAISE.",
					"Data Abstraction for CSP-OZ.",
					"Systems Development Using Z Generics.",
					"A Brief Summary of VSPEC.",
					"Enhancing the Pre- and Postcondition Technique for More Expressive Specifications.",
					"On Excusable and Inexcusable Failures.",
					"Interfacing Program Construction and Verification.",
					"Software Verification Based on Linear Programming.",
					"Sensors and Actuators in TCOZ.",
					"The UniForM Workbench, a Universal Development Environment for Formal Methods.",
					"Integrating Formal Description Techniques.",
					"A More Complete TLA.",
					"Formal Justification of the Rely-Guarantee Paradigm for Shared-Variable Concurrency: A Semantic Approach.",
					"Relating Z and First-Order Logic.",
					"Formal Modeling of the Enterprise JavaBeansTM Component Integration Framework.",
					"Developing Components in the Presence of Re-entrance.",
					"Communication and Synchronisation Using Interaction Objects.",
					"Modelling Microsoft COM Using pi-Calculus.",
					"Validation of Mixed SIGNAL-ALPHA Real-Time Systems through Affine Calculus on Clock Synchronisation Constraints.",
					"Combining Theorem Proving and Continuous Models in Synchronous Design.",
					"ParTS: A Partitioning Transformation System.",
					"A Behavioral Model for Co-design.",
					"A Weakest Precondition Semantics for an Object-Oriented Language of Refinement.",
					"Reasoning About Interactive Systems.",
					"Non-atomic Refinement in Z.",
					"Refinement Semantics and Loop Rules.",
					"Lessons from the Application of Formal Methods to the Design of a Storm Surge Barrier Control System.",
					"The Value of Verification: Positive Experience of Industrial Proof.",
					"Formal Development and Verification of a Distributed Railway Control System.",
					"Safety Analysis in Formal Specification.",
					"Formal Specification and Validation of a Vital Communication Protocol.",
					"Incremental Design of a Power Transformer Station Controller Using a Controller Synthesis Methodology.",
					"Verifying Behavioural Specifications in CafeOBJ Environment.",
					"Component-Based Algebraic Specification and Verification in CafeOBJ.",
					"Using Algebraic Specification Techniques in Development of Object-Oriented Frameworks.",
					"Maude as a Formal Meta-tool.",
					"Hiding More of Hidden Algebra.",
					"A Termination Detection Algorithm: Specification and Verification.",
					"Logspace Reducibility via Abstract State Machines.",
					"Formal Methods for Extensions to CAS.",
					"An Algebraic Framework for Higher-Order Modules.",
					"Applying Formal Proof Techniques to Avionics Software: A Pragmatic Approach.",
					"Secure Synthesis of Code: A Process Improvement Experiment.",
					"Cronos: A Separate Compilation Toolset for Modular Esterel Applications.",
					"Tool Support for Production Use of Formal Techniques.",
					"Modeling Aircraft Mission Computer Task Rates.",
					"A Study of Collaborative Work: Answers to a Test on Formal Specification in B.",
					"Archived Design Steps in Temporal Logic.",
					"A PVS-Based Approach for Teaching Constructing Correct Iterations.",
					"A Minimal Framework for Specification Theory.",
					"A Model of Specification-Based Testing of Interactive Systems.",
					"Algebraic Aspects of the Mapping between Abstract Syntax Notation One and CORBA IDL.",
					"Retrenchment.",
					"Proof Preservation in Component Generalization.",
					"Formal Modelling and Simulation of Train Control Systems Using Petri Nets.",
					"Formal Specification of a Voice Communication System Used in Air Traffic Control.",
					"Model-Checking the Architectural Design of a Fail-Safe Communication System for Railway Interlocking Systems.",
					"Analyzing the Requirements of an Access Control Using VDMTools and PVS.",
					"Cache Coherence Verification with TLA+."
				]
			}
		]
	},
	{
		"year": "1998",
		"name": "FM-Trends 1998",
		"info": "Boppard, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1998",
				"sub_name": "Applied Formal Methods - FM-Trends 98, International Workshop on Current Trends in Applied Formal Method, Boppard, Germany, October 7-9, 1998, Proceedings.",
				"count": 28,
				"papers": [
					"High Level System Design and Analysis Using Abstract State Machines.",
					"Enriching the Software Development Process by Formal Methods.",
					"Formal Program Development in Geometric Modeling.",
					"Design of Distributed Multimedia Applications (DAMD).",
					"Structured Formal Verification of a Fragment of the IBM S/390 Clock Chip.",
					"Automated Test Set Generation for Statecharts.",
					"Rigorous Compiler Implementation Correctness: How to Prove the Real Thing Correct.",
					"Translation Validation: From DC+ to C*.",
					"A Practical Hierarchical Design by Timed Simulation Relations for Real-Time Systems.",
					"A Lightweight Approach to Formal Methods.",
					"An Open Environment for the Integration of Hetereogenous Modelling Techniques and Tools.",
					"Integrating Domain Specific Language Design in the Software Life Cycle.",
					"Flexible and Reliable Process Model Properties: An Integrated Approach.",
					"A Symbolic Model Checker for ACTL.",
					"Critical Systems Validation and Verification with CSP and FDR.",
					"UniForM Perspectives for Formal Methods.",
					"The UniForM WorkBench - A Higher Order Tool Integration Framework.",
					"Two Real Formal Verification Experiences: ATM Switch Chip and Parallel Cache Protocol.",
					"Formal Methods in the Specification of the Emergency Closing System of the Eastern Scheldt Storm Surge Barrier.",
					"The New Topicality of Using Formal Models of Security Policy within the Security Engineering Process.",
					"Towards Comprehensive Tool Support for Abstract State Machines: The ASM Workbench Tool Environment and Architecture.",
					"The IFAD VDM Tools: Lightweight Formal Methods.",
					"KIV 3.0 for Provably Correct Systems.",
					"PVS: An Experience Report.",
					"QUEST: Overview over the Project.",
					"VSE: Controlling the Complexity in Formal Software Developments.",
					"The wHOLe System.",
					"Z/EVES Version 1.5: An Overview."
				]
			}
		]
	},
	{
		"year": "1997",
		"name": "4th FME 1997",
		"info": "Graz, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1997",
				"sub_name": "FME '97: Industrial Applications and Strengthened Foundations of Formal Methods, 4th International Symposium of Formal Methods Europe, Graz, Austria, September 15-19, 1997, Proceedings.",
				"count": 35,
				"papers": [
					"Diagrams and Programming Languages for Programmable Controllers.",
					"Graphical Specification and Reasoning: Case Study Generalised Railroad Crossing.",
					"A Graphic Notation for Formal Specifications of Dynamic Systems.",
					"A Semantic Integration of Object-Z and CSP for the Specification of Concurrent Systems.",
					"Class Refinement and Interface Refinement in Object-Oriented Programs.",
					"Formalizing Requirements for Distributed Systems with Trace Diagrams.",
					"Consistent Graphical Specification of Distributed Systems.",
					"Design of Reactive Control Systems for Event-Drivem Operations.",
					"An M-Net Semantics for a Real-Time Extension of µSDL.",
					"Reconciling Real-Time with Asynchronous Message Passing.",
					"Specifying the Remote Control of Valves in an Explosion Test Environment.",
					"PICGAL: Practical Use of Formal Specification to Develop a Complex Critical System.",
					"Mathematical Modeling and Analysis of an External Memory Manager.",
					"Automatic Translation of VDM-SL Specifications into Gofer.",
					"Towards an Integrated CASE and Theorem Proving Tool for VDM-SL.",
					"Specification of Required Non-determinism.",
					"A Corrected Failure Divergence Model for CSP in Isabelle/HOL.",
					"A Proof Obligation Generator for VDM-SL.",
					"Verification of Cryptographic Protocols: An Experiment.",
					"TLA + PROMELA: Conjecture, Check, Proof, Engineering New Protocols Using Methods and Formal Notations.",
					"A TLA Solution to the Specification and Verification of the RLP1 Retransmission Protocol.",
					"An Efficient Technique for Deadlock Analysis of Large Scale Process Networks.",
					"Implementing a Model Checker for LEGO.",
					"Formal Verification of Transformations for Peephole Optimization.",
					"A Meta-Method for Formal Method Integration.",
					"Reuse of Verified Design Templates Through Extended Pattern Matching.",
					"A Compositional Proof System for Shared Variable Concurrency.",
					"A Framework for Modular Formal Specification and Verification.",
					"A Timed Semantics for the STATEMATE Implementation of Statecharts.",
					"Using PVS to Prove a Z Refinement: A Case Study.",
					"Verification of Reactive Systems Using DisCo and PVS.",
					"Term Rewrite Systems to Derive Set Boolean Operations on 2D Objects.",
					"A Normal Form Reduction Strategy for Hardware/Software Partitioning.",
					"Viewpoint Consistency in Z and LOTOS: A Case Study.",
					"A UNITY Mapping Operator for Distributed Programs."
				]
			}
		]
	},
	{
		"year": "1996",
		"name": "3rd FME 1996",
		"info": "Oxford, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1996",
				"sub_name": "FME '96: Industrial Benefit and Advances in Formal Methods, Third International Symposium of Formal Methods Europe, Co-Sponsored by IFIP WG 14.3, Oxford, UK, March 18-22, 1996, Proceedings.",
				"count": 38,
				"papers": [
					"How Did Software Get So Reliable Without Proof?",
					"A Case Study on the Formal Development of a Reactor Safety System.",
					"Test Automation for Safety-Critical Systems: Industrial Application and Future Developments.",
					"Quantitative Analysis of an Application of Formal Methods.",
					"Applying the B Technologies on CICS.",
					"Refining Action Systems within B-Tool.",
					"Integrating Action Systems and Z in a Medical System Specification.",
					"Formalizing Anaesthesia: a case study in formal specification.",
					"A New System Engineering Methodology Coupling Formal Specification and Performance Evaluation.",
					"Formalizing New Navigation Requirements for NASA's Space Shuttle.",
					"Combining VDM-SL Specifications with C++ Code.",
					"Data Reification without Explicit Abstraction Functions.",
					"Formal and Informal Specifications of a Secure System Component: Final Results in a Comparative Study.",
					"Visual Verification of Safety and Liveness.",
					"Graphical Development of Consistent System Specifications.",
					"Deduction in the Verification Support Environment (VSE).",
					"Consistency and Refinement for Partial Specification in Z.",
					"Combining Statecharts and Z for the Design of Safety-Critical Control Systems.",
					"Integrating Real-Time Scheduling Theory and Program Refinement.",
					"Using a Logical and Categorical Approach for the Validation of Fault-Tolerant Systems.",
					"Local Nondeterminism in Asynchronously Communicating Processes.",
					"Identification of and Solutions to Shortcomings of LCL, a Larch/C Interface Specification Language.",
					"Formal Specification and Verification of the pGVT Algorithm.",
					"Automatic Verification of a Hydroelectric Power Plant.",
					"Experiences in Embedded Scheduling.",
					"Model Checking in Practice: An Analysis of the ACCESS.bus Protocol using SPIN.",
					"The Incremental Development of Correct Specifications for Distributed Systems.",
					"A Theory of Distributing Train Rescheduling.",
					"An Improved Translation of SA/RT Specification Model to High-Level Timed Petri Nets.",
					"From Testing Theory to Test Driver Implementation.",
					"Program Slicing Using Weakest Preconditions.",
					"A Formal Approach to Architectural Design Patterns.",
					"Modular Completeness: Integrating the Reuse of Specified Software in Top-down Program Development.",
					"A Strategic Approach to Transformational Design.",
					"Correct and User-Friendly Implementations of Transformation Systems.",
					"An Example of Use of Formal Methods to Debug an Embedded Software.",
					"Experiments in Theorem Proving and Model Checking for Protocol Verification.",
					"Procedure-Level Verification of Real-time Concurrent Systems."
				]
			}
		]
	},
	{
		"year": "1994",
		"name": "2nd FME 1994",
		"info": "Barcelona, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1994",
				"sub_name": "FME '94: Industrial Benefit of Formal Methods, Second International Symposium of Formal Methods Europe, Barcelona, Spain, October 24-18, 1994, Proceedings.",
				"count": 41,
				"papers": [
					"From Action Systems to Modular Systems.",
					"Formal Methods in the Railways Signalling Industry.",
					"Formal and Informal Specifications of a Secure System Component: first results in a comparative study.",
					"Formalising British Rail's Signalling Rules.",
					"Three Applications of Formal Methods at MITRE.",
					"Specification and Analysis of a Security Management System.",
					"Verification Techniques for LOTOS.",
					"Experiences in Using the Abstract Machine Notation in a GKS Case Study.",
					"Seven More Myths of Formal Methods.",
					"Comparing Approaches to Data Reification.",
					"Towards a Formalization of Programming-by-Difference.",
					"A new Concept of Refinement used for Behaviour Modelling with Automata.",
					"An Extended VDM Refinement Relation.",
					"On transferring VDM verification techniques to Z.",
					"Proof-Based Development of Specifications with KIDS/VDM.",
					"Evaluation of Underdetermined Explicit Definitions.",
					"A Precise Examination of the Behaviour of Process Models.",
					"A Theory of Presentations.",
					"Applying a Concurrent Formal Framework to Process Modelling.",
					"From MooZ to Eiffel - A Rigorous Approach to System Development.",
					"OPUS: a Formal Approach to Object-Orientation.",
					"A Strategy for the Production of Verifiable Code Using the B Method.",
					"Specifying & Verifying Concurrent Systems Using Z.",
					"A Critical Look at Functional Specifications.",
					"Informal Strategies in Design by Refinement.",
					"An experimental support system for formal mathematical reasoning.",
					"Literate Mathematical Development of a Revision Management System.",
					"An Action Semantics for ML Concurrency Primitives.",
					"A Semantics for NewSpeak in VDM-SL.",
					"Evaluation Semantics in Z.",
					"Abstract Model Checking of Infinite Specifications.",
					"Case Study: Specification and Refinement of the PI-Bus.",
					"Stepwise Refinement of Control Software - A Case Study Using RAISE.",
					"Specifying Safety and Progress Properties with RSL.",
					"Validation of a Railway Interlocking Model.",
					"A Formal Specification of an Automatic Train Protection System.",
					"Adding Real Time to Formal Program Development.",
					"Combining the Design of Industrial Systems with Effective Verification Techniques.",
					"RTL and Refutation by Positive Cycles.",
					"Formalising the Semantics of Ward/Mellor SA/RT Essential Models using a Process Algebra.",
					"Deriving Relational Database Programs from Formal Specifications."
				]
			}
		]
	},
	{
		"year": "1993",
		"name": "1st FME 1993",
		"info": "Odense, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1993",
				"sub_name": "FME '93: Industrial-Strength Formal Methods, First International Symposium of Formal Methods Europe, Odense, Denmark, April 19-23, 1993, Proceedings.",
				"count": 40,
				"papers": [
					"Reasoning about Interference in an Object-Based Design Method.",
					"Using Relative Refinement for Fault Tolerance.",
					"Specification and Validation of a Security Policy Model.",
					"Experience from Applications of RAISE.",
					"Role of VDM(++) in the Development of a Real-Time Tracking and Tracing System.",
					"The Integration of LOTOS with an Object Oriented Development Method.",
					"An Industrial Experience on LOTOS-Based Prototyping for Switching Systems Design.",
					"Towards an Implementation-oriented Specification of TP Protocol in LOTOS.",
					"A Metalanguage for the Formal Requirement Specification of Reactive Systems.",
					"Model Checking in Practice - The T9000 Virtual Channel Processor.",
					"Algorithm Refinement with Read and Write Frames.",
					"Invariants, Frames and Postconditions: a Comparison of the VDM and B Notations.",
					"The Industrial Take-up of Formal Methods in Safety-Critical and Other Areas: A Perspective.",
					"A Proof Environment for Concurrent Programs.",
					"A VDM Study of Fault-Tolerant Stable Storage - Towards a Computer Engineering Mathematics.",
					"Applications of Modal Logic for the Specification of Real-Time Systems.",
					"Formal Methods Reality Check: Industrial Usage.",
					"Automating the Generation and Sequencing of Test Cases from Model-Based Specifications.",
					"The Parallel Abstract Machine: A Common Execution Model for FDTs.",
					"Generalizing Abadi & Lamport's Method to Solve a Problem Posed by A. Pnueli.",
					"Real-Time Refinement.",
					"Different FDT's Confronted with Different ODP-Viewpoints of the Trader.",
					"On the Derivation of Executable Database Programs from Formal Specifications.",
					"A Concurrency Case Study Using RAISE.",
					"Specifying a Safety-Critical Control System in Z.",
					"An Overview of the SPRINT Method.",
					"Application of Composition Development Method for definition of SYNTHESIS information resource query language semantics.",
					"Verification Tools in the Development of Provably Correct Compilers.",
					"Encoding W: A Logic for Z in 2OBJ.",
					"Formal Verification for Fault-Tolerant Architectures: Some Lessons Learned.",
					"Conformity Clause for VDM-SL.",
					"Process Instances in LOTOS Simulation.",
					"The SAZ Project: Integrating SSADM and Z..",
					"Maintaining Consistency Under Changes to Formal Specifications.",
					"An EVES Data Abstraction Example.",
					"Putting Advanced Reachability Analysis Techniques Together: the \"ARA\" Tool.",
					"Integrating SA/RT with LOTOS.",
					"Symbolic Model Checking for Distributed Real-Time Systems.",
					"Adding Specification Constructors to the Refinement Calculus.",
					"Selling Formal Methods to Industry."
				]
			}
		]
	},
	{
		"year": "1991",
		"name": "4th VDM Europe 1991",
		"info": "Noordwijkerhout, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1991-1",
				"sub_name": "VDM '91 - Formal Software Development, 4th International Symposium of VDM Europe, Noordwijkerhout, The Netherlands, October 21-25, 1991, Proceedings, Volume 1: Conference Contributions.",
				"count": 54,
				"papers": [
					"Description is our Business.",
					"Concurrent Processes as Objects (Abstract).",
					"The Larch Approach to Specification (Abstract).",
					"Formal Specification in Metamorphic Programing.",
					"Formalizing Design Spaces: Implicit Invocation Mechanisms.",
					"On Type Checking in VDM and Related Consistency Issues.",
					"Combining Transformation and Posit-and Prove in a VDM Development.",
					"A Case for Structured Analysis/Formal Design.",
					"A Model-Oriented Method for Algebraic Specification using COLD-1 as Notation.",
					"A Mechanical Formalization of Several Fairness Notions.",
					"Specification and Stepwise Development of Communicating Systems.",
					"Writing Operational Semantics in Z: A Sructural Approach.",
					"EZ: A System for Automatic Prototyping of Z Specifications.",
					"Z and High Level Petri Nets.",
					"An Approach to the Static Semantics of VDM-SL.",
					"Behavioural Extension for CSP.",
					"CPO's do not form a CPO, and yet Recursion Works.",
					"LPF and MPLomega - A Logical Comparison of VDM SL and COLD-K.",
					"Tactical Tools for Distributing VDM Specifications.",
					"An Attempt to Reason about Shared-State Concurrency in the Style of VDM.",
					"Reasoning about VDM Specifications.",
					"On Formal Specification of a Proof Tool.",
					"Reasoning about VDM Developments using the VDM Support Tool in MURAL.",
					"EVES: An Overview.",
					"Deriving Transivity of VDM-Reification in DEVA.",
					"Upgrading the Pre- and Postcondition Technique.",
					"The Formal Development of a Secure Transaction Mechanism.",
					"Formal Development of a Serial Copy Management System.",
					"Specification and Refinement in an Integrated Database Application Environment.",
					"Techniques for Partial Specification and Specification of Switching Systems.",
					"Specification of the MAA Standard in VDM.",
					"Unintrusive Ways to Integrate Formal Specifications in Practice.",
					"An Overview of HP-SL.",
					"CICS Project Report: Experiences and Results from the use of Z in IBM.",
					"A Debugger for a Meta-IV-like Meta-Language.",
					"An Executable Subset of Meta-IV with Loose Specification.",
					"Using VDM within an Object-Oriented Framework.",
					"The Integrated Software Development and Verification System ATES.",
					"Using RAISE - First Impressions from the LaCoS Applications.",
					"A Specification of a Complex Programming Language Statement.",
					"The PROSPECTRA System.",
					"The Visual Presentation of VDM Specifications.",
					"MURAL and SPECBOX.",
					"The VDM Domain Compiler: A VDM Class Library Generator.",
					"The Delft VDM-SL Front-End.",
					"Prototyping with Temporal VDM: A Status Report.",
					"The EXSPECT Tool.",
					"CADIZ - Computer Aided Design in Z.",
					"The HP-ST Toolset.",
					"The RAISE Toolset.",
					"The IBM Z Tool.",
					"The VDM-SL Editor and Consistency Checker.",
					"B-Tool.",
					"A VDM Subset Compiler."
				]
			},
			{
				"sub_name_abbr": "conf/fm/1991-2",
				"sub_name": "VDM '91 - Formal Software Development, 4th International Symposium of VDM Europe, Noordwijkerhout, The Netherlands, October 21-25, 1991, Proceedings, Volume 2: Tutorials.",
				"count": 11,
				"papers": [
					"A Tutorial on LARCH and LCL, A LARCH/C Interface Language.",
					"A Tutorial on the Refinement Calculus.",
					"The Refinement Calculus.",
					"An Introduction to Refinement in Z.",
					"Two Refinement Case Studies.",
					"Tutorial on the Irish School of the VDM.",
					"The RAISE Specification Langiage: A Tutorial.",
					"Formal Development with ABEL.",
					"The PROSPECTRA Methodology and System: Uniform Transformational (Meta-) Development.",
					"The B-Method.",
					"Mathematical Methods for Digital Systems Development."
				]
			}
		]
	},
	{
		"year": "1990",
		"name": "3rd VDM Europe 1990",
		"info": "Kiel, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1990",
				"sub_name": "VDM '90, VDM and Z - Formal Methods in Software Development, Third International Symposium of VDM Europe, Kiel, FRG, April 17-21, 1990, Proceedings.",
				"count": 27,
				"papers": [
					"Object Orientation and Formal Techniques.",
					"An Algebraic Approach to Refinement.",
					"Modal Logic Programming.",
					"Z Specification of an Object Manager.",
					"Correctness in the Small.",
					"A Formal Approach to Hypertext using Post-Prototype Formal Specification.",
					"Programming with VDM Domains.",
					"A Buffering System Implementation using VDM.",
					"Formal Specifications as Reusable Frameworks.",
					"Z and the Refinement Calculus.",
					"Modularizing the Formal Description of a Database System.",
					"Modular Extensions to Z.",
					"Adding Abstract Datatypes to Meta-IV.",
					"Towards a Semantics for Object-Z.",
					"HOOD and Z for the Development of Complex Software Systems.",
					"Using Z as a Specification Calculus for Object-Oriented Systems.",
					"Specifying Open Distributed Systems with Z.",
					"Refinement of State-Based Concurrent Systems.",
					"Refining Data to Processes.",
					"Two Approaches towards the Formalisation of VDM.",
					"Type Checking BSI/VDM-SL.",
					"Type Inference in Z.",
					"Recursive Definitions Revisited.",
					"Towards the Semantics of the Definitional Language of MetaSoft.",
					"On Conservative Extensions of Syntax in the Process of System Development.",
					"A Formal Semantics for Z and the Link between Z and the Relational Algebra.",
					"A Naive Domain Universe for VDM."
				]
			}
		]
	},
	{
		"year": "1988",
		"name": "2nd VDM Europe 1988",
		"info": "Dublin, Ireland",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1988",
				"sub_name": "VDM '88, VDM - The Way Ahead, 2nd VDM-Europe Symposium, Dublin, Ireland, September 11-16, 1988, Proceedings.",
				"count": 29,
				"papers": [
					"Computing is a Physical Science (Abstract).",
					"Structuring for the VDM Specification Language.",
					"Correctness for Beginners.",
					"Understanding an informal Description: Office Documents Architecture, an ISO Standard.",
					"Towards a Formal Definition of GKS and other Graphic Standards.",
					"Report from the BSIPanel for the Standardisation of VDM (IST/5/50).",
					"Formal Methods in Standards - A Report from the BCS Working Group.",
					"The B Tool (Abstract).",
					"Specification of an Operating System Kernel FOREST and VDM compared.",
					"Compiler Prototyping with VDM and Standard ML.",
					"VDM Development with ADA as the Target Language.",
					"NUSL: An Executable Specification Language Based on Data Abstraction.",
					"A Support System for Formal Reasoning: Requirements and Status.",
					"The Use of VDM within the Alvey Flagship Project.",
					"The Formal Definition of Modula-2 and Its Associated Interpreter.",
					"Test Case Selection using VDM.",
					"The VIP VDM Specification Language.",
					"SAMPLE - A Functional Language.",
					"A Three-Valued Logic for Software Specification and Validation.",
					"Three-Valued Predicates for Software Specification and Validation.",
					"A Set-Theoretic Model for a Typed Polymorphic Lambda Calculus - A Contribution to MetaSoft.",
					"Mutually Recursive Algebraic Domain Equations.",
					"Proof Rules for VDM Statements.",
					"MUFFIN: A User Interface Design Experiment for a Theorem Proving Assistant.",
					"The RAISE Language, Method and Tools.",
					"Correctness Proofs for Meta IV Written Code Generator Specification using Term Rewriting.",
					"Using VDM with Rely and Guarantee-Conditions - Experiences from a Real Project.",
					"Software Support for the Refinement of VDM Specifications.",
					"The Use of VDM in the Specification of Chinese Characters."
				]
			}
		]
	},
	{
		"year": "1987",
		"name": "1st VDM Europe 1987",
		"info": "Brussels, Belgium",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1987",
				"sub_name": "VDM '87, VDM - A Formal Method at Work, VDM-Europe Symposium, Brussels, Belgium, March 23-26, 1987, Proceedings.",
				"count": 22,
				"papers": [
					"VDM: Origins, Hopes, and Achievements.",
					"Experience Using VDM in STC.",
					"VDM in Three Generations of Ada* Formal Descriptions.",
					"Experience with VDM in Norsk Data.",
					"Using VDM in an Object-Oriented Development Method for Ada Software.",
					"The Stepwise Development of Software Development Graphs: Meta-Programming VDM Developments.",
					"Heap Storage Specification and Development.",
					"VDM as a Specification Method for Telecommunications Software.",
					"Support Environments for VDM.",
					"Development and Application of a Meta IV Compiler.",
					"From VDM to RAISE.",
					"Denotational Engineering or from Denotations to Syntax.",
					"A Type Model for VDM.",
					"A Formal Description of Object-Oriented Programming Using VDM.",
					"VDM Proof Obligations and their Justification.",
					"Mathematical Structures and their Morphisms in Meta-IV.",
					"Objectives of the British Standardisation of a Language to support the Vienna Development Method - The BSI VDM Specification Language Standardisation Panel - United Kingdom.",
					"Use of VDM within CCITT.",
					"A Formal Semantics for a DataFlow Machine - Using VDM.",
					"Introduction to the VDM Tutorial.",
					"Specification by Data Types.",
					"Data Reification and Program Decomposition."
				]
			}
		]
	},
	{
		"year": "1981",
		"name": "Program Specification 1981",
		"info": "Aarhus, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1981",
				"sub_name": "Program Specification, Proceedings of a Workshop, Aarhus, Denmark, August 1981.",
				"count": 17,
				"papers": [
					"Introduction.",
					"Issues and Observations.",
					"Geometrical Constructions.",
					"KWIC-index generation.",
					"Communication Network.",
					"Partial Correctness of Distributed Programs.",
					"Specification of Distributed Programs.",
					"Robust Data Types.",
					"A Reduction Specification for DTL.",
					"Recursive Definitions of Operations in Universal Algebras.",
					"The SRDL Specification Experiment.",
					"Program Specification by Module Trees.",
					"Parameter Passing in Algebraic Specification Languages.",
					"A few Remarks on Putting Formal Specifications to Productive Use.",
					"A Specification Language.",
					"Tecton: A Language for Manipulating Generic Objects.",
					"Concurrency."
				]
			}
		]
	},
	{
		"year": "1979",
		"name": "The Use of Formal Specification of Software 1979",
		"info": "Berlin, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1979",
				"sub_name": "The Use of Formal Specification of Software, June 25-27, 1979, Berlin, Germany.",
				"count": 8,
				"papers": [
					"Towards a Uniform Design Methodology for Software, Firmware, and Hardware.",
					"Writing Simulatable Specifications in SPECIAL.",
					"An Overview of RDM: Rational Design Methodology.",
					"Abstraction and Refinement in RDM.",
					"Hierarchical Specification of Abstract Data Types.",
					"An Approach to the Specification of Distributed Software.",
					"Correctness of Software - An Overview.",
					"Interactive Design and Verification: A Message Switching Network Example."
				]
			}
		]
	},
	{
		"year": "1978",
		"name": "The Vienna Development Method",
		"info": "The Meta-Language 1978",
		"venues": [
			{
				"sub_name_abbr": "conf/fm/1978",
				"sub_name": "The Vienna Development Method: The Meta-Language.",
				"count": 6,
				"papers": [
					"On the Formalization of Programming Languages: Early History and Main Approaches.",
					"Programming in the META-Language: A Tutorial.",
					"The META-Language: A Reference Manual.",
					"Denotational Semantics of GOTO: An Exit Formulation and Its Relation to Continuations.",
					"A Formal Definition of Algol 60 as Described in the 1975 Modified Report.",
					"Software Abstraction Principles: Tutorial Examples of: An Operating System Command Language Specification, and a PL/I-like On-Condition Language Definition."
				]
			}
		]
	}
]