[
    {
        "year": "2021",
        "name": "29th SIGSOFT FSE / 20th ESEC 2021",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2021",
                "sub_name": "ESEC/FSE '21: 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, Athens, Greece, August 23-28, 2021.",
                "count": 188,
                "papers": [
                    "Programming and execution models for next generation code intelligence systems (keynote).",
                    "The 4ps: product, process, people, and productivity: a data-driven approach to improve software engineering (keynote).",
                    "Interactive analysis of large code bases (invited talk).",
                    "Managers hate uncertainty: good and bad experiences with adaptive project management (invited talk).",
                    "Industrial best practices for continuous integration (CI) and continuously delivery (CD) (invited talk).",
                    "Huawei's practices on trusted software engineering capability improvement (invited talk).",
                    "Hazard analysis for human-on-the-loop interactions in sUAS systems.",
                    "An exploratory study of autopilot software bugs in unmanned aerial vehicles.",
                    "Code integrity attestation for PLCs using black box neural network predictions.",
                    "PHYSFRAME: type checking physical frames of reference for robotic systems.",
                    "Automating serverless deployments for DevOps organizations.",
                    "Algebraic-datatype taint tracking, with applications to understanding Android identifier leaks.",
                    "Vet: identifying and avoiding UI exploration tarpits.",
                    "Checking conformance of applications against GUI policies.",
                    "Data-driven accessibility repair revisited: on the effectiveness of generating labels for icons in Android apps.",
                    "Benchmarking automated GUI testing for Android against real-world bugs.",
                    "Checking LTL[F, G, X] on compressed traces in polynomial time.",
                    "Conditional interpolation: making concurrent program verification more effective.",
                    "AlloyMax: bringing maximum satisfaction to relational specifications.",
                    "Timely and accurate detection of model deviation in self-adaptive software-intensive systems.",
                    "Lightweight and modular resource leak verification.",
                    "JSISOLATE: lightweight in-browser JavaScript isolation.",
                    "Cross-language code search using static and dynamic analyses.",
                    "Automating the removal of obsolete TODO comments.",
                    "Estimating residual risk in greybox fuzzing.",
                    "HeteroFuzz: fuzz testing to detect platform dependent divergence for heterogeneous applications.",
                    "Sound and efficient concurrency bug prediction.",
                    "Detecting Node.js prototype pollution vulnerabilities via object lookup analysis.",
                    "Detecting concurrency vulnerabilities based on partial orders of memory and thread events.",
                    "Vulnerability detection with fine-grained interpretations.",
                    "Identifying casualty changes in software patches.",
                    "ACHyb: a hybrid analysis approach to detect kernel access control vulnerabilities.",
                    "Context-aware and data-driven feedback generation for programming assignments.",
                    "A syntax-guided edit decoder for neural program repair.",
                    "VarFix: balancing edit expressiveness and search effectiveness in automated program repair.",
                    "Flaky test detection in Android via event order exploration.",
                    "SmartCommit: a graph-based interactive assistant for activity-oriented commits.",
                    "A first look at developers' live chat on Gitter.",
                    "Reel life vs. real life: how software developers share their daily life through vlogs.",
                    "An empirical study on challenges of application development in serverless computing.",
                    "Bias in machine learning software: why? how? what to do?",
                    "Understanding neural code intelligence through program simplification.",
                    "Multi-objectivizing software configuration tuning.",
                    "Embedding app-library graph for neural third party library recommendation.",
                    "A large-scale empirical study on Java library migrations: prevalence, trends, and rationales.",
                    "Learning-based extraction of first-order logic representations of API directives.",
                    "DIFFBASE: a differential factbase for effective software evolution management.",
                    "Would you like a quick peek? providing logging support to monitor data processing in big data applications.",
                    "Identifying bad software changes via multimodal anomaly detection for online service systems.",
                    "An automatic refactoring framework for replacing test-production inheritance by mocking mechanism.",
                    "ÐArcher: detecting on-chain-off-chain synchronization bugs in decentralized applications.",
                    "iBatch: saving Ethereum fees via secure and cost-effective batching of smart-contract invocations.",
                    "Which abbreviations should be expanded?",
                    "Validation on machine reading comprehension software without annotated labels: a property-based method.",
                    "FLEX: fixing flaky tests in machine learning projects by updating assertion bounds.",
                    "Parallel shadow execution to accelerate the debugging of numerical errors.",
                    "Exposing numerical bugs in deep learning via gradient back-propagation.",
                    "Metamorphic testing of Datalog engines.",
                    "Synthesis of web layouts from examples.",
                    "Boosting coverage-based fault localization via graph-based representation learning.",
                    "SynGuar: guaranteeing generalization in programming by example.",
                    "StateFormer: fine-grained type recovery from binaries using generative state modeling.",
                    "Empirical study of transformers for source code.",
                    "Explaining mispredictions of machine learning models using rule induction.",
                    "Generalizable and interpretable learning for configuration extrapolation.",
                    "Lightweight global and local contexts guided method name recommendation with prior knowledge.",
                    "To read or to rotate? comparing the effects of technical reading training and spatial skills training on novice programming ability.",
                    "Connecting the dots: rethinking the relationship between code and prose writing with functional connectivity.",
                    "LastPyMile: identifying the discrepancy between sources and packages.",
                    "A grounded theory of the role of coordination in software security patch management.",
                    "TaintStream: fine-grained taint tracking for big data platforms through dynamic code translation.",
                    "Demystifying \"bad\" error messages in data science libraries.",
                    "NIL: large-scale detection of large-variance clones.",
                    "Understanding and detecting server-side request races in web applications.",
                    "Detecting and localizing keyboard accessibility failures in web applications.",
                    "Swarmbug: debugging configuration bugs in swarm robotics.",
                    "Probabilistic Delta debugging.",
                    "Finding broken Linux configuration specifications by statically analyzing the Kconfig language.",
                    "Semantic bug seeding: a learning-based approach for creating realistic bugs.",
                    "Characterizing search activities on stack overflow.",
                    "Authorship attribution of source code: a language-agnostic approach and applicability in software engineering.",
                    "Probing model signal-awareness via prediction-preserving input minimization.",
                    "Generating efficient solvers from constraint models.",
                    "A comprehensive study of deep learning compiler bugs.",
                    "Fair preprocessing: towards understanding compositional fairness of data transformers in machine learning pipeline.",
                    "Fairea: a model behaviour mutation approach to benchmarking bias mitigation methods.",
                    "Feature trace recording.",
                    "A longitudinal analysis of bloated Java dependencies.",
                    "XAI tools in the public sector: a case study on predicting combined sewer overflows.",
                    "How disabled tests manifest in test maintainability challenges?",
                    "Sustainability forecasting for Apache incubator projects.",
                    "Graph-based seed object synthesis for search-based unit testing.",
                    "LS-sampling: an effective local search based sampling approach for achieving high t-wise coverage.",
                    "GLIB: towards automated test oracle for graphically-rich applications.",
                    "Reassessing automatic evaluation metrics for code summarization tasks.",
                    "Toward efficient interactions between Python and native libraries.",
                    "Accelerating JavaScript static analysis via dynamic shortcuts.",
                    "Skeletal approximation enumeration for SMT solver testing.",
                    "Boosting static analysis accuracy with instrumented test executions.",
                    "Symbolic parallel adaptive importance sampling for probabilistic program analysis.",
                    "IDE support for cloud-based static analyses.",
                    "A bounded symbolic-size model for symbolic execution.",
                    "Efficient module-level dynamic analysis for dynamic languages with module recontextualization.",
                    "Mono2Micro: a practical and effective tool for decomposing monolithic Java applications to microservices.",
                    "Data-driven test selection at scale.",
                    "Effective low capacity status prediction for cloud systems.",
                    "Automated code transformation for context propagation in Go.",
                    "Onion: identifying incident-indicating logs for cloud systems.",
                    "Generating metamorphic relations for cyber-physical systems with genetic programming: an industrial case study.",
                    "Domain adaptation for an automated classification of deontic modalities in software engineering contracts.",
                    "How can manual testing processes be optimized? developer survey, optimization guidelines, and case studies.",
                    "Turnover-induced knowledge loss in practice.",
                    "One thousand and one stories: a large-scale survey of software refactoring.",
                    "A comprehensive study on learning-based PE malware family classification methods.",
                    "Infiltrating security into development: exploring the world's largest software security study.",
                    "Data-driven extract method recommendations: a study at ING.",
                    "Duplicated code pattern mining in visual programming languages.",
                    "Making smart contract development more secure and easier.",
                    "Quantifying no-fault-found test failures to prioritize inspection of flaky tests at Ericsson.",
                    "When life gives you oranges: detecting and diagnosing intermittent job failures at Mozilla.",
                    "FuzzBench: an open fuzzer benchmarking platform and service.",
                    "An empirical investigation of practical log anomaly detection for online service systems.",
                    "RAPID: checking API usage for the cloud in the cloud.",
                    "An empirical study of GUI widget detection for industrial mobile games.",
                    "Intelligent container reallocation at Microsoft 365.",
                    "Organizational implications of agile adoption: a case study from the public sector.",
                    "Towards immersive software archaeology: regaining legacy systems' design knowledge via interactive exploration in virtual reality.",
                    "Reducing the search space of bug inducing commits using failure coverage.",
                    "The gas triangle and its challenges to the development of blockchain-powered applications.",
                    "Selecting test inputs for DNNs using differential testing with subspecialized model instances.",
                    "Term interrelations and trends in software engineering.",
                    "Software robustness: a survey, a theory, and prospects.",
                    "Towards automating code review at scale.",
                    "Learning type annotation: is big data enough?",
                    "New visions on metamorphic testing after a quarter of a century of inception.",
                    "Health of smart ecosystems.",
                    "LLSC: a parallel symbolic execution compiler for LLVM IR.",
                    "OwlEyes-online: a fully automated platform for detecting and localizing UI display issues.",
                    "Exploit those code reviews! bigger data for deeper learning.",
                    "BRAID: an API recommender supporting implicit user feedback.",
                    "KGAMD: an API-misuse detector driven by fine-grained API-constraint knowledge graph.",
                    "Sangrahaka: a tool for annotating and querying knowledge graphs.",
                    "Code2Que: a tool for improving question titles from mined code snippets in stack overflow.",
                    "BF-detector: an automated tool for CI build failure detection.",
                    "AlloyFL: a fault localization framework for Alloy.",
                    "BiasRV: uncovering biased sentiment predictions at runtime.",
                    "ICME: an informed consent management engine for conformance in smart building environments.",
                    "StackEmo: towards enhancing user experience by augmenting stack overflow with emojis.",
                    "AC²: towards understanding architectural changes in Python projects.",
                    "csDetector: an open source tool for community smells detection.",
                    "CrossVul: a cross-language vulnerability dataset with commit data.",
                    "Slicer4J: a dynamic slicer for Java.",
                    "CrossASR++: a modular differential testing framework for automatic speech recognition.",
                    "Frontmatter: mining Android user interfaces at scale.",
                    "GenSys: a scalable fixed-point engine for maximal controller synthesis over infinite state spaces.",
                    "Analysis of specifications of multiparty sessions with dcj-lint.",
                    "Documenting evidence of a reuse of 'a systematic study of the class imbalance problem in convolutional neural networks'.",
                    "Documenting evidence of a reuse of 'on the number of linear regions of deep neural networks'.",
                    "Documenting evidence of a reuse of 'a systematic literature review of techniques and metrics to reduce the cost of mutation testing'.",
                    "Documenting evidence of a reuse of 'RefactoringMiner 2.0'.",
                    "Documenting evidence of a reuse of 'what is a feature? a qualitative study of features in industrial software product lines'.",
                    "Documenting evidence of a reuse of '\"why should I trust you?\": explaining the predictions of any classifier'.",
                    "Documenting evidence of a replication of 'populating a release history database from version control and bug tracking systems'.",
                    "Documenting evidence of a replication of 'analyze this! 145 questions for data scientists in software engineering'.",
                    "Documenting evidence of a reproduction of 'is there a \"golden\" feature set for static warning identification? - an experimental evaluation'.",
                    "A replication of 'DeepBugs: a learning approach to name-based bug detection'.",
                    "Investigating documented information for accurate effort estimation in agile software development.",
                    "Security guarantees for automated software testing.",
                    "Unveiling multiple facets of design degradation in modern code review.",
                    "Freeing hybrid distributed AI training configuration.",
                    "Towards an approach for resource-driven adaptation.",
                    "Deployment coordination for cross-functional DevOps teams.",
                    "Lightweight verification via specialized typecheckers.",
                    "Multi-location cryptographic code repair with neural-network-based methodologies.",
                    "Improving the effectiveness of peer code review in identifying security defects.",
                    "Reducing cost in continuous integration with a collection of build selection approaches.",
                    "A live environment for inspection and refactoring of software systems.",
                    "PorkFuzz: testing stateful software-defined network applications with property graphs.",
                    "A qualitative study of cleaning in Jupyter notebooks.",
                    "Automated generation of realistic test inputs for web APIs.",
                    "Contextualizing toxicity in open source: a qualitative study.",
                    "Accelerating redundancy-based program repair via code representation learning and adaptive patch filtering.",
                    "SMT solver testing with type and grammar based mutation.",
                    "Overcoming metric diversity in meta-analysis for software engineering: proposed approach and a case study on its usage on the effects of software reuse.",
                    "A general approach to modeling Java framework behaviors.",
                    "Discovering repetitive code changes in ML systems.",
                    "Does reusing pre-trained NLP model propagate bugs?",
                    "Mitigating security attacks in kubernetes manifests for security best practices violation."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2021atest",
                "sub_name": "A-TEST 2021: Proceedings of the 12th International Workshop on Automating TEST Case Design, Selection, and Evaluation, A-TEST@ESEC/SIGSOFT FSE 2021, Athens, Greece, August 23-24, 2021.",
                "count": 5,
                "papers": [
                    "Using an agent-based approach for robust automated testing of computer games.",
                    "Towards automated generation of PO-based WebDriver test suites from Selenium IDE recordings.",
                    "Automated translation of Android context-dependent gestures to visual GUI test instructions.",
                    "Integrating usage monitoring for continuous evaluation and testing in the UI of an industry application.",
                    "Towards a workflow for model-based testing of embedded systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2021easeai",
                "sub_name": "EASEAI 2021: Proceedings of the 3rd International Workshop on Education through Advanced Software Engineering and Artificial Intelligence, Athens, Greece, 23 August 2021.",
                "count": 10,
                "papers": [
                    "The good, the bad, and the ugly: mining for patterns in student source code.",
                    "Experience report on soft and project skills building through repetition.",
                    "Experience report on teaching testing through gamification.",
                    "A tool for evaluating computer programs from students.",
                    "Seeding digital competencies from early childhood: a competence based approach.",
                    "Agile principles applied in learning contexts.",
                    "Students perception on the impact of their involvement in the learning process: an empirical study.",
                    "Practice makes better: quiz retake software to increase student learning.",
                    "Towards authentic undergraduate research experiences in software engineering and machine learning.",
                    "Analysis of the transition to a virtual learning semester in a college software testing course."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2021maltesque",
                "sub_name": "MaLTeSQuE@ESEC/SIGSOFT FSE 2021: Proceedings of the 5th International Workshop on Machine Learning Techniques for Software Quality Evolution, Athens, Greece, 23 August 2021.",
                "count": 6,
                "papers": [
                    "Comparing within- and cross-project machine learning algorithms for code smell detection.",
                    "Unsupervised learning of general-purpose embeddings for code changes.",
                    "VaryMinions: leveraging RNNs to identify variants in event logs.",
                    "Toward static test flakiness prediction: a feasibility study.",
                    "Building a bot for automatic expert retrieval on discord.",
                    "Metrics selection for load monitoring of service-oriented system."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2020apeqs",
                "sub_name": "Proceedings of the 1st ACM SIGSOFT International Workshop on Architectures and Paradigms for Engineering Quantum Software, APEQS@ESEC/SIGSOFT FSE 2021, Virtual Event, USA, November 13, 2020.",
                "count": 5,
                "papers": [
                    "Designing and benchmarking full-stack Quantum systems (keynote).",
                    "The Quantum software lifecycle.",
                    "About a criterion of successfully executing a circuit in the NISQ era: what wd ≪ 1/ε eff really means.",
                    "Modeling Quantum programs: challenges, initial results, and research directions.",
                    "Quantum Shuttle: traffic navigation with Quantum computing."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th SIGSOFT FSE / 19th ESEC 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2020",
                "sub_name": "ESEC/FSE '20: 28th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering, Virtual Event, USA, November 8-13, 2020.",
                "count": 169,
                "papers": [
                    "A behavioral notion of robustness for software systems.",
                    "ARDiff: scaling program equivalence checking via iterative abstraction and refinement of common code.",
                    "C2S: translating natural language comments to formal program specifications.",
                    "Detecting and understanding JavaScript global identifier conflicts on the web.",
                    "Domain-independent interprocedural program analysis using block-abstraction memoization.",
                    "Flexeme: untangling commits using lexical flows.",
                    "HISyn: human learning-inspired natural language programming.",
                    "Inductive program synthesis over noisy data.",
                    "Inherent vacuity for GR(1) specifications.",
                    "Interval counterexamples for loop invariant learning.",
                    "Java Ranger: statically summarizing regions for efficient symbolic execution of Java.",
                    "JShrink: in-depth investigation into debloating modern Java applications.",
                    "Making symbolic execution promising by learning aggressive state-pruning strategy.",
                    "Mining assumptions for software components using machine learning.",
                    "Mining input grammars from dynamic control flow.",
                    "Modular collaborative program analysis in OPAL.",
                    "Past-sensitive pointer analysis for symbolic execution.",
                    "TypeWriter: neural type prediction with search-based validation.",
                    "UBITect: a precise and scalable method to detect use-before-initialization bugs in Linux kernel.",
                    "Exploring how deprecated Python library APIs are (not) handled.",
                    "Selecting third-party libraries: the practitioners' perspective.",
                    "A principled approach to GraphQL query cost analysis.",
                    "Beware the evolving 'intelligent' web service! an integration architecture tactic to guard AI-first components.",
                    "Block public access: trust safety verification of access control policies.",
                    "Efficient incident identification from multi-dimensional issue reports via meta-heuristic search.",
                    "Identifying linked incidents in large-scale online service systems.",
                    "Real-time incident prediction for online service systems.",
                    "Configuration smells in continuous delivery pipelines: a linter and a six-month study on GitLab.",
                    "Dimensions of software configuration: on the configuration context in modern software development.",
                    "Global cost/quality management across multiple applications.",
                    "Understanding and discovering software configuration dependencies in cloud and datacenter systems.",
                    "Docable: evaluating the executability of software tutorials.",
                    "RulePad: interactive authoring of checkable design rules.",
                    "A first look at good first issues on GitHub.",
                    "A randomized controlled trial on the effects of embedded computer language switching.",
                    "A theory of the engagement in open source projects via summer of code programs.",
                    "An empirical analysis of the costs of clone- and platform-oriented software reuse.",
                    "An empirical study of bots in software development: characteristics and challenges from a practitioner's perspective.",
                    "Biases and differences in code review using medical imaging and eye-tracking: genders, humans, and machines.",
                    "Community expectations for research artifacts and evaluation processes.",
                    "Does stress impact technical interview performance?",
                    "Exploring the evolution of software practices.",
                    "Heard it through the Gitvine: an empirical study of tool diffusion across the npm ecosystem.",
                    "Interactive, effort-aware library version harmonization.",
                    "On the naturalness of hardware descriptions.",
                    "On the relationship between design discussions and design quality: a case study of Apache projects.",
                    "On the relationship between refactoring actions and bugs: a differentiated replication.",
                    "Questions for data scientists in software engineering: a replication.",
                    "Reducing implicit gender biases in software development: does intergroup contact theory work?",
                    "Robotics software engineering: a perspective from the service robotics domain.",
                    "Thinking aloud about confusing code: a qualitative investigation of program comprehension and atoms of confusion.",
                    "Understanding build issue resolution in practice: symptoms and fix patterns.",
                    "Understanding type changes in Java.",
                    "Do the machine learning models on a crowd sourced platform exhibit bias? an empirical study on model fairness.",
                    "Fairway: a way to build fair ML software.",
                    "Towards automated verification of smart contract fairness.",
                    "Boosting fuzzer efficiency: an information theoretic perspective.",
                    "CrFuzz: fuzzing multi-purpose programs through input validation.",
                    "Detecting critical bugs in SMT solvers using blackbox mutational fuzzing.",
                    "Fuzzing: on the exponential cost of vulnerability discovery.",
                    "Intelligent REST API data fuzzing.",
                    "MTFuzz: fuzzing with a multi-task neural network.",
                    "A comprehensive study on challenges in deploying deep learning based software.",
                    "AMS: generating AutoML search spaces from weak specifications.",
                    "Correlations between deep neural network model coverage criteria and model quality.",
                    "Deep learning library testing via effective model generation.",
                    "DeepSearch: a simple and effective blackbox attack for deep neural networks.",
                    "DENAS: automated rule generation by knowledge extraction from neural networks.",
                    "Detecting numerical bugs in neural network architectures.",
                    "Dynamic slicing for deep neural networks.",
                    "Is neuron coverage a meaningful measure for testing deep neural networks?",
                    "Machine translation testing via pathological invariance.",
                    "Model-based exploration of the frontier of behaviours for deep learning system testing.",
                    "On decomposing a deep neural network into modules.",
                    "Operational calibration: debugging confidence errors for DNNs in the field.",
                    "All your app links are belong to us: understanding the threats of instant apps based attacks.",
                    "Automated construction of energy test oracles for Android.",
                    "Borrowing your enemy's arrows: the case of code reuse in Android via direct inter-app code invocation.",
                    "Static asynchronous component misuse detection for Android applications.",
                    "Automatically identifying performance issue reports with heuristic linguistic patterns.",
                    "Calm energy accounting for multithreaded Java applications.",
                    "Dynamically reconfiguring software microbenchmarks: reducing execution time without sacrificing result quality.",
                    "Testing self-adaptive software with probabilistic guarantees on performance metrics.",
                    "API method recommendation via explicit matching of functionality verb phrases.",
                    "Code recommendation for exception handling.",
                    "eQual: informing early design decisions.",
                    "Recommending stack overflow posts for fixing runtime exceptions using failure scenario matching.",
                    "Understanding the impact of GitHub suggested changes on recommendations between developers.",
                    "An evaluation of methods to port legacy code to SGX enclaves.",
                    "Search-based adversarial testing and improvement of constrained credit scoring systems.",
                    "SinkFinder: harvesting hundreds of unknown interesting function pairs with just one seed.",
                    "Baital: an adaptive weighted sampling approach for improved t-wise coverage.",
                    "Cost measures matter for mutation testing study validity.",
                    "Detecting optimization bugs in database engines via non-optimizing reference engine construction.",
                    "Efficient binary-level coverage analysis.",
                    "Efficiently finding higher-order mutants.",
                    "Evolutionary improvement of assertion oracles.",
                    "FrUITeR: a framework for evaluating UI test reuse.",
                    "Object detection for graphical user interface: old fashioned or deep learning or a combination?",
                    "Understanding and automatically detecting conflicting interactions between smart home IoT applications.",
                    "When does my program do this? learning circumstances of software behavior.",
                    "A first look at the integration of machine learning models in complex autonomous driving systems: a case study on Apollo.",
                    "Adapting bug prediction models to predict reverted commits at Wayfair.",
                    "Can microtask programming work in industry?",
                    "Change impact analysis in Simulink designs of embedded systems.",
                    "Clustering test steps in natural language toward automating test automation.",
                    "Efficient customer incident triage via linking with system incidents.",
                    "Effort-aware just-in-time defect identification in practice: a case study at Alibaba.",
                    "Enhancing the interoperability between deep learning frameworks by model conversion.",
                    "Establishing key performance indicators for measuring software-development processes at a large organization.",
                    "Estimating GPU memory consumption of deep learning models.",
                    "Exempla gratis (E.G.): code examples for free.",
                    "Fireteam: a small-team development practice in industry.",
                    "FREPA: an automated and formal approach to requirement modeling and analysis in aircraft control domain.",
                    "Graph-based trace analysis for microservice architecture understanding and problem diagnosis.",
                    "Harvey: a greybox fuzzer for smart contracts.",
                    "How to mitigate the incident? an effective troubleshooting guide recommendation technique for online service systems.",
                    "Improving cybersecurity hygiene through JIT patching.",
                    "IntelliCode compose: code generation using transformer.",
                    "Learning to extract transaction function from requirements: an industrial case on financial software.",
                    "Online sports betting through the prism of software engineering.",
                    "Reducing DNN labelling cost using surprise adequacy: an industrial case study for autonomous driving.",
                    "Scaling static taint analysis to industrial SOA applications: a case study at Alibaba.",
                    "Towards intelligent incident management: why we need it and how we make it.",
                    "WebRR: self-replay enhanced robust record/replay for web application testing.",
                    "Beyond accuracy: assessing software documentation quality.",
                    "Continuous experimentation on artificial intelligence software: a research agenda.",
                    "Inferring and securing software configurations using automated reasoning.",
                    "Next generation automated software evolution refactoring at scale.",
                    "Revealing the complexity of automotive software.",
                    "Software documentation and augmented reality: love or arranged marriage?",
                    "Testing machine learning code using polyhedral region.",
                    "Towards learning visual semantics.",
                    "AlloyMC: Alloy meets model counting.",
                    "ARCADE: an extensible workbench for architecture recovery, change, and decay evaluation.",
                    "BEE: a tool for structuring and analyzing bug reports.",
                    "BugsInPy: a database of existing bugs in Python programs to enable controlled testing and debugging studies.",
                    "CRSG: a serious game for teaching code review.",
                    "Dads: dynamic slicing continuously-running distributed programs with budget constraints.",
                    "DeepCommenter: a deep code comment generation tool with hybrid lexical and syntactical information.",
                    "DiffTech: a tool for differencing similar technologies from question-and-answer discussions.",
                    "Enhancing developer interactions with programming screencasts through accurate code extraction.",
                    "JITO: a tool for just-in-time defect identification and localization.",
                    "LibComp: an IntelliJ plugin for comparing Java libraries.",
                    "MCBAT: a practical tool for model counting constraints on bounded integer arrays.",
                    "ModCon: a model-based testing platform for smart contracts.",
                    "Mono2Micro: an AI-based toolchain for evolving monolithic enterprise applications to a microservice architecture.",
                    "MutAPK 2.0: a tool for reducing mutation testing effort of Android apps.",
                    "PAClab: a program analysis collaboratory.",
                    "PCA: memory leak detection using partial call-path analysis.",
                    "PRF: a framework for building automatic program repair prototypes for JVM-based languages.",
                    "PRODeep: a platform for robustness verification of deep neural networks.",
                    "SVMRanker: a general termination analysis framework of loop programs via SVM.",
                    "SWAN: a static analysis framework for swift.",
                    "Threshy: supporting safe usage of intelligent web services.",
                    "tsDetect: an open source test smells detection tool.",
                    "UIED: a hybrid tool for GUI element detection.",
                    "UIScreens: extracting user interface screens from mobile programming video tutorials.",
                    "WebJShrink: a web service for debloating Java bytecode.",
                    "Assisting the elite-driven open source development through activity data.",
                    "Enhancing developers' support on pull requests activities with software bots.",
                    "Machine learning based test data generation for safety-critical software.",
                    "Reusing software engineering knowledge from developer communication.",
                    "Towards transferring lean software startup practices in software engineering education.",
                    "Attention tracking for developers.",
                    "Impact of programming languages on energy consumption for mobile devices.",
                    "Recommender systems: metric suggestion mechanisms applied to adaptable software dashboards.",
                    "Repairing confusion and bias errors for DNN-based image classifiers.",
                    "Synthesizing correct code for machine learning programs."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2020atest",
                "sub_name": "A-TEST 2020: Proceedings of the 11th ACM SIGSOFT International Workshop on Automating TEST Case Design, Selection, and Evaluation, A-TEST@ESEC/SIGSOFT FSE 2020, Virtual Event, USA, November 8-9, 2020.",
                "count": 6,
                "papers": [
                    "SafeDNN: understanding and verifying neural networks (keynote).",
                    "The effectiveness of automated software testing techniques (keynote).",
                    "Navigation and exploration in 3D-game automated play testing.",
                    "Comparing transition trees test suites effectiveness for different mutation operators.",
                    "Fuzz4B: a front-end to AFL not only for fuzzing experts.",
                    "Towards automated testing of RPA implementations."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2020maltesque",
                "sub_name": "Proceedings of the 4th ACM SIGSOFT International Workshop on Machine Learning Techniques for Software Quality Evaluation, MaLTeSQuE@ESEC/SIGSOFT FSE 2020, Virtual Event, USA, November 13, 2020.",
                "count": 6,
                "papers": [
                    "A preliminary study on the adequacy of static analysis warnings with respect to code smell prediction.",
                    "DeepIaC: deep learning-based linguistic anti-pattern detection in IaC.",
                    "Speeding up the data extraction of machine learning approaches: a distributed framework.",
                    "RARE: a labeled dataset for cloud-native memory anomalies.",
                    "TraceSim: a method for calculating stack trace similarity.",
                    "Singling the odd ones out: a novelty detection approach to find defects in infrastructure-as-code."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th SIGSOFT FSE / 18th ESEC 2019",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2019",
                "sub_name": "Proceedings of the ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering, ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 26-30, 2019.",
                "count": 150,
                "papers": [
                    "Living with feature interactions (keynote).",
                    "Safety and robustness for deep learning with provable guarantees (keynote).",
                    "Insights from open source software supply chains (keynote).",
                    "Concolic testing for models of state-based systems.",
                    "Target-driven compositional concolic testing with function summary refinement for effective bug detection.",
                    "Generating automated and online test oracles for Simulink models with continuous and uncertain behaviors.",
                    "Lifting Datalog-based analyses to software product lines.",
                    "An empirical study of real-world variability bugs detected by variability-oblivious tools.",
                    "Principles of feature modeling.",
                    "Understanding GCC builtins to develop better tools.",
                    "Assessing the quality of the steps to reproduce in bug reports.",
                    "A learning-based approach for automatic construction of domain glossary from source code and documentation.",
                    "On using machine learning to identify knowledge in API reference documentation.",
                    "Generating query-specific class API summaries.",
                    "Semantic relation based expansion of abbreviations.",
                    "Diversity-based web test generation.",
                    "Web test dependency detection.",
                    "Testing scratch programs automatically.",
                    "A large-scale empirical study of compiler errors in continuous integration.",
                    "A statistics-based performance testing methodology for cloud applications.",
                    "How bad can a bug get? an empirical analysis of software failures in the OpenStack cloud computing platform.",
                    "Towards more efficient meta-heuristic algorithms for combinatorial test generation.",
                    "Compiler bug isolation via effective witness test program generation.",
                    "Concolic testing with adaptively changing search heuristics.",
                    "Symbolic execution-driven extraction of the parallel execution plans of Spark applications.",
                    "Generating effective test cases for self-driving cars from police reports.",
                    "Preference-wise testing for Android applications.",
                    "Bisecting commits and modeling commit risk during testing.",
                    "White-box testing of big data analytics with complex user-defined functions.",
                    "Empirical review of Java program repair tools: a large-scale experiment on 2, 141 bugs and 23, 551 repair attempts.",
                    "iFixR: bug report driven program repair.",
                    "Exploring and exploiting the correlations between bug-inducing and bug-fixing commits.",
                    "Effects of explicit feature traceability on program comprehension.",
                    "What the fork: a study of inefficient and efficient forking practices in social coding.",
                    "ServDroid: detecting service usage inefficiencies in Android applications.",
                    "Together strong: cooperative Android app analysis.",
                    "A framework for writing trigger-action todo comments in executable format.",
                    "Decomposing the rationale of code commits: the software developer's perspective.",
                    "Model-based testing of breaking changes in Node.js libraries.",
                    "Monitoring-aware IDEs.",
                    "Going big: a large-scale study on what big data developers ask.",
                    "Why aren't regular expressions a lingua franca? an empirical study on the re-use and portability of regular expressions.",
                    "Nodest: feedback-driven static analysis of Node.js applications.",
                    "Effective error-specification inference via domain-knowledge expansion.",
                    "DeepStellar: model-based quantitative analysis of stateful deep learning systems.",
                    "REINAM: reinforcement learning for input-grammar inference.",
                    "Boosting operational DNN testing efficiency through conditioning.",
                    "A comprehensive study on deep learning bug characteristics.",
                    "Just fuzz it: solving floating-point constraints using coverage-guided fuzzing.",
                    "Cerebro: context-aware adaptive fuzzing for effective vulnerability detection.",
                    "iFixFlakies: a framework for automatically fixing order-dependent flaky tests.",
                    "Binary reduction of dependency graphs.",
                    "AggrePlay: efficient record and replay of multi-threaded programs.",
                    "The review linkage graph for code review analytics: a recovery approach and empirical study.",
                    "Mitigating power side channels during compilation.",
                    "Maximal multi-layer specification synthesis.",
                    "Phoenix: automated data-driven synthesis of repairs for static analysis violations.",
                    "Black box fairness testing of machine learning models.",
                    "Java reflection API: revealing the dark side of the mirror.",
                    "A conceptual replication of continuous integration pain points in the context of Travis CI.",
                    "Ethnographic research in software engineering: a critical review and checklist.",
                    "Achilles' heel of plug-and-Play software architectures: a grounded theory based approach.",
                    "Latent error prediction and fault localization for microservice applications by learning from system trace logs.",
                    "The importance of accounting for real-world labelling when predicting software vulnerabilities.",
                    "Detecting concurrency memory corruption vulnerabilities.",
                    "Locating vulnerabilities in binaries via memory layout recovering.",
                    "Storm: program reduction for testing and debugging probabilistic programming systems.",
                    "NullAway: practical type-based null safety for Java.",
                    "Automatically detecting missing cleanup for ungraceful exits.",
                    "Finding and understanding bugs in software model checkers.",
                    "A segmented memory model for symbolic execution.",
                    "Releasing fast and slow: an exploratory case study at ING.",
                    "SAR: learning cross-language API mappings with little knowledge.",
                    "Robust log-based anomaly detection on unstable log data.",
                    "Pinpointing performance inefficiencies in Java.",
                    "Understanding flaky tests: the developer's perspective.",
                    "SEntiMoji: an emoji-powered learning approach for sentiment analysis in software engineering.",
                    "FinExpert: domain-specific test generation for FinTech systems.",
                    "Design diagrams as ontological source.",
                    "Predicting pull request completion time: a case study on large scale cloud services.",
                    "TERMINATOR: better automated UI test case prioritization.",
                    "Risks and assets: a qualitative study of a software ecosystem in the mining industry.",
                    "Using microservices for non-intrusive customization of multi-tenant SaaS.",
                    "Predicting breakdowns in cloud services (with SPIKE).",
                    "DeepDelta: learning to repair compilation errors.",
                    "WhoDo: automating reviewer suggestions at scale.",
                    "An IR-based approach towards automated integration of geo-spatial datasets in map-based software systems.",
                    "Code coverage at Google.",
                    "When deep learning met code search.",
                    "FUDGE: fuzz driver generation at scale.",
                    "Industry practice of coverage-guided enterprise Linux kernel fuzzing.",
                    "Architectural decision forces at work: experiences in an industrial consultancy setting.",
                    "The role of limitations and SLAs in the API industry.",
                    "Evaluating model testing and model checking for finding requirements violations in Simulink models.",
                    "Model checking a C++ software framework: a case study.",
                    "Evolving with patterns: a 31-month startup experience report.",
                    "Bridging the gap between ML solutions and their business requirements using feature interactions.",
                    "Design thinking in practice: understanding manifestations of design thinking in software engineering.",
                    "MOTSD: a multi-objective test selection tool using test suite diagnosability.",
                    "BIKER: a tool for Bi-information source based API method recommendation.",
                    "Mart: a mutant generation tool for LLVM.",
                    "VARYS: an agnostic model-driven monitoring-as-a-service framework for the cloud.",
                    "JCOMIX: a search-based tool to detect XML injection vulnerabilities in web applications.",
                    "Event trace reduction for effective bug replay of Android apps via differential GUI state analysis.",
                    "PyGGI 2.0: language independent genetic improvement framework.",
                    "CloneCognition: machine learning based code clone validation tool.",
                    "EVMFuzzer: detect EVM vulnerabilities via fuzz testing.",
                    "A dynamic taint analyzer for distributed systems.",
                    "Governify for APIs: SLA-driven ecosystem for API governance.",
                    "Developing secure bitcoin contracts with BitML.",
                    "DISCOVER: detecting algorithmic complexity vulnerabilities.",
                    "AnswerBot: an answer summary generation tool based on stack overflow.",
                    "Eagle: a team practices audit framework for agile software development.",
                    "A taxonomy of metrics for software fault prediction.",
                    "Distributed execution of test cases and continuous integration.",
                    "A longitudinal field study on creation and use of domain-specific languages in industry.",
                    "Failure-driven program repair.",
                    "On extending single-variant model transformations for reuse in software product line engineering.",
                    "Exploratory test agents for stateful software systems.",
                    "Helping developers search and locate task-relevant information in natural language documents.",
                    "Improving requirements engineering practices to support experimentation in software startups.",
                    "Managing the open cathedral.",
                    "Machine-learning supported vulnerability detection in source code.",
                    "Software clusterings with vector semantics and the call graph.",
                    "Machine learning-assisted performance testing.",
                    "File tracing by intercepting disk requests.",
                    "Recommending related functions from API usage-based function clone structures.",
                    "Identifying the most valuable developers using artifact traceability graphs.",
                    "Automated patch porting across forked projects.",
                    "Employing different program analysis methods to study bug evolution.",
                    "Reducing the workload of the Linux kernel maintainers: multiple-committer model.",
                    "Efficient computing in a safe environment.",
                    "The lessons software engineers can extract from painters to improve the software development process.",
                    "An industrial application of test selection using test suite diagnosability.",
                    "Understanding source code comments at large-scale.",
                    "A graph-based framework for analysing the design of smart contracts.",
                    "Finding the shortest path to reproduce a failure found by TESTAR.",
                    "Analysing socio-technical congruence in the package dependency network of Cargo.",
                    "Tuning backfired? not (always) your fault: understanding and detecting configuration-related performance bugs.",
                    "On the use of lambda expressions in 760 open source Python projects.",
                    "Test-related factors and post-release defects: an empirical study.",
                    "Static deep neural network analysis for robustness.",
                    "Are existing code smells relevant in web games? an empirical study.",
                    "Tackling knowledge needs during software evolution.",
                    "On the scalable dynamic taint analysis for distributed systems.",
                    "Suggesting reviewers of software artifacts using traceability graphs.",
                    "Using software testing to repair models.",
                    "Rethinking Regex engines to address ReDoS.",
                    "Context-aware test case adaptation.",
                    "Empirical study of customer communication problem in agile requirements engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019squade",
                "sub_name": "Proceedings of the 2nd ACM SIGSOFT International Workshop on Software Qualities and Their Dependencies, SQUADE@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 26, 2019.",
                "count": 6,
                "papers": [
                    "A heuristic fuzz test generator for Java native interface.",
                    "A comparative study of FAQs for software development.",
                    "Hospitality of chatbot building platforms.",
                    "Integrating runtime data with development data to monitor external quality: challenges from practice.",
                    "Predicting reliability by severity and priority of defects.",
                    "Contributors' impact on a FOSS project's quality."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019maltesque",
                "sub_name": "Proceedings of the 3rd ACM SIGSOFT International Workshop on Machine Learning Techniques for Software Quality Evaluation, MaLTeSQuE@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 27, 2019.",
                "count": 7,
                "papers": [
                    "Leveraging mutants for automatic prediction of metamorphic relations using machine learning.",
                    "SZZ unleashed: an open implementation of the SZZ algorithm - featuring example usage in a study of just-in-time bug prediction for the Jenkins project.",
                    "Risk-based data validation in machine learning-based software systems.",
                    "On the role of data balancing for machine learning-based code smell detection.",
                    "Classifying non-functional requirements using RNN variants for quality software development.",
                    "A machine learning based automatic folding of dynamically typed languages.",
                    "Towards surgically-precise technical debt estimation: early results and research roadmap."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019iwsib",
                "sub_name": "Proceedings of the 2nd ACM SIGSOFT International Workshop on Software-Intensive Business: Start-ups, Platforms, and Ecosystems, IWSiB@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 26, 2019.",
                "count": 10,
                "papers": [
                    "iIoT ecosystem development through boundary resources: a Siemens MindSphere case study.",
                    "Do we know how to price SaaS: a multi-vocal literature review.",
                    "QUESt: new practices to represent hypotheses in experiment-driven software development.",
                    "DEEP: the product roadmap maturity model: a method for assessing the product roadmapping capabilities of organizations.",
                    "Software startup education: gamifying growth hacking.",
                    "Touched by the Hackathon: a study on the connection between Hackathon participants and start-up founders.",
                    "The effects of AI-human-interaction to value creation in multi-actor systems: how AI shapes digital B2B sales.",
                    "Productization levels towards whole product in SaaS business.",
                    "Hub companies shaping the future: the ethicality and corporate social responsibility of platform economy giants.",
                    "Value-based technical debt management: an exploratory case study in start-ups and scale-ups."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019wama",
                "sub_name": "Proceedings of the 3rd ACM SIGSOFT International Workshop on App Market Analytics, WAMA@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 27, 2019.",
                "count": 7,
                "papers": [
                    "A recommendation system for emergency mobile applications using context attributes: REMAC.",
                    "Characterizing the transition to Kotlin of Android apps: a study on F-Droid, Play Store, and GitHub.",
                    "Release practices for iOS and Android apps.",
                    "AppNet: understanding app recommendation in Google Play.",
                    "Better Android apps using Android vitals.",
                    "Healthcare Android apps: a tale of the customers' perspective.",
                    "Using app reviews for competitive analysis: tool support."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019easeai",
                "sub_name": "Proceedings of the 1st ACM SIGSOFT International Workshop on Education through Advanced Software Engineering and Artificial Intelligence, EASEAI@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 26, 2019.",
                "count": 9,
                "papers": [
                    "Engaging children in the smart city: a participatory design workshop.",
                    "Designing personalized learning environments through monitoring and guiding user interactions with code and natural language.",
                    "Analysis of students' preconceptions of concurrency.",
                    "Open knowledge interface: a digital assistant to support students in writing academic assignments.",
                    "Towards context-aware automated writing evaluation systems.",
                    "Application of data clustering for automated feedback generation about student well-being.",
                    "Does learning by doing have a positive impact on teaching model checking?",
                    "Artificial intelligence meets software engineering in the classroom.",
                    "Advances in designing a student-centered learning process using cutting-edge methods, tools, and artificial intelligence: an e-learning platform."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019atest",
                "sub_name": "Proceedings of the 10th ACM SIGSOFT International Workshop on Automating TEST Case Design, Selection, and Evaluation, A-TEST@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 16-17, 2019.",
                "count": 6,
                "papers": [
                    "Testing extended finite state machines using NSGA-III.",
                    "Extending UTP 2 with cascading arbitration specifications.",
                    "Test coverage criteria for RESTful web APIs.",
                    "Lessons learned from making the transition to model-based GUI testing.",
                    "Fragility of layout-based and visual GUI test scripts: an assessment study on a hybrid mobile application.",
                    "A platform for diversity-driven test amplification."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2019ensemble",
                "sub_name": "Proceedings of the 2nd ACM SIGSOFT International Workshop on Ensemble-Based Software Engineering for Modern Computing Platforms, EnSEmble@ESEC/SIGSOFT FSE 2019, Tallinn, Estonia, August 26, 2019.",
                "count": 3,
                "papers": [
                    "EnergyAware: a non-intrusive load monitoring system to improve the domestic energy consumption awareness.",
                    "Assessing the greenability of ensembles.",
                    "Semi-automatic generation of cybersecurity exercises: a preliminary proposal."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th SIGSOFT FSE / 17th ESEC 2018",
        "info": "Lake Buena Vista, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2018",
                "sub_name": "Proceedings of the 2018 ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering, ESEC/SIGSOFT FSE 2018, Lake Buena Vista, FL, USA, November 04-09, 2018.",
                "count": 124,
                "papers": [
                    "Behind every great deep learning framework is an even greater programming languages concept (keynote).",
                    "Ten years of hunting for similar code for fun and profit (keynote).",
                    "CloudRaid: hunting concurrency bugs in the cloud via log-mining.",
                    "Testing multithreaded programs via thread speed control.",
                    "Data race detection on compressed traces.",
                    "Practical AJAX race detection for JavaScript web applications.",
                    "Using finite-state models for log differencing.",
                    "Identifying impactful service system problems via log analysis.",
                    "Learning to sample: exploiting similarities across environments to learn performance models for configurable systems.",
                    "Performance comprehension at WiredTiger.",
                    "MemFix: static analysis-based repair of memory deallocation errors for C.",
                    "RefiNym: using names to refine types.",
                    "Darwinian data structure selection.",
                    "Scalability-first pointer analysis with self-tuning context-sensitivity.",
                    "DeepSim: deep learning code functional similarity.",
                    "Deep learning type inference.",
                    "Code vectors: understanding programs through embedded abstracted symbolic traces.",
                    "MODE: automated neural network model debugging via state differential analysis and input selection.",
                    "Towards a theory of software development expertise.",
                    "What makes a code change easier to review: an empirical investigation on code change reviewability.",
                    "Singularity: pattern fuzzing for worst case complexity.",
                    "Bug synthesis: challenging bug-finding tools with deep faults.",
                    "Modify, enhance, select: co-evolution of combinatorial models and test plans.",
                    "The impact of regular expression denial of service (ReDoS) in practice: an empirical study at the ecosystem scale.",
                    "FraudDroid: automated ad fraud detection for Android apps.",
                    "AppFlow: using machine learning to synthesize robust, reusable UI tests.",
                    "Winning the app production rally.",
                    "One size does not fit all: an empirical study of containerized continuous deployment workflows.",
                    "Be careful of when: an empirical study on time-related misuse of issue tracking data.",
                    "Do the dependency conflicts in my project matter?",
                    "Do Android taint analysis tools keep their promises?",
                    "Neural-augmented static analysis of Android communication.",
                    "Oreo: detection of clones in the twilight zone.",
                    "Concurrency verification with maximal path causality.",
                    "Adversarial symbolic execution for detecting concurrency-related cache timing leaks.",
                    "Symbolic execution with existential second-order constraints.",
                    "Parameterized model counting for string and numeric constraints.",
                    "NAR-miner: discovering negative association rules from code for bug detection.",
                    "Path-based function embedding and its application to error-handling specification mining.",
                    "Putback-based bidirectional model transformations.",
                    "Model transformation languages under a magnifying glass: a controlled experiment with Xtend, ATL, and QVT.",
                    "Applications of psychological science for actionable analytics.",
                    "A novel automated approach for software effort estimation based on data augmentation.",
                    "Predicting Node failure in cloud service systems.",
                    "Detecting speech act types in developer question/answer conversations during bug repair.",
                    "Visual web test repair.",
                    "Syntax-guided synthesis of Datalog programs.",
                    "Large-scale study of substitutability in the presence of effects.",
                    "An empirical study on crash recovery bugs in large-scale distributed systems.",
                    "Complementing global and local contexts in representing API descriptions to improve API retrieval tasks.",
                    "Phys: probabilistic physical unit assignment and inconsistency detection.",
                    "Testing probabilistic programming systems.",
                    "Verifying the long-run behavior of probabilistic system models in the presence of uncertainty.",
                    "Automated patch extraction via syntax- and semantics-aware Delta debugging on source code changes.",
                    "Feedback-directed differential testing of interactive debuggers.",
                    "Improving IR-based bug localization with context-aware query reformulation.",
                    "How should compilers explain problems to developers?",
                    "Ecosystem-level determinants of sustained activity in open-source projects: a case study of the PyPI ecosystem.",
                    "Optimizing test prioritization via test distribution analysis.",
                    "How well are regular expressions tested in the wild?",
                    "Which generated test failures are fault revealing? prioritizing failures based on inferred precondition violations using PAF.",
                    "Detection of energy inefficiencies in Android wear watch faces.",
                    "Stochastic energy optimization for mobile GPS applications.",
                    "Gamifying static analysis.",
                    "The case for experiment-oriented computing.",
                    "On the naturalness of proofs.",
                    "Does ACM's code of ethics change ethical decision making in software development?",
                    "How are spreadsheet templates used in practice: a case study on Enron.",
                    "DLFuzz: differential fuzzing testing of deep learning systems.",
                    "Towards data-driven vulnerability prediction for requirements.",
                    "Beyond testing configurable systems: applying variational execution to automatic program repair and higher order mutation testing.",
                    "Software fairness.",
                    "Software engineering collaboratories (SEClabs) and collaboratories as a service (CaaS).",
                    "Towards counterexample-guided k-induction for fast bug detection.",
                    "Salient-class location: help developers understand code change in code review.",
                    "Towards quantifying the development value of code contributions.",
                    "Operationalizing human values in software: a research roadmap.",
                    "Modeling and testing a family of surgical robots: an experience report.",
                    "Efficient static checking of library updates.",
                    "Are mobile banking apps secure? what can be improved?",
                    "VulSeeker-pro: enhanced semantic learning based binary vulnerability seeker with emulation.",
                    "PAFL: extend fuzzing optimizations of single mode to industrial parallel mode.",
                    "Software development challenges with air-gap isolation.",
                    "Design and validation of precooked developer dashboards.",
                    "Testing and validating end user programmed calculated fields.",
                    "Automated refactoring of nested-IF formulae in spreadsheets.",
                    "FACTS: automated black-box testing of FinTech systems.",
                    "Regression test selection for TizenRT.",
                    "Building lean continuous integration and delivery pipelines by applying DevOps principles: a case study at Varidesk.",
                    "The impact of failing, flaky, and high failure tests on the number of crash reports associated with Firefox builds.",
                    "BigSift: automated debugging of big data analytics in data-intensive scalable computing.",
                    "FOT: a versatile, configurable, extensible fuzzing framework.",
                    "Themis: automatically testing software for discrimination.",
                    "Vista: web test repair using computer vision.",
                    "Augmenting stack overflow with API usage patterns mined from GitHub.",
                    "PowerStation: automatically detecting and fixing inefficiencies of database-backed web applications in IDE.",
                    "SketchFix: a tool for automated program repair approach using lazy candidate generation.",
                    "WarningsGuru: integrating statistical bug models with static analysis to provide timely and specific bug warnings.",
                    "DSM: a specification mining tool using recurrent neural network based language model.",
                    "EClone: detect semantic clones in Ethereum via symbolic transaction sketch.",
                    "INFAR: insight extraction from app reviews.",
                    "PyDriller: Python framework for mining software repositories.",
                    "A formal verification tool for Ethereum VM bytecode.",
                    "ASketch: a sketching framework for Alloy.",
                    "AlloyInEcore: embedding of first-order relational logic into meta-object facility for automated model reasoning.",
                    "VT-revolution: interactive programming tutorials made possible.",
                    "Practices and tools for better software testing.",
                    "Automated support for mobile application testing and maintenance.",
                    "Moving towards objective measures of program comprehension.",
                    "Semantic inference from natural language privacy policies and Android code.",
                    "Intelligent bug fixing with software bug knowledge graph.",
                    "Quality assurance automation in autonomous systems.",
                    "How do developers resolve merge conflicts? an investigation into the processes, tools, and improvements.",
                    "Automated scenario-based integration testing of distributed systems.",
                    "Towards learning-augmented languages.",
                    "On the adoption of neural networks in modeling software reliability.",
                    "Type migration in large-scale code bases.",
                    "Reshaping distributed agile and adaptive development environment.",
                    "How Dance(Sport) can help to produce better software.",
                    "Feature-interaction aware configuration prioritization.",
                    "Dara: hybrid model checking of distributed systems.",
                    "Bugs in the wild: examining the effectiveness of static analyzers at finding real-world bugs.",
                    "Mining error-handling specifications for systems software.",
                    "Diversity and decorum in open source communities."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2018swan",
                "sub_name": "Proceedings of the 4th ACM SIGSOFT International Workshop on Software Analytics, SWAN@ESEC/SIGSOFT FSE 2018, Lake Buena Vista, FL, USA, November 5, 2018.",
                "count": 6,
                "papers": [
                    "(No) influence of continuous integration on the commit activity in GitHub projects.",
                    "Characterizing the influence of continuous integration: empirical results from 250+ open source and proprietary projects.",
                    "Facilitating feasibility analysis: the pilot defects prediction dataset maker.",
                    "Is one hyperparameter optimizer enough?",
                    "Differentially-private software analytics for mobile apps: opportunities and challenges.",
                    "Towards a framework for generating program dependence graphs from source code."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2018ensemble",
                "sub_name": "Proceedings of the 1st ACM SIGSOFT International Workshop on Ensemble-Based Software Engineering, EnSEmble@ESEC/SIGSOFT FSE 2018, Lake Buena Vista, FL, USA, November 4, 2018.",
                "count": 4,
                "papers": [
                    "Towards an approach for developing and testing Node-RED IoT systems.",
                    "LiquiDADE: a liquid-based distributed agile and adaptive development environment (DADE) multi-device tool.",
                    "\"Smart Traffic\": an IoT traffic monitoring system based on open source technologies on the cloud.",
                    "From big data to smart data: a data quality perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2018waspi",
                "sub_name": "Proceedings of the 1st ACM SIGSOFT International Workshop on Automated Specification Inference, WASPI@ESEC/SIGSOFT FSE, Lake Buena Vista, FL, USA, November 9, 2018.",
                "count": 5,
                "papers": [
                    "Towards static recovery of micro state transitions from legacy embedded code.",
                    "Contract discovery from black-box components.",
                    "Automated generation of creative software requirements: a data-driven approach.",
                    "On the significance of contract-based typestate specification.",
                    "Towards combining usage mining and implementation analysis to infer API preconditions."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2018atest",
                "sub_name": "Proceedings of the 9th ACM SIGSOFT International Workshop on Automating TEST Case Design, Selection, and Evaluation, A-TEST@SIGSOFT FSE 2018, Lake Buena Vista, FL, USA, November 05, 2018.",
                "count": 11,
                "papers": [
                    "Improving regression testing in continuous integration development environments (keynote).",
                    "Reinforcement learning for Android GUI testing.",
                    "Extending equivalence transformation based program generator for random testing of C compilers.",
                    "HDDr: a recursive variant of the hierarchical Delta debugging algorithm.",
                    "Goal-oriented mutation testing with focal methods.",
                    "A reinforcement learning based approach to automated testing of Android applications.",
                    "Random testing of compilers' performance based on mixed static and dynamic code comparison.",
                    "Grammarinator: a grammar-based open source fuzzer.",
                    "Abstract flow learning for web application test generation.",
                    "Property-based testing for the robot operating system.",
                    "Test patterns for IoT."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2018nl4se",
                "sub_name": "Proceedings of the 4th ACM SIGSOFT International Workshop on NLP for Software Engineering, NL4SE@ESEC/SIGSOFT FSE 2018, Lake Buena Vista, FL, USA, November 4, 2018.",
                "count": 11,
                "papers": [
                    "Learning from code with graphs (keynote).",
                    "LinkSO: a dataset for learning to retrieve similar question answer pairs on software development forums.",
                    "Two perspectives on software documentation quality in stack overflow.",
                    "Total recall, language processing, and software engineering.",
                    "A fine-grained approach for automated conversion of JUnit assertions to English.",
                    "Towards understanding code readability and its impact on design quality.",
                    "Mining monitoring concerns implementation in Java-based software systems.",
                    "Generating comments from source code with CCGs.",
                    "TestNMT: function-to-test neural machine translation.",
                    "3CAP: categorizing the cognitive capabilities of Alzheimer's patients in a smart home environment.",
                    "Natural language processing (NLP) applied on issue trackers."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th SIGSOFT FSE / 16th ESEC 2017",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2017",
                "sub_name": "Proceedings of the 2017 11th Joint Meeting on Foundations of Software Engineering, ESEC/FSE 2017, Paderborn, Germany, September 4-8, 2017.",
                "count": 124,
                "papers": [
                    "The rising tide lifts all boats: the advancement of science in cyber security (invited talk).",
                    "Verifying the forecast: how climate models are developed and tested (invited talk).",
                    "Software engineering research results in industrial practice: a tale of two projects (invited talk).",
                    "Reflections on the REST architectural style and \"principled design of the modern web architecture\" (impact paper award).",
                    "A fast causal profiler for task parallel programs.",
                    "On the scalability of Linux kernel maintainers' work.",
                    "Modeling and verification of evolving cyber-physical spaces.",
                    "Easy over hard: a case study on deep learning.",
                    "Finding near-optimal configurations in product lines by random sampling.",
                    "Revisiting unsupervised learning for defect prediction.",
                    "Loopster: static loop termination analysis.",
                    "CodeCarbonCopy.",
                    "The power of \"why\" and \"why not\": enriching scenario exploration with provenance.",
                    "Where is the bug and how is it fixed? an experiment with practitioners.",
                    "Understanding misunderstandings in source code.",
                    "Measuring neural efficiency of program comprehension.",
                    "Bayesian specification learning for finding API usage errors.",
                    "Synergistic debug-repair of heap manipulations.",
                    "Failure-directed program trimming.",
                    "Why modern open source projects fail.",
                    "Trade-offs in continuous integration: assurance, security, and flexibility.",
                    "µDroid: an energy-aware mutation testing framework for Android.",
                    "PATDroid: permission-aware GUI testing of Android.",
                    "Enabling mutation testing for Android apps.",
                    "Guided, stochastic model-based GUI testing of Android apps.",
                    "Using bad learners to find good configurations.",
                    "Attributed variability models: outside the comfort zone.",
                    "Kmax: finding all configurations of Kbuild makefiles statically.",
                    "Is there a mismatch between real-world feature models and product-line research?",
                    "Adaptively generating high quality fixes for atomicity violations.",
                    "AtexRace: across thread and execution sampling for in-house race detection.",
                    "Symbolic execution of programmable logic controller code.",
                    "Thread-modular static analysis for relaxed memory models.",
                    "ARTINALI: dynamic invariant detection for cyber-physical system security.",
                    "A symbolic justice violations transition system for unrealizable GR(1) specifications.",
                    "Automated control of multiple software goals using multiple actuators.",
                    "Why do developers use trivial packages? an empirical case study on npm.",
                    "Detecting missing information in bug descriptions.",
                    "Continuous variable-specific resolutions of feature interactions.",
                    "Model-level, platform-independent debugging in the context of the model-driven development of real-time systems.",
                    "Cooperative kernels: GPU multitasking for blocking algorithms.",
                    "Toward full elasticity in distributed static analysis: the case of callgraph analysis.",
                    "Probabilistic model checking of perturbed MDPs with applications to cloud computing.",
                    "Understanding the impact of refactoring on smells: a longitudinal study of 23 software projects.",
                    "Cimplifier: automatically debloating containers.",
                    "Craig vs. Newton in software model checking.",
                    "Fairness testing: testing software for discrimination.",
                    "The care and feeding of wild-caught mutants.",
                    "QTEP: quality-aware test case prioritization.",
                    "Constraint normalization and parameterized caching for quantitative program analysis.",
                    "Generalized observational slicing for tree-represented modelling languages.",
                    "On evidence preservation requirements for forensic-ready systems.",
                    "BDCI: behavioral driven conflict identification.",
                    "NoFAQ: synthesizing command repairs from examples.",
                    "S3: syntax- and semantic-guided repair synthesis via programming by examples.",
                    "Counterexample-guided approach to finding numerical invariants.",
                    "Discovering relational specifications.",
                    "Steelix: program-state based binary fuzzing.",
                    "CodeMatch: obfuscation won't conceal your repackaged app.",
                    "A compiler and verifier for page access oblivious computation.",
                    "Automatic generation of inter-component communication exploits for Android applications.",
                    "OASIS: prioritizing static analysis warnings for Android apps based on app user reviews.",
                    "Recovering clear, natural identifiers from obfuscated JS names.",
                    "DESCRY: reproducing system-level concurrency failures.",
                    "Reproducing concurrency failures from crash stacks.",
                    "Automatically analyzing groups of crashes for finding correlations.",
                    "Automatic inference of code transforms for patch generation.",
                    "A feasibility study of using automated program repair for introductory programming assignments.",
                    "Automatically diagnosing and repairing error handling bugs in C.",
                    "Are deep neural networks the best choice for modeling source code?",
                    "Understanding the impact of support for iteration on code search.",
                    "LAMP: data provenance for graph based machine learning algorithms through derivative computation.",
                    "More accurate recommendations for method-level changes.",
                    "Regression test selection across JVM boundaries.",
                    "Measuring the cost of regression testing in practice: a study of Java projects using continuous integration.",
                    "Better test cases for better automated program repair.",
                    "When program analysis meets mobile security: an industrial study of misusing Android internet sockets.",
                    "File-level vs. module-level regression test selection for .NET.",
                    "Record and replay for Android: are we there yet in industrial cases?",
                    "Model-driven software engineering in practice: privacy-enhanced filtering of network traffic.",
                    "Strong agile metrics: mining log data to determine predictive power of software metrics for continuous delivery teams.",
                    "Screening heuristics for project gating systems.",
                    "Natural language querying in SAP-ERP platform.",
                    "Serverless computing: economic and architectural impact.",
                    "What do software engineers care about? gaps between research and practice.",
                    "Reference architectures and Scrum: friends or foes?",
                    "Guidelines for adopting frontend architectures and patterns in microservices-based systems.",
                    "Improving understanding of dynamically typed software developed by agile practitioners.",
                    "Automated identification of security issues from commit messages and bug reports.",
                    "LaChouTi: kernel vulnerability responding framework for the fragmented Android devices.",
                    "Applying deep learning based automatic bug triager to industrial projects.",
                    "Static analysis for optimizing big data queries.",
                    "Automated testing of hybrid Simulink/Stateflow controllers: industrial case studies.",
                    "QEMU-based framework for non-intrusive virtual machine instrumentation and introspection.",
                    "RunDroid: recovering execution call graphs for Android applications.",
                    "RGSE: a regular property guided symbolic executor for Java.",
                    "A tool for automated reasoning about traces based on configurable formal semantics.",
                    "VART: a tool for the automatic detection of regression faults.",
                    "DynAlloy analyzer: a tool for the specification and analysis of alloy models with dynamic behaviour.",
                    "From scenario modeling to scenario programming for reactive systems with dynamic topology.",
                    "CLTSA: labelled transition system analyser with counting fluent support.",
                    "The MONDO collaboration framework: secure collaborative modeling over existing version control systems.",
                    "Model-based privacy and security analysis with CARiSMA.",
                    "Cherry-picking of code commits in long-running, multi-release software.",
                    "ARCC: assistant for repetitive code comprehension.",
                    "JoanAudit: a tool for auditing common injection vulnerabilities.",
                    "XSearch: a domain-specific cross-language relevant question retrieval tool.",
                    "Using search-based software engineering to handle the changes with uncertainties for self-adaptive systems.",
                    "DRACO: discovering refactorings that improve architecture using fine-grained co-change dependencies.",
                    "User- and analysis-driven context aware software development in mobile computing.",
                    "Recommender system for model driven software development.",
                    "On the similarity of software development documentation.",
                    "Application of search-based software engineering methodologies for test suite optimization and evolution in mission critical mobile application development.",
                    "Summarizing software engineering communication artifacts from different sources.",
                    "Model-based dynamic software project scheduling.",
                    "System performance optimization via design and configuration space exploration.",
                    "Suggesting meaningful variable names for decompiled code: a machine translation approach.",
                    "Practical symbolic verification of regular properties.",
                    "FOSS version differentiation as a benchmark for static analysis security testing tools.",
                    "DecisionDroid: a supervised learning-based system to identify cloned Android applications.",
                    "Reasons and drawbacks of using trivial npm packages: the developers' perspective.",
                    "Detecting wearable app permission mismatches: a case study on Android wear.",
                    "Automating traceability link recovery through classification.",
                    "Improving performance of automatic program repair using learned heuristics."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2017serf",
                "sub_name": "Proceedings of the 1st ACM SIGSOFT International Workshop on Software Engineering and Digital Forensics, SERF@ESEC/SIGSOFT FSE 2017, Paderborn, Germany, September 4, 2017.",
                "count": 4,
                "papers": [
                    "Building forensics in: supporting the investigation of digital criminal activities (invited talk).",
                    "Use of organisational topologies for forensic investigations.",
                    "Sustainable automated data recovery: a research roadmap.",
                    "Snap forensics: a tradeoff between ephemeral intelligence and persistent evidence collection."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2017swan",
                "sub_name": "Proceedings of the 3rd ACM SIGSOFT International Workshop on Software Analytics, SWAN@ESEC/SIGSOFT FSE 2017, Paderborn, Germany, September 4, 2017.",
                "count": 5,
                "papers": [
                    "Find, understand, and extend development screencasts on YouTube.",
                    "Analyzing source code for automated design pattern recommendation.",
                    "Metadata-based code example embedding.",
                    "Timezone and time-of-day variance in GitHub teams: an empirical method and study.",
                    "Predicting rankings of software verification tools."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2017wama",
                "sub_name": "Proceedings of the 2nd ACM SIGSOFT International Workshop on App Market Analytics, WAMA@ESEC/SIGSOFT FSE 2017, Paderborn, Germany, September 5, 2017.",
                "count": 4,
                "papers": [
                    "Mining mobile app markets for prioritization of security assessment effort.",
                    "Android apps and user feedback: a dataset for software evolution and quality improvement.",
                    "Understanding the security management of global third-party Android marketplaces.",
                    "Studying software descriptions in SourceForge and app stores for a better understanding of real-life requirements."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2017atest",
                "sub_name": "Proceedings of the 8th ACM SIGSOFT International Workshop on Automated Software Testing, A-TEST@ESEC/SIGSOFT FSE 2017, Paderborn, Germany, September 4-5, 2017.",
                "count": 5,
                "papers": [
                    "Dynamic mutant subsumption analysis using LittleDarwin.",
                    "Hybrid monkey testing: enhancing automated GUI tests with random test generation.",
                    "Collaborative economy for testing cost reduction on Android ecosystem.",
                    "Evaluating quality of security testing of the JDK.",
                    "Comparing automated visual GUI testing tools: an industrial case study."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th SIGSOFT FSE 2016",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2016",
                "sub_name": "Proceedings of the 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering, FSE 2016, Seattle, WA, USA, November 13-18, 2016.",
                "count": 143,
                "papers": [
                    "\"Womenomics\" and gender-inclusive software: what software engineers need to know (invited talk).",
                    "Building a socio-technical theory of coordination: why and how (outstanding research award).",
                    "Correct or usable? the limits of traditional verification (impact paper award).",
                    "Continuous deployment of mobile software at facebook (showcase).",
                    "Model, execute, and deploy: answering the hard questions in end-user programming (showcase).",
                    "Making invisible things visible: tracking down known vulnerabilities at 3000 companies (showcase).",
                    "Developer workflow at google (showcase).",
                    "Titanium: efficient analysis of evolving alloy specifications.",
                    "Mining performance specifications.",
                    "Designing minimal effective normative systems with the help of lightweight formal methods.",
                    "Proteus: computing disjunctive loop summary via path dependency analysis.",
                    "A cross-tool communication study on program analysis tool notifications.",
                    "Factors influencing code review processes in industry.",
                    "Foraging and navigations, fundamentally: developers' predictions of value and cost.",
                    "How to break an API: cost negotiation and community values in three software ecosystems.",
                    "Python predictive analysis for bug detection.",
                    "Crash consistency validation made easy.",
                    "Discovering bug patterns in JavaScript.",
                    "Effort-aware just-in-time defect prediction: simple unsupervised models could be better than supervised models.",
                    "Detecting sensitive data disclosure via bi-directional text correlation analysis.",
                    "Multi-representational security analysis.",
                    "String analysis for side channels with segmented oracles.",
                    "WebRanz: web page randomization for better advertisement delivery and web-bot prevention.",
                    "A discrete-time feedback controller for containerized cloud applications.",
                    "Keep it SIMPLEX: satisfying multiple goals with guarantees in control-based self-adaptive systems.",
                    "Automated change impact analysis between SysML models of requirements and design.",
                    "Parameter-free probabilistic API mining across GitHub.",
                    "API deprecation: a retrospective analysis and detection method for code examples on the web.",
                    "When should internal interfaces be promoted to public?",
                    "POLLUX: safely upgrading dependent application libraries.",
                    "Extracting instruction semantics via symbolic execution of code generators.",
                    "Efficient generation of inductive validity cores for safety properties.",
                    "Correctness witnesses: exchanging verification results between verifiers.",
                    "SMT-based verification of parameterized systems.",
                    "On-the-fly decomposition of specifications in software model checking.",
                    "On well-separation of GR(1) specifications.",
                    "Lightweight specification and analysis of dynamic systems with rich configurations.",
                    "Gray links in the use of requirements traceability.",
                    "Understanding and detecting wake lock misuses for Android applications.",
                    "DiagDroid: Android performance diagnosis via anatomizing asynchronous executions.",
                    "Minimizing GUI event traces.",
                    "Causal impact analysis for app releases in google play.",
                    "Static DOM event dependency analysis for testing web applications.",
                    "On-demand strong update analysis via value-flow refinement.",
                    "Call graph construction for Java libraries.",
                    "Revamping JavaScript static analysis via localization and remediation of root causes of imprecision.",
                    "What would users change in my app? summarizing app reviews for recommending software changes.",
                    "API code recommendation using statistical learning from fine-grained changes.",
                    "TIPMerge: recommending experts for integrating changes across branches.",
                    "Interactive and guided architectural refactoring with search-based recommendation.",
                    "Can testedness be effectively measured?",
                    "A large-scale empirical comparison of static and dynamic test case prioritization techniques.",
                    "Analyzing the validity of selective mutation with dominator mutants.",
                    "An extensive study of static regression test selection in modern software evolution.",
                    "PerfGuard: binary-centric application performance monitoring in production environments.",
                    "Python probabilistic type inference with natural language support.",
                    "Detecting and fixing precision-specific operations for measuring floating-point errors.",
                    "Deep API learning.",
                    "Build system with lazy retrieval for Java projects.",
                    "iGen: dynamic interaction inference for configurable software.",
                    "CacheOptimizer: helping developers configure caching frameworks for hibernate-based database-centric web applications.",
                    "BinGo: cross-architecture cross-OS binary search.",
                    "Relationship-aware code search for JavaScript frameworks.",
                    "Code relatives: detecting similarly behaving software.",
                    "Understanding and generating high quality patches for concurrency bugs.",
                    "Anti-patterns in search-based program repair.",
                    "Semi-supervised verified feedback generation.",
                    "WATERFALL: an incremental approach for repairing record-replay tests of web applications.",
                    "Efficiency of projectional editing: a controlled experiment.",
                    "ECHO: instantaneous in situ race detection in the IDE.",
                    "Detecting table clones and smells in spreadsheets.",
                    "Flow-sensitive composition of thread-modular abstract interpretation.",
                    "A deployable sampling strategy for data race detection.",
                    "Online shared memory dependence reduction via bisectional coordination.",
                    "Parallel data race detection for task parallel programs with locks.",
                    "Paradise unplugged: identifying barriers for female participation on stack overflow.",
                    "Why we refactor? confessions of GitHub contributors.",
                    "Effectiveness of code contribution: from patch-based to pull-request-based tools.",
                    "Isomorphic regression testing: executing uncovered branches without test augmentation.",
                    "Directed test generation to detect loop inefficiencies.",
                    "Field-exhaustive testing.",
                    "Sustainable software design.",
                    "Designing for dystopia: software engineering research for the post-apocalypse.",
                    "Disrupting developer productivity one bot at a time.",
                    "Training the future workforce through task curation in an OSS ecosystem.",
                    "Reaching the masses: a new subdiscipline of app programmer education.",
                    "Studying developer gaze to empower software engineering research and practice.",
                    "DeepSoft: a vision for a deep model of software.",
                    "Budgeted testing through an algorithmic lens.",
                    "Reasoning with imprecise privacy preferences.",
                    "Bing developer assistant: improving developer productivity by recommending sample code.",
                    "Cluster-based test suite functional analysis.",
                    "A portable interface for runtime energy monitoring.",
                    "Learning for test prioritization: an industrial case study.",
                    "Combinatorial generation of structurally complex test inputs for commercial software applications.",
                    "Automated test input generation for Android: are we really there yet in an industrial case?",
                    "NonDex: a tool for detecting and debugging wrong assumptions on Java API specifications.",
                    "TIPMerge: recommending developers for merging branches.",
                    "Time-travel debugging for JavaScript/Node.js.",
                    "PUMConf: a tool to configure product specific use case and domain models in a product line.",
                    "T2API: synthesizing API code usage templates from English texts with statistical translation.",
                    "JBSE: a symbolic executor for Java programs with complex heap inputs.",
                    "ARdoc: app reviews development oriented classifier.",
                    "Hunter: next-generation code reuse for Java.",
                    "BigDebug: interactive debugger for big data analytics in Apache Spark.",
                    "Visualizing code and coverage changes for code review.",
                    "End-to-end memory behavior profiling with DINAMITE.",
                    "Validate your SPDX files for open source license violations.",
                    "FSX: a tool for fine-grained incremental unit test generation for C/C++ programs.",
                    "Refactoring and migration of cascading style sheets: towards optimization and improved maintainability.",
                    "Developing a reusable control-based approach to build self-adaptive software systems with formal guarantees.",
                    "Automating repetitive code changes using examples.",
                    "Understanding and improving continuous integration.",
                    "Guided code synthesis using deep neural networks.",
                    "Generating interactive web pages from storyboards.",
                    "Data structure synthesis.",
                    "Understanding behavioural patterns in JavaScript.",
                    "Regression testing of web applications using Record/Replay tools.",
                    "Supporting change in product lines within the context of use case-driven development and testing.",
                    "Input-sensitive performance testing.",
                    "On the utility of dominator mutants for mutation testing.",
                    "Effective assignment and assistance to software developers and reviewers.",
                    "RABIEF: range analysis based integer error fixing.",
                    "Fine-grained binary code authorship identification.",
                    "Identifying participants for collaborative merge.",
                    "Cozy: synthesizing collection data structures.",
                    "Constraint-based event trace reduction.",
                    "Automatic trigger generation for end user written rules for home automation.",
                    "Hotspot symbolic execution of floating-point programs.",
                    "Evaluation of fault localization techniques.",
                    "How should static analysis tools explain anomalies to developers?",
                    "Repairing test dependence.",
                    "Combining bug detection and test case generation.",
                    "SmartDebug: an interactive debug assistant for Java.",
                    "Static loop analysis and its applications.",
                    "Social health cues developers use when choosing open source packages.",
                    "Finding and breaking test dependencies to speed up test execution.",
                    "Automatic performance testing using input-sensitive profiling.",
                    "Enforcing correct array indexes with a type system.",
                    "Discovering additional violations of Java API invariants.",
                    "Preventing signedness errors in numerical computations in Java.",
                    "Bounded model checking of state-space digital systems: the impact of finite word-length effects on the implementation of fixed-point digital controllers based on state-space modeling.",
                    "Atlas: an intelligent, performant framework for web-based grid computing."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2016sse",
                "sub_name": "Proceedings of the 8th International Workshop on Social Software Engineering, SSE 2016, Seattle, WA, USA, November 14, 2016.",
                "count": 3,
                "papers": [
                    "Understanding Git history: a multi-sense view.",
                    "VDML4RS: a tool for reputation systems modeling and design.",
                    "On the impact of social network information diversity on end-user programming productivity: a foraging-theoretic study."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2016swan",
                "sub_name": "Proceedings of the 2nd International Workshop on Software Analytics, SWAN@SIGSOFT FSE 2016, Seattle, WA, USA, November 13, 2016.",
                "count": 8,
                "papers": [
                    "Addressing scalability in API method call analytics.",
                    "Vulnerability severity scoring and bounties: why the disconnect?",
                    "A replication study: mining a proprietary temporal defect dataset.",
                    "A hybrid model for task completion effort estimation.",
                    "Analyzing on-boarding time in context of crowdsourcing.",
                    "Software crowdsourcing reliability: an empirical study on developers behavior.",
                    "FourD: do developers discuss design? revisited.",
                    "Sampling code clones from program dependence graphs with GRAPLE."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2016wama",
                "sub_name": "Proceedings of the International Workshop on App Market Analytics, WAMA@SIGSOFT FSE, Seattle, WA, USA, November 14, 2016.",
                "count": 9,
                "papers": [
                    "Checking app user interfaces against app descriptions.",
                    "Examining the relationship between security metrics and user ratings of mobile apps: a case study.",
                    "Feature-based evaluation of competing apps.",
                    "CALAPPA: a toolchain for mining Android applications.",
                    "Darwin: a static analysis dataset of malicious and benign Android apps.",
                    "More insight from being more focused: analysis of clustered market apps.",
                    "To upgrade or not to upgrade? the release of new versions to survive in the hypercompetitive app market.",
                    "The impact of cross-platform development approaches for mobile applications from the user's perspective.",
                    "Mining and characterizing hybrid apps."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2016atest",
                "sub_name": "Proceedings of the 7th International Workshop on Automating Test Case Design, Selection, and Evaluation, A-TEST@SIGSOFT FSE 2016, Seattle, WA, USA, November 18, 2016.",
                "count": 12,
                "papers": [
                    "Multilevel coarse-to-fine-grained prioritization for GUI and web applications.",
                    "EventFlowSlicer: goal based test generation for graphical user interfaces.",
                    "PredSym: estimating software testing budget for a bug-free release.",
                    "The complementary aspect of automatically and manually generated test case sets.",
                    "Modernizing hierarchical delta debugging.",
                    "Complete IOCO test cases: a case study.",
                    "Model-based testing of stochastic systems with IOCO theory.",
                    "Development and maintenance efforts testing graphical user interfaces: a comparison.",
                    "MT4A: a no-programming test automation framework for Android applications.",
                    "Mitigating (and exploiting) test reduction slippage.",
                    "Automated workflow regression testing for multi-tenant SaaS: integrated support in self-service configuration dashboard.",
                    "Towards an MDE-based approach to test entity reconciliation applications."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd SIGSOFT FSE / 15th ESEC 2015",
        "info": "Bergamo, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2015",
                "sub_name": "Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering, ESEC/FSE 2015, Bergamo, Italy, August 30 - September 4, 2015.",
                "count": 124,
                "papers": [
                    "Proactive self-adaptation under uncertainty: a probabilistic model checking approach.",
                    "Automated multi-objective control for self-adaptive software design.",
                    "Detecting event anomalies in event-based systems.",
                    "Suggesting accurate method and class names.",
                    "Measure it? Manage it? Ignore it? software practitioners and technical debt.",
                    "Automatically computing path complexity of programs.",
                    "Systematic testing of asynchronous reactive systems.",
                    "Effective test suites for mixed discrete-continuous stateflow controllers.",
                    "GR(1) synthesis for LTL specification patterns.",
                    "Modeling readability to improve unit tests.",
                    "Improving model-based test generation by model decomposition.",
                    "Synthesizing tests for detecting atomicity violations.",
                    "Optimizing energy consumption of GUIs in Android apps: a multi-objective approach.",
                    "Generating TCP/UDP network data for automated unit test generation.",
                    "Staged program repair with condition synthesis.",
                    "When, how, and why developers (do not) test in their IDEs.",
                    "How developers search for code: a case study.",
                    "Tracing software developers' eyes and interactions for change tasks.",
                    "Assertions are strongly correlated with test suite effectiveness.",
                    "Test report prioritization to assist crowdsourced testing.",
                    "Comparing and combining test-suite reduction and regression test selection.",
                    "Questions developers ask while diagnosing potential security vulnerabilities with static analysis.",
                    "Quantifying developers' adoption of security tools.",
                    "Auto-patching DOM-based XSS at scale.",
                    "Performance-influence models for highly configurable systems.",
                    "Users beware: preference inconsistencies ahead.",
                    "Hey, you have given me too many knobs!: understanding and dealing with over-designed configuration in system software.",
                    "Crowd debugging.",
                    "On the use of delta debugging to reduce recordings and facilitate debugging of web applications.",
                    "MemInsight: platform-independent memory debugging for JavaScript.",
                    "JITProf: pinpointing JIT-unfriendly JavaScript code.",
                    "Cross-language program slicing for dynamic web applications.",
                    "Detecting JavaScript races that matter.",
                    "The making of cloud applications: an empirical study on software development for the cloud.",
                    "An empirical study of goto in C code from GitHub repositories.",
                    "How practitioners perceive the relevance of software engineering research.",
                    "What change history tells us about thread synchronization.",
                    "Finding schedule-sensitive branches.",
                    "Effective and precise dynamic detection of hidden races for Java programs.",
                    "A user-guided approach to program analysis.",
                    "Hidden truths in dead software paths.",
                    "P3: partitioned path profiling.",
                    "Heterogeneous cross-company defect prediction by unified metric representation and CCA-based transfer learning.",
                    "Heterogeneous defect prediction.",
                    "Clone-based and interactive recommendation for modifying pasted code.",
                    "Is the cure worse than the disease? overfitting in automated program repair.",
                    "Responsive designs in a snap.",
                    "CLOTHO: saving programs from malformed strings and incorrect string-handling.",
                    "Query-based configuration of text retrieval solutions for software engineering tasks.",
                    "Information retrieval and spectrum based bug localization: better together.",
                    "Rule-based extraction of goal-use case models from text.",
                    "Symbolic execution of programs with heap inputs.",
                    "Automatically deriving pointer reference expressions from binary code for memory dump analysis.",
                    "Summarizing and measuring development activity.",
                    "A method to identify and correct problematic software activity data: exploiting capacity constraints and data redundancies.",
                    "Gamification for enforcing coding conventions.",
                    "String analysis for Java and Android applications.",
                    "Auto-completing bug reports for Android applications.",
                    "CLAPP: characterizing loops in Android applications.",
                    "TLV: abstraction through testing, learning, and validation.",
                    "Mimic: computing models for opaque code.",
                    "Witness validation and stepwise testification across software verifiers.",
                    "Efficient and reasonable object-oriented concurrency.",
                    "FlexJava: language support for safe and modular approximate programming.",
                    "Getting to know you: towards a capability model for Java.",
                    "Efficient dependency detection for safe Java test acceleration.",
                    "Turning programs against each other: high coverage fuzz-testing using binary-code mutation and dynamic slicing.",
                    "Guided differential testing of certificate validation in SSL/TLS implementations.",
                    "Quality and productivity outcomes relating to continuous integration in GitHub.",
                    "Developer onboarding in GitHub: the role of prior social links and language experience.",
                    "Impact of developer turnover on quality in open-source software.",
                    "MultiSE: multi-path symbolic execution using value summaries.",
                    "Assertion guided symbolic execution of multithreaded programs.",
                    "Iterative distribution-aware sampling for probabilistic symbolic execution.",
                    "Bespoke tools: adapted to the concepts developers know.",
                    "I heart hacker news: expanding qualitative research findings by analyzing social news websites.",
                    "GitSonifier: using sound to portray developer conflict history.",
                    "Automatically recommending test code examples to inexperienced developers.",
                    "Using software theater for the demonstration of innovative ubiquitous applications.",
                    "Behavioral log analysis with statistical guarantees.",
                    "Inner oracles: input-specific assertions on internal states.",
                    "Targeted program transformations for symbolic execution.",
                    "Crash reproduction via test case mutation: let existing test cases help.",
                    "RDIT: race detection from incomplete traces.",
                    "TACO: test suite augmentation for concurrent programs.",
                    "Navigating through the archipelago of refactorings.",
                    "Detecting semantic merge conflicts with variability-aware execution.",
                    "Product lines can jeopardize their trade secrets.",
                    "JSketch: sketching for Java.",
                    "Don't panic: reverse debugging of kernel drivers.",
                    "UMTG: a toolset to automatically generate system test cases from use case specifications.",
                    "DexterJS: robust testing platform for DOM-based XSS vulnerabilities.",
                    "T3i: a tool for generating and querying test suites for Java.",
                    "iTrace: enabling eye tracking on software artifacts within the IDE to support software engineering tasks.",
                    "Nyx: a display energy optimizer for mobile web apps.",
                    "NARCIA: an automated tool for change impact analysis in natural language requirements.",
                    "Commit guru: analytics and risk prediction of software commits.",
                    "OSSMETER: a software measurement platform for automatically analysing open source software projects.",
                    "Comprehensive service matching with MatchBox.",
                    "UEDashboard: awareness of unusual events in commit histories.",
                    "MatrixMiner: a red pill to architect informal product descriptions in the matrix.",
                    "Predicting field reliability.",
                    "REMI: defect prediction for efficient API testing.",
                    "OnSpot system: test impact visibility during code edits in real software.",
                    "Products, developers, and milestones: how should I build my N-Gram language model.",
                    "Evaluating a formal scenario-based method for the requirements analysis in automotive software engineering.",
                    "Barriers and enablers for shortening software development lead-time in mechatronics organizations: a case study.",
                    "Semantic degrees for Industrie 4.0 engineering: deciding on the degree of semantic formalization to select appropriate technologies.",
                    "Towards automating the security compliance value chain.",
                    "Requirements, architecture, and quality in a mission critical system: 12 lessons learned.",
                    "Decentralized self-adaptation in large-scale distributed systems.",
                    "Vehicle level continuous integration in the automotive industry.",
                    "Quantifying architectural debts.",
                    "User-centric security: optimization of the security-usability trade-off.",
                    "Automated unit test generation for evolving software.",
                    "Increasing the efficiency of search-based unit test generation using parameter control.",
                    "Enhancing Android application bug reporting.",
                    "Improving energy consumption in Android apps.",
                    "Automated generation of programming language quizzes.",
                    "Spotting familiar code snippet structures for program comprehension.",
                    "Combining eye tracking with navigation paths for identification of cross-language code dependencies.",
                    "A textual domain specific language for requirement modelling.",
                    "Automated attack surface approximation.",
                    "Pockets: a tool to support exploratory programming for novices and educators."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2015demobile",
                "sub_name": "Proceedings of the 3rd International Workshop on Software Development Lifecycle for Mobile, DeMobile 2015, Bergamo, Italy, August 31 - September 4, 2015.",
                "count": 10,
                "papers": [
                    "App store mining and analysis.",
                    "Walking the model: the smart mobile field engineer (keynote).",
                    "AGRippin: a novel search based testing technique for Android applications.",
                    "Detecting Android malware using sequences of system calls.",
                    "Tailoring software architecture concepts and process for mobile application development.",
                    "Optimizing energy of HTTP requests in Android applications.",
                    "Perspectives on static analysis of mobile apps (invited talk).",
                    "A mobile application for geographical data gathering and validation in fieldwork (invited talk).",
                    "CLAPP: characterizing loops in Android applications (invited talk).",
                    "Optimizing display energy consumption for hybrid Android apps (invited talk)."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2015qudos",
                "sub_name": "Proceedings of the 1st International Workshop on Quality-Aware DevOps, QUDOS 2015, Bergamo, Italy, September 1, 2015.",
                "count": 8,
                "papers": [
                    "A DevOps approach to integration of software components in an EU research project.",
                    "DevOps meets formal modelling in high-criticality complex systems.",
                    "Modelling multi-tier enterprise applications behaviour with design of experiments technique.",
                    "A proactive approach for runtime self-adaptation based on queueing network fluid analysis.",
                    "Model-based performance evaluations in continuous delivery pipelines.",
                    "Continous deployment of multi-cloud systems.",
                    "SPACE4Cloud: a DevOps environment for multi-cloud applications.",
                    "Filling the gap: a tool to automate parameter estimation for software performance models."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2015ctse",
                "sub_name": "Proceedings of the 1st International Workshop on Control Theory for Software Engineering, CTSE@SIGSOFT FSE 2015, Bergamo, Italy, August 31 - September 04, 2015.",
                "count": 6,
                "papers": [
                    "SimCA vs ActivFORMS: comparing control- and architecture-based adaptation on the TAS exemplar.",
                    "MORPH: a reference architecture for configuration and behaviour self-adaptation.",
                    "Adaptive predictive control for software systems.",
                    "Quo vadis cyber-physical systems: research areas of cyber-physical ecosystems: a position paper.",
                    "Robust degradation and enhancement of robot mission behaviour in unpredictable environments.",
                    "Control theory meets software engineering: the holonic perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2015sse",
                "sub_name": "Proceedings of the 7th International Workshop on Social Software Engineering, SSE 2015, Bergamo, Italy, September 1, 2015.",
                "count": 8,
                "papers": [
                    "Communicating software testing culture through visualizing testing activity.",
                    "Towards GEEZMO: hiGh-frEquEncy Zest and Mood-pOlling for proactive software development problem-solving.",
                    "The role of social interactions in value creation in agile software development processes.",
                    "Could social factors influence the effort software estimation?",
                    "Understanding the affect of developers: theoretical background and guidelines for psychoempirical software engineering.",
                    "The challenges of sentiment detection in the social programmer ecosystem.",
                    "The social developer: now, then, and tomorrow.",
                    "Preparing next generation of software engineers for future societal challenges and opportunities."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2015atest",
                "sub_name": "Proceedings of the 6th International Workshop on Automating Test Case Design, Selection and Evaluation, A-TEST 2015, Bergamo, Italy, August 30-31, 2015.",
                "count": 7,
                "papers": [
                    "Model-driven test case design for model-to-model semantics preservation.",
                    "A test model for graph database applications: an MDA-based approach.",
                    "EvoSE: evolutionary symbolic execution.",
                    "Testing data transformations in MapReduce programs.",
                    "Deterministically testing actor-based concurrent software.",
                    "Concurrent software testing in practice: a catalog of tools.",
                    "Bayesian concepts in software testing: an initial review."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd SIGSOFT FSE 2014",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2014",
                "sub_name": "Proceedings of the 22nd ACM SIGSOFT International Symposium on Foundations of Software Engineering, (FSE-22), Hong Kong, China, November 16 - 22, 2014.",
                "count": 105,
                "papers": [
                    "Omlet: a revolution against big-brother social networks (invited talk).",
                    "From software engineering to software systems (invited talk).",
                    "Ten years with evidence-based software engineering. What is it? Has it had any impact? What's next?",
                    "Experiences developing tools for developers (invited talk).",
                    "Are you getting traction? tales from the tech transfer trenches (invited talk).",
                    "Data hard with a vengeance (invited talk).",
                    "Developers' code context models for change tasks.",
                    "Software developers' perceptions of productivity.",
                    "Enablers, inhibitors, and perceptions of testing in novice software teams.",
                    "Feedback generation for performance problems in introductory programming assignments.",
                    "Test case purification for improving fault localization.",
                    "Automatically generated patches as debugging aids: a human study.",
                    "A foundation for refactoring C with macros.",
                    "Vector abstraction and concretization for scalable detection of refactorings.",
                    "FlowTwist: efficient context-sensitive inside-out taint analysis for large codebases.",
                    "ORBS: language-independent program slicing.",
                    "JSAI: a static analysis platform for JavaScript.",
                    "A path-sensitively sliced control flow graph.",
                    "Let's talk about it: evaluating contributions through discussion in GitHub.",
                    "A large scale study of programming languages and code quality in github.",
                    "Mining preconditions of APIs in large-scale code corpus.",
                    "Automatic mining of specifications from invocation traces and method invariants.",
                    "Counterexample guided abstraction refinement of product-line behavioural models.",
                    "Powering the static driver verifier using corral.",
                    "Verifying CTL-live properties of infinite state models using an SMT solver.",
                    "Efficient runtime-enforcement techniques for policy weaving.",
                    "Techniques for improving regression testing in continuous integration development environments.",
                    "Balancing trade-offs in test-suite reduction.",
                    "Identifying the characteristics of vulnerable code changes: an empirical study.",
                    "On the localness of software.",
                    "Learning natural coding conventions.",
                    "How should we measure functional sameness from program source code? an exploratory study on Java methods.",
                    "The plastic surgery hypothesis.",
                    "Grail: context-aware fixing of concurrency bugs.",
                    "AI: a lightweight system for tolerating concurrency bugs.",
                    "Retrofitting concurrency for Android applications through refactoring.",
                    "Sherlock: scalable deadlock detection for concurrent programs.",
                    "Search-based synthesis of equivalent method sequences.",
                    "Beyond the rainbow: self-adaptive failure avoidance in configurable systems.",
                    "Semantics-based obfuscation-resilient binary code similarity comparison with applications to software plagiarism detection.",
                    "Focus-shifting patterns of OSS developers and their congruence with call graphs.",
                    "How we get there: a context-guided search strategy in concolic testing.",
                    "Solving complex path conditions through heuristic search on induced polytopes.",
                    "Statistical symbolic execution with informed sampling.",
                    "SymJS: automatic symbolic testing of JavaScript web applications.",
                    "Selection and presentation practices for code example summarization.",
                    "Mining idioms from source code.",
                    "Automatic generation of release notes.",
                    "Discovering refactoring opportunities in cascading style sheets.",
                    "SAFEWAPI: web API misuse detector for web applications.",
                    "Building call graphs for embedded client-side code in dynamic web applications.",
                    "Sketches and diagrams in practice.",
                    "Architecture challenges for internal software ecosystems: a large-scale industry case study.",
                    "Variable-specific resolutions for feature interactions.",
                    "An empirical study on program comprehension with reactive programming.",
                    "Apposcopy: semantics-based detection of Android malware through static analysis.",
                    "Detecting energy bugs and hotspots in mobile apps.",
                    "EvoDroid: segmented evolutionary testing of Android apps.",
                    "Prioritizing the devices to test your app on: a case study of Android game apps.",
                    "Improving oracle quality by detecting brittle assertions and unused inputs in tests.",
                    "On the efficiency of automated testing.",
                    "An empirical analysis of flaky tests.",
                    "Are mutants a valid substitute for real faults in software testing?",
                    "No issue left behind: reducing information overload in issue tracking.",
                    "Panning requirement nuggets in stream of software maintenance tickets.",
                    "Learning to rank relevant files for bug reports using domain knowledge.",
                    "Querying sequential software engineering data.",
                    "Tsmart-GalsBlock: a toolkit for modeling, validation, and synthesis of multi-clocked embedded systems.",
                    "A tool suite for the model-driven software engineering of cyber-physical systems.",
                    "XMLMate: evolutionary XML test generation.",
                    "CHOReOSynt: enforcing choreography realizability in the future internet.",
                    "RaPiD: a toolkit for reliability analysis of non-deterministic systems.",
                    "Aalta: an LTL satisfiability checker over Infinite/Finite traces.",
                    "Omen+: a precise dynamic deadlock detector for multithreaded Java libraries.",
                    "Archie: a tool for detecting, monitoring, and preserving architecturally significant code.",
                    "Linking sketches and diagrams to source code artifacts.",
                    "BumbleBee: a refactoring environment for spreadsheet formulas.",
                    "RefDistiller: a refactoring aware code review tool for inspecting manual refactoring edits.",
                    "Critics: an interactive code review tool for searching and inspecting systematic changes.",
                    "ConceptCloud: a tagcloud browser for software archives.",
                    "Titan: a toolset that connects software architecture with quality analysis.",
                    "BugLocalizer: integrated tool support for bug localization.",
                    "Diagnose crashing faults on production software.",
                    "Integrating approaches for feature implementation.",
                    "Numerical program analysis and testing.",
                    "Traceability and model checking to support safety requirement verification.",
                    "Dealing with uncertainty in verification of nondeterministic systems.",
                    "Static analysis driven performance and energy testing.",
                    "Autonomous compliance monitoring of non-functional properties.",
                    "Detecting, isolating, and enforcing dependencies among and within test cases.",
                    "Improving the software testing skills of novices during onboarding through social transparency.",
                    "Minimizing software conflicts through proactive detection of conflicts and task scheduling.",
                    "Detecting and preventing the architectural roots of bugs.",
                    "Estimating the effectiveness of spectrum-based fault localization.",
                    "Managing lots of models: the FaMine approach.",
                    "Social network analysis in open source software peer review.",
                    "Towards a theory of architectural styles.",
                    "Software programmer management: a machine learning and human computer interaction framework for optimal task assignment.",
                    "Methodology and culture: drivers of mediocrity in software engineering?",
                    "Known unknowns: testing in the presence of uncertainty.",
                    "Speculative reprogramming.",
                    "A variability perspective of mutation analysis.",
                    "Mining micro-practices from operational data.",
                    "Achieving lightweight trustworthy traceability.",
                    "Software maintenance like maintenance in other engineering disciplines."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2014aoasia",
                "sub_name": "Proceedings of the 9th International Workshop on Advanced Modularization Techniques, AOAsia 2014, Hong Kong, China, November 16, 2014.",
                "count": 2,
                "papers": [
                    "Toward understanding how developers recognize features in source code from descriptions.",
                    "Uncertainty-aware architectural interface."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2014crowdsoft",
                "sub_name": "Proceedings of the 1st International Workshop on Crowd-based Software Development Methods and Technologies, CrowdSoft 2014, Hong Kong, China, November 17, 2014.",
                "count": 11,
                "papers": [
                    "How the crowd impacts commercial applications: a user-oriented approach.",
                    "Crowdsourcing in the Brazilian IT industry: what we know and what we don't know.",
                    "Using clustering and transitivity to reduce the costs of crowdsourced entity resolution.",
                    "iTest: testing software with mobile crowdsourcing.",
                    "Recommending relevant projects via user behaviour: an exploratory study on github.",
                    "Exploring the patterns of social behavior in GitHub.",
                    "Investigating social media in GitHub's pull-requests: a case study on Ruby on Rails.",
                    "SmartHR: a resume query and management system based on semantic web.",
                    "Personalized mobile application discovery.",
                    "A novel multilayered context awareness technology for internetware evolution.",
                    "Estimating the dynamic performance of composed services: a probability theory based approach."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2014demobile",
                "sub_name": "Proceedings of the 2nd International Workshop on Software Development Lifecycle for Mobile, DeMobile 2014, Hong Kong, China, November 17, 2014.",
                "count": 7,
                "papers": [
                    "Responsiveness analysis tool for Android application.",
                    "Attack surfaces for mobile devices.",
                    "Improving responsiveness in mobile apps via refactoring for asynchrony (invited talk).",
                    "Perspectives on task ownership in mobile operating system development (invited talk).",
                    "Apposcopy: automated detection of Android malware (invited talk).",
                    "Energy-aware design patterns for mobile application development (invited talk).",
                    "Automated detection and mitigation of inter-application security vulnerabilities in Android (invited talk)."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2014innoswdev",
                "sub_name": "Proceedings of the International Workshop on Innovative Software Development Methodologies and Practices, InnoSWDev 2014, Hong Kong, China, November 16, 2014.",
                "count": 14,
                "papers": [
                    "Software engineering for multi-tenancy computing challenges and implications.",
                    "Enhanced n-version programming and recovery block techniques for web service systems.",
                    "Model checking partial software product line designs.",
                    "Software reliability analysis considering the variation of testing-effort and change-point.",
                    "Program structure aware fault localization.",
                    "Toward a methodology to expose partially fixed concurrency bugs in modified multithreaded programs.",
                    "Cloud-based support for global software engineering: potentials, risks, and gaps.",
                    "Scaling up analogy-based software effort estimation: a comparison of multiple hadoop implementation schemes.",
                    "A new business model of custom software development for agile software development.",
                    "Developing enterprise mobile applications the easy way.",
                    "Context-sensitive detection of information exposure bugs with symbolic execution.",
                    "Supporting clone analysis with tag cloud visualization.",
                    "Sketch-based gradual model-driven development.",
                    "An empirical study of BM25 and BM25F based feature location techniques."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2014sse",
                "sub_name": "Proceedings of the 6th International Workshop on Social Software Engineering, SSE 2014, Hong Kong, China, November 17, 2014.",
                "count": 7,
                "papers": [
                    "Can collaborative tagging improve user feedback? a case study.",
                    "Supporting collaboration of heterogeneous teams in an augmented team room.",
                    "Eliciting and visualising trust expectations using persona trust characteristics and goal models.",
                    "One size doesn't fit all: diversifying \"the user\" using personas and emotional scenarios.",
                    "Towards discovering the role of emotions in stack overflow.",
                    "An empirical investigation of socio-technical code review metrics and security vulnerabilities.",
                    "Developer involvement considered harmful?: an empirical examination of Android bug resolution times."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st SIGSOFT FSE / 14th ESEC 2013",
        "info": "Saint Petersburg, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2013",
                "sub_name": "Joint Meeting of the European Software Engineering Conference and the ACM SIGSOFT Symposium on the Foundations of Software Engineering, ESEC/FSE'13, Saint Petersburg, Russian Federation, August 18-26, 2013.",
                "count": 95,
                "papers": [
                    "A logical revolution (keynote).",
                    "Producing software by integration: challenges and research directions (keynote).",
                    "Software engineering for mathematics (keynote).",
                    "Empirical answers to fundamental software engineering problems (panel).",
                    "A publication culture in software engineering (panel).",
                    "Artifact evaluation (summary).",
                    "Efficiency and early fault detection with lower and higher strength combinatorial interaction testing.",
                    "Con2colic testing.",
                    "Boosting concolic testing via interpolation.",
                    "Adequate monitoring of service compositions.",
                    "Prediction of atomic web services reliability based on k-means clustering.",
                    "Scalable analysis of variable software.",
                    "Bayesian inference using data flow analysis.",
                    "Second-order constraints in dynamic invariant inference.",
                    "Z3-str: a z3-based string solver for web application analysis.",
                    "An empirical analysis of the co-evolution of schema and code in database applications.",
                    "Automated oracles: an empirical study on cost and effectiveness.",
                    "Sample size vs. bias in defect prediction.",
                    "Finding incorrect compositions of atomicity.",
                    "Tightfit: adaptive parallelization with foresight.",
                    "Distributed program tracing.",
                    "Will you still compile me tomorrow? static cross-version compiler validation.",
                    "Convergent contemporary software peer review practices.",
                    "Do all task dependencies require coordination? the role of task properties in identifying critical coordination needs in software projects.",
                    "Dynodroid: an input generation system for Android apps.",
                    "KATCH: high-coverage testing of software patches.",
                    "Termination proofs from tests.",
                    "SPLat: lightweight dynamic analysis for reducing combinatorics in testing configurable systems.",
                    "Cachetor: detecting cacheable data to remove bloat.",
                    "Effective dynamic detection of alias analysis errors.",
                    "Feature model extraction from large collections of informal product descriptions.",
                    "N-way model merging.",
                    "Compiling mockups to flexible UIs.",
                    "Making offline analyses continuous.",
                    "Regression tests to expose change interaction errors.",
                    "Differential assertion checking.",
                    "Preventing database deadlocks in applications.",
                    "Identifying message flow in distributed event-based systems.",
                    "Improving trace accuracy through data-driven configuration and composition of tracing features.",
                    "Precision reuse for efficient regression verification.",
                    "Cascading verification: an integrated method for domain-specific model checking.",
                    "Enhancing symbolic execution with built-in term rewriting and constrained lazy initialization.",
                    "Mining behavior models from enterprise web applications.",
                    "Incrementally synthesizing controllers from scenario-based product line specifications.",
                    "Synthesis of component and connector models from crosscutting structural views.",
                    "Searching for better configurations: a rigorous approach to clone evaluation.",
                    "Diversity in software engineering research.",
                    "API change and fault proneness: a threat to the success of Android apps.",
                    "Jalangi: a selective record-replay and dynamic analysis framework for JavaScript.",
                    "Practical static analysis of JavaScript applications in the presence of frameworks and libraries.",
                    "Server interface descriptions for automated testing of JavaScript web applications.",
                    "Explaining inconsistent code.",
                    "A statistical semantic language model for source code.",
                    "Crossing the gap from imperative to functional programming through refactoring.",
                    "Scalable and incremental software bug detection.",
                    "Inferring project-specific bug patterns for detecting sibling bugs.",
                    "Mining succinct predicated bug signatures.",
                    "SocialCDE: a social awareness tool for global software teams.",
                    "REDACT: preventing database deadlocks from application-based transactions.",
                    "aPET: a test case generation tool for concurrent objects.",
                    "RUBRIC: a flexible tool for automated checking of conformance to requirement boilerplates.",
                    "RiTHM: a tool for enabling time-triggered runtime verification for C programs.",
                    "PoMMaDe: pushdown model-checking for malware detection.",
                    "RADA: a tool for reasoning about algebraic data types with abstractions.",
                    "Jalangi: a tool framework for concolic testing, selective record-replay, and dynamic analysis of JavaScript.",
                    "RSA-MBT: a test tool for generating test artifacts based on models.",
                    "USMMC: a self-contained model checker for UML state machines.",
                    "Extracting URLs from JavaScript via program analysis.",
                    "Data debugging with continuous testing.",
                    "Iterative test suites refinement for elastic computing systems.",
                    "Using fault history to improve mutation reduction.",
                    "A cost-effectiveness criterion for applying software defect prediction models.",
                    "BugMap: a topographic map of bugs.",
                    "Lexical statistical machine translation for language migration.",
                    "Code fragment summarization.",
                    "Understanding gamification mechanisms for software development.",
                    "Toward understanding the causes of unanswered questions in software information sites: a case study of stack overflow.",
                    "Where is the business logic?",
                    "Towards emotional awareness in software development teams.",
                    "Precise range analysis on large industry code.",
                    "Agreements for software reuse in corporations.",
                    "Good technology makes the difficult task easy.",
                    "ShAir: extensible middleware for mobile peer-to-peer resource sharing.",
                    "Risky files: an approach to focus quality improvement effort.",
                    "System reliability calculation based on the run-time analysis of ladder program.",
                    "h-ubu: an industrial-strength service-oriented component framework for JavaScript applications.",
                    "Design and optimization of multi-clocked embedded systems using formal technique.",
                    "The economics of static analysis tools.",
                    "Automatically describing software faults.",
                    "Fuzzy service matching in on-the-fly computing.",
                    "PHRT: a model and programmable tool for hardware reengineering automation.",
                    "Using topic models to understand the evolution of a software ecosystem.",
                    "Automotive architecture description and its quality.",
                    "Towards open architecture system.",
                    "A framework for defining the dynamic semantics of DSLs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th SIGSOFT FSE 2012",
        "info": "Cary, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2012",
                "sub_name": "20th ACM SIGSOFT Symposium on the Foundations of Software Engineering (FSE-20), SIGSOFT/FSE'12, Cary, NC, USA - November 11 - 16, 2012.",
                "count": 59,
                "papers": [
                    "Testing mined specifications.",
                    "Detecting and analyzing insecure component usage.",
                    "Retargeting Android applications to Java bytecode.",
                    "SelfMotion: a declarative language for adaptive service-oriented mobile apps.",
                    "REPERTOIRE: a cross-system porting analysis tool for forked software projects.",
                    "Automating adaptive maintenance changes with SrcML and LINQ.",
                    "Searching connected API subgraph via text phrases.",
                    "AUSUM: approach for unsupervised bug report summarization.",
                    "Automated extraction of security policies from natural-language software documents.",
                    "Practical change impact analysis based on static program slicing for industrial software systems.",
                    "MayPar: a may-happen-in-parallel analyzer for concurrent objects.",
                    "Sando: an extensible local code search framework.",
                    "Automating presentation changes in dynamic web applications via collaborative hybrid analysis.",
                    "Mining the execution history of a software system to infer the best time for its adaptation.",
                    "SecuriTAS: a tool for engineering adaptive security.",
                    "Dione: an integrated measurement and defect prediction solution.",
                    "Dealing with uncertainty in early software architecture.",
                    "Software change contracts.",
                    "Semantic fault diagnosis: automatic natural-language fault descriptions.",
                    "Toward measuring program comprehension with functional magnetic resonance imaging.",
                    "Toward semantic search via SMT solver.",
                    "Inference and checking of context-sensitive pluggable types.",
                    "Scalable malware clustering through coarse-grained behavior modeling.",
                    "Has this bug been reported?",
                    "Concept-based failure clustering.",
                    "Seeing the forest and the trees: focusing team interaction on value and effort drivers.",
                    "From pixels to bytes: evolutionary scenario based design with video.",
                    "Service selection for happy users: making user-intuitive quality abstractions.",
                    "Understanding myths and realities of test-suite evolution.",
                    "Test input generation using dynamic programming.",
                    "CarFast: achieving higher statement coverage faster.",
                    "Scalable test data generation from multidimensional models.",
                    "UMLtoCSP (UOST): a tool for efficient verification of UML/OCL class diagrams through model slicing.",
                    "ReImInfer: method purity inference for Java.",
                    "TouchDevelop: app development on mobile devices.",
                    "FaultTracer: a change impact and regression fault analysis tool for evolving Java programs.",
                    "Efficiently scripting change-resilient tests.",
                    "Improving software developers' fluency by recommending development environment commands.",
                    "History slicing: assisting code-evolution tasks.",
                    "Who is going to mentor newcomers in open source projects?",
                    "Assessing the value of branches with what-if analysis.",
                    "DTAM: dynamic taint analysis of multi-threaded programs for relevancy.",
                    "Predicting null-pointer dereferences in concurrent programs.",
                    "Asynchronous programs with prioritized task-buffers.",
                    "Do crosscutting concerns cause modularity problems?",
                    "A field study of refactoring challenges and benefits.",
                    "How do software engineers understand code changes?: an exploratory study in industry.",
                    "Variability points and design pattern usage in architectural tactics.",
                    "A case study of cross-system porting in forked projects.",
                    "How do developers use parallel libraries?",
                    "Seeking the ground truth: a retroactive study on the evolution and migration of software libraries.",
                    "How do developers react to API deprecation?: the case of a smalltalk ecosystem.",
                    "Conditional model checking: a technique to pass information between verifiers.",
                    "Green: reducing, reusing and recycling constraints in program analysis.",
                    "Automated concolic testing of smartphone apps.",
                    "Rubicon: bounded verification of web applications.",
                    "Recalling the \"imprecision\" of cross-project defect prediction.",
                    "An industrial study on the risk of software changes.",
                    "Multi-layered approach for recovering links between bug reports and fixes."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th SIGSOFT FSE / 13th ESEC 2011",
        "info": "Szeged, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2011",
                "sub_name": "SIGSOFT/FSE'11 19th ACM SIGSOFT Symposium on the Foundations of Software Engineering (FSE-19) and ESEC'11: 13th European Software Engineering Conference (ESEC-13), Szeged, Hungary, September 5-9, 2011.",
                "count": 77,
                "papers": [
                    "Building advanced mechatronic systems.",
                    "Software architecture: reflections on an evolving discipline.",
                    "ELI-ALPS: the ultrafast challenges in Hungary.",
                    "Don't touch my code!: examining the effects of ownership on software quality.",
                    "ReLink: recovering links between bugs and changes.",
                    "How do fixes become bugs?",
                    "CSSL: a logic for specifying conditional scenarios.",
                    "Using an SMT solver for interactive requirements prioritization.",
                    "Modeling the HTML DOM and browser API in static analysis of JavaScript web applications.",
                    "The onion patch: migration in open source ecosystems.",
                    "Does adding manpower also affect quality?: an empirical, longitudinal analysis.",
                    "Effective communication of software development knowledge through community portals.",
                    "Proving programs robust.",
                    "Checking conformance of a producer and a consumer.",
                    "Managing performance vs. accuracy trade-offs with loop perforation.",
                    "Partial replay of long-running applications.",
                    "Mitigating the confounding effects of program dependences for effective fault localization.",
                    "Fault localization for data-centric programs.",
                    "Proactive detection of collaboration conflicts.",
                    "ADDiff: semantic differencing for activity diagrams.",
                    "Semistructured merge: rethinking merge in revision control systems.",
                    "Testing software in age of data privacy: a balancing act.",
                    "Strong higher order mutation-based test data generation.",
                    "Improved multithreaded unit testing.",
                    "Taming uncertainty in self-adaptive software.",
                    "Version-consistent dynamic reconfiguration of component-based distributed systems.",
                    "On software component co-installability.",
                    "Leveraging existing instrumentation to automatically infer invariant-constrained models.",
                    "Path exploration based on symbolic output.",
                    "Synthesizing data structure manipulations from storyboards.",
                    "High-impact defects: a study of breakage and surprise defects.",
                    "Micro interaction metrics for defect prediction.",
                    "BugCache for inspections: hit or miss?",
                    "Inferring data polymorphism in systems code.",
                    "Boosting the performance of flow-sensitive points-to analysis using value flow.",
                    "On the congruence of modularity and code coupling.",
                    "Fuzzy set and cache-based approach for bug triaging.",
                    "Mining development repositories to study the impact of collaboration on software systems.",
                    "Reputation-based self-management of software process artifact quality in consortium research projects.",
                    "An architecture-centric approach for goal-driven requirements elicitation.",
                    "Experimental specification mining for enterprise applications.",
                    "Search based hierarchy generation for reverse engineered state machines.",
                    "Automatic test suite evolution.",
                    "Automatic structural testing with abstraction refinement and coarsening.",
                    "Understanding failures through facts.",
                    "QoS verification and model tuning @ runtime.",
                    "A software lifecycle process for context-aware adaptive systems.",
                    "EvoSuite: automatic test suite generation for object-oriented software.",
                    "SCORE: a scalable concolic testing tool for reliable embedded software.",
                    "SMutant: a tool for type-sensitive mutation testing in a dynamic language.",
                    "jStar-eclipse: an IDE for automated verification of Java programs.",
                    "Static deep error checking in large system applications using parfait.",
                    "Querypoint: moving backwards on wrong values in the buggy execution.",
                    "Sydit: creating and applying a program transformation from an example.",
                    "Crystal: precise and unobtrusive conflict warnings.",
                    "Synoptic: studying logged behavior with inferred models.",
                    "Cross-layer modeler: a tool for flexible multilevel modeling with consistency checking.",
                    "Tool support for UML-based specification and verification of role-based access control properties.",
                    "SafeSlice: a model slicing and design safety inspection tool for SysML.",
                    "Design and validation of feature-based process model tailoring: a sample implementation of PDE.",
                    "PSPWizard: machine-assisted definition of temporal logical properties with specification patterns.",
                    "Using social media to study the diversity of example usage among professional developers.",
                    "Social sensing: when users become monitors.",
                    "Cross-library API recommendation using web search engines.",
                    "Exploiting software architecture to support requirements satisfaction testing.",
                    "EAGLE: engineering software in the ubiquitous globe by leveraging uncErtainty.",
                    "Stateful breakpoints: a practical approach to defining parameterized runtime monitors.",
                    "Finding bugs by isolating unit tests.",
                    "Inferring test results for dynamic software product lines.",
                    "New ideas track: testing mapreduce-style programs.",
                    "Join point interfaces for modular reasoning in aspect-oriented programs.",
                    "Probabilistic dataflow analysis using path profiles on structure graphs.",
                    "Workshop on assurances for self-adaptive systems (ASAS 2011).",
                    "IWPSE-EVOL 2011: 12th international workshop on principles on software evolution and 7th ERCIM workshop on software evolution.",
                    "PASTE'11: Proceedings of the 10th ACM sigplan-sigsoft workshop on program analysis for software tools and engineering.",
                    "The 4th international workshop on social software engineering (SSE'11).",
                    "8th international workshop on software quality (WoSQ)."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th SIGSOFT FSE 2010",
        "info": "Santa Fe, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2010",
                "sub_name": "Proceedings of the 18th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2010, Santa Fe, NM, USA, November 7-11, 2010.",
                "count": 55,
                "papers": [
                    "Supercomputing in biology: towards understanding living systems in atomic detail.",
                    "Big data, global development, and complex social systems.",
                    "Avoiding the classic catastrophic computer science failure mode: 2010 acm sigsoft outstanding research award talk.",
                    "FUSION: a framework for engineering self-tuning self-adaptive software systems.",
                    "Finding latent performance bugs in systems implementations.",
                    "Realizability analysis for message-based interactions using shared-state projections.",
                    "PENELOPE: weaving threads to expose atomicity violations.",
                    "Staged concurrent program analysis.",
                    "A trace simplification technique for effective debugging of concurrent programs.",
                    "Combining hardware and software instrumentation to classify program executions.",
                    "Synthesis of live behaviour models.",
                    "Locating need-to-translate constant strings in web applications.",
                    "The missing links: bugs and bug-fix commits.",
                    "Evolution of a bluetooth test application product line: a case study.",
                    "Organizational volatility and its effects on software defects.",
                    "Creating and evolving developer documentation: understanding the decisions of open source contributors.",
                    "Developer fluency: achieving true mastery in software projects.",
                    "A study of the uniqueness of source code.",
                    "Leveraging usage similarity for effective retrieval of examples in code repositories.",
                    "Instant code clone search.",
                    "Golden implementation driven software debugging.",
                    "Scalable SMT-based verification of GPU kernel functions.",
                    "Language-based replay via data flow cut.",
                    "LEAP: lightweight deterministic multi-processor replay of concurrent java programs.",
                    "Memory indexing: canonicalizing addresses across executions.",
                    "Change-point detection for black-box services.",
                    "Automatic workarounds for web applications.",
                    "Guided recovery for web service applications.",
                    "Directed test suite augmentation: techniques and tradeoffs.",
                    "An enhanced test case selection approach for model-based testing: an industrial case study.",
                    "Representation dependence testing using program inversion.",
                    "Field-sensitive program dependence analysis.",
                    "DSketch: lightweight, adaptable dependency analysis.",
                    "Path-based fault correlations.",
                    "Practical and effective symbolic analysis for buffer overflow detection.",
                    "An effective dynamic analysis for detecting generalized deadlocks.",
                    "Updating requirements from tests during maintenance and evolution.",
                    "From requirements to partial behavior models: an iterative approach to incremental specification refinement.",
                    "A learning-based approach for engineering feature-oriented self-adaptive software systems.",
                    "Towards behavior elaboration and synthesis using modes.",
                    "A study of applying a research prototype tool in industrial practice.",
                    "Generating integration test cases automatically.",
                    "BERT: a tool for behavioral regression testing.",
                    "Basset: a tool for systematic testing of actor programs.",
                    "Analyzing hierarchical complex real-time systems.",
                    "Using dynamic analysis to create trace-focused user interfaces for IDEs.",
                    "LINKSTER: enabling efficient manual inspection and annotation of mined data.",
                    "Ref-Finder: a refactoring reconstruction tool based on logic query templates.",
                    "Phantm: PHP analyzer for type mismatch.",
                    "Building and using pluggable type systems.",
                    "RT-simex: retro-analysis of execution traces.",
                    "HI-C: diagnosing object churn in framework-based applications.",
                    "WhoselsThat: finding software engineers with codebook.",
                    "iMuse: interactive model-based use-case and storytelling environment.",
                    "LEAP: lightweight deterministic multi-processor replay of concurrent java programs."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2010foser",
                "sub_name": "Proceedings of the Workshop on Future of Software Engineering Research, FoSER 2010, at the 18th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2010, Santa Fe, NM, USA, November 7-11, 2010.",
                "count": 89,
                "papers": [
                    "Embracing ambiguity.",
                    "Software economies.",
                    "Why haven't we automated programming.",
                    "The disappearing boundary between development-time and run-time.",
                    "On the shoulders of giants.",
                    "Thoughts on automated software design and synthesis.",
                    "Social media for software engineering.",
                    "Extending software engineering research outside the digital box.",
                    "A benchmark- and competition-based approach to software engineering research.",
                    "Managing technical debt in software-reliant systems.",
                    "IDE 2.0: collective intelligence in software development.",
                    "Speculative analysis: exploring future development states of software.",
                    "Domain-specific software engineering.",
                    "Software for everyone by everyone.",
                    "The future of software engineering: enhancing human expertise in tackling software quality.",
                    "Analytics for software development.",
                    "Multiplicity computing: a vision of software engineering for next-generation computing platform applications.",
                    "Supporting human-intensive systems.",
                    "Unifying verification and validation techniques: relating behavior and properties through partial evidence.",
                    "Climate change: a grand software challenge.",
                    "Program fields for continuous software.",
                    "Embracing policy engineering.",
                    "Latent risks and dangers in the state of climate model software development.",
                    "Software engineering as live performance.",
                    "Ad-opera: music-inspired self-adaptive systems.",
                    "Software engineering in an uncertain world.",
                    "Lawful software engineering.",
                    "Software assurance for systems of systems.",
                    "Top ten ways to make formal methods for HPC practical.",
                    "Advancing software architecture modeling for large scale heterogeneous systems.",
                    "Bridging gaps between developers and testers in globally-distributed software development.",
                    "Minding the (semantic) gap: engineering programming language theory.",
                    "N-version programming in WCET analysis: revisiting a discredited idea.",
                    "Software intelligence: the future of mining software engineering data.",
                    "The case for end-user programming of ubiquitous computing environments.",
                    "Separation of concerns for dependable software design.",
                    "Software development is program transformation.",
                    "Maturity is also about the capability to conform the process to the right context!",
                    "The metropolis model and its implications for the engineering of software ecosystems.",
                    "Evidence-based software production.",
                    "Designing for incentives: better information sharing for better software engineering.",
                    "Differential static analysis: opportunities, applications, and challenges.",
                    "The case for software evolution.",
                    "The future of library specification.",
                    "An agenda for concern-oriented software engineering.",
                    "Towards predictive models of technology impact on software design productivity.",
                    "Software is data too.",
                    "Infringo ergo sum: when will software engineering support infringements?",
                    "Community-based, collaborative testing and analysis.",
                    "The mashware challenge: bridging the gap between web development and software engineering.",
                    "Human-centric software engineering.",
                    "Understanding context: creating a lasting impact in experimental software engineering research.",
                    "Needed foundations for assuring the desirable behavior of software-reliant systems.",
                    "Monitoring, analysis, and testing of deployed software.",
                    "Supporting negotiation and dispute resolution with computing and communication technologies.",
                    "Software testing research and software engineering education.",
                    "Integrating participatory sensing in application development practices.",
                    "Software engineering and wireless sensor networks: happy marriage or consensual divorce?",
                    "Evidence-based validation and improvement of electronic health record systems.",
                    "Building scalable software systems in the multicore era.",
                    "Writing and using program specifications.",
                    "Requirements engineering at the margins: avoiding technological hubris through alternative approaches.",
                    "The last mile: parallel programming and usability.",
                    "The future of research in free/open source software development.",
                    "Engineering self-coordinating software intensive systems.",
                    "Rethinking the economics of software engineering.",
                    "Towards software health management with bayesian networks.",
                    "Research toward an engineering discipline for software.",
                    "Language-based verification will change the world.",
                    "Bayesian reasoning for software testing.",
                    "Derivational software engineering.",
                    "The impact of social media on software engineering practices and tools.",
                    "An ultra-large-scale systems approach to national-scale health information systems.",
                    "Opportunity-centered software development.",
                    "Enabling innovation: a choice for software engineering.",
                    "Text to software: developing tools to close the gaps in software engineering.",
                    "Packaging and prioritizing software engineering research to maximize industry impact.",
                    "Return to the language forrest: the case for DSL oriented software engineering.",
                    "Static analysis for software assurance: soundness, scalability and adaptiveness.",
                    "Software engineering issues for mobile application development.",
                    "FITE: future integrated testing environment.",
                    "R&D challenges and emerging solutions for multicore deployment/configuration optimization.",
                    "Validity concerns in software engineering research.",
                    "Future of developer testing: building quality in code.",
                    "Software bloat analysis: finding, removing, and preventing performance problems in modern large-scale object-oriented applications.",
                    "Entropy and software systems: towards an information-theoretic foundation of software testing.",
                    "Through the looking glass of immaterial labor.",
                    "Sharing what we know about software engineering.",
                    "Growth of newcomer competence: challenges of globalization."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th SIGSOFT FSE / 12th ESEC 2009",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2009",
                "sub_name": "Proceedings of the 7th joint meeting of the European Software Engineering Conference and the ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2009, Amsterdam, The Netherlands, August 24-28, 2009.",
                "count": 53,
                "papers": [
                    "The challenge of pervasive software to the conventional wisdom of software engineering.",
                    "Asserting and checking determinism for multithreaded programs.",
                    "Static data race detection for concurrent programs with asynchronous calls.",
                    "Symbolic pruning of concurrent program executions.",
                    "Darwin: an approach for debugging evolving programs.",
                    "Capturing propagation of infected program states.",
                    "Saturation-based testing of concurrent programs.",
                    "The massification and webification of systems' modeling and simulation with virtual worlds.",
                    "Backward-compatible constant-time exception-protected memory.",
                    "Automated security testing of web widget interactions.",
                    "Cross-project defect prediction: a large scale experiment on data vs. domain vs. process.",
                    "On the relationship between process maturity and geographic distribution: an empirical analysis of their impact on software quality.",
                    "Improving bug triage with bug tossing graphs.",
                    "Fair and balanced?: bias in bug-fix datasets.",
                    "Qos-driven runtime adaptation of service oriented architectures.",
                    "Automatic synthesis of behavior protocols for composable web-services.",
                    "Data flow testing of service choreography.",
                    "Whitening SOA testing.",
                    "IQ routes and HD traffic: technology insights about tomtom's time-dynamic navigation concept.",
                    "Refactoring for reentrancy.",
                    "Monitoring probabilistic properties.",
                    "MSeqGen: object-oriented unit-test generation via mining source code.",
                    "Api hyperlinking via structural overlap.",
                    "Learning from examples to improve code completion systems.",
                    "Improving slice accuracy by compression of data and control flow paths.",
                    "Insights from expert software design practice.",
                    "Fitting the pieces together: a machine-checked model of safe composition.",
                    "Ensuring interoperable service-oriented systems through engineered self-healing.",
                    "Debugging debugging: acm sigsoft impact paper award keynote.",
                    "Facilitating software refactoring with appropriate resolution order of bad smells.",
                    "Software change dynamics: evidence from 35 java projects.",
                    "Practical framework constraints.",
                    "Evaluating recovery aware components for grid reliability.",
                    "Towards accurate probabilistic models using state refinement.",
                    "Verification and performance evaluation of aadl models.",
                    "Reo2MC: a tool chain for performance analysis of coordination models.",
                    "Smart views for analyzing problem reports: tool demo.",
                    "SCA: a semantic conflict analyzer for parallel changes.",
                    "Test case comparison and clustering using program profiles and static execution.",
                    "ReCrashJ: a tool for capturing and reproducing program crashes in deployed applications.",
                    "Javalanche: efficient mutation testing for Java.",
                    "ConcernMorph: metrics-based detection of crosscutting patterns.",
                    "Srijan: a graphical toolkit for sensor network macroprogramming.",
                    "Software architecture: many faces, many places, yet a central discipline.",
                    "Synthesizing partial component-level behavior models from system specifications.",
                    "Supporting automatic model inconsistency fixing.",
                    "Behavioral automata composition for automatic topology independent verification of parameterized systems.",
                    "Probabilistic environments in the quantitative analysis of (non-probabilistic) behaviour models.",
                    "Automatic steering of behavioral model inference.",
                    "Sireum/Topi LDP: a lightweight semi-decision procedure for optimizing symbolic execution-based analyses.",
                    "Engineering search computing applications: vision and challenges.",
                    "DebugAdvisor: a recommender system for debugging.",
                    "Graph-based mining of multiple object usage patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2009casta",
                "sub_name": "Proceedings of the first international workshop on Context-aware software technology and applications, CASTA@ESEC/SIGSOFT FSE 2009, Amsterdam, The Netherlands, August 24, 2009.",
                "count": 9,
                "papers": [
                    "Towards context-aware components.",
                    "Orchestrating context-aware systems: a design perspective.",
                    "Automizing home environments and supervising patients at home with the hydra middleware: application scenarios using the hydra middleware for embedded systems.",
                    "The practical uses of TransLucid.",
                    "A formal model and composition language for context-aware service protocols.",
                    "Safe reflection through polymorphism.",
                    "On modeling, collecting and utilizing context information for disaster responses in pervasive environments.",
                    "Context modeling and constraints binding in web service business processes.",
                    "Using user context for accessing IT resources."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th SIGSOFT FSE 2008",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2008",
                "sub_name": "Proceedings of the 16th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2008, Atlanta, Georgia, USA, November 9-14, 2008.",
                "count": 35,
                "papers": [
                    "A design-centric view of the economy: abstract.",
                    "Can developer-module networks predict failures?",
                    "Predicting failures with developer networks and social network analysis.",
                    "Latent social structure in open source projects.",
                    "Finding programming errors earlier by evaluating runtime monitors ahead-of-time.",
                    "Profile-guided program simplification for effective testing and analysis.",
                    "A scalable technique for characterizing the usage of temporaries in framework-intensive Java applications.",
                    "An empirical study of the effect of time constraints on the cost-benefits of regression testing.",
                    "Deriving input syntactic structure from execution.",
                    "Inter-context control-flow and data-flow test adequacy criteria for nesC applications.",
                    "The implications of method placement on API learnability.",
                    "Empirical evidence of the benefits of workspace awareness in software configuration management.",
                    "Using assertions to help end-user programmers create dependable web macros.",
                    "Randomized active atomicity violation detection in concurrent programs.",
                    "Generation of concurrency control code using discrete-event systems theory.",
                    "Alchemy: transmuting base alloy specifications into implementations.",
                    "Efficient online monitoring of web-service SLAs.",
                    "Automated identification of parameter mismatches in web applications.",
                    "Modular verification of web services using efficient symbolic encoding and summarization.",
                    "Automatically locating framework extension examples.",
                    "Semi-automating small-scale source code reuse via structural correspondence.",
                    "Differential symbolic execution.",
                    "Requirements engineering: from craft to discipline.",
                    "Effective blame for information-flow violations.",
                    "Model-based fault detection in context-aware adaptive applications.",
                    "Marple: a demand-driven path-sensitive buffer overflow detector.",
                    "Dev 2.0: model driven development in the cloud.",
                    "ACM SIGSOFT impact paper award: reflections and prospects.",
                    "Towards compositional synthesis of evolving systems.",
                    "On correct and complete strong merging of partial behaviour models.",
                    "What makes a good bug report?",
                    "Experience in using a process language to define scientific workflow and generate dataset provenance.",
                    "ENNA: software effort estimation using ensemble of neural networks with associative memory.",
                    "Javert: fully automatic mining of general temporal properties from dynamic traces.",
                    "Doloto: code splitting for network-bound web 2.0 applications."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th SIGSOFT FSE / 11th ESEC 2007",
        "info": "Dubrovnik, Croatia",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2007",
                "sub_name": "Proceedings of the 6th joint meeting of the European Software Engineering Conference and the ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2007, Dubrovnik, Croatia, September 3-7, 2007.",
                "count": 88,
                "papers": [
                    "Pervasive computers and the GRID: the birth of a computational exoskeleton for augmented reality.",
                    "Mining specifications of malicious behavior.",
                    "Recommending random walks.",
                    "Mining API patterns as partial orders from source code: from usage scenarios to specifications.",
                    "Detecting object usage anomalies.",
                    "Which warnings should I fix first?",
                    "Context-based detection of clone-related bugs.",
                    "Programming asynchronous layers with CLARITY.",
                    "Object and reference immutability using java generics.",
                    "Efficient checkpointing of java software using context-sensitive capture and replay.",
                    "Recovering and using use-case-diagram-to-source-code traceability links.",
                    "Bi-objective release planning for evolving software systems.",
                    "An end-to-end industrial software traceability tool.",
                    "Globally distributed software development project performance: an empirical analysis.",
                    "Parallel test generation and execution with Korat.",
                    "Improving test case generation for web applications using automated interface discovery.",
                    "The impact of input domain reduction on search-based test data generation.",
                    "Determining detailed structural correspondence for generalization tasks.",
                    "Beyond refactoring: a framework for modular maintenance of crosscutting design idioms.",
                    "Automated testing of refactoring engines.",
                    "Finding bugs efficiently with a SAT solver.",
                    "RELAY: static race detection on millions of lines of code.",
                    "Detecting large number of infeasible paths through recognizing their patterns.",
                    "Model checking service compositions under resource constraints.",
                    "Detection and resolution of atomicity violation in service composition.",
                    "Automatic consistency assessment for query results in dynamic environments.",
                    "From representations to computations: the evolution of web architectures.",
                    "Reconciling software configuration management and product data management.",
                    "Symbolic message sequence charts.",
                    "Model transformation in the large.",
                    "Difference computation of large models.",
                    "Software engineering research: from cradle to grave.",
                    "The symmetry of the past and of the future: bi-infinite time in the verification of temporal properties.",
                    "State space exploration using feedback constraint generation and Monte-Carlo sampling.",
                    "Automated size analysis for OCL.",
                    "Does a programmer's activity indicate knowledge of code?",
                    "A socio-technical framework for supporting programmers.",
                    "Program comprehension as fact finding.",
                    "The work of Dean Rosenzweig: a tribute to a scientist and an innovator.",
                    "A framework for characterization and analysis of software system scalability.",
                    "An empirical study on the evolution of design patterns.",
                    "Measuring empirical computational complexity.",
                    "Training on errors experiment to detect fault-prone software modules by spam filter.",
                    "CTG: a connectivity trace generator for testing the performance of opportunistic mobile systems.",
                    "Contract driven development = test driven development - writing test cases.",
                    "Foreword to state-of-the-art presentations.",
                    "On marrying ontological and metamodeling technical spaces.",
                    "Quantitative verification: models techniques and tools.",
                    "Free/open source software development.",
                    "Welcome to the WISE track.",
                    "Practicum in software project management: an endeavor to effective and pragmatic software project management education.",
                    "A survey of web engineering practice in small Jordanian web development firms.",
                    "Building a research university ecosystem: the case of software engineering education at Sofia University.",
                    "Exploring motivational differences between software developers and project managers.",
                    "Product integration improvement based on analysis of build statistics.",
                    "A case study in assessing and improving capacity using an anatomy of good practice.",
                    "Efficient token based clone detection with flexible tokenization.",
                    "A segment-based approach for reconcilable model transformation.",
                    "A behavioural model for product families.",
                    "A specification-based approach to testing software product lines.",
                    "A profile-driven statistical analysis framework for the design optimization of soft real-time applications.",
                    "A study of interleaving coverage criteria.",
                    "An iterative, multi-level, and scalable approach to comparing execution traces.",
                    "State coverage: a structural test adequacy criterion for behavior checking.",
                    "Quantifying the effectiveness of testing via efficient residual path profiling.",
                    "Differential testing: a new approach to change detection.",
                    "Directed test generation using symbolic grammars.",
                    "Towards incremental adaptive covering arrays.",
                    "Predictive testing: amplifying the effectiveness of software testing.",
                    "Using groupings of static analysis alerts to identify files likely to contain field failures.",
                    "On impact-oriented automatic resolution of pervasive context inconsistency.",
                    "Foreword to the doctoral symposium.",
                    "Visualising exemplary program values.",
                    "An analysis of developers' tasks using low-level, automatically collected data.",
                    "Composition and tradeoff of non-functional attributes in software systems: research directions.",
                    "Model-driven test-case construction.",
                    "SLEDE: lightweight verification of sensor network security protocol implementations.",
                    "Analysis of a deployed software.",
                    "Component airbag: a novel approach to develop dependable component-based applications.",
                    "A model-driven approach to generating user interfaces.",
                    "Syanco 2007: international workshop on synthesis and analysis of component connectors.",
                    "Specification and verification of component-based systems 2007.",
                    "IWPSE 2007: 9th international workshop on principles of software evolution.",
                    "2nd international workshop on service oriented software engineering (IW-SOSWE 2007).",
                    "SOQUA 2007: 4th international workshop on software quality assurance.",
                    "EFTS 2007: the 2nd international workshop on engineering fault tolerant systems.",
                    "Engineering software services for pervasive environments.",
                    "Domain specific approaches to software test automation."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007efts",
                "sub_name": "Proceedings of the 2007 Workshop on Engineering Fault Tolerant Systems, EFTS 2007, Dubrovnik, Croatia, September 4, 2007.",
                "count": 10,
                "papers": [
                    "Formal modeling of BPEL workflows including fault and compensation handling.",
                    "Towards fault tolerance in web services compositions.",
                    "Diagnosis service for embedded software component based systems.",
                    "On engineering standards based carrier grade platforms.",
                    "Experimenting with diversity in the model driven development of a railway signaling system.",
                    "Fault-tolerant digital systems implemented with partially definite and partially correct automata.",
                    "Fault and adversary tolerance as an emergent property of distributed systems' software architectures.",
                    "Scheduling of embedded time-triggered systems.",
                    "Evaluating fault-tolerant system designs using FAUmachine.",
                    "Refinement patterns for rapid development of dependable systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007dosta",
                "sub_name": "Proceedings of the 2007 Workshop on Domain Specific Approaches to Software Test Automation, DOSTA 2007, Dubrovnik, Croatia, September 4, 2007.",
                "count": 6,
                "papers": [
                    "Test suite prioritization by interaction coverage.",
                    "Automatic generation of test data generators for synchronous programs: Lutess V2.",
                    "Session-aware debugging features for web applications using Ruby and Python frameworks.",
                    "Program representations for testing wireless sensor network applications.",
                    "An experimental evaluation of approaches to feature testing in the mobile phone applications domain.",
                    "Profiling and testing within domains to facilitate document exchangeability."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007esspe",
                "sub_name": "Proceedings of the 2007 International Workshop on Engineering of Software Services for Pervasive Environments, ESSPE 2007, Dubrovnik, Croatia, September 4, 2007.",
                "count": 12,
                "papers": [
                    "Resource discovery with evolving tuples.",
                    "Self-healing BPEL processes with Dynamo and the JBoss rule engine.",
                    "A component model for dynamic adaptive systems.",
                    "A reuse-based approach to the correct and automatic composition of web-services.",
                    "Divide and conquer: scalability and variability for adaptive middleware.",
                    "Mobility management in B3G networks: a middleware-based approach.",
                    "Software deployment architecture and quality-of-service in pervasive environments.",
                    "Using proximity relations for the adaptation of mobile field services.",
                    "A basis for performance property prediction of ubiquitous self-adapting systems.",
                    "Scaling up SLA monitoring in pervasive environments.",
                    "Towards model driven design of service-based context-aware applications.",
                    "Engineering mobile field worker applications."
                ]
            },
            {
                "sub_name_abbr": "conf/soqua/2007",
                "sub_name": "Fourth International Workshop on Software Quality Assurance, SOQUA 2007, in conjunction with the 6th ESEC/FSE joint meeting, Dubrovnik, Croatia, September 3-4, 2007.",
                "count": 17,
                "papers": [
                    "Can self-healing software cope with loitering?",
                    "ConTest listeners: a concurrency-oriented infrastructure for Java test and heal tools.",
                    "An approach to detecting failures automatically.",
                    "How to measure success of fault prediction models.",
                    "Refactoring test suites versus test behaviour: a TTCN-3 perspective.",
                    "Toward a text classification system for the quality assessment of software requirements written in natural language.",
                    "Testing randomized software by means of statistical hypothesis tests.",
                    "Generating combinatorial test suite for interaction relationship.",
                    "Regression test suite reduction using extended dependence analysis.",
                    "Designing multi-layers self-adaptive complex applications.",
                    "Investigation of failure causes in workload-driven reliability testing.",
                    "Towards design for self-healing.",
                    "Towards the determination of typical failure patterns.",
                    "A component quality assurance process.",
                    "A theoretical evaluation for assessing the relevance of modeling techniques in business process modeling.",
                    "Evaluating variability modeling languages using a generic quality framework.",
                    "Faults' context matters."
                ]
            },
            {
                "sub_name_abbr": "conf/iwpse/2007",
                "sub_name": "9th International Workshop on Principles of Software Evolution (IWPSE 2007), in conjunction with the 6th ESEC/FSE joint meeting, Dubrovnik, Croatia, September 3-4, 2007.",
                "count": 21,
                "papers": [
                    "Requiem for software evolution research: a few steps toward the creative age.",
                    "How documentation evolves over time.",
                    "Improving defect prediction using temporal features and non linear models.",
                    "Learning from bug-introducing changes to prevent fault prone code.",
                    "Visual identification of software evolution patterns.",
                    "Assessing the impact of bad smells using historical information.",
                    "BugzillaMetrics: an adaptable tool for evaluating metric specifications on change requests.",
                    "Aggregating changes to efficiently check consistency.",
                    "Modification analysis support at the requirements level.",
                    "Talking tests: an empirical assessment of the role of fit acceptance tests in clarifying requirements.",
                    "Assessing the influence on processes when evolving the software architecture.",
                    "An evolutionary model of requirements correctness with early aspects.",
                    "Assessment of software system evolvability.",
                    "A deviation-tolerant approach to software process evolution.",
                    "Adapting the \"staged model for software evolution\" to free/libre/open source software.",
                    "Using concept analysis to detect co-change patterns.",
                    "Structural analysis and visualization of C++ code evolution using syntax trees.",
                    "Efficient recovery of algebraic specifications for stateful components.",
                    "A small observatory for super-repositories.",
                    "Improving context awareness in subversion through fine-grained versioning of Java code.",
                    "A tool to visualize behavior and design evolution."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007savcbs",
                "sub_name": "Proceedings of the 2007 Conference Specification and Verification of Component-Based Systems, SAVCBS 2007, Dubrovnik, Croatia, September 3-4, 2007.",
                "count": 14,
                "papers": [
                    "Effective verification of systems with a dynamic number of components.",
                    "Plan-directed architectural change for autonomous systems.",
                    "Reachability analysis for annotated code.",
                    "Faithful mapping of model classes to mathematical structures.",
                    "Proof-transforming compilation of programs with abrupt termination.",
                    "An integrated verification environment for JML: architecture and early results.",
                    "Playing with time in publish-subscribe using a domain-specific model checker.",
                    "On timed components and their abstraction.",
                    "Subject-observer specification with component-interaction automata.",
                    "Game-based safety checking with Mage.",
                    "Specification and verification of trustworthy component-based real-time reactive systems.",
                    "Components, objects, and contracts.",
                    "Compositional failure-based semantic equivalences for Reo specifications.",
                    "A concept for dynamic wiring of components: correctness in dynamic adaptive systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007syanco",
                "sub_name": "Proceedings of the International Workshop on Synthesis and Analysis of Component Connectors: in conjunction with the 6th ESEC/FSE joint meeting, SYANCO 2007, Dubrovnik, Croatia, September 3-4, 2007.",
                "count": 3,
                "papers": [
                    "Rethinking software connectors.",
                    "Aspect-oriented connectors for coordination.",
                    "A type-level approach to component prototyping."
                ]
            },
            {
                "sub_name_abbr": "conf/sigsoft/2007soswe",
                "sub_name": "Proceedings of the 2nd International Workshop on Service Oriented Software Engineering: in conjunction with the 6th ESEC/FSE joint meeting, IW-SOSWE 2007, Dubrovnik, Croatia, September 3, 2007.",
                "count": 8,
                "papers": [
                    "A stakeholder-driven service life cycle model for SOA.",
                    "Discovery of SOA patterns via model checking.",
                    "Monitoring conversational web services.",
                    "Towards recovering the broken SOA triangle: a software engineering perspective.",
                    "Efficient provisioning of service level agreements for service oriented applications.",
                    "Dynamic trust assessment of software services.",
                    "Monitoring the monitor: an approach towards trustworthiness in service oriented architecture.",
                    "A service-based infrastructure for advanced logistics."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th SIGSOFT FSE 2006",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2006",
                "sub_name": "Proceedings of the 14th ACM SIGSOFT International Symposium on Foundations of Software Engineering, FSE 2006, Portland, Oregon, USA, November 5-11, 2006.",
                "count": 25,
                "papers": [
                    "Using task context to improve programmer productivity.",
                    "Work experience versus refactoring to design patterns: a controlled experiment.",
                    "Questions programmers ask during software evolution tasks.",
                    "Memories of bug fixes.",
                    "Failure proximity: a fault localization-based approach.",
                    "Finding failure-inducing changes in java programs using change classification.",
                    "How is aliasing used in systems software?",
                    "Dynamic slicing long running programs through execution fast forwarding.",
                    "Controlling factors in evaluating path-sensitive error detection techniques.",
                    "Interpolation for data structures.",
                    "SYNERGY: a new algorithm for property checking.",
                    "Bit level types for high level reasoning.",
                    "An empirical study of regression testing techniques incorporating context and lifetime factors and improved cost-benefit models.",
                    "Exceptions and aspects: the devil is in the details.",
                    "Detecting increases in feature coupling using regression tests.",
                    "Using positive tainting and syntax-aware evaluation to counter SQL injection attacks.",
                    "Local analysis of atomicity sphere for B2B collaboration.",
                    "Scenarios, goals, and state machines: a win-win partnership for model synthesis.",
                    "User guidance for creating precise and accessible property specifications.",
                    "From multi-modal scenarios to code: compiling LSCs into aspectJ.",
                    "Simulation-based test adequacy criteria for distributed systems.",
                    "Testing context-aware middleware-centric programs: a data flow approach and an RFID-based experimentation.",
                    "Carving differential unit test cases from system test cases.",
                    "SMArTIC: towards building an accurate, robust and scalable specification miner.",
                    "Lightweight extraction of syntactic specifications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th SIGSOFT FSE / 10th ESEC 2005",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2005",
                "sub_name": "Proceedings of the 10th European Software Engineering Conference held jointly with 13th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2005, Lisbon, Portugal, September 5-9, 2005.",
                "count": 49,
                "papers": [
                    "The story of moose: an agile reengineering environment.",
                    "Automatic generation of suggestions for program investigation.",
                    "ASTEC: a new approach to refactoring C.",
                    "Permissive interfaces.",
                    "Reasoning about confidentiality at requirements engineering time.",
                    "Detecting and resolving semantic pathologies in UML sequence diagrams.",
                    "A case study on value-based requirements tracing.",
                    "Fluent temporal logic for discrete-time event-based models.",
                    "Towards a unified formal model for supporting mechanisms of dynamic component update.",
                    "Arithmetic program paths.",
                    "Moose: an agile reengineering environment.",
                    "Dynamically discovering architectures with DiscoTect.",
                    "HATARI: raising risk awareness.",
                    "CHARMY: an extensible tool for architectural analysis.",
                    "Context- and path-sensitive memory leak detection.",
                    "Performance data collection using a hybrid approach.",
                    "Summarizing application performance from a components perspective.",
                    "Applying classification techniques to remotely-collected program execution data.",
                    "Detecting higher-level similarity patterns in programs.",
                    "Information hiding interfaces for aspect-oriented design.",
                    "Innovations in pervasive computing.",
                    "Facilitating software evolution research with kenyon.",
                    "An empirical study of code clone genealogies.",
                    "Matching execution histories of program versions.",
                    "Relational analysis of algebraic datatypes.",
                    "Lightweight object specification with typestates.",
                    "Joining dataflow with predicates.",
                    "Strathcona example recommendation tool.",
                    "Parameterized unit tests with unit meister.",
                    "KenyaEclipse: learning to program in eclipse.",
                    "Visual tool for generative programming.",
                    "Parameterized unit tests.",
                    "CUTE: a concolic unit testing engine for C.",
                    "Online testing with model programs.",
                    "Engineering distributed software: a structural discipline.",
                    "SOBER: statistical model-based bug localization.",
                    "DynaMine: finding common error patterns by mining software revision histories.",
                    "PR-Miner: automatically extracting implicit programming rules and detecting violations in large software code.",
                    "Reuse and variability in large software applications.",
                    "Industrial experience with building a web portal product line using a lightweight, reactive approach.",
                    "Inconsistency detection and resolution for context-aware middleware support.",
                    "Anchoring and adjustment in software estimation.",
                    "Combining self-reported and automatic data to improve programming effort measurement.",
                    "Quantitative assessment of UML dynamic models.",
                    "Reengineering towards components using \"Reconn-exion\".",
                    "UPEX: user participation by example.",
                    "A refinement calculus for software components and architectures.",
                    "Utilizing verification and validation certificates to estimate software defect density.",
                    "Surveying the factors that influence maintainability: research design."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th SIGSOFT FSE 2004",
        "info": "Newport Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2004",
                "sub_name": "Proceedings of the 12th ACM SIGSOFT International Symposium on Foundations of Software Engineering, 2004, Newport Beach, CA, USA, October 31 - November 6, 2004.",
                "count": 28,
                "papers": [
                    "Is security engineering really just good software engineering?",
                    "Resolving uncertainties during trace analysis.",
                    "Automating comprehensive safety analysis of concurrent programs using verisoft and TXL.",
                    "Efficient incremental algorithms for dynamic detection of likely invariants.",
                    "System architecture: the context for scenario-based model synthesis.",
                    "Merging partial behavioural models.",
                    "Reasoning about partial goal satisfaction for requirements and design engineering.",
                    "PSE: explaining program failures via postmortem static analysis.",
                    "Explaining abstract counterexamples.",
                    "Correlation exploitation in error ranking.",
                    "The usability problem for home appliances: engineers caused it, engineers can fix it!",
                    "Testing static analysis tools using exploitable buffer overflows from open source code.",
                    "Engineering human trust in mobile system collaborations.",
                    "An efficient and backwards-compatible transformation to ensure memory safety of C programs.",
                    "Variability management with feature-oriented programming and aspects.",
                    "Verifying aspect advice modularly.",
                    "A classification system and analysis for aspect-oriented programs.",
                    "Implementing protocols via declarative event patterns.",
                    "Making embedded software reuse practical and safe.",
                    "Modular design and verification of component-based mechatronic systems with online-reconfiguration.",
                    "A type system for object models.",
                    "Heuristic-guided counterexample search in FLAVERS.",
                    "Relevancy based semantic interoperation of reuse repositories.",
                    "How a good software practice thwarts collaboration: the multiple roles of APIs in software development.",
                    "Refining code-design mapping with flow analysis.",
                    "Scaling regression testing to large software systems.",
                    "Using an SQL coverage measurement for testing database applications.",
                    "Empirical evaluation of defect projection models for widely-deployed production software systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th SIGSOFT FSE / 9th ESEC 2003",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2003",
                "sub_name": "Proceedings of the 11th ACM SIGSOFT Symposium on Foundations of Software Engineering 2003 held jointly with 9th European Software Engineering Conference, ESEC/FSE 2003, Helsinki, Finland, September 1-5, 2003.",
                "count": 45,
                "papers": [
                    "Computer modelling and natural phenomena.",
                    "Understanding process and the quest for deeper questions in software engineering research.",
                    "Assessing software projects: tools for business owners.",
                    "Behaviour model elaboration using partial labelled transition systems.",
                    "A strategy for efficiently verifying requirements.",
                    "Towards the compositional verification of real-time UML designs.",
                    "Refinements and multi-dimensional separation of concerns.",
                    "Validating UML models against architectural profiles.",
                    "Modeling and validation of service-oriented architectures: application vs. style.",
                    "Evaluating and improving the automatic analysis of implicit invocation systems.",
                    "Designing and implementing a family of intrusion detection systems.",
                    "A family of test adequacy criteria for database-driven applications.",
                    "Consistency techniques for interprocedural test data generation.",
                    "Regression testing of GUIs.",
                    "Leveraging field data for impact analysis and regression testing.",
                    "Formulation and preliminary test of an empirical theory of coordination in software engineering.",
                    "Factors of software process improvement success in small and large organizations: an empirical study in the scandinavian context.",
                    "Monitoring the software test process using statistical process control: a logarithmic approach.",
                    "On the economic evaluation of XP projects.",
                    "Context-sensitive slicing of concurrent programs.",
                    "Adapting side effects analysis for modular program model checking.",
                    "Deadline analysis of interrupt-driven software.",
                    "Ontology support for web service processes.",
                    "Reverse engineering framework reuse interfaces.",
                    "Differences between versions of UML diagrams.",
                    "Eliminating redundancies with a \"composition with adaptation\" meta-programming technique.",
                    "Towards scalable compositional analysis by refactoring design models.",
                    "Fluent model checking for event-based systems.",
                    "Bogor: an extensible and highly-modular software model checking framework.",
                    "Verified systems by composition from verified components.",
                    "Predicting problems caused by component upgrades.",
                    "Eos: instance-level aspects for integrated system design.",
                    "Protecting C programs from attacks via invalid pointer dereferences.",
                    "Tracking pointers with path and context sensitivity for bug detection in C programs.",
                    "ARCHER: using symbolic, path-sensitive analysis to detect memory access errors.",
                    "Runtime safety analysis of multithreaded programs.",
                    "Composing architectural styles from architectural primitives.",
                    "Towards an engineering tool for implementing reusable distributed control systems.",
                    "Use case-based testing of product lines.",
                    "EFFICIENT: a tool set for supporting the modelling and validation of ebXML.",
                    "A simulation-based approach to software performance modeling.",
                    "Making sense of runtime architecture for mobile phone software.",
                    "Policy-enforced linking of untrusted components.",
                    "A fault-tolerant software architecture for COTS-based software systems.",
                    "Gravity: supporting dynamically available services in client-side applications."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th FSE 2002",
        "info": "Charleston, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2002",
                "sub_name": "Proceedings of the Tenth ACM SIGSOFT Symposium on Foundations of Software Engineering 2002, Charleston, South Carolina, USA, November 18-22, 2002.",
                "count": 18,
                "papers": [
                    "Isolating cause-effect chains from computer programs.",
                    "Invariant inference for static checking.",
                    "Egocentric context-aware programming in ad hoc mobile environments.",
                    "A micro-economic approach to conflict resolution in mobile computing.",
                    "Architectural primitives for distribution and mobility.",
                    "Using redundancies to find errors.",
                    "Searching for points-to analysis.",
                    "Improving program slicing with dynamic points-to data.",
                    "The logic of bugs.",
                    "Verifying cross-cutting features as open systems.",
                    "Supporting aggregation in fine grained software configuration management.",
                    "Negative scenarios for implied scenario elicitation.",
                    "Deriving operational software specifications from system goals.",
                    "Secure systems development based on the common criteria: the PalME project.",
                    "Model exploration with temporal logic query checking.",
                    "Composable semantics for model-based notations.",
                    "Containment units: a hierarchically composable architecture for adaptive systems.",
                    "Triggered message sequence charts."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th FSE / 8th ESEC 2001:\nVienna, Austria",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2001",
                "sub_name": "Proceedings of the 8th European Software Engineering Conference held jointly with 9th ACM SIGSOFT International Symposium on Foundations of Software Engineering 2001, Vienna, Austria, September 10-14, 2001.",
                "count": 46,
                "papers": [
                    "Taming architectural evolution.",
                    "An architectural style of product lines for distributed processing systems, and practical selection method.",
                    "A graph based architectural (Re)configuration language.",
                    "An architecture for flexible, evolvable process-driven user-guidance environments.",
                    "Deadlock detection in distribution object systems.",
                    "Increasing client-side confidence in remote component implementations.",
                    "A micromodularity mechanism.",
                    "Detecting implied scenarios in message sequence chart specifications.",
                    "A formal approach to the assessment and improvement of terminological models used in information systems engineering.",
                    "Using aspectC to improve the modularity of path-specific customization in operating system code.",
                    "The structure and value of modularity in software design.",
                    "Interface automata.",
                    "Automatic synthesis of deadlock free connectors for COM/DCOM applications.",
                    "A notation for problematic architecture interactions.",
                    "Using symbolic execution for verifying safety-critical systems.",
                    "Modular verification of collaboration-based software designs.",
                    "Automatic abstraction for model checking software systems with interrelated numeric constraints.",
                    "An algebraic approach to file synchronization.",
                    "A methodology for specifying and analyzing consistency of object-oriented behavioral models.",
                    "Combining UML and formal notations for modelling real-time systems.",
                    "WREN---an environment for component-based development.",
                    "Engineering component-based net-centric systems for embedded applications.",
                    "Behavioral contracts and behavioral subtyping.",
                    "Analysis of the constraint solver in UNA based test data generation.",
                    "Pursuing failure: the distribution of program failures in a profile space.",
                    "Coverage criteria for GUI testing.",
                    "An empirical study on the utility of formal routines to transfer knowledge and experience.",
                    "An industrial case study of implementing software risk management.",
                    "An empirical methodology for introducing software processes.",
                    "Component revision identification based on IDL/ADL component specification.",
                    "Modelling and managing software federations.",
                    "STG: a tool for generating symbolic test programs and oracles from operational specifications.",
                    "A formal data-model of the CORBA security service.",
                    "York: programming software components.",
                    "8th European workshop on software process technology: report and future directions.",
                    "Software architecture in a changing world: developing design strategies that anticipate change.",
                    "Component technologies: Java Beans, COM, CORBA, RMI, EJB and the CORBA Component Model.",
                    "Aspect-oriented programming.",
                    "Half day tutorial in methods of component-based software engineering essential concepts and classroom experience.",
                    "Adapting XP to complex application domains.",
                    "Engineering of Web services with XML and XSL.",
                    "EasyWinWin: a groupware-supported methodology for requirements negotiation.",
                    "Requirements-based product line engineering.",
                    "From use cases to code---rigorous software development with UML.",
                    "Peer-to-peer information systems: concepts and models, state-of-the-art, and future systems.",
                    "Fundamental concepts for practical software architecture."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th SIGSOFT FSE 2000",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/2000",
                "sub_name": "ACM SIGSOFT Symposium on Foundations of Software Engineering, an Diego, California, USA, November 6-10, 2000, Proceedings.",
                "count": 21,
                "papers": [
                    "Software development for next generation communication networks.",
                    "Designing robust Java programs with exceptions.",
                    "Experience report: using RESOLVE/C++ for commercial software.",
                    "The universe model: an approach for improving the modularity and reliability of concurrent programs.",
                    "Automated test oracles for GUIs.",
                    "Automated systematic testing for constraint-based interactive services.",
                    "Compiler and tool support for debugging object protocols.",
                    "Integrating active information delivery and reuse repository systems.",
                    "Implicit context: easing software evolution and reuse.",
                    "Bugs in the programs.",
                    "Accumulative versioning file system Moraine and its application to metrics environment MAME.",
                    "Coven: brewing better collaboration through software configuration management.",
                    "Extracting library-based object-oriented applications.",
                    "The impact project: determining the impact of software engineering research upon practice (panel session).",
                    "Composing features and resolving interactions.",
                    "A compositional approach to statecharts semantics.",
                    "Automating first-order relational logic.",
                    "On the formalization of architectural types with process algebras.",
                    "COM revisited: tool-assisted modelling of an architectural framework.",
                    "Classifying properties: an alternative to the safety-liveness classification.",
                    "The shape of things to come?"
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th SIGSOFT FSE / 7th ESEC 1999:\nToulouse, France",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/esec/1999",
                "sub_name": "Software Engineering - ESEC/FSE'99, 7th European Software Engineering Conference, Held Jointly with the 7th ACM SIGSOFT Symposium on the Foundations of Software Engineering, Toulouse, France, September 1999, Proceedings.",
                "count": 31,
                "papers": [
                    "Extreme Programming: A Discipline of Software Development.",
                    "Components and Generative Programming.",
                    "A Component and Communication Model for Push Systems.",
                    "A Fine-Grained Model for Code Mobility.",
                    "Robots: A Real-Time Systems Architectural Style.",
                    "Collaboration and Composition: Issues for a Second Generation Process Language.",
                    "Using UML for Software Process Modeling.",
                    "A Probabilistic Model for Software Projects.",
                    "Designing Specification Languages for Process Control Systems: Lessons Learned and Steps to the Future.",
                    "Using Model Checking to Generate Tests from Requirements Specifications.",
                    "Specification-Based Prototyping for Embedded Systems.",
                    "Coping with Type Casts in C.",
                    "Efficient Points-to Analysis for Whole-Program Analysis.",
                    "The Concept of Dynamic Analysis.",
                    "Data-Flow Analysis of Program Fragments.",
                    "Yesterday, My Program Worked. Today, It Does Not. Why?",
                    "Comparison Checking: An Approach to Avoid Debugging of Optimized Code.",
                    "Structural Specification-Based Testing: Automated Support and Experimental Evaluation.",
                    "An Efficient Relevant Slicing Method for Debugging.",
                    "Analyzing Exception Flow in Java Programs.",
                    "An Efficient Algorithm for Computing MHP Information for Concurrent Java Programs.",
                    "CoffeeStrainer: Statically-Checked Constraints on the Definition and Use of Types in Java.",
                    "The CIP Method: Component- and Model-Based Construction of Embedded Systems.",
                    "Algebraic Software Architecture Reconfiguration.",
                    "Consistency Checking for Multiple View Software Architectures.",
                    "Synergy between Component-Based and Generative Approaches.",
                    "Transitioning Legacy Assets to a Product Line Architecture.",
                    "CHIME: A Metadata-Based Distributed Software Development Environment.",
                    "FACADE: A Typed Intermediate Language Dedicated to Smart Cards.",
                    "Verification of Real-Time Designs: Combining Scheduling Theory with Automatic Formal Verification.",
                    "Checking Progress with Action Priority: Is it Fair?"
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th SIGSOFT FSE 1998",
        "info": "Lake Buena Vista, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1998",
                "sub_name": "Proceedings of the ACM SIGSOFT International Symposium on Foundations of Software Engineering, SIGSOFT 1998, Lake Buena Vista, Florida, USA, November 3-5, 1998.",
                "count": 24,
                "papers": [
                    "Customizaton and Compositon of Distributed Objects: Middleware Abstractions for Policy Management.",
                    "Pattern-Based Design Recovery of Java Software.",
                    "Systems Reengineering Patterns.",
                    "A Conservative Data Flow Algorithm for Detecting All Pairs of Statement That May Happen in Parallel.",
                    "Event-Base Detection of Concurrency.",
                    "Effective Whole-Program Analysis in the Presence of Pointers.",
                    "Automatic Generation of State Invariants from Requirements Specifications.",
                    "Formal Modeling and Analysis of the HLA Component Integration Standard.",
                    "On-Line Change Mechanisms.",
                    "Finding a History for Software Engineering.",
                    "Toward a Formal Theory of Extensible Software.",
                    "Reengineering Class Hierarchies Using Concept Analysis.",
                    "Applying Design Patterns to Decision Tree Learning System.",
                    "An Intermedicate Design Language and Its Analysis.",
                    "The Architecture of Montana: An Open and Extensible Programming Environment with an Incremental C++.",
                    "Investigation Data Quality Problems in the PSP.",
                    "Further Empirical Studies of Test Effectiveness.",
                    "Experiences in Improving Risk Management Processes Using the Concepts of the Riskit Method.",
                    "Model Checking of Hierarchical State Machines.",
                    "Filter-Based Model Checking of Partial Systems.",
                    "Software Engineering as a Profession: Industry and Academia Working Together.",
                    "Reasoning about Implicit Invocation.",
                    "Proof Linking: An Architecture for Modular Verification of Dynamically-Linked Mobile Code.",
                    "Automated Test Data Generation Using an Iterative Relaxation Method."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th SIGSOFT FSE / 6th ESEC 1997",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/esec/1997",
                "sub_name": "Software Engineering - ESEC/FSE '97, 6th European Software Engineering Conference Held Jointly with the 5th ACM SIGSOFT Symposium on Foundations of Software Engineering, Zurich, Switzerland, September 22-25, 1997, Proceedings.",
                "count": 39,
                "papers": [
                    "Software Engineering: An Unconsummated Marriage (Extended Abstract).",
                    "Subtypes for Specifications.",
                    "Developing Multimedia Applications with the WinWin Spiral Model.",
                    "What We Teach Software Engineers in the University: Do We Take Engineering Seriously?",
                    "What we Expect from Software Engineers in the Industry (Abstract).",
                    "Security Issues in Distributed Software.",
                    "A Framework for Classifying and Comparing Architecture Description Languages.",
                    "Applying Static Analysis to Software Architectures.",
                    "Making Design Patterns Explicit in FACE: A Frame Work Adaptive Composition Environment.",
                    "TTM15 - A Large Multi-Site Improvement Project.",
                    "Change Management Needs Integrated Process and Configuration Management.",
                    "The Design of a Next-Generation Process Language.",
                    "Software Release Management.",
                    "A Contextual Approach for Process-Integrated Tools.",
                    "Generic Fuzzy Reasoning Nets as a Basis for Reverse Engineering Relational Database Applications.",
                    "Providing Automated Support to Deductive Analysis of Time Critical Systems.",
                    "Verification of Liveness Properties Using Compositional Reachability Analysis.",
                    "Model Checking Graphical User Interfaces Using Abstractions.",
                    "Comparing and Combining Software Defect Detection Techniques: A Replicated Empirical Study.",
                    "Experiences with Criticality Predictions in Software Development.",
                    "Validating the Defect Detection Performance Advantage of Group Designs for Software Reviews: Report of a Laboratory Experiment Using Program Code.",
                    "Integration of Sequential Scenarios.",
                    "A View-Oriented Approach to System Modelling Based on Graph Transformation.",
                    "A Design Framework for Internet-Scale Event Observation and Notification.",
                    "Refining Data Flow Information Using Infeasible Paths.",
                    "Feasible Test Path Selection by Principal Slicing.",
                    "Cryptographic Verification of Test Coverage Claims.",
                    "A C++ Data Model Supporting Reachability Analysis and Dead Code Detection.",
                    "The Use of Program Profiling for Software Maintenance with Applications to the Year 2000 Problem.",
                    "Reduction and Slicing of Hierarchical State Machines.",
                    "A Pattern-Based Application Generator for Building Simulation.",
                    "Executable Connectors: Towards Reusable Design Elements.",
                    "Expressing Code Mobility in Mobile UNITY.",
                    "Incremental Development for AXE 10.",
                    "The Tale of Two Projects - Abstract.",
                    "Analysis of Software Architectures in High and Low Volume Electronic Systems, Industrial Experience Report.",
                    "Towards an Adaptation of the COCOMO Cost Model to the Software Measurement Theory.",
                    "Formalizing Software Architectures: An Industrial Experience.",
                    "Software Engineering - Old Problems, New Problems, and Unsolved Problems (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th SIGSOFT FSE 1996",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1996",
                "sub_name": "Proceedings of the Fourth ACM SIGSOFT Symposium on Foundations of Software Engineering, SIGSOFT1996, San Francisco, California, USA, October 16-18, 1996.",
                "count": 22,
                "papers": [
                    "Problems, Methods, and Structures (Abstract).",
                    "Engineering Bridges: From Concept to Reality (Abstract).",
                    "Software Systems Architecting (Abstract).",
                    "What Can Programming Languages Contribute to Software Engineering, and Vice Versa? (Panel).",
                    "Industrial Priorities for Software Engineering Research (Panel).",
                    "Dynamic Structure in Software Architectures.",
                    "Software Architecture Styles as Graph Grammars.",
                    "Using Object-Oriented Typing to Support Architectural Design in the C2 Style.",
                    "Tool Support for Planning the Restructuring of Data Abstractions in Large Systems.",
                    "Evolution of Object Behavior Using Context Relations.",
                    "Decoupling Change from Design.",
                    "Checking Relational Specifications With Binary Decision Diagrams.",
                    "Program Decomposition for Pointer Aliasing: A Step Toward Practical Analyses.",
                    "Verification of Communication Protocols Using Data Flow Analysis.",
                    "Generating Oracles from Your Favorite Temporal Logic Specifications.",
                    "Predicting the Cost-Effectiveness of Regression Testing Strategies.",
                    "Specification-based Testing of Synchronous Software.",
                    "Program Generalization for Software Reuse: From C to C++.",
                    "Automated Support for Seamless Interoperability in Polylingual Software Systems.",
                    "Model Checking Large Software Specifications.",
                    "Abstracting Dependencies between Software Configuration Items.",
                    "Formal Refinement Patterns for Goal-Driven Requirements Elaboration."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd SIGSOFT FSE 1995",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1995",
                "sub_name": "Proceedings of the Third ACM SIGSOFT Symposium on Foundations of Software Engineering, SIGSOFT 1995, Washington, DC, USA, October 10-13, 1995.",
                "count": 17,
                "papers": [
                    "Feature Interactions in the Global Information Infrastructure (Panel).",
                    "Software Architecture: Next Steps Towards an Engineering Discipline for Software Systems Design (Panel).",
                    "Specification Matching of Software Components.",
                    "Software Reflexion Models: Bridging the Gap Between Source and High-Level Models.",
                    "Hybrid Slicing: An Approach for Refining Static Slices Using Dynamic Information.",
                    "Precise Interprocedural Chopping.",
                    "State Abstraction and Modular Software Development.",
                    "Liveness Conditions in Model-Based Service Specifications: A Case Study.",
                    "Interconnecting Formalisms: Supporting Modularity, Reuse and Incrementality.",
                    "Using the Consequence of Failures for Testing and Reliability Assessment.",
                    "An Experiment to Assess the Cost-Benefits of Code Inspections in Large Scale Software Development.",
                    "Demand Interprocedural Dataflow Analysis.",
                    "Lightweight Source Model Extraction.",
                    "Model Checking Software Systems: A Case Study.",
                    "Compositional Reachability Analysis of Finite-State Distributed Systems with User-Specified Constraints.",
                    "A Unified Version Model for Configuration Management.",
                    "Formalization and Application of a Unifying Model for Name Management."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2nd SIGSOFT FSE 1994",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1994",
                "sub_name": "Proceedings of the Second ACM SIGSOFT Symposium on Foundations of Software Engineering, SIGSOFT 1994, New Orleans, Louisiana, USA, December 6-9, 1994.",
                "count": 17,
                "papers": [
                    "A New Model of Program Dependences for Reverse Engineering.",
                    "Speeding up Slicing.",
                    "CAIS: Collaborative Asynchronous Inspection of Software.",
                    "Duplication, Insertion and Lossiness Errors in Unreliable Communication Channels.",
                    "Integrating Status and Event Phenomena in Formal Specifications of Interactive Systems.",
                    "Towards Scalable Compositional Analysis.",
                    "Data Flow Analysis for Verifying Properties of Concurrent Programs.",
                    "A Language-Independent Approach to Specification Construction.",
                    "LCLint: A Tool for Using Specifications to Check Code.",
                    "Automated Support for Encapsulating Abstract Data Types.",
                    "Reengineering a Complex Application Using a Scalable Data Structure Compiler.",
                    "Using Specialized Procedures and Specification-Based Analysis to Reduce the Runtime Costs of Modularity.",
                    "Foundations of Software Testing: Dependability Theory.",
                    "Oracles for Checking Temporal Properties of Concurrent Systems.",
                    "Performing Data Flow Testing on Classes.",
                    "Correctness and Composition of Software Architectures.",
                    "Exploiting Style in Architectural Design Environments."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1st SIGSOFT FSE 1993",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1993",
                "sub_name": "Proceedings of the First ACM SIGSOFT Symposium on Foundations of Software Engineering, SIGSOFT 1993, Los Angeles, California, USA, December 7-10, 1993.",
                "count": 19,
                "papers": [
                    "Algebra and Models.",
                    "Using Style to Understand Descriptions of Software Architecture.",
                    "Mechanisms for Generic Process Support.",
                    "Fine-Grained Revision Control for Collaborative Software Development.",
                    "Direct Update of Data Flow Representations for a Meaning-Preserving Program Restructuring Tool.",
                    "PLEIADES: An Object Management System for Software Engineering Environments.",
                    "Towards Increased Productivity of Algorithm Implementation.",
                    "A Practical Approach to Software Engineering Using Z and the Refinement Calculus.",
                    "Deriving Modular Designs from Formal Specifications.",
                    "Targeting Safety-Related Errors During Software Requirements Analysis.",
                    "Does Every Inspection Need a Meeting?",
                    "Enhancing Compositional Reachability Analysis with Context Constraints.",
                    "A Framework for Programming and Formalizing Concurrent Objects.",
                    "A Logical Approach to Data Structures.",
                    "Test Case Generation by Means of Learning Techniques.",
                    "Software Measure Specification.",
                    "Partition testing, stratified sampling, and cluster analysis.",
                    "Signature Matching: A Key to Reuse.",
                    "Scalable Software Libraries."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "SIGSOFT 1991",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1991",
                "sub_name": "Proceedings of the conference on Software for citical systems, SIGSOFT 1991, New Orleans, Louisiana, USA.",
                "count": 13,
                "papers": [
                    "Formal verification of algorithms for critical systems.",
                    "State-based model checking of event-driven system requirements.",
                    "Rigorous development using RAISE.",
                    "Specifying and verifying requirements of real-time systems.",
                    "A systematic kernel development.",
                    "The infeasibility of experimental quantification of life-critical software reliability.",
                    "Assessing the fault-detecting ability of testing methods.",
                    "An exception handling model for parallel programming and its verification.",
                    "A real-time transition model for analyzing behavioral compatibility of telecommunications services.",
                    "Programming and verifying critical systems by means of the synchronous data-flow language LUSTRE.",
                    "Stepwise design of real-time systems.",
                    "On satisfying timing constraints in hard-real-time systems.",
                    "Automated analysis of bounded response time for two NASA expert systems."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "SIGSOFT 1983",
        "info": "Pacific Grove, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigsoft/1983",
                "sub_name": "Proceedings of the symposium on High-level debugging, SIGSOFT 1983, Pacific Grove, California, USA, March 20-23, 1983.",
                "count": 36,
                "papers": [
                    "Debugging methodology: session summary.",
                    "Debugging \"level\": step-wise debugging.",
                    "Interactive debug requirements.",
                    "Knowledge-based debugging: session summary.",
                    "Knowledge-based fault localization in debugging: preliminary draft.",
                    "Requirements/design debugging: session summary.",
                    "Generalized path expressions: a high level debugging mechanism.",
                    "The application of error-sensitive testing strategies to debugging.",
                    "An approach to testing specifications.",
                    "Integrated environments.",
                    "An experimental debugger in a limited programming environment.",
                    "A database model of debugging.",
                    "Interactive program execution in Lispedit.",
                    "The role of debugging within software engineering environments.",
                    "An integrated Lisp programming environment.",
                    "Distributed debugging: session summary.",
                    "Development of a debugger for a concurrent language.",
                    "An approach to high-level debugging of distributed systems: preliminary draft.",
                    "Interactive debugging of concurrent programs.",
                    "Implementation issues: session summary.",
                    "Implementation issues II.",
                    "SIMOB: a portable toolbox for observation of SIMULA executions.",
                    "High level language debugging with a compiler.",
                    "A systematic approach to advanced debugging: incremental compilation.",
                    "Hardware assisted high level debugging: preliminary draft.",
                    "A real-time microprocessor debugging technique.",
                    "Implementation issues for a source level symbolic debugger.",
                    "High-level debugging assistance via optimizing compiler technology.",
                    "Static analysis of programs as an aid to debugging.",
                    "An interactive high-level debugger for control-flow optimized programs.",
                    "VAX DEBUG: an interactive, symbolic, multilingual debugger.",
                    "Multilingual debugging with the SWAT high-level debugger.",
                    "The blit debugger: preliminary draft.",
                    "DYMOS: a dynamic modification system.",
                    "DELTA: the Universal Debugger for CP-6.",
                    "Summary of evaluation and comments."
                ]
            }
        ]
    }
]