[
    {
        "name": "GeoInformatica",
        "year": "2022",
        "info": "2022: Volume 26",
        "count": 9,
        "papers": [
            "Contextual location recommendation for location-based social networks by learning user intentions and contextual triggers.",
            "On discovering motifs and frequent patterns in spatial trajectories with discrete Fréchet distance.",
            "GeoBalance: workload-aware partitioning of real-time spatiotemporal data.",
            "Efficient computation of map algebra over raster data stored in the k2-acc compact data structure.",
            "CIME: Context-aware geolocation of emergency-related posts.",
            "A survey of location-based social networks: problems, methods, and future research directions.",
            "Reverse keyword-based location search on road networks.",
            "Temporal aggregation bias and Gerrymandering urban time series.",
            "Porting disk-based spatial index structures to flash-based solid state drives."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2021",
        "info": "2021: Volume 25",
        "count": 34,
        "papers": [
            "An information fusion approach for conflating labeled point-based time-series data.",
            "Size constrained k simple polygons.",
            "Building navigation networks from multi-vessel trajectory data.",
            "Route intersection reduction with connected autonomous vehicles.",
            "Probabilistic forecasting using deep generative models.",
            "Spatiotemporal event sequence discovery without thresholds.",
            "Hidden Markov map matching based on trajectory segmentation with heading homogeneity.",
            "Finding the most navigable path in road networks.",
            "Correction to: MongoDB Vs PostgreSQL: a comparative study on performance aspects.",
            "MongoDB Vs PostgreSQL: A comparative study on performance aspects.",
            "SWS: an unsupervised trajectory segmentation algorithm based on change detection with interpolation kernels.",
            "Scalable enrichment of mobility data with weather information.",
            "Towards a semantic indoor trajectory model: application to museum visits.",
            "Distributed mining of convoys in large scale datasets.",
            "Query the trajectory based on the precise track: a Bloom filter-based approach.",
            "Introduction to the special issue on smart transportation.",
            "Correction to: Introduction to the special issue on smart transportation.",
            "Editorial note for the special issue on smart transportation.",
            "Optimum versus Nash-equilibrium in taxi ridesharing.",
            "Improving human mobility identification with trajectory augmentation.",
            "Geographical and temporal huff model calibration using taxi trajectory data.",
            "Constrained shortest path problems in bi-colored graphs: a label-setting approach.",
            "Mobile participatory sensing with strong privacy guarantees using secure probes.",
            "Mitigating Spoofed GNSS Trajectories through Nature Inspired Algorithm.",
            "A comparison of supervised learning schemes for the detection of search and rescue (SAR) vessel patterns.",
            "Parallel and scalable processing of spatio-temporal RDF queries using Spark.",
            "Conflict-Free Evacuation Route Planning.",
            "Evaluating the effect of compressing algorithms for trajectory similarity and classification problems.",
            "Editor's note.",
            "Urban expansion modeling using an enhanced decision tree algorithm.",
            "Consistency assessment for open geodata integration: an ontology-based approach.",
            "Bi- and three-dimensional urban change detection using sentinel-1 SAR temporal series.",
            "Emergency ambulance speed characteristics: a case study of Lesser Poland voivodeship, southern Poland.",
            "How do you visit: Identifying addicts from large-scale transit records via scenario deep embedding."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2020",
        "info": "2020: Volume 24",
        "count": 38,
        "papers": [
            "Introduction to Spatio-temporal data management and analytics for Smart City research.",
            "S2R-tree: a pivot-based indexing structure for semantic-aware spatial keyword search.",
            "ITISS: an efficient framework for querying big temporal data.",
            "Collective spatial keyword search on activity trajectories.",
            "Spatial keyword search: a survey.",
            "Preference-aware sequence matching for location-based services.",
            "Annotating semantic tags of locations in location-based social networks.",
            "Multi-skill aware task assignment in real-time spatial crowdsourcing.",
            "Two-sided online bipartite matching in spatial data: experiments and analysis.",
            "Graph simulation on large scale temporal graphs.",
            "An innovative multi-label learning based algorithm for city data computing.",
            "Joint hyperspectral unmixing for urban computing.",
            "Guest Editorial: Special Issue on Analytics for Local Events and News.",
            "Techniques for efficient detection of rapid weather changes and analysis of their impacts on a highway network.",
            "Local trend discovery on real-time microblogs with uncertain locations in tight memory environments.",
            "Crosstown traffic - supervised prediction of impact of planned special events on urban traffic.",
            "Building socially-enabled event-enriched maps.",
            "Enhancing local live tweet stream to detect news.",
            "Online flu epidemiological deep modeling on disease contact network.",
            "Behavior-based location recommendation on location-based social networks.",
            "Toward volume preserving spheroid degenerated-octree grid.",
            "Influences of different underground station map designs on map-reading and wayfinding.",
            "Generalized communication cost efficient multi-way spatial join: revisiting the curse of the last reducer.",
            "Top-k spatial distance joins.",
            "Map construction algorithms: a local evaluation through hiking data.",
            "A template-based approach for the specification of 3D topological constraints.",
            "Learning evolving user's behaviors on location-based social networks.",
            "A Framework for Group Converging Pattern Mining using Spatiotemporal Trajectories.",
            "SST: Synchronized Spatial-Temporal Trajectory Similarity Search.",
            "Road network simplification for location-based services.",
            "A novel spectral-spatial based adaptive minimum spanning forest for hyperspectral image classification.",
            "Affine-invariant querying of spatial data using a triangle-based logic.",
            "SHAREK*: A Scalable Matching Method for Dynamic Ride Sharing.",
            "A framework for evaluating 3D topological relations based on a vector data model.",
            "A secure location-based alert system with tunable privacy-performance trade-off.",
            "JS4Geo: a canonical JSON Schema for geographic data suitable to NoSQL databases.",
            "Cost estimation of spatial join in spatialhadoop.",
            "Correction to: FeaturEyeTrack: automatic matching of eye tracking data with map features on interactive maps."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2019",
        "info": "2019: Volume 23",
        "count": 28,
        "papers": [
            "Spatio-temporal access methods: a survey (2010 - 2017).",
            "Spatial data management in apache spark: the GeoSpark perspective and beyond.",
            "Query rewriting for semantic query optimization in spatial databases.",
            "An overlapping Voronoi diagram-based system for multi-criteria optimal location queries.",
            "Guest editorial for spatial agent-based models: current practices and future trends.",
            "Crossing the chasm: a 'tube-map' for agent-based social simulation of policy scenarios in spatially-distributed systems.",
            "Quantifying the ambient population using hourly population footfall data and an agent-based model of daily mobility.",
            "Using word embeddings to generate data-driven human agent decision-making from natural language.",
            "Bayesian networks for spatial learning: a workflow on using limited survey data for intelligent learning in spatial agent-based models.",
            "Using agent-based modelling to simulate social-ecological systems across scales.",
            "Building, composing and experimenting complex spatial models with the GAMA platform.",
            "Guest Editorial: Special issue on mobility analytics for spatio-temporal and social data.",
            "Regularized topic-aware latent influence propagation in dynamic relational networks.",
            "On the composition and recommendation of multi-feature paths: a comprehensive approach.",
            "A hybrid CNN-LSTM model for typhoon formation forecasting.",
            "A spatially-pruned vertex expansion operator in the Neo4j graph database system.",
            "Spatio-temporal mining of keywords for social media cross-social crawling of emergency events.",
            "Clustering-based disambiguation of fine-grained place names from descriptions.",
            "An efficient aggregation and overlap removal algorithm for circle maps.",
            "Editorial: mobile data management and analytics.",
            "A versatile computational framework for group pattern mining of pedestrian trajectories.",
            "Continuous decaying of telco big data with data postdiction.",
            "Efficient matching of offers and requests in social-aware ridesharing.",
            "Efficient framework for processing top-k queries with replication in mobile ad hoc networks.",
            "Top-k trajectories with the best view.",
            "FeaturEyeTrack: automatic matching of eye tracking data with map features on interactive maps.",
            "Qualitatively correct bintrees: an efficient representation of qualitative spatial information.",
            "A dynamic approach for presenting local and global information in geospatial network visualizations."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2018",
        "info": "2018: Volume 22",
        "count": 38,
        "papers": [
            "Preface to the special issue on advances in Spatio-temporal data analysis and management.",
            "Efficient evaluation of shortest travel-time path queries through spatial mashups.",
            "EPLA: efficient personal location anonymity.",
            "FTS: a feature-preserving trajectory synthesis model.",
            "Guest editorial: mobile computing support for geospatial systems.",
            "Probabilistic spatio-temporal resource search.",
            "A semantic HTML based approach for geosensor media.",
            "Automatic evacuation guiding scheme based on implicit interactions between evacuees and their mobile nodes.",
            "Towards pervasive geospatial affect perception.",
            "Efficient large-scale distance-based join queries in spatialhadoop.",
            "A compiler approach to map algebra: automatic parallelization, locality optimization, and GPU acceleration of raster spatial analysis.",
            "Aggregate keyword nearest neighbor queries on road networks.",
            "A novel computational knowledge-base framework for visualization and quantification of geospatial metadata in spatial data infrastructures.",
            "Guest editorial: special issue on spatial computing in emergency management.",
            "The national geographic characteristics of online public opinion propagation in China based on WeChat network.",
            "Efficient task assignment in spatial crowdsourcing with worker and task privacy protection.",
            "Spatio-temporal prediction of crop disease severity for agricultural emergency management based on recurrent neural networks.",
            "OSCAR: a framework to integrate spatial computing ability and data aggregation for emergency management of public health.",
            "A Spatio-temporal Scenario Model for Emergency Decision.",
            "Multi-vehicles dynamic navigating method for large-scale event crowd evacuations.",
            "Close range photogrammetry with tablet technology in post-earthquake scenario: Sant'Agostino church in Amatrice.",
            "Efficient CPS model based online opinion governance modeling and evaluation for emergency accidents.",
            "Preface: special issue on geo-social media analytics.",
            "Human mobility semantics analysis: a probabilistic and scalable approach.",
            "Assessing spatiotemporal predictability of LBSN: a case study of three Foursquare datasets.",
            "Strategies for combining Twitter users geo-location methods.",
            "A framework for annotating OpenStreetMap objects using geo-tagged tweets.",
            "Combined geo-social search: computing top-k join queries over incomplete information.",
            "k-most suitable locations selection.",
            "Mining mobile application usage pattern for demand prediction by considering spatial and temporal relations.",
            "Continuous k nearest neighbor queries over large multi-attribute trajectories: a systematic approach.",
            "Generating random connected planar graphs.",
            "Editorial: Advances in spatial and temporal databases.",
            "ST-Hadoop: a MapReduce framework for spatio-temporal data.",
            "Diverse nearest neighbors queries using linear skylines.",
            "Optimal group route query: Finding itinerary for group of users in spatial databases.",
            "Location-aware query reformulation for search engines.",
            "Correction to: A framework for annotating OpenStreetMap objects using geo-tagged tweets."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2017",
        "info": "2017: Volume 21",
        "count": 33,
        "papers": [
            "Discovering historic traffic-tolerant paths in road networks.",
            "Exploiting location-aware social networks for efficient spatial query processing.",
            "Enabling time-dependent uncertain eco-weights for road networks.",
            "Constrained energy-efficient routing in time-aware road networks.",
            "Finding dense locations in symbolic indoor tracking data: modeling, indexing, and processing.",
            "Multi-core parallelism for plane sweep algorithms as a foundation for GIS operations.",
            "Panda ∗: A generic and scalable framework for predictive spatio-temporal queries.",
            "Vague distance predicates.",
            "Guest editorial: GeoStreaming.",
            "Design principles of a stream-based framework for mobility analysis.",
            "Distributed processing of big mobility data as spatio-temporal data streams.",
            "High performance location-based services in a main-memory database.",
            "Implementing set operations over moving regions using the component moving region model.",
            "Operations to support temporal coverage aggregates over moving regions.",
            "Efficient online extraction of keywords for localized events in twitter.",
            "Online event recognition from moving vessel trajectories.",
            "Index-supported pattern matching on tuples of time-dependent values.",
            "Personalized location recommendation by aggregating multiple recommenders in diversity.",
            "Popularity-aware collective keyword queries in road networks.",
            "Humaine: a ubiquitous smartphone-based user heading estimation for mobile computing systems.",
            "Efficient maximal reverse skyline query processing.",
            "Guest editorial: map interaction.",
            "PerSE: visual analytics for calendar related spatiotemporal periodicity detection and analysis.",
            "How users perceive transparency in the 3D visualization of cadastre: testing its usability in an online questionnaire.",
            "Controllability matters: The user experience of adaptive maps.",
            "Interactive shearing for terrain visualization: an expert study.",
            "Special issue on spatial and temporal database management.",
            "Snapshot and continuous points-based trajectory search.",
            "Hub Labels on the database for large-scale graphs with the COLD framework.",
            "Privacy-preserving detection of anomalous phenomena in crowdsourced environmental sensing using fine-grained weighted voting.",
            "Knowledge extraction from crowdsourced data for the enrichment of road networks.",
            "Uncertain Voronoi cell computation based on space decomposition.",
            "Discovering non-compliant window co-occurrence patterns."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2016",
        "info": "2016: Volume 20",
        "count": 32,
        "papers": [
            "SPLZ: An efficient algorithm for single source shortest path problem using compression method.",
            "SMe: explicit & implicit constrained-space probabilistic threshold range queries for moving objects.",
            "Spatio-temporal traffic video data archiving and retrieval system.",
            "Kernel density estimation based on Ripley's correction.",
            "A domain specific language for spatial simulation scenarios.",
            "Current computational transportation science.",
            "Cooperative vehicle-infrastructure localization based on the symmetric measurement equation filter.",
            "Towards fusing uncertain location data from heterogeneous sources.",
            "Towards sustainable mobility behavior: research challenges for location-aware information and communication technology.",
            "Advanced methods for the estimation of an unknown projection from a map.",
            "A framework for intelligence analysis using spatio-temporal storytelling.",
            "Exploring cell tower data dumps for supervised learning-based point-of-interest prediction (industrial paper).",
            "Finding optimal region for bichromatic reverse nearest neighbor in two- and three-dimensional spaces.",
            "Robust high-quality interpolation of regions to moving regions.",
            "Location K-anonymity in indoor spaces.",
            "Skyline for geo-textual data.",
            "The direction-constrained k nearest neighbor query - Dealing with spatio-directional objects.",
            "Geographically weighted evidence combination approaches for combining discordant and inconsistent volunteered geographical information.",
            "Task selection in spatial crowdsourcing from worker's perspective.",
            "GeoInformatica welcomes a new co-editor-in-chief.",
            "New plane-sweep algorithms for distance-based join queries in spatial databases.",
            "Developing a web-based system for supervised classification of remote sensing images.",
            "On discovering co-location patterns in datasets: a case study of pollutants and child cancers.",
            "Support Vector machine and duration-aware conditional random field for identification of spatio-temporal activity patterns by combined indoor positioning and heart rate sensors.",
            "A probabilistic approach to detect mixed periodic patterns from moving object data.",
            "Integrating tourist packages and tourist attractions for personalized trip planning based on travel constraints.",
            "Automatic targeted-domain spatiotemporal event detection in twitter.",
            "Guest editorial: big spatial data.",
            "Mining spatiotemporal co-occurrence patterns in non-relational databases.",
            "Efficient indexing and retrieval of large-scale geo-tagged video databases.",
            "The index array approach and the dual tiled similarity algorithm for UAS hyper-spatial image processing.",
            "The big data of violent events: algorithms for association analysis using spatio-temporal storytelling."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2015",
        "info": "2015: Volume 19",
        "count": 26,
        "papers": [
            "Recognizing text in raster maps.",
            "Efficient continuous top-k spatial keyword queries on road networks.",
            "Partition-based range query for uncertain trajectories in road networks.",
            "Stacked space-time densities: a geovisualisation approach to explore dynamics of space use over time.",
            "Spatio-temporal compression of trajectories in road networks.",
            "Domain-driven co-location mining - Extraction, visualization and integration in a GIS.",
            "Impact of data representation rules on the robustness of topological relation evaluation.",
            "GMOBench: Benchmarking generic moving objects.",
            "Adaptive generation of variable-scale network maps for small displays based on line density distribution.",
            "Special issue on spatial and temporal database management.",
            "On reverse-k-nearest-neighbor joins.",
            "A Dilution-matching-encoding compaction of trajectories over road networks.",
            "Best upgrade plans for single and multiple source-destination pairs.",
            "High performance FPGA and GPU complex pattern matching over spatio-temporal streams.",
            "Querying visible points in large obstructed space.",
            "Improving label placement quality by considering basemap detail with a raster-based approach.",
            "The TM-RTree: an index on generic moving objects for range queries.",
            "Recommendations in location-based social networks: a survey.",
            "EcoMark 2.0: empowering eco-routing with vehicular environmental models and actual vehicle fuel consumption data.",
            "A comparison and evaluation of map construction algorithms using vehicle tracking data.",
            "MobiFeed: A location-aware news feed framework for moving users.",
            "Efficiently computing the drainage network on massive terrains using external memory flooding process.",
            "Travel topic analysis: a mutually reinforcing method for geo-tagged photos.",
            "Planning unobstructed paths in traffic-aware spatial networks.",
            "The CASE histogram: privacy-aware processing of trajectory data using aggregates.",
            "From GPS and virtual globes to spatial computing - 2020."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2014",
        "info": "2014: Volume 18",
        "count": 28,
        "papers": [
            "Interactive cartographic route descriptions.",
            "Active learning of user's preferences estimation towards a personalized 3D navigation of geo-referenced scenes.",
            "Using spatial data support for reducing uncertainty in geospatial applications.",
            "Guest editorial: location-centric privacy in mobile services.",
            "Protecting query privacy in location-based services.",
            "Effective mix-zone anonymization techniques for mobile travelers.",
            "User-side adaptive protection of location privacy in participatory sensing.",
            "The largest empty rectangle containing only a query object in Spatial Databases.",
            "A comparative study of two approaches for supporting optimal network location queries.",
            "Reconstruct street network from imprecise excavation data using fuzzy Hough transforms.",
            "Special section on \"Spatial data warehouses and SOLAP\".",
            "A general framework for trajectory data warehousing and visual OLAP.",
            "Modeling vague spatial data warehouses using the VSCube conceptual model.",
            "A probabilistic data model and algebra for location-based data warehouses and their implementation.",
            "Context-based mobile GeoBI: enhancing business analysis with contextual metrics/statistics and context-based reasoning.",
            "Compression of trajectory data: a comprehensive evaluation and new approach.",
            "TARS: traffic-aware route search.",
            "On detecting spatial categorical outliers.",
            "An assisting, constrained 3D navigation technique for multiscale virtual 3D city models.",
            "A polygon-based clustering and analysis framework for mining spatial datasets.",
            "Comparing G-maps with other topological data structures.",
            "Estimation of an unknown cartographic projection and its parameters from the map.",
            "Large-scale geo-tagged video indexing and queries.",
            "Group spatiotemporal pattern queries.",
            "An evaluative baseline for geo-semantic relatedness and similarity.",
            "Publishing deep web geographic data.",
            "Improving geographic information retrieval in spatial data infrastructures.",
            "Location privacy models in mobile applications: conceptual view and research directions."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2013",
        "info": "2013: Volume 17",
        "count": 24,
        "papers": [
            "Building pattern recognition in topographic data: examples on collinear and curvilinear alignments.",
            "Computer-based synthetic data to assess the tree delineation algorithm from airborne LiDAR survey.",
            "Continuous aggregate nearest neighbor queries.",
            "A query integrity assurance scheme for accessing outsourced spatial databases.",
            "A generic data model for moving objects.",
            "Users plan optimization for participatory urban texture documentation.",
            "HFPaC: GPU friendly height field parallel compression.",
            "Directional relations and frames of reference.",
            "A framework to model and manipulate constraints for over-constrained geographic applications.",
            "Footprint generation using fuzzy-neighborhood clustering.",
            "Multi-level representation of terrain features on a contour map.",
            "STHist-C: a highly accurate cluster-based histogram for two and three dimensional geographic data points.",
            "Evolutionary search for understanding movement dynamics on mixed networks.",
            "Spatio-temporal polygonal clustering with space and time as first-class citizens.",
            "Guest editorial: spatial and temporal databases.",
            "Generic and efficient framework for search trees on flash memory storage systems.",
            "Spatial inverse query processing.",
            "Index-based query processing on distributed multidimensional data.",
            "Using virtual reality and percolation theory to visualize fluid flow in porous media.",
            "The k closest pairs in spatial databases - When only one set is indexed.",
            "Opportunistic sampling-based query processing in wireless sensor networks.",
            "Blind evaluation of location based queries using space transformation to preserve location privacy.",
            "An algorithm for local geoparsing of microtext.",
            "Decentralized querying of topological relations between regions monitored by a coordinate-free geosensor network."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2012",
        "info": "2012: Volume 16",
        "count": 26,
        "papers": [
            "Automatic geospatial metadata generation for earth science virtual data products.",
            "An evaluation of ontology matching in geo-service applications.",
            "Topological operators: a relaxed query processing approach.",
            "Reference model for a data grid approach to address data in a dynamic SDI.",
            "Provably correct and complete transaction rules for updating 3D city models.",
            "The SB-index and the HSB-index: efficient indices for spatial data warehouses.",
            "Integrating GI with non-GI services - showcasing interoperability in a heterogeneous service-oriented architecture.",
            "Comparison of four line-based positional assessment methods by means of synthetic data.",
            "Blind and squaring-resistant watermarking of vectorial building layers.",
            "Automatic classification of building types in 3D city models - Using SVMs for semantic enrichment of low resolution building data.",
            "Generating seamless surfaces for transport and dispersion modeling in GIS.",
            "An interactive framework for spatial joins: a statistical approach to data analysis in GIS.",
            "Moving GeoPQL: a pictorial language towards spatio-temporal queries.",
            "Efficient parallel algorithm for pixel classification in remote sensing imagery.",
            "Towards dynamic behavior-based profiling for reducing spatial information overload in map browsing activity.",
            "Retrospective adaptive prefetching for interactive Web GIS applications.",
            "PNN query processing on compressed trajectories.",
            "Processing aggregated data: the location of clusters in health data.",
            "A framework for integrating multi-accuracy spatial data in geographical applications.",
            "SKIF-P: a point-based indexing and ranking of web documents for spatial-keyword search.",
            "A fuzzy index for detecting spatiotemporal outliers.",
            "Erratum to: A fuzzy index for detecting spatiotemporal outliers.",
            "Guest editorial: Integrated spatio-temporal analysis and data mining.",
            "Multi-scale decomposition of point process data.",
            "Cluster recognition in spatial-temporal sequences: the case of forest fires.",
            "Assessing the changing flowering date of the common lilac in North America: a random coefficient model approach."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2011",
        "info": "2011: Volume 15",
        "count": 29,
        "papers": [
            "A framework for regional association rule mining and scoping in spatial datasets.",
            "A hybrid classification scheme for mining multisource geospatial data.",
            "Crime analysis through spatial areal aggregated density patterns.",
            "TIDES - a new descriptor for time series oscillation behavior.",
            "openModeller: a generic approach to species' potential distribution modelling.",
            "How to achieve consistency for 3D city models.",
            "Computational method for the point cluster analysis on networks.",
            "Functional description of geoprocessing services as conjunctive datalog queries.",
            "Connectivity in the regular polytope representation.",
            "Interpreting motion events of pairs of moving objects.",
            "Integrating semantic web technologies and geospatial catalog services for geospatial information discovery and processing in cyberinfrastructure.",
            "Qualitative change detection using sensor networks based on connectivity information.",
            "Comparison of distribution strategies in uncertainty-aware catchment delineation.",
            "Spatial cloaking for anonymous location-based services in mobile peer-to-peer environments.",
            "Efficient viewshed computation on terrain in external memory.",
            "Controlling patterns of geospatial phenomena.",
            "The elements of probabilistic time geography.",
            "Mining boundary effects in areally referenced spatial data using the Bayesian information criterion.",
            "A data model and query language for spatio-temporal decision support.",
            "Spatiotemporal pattern queries.",
            "The partial sequenced route query with traveling rules in road networks.",
            "Query-aware location anonymization for road networks.",
            "Ontology-driven discovery of geospatial evidence in web pages.",
            "Representing topological relationships for spatiotemporal objects.",
            "Special section on spatial and temporal databases.",
            "Spatial skyline queries: exact and approximation algorithms.",
            "Approximate and exact hybrid algorithms for private nearest-neighbor queries with database protection.",
            "MOVIES: indexing moving objects by shooting index images.",
            "Editing and versioning for high performance network models in a multiuser environment."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2010",
        "info": "2010: Volume 14",
        "count": 21,
        "papers": [
            "Colors of the past: color image segmentation in historical topographic maps based on homogeneity.",
            "User defined topological predicates in database systems.",
            "High-dimensional kNN joins with incremental updates.",
            "Support vector machines for urban growth modeling.",
            "Spatial interpolation in wireless sensor networks: localized algorithms for variogram modeling and Kriging.",
            "Evaluating the benefits of multimodal interface design for CoMPASS - a mobile GIS.",
            "Efficient evaluation of continuous spatio-temporal queries on moving objects with uncertain velocity.",
            "Semantic-based pruning of redundant and uninteresting frequent geographic patterns.",
            "Mastering map scale: balancing workloads using display and geometry change in multi-scale mapping.",
            "Algorithms for constrained k-nearest neighbor queries over moving object trajectories.",
            "Preface: semantic and conceptual issues in geographic information systems.",
            "Managing sensor traffic data and forecasting unusual behaviour propagation.",
            "Exploiting geographic references of documents in a geographical information retrieval system using an ontology-based index.",
            "A semantic and language-based representation of an environmental scene.",
            "OCL for formal modelling of topological constraints involving regions with broad boundaries.",
            "A knowledge infrastructure for intelligent query answering in location-based services.",
            "Effect of SRTM resolution on morphometric feature identification using neural network - self organizing map.",
            "Tightly-coupled spatial database features in the Odysseus/OpenGIS DBMS for high-performance.",
            "The OGC web coverage processing service (WCPS) standard.",
            "Combining ontologies to automatically generate temporal perspectives of geospatial domains.",
            "IRSJ: incremental refining spatial joins for interactive queries in GIS."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2009",
        "info": "2009: Volume 13",
        "count": 23,
        "papers": [
            "Continuous K-Nearest Neighbor Query for Moving Objects with Uncertain Velocity.",
            "Mining Long, Sharable Patterns in Trajectories of Moving Objects.",
            "Retrieval of Spatial Join Pattern Instances from Sensor Networks.",
            "The Effects of Navigation Sensors and Spatial Road Network Data Quality on the Performance of Map Matching Algorithms.",
            "Evaluation and Implementation of the OGC Web Processing Service for Use in Client-Side GIS.",
            "Automatic and Accurate Extraction of Road Intersections from Raster Maps.",
            "Cloaking locations for anonymous location based services: a hybrid approach.",
            "Yet Another Map Algebra.",
            "Shape deformation in continuous map generalization.",
            "Urban granularities - a data structure for cognitively ergonomic route directions.",
            "Preface: Geology and information technology.",
            "Comparison of GIS-based methodologies for the landslide susceptibility assessment.",
            "GIS-based method for the environmental vulnerability assessment to volcanic ashfall at Etna Volcano.",
            "A preliminary method for the evaluation of the landslides volume at a regional scale.",
            "Automated tools within workflows for 3D structural construction from surface and subsurface data.",
            "A WebGIS for the dissemination of information on historical landslides and floods in Umbria, Italy.",
            "Comparison of 2-D and 3-D computer models for the M. Salta rock fall, Vajont Valley, northern Italy.",
            "Application of a model to the evaluation of flood damage.",
            "Efficient MaxCount and threshold operators of moving objects.",
            "Update-efficient indexing of moving objects in road networks.",
            "Automated processing for map generalization using web services.",
            "A meeting scheduling problem respecting time and space.",
            "Web data retrieval: solving spatial range queries using k-nearest neighbor searches."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2008",
        "info": "2008: Volume 12",
        "count": 20,
        "papers": [
            "Innovations in Individual Feature History Management - The Significance of Feature-based Temporal Model.",
            "Approximating the Visible Region of a Point on a Terrain.",
            "An Application of Advanced Spatio-Temporal Formalisms to Behavioural Ecology.",
            "A Multi-parameter Approach to Automated Building Grouping and Generalization.",
            "Techniques for Computing Fitness of Use (FoU) for Time Series Datasets with Applications in the Geospatial Domain.",
            "One Way Distance: For Shape Based Similarity Search of Moving Object Trajectories.",
            "PIST: An Efficient and Practical Indexing Technique for Historical Spatio-Temporal Point Data.",
            "Area Collapse and Road Centerlines based on Straight Skeletons.",
            "A Statistical Model for Directional Relations Between Spatial Objects.",
            "Enabling Location-based Services - Multi-Graph Representation of Transportation Networks.",
            "Efficient Maintenance of Continuous Queries for Trajectories.",
            "Generalization-oriented Road Line Classification by Means of an Artificial Neural Network.",
            "Efficient Implementation Techniques for Topological Predicates on Complex Spatial Objects.",
            "Variable-resolution Compression of Vector Data.",
            "Automatically and Accurately Conflating Raster Maps with Orthoimagery.",
            "Processing Optimal Sequenced Route Queries Using Voronoi Diagrams.",
            "Matching Networks with Different Levels of Detail.",
            "On Detecting Spatial Outliers.",
            "Modeling Motion Relations for Moving Objects on Road Networks.",
            "Reporting Leaders and Followers among Trajectories of Moving Point Objects."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2007",
        "info": "2007: Volume 11",
        "count": 20,
        "papers": [
            "Ontology-Based Descriptions for Semantic Discovery and Composition of Geoprocessing Services.",
            "LiDAR-Derived High Quality Ground Control Information and DEM for Image Orthorectification.",
            "Enabling Routes of Road Network Constrained Movements as Mobile Service Context.",
            "Assessing the Certainty of Locations Produced by an Address Geocoding System.",
            "Advances in GML for Geospatial Applications.",
            "Algorithms for Nearest Neighbor Search on Moving Object Trajectories.",
            "Efficient Detection of Patterns in 2D Trajectories of Moving Points.",
            "Contextualization of Geospatial Database Semantics for Human-GIS Interaction.",
            "Multi-level Topological Relations Between Spatial Regions Based Upon Topological Invariants.",
            "A Schedule-based Pathfinding Algorithm for Transit Networks Using Pattern First Search.",
            "A New Model for Cloud Tracking and Analysis on Satellite Images.",
            "Higher Order Vagueness in Geographical Information: Empirical Geographical Population of Type n Fuzzy Sets.",
            "Unified Hybrid Terrain Representation Based on Local Convexifications.",
            "Computation of Random Errors in Digital Terrain Models.",
            "Weight-proportional Space Partitioning Using Adaptive Voronoi Diagrams.",
            "Multicriteria Spatial Decision Analysis in Web GIS Environment.",
            "Logical Representation of a Conceptual Model for Spatial Data Warehouses.",
            "Aim4GDI: Facilitating the Synthesis of GDI Resources through Mapping and Superimpositions of Metadata Summaries.",
            "A Relative Representation of Trajectories in Geogaphical Spaces.",
            "Convergence Analysis and Quality Criteria for an Iterative Schematization of Networks."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2006",
        "info": "2006: Volume 10",
        "count": 23,
        "papers": [
            "Introduction to the Special Issue.",
            "Utilizing Voronoi Cells of Location Data Streams for Accurate Computation of Aggregate Functions in Sensor Networks.",
            "Detecting Roads in Stabilized Video with the Spatio-Temporal Structure Tensor.",
            "An Ontology-Based Approach to Personalized Situation-Aware Mobile Service Supply.",
            "Building and Querying a P2P Virtual World.",
            "Errata.",
            "Supporting Distributed Spatial Collaboration: An Investigation of Navigation and Radar View Techniques.",
            "Metadata Community Profiles for the Semantic Web.",
            "A Quantitative Description Model for Direction Relations Based on Direction Groups.",
            "Decreasing Computational Time of Urban Cellular Automata Through Model Portability.",
            "Handling High-Level Queries in Location-Based Services for User Groups.",
            "Mining Co-Location Patterns with Rare Events from Spatial Data Sets.",
            "Spatial Query Estimation without the Local Uniformity Assumption.",
            "A New Method for Feature Mining in Remotely Sensed Images.",
            "Ontological Investigation of a Multiscale Ecosystem Classification Using the \"National Hierarchical Framework of Ecological Units\" as an Example.",
            "A Multi-Agent Model and Tabu Search Optimization to Manage Agricultural Territories.",
            "Multi-VMap: A Multi-Scale Model for Vector Maps.",
            "Fast Cluster Polygonization and its Applications in Data-Rich Environments.",
            "Indexing Fast Moving Objects for kNN Queries Based on Nearest Landmarks.",
            "The Radial Topology Algorithm - A New Approach for Deriving 2.5D GIS Data Models.",
            "GABRIEL: Gis Activity-Based tRavel sImuLator. Activity Scheduling in the Presence of Real-Time Information.",
            "Automatically Conflating Road Vector Data with Orthoimagery.",
            "Specifying and Implementing Constraints in GIS - with Examples from a Geo-Virtual Reality System."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2005",
        "info": "2005: Volume 9",
        "count": 18,
        "papers": [
            "Interpretive Tools for 3-D Structural Geological Modelling Part II: Surface Design from Sparse Spatial Data.",
            "Indexing the Trajectories of Moving Objects in Networks.",
            "Multi-Dimensional Scattered Ranking Methods for Geographic Information Retrieval.",
            "Introduction to the Special Issue.",
            "Trajectory Indexing Using Movement Constraints*.",
            "In-Route Nearest Neighbor Queries.",
            "How to Get 3-D for the Price of 2-D-Topology and Consistency of 3-D Urban GIS.",
            "Visualizing Demographic Trajectories with Self-Organizing Maps.",
            "Construction of the Planar Partition Postal Code Map Based on Cadastral Registration.",
            "Indeterminacy and Spatiotemporal Data: Basic Definitions and Case Study.",
            "Controlled Line Smoothing by Snakes.",
            "Digital Terrain Model Computation from Contour Lines: How to Derive Quality Information from Artifact Analysis.",
            "Classification of Spatial Properties for Spatial Allocation Modeling.",
            "Guest Editor's Introduction.",
            "Mobility Patterns.",
            "Alternative Solutions for Continuous K Nearest Neighbor Queries in Spatial Network Databases.",
            "Continuous Query Processing of Spatio-Temporal Data Streams in PLACE.",
            "SaIL: A Spatial Index Library for Efficient Application Integration."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2004",
        "info": "2004: Volume 8",
        "count": 14,
        "papers": [
            "The Story of the GeoToolKit - An Object-Oriented Geodatabase Kernel System.",
            "The Design and Implementation of a Repository for the Management of Spatial Data Integrity Constraints.",
            "A Probability-based Uncertainty Model for Point-in-Polygon Analysis in GIS.",
            "A Filter Flow Visual Querying Language and Interface for Spatial Databases.",
            "Predicting Forest Age Classes from High Spatial Resolution Remotely Sensed Imagery Using Voronoi Polygon Aggregation.",
            "A Structural Approach to the Model Generalization of an Urban Street Network.",
            "A System for Change Documentation Based on a Spatiotemporal Database.",
            "Development of a Temporal Extension to Query Travel Behavior Time Paths Using an Object-Oriented GIS.",
            "A Spatial Access-Oriented Implementation of a 3-D GIS Topological Data Model for Urban Entities.",
            "Towards Temporal Dynamic Segmentation.",
            "From \"Onto-GeoNoesis\" to \"Onto-Genesis\": The Design of Geographic Ontologies.",
            "Complex Spatial Query Processing.",
            "Defining and Comparing Content Measures of Topological Relations.",
            "Multi-Way Distance Join Queries in Spatial Databases."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2003",
        "info": "2003: Volume 7",
        "count": 17,
        "papers": [
            "Editorial.",
            "Multiresolution Compression and Visualization of Global Topographic Data.",
            "Ordering Points for Incremental TIN Construction from DEMs.",
            "Interpretive Tools for 3-D Structural Geological Modeling Part I: Bézier-Based Curves, Ribbons and Grip Frames.",
            "Imprecise Navigation.",
            "Finding Geographic Information: Collection-Level Metadata.",
            "Fast Nearest-Neighbor Query Processing in Moving-Object Databases.",
            "A Unified Approach to Detecting Spatial Outliers.",
            "Introduction to the Special Issue.",
            "Analysis of Multi-Dimensional Space-Filling Curves.",
            "Efficient Estimation of Qualitative Topological Relations based on the Weighted Walkthroughs Model.",
            "ICEAGE: Interactive Clustering and Exploration of Large and High-Dimensional Geodata.",
            "A Road Network Embedding Technique for K-Nearest Neighbor Search in Moving Object Databases.",
            "Efficient Flow Computation on Massive Grid Terrain Datasets.",
            "Polyline Spatial Join Evaluation Using Raster Approximation.",
            "Performance Evaluation of Lazy Deletion Methods in R-trees.",
            "Bridging Ontologies and Conceptual Schemas in Geographic Information Integration."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2002",
        "info": "2002: Volume 6",
        "count": 17,
        "papers": [
            "Editorial.",
            "Merging R-Trees: Efficient Strategies for Local Bulk Insertion.",
            "Generalized Model for Linear Referencing in Transportation.",
            "Dual Grid: A New Approach for Robust Spatial Algebra Implementation.",
            "Tabu Search Heuristic for Point-Feature Cartographic Label Placement.",
            "Vagueness and Rough Location.",
            "Multi-Level Clustering and its Visualization for Exploratory Spatial Analysis.",
            "A Framework for Generating Network-Based Moving Objects.",
            "Practical Extensions of Point Labeling in the Slider Model.",
            "On the Generation of Time-Evolving Regional Data.",
            "Simultaneous Graphic Generalization of Vector Data Sets.",
            "Semi-Automated Extraction of Rivers from Digital Imagery.",
            "Classifying Ambiguities in a Visual Spatial Language.",
            "Development of a Process-Based Model for Dynamic Interaction in Spatio-Temporal GIS.",
            "Modeling Costs of Turns in Route Planning.",
            "Field Data Collection with Mobile GIS: Dependencies Between Semantics and Data Quality.",
            "Using Genetic Algorithms for Solving Hard Problems in GIS."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2001",
        "info": "2001: Volume 5",
        "count": 19,
        "papers": [
            "Editorial: Spatio-Temporal Data Models and Languages.",
            "Making Space for Time: Issues in Space-Time Data Representation.",
            "Beyond Schema Versioning: A Flexible Model for Spatio-Temporal Schema Selection.",
            "A Spatio-Temporal Model for the Manipulation of Lineage Metadata.",
            "Oporto: A Realistic Scenario Generator for Moving Objects.",
            "Spatio-Temporal Data Handling with Constraints.",
            "Editorial.",
            "Neighborhood Relations between Fields with Applications to Cellular Networks.",
            "MapScript: A Map Algebra Programming Language Incorporating Neighborhood Analysis.",
            "Wavelet Compression and the Automatic Classification of Urban Environments Using High Resolution Multispectral Imagery and Laser Scanning Data.",
            "The DR-tree: A Main Memory Data Structure for Complex Multi-dimensional Objects.",
            "Editorial.",
            "OMT-G: An Object-Oriented Data Model for Geographic Applications.",
            "Object Calculus and the Object-Oriented Analysis and Design of an Error-Sensitive GIS.",
            "Towards a Methodology for the Evaluation of Multimedia Geographical Information Products.",
            "Editorial: Quality is the Future of Geoprocessing.",
            "Graphical Information Portals - The Application of Smart Maps in GeoNet 4D.",
            "Progressive Transmission of Vector Map Data over the World Wide Web.",
            "Spatio-Temporal Modeling in Video and Multimedia Geographic Information Systems."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "2000",
        "info": "2000: Volume 4",
        "count": 24,
        "papers": [
            "Editorial.",
            "A Methodology for Spatial Consistency Improvement of Geographic Databases.",
            "Topology in Raster and Vector Representation.",
            "Compressing Triangulated Irregular Networks.",
            "A Distributed Geographic Information System on the Common Object Request Broker Architecture (CORBA).",
            "Editorial: Geographic Information Systems and Intelligent Transportation Systems.",
            "GIS and Transportation: Status and Challenges.",
            "GIS Software for Measuring Space-Time Accessibility in Transportation Planning and Analysis.",
            "Handling Disaggregate Spatiotemporal Travel Data in GIS.",
            "Development of Transport Telematics in Europe.",
            "Towards ITS Map Database Interoperability-Database Error and Rectification.",
            "Spatial Data Handling for ITS: Perspective, Issues and Approaches.",
            "GIS and ITS Traffic Assignment: Issues in Dynamic User-Optimal Assignments.",
            "Editorial.",
            "Distributed Spatial Catalog Service on the CORBA Object Bus.",
            "A Conceptual Model for a Feature-Based Virtual Network.",
            "VARIANT: A System for Terrain Modeling at Variable Resolution.",
            "Fast Range Searching with Delaunay Triangulations.",
            "Editorial: A Perspective on Dynamic and Multi-Dimensional GIS in the 21st Century.",
            "Terrain Reconstruction from Contours by Skeleton Construction.",
            "Expression and Visualization of Cloverleaf Junction in a 3-Dimensional City Model.",
            "An Event-Based Approach to Spatio-Temporal Data Modeling in Land Subdivision Systems.",
            "Temporal Interpolation of Spatially Dynamic Object.",
            "Basic Topological Models for Spatial Entities in 3-Dimensional Space."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "1999",
        "info": "1999: Volume 3",
        "count": 16,
        "papers": [
            "Editorial.",
            "Developing GIS Applications with Objects: A Design Patterns Approach.",
            "Caching Strategies for Spatial Joins.",
            "Survey of Spatio-Temporal Databases.",
            "Editorial.",
            "A Multi-Resolution Content-Based Retrieval Approach for Geographic Images.",
            "SMART: Towards Spatial Internet Marketplaces.",
            "Design of a Query Language for Accessing Spatial Analysis in the Web Environment.",
            "Automating the Detection and Simplification of Junctions in Road Networks.",
            "Constraint-based Interoperability of Spatiotemporal Databases.",
            "Conceptual Data Modeling for Spatiotemporal Applications.",
            "Spatio-Temporal Data Types: An Approach to Modeling and Querying Moving Objects in Databases.",
            "Editorial: Object Dynamics.",
            "Requirement Analysis for the Definition of Reusable Spatial Objects.",
            "Diachronic Analysis of Fuzzy Objects.",
            "An Object Model of Direction and Its Implications."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "1998",
        "info": "1998: Volume 2",
        "count": 19,
        "papers": [
            "A Word from the Editor-in-Chief.",
            "A Rule-based Approach for the Conflation of Attributed Vector Data.",
            "Sorting Spatial Data for Sampling and Other Geographic Applications.",
            "Managing, Modeling, and Visualizing High-dimensional Spatio-temporal Data in an Integrated System.",
            "3d-Gis for Urban Purposes.",
            "Editorial.",
            "Approximation-Based Similarity Search for 3-D Surface Segments.",
            "Symbolic Intersect Detection: A Method for Improving Spatial Intersect Joins.",
            "Data Partitioning for Parallel Spatial Join Processing.",
            "Editorial.",
            "Improved Modeling of Elevation Error with Geostatistics.",
            "A Comparison of Two Approaches to Ranking Algorithms Used to Compute Hill Slopes.",
            "Imprecision in Finite Resolution Spatial Data.",
            "Finite-Resolution Simplicial Complexes.",
            "Computational Perspectives on Map Generalization.",
            "Experiments with Learning Techniques for Spatial Model Enrichment and Line Generalization.",
            "Linking Objects of Different Spatial Data Sets by Integration and Aggregation.",
            "Morphological Models for the Collapse of Area Features in Digital Map Generalization.",
            "Conflict Reduction in Map Generalization Using Iterative Improvement."
        ]
    },
    {
        "name": "GeoInformatica",
        "year": "1997",
        "info": "1997: Volume 1",
        "count": 14,
        "papers": [
            "Bridging the Gap between Computer Science and Geography.",
            "A Global Framework for Qualitative Shape Description.",
            "An Environment for Modeling and Design of Geographic Applications.",
            "Efficient Window Block Retrieval in Quadtree-Based Spatial Databases.",
            "Point-in-Polygon Analysis Under Certainty and Uncertainty.",
            "A Hierarchical Path View Model for Path Finding in Intelligent Transportation Systems.",
            "A Platform for Research in Generalization: Application to Caricature.",
            "Parallel Processing for Terrain Analysis in GIS: Visibility as a Case Study.",
            "Visibility Computations on Hierarchical Triangulated Terrain Models.",
            "Algorithms for Hierarchical Spatial Reasoning.",
            "Qualitative Spatial Representation and Reasoning with the Region Connection Calculus.",
            "A Taxonomy of Spatial Data Integrity Constraints.",
            "Achieving Integrity in Geographic Information Systems Maps and Nested Maps.",
            "Nearest Neighbor Queries in Shared-Nothing Environments."
        ]
    }
]