[
    {
        "year": "2021",
        "name": "18th HotOS 2021",
        "info": "Ann Arbor, Michigan, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2021",
                "sub_name": "HotOS '21: Workshop on Hot Topics in Operating Systems, Ann Arbor, Michigan, USA, June, 1-3, 2021.",
                "count": 34,
                "papers": [
                    "The last CPU.",
                    "Cores that don't count.",
                    "A case against (most) context switches.",
                    "From cloud computing to sky computing.",
                    "User-defined cloud.",
                    "Rethinking networking abstractions for cloud tenants.",
                    "The RESTless cloud.",
                    "From warm to hot starts: leveraging runtimes for the serverless era.",
                    "Systems research is running out of time.",
                    "Century-scale smart infrastructure.",
                    "FlexOS: making OS isolation flexible.",
                    "Stop! Hammer time: rethinking our approach to rowhammer mitigations.",
                    "CloudEx: a fair-access financial exchange in the cloud.",
                    "Unix shell programming: the next 50 years.",
                    "Privacy heroes need data disguises.",
                    "Doing more with less: training large DNN models on commodity servers for the masses.",
                    "BPF for storage: an exokernel-inspired approach.",
                    "The Aurora operating system: revisiting the single level store.",
                    "Don't be a blockhead: zoned namespaces make work on conventional SSDs obsolete.",
                    "We need kernel interposition over the network dataplane.",
                    "mmapx: uniform memory protection in a heterogeneous world.",
                    "Contextual concurrency control.",
                    "Toward reconfigurable kernel datapaths with learned optimizations.",
                    "An incremental path towards a safer OS kernel.",
                    "In reference to RPC: it's time to add distributed memory.",
                    "Breakfast of champions: towards zero-copy serialization with NIC scatter-gather.",
                    "Zerializer: towards zero-copy serialization.",
                    "Reasoning about modern datacenter infrastructures using partial histories.",
                    "Metastable failures in distributed systems.",
                    "Fail-slow fault tolerance needs programming support.",
                    "The future of hardware development: a perspective from systems researchers.",
                    "Burnt topics in operating systems.",
                    "Systems trivia night.",
                    "The future of the shell: Unix and beyond."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th HotOS 2019",
        "info": "Bertinoro, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2019",
                "sub_name": "Proceedings of the Workshop on Hot Topics in Operating Systems, HotOS 2019, Bertinoro, Italy, May 13-15, 2019.",
                "count": 30,
                "papers": [
                    "Composing Abstractions using the null-Kernel.",
                    "Unikernels: The Next Stage of Linux's Dominance.",
                    "A fork() in the road.",
                    "Can We Prove Time Protection?",
                    "Towards Automatic Inference of Inductive Invariants.",
                    "RedLeaf: Towards An Operating System for Safe and Verified Firmware.",
                    "Synthesizing Cluster Management Code for Distributed Systems.",
                    "Comprehensive and Efficient Runtime Checking in System Software through Watchdogs.",
                    "Automatic Virtualization of Accelerators.",
                    "The Case for I/O-Device-as-a-Service.",
                    "I'm Not Dead Yet!: The Role of the Operating System in a Kernel-Bypass Era.",
                    "I/O Is Faster Than the CPU: Let's Partition Resources and Eliminate (Most) OS Abstractions.",
                    "Towards Multiverse Databases.",
                    "Isolation and Beyond: Challenges for System Security.",
                    "Rethinking General-Purpose Decentralized Computing.",
                    "Fast key-value stores: An idea whose time has come and gone.",
                    "Designing Far Memory Data Structures: Think Outside the Box.",
                    "Project PBerry: FPGA Acceleration for Remote Memory.",
                    "Nines are Not Enough: Meaningful Metrics for Clouds.",
                    "The Synchronous Data Center.",
                    "Granular Computing.",
                    "What bugs cause production cloud incidents?",
                    "You can't debug what you can't see: Expanding observability with the OmniTable.",
                    "Practical Safe Linux Kernel Extensibility.",
                    "Machine Learning Systems are Stuck in a Rut.",
                    "A Case for Managed and Model-less Inference Serving.",
                    "Why and How to Increase SSD Performance Transparency.",
                    "CPR for SSDs.",
                    "When Should The Network Be The Computer?",
                    "In-Network Compute: Considered Armed and Dangerous."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "16th HotOS 2017",
        "info": "Whistler, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2017",
                "sub_name": "Proceedings of the 16th Workshop on Hot Topics in Operating Systems, HotOS 2017, Whistler, BC, Canada, May 8-10, 2017.",
                "count": 29,
                "papers": [
                    "Performance clarity as a first-class design principle.",
                    "Towards O(1) Memory.",
                    "Thinking about Availability in Large Service Infrastructures.",
                    "Towards Proving Optimistic Multicore Schedulers.",
                    "Scalability Bugs: When 100-Node Testing is Not Enough.",
                    "Verification in the Age of Microservices.",
                    "Hypercallbacks: Decoupling Policy Decisions and Execution.",
                    "Flash Drive Lifespan *is* a Problem.",
                    "Preserving Hidden Data with an Ever-Changing Disk.",
                    "It's Time to Think About an Operating System for Near Data Processing Architectures.",
                    "A Clairvoyant Approach to Evaluating Software (In)Security.",
                    "OmniX: an accelerator-centric OS for omni-programmable systems.",
                    "Quantum Operating Systems.",
                    "Consistency Oracles: Towards an Interactive and Flexible Consistency Model Specification.",
                    "No!: Not Another Deep Learning Framework.",
                    "Glimmers: Resolving the Privacy/Trust Quagmire.",
                    "From Crash Consistency to Transactions.",
                    "Real-Time Machine Learning: The Missing Pieces.",
                    "Towards Automated Configuration of Systems with Non-Functional Constraints.",
                    "Separating Translation from Protection in Address Spaces with Dynamic Remapping.",
                    "The Game of Twenty Questions: Do You Know Where to Log?",
                    "Hardware is the new Software.",
                    "Return of the Runtimes: Rethinking the Language Runtime System for the Cloud 3.0 Era.",
                    "A Case Against Tiny Tasks in Iterative Analytics.",
                    "Gray Failure: The Achilles' Heel of Cloud-Scale Systems.",
                    "System Programming in Rust: Beyond Safety.",
                    "Why Your Encrypted Database Is Not Secure.",
                    "Will Serverless End the Dominance of Linux in the Cloud?",
                    "OS Support for Thread Migration and Distribution in the Fully Heterogeneous Datacenter."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15th HotOS 2015",
        "info": "Kartause Ittingen, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2015",
                "sub_name": "15th Workshop on Hot Topics in Operating Systems, HotOS XV, Kartause Ittingen, Switzerland, May 18-20, 2015.",
                "count": 29,
                "papers": [
                    "Practical Always-on Taint Tracking on Mobile Devices.",
                    "ASPIRE: Iterative Specification Synthesis for Security.",
                    "Lax: Driver Interfaces for Approximate Sensor Device Access.",
                    "The Case for Less Predictable Operating System Behavior.",
                    "Recommendations for Randomness in the Operating System, or How to Keep Evil Children out of Your Pool and Other Random Facts.",
                    "Inferring the Network Latency Requirements of Cloud Tenants.",
                    "The Most Dangerous Code in the Browser.",
                    "The Activity Platform.",
                    "Specifying Crash Safety for Storage Systems.",
                    "Beyond Storage APIs: Provable Semantics for Storage Stacks.",
                    "Amber: Decoupling User Data from Web Applications.",
                    "My OS Ought to Know Me Better: In-app Behavioural Analytics as an OS Service.",
                    "Beyond Processor-centric Operating Systems.",
                    "Not Your Parents' Physical Address Space.",
                    "From Lone Dwarfs to Giant Superclusters: Rethinking Operating System Abstractions for the Cloud.",
                    "Scalability! But at what COST?",
                    "Challenges to Adopting Stronger Consistency at Scale.",
                    "A Case for Ending Monolithic Apps for Connected Devices.",
                    "Fault Tolerance and the Five-Second Rule.",
                    "A Case for Enforcing App-Specific Constraints to Mobile Devices by Using Trust Leases.",
                    "Route Bazaar: Automatic Interdomain Contract Negotiation.",
                    "Distributing the Data Plane for Remote Storage Access.",
                    "FlexNIC: Rethinking Network DMA.",
                    "On Instruction Organization.",
                    "Failure Sketches: A Better Way to Debug.",
                    "Software Engagement with Sleeping CPUs.",
                    "Elastic Memory: Bring Elasticity Back to In-Memory Big Data Analytics.",
                    "Broom: Sweeping Out Garbage Collection from Big Data Systems.",
                    "Trash Day: Coordinating Garbage Collection in Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th HotOS 2013",
        "info": "Santa Ana Pueblo, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2013",
                "sub_name": "14th Workshop on Hot Topics in Operating Systems, HotOS XIV, Santa Ana Pueblo, New Mexico, USA, May 13-15, 2013.",
                "count": 27,
                "papers": [
                    "HAT, Not CAP: Towards Highly Available Transactions.",
                    "Lightweight Snapshots and System-level Backtracking.",
                    "Solving the Straggler Problem with Bounded Staleness.",
                    "Operating System Support for Augmented Reality Applications.",
                    "Rethinking Network Stack Design with Memory Snapshots.",
                    "Arrakis: A Case for the End of the Empire.",
                    "The von Neumann Architecture Is Due for Retirement.",
                    "Automated Debugging for Arbitrarily Long Executions.",
                    "Global Authentication in an Untrustworthy World.",
                    "-OVERIFY: Optimizing Programs for Fast Verification.",
                    "Toward Principled Browser Security.",
                    "Towards Elastic Operating Systems.",
                    "Using Dark Fiber to Displace Diesel Generators.",
                    "The Case for Tiny Tasks in Compute Clusters.",
                    "Wanted: Systems Abstractions for SDN.",
                    "When Cycles Are Cheap, Some Tables Can Be Huge.",
                    "Large-Scale Computation Not at the Cost of Expressiveness.",
                    "Escape Capsule: Explicit State Is Robust and Scalable.",
                    "Toward Common Patterns for Distributed, Concurrent, Fault-Tolerant Code.",
                    "Failure Recovery: When the Cure Is Worse Than the Disease.",
                    "QuarkOS: Pushing the Operating Limits of Micro-Powered Sensors.",
                    "Making Every Bit Count in Wide-Area Analytics.",
                    "The Case for Onloading Continuous High-Datarate Perception to the Phone.",
                    "Unified High-Performance I/O: One Stack to Rule Them All.",
                    "Virtualize Storage, Not Disks.",
                    "The NIC Is the Hypervisor: Bare-Metal Guests in IaaS Clouds.",
                    "We Need to Talk About NICs."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th HotOS 2011",
        "info": "Napa, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2011",
                "sub_name": "13th Workshop on Hot Topics in Operating Systems, HotOS XIII, Napa, California, USA, May 9-11, 2011.",
                "count": 33,
                "papers": [
                    "The Case for VOS: The Vector Operating System.",
                    "Operating Systems Must Support GPU Abstractions.",
                    "Multicore OSes: Looking Forward from 1991, er, 2011.",
                    "What If You Could Actually Trust Your Kernel?",
                    "Provable Security: How Feasible Is It?",
                    "Toward Practical and Unconditional Verification of Remote Computations.",
                    "MOMMIE Knows Best: Systematic Optimizations for Verifiable Distributed Algorithms.",
                    "Exploiting MISD Performance Opportunities in Multi-core Systems.",
                    "More Intervention Now!",
                    "make world.",
                    "Privacy Revelations for Web and Mobile Apps.",
                    "Do You Know Where Your Data Are? Secure Data Capsules for Deployable Data Protection.",
                    "Making Programs Forget: Enforcing Lifetime for Sensitive Data.",
                    "Debug Determinism: The Sweet Spot for Replay-Based Debugging.",
                    "Non-Deterministic Parallelism Considered Useful.",
                    "Finding Concurrency Errors in Sequential Code - OS-level, In-vivo Model Checking of Process Races.",
                    "The Case for Power-Agile Computing.",
                    "Mobile Apps: It's Time to Move Up to CondOS.",
                    "Free Lunch: Exploiting Renewable Energy for Computing.",
                    "Disk-Locality in Datacenter Computing Considered Irrelevant.",
                    "Optimizing Data Partitioning for Data-Parallel Computing.",
                    "Disks Are Like Snowflakes: No Two Are Alike.",
                    "Benchmarking File System Benchmarking: It *IS* Rocket Science.",
                    "Multicore OS Benchmarks: We Can Do Better.",
                    "It's Time for Low Latency.",
                    "Macho: Programming with Man Pages.",
                    "Pursue Robust Indefinite Scalability.",
                    "The Best of Both Worlds with On-Demand Virtualization.",
                    "Repair from a Chair: Computer Repair as an Untrusted Cloud Service.",
                    "Structuring the Unstructured Middle with Chunk Computing.",
                    "Mind the Gap: Reconnecting Architecture and OS Research.",
                    "Operating System Implications of Fast, Cheap, Non-Volatile Memory.",
                    "Virtually Cool Ternary Content Addressable Memory."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th HotOS 2009",
        "info": "Monte Verità, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2009",
                "sub_name": "Proceedings of HotOS'09: 12th Workshop on Hot Topics in Operating Systems, May 18-20, 2009, Monte Verità, Switzerland.",
                "count": 22,
                "papers": [
                    "Hierarchical File Systems Are Dead.",
                    "An End to the Middle.",
                    "No Time for Asynchrony.",
                    "Computer Meteorology: Monitoring Compute Clouds.",
                    "Wave Computing in the Cloud.",
                    "On Availability of Intermediate Data in Cloud Computations.",
                    "Mobility Changes Everything in Low-Power Wireless Sensornets.",
                    "Augmented Smartphone Applications Through Clone Cloud Execution.",
                    "Peloton: Coordinated Resource Management for Sensor Networks.",
                    "Migration without Virtualization.",
                    "Operating Systems Should Provide Transactions.",
                    "Your computer is already a distributed system. Why isn't your OS?",
                    "FlashVM: Revisiting the Virtual Memory Hierarchy.",
                    "Operating System Support for NVM+DRAM Hybrid Main Memory.",
                    "Hera-JVM: Abstracting Processor Heterogeneity Behind a Virtual Machine.",
                    "Security Impact Ratings Considered Harmful.",
                    "If It Ain't Broke, Don't Fix It: Challenges and New Directions for Inferring the Impact of Software Patches.",
                    "Simplifying Distributed System Development.",
                    "Automated Experiment-Driven Management of (Database) Systems.",
                    "FLUXO: A Simple Service Compiler.",
                    "Reinventing Scheduling for Multicore Systems.",
                    "FAWNdamentally Power-efficient Clusters."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11th HotOS 2007",
        "info": "San Diego, California, USA",
        "venues": []
    },
    {
        "year": "2005",
        "name": "10th HotOS 2005",
        "info": "Santa Fe, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2007",
                "sub_name": "Proceedings of HotOS'07: 11th Workshop on Hot Topics in Operating Systems, May 7-9, 2005, San Diego, California, USA.",
                "count": 21,
                "papers": [
                    "Is the Optimism in Optimistic Concurrency Warranted?",
                    "Thread Scheduling for Multi-Core Platforms.",
                    "Automatic Mutual Exclusion.",
                    "Hype and Virtue.",
                    "Relaxed Determinism: Making Redundant Execution on Multiprocessors Practical.",
                    "Compatibility Is Not Transparency: VMM Detection Myths and Realities.",
                    "Don't Settle for Less Than the Best: Use Optimization to Make Decisions.",
                    "Hyperspaces for Object Clustering and Approximate Matching in Peer-to-Peer Overlays.",
                    "Optimizing Power Consumption in Large Scale Storage Systems.",
                    "Can Ferris Bueller Still Have His Day Off? Protecting Privacy in the Wireless Era.",
                    "Auditing to Keep Online Storage Services Honest.",
                    "A Web Based Covert File System.",
                    "Purely Functional System Configuration Management.",
                    "Processor Hardware Counter Statistics as a First-Class System Resource.",
                    "Microdrivers: A New Architecture for Device Drivers.",
                    "MashupOS: Operating System Abstractions for Client Mashups.",
                    "Live Monitoring: Using Adaptive Instrumentation and Analysis to Debug and Maintain Web Applications.",
                    "End-to-End Web Application Security.",
                    "HotComments: How to Make Program Comments More Useful?",
                    "Towards a Practical, Verified Kernel.",
                    "Beyond Bug-Finding: Sound Program Analysis for Linux."
                ]
            },
            {
                "sub_name_abbr": "conf/hotos/2005",
                "sub_name": "Proceedings of HotOS'05: 10th Workshop on Hot Topics in Operating Systems, June 12-15, 2005, Santa Fe, New Mexico, USA.",
                "count": 26,
                "papers": [
                    "Are Virtual Machine Monitors Microkernels Done Right?",
                    "OS Verification - Now!",
                    "Making Events Less Slippery with eel.",
                    "Parallax: Managing Storage for a Million Machines.",
                    "Stupid File Systems Are Better.",
                    "Aggressive Prefetching: An Idea Whose Time Has Come.",
                    "Why Markets Could (But Don't Currently) Solve Resource Allocation Problems in Systems.",
                    "Operating Systems Should Support Business Change.",
                    "Designing Controllable Computer Systems.",
                    "Three Research Challenges at the Intersection of Machine Learning, Statistical Induction, and Systems.",
                    "Making System Configuration More Declarative.",
                    "Reducing the Cost of IT Operations - Is Automation Always the Answer?",
                    "Human-Aware Computer System Design.",
                    "Thirty Years Is Long Enough: Getting Beyond C.",
                    "Broad New OS Research: Challenges and Opportunities.",
                    "Patch (1) Considered Harmful.",
                    "WiDS: An Integrated Toolkit for Distributed System Development.",
                    "Causeway: Operating System Support for Controlling and Analyzing the Execution of Distributed Programs.",
                    "Treating Bugs as Allergies: A Safe Method for Surviving Software Failures.",
                    "When Virtual Is Harder than Real: Security Challenges in Virtual Machine Based Computing Environments.",
                    "Make Least Privilege a Right (Not a Privilege).",
                    "Access Control in a World of Software Diversity.",
                    "PRESTO: A Predictive Storage Architecture for Sensor Networks.",
                    "Towards a Sensor Network Architecture: Lowering the Waistline.",
                    "Falling Off the Cliff: When Systems Go Nonlinear.",
                    "The Many Faces of Systems Research - and How to Evaluate Them."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th HotOS 2003",
        "info": "Lihue (Kauai), Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2003",
                "sub_name": "Proceedings of HotOS'03: 9th Workshop on Hot Topics in Operating Systems, May 18-21, 2003, Lihue (Kauai), Hawaii, USA.",
                "count": 31,
                "papers": [
                    "High Availability, Scalable Storage, Dynamic Peer Networks: Pick Two.",
                    "One Hop Lookups for Peer-to-Peer Overlays.",
                    "An Analysis of Compare-by-hash.",
                    "Why Events Are a Bad Idea (for High-Concurrency Servers).",
                    "TCP Offload Is a Dumb Idea Whose Time Has Come.",
                    "TCP Meets Mobile Code.",
                    "Exploiting the Synergy between Peer-to-Peer and Mobile Ad Hoc Networks.",
                    "Scheduling and Simulation: How to Upgrade Distributed Systems.",
                    "Development Tools for Distributed Applications.",
                    "Virtual Appliances in the Collective: A Road to Hassle-Free Computing.",
                    "POST: A Secure, Resilient, Cooperative Messaging System.",
                    "Crash-Only Software.",
                    "The Phoenix Recovery System: Rebuilding from the Ashes of an Internet Catastrophe.",
                    "Using Runtime Paths for Macroanalysis.",
                    "Magpie: Online Modelling and Performance-aware Systems.",
                    "Using Computers to Diagnose Computer Problems.",
                    "Using Performance Reflection in Systems Software.",
                    "Cassyopia: Compiler Assisted System Optimization.",
                    "Cosy: Develop in User-Land, Run in Kernel-Mode.",
                    "Why Can't I Find My Files? New Methods for Automating Attribute Assignment.",
                    "Secure Data Replication over Untrusted Hosts.",
                    "Palimpsest: Soft-Capacity Storage for Planetary-Scale Services.",
                    "Certifying Program Execution with Secure Processors.",
                    "Hardware Works, Software Doesn't: Enforcing Modularity with Mondriaan Memory Protection.",
                    "Flexible OS Support and Applications for Trusted Computing.",
                    "Sensing User Intention and Context for Energy Management.",
                    "Access Control to Information in Pervasive Computing Environments.",
                    "Privacy-Aware Location Sensor Networks.",
                    "FAB: Enterprise Storage Systems on a Shoestring.",
                    "The Case for a Session State Storage Layer.",
                    "Towards a Semantic-Aware File Store."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th HotOS 2001",
        "info": "Elmau/Oberbayern, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/2001",
                "sub_name": "Proceedings of HotOS-VIII: 8th Workshop on Hot Topics in Operating Systems, May 20-23, 2001, Elmau/Oberbayern, Germany.",
                "count": 54,
                "papers": [
                    "Beyond Address Spaces - Flexibility, Performance, Protection, and Resource Management in the Type-Safe JX Operating System.",
                    "Design Issues in System Support for Programmable Routers.",
                    "Lazy Process Switching.",
                    "Robustness in Complex Systems.",
                    "Using Abstraction To Improve Fault Tolerance.",
                    "Fail-Stutter Fault Tolerance.",
                    "Smart Card Operating Systems: Overview and Trends.",
                    "Reconsidering Internet Mobility.",
                    "Protium, an Infrastructure for Partitioned Applications.",
                    "Probabilistic Modelling of Replica Divergence.",
                    "Self-Tuned Remote Execution for Pervasive Computing.",
                    "Energy is just another resource: Energy accountin and energy pricing in the Nemesis OS.",
                    "PAST: A large-scale, persistent peer-to-peer storage utility.",
                    "Building peer-to-peer systems with Chord, a distributed lookup service.",
                    "Herald: Achieving a Global Event Notification Service.",
                    "HeRMES: High-Performance Reliable MRAM-Enabled Storage.",
                    "Better Security via Smarter Devices.",
                    "Research Issues in No-Futz Computing.",
                    "Don't Trust your File Server.",
                    "Active Protocols for Agile, Censor-Resistant Networks.",
                    "Recursive Restartability: Turning the Reboot Sledgehammer into a Scalpel.",
                    "When Virtual is Better than Real.",
                    "Virtualization Considered Harmful: OS Design Directions for Well-Conditioned Services.",
                    "Systems Directions for Pervasive Computing.",
                    "The Case for Resilient Overlay Networks.",
                    "Bossa: A DSL Framework for Application-Specific Scheduling Policies.",
                    "Supporting Coordinated Adaption in Networked Systems.",
                    "Active Streams-An Approach to Adaptive Distributed Systems.",
                    "Middleware for Mobile Computing: Awareness vs. Transparency.",
                    "Energy Management for Server Clusters.",
                    "Aspect-Oriented System Structure.",
                    "Architectures for Adaption Systems.",
                    "Secure OS Extensibility Needn't Cost an Arm and a Leg.",
                    "Authentication Confidences.",
                    "Supporting Hot-Swappable Components for System Software.",
                    "A Backup Appliance Composed of High-Capacity Disk Drives.",
                    "Towards Zero-Code Service Composition.",
                    "Separating Mobility from Mobile Agents.",
                    "A Streaming Interface for Real-Time Interprocess Communication.",
                    "DiPS: A Unifying Approach for Developing System Software.",
                    "Toward a Rigorous Data Type Model for HTTP.",
                    "Hinting for Goodness' Sake.",
                    "Applying the VVM Kernel to Flexible Web Caches.",
                    "Supporting Disconnected Operation in DOORS.",
                    "The Lana Aproach to Wireless Computing.",
                    "Smart Messages: A System Architecture for Large Networks of Embedded Systems.",
                    "Transport Layer Support for Highly-Available Network Services.",
                    "Mansion, A Distributed Multi-Agent System.",
                    "Towards Global Storage Management and Data Placement.",
                    "Censorship Resistant Publishing Through Document Entanglements.",
                    "The Conquest File System's Life after Disks.",
                    "The Importance of Good Plumbing-Reconsidering Infrastructure in Distributed Systems.",
                    "EOS - The Dawn of the Resource Economy.",
                    "Anypoint Communication Protocol."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th HotOS 1999",
        "info": "Rio Rico, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/1999",
                "sub_name": "Proceedings of The Seventh Workshop on Hot Topics in Operating Systems, HotOS-VII, Rio Rico, Arizona, USA, March 28-30, 1999.",
                "count": 31,
                "papers": [
                    "Elephant: The File System That Never Forgets.",
                    "Caching Documents with Active Properties.",
                    "The Case for Efficient File Access Pattern Modeling.",
                    "File Systems for CE Equipment.",
                    "The Box: A Replacement for Files.",
                    "ISTORE: Introspective Storage for Data-Intensive Network Services.",
                    "OS Support for General-Purpose Routers.",
                    "Conductor: A Framework for Distributed Adaptation.",
                    "An End-System Architecture for Unified Congestion Management.",
                    "The Case for Informed Transport Protocols.",
                    "Transparent Communication Management in Wireless Networks.",
                    "The Case for Better Throughput Estimation.",
                    "Operating Systems Support for Programmable Cluster-based Internet Routers.",
                    "A Case for Buffer Servers.",
                    "Brittle Metrics in Operating Systems Research.",
                    "The Problems You're Having May Not Be the Problems You Think You're Having: Results from a Latency Study of Windows NT.",
                    "The Case for Application-Specific Benchmarking.",
                    "Intra-Address Space Protection using Segmentation Hardware.",
                    "Drawing the Red Line in Java.",
                    "Hey, You Got Your Compiler in My Operating System!",
                    "Soft Real Time Scheduling for General Purpose Client-Server Systems.",
                    "Xenoservers: Accountable Execution of Untrusted Programs.",
                    "An Economic Approach to Adaptive Resource Management.",
                    "Tickets and Currencies Revisited: Extensions to Multi-Resouce Lottery Scheduling.",
                    "How To Schedule Unlimited Memory Pinning of Untrusted Processes Or Provisional Ideas about Service-Neutrality.",
                    "The Case for Higher-Level Power Management.",
                    "Reliability Hierarchies.",
                    "Harvest, Yield and Scalable Tolerant Systems.",
                    "Command Management System for Next-Generation User Input.",
                    "Practical Security Systems with Smartcards.",
                    "Flexible Access Control using IPC Redirection."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "6th HotOS 1997",
        "info": "Cape Cod, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/1997",
                "sub_name": "Proceedings of The Sixth Workshop on Hot Topics in Operating Systems, HotOS-VI, Cape Cod, Massachusetts, USA, May 5-6, 1997.",
                "count": 23,
                "papers": [
                    "Experience with the Development of a Microkernel-Based, Multi-Server Operating System.",
                    "The Failure of Personalities to Generalize.",
                    "The Flux OS Toolkit: Reusable Components for OS Implementation.",
                    "Formal Methods: A Practical Tool for OS Implementors.",
                    "Achieved IPC Performance.",
                    "The Network Hardware is the Operating System.",
                    "Extensible Systems are Leading OS Research Astray.",
                    "Customization Lite.",
                    "Operating Systems for Component Software Environments.",
                    "Secure Applications Need Flexible Operating Systems.",
                    "Security for Extensible Systems.",
                    "Building Diverse Computer Systems.",
                    "Preventing Denial-of-Service Attacks on a µ-Kernel for WebOSes.",
                    "Query Routing: Applying Systems Thinking to Internet Search.",
                    "General Purpose Proxies: Solved and Unsolved Problems.",
                    "Reduce, Reuse, Recycle: An Approach to Building Large Internet Caches.",
                    "Distributed Systems Support for Networked Games.",
                    "Operating System Directions for the Next Millennium.",
                    "Run-Time Code Generation as a Central System Service.",
                    "What Synchronous Groupware Needs: Notification Services.",
                    "Self-Modifying and Self-Adapting Operating Systems.",
                    "A Fresh Look at Memory Hierarchy Management.",
                    "The Role of Trace Modulation in Building Mobile Computing Systems."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th HotOS 1995",
        "info": "Orcas Island, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/1995",
                "sub_name": "Fifth Workshop on Hot Topics in Operating Systems, HotOS-V, Orcas Island, Washington, USA, May 4-5, 1995.",
                "count": 26,
                "papers": [
                    "Real-time is no longer a small specialized niche.",
                    "Continuous and multimedia OS support in real-time control applications.",
                    "Modular real-time resource management in the Rialto operating system.",
                    "Real-time operating systems for multimedia processing.",
                    "Effective wireless communication through application partitioning.",
                    "Intelligent communication filtering for limited bandwidth environments.",
                    "Efficient TCP over networks with wireless links.",
                    "Operating system support for mobile agents.",
                    "Meta-scripts as a mechanism for complex web services.",
                    "The case for geographical push-caching.",
                    "Scout: a communications-oriented operating system.",
                    "Protection is a software issue.",
                    "The grand unified theory of address spaces.",
                    "AVM: application-level virtual memory.",
                    "Exterminate all operating system abstractions.",
                    "Paramecium: an extensible object-based kernel.",
                    "μChoices: an object-oriented multimedia operating system.",
                    "Adaptive operating system design using reflection.",
                    "Application of meta-protocols to improve OS services.",
                    "A memory approach to consistent, reliable distributed shared memory.",
                    "Generic support for synchronization and consistency in Arias.",
                    "Distributed shared memory: where we are and where we should be headed.",
                    "Improving data consistency in mobile computing using isolation-only transactions.",
                    "Shared data management needs adaptive methods.",
                    "Using dynamic sets to overcome high I/O latencies during search.",
                    "Are we answering the right research questions for commercial operating systems?"
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th WWOS 1993",
        "info": "Napa, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/1993",
                "sub_name": "Proceedings Fourth Workshop on Workstation Operating Systems, WWOS 1993, Napa, California, USA, October 14-15, 1993.",
                "count": 34,
                "papers": [
                    "Operating System Issues for PDAs.",
                    "A Microkernel-Based Operating System for Personal Digital Assistants.",
                    "Mobile Computing Personae.",
                    "Operating System Implications of Solid-State Mobile Computers.",
                    "How to Program Networked Portable Computers.",
                    "The PARCTAB Mobile Computing System.",
                    "User Interface Issues in Mobile Computing.",
                    "Providing Network Video Service to Mobile Clients.",
                    "Using Reconciliation to Share Files Between Occasionally Connected Computers.",
                    "Generic Support for Caching and Disconnected Operation.",
                    "Supporting Application-Specific Resolution in an Optimistically Replicated File System.",
                    "xFS: A Wide Area Mass Storage File System.",
                    "Careful Protocols or How to Use Highly Reliable Networks.",
                    "Ubiquitous Mobil Host Internetworking.",
                    "Handling Mobile Clients: A Case for Indirect Interaction.",
                    "Transparent Mistrust: OS Support for Cryptography-in-the-Large.",
                    "Virtual Memory Support for Multiple Page Sizes.",
                    "Big Memories on the Desktop.",
                    "eNVy: A NonVolatile Main Memory Storage System.",
                    "Object Groups May Be Better Than Pages.",
                    "Feedback-Based Scheduling: a Toolbox Approach.",
                    "Processor Capacity Reserves: An Abstraction for Managing Processor Usage.",
                    "Adaptive Real-Time Resource Management Supporting Composition of Independently Authored Time-Critical Services.",
                    "Distributed Shared Object Memory.",
                    "Some Issues for Single Address Space Systems.",
                    "Resolving the Integrity/Performance Conflict.",
                    "The Case for Run-Time Replaceable Kernel Modules.",
                    "The Need for Customizable Operating Systems.",
                    "Service without Servers.",
                    "Software Methods for System Address Tracing.",
                    "The Persistent Relevance of IPC Performance: New Techniques for Reducing the IPC Penalty.",
                    "Invocation Chaining: Manipulating Lightweight Objects across Heavyweight Boundaries.",
                    "Self-Tuning Software.",
                    "FLEX: A Tool for Building Efficient and Flexible Systems."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "3rd WWOS 1991",
        "info": "",
        "venues": []
    },
    {
        "year": "1989",
        "name": "2nd WWOS 1989",
        "info": "Pacific Grove, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/hotos/1989",
                "sub_name": "Proceedings of the Second Workshop On Workstation Operating Systems, WWOS 1989, Pacific Grove, CA, USA, 27-29 September 1989.",
                "count": 24,
                "papers": [
                    "A file storage implementation for very large distributed systems.",
                    "The workstation as global communication interface.",
                    "Efficient shared memory for testing parallel algorithms on distributed systems.",
                    "Experience with object-based distributed computation in the GUIDE operating system.",
                    "Architecture of fault-tolerant multiprocessor workstations.",
                    "Supporting large scale applications on networks of workstations.",
                    "PLURIX: a multiprocessing Unix-like operating system.",
                    "Operating system support for an object-oriented environment.",
                    "Comments on workstation operating systems and virtual memory.",
                    "Availability and Consistency Tradeoffs in the Echo Distributed File System.",
                    "The x-kernel: an open operating system design.",
                    "Ubik: replicated servers made easy.",
                    "The connector and active devices mechanisms for constructing multimedia applications.",
                    "Efficient at-most-once messages based on synchronized clocks.",
                    "What is the right amount of statelessness in a file server?",
                    "The Raven project (distributed object-oriented OS).",
                    "Workstations and the virtual system model.",
                    "AIX 3 technology (operating system).",
                    "The workstation on the network: performance considerations for the communications interface.",
                    "Mach: a foundation for open systems (operating systems).",
                    "Coda: a highly available file system for a distributed workstation environment.",
                    "A prototype information environment.",
                    "A multi-user, multi-language open operating system.",
                    "Sprite position statement: use distributed state for failure recovery."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "1st WWOS 1987",
        "info": "",
        "venues": []
    }
]