[
    {
        "year": "2020",
        "name": "25th ICECCS 2020",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2020",
                "sub_name": "25th International Conference on Engineering of Complex Computer Systems, ICECCS 2020, Singapore, October 28-31, 2020.",
                "count": 25,
                "papers": [
                    "Visual counterexample explanation for model checking with OERITTE.",
                    "CTL Model Checking of Self Modifying Code.",
                    "Formal Verification of Access Control Model for My Health Record System.",
                    "RL: a Language for Formal Engineering.",
                    "Parametric non-interference in timed automata.",
                    "Automatic Verification of Multi-threaded Programs by Inference of Rely-Guarantee Specifications.",
                    "Deep Learning Application in Broadcast Tennis Video Annotation.",
                    "SeqMobile: An Efficient Sequence-Based Malware Detection System Using RNN on Mobile Devices.",
                    "An Empirical Study on Correlation between Coverage and Robustness for Deep Neural Networks.",
                    "Safety Controller Synthesis for Collaborative Robots.",
                    "Achieving Weight Coverage for an Autonomous Driving System with Search-based Test Generation.",
                    "Formal Synthesis of Trajectories for Unmanned Aerial Vehicles to Perform Resilient Surveillance of Critical Power Transmission Lines.",
                    "Towards Deductive Verification of Control Algorithms for Autonomous Marine Vehicles.",
                    "The Burn-to-Claim cross-blockchain asset transfer protocol.",
                    "DEPOSafe: Demystifying the Fake Deposit Vulnerability in Ethereum Smart Contracts.",
                    "Foggy: A New Anonymous Communication Architecture Based on Microservices.",
                    "Gathering GitHub OSS Requirements from Q&A Community: an Empirical Study.",
                    "IFIX: Fixing Concurrency Bugs While They Are Introduced.",
                    "A Fault Localization Approach Derived From Testing-based Formal Verification.",
                    "The Semantic Spreadsheet.",
                    "ReoFS: A Read-Efficient and Write-Optimized File System for Persistent Memory.",
                    "ROS-FM: Fast Monitoring for the Robotic Operating System(ROS).",
                    "Optimizing Communication Strategies in Contested and Dynamic Environments.",
                    "An Anytime Algorithm for Large-scale Heterogeneous Task Allocation.",
                    "Automated Planning for Software Architectural Migration."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th ICECCS 2019",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2019",
                "sub_name": "24th International Conference on Engineering of Complex Computer Systems, ICECCS 2019, Guangzhou, China, November 10-13, 2019.",
                "count": 27,
                "papers": [
                    "LTL Model Checking of Self Modifying Code.",
                    "Formal Verification of Dynamic and Stochastic Behaviors for Automotive Systems.",
                    "Checking Multi-Agent Systems Against Temporal-Epistemic Specifications.",
                    "Joint Prediction of Multiple Vulnerability Characteristics Through Multi-Task Learning.",
                    "Static Detection of Control-Flow-Related Vulnerabilities Using Graph Embedding.",
                    "Industry-Oriented Project-Based Learning of Software Engineering.",
                    "MobiDroid: A Performance-Sensitive Malware Detection System on Mobile Platform.",
                    "Squeezing State Spaces of (Attack-Defence) Trees.",
                    "QuickAdapt: Scalable Adaptation for Big Data Cyber Security Analytics.",
                    "On the Expressive Power of Invariants in Parametric Timed Automata.",
                    "Behaviour-Driven Formal Model Development of the ETCS Hybrid Level 3.",
                    "Modelling Hybrid Train Speed Controller using Proof and Refinement.",
                    "Efficient Contention-Aware Scheduling of SDF Graphs on Shared Multi-Bank Memory.",
                    "Adaptive Randomized Scheduling for Concurrency Bug Detection.",
                    "Efficient Retiming of Unfolded Synchronous Dataflow Graphs.",
                    "A Formally Verified Buddy Memory Allocation Model.",
                    "EFLightPM: An Efficient and Lightweight Persistent Memory System.",
                    "Toward New Unit-Testing Techniques for Shared-Memory Concurrent Programs.",
                    "Automatic Difficulty Management and Testing in Games using a Framework Based on Behavior Trees and Genetic Algorithms.",
                    "Safe Inputs Approximation for Black-Box Systems.",
                    "Assessing the Relation Between Hazards and Variability in Automotive Systems.",
                    "On the Evolution of Mobile App Complexity.",
                    "Apla Generic Constraint Matching Detection and Verification.",
                    "Bi-Abductive Inference for Shape and Ordering Properties.",
                    "Recovering Software Architecture Product Lines.",
                    "A Formal Methods Approach to Security Requirements Specification and Verification.",
                    "Measuring Opacity for Non-Probabilistic DES: a SOG-Based Approach."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd ICECCS 2018",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2018",
                "sub_name": "23rd International Conference on Engineering of Complex Computer Systems, ICECCS 2018, Melbourne, Australia, December 12-14, 2018.",
                "count": 29,
                "papers": [
                    "Layered and Collecting NDFS with Subsumption for Parametric Timed Automata.",
                    "Offline Timed Pattern Matching under Uncertainty.",
                    "HOMESCAN: Scrutinizing Implementations of Smart Home Integrations.",
                    "B-Repair: Repairing B-Models Using Machine Learning.",
                    "State Compression Based on One-Sided Communications for Distributed Model Checking.",
                    "Towards Mining Comprehensive Android Sandboxes.",
                    "Cultural Influences on the Requirements Engineering Process: Lessons Learned from Practice.",
                    "Modelling and Verification of Large-Scale Sensor Network Infrastructures.",
                    "Multi-Level Multi-Stage Agent-Based Decision Support System for Simulation of Crowd Dynamics.",
                    "A Model-Based Approach for Design Time Elasticity Rules Generation.",
                    "EH-Recommender: Recommending Exception Handling Strategies Based on Program Context.",
                    "Section-Blockchain: A Storage Reduced Blockchain Protocol, the Foundation of an Autotrophic Decentralized Storage Architecture.",
                    "Variant Region Types.",
                    "Formal Ontology Driven Model Refactoring.",
                    "Extended Algebraic State-Transition Diagrams.",
                    "SMI: Stack Management Interface.",
                    "Back Propagating B System Updates on SysML/KAOS Domain Models.",
                    "Design Verification and Validation for Reliable Safety-Critical Autonomous Control Systems.",
                    "Efficient Algorithms and Tools for MITL Model-Checking and Synthesis.",
                    "AWaRE - Towards Distributed Self-Management for Resilient Cyber Systems.",
                    "Reusing Formal Models via Lifting.",
                    "Semi-Supervised Approach for Recovering Traceability Links in Complex Systems.",
                    "Formal Analysis of a Proof-of-Stake Blockchain.",
                    "Formal Modeling and Security Analysis for OpenFlow-Based Networks.",
                    "Kinship Determination in Mobile Social Networks.",
                    "Scalable Correct-by-Construction Conversation Protocols with Event-B: Validation, Experiments and Benchmarks.",
                    "Facilitating the Adoption of Standards through Model-Based Representation.",
                    "Design Concerns for Industrial Big Data System in the Smart Factory Domain: From Product Lifecycle View.",
                    "Software Product Line Extraction from Bytecode Based Applications."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22nd ICECCS 2017",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2017",
                "sub_name": "22nd International Conference on Engineering of Complex Computer Systems, ICECCS 2017, Fukuoka, Japan, November 5-8, 2017.",
                "count": 23,
                "papers": [
                    "Efficient Parameter Synthesis Using Optimized State Exploration Strategies.",
                    "Integrating Tools: Co-simulation in UPPAAL Using FMI-FMU.",
                    "Extending ERS for Modelling Dynamic Workflows in Event-B.",
                    "TLSsem: A TLS Security-Enhanced Mechanism against MITM Attacks in Public WiFis.",
                    "Distributed Object-Oriented Design of Autonomous Control Systems for Connected Vehicle Platoons.",
                    "BigrTiMo-A Process Algebra for Structure-Aware Mobile Systems.",
                    "Study of Software-Related Causes in the FDA Medical Device Recalls.",
                    "Learning Likely Invariants to Explain Why a Program Fails.",
                    "Search-Based Uncertainty-Wise Requirements Prioritization.",
                    "Enhancing Knowledge Sharing in Stack Overflow via Automatic External Web Resources Linking.",
                    "A Composition Mechanism for Refinement-Based Methods.",
                    "Class Modularization Using Indirect Relationships.",
                    "Reachability Analysis of Self Modifying Code.",
                    "A Unified Framework for Throughput Analysis of Streaming Applications under Memory Constraints.",
                    "Speeding Up Type-Specific Instrumentation for the Analysis of Complex Systems.",
                    "Multi-modeling Approach to Performance Engineering of Cyber-Physical Systems Design.",
                    "Formal Modeling and Automatic Code Synthesis for Robot System.",
                    "Towards Solving Decision Making Problems Using Probabilistic Model Checking.",
                    "Software Reliability Modeling and Analysis via Kernel-Based Approach.",
                    "Evaluating Suitability of Applying Blockchain.",
                    "Decomposition and Collaboration of Industrial Control System with Resource Constraints.",
                    "A Model Driven Method to Design and Analyze Secure Architectures of Systems-of-Systems.",
                    "Functional Requirements-Based Automated Testing for Avionics."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21st ICECCS 2016",
        "info": "Dubai, United Arab Emirates",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2016",
                "sub_name": "21st International Conference on Engineering of Complex Computer Systems, ICECCS 2016, Dubai, United Arab Emirates, November 6-8, 2016.",
                "count": 32,
                "papers": [
                    "Fostering Software Architect and Programmer Collaboration.",
                    "Formally Describing the Architectural Behavior of Software-Intensive Systems-of-Systems with SosADL.",
                    "TORUS: Tracing Complex Requirements for Large Cyber-Physical Systems.",
                    "A Spatial Logic for Modeling and Verification of Collision-Free Control of Vehicles.",
                    "Stepwise Formal Modeling and Verification of Self-Adaptive Systems with Event-B. The Automatic Rover Protection Case Study.",
                    "Verification of Nash-Equilibrium for Probabilistic BAR Systems.",
                    "A Semantic Approach for Managing Trust and Uncertainty in Distributed Systems Environments.",
                    "Semantic Technologies for Realising Decentralised Applications for the Web of Things.",
                    "Engineering Socially-Aware Systems and Applications.",
                    "Pareto Optimal Scheduling for Synchronous Data Flow Graphs on Heterogeneous Multiprocessor.",
                    "Improving Quality of Use Case Documents through Learning and User Interaction.",
                    "An Experiment on Decision Diagrams for Model Checking Probabilistic Timed Automata.",
                    "Data Analysis of Digital Currency Networks: Namecoin Case Study.",
                    "Developing Multi-view Contracts Using Event-B and Uppaal Timed Automata.",
                    "Concurrent On-the-Fly SCC Detection for Automata-Based Model Checking with Fairness Assumption.",
                    "Universal Analysis and Detection Framework for Location Aided Routing.",
                    "Guiding the Selection of Security Patterns for Real-Time Systems.",
                    "Using Mobile Phone Based Camera to Read Information from a Li-Fi Source.",
                    "Towards SDN Network Proofs - Taming a Complex System.",
                    "From Code to Design: A Reverse Engineering Approach.",
                    "CostDL: A Cost Models Description Language for Performance Metrics in Database.",
                    "A Collaborative Code Review Platform for GitHub.",
                    "Meduse: An Approach for Tailoring Software Development Process.",
                    "Bridging Missions and Architecture in Software-Intensive Systems-of-Systems.",
                    "Modelling Link State Routing in Event-B.",
                    "Towards a User-Guided Difference-Based Detection of Atomic Changes.",
                    "Extracting Permission-Based Specifications from a Sequential Java Program.",
                    "Towards Using Concurrent Java API Correctly.",
                    "Application of Organizational Process Asset Library in High Maturity Process Improvement.",
                    "Experimental Frailty Model towards an Adaptable Service Delivery for Aging People.",
                    "Automatic Construction of Callback Model for Android Application.",
                    "Detecting Inconsistencies in Rule-Based Reasoning for Ambient Intelligence."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20th ICECCS 2015",
        "info": "Gold Coast, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2015",
                "sub_name": "20th International Conference on Engineering of Complex Computer Systems, ICECCS 2015, Gold Coast, Australia, December 9-12, 2015.",
                "count": 30,
                "papers": [
                    "Architecture Exploration of Real-Time Systems Based on Multi-objective Optimization.",
                    "Fitness Landscape Characterisation for Constrained Software Architecture Optimisation Problems.",
                    "Multi-objectives Refinement of AADL Models for the Synthesis Embedded Systems (mu-RAMSES).",
                    "A Make/Buy/Reuse Feature Development Framework for Product Line Evolution.",
                    "Combining Software Metrics and Text Features for Vulnerable File Prediction.",
                    "Hardened Flow-Sensitive Trace Formula for Fault Localization.",
                    "All Your Sessions Are Belong to Us: Investigating Authenticator Leakage through Backup Channels on Android.",
                    "Improving Tenants' Trust in SaaS Applications Using Dynamic Security Monitors.",
                    "Design and Evaluation of Feature Distributed Malware Attacks against the Internet of Things (IoT).",
                    "Formal Analysis of a Single Sign-On Protocol Implementation for Android.",
                    "GPU Accelerated On-the-Fly Reachability Checking.",
                    "The Complexity of Deadline Analysis for Workflow Graphs with a Single Resource.",
                    "Verifying FreeRTOS' Cyclic Doubly Linked List Implementation: From Abstract Specification to Machine Code.",
                    "Formal Development of a Real-Time Operating System Memory Manager.",
                    "Towards a Session Logic for Communication Protocols.",
                    "A Formal Framework for Reasoning Emergent Behaviors in Swarm Robotic Systems.",
                    "Probabilistic Denotational Semantics for an Interrupt Modelling Language.",
                    "Conversing at Many Layers: Multi-layer System-on-Chip Protocol Conversion.",
                    "SeBip: A Symbolic Executor for BIP.",
                    "Improved Recovery for Proactive, Distributed Routing.",
                    "Sports Strategy Analytics Using Probabilistic Reasoning.",
                    "Web Application Architecture Security Evaluation Method Based on AADL.",
                    "Security Concepts as Add-On for Process Models.",
                    "Semantic Network Model: A Reasoning Engine for Software Requirements.",
                    "Requirements-Aided Automatic Test Case Generation for Industrial Cyber-physical Systems.",
                    "Formal Certification of Non-interferent Android Bytecode (DEX Bytecode).",
                    "Comparing Routing Protocols.",
                    "Parallel and Distributed Algorithms for Model Checking Problems (Doctoral Consortium).",
                    "Analyzing Security Property of Android Application Implementation Using Formal Method.",
                    "An Invariant Inference Framework by Active Learning and SVMs."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19th ICECCS 2014",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2014",
                "sub_name": "2014 19th International Conference on Engineering of Complex Computer Systems, Tianjin, China, August 4-7, 2014.",
                "count": 29,
                "papers": [
                    "From TiMo to Event-B: Event-Driven Timed Mobility.",
                    "Symbolic Analysis of an Electric Vehicle Charging Protocol.",
                    "An Extended UML Method for the Verification of Security Protocols.",
                    "DroidVault: A Trusted Data Vault for Android Devices.",
                    "Automatic Defect Categorization Based on Fault Triggering Conditions.",
                    "Understanding Complex Binary Loading Behaviors.",
                    "Design and Analysis of Security Attacks against Critical Smart Grid Infrastructures.",
                    "An Adaptive Auto-configuration Tool for Hadoop.",
                    "QScheduler: A Tool for Parallel Query Processing in Database Systems.",
                    "Deriving Usage Model Variants for Model-Based Testing: An Industrial Case Study.",
                    "A Reference Framework for the Automated Exploration of Web Applications.",
                    "A Thread Behavior-Based Memory Management Framework on Multi-core Smartphone.",
                    "Evolving Commitments for Self-Adaptive Socio-technical Systems.",
                    "Clause Replication and Reuse in Incremental Temporal Induction.",
                    "Generating SystemC Implementations for Clock Constraints Specified in UML/MARTE CCSL.",
                    "Automatic Fine-Grained Issue Report Reclassification.",
                    "How Do Open Source Communities Document Software Architecture: An Exploratory Survey.",
                    "Behavior Gaps and Relations between Operating System and Applications on Accessing DRAM.",
                    "OOPN-SRAM: A Novel Method for Software Risk Assessment.",
                    "SQLR: Grammar-Guided Validation of SQL Injection Sanitizers.",
                    "A Trace-Based JIT Compilation Framework for XQuery.",
                    "Exact and Efficient Temporal Steering of Software Behavioral Model Inference.",
                    "A Refinement Calculus for Hybrid Systems.",
                    "Knowledge Base Construction Process for Smart-City Services.",
                    "A Lazy Evaluation Strategy for Assessing Network Device Configuration Correctness.",
                    "A Behavior-Aware Systematic Approach for Merging Business Process Fragments.",
                    "An Executable Semantics of SystemC Transaction Level Models and Its Applications with VERDS.",
                    "Model Checking Rate-Monotonic Scheduler with TMSVL.",
                    "Model-Checking Based Approaches to Parameter Estimation of Gene Regulatory Networks."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18th ICECCS 2013",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2013",
                "sub_name": "2013 18th International Conference on Engineering of Complex Computer Systems, Singapore, July 17-19, 2013.",
                "count": 39,
                "papers": [
                    "Expressiveness of Notations for Reasoning about Concurrency.",
                    "Hybrid Relation Calculus.",
                    "Goal Model Elaboration for Software Evolution.",
                    "Modeling and Verification of Component-Based Systems with Data Passing Using BIP.",
                    "Modeling and Verifying Real-Time Properties of Reactive Systems.",
                    "Knowledge-Based Verification of Service Compositions - An SMT Approach.",
                    "CosyVerif: An Open Source Extensible Verification Environment.",
                    "Measurements for Adaptation Level and Efficiency of Adaptive Software Systems.",
                    "Network Performance Evaluation for Distributed Embedded Systems Using Feature Models.",
                    "A Model-Driven Approach for Evaluating System of Systems.",
                    "An Adequate Logic for Heterogeneous Systems.",
                    "A Refinement Calculus for Promela.",
                    "Reusing Search Tree for Incremental SAT Solving of Temporal Induction.",
                    "Formal Modelling and Analysis of AODV.",
                    "Spatio-temporal Properties Analysis for Cyber-physical Systems.",
                    "Using Bounded Fairness to Specify and Verify Ordered Asynchronous Multi-agent Systems.",
                    "Automatic Analysis of TiMo Systems in PAT.",
                    "Observer Patterns for Real-Time Systems.",
                    "Model-Based Verification of Energy-Aware Real-Time Automotive Systems.",
                    "Tool Support for the Analysis of TADL2 Timing Constraints Using TimeSquare.",
                    "Model-Driven Performance Prediction of Distributed Real-Time Embedded Defense Systems.",
                    "Web Services Testing via Goal and Mutation.",
                    "GUI Ferret: GUI Test Tool to Analyze Complex Behavior of Multi-window Applications.",
                    "Merging Test Models.",
                    "History-Based Test Case Prioritization with Software Version Awareness.",
                    "Exploiting Concurrency for the ESB Architecture.",
                    "A Comprehensive Client-Side Behavior Model for Diagnosing Attacks in Ajax Applications.",
                    "Protecting Web Browser Extensions from JavaScript Injection Attacks.",
                    "Automated Analysis of Reliability Architectures.",
                    "A Software Environment for Confining Malicious Android Applications via Resource Virtualization.",
                    "How Do Developers Use APIs? A Case Study in Concurrency.",
                    "Software Internationalization and Localization: An Industrial Experience.",
                    "Runtime Prediction of Failure Modes from System Error Logs.",
                    "Orion: A Software Project Search Engine with Integrated Diverse Software Artifacts.",
                    "Rigorous Analysis of Temporal Access Control Properties in Mobile Systems.",
                    "CARE: A Platform for Reliable Comparison and Analysis of Reverse-Engineering Techniques.",
                    "Resilient Architecture for Complex Computing Systems.",
                    "Linking Algebraic Semantics and Operational Semantics for Web Services Using Maude.",
                    "Game-Based Monitors for Scenario-Based Specification."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17th ICECCS 2012",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2012",
                "sub_name": "17th IEEE International Conference on Engineering of Complex Computer Systems, ICECCS 2012, Paris, France, July 18-20, 2012.",
                "count": 38,
                "papers": [
                    "Message from Program Co-chairs.",
                    "Non-intrusive Repair of Reactive Programs.",
                    "Bridging the Gap between User Requirements and Configuration Requirements.",
                    "An Experimental Study on Collaborative Filtering for Requirements Engineering.",
                    "Analysis of Use Case Requirements Using SFTA and SFMEA Techniques.",
                    "Control Systems: Phenomena and Structuring Functional Requirement Documents.",
                    "Improving Hardware Reuse through XML-based Interface Encapsulation.",
                    "Models and Methodology for Automated Business Continuity Analysis.",
                    "Design Patterns for Rule-Based Refinement of Safety Critical Embedded Systems Models.",
                    "Merging UML2 Composite Structures of Software Product Lines.",
                    "Systematic Scenario-Based Analysis of UML Design Class Models.",
                    "Performance Analysis of Data Gathering Protocol Using PRISM.",
                    "An Interaction-Driven Approach to Identifying Functional Behaviors of Service Robot Systems.",
                    "Adaptive Majority-Based Re-routing for Differentiated Reliability in Wireless Sensor Networks.",
                    "Dhara: A Service Abstraction-Based OS Kernel Design Model.",
                    "Spatio-temporal UML Statechart for Cyber-Physical Systems.",
                    "A Deep Investigation for QoS-based Feedback at Design Time and Runtime.",
                    "Self-Explanation in Adaptive Systems.",
                    "Formal Analysis of Pervasive Computing Systems.",
                    "P/S-CoM+: A Formal Approach to Design Correct Publish/Subscribe Architectural Styles.",
                    "A Case Study in Formal System Engineering with SysML.",
                    "Heterogeneous Aviation Safety Cases: Integrating the Formal and the Non-formal.",
                    "xBIL - A Hardware Resource Oriented Binary Intermediate Language.",
                    "Efficient Algorithms for T-way Test Sequence Generation.",
                    "A Timing Model for Specifying Multi Clock Automotive Systems: The Timing Augmented Description Language V2.",
                    "Translating PDDL into CSP# - The PAT Approach.",
                    "Parameter Synthesis for Hierarchical Concurrent Real-Time Systems.",
                    "A Design by Contract Approach to Verify Access Control Policies.",
                    "Control System with High Robust Stability Characteristics Based on Catastrophe Function.",
                    "A Control Theoretic Approach for Workflow Management.",
                    "ORIENTAIS: Formal Verified OSEK/VDX Real-Time Operating System.",
                    "An Energy-Efficient Real-Time Routing Protocol for Differentiated Data in Wireless Sensor Networks.",
                    "Self-Calibration: Enabling Self-Management in Autonomous Systems by Preserving Model Fidelity.",
                    "VPDSL: A DSL for Software in the Loop Simulations Covering Material Flow.",
                    "ViTAL: A Verification Tool for EAST-ADL Models Using UPPAAL PORT.",
                    "Reasoning About Adaptivity of Agents and Multi-agent Systems.",
                    "Extending and Evaluating Agent-Based Models of Algorithmic Trading Strategies.",
                    "SMURF: Supporting Multi-tenancy Using Re-aspects Framework."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16th ICECCS 2011",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2011",
                "sub_name": "16th IEEE International Conference on Engineering of Complex Computer Systems, ICECCS 2011, Las Vegas, Nevada, USA, 27-29 April 2011.",
                "count": 39,
                "papers": [
                    "Preface.",
                    "Temporal Abstract Domains.",
                    "WCET Analysis of Component-Based Systems Using Timing Traces.",
                    "Memory Positioning of Real-Time Code for Smaller Worst-Case Execution Times.",
                    "Tighter Schedulability Analysis of Synchronization Protocols Based on Overrun without Payback for Hierarchical Scheduling Frameworks.",
                    "A Model-Driven Framework for the Development of Portable Real-Time Embedded Systems.",
                    "Timed Circus: Timed CSP with the Miracle.",
                    "Verification of MARTE/CCSL Time Requirements in Promela/SPIN.",
                    "Modeling Variability from Requirements to Runtime.",
                    "Formal Model of Interrupt Program from a Probabilistic Perspective.",
                    "Model-Based Simulation of SOAP Web Services from Temporal Logic Specifications.",
                    "A Fully Dynamic Approach to the Reverse Engineering of UML Sequence Diagrams.",
                    "Using Model Transformation to Generate Graphical Counter-Examples for the Formal Analysis of xUML Models.",
                    "Required Behavior of Sequence Diagrams: Semantics and Refinement.",
                    "A Goal-Based Approach to Guide the Design of an Abstract Event-B Specification.",
                    "Modelling and Analysing Standard Use within System of Systems.",
                    "Towards a MDE Transformation Workflow for Dependability Analysis.",
                    "Tailoring Process Synthesis to Domain Characteristics.",
                    "A Component-Oriented Metamodel for the Modernization of Software Applications.",
                    "A Formal Approach to Model Composition Applied to VUML.",
                    "Leveraging Service-Orientation for Combining Code Generation Frameworks.",
                    "A Software Requirements Specification Framework for Objective Pattern Recognition: A Set-Theoretic Classification Approach.",
                    "A Novel Approach Based on Gestalt Psychology for Abstracting the Content of Large Execution Traces for Program Comprehension.",
                    "Towards Succinctness in Mining Scenario-Based Specifications.",
                    "Modeling and Coordinating Social Interactions in Pervasive Environments.",
                    "Group Selection by Nodes in Wireless Sensor Networks Using Coalitional Game Theory.",
                    "LIPS: A Protocol Suite for Homeostatic Sensornet Management.",
                    "Computational Social Network Management in Crowdsourcing Environments.",
                    "Parallelism Viewpoint: A Viewpoint to Model Parallelism in Parallelism-Intensive Software Systems.",
                    "Analyzing and Forecasting Near-Miss Clones in Evolving Software: An Empirical Study.",
                    "On the Impact of Kanban on Software Project Work: An Empirical Case Study Investigation.",
                    "An Efficient Modeling and Execution Framework for Complex Systems Development.",
                    "An Implementation of the Behavior Annex in the AADL-Toolset Osate2.",
                    "Modeling and Verification of Memory Architectures with AADL and REAL.",
                    "Two Formal Semantics of a Subset of the AADL.",
                    "Requirements Exchange: From Specification Documents to Models.",
                    "ABV - A Verifier for the Architecture Analysis and Design Language (AADL).",
                    "A Tool Set for Integrated Software and Hardware Dependability Analysis Using the Architecture Analysis and Design Language (AADL) and Error Model Annex.",
                    "Integrating AADL-Based Tool Chain into Existing Industrial Processes."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15th ICECCS 2010",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2010",
                "sub_name": "15th IEEE International Conference on Engineering of Complex Computer Systems, ICECCS 2010, Oxford, United Kingdom, 22-26 March 2010.",
                "count": 52,
                "papers": [
                    "An Analysis of Formal Languages for Dynamic Adaptation.",
                    "Development of Autonomic Management Solutions for the Military Application Domain.",
                    "Engineering Dynamic Adaptation for Achieving Cost-Efficient Resilience in Software-Intensive Embedded Systems.",
                    "Trust-Based Adaptation in Complex Service-Oriented Systems.",
                    "A Tile-Based Approach for Self-Assembling Service Compositions.",
                    "Service-Based Development of Context-Aware Automotive Telematics Systems.",
                    "Modeling and Implementing Ontology-Based Publish/Subscribe Using Semantic Web Technologies.",
                    "Effects of Component-Subscription Network Topology on Large-Scale Data Centre Performance Scaling.",
                    "Using Compositionality to Formally Model and Analyze Systems Built of a High Number of Components.",
                    "Configuration Procedure Synthesis for Complex Systems Using Model Finder.",
                    "Patterns for Modelling Time and Consistency in Business Information Systems.",
                    "Implementing and Evaluating a Model Checker for Transactional Memory Systems.",
                    "Model Checking Round-Based Distributed Algorithms.",
                    "Automated Formal Verification of the DHCP Failover Protocol Using Timeout Order Abstraction.",
                    "Performance Antipatterns as Logical Predicates.",
                    "Maintaining Stable Node Populations in Long-Lifetime Sensornets.",
                    "Statistical-Based Response-Time Analysis of Systems with Execution Dependencies between Tasks.",
                    "Using Expressive Traceability Relationships for Ensuring Consistent Process Model Refinement.",
                    "An Approach to Verifying Security and Timing Properties in UML Models.",
                    "A Network Analysis of Stakeholders in Tool Visioning Process for Story Test Driven Development.",
                    "Requirements Elicitation with Adapted CUTA Cards: First Experiences with Business Process Analysis.",
                    "Modelling and Analysis of Socio-Technical System of Systems.",
                    "A Model for Requirements Traceability in a Heterogeneous Model-Based Design Process: Application to Automotive Embedded Systems.",
                    "Engineering Quality Requirements Using Quality Models.",
                    "Incremental Updates for Textual Modelling of Large Scale Models.",
                    "A Model-Based Architecture Supporting Virtual Organizations in Pervasive Systems.",
                    "Engineering Optimization Models at Runtime for Dynamically Adaptive Systems.",
                    "McC++/Java: Enabling Multi-core Based Monitoring and Fault Tolerance in C++/Java.",
                    "A Multi-agent System for Complex Vehicle Fault Diagnostics and Health Monitoring.",
                    "An Experience Report in Requirements Elicitation for Accessible E-Learning Systems.",
                    "Enriching Use Cases with CTTs.",
                    "Testing .NET Code with YETI.",
                    "On Immunological Memory as a Function of a Recursive Proliferation Process.",
                    "Reflections on the Simulation of Complex Systems for Science.",
                    "A Transactional Architecture for Simulation.",
                    "Representing Plankton Functional Types in Ocean General Circulation Models: Competition, Tradeoffs and Self-Organizing Architecture.",
                    "Severe Punishment for Those Who Were Caught.",
                    "A Complex Systems Modelling Approach for Decentralised Simulation of Electrical Microgrids.",
                    "In Search of Sound 'in silico' Research - Validating a Complex System Simulation.",
                    "Towards Self-Healing Swarm Robotic Systems Inspired by Granuloma Formation.",
                    "Towards a Principled Design of Bio-inspired Solutions to Adaptive Information Filtering.",
                    "An MDE-Based Process for the Design, Implementation and Validation of Safety-Critical Systems.",
                    "Testing Safety Critical Systems with SysML/UML.",
                    "Supporting the Design of Safety Critical Systems Using AADL.",
                    "Expressing and Enforcing User-Defined Constraints of AADL Models.",
                    "Formal Modeling for UML/MARTE Concurrency Resources.",
                    "QVT Based Model Transformation from Sequence Diagram to CSP.",
                    "Knowledge Models to Reduce the Gap between Heterogeneous Models: Application to Aircraft Systems Engineering.",
                    "From MARTE to AADL with a Seamless Process.",
                    "Comparison of Six Ways to Extend the Scope of Cheddar to AADL v2 with Osate.",
                    "OMEGA2: A New Version of the Profile and the Tools.",
                    "AADS+: AADL Simulation Including the Behavioral Annex."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th ICECCS 2009",
        "info": "Potsdam, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2009",
                "sub_name": "14th IEEE International Conference on Engineering of Complex Computer Systems, ICECCS 2009, Potsdam, Germany, 2-4 June 2009.",
                "count": 49,
                "papers": [
                    "Keynote: Continuous Model Driven Engineering.",
                    "Keynote: On the Increasing Complexity of Multimedia Service Provision in Next Generation Networks and the Future Internet.",
                    "A Proof Based Approach for Modelling and VerifyingWeb Services Compositions.",
                    "ASIIST: Application Specific I/O Integration Support Tool for Real-Time Bus Architecture Designs.",
                    "Testing an Open Source Suite for Open Queuing Network Modelling Using Metamorphic Testing Technique.",
                    "Architecture Design for the Large-Scale Software-Intensive Systems: A Decision-Oriented Approach and the Experience.",
                    "Towards OpenWorld Software Architectures with Semantic Architectural Styles, Components and Connectors.",
                    "Architecture Driven Modernization in Practice - Study Results.",
                    "Energy Efficient Duty Allocation Protocols for Wireless Sensor Networks.",
                    "Formal Modelling and Analysis of Business Information Applications with Fault Tolerant Middleware.",
                    "Ontology Aided Model Comparison.",
                    "REMES: A Resource Model for Embedded Systems.",
                    "From Bio-jETI Process Models to Native Code.",
                    "Formal Specification and Code Generation of Programable Logic Controllers.",
                    "Analysis and Code Model Extraction for C/C++ Source Code.",
                    "Security Aspect of the Complexity of Modern Surveillance Systems - An Experience Report.",
                    "A Rigorous Approach to Uncovering Security Policy Violations in UML Designs.",
                    "Computational Trust to Insure the Quality of Assistance Given to Human Actors.",
                    "Benchmarking Dependability of a System Biology Application.",
                    "CONNECT Challenges: Towards Emergent Connectors for Eternal Networked Systems.",
                    "The Design of a Conceptual Framework and Technical Infrastructure for Model Management Language Engineering.",
                    "Test your Strategy: Graphical Construction of Strategies for Connect-Four.",
                    "Abstractions of Web Services.",
                    "An Evaluation of the NSGA-II and MOCell Genetic Algorithms for Self-Management Planning in a Pervasive Service Middleware.",
                    "SBAC: Service Based Access Control.",
                    "On the Applicability of Compressive Sampling in Fine Grained Processor Performance Monitoring.",
                    "Using Cases in Variability Analysis to Promote the Design of Flexible, Adaptable and Adaptive Systems.",
                    "ATRIUM: Software Architecture Driven by Requirements.",
                    "Enabling eXtreme Model Driven Design of Parlay X-based Communications Services for End-to-End Multiplatform Service Orchestrations.",
                    "Towards an Embedded Software Component Quality Verification Framework.",
                    "An Automated Platform for Immersive and Collaborative Visualization of Industrial Models.",
                    "Information System Architecture for Wearable Cardiac Sensors Personalization.",
                    "Some Observations on a Maturity Model for CBSE.",
                    "Applying the COSMIC Functional Size Measurement Method to Problem Frames.",
                    "An Integrated Specification Logic for Cyber-Physical Systems.",
                    "A Reflective Approach for Supporting the Dynamic Evolution of Component Types.",
                    "UML Modeling and Formal Verification of Control/Data Driven Embedded Systems.",
                    "Constraint Management in Engineering of Complex Information Systems.",
                    "AADL Simulation and Performance Analysis in SystemC.",
                    "Common Pitfalls of Using QVT Relations - Graphical Debugging as Remedy.",
                    "Visual Comparison of Graphical Models.",
                    "Integrating AADL within a Multi-domain Modeling Framework.",
                    "A Comparative Study of FIACRE and TASM to Define AADL Real Time Concepts.",
                    "Towards a Model-Driven Approach for Mapping Requirements on AADL Architectures.",
                    "An Emerging Need for a New Software Engineering Method.",
                    "Verification of Replication Architectures in AADL.",
                    "Executing AADL Models with UML/MARTE.",
                    "Modeling the Implementation of State-Based System Architectures.",
                    "Automating the Generation of Platform Specific Models."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th ICECCS 2008",
        "info": "Belfast, Northern Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2008",
                "sub_name": "13th International Conference on Engineering of Complex Computer Systems (ICECCS 2008), March 31 2008 - April 3 2008, Belfast, Northern Ireland.",
                "count": 35,
                "papers": [
                    "Verified Software: Theories, Tools, Experiments.",
                    "Global Software Engineering Research in a Small Country.",
                    "Verifying Statecharts with State Invariants.",
                    "Verifying Semistructured Data Normalization Using PVS.",
                    "A Scalable Approach to Multi-style Architectural Modeling and Verification.",
                    "Revisiting Safe Realizability of Message Sequence Charts Specifications.",
                    "iPSL: An Environment for IP-Based PSL Specification.",
                    "Task Mapping in Heterogeneous MPSoCs for System Level Design.",
                    "High-Precision Relative Clock Synchronization Using Time Stamp Counters.",
                    "Integrated Real-Time Scheduling and Communication with Probabilistic Timing Assurances in Unreliable Distributed Systems.",
                    "Why Predicting Outliers in Software is a Good Thing to Do!",
                    "On Extracting Tests from a Testable Model in the Context of Domain Engineering.",
                    "A Formal Model of Semantic Web Service Ontology (WSMO) Execution.",
                    "Jini++: A Framework for Developing Pervasive and Wireless Distributed Applications.",
                    "GENESIS - A Framework for Automatic Generation and Steering of Testbeds of ComplexWeb Services.",
                    "Linking VDM and Z.",
                    "POSIX and the Verification Grand Challenge: A Roadmap.",
                    "Ambient Intelligence Applications: Introducing the Campus Framework.",
                    "Ubiquitous Service Regulation Based on Dynamic Rules.",
                    "The Semantic Web Services Challenge: Tackling Complexity at the Orchestration Level.",
                    "An Environment to Support Large Scale Experimentation in Software Engineering.",
                    "A Framework for Software Engineering Experimental Replications.",
                    "A Concrete Syntax for UML 2.1 Action Semantics Using +CAL.",
                    "AnExecution Framework for MARTE-Based Models.",
                    "Dealing with AADL End-to-End Flow Latency with UML MARTE.",
                    "Contract-Based Approach to Analyze Software Components.",
                    "Arcade - A Formal, Extensible, Model-Based Dependability Evaluation Framework.",
                    "An Integrated MDA Approach with SysML and UML.",
                    "Code Generation from AADL to a Real-Time Operating System: An Experimentation Feedback on the Use of Model Transformation.",
                    "AADL Execution Semantics Transformation for Formal Verification.",
                    "Automatic Composition of AADL Models for the Verification of Critical Component-Based Embedded Systems.",
                    "Using AADL to Model a Protocol Stack.",
                    "Modes in Asynchronous Systems.",
                    "A Study of the AADL Mode Change Protocol.",
                    "Efficient Embedded Runtime Systems through Port Communication Optimization."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th ICECCS 2007",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2007",
                "sub_name": "12th International Conference on Engineering of Complex Computer Systems (ICECCS 2007), 10-14 July 2007, Auckland, New Zealand.",
                "count": 40,
                "papers": [
                    "POSIX file store in Z/Eves: an experiment in the verified software repository.",
                    "Just-in-Time Certification.",
                    "Modular Synthesis of Discrete Controllers.",
                    "Achieving Discrete Relative Timing with Untimed Process Algebra.",
                    "Model Checking-based Verification of Web Application.",
                    "A light-weight static approach to analyzing UML behavioral properties.",
                    "A Formal Model for Compensable Transactions.",
                    "A Formal Semantic Model of the Semantic Web Service Ontology (WSMO).",
                    "Selecting V&V Technology Combinations: How to Pick a Winner?",
                    "A Novel Approach to the Detection of Cheating in Multiplayer Online Games.",
                    "Reasoning about Nonblocking Concurrency using Reduction.",
                    "A Combined Approach for Information Flow Analysis in Fault Tolerant Hardware.",
                    "The Registry for Sensor Network Discovery.",
                    "An agent based approach to examining shared situation awareness.",
                    "Product Line Enabled Intelligent Mobile Middleware.",
                    "Pex - An Intelligent Assistant for Rigorous Developer Testing.",
                    "Belief-augmented OWL (BOWL) Engineering the SemanticWeb with Beliefs.",
                    "A Formal Contract Language for Plugin-based Software Engineering.",
                    "Linking Object-Z with Spec#.",
                    "Architectural Design Methodologies for Complex Evolving Systems.",
                    "EmVC: Managing Changes and Configurations in Designs of Complex, Embedded Computing Systems.",
                    "Communicating Software Architecture using a Unified Single-View Visualization.",
                    "A first approach to the closed-form specification and analysis of an autonomic control system.",
                    "The Imminent Complexity Quagmire in Pervasive Computing - Autonomic Agents a Solution?",
                    "Formalising Flash Memory: First Steps.",
                    "Formally Counting Electronic Votes (But Still Only Trusting Paper).",
                    "What Use is Verified Software?",
                    "A Refinement Driven Component-Based Design.",
                    "Verifying the CICS File Control API with Z/Eves: An Experiment in the Verified Software Repository.",
                    "Experiments in Verifying Low Level Concurrent C Code.",
                    "What Can the pi-calculus Tell Us About the Mondex Purse System?",
                    "Automated Verification of Shape, Size and Bag Properties.",
                    "On-the-fly model checking for C programs with extended CADP in FMICS-jETI.",
                    "Parallel Model Checking and the FMICS-jETI Platform.",
                    "The LearnLib in FMICS-jETI.",
                    "Managing Complexity of Automotive Electronics Using the EAST-ADL.",
                    "MARTE: Also an UML Profile for Modeling AADL Applications.",
                    "From PIMs to PSMs.",
                    "A Co-Modeling Methodology Designed for RT Architecture Models Integration.",
                    "The AADL behaviour annex - experiments and roadmap."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th ICECCS 2006",
        "info": "Stanford University, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2006",
                "sub_name": "11th International Conference on Engineering of Complex Computer Systems (ICECCS 2006), 15-17 August 2006, Stanford, California, USA.",
                "count": 29,
                "papers": [
                    "Physiological vs. Social Complexity in Software Design.",
                    "Efficient Dynamic Multikeys in Enterprise JavaBeans.",
                    "A Case History of International Space Station Requirement Faul.",
                    "Reactive Component based Service-Oriented Design - A Case Study.",
                    "On the Complexity of Design in Imaging Software.",
                    "Inference of Design Pattern Instances in UML models via Logic Programming.",
                    "Integrating Functional and Security Requirements with Use Case Decomposition.",
                    "A Characterization of UML Diagrams and their Consistency.",
                    "A UML Profile utilizing Enterprise Information System Configuration.",
                    "Engineering Emergence.",
                    "A Layered Behavioural Model of Platelets.",
                    "Communicating Complex Systems.",
                    "A Tool-Supported Review Approach to Detecting Structural Consistency Violations.",
                    "Integrating Timed Automata into Tabu Algorithm for HW-SW Partitioning.",
                    "From Algebraic Semantics to Denotational Semantics for Verilog.",
                    "Formal Specification-based Online Monitoring.",
                    "Biologically-Inspired Concepts for Self-Management of Complexity.",
                    "Model-based Design of Distributed Collaborative Bioinformatics Processes in the jABC.",
                    "Modelling Bacterial Growth Patterns in the presence of Antibiotic.",
                    "A Type System for the Relational Calculus of Object Systems.",
                    "An Assertional Correctness Proof of a Self-Stabilizing - Exclusion Algorithm.",
                    "A Real-time High-fidelity Driving Simulator System Based on PC Clusters.",
                    "Multi-Level Modeling and Distributed Agent-Based Inference: the Role of System Structure.",
                    "Origins of the Grid Architectural Style.",
                    "A GRID based Framework and tools for automating production of cross media content.",
                    "On the Generation of Object Databases using Booster.",
                    "Automation of Java Card component development using the B method.",
                    "Verification of Control Systems using Circus.",
                    "Reliability - Security Model."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th ICECCS 2005",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2005",
                "sub_name": "10th International Conference on Engineering of Complex Computer Systems (ICECCS 2005), 16-20 June 2005, Shanghai, China.",
                "count": 76,
                "papers": [
                    "Message from the General Chairs.",
                    "Welcome from the Program Chairs.",
                    "Organizing Committee.",
                    "Additional Reviewers.",
                    "Software Engineering Approaches to Semantic Web.",
                    "Multimedia Content Distribution and Protection.",
                    "An Introduction to Self-Healing Web Services.",
                    "A Framework for SOFL-Based Program Review.",
                    "An Introduction to Three Perspectives on Formal Specification Review.",
                    "Design of a Tool for Specification-Based Program Review.",
                    "A Formal Specification Constructing Tool for SOFL.",
                    "Extending SOFL Features for AOP Modeling.",
                    "Extended SOFL Features for the Modeling of Middleware-Based Transaction Management.",
                    "Tools for an Extended Object Modelling Environment.",
                    "Grammar-Specified Model-Driven Architectures.",
                    "A Strategy for Component-Based Modeling and Refinement.",
                    "Principles, Standards and Tools for Model Engineering.",
                    "Evaluating Conformance of UML Models to Design Patterns.",
                    "Modeling Diverse and Complex Interactions Enabled by Middleware as Connectors in Software Architectures.",
                    "Secure Software Architectures Design by Aspect Orientation.",
                    "Modeling Architecture Based Development in UML.",
                    "Analysis and Verification of the Interaction Model in Software Design.",
                    "Formal Verification of Concurrent and Distributed Constraint-Based Java Programs.",
                    "Detecting Malicious JavaScript Code in Mozilla.",
                    "Extracting FSMs from Object-Z Specifications with History Invariants.",
                    "Formal Methods to Generate Parallel Iterative Codes for PDE-Based Applications.",
                    "Formal Requirements-Based Programming for Complex Systems.",
                    "Ringed Petersen Spheres Connected Hypercube Interconnection Networks.",
                    "A General Model for Non-Markovian Stochastic Decision Discrete-Event Systems.",
                    "A Slice Monad Transformer and Its Applications in Program Slicing.",
                    "Slicing Component-Based Systems.",
                    "A Cost-Efficient Server Architecture for Real-Time Credit-Control.",
                    "A Feasible Schedulability Analysis for Fault-Tolerant Hard Real-Time Systems.",
                    "From chi-t to µCRL: Combining Performance and Functional Analysis.",
                    "Cost-Benefit Trade-Off Analysis Using BBN for Aspect-Oriented Risk-Driven Development.",
                    "Comparing Fault-Proneness Estimation Models.",
                    "Evolving Messaging Systems for Secure Role Based Messaging.",
                    "Model-Based Design and Analysis of Permission-Based Security.",
                    "Exploiting OS-Level Mechanisms to Implement Mobile Code Security.",
                    "An Internet-Based System for Setup Planning in Machining Operations.",
                    "A B2B Conversational Architecture for Semantic Web Services Based on BPIMS-WS.",
                    "Conquering the Eight-Tailed Dragon - An Attempt to Deal with Structural and Behavioral Complexities.",
                    "A Component-Based Approach for JavaCard Runtime System Development.",
                    "Customizable Framework for Managing Trusted Components Deployed on Middleware.",
                    "Behavior Capture and Test: Automated Analysis of Component Integration.",
                    "Formal Semantics and Verification for Feature Modeling.",
                    "Verifying Parameterized Refinement.",
                    "Mediation Systems Modeling and Verification.",
                    "Robust H-infinity Filter Design for Networked Control System with Random Time Delays.",
                    "Fluid-Based Stability Analysis of Mixed TCP and UDP Traffic under RED.",
                    "A Formal General Framework and Service Access Model for Service Grid.",
                    "Rapid Prototyping of Complex Interactive Simulation Systems.",
                    "A Study of Secure Communications between Mobile Objects.",
                    "Recovery Method Based on Communicating Extended Finite State Machine (CEFSM) for Mobile Communications.",
                    "Identification of Faulty Links in LEO/MEO Satellite Communication Networks.",
                    "Inconsistency Measurement of Software Requirements Specifications: An Ontology-Based Approach.",
                    "Consistency Checking of UML Requirements.",
                    "Using the Metamodel Mechanism to Support Class Refinement.",
                    "Improving the Robustness and Reliability of Object-Oriented Programs through Exception Analysis and Testing.",
                    "An Optimized Method for Automatic Test Oracle Generation from Real-Time Specification.",
                    "Regression Testing of Classes Based on TCOZ Specification.",
                    "Derivation of Implementation Constraints - Implementation Simulation and Treatment of Multiple Design Choices.",
                    "Design Patterns for Software Health Monitoring.",
                    "Dynamic Architectural Connectors in Cooperative Software Systems.",
                    "Integrating Object-Z with Timed Automata.",
                    "Mutation Operators for Object-Z Specification.",
                    "Formal Verification of an Array-Based Nonblocking Queue.",
                    "A Tool-Supported Approach to Testing UML Design Models.",
                    "Model Checking Live Sequence Charts.",
                    "Effective Generation of Test Sequences for Structural Testing of Concurrent Programs.",
                    "Evaluating Software Quality Attributes of Communication Components in an Automated Guided Vehicle System.",
                    "Measuring Various Properties of Execution Traces to Help Build Better Trace Analysis Tools.",
                    "Scavenging Complex Genomic Information Using Mobile Code: An Evaluation.",
                    "The Preservation of Interleaving Equivalences.",
                    "Preserving Consistency of Runtime Monitors across Protocol Changes.",
                    "Coping with Legacy System Migration Complexity."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th ICECCS 2004",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2004",
                "sub_name": "9th International Conference on Engineering of Complex Computer Systems (ICECCS 2004), 14-16 April 2004, Florence, Italy.",
                "count": 27,
                "papers": [
                    "Architecture Driven Modeling in Software Development.",
                    "Major Threat: From Formal Methods without Tools to Tools without Formal Methods.",
                    "Modeling Complex Systems by Separating Application and Security Concerns.",
                    "Dealing with Complex Networks of Process Interactions: A Security Measure.",
                    "TTET: Event-Triggered Channels on a Time-Triggered Base.",
                    "Enterprise Information Systems Configuration: Emphasizing the Symbiotic Relationship between Applications and the Underlying Network.",
                    "Integrated Fault Diagnostics on the Grid.",
                    "Robust On-Line Approximation Control of Uncertain Nonlinear Systems Subject to Constraints.",
                    "Formal Test-Case Generation for UML Statecharts.",
                    "Requirements Validation by Lifting Retrenchments in B.",
                    "Relating pi-calculus to Object-Z.",
                    "A Conceptual Framework for State-Based and Event-Based Formal Behavioural Specification Languages.",
                    "Towards a Tool for Derivation of Implementation Constraints.",
                    "Supporting Rigorous Evolution of UML Models.",
                    "Independence Transformations and Tools for Components.",
                    "Using Contexts to Manage System Complexity.",
                    "Visualising Object-Oriented Source Code Complexity Using XML.",
                    "Domain Visualization for Dealing with Complex Information Systems .",
                    "A Web-Based Infrastructure for the Management of Semantic Meta-Data.",
                    "A CORBA-Based Multi-Agent System Integration Framework.",
                    "Muse over University Organisational Ecology in Action and Service-Oriented Architectures.",
                    "Design of a Microprocessor-Based Control System of a Compression Molding Process.",
                    "Monitoring and Optimizing Industrial Production Processes.",
                    "System for the Production Control and Automatic Packaging of Plastic Air Sleeve Guides.",
                    "Verification of NASA Emergent Systems.",
                    "Software Information Leaks: A Complexity Perspective.",
                    "An Investigation of the Approach to Specification-Based Program Review through Case Studies."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "8th ICECCS 2002",
        "info": "Greenbelt, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2002",
                "sub_name": "8th International Conference on Engineering of Complex Computer Systems (ICECCS 2002), 2-4 December 2002, Greenbelt, MD, USA.",
                "count": 26,
                "papers": [
                    "Complexity Is the Enemy of Dependability - Can Diversity Provide a Defense?",
                    "Validating Run-time Interactions in Distributed Java Applications.",
                    "Reasoning about Asynchronous Behaviour in Distributed Systems.",
                    "A Framework for Performability Modeling of Messaging Services in Distributed Systems.",
                    "Efficient Reachability Testing of Asynchronous Message-Passing Programs.",
                    "Integrating CSP and DC.",
                    "Capturing Complete and Accurate Requirements by Refinemen.",
                    "Mechanization of a Proof of String-Preprocessing in Boyer-Moore's Pattern Matching Algorithm.",
                    "Execution of TILCO Temporal Logic Specifications.",
                    "Mnemosyne: Designing and Implementing Network Short-Term Memory.",
                    "Composability for Software Components: An Approach Based on the Whole-Part Theory.",
                    "Using Role-Based Modeling Language (RBML) to Characterize Model Families.",
                    "Using Aspects to Design a Secure System.",
                    "A Light-Weight Process for Capturing and Evolving Defect Reduction Experience.",
                    "Interclass Testing of Object Oriented Software.",
                    "A Perturbation-based Testing Strategy.",
                    "A Framework for Specification-Based Class Testing.",
                    "Mars Polar Lander Fault Identification Using Model-based Testing.",
                    "An Empirical Comparison of Modularity of Procedural and Object-oriented Software.",
                    "Fault Detection Effectiveness of Spathic Test Data.",
                    "Syntactic Fault Patterns in OO Programs.",
                    "Model Checking UML Specifications of Real Time Software.",
                    "An Evolutionary Lifecycle Model with Agile Practices for Software Development at ABB.",
                    "Managing Software Evolution with a Formalized Abstraction Hierarchy.",
                    "OptoNet - A Case Study in Using Rigorous Analysis Techniques to Justify a Revised Product Assurance Strategy.",
                    "Multiple-View Meta-Modeling of Software Product Lines."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7th ICECCS 2001",
        "info": "Skövde, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2001",
                "sub_name": "7th International Conference on Engineering of Complex Computer Systems (ICECCS 2001), 11-13 June 2001, Skövde, Sweden.",
                "count": 29,
                "papers": [
                    "Intelligent Agent-Based Decision-Support Systems for Complex C2 Applications.",
                    "Communicating TILCO: A Model for Real-Time System Specification.",
                    "TILCO-X, an Extension of TILCO Temporal Logic.",
                    "On-line Scheduling of Real-Time Distributed Computers With Complex Communication Constraints.",
                    "A Method for Verifying Real-Time Properties of Ada Programs.",
                    "Verification of Hybrid Systems: Formalization and Proof Rules in PVS.",
                    "Action Refinement for True Concurrent Real Time.",
                    "Formal Guides for Experimentally Verifying Complex Software-Implemented Fault Tolerance Mechanisms.",
                    "Compositional Construction of Protocol Behaviours with Arbitrary Channel Capacities.",
                    "Future Mobile Phones - Complex Design Challenges from an Embedded Systems Perspective.",
                    "Quality Attribute Conflicts - Experiences from a Large Telecommunication Application.",
                    "Can We Learn Anything from Hardware Preventive Maintenance?",
                    "Motivating the Corrective Maintenance Maturity Model (CM3).",
                    "An Object-Oriented Analysis and Design Approach for Safe Object Sharing.",
                    "Design Method for Conceptual Design of By-Wire Control: Two Case Studies.",
                    "Designing Distributed Component-Based Systems With DCL.",
                    "A Framework for Analyzing and Organizing Complex Systems.",
                    "The Problem of Platform Complexity.",
                    "Towards A Framework for Architecting Mechatronics Software Systems.",
                    "Aspect-Oriented Specification Architectures for Distributed Real-Time Systems.",
                    "Independent Proprietorship and Competition in Distributed Web Search.",
                    "Intelligent Agent-Based Software Architecture for Combat Performance under Overwhelming Information Inflow and Uncertainty.",
                    "Using a Model Checker to Test Safety Properties.",
                    "Techniques for Testing Component-Based Software.",
                    "Module Testing Embedded Software--An Industrial Pilot Project.",
                    "Analysis of Self-Stabilization for Infinite-State Systems.",
                    "Parallel Machine Translation: Principles and Practice.",
                    "Managing Feature Interactions in Telecommunications Systems by Temporal Colored Petri Nets.",
                    "Modelling Free Flight with Collision Avoidance."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th ICECCS 2000",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/2000",
                "sub_name": "6th International Conference on Engineering of Complex Computer Systems (ICECCS 2000), 11-15 September 2000, Tokyo, Japan.",
                "count": 27,
                "papers": [
                    "Complexity: Concept, Causes and Control.",
                    "Managing Complexity in Real-Time Reactive Systems.",
                    "Verification Criteria for a Compositional Model for Reactive Systems.",
                    "Dependability Engineering of Complex Computing Systems.",
                    "Domain Modeling of Software Process Models.",
                    "Integration of the Domain Modeling Method for Families of Systems with the SOFL Formal Specification Language.",
                    "Experience Using Formal Methods for Specifying a Multi-Agent System.",
                    "Distributed Development of Complex Software Systems with Object Make.",
                    "An Intelligent-Agent Based Decision Support System for a Complex Command and Control Application.",
                    "Using the Right Tool for the Job.",
                    "Interworking among Intelligent Networks and Different Networks: Service Control Interfaces and Their Applications.",
                    "Mobile IP Route Optimization Method for a Carrier-Scale IP Network.",
                    "Multiple Backup Virtual Paths Reservation Problem and Its Solution.",
                    "Overcoming Software Complexity by Constructing Abstraction Hierarchies - The Principles and Applications.",
                    "Definitions of Equivalence for Transformational Synthesis of Embedded Systems.",
                    "Scalable Data Mining with Log Based Consistency DSM for High Performance Distributed Computing.",
                    "Concurrent Programming Made Easy.",
                    "Dynamically Detecting Relevant Program Invariants.",
                    "A Test Class Framework for Generating Test Cases from Z Specifications.",
                    "An Analysis Tool for Coupling-Based Integration Testing.",
                    "Evaluation of Three Specification-Based Testing Criteria.",
                    "Automated Result Verification with AWK.",
                    "Principles and Mechnisms for Evolving Software Systems: A Report from a Project on Software Evolution Principles.",
                    "Reduction of the Number of Terminal Assisgnments for Detecting Feature Interactions in Telecommuncation Services.",
                    "A Flexible Scheduling for Automobile Control Using Imprecise Computation and Its Fundamental Evaluation.",
                    "New Measure and Experimental Evaluation for Multiagent-Based Reservation of Backup Virtual Paths in ATM Networks.",
                    "Cost Models for Electronic Architecture Trade Studies."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "5th ICECCS 1999",
        "info": "Las Vegas, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/1999",
                "sub_name": "5th International Conference on Engineering of Complex Computer Systems (ICECCS '99), October 18-22, 1999, Las Vegas, NV, USA.",
                "count": 22,
                "papers": [
                    "Securing Internet Sessions with Sorbet.",
                    "A CSCW Framework for the Flexible Coupling of Groupware Widgets.",
                    "A General Purpose Virtual Collaboration Room.",
                    "A Framework for Analyzing Configurations of Deployable Software Systems.",
                    "UML + ROOM as a Standard ADL?",
                    "An Integrating Approach for Developing Distributed Software Systems -- Combining Formal Methods, Software Reuse, and the Experience Base.",
                    "Evaluating a Flexible Architecture for Distributed Control.",
                    "Performance Analysis of Traffic Networks Based on Stochastic Timed Petri Net Models.",
                    "On Cost Function Synthesis for Multi-Objective Design Decisions in Complex Real-Time Systems.",
                    "Formal Development and Validation of Java Dependable Distributed Systems.",
                    "A Realistic Architecture for Timed Testing.",
                    "Criteria for Generating Specification-Based Tests.",
                    "Lessons Learned from Wrapping Systems.",
                    "A CORBA-Based Architecture for Integrating Distributed and Heterogeneous Databases.",
                    "Practical Considerations in Protocol Verification: The E-2C Case Study.",
                    "Developing More Reliable Software Faster and Cheaper.",
                    "Planning Complex Systems in a Business Context.",
                    "Complexity in Human Centered Systems: The Case of Software Processes.",
                    "Developing More Reliable Software Faster and Cheaper.",
                    "Using Design Patterns, Frameworks and CORBA to Reduce the Complexity of Developing Reusable Large-Scale Object-Oriented Concurrent Communication Components and Systems.",
                    "Implementing Large-Scale Systems Using COTS Software.",
                    "A Realistic Commercially Robust Process for the Development of Object-Oriented Software."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "4th ICECCS 1998",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/1998",
                "sub_name": "4th International Conference on Engineering of Complex Computer Systems (ICECCS '98), 10-14 August 1998, Monterey, CA, USA.",
                "count": 12,
                "papers": [
                    "A Method and a Technique to Model and Ensure Timeliness in Safety Critical Real-Time Systems.",
                    "Evaluating the Performance of Group Membership Protocols.",
                    "Inter-Completion Time Scheduling (ICTS): Non-Preemptive Scheduling to Maximize the Minimum Inter-Completion Time.",
                    "Metrics and Tool for System Assessment.",
                    "Design Patterns in Petri Net System Modeling.",
                    "Building Soft Real-Time Monitors Based on Software Reuse.",
                    "The Architecture Tradeoff Analysis Method.",
                    "Open Complex Computer Systems are No Silver Bullet.",
                    "Applying Slicing Technique to Software Architectures.",
                    "An Approach to Specifying and Verifying Safety-Critical Systems with Practical Formal Method SOFL.",
                    "Risk Assessment and Integrity in System Design.",
                    "VP Reservation for Rapid Restoration Using Multiagents."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "3rd ICECCS 1997",
        "info": "Lake Como, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/1997",
                "sub_name": "3rd IEEE International Conference on Engineering of Complex Computer Systems (ICECCS '97), 8-12 September 1997, Lake Como, Italy.",
                "count": 25,
                "papers": [
                    "Problem complexity.",
                    "Enacting a Software Development Process.",
                    "Use of the process meta-model to describe requirements engineering.",
                    "An experience in introducing configuration management in a process-centered software engineering environment.",
                    "Precedence constraints in hard real-time distributed systems.",
                    "Optimal deadline assignment for scheduling soft aperiodic tasks in hard real-time environments.",
                    "Resolving Conflicts with Committing Transactions in Distributed Real-time Databases.",
                    "An Architectural Style Decoupling Coordination, Computation and Data.",
                    "An approach to integration testing based on architectural descriptions.",
                    "Optimal mobile location tracking by multilayered model strategy.",
                    "A Synthesis Method for Fault-tolerant and Flexible Multipath Routing Protocols.",
                    "Client--Access Protocols for Replicated Services.",
                    "Cache based fault recovery for distributed systems.",
                    "Feasibility concerns in PGM graphs with bounded buffers.",
                    "Evolution: A More Practical Approach than Refinement for Software Development.",
                    "Hypercharts: extended statecharts to support hypermedia specification.",
                    "A Three Layers Software Development Method: Foundations and Definition.",
                    "Versatile Real-Time Vision Based on a Distributed System of Personal Computers.",
                    "Interoperability issues in sharing electronic healthcare records-the Synapses approach.",
                    "Object management for network-centric systems with mobile objects.",
                    "The Butterfly Methodology : A Gateway-free Approach for Migrating Legacy Information Systems.",
                    "Framework for documenting design decisions in product families development .",
                    "A Language Support Environment for Complex Distributed Real-Time Applications.",
                    "Morphologically Realistic Neural Networks.",
                    "Bridging the Gap between Users and Complex Decision Support Systems: the Role of Justification."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "2nd ICECCS 1996",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/1996",
                "sub_name": "2nd IEEE International Conference on Engineering of Complex Computer Systems (ICECCS '96), 21-25 October 1996, Montreal, Canada.",
                "count": 81,
                "papers": [
                    "Interactive Consistency in Quasi-Asynchronous Systems.",
                    "Coupling-based Integration Testing.",
                    "Using TILCO for Specifying Real-Time Systems.",
                    "IDEA: Integrated Design Environment for Assessment of ATM Networks.",
                    "Toward Compiler Optimization of Distributed Real-Time Processes.",
                    "Virtual Reality - An Approach to Improve the Generation of Fault-Free Software for Programmable Logic Controllers (PLC).",
                    "A Software Architecture Approach for Designing CASE Systems.",
                    "A Distributed Architecture for Autonomous Robots.",
                    "An Experimental Investigation of the Potential of BLF-driven Scheduling of Real-time Threads.",
                    "Using a discrete event simulation to test a generic architecture for complex real-time systems.",
                    "A comparative assessment of some reengineering techniques.",
                    "A Theory of Lexicographic Multi-Criteria Optimization.",
                    "A Process for Specifying Black Box Behavior, Demonstrated in a Case Study.",
                    "The Two Real-Time Solitudes: computerized control and telecommunications.",
                    "The Allocation and Scheduling Precedence and Timing-Constrained Tasks with communication Delays.",
                    "Progressive Scheduling for Real-Time Artificial Intelligence Tasks.",
                    "Design of a Communication System Capable of Supporting Real-Time RPC.",
                    "An Iterative Method of Task Temporal Parameter Adjustment in Hard Real-Time Systems.",
                    "Providing Generalized Rate Monotonic Scheduling Theory to I/O Abstractions over Timed Token Protocol MAC Networks.",
                    "Certification of Reusable Software Components: Summary of Work In Progress.",
                    "System Dependability Assessment Tool.",
                    "Certification of reusable software components: summary of work in progress.",
                    "Adaptability in cooperative systems: merging flexibility and performance.",
                    "Subscription as a Model for the Architecture of Embedded Systems.",
                    "On the specification of complex software systems.",
                    "Developments in System Architecting.",
                    "Understanding Large-Scale Behavior Patterns in Complex systems.",
                    "Teledesic network and space infrastructure architecture and design.",
                    "Autonomous Navigation Based On a Dynamic Representation.",
                    "A Cyclic Scheduling for Relative Timing Requirements.",
                    "Enhancement and real-time analysis of an adaptive impulsive noise removal method.",
                    "Integrating Petri Nets With Design Methods for Concurrent and Real-Time Systems.",
                    "Graphical Programming of Time-Deterministic Real-Time Systems.",
                    "Animating Real-Time Reactive Systems.",
                    "Three-dimensional DCT video compression technique based on adaptive quantizers.",
                    "Development of a Systems Architecting Process for Computer Based Systems.",
                    "Application of Security Principles to Integration of Enterprise, System and Software Engineering Methods.",
                    "A Progressive Software Development Lifecycle.",
                    "A Generalized Methodology for Evaluating and Optimizing System Design Factors.",
                    "Dynamically Reconfigurable Embedded Software - Does It Make Sense?",
                    "Real-Time Commit Protocol For Distributed Real-Time Database Systems.",
                    "Evaluation and Comparison of Task Allocation and Scheduling Methods for Distributed Real-Time Systems.",
                    "Formal verification for distributed real-time control: periodic Producer/Consumer.",
                    "Alternative priority scheduling in dynamic priority systems.",
                    "Improving Protocol Performance by Dynamic Control of Communication Resources.",
                    "Conformance Testing of Time-Dependent Protocols.",
                    "Recovery of Communications Protocol Design from Run Time Protocol Traces.",
                    "Telecommunication software development using SDL-92: practical experience.",
                    "Recovery of Software Design, State-Machines, and Specifications from Source Code.",
                    "Adaptive Parallel Algorithms for the Synthesis of Real-Time Computer Systems.",
                    "An Algorithmic Semantics for Viewcharts.",
                    "Layering in Object-Oriented Control Systems.",
                    "A Framework for Dependability Specification.",
                    "Resource Conscious Design of Distributed Real-Time Systems: An End-to-End Approach.",
                    "Architecture and Language support for Fault-tolerance in Complex Real-Time Systems.",
                    "Time Controlled Dynamic Scheduling of Aperiodic Real-Time Tasks.",
                    "On Real-Time Quasi-Durable Checkpointing.",
                    "A Z-based Approach to Specifying and Analyzing Complex Systems.",
                    "Formal Methods Applied to Secure Network Engineering.",
                    "Hardware Composition with Hardware Flowcharts and Process Algebras.",
                    "Indexing to Efficiently Support Fussy Queries on Range Specifications.",
                    "A Join Algorithm Utilizing Multiple Path Indexes in Object-Oriented Database Systems.",
                    "Hardware/software cosynthesis: multiple constraint satisfaction and component retrieval.",
                    "An architectural framework for interoperation of distributed heterogeneous database systems.",
                    "An Engineering Design Process Supported by Knowledge Retrieval from a Spatial Database.",
                    "Assessment and Optimization of System Architectures - Experience from Industrial Applications at Siemens.",
                    "Toward a Recommended Practice for Architectural Description.",
                    "Engineering of component-based systems.",
                    "Modeling and analysis of complex computer systems-the MTCCS approach.",
                    "A task graph model for design and implementation of real-time systems.",
                    "An Approach for Generating Executable Distributed Applications from Reusable Software Architectures.",
                    "Designing a Non-intrusive Monitoring Tool for Developing Complex Distributed Applications.",
                    "Temporal Causal Networks for Simulation and Diagnosis.",
                    "Building Reusable Software Architectures with Ada 95.",
                    "Evolvable Real-Time C3 Systems-II: Real-Time Infrastructure Requirements.",
                    "System Refinement in VDM-SL.",
                    "A knowledge-based approach to object-oriented legacy code reuse.",
                    "Assessing Complex Computer Based Systems using the Goal Structuring Notation.",
                    "Semi-automatic Transformation from Formal Specifications to Programs.",
                    "Deriving Mode Invariants from SCR Specifications.",
                    "Design Synthesis Using Adaptive Search Techniques and Multi-Criteria Decision Analysis."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "1st ICECCS 1995",
        "info": "Fort Lauderdale, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iceccs/1995",
                "sub_name": "1st IEEE International Conference on Engineering of Complex Computer Systems (ICECCS '95), November 6-10, 1995, Fort Lauderdale, Florida, USA.",
                "count": 77,
                "papers": [
                    "Automatic analytical tools for reliability and dynamic adaptation of complex distributed systems.",
                    "A time-sharing architecture for complex real-time systems.",
                    "Engineering baselines in system development: using ASCII files, two-column index piles, and system numbers, engineering tags, and change set numbers.",
                    "SDT a tool for complex real-time systems.",
                    "Tracing complexity through the software process.",
                    "The role of secondary attributes in formal object modelling.",
                    "A graphical paradigm facilitating correct programming of complex computer control systems.",
                    "Customizable notations for kernel formalisms.",
                    "Animation of heterogeneous prototypes of real-time systems.",
                    "Automation of analysis and simulation for understanding of large real-time Ada software.",
                    "A case study on design for provability.",
                    "Control and supervision of a complex production process using hybrid systems techniques.",
                    "Advances in the design and deployment of human-machine interfaces.",
                    "A tool for modeling and verifying real-time systems.",
                    "A performance oriented design methodology for large-scale distributed data intensive information systems.",
                    "Representing architectural designs: a central issue in the development of complex systems.",
                    "Integrating formal methods tools to support system design.",
                    "Hard real-time communications with weighted round robin service in ATM local area networks.",
                    "Predictions for increasing confidence in the reliability of safety critical software.",
                    "Requirements for client/server performance modeling.",
                    "Managing system technical risks using a process-based, integration infrastructure.",
                    "On the integration of heterogeneous methods for complex applications.",
                    "Command and control system requirements analysis. System requirements specification tactical system CUP CMT.",
                    "POSD-a notation for presenting complex systems of processes.",
                    "Discrete event process controller synthesis using VDM++.",
                    "Structured methodology+object-oriented methodology+formal methods: methodology of SOFL.",
                    "A formal method for provably correct composition of a real-life processor out of basic components. (The APE100 Reverse Engineering Study.",
                    "Hybrid specification of control systems.",
                    "Evolvable real-time C3 systems.",
                    "A combined functional and object-oriented approach to software design.",
                    "STADIUM: a new tool for high assurance in systems design.",
                    "A software design for integrating DESTINATION with ACEIT.",
                    "Contribution of object-oriented methodologies to the specification of complex systems.",
                    "Derivation of S-domain aircraft models.",
                    "Complex Systems - The External Influences.",
                    "Goal-oriented dynamic buffer pool management for data base systems.",
                    "Active integration frameworks.",
                    "On-line event reconstruction using a parallel in-memory database.",
                    "A system engineering methodology for predicting scalability of very large real-time databases.",
                    "Schedulability related issues in end-to-end systems.",
                    "Knowledge-Based assistance for real-time systems.",
                    "Model-embedded on-line problem solving environment for chemical engineering.",
                    "A unique tool set for engineering complex systems.",
                    "Compositional reasoning about projected and infinite time.",
                    "Formal specification and verification of communication protocols using automated tools .",
                    "Specifying static analysis tools using formal methods.",
                    "Model-based synthesis of a real-time image processing system.",
                    "Design and implementation of a distributed real-time image processing system.",
                    "Real-time computer controlled ultrasound therapy system for breast cancer treatment.",
                    "Modeling and design of complex cooperative software.",
                    "RECAP: a requirements elicitation, capture and analysis process prototype tool for large complex systems.",
                    "Abstract and concrete components: an approach to complex systems engineering.",
                    "A constraint function classification for complex systems development.",
                    "Target tracking: a real-time object oriented design experiment.",
                    "Enhancing object modelling technique with timing analysis capabilities.",
                    "An object-oriented approach to handle complex real-time industrial automation projects.",
                    "Applying object-oriented technology in real-time systems with the OCTOPUS method.",
                    "An object-oriented modeling of real-time robotic assembly system.",
                    "The computational requirements of mobile machines.",
                    "The effect of preemptive queuing in a priority-based real-time network.",
                    "Dynamic task migration from SIMD to SPMD virtual machines.",
                    "General-purpose multiparadigm programming languages: an enabling technology for constructing complex systems.",
                    "PolyCARE: a tool for re-engineering multi-language program integrations.",
                    "Formal specification of real-time dependable systems.",
                    "Using speculative execution for fault tolerance in a real-time system.",
                    "Architecture specifications for complex real-time dependable systems.",
                    "MULTIGRAPH: an architecture for model-integrated computing.",
                    "Specifying fault tolerance in large complex computing systems.",
                    "A requirements taxonomy for specifying complex systems.",
                    "Bridging structural and software design of PLC-based system families.",
                    "A parallel control computer structure for complex high speed applications.",
                    "Multivariate assessment of complex software systems: a comparative study.",
                    "Ensuring the satisfaction of a temporal specification at run-time.",
                    "Large complex system test: objectives and approaches.",
                    "Refinement of system-level designs using hybrid modeling.",
                    "The DELPHI experiment control system.",
                    "A construction of neural-net based AI systems."
                ]
            }
        ]
    }
]