[
    {
        "year": "2020",
        "name": "22nd ICFEM 2020",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2020",
                "sub_name": "Formal Methods and Software Engineering - 22nd International Conference on Formal Engineering Methods, ICFEM 2020, Singapore, Singapore, March 1-3, 2021, Proceedings.",
                "count": 20,
                "papers": [
                    "Hackers vs. Security: Attack-Defence Trees as Asynchronous Multi-agent Systems.",
                    "Robustness and Failure Detection in Epistemic Gossip Protocols.",
                    "Reasoning with Failures.",
                    "Verification of Programs with Pointers in SPARK.",
                    "Automated Temporal Verification of Integrated Dependent Effects.",
                    "A Reversible Operational Semantics for Imperative Programming Languages.",
                    "Parallel Chopped Symbolic Execution.",
                    "PAC Learning of Deterministic One-Clock Timed Automata.",
                    "Learning Fault Models of Cyber Physical Systems.",
                    "VARF: Verifying and Analyzing Robustness of Random Forests.",
                    "Type-Based Declassification for Free.",
                    "Four-Valued Monitorability of ømega-Regular Languages.",
                    "Formally Verified Trades in Financial Markets.",
                    "Formalizing the Transaction Flow Process of Hyperledger Fabric.",
                    "Embedding Approximation in Event-B: Safe Hybrid System Design Using Proof and Refinement.",
                    "Formal Foundations for Intel SGX Data Center Attestation Primitives.",
                    "Towards Modeling and Verification of the CKB Block Synchronization Protocol in Coq.",
                    "Accurate Abstractions for Controller Synthesis with Non-uniform Disturbances.",
                    "Formalising Privacy-Preserving Constraints in Microservices Architecture.",
                    "Algebraic Approach for Confidence Evaluation of Assurance Cases."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "21st ICFEM 2019",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2019",
                "sub_name": "Formal Methods and Software Engineering - 21st International Conference on Formal Engineering Methods, ICFEM 2019, Shenzhen, China, November 5-9, 2019, Proceedings.",
                "count": 37,
                "papers": [
                    "Secure Deep Learning Engineering: A Road Towards Quality Assurance of Intelligent Systems.",
                    "Using DimSpec for Bounded and Unbounded Software Model Checking.",
                    "SMTBCF: Efficient Backbone Computing for SMT Formulas.",
                    "Automatic Verification for Node-Based Visual Script Notation Using Model Checking.",
                    "A Reo Model of Software Defined Networks.",
                    "Design of Point-and-Click User Interfaces for Proof Assistants.",
                    "SqlSol: An accurate SQL Query Synthesizer.",
                    "Towards Verifying Ethereum Smart Contracts at Intermediate Language Level.",
                    "Simulations for Multi-Agent Systems with Imperfect Information.",
                    "On the Generation of Equational Dynamic Logics for Weighted Imperative Programs.",
                    "A Security Calculus for Wireless Networks of Named Data Networking.",
                    "Automatic Modularization of Large Programs for Bounded Model Checking.",
                    "PDNet: A Programming Language for Software-Defined Networks with VLAN.",
                    "Consistency Enforcement for Static First-Order Invariants in Sequential Abstract State Machines.",
                    "Probably Approximate Safety Verification of Hybrid Dynamical Systems.",
                    "A Formally Verified Algebraic Approach for Dynamic Reliability Block Diagrams.",
                    "Reasoning About Universal Cubes in MCMT.",
                    "sCompile: Critical Path Identification and Analysis for Smart Contracts.",
                    "A Mechanized Theory of Program Refinement.",
                    "A Relational Static Semantics for Call Graph Construction.",
                    "Solution Enumeration Abstraction: A Modeling Idiom to Enhance a Lightweight Formal Method.",
                    "Formal Analysis of Qualitative Long-Term Behaviour in Parametrised Boolean Networks.",
                    "Combining Parallel Emptiness Checks with Partial Order Reductions.",
                    "A Coalgebraic Semantics Framework for Quantum Systems.",
                    "Parameterized Hardware Verification Through a Term-Level Generalized Symbolic Trajectory Evaluation.",
                    "An Axiomatisation of the Probabilistic \\mu -Calculus.",
                    "Synthesizing Nested Ranking Functions for Loop Programs via SVM.",
                    "A First Step in the Translation of Alloy to Coq.",
                    "Assessment of a Formal Requirements Modeling Approach on a Transportation System.",
                    "Design Model Repair with Formal Verification.",
                    "A Performance-Sensitive Malware Detection System on Mobile Platform.",
                    "Certifying Hardware Model Checking Results.",
                    "A Note on Failure Mode Reasoning.",
                    "Robustness of Piece-Wise Linear Neural Network with Feasible Region Approaches.",
                    "Formal Specification and Verification of Smart Contracts.",
                    "Spatio-Temporal Specification Language for Cyber-Physical Systems.",
                    "A Modeling Framework of Cyber-Physical-Social Systems with Human Behavior Classification Based on Machine Learning."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "20th ICFEM 2018",
        "info": "Gold Coast, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2018",
                "sub_name": "Formal Methods and Software Engineering - 20th International Conference on Formal Engineering Methods, ICFEM 2018, Gold Coast, QLD, Australia, November 12-16, 2018, Proceedings.",
                "count": 37,
                "papers": [
                    "Engineering a Theory of Concurrent Programming.",
                    "Behaviour-Driven Formal Model Development.",
                    "The Foul Adversary: Formal Models.",
                    "The Miles Before Formal Methods - A Case Study on Modeling and Analyzing a Passenger Lift System.",
                    "PAR: A Practicable Formal Method and Its Supporting Platform.",
                    "Deductive Verification of Hybrid Control Systems Modeled in Simulink with KeYmaera X.",
                    "Verification of Strong Nash-equilibrium for Probabilistic BAR Systems.",
                    "Model Checking of C++ Programs Under the x86-TSO Memory Model.",
                    "Modeling and Verifying NDN Access Control Using CSP.",
                    "The Power of Synchronisation: Formal Analysis of Power Consumption in Networks of Pulse-Coupled Oscillators.",
                    "CDGDroid: Android Malware Detection Based on Deep Learning Using CFG and DFG.",
                    "Strongly Typed Numerical Computations.",
                    "Type Capabilities for Object-Oriented Programming Languages.",
                    "Capabilities: Effects for Free.",
                    "A Framework for Interactive Verification of Architectural Design Patterns in Isabelle/HOL.",
                    "Formalization of Symplectic Geometry in HOL-Light.",
                    "Using Theorem Provers to Increase the Precision of Dependence Analysis for Information Flow Control.",
                    "Preserving Liveness Guarantees from Synchronous Communication to Asynchronous Unstructured Low-Level Languages.",
                    "Deriving Mode Logic for Autonomous Resilient Systems.",
                    "UTP Semantics for BigrTiMo.",
                    "Analysis on Strategies of Superposition Refinement of Event-B Specifications.",
                    "Formalising Extended Finite State Machine Transition Merging.",
                    "Checking Activity Transition Systems with Back Transitions Against Assertions.",
                    "Towards Trustworthy AI for Autonomous Systems.",
                    "Towards Dependable and Explainable Machine Learning Using Automated Reasoning.",
                    "Modeling and Verification of Component Connectors.",
                    "Model Based Testing of Cyber-Physical Systems.",
                    "Service-Oriented Design and Verification of Hybrid Control Systems.",
                    "Developing Reliable Component-Based Software in Mediator.",
                    "Model Checking Nash-Equilibrium - Automatic Verification of Robustness in Distributed Systems.",
                    "Analyzing Security and Privacy in Design and Implementation of Web Authentication Protocols.",
                    "Combining Deep Learning and Probabilistic Model Checking in Sports Analytics.",
                    "Security Analysis of Smart Home Implementations.",
                    "Principled Greybox Fuzzing.",
                    "Engineering Software for Modular Formalisation and Verification of STV Algorithms.",
                    "Towards Building a Generic Vulnerability Detection Platform by Combining Scalable Attacking Surface Analysis and Directed Fuzzing.",
                    "Formalising Performance Guarantees in Meta-Reinforcement Learning."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th ICFEM 2017",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2017",
                "sub_name": "Formal Methods and Software Engineering - 19th International Conference on Formal Engineering Methods, ICFEM 2017, Xi'an, China, November 13-17, 2017, Proceedings.",
                "count": 29,
                "papers": [
                    "Towards Customizable CPS: Composability, Efficiency and Predictability.",
                    "Modularization of Refinement Steps for Agile Formal Methods.",
                    "Model Checking Pushdown Epistemic Game Structures.",
                    "Transforming Timing Requirements into CCSL Constraints to Verify Cyber-Physical Systems.",
                    "A Framework for Multi-view Reconciliation and for Medical Devices Personalization.",
                    "Compiling Parameterized X86-TSO Concurrent Programs to Cubicle- W.",
                    "Improving the Scalability of Automatic Linearizability Checking in SPIN.",
                    "Verifying Temporal Properties of C Programs via Lazy Abstraction.",
                    "Combining Event-B and CSP: An Institution Theoretic Approach to Interoperability.",
                    "Refinement-Based Modelling and Verification of Design Patterns for Self-adaptive Systems.",
                    "Assertion Generation Through Active Learning.",
                    "Detecting Energy Bugs in Android Apps Using Static Analysis.",
                    "A Flexible Approach for Finding Optimal Paths with Minimal Conflicts.",
                    "A Certified Decision Procedure for Tree Shares.",
                    "Classification-Based Parameter Synthesis for Parametric Timed Automata.",
                    "A Verification Framework for Stateful Security Protocols.",
                    "A Sliding-Window Algorithm for On-The-Fly Interprocedural Program Analysis.",
                    "Exploring Design Alternatives for RAMP Transactions Through Statistical Model Checking.",
                    "An Improved Android Collusion Attack Detection Method Based on Program Slicing.",
                    "Parameterized Complexity of Resilience Decision for Database Debugging.",
                    "Formal Analysis of Linear Control Systems Using Theorem Proving.",
                    "Policy Dependent and Independent Information Flow Analyses.",
                    "Improving Probability Estimation Through Active Probabilistic Model Learning.",
                    "Nested Timed Automata with Diagonal Constraints.",
                    "Integration of Metamorphic Testing with Program Repair Methods Based on Adaptive Search Strategies and Program Equivalence.",
                    "Learning Types for Binaries.",
                    "Inconsistency Analysis of Time-Based Security Policy and Firewall Policy.",
                    "An Algebraic Approach to Automatic Reasoning for NetKAT Based on Its Operational Semantics.",
                    "Pareto Optimal Reachability Analysis for Simple Priced Timed Automata."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th ICFEM 2016",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2016",
                "sub_name": "Formal Methods and Software Engineering - 18th International Conference on Formal Engineering Methods, ICFEM 2016, Tokyo, Japan, November 14-18, 2016, Proceedings.",
                "count": 29,
                "papers": [
                    "A (Proto) Logical Basis for the Notion of a Structured Argument in a Safety Case.",
                    "Promotion of Formal Approaches in Japanese Software Industry and a Best Practice of FeliCa's Case (Extended Abstract).",
                    "Automated Requirements Validation for ATP Software via Specification Review and Testing.",
                    "Automatic Generation of Potentially Pathological Instances for Validating Alloy Models.",
                    "A General Lattice Model for Merging Symbolic Execution Branches.",
                    "A Case Study of Formal Approach to Dynamically Reconfigurable Systems by Using Dynamic Linear Hybrid Automata.",
                    "Modelling Hybrid Systems in Event-B and Hybrid Event-B: A Comparison of Water Tanks.",
                    "A System Substitution Mechanism for Hybrid Systems in Event-B.",
                    "Service Adaptation with Probabilistic Partial Models.",
                    "A Formal Approach to Identifying Security Vulnerabilities in Telecommunication Networks.",
                    "Multi-threaded On-the-Fly Model Generation of Malware with Hash Compaction.",
                    "CPDY: Extending the Dolev-Yao Attacker with Physical-Layer Interactions.",
                    "Towards the Formal Verification of Data-Intensive Applications Through Metric Temporal Logic.",
                    "Proving Event-B Models with Reusable Generic Lemmas.",
                    "Formal Availability Analysis Using Theorem Proving.",
                    "Formal Verification of the rank Algorithm for Succinct Data Structures.",
                    "Contextual Trace Refinement for Concurrent Objects: Safety and Progress.",
                    "Local Livelock Analysis of Component-Based Models.",
                    "Session-Based Compositional Analysis for Actor-Based Languages Using Futures.",
                    "An Event-B Development Process for the Distributed BIP Framework.",
                    "Partial Order Reduction for State/Event Systems.",
                    "Concolic Unbounded-Thread Reachability via Loop Summaries.",
                    "Scaling BDD-based Timed Verification with Simulation Reduction.",
                    "Model Checking Real-Time Properties on the Functional Layer of Autonomous Robots.",
                    "Decision Problems for Parametric Timed Automata.",
                    "Verifying Nested Lock Priority Inheritance in RTEMS with Java Pathfinder.",
                    "An SMT-Based Approach to the Formal Analysis of MARTE/CCSL.",
                    "Checking SysML Models for Co-simulation.",
                    "A CEGAR Scheme for Information Flow Analysis."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th ICFEM 2015",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2015",
                "sub_name": "Formal Methods and Software Engineering - 17th International Conference on Formal Engineering Methods, ICFEM 2015, Paris, France, November 3-5, 2015, Proceedings.",
                "count": 27,
                "papers": [
                    "Domain-Specific Languages with Scala.",
                    "Formal Verification of Programs Computing the Floating-Point Average.",
                    "Formalization and Verification of Declarative Cloud Orchestration.",
                    "Consistency Verification of Specification Rules.",
                    "Applying Automata Learning to Embedded Control Software.",
                    "A 3-Valued Contraction Model Checking Game: Deciding on the World of Partial Information.",
                    "Supporting Requirements Analysis Using Pattern-Based Formal Specification Construction.",
                    "Dependency Analysis of Functional Specifications with Algebraic Data Structures.",
                    "A SysML Formal Framework to Combine Discrete and Continuous Simulation for Testing.",
                    "Mastering the Visualization of Larger State Spaces with Projection Diagrams.",
                    "Refinement-Based Verification of the FreeRTOS Scheduler in VCC.",
                    "Model Checking \\mu μ C/OS-III Multi-task System with TMSVL.",
                    "A Predictability Algorithm for Distributed Discrete Event Systems.",
                    "History-Based Specification and Verification of Scalable Concurrent and Distributed Systems.",
                    "Regression Verification for Programmable Logic Controller Software.",
                    "A Logical Approach for Behavioural Composition of Scenario-Based Models.",
                    "Formal Analysis of Power Electronic Systems.",
                    "Practical Analysis Framework for Component Systems with Dynamic Reconfigurations.",
                    "DFTCalc: Reliability Centered Maintenance via Fault Tree Analysis (Tool Paper).",
                    "B for Modeling Secure Information Systems - The B4MSecure Platform.",
                    "Enhanced Distributed Behavioral Cartography of Parametric Timed Automata.",
                    "A Recursive Probabilistic Temporal Logic.",
                    "Specifying Compatible Sharing in Data Structures.",
                    "Delta-Oriented FSM-Based Testing.",
                    "An Improved HHL Prover: An Interactive Theorem Prover for Hybrid Systems.",
                    "Continuation Semantics for Concurrency with Multiple Channels Communication.",
                    "SysML Blocks Adaptation."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th ICFEM 2014",
        "info": "Luxembourg",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2014",
                "sub_name": "Formal Methods and Software Engineering - 16th International Conference on Formal Engineering Methods, ICFEM 2014, Luxembourg, Luxembourg, November 3-5, 2014. Proceedings.",
                "count": 29,
                "papers": [
                    "Approximations for Stochastic Graph Rewriting.",
                    "Computing Maximal Bisimulations.",
                    "Improving the Model Checking of Strategies under Partial Observability and Fairness Constraints.",
                    "A Formal Model for Natural-Language Timed Requirements of Reactive Systems.",
                    "A Hybrid Model of Connectors in Cyber-Physical Systems.",
                    "A Language-Independent Proof System for Mutual Program Equivalence.",
                    "PHASE: A Stochastic Formalism for Phase-Type Distributions.",
                    "CASSANDRA: An Online Failure Prediction Strategy for Dynamically Evolving Systems.",
                    "Modal Characterisations of Probabilistic and Fuzzy Bisimulations.",
                    "Pointer Program Derivation Using Coq: Graphs and Schorr-Waite Algorithm.",
                    "An LTL Model Checking Approach for Biological Parameter Inference.",
                    "SCC-Based Improved Reachability Analysis for Markov Decision Processes.",
                    "Comprehension of Spacecraft Telemetry Using Hierarchical Specifications of Behavior.",
                    "Timed Automata Verification via IC3 with Zones.",
                    "GRL: A Specification Language for Globally Asynchronous Locally Synchronous Systems.",
                    "A Formal Framework to Prove the Correctness of Model Driven Engineering Composition Operators.",
                    "A Formula-Based Approach for Automatic Fault Localization of Imperative Programs.",
                    "A Resource-Based Logic for Termination and Non-termination Proofs.",
                    "Practical Analysis Framework for Software-Based Attestation Scheme.",
                    "TAuth: Verifying Timed Security Protocols.",
                    "On the Formal Analysis of HMM Using Theorem Proving.",
                    "Formal Modeling and Analysis of Cassandra in Maude.",
                    "Bounded Model Checking High Level Petri Nets in PIPE+Verifier.",
                    "Fast Translation from LTL to Büchi Automata via Non-transition-based Automata.",
                    "Complete Model-Based Equivalence Class Testing for the ETCS Ceiling Speed Monitor.",
                    "Contract-Based Verification of MATLAB and Simulink Matrix-Manipulating Code.",
                    "GPU Accelerated Counterexample Generation in LTL Model Checking.",
                    "Formal Throughput and Response Time Analysis of MARTE Models.",
                    "Extending MSVL with Function Calls."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th ICFEM 2013",
        "info": "Queenstown, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2013",
                "sub_name": "Formal Methods and Software Engineering - 15th International Conference on Formal Engineering Methods, ICFEM 2013, Queenstown, New Zealand, October 29 - November 1, 2013, Proceedings.",
                "count": 29,
                "papers": [
                    "Lattices of Information for Security: Deterministic, Demonic, Probabilistic.",
                    "Algebraic Laws for Process Subtyping.",
                    "Boundness Issues in CCSL Specifications.",
                    "Mining Dataflow Sensitive Specifications.",
                    "A Proof Slicing Framework for Program Verification.",
                    "Formally Verified System Initialisation.",
                    "Verifying an Aircraft Proximity Characterization Method in Coq.",
                    "Assisting Specification Refinement by Random Testing.",
                    "Generation of Checking Sequences Using Identification Sets.",
                    "The Circus Testing Theory Revisited in Isabelle/HOL.",
                    "A CSP Timed Input-Output Relation and a Strategy for Mechanised Conformance Verification.",
                    "Deadline Analysis of AUTOSAR OS Periodic Tasks in the Presence of Interrupts.",
                    "Improving Model Checking Stateful Timed CSP with non-Zenoness through Clock-Symmetry Reduction.",
                    "A Modular Approach for Reusing Formalisms in Verification Tools of Concurrent Systems.",
                    "A UTP Semantics for Communicating Processes with Shared Variables.",
                    "Verification of Static and Dynamic Barrier Synchronization Using Bounded Permissions.",
                    "Formal Models of SysML Blocks.",
                    "Towards a Process Algebra Framework for Supporting Behavioural Consistency and Requirements Traceability in SysML.",
                    "Translation from Workflow Nets to MSVL.",
                    "Asymptotic Bounds for Quantitative Verification of Perturbed Probabilistic Systems.",
                    "Verification of Functional and Non-functional Requirements of Web Service Composition.",
                    "vTRUST: A Formal Modeling and Verification Framework for Virtualization Systems.",
                    "Formal Kinematic Analysis of the Two-Link Planar Manipulator.",
                    "Formal Modelling of Resilient Data Storage in Cloud.",
                    "Linking Operational Semantics and Algebraic Semantics for Wireless Networks.",
                    "Automated Specification Discovery via User-Defined Predicates.",
                    "Path-Sensitive Data Flow Analysis Simplified.",
                    "Reconstructing Paths for Reachable Code.",
                    "The Domain of Parametric Hypercubes for Static Analysis of Computer Games Software."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th ICFEM 2012",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2012",
                "sub_name": "Formal Methods and Software Engineering - 14th International Conference on Formal Engineering Methods, ICFEM 2012, Kyoto, Japan, November 12-16, 2012. Proceedings.",
                "count": 34,
                "papers": [
                    "Toward Practical Application of Formal Methods in Software Lifecycle Processes.",
                    "Formal Methods in the Aerospace Industry: Follow the Money.",
                    "Applying Term Rewriting to Speech Recognition of Numbers.",
                    "Variable Permissions for Concurrency Verification.",
                    "A Concurrent Temporal Programming Model with Atomic Blocks.",
                    "A Composable Mixed Mode Concurrency Control Semantics for Transactional Programs.",
                    "Towards a Formal Verification Methodology for Collective Robotic Systems.",
                    "Modeling Resource-Aware Virtualized Applications for the Cloud in Real-Time ABS.",
                    "Specification and Model Checking of the Chandy and Lamport Distributed Snapshot Algorithm in Rewriting Logic.",
                    "Quantitative Program Dependence Graphs.",
                    "Quantitative Analysis of Information Flow Using Theorem Proving.",
                    "Modeling and Verification of Probabilistic Actor Systems Using pRebeca.",
                    "Modular Verification of OO Programs with Interfaces.",
                    "Separation Predicates: A Taste of Separation Logic in First-Order Logic.",
                    "The Confinement Problem in the Presence of Faults.",
                    "Verification of ATL Transformations Using Transformation Models and Model Finders.",
                    "Automatic Generation of Provably Correct Embedded Systems.",
                    "Complementary Methodologies for Developing Hybrid Systems with Event-B.",
                    "A Temporal Logic with Mean-Payoff Constraints.",
                    "Time Constraints with Temporal Logic Programming.",
                    "Stepwise Satisfiability Checking Procedure for Reactive System Specifications by Tableau Method and Proof System.",
                    "Equational Abstraction Refinement for Certified Tree Regular Model Checking.",
                    "SMT-Based False Positive Elimination in Static Program Analysis.",
                    "Predicate Analysis with Block-Abstraction Memoization.",
                    "Heuristic-Guided Abstraction Refinement for Concurrent Systems.",
                    "More Anti-chain Based Refinement Checking.",
                    "An Analytical and Experimental Comparison of CSP Extensions and Tools.",
                    "Symbolic Model-Checking of Stateful Timed CSP Using BDD and Digitization.",
                    "Annotations for Alloy: Automated Incremental Analysis Using Domain Specific Solvers.",
                    "State Space c-Reductions of Concurrent Systems in Rewriting Logic.",
                    "A Practical Loop Invariant Generation Approach Based on Random Testing, Constraint Solving and Verification.",
                    "ConSMutate: SQL Mutants for Guiding Concolic Testing of Database Applications.",
                    "Demonic Testing of Concurrent Programs.",
                    "Towards Certified Runtime Verification."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th ICFEM 2011",
        "info": "Durham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2011",
                "sub_name": "Formal Methods and Software Engineering - 13th International Conference on Formal Engineering Methods, ICFEM 2011, Durham, UK, October 26-28, 2011. Proceedings.",
                "count": 43,
                "papers": [
                    "Towards a Signal Calculus for Event-Based Synchronous Languages.",
                    "Reasoning about Programs Using a Scientific Method.",
                    "Poirot - A Concurrency Sleuth.",
                    "Context-Based Behavioral Equivalence of Components in Self-Adaptive Systems.",
                    "Towards a Practical Approach to Check UML/fUML Models Consistency Using CSP.",
                    "The Safety-Critical Java Mission Model: A Formal Account.",
                    "Is There Evolution Before Birth? Deterioration Effects of Formal Z Specifications.",
                    "Asynchronous Communication in MSVL.",
                    "Verification of Orchestration Systems Using Compositional Partial Order Reduction.",
                    "Domain-Driven Probabilistic Analysis of Programmable Logic Controllers.",
                    "Statistical Model Checking for Distributed Probabilistic-Control Hybrid Automata with Smart Grid Applications.",
                    "PRTS: An Approach for Model Checking Probabilistic Real-Time Hierarchical Systems.",
                    "Integrating Prototyping into the SOFL Three-Step Modeling Approach.",
                    "A Deterministic Interpreter Simulating a Distributed Real Time System Using VDM.",
                    "On Fitting a Formal Method into Practice.",
                    "A Formal Engineering Approach to High-Level Design of Situation Analysis Decision Support Systems.",
                    "Conformance Checking of Dynamic Access Control Policies.",
                    "A Knowledge-Based Verification Method for Dynamic Access Control Policies.",
                    "Validation of Security-Design Models Using Z.",
                    "Mutation in Linked Data Structures.",
                    "Contract-Based Verification of Simulink Models.",
                    "Exploiting Abstraction for Efficient Formal Verification of DSPs with Arrays of Reconfigurable Functional Units.",
                    "Architectural Verification of Control Systems Using CSP.",
                    "Symbolic Execution of Alloy Models.",
                    "Distributed Theorem Proving for Distributed Hybrid Systems.",
                    "Towards a Model Checker for NesC and Wireless Sensor Networks.",
                    "Formal Analysis of a Scheduling Algorithm for Wireless Sensor Networks.",
                    "An Abstract Model for Proving Safety of Multi-lane Traffic Manoeuvres.",
                    "Formal Derivation of a Distributed Program in Event B.",
                    "From Requirements to Development: Methodology and Example.",
                    "Reasoning about Liveness Properties in Event-B.",
                    "Extracting Significant Specifications from Mining through Mutation Testing.",
                    "Developer-Oriented Correctness Proofs - A Case Study of Cheney's Algorithm.",
                    "Static Analysis of String Values.",
                    "A Theory of Classes from the Theoretical Foundations of LePUS3.",
                    "Differencing Labeled Transition Systems.",
                    "Developing a Consensus Algorithm Using Stepwise Refinement.",
                    "Refining Nodes and Edges of State Machines.",
                    "Managing Complexity through Abstraction: A Refinement-Based Approach to Formalize Instruction Set Architectures.",
                    "A Language for Test Case Refinement in the Test Template Framework.",
                    "Automating Algebraic Methods in Isabelle.",
                    "Term Rewriting in Logics of Partial Functions.",
                    "Synchronous AADL and Its Formal Analysis in Real-Time Maude."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th ICFEM 2010",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2010",
                "sub_name": "Formal Methods and Software Engineering - 12th International Conference on Formal Engineering Methods, ICFEM 2010, Shanghai, China, November 17-19, 2010. Proceedings.",
                "count": 45,
                "papers": [
                    "Fostering Proof Scores in CafeOBJ.",
                    "Exploiting Partial Success in Applying Automated Formal Methods.",
                    "Multicore Embedded Systems: The Timing Problem and Possible Solutions.",
                    "Applying PVS Background Theories and Proof Strategies in Invariant Based Programming.",
                    "Proof Obligation Generation and Discharging for Recursive Definitions in VDM.",
                    "Correct-by-Construction Model Transformations from Partially Ordered Specifications in Coq.",
                    "Decision Procedures for the Temporal Verification of Concurrent Lists.",
                    "An Improved Decision Procedure for Propositional Projection Temporal Logic.",
                    "A Semantic Model for Service Composition with Coordination Time Delays.",
                    "Compensable WorkFlow Nets.",
                    "Automatically Testing Web Services Choreography with Assertions.",
                    "Applying Ordinary Differential Equations to the Performance Analysis of Service Composition.",
                    "Verifying Heap-Manipulating Programs with Unknown Procedure Calls.",
                    "API Conformance Verification for Java Programs.",
                    "Assume-Guarantee Reasoning with Local Specifications.",
                    "Automating Coinduction with Case Analysis.",
                    "Enhanced Semantic Access to Formal Software Models.",
                    "Making Pattern- and Model-Based Software Development More Rigorous.",
                    "Practical Parameterised Session Types.",
                    "A Formal Verification Study on the Rotterdam Storm Surge Barrier.",
                    "Formalization and Correctness of the PALS Architectural Pattern for Distributed Real-Time Systems.",
                    "Automated Multiparameterised Verification by Cut-Offs.",
                    "Automating Cut-off for Multi-parameterized Systems.",
                    "Method for Formal Verification of Soft-Error Tolerance Mechanisms in Pipelined Microprocessors.",
                    "Formal Verification of Tokeneer Behaviours Modelled in fUML Using CSP.",
                    "Model Checking Hierarchical Probabilistic Systems.",
                    "Trace-Driven Verification of Multithreaded Programs.",
                    "Closed Form Approximations for Steady State Probabilities of a Controlled Fork-Join Network.",
                    "Reasoning about Safety and Progress Using Contracts.",
                    "Abstract Program Slicing: From Theory towards an Implementation.",
                    "Loop Invariant Synthesis in a Combined Domain.",
                    "Software Metrics in Static Program Analysis.",
                    "A Combination of Forward and Backward Reachability Analysis Methods.",
                    "Model Checking a Model Checker: A Code Contract Combined Approach.",
                    "On Symmetries and Spotlights - Verifying Parameterised Systems.",
                    "A Methodology for Automatic Diagnosability Analysis.",
                    "Making the Right Cut in Model Checking Data-Intensive Timed Systems.",
                    "Comparison of Model Checking Tools for Information Systems.",
                    "A Modular Scheme for Deadlock Prevention in an Object-Oriented Programming Model.",
                    "Model-Driven Protocol Design Based on Component Oriented Modeling.",
                    "Laws of Pattern Composition.",
                    "Dynamic Resource Reallocation between Deployment Components.",
                    "A Pattern System to Support Refining Informal Ideas into Formal Expressions.",
                    "Specification Translation of State Machines from Equational Theories into Rewrite Theories.",
                    "Alternating Interval Based Temporal Logics."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th ICFEM 2009",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2009",
                "sub_name": "Formal Methods and Software Engineering, 11th International Conference on Formal Engineering Methods, ICFEM 2009, Rio de Janeiro, Brazil, December 9-12, 2009. Proceedings.",
                "count": 38,
                "papers": [
                    "Seamless Model Driven Systems Engineering Based on Formal Models.",
                    "Compositional Verification of Input-Output Conformance via CSP Refinement Checking.",
                    "Symbolic Query Exploration.",
                    "Event Listener Analysis and Symbolic Execution for Testing GUI Applications.",
                    "An Empirical Study of Structural Constraint Solving Techniques.",
                    "Improving Automatic Verification of Security Protocols with XOR.",
                    "Modeling and Verification of Privacy Enhancing Protocols.",
                    "Role-Based Symmetry Reduction of Fault-Tolerant Distributed Protocols with Language Support.",
                    "Implementing and Applying the Stocks-Carrington Framework for Model-Based Testing.",
                    "A Statistical Approach to Test Stochastic and Probabilistic Systems.",
                    "Qualitative Action Systems.",
                    "RAFFS: Model Checking a Robust Abstract Flash File Store.",
                    "European Train Control System: A Case Study in Formal Verification.",
                    "Development of Security Software: A High Assurance Methodology.",
                    "Bounded Semantics of CTL and SAT-Based Verification.",
                    "Graded-CTL: Satisfiability and Symbolic Model Checking.",
                    "Approximate Model Checking of PCTL Involving Unbounded Path Properties.",
                    "A Graph-Based Operational Semantics of OO Programs.",
                    "Modeling and Analysis of Thread-Pools in an Industrial Communication Platform.",
                    "A Verification System for Distributed Objects with Asynchronous Method Calls.",
                    "A Time-Optimal On-the-Fly Parallel Algorithm for Model Checking of Weak LTL Properties.",
                    "Scalable Multi-core Model Checking Fairness Enhanced Systems.",
                    "Combining Static Model Checking with Dynamic Enforcement Using the Statecall Policy Language.",
                    "Supporting Reuse of Event-B Developments through Generic Instantiation.",
                    "A Lazy Unbounded Model Checker for Event-B.",
                    "Proof Assisted Model Checking for B.",
                    "Machine-Checked Sequencer for Critical Embedded Code Generator.",
                    "Implementing a Direct Method for Certificate Translation.",
                    "Algorithmic Verification with Multiple and Nested Parameters.",
                    "Verifying Stateful Timed CSP Using Implicit Clocks and Zone Abstraction.",
                    "Modal Systems: Specification, Refinement and Realisation.",
                    "Refinement-Preserving Co-evolution.",
                    "Circular Coinduction with Special Contexts.",
                    "The VSE Refinement Method in Hets.",
                    "A Compositional Approach on Modal Specifications for Timed Systems.",
                    "An Efficient Translation of Timed-Arc Petri Nets to Networks of Timed Automata.",
                    "Verifying Ptolemy II Discrete-Event Models Using Real-Time Maude.",
                    "Specifying and Verifying Business Processes Using PPML."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th ICFEM 2008",
        "info": "Kitakyushu-City, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2008",
                "sub_name": "Formal Methods and Software Engineering, 10th International Conference on Formal Engineering Methods, ICFEM 2008, Kitakyushu-City, Japan, October 27-31, 2008. Proceedings.",
                "count": 23,
                "papers": [
                    "How Can We Make Industry Adopt Formal Methods?",
                    "Programmers Ain't Mathematicians, and Neither Are Testers.",
                    "Contract-Based Reasoning for Verification and Certification of Secure Information Flow Policies in Industrial Workflows.",
                    "Specifying and Verifying Event-Based Fairness Enhanced Systems.",
                    "Modelling and Proof of a Tree-Structured File System in Event-B and Rodin.",
                    "Conformance Testing Based on UML State Machines.",
                    "An Approach to Testing with Embedded Context Using Model Checker.",
                    "Requirements Coverage as an Adequacy Measure for Conformance Testing.",
                    "Decomposition for Compositional Verification.",
                    "A Formal Soundness Proof of Region-Based Memory Management for Object-Oriented Paradigm.",
                    "Program Models for Compositional Verification.",
                    "A Unified Model Checking Approach with Projection Temporal Logic.",
                    "Formal Analysis of the Bakery Protocol with Consideration of Nonatomic Reads and Writes.",
                    "Towards Abstraction for DynAlloy Specifications.",
                    "Partial Translation Verification for Untrusted Code-Generators.",
                    "A Practical Approach to Partiality - A Proof Based Approach.",
                    "A Representative Function Approach to Symmetry Exploitation for CSP Refinement Checking.",
                    "Probing the Depths of CSP-M: A New fdr-Compliant Validation Tool.",
                    "Practical Automated Partial Verification of Multi-paradigm Real-Time Models.",
                    "Specifying and Verifying Sensor Networks: An Experiment of Formal Methods.",
                    "Correct Channel Passing by Construction.",
                    "A Process Semantics for BPMN.",
                    "A Formal Descriptive Semantics of UML."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9th ICFEM 2007",
        "info": "Boca Raton, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2007",
                "sub_name": "Formal Methods and Software Engineering, 9th International Conference on Formal Engineering Methods, ICFEM 2007, Boca Raton, FL, USA, November 14-15, 2007, Proceedings.",
                "count": 21,
                "papers": [
                    "A System Development Process with Event-B and the Rodin Platform.",
                    "Challenges in Software Certification.",
                    "Integrating Formal Methods with System Management.",
                    "Formal Engineering of XACML Access Control Policies in VDM++.",
                    "A Verification Framework for Agent Knowledge.",
                    "From Model-Based Design to Formal Verification of Adaptive Embedded Systems.",
                    "Machine-Assisted Proof Support for Validation Beyond Simulink.",
                    "VeSTA: A Tool to Verify the Correct Integration of a Component in a Composite Timed System.",
                    "Integrating Specification-Based Review and Testing for Detecting Errors in Programs.",
                    "Testing for Refinement in CSP.",
                    "Reducing Test Sequence Length Using Invertible Sequences.",
                    "Model Checking with SAT-Based Characterization of ACTL Formulas.",
                    "Automating Refinement Checking in Probabilistic System Design.",
                    "Model Checking in Practice: Analysis of Generic Bootloader Using SPIN.",
                    "Model Checking Propositional Projection Temporal Logic Based on SPIN.",
                    "A Denotational Semantics for Handel-C Hardware Compilation.",
                    "Automatic Generation of Verified Concurrent Hardware.",
                    "Modeling and Verification of Master/Slave Clock Synchronization Using Hybrid Automata and Model-Checking.",
                    "Efficient Symbolic Execution of Large Quantifications in a Process Algebra.",
                    "Formalizing SANE Virtual Processor in Thread Algebra.",
                    "Calculating and Composing Progress Properties in Terms of the Leads-to Relation."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8th ICFEM 2006",
        "info": "Macao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2006",
                "sub_name": "Formal Methods and Software Engineering, 8th International Conference on Formal Engineering Methods, ICFEM 2006, Macao, China, November 1-3, 2006, Proceedings.",
                "count": 41,
                "papers": [
                    "Program Verification Through Computer Algebra.",
                    "JML's Rich, Inherited Specifications for Behavioral Subtypes.",
                    "Three Perspectives in Formal Engineering.",
                    "A Method for Formalizing, Analyzing, and Verifying Secure User Interfaces.",
                    "Applying Timed Interval Calculus to Simulink Diagrams.",
                    "Reducing Model Checking of the Few to the One.",
                    "Induction-Guided Falsification.",
                    "Verifying chi Models of Industrial Systems with Spin.",
                    "Stateful Dynamic Partial-Order Reduction.",
                    "User-Defined Atomicity Constraint: A More Flexible Transaction Model for Reliable Service Composition.",
                    "Environment Ontology-Based Capability Specification for Web Service Discovery.",
                    "Scenario-Based Component Behavior Derivation.",
                    "Verification of Computation Orchestration Via Timed Automata.",
                    "Towards the Semantics for Web Service Choreography Description Language.",
                    "Type Checking Choreography Description Language.",
                    "Formalising Progress Properties of Non-blocking Programs.",
                    "Towards a Fully Generic Theory of Data.",
                    "Verifying Statemate Statecharts Using CSP and FDR.",
                    "A Reasoning Method for Timed CSP Based on Constraint Solving.",
                    "Mapping RT-LOTOS Specifications into Time Petri Nets.",
                    "Reasoning Algebraically About Probabilistic Loops.",
                    "Formal Verification of the Heap Manager of an Operating System Using Separation Logic.",
                    "A Statically Verifiable Programming Model for Concurrent Object-Oriented Programs.",
                    "Model Checking Dynamic UML Consistency.",
                    "Conditions for Avoiding Controllability Problems in Distributed Testing.",
                    "Generating Test Cases for Constraint Automata by Genetic Symbiosis Algorithm.",
                    "Checking the Conformance of Java Classes Against Algebraic Specifications.",
                    "Incremental Slicing.",
                    "Assume-Guarantee Software Verification Based on Game Semantics.",
                    "Optimized Execution of Deterministic Blocks in Java PathFinder.",
                    "A Tool for a Formal Pattern Modeling Language.",
                    "An Open Extensible Tool Environment for Event-B.",
                    "Tool for Translating Simulink Models into Input Language of a Model Checker.",
                    "Verifying Abstract Information Flow Properties in Fault Tolerant Security Devices.",
                    "A Language for Modeling Network Availability.",
                    "Multi-process Systems Analysis Using Event B: Application to Group Communication Systems.",
                    "Issues in Implementing a Model Checker for Z.",
                    "Taking Our Own Medicine: Applying the Refinement Calculus to State-Rich Refinement Model Checking.",
                    "Discovering Likely Method Specifications.",
                    "Time Aware Modelling and Analysis of Multiclocked VLSI Systems.",
                    "SALT - Structured Assertion Language for Temporal Logic."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th ICFEM 2005",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2005",
                "sub_name": "Formal Methods and Software Engineering, 7th International Conference on Formal Engineering Methods, ICFEM 2005, Manchester, UK, November 1-4, 2005, Proceedings.",
                "count": 33,
                "papers": [
                    "Realising the Benefits of Formal Methods.",
                    "A Compositional Framework for Service Interaction Patterns and Interaction Flows.",
                    "An Evidential Tool Bus.",
                    "Derivation of UML Class Diagrams as Static Views of Formal B Developments.",
                    "29 New Unclarities in the Semantics of UML 2.0 State Machines.",
                    "The Semantics and Tool Support of OZTA.",
                    "An Abstract Model for Process Mediation.",
                    "How Symbolic Animation Can Help Designing an Efficient Formal Model.",
                    "A Theory of Secure Control Flow.",
                    "Game Semantics Model for Security Protocols.",
                    "Towards Dynamically Communicating Abstract Machines in the B Method.",
                    "Sweep-Line Analysis of TCP Connection Management.",
                    "2/3 Alternating Simulation Between Interface Automata.",
                    "Formal Model-Driven Development of Communicating Systems.",
                    "Jahuel: A Formal Framework for Software Synthesis.",
                    "Modelling and Refinement of an On-Chip Communication Architecture.",
                    "Finding Bugs in Network Protocols Using Simulation Code and Protocol-Specific Heuristics.",
                    "Adaptive Random Testing by Bisection with Restriction.",
                    "Testing Real-Time Multi Input-Output Systems.",
                    "Formal Verification of a Memory Model for C-Like Imperative Languages.",
                    "Symbolic Verification of Distributed Real-Time Systems with Complex Synchronizations.",
                    "An Improved Rule for While Loops in Deductive Program Verification.",
                    "Using Stålmarck's Algorithm to Prove Inequalities.",
                    "Automatic Refinement Checking for B.",
                    "Slicing an Integrated Formal Method for Verification.",
                    "A Static Communication Elimination Algorithm for Distributed System Verification.",
                    "Incremental Verification of Owicki/Gries Proof Outlines Using PVS.",
                    "Using Three-Valued Logic to Specify and Verify Algorithms of Computational Geometry.",
                    "An Automated Approach to Specification-Based Program Inspection.",
                    "Visualizing and Simulating Semantic Web Services Ontologies.",
                    "A Model-to-Implementation Mapping Tool for Automated Model-Based GUI Testing.",
                    "ClawZ: Cost-Effective Formal Verification for Control Systems.",
                    "SVG Web Environment for Z Specification Language."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th ICFEM 2004",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2004",
                "sub_name": "Formal Methods and Software Engineering, 6th International Conference on Formal Engineering Methods, ICFEM 2004, Seattle, WA, USA, November 8-12, 2004, Proceedings.",
                "count": 39,
                "papers": [
                    "Model-Based Development: Combining Engineering Approaches and Formal Techniques.",
                    "Tutorial on the RAISE Language, Method and Tools.",
                    "Model-Based Testing with Spec#.",
                    "Formal Engineering for Industrial Software Development - An Introduction to the SOFL Specification Language and Method.",
                    "Tutorial: Software Model Checking.",
                    "Engineering Quality Software.",
                    "When Can Formal Methods Make a Real Difference?",
                    "On the Adoption of Formal Methods by Industry: The ACL2 Experience.",
                    "A CLP Approach to Modelling Systems.",
                    "Multi-prover Verification of C Programs.",
                    "Memory-Model-Sensitive Data Race Analysis.",
                    "Formal Models for Web Navigations with Session Control and Browser Cache.",
                    "Managing Verification Activities Using SVM.",
                    "A General Model for Reachability Testing of Concurrent Programs.",
                    "A Knowledge Based Analysis of Cache Coherence.",
                    "A Propositional Logic-Based Method for Verification of Feature Models.",
                    "Deriving Probabilistic Semantics Via the 'Weakest Completion'.",
                    "CSP Representation of Game Semantics for Second-Order Idealized Algol.",
                    "An Equational Calculus for Alloy.",
                    "Guiding Spin Simulation.",
                    "Linear Inequality LTL (iLTL): A Model Checker for Discrete Time Markov Chains.",
                    "Software Model Checking Using Linear Constraints.",
                    "Counterexample Guided Abstraction Refinement Via Program Execution.",
                    "Faster Analysis of Formal Specifications.",
                    "Bridging Refinement of Interface Automata to Forward Simulation of I/O Automata.",
                    "Learning to Verify Safety Properties.",
                    "Automatic Extraction of Object-Oriented Observer Abstractions from Unit-Test Executions.",
                    "A Specification-Based Approach to Testing Polymorphic Attributes.",
                    "From Circus to JCSP.",
                    "An Approach to Preserve Protocol Consistency and Executability Across Updates.",
                    "A Formal Monitoring-Based Framework for Software Development and Analysis.",
                    "Verifying a File System Implementation.",
                    "Verifying the On-line Help System of SIEMENS Magnetic Resonance Tomographs.",
                    "Implementing Dynamic Aggregations of Abstract Machines in the B Method.",
                    "Formal Proof from UML Models.",
                    "Interactive Verification of UML State Machines.",
                    "Refinement of Actions for Real-Time Concurrent Systems with Causal Ambiguity.",
                    "From Durational Specifications to TLA Designs of Timed Automata.",
                    "Timed Patterns: TCOZ to Timed Automata."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5th ICFEM 2003",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2003",
                "sub_name": "Formal Methods and Software Engineering, 5th International Conference on Formal Engineering Methods, ICFEM 2003, Singapore, November 5-7, 2003, Proceedings.",
                "count": 37,
                "papers": [
                    "Programs as Paths: An Approach to Timing Constraint Analysis.",
                    "Model Based Code Verification.",
                    "Adding Formalism to Methods or Where and When Will Industry Use Formal Reasoning?.",
                    "Using Formal Methods to Serialize Synchronization Events.",
                    "An AMBA-ARM7 Formal Verification Platform.",
                    "Formalization, Testing and Execution of a Use Case Diagram.",
                    "Service-Based Systems Engineering: Consistent Combination of Services.",
                    "Using State Diagrams to Describe Concurrent Behaviour.",
                    "The Equivalence of Statecharts.",
                    "Generic Interacting State Machines and Their Instantiation with Dynamic Features.",
                    "Using PVS to Prove Properties of Systems Modelled in a Synchronous Dataflow Language.",
                    "Formalising an Integrated Language in PVS.",
                    "Modeling System C Fixed-Point Arithmetic in HOL.",
                    "Adding Action Refinement to Stochastic True Concurrency Models.",
                    "Incremental Derivation of Abstraction Relations for Data Refinement.",
                    "Comparison of Data and Process Refinement.",
                    "Compilation by Refinement for a Practical Assembly Language.",
                    "Java Card Code Generation from B Specifications.",
                    "Efficient Path Finding with the Sweep-Line Method Using External Storage.",
                    "Formal Development of a Distributed Logging Mechanism Supporting Disconnected Updates.",
                    "Formal Proof of a Polychronous Protocol for Loosely Time-Triggered Architectures.",
                    "A Z Based Approach to Verifying Security Protocols.",
                    "A Refinement Tool for Z.",
                    "The Common Semantic Constructs of XML Family.",
                    "Controller Synthesis for Object Petri Nets.",
                    "Towards a Workflow Model of Real-Time Cooperative Systems.",
                    "New Developments in Closed-Form Computation for GSPN Aggregation.",
                    "On Clock Difference Constraints and Termination in Reachability Analysis of Timed Automata.",
                    "Analyzing the Redesign of a Distributed Lift System in UPPAAL.",
                    "Verification of Timeliness QoS Properties in Multimedia Systems.",
                    "A Calculus for Set-Based Program Development.",
                    "Compositional Verification of a Switch Fabric from Nortel Networks.",
                    "Constraint-Based Model Checking of Data-Independent Systems.",
                    "A Formal Model for the Block Device Subsystem of the Linux Kernel.",
                    "A Mathematical Framework for Safecharts.",
                    "A Relational Model for Formal Object-Oriented Requirement Analysis in UML.",
                    "From Specification to Hardware Device: A Synthesis Algorithm."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4th ICFEM 2002",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2002",
                "sub_name": "Formal Methods and Software Engineering, 4th International Conference on Formal Engineering Methods, ICFEM 2002 Shanghai, China, October 21-25, 2002, Proceedings.",
                "count": 62,
                "papers": [
                    "SFI: A Refinement Based Layered Software Architecture.",
                    "Developing Quality Software Systems Using the SOFL Formal Engineering Method.",
                    "Maintaining Referential Integrity on the Web.",
                    "Formal Methods in Enterprise Computing.",
                    "Unifying Theories of Parallel Programming.",
                    "ABC/ADL: An ADL Supporting Component Composition.",
                    "The Description of CORBA Objects Based on Petri Nets.",
                    "Toward a Formal Model of Software Components.",
                    "A Specification-Based Software Construction Framework for Reuse.",
                    "Specifying a Component Model for Building Dynamically Reconfigurable Distributed Systems.",
                    "Three-Tiered Specification of Micro-architectures.",
                    "Modeling the Architecture for Component-Based E-commerce System.",
                    "Component Specification and Wrapper/Glue Code Generation with Two-Level Grammar Using Domain Specific Knowledge.",
                    "Abstract Specification in Object-Z and CSP.",
                    "Mechanization of an Integrated Approach: Shallow Embedding into SAL/PVS.",
                    "Concept Use or Concept Refinement: An Important Distinction in Building Generic Specifications.",
                    "An Overview of Mobile Object-Z.",
                    "Z Approach to Semantic Web.",
                    "Hardware/Software Partitioning in Verilog.",
                    "A Formal Methodology to Specify E-commerce Systems.",
                    "Model-Based Specification Animation Using Testgraphs.",
                    "An Abstract Model for Scheduling Real-Time Programs.",
                    "A Specification and Validation Technique Based on STATEMATE and FNLOG.",
                    "Formal Representation and Analysis of Batch Stock Trading Systems by Logical Petri Net Workflows.",
                    "A Calculus for Mobile Network Systems.",
                    "Modelling Real-Time Systems with Continuous-Time Temporal Logic.",
                    "On Concept-Based Definition of Domain-Specific Languages.",
                    "Formal Specification of Evolutionary Software Agents.",
                    "Detecting Deadlock in Ada Rendezvous Flow Structure Based on Process Algebra.",
                    "Formal Analysis of Real-Time Systems with SAM.",
                    "Tool Support for Visualizing CSP in UML.",
                    "Theorem Prover Support for Precondition and Correctness Calculation.",
                    "XML-Based Static Type Checking and Dynamic Visualization for TCOZ.",
                    "µ-Chart-Based Specification and Refinement.",
                    "Towards a Refinement Calculus for Concurrent Real-Time Programs.",
                    "Refinement Algebra for Formal Bytecode Generation.",
                    "Formal Modelling of Java GUI Event Handling.",
                    "A New Algorithm for Service Interaction Detection.",
                    "Specification of an Asynchronous On-chip Bus.",
                    "Analysis of a Security Protocol in µCRL.",
                    "Developing a Spell-Checker for Tajik Using RAISE.",
                    "M2Z: A Tool for Translating a Natural Language Software Specification into Z.",
                    "Abstract Interpretation with a Theorem Prover.",
                    "Formal Reasoning about Hardware and Software Memory Models.",
                    "Slicing Hierarchical Automata for Model Checking UML Statecharts.",
                    "Formal Verification of a SONET Telecom System Block.",
                    "Enabling Hardware Verification through Design Changes.",
                    "Specification-Based Test Generation for Security-Critical Systems Using Mutations.",
                    "A Formal Definition of Function Points for Automated Measurement of B Specifications.",
                    "Machine Code Type Safety.",
                    "On the Formalized Semantics of Static Modeling Elements in UML.",
                    "From a B Specification to UML StateChart Diagrams.",
                    "Formalizing UML Models with Object-Z.",
                    "Using Transition Systems to Unify UML Models.",
                    "A Formal Metamodeling Approach to a Transformation between the UML State Machine and Object-Z.",
                    "A UML Approach to the Design of Open Distributed Systems.",
                    "A Semantic Model of Real-Time UML.",
                    "Research on Ontology-Oriented Domain Analysis on MIS.",
                    "A Requirements Description Model Based on Conditional Directed Graphs.",
                    "Introducing Reference Semantics via Refinement.",
                    "Soundness, Completeness and Non-redundancy of Operational Semantics for Verilog Based on Denotational Semantics.",
                    "Towards a Time Model for Circus."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd ICFEM 2000",
        "info": "York, England, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/2000",
                "sub_name": "3rd IEEE International Conference on Formal Engineering Methods, ICFEM 2000, York, England, UK, September 4-7, 2000, Proceedings.",
                "count": 22,
                "papers": [
                    "The Use of Mathematics in Software Engineering.",
                    "Formal Derivation of Multilayered Hardware/Software Structures.",
                    "Embedding Formally Proved Code in a Smart Card: Converting B to C.",
                    "Structuring Reactive Systems in B AMN.",
                    "Highly Reliable Component-Based Software Development by Using Algebraic Behavioral Specification.",
                    "Composing Specifications in VSPEC.",
                    "A Unified Algebraic Framework for Specifying Communication Protocols.",
                    "Formal Treatment of a Family of Fixed-Point Problems on Graphs by CafeOBJ.",
                    "Legacy Code.",
                    "SPIN vs. VIS: A Case Study on the Formal Verification of the ATMR Protocol.",
                    "Mechanical Verification of Transaction Processing Systems.",
                    "Formal Foundations of Object-Oriented Modeling Notations.",
                    "Using Use Cases in Executable Z.",
                    "Translating UAN into CSP.",
                    "Maximally Abstract Retrenchments.",
                    "Fragmented Retrenchment, Concurrency and Fairness.",
                    "Offering Formal Verification Capabilities for Industry Standard Case Tools: Challenges and Results.",
                    "Filter Promotion Transformation Strategies for Deriving Efficient Programs from Z Specifications.",
                    "ClawZ: Control Laws in Z.",
                    "A Case Study in Partial Specification: Consistency and Refinement for Object-Z.",
                    "An Integrated CSP-Based Tool for the Visualisation, Animation and Performance Evaluation of Message Passing Algorithms.",
                    "An Animatable Operational Semantics of the Verilog Hardware Description Language."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "2nd ICFEM 1998",
        "info": "Brisbane, Queensland, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/1998",
                "sub_name": "Second IEEE International Conference on Formal Engineering Methods, ICFEM 1998, Brisbane, Queensland, Australia, December 9-11, 1998, Proceedings.",
                "count": 22,
                "papers": [
                    "Interaction Interfaces - Towards a Scientific Foundation of a Methodological Usage of Message Sequence Charts.",
                    "Active Objects in TCOZ.",
                    "Incremental Architectural Modeling and Verification of Real-Time Concurrent Systems.",
                    "B Model Animation for External Verification.",
                    "Using Model Checking to Generate Tests from Specifications.",
                    "A Calculus Based on the Agent-Place Model.",
                    "Defining Differentiation and Integration in Z.",
                    "Towards Industrially Applicable Formal Methods: Three Small Steps and One Giant Leap.",
                    "A Process Algebra Based Verification of a Production System.",
                    "Market-Driven Symbolic Execution of Methods of Manufacturing Enterprises.",
                    "Interacting Frameworks in Catalysis.",
                    "From Monolithic to Modular Formal Specification.",
                    "Automatic Synthesis of Controllers from Formal Specifications.",
                    "Selective Integration of Formal Methods in the Development of Electronic Control Units.",
                    "Proving Inductive Theorems Using Witnessed Test Sets.",
                    "Translating Object-Z Specifications to Passive Test Oracles.",
                    "Ubiquitous Abstraction: A New Approach to Mechanized Formal Verification.",
                    "Formal Specification of CORBA Services Using Object-Z.",
                    "The B Bank: A Complete Case Study.",
                    "The Formal Specification of the Fieldbus Foundation Link Scheduler in E-LOTOS.",
                    "Application of Embedded Testing Methods to Service Validation.",
                    "Specification-Based Class Testing: A Case Study."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st ICFEM 1997",
        "info": "Hiroshima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfem/1997",
                "sub_name": "First IEEE International Conference on Formal Engineering Methods, ICFEM 1997, Hiroshima, Japan, November 12-14, 1997, Proceedings.",
                "count": 32,
                "papers": [
                    "Whither Formal Methods: A Plea to Investigate New Applications.",
                    "Towards a Rigorous Object-Oriented Analysis and Design Method.",
                    "Hybrid Object-Oriented Real-Time Software Development with VDM++.",
                    "Towards a Formal Semantics for an Integrated SA/RT & Z Specification Language.",
                    "A Pragmatic, Rigorous Integration of Structural and Behavioral Modeling Notations.",
                    "Formal Automatic Verification of Authentication Crytographic Protocols.",
                    "Incremental Specification of Telecommunication Services.",
                    "Generic Engineering of Communication Protocols - Current Experience and Future Issues.",
                    "Test Case Design Based on Z and the Classification-Tree Method.",
                    "A Formal Approach to Testing LUSTRE Specifications.",
                    "CASTING: A Formally Based Software Test Generation Method.",
                    "Formally Specifying and Verifying Real-Time Systems.",
                    "Using CARE to Construct Verified Software.",
                    "A Simple Program whose Derivation and Proof is Also.",
                    "Systematic Formal Verification of Interpreters.",
                    "The Specification-Based Testing of a Trusted Kernel: MK++.",
                    "Formalizing Process Scheduling Requirements for an Aircraft Operational Flight Program.",
                    "An Overview of CAFE Specification Environment - An Algebraic Approach for Creating, Verifying, and Maintaining Formal Specifications over Networks.",
                    "A Methodological Approach to the Requirement Specification of Embedded Systems.",
                    "Specification and Analysis of System Level Inter-Component Communication.",
                    "Refinement of Information Flow Architectures.",
                    "Frameworks in Catalysis: Pictorial Notation and Formal Semantics.",
                    "Development and Application of a Formal Agent Framework.",
                    "Formal Specification and Verification of the MISSI Sender and Local Cache using SPIN.",
                    "Automatic Generation of Formal Specification from Requirements Definition.",
                    "A Generic Approach to the Formal Specification of Requirements.",
                    "Michael Jackson's Problem Frames: Towards Methodological Principles of Selecting and Applying Formal Software Development Techniques and Tools.",
                    "An Operational Semantics for ZCCS.",
                    "The State-Based CCS Semantics for Concurrent Z Specification.",
                    "Refinement and Verification of Concurrent Systems Specified in Object-Z and CSP.",
                    "Formal Specification of Dynamic Constraints with the B Method.",
                    "Software Measurement and Formal Methods: A Case Study Centered on TRIO+ Specifications."
                ]
            }
        ]
    }
]