[
    {
        "year": "2021",
        "name": "26th ICFP 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 5(ICFP)",
                "count": 167,
                "papers": [
                    "Cyclic proofs, system t, and the power of contraction.",
                    "Diamonds are not forever: liveness in reactive programming with guarded recursion.",
                    "𝜆ₛ: computable semantics for differentiable programming with higher-order functions and datatypes.",
                    "Verifying observational robustness against a c11-style memory model.",
                    "On algebraic abstractions for concurrent separation logics.",
                    "Efficient and provable local capability revocation using uninitialized capabilities.",
                    "Fully abstract from static to gradual.",
                    "Deciding accuracy of differential privacy schemes.",
                    "A computational interpretation of compact closed categories: reversible programming with negative and fractional types.",
                    "Mechanized logical relations for termination-insensitive noninterference.",
                    "Probabilistic programming semantics for name generation.",
                    "Internalizing representation independence with univalence.",
                    "Transfinite step-indexing for termination.",
                    "Generating collection transformations from proofs.",
                    "Learning the boundary of inductive invariants.",
                    "Precise subtyping for asynchronous multiparty sessions.",
                    "Verifying correct usage of context-free API protocols.",
                    "Provably space-efficient parallel functional programming.",
                    "Data flow refinement type inference.",
                    "Simplifying dependent reductions in the polyhedral model.",
                    "On the semantic expressiveness of recursive types.",
                    "Intrinsically typed compilation with nameless labels.",
                    "egg: Fast and extensible equality saturation.",
                    "Asynchronous effects.",
                    "Modeling and analyzing evaluation cost of CUDA kernels.",
                    "Dijkstra monads forever: termination-sensitive specifications for interaction trees.",
                    "A unifying type-theory for higher-order (amortized) cost analysis.",
                    "Automatic differentiation in PCF.",
                    "An approach to generate correctly rounded math libraries for new floating point variants.",
                    "Semantics-guided synthesis.",
                    "An abstract interpretation for SPMD divergence on reducible control flow graphs.",
                    "Intersection types and (positive) almost-sure termination.",
                    "A separation logic for effect handlers.",
                    "The fine-grained and parallel complexity of andersen's pointer analysis.",
                    "Giving semantics to program-counter labels via secure effects.",
                    "Optimal prediction of synchronization-preserving races.",
                    "A verified optimizer for Quantum circuits.",
                    "Automata and fixpoints for asynchronous hyperproperties.",
                    "Relatively complete verification of probabilistic programs: an expressive language for expectation-based reasoning.",
                    "Verified code generation for the polyhedral model.",
                    "Petr4: formal foundations for p4 data planes.",
                    "Distributed causal memory: modular specification and verification in higher-order distributed separation logic.",
                    "PerSeVerE: persistency semantics for verification under ext4.",
                    "Context-bounded verification of liveness properties for multithreaded shared-memory programs.",
                    "A practical mode system for recursive definitions.",
                    "Formally verified speculation and deoptimization in a JIT compiler.",
                    "Taming x86-TSO persistency.",
                    "Deciding ω-regular properties on linear recurrence sequences.",
                    "Automatically eliminating speculative leaks from cryptographic code with blade.",
                    "A graded dependent type system with a usage-aware semantics.",
                    "The (In)Efficiency of interaction.",
                    "A pre-expectation calculus for probabilistic sensitivity.",
                    "Corpse reviver: sound and efficient gradual typing via contract verification.",
                    "Combining the top-down propagation and bottom-up enumeration for inductive program synthesis.",
                    "Intensional datatype refinement: with application to scalable verification of pattern-match safety.",
                    "Deciding reachability under persistent x86-TSO.",
                    "Functorial semantics for partial theories.",
                    "Paradoxes of probabilistic programming: and how to condition on events of measure zero with infinitesimal probabilities.",
                    "On the complexity of bidirected interleaved Dyck-reachability.",
                    "The taming of the rew: a type theory with computational assumptions.",
                    "Abstracting gradual typing moving forward: precise and space-efficient.",
                    "An order-aware dataflow model for parallel Unix pipelines.",
                    "Getting to the point: index sets and parallelism-preserving autodiff for pointful array programming.",
                    "Of JavaScript AOT compilation performance.",
                    "Generalized evidence passing for effect handlers: efficient compilation of effect handlers to C.",
                    "Symbolic and automatic differentiation of languages.",
                    "Algebras for weighted search.",
                    "Reasoning about effect interaction by fusion.",
                    "Compositional optimizations for CertiCoq.",
                    "Contextual modal types for algebraic effects and handlers.",
                    "Higher-order probabilistic adversarial computations: categorical semantics and program logics.",
                    "Newly-single and loving it: improving higher-order must-alias analysis with heap fragments.",
                    "Efficient tree-traversals: reconciling parallelism and dense data representations.",
                    "Formal verification of a concurrent bounded queue in a weak memory model.",
                    "Steel: proof-oriented programming in a dependently typed concurrent separation logic.",
                    "A theory of higher-order subtyping with type intervals.",
                    "Propositions-as-types and shared state.",
                    "Theorems for free from separation logic specifications.",
                    "Modular, compositional, and executable formal semantics for LLVM IR.",
                    "Catala: a programming language for the law.",
                    "Persistent software transactional memory in Haskell.",
                    "CPS transformation with affine types for call-by-value implicit polymorphism.",
                    "ProbNV: probabilistic verification of network control planes.",
                    "How to evaluate blame for gradual types.",
                    "GhostCell: separating permissions from data in Rust.",
                    "Distributing intersection and union types with splits and duality (functional pearl).",
                    "Automatic amortized resource analysis with the Quantum physicist's method.",
                    "On continuation-passing transformations and expected cost analysis.",
                    "Skipping the binder bureaucracy with mixed embeddings in a semantics course (functional pearl).",
                    "Calculating dependently-typed compilers (functional pearl).",
                    "Grafs: declarative graph analytics.",
                    "An existential crisis resolved: type inference for first-class existential types.",
                    "Client-server sessions in linear logic.",
                    "Certifying the synthesis of heap-manipulating programs.",
                    "Deriving efficient program transformations from rewrite rules.",
                    "Reasoning about the garden of forking paths.",
                    "Static detection of silent misconfigurations with deep interaction analysis.",
                    "Data-driven abductive inference of library specifications.",
                    "What we eval in the shadows: a large-scale study of eval in R programs.",
                    "ECROs: building global scale systems from sequential code.",
                    "Reconciling optimization with secure compilation.",
                    "Compilation of sparse array programming models.",
                    "Making pointer analysis more precise by unleashing the power of selective context sensitivity.",
                    "VESPA: static profiling for binary optimization.",
                    "SimTyper: sound type inference for Ruby using type equality prediction.",
                    "LooPy: interactive program synthesis with control structures.",
                    "A multiparty session typing discipline for fault-tolerant event-driven distributed programming.",
                    "Much ADO about failures: a fault-aware model for compositional verification of strongly consistent distributed systems.",
                    "Efficient compilation of algebraic effect handlers.",
                    "Copy-and-patch compilation: a fast compilation algorithm for high-level languages and bytecode.",
                    "Programming and execution models for parallel bounded exhaustive testing.",
                    "Interpretable noninterference measurement and its application to processor designs.",
                    "Reachability types: tracking aliasing and separation in higher-order functional programs.",
                    "Rewrite rule inference using equality saturation.",
                    "Type stability in Julia: avoiding performance pathologies in JIT compilation.",
                    "Multi-modal program inference: a marriage of pre-trained language models and component-based synthesis.",
                    "Fully automated functional fuzzing of Android apps for detecting non-crashing logic bugs.",
                    "SecRSL: security separation logic for C11 release-acquire concurrency.",
                    "Generative type-aware mutation for testing SMT solvers.",
                    "Modular specification and verification of closures in Rust.",
                    "Synthesizing contracts correct modulo a test generator.",
                    "Well-typed programs can go wrong: a study of typing-related bugs in JVM compilers.",
                    "Specifying and testing GPU workgroup progress models.",
                    "Study of the subtyping machine of nominal subtyping with variance.",
                    "A derivative-based parser generator for visibly Pushdown grammars.",
                    "Automatic migration from synchronous to asynchronous JavaScript APIs.",
                    "Compacting points-to sets through object clustering.",
                    "Durable functions: semantics for stateful serverless.",
                    "Semantic programming by example with pre-trained models.",
                    "UDF to SQL translation through compositional lazy inductive synthesis.",
                    "Permchecker: a toolchain for debugging memory managers with typestate.",
                    "Rich specifications for Ethereum smart contract verification.",
                    "Making weak memory models fair.",
                    "The semantics of shared memory in Intel CPU/FPGA systems.",
                    "Coarsening optimization for differentiable programming.",
                    "APIfix: output-oriented program synthesis for combating breaking changes in libraries.",
                    "Transitioning from structural to nominal code with efficient gradual typing.",
                    "Generalizable synthesis through unification.",
                    "One down, 699 to go: or, synthesising compositional desugarings.",
                    "The reads-from equivalence for the TSO and PSO memory models.",
                    "JavaDL: automatically incrementalizing Java bug pattern detection.",
                    "How statically-typed functional programmers write code.",
                    "Scalability and precision by combining expressive type systems and deductive verification.",
                    "Program analysis via efficient symbolic abstraction.",
                    "Dynaplex: analyzing program complexity using dynamically inferred recurrence relations.",
                    "Compiling with continuations, correctly.",
                    "Promises are made to be broken: migrating R to strict semantics.",
                    "Efficient automatic scheduling of imaging and vision pipelines for the GPU.",
                    "Gauss: program synthesis by reasoning over graphs.",
                    "QuickSilver: modeling and parameterized verification for distributed agreement-based systems.",
                    "SpecSafe: detecting cache side channels in a speculative world.",
                    "Label dependent lambda calculus and gradual typing.",
                    "Not so fast: understanding and mitigating negative impacts of compiler optimizations on code reuse gadget sets.",
                    "FPL: fast Presburger arithmetic through transprecision.",
                    "Translating C to safer Rust.",
                    "Relational nullable types with Boolean unification.",
                    "LXM: better splittable pseudorandom number generators (and almost as fast).",
                    "Safer at any speed: automatic context-aware safety enhancement for Rust.",
                    "Verifying concurrent multicopy search structures.",
                    "Formal verification of high-level synthesis.",
                    "Synbit: synthesizing bidirectional programs using unidirectional sketches.",
                    "Statically bounded-memory delayed sampling for probabilistic streams.",
                    "Solver-based gradual type migration.",
                    "Symbolic value-flow static analysis: deep, precise, complete modeling of Ethereum smart contracts.",
                    "A type system for extracting functional specifications from memory-safe imperative programs.",
                    "Gradually structured data.",
                    "MonkeyDB: effectively testing correctness under weak isolation levels."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "25th ICFP 2020",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2020scheme",
                "sub_name": "Proceedings of the 2020 Scheme and Functional Programming Workshop, Online, Virtual Event, August 20-28, 2020.",
                "count": 9,
                "papers": [
                    "SICP JS: Ketchup on Caviar?",
                    "21st Century Lisp in Academic Research and Pedagogy.",
                    "Clotho: A Racket Library for Parametric Randomness.",
                    "Solving SICP: An Experience Report on Solving the World's Most Famous Programming Problem Set.",
                    "Running Scheme On Bare Metal (Experience Report).",
                    "Scheme for scientific computing.",
                    "On Teaching Type Systems as Macros (Lightning Talk).",
                    "Designing a Programming Environment Based on the Program Design Recipe (Lightening Talk).",
                    "Programming with Petri Nets to Reason about Concurrency."
                ]
            },
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 4(ICFP)",
                "count": 233,
                "papers": [
                    "Taylor subsumes Scott, Berry, Kahn and Plotkin.",
                    "Deductive verification with ghost monitors.",
                    "Dependent type systems as macros.",
                    "The next 700 relational program logics.",
                    "Complexity and information in invariant inference.",
                    "Actris: session-type based reasoning in separation logic.",
                    "Formal verification of a constant-time preserving C compiler.",
                    "Coq Coq correct! verification of type checking and erasure for Coq, in Coq.",
                    "Undecidability of d<:  and its decidable fragments.",
                    "Incorrectness logic.",
                    "Persistency semantics of the Intel-x86 architecture.",
                    "Program synthesis by type-guided abstraction refinement.",
                    "Reductions for safety proofs.",
                    "Deterministic parallel fixpoint computation.",
                    "Recurrence extraction for functional programs through call-by-push-value.",
                    "Towards verified stochastic variational inference for probabilistic programs.",
                    "Fast, sound, and effectively complete dynamic race prediction.",
                    "Par means parallel: multiplicative linear logic proofs as concurrent functional programs.",
                    "Trace types and denotational semantics for sound programmable inference in probabilistic languages.",
                    "Virtual timeline: a formal abstraction for verifying preemptive schedulers with temporal isolation.",
                    "Relational proofs for quantum programs.",
                    "Seminaïve evaluation for a higher-order functional language.",
                    "CompCertM: CompCert with C-assembly linking and lightweight modular verification.",
                    "Liquidate your assets: reasoning about resource usage in liquid Haskell.",
                    "Proving expected sensitivity of probabilistic programs with randomized variable-dependent termination time.",
                    "Parameterized verification under TSO is PSPACE-complete.",
                    "The weak call-by-value λ-calculus is reasonable for both time and space.",
                    "Abstract extensionality: on the properties of incomplete abstract interpretations.",
                    "What is decidable about gradual types?",
                    "Decomposition diversity with symmetric data and codata.",
                    "Reduction monads and their signatures.",
                    "The high-level benefits of low-level sandboxing.",
                    "Spy game: verifying a local generic solver in Iris.",
                    "RustBelt meets relaxed memory.",
                    "Deciding memory safety for single-pass heap-manipulating programs.",
                    "Optimal approximate sampling from discrete probability distributions.",
                    "Aiming low is harder: induction for lower bounds in probabilistic program verification.",
                    "A simple differentiable programming language.",
                    "PλωNK: functional probabilistic NetKAT.",
                    "Partial type constructors: or, making ad hoc datatypes less ad hoc.",
                    "Stacked borrows: an aliasing model for Rust.",
                    "Abstract interpretation of distributed network control planes.",
                    "Executable formal semantics for the POSIX shell.",
                    "Mechanized semantics and verified compilation for a dataflow synchronous language with reset.",
                    "The future is ours: prophecy variables in separation logic.",
                    "Graduality and parametricity: together again for the first time.",
                    "Disentanglement in nested-parallel programs.",
                    "Binders by day, labels by night: effect instances via lexically scoped handlers.",
                    "Visualization by example.",
                    "A language for probabilistically oblivious computation.",
                    "Interaction trees: representing recursive and impure programs in Coq.",
                    "Synthesizing replacement classes.",
                    "Kind inference for datatypes.",
                    "Synthesis of coordination programs from linear temporal specifications.",
                    "A probabilistic separation logic.",
                    "Augmented example-based synthesis using relational perturbation properties.",
                    "Semantics of higher-order probabilistic programs with conditioning.",
                    "The fire triangle: how to mix substitution, dependent elimination, and effects.",
                    "SyTeCi: automating contextual equivalence for higher-order programs with references.",
                    "Detecting floating-point errors via atomic conditions.",
                    "Guarded Kleene algebra with tests: verification of uninterpreted programs in nearly linear time.",
                    "Provenance-guided synthesis of Datalog programs.",
                    "Full abstraction for the quantum lambda-calculus.",
                    "Backpropagation in the simply typed lambda-calculus with linear negation.",
                    "Does blame shifting work?",
                    "Decidable subtyping for path dependent types.",
                    "Label-dependent session types.",
                    "Pointer life cycle types for lock-free data structures with memory reclamation.",
                    "APL since 1978.",
                    "Thriving in a crowded and changing world: C++ 2006-2020.",
                    "A history of Clojure.",
                    "History of coarrays and SPMD parallelism in Fortran.",
                    "Origins of the D programming language.",
                    "Evolution of Emacs Lisp.",
                    "The early history of F#.",
                    "A history of the Groovy programming language.",
                    "JavaScript: the first 20 years.",
                    "LabVIEW.",
                    "History of Logo.",
                    "Hygienic macro technology.",
                    "A history of MATLAB.",
                    "The origins of Objective-C at PPI/Stepstone and its evolution at NeXT.",
                    "A history of the Oz multiparadigm language.",
                    "S, R, and data science.",
                    "The evolution of Smalltalk: from Smalltalk-72 through Squeak.",
                    "The history of Standard ML.",
                    "Verilog HDL and its ancestors and descendants.",
                    "A general approach to define binders using matching logic.",
                    "A quick look at impredicativity.",
                    "A unified view of modalities in type systems.",
                    "A dependently typed calculus with pattern matching and erasure inference.",
                    "Achieving high-performance the functional way: a functional pearl on expressing high-performance optimizations as rewrite strategies.",
                    "Compiling effect handlers in capability-passing style.",
                    "Composing and decomposing op-based CRDTs with semidirect products.",
                    "Computation focusing.",
                    "Cosmo: a concurrent separation logic for multicore OCaml.",
                    "Denotational recurrence extraction for amortized analysis.",
                    "Duplo: a framework for OCaml post-link optimisation.",
                    "Effect handlers, evidently.",
                    "Effects for efficiency: asymptotic speedup with first-class control.",
                    "Elaboration with first-class implicit function types.",
                    "Higher-order demand-driven symbolic evaluation.",
                    "Kindly bent to free us.",
                    "Kinds are calling conventions.",
                    "Liquid information flow control.",
                    "Liquid resource types.",
                    "Lower your guards: a compositional pattern-match coverage checker.",
                    "Parsing with zippers (functional pearl).",
                    "Program sketching with live bidirectional evaluation.",
                    "Raising expectations: automating expected cost analysis with types.",
                    "Recovering purity with comonads and capabilities.",
                    "Regular language type inference with term rewriting.",
                    "Retrofitting parallelism onto OCaml.",
                    "Scala step-by-step: soundness for DOT with step-indexed logical relations in Iris.",
                    "Sealing pointer-based optimizations behind pure functions.",
                    "Separation logic for sequential programs (functional pearl).",
                    "Signature restriction for polymorphic algebraic effects.",
                    "Sparcl: a language for partially-invertible computation.",
                    "Stable relations and abstract interpretation of higher-order programs.",
                    "Staged selective parser combinators.",
                    "SteelCore: an extensible concurrent separation logic for effectful dependently typed programs.",
                    "Strong functional pearl: Harper's regular-expression matcher in Cedille.",
                    "TLC: temporal logic of distributed components.",
                    "The simple essence of algebraic subtyping: principal type inference with subtyping made easy (functional pearl).",
                    "Fixpoints for the masses: programming with first-class Datalog constraints.",
                    "Effects as capabilities: effect handlers and lightweight effect polymorphism.",
                    "A systematic approach to deriving incremental type checkers.",
                    "Proving highly-concurrent traversals correct.",
                    "Certified and efficient instruction scheduling: application to interlocked VLIW processors.",
                    "Enabling accuracy-aware Quantum compilers using symbolic resource estimation.",
                    "Semiring optimizations: dynamic elision of expressions with identity and absorbing elements.",
                    "Can advanced type systems be usable? An empirical study of ownership, assets, and typestate in Obsidian.",
                    "Assertion-based optimization of Quantum programs.",
                    "Multiparty motion coordination: from choreographies to robotics programs.",
                    "Automated policy synthesis for system call sandboxing.",
                    "How do programmers use unsafe rust?",
                    "Learning semantic program embeddings with graph interval neural network.",
                    "Mossad: defeating software plagiarism detection.",
                    "Handling bidirectional control flow.",
                    "Scaling exact inference for discrete probabilistic programs.",
                    "Formulog: Datalog for SMT-based static analysis.",
                    "Precise inference of expressive units of measurement types.",
                    "WATCHER: in-situ failure diagnosis.",
                    "A model for detecting faults in build specifications.",
                    "Guided linking: dynamic linking without the costs.",
                    "Satune: synthesizing efficient SAT encoders.",
                    "Exposing cache timing side-channel leaks through out-of-order symbolic execution.",
                    "Statically verified refinements for multiparty protocols.",
                    "Featherweight go.",
                    "Projection-based runtime assertions for testing and debugging Quantum programs.",
                    "Persistent Owicki-Gries reasoning: a program logic for reasoning about persistent programs on Intel-x86.",
                    "Igloo: soundly linking compositional refinement and separation logic for distributed system verification.",
                    "DiffStream: differential output testing for stream processing programs.",
                    "Polymorphic types and effects with Boolean unification.",
                    "CAMP: cost-aware multiparty session protocols.",
                    "The anchor verifier for blocking and non-blocking concurrent software.",
                    "Automatic and efficient variability-aware lifting of functional programs.",
                    "A sparse iteration space transformation framework for sparse tensor algebra.",
                    "Programming with a read-eval-synth loop.",
                    "LiveDroid: identifying and preserving mobile app state in volatile runtime environments.",
                    "Towards a unified proof framework for automated fixpoint reasoning using matching logic.",
                    "Adversarial examples for models of code.",
                    "Towards a formal foundation of intermittent computing.",
                    "Compiling symbolic execution with staging and algebraic effects.",
                    "Testing differential privacy with dual interpreters.",
                    "Verifying and improving Halide's term rewriting system with program synthesis.",
                    "Dynamic dispatch of context-sensitive optimizations.",
                    "Eliminating abstraction overhead of Java stream pipelines using ahead-of-time program optimization.",
                    "Build scripts with perfect dependencies.",
                    "Deductive optimization of relational data storage.",
                    "Program equivalence for assisted grading of functional programs.",
                    "A modular cost analysis for probabilistic programs.",
                    "Geometry types for graphics programming.",
                    "Hidden inheritance: an inline caching design for TypeScript performance.",
                    "A type-and-effect system for object initialization.",
                    "Sound garbage collection for C using pointer provenance.",
                    "Dataflow-based pruning for speeding up superoptimization.",
                    "FlowCFL: generalized type-based reachability analysis: graph reduction and equivalence of CFL-based and type-based reachability.",
                    "Learning graph-based heuristics for pointer analysis without handcrafting application-specific features.",
                    "Knowing when to ask: sound scheduling of name resolution in type checkers derived from declarative specifications.",
                    "Designing types for R, empirically.",
                    "Shiftry: RNN inference in 2KB of RAM.",
                    "StreamQL: a query language for processing streaming time series.",
                    "Incremental predicate analysis for regression verification.",
                    "Perfectly parallel fairness certification of neural networks.",
                    "Fuzzing channel-based concurrency runtimes using types and effects.",
                    "Detecting locations in JavaScript programs affected by breaking library changes.",
                    "Rethinking safe consistency in distributed object-oriented programming.",
                    "DynamiTe: dynamic termination and non-termination proofs.",
                    "Precise static modeling of Ethereum \"memory\".",
                    "Taming type annotations in gradual typing.",
                    "Inter-theory dependency analysis for SMT string solvers.",
                    "On the unusual effectiveness of type-aware operator mutations for testing SMT solvers.",
                    "Pomsets with preconditions: a simple model of relaxed memory.",
                    "Fast linear programming through transprecision computing on small and sparse data.",
                    "Random testing for C and C++ compilers with YARPGen.",
                    "CompCertELF: verified separate compilation of C programs into ELF object files.",
                    "Scalable and serializable networked multi-actor programming.",
                    "Termination analysis for evolving programs: an incremental approach by reusing certified modules.",
                    "Programming and reasoning with partial observability.",
                    "Interactive synthesis of temporal specifications from examples and natural language.",
                    "A large-scale longitudinal study of flaky tests.",
                    "Differentially-private software frequency profiling under linear constraints.",
                    "Do you have space for dessert? a verified space cost semantics for CakeML programs.",
                    "Digging for fold: synthesis-aided API discovery for Haskell.",
                    "Resolution as intersection subtyping via Modus Ponens.",
                    "World age in Julia: optimizing method dispatch in the presence of eval.",
                    "ιDOT: a DOT calculus with object initialization.",
                    "Taming callbacks for smart contract modularity.",
                    "Testing consensus implementations using communication closure.",
                    "Finding bugs in database systems via query partitioning.",
                    "Structure interpretation of text formats.",
                    "Programming at the edge of synchrony.",
                    "Actor concurrency bugs: a comprehensive study on symptoms, root causes, API usages, and differences.",
                    "A structural model for contextual code changes.",
                    "Verifying replicated data types with typeclass refinements in Liquid Haskell.",
                    "Unifying execution of imperative generators and declarative specifications.",
                    "Regex matching with counting-set automata.",
                    "Feedback-driven semi-supervised synthesis of program transformations.",
                    "Contextual dispatch for function specialization.",
                    "Counterexample-guided correlation algorithm for translation validation.",
                    "Adding interactive visual syntax to textual code.",
                    "Revisiting iso-recursive subtyping.",
                    "Guiding dynamic programing via structural probability for accelerating programming by example.",
                    "Neural reverse engineering of stripped binaries using augmented control flow graphs.",
                    "Foundations of empirical memory consistency testing.",
                    "Just-in-time learning for bottom-up enumerative synthesis.",
                    "Gradual verification of recursive heap data structures.",
                    "Macros for domain-specific languages.",
                    "Learning-based controlled concurrency testing.",
                    "TacTok: semantics-aware proof synthesis.",
                    "Koord: a language for programming and verifying distributed robotics application.",
                    "Flow2Vec: value-flow-based precise code embedding."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "24th ICFP 2019",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 3(ICFP)",
                "count": 189,
                "papers": [
                    "Higher inductive types in cubical computational type theory.",
                    "Constructing quotient inductive-inductive types.",
                    "Definitional proof-irrelevance without K.",
                    "Bisimulation as path type for guarded recursive types.",
                    "Abstraction-safe effect handlers via tunneling.",
                    "Abstracting algebraic effects.",
                    "Intersection types and runtime errors in the pi-calculus.",
                    "Principality and approximation under dimensional bound.",
                    "Sound and complete bidirectional typechecking for higher-rank polymorphism with existentials and indexed types.",
                    "Fully abstract module compilation.",
                    "Polymorphic symmetric multiple dispatch with variance.",
                    "Abstracting extensible data types: or, rows by any other name.",
                    "Type-guided worst-case input generation.",
                    "Live functional programming with typed holes.",
                    "Gradual type theory.",
                    "Gradual typing: a new perspective.",
                    "Gradual parametricity, revisited.",
                    "Dynamic type inference for gradual Hindley-Milner typing.",
                    "StkTokens: enforcing well-bracketed control flow and stack encapsulation using linear capabilities.",
                    "Modalities, cohesion, and information flow.",
                    "Familial monads and structural operational semantics.",
                    "Bindings as bounded natural functors.",
                    "Categorical combinatorics of scheduling and synchronization in game semantics.",
                    "Better late than never: a fully-abstract semantics for classical processes.",
                    "Diagrammatic algebra: from linear to concurrent systems.",
                    "Fixpoint games on continuous lattices.",
                    "Two sides of the same coin: session types and game semantics: a synchronous side and an asynchronous side.",
                    "Exceptional asynchronous session types: session types without tiers.",
                    "Distributed programming using role-parametric session types in go: statically-typed endpoint APIs for dynamically-instantiated communication structures.",
                    "Less is more: multiparty session types revisited.",
                    "Quantitative robustness analysis of quantum programs.",
                    "Game semantics for quantum programming.",
                    "Quantum relational Hoare logic.",
                    "Quantitative separation logic: a logic for reasoning about probabilistic pointer programs.",
                    "Probabilistic programming with densities in SlicStan: efficient, flexible, and deterministic.",
                    "A domain theory for statistical probabilistic programming.",
                    "Bayesian synthesis of probabilistic programs for automatic data modeling.",
                    "Formal verification of higher-order probabilistic programs: reasoning about approximation, convergence, Bayesian inference, and optimization.",
                    "Trace abstraction modulo probability.",
                    "code2vec: learning distributed representations of code.",
                    "An abstract domain for certifying neural networks.",
                    "A²I: abstract² interpretation.",
                    "Concerto: a framework for combined concrete and abstract interpretation.",
                    "Skeletal semantics and their interpretations.",
                    "Refinement of path expressions for static analysis.",
                    "Decidable verification of uninterpreted programs.",
                    "Inferring frame conditions with static correlation analysis.",
                    "Context-, flow-, and field-sensitive data-flow analysis using synchronized Pushdown systems.",
                    "Decision procedures for path feasibility of string-manipulating programs with complex operations.",
                    "Modular quantitative monitoring.",
                    "Bounded model checking of signal temporal logic properties using syntactic separation.",
                    "Adventures in monitorability: from branching to linear time and back again.",
                    "Efficient parameterized algorithms for data packing.",
                    "Fast and exact analysis for LRU caches.",
                    "Closed forms for numerical loops.",
                    "Efficient automated repair of high floating-point errors in numerical libraries.",
                    "A true positives theorem for a static race detector.",
                    "Decoupling lock-free data structures from memory reclamation for static analysis.",
                    "Pretend synchrony: synchronous verification of asynchronous distributed programs.",
                    "Weak-consistency specification via visibility relaxation.",
                    "A calculus for Esterel: if can, can. if no can, no can.",
                    "An abstract stack based approach to verified compositional compilation to machine code.",
                    "A verified, efficient embedding of a verifiable assembly language.",
                    "A separation logic for concurrent randomized programs.",
                    "Iron: managing obligations in higher-order concurrent separation logic.",
                    "JaVerT 2.0: compositional symbolic execution for JavaScript.",
                    "Exploring C semantics and pointer provenance.",
                    "On library correctness under weak memory consistency: specifying and verifying concurrent libraries under declarative consistency models.",
                    "Bridging the gap between programming languages and hardware weak memory models.",
                    "Grounding thin-air reads with event structures.",
                    "ISA semantics for ARMv8-a, RISC-v, and CHERI-MIPS.",
                    "Structuring the synthesis of heap-manipulating programs.",
                    "FrAngel: component-based synthesis with control structures.",
                    "Hamsaz: replication coordination analysis and synthesis.",
                    "LWeb: information flow security for multi-tier web applications.",
                    "From fine- to coarse-grained dynamic information flow control and back.",
                    "CT-wasm: type-driven secure cryptography for the web ecosystem.",
                    "Rebuilding racket on chez scheme (experience report).",
                    "Compiling with continuations, or without? whatever.",
                    "Lambda calculus with algebraic simplification for reduction parallelization by equational reasoning.",
                    "Fairness in responsive parallelism.",
                    "Narcissus: correct-by-construction derivation of decoders and encoders from binary formats.",
                    "Closure conversion is safe for space.",
                    "Linear capabilities for fully abstract compilation of separation-logic-verified code.",
                    "The next 700 compiler correctness theorems (functional pearl).",
                    "Equations reloaded: high-level dependently-typed functional programming and proving in Coq.",
                    "Cubical agda: a dependently typed programming language with univalence and higher inductive types.",
                    "Approximate normalization for gradual dependent types.",
                    "Simple noninterference from parametricity.",
                    "Selective applicative functors.",
                    "Coherence of type class resolution.",
                    "Relational cost analysis for functional-imperative programs.",
                    "Fuzzi: a three-level logic for differential privacy.",
                    "Synthesizing differentially private programs.",
                    "Synthesizing symmetric lenses.",
                    "Demystifying differentiable programming: shift/reset the penultimate backpropagator.",
                    "Efficient differentiable programming in a functional array-processing language.",
                    "From high-level inference algorithms to efficient code.",
                    "Sound and robust solid modeling via exact real arithmetic and continuity.",
                    "Dependently typed Haskell in industry (experience report).",
                    "A role for dependent types in Haskell.",
                    "Higher-order type-level programming in Haskell.",
                    "A predicate transformer semantics for effects (functional pearl).",
                    "Dijkstra monads for all.",
                    "Mechanized relational verification of concurrent programs with continuations.",
                    "Sequential programming for replicated data stores.",
                    "Implementing a modal dependent type theory.",
                    "A reasonably exceptional type theory.",
                    "Simply RaTT: a fitch-style modal calculus for reactive programming without space leaks.",
                    "Quantitative program reasoning with graded modal types.",
                    "Mixed linear and non-linear recursive types.",
                    "A mechanical formalization of higher-ranked polymorphic type inference.",
                    "An efficient algorithm for type-safe structural diffing.",
                    "Call-by-need is clairvoyant call-by-value.",
                    "Teaching the art of functional programming using automated grading (experience report).",
                    "Lambda: the ultimate sublanguage (experience report).",
                    "CLOTHO: directed test generation for weakly consistent database systems.",
                    "Probabilistic verification of fairness properties via concentration.",
                    "Verifying safety and accuracy of approximate parallel programs via canonical sequentialization.",
                    "Qubit allocation as a combination of subgraph isomorphism and token swapping.",
                    "Modular verification of heap reachability properties in separation logic.",
                    "Complete monitors for gradual types.",
                    "TLA+ model checking made symbolic.",
                    "Value-centric dynamic partial order reduction.",
                    "Seq: a high-performance language for bioinformatics.",
                    "Staged abstract interpreters: fast and modular whole-program analysis via meta-programming.",
                    "Derivative grammars: a symbolic approach to parsing with derivatives.",
                    "Efficient lock-free durable sets.",
                    "Modular verification for almost-sure termination of probabilistic programs.",
                    "IVT: an efficient method for sharing subtype polymorphic objects.",
                    "Refinement kinds: type-safe programming with practical type-level computation.",
                    "Program synthesis with algebraic library specifications.",
                    "Weakening WebAssembly.",
                    "Generating a fluent API with syntax checking from an LR grammar.",
                    "Weak persistency semantics from the ground up: formalising the persistency semantics of ARMv8 and transactional models.",
                    "DeepSEA: a language for certified system software.",
                    "BDA: practical dependence analysis for binary executables by unbiased whole-program path sampling and per-path abstract interpretation.",
                    "Asphalion: trustworthy shielding against Byzantine faults.",
                    "Automatic repair of regular expressions.",
                    "Static analysis with demand-driven value refinement.",
                    "Relational verification using reinforcement learning.",
                    "A formalization of Java's concurrent access modes.",
                    "On the fly synthesis of edit suggestions.",
                    "A fault-tolerant programming model for distributed interactive applications.",
                    "A path to DOT: formalizing fully path-dependent types.",
                    "Reliable and fast DWARF-based stack unwinding.",
                    "Leveraging rust types for modular specification and verification.",
                    "Precision-preserving yet fast object-sensitive pointer analysis with partial context sensitivity.",
                    "Formal foundations of serverless computing.",
                    "Optimal stateless model checking for reads-from equivalence under sequential consistency.",
                    "Modular verification of web page layout.",
                    "Aroma: code recommendation via structural code search.",
                    "On the design, implementation, and use of laziness in R.",
                    "Mergeable replicated data types.",
                    "Compiler fuzzing: how much does it matter?",
                    "DProf: distributed profiler with strong guarantees.",
                    "Precise reasoning with structured time, structured heaps, and collective operations.",
                    "Casting about in the dark: an empirical study of cast operations in Java programs.",
                    "Getafix: learning to fix bugs automatically.",
                    "Generating precise error specifications for C: a zero shot learning approach.",
                    "Specifying concurrent programs in separation logic: morphisms and simulations.",
                    "Improving bug detection via context-based code representation learning and attention-based neural networks.",
                    "Scala implicits are everywhere: a large-scale study of the use of Scala implicits in the wild.",
                    "Optimization of swift protocols.",
                    "On the complexity of checking transactional consistency.",
                    "System FR: formalized foundations for the stainless verifier.",
                    "Language-integrated privacy-aware distributed queries.",
                    "AutoPandas: neural-backed generators for program synthesis.",
                    "Ryū revisited: printf floating point conversion.",
                    "IntelliMerge: a refactoring-aware software merging technique.",
                    "Certifying graph-manipulating C programs via localizations within data structures.",
                    "Duet: an expressive higher-order language and linear type system for statically enforcing differential privacy.",
                    "Effective lock handling in stateless model checking.",
                    "FuzzFactory: domain-specific fuzzing with waypoints.",
                    "AL: autogenerating supervised learning programs.",
                    "Sound and reusable components for abstract interpretation.",
                    "Design, implementation, and application of GPU-based Java bytecode interpreters.",
                    "Specification and inference of trace refinement relations.",
                    "Dependence-aware, unbounded sound predictive race detection.",
                    "Trace aware random testing for distributed systems.",
                    "Coverage guided, property based testing.",
                    "PlanAlyzer: assessing threats to the validity of online experiments.",
                    "I/O dependent idempotence bugs in intermittent systems.",
                    "Initialize once, start fast: application initialization at build time.",
                    "Safer smart contract programming with Scilla.",
                    "ApproxHPVM: a portable compiler IR for accuracy-aware optimizations.",
                    "Reflection-aware static regression test selection.",
                    "Automatic and scalable detection of logical errors in functional programming assignments.",
                    "Detecting nondeterministic payment bugs in Ethereum smart contracts."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "23rd ICFP 2018",
        "info": "St. Louis, Missouri, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 2(ICFP)",
                "count": 166,
                "papers": [
                    "Synthesizing bijective lenses.",
                    "WebRelate: integrating web data with spreadsheets using examples.",
                    "What is decidable about string constraints with the ReplaceAll function.",
                    "String constraints with concatenation and transducers solved efficiently.",
                    "Linear Haskell: practical linearity in a higher-order polymorphic language.",
                    "Polyadic approximations, fibrations and intersection types.",
                    "Handling fibred algebraic effects.",
                    "Handle with care: relational interpretation of algebraic effects and handlers.",
                    "Automated lemma synthesis in symbolic-heap separation logic.",
                    "Foundations for natural proofs and quantifier instantiation.",
                    "Higher-order constrained horn clauses for verification.",
                    "Relatively complete refinement type system for verification of higher-order non-deterministic programs.",
                    "Unifying analytic and statically-typed quasiquotes.",
                    "Jones-optimal partial evaluation by specialization-safe normalization.",
                    "Migrating gradual types.",
                    "Intrinsically-typed definitional interpreters for imperative languages.",
                    "Effective stateless model checking for C/C++ concurrency.",
                    "Transactions in relaxed memory architectures.",
                    "Simplifying ARM concurrency: multicopy-atomic axiomatic and operational models for ARMv8.",
                    "Progress of concurrent objects with partial methods.",
                    "A principled approach to ornamentation in ML.",
                    "Type-preserving CPS translation of Σ and Π types is not not possible.",
                    "Decidability of conversion for type theory in type theory.",
                    "Safety and conservativity of definitions in HOL and Isabelle/HOL.",
                    "Sound, complete, and tractable linearizability monitoring for concurrent collections.",
                    "Reducing liveness to safety in first-order logic.",
                    "Alone together: compositional reasoning and inference for weak isolation.",
                    "Programming and proving with distributed protocols.",
                    "Inference of static semantics for incomplete C programs.",
                    "Optimal Dyck reachability for data-dependence and alias analysis.",
                    "Data-centric dynamic partial order reduction.",
                    "Analytical modeling of cache behavior for affine programs.",
                    "A new proof rule for almost-sure termination.",
                    "Lexicographic ranking supermartingales: an efficient approach to termination of probabilistic programs.",
                    "Algorithmic analysis of termination problems for quantum programs.",
                    "Monadic refinements for relational cost analysis.",
                    "Go with the flow: compositional abstractions for concurrent data structures.",
                    "Parametricity versus the universal type.",
                    "Linearity in higher-order recursion schemes.",
                    "Symbolic types for lenient symbolic execution.",
                    "An axiomatic basis for bidirectional programming.",
                    "Simplicitly: foundations and applications of implicit function types.",
                    "Up-to techniques using sized types.",
                    "Univalent higher categories via complete Semi-Segal types.",
                    "Generating good generators for inductive relations.",
                    "Why is random testing effective for partition tolerance bugs?",
                    "On automatically proving the correctness of math.h implementations.",
                    "Online detection of effectively callback free objects with applications to smart contracts.",
                    "Correctness of speculative optimizations with dynamic deoptimization.",
                    "JaVerT: JavaScript verification toolchain.",
                    "Soft contract verification for higher-order stateful programs.",
                    "Collapsing towers of interpreters.",
                    "Refinement reflection: complete verification with SMT.",
                    "Non-linear reasoning for invariant synthesis.",
                    "A practical construction for decomposing numerical abstract domains.",
                    "Verifying equivalence of database-driven applications.",
                    "Proving expected sensitivity of probabilistic programs.",
                    "Synthesizing coupling proofs of differential privacy.",
                    "Measurable cones and stable, measurable functions: a model for probabilistic higher-order programming.",
                    "Denotational validation of higher-order Bayesian inference.",
                    "Strategy synthesis for linear arithmetic games.",
                    "Bonsai: synthesis-based reasoning for type systems.",
                    "Program synthesis using abstraction refinement.",
                    "A logical relation for monadic encapsulation of state: proving contextual equivalences in the presence of runST.",
                    "Recalling a witness: foundations and applications of monotonic state.",
                    "RustBelt: securing the foundations of the rust programming language.",
                    "Versatile event correlation with algebraic effects.",
                    "Parametric polymorphism and operational improvement.",
                    "Handling delimited continuations with dependent types.",
                    "The simple essence of automatic differentiation.",
                    "A spectrum of type soundness and performance.",
                    "Compositional soundness proofs of abstract interpreters.",
                    "Graduality from embedding-projection pairs.",
                    "Incremental relational lenses.",
                    "Elaborating dependent (co)pattern matching.",
                    "Capturing the future by replaying the past (functional pearl).",
                    "MoSeL: a general, extensible modal framework for interactive proofs in separation logic.",
                    "Mtac2: typed tactics for backward reasoning in Coq.",
                    "Build systems à la carte.",
                    "Synthesizing quotient lenses.",
                    "Finitary polymorphism for optimizing type-directed compilation.",
                    "Teaching how to program using automated assessment and functional glossy games (experience report).",
                    "Functional programming for modular Bayesian inference.",
                    "What you needa know about Yoneda: profunctor optics and the Yoneda lemma (functional pearl).",
                    "Generic deriving of generic traversals.",
                    "Relational algebra by way of adjunctions.",
                    "Contextual equivalence for a probabilistic language with continuous random variables and recursion.",
                    "Strict and lazy semantics for effects: layering monads and comonads.",
                    "Ready, set, verify! applying hs-to-coq to real-world Haskell code (experience report).",
                    "A type and scope safe universe of syntaxes with binding: their semantics and proofs.",
                    "Parallel complexity analysis with temporal session types.",
                    "Equivalences for free: univalent parametricity for effective transport.",
                    "Prototyping a functional language using higher-order logic programming: a functional pearl on learning the ways of λProlog/Makam.",
                    "Tight typings and split bounds.",
                    "Competitive parallelism: getting your priorities right.",
                    "Fault tolerant functional reactive programming (functional pearl).",
                    "Static interpretation of higher-order modules in Futhark: functional GPU programming in the large.",
                    "Casts and costs: harmonizing safety and performance in gradual typing.",
                    "Functional programming for compiling and decompiling computer-aided design.",
                    "Partially-static data as free extension of algebras.",
                    "What's the difference? a functional pearl on subtracting bijections.",
                    "Keep your laziness in check.",
                    "Merlin: a language server for OCaml (experience report).",
                    "Generic zero-cost reuse for dependent types.",
                    "Refunctionalization of abstract abstract machines: bridging the gap between abstract abstract machines and abstract definitional interpreters (functional pearl).",
                    "Reasonably programmable literal notation.",
                    "Thread-safe reactive programming.",
                    "Parallelization of dynamic languages: synchronizing built-in collections.",
                    "Virtual machine design for parallel dynamic programming languages.",
                    "goSLP: globally optimized superword level parallelism framework.",
                    "Effect handlers for the masses.",
                    "Empowering union and intersection types with integrated subtyping.",
                    "Julia subtyping: a rational reconstruction.",
                    "Scopes as types.",
                    "A derivation framework for dependent security label inference.",
                    "MadMax: surviving out-of-gas conditions in Ethereum smart contracts.",
                    "Faster variational execution with transparent bytecode transformation.",
                    "Secure serverless computing using dynamic information flow control.",
                    "AnyDSL: a partial evaluation framework for programming high-performance libraries.",
                    "Julia: dynamism and performance reconciled by design.",
                    "GraphIt: a high-performance graph DSL.",
                    "One tool, many languages: language-parametric transformation with incremental parametric syntax.",
                    "Format abstraction for sparse tensor algebra compilers.",
                    "ShareJIT: JIT code cache sharing across processes and its practical implementation.",
                    "Reconciling high-level optimizations and low-level code in LLVM.",
                    "An empirical study of the effect of source-level loop transformations on compiler stability.",
                    "Bidirectional evaluation with direct manipulation.",
                    "BioScript: programming safe chemistry on laboratories-on-a-chip.",
                    "Distributed system development with ScalaLoci.",
                    "Concurrency-aware object-oriented programming with roles.",
                    "Horn-ICE learning for synthesizing invariants and contracts.",
                    "Gradual liquid type inference.",
                    "Collapsible contracts: fixing a pathology of gradual typing.",
                    "The root cause of blame: contracts for intersection and union types.",
                    "Optimal stateless model checking under the release-acquire semantics.",
                    "Towards understanding the costs of avoiding out-of-thin-air results.",
                    "Persistence semantics for weak memory: integrating epoch persistency with the TSO memory model.",
                    "Identifying refactoring opportunities for replacing type code with subclass and state.",
                    "Incrementalizing lattice-based program analyses in Datalog.",
                    "Precise and scalable points-to analysis via data-driven context tunneling.",
                    "Precision-guided context sensitivity for pointer analysis.",
                    "Refinement in object-sensitivity points-to analysis via slicing.",
                    "Every data structure deserves lock-free memory reclamation.",
                    "RacerD: compositional static race detection.",
                    "What happens-after the first race? enhancing the predictive power of happens-before based dynamic race detection.",
                    "Sound deadlock prediction.",
                    "DeepBugs: a learning approach to name-based bug detection.",
                    "ExceLint: automatically finding spreadsheet formula errors.",
                    "Finding code that explodes under symbolic evaluation.",
                    "FlashProfile: a framework for synthesizing data profiles.",
                    "Cross-component garbage collection.",
                    "Reactive caching for composed services: polling at the speed of push.",
                    "Object-oriented recovery for non-volatile memory.",
                    "Software multiplexing: share your libraries and statically link them too.",
                    "Relational program synthesis.",
                    "Robust relational layout synthesis from examples for Android.",
                    "Speeding up symbolic reasoning for relational queries.",
                    "Automatic diagnosis and correction of logical errors for functional programming assignments.",
                    "Compositional programming and testing of dynamic distributed systems.",
                    "Randomized testing of distributed systems with probabilistic guarantees.",
                    "Test generation for higher-order functions in dynamic languages.",
                    "Finding broken promises in asynchronous JavaScript programs.",
                    "Leto: verifying application-specific hardware fault tolerance with programmable execution models.",
                    "Safe replication through bounded concurrency verification.",
                    "Verified three-way program merge.",
                    "Conflict resolution for structured merge via version space algebra."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "22nd ICFP 2017",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 1(ICFP)",
                "count": 110,
                "papers": [
                    "Herbarium Racketensis: a stroll through the woods (functional pearl).",
                    "Testing and debugging functional reactive programming.",
                    "Lock-step simulation is child's play (experience report).",
                    "Scaling up functional programming education: under the hood of the OCaml MOOC.",
                    "Faster coroutine pipelines.",
                    "A pretty but not greedy printer (functional pearl).",
                    "Generic functional parallel algorithms: scan and FFT.",
                    "A unified approach to solving seven programming problems (functional pearl).",
                    "Prototyping a query compiler using Coq (experience report).",
                    "A framework for adaptive differential privacy.",
                    "Symbolic conditioning of arrays in probabilistic programs.",
                    "Abstracting definitional interpreters (functional pearl).",
                    "On the expressive power of user-defined effects: effect handlers, monadic reflection, delimited control.",
                    "Imperative functional programs that explain their work.",
                    "Effect-driven QuickChecking of compilers.",
                    "Persistence for the masses: RRB-vectors in a systems language.",
                    "Verified low-level programming embedded in F.",
                    "Verifying efficient function calls in CakeML.",
                    "Better living through operational semantics: an optimizing compiler for radio protocols.",
                    "Foundations of strong call by need.",
                    "A relational logic for higher-order programs.",
                    "How to prove your calculus is decidable: practical applications of second-order algebraic theories and computation.",
                    "No-brainer CPS conversion (functional pearl).",
                    "Kami: a platform for high-level parametric hardware specification and its modular verification.",
                    "SpaceSearch: a library for building and verifying solver-aided tools.",
                    "Local refinement typing.",
                    "Compiling to categories.",
                    "Visitors unchained.",
                    "Staged generic programming.",
                    "Super 8 languages for making movies (functional pearl).",
                    "A specification for dependent types in Haskell.",
                    "Parametric quantifiers for dependent type theory.",
                    "Normalization by evaluation for sized dependent types.",
                    "A metaprogramming framework for formal verification.",
                    "Chaperone contracts for higher-order sessions.",
                    "Whip: higher-order contracts for modern services.",
                    "Manifest sharing with session types.",
                    "Gradual session types.",
                    "Theorems for free for free: parametricity, with and without types.",
                    "On polymorphic gradual typing.",
                    "Gradual typing with union and intersection types.",
                    "Constrained type families.",
                    "Automating sized-type inference for complexity analysis.",
                    "Inferring scope through syntactic sugar.",
                    "SAVI objects: sharing and virtuality incorporated.",
                    "A simple soundness proof for dependent object types.",
                    "Unifying typing and subtyping.",
                    "Fast and precise type checking for JavaScript.",
                    "A volatile-by-default JVM for server applications.",
                    "Static placement of computation on heterogeneous devices.",
                    "Skip blocks: reusing execution history to accelerate web scripts.",
                    "Virtual machine warmup blows hot and cold.",
                    "Model checking copy phases of concurrent copying garbage collection with various memory models.",
                    "Sound gradual typing: only mostly dead.",
                    "The VM already knew that: leveraging compile-time knowledge to optimize gradual typing.",
                    "Sound gradual typing is nominally alive and well.",
                    "Effective interactive resolution of static analysis alarms.",
                    "Abridging source code.",
                    "Evaluating and improving semistructured merge.",
                    "Learning to blame: localizing novice type errors with data-driven diagnosis.",
                    "Model-assisted machine-code synthesis.",
                    "Synthesis of data completion scripts using finite tree automata.",
                    "SQLizer: query synthesis from natural language.",
                    "Synthesizing configuration file specifications with association rule learning.",
                    "Natural synthesis of provably-correct data-structure manipulations.",
                    "Practical initialization race detection for JavaScript web applications.",
                    "Efficient logging in non-volatile memory by exploiting coherency protocols.",
                    "Heaps don't lie: countering unsoundness with heap snapshots.",
                    "Instrumentation bias for dynamic data race detection.",
                    "Familia: unifying interfaces, type classes, and family polymorphism.",
                    "Static stages for heterogeneous programming.",
                    "Orca: GC and type system co-design for actor languages.",
                    "Monadic composition for deterministic, parallel batch processing.",
                    "GLORE: generalized loop redundancy elimination upon LER-notation.",
                    "Verifying spatial properties of array computations.",
                    "TreeFuser: a framework for analyzing and fusing general recursive tree traversals.",
                    "The tensor algebra compiler.",
                    "Seam: provably safe local edits on graphs.",
                    "TiML: a functional language for practical complexity analysis with invariants.",
                    "FairSquare: probabilistic verification of program fairness.",
                    "Reasoning on divergent computations with coaxioms.",
                    "Restricting grammars with tree automata.",
                    "Exploiting implicit beliefs to resolve sparse usage problem in usage-based specification mining.",
                    "DéjàVu: a map of code duplicates on GitHub.",
                    "Understanding the use of lambda expressions in Java.",
                    "A model for reasoning about JavaScript promises.",
                    "A verified messaging system.",
                    "Who guards the guards? formal validation of the Arm v8-m architecture specification.",
                    "Robust and compositional verification of object capability patterns.",
                    "Type test scripts for TypeScript testing.",
                    "A solver-aided language for test input generation.",
                    "Transforming programs and tests in tandem for fault localization.",
                    "Automated testing of graphics shader compilers.",
                    "Bounded exhaustive test-input generation on GPUs.",
                    "Project snowflake: non-blocking safe manual memory management in .NET.",
                    "Alpaca: intermittent execution without checkpoints.",
                    "An auditing language for preventing correlated failures in the cloud.",
                    "Reliable and automatic composition of language extensions to C: the ableC extensible language framework.",
                    "IDEal: efficient and precise alias-aware dataflow analysis.",
                    "Data-driven context-sensitivity for points-to analysis.",
                    "Automatically generating features for learning program analysis heuristics for C-like languages.",
                    "P/Taint: unified points-to and taint analysis.",
                    "Deadlock avoidance in parallel programs with futures: why parallel tasks should not wait for strangers.",
                    "Detecting argument selection defects.",
                    "How type errors were fixed and what students did?",
                    "Learning user friendly type-error messages.",
                    "Geo-distribution of actor-based services.",
                    "Paxos made EPR: decidable reasoning about distributed protocols.",
                    "Verifying strong eventual consistency in distributed systems.",
                    "Verifying distributed programs via canonical sequentialization."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "21st ICFP 2016",
        "info": "Nara, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2016",
                "sub_name": "Proceedings of the 21st ACM SIGPLAN International Conference on Functional Programming, ICFP 2016, Nara, Japan, September 18-22, 2016.",
                "count": 40,
                "papers": [
                    "TensorFlow: learning functions at scale.",
                    "Journey to find bugs in JavaScript web applications in the wild.",
                    "A functional programmer's guide to homotopy type theory.",
                    "Farms, pipes, streams and reforestation: reasoning about structured parallel processes using types and hylomorphisms.",
                    "Dag-calculus: a calculus for parallel computation.",
                    "A lambda-calculus foundation for universal probabilistic programming.",
                    "Deriving a probability density calculator (functional pearl).",
                    "A new verified compiler backend for CakeML.",
                    "Sequent calculus as a compiler intermediate language.",
                    "Refinement through restraint: bringing down the cost of verification.",
                    "Fully abstract compilation via universal embedding.",
                    "Oh Lord, please don't let contracts be misunderstood (functional pearl).",
                    "A type theory for incremental computational complexity with control flow changes.",
                    "Compact bit encoding schemes for simply-typed lambda-terms.",
                    "Queueing and glueing for optimal partitioning (functional pearl).",
                    "All sorts of permutations (functional pearl).",
                    "A glimpse of Hopjs.",
                    "Experience report: growing and shrinking polygons for random testing of computational geometry algorithms.",
                    "Think like a vertex, behave like a function! a functional DSL for vertex-centric big graph processing.",
                    "Datafun: a functional Datalog.",
                    "Dynamic witnesses for static type errors (or, ill-typed programs usually go wrong).",
                    "Automatically disproving fair termination of higher-order functional programs.",
                    "Higher-order ghost state.",
                    "Unifiers as equivalences: proof-relevant unification of dependently typed data.",
                    "Elaborator reflection: extending Idris in Idris.",
                    "Partial type equivalences for verified dependent interoperability.",
                    "Constructive Galois connections: taming the Galois connection framework for mechanized metatheory.",
                    "An abstract memory functor for verified C static analyzers.",
                    "Ghostbuster: a tool for simplifying and converting GADTs.",
                    "Indexed codata types.",
                    "Disjoint intersection types.",
                    "Set-theoretic types for polymorphic variants.",
                    "Hierarchical memory management for parallel programs.",
                    "Allocation characterizes polyvariance: a unified methodology for polyvariant control-flow analysis.",
                    "A fully concurrent garbage collector for functional programs on multicore processors.",
                    "Talking bananas: structural recursion for session types.",
                    "The best of both worlds: linear functional programming without compromise.",
                    "Context-free session types.",
                    "Combining effects and coeffects via grading.",
                    "String diagrams for free monads (functional pearl)."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "20th ICFP 2015",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2015",
                "sub_name": "Proceedings of the 20th ACM SIGPLAN International Conference on Functional Programming, ICFP 2015, Vancouver, BC, Canada, September 1-3, 2015.",
                "count": 37,
                "papers": [
                    "Program synthesis: opportunities for the next decade.",
                    "Functional pearl: a SQL to C compiler in 500 lines of code.",
                    "An optimizing compiler for a purely functional web-application language.",
                    "Pycket: a tracing JIT for a functional language.",
                    "1ML - core and modules united (F-ing first-class modules).",
                    "Bounded refinement types.",
                    "Applicative bidirectional programming with lenses.",
                    "Hygienic resugaring of compositional desugaring.",
                    "XQuery and static typing: tackling the problem of backward axes.",
                    "Noninterference for free.",
                    "Algebras and coalgebras in the light affine Lambda calculus.",
                    "Structures for structural recursion.",
                    "Denotational cost semantics for functional languages with inductive types.",
                    "Analysing the complexity of functional programs: higher-order meets first-order.",
                    "Functional programming and hardware design: still interesting after all these years.",
                    "Pilsner: a compositionally verified compiler for a higher-order imperative language.",
                    "A unification algorithm for Coq featuring universe polymorphism and overloading.",
                    "Foundational extensible corecursion: a proof assistant perspective.",
                    "Generating performance portable code using rewrite rules: from high-level functional expressions to high-performance OpenCL code.",
                    "Adaptive lock-free maps: purely-functional to scalable.",
                    "Partial aborts for transactions via first-class continuations.",
                    "Which simple types have a unique inhabitant?",
                    "Elaborating evaluation-order polymorphism.",
                    "Automatic refunctionalization to a language with copattern matching: with applications to the expression problem.",
                    "Functional pearl: two can keep a secret, if one of them uses Haskell.",
                    "HLIO: mixing static and dynamic typing for information-flow control in Haskell.",
                    "Practical principled FRP: forget the past, change the future, FRPNow!",
                    "Certified symbolic management of financial multi-party contracts.",
                    "A fast compiler for NetKAT.",
                    "RRB vector: a practical general purpose immutable sequence.",
                    "Functional pearl: a smart view on datatypes.",
                    "Efficient communication and collection with compact normal forms.",
                    "Blame assignment for higher-order contracts with intersection and union.",
                    "Expressing contract monitors as patterns of communication.",
                    "Learning refinement types.",
                    "Practical SMT-based type error localization.",
                    "GADTs meet their match: pattern-matching warnings that account for GADTs, guards, and laziness."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "19th ICFP 2014",
        "info": "Gothenburg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2014",
                "sub_name": "Proceedings of the 19th ACM SIGPLAN international conference on Functional programming, Gothenburg, Sweden, September 1-3, 2014.",
                "count": 31,
                "papers": [
                    "Using formal methods to enable more secure vehicles: DARPA's HACMS program.",
                    "Building embedded systems with embedded DSLs.",
                    "Concurrent NetCore: from policies to pipelines.",
                    "SeLINQ: tracking information across application-database boundaries.",
                    "Type-based parametric analysis of program families.",
                    "Romeo: a system for more flexible binding-safe programming.",
                    "Maximal sharing in the Lambda calculus with letrec.",
                    "Practical and effective higher-order optimizations.",
                    "Worker/wrapper/makes it/faster.",
                    "Compositional semantics for composable continuations: from abortive to delimited control.",
                    "Coeffects: a calculus of context-dependent computation.",
                    "Behavioral software contracts.",
                    "Soft contract verification.",
                    "On teaching *how to design programs*: observations from a newcomer.",
                    "SML# in industry: a practical ERP system development.",
                    "Lem: reusable engineering of real-world semantics.",
                    "Safe zero-cost coercions for Haskell.",
                    "Hindley-milner elaboration in applicative style: functional pearl.",
                    "Settable and non-interfering signal functions for FRP: how a first-order switch is more than enough.",
                    "Functional programming for dynamic and large data with self-adjusting computation.",
                    "Depending on types.",
                    "Homotopical patch theory.",
                    "Pattern matching without K.",
                    "Refinement types for Haskell.",
                    "A theory of gradual effect systems.",
                    "How to keep your neighbours in order.",
                    "A relational framework for higher-order shape analysis.",
                    "There is no fork: an abstraction for efficient, concurrent, and concise data access.",
                    "Folding domain-specific languages: deep and shallow embeddings (functional Pearl).",
                    "Krivine nets: a semantic foundation for distributed execution.",
                    "Distilling abstract machines."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "18th ICFP 2013",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2013",
                "sub_name": "ACM SIGPLAN International Conference on Functional Programming, ICFP'13, Boston, MA, USA - September 25 - 27, 2013.",
                "count": 42,
                "papers": [
                    "Interactive programming with dependent types.",
                    "Verified decision procedures for MSO on words based on derivatives of regular expressions.",
                    "C-SHORe: a collapsible approach to higher-order verification.",
                    "Automatic SIMD vectorization for Haskell.",
                    "Exploiting vector instructions with generalized stream fusio.",
                    "Optimising purely functional GPU programs.",
                    "Type-theory in color.",
                    "Typed syntactic meta-programming.",
                    "Mtac: a monad for typed tactic programming in Coq.",
                    "Fun with semirings: a functional pearl on the abuse of linear algebra.",
                    "Efficient divide-and-conquer parsing of practical context-free languages.",
                    "Functional geometry and the Traité de Lutherie: functional pearl.",
                    "Programming and reasoning with algebraic effects and dependent types.",
                    "Handlers in action.",
                    "Computer science as a school subject.",
                    "Correctness of an STM Haskell implementation.",
                    "Programming with permissions in Mezzo.",
                    "Wellfounded recursion with copatterns: a unified approach to termination and productivity.",
                    "Productive coprogramming with guarded recursion.",
                    "Unifying structured recursion schemes.",
                    "Higher-order functional reactive programming without spacetime leaks.",
                    "Functional reactive programming with liveness guarantees.",
                    "A short cut to parallelization theorems.",
                    "Using circular programs for higher-order syntax: functional pearl.",
                    "Weak optimality, and the meaning of sharing.",
                    "System FC with explicit kind equality.",
                    "The constrained-monad problem.",
                    "Simple and compositional reification of monadic embedded languages.",
                    "Structural recursion for querying ordered graphs.",
                    "Modular monadic meta-theory.",
                    "Modular and automated type-soundness verification for language extensions.",
                    "A nanopass framework for commercial compiler development.",
                    "Experience report: applying random testing to a base type environment.",
                    "Experience report: functional programming of mHealth applications.",
                    "Hoare-style reasoning with (algebraic) continuations.",
                    "Unifying refinement and hoare-style reasoning in a logic for higher-order concurrency.",
                    "The bedrock structured programming system: combining generative metaprogramming and hoare logic in an extensible program verifier.",
                    "A practical theory of language-integrated query.",
                    "Calculating threesomes, with blame.",
                    "Complete and easy bidirectional typechecking for higher-rank polymorphism.",
                    "Optimizing abstract abstract machines.",
                    "Testing noninterference, quickly."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2013dtp",
                "sub_name": "Proceedings of the 2013 ACM SIGPLAN workshop on Dependently-typed programming, DTP@ICFP 2013, Boston, Massachusetts, USA, September 24, 2013.",
                "count": 5,
                "papers": [
                    "Correct-by-construction pretty-printing.",
                    "New equations for neutral terms: a sound and complete decision procedure, formalized.",
                    "A multivalued language with a dependent type system.",
                    "Relational algebraic ornaments.",
                    "Leveling up dependent types: generic programming over a predicative hierarchy of universes."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2013fpcdsl",
                "sub_name": "Proceedings of the 1st annual workshop on Functional programming concepts in domain-specific languages, FPCDSL@ICFP 2013, Boston, Massachusetts, USA, September 22, 2013.",
                "count": 7,
                "papers": [
                    "Bluespec and Haskell.",
                    "Functional synthesis of genetic regulatory networks.",
                    "Encoding secure information flow with restricted delegation and revocation in Haskell.",
                    "QuaFL: a typed DSL for quantum programming.",
                    "Embrace, defend, extend: a methodology for embedding preexisting DSLs.",
                    "Abstract resource cost derivation for logical quantum circuit descriptions.",
                    "Sensitivity analysis using type-based constraints."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "17th ICFP 2012",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2012",
                "sub_name": "ACM SIGPLAN International Conference on Functional Programming, ICFP'12, Copenhagen, Denmark, September 9-15, 2012.",
                "count": 35,
                "papers": [
                    "Agda-curious?: an exploration of programming with dependent types.",
                    "Verified heap theorem prover by paramodulation.",
                    "Formal verification of monad transformers.",
                    "Elaborating intersection and union types.",
                    "An error-tolerant type system for variational lambda calculus.",
                    "Superficially substructural types.",
                    "Shake before building: replacing make with haskell.",
                    "Practical typed lazy contracts.",
                    "Functional programming with structured graphs.",
                    "Painless programming combining reduction and search: design principles for embedding decision procedures in high-level languages.",
                    "Transporting functions across ornaments.",
                    "Proof-producing synthesis of ML from higher-order logic.",
                    "Operational semantics using the partiality monad.",
                    "High performance embedded domain specific languages.",
                    "Pure type systems with corecursion on streams: from finite to infinitary normalisation.",
                    "On the complexity of equivalence of specifications of infinite objects.",
                    "Automatic amortised analysis of dynamic memory allocation for lazy functional programs.",
                    "Introspective pushdown analysis of higher-order programs.",
                    "Efficient lookup-table protocol in secure multiparty computation.",
                    "Addressing covert termination and timing channels in concurrent information flow systems.",
                    "Sneaking around concatMap: efficient combinators for dynamic programming.",
                    "Experience report: Haskell in computational biology.",
                    "A meta-scheduler for the par-monad: composable scheduling for the heterogeneous cloud.",
                    "Nested data-parallelism on the gpu.",
                    "Work efficient higher-order vectorisation.",
                    "Tales from the jungle.",
                    "Propositions as sessions.",
                    "Typing unmarshalling without marshalling types.",
                    "Deconstraining DSLs.",
                    "Explicitly heterogeneous metaprogramming with MetaHaskell.",
                    "A generic abstract syntax model for embedded languages.",
                    "Experience report: a do-it-yourself high-assurance compiler.",
                    "Equality proofs and deferred type errors: a compiler pearl.",
                    "A traversal-based algorithm for higher-order model checking.",
                    "Functional programs that explain their work."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2012scheme",
                "sub_name": "Proceedings of the 2012 Annual Workshop on Scheme and Functional Programming, Scheme 2012, Copenhagen, Denmark, September 9-15, 2012.",
                "count": 11,
                "papers": [
                    "Scheme on the web and in the classroom: a retrospective about the LAML project.",
                    "miniKanren, live and untagged: quine generation via relational interpreters (programming pearl).",
                    "Optimizing closures in O(0) time.",
                    "A sufficiently smart compiler for procedural records.",
                    "Efficient compilation of tail calls and continuations to JavaScript.",
                    "Hygienic quasiquotation in scheme.",
                    "AspectScheme: aspects in higher-order languages.",
                    "Optimizing JavaScript code for V8.",
                    "Interpretations of the gradually-typed lambda calculus.",
                    "Form over function: teaching beginners how to construct programs.",
                    "Using scheme to control simulated modular robots."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "16th ICFP 2011",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2011",
                "sub_name": "Proceeding of the 16th ACM SIGPLAN international conference on Functional Programming, ICFP 2011, Tokyo, Japan, September 19-21, 2011.",
                "count": 40,
                "papers": [
                    "Towards a comprehensive theory of monadic effects.",
                    "Just do it: simple monadic equational reasoning.",
                    "Lightweight monadic programming in ML.",
                    "Functional programming through deep time: modeling the first complex ecosystems on earth.",
                    "Monads, zippers and views: virtualizing the monad stack.",
                    "A semantic model for graphical user interfaces.",
                    "Modular rollback through control logging: a pair of twin functional pearls.",
                    "Pushdown flow analysis of first-class control.",
                    "Subtyping delimited continuations.",
                    "Set-theoretic foundation of parametric polymorphism and subtyping.",
                    "Parametric polymorphism and semantic subtyping: the logical connection.",
                    "Balanced trees inhabiting functional parallel programming.",
                    "Implicit self-adjusting computation for purely functional programs.",
                    "Programming assurance cases in Agda.",
                    "On the bright side of type classes: instance arguments in Agda.",
                    "Functional modelling of musical harmony: an experience report.",
                    "How to make ad hoc proof automation less ad hoc.",
                    "Temporal higher-order contracts.",
                    "Parsing with derivatives: a functional pearl.",
                    "An efficient non-moving garbage collector for functional languages.",
                    "Deriving an efficient FPGA implementation of a low density parity check forward error corrector.",
                    "Geometry of synthesis iv: compiling affine recursion into static hardware.",
                    "A hierarchy of mendler style recursion combinators: taming inductive datatypes with negative occurrences.",
                    "Typed self-interpretation by pattern matching.",
                    "Using camlp4 for presenting dynamic mathematics on the web: DynaMoW, an OCaml language extension for the run-time generation of mathematical contents and their presentation on the web.",
                    "Secure distributed programming with value-dependent types.",
                    "Frenetic: a network programming language.",
                    "Forest: a language and toolkit for programming with filestores.",
                    "Making standard ML a practical database programming language.",
                    "Nameless, painless.",
                    "Binders unbound.",
                    "Recursion principles for syntax with bindings and substitution.",
                    "Proving the unique fixed-point principle correct: an adventure with category theory.",
                    "Linearity and PCF: a semantic insight!",
                    "Generalising and dualising the third list-homomorphism theorem: functional pearl.",
                    "Incremental updates for efficient bidirectional transformations.",
                    "Modular verification of preemptive OS kernels.",
                    "Characteristic formulae for the verification of imperative programs.",
                    "An equivalence-preserving CPS translation via multi-language semantics.",
                    "A kripke logical relation for effect-based program transformations."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "15th ICFP 2010",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2010",
                "sub_name": "Proceeding of the 15th ACM SIGPLAN international conference on Functional programming, ICFP 2010, Baltimore, Maryland, USA, September 27-29, 2010.",
                "count": 36,
                "papers": [
                    "ML: metalanguage or object language?",
                    "The gentle art of levitation.",
                    "Functional pearl: every bit counts.",
                    "ReCaml: execution state as the cornerstone of reconfigurations.",
                    "Lolliproc: to concurrency from classical linear logic via curry-howard and control.",
                    "Abstracting abstract machines.",
                    "Polyvariant flow analysis with higher-ranked polymorphic types and higher-order effect operators.",
                    "The reduceron reconfigured.",
                    "Using functional programming within an industrial product group: perspectives and perceptions.",
                    "Lazy tree splitting.",
                    "Semantic subtyping with an SMT solver.",
                    "Logical types for untyped languages.",
                    "TeachScheme!: a checkpoint.",
                    "Higher-order representation of substructural logics.",
                    "The impact of higher-order state and control effects on local relational reasoning.",
                    "Distance makes the types grow stronger: a calculus for differential privacy.",
                    "Security-typed programming within dependently typed programming.",
                    "Combining syntactic and semantic bidirectionalization.",
                    "Matching lenses: alignment and view update.",
                    "Bidirectionalizing graph transformations.",
                    "A fresh look at programming with names and binders.",
                    "Experience report: growing programming languages for beginning students.",
                    "Fortifying macros.",
                    "Functional parallel algorithms.",
                    "Specifying and verifying sparse matrix codes.",
                    "Regular, shape-polymorphic, parallel arrays in Haskell.",
                    "A certified framework for compiling and executing garbage-collected languages.",
                    "Total parser combinators.",
                    "Scrapping your inefficient engine: using partial evaluation to improve domain-specific language implementation.",
                    "Rethinking supercompilation.",
                    "Program verification through characteristic formulae.",
                    "VeriML: typed computation of logical terms inside a language with effects.",
                    "Parametricity and dependent types.",
                    "A play on regular expressions: functional pearl.",
                    "Experience report: Haskell as a reagent: results and observations on the use of Haskell in a python project.",
                    "Instance chains: type class programming without overlapping instances."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "14th ICFP 2009",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2009",
                "sub_name": "Proceeding of the 14th ACM SIGPLAN international conference on Functional programming, ICFP 2009, Edinburgh, Scotland, UK, August 31 - September 2, 2009.",
                "count": 35,
                "papers": [
                    "Organizing functional code for parallel execution or, foldl and foldr considered slightly harmful.",
                    "Functional pearl: la tour d'Hanoï.",
                    "Purely functional lazy non-deterministic programming.",
                    "Safe functional reactive programming through dependent types.",
                    "Causal commutative arrows and their optimization.",
                    "A functional I/O system or, fun for freshman kids.",
                    "Experience report: embedded, parallel computer-vision with a functional DSL.",
                    "Runtime support for multicore Haskell.",
                    "Effective interactive proofs for higher-order imperative programs.",
                    "Experience report: seL4: formally verifying a high-performance microkernel.",
                    "Biorthogonality, step-indexing and compiler correctness.",
                    "Scribble: closing the book on ad hoc documentation tools.",
                    "Lambda, the ultimate TA: using a proof assistant to teach programming language foundations.",
                    "A universe of binding and computation.",
                    "Non-parametric parametricity.",
                    "Finding race conditions in Erlang with QuickCheck and PULSE.",
                    "Partial memoization of concurrency and communication.",
                    "Free theorems involving type constructor classes: functional pearl.",
                    "Experience report: Haskell in the 'real world': writing a commercial application in a lazy functional lanuage.",
                    "Beautiful differentiation.",
                    "OXenstored: an efficient hierarchical and transactional database using functional programming with reference cell comparisons.",
                    "Experience report: using objective caml to develop safety-critical embedded tools in a certification framework.",
                    "Identifying query incompatibilities with evolving XML schemas.",
                    "Commutative monads, diagrams and knots.",
                    "Generic programming with fixed points for mutually recursive datatypes.",
                    "Attribute grammars fly first-class: how to do aspect oriented programming in Haskell.",
                    "Parallel concurrent ML.",
                    "A concurrent ML library in concurrent Haskell.",
                    "Experience report: OCaml for an industrial-strength static analysis framework.",
                    "Control-flow analysis of function calls and returns by abstract interpretation.",
                    "Automatically RESTful web applications: marking modular serializable continuations.",
                    "Experience report: ocsigen, a web programming framework.",
                    "Implementing first-class polymorphic delimited continuations by a type-directed selective CPS-transform.",
                    "A theory of typed coercions and its applications.",
                    "Complete and decidable type inference for GADTs."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th ICFP 2008",
        "info": "Victoria, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2008",
                "sub_name": "Proceeding of the 13th ACM SIGPLAN international conference on Functional programming, ICFP 2008, Victoria, BC, Canada, September 20-28, 2008.",
                "count": 39,
                "papers": [
                    "Lazy and speculative execution in computer systems.",
                    "FLUX: functional updates for XML.",
                    "Typed iterators for XML.",
                    "AURA: a programming language for authorization and audit.",
                    "The power of Pi.",
                    "Type checking with open type functions.",
                    "From ML to MLF: graphic type constraints with efficient type inference.",
                    "A type-preserving compiler in Haskell.",
                    "Experience report: playing the DSL card.",
                    "Generic discrimination: sorting and paritioning unshared data in linear time.",
                    "Transactional events for ML.",
                    "Experience report: erlang in acoustic ray tracing.",
                    "Implicitly-threaded parallelism in Manticore.",
                    "Defunctionalized interpreters for programming languages.",
                    "Parametric higher-order abstract syntax for mechanized semantics.",
                    "Typed closure conversion preserves observational equivalence.",
                    "Write it recursively: a generic framework for optimal path queries.",
                    "Efficient nondestructive equality checking for trees and graphs.",
                    "Functional pearl: streams and unique fixed points.",
                    "Data-flow testing of declarative programs.",
                    "Functional translation of a calculus of capabilities.",
                    "Paradise: a two-stage DSL embedded in Haskell.",
                    "Ynot: dependent types for imperative programs.",
                    "A scheduling framework for general-purpose parallel languages.",
                    "Space profiling for parallel functional programs.",
                    "Polymorphism and page tables: systems programming from a functional programmer's perspective.",
                    "Pattern minimization problems over recursive data types.",
                    "Deciding kCFA is complete for EXPTIME.",
                    "HMF: simple type inference for first-class polymorphism.",
                    "FPH: first-class polymorphism for Haskell.",
                    "Mixin' up the ML module system.",
                    "Compiling self-adjusting programs with continuations.",
                    "Flask: staged functional programming for sensor networks.",
                    "Experience report: a pure shirt fits.",
                    "Functional netlists.",
                    "NixOS: a purely functional Linux distribution.",
                    "Experience report: visualizing data through functional pipelines.",
                    "Quotient lenses.",
                    "Report on the tenth ICFP programming contest."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2008fdpe",
                "sub_name": "Proceedings of the 2008 international workshop on Functional and declarative programming in education, FDPE@ICFP 2008, Victoria, BC, Canada, September 20 - 28, 2008.",
                "count": 9,
                "papers": [
                    "Htdp and dmda in the battlefield: a case study in first-year programming instruction.",
                    "The chilling descent: making the transition to a conventional curriculum.",
                    "Functional programming and theorem proving for undergraduates: a progress report.",
                    "SASyLF: an educational proof assistant for language theory.",
                    "Experimenting with formal languages using forlan.",
                    "A robot in every classroom: robots and functional programming across the curriculum.",
                    "Teaching functional programming with soccer-fun.",
                    "Declarative language extensions for prolog courses.",
                    "Tips on teaching types and functions."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th ICFP 2007",
        "info": "Freiburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2007",
                "sub_name": "Proceedings of the 12th ACM SIGPLAN International Conference on Functional Programming, ICFP 2007, Freiburg, Germany, October 1-3, 2007.",
                "count": 34,
                "papers": [
                    "Ott: effective tool support for the working semanticist.",
                    "Program-ing finger trees in Coq.",
                    "Experience report: functional programming in c-rules.",
                    "Extensible pattern matching via a lightweight language extension.",
                    "On Barron and Strachey's cartesian product function.",
                    "Bidirectionalization transformation based on automatic derivation of view complement functions.",
                    "Tangible functional programming.",
                    "Termination analysis and call graph construction for higher-order functional programs.",
                    "Relating complexity and precision in control flow analysis.",
                    "Inductive reasoning about effectful data types.",
                    "A type directed translation of MLF to system F.",
                    "Declarative programming for artificial intelligence applications.",
                    "McErlang: a model checker for a distributed functional programming language.",
                    "Experience report: the reactis validation tool.",
                    "iTasks: executable specifications of interactive work flow systems for the web.",
                    "Experience report: scheme in commercial web application development.",
                    "Functional pearl: the great escape or, how to jump the border without getting caught.",
                    "Adding delimited and composable control to a production programming environment.",
                    "Compiling with continuations, continued.",
                    "Type-safe higher-order channels in ML-like languages.",
                    "Evaluating high-level distributed language constructs.",
                    "Experience report: using functional programming to manage a linux distribution.",
                    "Subtyping and intersection types revisited.",
                    "Experience report: building an eclipse-based IDE for Haskell.",
                    "User-friendly functional programming for web mashups.",
                    "A generic usage analysis with subeffect qualifiers.",
                    "Experience report: a Haskell interpreter for cellML.",
                    "Feedback directed implicit parallelism.",
                    "Lazy call-by-value evaluation.",
                    "Faster laziness using dynamic pointer tagging.",
                    "A type system for recursive modules.",
                    "Implicit phasing for R6RS libraries.",
                    "Stream fusion: from lists to streams to nothing at all.",
                    "Call-pattern specialisation for haskell programs."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "11th ICFP 2006",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2006",
                "sub_name": "Proceedings of the 11th ACM SIGPLAN International Conference on Functional Programming, ICFP 2006, Portland, Oregon, USA, September 16-21, 2006.",
                "count": 27,
                "papers": [
                    "The development of Chez Scheme.",
                    "Improving flow analyses via GammaCFA: abstract garbage collection and counting.",
                    "Delimited dynamic binding.",
                    "Static typing for a faulty lambda calculus.",
                    "Simple unification-based type inference for GADTs.",
                    "Polymorphism and separation in hoare type theory.",
                    "Recursive modules for programming.",
                    "From structures and functors to modules and units.",
                    "The missing link: dynamic components for ML.",
                    "Static analysis for syntax objects.",
                    "Practical proofs of concurrent programs.",
                    "Transactional events.",
                    "Stabilizers: a modular checkpointing abstraction for concurrent functional programs.",
                    "Modelling deterministic concurrent I/O.",
                    "Modular development of certified program verifiers with a proof assistant.",
                    "Mechanized meta-reasoning using a hybrid HOAS/de bruijn representation and reflection.",
                    "Equality of streams is a Pi0 over 2-complete problem.",
                    "OCaml + XDuce.",
                    "biXid: a bidirectional transformation language for XML.",
                    "Fifteen years of functional pearls.",
                    "A pattern for almost compositional functions.",
                    "Algebraic fusion of functions with an accumulating parameter and its improvement.",
                    "Extensible programming with first-class cases.",
                    "Boxy types: inference for higher-rank types and impredicativity.",
                    "Access control in a core calculus of dependency.",
                    "Programming monads operationally with Unimo.",
                    "Abstraction preservation and subtyping in distributed languages."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th ICFP 2005",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2005",
                "sub_name": "Proceedings of the 10th ACM SIGPLAN International Conference on Functional Programming, ICFP 2005, Tallinn, Estonia, September 26-28, 2005.",
                "count": 29,
                "papers": [
                    "From ML type inference to stratified type inference.",
                    "The anatomy of a loop: a story of scope and control.",
                    "Acute: high-level programming language design for distributed computation.",
                    "An expressive language of signatures.",
                    "Recursive type generativity.",
                    "Dynamic optimization for functional reactive programming using generalized algebraic data types.",
                    "Combining programming with theorem proving.",
                    "A step-indexed model of substructural state.",
                    "AtomCaml: first-class atomicity via rollback.",
                    "Witnessing side-effects.",
                    "A principled approach to operating system construction in Haskell.",
                    "JavaScript at ten years.",
                    "Simple, partial type-inference for System F based on type-containment.",
                    "Qualified types for MLF.",
                    "Type inference, principal typings, and let-polymorphism for first-class mixin modules.",
                    "High-level views on low-level representations.",
                    "Scrap your nameplate: (functional pearl).",
                    "Backtracking, interleaving, and terminating monad transformers: (functional pearl).",
                    "Scrap your boilerplate with class: extensible generic functions.",
                    "Continuations from generalized stack inspection.",
                    "Fast narrowing-driven partial evaluation for inductively sequential programs.",
                    "Mechanizing the meta-theory of programming languages.",
                    "Associated type synonyms.",
                    "Modular verification of concurrent assembly code with dynamic thread creation and termination.",
                    "A language-based approach to functionally correct imperative programming.",
                    "A logical analysis of aliasing in imperative higher-order functions.",
                    "Monadic augment and generalised short cut fusion.",
                    "PolyAML: a polymorphic aspect-oriented functional programming language.",
                    "Aspectual Caml: an aspect-oriented functional language."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2005merlin",
                "sub_name": "ACM SIGPLAN International Conference on Functional Programming, Workshop on Mechanized reasoning about languages with variable binding, MERLIN 2005, Tallinn, Estonia, September 30, 2005.",
                "count": 8,
                "papers": [
                    "Towards a type theory of contexts.",
                    "A computational approach to reflective meta-reasoning about languages with bindings.",
                    "A unified category-theoretic formulation of typed binding signatures.",
                    "A formal treatment of the barendregt variable convention in rule inductions.",
                    "Toward a general theory of names: binding and scope.",
                    "Translating specifications from nominal logic to CIC with the theory of contexts.",
                    "Types with semantics: soundness proof assistant.",
                    "Combining higher-order abstract syntax with first-order abstract syntax in ATS."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2005fdpe",
                "sub_name": "Proceedings of the 2005 workshop on Functional and Declarative Programming in Education, FDPE@ICFP 2005, Tallinn, Estonia, September 25 - 25, 2005.",
                "count": 7,
                "papers": [
                    "How to design class hierarchies.",
                    "From functional to object-oriented programming: a smooth transition for beginners.",
                    "Laziness without all the hard work: combining lazy and strict languages for teaching.",
                    "Word puzzles in Haskell: interactive games for functional programming exercises.",
                    "Teaching of image synthesis in functional style.",
                    "MinCaml: a simple and efficient compiler for a minimal functional language.",
                    "Engineering software correctness."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "9th ICFP 2004",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2004",
                "sub_name": "Proceedings of the Ninth ACM SIGPLAN International Conference on Functional Programming, ICFP 2004, Snow Bird, UT, USA, September 19-21, 2004.",
                "count": 25,
                "papers": [
                    "The C - compiler infrastructure.",
                    "Galois: high assurance software.",
                    "Making a fast curry: push/enter vs. eval/apply for higher-order languages.",
                    "Improving the static analysis of embedded languages via partial evaluation.",
                    "Searching for deadlocks while debugging concurrent haskell programs.",
                    "A type-theoretic foundation of continuations and prompts.",
                    "Relating models of backtracking.",
                    "Don't make the wrong mistakes: programming as debugging.",
                    "Regular expression patterns.",
                    "Multi-return function call.",
                    "Implementing functional logic languages using multiple threads and stores.",
                    "Monadic regions.",
                    "Translating dependency into parametricity.",
                    "Types for path correctness of XML queries.",
                    "Types, potency, and idempotency: why nonlinearity and amnesia make a type system work.",
                    "Numbering matters: first-order canonical forms for second-order recursive types.",
                    "20 years of industrial functional programming.",
                    "From process logic to program logic.",
                    "Verification of safety properties for concurrent assembly code.",
                    "A sound (and complete) model of contracts.",
                    "A nanopass infrastructure for compiler education.",
                    "Functional morphology.",
                    "Slideshow: functional presentations.",
                    "Generics for the masses.",
                    "Scrap more boilerplate: reflection, zips, and generalised casts."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8th ICFP 2003",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2003",
                "sub_name": "Proceedings of the Eighth ACM SIGPLAN International Conference on Functional Programming, ICFP 2003, Uppsala, Sweden, August 25-29, 2003.",
                "count": 27,
                "papers": [
                    "Conservation of information: applications in functional, reversible, and quantum computing.",
                    "Scripting the type inference process.",
                    "Discriminative sum types locate the source of type errors.",
                    "MLF: raising ML to the power of system F.",
                    "An extension of HM(X) with bounded existential and universal data-types.",
                    "CDuce: an XML-centric general-purpose language.",
                    "Compiling regular patterns.",
                    "Software is discrete mathematics.",
                    "Global abstraction-safe marshalling with hash types.",
                    "Dynamic rebinding for marshalling and update, with destruct-time?",
                    "Iterative-free program analysis.",
                    "From Hilbert space to Dilbert space: context semantics as a language for games and flow analysis.",
                    "A theory of aspects.",
                    "Dependency-style generic Haskell.",
                    "Functional automatic differentiation with dirac impulses.",
                    "A user-centred approach to functions in Excel.",
                    "A sound and complete axiomatization of delimited continuations.",
                    "Call-by-value is dual to call-by-name.",
                    "Disjunctive normal forms and local exceptions.",
                    "An effective theory of type refinements.",
                    "A static type system for JVM access control.",
                    "Polish parsers, step by step.",
                    "Boxes go bananas: encoding higher-order abstract syntax with parametric polymorphism.",
                    "FreshML: programming with binders made simple.",
                    "Meta-programming through typeful code representation.",
                    "Optimistic evaluation: an adaptive evaluation strategy for non-strict programs.",
                    "Understanding aspects: extended abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/icfp/2003merlin",
                "sub_name": "Eighth ACM SIGPLAN International Conference on Functional Programming, Workshop on Mechanized reasoning about languages with variable binding, MERLIN 2003, Uppsala, Sweden, August 2003.",
                "count": 11,
                "papers": [
                    "A definitional approach to primitivexs recursion over higher order abstract syntax.",
                    "Mechanising Hankin and Barendregt using the Gordon-Melham axioms.",
                    "A formalization of an Ordered Logical Framework in Hybrid with applications to continuation machines.",
                    "Reasoning on an imperative object-based calculus in Higher Order Abstract Syntax.",
                    "Reasoning about recursive procedures with parameters.",
                    "Compiler implementation in a formal logical framework.",
                    "Verifying CPS transformations in Isabelle/HOL.",
                    "A unified category theoretic approach to variable binding.",
                    "Representing reductions of NP-complete problems in logical frameworks: a case study.",
                    "Explicit substitutions and higher-order syntax.",
                    "A modal foundation for meta-variables."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "7th ICFP 2002",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2002",
                "sub_name": "Proceedings of the Seventh ACM SIGPLAN International Conference on Functional Programming (ICFP '02), Pittsburgh, Pennsylvania, USA, October 4-6, 2002.",
                "count": 27,
                "papers": [
                    "Towards more natural functional programming languages.",
                    "Bootstrapping one-sided flexible arrays.",
                    "Concatenate, reverse and map vanish for free.",
                    "Monads for incremental computing.",
                    "Packrat parsing: : simple, powerful, lazy, linear time, functional pearl.",
                    "Contracts for higher-order functions.",
                    "An interoperable calculus for external object access.",
                    "Composable and compilable macros: : you want it when?",
                    "A demand-driven adaptive type analysis.",
                    "Exception analysis for non-strict languages.",
                    "Modular typechecking for hierarchically extensible datatypes and functions.",
                    "Functional formal methods.",
                    "Shortcut fusion for accumulating parameters & zip-like functions.",
                    "Composing monads using coproducts.",
                    "Interactive visual functional programming.",
                    "Typing dynamic typing.",
                    "A theory of overloading.",
                    "Type classes with more higher-order polymorphism.",
                    "An expressive, scalable type theory for certified code.",
                    "Meta-programming with names and necessity.",
                    "Tagless staged interpreters for typed languages.",
                    "There and back again.",
                    "A compiled implementation of strong reduction.",
                    "An experimental study of renewal-older-first garbage collection.",
                    "Compiling scheme to JVM bytecode: : a performance study.",
                    "Final shift for call/cc: : direct implementation of shift and reset.",
                    "Program generation, termination, and binding-time analysis."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "6th ICFP 2001",
        "info": "Firenze (Florence), Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2001",
                "sub_name": "Proceedings of the Sixth ACM SIGPLAN International Conference on Functional Programming (ICFP '01), Firenze (Florence), Italy, September 3-5, 2001.",
                "count": 24,
                "papers": [
                    "A Fresh Approach to Representing Syntax with Static Binders in Functional Programming.",
                    "Contification Using Dominators.",
                    "Functioning without Closure: Type-Safe Customized Function Representations for Standard ML.",
                    "Optimizing Pattern Matching.",
                    "Down with Emacs Lisp: Dynamic Scope Analysis.",
                    "Recursive Structures for Standard ML.",
                    "Type-Based Hot Swapping of Running Modules.",
                    "Macros as Multi-Stage Computations: Type-Safe, Generative, Binding Macros in MacroML.",
                    "Generic Unification via Two-Level Types and Parameterized Modules.",
                    "Generic Validation of Structural Content with Parametric Modules.",
                    "A Simple Implementation Technique for Priority Search Queues.",
                    "Developing a Stage Lighting System from Scratch.",
                    "Charting Patterns on Price History.",
                    "Real-Time FRP.",
                    "Events in Haskell, and How to Implement Them.",
                    "A Dependently Typed Assembly Language.",
                    "On Regions and Linear Types.",
                    "Compositional Explanation of Types and Algorithmic Debugging of Type Errors.",
                    "Functional Array Fusion.",
                    "Automatic Generation of Staged Geometric Predicates.",
                    "A New Notation for Arrows.",
                    "Extensible Algebraic Datatypes with Defaults.",
                    "Cost Recurrences for DML Programs.",
                    "Possibilities and Limitations of Call-by-Need Space Improvement."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "5th ICFP 2000",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/2000",
                "sub_name": "Proceedings of the Fifth ACM SIGPLAN International Conference on Functional Programming (ICFP '00), Montreal, Canada, September 18-21, 2000.",
                "count": 27,
                "papers": [
                    "The functional guts of the Kleisli query system.",
                    "Regular expression types for XML.",
                    "The influence of browsers on evaluators or, continuations to program web servers.",
                    "Static enforcement of security with types.",
                    "Information flow inference for free.",
                    "Type-safe cast: functional pearl.",
                    "Typed compilation of inclusive subtyping.",
                    "Fully reflexive intensional type analysis.",
                    "More types for nested data parallel programming.",
                    "FranTk - a declarative GUI language for Haskell.",
                    "Functional programming in C++.",
                    "Advanced module systems: a guide for the perplexed (abstract of invited talk).",
                    "Breadth-first numbering: lessons from a small exercise in algorithm design.",
                    "Make it practical: a generic linear-time algorithm for solving maximum-weightsum problems.",
                    "Cheap eagerness: speculative evaluation in a lazy functional language.",
                    "An operational semantics for parallel lazy evaluation.",
                    "Recursive monadic bindings.",
                    "Deriving backtracking monad transformers.",
                    "Intersection types and computational effects.",
                    "Syntactic accidents in program analysis: on the impact of the CPS transformation.",
                    "Recursive subtyping revealed: functional pearl.",
                    "The duality of computation.",
                    "Combining functional programming and hardware verification (abstract of invited talk).",
                    "Understanding memory allocation of scheme programs.",
                    "Non-stop Haskell.",
                    "QuickCheck: a lightweight tool for random testing of Haskell programs.",
                    "Composing contracts: an adventure in financial engineering, functional pearl."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "4th ICFP 1999",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/1999",
                "sub_name": "Proceedings of the fourth ACM SIGPLAN International Conference on Functional Programming (ICFP '99), Paris, France, September 27-29, 1999.",
                "count": 25,
                "papers": [
                    "When is a Functional Program Not a Functional Program?",
                    "Monadic Encapsulation in ML.",
                    "Trampolined Style.",
                    "From Fast Exponentiation to Square Matrices: An Adventure in Types.",
                    "Tracing Piece by Piece: Affordable Debugging for Lazy Functional Languages.",
                    "Atomic Heap Transactions and Fine-grain Interrupts.",
                    "On Embedding a Microarchitectural Design Language within Haskell.",
                    "Recursion and Dynamic Data-structures in Bounded Space: Towards Embedded ML Programming.",
                    "A Simple Proof Technique for Certain Parametricity Results.",
                    "Relating Typability and Expressiveness in Finite-Rank Intersection Type Systems (Extended Abstract).",
                    "Type Fixpoints: Iteration vs. Recursion.",
                    "Calling Hell From Heaven and Heaven From Hell.",
                    "Interlanguage Working Without Tears: Blending SML with Java.",
                    "Programming Languages as Operating Systems (or Revenge of the Son of the Lisp Machine).",
                    "Haskell and XML: Generic Combinators or Type-Based Translation?",
                    "Type Inference with Rank 1 Polymorphism for Type-Directed Compilation of ML.",
                    "Type Dispatch for Named Hierarchical Types.",
                    "Representing Java Classes in a Typed Intermediate Language.",
                    "Principals in Programming Languages: A Syntactic Proof Technique.",
                    "Static Interpretation of Modules.",
                    "Transparent Modules with Fully Syntactic Signatures.",
                    "Flexible Type Analysis.",
                    "Type Inference Builds a Short Cut to Deforestation.",
                    "Verification of Erlang Programs using Abstract Interpretation and Model Mhecking.",
                    "Specialization of Inductively Sequential Functional Logic Programs."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "3rd ICFP 1998",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/1998",
                "sub_name": "Proceedings of the third ACM SIGPLAN International Conference on Functional Programming (ICFP '98), Baltimore, Maryland, USA, September 27-29, 1998.",
                "count": 46,
                "papers": [
                    "On the Runtime Complexity of Type-Directed Unboxing.",
                    "Building Program Optimizers with Rewriting Strategies.",
                    "Higher-Order Arity Raising.",
                    "A Type Based Sharing Analysis for Update Avoidance and Optimisation.",
                    "Taming Effects with Monadic Typing.",
                    "The Marriage of Effects and Monads.",
                    "A Theory of Core Fudgets.",
                    "PLAN: A Packet Language for Active Networks.",
                    "Modular Object-Oriented Programming with Units and Mixins.",
                    "Programming with Variable Functions.",
                    "YALE: Yet Another Lambda Evaluator Based on Interaction Nets.",
                    "Compiling Standard ML to Java Bytecodes.",
                    "Typed Cross-Module Compilation.",
                    "H/Direct: A Binary Foreign Language Interface for Haskell.",
                    "The Spineless Tagless G-machine, naturally.",
                    "Lava: Hardware Design in Haskell.",
                    "Lazy Computation with Exact Real Numbers.",
                    "Functional Differentiation of Computer Programs.",
                    "A Distributed Garbage Collector with Diffusion Tree Reorganisation and Mobile Objects.",
                    "Pragmatic Subtyping in Polymorphic Languages.",
                    "A Framework for Type Inference with Subtyping.",
                    "Cayenne - a Language with Dependent Types.",
                    "Recycling Continuations.",
                    "Imperative Streams - A Monadic Combinator Library for Synchronous Programming.",
                    "The Under-Appreciated Unfold.",
                    "Fold and Unfold for Program Semantics.",
                    "Encoding Types in ML-Like Languages.",
                    "Intensional Polymorphism in Type-Erasure Semantics.",
                    "Implementing Typed Intermediate Languages.",
                    "A Non-Deterministic Call-by-Need Lambda Calculus.",
                    "LAND*: an AND with local bindings, a guarded LET* special form.",
                    "Functional Style in C++: Closures, Late Binding, and Lambda Abstractions.",
                    "Type Errors Confuse the Programmer (Poster Abstract).",
                    "Controlled Temporal Non-Determinism for Reasoning with a Machine of Finite Speed.",
                    "Verbose Typing.",
                    "On Application of Self-Similar Pictures in Education.",
                    "MAP: A Functional Analysis and Design Method.",
                    "A Delegation Language to Request Weather Products and a Scheme of Its Interpretation.",
                    "A Structured Approach to Retrieving Functions by Types.",
                    "Frob - Functional Robotics.",
                    "A Functional Programming Approach to Hypermedia Authoring.",
                    "A Term Calculus for Unitary Approach to Nomalization.",
                    "Implementing Design Patterns as Language Constructs.",
                    "A Lazy CGI Namespace in Scheme.",
                    "Automating Derivation of Incremental Programs.",
                    "Combining CFG and Recursive Functions to Get a New Language."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "2nd ICFP 1997",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/1997",
                "sub_name": "Proceedings of the 1997 ACM SIGPLAN International Conference on Functional Programming (ICFP '97), Amsterdam, The Netherlands, June 9-11, 1997.",
                "count": 42,
                "papers": [
                    "A Modular, Polyvariant, and Type-Based Closure Analysis.",
                    "Strongly Typed Flow-Directed Representation Transformations.",
                    "Type-Driven Defunctionalization.",
                    "Systematic Realisation of Control Flow Analyses for CML.",
                    "Functional Programming with Graphs.",
                    "Catenable Double-Ended Queues.",
                    "Statically Checkable Pattern Abstractions.",
                    "Flexible Representation Analysis.",
                    "The Effectiveness of Flow Analysis for Inlining.",
                    "Lambda-Splitting: A Higher-Order Approach to Cross-Module Optimizations.",
                    "Foundations for the Implementation of Higher-Order Subtyping.",
                    "A Practical Subtyping System For Erlang.",
                    "On the Complexity of Set-Based Analysis.",
                    "Tupling Calculation Eliminates Multiple Data Traversals.",
                    "A Bounds Inference Method for Vector-Based Memoisation.",
                    "on Global Dynamics of Optimal Graph Reduction.",
                    "The Development of Erlang.",
                    "Type Specialization for Imperative Languages.",
                    "Compositional References for Stateful Functional Programming.",
                    "Monadic State: Axiomatization and Type Safety.",
                    "Implementing Bit-addressing with Specialization.",
                    "Structuring Graphical Paradigms in TkGofer.",
                    "Functional Reactive Animation.",
                    "Automatic Management of Operating System Resources.",
                    "Formal Models of Distributed Memory Management.",
                    "The Measured Cost of Copying Garbage Collection Mechanisms.",
                    "A GUI on Top of a Functional Language.",
                    "Graphs in Compilation.",
                    "Disposable Memo Functions (Extended Abstract).",
                    "Affordable Dynamic Types.",
                    "Functional Programming and Attribute Grammars Deforestation.",
                    "Protien Folding meets Functional Programming.",
                    "Modelling String Folding with G2L Grammars.",
                    "A Functional Macro Expansion System for Optimizing Code Generation: Gaining Context-Sensitivity without Losing Confluence.",
                    "BigTypes in ML.",
                    "Synthesis of Functions by Transformations and Constraints.",
                    "Intensional Sets Using Explicit Substitutions.",
                    "Simple Semantic Analysis Problems for Functional Programs.",
                    "Distributed Programming, a Purely Functional Approach.",
                    "Multi-Stage Programming.",
                    "Lambda-Flow: A Parallel Functional Synchronous Dataflow Language.",
                    "Inductive Synthesis of Recursive Functional Programs (Poster Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "1st ICFP 1996",
        "info": "Philadelphia, Pennsylvania",
        "venues": [
            {
                "sub_name_abbr": "conf/icfp/1996",
                "sub_name": "Proceedings of the 1996 ACM SIGPLAN International Conference on Functional Programming, ICFP 1996, Philadelphia, Pennsylvania, USA, May 24-26, 1996.",
                "count": 25,
                "papers": [
                    "Let-floating: Moving Bindings to Give Faster Programs.",
                    "A Reflection on Call-by-Value.",
                    "Functional Back-Ends within the Lambda-Sigma Calculus.",
                    "Lag, Drag, Void and Use - Heap Profiling and Space-Efficient Compilation Revisited.",
                    "Static and Dynamic Partitioning of Pointers as Links and Threads.",
                    "Storage Use Analysis and its Applications.",
                    "The Role of Lazy Evaluation in Amortized Data Structures.",
                    "Deriving Structural Hylomorphisms From Recursive Definitions.",
                    "Analysis and Caching of Dependencies.",
                    "Optimality and Inefficiency: What Isn't a Cost Model of the Lambda Calculus?",
                    "Inductive, Coinductive, and Pointed Types.",
                    "A New Look to Pattern Matching in Abstract Data Types.",
                    "Simplifying Subtyping Constraints.",
                    "Complexity of Kernel Fun Subtype Checking.",
                    "The Semantics of Scheme with Future.",
                    "First-Class Synchronization Barriers.",
                    "pHluid: The Design of a Parallel Functional Language Implementation on Workstations.",
                    "Cogen in Six Lines.",
                    "A Probabilistic Approach to the Problem of Automatic Selection of Data Representations.",
                    "A Theory of Weak Bisimulation for Core CML.",
                    "A Provable Time and Space Efficient Implementation of NESL.",
                    "Synchronous Kahn Networks.",
                    "Enriching the Lambda Calculus with Contexts: Toward a Theory of Incremental Program Construction.",
                    "Sharing Code through First-class Environments.",
                    "Mixin Modules."
                ]
            }
        ]
    }
]