[
    {
        "year": "2021",
        "name": "19th ICSOC 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2021",
                "sub_name": "Service-Oriented Computing - 19th International Conference, ICSOC 2021, Virtual Event, November 22-25, 2021, Proceedings.",
                "count": 67,
                "papers": [
                    "Assessing the Impact of Context Data on Process Outcomes During Runtime.",
                    "DeepProcess: Supporting Business Process Execution Using a MANN-Based Recommender System.",
                    "Interval-Based Remaining Time Prediction for Business Processes.",
                    "Evaluating Stability of Post-hoc Explanations for Business Process Predictions.",
                    "Interactive Segmentation of User Interface Logs.",
                    "Trustworthy Cross-Organizational Collaborations with Hybrid On/Off-Chain Declarative Choreographies.",
                    "Blockchain-Based Result Verification for Computation Offloading.",
                    "Model Checking of Solidity Smart Contracts Adopted for Business Processes.",
                    "Trustworthy Pre-processing of Sensor Data in Data On-Chaining Workflows for Blockchain-Based IoT Applications.",
                    "Formalising Solutions to REST API Practices as Design (Anti)Patterns.",
                    "Are Developers Equally Concerned About Making Their APIs RESTful and the Linguistic Quality? A Study on Google APIs.",
                    "Evaluating and Improving Microservice Architecture Conformance to Architectural Design Decisions.",
                    "ThunQ: A Distributed and Deep Authorization Middleware for Early and Lazy Policy Enforcement in Microservice Applications.",
                    "Boreas - A Service Scheduler for Optimal Kubernetes Deployment.",
                    "Resource Management for TensorFlow Inference.",
                    "Representation Learning Based Query Decomposition for Batch Shortest Path Processing in Road Networks.",
                    "An Adaptive Charging Scheduling for Electric Vehicles Using Multiagent Reinforcement Learning.",
                    "Locating False Data Injection Attacks on Smart Grids Using D-FACTS Devices.",
                    "Privacy-Preserving Worker Recruitment Under Variety Requirement in Spatial Crowdsourcing.",
                    "T2L2: A Tiny Three Linear Layers Model for Service Mashup Creation.",
                    "Energy-Aware Placement of Device-to-Device Mediation Services in IoT Systems.",
                    "Fairness-Aware Crowdsourcing of IoT Energy Services.",
                    "Dynamic Conflict Resolution of IoT Services in Smart Homes.",
                    "Migration-Based Service Allocation Optimization in Dynamic IoT Networks.",
                    "Automated Paraphrase Generation with Over-Generation and Pruning Services.",
                    "Privacy-Aware Identity Cloning Detection Based on Deep Forest.",
                    "Multiple Agents Reinforcement Learning Based Influence Maximization in Social Network Services.",
                    "On the Scalability of Compositions of Service-Oriented Applications.",
                    "ServiceBERT: A Pre-trained Model for Web Service Tagging and Recommendation.",
                    "Top-k Dynamic Service Composition in Skyway Networks.",
                    "Graph-Based Data Deduplication in Mobile Edge Computing Environment.",
                    "IaaS Signature Change Detection with Performance Noise.",
                    "WattEdge: A Holistic Approach for Empirical Energy Measurements in Edge Computing.",
                    "Improving Load Balancing for Modern Data Centers Through Resource Equivalence Classes.",
                    "Computation Offloading and Resource Management for Energy and Cost Trade-Offs with Deep Reinforcement Learning in Mobile Edge Computing.",
                    "Deep Reinforcement Learning Based Task Offloading Strategy Under Dynamic Pricing in Edge Computing.",
                    "BRIBOT: Towards a Service-Based Methodology for Bridging Business Processes and IoT Big Data.",
                    "Cross-Silo Process Mining with Federated Learning.",
                    "Application-Platform Co-design for Serverless Data Processing.",
                    "A Reinforcement Learning Approach for Re-allocating Drone Swarm Services.",
                    "TAGen: Generating Trigger-Action Rules for Smart Homes by Mining Event Traces.",
                    "Joint Optimization of UAV Trajectory and Task Scheduling in SAGIN: Delay Driven.",
                    "Weaving Open Services with Runtime Models for Continuous Smart Cities KPIs Assessment.",
                    "A Structure Alignment Deep Graph Model for Mashup Recommendation.",
                    "CSSR: A Context-Aware Sequential Software Service Recommendation Model.",
                    "LogLAB: Attention-Based Labeling of Log Data Anomalies via Weak Supervision.",
                    "LogDP: Combining Dependency and Proximity for Log-Based Anomaly Detection.",
                    "MMA-Net: A MultiModal-Attention-Based Deep Neural Network for Web Services Classification.",
                    "Incentive Mechanism for Spatial Crowdsourcing Cooperation: A Fair Revenue Allocation Method.",
                    "Sprelog: Log-Based Anomaly Detection with Self-matching Networks and Pre-trained Models.",
                    "Service Allocation/Placement in Multi-Access Edge Computing with Workload Fluctuations.",
                    "Location-Aware and Budget-Constrained Service Brokering in Multi-Cloud via Deep Reinforcement Learning.",
                    "Edge Node Placement with Minimum Costs: When User Tolerance on Service Delay Matters.",
                    "Prediction-Awareness Edge User Allocating in Edge Based Intelligent Video Systems Driven by Priority.",
                    "Service Deployment with Predictive Ability for Data Stream Processing in a Cloud-Edge Environment.",
                    "A Reinforcement Learning-Based Service Model for the Internet of Things.",
                    "Evaluating the Security of Machine Learning Based IoT Device Identification Systems Against Adversarial Examples.",
                    "DeepPatterns: Predicting Mobile Apps Usage from Spatio-Temporal and Contextual Features.",
                    "KOSMOS: Vertical and Horizontal Resource Autoscaling for Kubernetes.",
                    "Pangaea: Semi-automated Monolith Decomposition into Microservices.",
                    "Vertical Scaling of Resource for OpenMP Application.",
                    "A Decision Model for Selecting Patterns and Strategies to Decompose Applications into Microservices.",
                    "API-PROGRAM: An API Package Recommendation Model Based on the Graph Representation Learning Method.",
                    "H-STREAM: Composing Microservices for Enacting Stream and Histories Analytics Pipelines.",
                    "KG2Code: Correct Code Examples Mining Service Based on Knowledge Graph for Fixing API Misuses.",
                    "An Embedded Representation Learning of Relational Clinical Codes.",
                    "An Attention-Based Forecasting Network for Intelligent Services in Manufacturing."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "18th ICSOC 2020",
        "info": "Dubai, United Arab Emirates",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2020",
                "sub_name": "Service-Oriented Computing - 18th International Conference, ICSOC 2020, Dubai, United Arab Emirates, December 14-17, 2020, Proceedings.",
                "count": 42,
                "papers": [
                    "Optimal Evolution Planning and Execution for Multi-version Coexisting Microservice Systems.",
                    "Topology-Aware Continuous Experimentation in Microservice-Based Applications.",
                    "Charting Microservices to Support Services' Developers: The Anaximander Approach.",
                    "Fast Replica of Polyglot Persistence in Microservice Architectures for Fog Computing.",
                    "On Discovering Data Preparation Modules Using Examples.",
                    "Accelerate Personalized IoT Service Provision by Cloud-Aided Edge Reinforcement Learning: A Case Study on Smart Lighting.",
                    "A Game-Based Secure Trading of Big Data and IoT Services: Blockchain as a Two-Sided Market.",
                    "A Dynamic Cost Model to Minimize Energy Consumption and Processing Time for IoT Tasks in a Mobile Edge Computing Environment.",
                    "Automated SLA Negotiation in a Dynamic IoT Environment - A Metaheuristic Approach.",
                    "PATRIoT: A Data Sharing Platform for IoT Using a Service-Oriented Approach Based on Blockchain.",
                    "Energy Minimization for Cloud Services with Stochastic Requests.",
                    "Scalable Joint Optimization of Placement and Parallelism of Data Stream Processing Applications on Cloud-Edge Infrastructure.",
                    "Impact of Service- and Cloud-Based Dynamic Routing Architectures on System Reliability.",
                    "Pricing in the Competing Auction-Based Cloud Market: A Multi-agent Deep Deterministic Policy Gradient Approach.",
                    "Dynamic Edge User Allocation with User Specified QoS Preferences.",
                    "Fault-Tolerating Edge Computing with Server Redundancy Based on a Variant of Group Degree Centrality.",
                    "TD-EUA: Task-Decomposable Edge User Allocation with QoE Optimization.",
                    "A Decentralized Reactive Approach to Online Task Offloading in Mobile Edge Computing Environments.",
                    "Mobility-Aware Service Placement for Vehicular Users in Edge-Cloud Environment.",
                    "Feature Model-Guided Online Reinforcement Learning for Self-Adaptive Services.",
                    "FAST: A Fairness Assured Service Recommendation Strategy Considering Service Capacity Constraint.",
                    "Real-Time Automatic Configuration Tuning for Smart Manufacturing with Federated Deep Learning.",
                    "A Trust and Energy-Aware Double Deep Reinforcement Learning Scheduling Strategy for Federated Learning on IoT Devices.",
                    "A Spectrum of Entropy-Based Precision and Recall Measurements Between Partially Matching Designed and Observed Processes.",
                    "A Knowledge Graph Based Approach for Mobile Application Recommendation.",
                    "ICS-Assist: Intelligent Customer Inquiry Resolution Recommendation in Online Customer Service for Large E-Commerce Businesses.",
                    "Detecting User Significant Intention via Sentiment-Preference Correlation Analysis for Continuous App Improvement.",
                    "Fine-Grained Task Distribution for Mobile Sensor Networks with Agent Cooperation Relationship.",
                    "Allocation Priority Policies for Serverless Function-Execution Scheduling Optimisation.",
                    "Adaptive Recollected RNN for Workload Forecasting in Database-as-a-Service.",
                    "Exploring Interpretability for Predictive Process Analytics.",
                    "Designing Optimal Robotic Process Automation Architectures.",
                    "RESTest: Black-Box Constraint-Based Testing of RESTful Web APIs.",
                    "A Type-Sensitive Service Identification Approach for Legacy-to-SOA Migration.",
                    "Automated Quality Assessment of Incident Tickets for Smart Service Continuity.",
                    "API-Prefer: An API Package Recommender System Based on Composition Feature Learning.",
                    "Tail-Latency-Aware Fog Application Replica Placement.",
                    "Two-Sided Matching Scheduling Using Multi-Level Look-Ahead Queue of Supply and Demand.",
                    "A Practice-Oriented, Control-Flow-Based Anomaly Detection Approach for Internal Process Audits.",
                    "Latest Image Recommendation Method for Automatic Base Image Update in Dockerfile.",
                    "Online Topic Modeling for Short Texts.",
                    "Metrics for Assessing Architecture Conformance to Microservice Architecture Patterns and Practices."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2020w",
                "sub_name": "Service-Oriented Computing - ICSOC 2020 Workshops - AIOps, CFTIC, STRAPS, AI-PA, AI-IOTS, and Satellite Events, Dubai, United Arab Emirates, December 14-17, 2020, Proceedings.",
                "count": 55,
                "papers": [
                    "Staking Assets Management on Blockchains: Vision and Roadmap.",
                    "Hybrid Context-Aware Method for Quality Assessment of Data Streams.",
                    "Container-Based Network Architecture for Mobility, Energy and Security Management as a Service in IoT Environments.",
                    "Towards a Rule-Based Recommendation Approach for Business Process Modeling.",
                    "Towards a Privacy Conserved and Linked Open Data Based Device Recommendation in IoT.",
                    "Learning Performance Models Automatically.",
                    "Blockchain-Based Business Processes: A Solidity-to-CPN Formal Verification Approach.",
                    "Formal Quality of Service Analysis in the Service Selection Problem.",
                    "A Crowdsourcing-Based Knowledge Graph Construction Platform.",
                    "Data Interaction for IoT-Aware Wearable Process Management.",
                    "SiDD: The Situation-Aware Distributed Deployment System.",
                    "AuraEN: Autonomous Resource Allocation for Cloud-Hosted Data Processing Pipelines.",
                    "Performance Diagnosis in Cloud Microservices Using Deep Learning.",
                    "Anomaly Detection at Scale: The Case for Deep Distributional Time Series Models.",
                    "A Systematic Mapping Study in AIOps.",
                    "An Influence-Based Approach for Root Cause Alarm Discovery in Telecom Networks.",
                    "Localization of Operational Faults in Cloud Applications by Mining Causal Dependencies in Logs Using Golden Signals.",
                    "Using Language Models to Pre-train Features for Optimizing Information Technology Operations Management Tasks.",
                    "Towards Runtime Verification via Event Stream Processing in Cloud Computing Infrastructures.",
                    "Decentralized Federated Learning Preserves Model and Data Privacy.",
                    "Online Memory Leak Detection in the Cloud-Based Infrastructures.",
                    "Multi-source Anomaly Detection in Distributed IT Systems.",
                    "TELESTO: A Graph Neural Network Model for Anomaly Classification in Cloud Services.",
                    "Discovering Alarm Correlation Rules for Network Fault Management.",
                    "Resource Sharing in Public Cloud System with Evolutionary Multi-agent Artificial Swarm Intelligence.",
                    "SLMAD: Statistical Learning-Based Metric Anomaly Detection.",
                    "Software Reliability Engineering for Resilient Cloud Operations.",
                    "The Future of Robotic Process Automation (RPA).",
                    "Adaptive Summaries: A Personalized Concept-Based Summarization Approach by Learning from Users' Feedback.",
                    "TAP: A Two-Level Trust and Personality-Aware Recommender System.",
                    "Am I Rare? an Intelligent Summarization Approach for Identifying Hidden Anomalies.",
                    "On How Cognitive Computing Will Plan Your Next Systematic Review.",
                    "Security Professional Skills Representation in Bug Bounty Programs and Processes.",
                    "Stage-Based Process Performance Analysis.",
                    "AudioLens: Audio-Aware Video Recommendation for Mitigating New Item Problem.",
                    "Scalable Online Conformance Checking Using Incremental Prefix-Alignment Computation.",
                    "Bringing Cognitive Augmentation to Web Browsing Accessibility.",
                    "Towards Knowledge-Driven Automatic Service Composition for Wildfire Prediction.",
                    "Eyewitness Prediction During Crisis via Linguistic Features.",
                    "On the Definition of Data Regulation Risk.",
                    "Classifying Micro-text Document Datasets: Application to Query Expansion of Crisis-Related Tweets.",
                    "Data Centered and Usage-Based Security Service.",
                    "XYZ Monitor: IoT Monitoring of Infrastructures Using Microservices.",
                    "Multi-cloud Solution Design for Migrating a Portfolio of Applications to the Cloud.",
                    "Higher Order Statistical Analysis in Multiresolution Domain - Application to Breast Cancer Histopathology.",
                    "Ontology Evolution Using Recoverable SQL Logs.",
                    "A Novel Automated System for Hospital Acquired Infection Monitoring and Prevention.",
                    "A Novel Approach for Detecting IoT Botnet Using Balanced Network Traffic Attributes.",
                    "KMeans Kernel-Learning Based AI-IoT Framework for Plant Leaf Disease Detection.",
                    "System for Monitoring and Control of Vehicle's Carbon Emissions Using Embedded Hardwares and Cloud Applications.",
                    "An Information Retrieval-Based Approach to Activity Recognition in Smart Homes.",
                    "Botnet Sizes: When Maths Meet Myths.",
                    "Cyber Security Education and Future Provision.",
                    "Efficient Threat Hunting Methodology for Analyzing Malicious Binaries in Windows Platform.",
                    "Peer-to-Peer Application Threat Investigation."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th ICSOC 2019",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2019",
                "sub_name": "Service-Oriented Computing - 17th International Conference, ICSOC 2019, Toulouse, France, October 28-31, 2019, Proceedings.",
                "count": 42,
                "papers": [
                    "An Empirical Study of GraphQL Schemas.",
                    "Automating SLA-Driven API Development with SLA4OAI.",
                    "On Observability and Monitoring of Distributed Systems - An Industry Interview Study.",
                    "Integrating Geographical and Functional Relevance to Implicit Data for Web Service Recommendation.",
                    "Towards Automated Microservices Extraction Using Muti-objective Evolutionary Search.",
                    "Towards Automated Planning for Enterprise Services: Opportunities and Challenges.",
                    "A Model for Distributed Service Level Agreement Negotiation in Internet of Things.",
                    "Edge User Allocation with Dynamic Quality of Service.",
                    "Automatic Business Process Model Extension to Repair Constraint Violations.",
                    "N2TM: A New Node to Trust Matrix Method for Spam Worker Defense in Crowdsourcing Environments.",
                    "QoS Value Prediction Using a Combination of Filtering Method and Neural Network Regression.",
                    "Harmonia: A Continuous Service Monitoring Framework Using DevOps and Service Mesh in a Complementary Manner.",
                    "ESDA: An Energy-Saving Data Analytics Fog Service Platform.",
                    "Leveraging AI in Service Automation Modeling: From Classical AI Through Deep Learning to Combination Models.",
                    "A Wearable Machine Learning Solution for Internet Traffic Classification in Satellite Communications.",
                    "FAME: An Influencer Model for Service-Oriented Environments.",
                    "Latency-Aware Deployment of IoT Services in a Cloud-Edge Environment.",
                    "Trusted Data Integration in Service Environments: A Systematic Mapping.",
                    "CSI2: Cloud Server Idleness Identification by Advanced Machine Learning in Theories and Practice.",
                    "An Energy Efficient and Interference Aware Virtual Machine Consolidation Algorithm Using Workload Classification.",
                    "Thread-Level CPU and Memory Usage Control of Custom Code in Multi-tenant SaaS.",
                    "Optimized Application Deployment in the Fog.",
                    "Toward Cost Efficient Cloud Bursting.",
                    "Optimized Renewable Energy Use in Green Cloud Data Centers.",
                    "Operating Enterprise AI as a Service.",
                    "Towards Automated Patch Management in a Hybrid Cloud.",
                    "QCF: QoS-Aware Communication Framework for Real-Time IoT Services.",
                    "Constraint-Aware Drone-as-a-Service Composition.",
                    "An Adaptive Monitoring Service Exploiting Data Correlations in Fog Computing.",
                    "The Circuit Breaker Pattern Targeted to Future IoT Applications.",
                    "A Catalogue of Inter-parameter Dependencies in RESTful Web APIs.",
                    "Simplification of Complex Process Models by Abstracting Infrequent Behaviour.",
                    "Improving IT Support by Enhancing Incident Management Process with Multi-modal Analysis.",
                    "A Recommendation of Crowdsourcing Workers Based on Multi-community Collaboration.",
                    "Analysis of Resource Allocation of BPMN Processes.",
                    "Joint Operator Scaling and Placement for Distributed Stream Processing Applications in Edge Computing.",
                    "Graph-Based Optimal Data Caching in Edge Computing.",
                    "Load-Aware Edge Server Placement for Mobile Edge Computing in 5G Networks.",
                    "PAPS: A Framework for Decentralized Self-management at the Edge.",
                    "Measuring the Fog, Gently.",
                    "Mobile Apps with Dynamic Bindings Between the Fog and the Cloud.",
                    "Re-deploying Microservices in Edge and Cloud Environment for the Optimization of User-Perceived Service Quality."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2019w",
                "sub_name": "Service-Oriented Computing - ICSOC 2019 Workshops - WESOACS, ASOCA, ISYCC, TBCE, and STRAPS, Toulouse, France, October 28-31, 2019, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "Service-Oriented Pervasive Platform Supporting Machine Learning Applications in Smart Buildings.",
                    "Freshening the Air in Microservices: Resolving Architectural Smells via Refactoring.",
                    "Specifying Web Interfaces for Command-Line Applications Based on OpenAPI.",
                    "Towards Understanding Adaptation Latency in Self-adaptive Systems.",
                    "Representing Multicloud Security and Privacy Policies and Detecting Potential Problems.",
                    "Survey and Evaluation of Blue-Green Deployment Techniques in Cloud Native Environments.",
                    "AutoCADep: An Approach for Automatic Cloud Application Deployment.",
                    "Microservices Management on Cloud/Edge Environments.",
                    "Towards Geo-Context Aware IoT Data Distribution.",
                    "A Blockchain Based Solution for Securing Data of IoT Devices.",
                    "Toward GDPR Compliance in IoT Systems.",
                    "A Reconfigurable Microservice-Based Migration Technique for IoT Systems.",
                    "Towards the Creation of Be In/Be Out Model for Smart City with the Use of Internet of Things Concepts.",
                    "Ontology for Smart Viticulture: Integrating Inference Rules Based on Sensor Data.",
                    "Model-Driven Engineering for Multi-party Interactions on a Blockchain - An Example.",
                    "Smart Contract Locator (SCL) and Smart Contract Description Language (SCDL).",
                    "Measuring the Quality of Life in \"La Condesa\" - Activating Mexico City Neighbourhood Economy While Maximising Well-Being.",
                    "Adaptive Agent-Based Architecture for Health Data Integration.",
                    "Constructing a Secured, Reactive and Scalable Data Platform for a Better Exploitation of Rich Data Assets in the Tourism Industry.",
                    "Towards Multi-level Trust-Driven Data Integration in Multi-cloud Environments.",
                    "User-Oriented Description of Emerging Services in Ambient Systems.",
                    "A Web-Component-Based Cross-Platform Mobile Application Development Environment for Ordinary Users.",
                    "OSPAci: Online Sentiment-Preference Analysis of User Reviews for Continues App Improvement.",
                    "ADS4all: Democratizing Authenticated Data Structures.",
                    "ProMoEE - A Lightweight Web Editor Supporting Study Research on Process Models.",
                    "The EDMM Modeling and Transformation System.",
                    "BlockMeds: A Blockchain-Based Online Prescription System with Privacy Protection.",
                    "Janus: A Tool to Modernize Legacy Applications to Containers.",
                    "A Programming Framework for People as a Service."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th ICSOC 2018",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2018",
                "sub_name": "Service-Oriented Computing - 16th International Conference, ICSOC 2018, Hangzhou, China, November 12-15, 2018, Proceedings.",
                "count": 63,
                "papers": [
                    "Microscope: Pinpoint Performance Issues with Causal Graphs in Micro-service Environments.",
                    "Architecture-Based Automated Updates of Distributed Microservices.",
                    "Function-Splitting Heuristics for Discovery of Microservices in Enterprise Systems.",
                    "High Performance Userspace Networking for Containerized Microservices.",
                    "Guiding Architectural Decision Making on Quality Aspects in Microservice APIs.",
                    "Adaptive Temporal Verification and Violation Handling for Time-Constrained Business Cloud Workflows.",
                    "Towards Creating Business Process Models from Images.",
                    "Empowering Business-Level Blockchain Users with a Rules Framework for Smart Contracts.",
                    "Context-Aware Trustworthy Service Evaluation in Social Internet of Things.",
                    "Cloudchain: A Blockchain-Based Coopetition Differential Game Model for Cloud Computing.",
                    "Prediction of Invoice Payment Status in Account Payable Business Process.",
                    "Explaining Non-compliance of Business Process Models Through Automated Planning.",
                    "A Genetic Algorithm for Cost-Aware Business Processes Execution in the Cloud.",
                    "Latency-Aware Placement of Data Stream Analytics on Edge Computing.",
                    "Optimal Edge User Allocation in Edge Computing with Variable Sized Vector Bin Packing.",
                    "RA-FSD: A Rate-Adaptive Fog Service Delivery Platform.",
                    "A Service-Based Declarative Approach for Capturing Events from Multiple Sensor Streams.",
                    "Response Time Aware Operator Placement for Complex Event Processing in Edge Computing.",
                    "Enacting Emergent Configurations in the IoT Through Domain Objects.",
                    "Energy-Delay Co-optimization of Resource Allocation for Robotic Services in Cloudlet Infrastructure.",
                    "Services in IoT: A Service Planning Model Based on Consumer Feedback.",
                    "Crowdsourcing Task Scheduling in Mobile Social Networks.",
                    "Cognitive System to Achieve Human-Level Accuracy in Automated Assignment of Helpdesk Email Tickets.",
                    "Crowdsourcing Energy as a Service.",
                    "Social-Sensor Composition for Scene Analysis.",
                    "QITA: Quality Inference Based Task Assignment in Mobile Crowdsensing.",
                    "Expert Recommendation via Tensor Factorization with Regularizing Hierarchical Topical Relationships.",
                    "Software Service Recommendation Base on Collaborative Filtering Neural Network Model.",
                    "A Weighted Meta-graph Based Approach for Mobile Application Recommendation on Heterogeneous Information Networks.",
                    "Temporal-Sparsity Aware Service Recommendation Method via Hybrid Collaborative Filtering Techniques.",
                    "QoS-Aware Web Service Recommendation with Reinforced Collaborative Filtering.",
                    "Unit of Work Supporting Generative Scientific Workflow Recommendation.",
                    "Mobile Crowdsourced Sensors Selection for Journey Services.",
                    "RLRecommender: A Representation-Learning-Based Recommendation Method for Business Process Modeling.",
                    "Domain Knowledge Driven Key Term Extraction for IT Services.",
                    "An Adaptive Semi-local Algorithm for Node Ranking in Large Complex Networks.",
                    "User Location Prediction in Mobile Crowdsourcing Services.",
                    "Leveraging Regression Algorithms for Process Performance Predictions.",
                    "Using Machine Learning to Provide Differentiated Services in SDN-like Publish/Subscribe Systems for IoT.",
                    "Constraint-Based Model-Driven Testing of Web Services for Behavior Conformance.",
                    "QoS Optimization of Service Clouds Serving Pleasingly Parallel Jobs.",
                    "Estimating the Performance of Cloud-Based Systems Using Benchmarking and Simulation in a Complementary Manner.",
                    "Two-Phase Web Service QoS Prediction with Restricted Boltzmann Machine.",
                    "Constructing and Evaluating an Evolving Web-API Network for Service Discovery.",
                    "Stigmergic Service Composition and Adaptation in Mobile Environments.",
                    "State of the Practice in Service Identification for SOA Migration in Industry.",
                    "A Truthful Mechanism for Optimally Purchasing IaaS Instances and Scheduling Parallel Jobs in Service Clouds.",
                    "Convenience-Based Periodic Composition of IoT Services.",
                    "CrowdMashup: Recommending Crowdsourcing Teams for Mashup Development.",
                    "A Variation Aware Composition Model for Dynamic Web Service Environments.",
                    "A Model-Driven Framework for Automated Generation and Verification of Cloud Solutions from Requirements.",
                    "Healthcare Application Migration in Compliant Hybrid Clouds.",
                    "DAliM: Machine Learning Based Intelligent Lucky Money Determination for Large-Scale E-Commerce Businesses.",
                    "Service-Oriented Approach for Analytics in Industry 4.0.",
                    "eTOUR: A Two-Layer Framework for Tour Recommendation with Super-POIs.",
                    "Hierarchical Recursive Resource Sharing for Containerized Applications.",
                    "A Fuzzy-Based Auto-scaler for Web Applications in Cloud Computing Environments.",
                    "Runtime Monitoring in Continuous Deployment by Differencing Execution Behavior Model.",
                    "Leveraging Computational Reuse for Cost- and QoS-Efficient Task Scheduling in Clouds.",
                    "QKnober: A Knob-Based Fairness-Efficiency Scheduler for Cloud Computing with QoS Guarantees.",
                    "Energy-Efficient and Quality of Experience-Aware Resource Provisioning for Massively Multiplayer Online Games in the Cloud.",
                    "A Cost-Effective Deadline-Constrained Scheduling Strategy for a Hyperparameter Optimization Workflow for Machine Learning Algorithms.",
                    "Transparently Capturing Execution Path of Service/Job Request Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2018w",
                "sub_name": "Service-Oriented Computing - ICSOC 2018 Workshops - ADMS, ASOCA, ISYyCC, CloTS, DDBS, and NLS4IoT, Hangzhou, China, November 12-15, 2018, Revised Selected Papers.",
                "count": 49,
                "papers": [
                    "A Data-Driven Optimization Method for Reallocating the Free-Floating Bikes.",
                    "Study on Airport De-icing Schedule Problem Balancing Fairness and Efficiency.",
                    "Co-design of Business and IT Services - A Tool-Supported Approach.",
                    "Energy-Aware and Location-Constrained Virtual Network Embedding in Enterprise Network.",
                    "WeChat Red Envelops: Literature Review and Future Research Directions.",
                    "Research and Design of CMOS Fully Differential Telescopic Operational Amplifier with Common Mode Feedback.",
                    "Parallel Concatenated Network with Cross-layer Connections for Image Recognition.",
                    "Application of System Calls in Abnormal User Behavioral Detection in Social Networks.",
                    "Multi-branch Aggregate Convolutional Neural Network for Image Classification.",
                    "Remote Sensing Image Deblurring Algorithm Based on WGAN.",
                    "Text Classification Research Based on Improved Word2vec and CNN.",
                    "Retinal Image Registration Based on Bifurcation Point and SURF.",
                    "Augmented Reality in IoT.",
                    "The Tentative Research of Hydrological IoT Data Processing System Based on Apache Flink.",
                    "Runtime Service Composition Modification Supporting Situational Sensor Data Correlation.",
                    "A Dynamic Service Adaptation Algorithm for Seamless Integration of Cloud Infrastructure and Edge Devices.",
                    "A Cost-Effective Time-Constrained Multi-workflow Scheduling Strategy in Fog Computing.",
                    "A Brief Survey on IoT Privacy: Taxonomy, Issues and Future Trends.",
                    "Real-Time Estimation of Road Traffic Speeds from Cell-Based Vehicle Trajectories.",
                    "A Data Cleaning Service on Massive Spatio-Temporal Data in Highway Domain.",
                    "Tracking a Person's Behaviour in a Smart House.",
                    "An Efficient In-Memory R-Tree Construction Scheme for Spatio-Temporal Data Stream.",
                    "Dynamic Task Allocation for Data-Intensive Workflows in Cloud Environment.",
                    "A Data Dependency and Access Threshold Based Replication Strategy for Multi-cloud Workflow Applications.",
                    "Support Context-Adaptation in the Constrained Application Protocol (CoAP).",
                    "Fast Nearest-Neighbor Classification Using RNN in Domains with Large Number of Classes.",
                    "TaxiC: A Taxi Route Recommendation Method Based on Urban Traffic Charge Heat Map.",
                    "Event Log Reconstruction Using Autoencoders.",
                    "MLE: A General Multi-Layer Ensemble Framework for Group Recommendation.",
                    "Does Your Accurate Process Predictive Monitoring Model Give Reliable Predictions?",
                    "Service Negotiation in a Dynamic IoT Environment.",
                    "Towards Energy and Time Efficient Resource Allocation in IoT-Fog-Cloud Environment.",
                    "AppNet: A Large-Scale Multi-layer Heterogeneous Complex App Network for Intelligent Program Search.",
                    "A Goal-Driven Context-Aware Architecture for Distributing Cognitive Service Group.",
                    "Crossover Service Phenomenon Analysis Based on Event Evolutionary Graph.",
                    "Improved Architectures/Deployments with Elmo.",
                    "CEA: A Service for Cognitive Event Automation.",
                    "BluePlan: A Service for Automated Migration Plan Construction Using AI.",
                    "ELeCTRA: Induced Usage Limitations Calculation in RESTful APIs.",
                    "Offering Artificial Intelligence Development Situation Analysis Service for Users.",
                    "TReAT: A Tool for Analyzing Relations Between Tasks in a Process.",
                    "iCOP: IoT-Enabled Policing Processes.",
                    "iSheets: A Spreadsheet-Based Machine Learning Development Platform for Data-Driven Process Analytics.",
                    "SORCER: A Decentralised Continuous Integration Platform for Service-Oriented Software Systems.",
                    "On Anomaly Detection and Root Cause Analysis of Microservice Systems.",
                    "RESTalk Miner: Mining RESTful Conversations, Pattern Discovery and Matching.",
                    "Cross-Client SLA Management with the ysla Language and Engine.",
                    "Paving the Way for Autonomous Cars in the City of Tomorrow: A Prototype for Mobile Devices Support at the Edges of 5G Network.",
                    "Juno: An Intelligent Chat Service for IT Service Automation."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th ICSOC 2017",
        "info": "Malaga, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2017",
                "sub_name": "Service-Oriented Computing - 15th International Conference, ICSOC 2017, Malaga, Spain, November 13-16, 2017, Proceedings.",
                "count": 53,
                "papers": [
                    "Similarity Computation Exploiting the Semantic and Syntactic Inherent Structure Among Job Titles.",
                    "RISE: Resolution of Identity Through Similarity Establishment on Unstructured Job Descriptions.",
                    "Social-Sensor Cloud Service for Scene Reconstruction.",
                    "Quark: A Methodology to Transform People-Driven Processes to Chatbot Services.",
                    "Cloud Certification Process Validation Using Formal Methods.",
                    "Validation of Service Blueprint Models by Means of Formal Simulation Techniques.",
                    "Deadlock-Freeness Verification of Business Process Configuration Using SOG.",
                    "Formally Modeling, Executing, and Testing Service-Oriented Systems with UML and OCL.",
                    "App Update Patterns: How Developers Act on User Reviews in Mobile App Stores.",
                    "Predicting the Evolution of Service Value Features from User Reviews for Continuous Service Improvement.",
                    "Confidence-Aware Reputation Bootstrapping in Composite Service Environments.",
                    "Compound Trace Clustering to Generate Accurate and Simple Sub-Process Models.",
                    "An Approach to Modeling and Discovering Event Correlation for Service Collaboration.",
                    "Energy Efficient Scheduling of Application Components via Brownout and Approximate Markov Decision Process.",
                    "Predicting the Available Bandwidth on Intra Cloud Network Links for Deadline Constrained Workflow Scheduling in Public Clouds.",
                    "Inferring Calling Relationship Based on External Observation for Microservice Architecture.",
                    "A QoS-Aware Resource Allocation Controller for Function as a Service (FaaS) Platform.",
                    "Probabilistic Qualitative Preference Matching in Long-Term IaaS Composition.",
                    "An Embedding Based Factorization Machine Approach for Web Service QoS Prediction.",
                    "A Deep Learning Approach for Long Term QoS-Compliant Service Composition.",
                    "An Artifact-Driven Approach to Monitor Business Processes Through Real-World Objects.",
                    "BenchFoundry: A Benchmarking Framework for Cloud Storage Services.",
                    "Automated Analysis of Cloud Offerings for Optimal Service Provisioning.",
                    "Middleware for Dynamic Upgrade Activation and Compensations in Multi-tenant SaaS.",
                    "Risk-Based Proactive Process Adaptation.",
                    "A Debt-Aware Learning Approach for Resource Adaptations in Cloud Elasticity Management.",
                    "Large-Scale and Adaptive Service Composition Using Deep Reinforcement Learning.",
                    "\\mathbb ECHO : An Adaptive Orchestration Platform for Hybrid Dataflows across Cloud and Edge.",
                    "Ensuring and Assessing Architecture Conformance to Microservice Decomposition Patterns.",
                    "Polly: A Language-Based Approach for Custom Change Detection of Web Service Data.",
                    "Design and Evaluation of a Self-Service Delivery Framework.",
                    "Automated Generation of REST API Specification from Plain HTML Documentation.",
                    "Efficient Keyword Search for Building Service-Based Systems Based on Dynamic Programming.",
                    "Supporting the Decision of Migrating to Microservices Through Multi-layer Fuzzy Cognitive Maps.",
                    "A Tree-Based Reliability Analysis for Fault-Tolerant Web Services Composition.",
                    "Modernization of Information Systems at Red.es: An Approach Based on Gap Analysis and ADM.",
                    "Improving Web Services Design Quality Using Dimensionality Reduction Techniques.",
                    "ARA-Assessor: Application-Aware Runtime Risk Assessment for Cloud-Based Business Continuity.",
                    "Personalized Quality Centric Service Recommendation.",
                    "Cataloger: Catalog Recommendation Service for IT Change Requests.",
                    "ATLAS: A World-Wide Travel Assistant Exploiting Service-Based Adaptive Technologies.",
                    "A Variability Model for Store-Oriented Software Ecosystems: An Enterprise Perspective.",
                    "An Analysis of RESTful APIs Offerings in the Industry.",
                    "Efficient Influential Individuals Discovery on Service-Oriented Social Networks: A Community-Based Approach.",
                    "Empirical Study on REST APIs Usage in Android Mobile Applications.",
                    "Revenue-Driven Service Provisioning for Resource Sharing in Mobile Cloud Computing.",
                    "Continuous Learning as a Service for Conversational Virtual Agents.",
                    "Costradamus: A Cost-Tracing System for Cloud-Based Software Services.",
                    "An Automatic Approach for Transforming IoT Applications to RESTful Services on the Cloud.",
                    "RobOps: Robust Control for Cloud-Based Services.",
                    "Serverless Execution of Scientific Workflows.",
                    "A Market-Based Approach for Detecting Malware in the Cloud via Introspection.",
                    "Trustless Intermediation in Blockchain-Based Decentralized Service Marketplaces."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2017w",
                "sub_name": "Service-Oriented Computing - ICSOC 2017 Workshops - ASOCA, ISyCC, WESOACS, and Satellite Events, Málaga, Spain, November 13-16, 2017, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "A BRS Based Approach for Modeling Elastic Cloud Systems.",
                    "Detecting Customer Queue \"at-risk\" Behaviors Based on Ethograms to Minimize Overall Service Dissatisfaction.",
                    "What, Where, When, How and Right of Runtime Adaptation in Service-Oriented Systems.",
                    "An End-to-End Security Model for Adaptive Service-Oriented Applications.",
                    "Runtime Migration of Applications in a Trans-Cloud Environment.",
                    "Verification of the Consistency of Time-Aware Cyber-Physical Processes.",
                    "Model Checking of Cost-Effective Elasticity Strategies in Cloud Computing.",
                    "QoS-Driven Self-adaptation for Critical IoT-Based Systems.",
                    "BiAgent-Based Model for IoT Applications - Case of a Collision Avoidance System.",
                    "Seamless Interactions on the Internet of Things. A Spotify-Based Proof of Concept.",
                    "A Feedback-Based Adaptive Service-Oriented Paradigm for the Internet of Things.",
                    "QoS Prediction for Reliable Service Composition in IoT.",
                    "Checking and Enforcing Security Through Opacity in Healthcare Applications.",
                    "Power-Based Device Recognition for Occupancy Detection.",
                    "Cognitive Determination of Policies for Data Management in IoT Systems.",
                    "A Research Perspective on Fog Computing.",
                    "Lessons Learned from Evaluating Workflow Management Systems.",
                    "Sustainable WAsTe Collection (SWAT): One Step Towards Smart and Spotless Cities.",
                    "Designing Suitable Access Control for Web-Connected Smart Home Platforms.",
                    "Integrating Smart Devices as Business Process Resources - Concept and Software Prototype.",
                    "Architecting Enterprise Applications for the Cloud: The Unicorn Universe Cloud Framework.",
                    "A Knowledge Carrying Service-Component Architecture for Smart Cyber Physical Systems - An Example Based on Self-documenting Production Systems.",
                    "Experiences on Migrating RESTful Web Services to GraphQL.",
                    "Using Risk Patterns to Identify Violations of Data Protection Policies in Cloud Systems.",
                    "Towards Setting Up a Collaborative Environment to Support Collaborative Business Processes and Services with Social Interactions.",
                    "Toward an Interactive Mobility Assistant for Multi-modal Transport in Smart Cities.",
                    "Meeting IoT Users' Preferences by Emerging Behavior at Run-Time.",
                    "A Proposition for a Design Method of Service Systems.",
                    "A Model-Driven Approach to Continuous Delivery of Cloud Resources.",
                    "SLA-Driven Governance for RESTful Systems.",
                    "Towards Adaptive Monitoring Services for Self-Adaptive Software Systems.",
                    "An Approach to Predictive Analysis of Self-Adaptive Systems in Design Time.",
                    "Paving the Way for a Real-Time Context-Aware Predictive Architecture.",
                    "OpenTOSCA Injector: Vertical and Horizontal Topology Model Injection.",
                    "Optimizing Service Delivery with Minimal Runtimes.",
                    "Semantic Data Mediator: Linking Services to Websites.",
                    "ARGON: A Tool for Modeling Cloud Resources.",
                    "Ubiquity: An Extensible Framework for Persistence in Container Environments.",
                    "Distributed Video Analytics Across Edge and Cloud Using \\mathbb ECHO."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "14th ICSOC 2016",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2016",
                "sub_name": "Service-Oriented Computing - 14th International Conference, ICSOC 2016, Banff, AB, Canada, October 10-13, 2016, Proceedings.",
                "count": 58,
                "papers": [
                    "Revisiting Service-Oriented Architecture for the IoT: A Middleware Perspective.",
                    "Towards a Shared Ledger Business Collaboration Language Based on Data-Aware Processes.",
                    "Optimizing Process Model Redesign.",
                    "QoS-Driven Management of Business Process Variants in Cloud Based Execution Environments.",
                    "Propagation of Event Content Modification in Business Processes.",
                    "Discovery of Multi-perspective Declarative Process Models.",
                    "Declarative Process Models: Different Ways to Be Hierarchical.",
                    "FitScale: Scalability of Legacy Applications Through Migration to Cloud.",
                    "Monitoring-Based Task Scheduling in Large-Scale SaaS Cloud.",
                    "Are REST APIs for Cloud Computing Well-Designed? An Exploratory Study.",
                    "Cross-Device Integration of Android Apps.",
                    "A Model-Driven Framework for Interoperable Cloud Resources Management.",
                    "Detecting Cloud (Anti)Patterns: OCCI Perspective.",
                    "Automated Quality Assessment of Unstructured Resolution Text in IT Service Systems.",
                    "Time-Aware Customer Preference Sensing and Satisfaction Prediction in a Dynamic Service Market.",
                    "A Skewness-Based Framework for Mobile App Permission Recommendation and Risk Evaluation.",
                    "On Engineering Analytics for Elastic IoT Cloud Platforms.",
                    "Prediction of Web Services Evolution.",
                    "Features of IT Service Markets: A Systematic Literature Review.",
                    "Qualitative Economic Model for Long-Term IaaS Composition.",
                    "An Uncertain Assessment Compatible Incentive Mechanism for Eliciting Continual and Truthful Assessments of Cloud Services.",
                    "Bi-level Identification of Web Service Defects.",
                    "Meta-Path Based Service Recommendation in Heterogeneous Information Networks.",
                    "A Robust Approach to Finding Trustworthy Influencer in Trust-Oriented E-Commerce Environments.",
                    "Context-Aware Recommendation of Task Allocations in Service Systems.",
                    "Semantic Pattern Mining Based Web Service Recommendation.",
                    "JSON Patch for Turning a Pull REST API into a Push.",
                    "User Interface Derivation Based on Role-Enriched Business Process Model.",
                    "Deriving Consistent GSM Schemas from DCR Graphs.",
                    "A Formal Guidance Approach for Correct Process Configuration.",
                    "iSim: An Efficient Integrated Similarity Based Collaborative Filtering Approach for Trust Prediction in Service-Oriented Social Networks.",
                    "Expertise and Trust -Aware Social Web Service Recommendation.",
                    "A Novel Heuristic Method for Improving the Fitness of Mined Business Process Models.",
                    "REST-Enabled Decision Making in Business Process Choreographies.",
                    "WiCare: A Synthesized Healthcare Service System Based on WiFi Signals.",
                    "Service Mining for Internet of Things.",
                    "A Testing Approach for Hidden Concurrencies Based on Process Execution Logs.",
                    "autoCEP: Automatic Learning of Predictive Rules for Complex Event Processing.",
                    "An Optimal and Iterative Pricing Model for Multiclass IaaS Cloud Services.",
                    "A Study of the Energy Consumption of Databases and Cloud Patterns.",
                    "Data-Dependent QoS-Based Service Selection.",
                    "A Mobile Service Engine Enabling Complex Data Collection Applications.",
                    "Service Recommendation Based on Social Balance Theory and Collaborative Filtering.",
                    "Personalized API Recommendation via Implicit Preference Modeling.",
                    "Empirical Study on the Interface and Feature Evolutions of Mobile Apps.",
                    "Service Package Recommendation for Mashup Development Based on a Multi-level Relational Network.",
                    "Integrating POMDP and SARSA( \\lambda λ ) for Service Composition with Incomplete Information.",
                    "Formal Specification and Verification Framework for Multi-domain Ubiquitous Environment.",
                    "Studying Social Collaboration Features and Patterns in Service Crowdsourcing.",
                    "Follow the Leader: A Social Network Approach for Service Communities.",
                    "A Data Services-Based Quality Analysis System for the Life Cycle of Tire Production.",
                    "Towards More Effective Solution Retrieval in IT Support Services Using Systems Log.",
                    "Top-Down Pricing of IT Services Deals with Recommendation for Missing Values of Historical and Market Data.",
                    "Context as a Service: Realizing Internet of Things-Aware Processes for the Independent Living of the Elderly.",
                    "Enriching API Descriptions by Adding API Profiles Through Semantic Annotation.",
                    "Service-Oriented Autonomic Pervasive Context.",
                    "A Discrete Constraint-Based Method for Pipeline Build-Up Aware Services Sales Forecasting.",
                    "Clustering and Labeling IT Maintenance Tickets."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2016w",
                "sub_name": "Service-Oriented Computing - ICSOC 2016 Workshops - ASOCA, ISyCC, BSCI, and Satellite Events, Banff, AB, Canada, October 10-13, 2016. Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Decentralized Dynamic Adaptation for Service-Based Collective Adaptive Systems.",
                    "A Generic Framework for Quality-Based Autonomic Adaptation Within Sensor-Based Systems.",
                    "Using Formal Model for Evaluation of Business Processes Elasticity in the Cloud.",
                    "A Brokerage Architecture: Cloud Service Selection.",
                    "Service Virtualization for Self-adaptation in Mobile Cyber-Physical Systems.",
                    "EQL: Event Query Language for the Sharing of Internet-of-Things Infrastructure and Collaborative Applications Development.",
                    "Trust-Based IoT Participatory Sensing for Hazard Detection and Response.",
                    "Data Provenance Model for Internet of Things (IoT) Systems.",
                    "Securing Data Provenance in Internet of Things (IoT) Systems.",
                    "Enhancing UML Class Diagram Abstraction with Page Rank Algorithm and Relationship Abstraction Rules.",
                    "Energy-Aware Composition for Service-Oriented Wireless Sensor Networks.",
                    "Searching the Web of Things: Resolving a Real Library of Babel.",
                    "A Migration Approach for Cloud Service Composition.",
                    "Towards Quality Guided Data Integration on Multi-cloud Settings.",
                    "Revenue-Driven Service Provision for Mobile Hosts.",
                    "Context-Aware Automated Workflow Composition for Interactive Data Exploration.",
                    "Towards Rules-Based Mapping Framework for RESTful Web Services.",
                    "Demand-Driven SOA Simulation Platform Based on GIPSY for Context-Based Brokerage.",
                    "DeMOCAS: Domain Objects for Service-Based Collective Adaptive Systems.",
                    "Anuvaad Pranaali: A RESTful API for Machine Translation.",
                    "Integration of Heterogeneous Services and Things into Choreographies.",
                    "Testing Processes with Service Invocation: Advanced Logging in CPEE.",
                    "COOL: A Model-Driven and Automated System for Guided and Verifiable Cloud Solution Design.",
                    "A Service-Based System for Sentiment Analysis and Visualization of Twitter Data in Realtime.",
                    "XDAI-A: Framework for Enabling Cross-Device Integration of Android Apps.",
                    "Desire: Deep Semantic Understanding and Retrieval for Technical Support Services.",
                    "BlueSight: Automated Discovery Service for Cloud Migration of Enterprises.",
                    "A Configurator Component for End-User Defined Mobile Data Collection Processes."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "13th ICSOC 2015",
        "info": "Goa, India",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2015",
                "sub_name": "Service-Oriented Computing - 13th International Conference, ICSOC 2015, Goa, India, November 16-19, 2015, Proceedings.",
                "count": 37,
                "papers": [
                    "Combining Practical and Dialectical Commitments for Service Engagements.",
                    "Positron: Composing Commitment-Based Protocols.",
                    "Analysis of Timing Constraints in Heterogeneous Middleware Interactions.",
                    "Context-Driven Assessment of Provider Reputation in Composite Provision Scenarios.",
                    "Runtime Model-Based Privacy Checks of Big Data Cloud Services.",
                    "Optimizing Workload Category for Adaptive Workload Prediction in Service Clouds.",
                    "On Developing and Operating of Data Elasticity Management Process.",
                    "Supporting Cloud Service Operation Management for Elasticity.",
                    "rSLA: Monitoring SLAs in Dynamic Service Environments.",
                    "AISLE: Assessment of Provisioned Service Levels in Public IaaS-Based Database Systems.",
                    "Are RESTful APIs Well-Designed? Detection of their Linguistic (Anti)Patterns.",
                    "Aggregating Functionality, Use History, and Popularity of APIs to Recommend Mashup Creation.",
                    "Integrating Gaussian Process with Reinforcement Learning for Adaptive Service Composition.",
                    "Scalable SaaS-Based Process Customization with CaseWalls.",
                    "Correlation Mining: Mining Process Orchestrations Without Case Identifiers.",
                    "Verification of GSM-Based Artifact-Centric Systems by Predicate Abstraction.",
                    "Mining and Querying Process Change Information Based on Change Trees.",
                    "Property Preservation in Adaptive Case Management.",
                    "Modelling and Optimizing Bandwidth Provision for Interacting Cloud Services.",
                    "Four-Fold Auto-Scaling on a Contemporary Deployment Platform Using Docker Containers.",
                    "An SLA-Based Advisor for Placement of HPC Jobs on Hybrid Clouds.",
                    "Optimizing Long-term IaaS Service Composition.",
                    "On the Complexity of QoS-Aware Service Selection Problem.",
                    "TRACE: A Dynamic Model of Trust for People-Driven Service Engagements - Combining Trust with Risk, Commitments, and Emotions.",
                    "A Context-Aware Approach for Personalised and Adaptive QoS Assessments.",
                    "Spatio-Temporal Composition of Crowdsourced Services.",
                    "Design for Adaptation of Distributed Service-Based Systems.",
                    "Automatic Deployment of Services in the Cloud with Aeolus Blender.",
                    "Analyzing Resource Behavior to Aid Task Assignment in Service Systems.",
                    "SenseX: Design and Deployment of a Pervasive Wellness Monitoring Platform for Workplaces.",
                    "Opportunities for Process Improvement: A Cross-Clientele Analysis of Event Data Using Process Mining.",
                    "Pricing IT Services Deals: A More Agile Top-Down Approach.",
                    "SimMon: A Toolkit for Simulating Monitoring Mechanism in Cloud Computing Environments.",
                    "CASE: A Platform for Crowdsourcing Based API Search.",
                    "WSTP: Web Services Tagging Platform.",
                    "Personalized Messaging Engine: The Next Step in Employee Engagement.",
                    "Offering Context-Aware Personalised Services for Mobile Users."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2015w",
                "sub_name": "Service-Oriented Computing - ICSOC 2015 Workshops - WESOA, RMSOC, ISC, DISCO, WESE, BSCI, FOR-MOVES, Goa, India, November 16-19, 2015, Revised Selected Papers.",
                "count": 20,
                "papers": [
                    "From Choreography Diagrams to RESTful Interactions.",
                    "Estimating the Complexity of Software Services Using an Entropy Based Metric.",
                    "Establishing Distributed Governance Infrastructures for Enacting Cross-Organization Collaborations.",
                    "All the Services Large and Micro: Revisiting Industrial Practice in Services Computing.",
                    "Distributed Service Co-evolution Based on Domain Objects.",
                    "A Web Services Infrastructure for the Management of Mashup Interfaces.",
                    "S-PDH: A CPS Service Contract Framework for Composition.",
                    "Towards RAM-Based Variant Generation of Business Process Models.",
                    "Extending Generic BPM with Computer Vision Capabilities.",
                    "Extraction of Topic Map Ontology for Web Service-Oriented Enterprises.",
                    "Case Study Method and Research Design for the Dynamic Multilevel Component Selection Problem.",
                    "Expressive Equivalence and Succinctness of Parametrized Automata with Respect to Finite Memory Automata.",
                    "Toward the Formalization of BPEL.",
                    "Context-Aware Personalization for Smart Mobile Cloud Services.",
                    "Information Governance Requirements for Architectural Solutions Supporting Dynamic Business Networking.",
                    "An Evolutionary Multiobjective Approach for the Dynamic Multilevel Component Selection Problem.",
                    "A Reusable Architecture for Dependability and Performance Benchmarking of Cloud Services.",
                    "Safe Configurations of Replica Voting Processes in Fault-Resilient Data Collection Services.",
                    "On Composition of Checkpoint and Recovery Protocols for Distributed Systems.",
                    "A Proactive Solution to Manage Web Service Unavailability in Service Oriented Software Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "12th ICSOC 2014",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2014",
                "sub_name": "Service-Oriented Computing - 12th International Conference, ICSOC 2014, Paris, France, November 3-6, 2014. Proceedings.",
                "count": 51,
                "papers": [
                    "Configuration Rule Mining for Variability Analysis in Configurable Process Models.",
                    "ProcessBase: A Hybrid Process Management Platform.",
                    "A Multi-objective Approach to Business Process Repair.",
                    "Memetic Algorithms for Mining Change Logs in Process Choreographies.",
                    "Flexible Batch Configuration in Business Processes Based on Events.",
                    "Automatic Generation of Optimized Workflow for Distributed Computations on Large-Scale Matrices.",
                    "A Dynamic Service Composition Model for Adaptive Systems in Mobile Computing Environments.",
                    "Optimal and Automatic Transactional Web Service Composition with Dependency Graph and 0-1 Linear Programming.",
                    "A Framework for Searching Semantic Data and Services with SPARQL.",
                    "Conformance for DecSerFlow Constraints.",
                    "Integrating On-policy Reinforcement Learning with Multi-agent Techniques for Adaptive Service Composition.",
                    "An Agent-Based Service Marketplace for Dynamic and Unreliable Settings.",
                    "Architecture-Centric Design of Complex Message-Based Service Systems.",
                    "Managing Expectations: Runtime Negotiation of Information Quality Requirements in Event-Based Systems.",
                    "C2P: Co-operative Caching in Distributed Storage Systems.",
                    "Detection of REST Patterns and Antipatterns: A Heuristics-Based Approach.",
                    "How Do Developers React to RESTful API Evolution?",
                    "How to Enable Multiple Skill Learning in a SLA Constrained Service System?",
                    "ADVISE - A Framework for Evaluating Cloud Service Elasticity Behavior.",
                    "Transforming Service Compositions into Cloud-Friendly Actor Networks.",
                    "A Runtime Model Approach for Data Geo-location Checks of Cloud Services.",
                    "Heuristic Approaches for Robust Cloud Monitor Placement.",
                    "Compensation-Based vs. Convergent Deployment Automation for Services Operated in the Cloud.",
                    "On Enabling Time-Aware Consistency of Collaborative Cross-Organisational Business Processes.",
                    "Weak Conformance between Process Models and Synchronized Object Life Cycles.",
                    "Failure-Proof Spatio-temporal Composition of Sensor Cloud Services.",
                    "Probabilistic Prediction of the QoS of Service Orchestrations: A Truly Compositional Approach.",
                    "QoS-Aware Complex Event Service Composition and Optimization Using Genetic Algorithms.",
                    "Towards QoS Prediction Based on Composition Structure Analysis and Probabilistic Models.",
                    "Orchestrating SOA Using Requirement Specifications and Domain Ontologies.",
                    "Estimating Functional Reusability of Services.",
                    "Negative-Connection-Aware Tag-Based Association Mining and Service Recommendation.",
                    "Choreographing Services over Mobile Devices.",
                    "Adaptation of Asynchronously Communicating Software.",
                    "Handling Irreconcilable Mismatches in Web Services Mediation.",
                    "Evaluating Cloud Users' Credibility of Providing Subjective Assessment or Objective Assessment for Cloud Services.",
                    "Composition of Cloud Collaborations under Consideration of Non-functional Attributes.",
                    "Bottleneck Detection and Solution Recommendation for Cloud-Based Multi-Tier Application.",
                    "Towards Auto-remediation in Services Delivery: Context-Based Classification of Noisy and Unstructured Tickets.",
                    "ITIL Metamodel.",
                    "Formal Modeling and Analysis of Home Care Plans.",
                    "Effort Analysis Using Collective Stochastic Model.",
                    "A Novel Equitable Trustworthy Mechanism for Service Recommendation in the Evolving Service Ecosystem.",
                    "Semantics-Based Approach for Dynamic Evolution of Trust Negotiation Protocols in Cloud Collaboration.",
                    "Social Context-Aware Trust Prediction in Social Networks.",
                    "Decidability and Complexity of Simulation Preorder for Data-Centric Web Services.",
                    "Market-Optimized Service Specification and Matching.",
                    "Designing Secure Service Workflows in BPEL.",
                    "Runtime Management of Multi-level SLAs for Transport and Logistics Services.",
                    "Single Source of Truth (SSOT) for Service Oriented Architecture (SOA).",
                    "Model for Service License in API Ecosystems."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2014w",
                "sub_name": "Service-Oriented Computing - ICSOC 2014 Workshops - WESOA; SeMaPS, RMSOC, KASA, ISC, FOR-MOVES, CCSA and Satellite Events, Paris, France, November 3-6, 2014, Revised Selected Papers.",
                "count": 40,
                "papers": [
                    "Building Enterprise Applications Using Unicorn Universe Services.",
                    "Cloud Migration Patterns: A Multi-cloud Service Architecture Perspective.",
                    "GovOps: The Missing Link for Governance in Software-Defined IoT Cloud Systems.",
                    "MoDAS: Methodology and Tool for Model-Driven Adaptable Services.",
                    "Service Interface Synthesis in Business Networks.",
                    "Virtualizing Communication for Hybrid and Diversity-Aware Collective Adaptive Systems.",
                    "BPM Supported Privacy by Design for Cross-Organization Business Processes.",
                    "Learning 'Good Quality' Resource Allocations from Historical Data.",
                    "Resource-Aware Process Model Similarity Matching.",
                    "Supporting Rule-Based Process Mining by User-Guided Discovery of Resource-Aware Frequent Patterns.",
                    "Optimizing Resource Utilization by Combining Running Business Process Instances.",
                    "A Planning-Based Service Composition Approach for Data-Centric Workflows.",
                    "Discovering and Categorizing Goal Alignments from Mined Process Variants.",
                    "Supporting Enterprise Changes Using Actor Performance Assessment.",
                    "Towards a Framework for Semantically-Enabled Compliance Management in Financial Services.",
                    "Reasoning on Incomplete Execution Traces Using Action Languages - A First Report.",
                    "Semantic Web Services Approach for Collaboration in E-Gov Context.",
                    "Contextualised Security Operation Deployment Through MDS@run.time Architecture.",
                    "Domain Specific Monitoring of Business Processes Using Concept Probes.",
                    "Towards a Model for Resource Allocation in API Value Networks.",
                    "Using COBIT 5 for Risk to Develop Cloud Computing SLA Evaluation Templates.",
                    "A Non-Parametric Data Envelopment Analysis Approach for Cloud Services Evaluation.",
                    "A Lightweight User State Monitoring System on Android Smartphones.",
                    "Developing Service Platform for Web Context-Aware Services Towards Self-Managing Ecosystem.",
                    "Retrieving Sensors Data in Smart Buildings Through Services: A Similarity Algorithm.",
                    "An EXPTIME Algorithm for Data-Aware Service Simulation Using Parametrized Automata.",
                    "Optimal Virtual Machine Placement in a Multi-tenant Cloud.",
                    "A Validation Method of Configurable Business Processes Based on Data-Flow.",
                    "Exploiting the Parallel Execution of Homology Workflow Alternatives in HPC Compute Clouds.",
                    "Vertical Scaling Capability of OpenStack - Survey of Guest Operating Systems, Hypervisors, and the Cloud Management Platform.",
                    "A Description-Based Service Search System.",
                    "Dynamic Composite Web Service Execution by Providing Fault-Tolerance and QoS Monitoring.",
                    "Dynamic QoS Requirement Aware Service Composition and Adaptation.",
                    "MobiDisc: Semantic Web Service Discovery Approach in Mobile Environments.",
                    "Monitoring and Checking Privacy Policies of Cloud Services Based on Models.",
                    "Service Map: A Service Hierarchy for Satisfying User's Requirement of Multiple Granularities.",
                    "WS-Portal an Enriched Web Services Search Engine.",
                    "SUPER: Social-Based Business Process Management Framework.",
                    "TL-VIEWS: A Tool for Temporal Logic Verification of Transactional Behavior of Web Service Compositions.",
                    "SmartPM: Automated Adaptation of Dynamic Processes."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "11th ICSOC 2013",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2013",
                "sub_name": "Service-Oriented Computing - 11th International Conference, ICSOC 2013, Berlin, Germany, December 2-5, 2013, Proceedings.",
                "count": 65,
                "papers": [
                    "Data-Centricity and Services Interoperation.",
                    "QoS-Aware Cloud Service Composition Using Time Series.",
                    "QoS Analysis in Heterogeneous Choreography Interactions.",
                    "Improving Interaction with Services via Probabilistic Piggybacking.",
                    "Runtime Enforcement of First-Order LTL Properties on Data-Aware Business Processes.",
                    "QoS-Aware Service VM Provisioning in Clouds: Experiences, Models, and Cost Analysis.",
                    "Personalized Quality Prediction for Dynamic Service Management Based on Invocation Patterns.",
                    "Open Source versus Proprietary Software in Service-Orientation: The Case of BPEL Engines.",
                    "Detection of SOA Patterns.",
                    "Optimal Strategy for Proactive Service Delivery Management Using Inter-KPI Influence Relationships.",
                    "On-the-Fly Adaptation of Dynamic Service-Based Systems: Incrementality, Reduction and Reuse.",
                    "WT-LDA: User Tagging Augmented LDA for Web Service Clustering.",
                    "Does One-Size-Fit-All Suffice for Service Delivery Clients?",
                    "Runtime Evolution of Service-Based Multi-tenant SaaS Applications.",
                    "Critical Path-Based Iterative Heuristic for Workflow Scheduling in Utility and Cloud Computing.",
                    "REFlex: An Efficient Web Service Orchestrator for Declarative Business Processes.",
                    "Task Scheduling Optimization in Cloud Computing Applying Multi-Objective Particle Swarm Optimization.",
                    "Verification of Artifact-Centric Systems: Decidability and Modeling Issues.",
                    "Automatically Composing Services by Mining Process Knowledge from the Web.",
                    "Batch Activities in Process Modeling and Execution.",
                    "Multi-Objective Service Composition Using Reinforcement Learning.",
                    "Provisioning Quality-Aware Social Compute Units in the Cloud.",
                    "Process Discovery Using Prior Knowledge.",
                    "Mirror, Mirror, on the Web, Which Is the Most Reputable Service of Them All? - A Domain-Aware and Reputation-Aware Method for Service Recommendation.",
                    "Service Discovery from Observed Behavior while Guaranteeing Deadlock Freedom in Collaborations.",
                    "Priority-Based Human Resource Allocation in Business Processes.",
                    "Prediction of Remaining Service Execution Time Using Stochastic Petri Nets with Arbitrary Firing Delays.",
                    "Entity-Centric Search for Enterprise Services.",
                    "Tactical Service Selection with Runtime Aspects.",
                    "Online Reliability Time Series Prediction for Service-Oriented System of Systems.",
                    "Multi-level Elasticity Control of Cloud Services.",
                    "Reasoning on UML Data-Centric Business Process Models.",
                    "QoS-Aware Multi-granularity Service Composition Based on Generalized Component Services.",
                    "Evaluating Cloud Services Using a Multiple Criteria Decision Analysis Approach.",
                    "An Approach for Compliance-Aware Service Selection with Genetic Algorithms.",
                    "Decomposing Ratings in Service Compositions.",
                    "Automatic Generation of Test Models for Web Services Using WSDL and OCL.",
                    "An Incentive Mechanism for Game-Based QoS-Aware Service Selection.",
                    "Goal Oriented Variability Modeling in Service-Based Business Processes.",
                    "A Cooperative Management Model for Volunteer Infrastructure as a Service in P2P Cloud.",
                    "Process Refinement Validation and Explanation with Ontology Reasoning.",
                    "Automated Service Composition for on-the-Fly SOAs.",
                    "Deriving Business Process Data Architecturesfrom Process Model Collections.",
                    "A Case Based Approach to Serve Information Needs in Knowledge Intensive Processes.",
                    "Patience-Aware Scheduling for Cloud Services: Freeing Users from the Chains of Boredom.",
                    "MaxInsTx: A Best-Effort Failure Recovery Approach for Artifact-Centric Business Processes.",
                    "Extending WS-Agreement to Support Automated Conformity Check on Transport and Logistics Service Agreements.",
                    "Automatic Composition of Form-Based Services in a Context-Aware Personal Information Space.",
                    "Synthesizing Cost-Minimal Partners for Services.",
                    "An Architecture to Provide Quality of Service in OGC SWE Context.",
                    "Verification of Semantically-Enhanced Artifact Systems.",
                    "A Framework for Cross Account Analysis.",
                    "DataSheets: A Spreadsheet-Based Data-Flow Language.",
                    "Decision Making in Enterprise Crowdsourcing Services.",
                    "Towards Optimal Risk-Aware Security Compliance of a Large IT System.",
                    "Behavioral Analysis of Service Delivery Models.",
                    "A Novel Service Composition Approach for Application Migration to Cloud.",
                    "PPINOT Tool Suite: A Performance Management Solution for Process-Oriented Organisations.",
                    "SYBL+MELA: Specifying, Monitoring, and Controlling Elasticity of Cloud Services.",
                    "Modeling and Monitoring Business Process Execution.",
                    "A Tool for Business Process Architecture Analysis.",
                    "OpenTOSCA - A Runtime for TOSCA-Based Cloud Applications.",
                    "iAgree Studio: A Platform to Edit and Validate WS-Agreement Documents.",
                    "Winery - A Modeling Tool for TOSCA-Based Cloud Applications.",
                    "Barcelona: A Design and Runtime Environment for Declarative Artifact-Centric BPM."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2013w",
                "sub_name": "Service-Oriented Computing - ICSOC 2013 Workshops - CCSA, CSB, PASCEB, SWESE, WESOA, and PhD Symposium, Berlin, Germany, December 2-5, 2013. Revised Selected Papers.",
                "count": 54,
                "papers": [
                    "Introduction to the 9th International Workshop on Engineering Service-Oriented Applications (WESOA'13).",
                    "From Process Models to Business Process Architectures: Connecting the Layers.",
                    "Goal-Driven Composition of Business Process Models.",
                    "Integrating Service Release Management with Service Solution Design.",
                    "Practical Compiler-Based User Support during the Development of Business Processes.",
                    "Model Checking GSM-Based Multi-Agent Systems.",
                    "Towards Modeling and Execution of Collective Adaptive Systems.",
                    "A Requirements-Based Model for Effort Estimation in Service-Oriented Systems.",
                    "Augmenting Complex Problem Solving with Hybrid Compute Units.",
                    "Towards Automating the Detection of Event Sources.",
                    "Discovering Pattern-Based Mediator Services from Communication Logs.",
                    "Cloud Service Brokerage - 2013: Methods and Mechanisms.",
                    "A Comparison Framework and Review of Service Brokerage Solutions for Cloud Architectures.",
                    "Brokerage for Quality Assurance and Optimisation of Cloud Services: An Analysis of Key Requirements.",
                    "Towards Value-Driven Business Modelling Based on Service Brokerage.",
                    "Introducing Policy-Driven Governance and Service Level Failure Mitigation in Cloud Service Brokers: Challenges Ahead.",
                    "Model-Based Testing in Cloud Brokerage Scenarios.",
                    "Value-Added Modelling and Analysis in Service Value Brokerage.",
                    "Introduction to the Proceedings of the 9th International Workshop on Semantic Web Enabled Software Engineering (SWESE) 2013.",
                    "Management of Variability in Modular Ontology Development.",
                    "Towards Automated Service Matchmaking and Planning for Multi-Agent Systems with OWL-S - Approach and Challenges.",
                    "Re-engineering the ISO 15926 Data Model: A Multi-level Metamodel Perspective.",
                    "Fluent Calculus-Based Semantic Web Service Composition and Verification Using WSSL.",
                    "Template-Based Ontology Population for Smart Environments Configuration.",
                    "Introduction to the 3rd International Workshop on Cloud Computing and Scientific Applications (CCSA'13).",
                    "SLA-Aware Load Balancing in a Web-Based Cloud System over OpenStack.",
                    "Are Public Clouds Elastic Enough for Scientific Computing?",
                    "A Light-Weight Framework for Bridge-Building from Desktop to Cloud.",
                    "Planning and Scheduling Data Processing Workflows in the Cloud with Quality-of-Data Constraints.",
                    "Galaxy + Hadoop: Toward a Collaborative and Scalable Image Processing Toolbox in Cloud.",
                    "SciLightning: A Cloud Provenance-Based Event Notification for Parallel Workflows.",
                    "Energy Savings on a Cloud-Based Opportunistic Infrastructure.",
                    "Introduction to the Proceedings of the Workshop on Pervasive Analytical Service Clouds for the Enterprise and Beyond (PASCEB) 2013.",
                    "Towards a Formal Model for Cloud Computing.",
                    "An Optimized Strategy for Data Service Response with Template-Based Caching and Compression.",
                    "Model-Driven Event Query Generation for Business Process Monitoring.",
                    "Enabling Semantic Complex Event Processing in the Domain of Logistics.",
                    "Towards Self-adaptation Planning for Complex Service-Based Systems.",
                    "Towards an Integration Platform for Bioinformatics Services.",
                    "Requirements to Pervasive System Continuous Deployment.",
                    "Towards Structure-Based Quality Awareness in Software Ecosystem Use.",
                    "An Adaptive Enterprise Service Bus Infrastructure for Service Based Systems.",
                    "Dynamic Adaptation of Business Process Based on Context Changes: A Rule-Oriented Approach.",
                    "Flexible Component Migration in an OSGi Based Pervasive Cloud Infrastructure.",
                    "Hybrid Emotion Recognition Using Semantic Similarity.",
                    "ICSOC PhD Symposium 2013.",
                    "Towards the Automated Synthesis of Data Dependent Service Controllers.",
                    "Multi-agent Approach for Managing Workflows in an Inter-Cloud Environment.",
                    "An Information-Centric System for Building the Web of Things.",
                    "Testing of Distributed Service-Oriented Systems.",
                    "Automation of the SLA Life Cycle in Cloud Computing ⋆.",
                    "Towards a Dynamic Declarative Service Workflow Reference Model.",
                    "A Context-Aware Access Control Framework for Software Services.",
                    "Description and Composition of Services towards the Web-Telecom Convergence."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "10th ICSOC 2012",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2012",
                "sub_name": "Service-Oriented Computing - 10th International Conference, ICSOC 2012, Shanghai, China, November 12-15, 2012. Proceedings.",
                "count": 62,
                "papers": [
                    "Specification and Detection of SOA Antipatterns.",
                    "Verification of GSM-Based Artifact-Centric Systems through Finite Abstraction.",
                    "Service Component Architecture Extensions for Dynamic Systems.",
                    "Who Do You Call? Problem Resolution through Social Compute Units.",
                    "Relationship-Preserving Change Propagation in Process Ecosystems.",
                    "Scheduling Service Tickets in Shared Delivery.",
                    "Programming Hybrid Services in the Cloud.",
                    "QoS-Aware Cloud Service Composition Based on Economic Models.",
                    "Cloud Service Selection Based on Variability Modeling.",
                    "Extending Enterprise Service Design Knowledge Using Clustering.",
                    "Participatory Service Design through Composed and Coordinated Service Feature Models.",
                    "PerCAS: An Approach to Enabling Dynamic and Personalized Adaptation for Context-Aware Services.",
                    "A Method for Assessing Influence Relationships among KPIs of Service Systems.",
                    "Dynamic Performance Management in Multi-tenanted Business Process Servers Using Nonlinear Control.",
                    "An Optimized Derivation of Event Queries to Monitor Choreography Violations.",
                    "Dynamic Service Selection with End-to-End Constrained Uncertain QoS Attributes.",
                    "A Constraint-Based Approach to Quality Assurance in Service Choreographies.",
                    "Structural Optimization of Reduced Ordered Binary Decision Diagrams for SLA Negotiation in IaaS of Cloud Computing.",
                    "A Service Composition Framework Based on Goal-Oriented Requirements Engineering, Model Checking, and Qualitative Preference Analysis.",
                    "WCP-Nets: A Weighted Extension to CP-Nets for Web Service Selection.",
                    "WS-Finder: A Framework for Similarity Search of Web Services.",
                    "A Framework for Trusted Services.",
                    "Configuring Private Data Management as Access Restrictions: From Design to Enforcement.",
                    "Modeling User's Non-functional Preferences for Personalized Service Ranking.",
                    "An Adaptive Mediation Framework for Mobile P2P Social Content Sharing.",
                    "Socially-Enriched Semantic Mashup of Web APIs.",
                    "Application of Business-Driven Decision Making to RESTful Business Processes.",
                    "Declarative Choreographies for Artifacts.",
                    "Managing Resource Contention in Embedded Service-Oriented Systems with Dynamic Orchestration.",
                    "Semantic Service Composition Framework for Multidomain Ubiquitous Computing Applications.",
                    "Sparse Functional Representation for Large-Scale Service Clustering.",
                    "Updatable Process Views for User-Centered Adaption of Large Process Models.",
                    "Management-Based License Discovery for the Cloud.",
                    "Ensuring Well-Formed Conversations between Control and Operational Behaviors of Web Services.",
                    "Variability in Service-Oriented Systems: An Analysis of Existing Approaches.",
                    "A Symbolic Framework for the Conformance Checking of Value-Passing Choreographies.",
                    "Service Composition Management Using Risk Analysis and Tracking.",
                    "Assisting Business Process Design by Activity Neighborhood Context Matching.",
                    "Adaptive Case Management in the Social Enterprise.",
                    "Automating Form-Based Processes through Annotation.",
                    "PASOAC-Net: A Petri-Net Model to Manage Authorization in Service-Based Business Process.",
                    "WSTRank: Ranking Tags to Facilitate Web Service Mining.",
                    "Maintaining Motivation Models (in BMM) in the Context of a (WSDL-S) Service Landscape.",
                    "Ontology-Learning-Based Focused Crawling for Online Service Advertising Information Discovery and Classification.",
                    "A Learning Method for Improving Quality of Service Infrastructure Management in New Technical Support Groups.",
                    "Adaptive Service-Oriented Mobile Applications: A Declarative Approach.",
                    "Algorithmic Aspects of Planning under Uncertainty for Service Delivery Organizations.",
                    "A Dynamic QoS-Aware Semantic Web Service Composition Algorithm.",
                    "IT Incident Management by Analyzing Incident Relations.",
                    "An Association Probability Based Noise Generation Strategy for Privacy Protection in Cloud Computing.",
                    "ARIMA Model-Based Web Services Trustworthiness Evaluation and Prediction.",
                    "Analyzing Coopetition Strategies of Services within Communities.",
                    "Trust-Based Service Discovery in Multi-relation Social Networks.",
                    "RETRAiN: A REcommendation Tool for Reconfiguration of RetAil BaNk Branch.",
                    "Automate Back Office Activity Monitoring to Drive Operational Excellence.",
                    "Collective Intelligence for Enhanced Quality Management of IT Services.",
                    "MapReduce-Based Data Stream Processing over Large History Data.",
                    "An Efficient Data Dissemination Approach for Cloud Monitoring.",
                    "A Service Oriented Architecture for Exploring High Performance Distributed Power Models.",
                    "Business Process Extensions as First-Class Entities - A Model-Driven and Aspect-Oriented Approach.",
                    "Towards Dynamic Reconfiguration for QoS Consistent Services Based Applications.",
                    "An Ontology-Based IoT Resource Model for Resources Evolution and Reverse Evolution."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2012w",
                "sub_name": "Service-Oriented Computing - ICSOC 2012 Workshops - ICSOC 2012, International Workshops ASC, DISA, PAASC, SCEB, SeMaPS, WESOA, and Satellite Events, Shanghai, China, November 12-15, 2012, Revised Selected Papers.",
                "count": 53,
                "papers": [
                    "The 1st International Workshop on Analytics Services on the Cloud (ASC 2012).",
                    "A Performance Evaluation of Public Cloud Using TPC-C.",
                    "An Efficient Data Maintenance Strategy for Data Service Mashup Based on Materialized View Selection.",
                    "Homomorphic-Encryption-Based Separation Approach for Outsourced Data Management.",
                    "Protecting Software as a Service in the Clouds by Validation.",
                    "Identifying Fake Feedback for Effective Trust Management in Cloud Environments.",
                    "Sonata: A Workflow Model for Interactive Mobile Cloud Applications.",
                    "Kachako: A Hybrid-Cloud Unstructured Information Platform for Full Automation of Service Composition, Scalable Deployment and Evaluation - Natural Language Processing as an Example.",
                    "2012 International Workshop on Data Intensive Services Based Application (DISA2012).",
                    "An End-User Oriented Approach for Business Process Personalization from Multiple Sources.",
                    "A Combination Approach to QoS Prediction of Web Services.",
                    "Effective and Efficient Web Reviews Extraction Based on Hadoop.",
                    "Intelligent Information Management of Tourist Attractions Based on Semantic Sensor Web.",
                    "An Optimal Approach to the QoS-Based WSMO Web Service Composition Using Genetic Algorithm.",
                    "Introduction to the Second International Workshop on Performance Assessment and Auditing in Service Computing (PAASC 2012).",
                    "Towards the Definition of a Framework Supporting High Level Reliability of Services.",
                    "A Service-Oriented Approach to Assess the Value of Digital Preservation.",
                    "Specification and Deployment of Distributed Monitoring and Adaptation Infrastructures.",
                    "Introducing the Vienna Platform for Elastic Processes.",
                    "TrustVis: A Trust Visualisation Service for Online Communities.",
                    "Crowd-Sourcing Service Designs: Overview and Research Challenges.",
                    "Towards an Architectural Framework for Service-Oriented Enterprises.",
                    "Monitoring Business Process Interaction.",
                    "Interactive Product Browsing and Configuration using Remote Augmented Reality Sales Services.",
                    "The 1st International Workshop on Self-Managing Pervasive Service Systems (SeMaPS 2012).",
                    "A Reformative System Architecture of Cloud Service Based on IEEE 1851.",
                    "Towards RESTful Communications in Self-managing Pervasive Systems.",
                    "A Research Roadmap for Context-Awareness-Based Self-managed Systems.",
                    "A 3D Model Based Action Recorder Using Computer Vision.",
                    "Protecting Sensitive Attributes in Attribute Based Access Control.",
                    "A Hybrid Indoor Positioning Approach for Supermarkets.",
                    "Introduction to the 8th International Workshop on Engineering Service-Oriented Applications (WESOA'12).",
                    "Towards Automated and Correct Composition of Timed Services.",
                    "Resolving Violations in Inter-process Relationships in Business Process Ecosystems.",
                    "An Aspect-Oriented Approach to Enforce Security Properties in Business Processes.",
                    "Evaluation of Quality of Design for Document-Centric Software Services.",
                    "Resource Management for Pervasive Systems.",
                    "Service Oriented Requirements Engineering: Practitioner's Perspective.",
                    "Phd Symposium Track: Message from Chairs.",
                    "Data Consistency Enforcement on Business Process Transactions.",
                    "An Auction-Based Approach for Composite Web Service Selection.",
                    "Data-Centric Probabilistic Process: A PhD. Symposium Paper for ICSOC.",
                    "Detection of SOA Antipatterns.",
                    "Requirements-Driven Software Service Evolution.",
                    "Detecting Runtime Business Process Compliance with Artifact Lifecycles.",
                    "Introduction to the Demo Track.",
                    "A Dynamic SCA-Based System for Smart Homes and Offices.",
                    "Realizing Elastic Processes with ViePEP.",
                    "A Social Network Based Collaborative Video Story Composition Platform.",
                    "BPMashup: Dynamic Execution of RESTful Processes.",
                    "Soda: A Tool Support for the Detection of SOA Antipatterns.",
                    "Method and System for In-Place Modeling of Business Process Extensions as First-Class Entities.",
                    "Supporting Business and IT through Updatable Process Views: The proView Demonstrator."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "9th ICSOC 2011",
        "info": "Paphos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2011",
                "sub_name": "Service-Oriented Computing - 9th International Conference, ICSOC 2011, Paphos, Cyprus, December 5-8, 2011 Proceedings.",
                "count": 54,
                "papers": [
                    "Computing Degree of Parallelism for BPMN Processes.",
                    "State Propagation in Abstracted Business Processes.",
                    "Push-Enabling RESTful Business Processes.",
                    "QoS Analysis for Web Service Compositions Based on Probabilistic QoS.",
                    "Constraint-Based Runtime Prediction of SLA Violations in Service Orchestrations.",
                    "Optimizing Decisions in Web Services Orchestrations.",
                    "Decidability Results for Choreography Realization.",
                    "Conformance Testing for Asynchronously Communicating Services.",
                    "Programming Services with Correlation Sets.",
                    "Verification of Deployed Artifact Systems via Data Abstraction.",
                    "Profiling-as-a-Service: Adaptive Scalable Resource Profiling for the Cloud in the Cloud.",
                    "VM Placement in non-Homogeneous IaaS-Clouds.",
                    "Place Semantics into Context: Service Community Discovery from the WSDL Corpus.",
                    "WTCluster: Utilizing Tags for Web Services Clustering.",
                    "Similarity Function Recommender Service Using Incremental User Knowledge Acquisition.",
                    "Revealing Hidden Relations among Web Services Using Business Process Knowledge.",
                    "Towards a Service System Ontology for Service Science.",
                    "Support for the Business Motivation Model in the WS-Policy4MASC Language and MiniZnMASC Middleware.",
                    "WS-Governance: A Policy Language for SOA Governance.",
                    "QoS-Based Task Scheduling in Crowdsourcing Environments.",
                    "Model Driven Security Analysis of IDaaS Protocols.",
                    "Credibility-Based Trust Management for Services in Cloud Environments.",
                    "Monere: Monitoring of Service Compositions for Failure Diagnosis.",
                    "Multi-layered Monitoring and Adaptation.",
                    "Efficient, Interactive Recommendation of Mashup Composition Knowledge.",
                    "A Semantic and Information Retrieval Based Approach to Service Contract Selection.",
                    "Modeling and Managing Variability in Process-Based Service Compositions.",
                    "QoS-Driven Proactive Adaptation of Service Composition.",
                    "A Quality Aggregation Model for Service-Oriented Software Product Lines Based on Variability and Composition Patterns.",
                    "Optimization of Complex QoS-Aware Service Compositions.",
                    "Goal-Driven Business Process Derivation.",
                    "Defining and Analysing Resource Assignments in Business Processes with RAL.",
                    "Stochastic Optimization for Adaptive Labor Staffing in Service Systems.",
                    "Declarative Enhancement Framework for Business Processes.",
                    "RSCMap: Resiliency Planning in Storage Clouds.",
                    "Dynamically Selecting Composition Algorithms for Economical Composition as a Service.",
                    "A Service Model for Development and Test Clouds.",
                    "Time Based QoS Modeling and Prediction for Web Services.",
                    "CANPRO: A Conflict-Aware Protocol for Negotiation of Cloud Resources and Services.",
                    "Game-Theoretic Analysis of a Web Services Collaborative Mechanism.",
                    "Importance Sampling of Probabilistic Contracts in Web Services.",
                    "Particle Filtering Based Availability Prediction for Web Services.",
                    "A Penalty-Based Approach for QoS Dissatisfaction Using Fuzzy Rules.",
                    "Cellular Differentiation-Based Service Adaptation.",
                    "Graceful Interruption of Request-Response Service Interactions.",
                    "Adaptation of Web Service Interactions Using Complex Event Processing Patterns.",
                    "Employing Dynamic Object Offloading as a Design Breakthrough for SOA Adoption.",
                    "A Survey of SOA Migration in Industry.",
                    "Forms-based Service Composition.",
                    "Contractually Compliant Service Compositions.",
                    "Profit Sharing in Service Composition.",
                    "A Predictive Business Agility Model for Service Oriented Architectures.",
                    "Personal-Hosting RESTful Web Services for Social Network Based Recommendation.",
                    "Work as a Service."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2011w",
                "sub_name": "Service-Oriented Computing - ICSOC 2011 Workshops - ICSOC 2011, International Workshops WESOA, NFPSLAM-SOC, and Satellite Events, Paphos, Cyprus, December 5-8, 2011. Revised Selected Papers.",
                "count": 42,
                "papers": [
                    "Seventh International Workshop on Engineering Service-Oriented Applications (WESOA 2011).",
                    "Taming the Cloud: Safety, Certification and Compliance for Software Services - Keynote at the Workshop on Engineering Service-Oriented Applications (WESOA) 2011.",
                    "Strategic Alignment of Business Processes.",
                    "Decentralized Workflow Coordination through Molecular Composition.",
                    "Using a Lifecycle Model for Developing and Executing Real-Time Online Applications on Clouds.",
                    "A Pragmatic Approach for Analysis and Design of Service Inventories.",
                    "Artifact-Centric Modeling Using BPMN.",
                    "Migratability of BPMN 2.0 Process Instances.",
                    "Asynchronous Learning for Service Composition.",
                    "Engineering Energy-Aware Web Services toward Dynamically-Green Computing.",
                    "Introduction to the Fifth Workshop on Non-Functional Properties and Service Level Agreements Management in Service-Oriented Computing (NFPSLAM-SOC 2011).",
                    "Applying QoS-Aware Service Selection on Functionally Diverse Services.",
                    "Semantic Matching of WS-SecurityPolicy Assertions.",
                    "Quality Prediction in Service Composition Frameworks.",
                    "ECMAF: An Event-Based Cross-Layer Service Monitoring and Adaptation Framework.",
                    "Phd Symposium Preface.",
                    "Defining an SLA-Aware Method to Test Service-Oriented Systems.",
                    "Data Flow-Oriented Process Mining to Support Security Audits.",
                    "Adaptable UI for Web Service Composition: A Model-Driven Approach.",
                    "Economic Model Based Cloud Service Composition.",
                    "Towards Opportunistic Service Composition in Dynamic Ad Hoc Environments.",
                    "Model Checking Inconsistency Recovery Costs.",
                    "Model-Driven Development of Resource-Oriented Applications.",
                    "Human Task Management for RESTful Services.",
                    "CLAM: Cross-Layer Adaptation Management in Service-Based Systems.",
                    "Investigating Service-Oriented Business Architecture.",
                    "Managing Things in an Ambient Space.",
                    "A Propagation Model for Integrating Web of Things and Social Networks.",
                    "ERP B3: Business Continuity Service Level Agreement Translation and Optimisation.",
                    "Business Process Variability: A Tool for Declarative Template Design.",
                    "A Cloud-Based Workflow Management Solution for Collaborative Analytics.",
                    "Analyzing QoS for Web Service Compositions by QoSDIST.",
                    "A Cloud Resource Orchestration Framework for Simplifying the Management of Web Applications.",
                    "A Tool Suite to Model Service Variability and Resolve It Based on Stakeholder Preferences.",
                    "CAptEvo: Context-Aware Adaptation and Evolution of Business Processes.",
                    "A Registry and Repository System Supporting Cloud Application Platform Governance.",
                    "Integrated Asset Analysis Framework for Model-Driven Development of SOA Based Solutions.",
                    "Reasoning-Based Context-Aware Workflow Management in Wireless Sensor Network.",
                    "Service for Crowd-Driven Gathering of Non-Discoverable Knowledge.",
                    "Improving Service Processes with the Crowds.",
                    "Performance Analysis and Problem Determination in SOA Environments.",
                    "Approaches to Improve Reliability of Service Composition."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "8th ICSOC 2010",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2010",
                "sub_name": "Service-Oriented Computing - 8th International Conference, ICSOC 2010, San Francisco, CA, USA, December 7-10, 2010. Proceedings.",
                "count": 79,
                "papers": [
                    "Business Process Model Abstraction Based on Behavioral Profiles.",
                    "Root-Cause Analysis of Design-Time Compliance Violations on the Basis of Property Patterns.",
                    "Artifact-Centric Choreographies.",
                    "Resolving Business Process Interference via Dynamic Reconfiguration.",
                    "Linked Data and Service Orientation.",
                    "Risk Sensitive Value of Changed Information for Selective Querying of Web Services.",
                    "Adaptive Service Composition Based on Reinforcement Learning.",
                    "A Service Execution Control Framework for Policy Enforcement.",
                    "An Integrated Solution for Runtime Compliance Governance in SOA.",
                    "A Differentiation-Aware Fault-Tolerant Framework for Web Services.",
                    "Repair vs. Recomposition for Broken Service Compositions.",
                    "Interoperation, Composition and Simulation of Services at Home.",
                    "Efficient QoS-Aware Service Composition with a Probabilistic Service Selection Policy.",
                    "Using Real-Time Scheduling Principles in Web Service Clusters to Achieve Predictability of Service Execution.",
                    "Aggregate Quality of Service Computation for Composite Services.",
                    "Creating Context-Adaptive Business Processes.",
                    "Statistical Quality Control for Human-Based Electronic Services.",
                    "A Requirement-Centric Approach to Web Service Modeling, Discovery, and Selection.",
                    "Spreadsheet as a Generic Purpose Mashup Development Environment.",
                    "Combining Enforcement Strategies in Service Oriented Architectures.",
                    "Fault Handling in the Web Service Stack.",
                    "Conjunctive Artifact-Centric Services.",
                    "Diagnosis of Service Failures by Trace Analysis with Partial Knowledge.",
                    "Automatic Fragment Identification in Workflows Based on Sharing Analysis.",
                    "Preventing SLA Violations in Service Compositions Using Aspect-Based Fragment Substitution.",
                    "Adaptive Management of Composite Services under Percentile-Based Service Level Agreements.",
                    "BPMN Modelling of Services with Dynamically Reconfigurable Transactions.",
                    "Programmable Fault Injection Testbeds for Complex SOA.",
                    "Abstracting and Applying Business Modeling Patterns from RosettaNet.",
                    "Heuristic Approaches for QoS-Based Service Selection.",
                    "From Quality to Utility: Adaptive Service Selection Framework.",
                    "Trust Assessment for Web Services under Uncertainty.",
                    "Incorporating Expectations as a Basis for Business Service Selection.",
                    "Enhancing Collaboration with IBM's Rational Jazztm.",
                    "Discovering Business Process Similarities: An Empirical Study with SAP Best Practice Business Processes.",
                    "A Scalable and Highly Available Brokering Service for SLA-Based Composite Services.",
                    "Business Artifacts Discovery and Modeling.",
                    "Carbon-Aware Business Process Design in Abnoba.",
                    "On Predicting Impacts of Customizations to Standard Business Processes.",
                    "Extended WS-Agreement Protocol to Support Multi-round Negotiations and Renegotiations.",
                    "Event-Driven Virtual Machine for Business Integration Middleware.",
                    "Consistent Integration of Selection and Replacement Methods under Different Expectations in Service Composition and Partner Management Life-Cycle.",
                    "Optimizing the Configuration of Web Service Monitors.",
                    "A Soft Constraint-Based Approach to QoS-Aware Service Selection.",
                    "Timed Conversational Protocol Based Approach for Web Services Analysis.",
                    "Service Discovery Using Communication Fingerprints.",
                    "Quantifying Service Compatibility: A Step beyond the Boolean Approaches.",
                    "Consistency Benchmarking: Evaluating the Consistency Behavior of Middleware Services in the Cloud.",
                    "Service Composition with Pareto-Optimality of Time-Dependent QoS Attributes.",
                    "QoS-Based Optimization of Service Compositions for Complex Workflows.",
                    "Privacy-Aware Device Identifier through a Trusted Web Service.",
                    "Towards Mitigating Human Errors in IT Change Management Process.",
                    "A Service-Based Architecture for Multi-domain Search on the Web.",
                    "Natural Language Service Composition with Request Disambiguation.",
                    "Families of SOA Migration.",
                    "An Ontology Based Approach for Cloud Services Catalog Management.",
                    "A Scalable Cloud-Based Queueing Service with Improved Consistency Levels.",
                    "Exploring Simulation-Based Configuration Decisions.",
                    "Efficient, Failure-Resilient Semantic Web Service Planning.",
                    "Integrated Service Process Adaptation.",
                    "Contract Based, Non-invasive, Black-Box Testing of Web Services.",
                    "Managing Process Model Collections with AProMoRe.",
                    "Managing Long-Tail Processes Using FormSys.",
                    "Managing Web Services: An Application in Bioinformatics.",
                    "An Integrated Solution for Runtime Compliance Governance in SOA.",
                    "Event-Driven Privacy Aware Infrastructure for Social and Health Systems Interoperability: CSS Platform.",
                    "Mashups with Mashlight.",
                    "A Service Mashup Tool for Open Document Collaboration.",
                    "Panta Rhei: Optimized and Ranked Data Processing over Heterogeneous Sources.",
                    "RnR: A System for Extracting Rationale from Online Reviews and Ratings.",
                    "Liquid Course Artifacts Software Platform.",
                    "A Programmble Fault Injection Testbed Generator for SOA.",
                    "BPEL'n'Aspects&Compensation: Adapted Service Orchestration Logic and Its Compensation Using Aspects.",
                    "A Tool for Integrating Pervasive Services and Simulating Their Composition.",
                    "BPEL4Pegasus: Combining Business and Scientific Workflows.",
                    "Multidisciplinary Views of Business Contracts.",
                    "Quantitative Service Analysis.",
                    "Scalable Services: Understanding Architecture Trade-off.",
                    "Crowd-Driven Processes: State of the Art and Research Challenges."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2010w",
                "sub_name": "Service-Oriented Computing - ICSOC 2010 International Workshops, PAASC, WESOA, SEE, and SOC-LOG, San Francisco, CA, USA, December 7-10, 2010, Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Introduction to the First International Workshop on Performance Assessment and Auditing in Service Computing (PAASC 2010).",
                    "A Case Study on Optimizing Web Service Monitoring Configurations.",
                    "Configuration Decision Making Using Simulation-Generated Data.",
                    "On the Formal Specification of Regulatory Compliance: A Comparative Analysis.",
                    "Performance and Cost Assessment of Cloud Services.",
                    "Towards Assessing Performance in Service Computing.",
                    "Engineering Service-Oriented Applications 6th International Workshop WESOA 2010.",
                    "Adaptation of Web Services Based on QoS Satisfaction.",
                    "CAGE: Customizable Large-Scale SOA Testbeds in the Cloud.",
                    "Engineering High Performance Service-Oriented Pipeline Applications with MeDICi.",
                    "Facilitating Enterprise Service Discovery for Non-technical Business Users.",
                    "Hypermedia-Driven RESTful Service Composition.",
                    "Process Restructuring in the Presence of Message-Dependent Variables.",
                    "Simple Metric for Assessing Quality of Service Design.",
                    "Wisdom-Aware Computing: On the Interactive Recommendation of Composition Knowledge.",
                    "Introduction to the First International Workshop on Services, Energy, and Ecosystem (SEE 2010).",
                    "A Dynamic Power Management Controller for Optimizing Servers' Energy Consumption in Service Centers.",
                    "An Energy Aware Context Model for Green IT Service Centers.",
                    "Creating Environmental Awareness in Service Oriented Software Engineering.",
                    "Towards Green Business Process Reengineering.",
                    "Business Process Improvement in Abnoba.",
                    "Towards a Service-Oriented Energy Market: Current State and Trend.",
                    "Introduction to the Second International Workshop on Service Oriented Computing in Logistics (SOC-LOG 2010).",
                    "Coordinating Distributed Operations.",
                    "Early Model-Analysis of Logistics Systems.",
                    "Event-Driven Services: Integrating Production, Logistics and Transportation.",
                    "Preselection of Electronic Services by Given Business Services Based on Semantic Concept Correspondence Applied for the Logistics Domain.",
                    "Realizing Process Modifications in Container Terminals with SOA - A Prototype."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "7th ICSOC / 2. ServiceWave 2009",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2009",
                "sub_name": "Service-Oriented Computing, 7th International Joint Conference, ICSOC-ServiceWave 2009, Stockholm, Sweden, November 24-27, 2009. Proceedings.",
                "count": 54,
                "papers": [
                    "Facilitating Workflow Interoperation Using Artifact-Centric Hubs.",
                    "Aspect Orientation for Composite Services in the Telecommunication Domain.",
                    "Intelligent Overload Control for Composite Web Services.",
                    "Trust-Oriented Composite Service Selection and Discovery.",
                    "A Two-Tiered Approach to Enabling Enhanced Service Discovery in Embedded Peer-to-Peer Systems.",
                    "Web Service Selection with Incomplete or Inconsistent User Preferences.",
                    "Energy-Aware Design of Service-Based Applications.",
                    "Action Patterns in Business Process Models.",
                    "Artifact-Centric Workflow Dominance.",
                    "Requirements-Driven Collaborative Choreography Customization.",
                    "An Automatic Approach to Enable Replacement of Conversational Services.",
                    "Towards Adaptable SOA: Model Driven Development, Context and Aspect.",
                    "Modeling Service Level Agreements with Binary Decision Diagrams.",
                    "Provider-Composer Negotiations for Semantic Robustness in Service Compositions.",
                    "Evaluating Contract Compatibility for Service Composition in the SeCO2 Framework.",
                    "Explaining the Non-compliance between Templates and Agreement Offers in WS-Agreement.",
                    "A Probabilistic Approach to Service Selection with Conditional Contracts and Usage Patterns.",
                    "ServiceTrust: Supporting Reputation-Oriented Service Selection.",
                    "QoS Browsing for Web Service Selection.",
                    "An Orchestration as a Service Infrastructure Using Grid Technologies and WS-BPEL.",
                    "The FAST Platform: An Open and Semantically-Enriched Platform for Designing Multi-channel and Enterprise-Class Gadgets.",
                    "Message-Oriented Middleware with QoS Awareness.",
                    "Learning the Control-Flow of a Business Process Using ICN-Based Process Models.",
                    "Fine-Grained Recommendation Systems for Service Attribute Exchange.",
                    "A Generative Framework for Service Process Composition.",
                    "Achieving Predictability and Service Differentiation in Web Services.",
                    "Incorporating Security Requirements into Service Composition: From Modelling to Execution.",
                    "End-to-End Security for Enterprise Mashups.",
                    "A Genetic Algorithms-Based Approach for Optimized Self-protection in a Pervasive Service Middleware.",
                    "Role of Process Modeling in Software Service Design.",
                    "Assisting Trustworthiness Based Web Services Selection Using the Fidelity of Websites.",
                    "Web Service Search on Large Scale.",
                    "Enabling Adaptation of Pervasive Flows: Built-in Contextual Adaptation.",
                    "A Service-Oriented UML Profile with Formal Support.",
                    "Designing Workflows on the Fly Using e-BioFlow.",
                    "Measuring the Quality of Service Oriented Design.",
                    "Specification, Verification and Explanation of Violation for Data Aware Compliance Rules.",
                    "Generating Interface Grammars from WSDL for Automated Verification of Web Services.",
                    "Satisfaction of Control Objectives by Control Processes.",
                    "Effective and Flexible NFP-Based Ranking of Web Services.",
                    "Combining Quality of Service and Social Information for Ranking Services.",
                    "Web Services Reputation Assessment Using a Hidden Markov Model.",
                    "MC-Cube: Mastering Customizable Compliance in the Cloud.",
                    "Another Approach to Service Instance Migration.",
                    "Distributed Cross-Domain Configuration Management.",
                    "A Pluggable Framework for Tracking and Managing Faults in Service-Oriented Systems.",
                    "Distributed Access Control Management - A XACML-Based Approach.",
                    "Engage: Engineering Service Modes with WS-Engineer and Dino.",
                    "FAST-SE: An ESB Based Framework for SLA Trading.",
                    "Gelee: Cooperative Lifecycle Management for (Composite) Artifacts.",
                    "Hosted Universal Integration on the Web: The mashArt Platform.",
                    "Sec-MoSC Tooling - Incorporating Security Requirements into Service Composition.",
                    "Services Inside the Smart Home: A Simulation and Visualization Tool.",
                    "SLA Management and Contract-Based Service Execution."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2009w",
                "sub_name": "Service-Oriented Computing. ICSOC/ServiceWave 2009 Workshops - International Workshops, ICSOC/ServiceWave 2009, Stockholm, Sweden, November 23-27, 2009, Revised Selected Papers.",
                "count": 54,
                "papers": [
                    "Future Research Topics in Enterprise Architecture Management - A Knowledge Management Perspective.",
                    "Enterprise Architecture Principles: Literature Review and Research Directions.",
                    "Something Is Missing: Enterprise Architecture from a Systems Theory Perspective.",
                    "A Reassessment of Enterprise Architecture Implementation.",
                    "The Dynamic Architecture Maturity Matrix: Instrument Analysis and Refinement.",
                    "Decoupling Models and Visualisations for Practical EA Tooling.",
                    "Cross-Organizational Security - The Service-Oriented Difference.",
                    "Enterprise Oriented Services - (Position Paper).",
                    "Automated Realization of Business Workflow Specification.",
                    "PeopleCloud for the Globally Integrated Enterprise.",
                    "Public Disclosure versus Private Practice: Challenges in Business Process Management (Position Paper).",
                    "Analysing Dependencies in Service Compositions.",
                    "Open Service-Oriented Computing for Logistics: A Case in Courier, Express and Parcel Networks.",
                    "Gain in Transparency versus Investment in the EPC Network - Analysis and Results of a Discrete Event Simulation Based on a Case Study in the Fashion Industry.",
                    "Using Automated Analysis of Temporal-Aware SLAs in Logistics.",
                    "Flexible SLA Negotiation Using Semantic Annotations.",
                    "Runtime Prediction of Service Level Agreement Violations for Composite Services.",
                    "A Framework for Multi-level SLA Management.",
                    "EC2 Performance Analysis for Resource Provisioning of Service-Oriented Applications.",
                    "On the Design of Compliance Governance Dashboards for Effective Compliance and Audit Management.",
                    "Transformation of Intermediate Nonfunctional Properties for Automatic Service Composition.",
                    "Dealing with Fixable and Non-fixable Properties in Service Matchmaking.",
                    "Using SLA Mapping to Increase Market Liquidity.",
                    "Translation of Service Level Agreements: A Generic Problem Definition.",
                    "Ontology-Based Feature Aggregation for Multi-valued Ranking.",
                    "Multi-level Monitoring and Analysis of Web-Scale Service Based Applications.",
                    "Calculating Service Fitness in Service Networks.",
                    "Applying Process Mining in SOA Environments.",
                    "Monitoring within an Autonomic Network: A GANA Based Network Monitoring Framework.",
                    "An Extensible Monitoring and Adaptation Framework.",
                    "Cross-Layer Adaptation and Monitoring of Service-Based Applications.",
                    "Towards a Unified Architecture for Resilience, Survivability and Autonomic Fault-Management for Self-managing Networks.",
                    "Replacement Policies for Service-Based Systems.",
                    "Retry Scopes to Enable Robust Workflow Execution in Pervasive Environments.",
                    "Integrating Complex Events for Collaborating and Dynamically Changing Business Processes.",
                    "Towards Business-Oriented Monitoring and Adaptation of Distributed Service-Based Applications from a Process Owner's Viewpoint.",
                    "Adaptation of Service-Based Applications Based on Process Quality Factor Analysis.",
                    "Delivering Multimedia in Autonomic Networking Environments.",
                    "An Initial Proposal for Data-Aware Resource Analysis of Orchestrations with Applications to Predictive Monitoring.",
                    "Service Customization by Variability Modeling.",
                    "Towards a Quality Model for Choreography.",
                    "Towards a Conceptual Framework for Legacy to SOA Migration.",
                    "MINERVA: Model drIveN and sErvice oRiented Framework for the Continuous Business Process improVement and relAted Tools.",
                    "Design for Adaptation of Service-Based Applications: Main Issues and Requirements.",
                    "Towards Runtime Migration of WS-BPEL Processes.",
                    "Encapsulating Multi-stepped Web Forms as Web Services.",
                    "Adapter Patterns for Resolving Mismatches in Service Discovery.",
                    "Lightweight Composition of Ad-Hoc Enterprise-Class Applications with Context-Aware Enterprise Mashups.",
                    "User-Centric Composition of Service Front-Ends at the Presentation Layer.",
                    "On the Support of Dynamic Service Composition at Runtime.",
                    "Rethinking the Semantic Annotation of Services.",
                    "Service Composition for Everyone: A Study of Risks and Benefits.",
                    "Using Personal Information Management Infrastructures to Facilitate User-Generated Services for Personal Use.",
                    "Towards Ontology Matching for Intelligent Gadgets."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "6th ICSOC 2008",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2008",
                "sub_name": "Service-Oriented Computing - ICSOC 2008, 6th International Conference, Sydney, Australia, December 1-5, 2008. Proceedings.",
                "count": 68,
                "papers": [
                    "Web Scale Computing: The Power of Infrastructure as a Service.",
                    "Services in the Long Tail World: Challenges and Opportunities.",
                    "Services for Science.",
                    "Managing and Internet Service Bus.",
                    "Quality-Driven Business Policy Specification and Refinement for Service-Oriented Systems.",
                    "Adaptation of Web Service Composition Based on Workflow Patterns.",
                    "Protocol-Based Web Service Composition.",
                    "Design and Implementation of a Fault Tolerant Job Flow Manager Using Job Flow Patterns and Recovery Policies.",
                    "Building Mashups for the Enterprise with SABRE.",
                    "Adaptation of Service Protocols Using Process Algebra and On-the-Fly Reduction Techniques.",
                    "Automatic Workflow Graph Refactoring and Completion.",
                    "Authorization and User Failure Resiliency for WS-BPEL Business Processes.",
                    "Reasoning on Semantically Annotated Processes.",
                    "Event-Driven Quality of Service Prediction.",
                    "Automatic Realization of SOA Deployment Patterns in Distributed Environments.",
                    "The LLAMA Middleware Support for Accountable Service-Oriented Architecture.",
                    "ubiSOAP: A Service Oriented Middleware for Seamless Networking.",
                    "Towards a Service-Oriented Approach for Managing Context in Mobile Environment.",
                    "An Autonomic Middleware Solution for Coordinating Multiple QoS Controls.",
                    "Transparent Runtime Adaptability for BPEL Processes.",
                    "Organizational Constraints to Realizing Business Value from Service Oriented Architectures: An Empirical Study of Financial Service Institutions.",
                    "E-Marketplace for Semantic Web Services.",
                    "Business Driven SOA Customization.",
                    "Sound Multi-party Business Protocols for Service Networks.",
                    "Automatic Mash Up of Composite Applications.",
                    "Non-desynchronizable Service Choreographies.",
                    "A Framework for Semantic Sensor Network Services.",
                    "Context-Driven Autonomic Adaptation of SLA.",
                    "Determining QoS of WS-BPEL Compositions.",
                    "An Initial Approach to Explaining SLA Inconsistencies.",
                    "Ontology-Based Compatibility Checking for Web Service Configuration Management.",
                    "SOAlive Service Catalog: A Simplified Approach to Describing, Discovering and Composing Situational Enterprise Services.",
                    "WorldTravel: A Testbed for Service-Oriented Applications.",
                    "TCP-Compose* - A TCP-Net Based Algorithm for Efficient Composition of Web Services Using Qualitative Preferences.",
                    "A Runtime Quality Architecture for Service-Oriented Systems.",
                    "QoS Policies for Business Processes in Service Oriented Architectures.",
                    "Deriving Business Service Interfaces in Windows Workflow from UMM Transactions.",
                    "From Business Process Models to Web Services Orchestration: The Case of UML 2.0 Activity Diagram to BPEL.",
                    "Batch Invocation of Web Services in BPEL Process.",
                    "Formation of Service Value Networks for Decentralized Service Provisioning.",
                    "Towards Automated WSDL-Based Testing of Web Services.",
                    "Automated Service Composition with Adaptive Planning.",
                    "A Planning-Based Approach for the Automated Configuration of the Enterprise Service Bus.",
                    "Verifying Interaction Protocol Compliance of Service Orchestrations.",
                    "Specify Once Test Everywhere: Analyzing Invariants to Augment Service Descriptions for Automated Test Generation.",
                    "A Model-Driven Approach to Dynamic and Adaptive Service Brokering Using Modes.",
                    "Integrated Security Context Management of Web Components and Services in Federated Identity Environments.",
                    "Predicting and Learning Executability of Composite Web Services.",
                    "Authorization Policy Based Business Collaboration Reliability Verification.",
                    "VGC: Generating Valid Global Communication Models of Composite Services Using Temporal Reasoning.",
                    "A Framework for Advanced Modularization and Data Flow in Workflow Systems.",
                    "Model Identification for Energy-Aware Management of Web Service Systems.",
                    "LASS - License Aware Service Selection: Methodology and Framework.",
                    "Integrated and Composable Supervision of BPEL Processes.",
                    "Optimised Semantic Reasoning for Pervasive Service Discovery.",
                    "COSMA - An Approach for Managing SLAs in Composite Services.",
                    "Resource Calculations with Constraints, and Placement of Tenants and Instances for Multi-tenant SaaS Applications.",
                    "SPIN: Service Performance Isolation Infrastructure in Multi-tenancy Environment.",
                    "Management as a Service for IT Service Management.",
                    "SMART: Application of a Method for Migration of Legacy Systems to SOA Environments.",
                    "Discovering and Deriving Service Variants from Business Process Specifications.",
                    "Market Overview of Enterprise Mashup Tools.",
                    "Siena: From PowerPoint to Web App in 5 Minutes.",
                    "Exploration of Discovered Process Views in Process Spaceship.",
                    "ROME4EU: A Web Service-Based Process-Aware System for Smart Devices.",
                    "WS-Engineer 2008.",
                    "MetaCDN: Harnessing Storage Clouds for High Performance Content Delivery.",
                    "Yowie: Information Extraction in a Service Enabled World."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2008w",
                "sub_name": "Service-Oriented Computing - ICSOC 2008 Workshops, ICSOC 2008 International Workshops, Sydney, Australia, December 1st, 2008, Revised Selected Papers.",
                "count": 40,
                "papers": [
                    "Introduction: Fourth International Workshop on Engineering Service-Oriented Applications (WESOA 2008).",
                    "What Would Smart Services Look Like.",
                    "Design of Composable Services.",
                    "A Conceptual Framework for Unified and Comprehensive SOA Management.",
                    "A Metrics Suite for Evaluating Flexibility and Complexity in Service Oriented Architectures.",
                    "Simulation of IT Service Processes with Petri-Nets.",
                    "Automatic Test Case Generation for Interacting Services.",
                    "Detecting Behavioural Incompatibilities between Pairs of Services.",
                    "On Supporting the Design of Human-Provided Services in SOA.",
                    "Model Transformations to Leverage Service Networks.",
                    "Building Scientific Workflow with Taverna and BPEL: A Comparative Study in caGrid.",
                    "Introduction: Second International Workshop on Web APIs and Services Mashups (Mashups 2008).",
                    "Innovation in the Programmable Web: Characterizing the Mashup Ecosystem.",
                    "The Changing Role of IT Departments in Enterprise Mashup Environments.",
                    "The Mashup Atelier.",
                    "The Reverse C10K Problem for Server-Side Mashups.",
                    "Creating a 'Cloud Storage' Mashup for High Performance, Low Cost Content Delivery.",
                    "Introduction: First International Workshop on Quality of Service Concerns in Service Oriented Architectures (QoSCSOA 2008).",
                    "Challenges in Integrating Tooling and Monitoring for QoS Provisioning in SOA Systems (Keynote).",
                    "A Scalable Approach for QoS-Based Web Service Selection.",
                    "Towards QoS-Based Web Services Discovery.",
                    "A Redundancy Protocol for Service-Oriented Architectures.",
                    "A Context-Aware Trust Model for Service-Oriented Multi-Agent Systems.",
                    "Three Common Mistakes in Modeling and Analysis of QoS of Service-Oriented Systems.",
                    "Introduction: First International Workshop on Enabling Service Business Ecosystems (ESBE 2008).",
                    "Describing Services for Service Ecosystems.",
                    "Service Selection in Business Service Ecosystem.",
                    "On the Feasibility of Bilaterally Agreed Accounting of Resource Consumption.",
                    "On Analyzing Evolutionary Changes of Web Services.",
                    "Standardization as a Business Ecosystem Enabler.",
                    "Managing Quality of Human-Based eServices.",
                    "Introduction: Third Workshop on Trends in Enterprise Architecture Research (TEAR 2008).",
                    "Towards a Sophisticated Understanding of Service Design for Enterprise Architecture.",
                    "A Conceptual Framework for the Governance of Service-Oriented Architectures.",
                    "Using Enterprise Architecture Models and Bayesian Belief Networks for Failure Impact Analysis.",
                    "Assessing System Availability Using an Enterprise Architecture Analysis Approach.",
                    "An Information Model for Landscape Management - Discussing Temporality Aspects.",
                    "A Lightweight Method for the Modelling of Enterprise Architectures.",
                    "A Contingency Approach to Enterprise Architecture Method Engineering.",
                    "Towards a Common Terminology in the Discipline of Enterprise Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2008phd",
                "sub_name": "Proceedings of the PhD Symposium at the 6th International Conference on Service Oriented Computing (ICSOC 2008), Sydney, Australia, 1 December 2008.",
                "count": 14,
                "papers": [
                    "Preface.",
                    "Advice to Service-Oriented Computing Research Students.",
                    "Distributed and Scalable QoS Optimization for Dynamic Web Service Composition.",
                    "Quality-driven Design and Management of Service-oriented Software Systems.",
                    "Supporting Documentation and Evolution of Crosscutting Concerns in Business Processes.",
                    "Pervasive Services Engineering for SOAs.",
                    "Towards Adaptive Service Development.",
                    "An Architecture Approach to Dependable Trust-based Service Systems.",
                    "Authorization Control in Business Collaboration.",
                    "TPIM: Transparent Privacy-Enhanced Identity Management of Web Services.",
                    "Measuring Similarity of Service Interfaces.",
                    "Realizing the Internet of Things in Service-Centric Environments.",
                    "External Behavior Modeling Enrichment of Web Services by Transactional Constraints.",
                    "A Graph b-coloring Based Scheme for Composition-Oriented Web Services Abstraction: COWSA."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "5th ICSOC 2007",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2007",
                "sub_name": "Service-Oriented Computing - ICSOC 2007, Fifth International Conference, Vienna, Austria, September 17-20, 2007, Proceedings.",
                "count": 60,
                "papers": [
                    "Pattern Based SOA Deployment.",
                    "A Domain-Specific Language for Web APIs and Services Mashups.",
                    "BPEL4Job: A Fault-Handling Design for Job Flow Management.",
                    "Faster and More Focused Control-Flow Analysis for Business Process Models Through SESE Decomposition.",
                    "Discovering Service Compositions That Feature a Desired Behaviour.",
                    "An Hybrid, QoS-Aware Discovery of Semantic Web Services Using Constraint Programming.",
                    "Architectural Decisions and Patterns for Transactional Workflows in SOA.",
                    "Bite: Workflow Composition for the Web.",
                    "Stochastic Modeling of Composite Web Services for Closed-Form Analysis of Their Performance and Reliability Bottlenecks.",
                    "SLA-Based Advance Reservations with Flexible and Adaptive Time QoS Parameters.",
                    "Monitoring the QoS for Web Services.",
                    "Q-Peer: A Decentralized QoS Registry Architecture for Web Services.",
                    "Business Process Regression Testing.",
                    "Auditing Business Process Compliance.",
                    "Specification and Verification of Artifact Behaviors in Business Process Models.",
                    "Improving Temporal-Awareness of WS-Agreement.",
                    "Maintaining Data Dependencies Across BPEL Process Fragments.",
                    "Supporting Dynamics in Service Descriptions - The Key to Automatic Service Usage.",
                    "Grid Application Fault Diagnosis Using Wrapper Services and Machine Learning.",
                    "Stochastic COWS.",
                    "Service License Composition and Compatibility Analysis.",
                    "Dynamic Requirements Specification for Adaptable and Open Service-Oriented Systems.",
                    "High Performance Approach for Multi-QoS Constrained Web Services Selection.",
                    "Negotiation of Service Level Agreements: An Architecture and a Search-Based Approach.",
                    "Byzantine Fault Tolerant Coordination for Web Services Atomic Transactions.",
                    "Syntactic Validation of Web Services Security Policies.",
                    "An Agent-Based, Model-Driven Approach for Enabling Interoperability in the Area of Multi-brand Vehicle Configuration.",
                    "User-Driven Service Lifecycle Management - Adopting Internet Paradigms in Telecom Services.",
                    "Run-Time Monitoring for Privacy-Agreement Compliance.",
                    "Task Memories and Task Forums: A Foundation for Sharing Service-Based Personal Processes.",
                    "Addressing the Issue of Service Volatility in Scientific Workflows.",
                    "Facilitating Mobile Service Provisioning in IP Multimedia Subsystem (IMS) Using Service Oriented Architecture.",
                    "eServices for Hospital Equipment.",
                    "Using Reo for Service Coordination.",
                    "A Context-Aware Service Discovery Framework Based on Human Needs Model.",
                    "Weight Assignment of Semantic Match Using User Values and a Fuzzy Approach.",
                    "Grounding OWL-S in SAWSDL.",
                    "A Declarative Approach for QoS-Aware Web Service Compositions.",
                    "Supporting QoS Negotiation with Feature Modeling.",
                    "A Multi-criteria Service Ranking Approach Based on Non-Functional Properties Rules Evaluation.",
                    "A Development Process for Self-adapting Service Oriented Applications.",
                    "Automated Dynamic Maintenance of Composite Services Based on Service Reputation.",
                    "Verifying Temporal and Epistemic Properties of Web Service Compositions.",
                    "Research and Implementation of Knowledge-Enhanced Information Services.",
                    "A Model and Rule Driven Approach to Service Integration with Eclipse Modeling Framework.",
                    "Semantic Web Services in Action - Enterprise Information Integration.",
                    "Policy Based Messaging Framework.",
                    "Contextualized B2B Registries.",
                    "Bridging Architectural Boundaries Design and Implementation of a Semantic BPM and SOA Governance Tool.",
                    "SOA and Large Scale and Complex Enterprise Transformation.",
                    "Run-Time Adaptation of Non-functional Properties of Composite Web Services Using Aspect-Oriented Programming.",
                    "Software as a Service: An Integration Perspective.",
                    "Building Data-Intensive Grid Applications with Globus Toolkit - An Evaluation Based on Web Crawling.",
                    "QoS-Aware Web Service Compositions Using Non-intrusive Policy Attachment to BPEL.",
                    "Execution Optimization for Composite Services Through Multiple Engines.",
                    "Service Design Process for Reusable Services: Financial Services Case Study.",
                    "UMM Add-In: A UML Extension for UN/CEFACT's Modeling Methodology.",
                    "CP4TWS - A Prototype Demonstrating Context and Policies for Transactional Web Services.",
                    "WSQoSX - A QoS Architecture for Web Service Workflows.",
                    "ReoService: Coordination Modeling Tool."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2007w",
                "sub_name": "Service-Oriented Computing - ICSOC 2007 Workshops, International Workshops, Vienna, Austria, September 17, 2007, Revised Selected Papers.",
                "count": 42,
                "papers": [
                    "Mashups'07: First International Workshop on Web APIs and Services Mashups.",
                    "Itinerary Planner: A Mashup Case Study.",
                    "Let It Flow: Building Mashups with Data Processing Pipelines.",
                    "Is There a Market for Web Services?",
                    "Non-Functional Properties and Service Level Agreements in Service-Oriented Computing (NFPSLA-SOC '07) - Organizers' Workshop Summary.",
                    "Non-Functional Property Driven Service Governance: Performance Implications.",
                    "Dynamic Service Provisioning Using GRIA SLAs.",
                    "Introducing Preferences over NFPs into Service Selection in SOA.",
                    "Managing Non-Functional Properties of Inter-enterprise Business Service Delivery.",
                    "Non-functional Parameters as First Class Citizens in Service Description and Matchmaking - An Integrated Approach.",
                    "On User Preferences and Utility Functions in Selection: A Semantic Approach.",
                    "onQoS-QL: A Query Language for QoS-Based Service Selection and Ranking.",
                    "Service Selection Based on Non-functional Properties.",
                    "A Framework for the Management of Dynamic SLAs in Composite Service Scenarios.",
                    "A Semantic QoS-Based Web Service Discovery Engine for Over-Constrained QoS Demands.",
                    "Temporal-Awareness in SLAs: Why Should We Be Concerned?",
                    "Second International SeMSoC Workshop - Business Oriented Aspects Concerning Semantics and Methodologies in Service-Oriented Computing.",
                    "Towards a Methodology for Semantic Business Process Modeling and Configuration.",
                    "Decoupling of Heterogeneous Semantic Service Annotations and Their Semantic Models - Towards an Integrated Approach in a Multi-Service-Provider-Scenario.",
                    "An Execution Engine for Semantic Business Processes.",
                    "Goal-Equivalent Secure Business Process Re-engineering.",
                    "Deriving SOA Evaluation Metrics in an Enterprise Architecture Context.",
                    "Querying in Business Process Modeling.",
                    "First International Workshop on Telecom Service Oriented Architectures (TSOA-07).",
                    "Mobile Ontology: Towards a Standardized Semantic Model for the Mobile Domain.",
                    "Validation Aspects of Automatic Service Composition.",
                    "Dealing with Active and Stateful Services in the Service-Oriented Architecture.",
                    "Design and Analysis of the Composed Telecom Services.",
                    "A Business-Level Service Model Supporting End-User Customization.",
                    "Web Service Based Asynchronous Service Execution Environment.",
                    "Towards Context-Aware Telecom End User Services through SOA.",
                    "Semantically Enabled Framework for User Centric Profile Description, Search and Match.",
                    "Third International Workshop on Engineering Service-Oriented Applications: Analysis, Design & Composition.",
                    "Towards Self-management in Service-Oriented Computing with Modes.",
                    "StPowla: SOA, Policies and Workflows.",
                    "A Fault Taxonomy for Web Service Composition.",
                    "Pluggable Framework for Enabling the Execution of Extended BPEL Behavior.",
                    "Variability-Driven Selection of Services for Service Compositions.",
                    "Web Service Choreography Configurations for BPMN.",
                    "Goal Preservation by Choreography-Driven Matchmaking.",
                    "From OWL-S Descriptions to Petri Nets.",
                    "Designing Web-Based Mobile Services with REST."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "4th ICSOC 2006",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2006",
                "sub_name": "Service-Oriented Computing - ICSOC 2006, 4th International Conference, Chicago, IL, USA, December 4-7, 2006, Proceedings.",
                "count": 61,
                "papers": [
                    "Requirements and Method for Assessment of Service Interoperability.",
                    "An Aspect-Oriented Framework for Service Adaptation.",
                    "Automated Generation of BPEL Adapters.",
                    "Division of Labor: Tools for Growing and Scaling Grids.",
                    "DECO: Data Replication and Execution CO-scheduling for Utility Grids.",
                    "Coordinated Co-allocator Model for Data Grid in Multi-sender Environment.",
                    "Adaptive Preference Specifications for Application Sessions.",
                    "Mobile Ad Hoc Services: Semantic Service Discovery in Mobile Ad Hoc Networks.",
                    "Discovering Web Services and JXTA Peer-to-Peer Services in a Unified Manner.",
                    "A Hierarchical Framework for Composing Nested Web Processes.",
                    "Using Dynamic Asynchronous Aggregate Search for Quality Guarantees of Multiple Web Services Compositions.",
                    "Service Composition (re)Binding Driven by Application-Specific QoS.",
                    "Design of Quality-Based Composite Web Services.",
                    "AMPol-Q: Adaptive Middleware Policy to Support QoS.",
                    "Adaptive Web Processes Using Value of Changed Information.",
                    "SCENE: A Service Composition Execution Environment Supporting Dynamic Changes Disciplined Through Rules.",
                    "A Self-healing Web Server Using Differentiated Services.",
                    "Quality of Service Enabled Database Applications.",
                    "A Model-Based Framework for Developing and Deploying Data Aggregation Services.",
                    "A Distributed Approach for the Federation of Heterogeneous Registries.",
                    "I-Queue: Smart Queues for Service Management.",
                    "Optimizing Differential XML Processing by Leveraging Schema and Statistics.",
                    "Optimized Web Services Security Performance with Differential Parsing.",
                    "Web Browsers as Service-Oriented Clients Integrated with Web Services.",
                    "Interaction Soundness for Service Orchestrations.",
                    "Modeling Web Services by Iterative Reformulation of Functional and Non-functional Requirements.",
                    ": A Calculus for Service Oriented Computing.",
                    "A Priori Conformance Verification for Guaranteeing Interoperability in Open Environments.",
                    "A Business-Aware Web Services Transaction Model.",
                    "Licensing Services: Formal Analysis and Implementation.",
                    "QoS Assessment of Providers with Complex Behaviours: An Expectation-Based Approach with Confidence.",
                    "A QoS-Aware Selection Model for Semantic Web Services.",
                    "UML-Based Service Discovery Framework.",
                    "BPEL-Unit: JUnit for BPEL Processes.",
                    "A User Driven Policy Selection Model.",
                    "Abstract Transaction Construct: Building a Transaction Framework for Contract-Driven, Service-Oriented Business Processes.",
                    "Securing Web Service Compositions: Formalizing Authorization Policies Using Event Calculus.",
                    "Supporting QoS Monitoring in Virtual Organisations.",
                    "Event Based Service Coordination over Dynamic and Heterogeneous Networks.",
                    "Implicit vs. Explicit Data-Flow Requirements in Web Service Composition Goals.",
                    "Light-Weight Semantic Service Annotations Through Tagging.",
                    "Service-Oriented Model-Driven Development: Filling the Extra-Functional Property Gap.",
                    "WSMX: A Semantic Service Oriented Middleware for B2B Integration.",
                    "Top Down Versus Bottom Up in Service-Oriented Integration: An MDA-Based Solution for Minimizing Technology Coupling.",
                    "Semantic Service Mediation.",
                    "Examining Usage Protocols for Service Discovery.",
                    "Sliver: A BPEL Workflow Process Execution Engine for Mobile Devices.",
                    "Automated Discovery of Compositions of Services Described with Separate Ontologies.",
                    "Dynamic Web Service Selection and Composition: An Approach Based on Agent Dialogues.",
                    "Leveraging Web Services Discovery with Customizable Hybrid Matching.",
                    "Assembly of Business Systems Using Service Component Architecture.",
                    "The End of Business as Usual: Service-Oriented Business Transformation.",
                    "A Service Oriented Reflective Wireless Middleware.",
                    "Procedures of Integration of Fragmented Data in a P2P Data Grid Virtual Repository, .",
                    "Towards Facilitating Development of SOA Application with Design Metrics.",
                    "Dynamic Service Oriented Architectures Through Semantic Technology.",
                    "A Service Oriented Architecture Supporting Data Interoperability for Payments Card Processing Systems.",
                    "Services-Oriented Computing in a Ubiquitous Computing Platform.",
                    "SCA Policy Association Framework.",
                    "A Model-Driven Development Approach to Creating Service-Oriented Solutions.",
                    "Towards Adaptive Management of QoS-Aware Service Compositions - Functional Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/icsoc/2006w",
                "sub_name": "Service-Oriented Computing, ICSOC 2006, 4th International Conference, Chicago, IL, USA, December 4-7, 2006, Workshops Proceedings.",
                "count": 17,
                "papers": [
                    "Managing SOA Through Business Services - A Business-Oriented Approach to Service-Oriented Architectures.",
                    "Reliable Scientific Service Compositions.",
                    "A Service-Oriented Architecture for Electric Power Transmission System Asset Management.",
                    "A Language for Quality of Service Requirements Specification in Web Services Orchestrations.",
                    "A Semi-automated Orchestration Tool for Service-Based Business Processes.",
                    "Web Service Composition: An Approach Using Effect-Based Reasoning.",
                    "Analysis of Composite Web Services Using Logging Facilities.",
                    "QoS Prediction for Composite Web Services with Transactions.",
                    "Service Aggregation Using Relational Operations on Interface Parameters.",
                    "A BPEL Based Implementation of Online Auctions.",
                    "Dynamic Binding for BPEL Processes - A Lightweight Approach to Integrate Semantics into Web Services.",
                    "A Model-Driven Approach for QoS Prediction of BPEL Processes.",
                    "Modelling of Service Compositions: Relations to Business Process and Workflow Modelling.",
                    "Extending the UN/CEFACT Modeling Methodology and Core Components for Intra-organizational Service Orchestration.",
                    "A Pattern-Based Approach to Business Process Modeling and Implementation in Web Services.",
                    "Integrating Semantic Business Policy into Web Service Composition.",
                    "Model Driven Service Domain Analysis."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "3rd ICSOC 2005",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2005",
                "sub_name": "Service-Oriented Computing - ICSOC 2005, Third International Conference, Amsterdam, The Netherlands, December 12-15, 2005, Proceedings.",
                "count": 54,
                "papers": [
                    "Autonomic Web Processes.",
                    "The (Service) Bus: Services Penetrate Everyday Life.",
                    "Service Oriented Architectures for Science Gateways on Grid Systems.",
                    "Toward a Programming Model for Service-Oriented Computing.",
                    "Speaking a Common Language: A Conceptual Model for Describing Service-Oriented Systems.",
                    "A Rule Driven Approach for Developing Adaptive Service Oriented Business Collaboration.",
                    "Pattern-Based Specification and Validation of Web Services Interaction Properties.",
                    "Using Test Cases as Contract to Ensure Service Compliance Across Releases.",
                    "Towards a Classification of Web Service Feature Interactions.",
                    "A High-Level Functional Matching for Semantic Web Services.",
                    "Service Selection Algorithms for Composing Complex Services with Multiple QoS Constraints.",
                    "On Service Discovery Process Types.",
                    "SPiDeR: P2P-Based Web Service Discovery.",
                    "An Approach to Temporal-Aware Procurement of Web Services.",
                    "Approaching Web Service Coordination and Composition by Means of Petri Nets. The Case of the Nets-Within-Nets Paradigm.",
                    "Modeling and Analyzing Context-Aware Composition of Services.",
                    "Towards Semi-automated Workflow-Based Aggregation of Web Services.",
                    "Choreography and Orchestration: A Synergic Approach for System Design.",
                    "PerfSONAR: A Service Oriented Architecture for Multi-domain Network Monitoring.",
                    "DySOA: Making Service Systems Self-adaptive.",
                    "Towards Dynamic Monitoring of WS-BPEL Processes.",
                    "Template-Based Automated Service Provisioning - Supporting the Agreement-Driven Service Life-Cycle.",
                    "Proactive Management of Service Instance Pools for Meeting Service Level Agreements.",
                    "Adaptive Component Management Service in ScudWare Middleware for Smart Vehicle Space.",
                    "Semantic Caching for Web Services.",
                    "ODEGSG Framework, Knowledge-Based Annotation and Design of Grid Services.",
                    "Implicit Service Calls in ActiveXML Through OWL-S.",
                    "Semantic Tuplespace.",
                    "Trust-Based Secure Workflow Path Construction.",
                    "Reputation-Based Service Level Agreements for Web Services.",
                    "Handling Faults in Decentralized Orchestration of Composite Web Services.",
                    "What's in an Agreement? An Analysis and an Extension of WS-Agreement.",
                    "SOA in the Real World - Experiences.",
                    "Service-Oriented Design: The Roots.",
                    "A Service Oriented Architecture for Deploying and Managing Network Services.",
                    "Dynamo: Dynamic Monitoring of WS-BPEL Processes.",
                    "WofBPEL: A Tool for Automated Analysis of BPEL Processes.",
                    "OpenWS-Transaction: Enabling Reliable Web Service Transactions.",
                    "ASTRO: Supporting Composition and Execution of Web Services.",
                    "Demonstrating Dynamic Configuration and Execution of Web Processes.",
                    "Programming and Compiling Web Services in GPSL.",
                    "Semantic Management of Web Services.",
                    "Composition of Services with Nondeterministic Observable Behavior.",
                    "Efficient and Transparent Web-Services Selection.",
                    "An Approach to Parameterizing Web Service Flows.",
                    "Dynamic Policy Management on Business Performance Management Architecture.",
                    "A Lightweight Formal Framework for Service-Oriented Applications Design.",
                    "A MDE Approach for Power Distribution Service Development.",
                    "Semantic Web Services for Activity-Based Computing.",
                    "The Price of Services.",
                    "Managing End-to-End Lifecycle of Global Service Policies.",
                    "Applying a Web Engineering Method to Design Web Services.",
                    "An Architecture for Unifying Web Services Authentication and Authorization.",
                    "Specifying Web Service Compositions on the Basis of Natural Language Requests."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "2nd ICSOC 2004",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2004",
                "sub_name": "Service-Oriented Computing - ICSOC 2004, Second International Conference, New York, NY, USA, November 15-19, 2004, Proceedings.",
                "count": 36,
                "papers": [
                    "Methodological support for service-oriented design with ISDL.",
                    "A service re-design methodology for multi-channel adaptation.",
                    "Service-based processes: design for business and technology.",
                    "Hybrid web service composition: business processes meet business rules.",
                    "Dynamic service composition using santic information.",
                    "Flexible coordination of service interaction patterns.",
                    "Connecting client objectives with resource capabilities: an essential component for grid service managent infrastructures.",
                    "Cremona: An Architecture and Library for Creation and Monitoring of WS-Agreents.",
                    "Hot service deployment in an ad hoc grid environment.",
                    "A framework for requirents monitoring of service based systems.",
                    "Associating assertions with business processes and monitoring their execution.",
                    "Synthesis of underspecified composite e-services based on automated reasoning.",
                    "Sound development of secure service-based systems.",
                    "Specification and querying of security constraints in the EFSOC framework.",
                    "A concrete solution for web services adaptability using policies and aspects.",
                    "Exact functional context matching for web services.",
                    "Discovering and ranking web services with BASIL: a personalized approach with biased focus.",
                    "Behavioral models as service descriptions.",
                    "SLA based profit optimization in autonomic computing systems.",
                    "Assured service quality by improved fault management.",
                    "Smart monitors for composed services.",
                    "Service portfolio measurement: a framework for evaluating the financial consequences of out-tasking decisions.",
                    "Toward autonomic web services trust and selection.",
                    "Knowledge-driven interactions with services across ad hoc networks.",
                    "A model for abstract process specification, verification and composition.",
                    "Web services: a process algebra approach.",
                    "Automated composition of e-services: lookaheads.",
                    "A service-oriented architecture for digital libraries.",
                    "Implementing integrated services of networked home appliances using service oriented architecture.",
                    "An OGSA-based accounting system for allocation enforcement across HPC centers.",
                    "Pitfalls of OWL-S: a practical semantic web use case.",
                    "Design framework for interoperable service interfaces.",
                    "Eliciting service composition in a goal driven manner.",
                    "Probabilistic, context-sensitive, and goal-oriented service selection.",
                    "Supporting policy-driven behaviors in web services: experiences and issues.",
                    "Server-side encoding, protocol and transport extensibility for remoting systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "1st ICSOC 2003",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icsoc/2003",
                "sub_name": "Service-Oriented Computing - ICSOC 2003, First International Conference, Trento, Italy, December 15-18, 2003, Proceedings.",
                "count": 38,
                "papers": [
                    "Capabilities: Describing What Services Can Do.",
                    "Representing Web Services with UML: A Case Study.",
                    "A Peer-to-Peer Advertising Game.",
                    "Automatic Composition of E-services That Export Their Behavior.",
                    "Service Discovery and Orchestration for Distributed Service Repositories.",
                    "Model Driven Service Composition.",
                    "Automating the Procurement of Web Services.",
                    "A Quality of Service Management Framework Based on User Expectations.",
                    "Reflective Architectures for Adaptive Information Systems.",
                    "E-healthcare via Customized Information Services: Addressing the Need for Factually Consistent Information.",
                    "\"Everything Personal, Not Just Business: \" Improving User Experience through Rule-Based Service Customization.",
                    "VINCA - A Visual and Personalized Business-Level Composition Language for Chaining Web-Based Services.",
                    "Stepwise Refinable Service Descriptions: Adapting DAML-S to Staged Service Trading.",
                    "Semantic Structure Matching for Assessing Web-Service Similarity.",
                    "Preliminary Report of Public Experiment of Semantic Service Matchmaker with UDDI Business Registry.",
                    "Comparing WSDL-Based and ebXML-Based Approaches for B2B Protocol Specification.",
                    "A Model-Driven Architecture for Electronic Service Management Systems.",
                    "The Business Grid: Providing Transactional Business Processes via Grid Services.",
                    "An Architectural Pattern to Extend the Interaction Model between Web-Services: The Location-Based Service Context.",
                    "PANDA: Specifying Policies for Automated Negotiations of Service Contracts.",
                    "Model Checking Correctness Properties of Electronic Contracts.",
                    "Supporting Dynamic Changes in Web Service Environments.",
                    "Planning and Monitoring the Execution of Web Service Requests.",
                    "WS-Workspace: Workspace Versioning for Web Services.",
                    "Secure Service Provision in Ad Hoc Networks.",
                    "Single Sign-On in Service-Oriented Computing.",
                    "Tracking Service Availability in Long Running Business Activities.",
                    "A Broker Architecture for Integrating Data Using a Web Services Environment.",
                    "Design and Implementation of the Multilingual Product Retrieval Agent through XML and the Semantic Networks in EC.",
                    "SpaceGlue: Linking Spaces for Adaptive and Situational Service Location.",
                    "Organizing Service-Oriented Peer Collaborations.",
                    "Service-Based Distributed Querying on the Grid.",
                    "Peer-to-Peer Process Execution with Osiris.",
                    "Disconnected Operation Service in Mobile Grid Computing.",
                    "A Policy Propagation Model Using Mobile Agents in Large-Scale Distributed Network Environments.",
                    "Location-Based Services in Ubiquitous Computing Environments.",
                    "Service Oriented Internet.",
                    "Service-Oriented Device Ecology Workflows."
                ]
            }
        ]
    }
]