[
    {
        "year": "2021",
        "name": "ICSSP / ICGSE 2021",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2021",
                "sub_name": "15th IEEE/ACM Joint International Conference on Software and System Processes, and 16th ACM/IEEE International Conference on Global Software Engineering ICSSP/ICGSE 2021, Madrid, Spain, May 17-19, 2021.",
                "count": 12,
                "papers": [
                    "Towards Shaping the Software Lifecycle with Methods and Practices.",
                    "Understanding Barriers to Internal Startups in Large Organizations: Evidence from a Globally Distributed Company.",
                    "Challenges in the Development of Mobile Online Services in the Automotive Industry - A Case Study.",
                    "Toward Understanding of Employee Motivation for Software InnerSourcing : Industrial Experience Report.",
                    "TaskAllocator: A Recommendation Approach for Role-based Tasks Allocation in Agile Software Development.",
                    "The Role of Skillset in the Determination of DevOps implementation Strategy.",
                    "Do Communities in Developer Interaction Networks align with Subsystem Developer Teams? An Empirical Study of Open Source Systems.",
                    "Timestamp-based Consistency Checking of Collaboratively Developed Engineering Artifacts.",
                    "Hierarchical Distribution of Consistency-relevant Changes in a Collaborative Engineering Environment.",
                    "Is Agile Not Agile Enough? A Study on How Agile is Applied and Misapplied in the Video Game Development Industry.",
                    "Supporting Agile Transformation: A Proposal for a Scientifically Founded Agile Assessment Model : Doctoral Paper.",
                    "An Empirical Investigation of Pull Requests in Partially Distributed BizDevOps Teams."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ICSSP 2020",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2020",
                "sub_name": "ICSSP '20: International Conference on Software and System Processes, Seoul, Republic of Korea, 26-28 June, 2020.",
                "count": 21,
                "papers": [
                    "Developing ML/DL Models: A Design Framework.",
                    "Do Instance-level Review Diagrams Support Validation Processes of Cyber-Physical System Specifications: Results from a Controlled Experiment.",
                    "Digital Re-imagination of Software and Systems Processes for Quality Engineering: iSPIN Approach.",
                    "Generating Use Case Scenarios from User Stories.",
                    "Process Implications of Executable Domain Models for Microservices Development.",
                    "Charting Coordination Needs in Large-Scale Agile Organisations with Boundary Objects and Methodological Islands.",
                    "Determining Context Factors for Hybrid Development Methods with Trained Models.",
                    "Why do Software Teams Deviate from Scrum?: Reasons and Implications.",
                    "Process Inspection Support: an Industrial Case Study.",
                    "Onboarding Bot for Newcomers to Software Engineering.",
                    "Experimentation for Business-to-Business Mission-Critical Systems: A Case Study.",
                    "Occurrence Frequency and All Historical Failure Information Based Method for TCP in CI.",
                    "Action-based Recommendation in Pull-request Development.",
                    "Emerging and Changing Tasks in the Development Process for Machine Learning Systems.",
                    "Constructing a Hybrid Software Process Simulation Model in Practice: An Exemplar from Industry.",
                    "How are Hybrid Development Approaches Organized?: A Systematic Literature Review.",
                    "EcoKnow: Engineering Effective, Co-created and Compliant Adaptive Case Management Systems for Knowledge Workers.",
                    "From Ad-Hoc Data Analytics to DataOps.",
                    "On the Role of Software Architecture in DevOps Transformation: An Industrial Case Study.",
                    "Towards Improving the Organization of Hybrid Development Approaches.",
                    "How to Treat the Use of Grey Literature in Software Engineering."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ICSSP 2019",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2019",
                "sub_name": "Proceedings of the International Conference on Software and System Processes, ICSSP 2019, Montreal, QC, Canada, May 25-26, 2019.",
                "count": 21,
                "papers": [
                    "Key features recommendation to improve bug reporting.",
                    "Towards a knowledge warehouse and expert system for the automation of SDLC tasks.",
                    "SPI is dead, isn't it?: clear the stage for continuous learning!",
                    "Success factors for effective process metrics operationalization in agile software development: a multiple case study.",
                    "TWINS: this workflow is not scrum: agile process adaptation for open source software projects.",
                    "Behavior-driven dynamics in agile development: the effect of fast feedback on teams.",
                    "On the benefits of using dedicated models in validation processes for behavioral specifications.",
                    "An ontology-driven approach to automating the process of integrating security software systems.",
                    "Recover and RELAX: concern-oriented software architecture recovery for systems development and maintenance.",
                    "How do startups develop internet-of-things systems: a multiple exploratory case study.",
                    "Evaluating coding behavior in software development processes: a process mining approach.",
                    "Using constraint mining to analyze software development processes.",
                    "The end of agile as we know it.",
                    "What are hybrid development methods made of?: an evidence-based characterization.",
                    "Towards unified software project monitoring for organizations using hybrid processes and tools.",
                    "Functional organization of software groups considered harmful.",
                    "Software quality models: a systematic mapping study.",
                    "A mapping study on product owners in industry: identifying future research directions.",
                    "The quest for productivity in software engineering: a practitioners systematic literature review.",
                    "Towards an agile concern-driven development process.",
                    "Continuous integration in validation of modern, complex, embedded systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ICSSP 2018",
        "info": "Gothenburg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2018",
                "sub_name": "Proceedings of the 2018 International Conference on Software and System Process, ICSSP 2018, Gothenburg, Sweden, May 26-27, 2018.",
                "count": 21,
                "papers": [
                    "Becoming Agile while preserving software product lines: an Agile transformation model for large companies.",
                    "From Scrum to Agile: a journey to tackle the challenges of distributed development in an Agile team.",
                    "A hybrid methodology for effort estimation in Agile development: an industrial evaluation.",
                    "Boundary objects in Agile practices: continuous management of systems engineering artifacts in the automotive domain.",
                    "Practitioners' eye on continuous software engineering: an interview study.",
                    "Measure early and decide fast: transforming quality management and measurement to continuous deployment.",
                    "Declarative project planning and controlling: a formal model to support the handling of unavoidable inconsistencies.",
                    "Adopting virtual reality as a medium for software development process education.",
                    "Informed projection: using what you know to make simple estimates of work better.",
                    "Discovering process maps from event streams.",
                    "Hierarchical performance analysis for process mining.",
                    "Using developers' features to estimate story points.",
                    "Empirical evaluation of the effects of experience on code quality and programmer productivity: an exploratory study.",
                    "On the effectiveness of unit tests in test-driven development.",
                    "Towards ensuring security by design in cyber-physical systems engineering processes.",
                    "Cinders: the continuous integration and delivery architecture framework.",
                    "Effect of time-pressure on perceived and actual performance in functional software testing.",
                    "Innovation initiatives in large software companies: a systematic mapping study.",
                    "In search of the origins and enduring impact of Agile software development.",
                    "An Agile transition starting with user stories, DoD & DoR.",
                    "Towards the systematic development of hybrid software development processes."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ICSSP 2017",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2017",
                "sub_name": "Proceedings of the 2017 International Conference on Software and System Process, Paris, France, ICSSP 2017, July 5-7, 2017.",
                "count": 22,
                "papers": [
                    "Software productivity decoded: how data science helps to achieve more (keynote).",
                    "Software engineering for connected health (journal first session).",
                    "Improving traceability management through tool integration: an experience in the automotive domain.",
                    "Mining collaboration patterns of software development processes based on trace alignment.",
                    "Tracing requirements in software design.",
                    "Hybrid software and system development in practice: waterfall, scrum, and beyond.",
                    "Requirements volatility in software architecture design: an exploratory case study.",
                    "A systematic map on verifying and validating software process simulation models.",
                    "Rapid, evolutionary, reliable, scalable system and software development: the resilient agile process.",
                    "Searching for common ground: existing literature on automotive agile software product lines.",
                    "How do agile practices support automotive SPICE compliance?",
                    "White-box prediction of process performance indicators via flow analysis.",
                    "Domain modeling for development process simulation.",
                    "Leveraging business process improvement with natural language processing and organizational semantic knowledge.",
                    "Data driven credit risk management process: a machine learning approach.",
                    "Using TRIZ to balance software process commonality and diversity.",
                    "Process-based project management and SPI.",
                    "Impact of task switching and work interruptions on software development processes.",
                    "WebProcessPAIR: recommendation system for software process improvement.",
                    "Towards capability-oriented business process management.",
                    "First international workshop on verification of business and software processes.",
                    "First international workshop on hybrid dEveLopmENt approaches in software systems development."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ICSSP 2016",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2016",
                "sub_name": "Proceedings of the International Conference on Software and Systems Process, ICSSP 2016, Austin, Texas, USA, May 14-15, 2016.",
                "count": 15,
                "papers": [
                    "Supporting the co-adaption of process properties.",
                    "Exploring the impact of situational context: a case study of a software development process for a microservices architecture.",
                    "Critical software cultures: analyses of processes in four domains.",
                    "How do process and team interaction depend on development technologies?: a case study on a combined setting of model-driven development and classical C coding.",
                    "Comparing pre commit reviews and post commit reviews using process simulation.",
                    "Towards efficient risk-identification in risk-driven development processes.",
                    "Understanding and improving effort estimation in Agile software development: an industrial case study.",
                    "Calibrating COCOMO® II for projects with high personnel turnover.",
                    "An exploratory study on functional size measurement based on code.",
                    "Software process models vs. descriptions: what do practitioners use and need?",
                    "CMMI guided process improvement for DevOps projects: an exploratory case study.",
                    "A complexity theory viewpoint on the software development process and situational context.",
                    "Research findings from an industrial trial of a traceability assessment and implementation framework.",
                    "Success factors in managing legacy system evolution: a case study.",
                    "Tailoring MDevSPICE® for mobile medical apps."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ICSSP 2015",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2015",
                "sub_name": "Proceedings of the 2015 International Conference on Software and System Process, ICSSP 2015, Tallinn, Estonia, August 24 - 26, 2015.",
                "count": 41,
                "papers": [
                    "Big software on the run: in vivo software analytics based on process mining (keynote).",
                    "How is the software development process impacted when a large company goes agile? (keynote).",
                    "Software development as an experiment system (keynote).",
                    "Piloting MDevSPICE: the medical device software process assessment framework.",
                    "Development and validation of the MedITNet assessment framework: improving risk management of medical IT networks.",
                    "Process model for rapid implementation of features using flexible architecture.",
                    "Towards a change-aware process environment for system and software process.",
                    "Automated team selection and compliance checking in business processes.",
                    "Ant colony algorithm based scheduling for handling software project delay.",
                    "Integrated systems engineering and software requirements engineering for technical systems.",
                    "Tailoring process requirements for software product assurance.",
                    "Conceiving the model-driven smart factory.",
                    "A reactive architecture for cloud-based system engineering.",
                    "A reference model for simulating agile processes.",
                    "The agile practices impact model: idea, concept, and application scenario.",
                    "Exploring the use of the cynefin framework to inform software development approach decisions.",
                    "Measuring productivity in agile software development process: a scoping study.",
                    "Software process improvement: where is the evidence?: initial findings from a systematic mapping study.",
                    "A large-scale survey on the effects of selected development practices on software correctness.",
                    "How do artifact models help direct SPI projects?",
                    "Software process line discovery.",
                    "A process mining approach to measure how users interact with software: an industrial case study.",
                    "Software process reflexivity and business performance: initial results from an empirical study.",
                    "Process simulation for software engineering education.",
                    "Constructing hybrid software process simulation models.",
                    "A conceptual framework for lean regulated software development.",
                    "Towards smart logistics processes: a predictive monitoring and proactive adaptation approach.",
                    "Squirrel: an architecture for the systematic collection of software development data in microenterprises to support lean software development.",
                    "Visualizing centrality of process area networks in CMMI-DEV.",
                    "The incremental commitment spiral model (ICSM): principles and practices for successful systems and software.",
                    "Strategic business process management.",
                    "Tackling the incompleteness of software engineering education with the ESSENCE kernel.",
                    "Summary of the 1st international workshop on impact of agile practices (ImpAct 2015).",
                    "Summary of the 1st international workshop on open innovation in software engineering (OISE 2015).",
                    "Process model for open innovation.",
                    "Software testing in open innovation: an exploratory case study of the acceptance test harness for jenkins.",
                    "A study plan: open innovation based on internet data mining in software engineering.",
                    "A social-media-based living lab: an incubator for human-centric software engineering and innovation.",
                    "Hunter-gatherer cycle: a conceptual model of the evolution of software startups.",
                    "A preliminary study into research about open innovation with focus on the field of computer science.",
                    "Requirements engineering in open innovation: a research agenda."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ICSSP 2014",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2014",
                "sub_name": "International Conference on Software and Systems Process 2014, ICSSP '14, Nanjing, China - May 26 - 28, 2014.",
                "count": 36,
                "papers": [
                    "The status and prospect of process improvements in china.",
                    "Principles for successful systems and software processes.",
                    "Software processes for a changing world.",
                    "A model for analyzing estimation, productivity, and quality performance in the personal software process.",
                    "COCOMO II parameters and IDPD: bilateral relevances.",
                    "Initial evaluation of data quality in a TSP software engineering project data repository.",
                    "Towards an understanding of enabling process knowing in global software development: a case study.",
                    "A case study on software ecosystem characteristics in industrial automation software.",
                    "Software process simulation modeling: preliminary results from an updated systematic review.",
                    "Refactoring planning and practice in agile software development: an empirical study.",
                    "Agility beyond software development.",
                    "Agile development with software process mining.",
                    "Software domains in incremental development productivity decline.",
                    "A collaborative method for business process oriented requirements acquisition and refining.",
                    "Processes for embedded systems development: preliminary results from a systematic review.",
                    "Realizing software process lines: insights and experiences.",
                    "Guiding the adoption of software development methods.",
                    "Artifact-based software process improvement and management: a method proposal.",
                    "Throughput based temporal verification for monitoring large batch of parallel processes.",
                    "Monitoring data-aware business constraints with finite state automata.",
                    "Hierarchical timed automata based verification of dynamic evolution process in open environments.",
                    "When to automate software testing? decision support based on system dynamics: an industrial case study.",
                    "An expert-based cost estimation model for system test execution.",
                    "On the need to study the impact of model driven engineering on software processes.",
                    "A business process simulation method supporting resource evolution.",
                    "A gaussian fields based mining method for semi-automating staff assignment in workflow application.",
                    "Towards context-specific software process selection, tailoring, and composition.",
                    "Are we ready for software process selection, tailoring, and composition?",
                    "An initial process decision table and a process evolution process.",
                    "You can't tailor what you haven't modeled.",
                    "Journey to agility for a large scale telecom system.",
                    "SW process tailoring practice in medical device industry.",
                    "Software processes: how important is your domain?",
                    "Understanding the dynamics of software projects: an introduction to software process simulation.",
                    "Workflow temporal verification: an efficient and effective approach for delivering on-time completion.",
                    "The incremental commitment spiral model (ICSM): principles and practices for successful systems and software."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ICSSP 2013",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2013",
                "sub_name": "International Conference on Software and System Process, ICSSP '13, San Francisco, CA, USA, May 18-19, 2013.",
                "count": 23,
                "papers": [
                    "The challenges of emerging software eco-systems (keynote).",
                    "Low ceremony processes for short lifecycle projects (keynote).",
                    "How to treat timing information for software effort estimation?",
                    "qEstimation: a process for estimating size and effort of software testing.",
                    "A model for estimating agile project process and schedule acceleration.",
                    "A discipline-spanning development process for self-adaptive mechatronic systems.",
                    "Process variability management in global software development: a case study.",
                    "Supporting process undo and redo in software engineering decision making.",
                    "A process practice to validate the quality of reused component documentation: a case study involving open-source components.",
                    "A methodology to derive sustainability indicators for software development projects.",
                    "Improving scenario testing process by adding value-based prioritization: an industrial case study.",
                    "Modeling user story completion of an agile software process.",
                    "Building lean thinking in a telecom software development organization: strengths and challenges.",
                    "Episode measurement method: a data collection technique for observing team processes.",
                    "Mining explicit rules for software process evaluation.",
                    "Processes in securing open architecture software systems.",
                    "A communication process for global requirements engineering.",
                    "Integrating collaborative requirements negotiation and prioritization processes: a match made in heaven.",
                    "Search based risk mitigation planning in project portfolio management.",
                    "Risk management of medical IT networks: an ISO/IEC 15504 compliant approach to assessment against IEC 80001-1.",
                    "Generation of process using multi-objective genetic algorithm.",
                    "Systematic software process development: where do we stand today?",
                    "Criteria for software process tailoring: a systematic review."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ICSSP 2012",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2012",
                "sub_name": "2012 International Conference on Software and System Process, ICSSP 2012, Zurich, Switzerland, June 2-3, 2012.",
                "count": 37,
                "papers": [
                    "Process analysis and optimization in Emergency Medicine.",
                    "System processes are software too.",
                    "Simulation modeling of a large-scale formal verification process.",
                    "Simulation-based decision support for bringing a project back on track: The case of RUP-based software construction.",
                    "Modeling kanban processes in systems engineering.",
                    "COTIPMO: A COnstructive Team Improvement Process MOdel.",
                    "Towards patterns for MDE-related processes to detect and handle changeability risks.",
                    "Generation of dynamic process models for multi-metamodel applications.",
                    "Introducing Software Process Tailoring to BPMN: BPMNt.",
                    "Improving the development process for automotive diagnostics.",
                    "Process implications of social networking-based requirements negotiation tools.",
                    "Developer experience: Concept and definition.",
                    "Improving systems engineering effectiveness in rapid response development environments.",
                    "Identifying criteria for designing a process architecture in a multimodel environment.",
                    "Supporting quantitative reasoning of non-functional requirements: A process-oriented approach.",
                    "Elements of a generalized duration forecasting model of test-and-fix cycles.",
                    "Software team processes: A taxonomy.",
                    "An approach to modeling and supporting the rework process in refactoring.",
                    "Supporting collaborative development using process models: An integration-focused approach.",
                    "Architectural design and documentation: Waste in agile development?",
                    "ReMo: A recommendation model for software process improvement.",
                    "From scrum to scrumban: A case study of a process transition.",
                    "Comparing two software emergency process models.",
                    "Assessing team performance from a socio-technical congruence perspective.",
                    "Building software process lines with CASPER.",
                    "Risk management in software product lines: An industrial case study.",
                    "A reduced set of RUP roles to small software development teams.",
                    "Systematic mapping of recommendation systems for requirements engineering.",
                    "Modeling and analysis of software development management as closed loop control.",
                    "Special panel: Software Process Simulation - At a crossroads?",
                    "Broadening software process perspectives.",
                    "Research and practice reciprocity in software process simulation.",
                    "Advancing process modeling, simulation, and analytics in practice.",
                    "Software process simulation is simulation too - What can be learned from other domains of simulation?",
                    "Evolving process simulators by using validated learning.",
                    "Simulation modeling of evolving software processes.",
                    "Process simulation will soon come of age: Where's the party?"
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ICSSP 2011",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2011",
                "sub_name": "International Conference on Software and Systems Process, ICSSP 2011, Honolulu, HI, USA, May 21-22, 2011, Proceedings.",
                "count": 36,
                "papers": [
                    "Software and systems engineering process implications of evolutionary development of evolutionary development.",
                    "Ubiquitous process: an opportunity or temptation?",
                    "Optimizing cost and quality by integrating inspection and test processes.",
                    "A value-based review process for prioritizing artifacts.",
                    "Analyzing software process models with AVISPA.",
                    "Toward a comparable characterization for software development activities in context of MDE.",
                    "An MDE approach to software process tailoring.",
                    "Model based analysis process for embedded software product lines.",
                    "Defect prediction using social network analysis on issue repositories.",
                    "Automatic mining of change set size information from repository for precise productivity estimation.",
                    "To branch or not to branch.",
                    "An empirical characterization of the accuracy of software process elicitation.",
                    "How does an agile coaching team work?: a case study.",
                    "Towards an understanding of tailoring scrum in global software development: a multi-case study.",
                    "Reuse and product-orientation as key elements for systems engineering: aligning a reference model for the industrial solutions business with ISO/IEC 15288.",
                    "Strategy to improve quality for software applications: a process view.",
                    "A competency framework for the stakeholders of a software process improvement initiative.",
                    "Agile development with security engineering activities.",
                    "Developer-driven big-bang process transition from Scrum to Kanban.",
                    "Strategically balanced process adoption.",
                    "Requirements for process management support: experience from the Japanese aerospace industry.",
                    "Goal-driven evaluation of process fragments using weighted dependency graphs.",
                    "Defense acquisition system simulation studies.",
                    "GoPoMoSA: a goal-oriented process modeling and simulation advisor.",
                    "Formally founded, plan-based enactment of software development processes.",
                    "Understanding how novices are integrated in a team analysing their tool usage.",
                    "Experiences mining open source release histories.",
                    "Towards detailed software artifact specification with SPEMArti.",
                    "The problem of private information in large software organizations.",
                    "Concepts in the definition of an enterprise development process.",
                    "Special panel: towards a manifesto for rich process models.",
                    "A proposal for principles and values from the perspective of the german standard it-development process V-Modell XT.",
                    "Towards richer process principles.",
                    "A plea for lean software process models.",
                    "The right process for each context: objective evidence needed.",
                    "A manifesto for effective process models."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ICSP 2010",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2010",
                "sub_name": "New Modeling Concepts for Today's Software Processes, International Conference on Software Process, ICSP 2010, Paderborn, Germany, July 8-9, 2010. Proceedings.",
                "count": 32,
                "papers": [
                    "A Risk-Driven Decision Table for Software Process Selection.",
                    "Using Process Definitions to Support Reasoning about Satisfaction of Process Requirements.",
                    "Early Empirical Assessment of the Practical Value of GQM+Strategies.",
                    "Determining Organization-Specific Process Suitability.",
                    "On Scoping Stakeholders and Artifacts in Software Process.",
                    "Critical Success Factors for Rapid, Innovative Solutions.",
                    "Evidence-Based Software Processes.",
                    "SoS Management Strategy Impacts on SoS Engineering Effort.",
                    "Using Project Procedure Diagrams for Milestone Planning.",
                    "A Framework for the Flexible Instantiation of Large Scale Software Process Tailoring.",
                    "A Methodological Framework and Software Infrastructure for the Construction of Software Production Methods.",
                    "Software Factories: Describing the Assembly Process.",
                    "How to Welcome Software Process Improvement and Avoid Resistance to Change.",
                    "The Incremental Commitment Model Process Patterns for Rapid-Fielding Projects.",
                    "A Repository of Agile Method Fragments.",
                    "OAP: Toward a Process for an Open World.",
                    "An Automatic Approach to Aid Process Integration within a Secure Software Processes Family.",
                    "Engineering Adaptive IT Service Support Processes Using Meta-modeling Technologies.",
                    "Modeling a Resource-Constrained Test-and-Fix Cycle and Test Phase Duration.",
                    "Visual Patterns in Issue Tracking Data.",
                    "Disruption-Driven Resource Rescheduling in Software Development Processes.",
                    "MODAL: A SPEM Extension to Improve Co-design Process Models.",
                    "Application of Re-estimation in Re-planning of Software Product Releases.",
                    "Software Process Model Blueprints.",
                    "Measurement and Analysis of Process Audit: A Case Study.",
                    "A Fuzzy-Based Method for Evaluating the Trustworthiness of Software Processes.",
                    "Software Process Simulation Modeling: An Extended Systematic Review.",
                    "SimSWE - A Library of Reusable Components for Software Process Simulation.",
                    "Applications of a Generic Work-Test-Rework Component for Software Process Simulation.",
                    "An Empirical Study of Lead-Times in Incremental and Agile Software Development.",
                    "Improving the ROI of Software Quality Assurance Activities: An Empirical Study.",
                    "Benchmarking the Customer Configuration Updating Process of the International Product Software Industry."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ICSP 2009",
        "info": "Vancouver, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2009",
                "sub_name": "Trustworthy Software Development Processes, International Conference on Software Process, ICSP 2009 Vancouver, Canada, May 16-17, 2009 Proceedings.",
                "count": 36,
                "papers": [
                    "System Engineering in the Energy and Maritime Sectors: Towards a Solution Based on Model-Centric Processes.",
                    "Decision Processes for Trustworthy Software.",
                    "Synthesis, Analysis, and Modeling of Large-Scale Mission-Critical Embedded Software Systems.",
                    "Statistically Based Process Monitoring: Lessons from the Trench.",
                    "The How? When? and What? for the Process of Re-planning for Product Releases.",
                    "Overcoming the First Hurdle: Why Organizations Do Not Adopt CMMI.",
                    "Value-Based Multiple Software Projects Scheduling with Genetic Algorithm.",
                    "Meta Model Based Architecture for Software Process Instantiation.",
                    "Distributed Orchestration Versus Choreography: The FOCAS Approach.",
                    "An Architecture for Modeling and Applying Quality Processes on Evolving Software.",
                    "Evaluating the Perceived Effect of Software Engineering Practices in the Italian Industry.",
                    "Evidence-Based Insights about Issue Management Processes: An Exploratory Study.",
                    "Process Aspect: Handling Crosscutting Concerns during Software Process Improvement.",
                    "Stochastic Process Algebra Based Software Process Simulation Modeling.",
                    "Combining Aspect and Model-Driven Engineering Approaches for Software Process Modeling and Execution.",
                    "Dynamic COQUALMO: Defect Profiling over Development Cycles.",
                    "A Hybrid Model for Dynamic Simulation of Custom Software Projects in a Multiproject Environment.",
                    "On the Relative Merits of Software Reuse.",
                    "Investigating the Gap between Quantitative and Qualitative/Semi-quantitative Software Process Simulation Models: An Explorative Study.",
                    "Bridge the Gap between Software Test Process and Business Value: A Case Study.",
                    "Subcontracting Processes in Software Service Organisations - An Experience Report.",
                    "On Reducing the Pre-release Failures of Web Plug-In on Social Networking Site.",
                    "Technical Software Development Process in the XML Domain.",
                    "Software Product Quality: Ensuring a Common Goal.",
                    "Predicting Upgrade Project Defects Based on Enhancement Requirements: An Empirical Study.",
                    "Incremental Process Modeling through Stakeholder-Based Hybrid Process Simulation.",
                    "A Process-Oriented Approach for the Optimal Satisficing of Non-Functional Requirements.",
                    "A Pattern for Modeling Rework in Software Development Processes.",
                    "Achieving On-Time Delivery: A Two-Stage Probabilistic Scheduling Strategy for Software Projects.",
                    "Incrementally Introducing Process Model Rationale Support in an Organization.",
                    "A Process for Driving Process Improvement in VSEs.",
                    "Modeling Software Evolution with Game Theory.",
                    "Structural Considerations in Defining Executable Process Models.",
                    "Analyzing a Software Process Model Repository for Understanding Model Evolution.",
                    "Process Trustworthiness as a Capability Indicator for Measuring and Improving Software Trustworthiness.",
                    "A System Dynamics Model That Simulates a Significant Late Life Cycle Manpower Increase Phenomenon."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ICSP 2008",
        "info": "Leipzig, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2008",
                "sub_name": "Making Globally Distributed Software Development a Success Story, International Conference on Software Process, ICSP 2008, Leipzig, Germany, May 10-11, 2008, Proceedings.",
                "count": 35,
                "papers": [
                    "Benefits of Global Software Development: The Known and Unknown.",
                    "Method Engineering: Towards Methods as Services.",
                    "Macro-processes Informing Micro-processes: The Case of Software Project Performance.",
                    "Improving Software Risk Management Practices in a Medical Device Company.",
                    "Framework to Evaluate Software Process Improvement in Small Organizations.",
                    "On Deriving Actions for Improving Cost Overrun by Applying Association Rule Mining to Industrial Project Repository.",
                    "Software Multi-project Resource Scheduling: A Comparative Analysis.",
                    "Project Assets Ontology (PAO) to Support Gap Analysis for Organization Process Improvement Based on CMMI v.1.2.",
                    "Towards Individualized Requirements Specification Evolution for Networked Software Based on Aspect.",
                    "Requirement-Centric Traceability for Change Impact Analysis: A Case Study.",
                    "Scaling Up Software Architecture Evaluation Processes.",
                    "Software Project Similarity Measurement Based on Fuzzy C-Means.",
                    "An Empirically-Based Process to Improve the Practice of Requirement Review.",
                    "Capability Assessment of Individual Software Development Processes Using Software Repositories and DEA.",
                    "Scoping Software Process Models - Initial Concepts and Experience from Defining Space Standards.",
                    "Detection of Consistent Patterns from Process Enactment Data.",
                    "A Deviation Management System for Handling Software Process Enactment Evolution.",
                    "Assessing Quality Processes with ODC COQUALMO.",
                    "Accurate Estimates without Calibration?",
                    "Investigating Factors Affecting the Usability of Software Process Descriptions.",
                    "Degree of Agility in Pre-Implementation Process Phases.",
                    "Support IT Service Management with Process Modeling and Analysis.",
                    "The Secret Life of a Process Description: A Look into the Evolution of a Large Process Model.",
                    "Simulating Worst Case Scenarios and Analyzing Their Combined Effect in Operational Release Planning.",
                    "Using Process Simulation to Assess the Test Design Effort Reduction of a Model-Based Testing Approach.",
                    "GENSIM 2.0: A Customizable Process Simulation Model for Software Process Evaluation.",
                    "RVSim: A Simulation Approach to Predict the Impact of Requirements Volatility on Software Project Plans.",
                    "Identifying Key Success Factors for Globally Distributed Software Development Project Using Simulation: A Case Study.",
                    "Hybrid Modeling of Test-and-Fix Processes in Incremental Development.",
                    "Reflections on 10 Years of Software Process Simulation Modeling: A Systematic Review.",
                    "Integrating Joint Reviews with Automotive SPICE Assessments Results.",
                    "Quantitatively Managing Defects for Iterative Projects: An Industrial Experience Report in China.",
                    "An Investigation of Software Development Productivity in China.",
                    "Optimized Software Process for Fault Handling in Global Software Development.",
                    "Measuring and Comparing the Adoption of Software Process Practices in the Software Product Industry."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ICSP 2007",
        "info": "Minneapolis, MN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2007",
                "sub_name": "Software Process Dynamics and Agility, International Conference on Software Process, ICSP 2007, Minneapolis, MN, USA, May 19-20, 2007, Proceedings.",
                "count": 28,
                "papers": [
                    "Extending Microsoft Team Foundation Server Architecture to Support Collaborative Product Patterns.",
                    "The REMIS Approach for Rationale-Driven Process Model Evolution.",
                    "On the Measurement of Agility in Software Process.",
                    "Coping with the Cone of Uncertainty: An Empirical Study of the SAIV Process Model.",
                    "Effects of Architecture and Technical Development Process on Micro-process.",
                    "Comparative Experiences with Electronic Process Guide Generator Tools.",
                    "Jasmine: A PSP Supporting Tool.",
                    "A Tool to Create Process-Agents for OEC-SPM from Historical Project Data.",
                    "Safety Critical Software Process Improvement by Multi-objective Optimization Algorithms.",
                    "Representing Process Variation with a Process Family.",
                    "An Algebraic Approach for Managing Inconsistencies in Software Processes, .",
                    "Cost Estimation and Analysis for Government Contract Pricing in China.",
                    "A Multilateral Negotiation Method for Software Process Modeling.",
                    "Distributed Global Development Parametric Cost Modeling.",
                    "Process Mining Framework for Software Processes.",
                    "Focused Identification of Process Model Changes.",
                    "An Approach for Decentralized Process Modeling.",
                    "A Survey of Software Development with Open Source Components in Chinese Software Industry.",
                    "Empirical Study on Benchmarking Software Development Tasks.",
                    "An Empirical Study on Establishing Quantitative Management Model for Testing Process.",
                    "DynaReP: A Discrete Event Simulation Model for Re-planning of Software Releases.",
                    "The Economic Impact of Software Process Variations.",
                    "Deriving a Valid Process Simulation from Real World Experiences.",
                    "Project Delay Variability Simulation in Software Product Line Development.",
                    "Modeling Risk-Benefit Assumptions in Technology Substitution.",
                    "Evaluating the Impact of the QuARS Requirements Analysis Tool Using Simulation.",
                    "A Framework for Adopting Software Process Simulation in CMMI Organizations.",
                    "Achieving Software Project Success: A Semi-quantitative Approach."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "SPW/ProSim 2006",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2006",
                "sub_name": "Software Process Change, International Software Process Workshop and International Workshop on Software Process Simulation and Modeling, SPW/ProSim 2006, Shanghai, China, May 20-21, 2006, Proceedings.",
                "count": 38,
                "papers": [
                    "A Value-Based Software Process Framework.",
                    "Exploring the Business Process-Software Process Relationship.",
                    "Assessing 3-D Integrated Software Development Processes: A New Benchmark.",
                    "Ubiquitous Process Engineering: Applying Software Process Technology to Other Domains.",
                    "Dependencies Between Data Decisions.",
                    "Tailor the Value-Based Software Quality Achievement Process to Project Business Cases.",
                    "Optimizing Process Decision in COTS-Based Development Via Risk Based Prioritization.",
                    "Project Replayer - An Investigation Tool to Revisit Processes of Past Projects.",
                    "Software Process Measurement in the Real World: Dealing with Operating Constraints.",
                    "Evaluation of Project Quality: A DEA-Based Approach.",
                    "A Pattern-Based Solution to Bridge the Gap Between Theory and Practice in Using Process Models.",
                    "On Mobility of Software Processes.",
                    "Software Process Fusion: Uniting Pair Programming and Solo Programming Processes.",
                    "Towards an Approach for Security Risk Analysis in COTS Based Development.",
                    "COCOMO-U: An Extension of COCOMO II for Cost Estimation with Uncertainty.",
                    "A Product Line Enhanced Unified Process.",
                    "Automatic Fault Tree Derivation from Little-JIL Process Definitions.",
                    "Workflows and Cooperative Processes.",
                    "Spiral Lifecycle Increment Modeling for New Hybrid Processes.",
                    "Definition and Analysis of Election Processes.",
                    "The Design of a Flexible Software Process Language.",
                    "Building Business Process Description and Reasoning Meta-model Mbp in A-Prolog.",
                    "A Process-Agent Construction Method for Software Process Modeling in SoftPM.",
                    "Applying Little-JIL to Describe Process-Agent Knowledge in SoftPM.",
                    "Reusable Model Structures and Behaviors for Software Processes.",
                    "Organization-Theoretic Perspective for Simulation Modeling of Agile Software Processes.",
                    "Semi-quantitative Simulation Modeling of Software Engineering Process.",
                    "Analysis of Software-Intensive System Acquisition Using Hybrid Software Process Simulation.",
                    "Simulation-Based Stability Analysis for Software Release Plans.",
                    "Exploring the Impact of Task Allocation Strategies for Global Software Development Using Simulation.",
                    "Users and Developers: An Agent-Based Simulation of Open Source Software Evolution.",
                    "Simulating the Structural Evolution of Software.",
                    "An Empirical Study on SW Metrics for Embedded System.",
                    "Process-Family-Points.",
                    "Automated Recognition of Low-Level Process: A Pilot Validation Study of Zorro for Test-Driven Development.",
                    "Process Evolution Supported by Rationale: An Empirical Investigation of Process Changes.",
                    "Implementing Process Change in a Software Organization - An Experience Based Study.",
                    "Practical Experiences of Cost/Schedule Measure Through Earned Value Management and Statistical Process Control."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ISPW 2005",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/2005",
                "sub_name": "Unifying the Software Process Spectrum, International Software Process Workshop, SPW 2005, Beijing, China, May 25-27, 2005, Revised Selected Papers.",
                "count": 41,
                "papers": [
                    "Evolving Defect \"Folklore\": A Cross-Study Analysis of Software Defect Behavior.",
                    "The Future of Software Processes.",
                    "Software are Processes Too.",
                    "The Software Process: Global Goals.",
                    "Achieving Software Development Performance Improvement Through Process Change.",
                    "Expanding the Horizons of Software Development Processes: A 3-D Integrated Methodology.",
                    "Unifying Microprocess and Macroprocess Research.",
                    "What Beyond CMMI Is Needed to Help Assure Program and Project Success?",
                    "Integrated Software Process and Product Lines.",
                    "A Rigorous Software Process for the Development of Embedded Systems.",
                    "Active Models: A Possible Approach to the Integration of Objective and Subjective Process Models.",
                    "A Value-Based Process for Achieving Software Dependability.",
                    "A Development Process for Building OSS-Based Applications.",
                    "A Study on the Distribution and Cost Prediction of Requirements Changes in the Software Life-Cycle.",
                    "Requirements Engineering Processes Improvement: A Systematic View.",
                    "S-RaP: A Concurrent, Evolutionary Software Prototyping Process.",
                    "Aspect-Oriented Software Development and Software Process.",
                    "A Gradually Proceeded Software Architecture Design Process.",
                    "Process Patterns for COTS-Based Development.",
                    "Software Testing Process Automation Based on UTP - A Case Study.",
                    "Evaluation of the Capability of Personal Software Process Based on Data Envelopment Analysis.",
                    "Project Management System Based on Work-Breakdown-Structure Process Model.",
                    "Spiral Pro: A Project Plan Generation Framework and Support Tool.",
                    "A Process Improvement Framework and a Supporting Software Oriented to Chinese Small Organizations.",
                    "Incremental Workflow Mining Based on Document Versioning Information.",
                    "A Framework for Coping with Process Evolution.",
                    "Software Process Management: Practices in China.",
                    "Process Elements: Components of Software Process Architectures.",
                    "Process Programming to Support Medical Safety: A Case Study on Blood Transfusion.",
                    "Translation of Nets Within Nets in Cross-organizational Software Process Modeling.",
                    "M(in)BASE: An Upward-Tailorable Process Wrapper Framework for Identifying and Avoiding Model Clashes.",
                    "Integrated Modeling of Business Value and Software Processes.",
                    "Process Technology to Facilitate the Conduct of Science.",
                    "Process Definition Language Support for Rapid Simulation Prototyping.",
                    "Evolving an Experience Base for Software Process Research.",
                    "Experiences in Discovering, Modeling, and Reenacting Open Source Software Development Processes.",
                    "Application of the V-Modell XT - Report from a Pilot Project.",
                    "A Road Map for Implementing eXtreme Programming.",
                    "Automatically Analyzing Software Processes: Experience Report.",
                    "Status of SPI Activities in Japanese Software - A View from JASPIC.",
                    "A Survey of CMM/CMMI Implementation in China."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "10th ISPW 1996",
        "info": "Dijon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1996",
                "sub_name": "10th International Software Process Workshop (ISPW '96), June 17-19, 1996, Dijon, France.",
                "count": 33,
                "papers": [
                    "An open architecture for software process asset reuse.",
                    "Connecting reusable software process elements and components.",
                    "Practical Issues in Process Reuse.",
                    "Product-line development requires sophisticated software configuration management.",
                    "Support for environment-mediated human cooperation in large-scale reuse-based projects.",
                    "Reuse sensitive process models: are process elements software assets too?",
                    "Process model reuse support-the OPSIS approach.",
                    "Supporting product line development.",
                    "Software reuse introduction requires a process perspective.",
                    "Supporting reuse and configuration for large scale software process models.",
                    "The software process and application domains.",
                    "Process support for reuse.",
                    "Program families: some requirements issues for the process languages.",
                    "Product lines: what are the issues?",
                    "Processes for systematic software reuse.",
                    "Considerations for an organizational memory in software development.",
                    "About reuse in multi-paradigm process modelling approach.",
                    "An asset view on the software process.",
                    "Reuse of software process fragments is reuse of software too.",
                    "Software in the field needs process too.",
                    "Reuse of process elements-one company's experience.",
                    "Experiences in process domain engineering at PRC Inc.",
                    "The role of a software process generaliser in managing a line of products.",
                    "Process measurement through process modeling and simulation.",
                    "Reusing software process models in E3.",
                    "Evolution of on-line process fragments families.",
                    "On the yellow brick road to component-based product lines.",
                    "Integrating and applying processes and methods for product line management.",
                    "Feedback, evolution and software technology.",
                    "Moving away from a hacker vs. disciplined-based organizational legacy-an organization theory perspective on software processes.",
                    "Product families and process families.",
                    "Towards software process modules.",
                    "Using process waiver data to improve a design process: a case study of feedback and control using the FEAST model."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "9th ISPW 1994",
        "info": "Airlie, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1994",
                "sub_name": "Proceedings of the Ninth International Software Process Workshop (ISPW '94), October 1994, Airlie, Virginia, USA.",
                "count": 33,
                "papers": [
                    "Relations between CSCW and software process research: a position statement.",
                    "Communication support in a process-centered software engineering environment.",
                    "Cooperation patterns in PSEEs.",
                    "Human interaction suppport in HP SynerVision for SoftBench.",
                    "Data collection in a process-sensitive software engineering environment.",
                    "Coupled vs. decoupled user interaction environments in PSEEs.",
                    "The \"process in the tool syndrome\": is it becoming worse?",
                    "OPT: organization and process together.",
                    "Formalizing humans in software processes.",
                    "Meta-integration for process integrated CASE environments.",
                    "The software process from the developer's perspective: a case study on improving process usability.",
                    "Separating process model enactment from process execution in Provence.",
                    "Using process descriptions as templates of communication flow.",
                    "Human-executed operations in the teamware process programming system.",
                    "Humans and process frameworks: some critical process elements.",
                    "Process models as multi-reader collaborative hyperdocuments.",
                    "The need for a cooperative model: the adele/tempo experience.",
                    "By the way, has anyone studied any real programmers yet?",
                    "Combining control and data integration in the SPADE-1 process-centered software engineering environment.",
                    "Process, space, & software development suppport.",
                    "Process feedback and learning.",
                    "Toward collaborative software processes.",
                    "Process-centered environments: support for human-environment interaction and environment-mediated human cooperation.",
                    "Integrating groupware and process technologies in the Oz environment.",
                    "Personal \"progress functions\" in the software process.",
                    "An argument for the elimination of roles.",
                    "Decision oriented process modelling.",
                    "An alternative to software process languages.",
                    "Process definition formalism maturity levels.",
                    "Evolution, feedback and software technology.",
                    "Issues in process architecture.",
                    "Life-cycle (sub) process scenario.",
                    "Lowering the entry barrier and raising the cofidence in large process models."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "8th ISPW 1993",
        "info": "Schloss Dagstuhl, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1993",
                "sub_name": "State of the Practice in Process Technology, Proceedings of the Eighth International Software Process Workshop (ISPW '93), March 2-5, 1993, Wadern, Schloss Dagstuhl, Germany.",
                "count": 41,
                "papers": [
                    "Demonstration Experience Report Session Summary.",
                    "PSEE Architectures - ISPW8 Session Summary.",
                    "Humans and Process.",
                    "Resume from Session on Process Change at ISPW8.",
                    "Software Process Measurement - Session Summary.",
                    "Managing Inconsistencies Between Process Enactment and Process Performance States.",
                    "Generic Process Support.",
                    "Requirements and Early Experiences in the Implementation of the SPADE Repository.",
                    "An Open Environment for Process Modeling and Enactment.",
                    "TEMPO: Enhancing O O Paradigm for Modeling Software Engineering Processes.",
                    "Building Process Models Using PROCESS WEAVER: A Progressive Approach.",
                    "Variability of Process Models and the EPOS Solution.",
                    "Transferring a Process Model to a Software Development Organization: A Case Study.",
                    "Software Process Technology Transfer - A Case Study Based on FUNSOFT Nets and MELMAC.",
                    "About Software Process Centered Environments.",
                    "Process Variables and Process Change.",
                    "Empirically Driven Improvement of Generic Process Models.",
                    "Modular, Visual Specifications of Software Processes.",
                    "CASE and CAPE: Conflict of Interest.",
                    "State Models and Protocols in Process-Centered Environments.",
                    "Process Formalisms Need to be Fully Reflective.",
                    "Process Modeling in Matisse: A Team Programming Environment.",
                    "Project and Process Management by Cooperative Software Process Description.",
                    "Investigating and Formalising the Development of HIS Within PSEEs.",
                    "A Revisionist Approach to Process Change.",
                    "From Software Process Engineering to Business Process Reengineering.",
                    "The Personal Software Process-Rationale and Status.",
                    "Process Evolution in the Marvel Environment.",
                    "Practical Technology for Process Assets.",
                    "Enactment in a Process Centered Software Engineering Environment.",
                    "Task Oriented Procedure Support.",
                    "Software Process Adoption Issues.",
                    "Humans in the Process: Architectural Implications.",
                    "Architectural Support for Distributed Process-Centered Software Development Environments.",
                    "Supporting the \"Other\" Kinds of Software Process Users.",
                    "Practical Use of Formal Process Models: First Experiences.",
                    "Experiences in the Modeling, Analysis, and Simulation of Formalized Software Processes.",
                    "Using the Software Process to Identify Integration Opportunities.",
                    "Incorporating Your Process Support into Your Software Development Environment.",
                    "Comparing One Formal to One Informal Process Description.",
                    "Process-Centered Environment (Only) Support Environment-Centered Processes."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "7th ISPW 1991",
        "info": "Yountville, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1991",
                "sub_name": "Proceedings of the Seventh International Software Process Workshop (ISPW '91), October 1991, Yountville, California, USA.",
                "count": 31,
                "papers": [
                    "Hierarchical specification of software processes in Oikos.",
                    "Process virtual machine.",
                    "A multi-paradigm Petri net based approach to process description.",
                    "Concurrency control in rule-based process-centered environments.",
                    "Activity coordination in Adele: a software production kernel.",
                    "Process modeling paradigms: an evaluation.",
                    "A proces definition methodology for software development organization.",
                    "Process and project management.",
                    "Process programming by hindsight.",
                    "A process server.",
                    "Supporting change in plan-based processes.",
                    "Process fitness and fidelity.",
                    "Design and Implementation of process-centered environments based on process language PDL and formal grammar.",
                    "A rule-based process server component for constructing rule-based.",
                    "What has been learned from applying a formal process model to a real process.",
                    "Multiple-paradigm approaches for software process modeling.",
                    "Position paper for ISPW-7.",
                    "Coordinating software process activities.",
                    "Communications and iterations in the process cycle.",
                    "Articulation: supporting dynamic evolution of software engineering processes.",
                    "Team coordination: information sharing + policies.",
                    "Supporting software process communication and cooperation through object sets.",
                    "Making process-based environments viable.",
                    "Policy-directed coordination and cooperation.",
                    "A consistency model for team cooperation.",
                    "Software process architecture issues.",
                    "Modularizing software process models for reuse.",
                    "Evolving towards support for process related sub-environments.",
                    "Accommodating manual activities in automated process programs.",
                    "Backtrack and foresight in software process.",
                    "Supporting task management & process automation in the softbench development environment."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "6th ISPW 1990",
        "info": "Hakodate, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1990",
                "sub_name": "Proceedings of the Sixth International Software Process Workshop (ISPW '90), October 1990, Hakodate, Japan.",
                "count": 35,
                "papers": [
                    "Software processes as a hierarchy.",
                    "What we do and don't know about the software process.",
                    "The E-L system support for process programs.",
                    "A logical framework for cooperative software development.",
                    "EPOS PM: planning and execution.",
                    "Roles cooperation through software process instantiaton.",
                    "Process modelling in HP softbench.",
                    "Concepts for process definition and support.",
                    "Software process support in software development environments.",
                    "Product-centered process description = algebraic specification of environment + SCRIPT.",
                    "Proscription versus prescription in process-centered environments.",
                    "Eureka software factory: OPIUM: an environment for software process modelling integrated with a project management tool.",
                    "On the relationship between software processes and software products.",
                    "People considerations in process models.",
                    "Process management in the DAIDA environments.",
                    "Preliminary design of an object management system for multi-user MARVEL.",
                    "Supporting software processes through software process modeling.",
                    "Possibility and limitation of process programming.",
                    "KyotoDB supports software processes.",
                    "Supporting coordination and cooperation in software processes.",
                    "Applying the software process to the instruction tool in system design.",
                    "A process-oriented architecture with knowledge acquisition and refinement mechanisms on software processes.",
                    "Building object and process-centered software environments on the PCTE public tool interface.",
                    "The architecture of the Arcadia-1 process centered software environment.",
                    "Experiences with SEE architectural support for the automation.",
                    "Policy and product-directed process instantiation.",
                    "A flexible environment architecture as a basis for distributed software development.",
                    "Organizational properties and software process models.",
                    "A framework for assesing process representations.",
                    "Formalizing operations and relationships on objects to support dynamic refinement of process models instances.",
                    "Object-oriented software processes and their environment.",
                    "Language support for oject process modeling.",
                    "A framework for describing software design processes.",
                    "Multiple paradigm descriptions of software process.",
                    "The implications of process support software for environment architectures."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "5th ISPW 1989",
        "info": "Kennebunkport, Maine, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1989",
                "sub_name": "Proceedings of the Fifth International Software Process Workshop (ISPW '89), October 1989, Kennebunkport, Maine, USA.",
                "count": 41,
                "papers": [
                    "Tolerating inconsistency.",
                    "Experiences with the spiral model as a process model generator.",
                    "System dynamics models of software development.",
                    "Process programing and process model.",
                    "Studying the process of software design teams.",
                    "Process programming: a structured multi-paradigm approach could be achieved.",
                    "Software process support through software configuration management.",
                    "A structural framework for the formal representation of cooperation.",
                    "The role of formalized domain-specific software frameworks.",
                    "P4: a logic language for process programming.",
                    "Software process instatiation and the planning paradigm.",
                    "Modelling implications of the personal software process.",
                    "Mechanisms for software process dynamics.",
                    "Experience with marvel.",
                    "Experience with enactable software process models.",
                    "Position paper for ISPW.",
                    "The role of process models in software and systems development and evolution.",
                    "A software process model based on unit workload network.",
                    "Law-governed software processes.",
                    "Product-based process models.",
                    "A method for recording and analyzing design processes.",
                    "Experiences with process programming.",
                    "Acquiring experiences with executable process models.",
                    "Software process dependability.",
                    "Conceptual programming.",
                    "Dynamics of process models in PML.",
                    "Specification of software process measurement.",
                    "Experiences with operational software process modelling in the system factory project.",
                    "OPM: an object process modelling environment.",
                    "The software process as a goal-directed activity.",
                    "Experiments with typing in process modelling.",
                    "Domain understanding and the software process.",
                    "An example of software development modelling.",
                    "An example P4 process program for rebus.",
                    "GRAPPLE example: processes as plans.",
                    "Marvel strategy language example.",
                    "An example of process description in HFSP.",
                    "software process modelling example.",
                    "An example of a software process model based on Unit workload network.",
                    "Example process program code, coded in Appl/A.",
                    "Describing working environments in OPM."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "4th ISPW 1988",
        "info": "Moretonhampstead, Devon, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1988",
                "sub_name": "Proceedings of the Forth International Software Process Workshop, ISPW 1988, Moretonhampstead, Devon, UK, May 1988.",
                "count": 32,
                "papers": [
                    "Process modelling in software environments.",
                    "Process programming: passing into new phase.",
                    "Applying process programming to the spiral model.",
                    "Activity coordination porgrams.",
                    "Duplicate instances of elements of a software process model.",
                    "Design considerations for process-driven software environments.",
                    "Constructing a dialogic framework for software development.",
                    "A manager/controller for the software development process.",
                    "The process model of the aspect IPSE.",
                    "Probing limits to automation: towards deeper process models.",
                    "The software engineering process: definition and scope.",
                    "Rule-based modelling of the software development process.",
                    "A hierarchical and functional approach to software process description.",
                    "Representation formalism for software process modelling.",
                    "Limits to the mechanization of the detailing step paradigm.",
                    "Enactable models for quantitative evolutionary software processes.",
                    "some reservations on software process programming.",
                    "A functional paradigm for software development.",
                    "Applying software process models to the full lifecycle is premature.",
                    "Process programming with Prolog.",
                    "Automated support for the enactment of rigorously described software processes.",
                    "Problems of scale and process models.",
                    "State change architecture: a protocol for executable process models.",
                    "Software reuse processes.",
                    "Describing and acting process models with PML.",
                    "A specification framework for software processes: formal specification and derivation of information base requirements.",
                    "Capturing software processes through the generated objects.",
                    "Modelling software evolution: a knowledge-based approach.",
                    "Advanced models of the software process.",
                    "Software process models and programs: observations on their nature and context.",
                    "Facilitating process prototyping by controlling the impact of change.",
                    "A behavioral approach to software process modelling."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "3rd ISPW 1986",
        "info": "Beckenridge, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1986",
                "sub_name": "Proceedings of the Third International Software Process Workshop (ISPW '86), November 1986, Beckenridge, Colorado, USA.",
                "count": 28,
                "papers": [
                    "An approach to axioms of the iteration process.",
                    "Software process model and iteration.",
                    "Incremental development and iteration in the software process.",
                    "Classes of process iteration.",
                    "Modes of evolution.",
                    "Describing the software process.",
                    "Iterations, learning and the detailing step paradigm.",
                    "Reasoning about iteration: a cost-benefit approach.",
                    "The iteration mechanism in the inscape environment.",
                    "Models of iteration in software development.",
                    "Beyond macro-iteration: an organic model of system design.",
                    "Specification via scenarios and views.",
                    "Backtracking in software process model.",
                    "Hierarchical control of software devlopment.",
                    "Software processes are software too.",
                    "Modelling software development in the large.",
                    "Concurrency and software process model.",
                    "The software development process as a fault-tolerant system.",
                    "Software design and complexity.",
                    "Modelling iteration in the software process.",
                    "Iteration in the software process.",
                    "Process iteration modelling and mechanization.",
                    "Software prototyping by progressive annotation.",
                    "Software evolution management.",
                    "Managing testing of iteratively developed software.",
                    "Evolution of a testbed.",
                    "Making formal specifications dynamic objects.",
                    "An incremental approach to construting, explaining and maintaining specifications."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "2nd ISPW 1985",
        "info": "Coto de Caza, Trabuco Canyon, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1985",
                "sub_name": "Proceedings of an International Workshop on the Software Process and Software Environments, Coto de Caza, Trabuco Canyon, California, USA, March 1985.",
                "count": 19,
                "papers": [
                    "The structure of the software process.",
                    "This is IT: a metamodel of the software process.",
                    "Foundational problems in software process research.",
                    "A spiral model of software development and enhancement.",
                    "Thoughts on the software process.",
                    "Approach to a disciplined development process- the ISTAR integrated project support environment.",
                    "On the role of domain knowledge in knowledge-based approaches to software development.",
                    "Towards an alternative model for software development.",
                    "An assessment of structured analysis and structured design.",
                    "Logical environments for natural language approach.",
                    "The role of validation in software development.",
                    "A meta-model for the software processes.",
                    "Comparison of algebraic and state-machine specification methods.",
                    "Two embedded computer system requirement models: issues for investigation.",
                    "The role of performance in the software process.",
                    "The von Neumann straitjacket- the process construct.",
                    "Program enhancement.",
                    "What should we do about the evolution of software.",
                    "Tools for evolving software."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "1st ISPW 1984",
        "info": "Egham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ispw/1984",
                "sub_name": "Proceedings of a Software Process Workshop, February 1984, Egham, UK.",
                "count": 17,
                "papers": [
                    "Software technology in the 1990's: using a new paradigm.",
                    "Software composition.",
                    "Thinking about software design: A meta activity.",
                    "A further model of coherent programming processes.",
                    "System development models.",
                    "A systems engineering approach to software engineering.",
                    "Are we real software engineers?",
                    "RECIPE: Requirements for an evolutionary computer-based information processing environment.",
                    "Environment requirements for system evolution.",
                    "Feedback-directed development of complex software systems.",
                    "SPMMS - A support for the management process.",
                    "Toolpack - Providing extended support for the Fortran programmer.",
                    "Theory and concepts for a software engineering environment.",
                    "Characteristics of the user software engineering methodology.",
                    "Prototyping versus specifying: A multiproject experiment.",
                    "Validation in the software process.",
                    "Completeness and executability of specifications: Two confusing notions."
                ]
            }
        ]
    }
]