[
    {
        "year": "2021",
        "name": "14th ICST 2021",
        "info": "Porto de Galinhas, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2021",
                "sub_name": "14th IEEE Conference on Software Testing, Verification and Validation, ICST 2021, Porto de Galinhas, Brazil, April 12-16, 2021.",
                "count": 51,
                "papers": [
                    "Synthesizing Multi-threaded Tests from Sequential Traces to Detect Communication Deadlocks.",
                    "Assessing the Effectiveness of Input and Output Coverage Criteria for Testing Quantum Programs.",
                    "Fail-Safe Execution of Deep Learning based Systems through Uncertainty Monitoring.",
                    "A Search-Based Testing Framework for Deep Neural Networks of Source Code Embedding.",
                    "Learning-Based Fuzzing of IoT Message Brokers.",
                    "Modeling with Mocking.",
                    "Uncertainty-aware Exploration in Model-based Testing.",
                    "Demystifying the Challenges of Formally Specifying API Properties for Runtime Verification.",
                    "Efficiently Finding Data Flow Subsumptions.",
                    "Mandoline: Dynamic Slicing of Android Applications with Trace-Based Alias Analysis.",
                    "Address-Aware Query Caching for Symbolic Execution.",
                    "Self determination: A comprehensive strategy for making automated tests more effective and efficient.",
                    "Artefact Relation Graphs for Unit Test Reuse Recommendation.",
                    "An Empirical Study of Flaky Tests in Python.",
                    "Fast Kernel Error Propagation Analysis in Virtualized Environments.",
                    "Dissecting Strongly Subsuming Second-Order Mutants.",
                    "IoTBox: Sandbox Mining to Prevent Interaction Threats in IoT Systems.",
                    "Quality Metrics and Oracles for Autonomous Vehicles Testing.",
                    "Digital Twin-based Anomaly Detection in Cyber-physical Systems.",
                    "Automatic Program Repair as Semantic Suggestions: An Empirical Study.",
                    "Exploring True Test Overfitting in Dynamic Automated Program Repair using Formal Methods.",
                    "A Large-scale Study on API Misuses in the Wild.",
                    "System and Software Testing in Automotive: an Empirical Study on Process Improvement Areas.",
                    "Simulation for Robotics Test Automation: Developer Perspectives.",
                    "Summary of: Adaptive Metamorphic Testing with Contextual Bandits.",
                    "Summary of Hansie: Hybrid and consensus regression test prioritization.",
                    "Summary of Search-based Crash Reproduction using Behavioral Model Seeding.",
                    "Summary of: A Federated Society of Bots for Smart Contract Testing.",
                    "Assisting Bug Report Assignment Using Automated Fault Localisation: An Industrial Case Study.",
                    "Targeting Patterns of Driving Characteristics in Testing Autonomous Driving Systems.",
                    "Industrial Oriented Evaluation of Fuzzing Techniques.",
                    "Type-Centric Kotlin Compiler Fuzzing: Preserving Test Program Correctness by Preserving Types.",
                    "Automatically Checking Semantic Equivalence between Versions of Large-Scale C Projects.",
                    "A Failed attempt at creating Guidelines for Visual GUI Testing: An industrial case study.",
                    "Industrial Scale Passive Testing with T-EARS.",
                    "Boosting Exploratory Testing of Industrial Automation Systems with AI.",
                    "Experiences from Large-Scale Model Checking: Verifying a Vehicle Control System with NuSMV.",
                    "Digital Twins Are Not Monozygotic - Cross-Replicating ADAS Testing in Two Industry-Grade Automotive Simulators.",
                    "Applicable Micropatches and Where to Find Them: Finding and Applying New Security Hot Fixes to Old Software.",
                    "Exploring the Triggering Modes of Spectrum-Based Fault Localization: An Industrial Case.",
                    "COSMO: Code Coverage Made Easier for Android.",
                    "Differential coverage: : automating coverage analysis.",
                    "RiverFuzzRL - an open-source tool to experiment with reinforcement learning for fuzzing.",
                    "Uncertainty-Wizard: Fast and User-Friendly Neural Network Uncertainty Quantification.",
                    "ROBY: a Tool for Robustness Analysis of Neural Network Classifiers.",
                    "Prut4j: Protocol Unit Testing fo(u)r Java.",
                    "PatrIoT: IoT Automated Interoperability and Integration Testing Framework.",
                    "STILE: a Tool for Parallel Execution of E2E Web Test Scripts.",
                    "Poster: Fuzz Testing of Quantum Program.",
                    "Poster: Repair Cross Browser Layout Issues by Combining Learning and Search-based technique.",
                    "Poster: Testing Complex Event Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2021w",
                "sub_name": "14th IEEE International Conference on Software Testing, Verification and Validation Workshops, ICST Workshops 2021, Porto de Galinhas, Brazil, April 12-16, 2021.",
                "count": 42,
                "papers": [
                    "Security testing and resilience.",
                    "Random Selection Might Just be Indomitable.",
                    "MutantBench: an Equivalent Mutant Problem Comparison Framework.",
                    "Automatic Equivalent Mutants Classification Using Abstract Syntax Tree Neural Networks.",
                    "Effectively Sampling Higher Order Mutants Using Causal Effect.",
                    "Inducing Subtle Mutations with Program Repair.",
                    "A Combinatorial Approach to Explaining Image Classifiers.",
                    "A Practical Method for API Testing in the Context of Continuous Delivery and Behavior Driven Development.",
                    "An environment for benchmarking combinatorial test suite generators.",
                    "A Combinatorial Approach to Testing Deep Neural Network-based Autonomous Driving Systems.",
                    "SYSMODIS: A Systematic Model Discovery Approach.",
                    "Computing Sequence Covering Arrays using Unified Combinatorial Interaction Testing.",
                    "Combinatorial Testing Metrics for Machine Learning.",
                    "Combinatorially XSSing Web Application Firewalls.",
                    "Online GANs for Automatic Performance Testing.",
                    "Software Defects Rules Discovery.",
                    "Assuring Fairness of Algorithmic Decision Making.",
                    "Enabling Fast Exploration and Validation of Thermal Dissipation Requirements for Heterogeneous SoCs.",
                    "A Metric Framework for the Gamification of Web and Mobile GUI Testing.",
                    "Model-based Automated Testing of Mobile Applications: An Industrial Case Study.",
                    "Improving Mobile User Interface Testing with Model Driven Monkey Search.",
                    "A Tag-based Recommender System for Regression Test Case Prioritization.",
                    "Multi-company Consumer Product Software Test Architecture Industry Experience Report.",
                    "Syntax-Tree Similarity for Test-Case Derivability in Software Requirements.",
                    "Boosted Exploratory Test Architecture: Coaching Test Engineers with Word Similarity.",
                    "Test Automation with Grad-CAM Heatmaps - A Future Pipe Segment in MLOps for Vision AI?",
                    "Test Sequence Generation with Cayley Graphs.",
                    "A Model-Based Test Script Generation Framework for Embedded Software.",
                    "Estimating Costs for Adopting and Using Model-Based Testing in Agile SCRUM Teams.",
                    "Process Mining on a Robotic Mechanism.",
                    "An Agent-based Architecture for AI-Enhanced Automated Testing for XR Systems, a Short Paper.",
                    "Prioritized Test Generation Guided by Software Fault Prediction.",
                    "DeepRace: A learning-based data race detector.",
                    "AutoKG - An Automotive Domain Knowledge Graph for Software Testing: A position paper.",
                    "Supervised Learning for Test Suit Selection in Continuous Integration.",
                    "Agents for Automated User Experience Testing.",
                    "QRTest: Automatic Query Reformulation for Information Retrieval Based Regression Test Case Prioritization.",
                    "AI-based Test Automation: A Grey Literature Analysis.",
                    "An Empirical Study of Parallelizing Test Execution Using CUDA Unified Memory and OpenMP GPU Offloading.",
                    "Using Advanced Code Analysis for Boosting Unit Test Creation.",
                    "Flaky Mutants; Another Concern for Mutation Testing.",
                    "Active Machine Learning to Test Autonomous Driving."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "13th ICST 2020",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2020",
                "sub_name": "13th IEEE International Conference on Software Testing, Validation and Verification, ICST 2020, Porto, Portugal, October 24-28, 2020.",
                "count": 55,
                "papers": [
                    "One-click formal methods.",
                    "Smart, and also Reliable and Gas-Efficient, Contracts.",
                    "SunDew: Systematic Automated Security Testing.",
                    "Can We Predict the Quality of Spectrum-based Fault Localization?",
                    "Substate Profiling for Enhanced Fault Detection and Localization: An Empirical Study.",
                    "More Accurate Dynamic Slicing for Better Supporting Software Debugging.",
                    "Language-Agnostic Generation of Compilable Test Programs.",
                    "MiMIs: Simple, Efficient, and Fast Bounded-Exhaustive Test Case Generators.",
                    "Learning How to Search: Generating Exception-Triggering Tests Through Adaptive Fitness Function Selection.",
                    "An Empirical Evaluation of Mutation Operators for Deep Learning Systems.",
                    "Comparing Offline and Online Testing of Deep Neural Networks: An Autonomous Car Case Study.",
                    "A Study on Challenges of Testing Robotic Systems.",
                    "Determining Method-Call Sequences for Object Creation in C++.",
                    "NodeRacer: Event Race Detection for Node.js Applications.",
                    "QuickREST: Property-based Test Generation of OpenAPI-Described RESTful APIs.",
                    "RESTTESTGEN: Automated Black-Box Testing of RESTful APIs.",
                    "Testability Transformations For Existing APIs.",
                    "Fostering the Diversity of Exploratory Testing in Web Applications.",
                    "Dependency-Aware Web Test Generation.",
                    "Metamorphic Security Testing for Web Systems.",
                    "Optimizing Mutation Testing by Discovering Dynamic Mutant Subsumption Relations.",
                    "Massively Parallel, Highly Efficient, but What About the Test Suite Quality? Applying Mutation Testing to GPU Programs.",
                    "STICCER: Fast and Effective Database Test Suite Reduction Through Merging of Similar Test Cases.",
                    "Implementation-induced Inconsistency and Nondeterminism in Deterministic Clustering Algorithms.",
                    "CBR: Controlled Burst Recording.",
                    "An Empirical Analysis of Blind Tests.",
                    "A Family of Experiments to Assess the Impact of Page Object Pattern in Web Test Suite Development.",
                    "Human-In-The-Loop Automatic Program Repair.",
                    "A Framework for In-Vivo Testing of Mobile Applications.",
                    "Prioritizing Runtime Verification Violations.",
                    "Parallelization of Classical Numerical optimization in Quantum Variational Algorithms.",
                    "SPECMATE: Automated Creation of Test Cases from Acceptance Criteria.",
                    "Tool Support for Refactoring Manual Tests.",
                    "EC.LANG - A Language for Specifying Response Time Analyses of Event Chains.",
                    "Detecting Higher-Order Merge Conflicts in Large Software Projects.",
                    "Scaling Test Case Generation For Expressive Decision Tables.",
                    "Generating Avoidable Collision Scenarios for Testing Autonomous Driving Systems.",
                    "Checking Security Properties of Cloud Service REST APIs.",
                    "Poster: Test Case Prioritization Using Error Propagation Probability.",
                    "Poster: Performance Testing Driven by Reinforcement Learning.",
                    "Poster: Is Euclidean Distance the best Distance Measurement for Adaptive Random Testing?",
                    "Poster: SONAR Testing - Novel Testing Approach Based on Operation Recording and Visualization.",
                    "Agent-based Testing of Extended Reality Systems.",
                    "Fast Abstract: Data Dynamics for Testing Systems.",
                    "Automated verification of compliance of non-functional requirements on mobile applications through metamorphic testing.",
                    "Well-informed Test Case Generation and Crash Reproduction.",
                    "Anomaly Analyses to Guide Software Testing Activity.",
                    "Toward Automated Assessment of User Experience in Extended Reality.",
                    "Source-Codeless Testing for Android Apps.",
                    "CDST: A Toolkit for Testing Cockpit Display Systems.",
                    "Open-source Defect Injection Benchmark Testbed for the Evaluation of Testing.",
                    "Callisto: Entropy-based Test Generation and Data Quality Assessment for Machine Learning Systems.",
                    "Run Java Applications and Test Them In-Vivo Meantime.",
                    "AFLNET: A Greybox Fuzzer for Network Protocols.",
                    "ct-fuzz: Fuzzing for Timing Leaks."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2020w",
                "sub_name": "13th IEEE International Conference on Software Testing, Verification and Validation Workshops, ICSTW 2020, Porto, Portugal, October 24-28, 2020.",
                "count": 74,
                "papers": [
                    "ICST 2020 CI/CD Industry Workshop Program.",
                    "General Message from the IWCT Workshop Chairs.",
                    "The Next Level of Test Automation (NEXTA 2020).",
                    "ToCaMS - Workshop on Testing of Configurable and Multi-variant Systems.",
                    "A Tool for the Automatic Generation of Test Cases and Oracles for Simulation Models Based on Functional Requirements.",
                    "A Model-Based Security Testing Approach for Automotive Over-The-Air Updates.",
                    "Ontology-based Testing: An Emerging Paradigm for Modeling and Testing Systems and Software.",
                    "Using tabular notation to support model based testing: A practical experience using STTSpec and Spec Explorer.",
                    "Model-Based Testing of Read Only Graph Queries.",
                    "Conformance Testing in UPPAAL: A diabolic approach.",
                    "Model-Based Testing for MAPE-K adaptation control loops.",
                    "Optimizing decision making in concolic execution using reinforcement learning.",
                    "An Automated Testing Framework For Smart TV apps Based on Model Separation.",
                    "Translation from Visual to Layout-based Android Test Cases: a Proof of Concept.",
                    "Supporting efficient test automation using lightweight MBT.",
                    "Model-Based Testing of GUI Applications Featuring Dynamic Instanciation of Widgets.",
                    "Automatic exploratory performance testing using a discriminator neural network.",
                    "Performance Evaluation of Container's Shared Volumes.",
                    "Prioritizing Scenarios based on STAMP/STPA Using Statistical Model Checking.",
                    "Generating Tests for the Discovery of Security Flaws in Product Variants.",
                    "Test Data Generation for False Data Injection Attack Testing in Air Traffic Surveillance.",
                    "Keywords-based test categorization for Extra-Functional Properties.",
                    "An Automata-Based Generation Method for Combinatorial Sequence Testing of Finite State Machines.",
                    "Combinatorial Methods for Explainable AI.",
                    "Generation of Invalid Test Inputs from Over-Constrained Test Models for Combinatorial Robustness Testing.",
                    "On Using Ontologies for Testing Compilers.",
                    "Avocado: Open-Source Flexible Constrained Interaction Testing for Practical Application.",
                    "CAGEN: A fast combinatorial test generation tool with support for constraints and higher-index arrays.",
                    "A Comparison Infrastructure for Fault Characterization Algorithms.",
                    "Toward an Encoding Approach to Interaction-based Test Suite Minimization.",
                    "Identifying Software Test Architect Skills and Knowledge.",
                    "Selenium based Testing Systems for Analytical Data Generation of Website User Behavior.",
                    "Automated security testing of Android applications for secure mobile development.",
                    "Techniques to Have a Common Understanding of Test Aspects among Test Team Members.",
                    "An Integrated Metamodel of Test Scenario to Conform Automotive Standards.",
                    "Complex Software Testing Analysis using International Standards.",
                    "On the impact of timeouts and JVM crashes in Pitest.",
                    "Using mutation testing to measure behavioural test diversity.",
                    "SiMut: Exploring Program Similarity to Support the Cost Reduction of Mutation Testing.",
                    "Predicting Survived and Killed Mutants.",
                    "Fault sTypes of Adaptive and Context-Aware Systems and Their Relationship with Fault-based Testing Approaches.",
                    "MutantDistiller: Using Symbolic Execution for Automatic Detection of Equivalent Mutants and Generation of Mutant Killing Tests.",
                    "A Preliminary Investigation into Using Machine Learning Algorithms to Identify Minimal and Equivalent Mutants.",
                    "Test Automation Process Improvement in a DevOps Team: Experience Report.",
                    "Selective Regression Testing based on Big Data: Comparing Feature Extraction Techniques.",
                    "Test Automation Challenges for Application Landscape Frameworks.",
                    "Test Automation Improvement Model - TAIM 2.0.",
                    "Optimizing the Parameters of an Evolutionary Algorithm for Fuzzing and Test Data Generation.",
                    "Boundary Value Exploration for Software Analysis.",
                    "Test Data Generation for MC/DC Criterion using Reinforcement Learning.",
                    "Optimization of automated executions based on integration test configurations of embedded software.",
                    "On the Industrial Applicability of Augmented Testing: An Empirical Study.",
                    "Session-Based Recommender Systems for Action Selection in GUI Test Generation.",
                    "Runtime Prioritization with the Classification Tree Method for Test Automation.",
                    "On Using k-means Clustering for Test Suite Reduction.",
                    "Prioritization of Test Cases with Varying Test Costs and Fault Severities for Certification Testing.",
                    "Test Tools: an illusion of usability?",
                    "Towards a unified catalog of attributes to guide industry in software testing technique selection.",
                    "How Can Software Testing be Improved by Analytics to Deliver Better Apps?",
                    "Teaching a Testing Concept (JUnit) with Active Learning.",
                    "Teaching Software Testing with Free and Open Source Software.",
                    "Teaching Software Testing in an Algorithms and Data Structures Course.",
                    "How to Teach Software Testing? Experiences with a Sandwich Approach.",
                    "A Case-based Approach for introducing Testing Tools and Principles.",
                    "Can Learning Formal Specification Be Fun? - Experience and Perspective.",
                    "Integrating Testing Throughout the CS Curriculum.",
                    "A Preliminary Report on Hands-On and Cross-Course Activities in a College Software Testing Course.",
                    "Incorporating Testing Topics in an Object-Oriented Programming Course.",
                    "Towards a Learning Environment for Internet of Things Testing with LEGO® MINDSTORMS®.",
                    "Teaching Software Testing with the Code Defenders Testing Game: Experiences and Improvements.",
                    "Towards a Deep Learning Model for Vulnerability Detection on Web Application Variants.",
                    "Regression Test Suite Reduction for Cloud Systems.",
                    "Test Design with the Classification Tree Method in Presence of Variants.",
                    "Fast Abstract: Data Dynamics for Testing Systems."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "12th ICST 2019",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2019",
                "sub_name": "12th IEEE Conference on Software Testing, Validation and Verification, ICST 2019, Xi'an, China, April 22-27, 2019.",
                "count": 53,
                "papers": [
                    "XSTRESSOR : Automatic Generation of Large-Scale Worst-Case Test Inputs by Inferring Path Conditions.",
                    "Automated Testing of Basic Recognition Capability for Speech Recognition Systems.",
                    "Extension-Aware Automated Testing Based on Imperative Predicates.",
                    "Parallel Many-Objective Search for Unit Tests.",
                    "MemFuzz: Using Memory Accesses to Guide Fuzzing.",
                    "SeqFuzzer: An Industrial Protocol Fuzzing Framework from a Deep Learning Perspective.",
                    "Fixing of Security Vulnerabilities in Open Source Projects: A Case Study of Apache HTTP Server and Apache Tomcat.",
                    "Similarities Across Libraries: Making a Case for Leveraging Test Suites.",
                    "BugsJS: a Benchmark of JavaScript Bugs.",
                    "You Cannot Fix What You Cannot Find! An Investigation of Fault Localization Bias in Benchmarking Automated Program Repair Systems.",
                    "Comparing Mutation Testing at the Levels of Source Code and Compiler Intermediate Representation.",
                    "Testing Machine Learning Algorithms for Balanced Data Usage.",
                    "PySE: Automatic Worst-Case Test Generation by Reinforcement Learning.",
                    "An RBM Anomaly Detector for the Cloud.",
                    "An Extensive Study on Cross-Project Predictive Mutation Testing.",
                    "Efficiently Repairing Internationalization Presentation Failures by Solving Layout Constraints.",
                    "Automatic Visual Verification of Layout Failures in Responsively Designed Web Pages.",
                    "Suspend-Less Debugging for Interactive and/or Realtime Programs.",
                    "Directing a Search Towards Execution Properties with a Learned Fitness Function.",
                    "Intent-Preserving Test Repair.",
                    "Learning to Optimize the Alloy Analyzer.",
                    "Uniform Sampling of SAT Solutions for Configurable Systems: Are We There Yet?",
                    "Do Pseudo Test Suites Lead to Inflated Correlation in Measuring Test Effectiveness?",
                    "Coverage-Driven Test Generation for Thread-Safe Classes via Parallel and Conflict Dependencies.",
                    "Precise Static Happens-Before Analysis for Detecting UAF Order Violations in Android.",
                    "An Empirical Assessment of Machine Learning Approaches for Triaging Reports of a Java Static Analysis Tool.",
                    "Techniques for Evolution-Aware Runtime Verification.",
                    "iDFlakies: A Framework for Detecting and Partially Classifying Flaky Tests.",
                    "Resurgence of Regression Test Selection for C++.",
                    "On the Evolution of Keyword-Driven Test Suites.",
                    "An Empirical Study on the Use of Defect Prediction for Test Case Prioritization.",
                    "Poster: ClearTH Test Automation Framework: A Running Example of a DLT-Based Post-Trade System.",
                    "Poster: Automatic Consistency Checking of Requirements with ReqV.",
                    "Poster: Re-Testing Configured Instances in the Production Environment - A Method for Reducing the Test Suite.",
                    "Poster: Aiding Java Developers with Interactive Fault Localization in Eclipse IDE.",
                    "Poster: Supporting JavaScript Experimentation with BugsJS.",
                    "Automating Root Cause Analysis via Machine Learning in Agile Software Testing Environments.",
                    "Classifying False Positive Static Checker Alarms in Continuous Integration Using Convolutional Neural Networks.",
                    "VCIPR: Vulnerable Code is Identifiable When a Patch is Released (Hacker's Perspective).",
                    "Automated Function Assessment in Driving Scenarios.",
                    "Using Data Flow-Based Coverage Criteria for Black-Box Integration Testing of Distributed Software Systems.",
                    "TestSage: Regression Test Selection for Large-Scale Web Service Testing.",
                    "Testing Android Incoming Calls.",
                    "Why Does this App Need this Data? Automatic Tightening of Resource Access.",
                    "Efficient Automated Decomposition of Build Targets at Large-Scale.",
                    "Program Repair at Arbitrary Fault Depth.",
                    "SmokeOut: An Approach for Testing Clustering Implementations.",
                    "AADL-Based Safety Analysis Approaches for Safety-Critical Systems.",
                    "Testing for Implicit Inconsistencies in Documentation and Implementation.",
                    "Automated Scenario-Based Integration Testing of Time-Constrained Distributed Systems.",
                    "Using Testing to Repair Models.",
                    "Operational Profile and Software Testing: Aligning User Interest and Test Strategy.",
                    "A Model-Based Approach to Generate Dynamic Synthetic Test Data."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2019w",
                "sub_name": "2019 IEEE International Conference on Software Testing, Verification and Validation Workshops, ICST Workshops 2019, Xi'an, China, April 22-23, 2019.",
                "count": 46,
                "papers": [
                    "Automatic Refinement of ASM Abstract Test Cases.",
                    "A Model-Based Approach to Generate Dynamic Synthetic Test Data: A Conceptual Model.",
                    "AbsCon: A Test Concretizer for Model-Based Testing.",
                    "Software Testing: According to Plan!",
                    "Using Imprecise Test Oracles Modelled by FSM.",
                    "Case Studies in Learning Models and Testing Without Reset.",
                    "Weighted Combinatorial Sequence Testing for the TLS Protocol.",
                    "Programming Behavioral Test Models for SMT Solving in Scala.",
                    "Developing a QRNG ECU for Automotive Security: Experience of Testing in the Real-World.",
                    "Evaluating a Test Automation Decision Support Tool.",
                    "Medusa: Mutant Equivalence Detection Using Satisfiability Analysis.",
                    "PIT-HOM: an Extension of Pitest for Higher Order Mutation Analysis.",
                    "An Empirical Comparison of Mutant Selection Assessment Metrics.",
                    "Testing When Mobile Apps Go to Background and Come Back to Foreground.",
                    "Estimating the Number of Equivalent Mutants.",
                    "Practical Combinatorial Testing for XSS Detection using Locally Optimized Attack Models.",
                    "Applying Change Impact Analysis Test to Migration Test Case Extraction Based on IDAU and Graph Analysis Techniques.",
                    "Team Activities Measurement Method for Open Source Software Development Using the Gini Coefficient.",
                    "Suggestion of Testing Method for Industrial Level Cyber-Physical System in Complex Environment.",
                    "Designing Fulfilling Test Cases with Test Aspect Model.",
                    "Requirements Dependencies-Based Test Case Prioritization for Extra-Functional Properties.",
                    "Machine Learning to Guide Performance Testing: An Autonomous Test Framework.",
                    "Behavioral Models and Scenario Selection for Testing IoT Trickle-Based Lossy Multicast Networks.",
                    "Augmented Testing: Industry Feedback To Shape a New Testing Technology.",
                    "Towards Automated Generation of Bug Benchmark for Smart Contracts.",
                    "Crucial Tool Features for Successful Combinatorial Input Parameter Testing in an Industrial Application.",
                    "Applying Combinatorial Testing to Large-Scale Data Processing at Adobe.",
                    "Measuring Combinatorial Coverage at Adobe.",
                    "Scenario Sampling for Cyber Physical Systems using Combinatorial Testing.",
                    "Efficient and Guaranteed Detection of t-Way Failure-Inducing Combinations.",
                    "An Industrial Study on Applications of Combinatorial Testing in Modern Web Development.",
                    "Partitioned Search with Column Resampling for Locating Array Construction.",
                    "A Framework for Automated Combinatorial Test Generation, Execution, and Fault Characterization.",
                    "On the Industrial Application of Combinatorial Testing for Autonomous Driving Functions.",
                    "An Approach to T-Way Test Sequence Generation With Constraints.",
                    "Using Parameter Mapping to Avoid Forbidden Tuples in a Covering Array.",
                    "Reduce Test Cost by Reusing Test Oracles through Combinatorial Join.",
                    "On Measuring Combinatorial Coverage of Manually Created Test Cases for Industrial Software.",
                    "Practical Fault Localization with Combinatorial Test Design.",
                    "Learning to Restrict Test Range for Compiler Test.",
                    "Coverage-Guided Learning-Assisted Grammar-Based Fuzzing.",
                    "Variable Strength Combinatorial Testing for Deep Neural Networks.",
                    "Learning Performance Optimization from Code Changes for Android Apps.",
                    "Automatic Generation of Capability Leaks' Exploits for Android Applications.",
                    "Prediction of Undetected Faults in Safety-Critical Software.",
                    "Test Agents: The Next Generation of Test Cases."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "11th ICST 2018",
        "info": "Västerås, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2018",
                "sub_name": "11th IEEE International Conference on Software Testing, Verification and Validation, ICST 2018, Västerås, Sweden, April 9-13, 2018.",
                "count": 47,
                "papers": [
                    "Practical Test Dependency Detection.",
                    "DOMINO: Fast and Effective Test Data Generation for Relational Database Schemas.",
                    "Automated Generation of Constraints from Use Case Specifications to Support System Testing.",
                    "Characterizing Defective Configuration Scripts Used for Continuous Deployment.",
                    "REMAP: Using Rule Mining and Multi-objective Search for Dynamic Test Case Prioritization.",
                    "Speeding up Mutation Testing via Regression Test Selection: An Extensive Study.",
                    "Automating Targeted Property-Based Testing.",
                    "Testing Cloud Applications under Cloud-Uncertainty Performance Effects.",
                    "Behavioral Fault Localization by Sampling Suspicious Dynamic Control Flow Subgraphs.",
                    "QBE: QLearning-Based Exploration of Android Applications.",
                    "Automated Accessibility Testing of Mobile Apps.",
                    "Context-Based Event Trace Reduction in Client-Side JavaScript Applications.",
                    "Exhaustive Exploration of the Failure-Oblivious Computing Search Space.",
                    "Finding Substitutable Binary Code for Reverse Engineering by Synthesizing Adapters.",
                    "EdSynth: Synthesizing API Sequences with Conditionals and Loops.",
                    "Continuous Integration and Visual GUI Testing: Benefits and Drawbacks in Industrial Practice.",
                    "Automatic Detection of Visibility Faults by Layout Changes in HTML5 Web Pages.",
                    "Web Canvas Testing Through Visual Inference.",
                    "Uncovering Unknown System Behaviors in Uncertain Networks with Model and Search-Based Testing.",
                    "Automated Repair of Internationalization Presentation Failures in Web Pages Using Style Similarity Clustering and Search-Based Techniques.",
                    "Accelerating Search-Based Program Repair.",
                    "Invasive Software Testing: Mutating Target Programs to Diversify Test Exploration for High Test Coverage.",
                    "How Do Automatically Generated Unit Tests Influence Software Maintenance?",
                    "Localizing Faults in Cloud Systems.",
                    "An Investigation of Compression Techniques to Speed up Mutation Testing.",
                    "Approximate Transformations as Mutation Operators.",
                    "Virtualized-Fault Injection Testing: A Machine Learning Approach.",
                    "Investigating NLP-Based Approaches for Predicting Manual Test Case Failure.",
                    "An Empirical Study on Software Failure Classification with Multi-label and Problem-Transformation Techniques.",
                    "Crashing Simulated Planes is Cheap: Can Simulation Detect Robotics Bugs Early?",
                    "Evaluating Automated Software Verification Tools.",
                    "Automating Web Application Testing from the Ground Up: Experiences and Lessons Learned in an Industrial Setting.",
                    "Improving Test Execution Efficiency Through Clustering and Reordering of Independent Test Steps.",
                    "Systematic Test Platform Selection: Reducing Costs for Testing Software-Based Automotive E/E Systems.",
                    "Bluetooth Low Energy Devices Security Testing Framework.",
                    "EvoMaster: Evolutionary Multi-context Automated System Test Generation.",
                    "AUnit: A Test Automation Tool for Alloy.",
                    "Jaguar: A Spectrum-Based Fault Localization Tool for Real-World Software.",
                    "SimEvo: A Toolset for Simulink Test Evolution & Maintenance.",
                    "Fuzzinator: An Open-Source Modular Random Testing Framework.",
                    "Taxonomy Based Testing Using SW91, a Medical Device Software Defect Taxonomy.",
                    "Test Automation Maturity Assessment.",
                    "Software Systems, Their Engineers and Their Testers.",
                    "Testing Natural Language Grammars.",
                    "Analysis of the Logical Consistency in Cassandra.",
                    "Knowledge Discovery Metamodel-Based Unit Test Cases Generation.",
                    "Anti-Patterns in Infrastructure as Code."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2018w",
                "sub_name": "2018 IEEE International Conference on Software Testing, Verification and Validation Workshops, ICST Workshops, Västerås, Sweden, April 9-13, 2018.",
                "count": 60,
                "papers": [
                    "A Systematic Review of Cost Reduction Techniques for Mutation Testing: Preliminary Results.",
                    "To Detect Abnormal Program Behaviours via Mutation Deduction.",
                    "If You Can't Kill a Supermutant, You Have a Problem.",
                    "Mull It Over: Mutation Testing Based on LLVM.",
                    "Mutant Quality Indicators.",
                    "MUSIC: Mutation Analysis Tool with High Configurability and Extensibility.",
                    "An Industrial Application of Mutation Testing: Lessons, Challenges, and Research Directions.",
                    "A Testability Analysis Framework for Non-functional Properties.",
                    "Model-Based Mutation Testing of Real-Time Systems via Model Checking.",
                    "Identifying Useful Mutants to Test Time Properties.",
                    "Learning-Based Self-Adaptive Assurance of Timing Properties in a Real-Time Embedded System.",
                    "Scan Code Injection Flaws in HTML5-Based Mobile Applications.",
                    "A Framework for Threat-Driven Cyber Security Verification of IoT Systems.",
                    "Architectures and Experiences in Testing IoT Communications.",
                    "A Brief Overview of Existing Tools for Testing the Internet-of-Things.",
                    "Requirements for Testing and Validating the Industrial Internet of Things.",
                    "Test Automation - Automation of What?",
                    "Challenges in Automated Testing Through Graphical User Interface.",
                    "Assessing Technical Debt in Automated Tests with CodeScene.",
                    "Evaluating Test Data Generation for Untyped Data Structures Using Genetic Algorithms.",
                    "Feature-Based Testing by Using Model Synthesis, Test Generation and Parameterizable Test Prioritization.",
                    "Introducing Automated GUI Testing and Observing Its Benefits: An Industrial Case Study in the Context of Law-Practice Management Software.",
                    "Automatically Generating Test Scripts for GUI Testing.",
                    "Maintenance of Android Widget-Based GUI Testing: A Taxonomy of Test Case Modification Causes.",
                    "The Next Level of Test Automation: What About the Users?",
                    "Design of High Confidence Embedded Software Hardware-in-Loop Simulation Test Platform Based on Hierarchical Model.",
                    "Software Metrics for Policy-Driven Software Development Life Cycle Automation.",
                    "A Model-Based Test Case Management Approach for Integrated Sets of Domain-Specific Models.",
                    "Generation of C++ Unit Tests from Abstract State Machines Specifications.",
                    "SPYH-Method: An Improvement in Testing of Finite-State Machines.",
                    "Modelling Hand Gestures to Test Leap Motion Controlled Applications.",
                    "Temporal Logic Falsification of Cyber-Physical Systems: An Input-Signal-Space Optimization Approach.",
                    "Lightweight Model-Based Testing for Enterprise IT.",
                    "Testing of Big Data Analytics Systems by Benchmark.",
                    "Test Case Reduction Based on the Join Condition in Pairwise Coverage-Based Database Testing.",
                    "Model-Based Security Testing - Deriving Test Models from Artefacts of Security Engineering.",
                    "Software Test Architectures and Advanced Support Environments for IoT.",
                    "Extending the UML Testing Profile with a Fine-Grained Test Logging Model.",
                    "Proposal for Enhancing UTP2 with Test Aspects.",
                    "A Test Architecture for Machine Learning Product.",
                    "A Survey of Software Quality for Machine Learning Applications.",
                    "A Satisfiability-Based Approach to Generation of Constrained Locating Arrays.",
                    "Optimal Scheduling for Combinatorial Software Testing and Design of Experiments.",
                    "Enumerator: An Efficient Approach for Enumerating all Valid t-tuples.",
                    "Combinatorial Test Design - A Smarter Way to Connect with the Business.",
                    "Migrating Combinatorial Interaction Test Modeling and Generation to the Web.",
                    "CAMETRICS: A Tool for Advanced Combinatorial Analysis and Measurement of Test Sets.",
                    "Combinatorial Testing with Constraints for Negative Test Cases.",
                    "The Effect of Time-Between-Events for Sequence Interaction Testing of a Real-Time System.",
                    "Practical Amplification of Condition/Decision Test Coverage by Combinatorial Testing.",
                    "Combining Combinatorial Testing and Metamorphic Testing for Testing a Logic-Based Non-monotonic Reasoning System.",
                    "Adapting Unit Tests by Generating Combinatorial Test Data.",
                    "Support for Finding Presentation Failures by Using Computer Vision Techniques.",
                    "Applying Automated Test Case Generation in Industry: A Retrospective.",
                    "On the Automation of Testing a Logic-Based Diagnosis System.",
                    "Effects of an Economic Approach for Test Case Selection and Reduction for a Large Industrial Project.",
                    "Tailoring ISO/IEC/IEEE 29119-3 Standard for Small and Medium-Sized Enterprises.",
                    "Verification of Cyber-Physical Automotive Systems-of-Systems: Test Environment Assignment.",
                    "A Topic Model and Test History-Based Test Case Recommendation Method for Regression Testing.",
                    "Risk-Driven Model-Based Testing of Washing Machine Software: An Industrial Case Study."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "10th ICST 2017",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2017",
                "sub_name": "2017 IEEE International Conference on Software Testing, Verification and Validation, ICST 2017, Tokyo, Japan, March 13-17, 2017.",
                "count": 67,
                "papers": [
                    "Localizing Faults in SQL Predicates.",
                    "Prevalence of Single-Fault Fixes and Its Impact on Fault Localization.",
                    "FIFA: A Kernel-Level Fault Injection Framework for ARM-Based Embedded Linux System.",
                    "Using Delta Debugging to Minimize Stress Tests for Concurrent Data Structures.",
                    "The Theory of Composite Faults.",
                    "Symbolic Complexity Analysis Using Context-Preserving Histories.",
                    "Coveringcerts: Combinatorial Methods for X.509 Certificate Testing.",
                    "Recovering Semantic Traceability Links between APIs and Security Vulnerabilities: An Ontological Modeling Approach.",
                    "Mining Sandboxes for Linux Containers.",
                    "Perphecy: Performance Regression Test Selection Made Simple but Effective.",
                    "A Selection Method for Black Box Regression Testing with a Statistically Defined Quality Level.",
                    "Private API Access and Functional Mocking in Automated Unit Test Generation.",
                    "Using Semantic Similarity in Crawling-Based Web Application Testing.",
                    "Barista: A Technique for Recording, Encoding, and Running Platform Independent Android Tests.",
                    "ATOM: Automatic Maintenance of GUI Test Scripts for Evolving Mobile Applications.",
                    "Automated Testing of Definition-Use Data Flow for Multithreaded Programs.",
                    "IPA: Error Propagation Analysis of Multi-Threaded Programs Using Likely Invariants.",
                    "Verifying Concurrent Programs Using Contracts.",
                    "Are There Any Unit Tests? An Empirical Study on Unit Testing in Open Source Python Projects.",
                    "Broadcast vs. Unicast Review Technology: Does It Matter?",
                    "JavaScript: The (Un)Covered Parts.",
                    "Non-Semantics-Preserving Transformations for Higher-Coverage Test Generation Using Symbolic Execution.",
                    "Uncertainty-Driven Black-Box Test Data Generation.",
                    "Automated Test Generation and Mutation Testing for Alloy.",
                    "Model-Based Testing IoT Communication via Active Automata Learning.",
                    "Model-Based API Testing of Apache ZooKeeper.",
                    "System Testing of Timing Requirements Based on Use Cases and Timed Automata.",
                    "Efficient Incrementalized Runtime Checking of Linear Measures on Lists.",
                    "Behavioral Execution Comparison: Are Tests Representative of Field Behavior?",
                    "Automated Random Testing in Multiple Dispatch Languages.",
                    "The Fitness Function for the Job: Search-Based Generation of Test Suites That Detect Real Faults.",
                    "A Search-Based Testing Approach for XML Injection Vulnerabilities in Web Applications.",
                    "CBGA-ES: A Cluster-Based Genetic Algorithm with Elitist Selection for Supporting Multi-Objective Test Optimization.",
                    "Incremental Deductive Verification for Relational Model Transformations.",
                    "Statistical Model Checking Meets Property-Based Testing.",
                    "Timed k-Tail: Automatic Inference of Timed Automata.",
                    "A Comparative Study of Manual and Automated Testing for Industrial Control Software.",
                    "How Do Assertions Impact Coverage-Based Test-Suite Reduction?",
                    "Automata Language Equivalence vs. Simulations for Model-Based Mutant Equivalence: An Empirical Evaluation.",
                    "Assessing and Improving the Mutation Testing Practice of PIT.",
                    "Generic and Effective Specification of Structural Test Objectives.",
                    "Ariadne: Hybridizing Directed Model Checking and Static Analysis.",
                    "A Toolkit for Testing Stochastic Simulations against Statistical Oracles.",
                    "O!Snap: Cost-Efficient Testing in the Cloud.",
                    "Accelerating Test Automation through a Domain Specific Language.",
                    "Efficient Safety Proofs for Industry-Scale Code Using Abstractions and Bounded Model Checking.",
                    "NuSeen: A Tool Framework for the NuSMV Model Checker.",
                    "Transferring State-of-the-Art Immutability Analyses: Experimentation Toolbox and Accuracy Benchmark.",
                    "NIVAnalyzer: A Tool for Automatically Detecting and Verifying Next-Intent Vulnerabilities in Android Apps.",
                    "Taming Coverage Criteria Heterogeneity with LTest.",
                    "Test Design as Code: JCUnit.",
                    "SAGA Toolbox: Interactive Testing of Guarded Assertions.",
                    "TITAN: Test Suite Optimization for Highly Configurable Software.",
                    "ADRENALIN-RV: Android Runtime Verification Using Load-Time Weaving.",
                    "Towards a Testbed for Automotive Cybersecurity.",
                    "How to Test in Sixteen Languages? Automation Support for Localization Testing.",
                    "Information Needs for Validating Evolving Software Systems: An Exploratory Study at Google.",
                    "A Controlled Experiment on Coverage Maximization of Automated Model-Based Software Test Cases in the Automotive Industry.",
                    "An Industrial Study of Natural Language Processing Based Test Case Prioritization.",
                    "Overview of the ICST International Software Testing Contest.",
                    "Localizing and Fixing Faults in SQL Predicates.",
                    "Debugging Multithreaded Programs Using Symbolic Analysis.",
                    "Automated and Scalable Mutation Testing.",
                    "A Framework for Failure Diagnosis.",
                    "Enhancing Trust - Software Vulnerability Analysis Framework.",
                    "Reflecting the Adoption of Software Testing Research in Open-Source Projects.",
                    "Abstraction Refinement for Non-Zeno Fairness Veri?cation of Linear Hybrid Automata."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2017w",
                "sub_name": "2017 IEEE International Conference on Software Testing, Verification and Validation Workshops, ICST Workshops 2017, Tokyo, Japan, March 13-17, 2017.",
                "count": 74,
                "papers": [
                    "Message from the TAIC PART 2017 Chairs.",
                    "Coverage-Based Reduction of Test Execution Time: Lessons from a Very Large Industrial Project.",
                    "Are CISQ Reliability Measures Practical? A Research Perspective.",
                    "Impact of Education and Experience Level on the Effectiveness of Exploratory Testing: An Industrial Case Study.",
                    "A Test Case Recommendation Method Based on Morphological Analysis, Clustering and the Mahalanobis-Taguchi Method.",
                    "Results of a Comparative Study of Code Coverage Tools in Computer Vision.",
                    "Test Case Generation and Prioritization: A Process-Mining Approach.",
                    "Software Testing in Industry and Academia: A View of Both Sides in Japan.",
                    "Industry-Academia Collaboration in Software Testing: An Overview of TAIC PART 2017.",
                    "Message from the ITEQS 2017 Chairs.",
                    "A Process for Sound Conformance Testing of Cyber-Physical Systems.",
                    "Testing Cache Side-Channel Leakage.",
                    "Simulation-Based Safety Testing Brake-by-Wire.",
                    "Targeted Mutation: Efficient Mutation Analysis for Testing Non-Functional Properties.",
                    "Automatic Test Generation for Energy Consumption of Embedded Systems Modeled in EAST-ADL.",
                    "Runtime Verification for Detecting Suspension Bugs in Multicore and Parallel Software.",
                    "Generating Controllably Invalid and Atypical Inputs for Robustness Testing.",
                    "Message from the Mutation 2017 Chairs.",
                    "MutRex: A Mutation-Based Generator of Fault Detecting Strings for Regular Expressions.",
                    "Towards Security-Aware Mutation Testing.",
                    "Speeding-Up Mutation Testing via Data Compression and State Infection.",
                    "Applying Mutation Analysis on Kernel Test Suites: An Experience Report.",
                    "Mutation Patterns for Temporal Requirements of Reactive Systems.",
                    "How Good Are Your Types? Using Mutation Analysis to Evaluate the Effectiveness of Type Annotations.",
                    "Reducing Mutants with Mutant Killable Precondition.",
                    "Finding Redundancy in Web Mutation Operators.",
                    "An Architecture for the Development of Mutation Operators.",
                    "Are Deletion Mutants Easier to Identify Manually?",
                    "General Message from the IWCT Workshop Chairs.",
                    "IWCT 2017 Organizers.",
                    "A Model for T-Way Fault Profile Evolution during Testing.",
                    "Mutation Score, Coverage, Model Inference: Quality Assessment for T-Way Combinatorial Test-Suites.",
                    "Optimizing IPOG's Vertical Growth with Constraints Based on Hypergraph Coloring.",
                    "Test Case Generation with Regular Expressions and Combinatorial Techniques.",
                    "Applying Combinatorial Testing to High-Speed Railway Track Circuit Receiver.",
                    "Applications of Practical Combinatorial Testing Methods at Siemens Industry Inc., Building Technologies Division.",
                    "Using Timed Base-Choice Coverage Criterion for Testing Industrial Control Software.",
                    "Building Combinatorial Test Input Model from Use Case Artefacts.",
                    "Combinatorial Methods for Modelling Composed Software Systems.",
                    "Combinatorial Interaction Testing for Automated Constraint Repair.",
                    "A Composition-Based Method for Combinatorial Test Design.",
                    "Applying Combinatorial Testing to Data Mining Algorithms.",
                    "Combinatorial Testing on Implementations of HTML5 Support.",
                    "Combinatorial Testing on MP3 for Audio Players.",
                    "Finding Minimum Locating Arrays Using a SAT Solver.",
                    "Test Optimization Using Combinatorial Test Design: Real-World Experience in Deployment of Combinatorial Testing at Scale.",
                    "Messages from the InSTA 2017 Chairs.",
                    "Analysing Test Basis and Deriving Test Cases Based on Data Design Documents.",
                    "Improvement of Description for Reusable Test Type by Using Test Frame.",
                    "Suggestion of Practical Quantification Measuring Method of Test Design Which Can Represent the Current Status.",
                    "Software Testing Design Techniques Used in Automated Vehicle Simulations.",
                    "Closing the Gap between Unit Test Code and Documentation.",
                    "Test Conglomeration - Proposal for Test Design Notation Like Class Diagram.",
                    "Defining the Phrase \"Software Test Architecture\" Emerging Idea.",
                    "Message from the A-MOST 2017 Chairs.",
                    "Mutation-Based Test-Case Generation with Ecdar.",
                    "Reducing the Concretization Effort in FSM-Based Testing of Software Product Lines.",
                    "Property-Based Testing with External Test-Case Generators.",
                    "Planning-Based Security Testing of the SSL/TLS Protocol.",
                    "Towards Decentralized Conformance Checking in Model-Based Testing of Distributed Systems.",
                    "Pattern-Based Usability Testing.",
                    "A Mechanism of Reliable and Standalone Script Generator on Android.",
                    "EarthCube Software Testing and Assessment Framework.",
                    "Using Model-Checking for Timing Verification in Industrial System Design.",
                    "Challenges of Operationalizing Spectrum-Based Fault Localization from a Data-Centric Perspective.",
                    "Towards a Gamified Equivalent Mutants Detection Platform.",
                    "Cloud API Testing.",
                    "Automated A/B Testing with Declarative Variability Expressions.",
                    "Weighting for Combinatorial Testing by Bayesian Inference.",
                    "Impact of Static and Dynamic Coverage on Test-Case Prioritization: An Empirical Study.",
                    "BDTest, a System to Test Big Data Frameworks.",
                    "What You See Is What You Test - Augmenting Software Testing with Computer Vision.",
                    "Framework for Model-Based Design and Verification of Human-in-the-Loop Cyber-Physical Systems.",
                    "Automated Test Case Generation from OTS/CafeOBJ Specifications by Specification Translation."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "9th ICST 2016",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2016",
                "sub_name": "2016 IEEE International Conference on Software Testing, Verification and Validation, ICST 2016, Chicago, IL, USA, April 11-15, 2016.",
                "count": 47,
                "papers": [
                    "A Controlled Experiment in Testing of Safety-Critical Embedded Software.",
                    "Repeated Combinatorial Test Design - Unleashing the Potential in Multiple Testing Iterations.",
                    "A Framework to Evaluate the Effectiveness of Different Load Testing Analysis Techniques.",
                    "Automatically Discovering, Reporting and Reproducing Android Application Crashes.",
                    "Symbooglix: A Symbolic Execution Engine for Boogie Programs.",
                    "Nonconformity Resolving Recommendations for Product Line Configuration.",
                    "Using Exploration Focused Techniques to Augment Search-Based Software Testing: An Experimental Evaluation.",
                    "Detecting Assumptions on Deterministic Implementations of Non-deterministic Specifications.",
                    "An Empirical Study on Detecting and Fixing Buffer Overflow Bugs.",
                    "Automatic Detection and Removal of Conformance Faults in Feature Models.",
                    "Debugging without Testing.",
                    "Properties of Effective Metrics for Coverage-Based Statistical Fault Localization.",
                    "Mysteries of DropBox: Property-Based Testing of a Distributed Synchronization Service.",
                    "Effective Partial Order Reduction in Model Checking Database Applications.",
                    "Canopus: A Domain-Specific Language for Modeling Performance Testing.",
                    "Predicting Testability of Concurrent Programs.",
                    "Why do Record/Replay Tests of Web Applications Break?",
                    "Using Visual Symptoms for Debugging Presentation Failures in Web Applications.",
                    "Detecting and Localizing Internationalization Presentation Failures in Web Applications.",
                    "Selecting the Right Topics for Industry-Academia Collaborations in Software Testing: An Experience Report.",
                    "Test Set Diameter: Quantifying the Diversity of Sets of Test Cases.",
                    "Interpreting Coverage Information Using Direct and Indirect Coverage.",
                    "How Well are Your Requirements Tested?",
                    "Empirical Evaluation of Test Coverage for Functional Programs.",
                    "Test Case Prioritization for Compilers: A Text-Vector Based Approach.",
                    "Tedsuto: A General Framework for Testing Dynamic Software Updates.",
                    "Model-Based Regression Test Selection for Validating Runtime Adaptation of Software Systems.",
                    "A Theoretical Framework for Understanding Mutation-Based Testing Methods.",
                    "Generating Evil Test Strings for Regular Expressions.",
                    "MuVM: Higher Order Mutation Analysis Virtual Machine for C.",
                    "Atrina: Inferring Unit Oracles from GUI Test Cases.",
                    "Automatically Documenting Unit Test Cases.",
                    "Profiting from Unit Tests for Integration Testing.",
                    "Coordinated Collaborative Testing of Shared Software Components.",
                    "Testing Concurrent Software Systems.",
                    "Semantic-Based Test Case Generation.",
                    "Making System User Interactive Tests Repeatable: When and What Should we Control?",
                    "Verification Methodology for Fully Autonomous Heavy Vehicles.",
                    "Automated Scenario-Based Testing of Distributed and Heterogeneous Systems.",
                    "Modeling App Behavior from Multiple Artifacts.",
                    "Symbolic Characterisation of Commonalities in Testing Software Product Lines.",
                    "Self-Healing Cloud Applications.",
                    "Semantic Testing of Interactive Applications.",
                    "Skyfire: Model-Based Testing with Cucumber.",
                    "Unit Test Generation During Software Development: EvoSuite Plugins for Maven, IntelliJ and Jenkins.",
                    "Large Scale Generation of Complex and Faulty PHP Test Cases.",
                    "A Framework for Monkey GUI Testing."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2016w",
                "sub_name": "Ninth IEEE International Conference on Software Testing, Verification and Validation Workshops, ICST Workshops 2016, Chicago, IL, USA, April 11-15, 2016.",
                "count": 41,
                "papers": [
                    "Automatic Generation of UTP Models from Requirements in Natural Language.",
                    "A Study on the Effectiveness of Test-Categories Based Test Analysis.",
                    "Difference in Quality of Test Architecture between Service Providers and Subcontractors.",
                    "Combinatorial Testing: From Algorithms to Applications.",
                    "Coverage, Location, Detection, and Measurement.",
                    "Evaluating the Effectiveness of BEN in Localizing Different Types of Software Fault.",
                    "Analyzing Minimal Failure-Causing Schemas in Siemens Suite.",
                    "Should We Care about \"Don't Care\" Testing Inputs?: Empirical Investigation of Pair-Wise Testing.",
                    "Towards Automatic Cost Model Discovery for Combinatorial Interaction Testing.",
                    "Pseudo-Exhaustive Testing of Attribute Based Access Control Rules.",
                    "Combinatorial Testing: Implementations in Solutions Testing.",
                    "Embedded Functions for Constraints and Variable Strength in Combinatorial Testing.",
                    "Test Oracles and Test Script Generation in Combinatorial Testing.",
                    "Applying a Pairwise Coverage Criterion to Scenario-Based Testing.",
                    "Pairwise Coverage-Based Testing with Selected Elements in a Query for Database Applications.",
                    "An Experimental Evaluation of Web Mutation Operators.",
                    "On Strong Mutation and Subsuming Mutants.",
                    "Diversity-Aware Mutation Adequacy Criterion for Improving Fault Detection Capability.",
                    "Measuring Effectiveness of Mutant Sets.",
                    "Are We There Yet? How Redundant and Equivalent Mutants Affect Determination of Test Completeness.",
                    "Nequivack: Assessing Mutation Score Confidence.",
                    "Code Defenders: A Mutation Testing Game.",
                    "SIMULTATE: A Toolset for Fault Injection and Mutation Testing of Simulink Models.",
                    "Relating Code Coverage, Mutation Score and Test Suite Reducibility to Defect Density.",
                    "Effective Fault Localization Using Dynamic Slicing and an SMT Solver.",
                    "Using Petri Nets to Test Concurrent Behavior of Web Applications.",
                    "A Model-Based Approach for Product Testing and Certification in Digital Ecosystems.",
                    "Industrial Evaluation of Test Suite Generation Strategies for Model-Based Testing.",
                    "Property-Based Testing with FsCheck by Deriving Properties from Business Rule Models.",
                    "Checking Experiments for Symbolic Input/Output Finite State Machines.",
                    "Industry-Academia Collaboration in Software Testing: An Overview of TAIC PART 2016.",
                    "Academic and Industrial Software Testing Conferences: Survey and Synergies.",
                    "Systematic Analysis of Practical Issues in Test Automation for Communication Based Systems.",
                    "Exploring the Presence of Technical Debt in Industrial GUI-Based Testware: A Case Study.",
                    "Successive Refinement of Models for Model-Based Testing to Increase System Test Effectiveness.",
                    "Experience Report: White Box Test Case Generation for Automotive Embedded Software.",
                    "Automated Fault-Tolerance Testing.",
                    "Dynamic Integration Test Selection Based on Test Case Dependencies.",
                    "A Tool for Automated Inspection of Software Design Documents and Its Empirical Evaluation in an Aviation Industry Setting.",
                    "The Effect of Team Exploratory Testing - Experience Report from F-Secure.",
                    "Do Exploratory Testers Need Formal Training? An Investigation Using HCI Techniques."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "8th ICST 2015",
        "info": "Graz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2015",
                "sub_name": "8th IEEE International Conference on Software Testing, Verification and Validation, ICST 2015, Graz, Austria, April 13-17, 2015.",
                "count": 60,
                "papers": [
                    "A Lightweight, Static Approach to Detecting Unbounded Thread-Instantiation Loops.",
                    "Achievements, Open Problems and Challenges for Search Based Software Testing.",
                    "Behind an Application Firewall, Are We Safe from SQL Injection Attacks?",
                    "Classifying and Qualifying GUI Defects.",
                    "Combining Algebraic and Domain Testing to Design Adequate Test Cases for Signal Processing Algorithms.",
                    "Conceptualization and Evaluation of Component-Based Testing Unified with Visual GUI Testing: An Empirical Study.",
                    "Detecting Display Energy Hotspots in Android Apps.",
                    "Detection and Localization of HTML Presentation Failures Using Computer Vision-Based Techniques.",
                    "Evaluating Symbolic Execution-Based Test Tools.",
                    "Exploring Test Suite Diversification and Code Coverage in Multi-Objective Test Case Selection.",
                    "Generating Complex and Faulty Test Data through Model-Based Mutation Analysis.",
                    "Generating Succinct Test Cases Using Don't Care Analysis.",
                    "Generating Tests for Detecting Faults in Feature Models.",
                    "Guided Test Generation for Finding Worst-Case Stack Usage in Embedded Systems.",
                    "If A Fails, Can B Still Succeed? Inferring Dependencies between Test Results in Automotive System Testing.",
                    "Iterative Instrumentation for Code Coverage in Time-Sensitive Systems.",
                    "JSEFT: Automated Javascript Unit Test Generation.",
                    "Navigating Information Overload Caused by Automated Testing - a Clustering Approach in Multi-Branch Development.",
                    "NUMFL: Localizing Faults in Numerical Software Using a Value-Based Causal Model.",
                    "On the Industrial Applicability of TextTest: An Empirical Case Study.",
                    "Optimization of Combinatorial Testing by Incremental SAT Solving.",
                    "Perspectives on White-Box Testing: Coverage, Concurrency, and Concolic Execution.",
                    "Postconditioned Symbolic Execution.",
                    "Prioritizing Manual Test Cases in Traditional and Rapid Release Environments.",
                    "QuickChecking Static Analysis Properties.",
                    "Reformulating Branch Coverage as a Many-Objective Optimization Problem.",
                    "Re-Using Generators of Complex Test Data.",
                    "Show Me New Counterexamples: A Path-Based Approach.",
                    "Sound and Quasi-Complete Detection of Infeasible Test Requirements.",
                    "Test Generation from Business Rules.",
                    "Understanding the Test Automation Culture of App Developers.",
                    "Using Fuzzy Logic and Symbolic Execution to Prioritize UML-RT Test Cases.",
                    "Using Multi-Locators to Increase the Robustness of Web Test Cases.",
                    "Yes! You Can Use Your Model Checker to Verify OSEK/VDX Applications.",
                    "Co-Evolution of Model-Based Tests for Industrial Automotive Software.",
                    "Incremental Model-Based Mutation Testing.",
                    "Model-Based Mutation Testing of Synchronous and Asynchronous Real-Time Systems.",
                    "Non-Intrusive Documentation-Driven Integration Testing.",
                    "Test Suite Quality Assessment Using Model Inference Techniques.",
                    "A Case Study on the Efficiency of Model-Based Testing at the European Space Agency.",
                    "A Scalable Big Data Test Framework.",
                    "A Virtual Bank for Development and Testing.",
                    "Fluently Reading, Writing and Speaking Hexadecimal with Gepetto's Help.",
                    "History-Based Test Case Prioritization for Black Box Testing Using Ant Colony Optimization.",
                    "Integrating Concrete Symbolic Testing with an Industrial Embedded Software Development Workflow.",
                    "MetTest: A Test Automation Framework for Development of a Point-To-Multipoint Radio.",
                    "Mobile Testing in Software Industry Using Agile: Challenges and Opportunities.",
                    "Model-Based Continuous Integration Testing of Responsiveness of Web Applications.",
                    "MoMut: : UML Model-Based Mutation Testing for UML.",
                    "PLeTsPerf - A Model-Based Performance Testing Tool.",
                    "Seamless Integration of Test Information Management and Calibration Data Management in the Overall Automotive Development Process.",
                    "Security Threat Identification and Testing.",
                    "SEViz: A Tool for Visualizing Symbolic Execution.",
                    "Supporting the Transition to an Agile Test Matrix.",
                    "TESEM: A Tool for Verifying Security Design Pattern Applications by Model Testing.",
                    "Testing Legacy Embedded Code: Landing on a Software Engineering Desert Island.",
                    "Testing Web Applications Through Layout Constraints.",
                    "The MIDAS Cloud Platform for Testing SOA Applications.",
                    "U-Test: Evolving, Modelling and Testing Realistic Uncertain Behaviours of Cyber-Physical Systems.",
                    "WebSee: A Tool for Debugging HTML Presentation Failures."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2015w",
                "sub_name": "Eighth IEEE International Conference on Software Testing, Verification and Validation, ICST 2015 Workshops, Graz, Austria, April 13-17, 2015.",
                "count": 74,
                "papers": [
                    "A test automation language framework for behavioral models.",
                    "On model-based testing advanced GUIs.",
                    "Test generation from timed pushdown automata with inputs and outputs.",
                    "Model-based approach for automated test case generation from visual requirement specifications.",
                    "Covering both stack and states while testing push-down systems.",
                    "A model-based testing technique for component-based real-time embedded systems.",
                    "State machine flattening, a mapping study and tools assessment.",
                    "Towards generation of adaptive test cases from partial models of determinized timed automata.",
                    "Scaled Agile Framework: Presentation and real world example.",
                    "A guide to lean software development in action.",
                    "PMBOK vs. agile methods: How cultural change can become transparent.",
                    "Test automation for NFC ICs using Jenkins and NUnit.",
                    "Designing sustainable information systems for organizations operating in safety critical environments.",
                    "Security tests for mobile applications - Why using TLS/SSL is not enough.",
                    "A survey on mobile users' software quality perceptions and expectations.",
                    "Implementing tool support for analyzing stakeholder communications in software development.",
                    "Automated testing in the cloud: Test infrastructure management with SaaS.",
                    "From agile software development to the sharing economy and the collaborative commons: Social apps for enterprises.",
                    "Scaling a running agile fix-bid project with near shoring: Theory vs. reality and (best) practice.",
                    "nCanto: An agile software development case study.",
                    "Automated testing in the continuous delivery pipeline: A case study of an online company.",
                    "Testing big data (Assuring the quality of large databases).",
                    "Test driven development for device drivers and rapid hardware prototyping.",
                    "Design principles in test suite architecture.",
                    "Automated compatibility testing method for software logic by using symbolic execution.",
                    "Mining process models and architectural components from test cases.",
                    "A study on an approach for analysing test basis using I/O test data patterns.",
                    "Semantic analysis technique of logics retrieval for software testing from specification documents.",
                    "Embedded functions in combinatorial test designs.",
                    "Introducing combinatorial testing in the organization a report on a first attempt.",
                    "Combining minimization and generation for combinatorial testing.",
                    "A first systematic mapping study on combinatorial interaction testing for software product lines.",
                    "Evaluation of the IPO-Family algorithms for test case generation in web security testing.",
                    "A process for nonfunctional combinatorial testing: Selection of parameter values from a nondiscrete domain space.",
                    "Combinatorial interaction testing of tangled configuration options.",
                    "Relationship between pair-wise and MC/DC testing: Initial experimental results.",
                    "Why combinatorial testing works: Analyzing minimal failure-causing schemas in logic expressions.",
                    "Constraint handling in combinatorial test generation using forbidden tuples.",
                    "Using decision trees to aid algorithm selection in combinatorial interaction tests generation.",
                    "Flattening or not of the combinatorial interaction testing models?",
                    "Improving IPOG's vertical growth based on a graph coloring scheme.",
                    "Equivalence class verification and oracle-free testing using two-layer covering arrays.",
                    "BEN: A combinatorial testing-based fault localization tool.",
                    "Faster mutation-based fault localization with a novel mutation execution strategy.",
                    "Mutation testing of memory-related operators.",
                    "Towards mutation analysis of Android apps.",
                    "Kernel Density Adaptive Random Testing.",
                    "Rehabilitating equivalent mutants as static anomaly detectors in software artifacts.",
                    "Mutation testing in practice using Ruby.",
                    "Static analysis of mutant subsumption.",
                    "Towards systematic mutations for and with ATL model transformations.",
                    "Mutating aspect-oriented models to test cross-cutting concerns.",
                    "Definition and evaluation of mutation operators for GUI-level mutation analysis.",
                    "Dynamic phishing content using generative grammars.",
                    "Security testing for Android mHealth apps.",
                    "A novel simulation approach for fault injection resistance evaluation on smart cards.",
                    "Automated testing of IDS rules.",
                    "Tool support for secure programming by security testing.",
                    "Industry-academia collaboration in software testing: An overview of TAIC PART 2015.",
                    "Combining model-based and risk-based testing for effective test case generation.",
                    "Requirements document based test scenario generation for web application scenario testing.",
                    "Testing AUTOSAR software with QuickCheck.",
                    "Testing of a telecommunication protocol using constraint programming.",
                    "Test automation for multi-touch user interfaces of industrial applications.",
                    "Writing unit tests: It's now or never!",
                    "Mapping software testing practice with software testing research - SERP-test taxonomy.",
                    "A process to increase the model quality in the context of model-based testing.",
                    "Lessons learnt from using DSLs for automated software testing.",
                    "Graphical editing support for QuickCheck models.",
                    "Automotive system testing by independent guarded assertions.",
                    "Software quality research: From processes to model-based techniques.",
                    "Beyond code coverage - An approach for test suite assessment and improvement.",
                    "A learning-based method for detecting defective classes in object-oriented systems.",
                    "Supporting software product line testing by optimizing code configuration coverage."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "7th ICST 2014",
        "info": "Cleveland, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2014",
                "sub_name": "Seventh IEEE International Conference on Software Testing, Verification and Validation, ICST 2014, March 31 2014-April 4, 2014, Cleveland, Ohio, USA.",
                "count": 40,
                "papers": [
                    "Sampling Program Inputs with Mutation Analysis: Going Beyond Combinatorial Interaction Testing.",
                    "Designing Deletion Mutation Operators.",
                    "Establishing Theoretical Minimal Sets of Mutants.",
                    "Automatic and Incremental Product Optimization for Software Product Lines.",
                    "A Comparison of Test Case Prioritization Criteria for Software Product Lines.",
                    "Model-Based Test Design of Product Lines: Raising Test Design to the Product Line Level.",
                    "Detecting Concurrency Errors in Client-Side Java Script Web Applications.",
                    "On the Right Objectives of Data Flow Testing.",
                    "Data-Flow Testing in the Large.",
                    "Semi-automatic Incompatibility Localization for Re-engineered Industrial Software.",
                    "Automated Multi-platform Testing and Code Coverage Analysis of the CP2K Application.",
                    "Test Case Reuse in Enterprise Software Implementation - An Experience Report.",
                    "System Level Combinatorial Testing in Practice - The Concurrent Maintenance Case Study.",
                    "Impediments for Automated Testing - An Empirical Analysis of a User Support Discussion Board.",
                    "Automatic Testing of Natural User Interfaces.",
                    "A Data-Agnostic Approach to Automatic Testing of Multi-dimensional Databases.",
                    "Automated Bug Finding in Video Games: A Case Study for Runtime Monitoring.",
                    "Ask the Mutants: Mutating Faulty Programs for Fault Localization.",
                    "Reproducing Field Failures for Programs with Complex Grammar-Based Input.",
                    "Efficient Leveraging of Symbolic Execution to Advanced Coverage Criteria.",
                    "Automated Generation of Oracles for Testing User-Interaction Features of Mobile Apps.",
                    "Automated Test Generation from Vulnerability Signatures.",
                    "Experimental Evaluation of SDL and One-Op Mutation for C.",
                    "Lazart: A Symbolic Approach for Evaluation the Robustness of Secured Codes against Control Flow Injections.",
                    "An Evaluation of Model-Based Testing in Embedded Applications.",
                    "Sanitizing and Minimizing Databases for Software Application Test Outsourcing.",
                    "Cause Reduction for Quick Testing.",
                    "Model Dependent Test Coverage Variabilities.",
                    "Hybrid Directed Test Suite Augmentation: An Interleaving Framework.",
                    "An Assessment of the Quality of Automated Program Operator Repair.",
                    "Supporting Regression Test Scoping with Visual Analytics.",
                    "Adding Contextual Guidance to the Automated Search for Probabilistic Test Profiles.",
                    "Multi-objective Test Suite Optimization for Incremental Product Family Testing.",
                    "SimLatte: A Framework to Support Testing for Worst-Case Interrupt Latencies in Embedded Software.",
                    "T-Fuzz: Model-Based Fuzzing for Robustness Testing of Telecommunication Protocols.",
                    "Validation of Software Testing Experiments: A Meta-Analysis of ICST 2013.",
                    "Do System Test Cases Grow Old?",
                    "Model-Based Testing of Video Conferencing Systems: Challenges, Lessons Learnt, and Results.",
                    "An Empirical Analysis of Test Oracle Strategies for Model-Based Testing.",
                    "Compositional Specifications for ioco Testing."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2014w",
                "sub_name": "Seventh IEEE International Conference on Software Testing, Verification and Validation, ICST 2014 Workshops Proceedings, March 31 - April 4, 2014, Cleveland, Ohio, USA.",
                "count": 65,
                "papers": [
                    "Using Algebraic Petri Nets for Testing the Models of Ad Hoc Secure Routing Protocols in Mobility Scenarios.",
                    "Security Testing Based on Attack Patterns.",
                    "Coverage-Based Test Cases Selection for XACML Policies.",
                    "Automatic Model Inference of Web Applications for Security Testing.",
                    "DITEC (DoD-Centric and Independent Technology Evaluation Capability): A Process for Testing Security.",
                    "Designing Sequence Diagram Models for Robustness to Attacks.",
                    "Empirical Investigation of the Web Browser Attack Surface under Cross-Site Scripting: An Urgent Need for Systematic Security Regression Testing.",
                    "On Modeling and Testing Security Properties of Vehicular Networks.",
                    "Combinatorial Testing for an Automotive Hybrid Electric Vehicle Control System: A Case Study.",
                    "Eris: A Tool for Combinatorial Testing of the Linux System Call Interface.",
                    "An Empirical Comparison of Combinatorial and Random Testing.",
                    "Using Combinatorial Approaches for Testing Mobile Applications.",
                    "Combinatorial Interaction Testing of a Java Card Static Verifier.",
                    "Extracting the Combinatorial Test Parameters and Values from UML Sequence Diagrams.",
                    "Validation of Models and Tests for Constrained Combinatorial Interaction Testing.",
                    "Functional Dependence and Equivalence Class Factors in Combinatorial Test Designs.",
                    "Combinatorial Testing with Order Requirements.",
                    "Test Suite Reduction by Combinatorial-Based Coverage of Event Sequences.",
                    "Test Suite Prioritization by Switching Cost.",
                    "Refining a Randomized Post-optimization Method for Covering Arrays.",
                    "Introducing Combinatorial Testing in a Large Organization: Pilot Project Experience Report.",
                    "Estimating Fault Detection Effectiveness.",
                    "MUTATION 2014 Workshop Summary: Ninth International Workshop on Mutation Analysis.",
                    "Experimental Evaluation of Mutation Testing Approaches to Python Programs.",
                    "HOMAJ: A Tool for Higher Order Mutation Testing in AspectJ and Java.",
                    "Assessing the Influence of Multiple Test Case Selection on Mutation Experiments.",
                    "Mutant Subsumption Graphs.",
                    "Probability-Based Semantic Interpretation of Mutants.",
                    "Using Data Flow Patterns for Equivalent Mutant Detection.",
                    "Towards a Taxonomy for Simulink Model Mutations.",
                    "Generating Test Data to Distinguish Conjunctive Queries with Equalities.",
                    "On Studying the Effectiveness of Extended Finite State Machine Based Test Selection Criteria.",
                    "Summary Based Static Analysis for Practical Search for Defects in C Programs and Libraries.",
                    "Enhancing Utility and Privacy of Data for Software Testing.",
                    "A Fault Model Framework for Quality Assurance.",
                    "Techniques for Automatic Detection of Metamorphic Relations.",
                    "Automating Test Oracles for Systems with Complex Outputs.",
                    "Static Analysis Usage for Customizable Semantic Checks of C and C++ Programming Languages Constraints.",
                    "Exhaustive Exploration of Ajax Web Applications with Selective Jumping.",
                    "MC/DC-Like Structural Coverage Criteria for Function Block Diagrams.",
                    "SOA Testing via Random Paths in BPEL Models.",
                    "Comparing Model-Based Testing with Traditional Testing Strategies: An Empirical Study.",
                    "Applying Pattern-Based Graphical Validation Rules to Business Process Models.",
                    "Model-Based Exploratory Testing: A Controlled Experiment.",
                    "Lossless Reduction of Execution Profiles Using a Genetic Algorithm.",
                    "Weighted Execution Profiles for Software Testing.",
                    "A Search-Based Approach for Cost-Effective Software Test Automation Decision Support and an Industrial Case Study.",
                    "Regression Testing for Web Applications Using Reusable Constraint Values.",
                    "Empirical Studies of Privacy-Preserving Regression Test Selection Techniques for Web Services.",
                    "State Profiling of Internal Variables.",
                    "TAIC PART 2014 Workshop Overview.",
                    "Towards a Test Automation Improvement Model (TAIM).",
                    "Murphy Tools: Utilizing Extracted GUI Models for Industrial Software Testing.",
                    "On an Embedded Software Design Architecture for Improving the Testability of In-vehicle Multimedia Software.",
                    "Viewpoint-Based Test Requirement Analaysis Modeling.",
                    "Practical Challenges in Test Environment Management.",
                    "Trial of Organizing Software Test Strategy via Software Test Perspectives.",
                    "Performance Testing Web Applications on the Cloud.",
                    "Automated WAIT for Cloud-Based Application Testing.",
                    "A DSL for Deployment and Testing in the Cloud.",
                    "Dfuzzer: A D-Bus Service Fuzzing Tool.",
                    "Automated and Isolated Tests for Complex Middleware Products: The Case of BPEL Engines.",
                    "MutaLog: A Tool for Mutating Logic Formulas.",
                    "ArbitCheck: A Highly Automated Property-Based Testing Tool for Java.",
                    "WebMate: Web Application Test Generation in the Real World."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "6th ICST 2013",
        "info": "Luxembourg",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2013",
                "sub_name": "Sixth IEEE International Conference on Software Testing, Verification and Validation, ICST 2013, Luxembourg, Luxembourg, March 18-22, 2013.",
                "count": 71,
                "papers": [
                    "Symbolic Path-Oriented Test Data Generation for Floating-Point Programs.",
                    "Generating Effective Integration Test Cases from Unit Ones.",
                    "Improving Test Generation under Rich Contracts by Tight Bounds and Incremental SAT Solving.",
                    "Search-Based Testing of Relational Schema Integrity Constraints Across Multiple Database Management Systems.",
                    "Real-Data Validation of Simulation Models in a Function-Based Modular Framework.",
                    "Test Quality Measurement Using TBPP-R.",
                    "Transitioning Manual System Test Suites to Automated Testing: An Industrial Case Study.",
                    "A Case Study of Automating User Experience-Oriented Performance Testing on Smartphones.",
                    "Defect Prioritization in the Software Industry: Challenges and Opportunities.",
                    "Efficient JavaScript Mutation Testing.",
                    "Empirical Evaluation of the Statement Deletion Mutation Operator.",
                    "Classification, Structuring, and Assessment of Evidence for Safety - A Systematic Literature Review.",
                    "A Functional Testing Approach for Hybrid Safety Properties with Incomplete Information.",
                    "Reconstructing Core Dumps.",
                    "MFL: Method-Level Fault Localization with Causal Inference.",
                    "GrowthTracker: Diagnosing Unbounded Heap Growth in C++ Software.",
                    "Generating Unit Tests for Concurrent Classes.",
                    "Systematic Testing for Detecting Concurrency Errors in Erlang Programs.",
                    "CHECK-THEN-ACT Misuse of Java Concurrent Collections.",
                    "Testing Database-Centric Applications for Causes of Database Deadlocks.",
                    "Scaling Model Checking for Test Generation Using Dynamic Inference.",
                    "Model-Based Testing of Cryptographic Components - Lessons Learned from Experience.",
                    "Transformation Rules for Platform Independent Testing: An Empirical Study.",
                    "Assessing Quality and Effort of Applying Aspect State Machines for Robustness Testing: A Controlled Experiment.",
                    "Behaviour Abstraction Coverage as Black-Box Adequacy Criteria.",
                    "The Impact of Concurrent Coverage Metrics on Testing Effectiveness.",
                    "An Efficient Algorithm for Constraint Handling in Combinatorial Test Generation.",
                    "Multi-objective Cross-Project Defect Prediction.",
                    "Analysis and Prediction of Mandelbugs in an Industrial Software System.",
                    "Estimating Fault Numbers Remaining After Testing.",
                    "R2Fix: Automatically Generating Bug Fixes from Bug Reports.",
                    "Oracle-based Regression Test Selection.",
                    "Coverage-Based Test Case Prioritisation: An Industrial Case Study.",
                    "Test Case Prioritization Using Requirements-Based Clustering.",
                    "Automated Detection of Test Fixture Strategies and Smells.",
                    "Crowdsourcing GUI Tests.",
                    "CrowdOracles: Can the Crowd Solve the Oracle Problem?",
                    "Evolving Readable String Test Inputs Using a Natural Language Model to Reduce Human Oracle Cost.",
                    "EvoSuite: On the Challenges of Test Case Generation in the Real World.",
                    "ACTS: A Combinatorial Test Generation Tool.",
                    "Combinatorial Interaction Testing with CITLAB.",
                    "A Testing Tool for Web Applications Using a Domain-Specific Modelling Language and the NuSMV Model Checker.",
                    "Smartesting CertifyIt: Model-Based Testing for Enterprise IT.",
                    "CDM-Suite: An Attributed Test Selection Tool.",
                    "JavaPDG: A New Platform for Program Dependence Analysis.",
                    "AVA: Supporting Debugging with Failure Interpretations.",
                    "OCCF: A Framework for Developing Test Coverage Measurement Tools Supporting Multiple Programming Languages.",
                    "Test Generation and Evaluation from High-Level Properties for Common Criteria Evaluations - The TASCCC Testing Tool.",
                    "JAutomate: A Tool for System- and Acceptance-test Automation.",
                    "LBTest: A Learning-Based Testing Tool for Reactive Systems.",
                    "Business Process Compliance via Security Validation as a Service.",
                    "AURORA: AUtomatic RObustness coveRage Analysis Tool.",
                    "VERA: A Flexible Model-Based Vulnerability Testing Tool.",
                    "A Method of Making Single Function Tests for Constituting Scenario Tests.",
                    "Formal Modeling and Verification of SDN-OpenFlow.",
                    "Proposal of Testing Diagrams for Visualizing Test Cases.",
                    "Towards Better Testing of fUML Models.",
                    "Repairing Selenium Test Cases: An Industrial Case Study about Web Page Element Localization.",
                    "Test Generation for Robotized Paint Systems Using Constraint Programming in a Continuous Integration Environment.",
                    "RAILROADMAP: An Agile Security Testing Framework for Web-application Development.",
                    "A Controlled Experiment to Evaluate Effectiveness and Efficiency of Three Software Testing Methods.",
                    "A Toolchain for Designing and Testing XACML Policies.",
                    "The SPaCIoS Project: Secure Provision and Consumption in the Internet of Services.",
                    "GUIdiff - A Regression Testing Tool for Graphical User Interfaces.",
                    "Security Testing with Fault-Models and Properties.",
                    "Test Generation for RTES from SysML Models: Context, Motivations and Research Proposal.",
                    "Research Questions for Model-Based Vulnerability Testing of Web Applications.",
                    "Leveraging Light-Weight Analyses to Aid Software Maintenance.",
                    "Challenges of Testing for Critical Interactive Systems.",
                    "Understanding the Influence of Social and Technical Factors Testers in Software Organizations.",
                    "Identification of Anomalies in Processes of Database Alteration."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2013w",
                "sub_name": "Sixth IEEE International Conference on Software Testing, Verification and Validation, ICST 2013 Workshops Proceedings, Luxembourg, Luxembourg, March 18-22, 2013.",
                "count": 76,
                "papers": [
                    "Message from ESSS 2013 Workshop Co-chairs.",
                    "Algorithms for Basic Compliance Problems.",
                    "Software-Based Remote Attestation for Safety-Critical Systems.",
                    "Towards Formal Description of Standards for Automotive Operating Systems.",
                    "A Denotational Model for Interrupt-Driven Programs.",
                    "Generating C# Programs from CSP# Models.",
                    "Welcome from the Chairs.",
                    "XACMUT: XACML 2.0 Mutants Generator.",
                    "Testing Delegation Policy Enforcement via Mutation Analysis.",
                    "Mutation Operators for the Atlas Transformation Language.",
                    "Using Mutation Analysis to Evolve Subdomains for Random Testing.",
                    "Efficient Mutation Analysis of Relational Database Structure Using Mutant Schemata and Parallelisation.",
                    "TAIC PART 2013 Workshop Summary.",
                    "Towards Tool-Support for Test Case Selection in Manual Regression Testing.",
                    "Conditional-Based Refactorings and Fault-Proneness: An Empirical Study.",
                    "A Call Graph Mining and Matching Based Defect Localization Technique.",
                    "Reachability Verification of Rhapsody Statecharts.",
                    "Organization of Testing Activities in Norwegian Software Companies.",
                    "Improving Test Suites Maintainability with the Page Object Pattern: An Industrial Case Study.",
                    "A Process for Assessing Data Quality.",
                    "Specifying Life Cycle Requirements in a Natural-like Language and ptLTL.",
                    "Reusing Automated Regression Tests for Multiple Variants of a Software Product Line.",
                    "What Can We Learn from In-process Metrics on Issue Management? - Insights from an Industrial Case Study.",
                    "Considering Context Events in Event-Based Testing of Mobile Applications.",
                    "AutoQUEST - Automated Quality Engineering of Event-Driven Software.",
                    "Pattern Based GUI Testing Modeling Environment.",
                    "Automated Significant Load Testing for WS-BPEL Compositions.",
                    "Fifty Shades of Grey in SOA Testing.",
                    "Model-Based Test Suite Generation for Function Block Diagrams Using the UPPAAL Model Checker.",
                    "A 5-Step Hunt for Faults in Java Implementations of Algebraic Specifications.",
                    "Combining Model-Based Testing and Runtime Monitoring for Program Testing in the Presence of Nondeterminism.",
                    "Assessing Software Product Line Testing Via Model-Based Mutation: An Application to Similarity Testing.",
                    "A Method and Tool for Test Optimization for Automotive Controllers.",
                    "Constraints in Software Testing, Verification and Analysis CSTVA'2013.",
                    "Random Grammar-Based Testing for Covering All Non-terminals.",
                    "A Stack Model for Symbolic Buffer Overflow Exploitability Analysis.",
                    "A Constraint Solver for PHP Arrays.",
                    "Strategies Comparison of Test Generation from UML Using SMT Solver.",
                    "A Late Treatment of C Precondition in Dynamic Symbolic Execution.",
                    "SOA Grey Box Testing - A Constraint-Based Approach.",
                    "Rank: A Tool to Check Program Termination and Computational Complexity.",
                    "Empirically Identifying the Best Greedy Algorithm for Covering Array Generation.",
                    "Evaluation of t-wise Approach for Testing Logical Expressions in Software.",
                    "On Use of Coverage Metrics in Assessing Effectiveness of Combinatorial Test Designs.",
                    "Cascade: A Test Generation Tool for Combinatorial Testing.",
                    "Identifying Failure-Inducing Combinations Using Tuple Relationship.",
                    "Better Bounds for Event Sequencing Testing.",
                    "A Study in Prioritization for Higher Strength Combinatorial Testing.",
                    "Combinatorial Test Architecture Design Using Viewpoint Diagram.",
                    "Experimenting with Category Partition's 1-Way and 2-Way Test Selection Criteria.",
                    "Using Projections to Debug Large Combinatorial Models.",
                    "Combinatorial Interaction Testing with Multi-perspective Feature Models.",
                    "Deriving Combinatorial Test Design Model from UML Activity Diagram.",
                    "Combinatorial Testing for Feature Models Using CitLab.",
                    "Applications of Combinatorial Testing Methods for Breakthrough Results in Software Testing.",
                    "Combinatorial Coverage Measurement Concepts and Applications.",
                    "Applying Combinatorial Testing to the Siemens Suite.",
                    "An Input Space Modeling Methodology for Combinatorial Testing.",
                    "On Adequacy of Assertions in Automated Test Suites: An Empirical Investigation.",
                    "Coverage Specification for Test Case Intent Preservation in Regression Suites.",
                    "Search-Based Propagation of Regression Faults in Automated Regression Testing.",
                    "Does Principal Component Analysis Improve Cluster-Based Analysis?",
                    "Sixth International Workshop on Search-Based Software Testing (SBST 2013): Workshop Summary.",
                    "EvoSuite at the SBST 2013 Tool Competition.",
                    "Measuring T2 against SBST 2013 Benchmark Suite.",
                    "Unit Testing Tool Competition.",
                    "En Garde: Winning Coding Duels through Genetic Programming.",
                    "Search Based Testing of Embedded Systems Implemented in IEC 61131-3: An Industrial Case Study.",
                    "The Forth International Workshop on Security Testing (SECTEST 2013).",
                    "Kepler - Raising Browser Security Awareness.",
                    "Automatic Generation of Test Drivers for Model Inference of Web Applications.",
                    "Model-Based Vulnerability Testing for Web Applications.",
                    "Generic Approach for Security Error Detection Based on Learned System Behavior Models for Automated Security Tests.",
                    "Formal Models of Bank Cards for Free.",
                    "Online Model-Based Behavioral Fuzzing.",
                    "A Query Driven Security Testing Framework for Enterprise Network."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "5th ICST 2012",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2012",
                "sub_name": "Fifth IEEE International Conference on Software Testing, Verification and Validation, ICST 2012, Montreal, QC, Canada, April 17-21, 2012.",
                "count": 127,
                "papers": [
                    "Dynamic Backward Slicing of Model Transformations.",
                    "X10X: Model Checking a New Programming Language with an \"Old\" Model Checker.",
                    "Finding the Optimal Balance between Over and Under Approximation of Models Inferred from Execution Logs.",
                    "AutoFLox: An Automatic Fault Localizer for Client-Side JavaScript.",
                    "Tester Feedback Driven Fault Localization.",
                    "A Unified Approach for Localizing Non-deadlock Concurrency Bugs.",
                    "Empirical Studies on Test Effectiveness for Database Applications.",
                    "Test Adequacy Evaluation for the User-database Interaction: A Specification-Based Approach.",
                    "AutoBlackTest: Automatic Black-Box Testing of Interactive Applications.",
                    "Lightweight Data-Flow Analysis for Execution-Driven Constraint Solving.",
                    "Bounded Program Verification Using an SMT Solver: A Case Study.",
                    "Symbolic Execution with Interval Solving and Meta-heuristic Search.",
                    "The Seed is Strong: Seeding Strategies in Search-Based Software Testing.",
                    "Searching the Boundaries of a Modeling Space to Test Metamodels.",
                    "Search-Based Test Input Generation for String Data Types Using the Results of Web Queries.",
                    "Crawlability Metrics for Web Applications.",
                    "Leveraging User-Privilege Classification to Customize Usage-based Statistical Models of Web Applications.",
                    "CrossCheck: Combining Crawling and Differencing to Better Detect Cross-browser Incompatibilities in Web Applications.",
                    "An Empirical Study of Pre-release Software Faults in an Industrial Product Line.",
                    "Software Behavior and Failure Clustering: An Empirical Study of Fault Causality.",
                    "Random Testing: Evaluation of a Law Describing the Number of Faults Found.",
                    "Dynamic Shape Analysis Using Spectral Graph Properties.",
                    "An Effective Regression Testing Approach for PHP Web Applications.",
                    "Supporting Test Suite Evolution through Test Case Adaptation.",
                    "Testing Conformance of Life Cycle Dependent Properties of Mobile Applications.",
                    "Formal Model-Based Test for AUTOSAR Multicore RTOS.",
                    "@tComment: Testing Javadoc Comments to Detect Comment-Code Inconsistencies.",
                    "Generating String Test Data for Code Coverage.",
                    "Better Algorithms to Minimize the Cost of Test Paths.",
                    "Semantic Mutation Analysis of Floating-Point Comparison.",
                    "Behaviourally Adequate Software Testing.",
                    "Generating Checking Sequences for Nondeterministic Finite State Machines.",
                    "Evaluating Machine-Independent Metrics for State-Space Exploration.",
                    "Comparing the Effectiveness of Equivalence Partitioning, Branch Testing and Code Reading by Stepwise Abstraction Applied by Subjects.",
                    "A Scalable Distributed Concolic Testing Approach: An Empirical Evaluation.",
                    "Automated System Testing Using Visual GUI Testing Tools: A Comparative Study in Industry.",
                    "CARIAL: Cost-Aware Software Reliability Improvement with Active Learning.",
                    "Identifying Failure-Inducing Combinations in a Combinatorial Test Set.",
                    "Weighted System Dependence Graph.",
                    "Industrial Application of Concolic Testing on Embedded Software: Case Studies.",
                    "Automated Unit Testing of a SCADA Control Software: An Industrial Case Study Based on Action Research.",
                    "A Large Scale Empirical Study on User-Centric Performance Analysis.",
                    "Analyzing a Controller of a Power Distribution Unit Using Formal Methods.",
                    "Securing Opensource Code via Static Analysis.",
                    "Towards Automated Anomaly Report Assignment in Large Complex Systems Using Stacked Generalization.",
                    "An Integrated Model-Driven Approach for Mechatronic Systems Testing.",
                    "CAST: Automating Software Tests for Embedded Systems.",
                    "When a GUI Regression Test Failed, What Should be Blamed?",
                    "A Smart Structured Test Automation Language (SSTAL).",
                    "Industrial Applicability of Visual GUI Testing for System and Acceptance Test Automation.",
                    "Mitigating the Effect of Coincidental Correctness in Spectrum Based Fault Localization.",
                    "Prioritization of Test Cases Using Software Agents and Fuzzy Logic.",
                    "Towards Practical Debugging for Regression Faults.",
                    "Using Control Charts for Detecting and Understanding Performance Regressions in Large Software.",
                    "Web Mutation Testing.",
                    "A Runtime Monitoring Framework for Event Streams with Non-primitive Arguments.",
                    "Grammar-Based Testing Using Realistic Domains in PHP.",
                    "From AUTOSAR Models to Co-simulation for MiL-Testing in the Automotive Domain.",
                    "An Extended LLRP Model for RFID System Test and Diagnosis.",
                    "Test Sequence Generation from Classification Trees.",
                    "Experimental Comparison of Test Case Generation Methods for Finite State Machines.",
                    "CITLAB: A Laboratory for Combinatorial Interaction Testing.",
                    "Combinatorial Test Design in the TOSCA Testsuite: Lessons Learned and Practical Implications.",
                    "Simplified Modeling of Combinatorial Test Spaces.",
                    "Effectiveness of Pair-Wise Testing for Software with Boolean Inputs.",
                    "Combinatorial Testing on ID3v2 Tags of MP3 Files.",
                    "Combinatorial Testing of ACTS: A Case Study.",
                    "Combinatorial Methods for Event Sequence Testing.",
                    "Combinatorial Interaction Testing for Test Selection in Grammar-Based Testing.",
                    "Isolating Failure-Inducing Combinations in Combinatorial Testing Using Test Augmentation and Classification.",
                    "Common Patterns in Combinatorial Models.",
                    "A System Analysis Study Comparing Reverse Engineered Combinatorial Testing to Expert Judgment.",
                    "Automated Performance Model Construction through Event Log Analysis.",
                    "Peer-to-Peer Load Testing.",
                    "Overcoming Web Server Benchmarking Challenges in the Multi-core Era.",
                    "SMT-C: A Semantic Mutation Testing Tools for C.",
                    "Mutant Execution Cost Reduction: Through MUSIC (Mutant Schema Improved with Extra Code).",
                    "Testing Obligation Policy Enforcement Using Mutation Analysis.",
                    "Toward Harnessing High-Level Language Virtual Machines for Further Speeding Up Weak Mutation Testing.",
                    "Using Mutants to Locate \"Unknown\" Faults.",
                    "Isolating First Order Equivalent Mutants via Second Order Mutation.",
                    "MESSI: Mutant Evaluation by Static Semantic Interpretation.",
                    "Do Redundant Mutants Affect the Effectiveness and Efficiency of Mutation Analysis?",
                    "Test Case Prioritization Due to Database Changes in Web Applications.",
                    "Dependency-Based Test Case Selection and Prioritization in Embedded Systems.",
                    "Analysis of Test Clusters for Regression Testing.",
                    "Enhancing Fault Localization via Multivariate Visualization.",
                    "Software Product Line Testing - A 3D Regression Testing Problem.",
                    "GUICOP: Specification-Based GUI Testing.",
                    "Towards Symbolic Model-Based Mutation Testing: Pitfalls in Expressing Semantics as Constraints.",
                    "Numerical Constraints for Combinatorial Interaction Testing.",
                    "Testing Deadline Misses for Real-Time Systems Using Constraint Optimization Techniques.",
                    "Open Research Challenges of Localizing Faults in Programs Using Constraints.",
                    "Statechart Analysis with Symbolic PathFinder.",
                    "Minimum Pairwise Coverage Using Constraint Programming Techniques.",
                    "Combining Constraint Programming and Abstract Interpretation for Value Analysis of Floating-point Programs.",
                    "Semi-automatic Search-Based Test Generation.",
                    "A Parallel Genetic Algorithm Based on Hadoop MapReduce for the Automatic Generation of JUnit Test Suites.",
                    "Search-Based Stress Testing of Wireless Network Protocol Stacks.",
                    "A Genetic Algorithm for Computing Class Integration Test Orders for Aspect-Oriented Systems.",
                    "Model-Based Fuzz Testing.",
                    "XSS Vulnerability Detection Using Model Inference Assisted Evolutionary Fuzzing.",
                    "A Taint Based Approach for Smart Fuzzing.",
                    "A Testing Model for Dynamic Malware Analysis Systems.",
                    "Managing Evolution by Orchestrating Requirements and Testing Engineering Processes.",
                    "Automatic XACML Requests Generation for Policy Testing.",
                    "Solving Some Modeling Challenges when Testing Rich Internet Applications for Security.",
                    "SPaCiTE - Web Application Testing Engine.",
                    "Events-Based Security Monitoring Using MMT Tool.",
                    "The SmartLogic Tool: Analysing and Testing Smart Card Protocols.",
                    "It Takes Two to Tango - An Experience Report on Industry - Academia Collaboration.",
                    "Adding Criteria-Based Tests to Test Driven Development.",
                    "Technical Debt in Test Automation.",
                    "Symbolic System Time in Distributed Systems Testing.",
                    "Robustness Testing of Mobile Telecommunication Systems: A Case Study on Industrial Practice and Challenges.",
                    "Testing of Evolving Protocols.",
                    "A Framework to Support Research in and Encourage Industrial Adoption of Regression Testing Techniques.",
                    "GEMS: A Generic Model Based Source Code Instrumentation Framework.",
                    "Combining Static Analysis and Constraint Solving for Automatic Test Case Generation.",
                    "A Tridimensional Approach for Studying the Formal Verification of Model Transformations.",
                    "Challenges for Addressing Quality Factors in Model Transformation.",
                    "Towards a Methodology for Verifying Partial Model Refinements.",
                    "Towards a Rule-Level Verification Framework for Property-Preserving Graph Transformations.",
                    "Verified Operational Patterns with Graph Transformation.",
                    "Incremental Test Case Generation for UML-RT Models Using Symbolic Execution.",
                    "Towards a Method for Reducing the Test Suites of Database Applications.",
                    "Property-Driven Software Engineering Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2011w",
                "sub_name": "Fourth IEEE International Conference on Software Testing, Verification and Validation, ICST 2012, Berlin, Germany, 21-25 March, 2011, Workshop Proceedings.",
                "count": 96,
                "papers": [
                    "Test Selection for Data-Flow Reactive Systems Based on Observations.",
                    "Abstracting Time and Data for Conformance Testing of Real-Time Systems.",
                    "Model Based Statistical Testing of Embedded Systems.",
                    "Risk-Based Testing of Safety-Critical Embedded Systems Driven by Fault Tree Analysis.",
                    "Simulated Restriction of Coverage Criteria on UML State Machines.",
                    "An Experience Report on an Industrial Case-Study about Timed Model-Based Testing with UPPAAL-TRON.",
                    "Reconfigurable Model-Based Test Program Generator for Microprocessors.",
                    "Model-Based Testing for the Second Generation of Integrated Modular Avionics.",
                    "Using a DSL and Fine-Grained Model Transformations to Explore the Boundaries of Model Verification - Extended Abstract.",
                    "TripleT: Improving Test Responsiveness for High Performance Embedded Systems.",
                    "Inverse Model Based Testing - Generating Behavior Models from Abstract Test Cases.",
                    "Scenario Based Test Generation Using Test Designer.",
                    "Scenario-Based Testing Applied in Two Real Contexts: Healthcare and Employability.",
                    "Empirically Evaluating Regression Testing Techniques: Challenges, Solutions, and a Potential Way Forward.",
                    "Challenges in Audit Testing of Web Services.",
                    "Customer-Oriented Regression Testing: An Initial Discussion.",
                    "Making the Case for MORTO: Multi Objective Regression Test Optimization.",
                    "Regression Test Selection Techniques for Test-Driven Development.",
                    "Selective Test Generation Method for Evolving Critical Systems.",
                    "Dynamic Prioritization in Regression Testing.",
                    "Employing Privacy-Preserving Techniques to Protect Control-Flow Graphs in a Decentralized, End-to-End Regression Test Selection Framework for Web Services.",
                    "Agent-Based Test Case Prioritization.",
                    "Search-Based Software Testing: Past, Present and Future.",
                    "MOST: A Multi-objective Search-Based Testing from EFSM.",
                    "Porantim-Opt: Optimizing the Combined Selection of Model-Based Testing Techniques.",
                    "A Principled Evaluation of the Effect of Directed Mutation on Search-Based Statistical Testing.",
                    "Towards Search-Based Testing for Event-B Models.",
                    "Search-Based Application Security Testing: Towards a Structured Search Space.",
                    "Identifying Infeasible GUI Test Cases Using Support Vector Machines and Induced Grammars.",
                    "Event-Based GUI Testing and Reliability Assessment Techniques - An Experimental Insight and Preliminary Results.",
                    "Behind the Scenes: An Approach to Incorporate Context in GUI Test Case Generation.",
                    "Improved Bug Reporting and Reproduction through Non-intrusive GUI Usage Monitoring and Automated Replaying.",
                    "Model-Based Testing with a General Purpose Keyword-Driven Test Automation Framework.",
                    "A GUI Crawling-Based Technique for Android Mobile Application Testing.",
                    "Decision Support for Test Management and Scope Selection in a Software Product Line Context.",
                    "A Survey of Empirics of Strategies for Software Product Line Testing.",
                    "Proof Composition for Deductive Verification of Software Product Lines.",
                    "Calculating Prioritized Interaction Test Sets with Constraints Using Binary Decision Diagrams.",
                    "Automated Detection of Discontinuities in Models Inferred from Execution Traces.",
                    "Validating Service Value Propositions Regarding Stakeholder Preferences.",
                    "Grey-Box Testing and Verification of Java/JML.",
                    "Utilizing Model Checking for Automatic Test Case Generation from Conjunctions of Predicates.",
                    "Optimizing Constraint Solving to Better Support Symbolic Execution.",
                    "Online Test Generation with PathCrawler: Tool Demo.",
                    "IPEG: Utilizing Infeasibility.",
                    "CPTEST: A Framework for the Automatic Fault Detection, Localization and Correction of Constraint Programs.",
                    "Dealing with Constraints in Boolean Expression Testing.",
                    "When Does My Program Fail?",
                    "An Analysis of OO Mutation Operators.",
                    "Object-Oriented Mutation Applied in Common Intermediate Language Programs Originated from C#.",
                    "Paraµ - A Partial and Higher-Order Mutation Tool with Concurrency Operators.",
                    "Change Sensitivity Based Prioritization for Audit Testing of Webservice Compositions.",
                    "An Evaluation of Mutation and Data-Flow Testing: A Meta-analysis.",
                    "Calibrated Mutation Testing.",
                    "Breeding High-Impact Mutations.",
                    "Test Case Generation from Mutants Using Model Checking Techniques.",
                    "Analogies and Differences between Mutation Operators for WS-BPEL 2.0 and Other Languages.",
                    "Model Driven Mutation Applied to Adaptative Systems Testing.",
                    "Refactoring as Testability Transformation.",
                    "Munch: An Efficient Modularisation Strategy to Assess the Degree of Refactoring on Sequential Source Code Checkings.",
                    "Parameter-Based Refactoring and the Relationship with Fan-in/Fan-out Coupling.",
                    "Automated Refactoring for Testability.",
                    "Test-Oriented Languages: Is it Time for a New Era?",
                    "An Experience Report on Using Code Smells Detection Tools.",
                    "Prioritising Refactoring Using Code Bad Smells.",
                    "Looking for Patterns in Code Bad Smells Relations.",
                    "Enabling Testing, Design and Refactoring Practices in Remote Locations.",
                    "Extracting Properties from Test Cases by Refactoring.",
                    "On Investigating Code Smells Correlations.",
                    "Alignment of Requirements Specification and Testing: A Systematic Mapping Study.",
                    "Automatic Validation and Correction of Formalized, Textual Requirements.",
                    "Model Based Test Specifications: Developing of Test Specifications in a Semi Automatic Model Based Way.",
                    "Requirements-Driven Testing with Behavior Trees.",
                    "Protocol Security Testing with SPIN and TTCN-3.",
                    "Defining and Matching Test-Based Certificates in Open SOA.",
                    "Scanstud: A Methodology for Systematic, Fine-Grained Evaluation of Static Analysis Tools.",
                    "Offset-Aware Mutation Based Fuzzing for Buffer Overflow Vulnerabilities: Few Preliminary Results.",
                    "Security Vulnerabilities Detection Using Model Inference for Applications and Security Protocols.",
                    "Practical Considerations in Control-Flow Integrity Monitoring.",
                    "Applying Security Assurance Techniques to a Mobile Phone Application: An Initial Approach.",
                    "How Test Organizations Adopt New Testing Practices and Methods?",
                    "Introducing Test Case Derivation Techniques into Traditional Software Development: Obstacles and Potentialities.",
                    "Assessing the Impact of Using Fault Prediction in Industry.",
                    "An Empirical Study on Object-Oriented Metrics and Software Evolution in Order to Reduce Testing Costs by Predicting Change-Prone Classes.",
                    "Combining Model-Based and Capture-Replay Testing Techniques of Graphical User Interfaces: An Industrial Approach.",
                    "Verifying Code and Its Optimizations: An Experience Report.",
                    "Monitoring and Testing with Case Observer Automata: An Industry Report.",
                    "Estimation of Clock Drift in HiL Testing by Property-Based Conformance Check.",
                    "Automated Debugging: Are We There Yet?",
                    "An Abstract Operational Framework for Dependence Models in Software Debugging.",
                    "Identifying Failure-Correlated Dependence Chains.",
                    "Probabilistic Error Propagation Modeling in Logic Circuits.",
                    "On the Use of Constraints in Dynamic Slicing for Program Debugging.",
                    "Modeling the Diagnostic Efficiency of Regression Test Suites.",
                    "Compression Strategies for Passive Testing.",
                    "A Diagnostic Point of View for the Optimization of Preparation Costs in Runtime Testing."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "4th ICST 2011",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2011",
                "sub_name": "Fourth IEEE International Conference on Software Testing, Verification and Validation, ICST 2011, Berlin, Germany, March 21-25, 2011.",
                "count": 51,
                "papers": [
                    "Using semi-supervised clustering to improve regression test selection techniques.",
                    "Applying aggressive propagation-based strategies for testing changes.",
                    "Regression testing in the presence of non-code changes.",
                    "Towards a Language and Framework for Penurious Testing.",
                    "Test Coverage of Data-Centric Dynamic Compositions in Service-Based Systems.",
                    "Systematic Testing of Database Engines Using a Relational Constraint Solver.",
                    "Seed: An Easy-to-Use Random Generator of Recursive Data Structures for Testing.",
                    "Analysis of Mistakes as a Method to Improve Test Case Design.",
                    "Exploiting Common Object Usage in Test Case Generation.",
                    "Assessing Oracle Quality with Checked Coverage.",
                    "Using Property-Based Oracles when Testing Embedded System Applications.",
                    "An Empirical Evaluation of Assertions as Oracles.",
                    "Efficient Mutation Killers in Action.",
                    "Test Generation for X-machines with Non-terminal States and Priorities of Operations.",
                    "Optimal Test Input Sequence Generation for Finite State Models and Pushdown Systems.",
                    "It is Not the Length That Matters, It is How You Control It.",
                    "An Approach for Search Based Testing of Null Pointer Exceptions.",
                    "An Evolutionary Algorithm for the Generation of Timed Test Traces for Embedded Real-Time Systems.",
                    "Runtime Verification of Linux Kernel Modules Based on Call Interception.",
                    "Constraint-Based Program Debugging Using Data Structure Repair.",
                    "Execution Hijacking: Improving Dynamic Analysis by Flying off Course.",
                    "Tailored Shielding and Bypass Testing of Web Applications.",
                    "Using SQL Hotspots in a Prioritization Heuristic for Detecting All Types of Web Application Vulnerabilities.",
                    "A Study of Usage-Based Navigation Models and Generated Abstract Test Cases for Web Applications.",
                    "Mutation-Based Test Generation from Security Protocols in HLPSL.",
                    "Mutation Testing of \"Go-Back\" Functions Based on Pushdown Automata.",
                    "Inferential Checking for Mutants Modifying Database States.",
                    "Implementing and Evaluating a Runtime Conformance Checker for Mobile Agent Systems.",
                    "Conformance Testing from Message Sequence Charts.",
                    "Security Model Evolution of PHP Web Applications.",
                    "EFindBugs: Effective Error Ranking for FindBugs.",
                    "Multicore SDK: A Practical and Efficient Deadlock Detector for Real-World Applications.",
                    "A Framework for the Automatic Correction of Constraint Programs.",
                    "Empirical Investigation of the Effects of Test Suite Properties on Similarity-Based Test Case Selection.",
                    "Factors Limiting Industrial Adoption of Test Driven Development: A Systematic Review.",
                    "An Empirical Study on the Relation between Dependency Neighborhoods and Failures.",
                    "CRANE: Failure Prediction, Change Analysis and Test Prioritization in Practice - Experiences from Windows.",
                    "Improving Regression Testing Transparency and Efficiency with History-Based Prioritization - An Industrial Case Study.",
                    "Experiences of System-Level Model-Based GUI Testing of an Android Application.",
                    "Model Checking a TTCAN Implementation.",
                    "A Systematic Test Case Generation Approach for Testing Message Length Variability.",
                    "Why are Bug Reports Invalid?",
                    "Risk-Based Security Testing in Cloud Computing Environments.",
                    "Towards Software Quality and User Satisfaction through User Interfaces.",
                    "Testing Resource Usage in Home Automation Systems.",
                    "On the Improvement of the Mutation Score Using Distinguishing Test Cases.",
                    "Finding Software Vulnerabilities by Smart Fuzzing.",
                    "Providing a Software Quality Framework for Testing of Mobile Applications.",
                    "SoftwareHardware Hybrid Systems Verification.",
                    "Cost Optimizations in Runtime Testing and Diagnosis of Systems of Systems.",
                    "A Framework to Test Advanced Web Services Transactions."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "3rd ICST 2010",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2010",
                "sub_name": "Third International Conference on Software Testing, Verification and Validation, ICST 2010, Paris, France, April 7-9, 2010.",
                "count": 59,
                "papers": [
                    "Using Formal Methods and Testability Concepts in the Avionics Systems Validation and Verification (V&V) Process.",
                    "Google's Innovation Factory: Testing, Culture, and Infrastructure.",
                    "Towards Automated, Formal Verification of Model Transformations.",
                    "Debug Support for Model-Based GUI Testing.",
                    "Automated Test Data Generation on the Analyses of Feature Models: A Metamorphic Testing Approach.",
                    "(Un-)Covering Equivalent Mutants.",
                    "MuTMuT: Efficient Exploration for Mutation Testing of Multithreaded Code.",
                    "Using Mutation to Automatically Suggest Fixes for Faulty Programs.",
                    "An Empirical Evaluation of Regression Testing Based on Fix-Cache Recommendations.",
                    "The Effectiveness of Regression Testing Techniques in Reducing the Occurrence of Residual Defects.",
                    "MbSRT2: Model-Based Selective Regression Testing with Traceability.",
                    "Generating Transition Probabilities for Automatic Model-Based Test Generation.",
                    "Model Based Testing and Abstract Interpretation in the Railway Signaling Context.",
                    "From Nondeterministic UML Protocol Statemachines to Class Contracts.",
                    "Simulated Satisfaction of Coverage Criteria on UML State Machines.",
                    "Regression Testing Ajax Applications: Coping with Dynamism.",
                    "Automated Behavioral Regression Testing.",
                    "A Dynamic Test Cluster Sampling Strategy by Leveraging Execution Spectra Information.",
                    "Text2Test: Automated Inspection of Natural Language Use Cases.",
                    "Cleansing Test Suites from Coincidental Correctness to Enhance Fault-Localization.",
                    "Industrial Scaled Automated Structural Testing with the Evolutionary Testing Tool.",
                    "TestFul: An Evolutionary Test Approach for Java.",
                    "GraphSeq: A Graph Matching Tool for the Extraction of Mobility Patterns.",
                    "It Does Matter How You Normalise the Branch Distance in Search Based Software Testing.",
                    "Explanation-Based Generalization of Infeasible Path.",
                    "Challenges with Software Verification and Validation Activities in the Space Industry.",
                    "GUI Testing Techniques Evaluation by Designed Experiments.",
                    "Repairing GUI Test Suites Using a Genetic Algorithm.",
                    "A Formal Model for Generating Integrated Functional and User Interface Test Cases.",
                    "Prioritizing State-Based Aspect Tests.",
                    "Machine Learning Methods and Asymmetric Cost Function to Estimate Execution Effort of Software Testing.",
                    "Does Hardware Configuration and Processor Load Impact Software Fault Observability?",
                    "An Application of Six Sigma and Simulation in Software Testing Risk Assessment.",
                    "Satisfying Test Preconditions through Guided Object Selection.",
                    "We're Finding Most of the Bugs, but What are We Missing?.",
                    "Specification of UML Model Transformations.",
                    "Holistic Model-Based Testing for Business Information Systems.",
                    "Towards an Automated and Dynamically Adaptable Test System for Testing Healthcare Information Systems.",
                    "Characterizing the Chain of Evidence for Software Safety Cases: A Conceptual Model Based on the IEC 61508 Standard.",
                    "Verified Firewall Policy Transformations for Test Case Generation.",
                    "Elaborating Software Test Processes and Strategies.",
                    "Model-Driven Engineering of Dependable Systems.",
                    "Online Testing Framework for Web Services.",
                    "A Counter-Example Testing Approach for Orchestrated Services.",
                    "Automated Bug Neighborhood Analysis for Identifying Incomplete Bug Fixes.",
                    "An Industrial Survey on Contemporary Aspects of Software Testing.",
                    "Fault Detection Likelihood of Test Sequence Length.",
                    "Towards Fully Automated Test Management for Large Complex Systems.",
                    "Searching for a Needle in a Haystack: Predicting Security Vulnerabilities for Windows Vista.",
                    "Precisely Detecting Runtime Change Interactions for Evolving Software.",
                    "Model Checking PLC Software Written in Function Block Diagram.",
                    "Timed Moore Automata: Test Data Generation and Model Checking.",
                    "Automated and Scalable T-wise Test Case Generation Strategies for Software Product Lines.",
                    "Longer is Better: On the Role of Test Sequence Length in Software Testing.",
                    "When BDDs Fail: Conformance Testing with Symbolic Execution and SMT Solving.",
                    "Towards a Testing Methodology for Reactive Systems: A Case Study of a Landing Gear Controller.",
                    "Rex: Symbolic Regular Expression Explorer.",
                    "State Machine Inference in Testing Context with Long Counterexamples.",
                    "Regression Test Selection and Product Line System Testing."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2010w",
                "sub_name": "Third International Conference on Software Testing, Verification and Validation, ICST 2010, Paris, France, April 7-9, 2010, Workshops Proceedings.",
                "count": 62,
                "papers": [
                    "From Test Purposes to Asynchronous Test Cases.",
                    "Modelling Requirements to Support Testing of Product Lines.",
                    "A Measurement Framework for Assessing Model-Based Testing Quality.",
                    "Effort Comparison for Model-Based Testing Scenarios.",
                    "Generating Minimal Fault Detecting Test Suites for Boolean Expressions.",
                    "Deriving Exhaustive Test Suits for Nondeterministic FSMs w.r.t. Non-separability Relation.",
                    "Test Generation Based on Abstraction and Test Purposes to Complement Structural Tests.",
                    "A Preliminary Study on BPEL Process Testability.",
                    "Language-Specific vs. Language-Independent Approaches: Embedding Semantics on a Metamodel for Testing and Verifying Access Control Policies.",
                    "A Manifesto for Higher Order Mutation Testing.",
                    "An Empirical Evaluation of the First and Second Order Mutation Testing Strategies.",
                    "Semantic Mutation Testing.",
                    "Mutation at System and Functional Levels.",
                    "Implementation-Oriented Mutation Testing of Statechart Models.",
                    "Type Sensitive Application of Mutation Operators for Dynamically Typed Programs.",
                    "Applying Mutation Testing to Web Applications.",
                    "Quantitative Evaluation of Mutation Operators for WS-BPEL Compositions.",
                    "Mutation Operators for Agent-Based Models.",
                    "Mutation Operators for Actor Systems.",
                    "Integrating Model-Based Testing with Evolutionary Functional Testing.",
                    "Using Evolutionary Testing to Find Test Scenarios for Hard to Reproduce Faults.",
                    "Optimizing for the Number of Tests Generated in Search Based Test Data Generation with an Application to the Oracle Cost Problem.",
                    "Metamorphic Testing of Stochastic Optimisation.",
                    "Considering Signal Constraints in Search-Based Testing of Continuous Systems.",
                    "Searching for Safety Violations Using Estimation of Distribution Algorithms.",
                    "Empirical Study on the Efficiency of Search Based Test Generation for EFSM Models.",
                    "Generating Feasible Transition Paths for Testing from an Extended Finite State Machine (EFSM) with the Counter Problem.",
                    "Generating Feasible Test Paths from an Executable Model Using a Multi-objective Approach.",
                    "Using Methods & Measures from Network Analysis for GUI Testing.",
                    "Performance Testing of GUI Applications.",
                    "A Framework for GUI Testing Based on Use Case Design.",
                    "On Modeling of GUI Test Profile.",
                    "Message Broker Using Asynchronous Method Invocation in Web Service and Its Evaluation.",
                    "Rich Internet Application Testing Using Execution Trace Data.",
                    "Test Coverage Analysis of UML State Machines.",
                    "Managing Testing Complexity in Dynamically Adaptive Systems: A Model-Driven Approach.",
                    "QoS-Based Model Driven Assessment of Adaptive Reactive Systems.",
                    "A Dynamic Behaviour and Reliability Evaluation Method for Applications That Are Based on Asynchronous Processing Nodes.",
                    "A Demo on Using Visualization to Aid Run-Time Verification of Dynamic Service Systems.",
                    "Generating Distinguishing Tests Using the Minion Constraint Solver.",
                    "Applications of Optimization to Logic Testing.",
                    "A Comparison of Constraint-Based and Sequence-Based Generation of Complex Input Data Structures.",
                    "SAT Solvers for Queries over Tree Automata with Constraints.",
                    "Using Constraints to Verify Properties of Rule Programs.",
                    "Model-Based Testing Using Symbolic Animation and Machine Learning.",
                    "Model-Checking Driven Security Testing of Web-Based Applications.",
                    "Taint Dependency Sequences: A Characterization of Insecure Execution Paths Based on Input-Sensitive Cause Sequences.",
                    "Towards Security Vulnerability Detection by Source Code Model Checking.",
                    "Functional Programming Way to Interact with Software Attacks and Vulnerabilities.",
                    "Practical Experience Gained from Passive Testing of Web Based Systems.",
                    "Some Modeling Challenges When Testing Rich Internet Applications for Security.",
                    "Honeyware: A Web-Based Low Interaction Client Honeypot.",
                    "Software Testing as an Online Service: Observations from Practice.",
                    "When to Migrate Software Testing to the Cloud?",
                    "Large-Scale Software Testing Environment Using Cloud Computing Technology for Dependable Parallel and Distributed Systems.",
                    "YETI on the Cloud.",
                    "Migrating Autonomic Self-Testing to the Cloud.",
                    "Supporting Test-Driven Development of Graphical User Interfaces Using Agile Interaction Design.",
                    "Overcoming Obstacles to Test-Driven Learning on Day One.",
                    "Software Testing Using Test Sheets.",
                    "LiFT: Driving Development Using a Business-Readable DSL for Web Testing.",
                    "Most Common Mistakes in Test-Driven Development Practice: Results from an Online Survey with Developers."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "2nd ICST 2009",
        "info": "Denver, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2009",
                "sub_name": "Second International Conference on Software Testing Verification and Validation, ICST 2009, Denver, Colorado, USA, April 1-4, 2009.",
                "count": 47,
                "papers": [
                    "Inferring Types of References to GUI Objects in Test Scripts.",
                    "An Initial Characterization of Industrial Graphical User Interface Systems.",
                    "An Empirical Evaluation of Automated Black Box Testing Techniques for Crashing GUIs.",
                    "Proving Functional Equivalence of Two AES Implementations Using Bounded Model Checking.",
                    "An Evaluation of Model Checkers for Specification Based Test Case Generation.",
                    "Optimizing Generation of Object Graphs in Java PathFinder.",
                    "Timed Testing under Partial Observability.",
                    "Passive Testing of Stochastic Timed Systems.",
                    "Testing Embedded Real Time Systems with TTCN-3.",
                    "Optimal Resource Allocation for Batch Testing.",
                    "A Flexible Framework for Quality Assurance of Software Artefacts with Applications to Java, UML, and TTCN-3 Test Specifications.",
                    "Quality Assurance of Software Applications Using the In Vivo Testing Approach.",
                    "Test Input Generation Using UML Sequence and State Machines Models.",
                    "Putting Formal Specifications under the Magnifying Glass: Model-based Testing for Validation.",
                    "The Effectiveness of Automated Static Analysis Tools for Fault Detection and Refactoring Prediction.",
                    "Euclide: A Constraint-Based Testing Framework for Critical C Programs.",
                    "A Model Building Process for Identifying Actionable Static Analysis Alerts.",
                    "Transforming and Selecting Functional Test Cases for Security Policy Testing.",
                    "Predicting Attack-prone Components.",
                    "Seasonal Variation in the Vulnerability Discovery Process.",
                    "Empirical Observations on Software Testing Automation.",
                    "Evaluating the Effect of the Number of Naturally Occurring Faults on the Estimates Produced by Capture-Recapture Models.",
                    "Test Redundancy Measurement Based on Coverage Information: Evaluations and Lessons Learned.",
                    "Generating Feasible Transition Paths for Testing from an Extended Finite State Machine (EFSM).",
                    "Pruning the Search Space in Path-Based Test Generation.",
                    "PKorat: Parallel Generation of Structurally Complex Test Inputs.",
                    "Practicing Testability in the Real World.",
                    "A Test Based Multidimensional Performance Model for a Mission Critical System Server.",
                    "An Alternative Approach to Test Effort Estimation Based on Use Cases.",
                    "A Simple Approach for Estimation of Execution Effort of Functional Test Cases.",
                    "Dynamic Regression Test Selection Based on a File Cache.",
                    "Automatic Test Generation for Coverage Analysis of ERTMS Software.",
                    "Automated Black Box Testing Tool for a Parallel Programming Library.",
                    "Test Automation on a SaaS Platform.",
                    "WS-TAXI: A WSDL-based Testing Tool for Web Services.",
                    "Clustering and Tailoring User Session Data for Testing Web Applications.",
                    "Penetration Testing with Improved Input Vector Identification.",
                    "Using Logic Criterion Feasibility to Reduce Test Set Size While Guaranteeing Fault Detection.",
                    "A Simple Coverage-Based Locator for Multiple Faults.",
                    "A Test-Driven Approach to Developing Pointcut Descriptors in AspectJ.",
                    "Using a Fault Hierarchy to Improve the Efficiency of DNF Logic Mutation Testing.",
                    "Mutation Testing for Java Database Applications.",
                    "Unit Testing Non-functional Concerns of Component-based Distributed Systems.",
                    "On the Effectiveness of Test Extraction without Overhead.",
                    "Assertion-Based Validation of Modified Programs.",
                    "Using JML Runtime Assertion Checking to Automate Metamorphic Testing in Applications without Test Oracles.",
                    "Optimizing Probabilities of Real-Time Test Case Execution."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2009w",
                "sub_name": "Second International Conference on Software Testing Verification and Validation, ICST 2009, Denver, Colorado, USA, April 1-4, 2009, Workshops Proceedings.",
                "count": 37,
                "papers": [
                    "Automated Evaluation of Runtime Object States against Model-Level States for State-Based Test Execution.",
                    "IPO-s: Incremental Generation of Combinatorial Interaction Test Data Based on Symmetries of Covering Arrays.",
                    "A Model for the Measurement of the Runtime Testability of Component-Based Systems.",
                    "Towards an Industrial Strength Process for Timed Testing.",
                    "Generating System Models for a Highly Configurable Train Control System Using a Domain-Specific Language: A Case Study.",
                    "Checking Sequence Generation Using State Distinguishing Subsequences.",
                    "Test Case Generation Using Model Checking for Software Components Deployed into New Environments.",
                    "Formal Correctness of a Passive Testing Approach for Timed Systems.",
                    "Experimental Comparison of Code-Based and Model-Based Test Prioritization.",
                    "Keynote Paper: Search Based Software Testing for Software Security: Breaking Code to Make it Safer.",
                    "Measuring and Improving Latency to Avoid Test Suite Wear Out.",
                    "Evolutionary White-Box Software Test with the EvoTest Framework: A Progress Report.",
                    "Signal Generation for Search-Based Testing of Continuous Systems.",
                    "A First Approach to Test Case Generation for BPEL Compositions of Web Services Using Scatter Search.",
                    "Evolving the Quality of a Model Based Test Suite.",
                    "Temporal White-Box Testing Using Evolutionary Algorithms.",
                    "Using Execution Paths to Evolve Software Patches.",
                    "A Mutation/Injection-Based Automatic Framework for Evaluating Code Clone Detection Tools.",
                    "Using Logic Criterion Feasibility to Reduce Test Set Size While Guaranteeing Double Fault Detection.",
                    "Mutation Analysis of Parameterized Unit Tests.",
                    "Assertion-Driven Development: Assessing the Quality of Contracts Using Meta-Mutations.",
                    "The Impact of Equivalent Mutants.",
                    "AjMutator: A Tool for the Mutation Analysis of AspectJ Pointcut Descriptors.",
                    "Evaluating Testing Strategies for Imaging Software by Means of Mutation Analysis.",
                    "Comparison of Unit-Level Automated Test Generation Tools.",
                    "An Experimental Comparison of Four Unit Test Criteria: Mutation, Edge-Pair, All-Uses and Prime Path Coverage.",
                    "Advantages of Mutation in Passive Testing: An Empirical Study.",
                    "Creating GUI Testing Tools Using Accessibility Technologies.",
                    "An Extensible Heuristic-Based Framework for GUI Test Case Maintenance.",
                    "Structural Feature Extraction for GUI Test Enhancement.",
                    "Towards Dynamic Adaptive Automated Test Generation for Graphical User Interfaces.",
                    "An Initial Study of Customer-Reported GUI Defects.",
                    "SOA Test Governance: Enabling Service Integration Testing across Organization and Technology Borders.",
                    "Automated Reverse Engineering of UML Sequence Diagrams for Dynamic Web Applications.",
                    "Using Common Criteria to Assess Quality of Web Services.",
                    "Automated Client-Side Monitoring for Web Applications.",
                    "Testing Composite Web Services-An Event-Based Approach."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "1st ICST 2008",
        "info": "Lillehammer, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/icst/2008",
                "sub_name": "First International Conference on Software Testing, Verification, and Validation, ICST 2008, Lillehammer, Norway, April 9-11, 2008.",
                "count": 63,
                "papers": [
                    "Efficient Test Data Generation for Variables with Complex Dependencies.",
                    "Relationships between Test Suites, Faults, and Fault Detection in GUI Testing.",
                    "Structural Testing of Executables.",
                    "Generation of All-Paths Unit Test with Function Calls.",
                    "A Crosstab-based Statistical Method for Effective Fault Localization.",
                    "Mutation Testing for Aspect-Oriented Programs.",
                    "Evaluating Automated Unit Testing in Sulu.",
                    "On the Predictability of Random Tests for Object-Oriented Software.",
                    "Less is More: A Minimalistic Approach to UML Model-Based Conformance Test Generation.",
                    "Traffic-aware Stress Testing of Distributed Real-Time Systems Based on UML Models in the Presence of Time Uncertainty.",
                    "Scheduling Timed Modules for Correct Resource Sharing.",
                    "Testability of Dynamic Real-Time Systems: An Empirical Study of Constrained Execution Environment Implications.",
                    "State-Based Testing of Ajax Web Applications.",
                    "A Three-Tiered Testing Strategy for Cookies.",
                    "Prioritizing User-Session-Based Test Cases for Web Applications Testing.",
                    "Trace-based Reflexive Testing of OO Programs with T2.",
                    "Relation between Depth of Inheritance Tree and Number of Methods to Test.",
                    "Testing Consequences of Grime Buildup in Object Oriented Design Patterns.",
                    "Contract-Based Verification for Aspect-Oriented Refactoring.",
                    "Testing Java Components based on Algebraic Specifications.",
                    "UML Activity Diagram Based Testing of Java Concurrent Programs for Data Race and Inconsistency.",
                    "Testing Grid Application Workflows Using TTCN-3.",
                    "Mining Software Repositories to Study Co-Evolution of Production & Test Code.",
                    "The Use of Intra-Release Product Measures in Predicting Release Readiness.",
                    "Test-Driven Assessment of Access Control in Legacy Applications.",
                    "An Evaluation of Two Bug Pattern Tools for Java.",
                    "Tool Support for Expert-Centred Code Assessments.",
                    "Empirical Software Change Impact Analysis using Singular Value Decomposition.",
                    "An Empirical Study on Bayesian Network-based Approach for Test Case Prioritization.",
                    "A Metamodel for the Measurement of Object-Oriented Systems: An Analysis using Alloy.",
                    "Automated Session Data Repair for Web Application Regression Testing.",
                    "Extended Finite State Machine Based Test Derivation Driven by User Defined Faults.",
                    "Simulation of Multi-Formalism Models with ModHel'X.",
                    "On Combining Multi-formalism Knowledge to Select Models for Model Transformation Testing.",
                    "Model-Based Tests for Access Control Policies.",
                    "Generating Test Requirements for the Service Connections based on the Layers of SOA.",
                    "Detecting and Repairing Inconsistencies across Heterogeneous Models.",
                    "Model Based Testing of System Requirements using UML Use Case Models.",
                    "Test Instrumentation and Pattern Matching for Automatic Failure Identification.",
                    "Comparing Aspects with Conventional Techniques for Increasing Testability.",
                    "Test Data Provision for ERP Systems.",
                    "Selective Homeworkless Reviews.",
                    "Designing and Building a Software Test Organization.",
                    "Challenges and Solutions in Test Staff Relocations within a Software Consultancy Company.",
                    "The Role of Stability Testing in Heterogeneous Application Environment.",
                    "Testing Predictive Software in Mobile Devices.",
                    "A Script-Based Testbed for Mobile Software Frameworks.",
                    "Automation Method for Testing XML/DB/XML Layers.",
                    "An Industrial Case Study of Bypass Testing on Web Applications.",
                    "Pre-testing Flash Device Driver through Model Checking Techniques.",
                    "Model-Based Testing of Automotive Systems.",
                    "How to Test the Intangible Properties of Graphical User Interfaces?",
                    "Workflow Inspector - A Test Tool for Microsoft Workflow Foundation.",
                    "Model-Based Quality Assurance of Windows Protocol Documentation.",
                    "Distributed In Vivo Testing of Software Applications.",
                    "A Methodology for UML Models V&V.",
                    "Quality of Automatically Generated Test Cases based on OCL Expressions.",
                    "Improving Automated Testing of Multi-threaded Software.",
                    "Functional Search-based Testing from State Machines.",
                    "Verifying and Analyzing Adaptive Logic through UML State Models.",
                    "Statistical Sampling Based Approach to Alleviate Log Replay Testing.",
                    "A Fitness Function to Find Feasible Sequences of Method Calls for Evolutionary Testing of Object-Oriented Programs.",
                    "A JML Compiler Based on AspectJ."
                ]
            },
            {
                "sub_name_abbr": "conf/icst/2008w",
                "sub_name": "First International Conference on Software Testing Verification and Validation, ICST 2008, Lillehammer, Norway, April 9-11, 2008, Workshops Proceedings.",
                "count": 54,
                "papers": [
                    "Formally comparing user and implementer model-based testing methods.",
                    "Observations for Assertion-based Scenarios in the context of Model Validation and Extension to Test Case Generation.",
                    "Use of invariant properties to evaluate the results of fault-injection-based robustness testing of protocol implementations.",
                    "Ordering Coverage Goals in Model Checker Based Testing.",
                    "Testing and Validating the Quality of Specifications.",
                    "Automated Test of Interactive Applications Using Task Trees.",
                    "An Environment for Automated Test Case Generation from Statechart-based and Finite State Machine-based Behavioral Models.",
                    "Verification of UML/OCL Class Diagrams using Constraint Programming.",
                    "Querying UML Models using OCL and Prolog: A Performance Study.",
                    "Using context descriptions and property definition patterns for software formal verification.",
                    "Unit Testing Model Management Operations.",
                    "Model transformation testing: oracle issue.",
                    "Validation and Verification of an UML/OCL Model with USE and B: Case Study and Lessons Learnt.",
                    "Mastering Specification Heterogeneity with Multifacet Analysis.",
                    "Heterogeneous colimits.",
                    "Checking Properties on the Control of Heterogeneous Systems.",
                    "Executing a Standard Compliant Transformation Model on a Non-standard Platform.",
                    "Theoretical Runtime Analyses of Search Algorithms on the Test Data Generation for the Triangle Classification Problem.",
                    "The spin on guided random search in verification.",
                    "Searching for Cognitively Diverse Tests: Towards Universal Test Diversity Metrics.",
                    "Strengthening Inferred Specifications using Search Based Testing.",
                    "Towards Constraing-Based Local Search for Automatic Test Data Generation.",
                    "Open Problems in Testability Transformation.",
                    "Search-based Testing using State-based Fitness.",
                    "Hybridizing Evolutionary Testing with Artificial Immune Systems and Local Search.",
                    "Constraint-based Evolutionary Testing of Autonomous Distributed Systems.",
                    "Evolutionary Structural Testing of Software with Pointers.",
                    "Handling Constraints for Search Based Software Test Data Generation.",
                    "Investigating the dimensionality problem of Adaptive Random Testing incorporating a local search technique.",
                    "Search-Based Testing of Complex Simulink Models containing Stateflow Diagrams.",
                    "Test generation and execution for security rules in temporal logic.",
                    "Security policy testing using vulnerability exploit chaining.",
                    "Detecting Security Vulnerabilities with Software Architecture Analysis Tools.",
                    "Testing Security Policies for Web Applications.",
                    "A Runtime Monitoring Environment for Mobile Java.",
                    "A Generic Metamodel For Security Policies Mutation.",
                    "Learning from Software Security Testing.",
                    "Security Testing: Turning Practice into Theory.",
                    "When it comes to Testing, is Usability the Closest Analogy to Security?",
                    "Incorporating Metrics in an Organizational Test Strategy.",
                    "A universal management and monitoring process for testing.",
                    "Testing Processes.",
                    "A Test Process for all Lifecycles.",
                    "Identifying Pitfalls of System Integration - An Exploratory Study.",
                    "Test Policy: Gaining Control on IT Quality and Processes.",
                    "The Keystone to Support a Generic Test Process: Separating the \"What\" from the \"How\".",
                    "A Benchmarking Suite for Measurement-Based WCET Analysis Tools.",
                    "A Workload Model for Benchmarking BPEL Engines.",
                    "Benchmarking Testing Strategies with Tools from Mutation Analysis.",
                    "Multi-Dimensional Measures for Test Case Quality.",
                    "Test Benchmarks - what is the question?",
                    "Balanced FSM Generation for Empirical Studies.",
                    "Benchmarking Effectiveness for Object-Oriented Unit Testing.",
                    "Experience with a Concurrency Bugs Benchmark."
                ]
            }
        ]
    }
]