[
    {
        "year": "2021",
        "name": "21st ICWE 2021",
        "info": "Biarritz, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2021",
                "sub_name": "Web Engineering - 21st International Conference, ICWE 2021, Biarritz, France, May 18-21, 2021, Proceedings.",
                "count": 48,
                "papers": [
                    "Interface to Query and Visualise Definitions from a Knowledge Base.",
                    "CARDINAL: Contextualized Adaptive Research Data Description INterface Applying LinkedData.",
                    "Publishing Base Registries as Linked Data Event Streams.",
                    "OntoSpect: IoT Ontology Inspection by Concept Extraction and Natural Language Generation.",
                    "A File-Based Linked Data Fragments Approach to Prefix Search.",
                    "Assessing the Quality of Online Reviews Using Formal Argumentation Theory.",
                    "Web User Interface as a Message - Power Law for Fraud Detection in Crowdsourced Labeling.",
                    "Conversation Graphs in Online Social Media.",
                    "WTA: Towards a Web-Based Testbed Architecture.",
                    "Towards Large-Scale Empirical Assessment of Web APIs Evolution.",
                    "Stability Metrics for Continuous Integration of Service-Oriented Systems.",
                    "Attentive Hybrid Collaborative Filtering for Rating Conversion in Recommender Systems.",
                    "Sentence Dependent-Aware Network for Aspect-Category Sentiment Analysis.",
                    "A Probabilistic Approach to Personalize Type-Based Facet Ranking for POI Suggestion.",
                    "Web Table Classification Based on Visual Features.",
                    "Automated Essay Scoring via Example-Based Learning.",
                    "Conversation and Recommendation: Knowledge-Enhanced Personalized Dialog System.",
                    "MPIA: Multiple Preferences with Item Attributes for Graph Convolutional Collaborative Filtering.",
                    "Better Call the Plumber: Orchestrating Dynamic Information Extraction Pipelines.",
                    "Preprocessing Techniques for End-To-End Trainable RNN-Based Conversational System.",
                    "Effective Seed-Guided Topic Labeling for Dataless Hierarchical Short Text Classification.",
                    "PrivaSeer: A Privacy Policy Search Engine.",
                    "Knowledge-Driven Architecture Composition: Assisting the System Integrator to Reuse Integration Knowledge.",
                    "A-MaGe: Atomic Mashup Generator for the Web of Things.",
                    "WebAssembly Modules as Lightweight Containers for Liquid IoT Applications.",
                    "Leveraging Web of Things W3C Recommendations for Knowledge Graphs Generation.",
                    "A Standalone WebAssembly Development Environment for the Internet of Things.",
                    "Full Stack Is Not What It Used to Be.",
                    "An Improving Approach for DOM-Based Web Test Suite Repair.",
                    "Communicating Web Vessels: Improving the Responsiveness of Mobile Web Apps with Adaptive Redistribution.",
                    "Snapshot-Based Migration of ES6 JavaScript.",
                    "Automated Repair of Layout Bugs in Web Pages with Linear Programming.",
                    "A Model-Based Chatbot Generation Approach to Converse with Open Data Sources.",
                    "Open Data Accessibility Based on Voice Commands.",
                    "PWA vs the Others: A Comparative Study on the UI Energy-Efficiency of Progressive Web Apps.",
                    "Static Analysis of Large-Scale JavaScript Front End.",
                    "Applying Predictive Analytics on Research Information to Enhance Funding Discovery and Strengthen Collaboration in Project Proposals.",
                    "A Web-Based Co-Creation and User Engagement Method and Platform.",
                    "Effectiveness Comparison of Email Addresses Recovery from Gravatars.",
                    "A Web Tool for XQuery Debugging.",
                    "Managing Versioned Web Resources in the File System.",
                    "Visualizing Web Users' Attention to Text with Selection Heatmaps.",
                    "City-Stories: Combining Entity Linking, Multimedia Retrieval, and Crowdsourcing to Make Historical Data Accessible.",
                    "SMOTE: A Tool to Proactively Manage Situations in WoT Environments.",
                    "Voice-Based Virtual Assistants for User Interaction Modeling.",
                    "Similarity Search, Recommendation and Explainability over Graphs in Different Domains: Social Media, News, and Health Industry.",
                    "High-Level Interaction Design with Discourse Models for Automated Web GUI Generation.",
                    "Influence Learning and Maximization."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2021w",
                "sub_name": "ICWE 2021 Workshops - ICWE 2021 International Workshops, BECS and Invited Papers, Biarritz, France, May 18-21, 2021, Revised Selected Papers.",
                "count": 8,
                "papers": [
                    "Putting Data Science Pipelines on the Edge.",
                    "DNN Model Deployment on Distributed Edges.",
                    "Towards Proactive Context-Aware IoT Environments by Means of Federated Learning.",
                    "Real-Time Deep Learning-Based Anomaly Detection Approach for Multivariate Data Streams with Apache Flink.",
                    "A Novel Approach to Dynamic Pricing for Cloud Computing Through Price Band Prediction.",
                    "Learning-Based Activation of Energy Harvesting Sensors for Fresh Data Acquisition.",
                    "Exploiting Triangle Patterns for Heterogeneous Graph Attention Network.",
                    "Towards Seamless IoT Device-Edge-Cloud Continuum: - Software Architecture Options of IoT Devices Revisited."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "20th ICWE 2020",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2020",
                "sub_name": "Web Engineering - 20th International Conference, ICWE 2020, Helsinki, Finland, June 9-12, 2020, Proceedings.",
                "count": 45,
                "papers": [
                    "Detecting Responsive Web Design Bugs with Declarative Specifications.",
                    "Layout as a Service (LaaS): A Service Platform for Self-Optimizing Web Layouts.",
                    "Structural Profiling of Web Sites in the Wild.",
                    "Accelerating Web Start-up with Resource Preloading.",
                    "An Analysis of Throughput and Latency Behaviours Under Microservice Decomposition.",
                    "W-ADE: Timing Performance Benchmarking in Web of Things.",
                    "Comparing a Polling and Push-Based Approach for Live Open Data Interfaces.",
                    "NuMessage: Providing Scalable and Reliable Messaging Service in Distributed Systems.",
                    "A Credit Scoring Model for SMEs Based on Social Media Data.",
                    "Who's Behind That Website? Classifying Websites by the Degree of Commercial Intent.",
                    "I Don't Have That Much Data! Reusing User Behavior Models for Websites from Different Domains.",
                    "Improving Detection Accuracy for Malicious JavaScript Using GAN.",
                    "VISH: Does Your Smart Home Dialogue System Also Need Training Data?",
                    "Neighborhood Aggregation Embedding Model for Link Prediction in Knowledge Graphs.",
                    "Automatic Model Completion for Web Applications.",
                    "Almost Rerere: An Approach for Automating Conflict Resolution from Similar Resolved Conflicts.",
                    "Generation of Realistic Navigation Paths for Web Site Testing Using Recurrent Neural Networks and Generative Adversarial Neural Networks.",
                    "Scalable Real-Time Confusion Detection for Personalized Onboarding Guides.",
                    "Creating and Capturing Artificial Emotions in Autonomous Robots and Software Agents.",
                    "On Emotions in Conflict Wikipedia Talk Pages Discussions.",
                    "Geospatial Partitioning of Open Transit Data.",
                    "Efficient Live Public Transport Data Sharing for Route Planning on the Web.",
                    "Web-Based Development and Visualization Dashboards for Smart City Applications.",
                    "Detecting Rumor on Microblogging Platforms via a Hybrid Stance Attention Mechanism.",
                    "A Hybrid Approach for Aspect-Based Sentiment Analysis Using Deep Contextual Word Embeddings and Hierarchical Attention.",
                    "Just the Right Mood for HIT! - Analyzing the Role of Worker Moods in Conversational Microtask Crowdsourcing.",
                    "SolidRDP: Applying Solid Data Containers for Research Data Publishing.",
                    "Applying Natural Language Processing Techniques to Generate Open Data Web APIs Documentation.",
                    "WebDelta: Lightweight Migration of Web Applications with Modified Execution State.",
                    "User-Side Service Synchronization in Multiple Devices Environment.",
                    "An Approach to Build P2P Web Extensions.",
                    "Blended or Distance Learning? - Comparing Student Performance Between University and Open University.",
                    "On Teaching Web Stream Processing - Lessons Learned.",
                    "Teaching Container-Based DevOps Practices.",
                    "Predicting the Outbreak of Conflict in Online Discussions Using Emotion-Based Features.",
                    "An APIfication Approach to Facilitate the Access and Reuse of Open Data.",
                    "A Personal Health Trajectory API: Addressing Problems in Health Institution-Oriented Systems.",
                    "Context-Aware Encoding and Delivery in the Web.",
                    "An OpenAPI-Based Testing Framework to Monitor Non-functional Properties of REST APIs.",
                    "OpenAPI Bot: A Chatbot to Help You Understand REST APIs.",
                    "A Different Web Analytics Perspective Through Copy to Clipboard Heatmaps.",
                    "A Web Augmentation Framework for Accessibility Based on Voice Interaction.",
                    "Annotated Knowledge Graphs for Teaching in Higher Education - Supporting Mentors and Mentees by Digital Systems.",
                    "A Universal Application Programming Interface to Access and Reuse Linked Open Data.",
                    "OntoSemStats: An Ontology to Express the Use of Semantics in RDF-Based Knowledge Graphs."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2020w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2020 International Workshops, KDWEB, Sem4Tra, and WoT4H, Helsinki, Finland, June 9-12, 2020, Revised Selected Papers.",
                "count": 8,
                "papers": [
                    "SOLID and PeaaS: Your Phone as a Store for Personal Data.",
                    "Use of Geolocation for the Management of Collective Transport of People in Stations and Airports.",
                    "Towards the Integration of Web of Things Applications Based on Service Discovery.",
                    "Extending W3C Thing Description to Provide Support for Interactions of Things in Real-Time.",
                    "Interactive Route Personalization Using Regions of Interest.",
                    "Velopark: A Linked Open Data Platform for Bicycle Parkings.",
                    "How to Prototype a Client-Side Route Planner for Helsinki with Routable Tiles and Linked Connections.",
                    "Research on Standardization Technology of Software Testing Process Based on Workflow."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "19th ICWE 2019",
        "info": "Daejeon, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2019",
                "sub_name": "Web Engineering - 19th International Conference, ICWE 2019, Daejeon, South Korea, June 11-14, 2019, Proceedings.",
                "count": 50,
                "papers": [
                    "Web Page Structured Content Detection Using Supervised Machine Learning.",
                    "Augmenting LOD-Based Recommender Systems Using Graph Centrality Measures.",
                    "ST-Sem: A Multimodal Method for Points-of-Interest Classification Using Street-Level Imagery.",
                    "Time and Location Recommendation for Crime Prevention.",
                    "Incremental PARAFAC Decomposition for Three-Dimensional Tensors Using Apache Spark.",
                    "Modeling Heterogeneous Influences for Point-of-Interest Recommendation in Location-Based Social Networks.",
                    "Exploring Semantic Change of Chinese Word Using Crawled Web Data.",
                    "A Customisable Pipeline for Continuously Harvesting Socially-Minded Twitter Users.",
                    "Predicting Graph Operator Output over Multiple Graphs.",
                    "Streaming Event Detection in Microblogs: Balancing Accuracy and Performance.",
                    "Supervised Group Embedding for Rumor Detection in Social Media.",
                    "Fast Incremental PageRank on Dynamic Networks.",
                    "Crowdsourced Time-Sync Video Recommendation via Semantic-Aware Neural Collaborative Filtering.",
                    "On Twitter Bots Behaving Badly: Empirical Study of Code Patterns on GitHub.",
                    "CrowDIY: How to Design and Adapt Collaborative Crowdsourcing Workflows Under Budget Constraints.",
                    "Finding Baby Mothers on Twitter.",
                    "An End-User Pipeline for Scraping and Visualizing Semi-Structured Data over the Web.",
                    "DotCHA: A 3D Text-Based Scatter-Type CAPTCHA.",
                    "Entropy and Compression Based Analysis of Web User Interfaces.",
                    "Domain Classifier: Compromised Machines Versus Malicious Registrations.",
                    "The \"Game Hack\" Scam.",
                    "Decentralized Service Registry and Discovery in P2P Networks Using Blockchain Technology.",
                    "Amalgam: Hardware Hacking for Web Developers with Style (Sheets).",
                    "Jekyll RDF: Template-Based Linked Data Publication with Minimized Effort and Maximum Scalability.",
                    "On the Web Platform Cornucopia.",
                    "Linked USDL Extension for Cloud Services Description.",
                    "An Automatic Data Service Generation Approach for Cross-origin Datasets.",
                    "Merging Intelligent API Responses Using a Proportional Representation Approach.",
                    "Analyzing the Evolution of Linked Vocabularies.",
                    "Comparison Matrices of Semantic RESTful APIs Technologies.",
                    "Dragon: Decision Tree Learning for Link Discovery.",
                    "Catch & Release: An Approach to Debugging Distributed Full-Stack JavaScript Applications.",
                    "Multi-device Adaptation with Liquid Media Queries.",
                    "Conversational Data Exploration.",
                    "Distributed Intelligent Client-Centric Personalisation.",
                    "Webifying Heterogenous Internet of Things Devices.",
                    "VR-Powered Scenario-Based Testing for Visual and Acoustic Web of Things Services.",
                    "User's Emotional eXperience Analysis of Wizard Form Pattern Using Objective and Subjective Measures.",
                    "Integration Platform for Metric-Based Analysis of Web User Interfaces.",
                    "Personal Information Controller Service (PICS).",
                    "Enabling the Interconnection of Smart Devices Through Semantic Web Techniques.",
                    "Content- and Context-Related Trust in Open Multi-agent Systems Using Linked Data.",
                    "Facilitating the Evolutionary Modifications in Distributed Apps via Automated Refactoring.",
                    "Effect-Driven Selection of Web of Things Services in Cyber-Physical Systems Using Reinforcement Learning.",
                    "Liquid Web Architectures.",
                    "Exploiting Side Information for Recommendation.",
                    "Deep Learning-Based Sequential Recommender Systems: Concepts, Algorithms, and Evaluations.",
                    "Architectures Server-Centric vs Mobile-Centric for Developing WoT Applications.",
                    "Powerful Data Analysis and Composition with the UNIX-Shell.",
                    "Non-monotonic Reasoning on the Web."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2019w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2019 International Workshops, DSKG, KDWEB, MATWEP, Daejeon, South Korea, June 11, 2019, Proceedings.",
                "count": 11,
                "papers": [
                    "A Design of Building Inventory for Risk Analysis Using Open Data.",
                    "Technical Invention Trend Analysis of Applicants Based on CPC Classification.",
                    "A Study on Automatic Keyphrase Extraction and Its Refinement for Scientific Articles.",
                    "A Study on the Characteristics of the Long-Term Web Forum Users Using Social Network Analysis.",
                    "Knowledge Exploration from Tables on the Web.",
                    "Context-Dependent Token-Wise Variational Autoencoder for Topic Modeling.",
                    "Extraction of Relations Between Entities from Human-Generated Content on Social Networks.",
                    "Social Networks as Communication Channels: A Logical Approach.",
                    "Dataset Anonyization on Cloud: Open Problems and Perspectives.",
                    "Scenario Testing of AngularJS-Based Single Page Web Applications.",
                    "Environment-Aware and Human-Centric Software Testing Framework for Cyber-Physical Systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "18th ICWE 2018",
        "info": "Cáceres, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2018",
                "sub_name": "Web Engineering - 18th International Conference, ICWE 2018, Cáceres, Spain, June 5-8, 2018, Proceedings.",
                "count": 43,
                "papers": [
                    "Evaluating the Impact of Developers' Personality on the Intention to Adopt Model-Driven Web Engineering Approaches: An Observational Study.",
                    "CME - A Web Application Framework Learning Technique Based on Concerns, Micro-Learning and Examples.",
                    "Refining Traceability Links Between Vulnerability and Software Component in a Vulnerability Knowledge Graph.",
                    "Transferring Tests Across Web Applications.",
                    "Generating GraphQL-Wrappers for REST(-like) APIs.",
                    "ReWaMP: Rapid Web Migration Prototyping Leveraging WebAssembly.",
                    "Form Filling Based on Constraint Solving.",
                    "Effective Crowdsourced Generation of Training Data for Chatbots Natural Language Understanding.",
                    "Chatbot Dimensions that Matter: Lessons from the Trenches.",
                    "HCI Vision for Automated Analysis and Mining of Web User Interfaces.",
                    "Decentralized Computation Offloading on the Edge with Liquid WebWorkers.",
                    "Improving Legacy Applications with Client-Side Augmentations.",
                    "Mashup Recommendation for Trigger Action Programming.",
                    "Leveraging Analysis of User Behavior from Web Usage Extraction over DOM-tree Structure.",
                    "Selectivity Estimation for SPARQL Triple Patterns with Shape Expressions.",
                    "Efficiently Pinpointing SPARQL Query Containments.",
                    "A Bottom-Up Algorithm for Answering Context-Free Path Queries in Graph Databases.",
                    "DaQAR - An Ontology for the Uniform Exchange of Comparable Linked Data Quality Assessment Requirements.",
                    "Predicting User Flight Preferences in an Airline E-Shop.",
                    "Focused Crawling Through Reinforcement Learning.",
                    "Semantic Fingerprinting: A Novel Method for Entity-Level Content Classification.",
                    "Learning to Rank Tweets with Author-Based Long Short-Term Memory Networks.",
                    "A Case Study on Visualizing Large Spatial Datasets in a Web-Based Map Viewer.",
                    "Towards Full End-Users Control of Social Recommendations.",
                    "FactCheck - Identify and Fix Conflicting Data on the Web.",
                    "Semantic Data Stream Mapping and Shape Constraint Validation Based on Collaboratively Created Annotations.",
                    "TDLIoT: A Topic Description Language for the Internet of Things.",
                    "Managing Uncertain Complex Events in Web of Things Applications.",
                    "GrOWTH: Goal-Oriented End User Development for Web of Things Devices.",
                    "Spatio-Cohesive Service Selection Using Machine Learning in Dynamic IoT Environments.",
                    "Reflective Internet of Things Middleware-Enabled a Predictive Real-Time Waste Monitoring System.",
                    "Distributed Stream Consistency Checking.",
                    "Peer-to-Peer Video Streaming in HTML5 with WebTorrent.",
                    "Datalyzer: Streaming Data Applications Made Easy.",
                    "OpenBudgets.eu: A Platform for Semantically Representing and Analyzing Open Fiscal Data.",
                    "Context-Aware and Linked Open Data Based Service Discovery.",
                    "Educational Open Government Data: From Requirements to End Users.",
                    "Natural-Language-Enabled End-User Tool Endowed with Ontology-Based Development.",
                    "Interconnecting and Monitoring Heterogeneous Things in IoT Applications.",
                    "ELEVATE-Live: Assessment and Visualization of Online News Virality via Entity-Level Analytics.",
                    "OpenAPItoUML: A Tool to Generate UML Models from OpenAPI Definitions.",
                    "Generation of Web Frontends from API Documentation with Direwolf Interaction Flow Designer.",
                    "Model Based Rapid Prototyping and Evolution of Web Application."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2018w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2018 International Workshops, MATWEP, EnWot, KD-WEB, WEOD, TourismKG, Cáceres, Spain, June 5, 2018, Revised Selected Papers.",
                "count": 29,
                "papers": [
                    "Intelligent Code Generation for Model Driven Web Development.",
                    "Applying Model-Driven Web Engineering to the Testing Phase of the ADAGIO Project.",
                    "Web Page Representations and Data Extraction with BERyL.",
                    "Towards Distribution Options in the End-User Development of Multi-device Mashups.",
                    "Towards Dynamically Programmable Devices Using Beacons.",
                    "Architecting Self-adaptive Software Systems.",
                    "A Modular Pill Dispenser Supporting Therapies at Home.",
                    "Towards a Runtime Verification Approach for Internet of Things Systems.",
                    "A User Modeling Pipeline for Studying Polarized Political Events in Social Media.",
                    "The Problem of Data Cleaning for Knowledge Extraction from Social Media.",
                    "From Web to Physical and Back: WP User Profiling with Deep Learning.",
                    "Making Sentiment Analysis Algorithms Scalable.",
                    "Using \\varphi -\\delta Diagrams on Web Data.",
                    "SemQuire - Assessing the Data Quality of Linked Open Data Sources Based on DQV.",
                    "Model-Driven Analytics for Open Data APIs.",
                    "Geo-Time Broker: A Web Agent of Dynamic Flows of Geo-Temporal Activity for Smart Cities.",
                    "Publishing Tourism Statistics as Linked Data a Case Study of Sri Lanka.",
                    "Linked-Fiestas: A Knowledge Graph to Promote Cultural Tourism in Spain.",
                    "DBtravel: A Tourism-Oriented Semantic Graph.",
                    "La Rioja Turismo: The Construction and Exploitation of a Queryable Tourism Knowledge Graph.",
                    "Linked Data Graphs for Semantic Data Integration in the CART System.",
                    "Destination Attractions System and Strategic Visitor Flows - An Exploratory Study.",
                    "SanTour: Towards Personalized Recommendation of Hiking Trails to Health Profiles.",
                    "Electronic Word-of-Mouth (eWOM) for Destination Promotion by Tourists.",
                    "Building an Ecosystem for the Tyrolean Tourism Knowledge Graph.",
                    "Knowledge Base Evolution Analysis: A Case Study in the Tourism Domain.",
                    "Type Prediction of RDF Knowledge Graphs Using Binary Classifiers with Structural Data.",
                    "Semantic Network Visualization of Cultural Heritage Data.",
                    "Adaptation Process in Context-Aware Recommender System of Accessible Tourism Plan."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "17. ICWE 2017",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2017",
                "sub_name": "Web Engineering - 17th International Conference, ICWE 2017, Rome, Italy, June 5-8, 2017, Proceedings.",
                "count": 49,
                "papers": [
                    "Evaluating Knowledge Anchors in Data Graphs Against Basic Level Objects.",
                    "Decentralized Evolution and Consolidation of RDF Graphs.",
                    "The BigDataEurope Platform - Supporting the Variety Dimension of Big Data.",
                    "Spatially Cohesive Service Discovery and Dynamic Service Handover for Distributed IoT Environments.",
                    "ALMOsT.js: An Agile Model to Model and Model to Text Transformation Framework.",
                    "A Big Data Analysis Framework for Model-Based Web User Behavior Analytics.",
                    "From Search Engines to Augmented Search Services: An End-User Development Approach.",
                    "Temporal Analysis of Social Media Response to Live Events: The Milano Fashion Week.",
                    "Trading Off Popularity for Diversity in the Results Sets of Keyword Queries on Linked Data.",
                    "The Qanary Ecosystem: Getting New Insights by Composing Question Answering Pipelines.",
                    "Improving Reliability of Crowdsourced Results by Detecting Crowd Workers with Multiple Identities.",
                    "Maturity Model for Liquid Web Architectures.",
                    "Twisting Web Pages for Saving Energy.",
                    "MateTee: A Semantic Similarity Metric Based on Translation Embeddings for Knowledge Graphs.",
                    "Improved Developer Support for the Detection of Cross-Browser Incompatibilities.",
                    "Proximity-Based Adaptation of Web Content on Public Displays.",
                    "Ontology-Enhanced Aspect-Based Sentiment Analysis.",
                    "Inter-parameter Constraints in Contemporary Web APIs.",
                    "Collaborative Item Embedding Model for Implicit Feedback Data.",
                    "Impact of Referral Incentives on Mobile App Reviews.",
                    "Towards Stochastic Performance Models for Web 2.0 Applications.",
                    "Web Intelligence Linked Open Data for Website Design Reuse.",
                    "Exploratory Search of Web Data Services Based on Collective Intelligence.",
                    "Tweetchain: An Alternative to Blockchain for Crowd-Based Applications.",
                    "The Dimensions of Crowdsourcing Task Design.",
                    "Public Transit Route Planning Through Lightweight Linked Data Interfaces.",
                    "A WebRTC Extension to Allow Identity Negotiation at Runtime.",
                    "A UML Profile for OData Web APIs.",
                    "A Query Log Analysis of Dataset Search.",
                    "Recruiting from the Network: Discovering Twitter Users Who Can Help Combat Zika Epidemics.",
                    "Towards Automatic Generation of Web-Based Modeling Editors.",
                    "Harvesting Forum Pages from Seed Sites.",
                    "Decentralised Authoring, Annotations and Notifications for a Read-Write Web with dokieli.",
                    "Evaluating Genomic Big Data Operations on SciDB and Spark.",
                    "Mining Worse and Better Opinions - Unsupervised and Agnostic Aggregation of Online Reviews.",
                    "XOOM: An End-User Development Tool for Web-Based Wearable Immersive Virtual Tours.",
                    "Public Debates on the Web.",
                    "A Web Tool for Type Checking and Testing of SPARQL Queries.",
                    "Supporting Mobile Web Augmentation by End Users.",
                    "Rapid Engineering of QA Systems Using the Light-Weight Qanary Architecture.",
                    "Improving GISBuilder with Runtime Product Preview.",
                    "ALMOsT-Trace: A Web Based Embeddable Tracing Tool for ALMOsT.js.",
                    "TweetCric: A Twitter-Based Accountability Mechanism for Cricket.",
                    "Extending the Genomic Data Model and the Genometric Query Language with Domain Taxonomies.",
                    "A Semantic Integration Approach for Building Knowledge Graphs On-Demand.",
                    "A People-Oriented Paradigm for Smart Cities.",
                    "CSQuaRE: Approach for Quality Control in Crowdsourcing.",
                    "Design of a Small and Medium Enterprise Growth Prediction Model Based on Web Mining.",
                    "Intelligent End User Development Platform Towards Enhanced Decision-Making."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2017w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2017 International Workshops, Liquid Multi-Device Software and EnWoT, practi-O-web, NLPIT, SoWeMine, Rome, Italy, June 5-8, 2017, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "An Adaptive Formal Metamodel for Semantic Complex Event Processing-Driven Social Internet of Things Network.",
                    "Semantic Discovery in the Web of Things.",
                    "Challenges When Moving from Monolith to Microservice Architecture.",
                    "IoT Application Deployment Using Request-Response Pattern with MQTT.",
                    "Wireless Brain-Computer Interface for Wheelchair Control by Using Fast Machine Learning and Real-Time Hyper-Dimensional Classification.",
                    "Case Study: Building a Serverless Messenger Chatbot.",
                    "Four Key Factors to Design a Web of Things Architecture.",
                    "Liquid Transfer of User Identity.",
                    "Engineering Task-Automation Systems for Domain Specificity.",
                    "A Homemade Pill Dispenser Prototype Supporting Elderly.",
                    "Towards an Acceptance Testing Approach for Internet of Things Systems.",
                    "ABC Algorithm for URL Extraction.",
                    "Towards a UML and IFML Mapping to GraphQL.",
                    "Accessing Government Open Data Through Chatbots.",
                    "Using Ontologies for Official Statistics: The Istat Experience.",
                    "Ontology Population from Raw Text Corpus for Open-Source Intelligence.",
                    "Named Entity Recognition in Twitter Using Images and Text.",
                    "Online Expectation Maximization for Language Characterization of Streaming Text.",
                    "Analysing Cultural Events on Twitter.",
                    "Harvesting Knowledge from Social Networks: Extracting Typed Relationships Among Entities.",
                    "Novel Comment Spam Filtering Method on Youtube: Sentiment Analysis and Personality Recognition.",
                    "Mining Communication Data in a Music Community: A Preliminary Analysis.",
                    "Measuring Personal Branding in Social Media: Towards an Influence Indication Score.",
                    "Big Web Data: Warehousing and Analytics - Recent Trends and Future Challenges.",
                    "Model-Based Development of JavaScript Web Applications.",
                    "Liquid Web Applications: ICWE2017 Tutorial."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "16. ICWE 2016",
        "info": "Lugano, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2016",
                "sub_name": "Web Engineering - 16th International Conference, ICWE 2016, Lugano, Switzerland, June 6-9, 2016. Proceedings.",
                "count": 61,
                "papers": [
                    "Medley: An Event-Driven Lightweight Platform for Service Composition.",
                    "REST APIs: A Large-Scale Analysis of Compliance with Principles and Best Practices.",
                    "MIRA: A Model-Driven Framework for Semantic Interfaces for Web Applications.",
                    "Volatile Functionality in Action: Methods, Techniques and Assessment.",
                    "Abstracting and Structuring Web Contents for Supporting Personal Web Experiences.",
                    "CTAT: Tilt-and-Tap Across Devices.",
                    "Revisiting Web Data Extraction Using In-Browser Structural Analysis and Visual Cues in Modern Web Designs.",
                    "Clustering-Aided Page Object Generation for Web Testing.",
                    "Coverage Patterns-Based Approach to Allocate Advertisement Slots for Display Advertising.",
                    "Enabling Fine-Grained RDF Data Completeness Assessment.",
                    "Benchmarking Web API Quality.",
                    "Correlation of Ontology-Based Semantic Similarity and Human Judgement for a Domain Specific Fashion Ontology.",
                    "Co-evolution of RDF Datasets.",
                    "LinkSUM: Using Link Analysis to Summarize Entity Data.",
                    "Beyond Established Knowledge Graphs-Recommending Web Datasets for Data Linking.",
                    "YABench: A Comprehensive Framework for RDF Stream Processor Correctness and Performance Assessment.",
                    "When a FILTER Makes the Difference in Continuously Answering SPARQL Queries on Streaming and Quasi-Static Linked Data.",
                    "Aspect-Based Sentiment Analysis on the Web Using Rhetorical Structure Theory.",
                    "Diversity in Urban Social Media Analytics.",
                    "Data-Aware Service Choreographies Through Transparent Data Exchange.",
                    "Formal Specification of RESTful Choreography Properties.",
                    "Analysis of an Access Control System for RESTful Services.",
                    "Operating System Compositor and Hardware Usage to Enhance Graphical Performance in Web Runtimes.",
                    "QwwwQ: Querying Wikipedia Without Writing Queries.",
                    "A Quality Model for Linked Data Exploration.",
                    "Please Stay vs Let's Play: Social Pressure Incentives in Paid Collaborative Crowdsourcing.",
                    "On the Invitation of Expert Contributors from Online Communities for Knowledge Crowdsourcing Tasks.",
                    "Analysis of a Cultural Heritage Game with a Purpose with an Educational Incentive.",
                    "Semantic Measures: How Similar? How Related?",
                    "Design of CQA Systems for Flexible and Scalable Deployment and Evaluation.",
                    "A Matter of Words: NLP for Quality Evaluation of Wikipedia Medical Articles.",
                    "Middleware Mediated Semantic Sensor Networks.",
                    "I am a Machine, Let Me Understand Web Media!",
                    "Situational-Context: A Unified View of Everything Involved at a Particular Situation.",
                    "The Direwolf Inside You: End User Development for Heterogeneous Web of Things Appliances.",
                    "A Semantic Model for Friend Segregation in Online Social Networks.",
                    "Bootstrapping an Online News Knowledge Base.",
                    "Integrating Big Spatio-Temporal Data Using Collaborative Semantic Data Management.",
                    "Extending Kansei Engineering for Requirements Consideration in Web Interaction Design.",
                    "Improving Automated Fact-Checking Through the Semantic Web.",
                    "Using Spatiotemporal Information to Integrate Heterogeneous Biodiversity Semantic Data.",
                    "Automatic Page Object Generation with APOGEN.",
                    "SnowWatch: A Multi-modal Citizen Science Application.",
                    "CroKnow: Structured Crowd Knowledge Creation.",
                    "ELES: Combining Entity Linking and Entity Summarization.",
                    "Liquid, Autonomous and Decentralized Stream Processing for the Web of Things.",
                    "Migrating and Pairing Recursive Stateful Components Between Multiple Devices with Liquid.js for Polymer.",
                    "A Universal Socio-Technical Computing Machine.",
                    "Web Objects Ambient: An Integrated Platform Supporting New Kinds of Personal Web Experiences.",
                    "WeatherUSI: User-Based Weather Crowdsourcing on Public Displays.",
                    "Discovering and Analyzing Alternative Treatments Hypothesis via Social Health Data.",
                    "Towards Handling Constraint Network Conditions Between WoT Entities Using Conflict-Free Anti-Entropy Communication.",
                    "RESTful Conversation with RESTalk - The Use Case of Doodle.",
                    "Supporting Personalization in Legacy Web Sites Through Client-Side Adaptation.",
                    "A Lightweight Semi-automated Acceptance Test-Driven Development Approach for Web Applications.",
                    "The WoT as an Awareness Booster in Agile Development Workspaces.",
                    "A Model-Driven Process to Migrate Web Content Management System Extensions.",
                    "Using Docker Containers to Improve Reproducibility in Software and Web Engineering Research.",
                    "A Declarative Approach to Information Extraction Using Web Service API.",
                    "Distributed Web Applications with IPFS, Tutorial.",
                    "Recommender Systems Meet Linked Open Data."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2016w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2016 International Workshops, DUI, TELERISE, SoWeMine, and Liquid Web, Lugano, Switzerland, June 6-9, 2016, Revised Selected Papers.",
                "count": 20,
                "papers": [
                    "privacyTracker: A Privacy-by-Design GDPR-Compliant Framework with Verifiable Data Traceability Controls.",
                    "Evaluation of Professional Cloud Password Management Tools.",
                    "Enhancing Access Control Trees for Cloud Computing.",
                    "Is a Picture Worth a Thousand Terms? Visualising Contract Terms and Data Protection Requirements for Cloud Computing Users.",
                    "Brief Overview of the Legal Instruments and Restrictions for Sharing Data While Complying with the EU Data Protection Law.",
                    "Identifying Great Teachers Through Their Online Presence.",
                    "Tracking Dengue Epidemics Using Twitter Content Classification and Topic Modelling.",
                    "Experimental Measures of News Personalization in Google News.",
                    "XD-Bike: A Cross-Device Repository of Mountain Biking Routes.",
                    "Multi-device UI Development for Task-Continuous Cross-Channel Web Applications.",
                    "Liquid Context: Migrating the Users' Context Across Devices.",
                    "Synchronizing Application State Using Virtual DOM Trees.",
                    "AttributeLinking: Exploiting Attributes for Inter-component Communication.",
                    "Improving Context-Awareness in Healthcare Through Distributed Interactions.",
                    "Distributed Tabletops: Study Involving Two RFID Tabletops with Generic Tangible Objects.",
                    "Distributing Interaction in Responsive Cross-Device Applications.",
                    "Towards User-Defined Cross-Device Interaction.",
                    "Optimally Storing the User Interaction in Mashup Interfaces Within a Relational Database.",
                    "Virtual Spatially Aware Shared Displays.",
                    "Flexible Distribution of Existing Web Interfaces: An Architecture Involving Developers and End-Users."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "15. ICWE 2015",
        "info": "Rotterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2015",
                "sub_name": "Engineering the Web in the Big Data Era - 15th International Conference, ICWE 2015, Rotterdam, The Netherlands, June 23-26, 2015, Proceedings.",
                "count": 67,
                "papers": [
                    "Beyond Graph Search: Exploring and Exploiting Rich Connected Data Sets.",
                    "Leveraging Social Patterns in Web Application Design.",
                    "Liquid Stream Processing Across Web Browsers and Web Servers.",
                    "Mixing and Mashing Website Themes.",
                    "Identifying Inter-Component Control Flow in Web Applications.",
                    "Deriving Custom Post Types from Digital Mockups.",
                    "Asqium: A JavaScript Plugin Framework for Extensible Client and Server-Side Components.",
                    "Mobile-IDM: A Design Method for Modeling the New Interaction Style of Mobile Applications.",
                    "Profiling User Activities with Minimal Traffic Traces.",
                    "Towards Liquid Web Applications.",
                    "User Interface Adaptation Using Web Augmentation Techniques: Towards a Negotiated Approach.",
                    "Using Query-Log Based Collective Intelligence to Generate Query Suggestions for Tagged Content Search.",
                    "TV Goes Social: Characterizing User Interaction in an Online Social Network for TV Fans.",
                    "Beomap: Ad Hoc Topic Maps for Enhanced Exploration of Social Media Data.",
                    "CrowdSTAR: A Social Task Routing Framework for Online Communities.",
                    "Transforming Collaboration Structures into Deployable Informal Processes.",
                    "Raimond: Quantitative Data Extraction from Twitter to Describe Events.",
                    "A K-shell Decomposition Based Algorithm for Influence Maximization.",
                    "Keyword Pattern Graph Relaxation for Selective Result Space Expansion on Linked Data.",
                    "Approximate Continuous Query Answering over Streams and Dynamic Linked Data Sets.",
                    "MIRROR: Automatic R2RML Mapping Generation from Relational Databases.",
                    "Using Caching for Local Link Discovery on Large Data Sets.",
                    "YQL as a Platform for Linked-Data Wrapper Development.",
                    "A Quantitative Comparison of Semantic Web Page Segmentation Approaches.",
                    "A Semantic Framework for Sequential Decision Making.",
                    "Generating Semantic Snapshots of Newscasts Using Entity Expansion.",
                    "Adaptive Faceted Search for Product Comparison on the Web of Data.",
                    "SUMMA: A Common API for Linked Data Entity Summaries.",
                    "Two Factor Authentication Made Easy.",
                    "REST Web Service Description for Graph-Based Service Discovery.",
                    "Live, Personal Data Integration Through UI-Oriented Computing.",
                    "Distributed Service Discovery in Mobile IoT Environments Using Hierarchical Bloom Filters.",
                    "A Methodology and Tool Support for Widget-Based Web Application Development.",
                    "Curtains Up! Lights, Camera, Action! Documenting the Creation of Theater and Opera Productions with Linked Data and Web Technologies.",
                    "Getting the Query Right: User Interface Design of Analysis Platforms for Crisis Research.",
                    "Tilt-and-Tap: Framework to Support Motion-Based Web Interaction Techniques.",
                    "Harnessing WebGL and WebSockets for a Web-Based Collaborative Graph Exploration Tool.",
                    "Challenges in Android Wear Application Development.",
                    "Model-Driven Development Based on OMG's IFML with WebRatio Web and Mobile Platform.",
                    "Personal, Social and Event Organization Through Web and Mobile Apps: The Fluxedo Case.",
                    "Interactive Networks for Digital Cultural Heritage Collections - Scoping the Future of HistoGraph.",
                    "A Framework for Business Mashup Applications.",
                    "The Inclusive Enterprise: Vision and Roadmap.",
                    "Fostering Innovation Through Coopetition: The E015 Digital Ecosystem.",
                    "A Distributed Transaction Model for Read-Write Linked Data Applications.",
                    "Secure Storing of E-Health Records in the Cloud.",
                    "Knowledge Crowdsourcing Acceleration.",
                    "Community-Driven Social Influence Analysis and Applications.",
                    "Designing and Developing Context-Aware Mobile Mashups: The CAMUS Approach.",
                    "Release Adolescent Stress by Virtual Chatting.",
                    "Conflict Resolution in Collaborative User Interface Mashups.",
                    "Supporting the Developmentof Team-Climate-Aware Collaborative Web Applications.",
                    "Leveraging Social Data for Health Care Behavior Analytics.",
                    "Collaborative Drawing Annotations on Web Videos.",
                    "Yjs: A Framework for Near Real-Time P2P Shared Editing on Arbitrary Data Types.",
                    "OSMoSys: A Web Interface for Graph-Based RDF Data Visualization and Ontology Browsing.",
                    "Loop Discovery in Publish-Subscribe-Based User Interface Mashups.",
                    "NeLMeS: Finding the Best Based on the People Available Leveraging the Crowd.",
                    "E-WISE: An Expertise-Driven Recommendation Platform for Web Question Answering Systems.",
                    "Detaching Control from Data Models in Model-Based Generation of User Interfaces.",
                    "Graph-Based Methods for Clustering Topics of Interest in Twitter.",
                    "Towards Strategy Patterns for Evaluating Usability.",
                    "Scope-Aware Delegations in Distributed Social Networks.",
                    "Balancing Isolation and Sharing of Data in Third-Party Extensible App Ecosystems.",
                    "An Empirical Study of the Use of Multi-dimensional Contexts for Collaborative-Filtering-Based Service Recommendations in IoT Environments.",
                    "The Web of Data for E-Commerce: Schema.org and GoodRelations for Researchers and Practitioners.",
                    "Enabling the Web of (Linked Open) Data."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2015w",
                "sub_name": "Current Trends in Web Engineering - 15th International Conference, ICWE 2015 Workshops, NLPIT, PEWET, SoWEMine, Rotterdam, The Netherlands, June 23-26, 2015. Revised Selected Papers.",
                "count": 16,
                "papers": [
                    "Constructing Linguistic Resources for the Tunisian Dialect Using Textual User-Generated Contents on the Social Web.",
                    "Spanish Treebank Annotation of Informal Non-standard Web Text.",
                    "Introduction of N-gram into a Run-Length Encoding Based ASCII Art Extraction Method.",
                    "SMT: A Case Study of Kazakh-English Word Alignment.",
                    "Fractally-Organized Connectionist Networks: Conjectures and Preliminary Results.",
                    "Internet-Based Enterprise Innovation Through a Community-Based API Builder to Manage APIs.",
                    "End-User Centered Events Detection and Management in the Internet of Things.",
                    "Proposals for Modular Asynchronous Web Programming: Issues and Challenges.",
                    "Responding to Retrieval: A Proposal to Use Retrieval Information for Better Presentation of Website Content.",
                    "Perspectives and Methods in the Development of Technological Tools for Supporting Future Studies in Science and Technology.",
                    "Sensing Airports' Traffic by Mining Location Sharing Social Services.",
                    "An Approach for Mining Social Patterns in the Conceptual Schema of CMS-Based Web Applications.",
                    "An e-Recruitment System Exploiting Candidates' Social Presence.",
                    "#Nowplaying on #Spotify: Leveraging Spotify Information on Twitter for Artist Recommendations.",
                    "Retrieving Relevant and Interesting Tweets During Live Television Broadcasts.",
                    "Topic Detection in Twitter Using Topology Data Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2015rmc",
                "sub_name": "Rapid Mashup Development Tools - First International Rapid Mashup Challenge, RMC 2015, Rotterdam, The Netherlands, June 23, 2015, Revised Selected Papers.",
                "count": 8,
                "papers": [
                    "ICWE 2015 Rapid Mashup Challenge: Introduction.",
                    "FlexMash - Flexible Data Mashups Based on Pattern-Based Model Transformation.",
                    "Interactive, Live Mashup Development Through UI-Oriented Computing.",
                    "SmartComposition: Extending Web Applications to Multi-screen Mashups.",
                    "EFESTO: A Platform for the End-User Development of Interactive Workspaces for Data Exploration.",
                    "Web Mashups with WebMakeup.",
                    "Mashup Development with Web Liquid Streams.",
                    "Challenge Outcome and Conclusion."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14. ICWE 2014",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2014",
                "sub_name": "Web Engineering, 14th International Conference, ICWE 2014, Toulouse, France, July 1-4, 2014. Proceedings.",
                "count": 52,
                "papers": [
                    "A Platform for Web Augmentation Requirements Specification.",
                    "An Empirical Study on Categorizing User Input Parameters for User Inputs Reuse.",
                    "Analysis and Evaluation of Web Application Performance Enhancement Techniques.",
                    "CRAWL·E: Distributed Skill Endorsements in Expert Finding.",
                    "Cross Publishing 2.0: Letting Users Define Their Sharing Practices on Top of YQL.",
                    "Ensuring Web Interface Quality through Usability-Based Split Testing.",
                    "Evaluating Mobileapp Usability: A Holistic Quality Approach.",
                    "Finding Implicit Features in Consumer Reviews for Sentiment Analysis.",
                    "From Choreographed to Hybrid User Interface Mashups: A Generic Transformation Approach.",
                    "Identifying Patterns in Eyetracking Scanpaths in Terms of Visual Elements of Web Pages.",
                    "Identifying Root Causes of Web Performance Degradation Using Changepoint Analysis.",
                    "Indexing Rich Internet Applications Using Components-Based Crawling.",
                    "Pattern-Based Specification of Crowdsourcing Applications.",
                    "SmartComposition: A Component-Based Approach for Creating Multi-screen Mashups.",
                    "SSUP - A URL-Based Method to Entity-Page Discovery.",
                    "StreamMyRelevance!",
                    "The Forgotten Many? A Survey of Modern Web Development Practices.",
                    "Using Path-Dependent Types to Build Type Safe JavaScript Foreign Function Interfaces.",
                    "Visual vs. DOM-Based Web Locators: An Empirical Study.",
                    "Widget Classification with Applications to Web Accessibility.",
                    "(De-)Composing Web Augmenters.",
                    "An Exploratory Study on the Relation between User Interface Complexity and the Perceived Quality.",
                    "Beyond Responsive Design: Adaptation to Touch and Multitouch.",
                    "Composing JSON-Based Web APIs.",
                    "Design Criteria for Web Applications Adapted to Emotions.",
                    "Driving Global Team Formation in Social Networks to Obtain Diversity.",
                    "Effectiveness of Incorporating Follow Relation into Searching for Twitter Users to Follow.",
                    "Improving the Scalability of Web Applications with Runtime Transformations.",
                    "Multi Matchmaking Approach for Semantic Web Services Selection Based on Fuzzy Inference.",
                    "Semantic Mediation Techniques for Composite Web Applications.",
                    "Standard-Based Integration of W3C and GeoSpatial Services: Quality Challenges.",
                    "Tamper-Evident User Profiles for WebID-Based Social Networks.",
                    "X-Themes: Supporting Design-by-Example.",
                    "A Tool for Detecting Bad Usability Smells in an Automatic Way.",
                    "An Extensible, Model-Driven and End-User Centric Approach for API Building.",
                    "Building Bridges between Diverse Identity Concepts Using WebID.",
                    "Cross-Browser Testing in Browserbite.",
                    "DireWolf Goes Pack Hunting: A Peer-to-Peer Approach for Secure Low Latency Widget Distribution Using WebRTC.",
                    "Easing Access for Novice Users in Multi-screen Mashups by Rule-Based Adaption.",
                    "Interactive Scalable Lectures with ASQ.",
                    "LiquidML: A Model Based Environment for Developing High Scalable Web Applications.",
                    "Managing and Monitoring Elastic Cloud Applications.",
                    "MAPMOLTY: A Web Tool for Discovering Place Loyalty Based on Mobile Crowdsource Data.",
                    "Paving the Path to Content-Centric and Device-Agnostic Web Design.",
                    "Twiagle: A Tool for Engineering Applications Based on Instant Messaging over Twitter.",
                    "Using Linked Data for Modeling Secure Distributed Web Applications and Services.",
                    "WaPPU: Usability-Based A/B Testing.",
                    "Webification of Software Development: User Feedback for Developer's Modeling.",
                    "Comparing Methods of Trend Assessment.",
                    "Exploiting Different Bioinformatics Resources for Enhancing Content Recommendations.",
                    "Methodologies for the Development of Crowd and Social-Based Applications.",
                    "Using Semantic Techniques to Improve Service Composition by End Users."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2014dui",
                "sub_name": "Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction, DUI@ICWE 2014, Toulouse, France, July 1, 2014.",
                "count": 12,
                "papers": [
                    "Distributing User Interfaces.",
                    "Towards User-Centered Distributed Mashups.",
                    "Interacting with Tangible Objects in Distributed Settings.",
                    "User-aware Distributed User Interface for Tiled-display Environments.",
                    "Context-sensitive and Collaborative application for Distributed User Interfaces on tabletops.",
                    "Fault-Tolerant User Interfaces for Critical Systems: Duplication, Redundancy and Diversity as New Dimensions of Distributed User Interfaces.",
                    "Improving Surgery Operations by means of Cloud Systems and Distributed User Interfaces.",
                    "12 + 1 Questions in the Design of Distributed User Interfaces.",
                    "Performance Evaluation of Proxywork.",
                    "Real Time Public Transport Location and Time Services for mobile users.",
                    "Interaction Modality Mapping Service for devices in a P2P network.",
                    "Non-Functional Requirements for Distributable User Interfaces in Agile Processes."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13. ICWE 2013",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2013",
                "sub_name": "Web Engineering - 13th International Conference, ICWE 2013, Aalborg, Denmark, July 8-12, 2013. Proceedings.",
                "count": 51,
                "papers": [
                    "Erratum: Heuristic Role Detection of Visual Elements of Web Pages.",
                    "Challenges in Service Mining: Record, Check, Discover.",
                    "How to Share Data Securely.",
                    "An Internet of Custom-Made Things: From 3D Printing and Personal Fabrication to Personal Design of Interactive Devices.",
                    "MockAPI: An Agile Approach Supporting API-first Web Application Development.",
                    "Semantic Data Driven Interfaces for Web Applications.",
                    "Integrating Component-Based Web Engineering into Content Management Systems.",
                    "Hidden-Web Induced by Client-Side Scripting: An Empirical Study.",
                    "Discovering Implicit Schemas in JSON Data.",
                    "The SWAC Approach for Sharing a Web Application's Codebase Between Server and Client.",
                    "DireWolf - Distributing and Migrating User Interfaces for Widget-Based Web Applications.",
                    "Awareness and Control for Inter-Widget Communication: Challenges and Solutions.",
                    "Heuristic Role Detection of Visual Elements of Web Pages.",
                    "Performance-Aware Design of Web Application Front-Ends.",
                    "CapView - Functionality-Aware Visual Mashup Development for Non-programmers.",
                    "Social Spreadsheet.",
                    "User-Driven Automation of Web Form Filling.",
                    "Generating Feature Usage Scenarios in Client-Side Web Applications.",
                    "Supporting Customized Views for Enforcing Access Control Constraints in Real-Time Collaborative Web Applications.",
                    "Towards Simulation-Based Similarity of End User Browsing Processes.",
                    "A Domain Specific Language for Orchestrating User Tasks Whilst Navigation Web Sites.",
                    "Tag Cloud Generation for Results of Multiple Keywords Queries.",
                    "Summaries on the Fly: Query-Based Extraction of Structured Knowledge from Web Documents.",
                    "Mining Taxonomies from Web Menus: Rule-Based Concepts and Algorithms.",
                    "Evaluation of Personalized Social Ranking Functions of Information Retrieval.",
                    "Building Rich Internet Applications Models: Example of a Better Strategy.",
                    "Intelligent and Adaptive Crawling of Web Applications for Web Archiving.",
                    "Enhancing Web Revisitation by Contextual Keywords.",
                    "A Linear and Monotonic Strategy to Keyword Search over RDF Data.",
                    "Identifying Candidate Datasets for Data Interlinking.",
                    "Discovering Links between Political Debates and Media.",
                    "Assisting User Browsing over Linked Data: Requirements Elicitation with a User Study.",
                    "A Framework for Migrating Web Applications to Web Services.",
                    "Automatic Refinement of Service Compositions.",
                    "A Generative Approach for the Adaptive Monitoring of SLA in Service Choreographies.",
                    "Detecting Occasional Reputation Attacks on Cloud Services.",
                    "Multi-tenancy Performance Benchmark for Web Application Platforms.",
                    "Agile Software Development with Open Source Software in a Hospital Environment - Case Study of an eCRF-System for Orthopaedical Studies.",
                    "USTO.RE: A Private Cloud Storage Software System.",
                    "Market Intelligence: Linked Data-driven Entity Resolution for Customer and Competitor Analysis.",
                    "GAwI: A Comprehensive Workspace Awareness Library for Collaborative Web Applications.",
                    "On Weighted Hybrid Track Recommendations.",
                    "A Hybrid B2B App Recommender System.",
                    "PEUDOM: A Mashup Platform for the End User Development of Common Information Spaces.",
                    "Customized Views on Profiles in WebID-Based Distributed Social Networks.",
                    "Inter-Widget Communication by Demonstration in User Interface Mashups.",
                    "A Linked Data Perspective for Effective Exploration of Web APIs Repositories.",
                    "Responsive Design and Development: Methods, Technologies and Current Issues.",
                    "An Introduction to Human Computation and Games with a Purpose.",
                    "Current Challenges in Web Crawling.",
                    "Enterprise Application Integration - The Cloud Perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2013w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2013 International Workshops ComposableWeb, QWE, MDWE, DMSSW, EMotions, CSE, SSN, and PhD Symposium, Aalborg, Denmark, July 8-12, 2013. Revised Selected Papers.",
                "count": 35,
                "papers": [
                    "Tasks Model Composition: Beyond Data, Representing User Activities.",
                    "The Interactive API (iAPI).",
                    "Semantic-Guided Communication and Composition in a Widget/Dashboard Environment.",
                    "MultiMasher: A Visual Tool for Multi-device Mashups.",
                    "From a Simple Flow to Social Applications.",
                    "Media Enrichment on Distributed Displays by Selective Information Presentation: A First Prototype.",
                    "Modeling and Utilizing Quality Properties in the Development of Composite Web Mashups.",
                    "Quality of Web Mashups: A Systematic Mapping Study.",
                    "Toward an Integrated Quality Evaluation of Web Applications with DEVS.",
                    "Assessing Corporate Web Sites: Quality Model and Methodology.",
                    "Enhancing the Conceptual Framework Capability for a Measurement and Evaluation Strategy.",
                    "Weaving Aspect-Orientation into Web Modeling Languages.",
                    "Model-Driven Generation of a REST API from a Legacy Web Application.",
                    "Towards an Access-Control Metamodel for Web Content Management Systems.",
                    "A Model-Based Approach for Supporting Offline Interaction with Web Sites Resilient to Interruptions.",
                    "A Method for Integrating Process Description and User Interface Use during Design of RIA Applications.",
                    "Recommendation of Text Tags in Social Applications Using Linked Data.",
                    "Query Answering in Datalog+/- Ontologies under Group Preferences and Probabilistic Uncertainty.",
                    "Towards an Integrated Social Semantic Web.",
                    "Recommending Experts for Collaboration in Mashup Development.",
                    "Crowdsourcing Mobile Web Applications.",
                    "Vision Based Page Segmentation Algorithm: Extended and Perceived Success.",
                    "Relating User Experience with MobileApp Quality Evaluation and Design.",
                    "Protecting User Profile Data in WebID-Based Social Networks Through Fine-Grained Filtering.",
                    "Building an Efficient Hadoop Workflow Engine Using BPEL.",
                    "Taldea: A Tool for Fostering Spontaneous Communities.",
                    "Identifying User Interests from Online Social Networks by Using Semantic Clusters Generated from Linked Data.",
                    "Supporting Offline Interaction with Web Sites Resilient to Interruptions Applied to E-learning Environments.",
                    "Toward Efficient Semantic Annotation: A Semantic Cloud Generation Scheme from Linked Data.",
                    "A Web-Based Approach for Designing and DeployingFlexible Learning Tools.",
                    "MockupDD: Facilitating Agile Support for Model-Driven Web Engineering.",
                    "Tag and Word Clouds as Means of Navigation Support in Social Systems.",
                    "Was That Webpage Pleasant to Use? Predicting Usability Quantitatively from Interactions.",
                    "A Modelling Based Notation for the Automated Extraction and Analysis of Social Networking Data.",
                    "Understanding Eye Tracking Data for Re-engineering Web Pages."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12. ICWE 2012",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2012",
                "sub_name": "Web Engineering - 12th International Conference, ICWE 2012, Berlin, Germany, July 23-27, 2012. Proceedings.",
                "count": 58,
                "papers": [
                    "Reusable Awareness Widgets for Collaborative Web Applications - A Non-invasive Approach.",
                    "News-Topic Oriented Hashtag Recommendation in Twitter Based on Characteristic Co-occurrence Word Detection.",
                    "Crowdsourced Web Engineering and Design.",
                    "Scaling Pair-Wise Similarity-Based Algorithms in Tagging Spaces.",
                    "Methodologies for Improved Tag Cloud Generation with Clustering.",
                    "Semantic Collaborative Tagging for Web APIs Sharing and Reuse.",
                    "Opening Personalization to Partners: An Architecture of Participation for Websites.",
                    "Role-Based Access Control for Model-Driven Web Applications.",
                    "Recovering Role-Based Access Control Security Models from Dynamic Web Applications.",
                    "Diversification for Multi-domain Result Sets.",
                    "Twinder: A Search Engine for Twitter Streams.",
                    "Social Event Detection on Twitter.",
                    "Temporal Semantic Centrality for the Analysis of Communication Networks.",
                    "Systematic Evolution of WebML Models by Coupled Transformations.",
                    "From Requirements to Web Applications in an Agile Model-Driven Approach.",
                    "Assessment of Effort Reduction due to Model-to-Model Transformations in the Web Domain.",
                    "Evaluating the Impact of a Model-Driven Web Engineering Approach on the Productivity and the Satisfaction of Software Development Teams.",
                    "JSART: JavaScript Assertion-Based Regression Testing.",
                    "A Framework for the Development of Haptic-Enhanced Web Applications.",
                    "Supporting Users Tasks with Personal Information Management and Web Forms Augmentation.",
                    "Model-Based Service Discovery and Orchestration for OSLC Services in Tool Chains.",
                    "On the Systematic Development of Domain-Specific Mashup Tools for End Users.",
                    "Adding Non-functional Preferences to Service Discovery.",
                    "A Semantic Scoring Approach for Service Offers.",
                    "Rich Communication Patterns for Mashups.",
                    "Supporting View Transition Design of Smartphone Applications Using Web Templates.",
                    "Turn the Page: Automated Traversal of Paginated Websites.",
                    "WebSelF: A Web Scraping Framework.",
                    "A Statistical Approach for Efficient Crawling of Rich Internet Applications.",
                    "Recording and Replaying Navigations on AJAX Web Sites.",
                    "Leveraging User Modeling on the Social Web with Linked Data.",
                    "ViP2P: Efficient XML Management in DHT Networks.",
                    "Online Change Estimation Models for Dynamic Web Resources - A Case-Study of RSS Feed Refresh Strategies.",
                    "Active Learning of Expressive Linkage Rules for the Web of Data.",
                    "Extracting Navigational Models from Struts-Based Web Applications.",
                    "Towards a Method for Unsupervised Web Information Extraction.",
                    "Web-Based Tool Integration: A Web Augmentation Approach.",
                    "Clustering Visually Similar Web Page Elements for Structured Web Data Extraction.",
                    "Improving Toponym Extraction and Disambiguation Using Feedback Loop.",
                    "GeForMTjs: A JavaScript Library Based on a Domain Specific Language for Multi-touch Gestures.",
                    "SemaKoDE: Hybrid System for Knowledge Discovery in Sensor-Based Smart Environments.",
                    "WebREd: A Model-Driven Tool for Web Requirements Specification and Optimization.",
                    "Answering Fuzzy Preference Queries over Data Web Services.",
                    "UsiWSC: Framework for Supporting an Interactive Web Service Composition.",
                    "Sticklet: An End-User Client-Side Augmentation-Based Mashup Tool.",
                    "NDT-Suite: A Model-Based Suite for the Application of NDT.",
                    "Enriching Web Applications with Collaboration Support Using Dependency Injection.",
                    "XFormsDB: A Declarative Web Application Framework.",
                    "A Framework for Service Discovery Based on Structural Similarity and Quality Satisfaction.",
                    "WebTribe: Dynamic Community Analysis from Online Forums.",
                    "MIGROS: A Model-Driven Transformation Approach of the User Experience of Legacy Applications.",
                    "Crowdsourced Web Site Evaluation with CrowdStudy.",
                    "Web Service Composition Reuse through Shared Process Fragment Libraries.",
                    "Engineering the Evaluation Approach to Fit Different Web Project and Organization Needs.",
                    "Epidemic Intelligence: For the Crowd, by the Crowd.",
                    "An Introduction to SPARQL and Queries over Linked Data.",
                    "Natural Language Processing for the Web.",
                    "The Web of Data for E-Commerce in Brief."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2012w",
                "sub_name": "Current Trends in Web Engineering - ICWE 2012 International Workshops: MDWE, ComposableWeb, WeRE, QWE, and Doctoral Consortium, Berlin, Germany, July 23-27, 2012, Revised Selected Papers.",
                "count": 26,
                "papers": [
                    "An Agile Model-Based Framework for Service Innovation for the Future Internet.",
                    "Web Engineering for Cloud Computing - (Web Engineering Forecast: Cloudy with a Chance of Opportunities).",
                    "Developing Semantic Rich Internet Applications with the Sm4RIA Extension for OIDE.",
                    "A Model-Based Approach for Supporting Aspect-Oriented Development of Personal Information Management Systems.",
                    "Model-Driven Development of Social Network Enabled Applications with WebML and Social Primitives.",
                    "Model Driven Extraction of the Navigational Concern of Legacy Web Applications.",
                    "Model-Driven Testing for Web Applications Using Abstract State Machines.",
                    "Understanding Web Augmentation.",
                    "UML2 Profile and Model-Driven Approach for Supporting System Integration and Adaptation of Web Data Mashups.",
                    "Extending Web Standards-Based Widgets towards Inter-Widget Communication.",
                    "A Mashup Construction Approach for Cooperation of Mobile Devices.",
                    "EnglishMash: Usability Design for a Natural Mashup Composition Environment.",
                    "visualRSS: A Platform to Mine and Visualise Social Data from RSS Feeds.",
                    "Extracting Models from Web API Documentation.",
                    "Identifying and Modelling Complex Workflow Requirements in Web Applications.",
                    "Requirements Models as First Class Entities in Model-Driven Web Engineering.",
                    "How the Web of Things Challenges Requirements Engineering.",
                    "Automatic Test Case Generation from Functional Requirements in NDT.",
                    "Reasoning about Knowledge from the Web - (Extended Abstract).",
                    "Toward the Improvement of a Measurement and Evaluation Strategy from a Comparative Study.",
                    "Evaluation and Comparison of Three Open Courseware Based on Quality Criteria.",
                    "Maintenance of Human and Machine Metadata over the Web Content.",
                    "End-User-Development and Evolution of Web Applications: The WebComposition EUD Approach.",
                    "A Description-Based Mashup for Cooperation of Mobile Devices.",
                    "Model Based Simulation and Evaluation of Mobile and Web 2.0 Applications for Users with Special Needs.",
                    "Decision Support for Off-the-Shelf Software Selection in Web Development Projects."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11. ICWE 2011",
        "info": "Paphos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2011",
                "sub_name": "Web Engineering - 11th International Conference, ICWE 2011, Paphos, Cyprus, June 20-24, 2011.",
                "count": 39,
                "papers": [
                    "The Anatomy of a Multi-domain Search Infrastructure.",
                    "How the Minotaur Turned into Ariadne: Ontologies in Web Data Extraction.",
                    "Analyzing Cross-System User Modeling on the Social Web.",
                    "Parallel Data Access for Multiway Rank Joins.",
                    "Assessing Fault Occurrence Likelihood for Service-Oriented Systems.",
                    "A Strategy for Efficient Crawling of Rich Internet Applications.",
                    "Graph-Based Search over Web Application Model Repositories.",
                    "AdapForms: A Framework for Creating and Validating Adaptive Forms.",
                    "Design and Implementation of Linked Data Applications Using SHDM and Synth.",
                    "A Quality Model for Mashups.",
                    "DashMash: A Mashup Environment for End User Development.",
                    "Learning Semantic Relationships between Entities in Twitter.",
                    "Mobile Mashup Generator System for Cooperative Applications of Different Mobile Devices.",
                    "A Framework for Concern-Sensitive, Client-Side Adaptation.",
                    "Instantiating Web Quality Models in a Purposeful Way.",
                    "Reusing Web Application User-Interface Controls.",
                    "Tools and Architectural Support for Crowdsourced Adaptation of Web Interfaces.",
                    "A Layered Approach to Revisitation Prediction.",
                    "Improving the Exploration of Tag Spaces Using Automated Tag Clustering.",
                    "A Semantic Web Annotation Tool for a Web-Based Audio Sequencer.",
                    "CloudFuice: A Flexible Cloud-Based Data Integration System.",
                    "Bootstrapping Trust of Web Services through Behavior Observation.",
                    "Parallel Distributed Rendering of HTML5 Canvas Elements.",
                    "Formal Modeling of RESTful Systems Using Finite-State Machines.",
                    "Knowledge Spaces.",
                    "Exploratory Multi-domain Search on Web Data Sources with Liquid Queries.",
                    "Model-Based Dynamic and Adaptive Visualization for Multi-domain Search Results.",
                    "A Constraint Programming Approach to Automatic Layout Definition for Search Results.",
                    "Adaptive Mobile Web Applications: A Quantitative Evaluation Approach.",
                    "A Personality Mining System for Automated Applicant Ranking in Online Recruitment Systems.",
                    "Development of the Evaluation Form for Expert Inspections of Web Portals.",
                    "WebSoDa: A Tailored Data Binding Framework for Web Programmers Leveraging the WebSocket Protocol and HTML5 Microdata.",
                    "Towards User-Centric Cross-Site Personalisation.",
                    "Tool Support for a Hybrid Development Methodology of Service-Based Interactive Applications.",
                    "A Comparative Evaluation of JavaScript Execution Behavior.",
                    "Designing a Step-by-Step User Interface for Finding Provenance Information over Linked Data.",
                    "Towards Behaviorally Enriched Semantic RESTful Interfaces Using OWL2.",
                    "Taxonomy for Rich-User-Interface Components: Towards a Systematic Development of RIAs.",
                    "NAVTAG - A Network-Theoretic Framework to Assess and Improve the Navigability of Tagging Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2011w",
                "sub_name": "Current Trends in Web Engineering - Workshops, Doctoral Symposium, and Tutorials, Held at ICWE 2011, Paphos, Cyprus, June 20-21, 2011. Revised Selected Papers.",
                "count": 42,
                "papers": [
                    "An Evaluation of Mashup Tools Based on Support for Heterogeneous Mashup Components.",
                    "An Approach to Construct Dynamic Service Mashups Using Lightweight Semantics.",
                    "Task-Based Recommendation of Mashup Components.",
                    "Integration of Telco Services into Enterprise Mashup Applications.",
                    "Orchestrated User Interface Mashups Using W3C Widgets.",
                    "Cross-Domain Embedding for Vaadin Applications.",
                    "Web Linking-Based Protocols for Guiding RESTful M2M Interaction.",
                    "Batched Transactions for RESTful Web Services.",
                    "Secure Mashup-Providing Platforms - Implementing Encrypted Wiring.",
                    "A Conceptual Framework for Linked Data Exploration.",
                    "Support for Reusable Explorations of Linked Data in the Semantic Web.",
                    "Generation of Semantic Clouds Based on Linked Data for Efficient Multimedia Semantic Annotation.",
                    "Ontology Based Segmentation of Geo-Referenced Queries.",
                    "SimSpectrum: A Similarity Based Spectral Clustering Approach to Generate a Tag Cloud.",
                    "Graph Access Pattern Diagrams (GAP-D): Towards a Unified Approach for Modeling Navigation over Hierarchical, Linear and Networked Structures.",
                    "Data-Driven and User-Driven Multidimensional Data Visualization.",
                    "Context-Aware and Adaptive Web Interfaces: A Crowdsourcing Approach.",
                    "Massive Multiplayer Human Computation for Fun, Money, and Survival.",
                    "Enterprise Crowdsourcing Solution for Software Development in an Outsourcing Organization.",
                    "A Model-Driven Framework for Developing Web Service Oriented Applications.",
                    "Developing Enterprise Web Applications Using the Story Driven Modeling Approach.",
                    "Aspect-Oriented Modeling of Web Applications with HiLA.",
                    "Model-Driven Web Form Validation with UML and OCL.",
                    "Modernization of Legacy Web Applications into Rich Internet Applications.",
                    "Quality Models for Web [2.0] Sites: A Methodological Approach and a Proposal.",
                    "Exploring the Quality in Use of Web 2.0 Applications: The Case of Mind Mapping Services.",
                    "Detecting Conflicts and Inconsistencies in Web Application Requirements.",
                    "Streamlining Complexity: Conceptual Page Re-modeling for Rich Internet Applications.",
                    "A Flexible Graph-Based Data Model Supporting Incremental Schema Design and Evolution.",
                    "ProLD: Propagate Linked Data.",
                    "Causal Relation Detection for Activities from Heterogeneous Sources.",
                    "XML Document Versioning, Revalidation and Constraints.",
                    "A Reuse-Oriented Product-Line Method for Enterprise Web Applications.",
                    "A Flexible Architecture for Client-Side Adaptation.",
                    "Applications of Mobile Application Interface Description Language MAIDL.",
                    "A Domain-Specific Language for Do-It-Yourself Analytical Mashups.",
                    "Information Extraction from Web Pages Based on Their Visual Representation.",
                    "End-User Programming for Web Mashups - Open Research Challenges.",
                    "Multi-dimensional Context-Aware Adaptation for Web Applications.",
                    "Engineering the Personal Social Semantic Web.",
                    "Automating the Use of Web APIs through Lightweight Semantics.",
                    "Improving Quality in Use of Web Applications in a Systematic Way."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10. ICWE 2010",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2010",
                "sub_name": "Web Engineering, 10th International Conference, ICWE 2010, Vienna, Austria, July 5-9, 2010. Proceedings.",
                "count": 45,
                "papers": [
                    "Searching Repositories of Web Application Models.",
                    "Toward Approximate GML Retrieval Based on Structural and Semantic Characteristics.",
                    "Advancing Search Query Autocompletion Services with More and Better Suggestions.",
                    "Designing Service Marts for Engineering Search Computing Applications.",
                    "Engineering Autonomic Controllers for Virtualized Web Applications.",
                    "AWAIT: Efficient Overload Management for Busy Multi-tier Web Services under Bursty Workloads.",
                    "Normative Management of Web Service Level Agreements.",
                    "Combining Schema and Level-Based Matching for Web Service Discovery.",
                    "Web Messaging for Open and Scalable Distributed Sensing Applications.",
                    "On Actors and the REST.",
                    "Multi-level Tests for Model Driven Web Applications.",
                    "Capture and Evolution of Web Requirements Using WebSpec.",
                    "Re-engineering Legacy Web Applications into Rich Internet Applications.",
                    "Deriving Vocal Interfaces from Logical Descriptions in Multi-device Authoring Environments.",
                    "Quality, Quality in Use, Actual Usability and User Experience as Key Drivers for Web Application Evaluation.",
                    "Interfaces for Scripting: Making Greasemonkey Scripts Resilient to Website Upgrades.",
                    "Context-Aware Interaction Approach to Handle Users Local Contexts in Web 2.0.",
                    "Rethinking Microblogging: Open, Distributed, Semantic.",
                    "A Web-Based Collaborative Metamodeling Environment with Secure Remote Model Access.",
                    "Carbon: Domain-Independent Automatic Web Form Filling.",
                    "Scalable and Mashable Location-Oriented Web Services.",
                    "A Flexible Rule-Based Method for Interlinking, Integrating, and Enriching User Data.",
                    "Ranking the Linked Data: The Case of DBpedia.",
                    "Linkator: Enriching Web Pages by Automatically Adding Dereferenceable Semantic Annotations.",
                    "A Generic Proxy for Secure Smart Card-Enabled Web Applications.",
                    "Efficient Term Cloud Generation for Streaming Web Content.",
                    "Experiences in Building a RESTful Mixed Reality Web Service Platform.",
                    "WebRatio BPM: A Tool for Designing and Deploying Business Processes on the Web.",
                    "A Visual Tool for Rapid Integration of Enterprise Software Applications.",
                    "Customization Realization in Multi-tenant Web Applications: Case Studies from the Library Sector.",
                    "Challenges and Experiences in Deploying Enterprise Crowdsourcing Service.",
                    "Business Conversation Manager: Facilitating People Interactions in Outsourcing Service Engagements.",
                    "Tools for Modeling and Generating Safe Interface Interactions in Web Applications.",
                    "Linking Related Documents: Combining Tag Clouds and Search Queries.",
                    "GAmera: A Tool for WS-BPEL Composition Testing Using Mutation Analysis.",
                    "Open, Distributed and Semantic Microblogging with SMOB.",
                    "The ServFace Builder - A WYSIWYG Approach for Building Service-Based Applications.",
                    "Extracting Client-Side Web User Interface Controls.",
                    "Applying Semantic Web Technology in a Mobile Setting: The Person Matcher.",
                    "Syncro - Concurrent Editing Library for Google Wave.",
                    "An Eclipse Plug-in for Model-Driven Development of Rich Internet Applications.",
                    "A Cross-Platform Software System to Create and Deploy Mobile Mashups.",
                    "A Blog-Centered IPTV Environment for Enhancing Contents Provision, Consumption, and Evolution.",
                    "Factic: Personalized Exploratory Search in the Semantic Web.",
                    "Takuan: A Tool for WS-BPEL Composition Testing Using Dynamic Invariant Generation."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2010w",
                "sub_name": "Current Trends in Web Engineering - 10th International Conference on Web Engineering, ICWE 2010 Workshops, Vienna, Austria, July 2010, Revised Selected Papers.",
                "count": 60,
                "papers": [
                    "Rapid Development of Composite Applications Using Annotated Web Services.",
                    "From Mockups to User Interface Models: An Extensible Model Driven Approach.",
                    "Model-Driven Web Engineering Performance Prediction with Layered Queue Networks.",
                    "Models and Meta Models for Transactions in Web Applications.",
                    "Using Actions Charts for Reactive Web Application Modeling.",
                    "Modeling Search Computing Applications.",
                    "Developing Security Assessment Models in Web2 Mobile Environments.",
                    "Association-Rules-Based Recommender System for Personalization in Adaptive Web-Based Applications.",
                    "Quality in Use Model for Web Portals (QiUWeP).",
                    "Towards Support Processes for Web Projects.",
                    "Reliability Verification of Search Engines' Hit Counts: How to Select a Reliable Hit Count for a Query.",
                    "Selecting Materialized Views for RDF Data.",
                    "Semantic Wonder Cloud: Exploratory Search in DBpedia.",
                    "Managing Adaptivity in Web Collaborative Processes Using Policies and User Profiles.",
                    "Transformation of the Common Information Model to OWL.",
                    "Improving Web Search Results for Homonyms by Suggesting Completions from an Ontology.",
                    "How to Modify on the Semantic Web? - A Web Application Architecture for Algebraic Graph Transformations on RDF.",
                    "T2.O.M. T.O.M.: Techniques and Technologies for an Ontology-Based Mobility Tool with Open Maps.",
                    "An Approach to Semantic Information Retrieval Based on Natural Language Query Understanding.",
                    "Slicing Linked Data by Extracting Significant, Self-describing Subsets: The DBpedia Case.",
                    "Automatically Identifying Bounds on Semantic Annotations for Bioinformatics Web Service Input Parameters.",
                    "REST Inspired Code Partitioning with a JavaScript Middleware.",
                    "The SOA Paradigm and e-Service Architecture Reconsidered from the e-Business Perspective.",
                    "Semantic Annotation of RESTful Services Using External Resources.",
                    "Analyzing Compliance of Service-Based Business Processes for Root-Cause Analysis and Prediction.",
                    "Trade-off between Complexity of Structured Tagging and Effectiveness of Web Service Retrieval.",
                    "Aspect-Oriented Checkpointing Approach of Composed Web Services.",
                    "A Runtime Performance Analysis for Web Service-Based Applications.",
                    "Business Process Compliance through Reusable Units of Compliant Processes.",
                    "An Approach to Enable Replacement of SOAP Services and REST Services in Lightweight Processes.",
                    "Context, Quality and Relevance: Dependencies and Impacts on RESTful Web Services Design.",
                    "Quality-Based Recommendations for Mashup Composition.",
                    "Partial Information Extraction Approach to Lightweight Integration on the Web.",
                    "Domain-Specific Mashups: From All to All You Need.",
                    "Conceptual and Usability Issues in the Composable Web of Software Services.",
                    "Crowdsourcing in the Document Processing Practice - (A Short Practitioner/Visionary Paper).",
                    "Definition of a Crowdsourcing Innovation Service for the European SMEs.",
                    "Script Programmers as Value Co-creators.",
                    "Quality Assurance for Human-Based Electronic Services: A Decision Matrix for Choosing the Right Approach.",
                    "Collaborative Workforce, Business Process Crowdsourcing as an Alternative of BPO.",
                    "Connecting Smart Things through Web Services Orchestrations.",
                    "Mashing Up Your Web-Enabled Home.",
                    "A Triple Space-Based Semantic Distributed Middleware for Internet of Things.",
                    "Touch-Based Services' Catalogs for AAL.",
                    "Designing Context-Aware Interactions for Task-Based Applications.",
                    "Tourist Trip Planning Functionalities: State-of-the-Art and Future.",
                    "Personalized Tourist Route Generation.",
                    "Automated Generation of Itineraries in Recommender Systems for Tourism.",
                    "A Method for Assessing Website Communicative Efficacy Using a Semantic Annotation Tool.",
                    "A Process Framework for Semantics-Aware Tourism Information Systems.",
                    "Use of Hypermedia Tools for End-User Development.",
                    "A Document-Centric Approach to Open Collaboration Processes.",
                    "Description-Based Mashup of Web Applications.",
                    "iSemServ: Towards the Engineering of Intelligent Semantic-Based Services.",
                    "Sustaining High-Availability and Quality of Web Services.",
                    "Client-Side Adaptation: An Approach Based in Reutilization Using Transversal Models.",
                    "QuEF (Quality Evaluation Framework) for Model-Driven Web Methodologies.",
                    "Consistent Cache Maintenance for Database Driven Websites.",
                    "Improvements of Webometrics by Using Sentiment Analysis for Better Accessibility of the Web.",
                    "Social Interaction with Cultural Heritage on the Web."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9. ICWE 2009",
        "info": "San Sebastián, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2009",
                "sub_name": "Web Engineering, 9th International Conference, ICWE 2009, San Sebastián, Spain, June 24-26, 2009, Proceedings.",
                "count": 55,
                "papers": [
                    "Fine-Grained Analysis of Web Tasks through Data Visualization.",
                    "Exploring Automatic CSS Accessibility Evaluation.",
                    "A Component-Based Approach for Engineering Enterprise Mashups.",
                    "Turning Web Applications into Mashup Components: Issues, Models, and Solutions.",
                    "Tagging-Aware Portlets.",
                    "Trust and Reputation Mining in Professional Virtual Communities.",
                    "A Structured Approach to Data Reverse Engineering of Web Applications.",
                    "Harnessing the Power of Semantics-Based, Aspect-Oriented Adaptation for amacont.",
                    "Model-Driven Web Engineering for the Automated Configuration of Web Content Management Systems.",
                    "Bridging Test and Model-Driven Approaches in Web Engineering.",
                    "A Requirement Analysis Approach for Using i* in Web Engineering.",
                    "Automating Navigation Sequences in AJAX Websites.",
                    "Modelling and Verification of Web Navigation.",
                    "Context-Driven Hypertext Specification.",
                    "Feature-Based Engineering of Compensations in Web Service Environment.",
                    "Product Line Development of Web Systems with Conventional Tools.",
                    "An Empirical Study on the Use of Web-COBRA and Web Objects to Estimate Web Application Development Effort.",
                    "An Extensible Monitoring Framework for Measuring and Evaluating Tool Performance in a Service-Oriented Architecture.",
                    "A Quality Model for Mashup Components.",
                    "Towards the Discovery of Data Quality Attributes for Web Portals.",
                    "Script InSight: Using Models to Explore JavaScript Code from the Browser View.",
                    "A Conceptual Framework for User Input Evaluation in Rich Internet Applications.",
                    "Patterns for the Model-Based Development of RIAs.",
                    "Adapting the Presentation Layer in Rich Internet Applications.",
                    "Web Site Metadata.",
                    "Conceptual Modeling of Multimedia Search Applications Using Rich Process Models.",
                    "Zero-Effort Search and Integration Model for Augmented Web Applications.",
                    "A Higher Order Generative Framework for Weaving Traceability Links into a Code Generator for Web Application Testing.",
                    "Exploring XML Perturbation Techniques for Web Services Testing.",
                    "Facilitating Controlled Tests of Website Design Changes: A Systematic Approach.",
                    "SOAF - Design and Implementation of a Service-Enriched Social Network.",
                    "RESTful Transactions Supported by the Isolation Theorems.",
                    "An Optimization Rule for ActiveXML Workflows.",
                    "Personal News RSS Feeds Generation Using Existing News Feeds.",
                    "A Tag Clustering Method to Deal with Syntactic Variations on Collaborative Social Networks.",
                    "Relating RSS News/Items.",
                    "A Layout-Independent Web News Article Contents Extraction Method Based on Relevance Analysis.",
                    "HyperAdapt: Enabling Aspects for XML.",
                    "Developing an Enterprise Web Application in XQuery.",
                    "Enhancing WS-BPEL Dynamic Invariant Generation Using XML Schema and XPath Information.",
                    "CRUISe: Composition of Rich User Interface Services.",
                    "An Online Platform for Semantic Validation of UML Models.",
                    "Efficient Building of Interactive Applications Guided by Requirements Models.",
                    "WAB*: A Quantitative Metric Based on WAB.",
                    "A Web-Based Mashup Tool for Information Integration and Delivery to Mobile Devices.",
                    "UWE4JSF: A Model-Driven Generation Approach for Web Applications.",
                    "On Using Distributed Extended XQuery for Web Data Sources as Services.",
                    "Automatic Generation of RIAs Using RUX-Tool and Webratio.",
                    "MagicUWE - A CASE Tool Plugin for Modeling Web Applications.",
                    "A Model-Based Approach Providing Context-Sensitive Television Interaction.",
                    "Model-Driven Development of Audio-Visual Web Search Applications: The PHAROS Demonstration.",
                    "beContent: A Model-Driven Platform for Designing and Maintaining Web Applications.",
                    "InSCo-Gen: A MDD Tool for Web Rule-Based Applications.",
                    "A Tool to Support End-User Development of Web Applications Based on a Use Case Model.",
                    "MODiCo: A Multi-Ontology Web Service Discovery and Composition System."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8. ICWE 2008",
        "info": "Yorktown Heights, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2008",
                "sub_name": "Proceedings of the Eighth International Conference on Web Engineering, ICWE 2008, 14-18 July 2008, Yorktown Heights, New York, USA.",
                "count": 41,
                "papers": [
                    "Refactoring to Rich Internet Applications. A Model-Driven Approach.",
                    "A Model-Driven Development for GWT-Based Rich Internet Applications with OOH4RIA.",
                    "Facing Interaction-Rich RIAs: The Orchestration Model.",
                    "Constructing Advanced Web-Based Dialog Components with Stakeholders - A DSL Approach.",
                    "Publish By Example.",
                    "Achieving Efficient Access to Large Integrated Sets of Semantic Data in Web Applications.",
                    "Knowledge Engineering in a Temporal Semantic Web Context.",
                    "A Catalogue of Refactorings for Navigation Models.",
                    "Security Policy Composition for Composite Services.",
                    "Combining Scalability and Expressivity in the Automatic Composition of Semantic Web Services.",
                    "BotSeer: An Automated Information System for Analyzing Web Robots.",
                    "The Next Step in Information Sharing: The Distributed Alerts Dissemination Backbone.",
                    "Crawling AJAX by Inferring User Interface State Changes.",
                    "Executable Semantics of Recursively Nestable Dialog Flow Specifications for Web Applications.",
                    "Designing Rich Internet Applications Combining UWE and RUX-Method.",
                    "Business Process-Based Conceptual Design of Rich Internet Applications.",
                    "Database-Driven Web Mashups.",
                    "Declarative Access Control for WebDSL: Combining Language Integration and Separation of Concerns.",
                    "A Method for Integration of Web Applications Based on Information Extraction.",
                    "Four Heuristics to Guide Structured Content Crawling.",
                    "The Use of Bayesian Networks for Web Effort Estimation: Further Investigation.",
                    "A Replicated Study on the Evaluation of a Size Measurement Procedure for Web Applications.",
                    "Assessing Web Applications Consistently: A Context Information Approach.",
                    "Identifying Cultural Markers for Web Application Design Targeted to a Multi-cultural Audience.",
                    "Specification Patterns for Formal Web Verification.",
                    "Modeling Ontology-Driven Personalization of Web Contents.",
                    "A Framework for the Management of Context Data in Adaptive Web Information Systems.",
                    "Addressing Performance and Security in a Screen Reading Web Application That Enables Accessibility Anywhere.",
                    "Efficacious Reuse Support as Enabler for Cross-Methodological Web Engineering with Stakeholders.",
                    "OptimAX: Optimizing Distributed ActiveXML Applications.",
                    "Exploiting Structure Recurrence in XML Processing.",
                    "The Use of Cognitive Authority for Information Retrieval in Folksonomy-Based Systems.",
                    "JOXM: Java Object XML Mapping.",
                    "Clustering Blogs with Collective Wisdom.",
                    "Roadmap towards Lifecycle Support for Highly Distributed Web-Based Systems.",
                    "MVC-Webflow: An AJAX Tool for Online Modeling of MVC-2 Web Applications.",
                    "Extending MS Office for Sharing Document Content Units over the Semantic Web.",
                    "WIKE: A Web Information/Knowledge Extraction System for Web Service Generation.",
                    "Peony: A Web Environment to Support Pattern-Based Development.",
                    "On-the-fly Data Integration for Personalized Television Recommender Systems.",
                    "A Component Based Architecture for Web Content Management: Runtime Deployable WebManager Component Bundles."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2008iwwost",
                "sub_name": "Proceedings of the 7th International Workshop on Web-Oriented Software Technologies ( IWWOST'2008 ) in conjunction with the 8th International Conference on Web Engineering ( ICWE'2008 ) Yorktown Heights, New York, USA, July 14, 2008.",
                "count": 11,
                "papers": [
                    "A MDD Approach for Modelling Web Accessibility.",
                    "Applying Interaction Patterns: Towards a Model-Driven Approach for Rich Internet Applications Development.",
                    "Architecture for Integrating Desktop and Web 2.0 Data Management.",
                    "Current Research on the Design of Web 2.0 Applications Based on Model-Driven Approaches.",
                    "JobOlize - Headhunting by Information Extraction in the Era of Web 2.0.",
                    "Modelling and Generating AJAX Applications: A Model-Driven Approach.",
                    "Multi-level Dialog Modeling in Highly Interactive Web Interfaces.",
                    "On the Implementation of Multiplatform RIA User Interface Components.",
                    "Specifying Quality Requirements for the Web 2.0 Applications.",
                    "Using Microformats to Personalize Web Experience.",
                    "Web User Interface Generation for Multiple Platforms."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7. ICWE 2007",
        "info": "Como, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2007",
                "sub_name": "Web Engineering, 7th International Conference, ICWE 2007, Como, Italy, July 16-20, 2007, Proceedings.",
                "count": 56,
                "papers": [
                    "On Embedding Task Memory in Services Composition Frameworks.",
                    "A QoS Test-Bed Generator for Web Services.",
                    "Engineering Compensations in Web Service Environment.",
                    "Context-Aware Workflow Management.",
                    "Practical Methods for Adapting Services Using Enterprise Service Bus.",
                    "On the Quality of Navigation Models with Content-Modification Operations.",
                    "Metamodeling the Quality of the Web Development Process' Intermediate Artifacts.",
                    "The Use of a Bayesian Network for Web Effort Estimation.",
                    "Sequential Pattern-Based Cache Replacement in Servlet Container.",
                    "A Hybrid Cache and Prefetch Mechanism for Scientific Literature Search Engines.",
                    "Finalizing Dialog Models at Runtime.",
                    "Transparent Interface Composition in Web Applications.",
                    "Fine-Grained Specification and Control of Data Flows in Web-Based User Interfaces.",
                    "Authoring Multi-device Web Applications with Database Access.",
                    "Enriching Hypermedia Application Interfaces.",
                    "Functional Web Applications.",
                    "Integrating Databases, Search Engines and Web Applications: A Model-Driven Approach.",
                    "A Method for Model Based Design of Rich Internet Application Interactive User Interfaces.",
                    "Improving Communication in Requirements Engineering Activities for Web Applications.",
                    "Meta-model to Support End-User Development of Web Based Business Information Systems.",
                    "Easing Web Guidelines Specification.",
                    "A Transformation-Driven Approach to the Verification of Security Policies in Web Designs.",
                    "Efficiently Detecting Webpage Updates Using Samples.",
                    "Auto-Generating Test Sequences for Web Applications.",
                    "A Survey of Analysis Models and Methods in Website Verification and Testing.",
                    "Building Semantic Web Portals with WebML.",
                    "Engineering Semantic-Based Interactive Multi-device Web Applications.",
                    "Towards Improving Web Search by Utilizing Social Bookmarks.",
                    "Designing Interaction Spaces for Rich Internet Applications with UML.",
                    "A Behavioral Model for Rich Internet Applications.",
                    "Considering Web Accessibility in Information Retrieval Systems.",
                    "Fixing Weakly Annotated Web Data Using Relational Models.",
                    "Creating Personal Histories from the Web Using Namesake Disambiguation and Event Extraction.",
                    "Comparing Clustering Algorithms for the Identification of Similar Pages in Web Applications.",
                    "Structural Patterns for Descriptive Documents.",
                    "Component-Based Content Linking Beyond the Application.",
                    "A Double-Model Approach to Achieve Effective Model-View Separation in Template Based Web Applications.",
                    "Model-Driven Development of Web Applications with UWA, MVC and JavaServer Faces.",
                    "On Refining XML Artifacts.",
                    "Mixup: A Development and Runtime Environment for Integration at the Presentation Layer.",
                    "Squiggle: An Experience in Model-Driven Development of Real-World Semantic Search Engines.",
                    "WebTE: MDA Transformation Engine for Web Applications.",
                    "Noodles: A Clustering Engine for the Web.",
                    "WebRatio 5: An Eclipse-Based CASE Tool for Engineering Web Applications.",
                    "Extending Ruby on Rails for Semantic Web Applications.",
                    "Personalized Faceted Navigation in the Semantic Web.",
                    "WebVAT: Web Page Visualization and Analysis Tool.",
                    "Smart Tools to Support Meta-design Paradigm for Developing Web Based Business Applications.",
                    "Next-Generation Tactical-Situation-Assessment Technology (TSAT): Chat.",
                    "Tool Support for Model Checking of Web Application Designs.",
                    "Developing eBusiness Solutions with a Model Driven Approach: The Case of Acer EMEA.",
                    "The Challenges of Application Service Hosting.",
                    "Securing Code in Services Oriented Architecture.",
                    "Service Level Agreements: Web Services and Security.",
                    "Risk Management for Service-Oriented Systems.",
                    "A Framework for Situational Web Methods Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2007mdwe",
                "sub_name": "Proceedings of the 3rd International Workshop on Model-Driven Web Engineering MDWE 2007, Como, Italy, July 17, 2007.",
                "count": 8,
                "papers": [
                    "MDWE2007 Foreword.",
                    "Model-driven Construction of Workflow-based Web Applications with Domain-specific Languages.",
                    "Model-Driven Generation of Web Applications in UWE.",
                    "MDWEnet: A Practical Approach to Achieving Interoperability of Model-Driven Web Engineering Methods.",
                    "On the Integration of Web Modeling Languages.",
                    "Bridging the Gap between BPMN and WS-BPEL. M2M Transformations in Practice.",
                    "Model Transformation for Service-Oriented Web Applications Development.",
                    "Modeling Data-intensive Rich Internet Applications with Server Push Support."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2007aewse",
                "sub_name": "Proceedings of the 2nd International Workshop on Adaptation and Evolution in Web Systems Engineering AEWSE'07, Como, Italy, July 19, 2007.",
                "count": 10,
                "papers": [
                    "AEWSE'07 Preface.",
                    "A Prototype Tool for the Automatic Generation of Adaptive Websites.",
                    "Active Rules for Runtime Adaptivity Management.",
                    "Using Object Variants to Support Context-Aware Interactions.",
                    "Web User Interface Migration through Different Modalities with Dynamic Device Discovery.",
                    "Adaptive Peer-to-Peer Web Clustering using Distributed Aspect Middleware (Damon).",
                    "Evolution of Web Applications with Aspect-Oriented Design Patterns.",
                    "Adaptive portal framework for Semantic Web applications.",
                    "An Approach to Support the Web User Interfaces Evolution.",
                    "Improving the Adaptation of Web Applications to Different Versions of Software with MDA."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6. ICWE 2006",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2006",
                "sub_name": "Proceedings of the 6th International Conference on Web Engineering, ICWE 2006, Palo Alto, California, USA, July 11-14, 2006.",
                "count": 54,
                "papers": [
                    "Assessing quality in use in a consistent way.",
                    "Effort estimation modeling techniques: a case study for web applications.",
                    "Usage-based statistical testing of web applications.",
                    "web services customization: a composition-based approach.",
                    "Modeling semantic web services: a case study.",
                    "Challenges and techniques on the road to dynamically compose web services.",
                    "Clustering web images using association rules, interestingness measures, and hypergraph partitions.",
                    "Modeling heterogeneous context information in adaptive web based applications.",
                    "Acquiring owl ontologies from data-intensive web sites.",
                    "Precise WIS development.",
                    "Modeling and generating application logic for data-intensive web applications.",
                    "Generation of WebML web application models from business process specifications.",
                    "SCORM metadata in the context of bloom-vincenti taxonomy and intelligent tutoring system.",
                    "Implementing example-based tools for preference-based search.",
                    "Generating semantic annotations during the web design process.",
                    "The quest for the web services stack: a fast trip.",
                    "FDX: federating devices and web applications.",
                    "Scorm run-time environment as a service.",
                    "Web server performance analysis.",
                    "An approach to generate test cases from use cases.",
                    "Defining a quality model for portal data.",
                    "Stakeholder collaboration: from conversation to contribution.",
                    "Chronica: a temporal web search engine.",
                    "An open and dynamical service oriented architecture for supporting mobile services.",
                    "Model driven distribution pattern design for dynamic web service compositions.",
                    "Transactional patterns for reliable web services compositions.",
                    "A platform for the development of semantic web portals.",
                    "Rapid prototyping of web applications combining domain specific languages and model driven design.",
                    "An adaptation method by feedback in an evolutionary hypermedia system.",
                    "Taking the community's pulse: one blog at a time.",
                    "Extended memory (xMem) of web interactions.",
                    "Sharing information on the web using bitlets.",
                    "Modelling information persistence on the web.",
                    "Multimodal interaction with xforms.",
                    "Automatic dialog mask generation for device-independent web applications.",
                    "Modeling, validating and automating composition of web services.",
                    "Searchstrings revealing user intent: a better understanding of user perception.",
                    "Divide and conquer approach for efficient pagerank computation.",
                    "Querying the web: a multiontology disambiguation method.",
                    "Modality conflicts in semantics aware access control.",
                    "Web engineering security: a practitioner's perspective.",
                    "Catching web crawlers in the act.",
                    "An enhanced conceptual framework to better handle business rules in process oriented applications.",
                    "Model transformations from requirements to web system design.",
                    "OpenXUP: an alternative approach to developing highly interactive web applications.",
                    "Combining software transactional memory with a domain modeling language to simplify web application development.",
                    "Agile development of secure web applications.",
                    "A survey of issue resolution on the incremental refinement of the system scope in web system development.",
                    "A workflow-driven design of web information systems.",
                    "Modeling and verification of adaptive navigation in web applications.",
                    "Hera-S: web design using sesame.",
                    "Web application internationalization and localization in action.",
                    "Constraint tuning and management for web applications.",
                    "Conceptual modeling and code generation for rich internet applications."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2006w",
                "sub_name": "Workshop Proceedings of the 6th International Conference on Web Engineering, ICWE 2006, Palo Alto, California, USA, July 11-14, 2006.",
                "count": 21,
                "papers": [
                    "Preface to MDWE'06.",
                    "Pattern-based development of user-friendly web applications.",
                    "Transformation techniques in the model-driven development process of UWE.",
                    "A UML 2.0 profile for WebML modeling.",
                    "Bridging existing Web modeling languages to model-driven engineering: a metamodel for WebML.",
                    "Generating web applications from process models.",
                    "Towards an operation model for generated web applications.",
                    "Formalizing and validating UML architecture description of web systems.",
                    "Preface to AEWSE'06.",
                    "Combining conceptual modeling and active rules for the design of adaptive web applications.",
                    "Adaptive hypermedia as a means for learning programming.",
                    "An author tool based on SEM-HP for the creation and evolution of adaptive hypermedia systems.",
                    "Estimating the evolution of categorized web page populations.",
                    "An approach to detection ontology changes.",
                    "Preface to SMIWEP-MATeS'06: workshop held in conjunction with the 6th international conference on web engineering (ICWE2006) Palo Alto, California, USA. July 10th, 2006.",
                    "A high-level specification for Semantic Web Service Discovery Services.",
                    "Towards semantic service selection for B2B integration.",
                    "A state propagation method for consistency checking of web service function invocations in web applications.",
                    "Integrating bioinformatic data sources over the SFSU ER design tools XML databus.",
                    "Ontology driven definition of a usability model for second generation portals.",
                    "Extended web services framework to meet non-functional requirements."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5. ICWE 2005",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2005",
                "sub_name": "Web Engineering, 5th International Conference, ICWE 2005, Sydney, Australia, July 27-29, 2005, Proceedings.",
                "count": 88,
                "papers": [
                    "Keynote: Just Enough Requirements Management for Web Engineering.",
                    "Keynote: Performance, Availability and Security in Web Design.",
                    "Keynote: Bridging the Gap Between Requirements and Design.",
                    "Keynote: Google Maps and Browser Support for Rich Web Applications.",
                    "Web Service Engineering - Advancing a New Software Engineering Discipline.",
                    "Toward a Comprehension View of Web Engineering.",
                    "A Need-Oriented Assessment of Technological Trends in Web Engineering.",
                    "Adding Usability to Web Engineering Models and Tools.",
                    "Organization-Oriented Measurement and Evaluation Framework for Software and Web Engineering Projects.",
                    "Web Usability Measurement: Comparing Logic Scoring Preference to Subjective Assessment.",
                    "Effectively Capturing User Navigation Paths in the Web Using Web Server Logs.",
                    "Design Verification of Web Applications Using Symbolic Model Checking.",
                    "Towards Model-Driven Testing of a Web Application Generator.",
                    "WIT: A Framework for In-container Testing of Web-Portal Applications.",
                    "How to Deal with Non-functional Properties in Web Service Development.",
                    "Use Constraint Hierarchy for Non-functional Requirements Analysis.",
                    "Towards a Taxonomy of Hypermedia and Web Application Size Metrics.",
                    "Identifying Websites with Flow Simulation.",
                    "An Increase Web Services Performance Method.",
                    "A System of Patterns for Web Navigation.",
                    "A Design of Spatial XQuery for Mobile and Location-Based Applications.",
                    "An Article Language Model for BBS Search.",
                    "Conqueries: An Agent That Supports Query Expansion.",
                    "Ubiquitous Information Retrieval Using Multi-level Characteristics.",
                    "First-Order Patterns for Information Integration.",
                    "Web Application Development: Java, .Net and Lamp at the Same Time.",
                    "A Security Acceleration Using XML Signcryption Scheme in Mobile Grid Web Services.",
                    "Light-Weight Distributed Web Interfaces: Preparing the Web for Heterogeneous Environments.",
                    "Building Blocks for Identity Federations.",
                    "Level of Detail Concepts in Data-Intensive Web Applications.",
                    "Separation of Navigation Routing Code in J2EE Web Applications.",
                    "Video-Based Sign Language Content Annotation by Incorporation of MPEG-7 Standard.",
                    "E-Legislative Services: Issues and Architecture.",
                    "An Application Framework for Collaborative Learning.",
                    "An Investigation of Cloning in Web Applications.",
                    "Intelligent Web Information Service Model for Minimizing Information Gap Among People in E-Government.",
                    "Intelligent Website Evolution of Public Sector Based on Data Mining Tools.",
                    "An Experiment on the Matching and Reuse of XML Schemas.",
                    "Aggregation in Ontologies: Practical Implementations in OWL.",
                    "Recursive Application of Structural Templates to Efficiently Compress Parsed XML.",
                    "Matching Semantic Web Services Using Different Ontologies.",
                    "Improving Semantic Consistency of Web Sites by Quantifying User Intent.",
                    "A Framework to Support QoS-Aware Usage of Web Services.",
                    "Integrating Web Applications and Web Services.",
                    "The Semantic Web Services Tetrahedron: Achieving Integration with Semantic Web Services.",
                    "Secure Web Forms with Client-Side Signatures.",
                    "Robust and Simple Authentication Protocol for Secure Communication on the Web.",
                    "Offline Expansion of XACML Policies Based on P3P Metadata.",
                    "Automatic Optimization of Web Recommendations Using Feedback and Ontology Graphs.",
                    "Recommender Systems Using Support Vector Machines.",
                    "Multi-channel Publication of Interactive Media Content for Web Information Systems.",
                    "Classification of RSS-Formatted Documents Using Full Text Similarity Measures.",
                    "Modelling Adaptivity with Aspects.",
                    "An Approach to User-Behavior-Aware Web Applications.",
                    "A Component-Based Reflective Middleware Approach to Context-Aware Adaptive Systems.",
                    "Adaptation of Web Pages for Hand-Held Devices.",
                    "A Model-Based Approach for Integrating Third Party Systems with Web Applications.",
                    "A Model-Driven Approach for Designing Distributed Web Information Systems.",
                    "MDA Transformations Applied to Web Application Development.",
                    "Higher-Level Information Aspects of Web Systems: Addressing the Problem of Disconnection.",
                    "As Easy as \"Click\": End-User Web Engineering.",
                    "Towards End User Development of Web Applications for SMEs: A Component Based Approach.",
                    "Web Applications: A Simple Pluggable Architecture for Business Rich Clients.",
                    "From Web Requirements to Navigational Design - A Transformational Approach.",
                    "Web Applications Design with a Multi-process Approach.",
                    "\"Designing for the Web\" Revisited: A Survey of Informal and Experienced Web Developers.",
                    "Web OPEN-Integrated: Proposed Framework for Web Development.",
                    "Framework for Collaborative Web Applications.",
                    "Discovering Re-usable Design Solutions in Web Conceptual Schemas: Metrics and Methodology.",
                    "The Role of Visual Tools in a Web Application Design and Verification Framework: A Visual Notation for LTL Formulae.",
                    "OOHDMDA - An MDA Approach for OOHDM.",
                    "A Service-Centric Architecture for Web Applications.",
                    "NavOptim: On the Possibility of Minimising Navigation Effort.",
                    "A First Step Towards the Web Engineering Body of Knowledge.",
                    "Design Considerations for Web-Based Interactive TV Services.",
                    "Web Service Based Integration of Biological Interaction Databases.",
                    "Integrating Process Management and Content Management for Service Industries.",
                    "Service Publishing and Discovering Model in a Web Services Oriented Peer-to-Peer System.",
                    "A Web Services Method on Embedded Systems.",
                    "Evaluating Current Testing Processes of Web-Portal Applications.",
                    "XML Approach to Communication Design of WebGIS.",
                    "Automatic Generation of Client-Server Collaborative Web Applications from Diagrams.",
                    "Web Operational Analysis Through Performance-Related Ontologies in OWL for Intelligent Applications.",
                    "WCAG Formalization with W3C Techniques.",
                    "Analyzing Time-to-Market and Reliability Trade-Offs with Bayesian Belief Networks.",
                    "A UI-Driven Lightweight Framework for Developing Web Applications.",
                    "Modelling the Behaviour of Web Applications with ArgoUWE.",
                    "Simulating Web Applications Design Models."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "4. ICWE 2004",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2004",
                "sub_name": "Web Engineering - 4th International Conference, ICWE 2004, Munich, Germany, July 26-30, 2004, Proceedings.",
                "count": 93,
                "papers": [
                    "The Real World or Web Engineering?",
                    "Web Engineering - Old Wine in New Bottles?",
                    "Requirements Engineering: Problem Analysis and Solution Specification (Extended Abstract).",
                    "Automated Evaluation of Web Usability and Accessibility by Guideline Review.",
                    "'I Need It Now': Improving Website Usability by Contextualizing Privacy Policies.",
                    "A Linear Regression Model for Assessing the Ranking of Web Sites Based on Number of Visits.",
                    "A Framework for Exploiting Conceptual Modeling in the Evaluation of Web Application Quality.",
                    "Using Adaptive Techniques to Validate and Correct an Audience Driven Design of Web Sites.",
                    "Modeling User Input and Hypermedia Dynamics in Hera.",
                    "A Behavioral Semantics of OOHDM Core Features and of Its Business Process Extension.",
                    "XGuide - Concurrent Web Engineering with Contracts.",
                    "A Proposal for Petri Net Based Web Service Application Modeling.",
                    "Extending Navigation Modelling to Support Content Aggregation in Web Sites.",
                    "Exception Handling Within Workflow-Based Web Applications.",
                    "Loosely Coupled Web Services in Remote Object Federations.",
                    "MDA Applied: From Sequence Diagrams to Web Service Choreography.",
                    "A Three-Level Architecture for Distributed Web Information Systems.",
                    "Modeling and Analysis of Contract Net Protocol.",
                    "A Web Metrics Survey Using WQM.",
                    "A COSMIC-FFP Based Method to Estimate Web Application Development Effort.",
                    "Evaluation of Commercial Web Engineering Processes.",
                    "A Roadmap Towards Distributed Web Assessment.",
                    "Ontology for Software Metrics and Indicators: Building Process and Decisions Taken.",
                    "Measuring Semantic Relations of Web Sites by Clustering of Local Context.",
                    "Interplay of Content and Context.",
                    "Model-Driven Design of Web Applications with Client-Side Adaptation.",
                    "Personalisation Services for Self E-learning Networks.",
                    "Personalizing Web Sites for Mobile Devices Using a Graphical User Interface.",
                    "Personalizing Digital Libraries at Design Time: The Miguel de Cervantes Digital Library Case Study.",
                    "Comparison of Two Approaches for Automatic Construction of Web Applications: Annotation Approach and Diagram Approach.",
                    "Device Independent Web Applications - The Author Once - Display Everywhere Approach.",
                    "WAPS: Web Application Prototyping System.",
                    "A Framework for the Simulation of Web Applications.",
                    "Advisor Suite: A Tool for Rapid Development of Maintainable Online Sales Advisory Systems.",
                    "An Agent-Based Approach to Web Site Maintenance.",
                    "From Maintenance to Evolutionary Development of Web Applications: A Pragmatic Approach.",
                    "An MDA Approach for the Development of Web Applications.",
                    "RetroWeb: A Web Site Reverse Engineering Approach.",
                    "Empirical Methodologies for Web Engineering.",
                    "Using RDF to Query Spatial XML.",
                    "Extending Policy Languages to the Semantic Web.",
                    "HyCo-An Authoring Tool to Create Semantic Learning Objects for Web-Based E-learning Systems.",
                    "Annotation for the Semantic Web During Website Development.",
                    "Lifting XML Schema to OWL.",
                    "Accelerating Dynamic Web Content Delivery Using Keyword-Based Fragment Detection.",
                    "SIE - Intelligent Web Proxy Framework.",
                    "Wide Area Performance Monitoring Using Aggregate Latency Profiles.",
                    "Workload Characterization of Uncacheable HTTP Content.",
                    "A Scalable Component-Based Architecture for Online Services of Library Catalogs.",
                    "An XHTML 2.0 Implementation.",
                    "Semantic Matching of Natural Language Web Queries.",
                    "From Relational Data to RDFS Models.",
                    "Automatic Interpretation of Natural Language for a Multimedia E-learning Tool.",
                    "Representing XML Schema in UML - A Comparison of Approaches.",
                    "Screen Readers Cannot See: Ontology Based Semantic Annotation for Visually Impaired Web Travellers.",
                    "Engineering the Presentation Layer of Adaptable Web Information Systems.",
                    "A Notation and Framework for Dialog Flow Control in Web Applications.",
                    "A Framework for the Internationalization of Data-Intensive Web Applications.",
                    "Using Web Services to Build Context-Aware Applications in Ubiquitous Computing.",
                    "Model-Checking of Safety and Security Aspects in Web Service Flows.",
                    "Reliable and Adaptable Security Engineering for Database-Web Services.",
                    "Supporting Secure Deployment of Portal Components.",
                    "A System for Interactive Authorization for Business Processes for Web Services.",
                    "Web Engineering Curriculum: A Case Study of an Evolving Framework.",
                    "Behaviour Recovery and Complicated Pattern Definition in Web Usage Mining.",
                    "An Efficient Automated Negotiation System Using Multi-attributes in the Online Environment.",
                    "Local Nonnegative Matrix Factorization for Mining Typical User Session Profile.",
                    "An Architecture for Personalized Systems Based on Web Mining Agents.",
                    "WISE: A Web-Based Intelligent Sensor Explorer Framework for Publishing, Browsing, and Analyzing Sensor Data over the Internet.",
                    "Semantic Information Generation from Classification and Information Extraction.",
                    "A Study on the Secure Business Web Service Based on ebXML.",
                    "Website Modeling and Website Generation.",
                    "Improving Web Sites by Automatic Source Code Analysis and Modifications.",
                    "Using Topic Maps in an E-learning Context.",
                    "A Component-Based WebGIS Geo-Union.",
                    "Engineering a Semantic Web for Pathology.",
                    "Enhancing Decoupling in Portlet Implementation.",
                    "A Metadata Model for the Design and Deployment of Document Management Systems.",
                    "MSC-Based Formalism for Automated Web Navigation.",
                    "A Procedure for Development and Execution of Process-Based Composite Web Services.",
                    "Towards Integrating Autonomously Created Knowledge Descriptions for the Semantic Web.",
                    "XWebProcess: Agile Software Development for Web Applications.",
                    "Automating Standards-Based Courseware Development Using UML.",
                    "WING: A Web Probing, Visualization, and Performance Analysis Service.",
                    "Preparing for Service-Oriented Computing: A Composite Design Pattern for Stubless Web Service Invocation.",
                    "An Architectural Model to Promote User Awareness on the Web.",
                    "UML Profile for OWL.",
                    "Building and Operating an E-business Platform - Technical Challenges and Other Pitfalls.",
                    "Model-Driven Web Development with VisualWADE.",
                    "WebRatio, an Innovative Technology for Web Application Development.",
                    "Modeling the Structure of Web Applications with ArgoUWE.",
                    "Welkin: Automatic Generation of Adaptive Hypermedia Sites with NLP Techniques.",
                    "Authoring and Dynamic Generation of Adaptive E-courses."
                ]
            },
            {
                "sub_name_abbr": "conf/icwe/2004w",
                "sub_name": "Engineering Advanced Web Applications: Proceedings of Workshops in connection with the 4th International Conference on Web Engineering (ICWE 2004), Munich, Germany, 28-30 July, 2004.",
                "count": 29,
                "papers": [
                    "Challenges in Adaptive Web Information Systems: Don't Forget the Link!",
                    "Model Driven Architecture with OOHDM.",
                    "WSLS: An Agile System Facilitating the Production of Service-Oriented Web Applications.",
                    "State-, HTML-, and Object-Based Dialog Design for Voice-Web Applications.",
                    "Dialogue-based Design for Multi-Channel Interactions.",
                    "DEPTH: A Methodology for Usability Evaluation of Web Sites Based on Design Patterns and Heuristics Criteria.",
                    "Model-Driven Navigation Design for Semantic Web Applications with the UML-Guide.",
                    "Semantic Analysis of a Web Site: a Prototype.",
                    "Semantic Capabilities for the Metrics and Indicators Cataloging Web System.",
                    "Getting Ready Web Engineering Methods for the Semantic Web.",
                    "Semantic Lookup in Service-Oriented Architectures.",
                    "MDA applied: From Sequence Diagrams to Web Service Choreography.",
                    "A Tutorial on the Integration of Agent Services into BPEL4WS Defined Workflows.",
                    "Toward Cognitive Tutoring in a Collaborative, Web-Based Environment.",
                    "Authoring a Collaborative Task Extending the IMS-LD to be Performed in a Standard-based Adaptive Learning Management System called aLFanet.",
                    "Using Learning Styles for Dynamic Group Formation in Adaptive Collaborative Hypermedia Systems.",
                    "Reusability in GEAHS.",
                    "A Virtual Assistant in an Insurance Domain endowed with a user-driven Dialogue Manager.",
                    "Description Logics Reasoning in Web-based Education Environments.",
                    "A Web-based Annotation System for Improving Cooperation in a Care Network.",
                    "Augmenting Web-Based Collaboration with Adaptive Replication and Mobility.",
                    "QoS in Multichannel IS: The MAIS Approach.",
                    "The Use of Trade-offs in the Development of Web Applications.",
                    "Towards Reconciling Quality and Agility in Web Application Development.",
                    "The Impact of Accessibility and Usability on the Development of Web Applications.",
                    "An Empirical Study of Web Quality: Measuring the Web from Wroclaw University of Technology Campus.",
                    "USIXML: A User Interface Description Language Supporting Multiple Levels of Independence.",
                    "Designing Multi-Device Interactive Services through Multiple Abstraction Levels.",
                    "Accessing Web Applications with Multiple Context-Aware Devices."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "3. ICWE 2003",
        "info": "Oviedo, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icwe/2003",
                "sub_name": "Web Engineering, International Conference, ICWE 2003, Oviedo, Spain, July 14-18, 2003, Proceedings.",
                "count": 103,
                "papers": [
                    "Semantic Web Services: A Communication Infrastructure for eWork and eCommerce.",
                    "Cybercrime: Vandalizing the Information Society.",
                    "Agent-Based Web Engineering.",
                    "Assisting Database Users in a Web Environment.",
                    "The PSI3 Agent Recommender System.",
                    "Mob: A Scripting Language for Mobile Agents Based on a Process Calculus.",
                    "Putting Together Web Services and Compositional Software Agents.",
                    "Mobile Agents Markup Language.",
                    "Building Wrapper Agents for the Deep Web.",
                    "Agent-Based Privilege Negotiation for E-commerce on World Wide Web.",
                    "An Automated Negotiation Model for M-commerce Using Mobile Agents.",
                    "A Fully Anonymous Electronic Payment Scheme for B2B.",
                    "An Efficient Anonymous Scheme for Secure Micropayments.",
                    "User Parameter Tunning for VoD Service Users.",
                    "IOWA: Intuitive-Use Oriented Webtool for the Creation of Adapted Contents (in an E-learning Environment).",
                    "Reaching Agreements through Fuzzy Counter-Offers.",
                    "A Dynamic Replication Service for XML-Documents to E-commerce.",
                    "Planning: An Intermediate Solution to the Problems in Design.",
                    "Organizing Problem Solving Activities for Synchronous Collaborative Learning of Design Domains.",
                    "Feijoo.net: An Approach to Personalized E-learning Using Learning Styles.",
                    "A Collaborative E-learning Component for the IDEFIX Project.",
                    "Engineering a Future for Web-Based Learning Objects.",
                    "Adaptation and Generation in a Web-Based Tutor for Linear Programming.",
                    "A \"Development Web Environment\" for Learning Programming Languages.",
                    "Adaptive Collaborative Web-Based Courses.",
                    "An Educational Component Based Framework for Web ITS Development.",
                    "Adaptive Interaction Multi-agent Systems in E-learning/E-teaching on the Web.",
                    "Platform of Virtual Training for Work.",
                    "An Object-Oriented Dialog System for Use in Computer-Aided Teaching.",
                    "Adaptable Contents Visulization (VIC).",
                    "XbotML: A Markup Language for Human Computer Interaction via Chatterbots.",
                    "Modelling Interacting Web Usability Criteria through Fuzzy Measures.",
                    "A Concept-Based Approach for the Design for Web Usability Evaluation Questionnaires.",
                    "Adaptive Interactive Dialogs through the Web: Addressing User's Interaction Requirements Dynamically.",
                    "Diaolog Model Clustering for User Interface Adaptation.",
                    "AVE - Method for 3D Visualization of Search Results.",
                    "Ubiquitous Access to Deep Content via Web Services.",
                    "NDT-Tool: A Case Tool to Deal with Requirements in Web Information Systems.",
                    "A Design Toolkit for Hypermedia Applications.",
                    "WebML + for Communication of Information Flows: An Empirical Study.",
                    "Multiple Markups in XML Documents.",
                    "BDOviedo3P: Data XML Storage and Management.",
                    "Building Applications with Domain-Specific Markup Languages: A Systematic Approach to the Development of XML-Based Software.",
                    "An XML-Based Approach for Fast Prototyping of Web Applications.",
                    "X-SHAAD: An XML Implementation for Hypermedia Systems Modeling through SHAAD.",
                    "Semi-automatic Assessment Process in a Ubiquitous Environment for Language Learning.",
                    "Mobile EC Service Applications by Privacy Management.",
                    "User Interfaces: A Proposal for Automatic Adaptation.",
                    "Moving Vehicle Tracking for the Web Camera.",
                    "Measuring End-to-End Quality of a News-on-Demand Web Service.",
                    "Continuous Media Streams Service Based on the Adaptive Buffer Sharing Policy.",
                    "New WAKE Key Recovery Protocol on M-commerce.",
                    "An Improvement of VeriSign's Key Roaming Service Protocol.",
                    "Host Revocation Authority: A Way of Protecting Mobile Agents from Malicious Hosts.",
                    "Enabling Secure Multicast Using a New Java LKH Rekeying Tool.",
                    "A Taxonomy of Web Attacks.",
                    "A Pseudorandom Bit Generator Based on Block Upper Triangular Matrices.",
                    "Retrofitting Security into a Web-Based Information System.",
                    "A Quantitative Analysis of eCRM Tools in the Austrian Pharamceutical Industry.",
                    "A Browser Compatibility Testing Method Based on Combinatorial Testing.",
                    "Analyzing Errors and Referral Pairs to Characterize Common Problems and Improve Web Reliability.",
                    "Towards the Design of a Metrics Cataloging System by Exploiting Conceptual and Semantic Web Approaches.",
                    "Choosing the\"Rightweight\" Model for Web Site Quality Evaluation.",
                    "WLGauge - A Web Link Gauge to Measure the Quality of External WWW Links.",
                    "Hyperlinks Analysis of Dynamic Web Applications.",
                    "Why Not RSVP over DTM?",
                    "Scalable QoS Approach in a Core Internet Network.",
                    "Accessibility Metrics of Web Pages for Blind End-Users.",
                    "A Three Dimensional Web Quality Model.",
                    "Comparison of Methods and Existing Tools for the Measurement of Usability in the Web.",
                    "Automatic Generation of Wrapper for Data Extraction from the Web.",
                    "Semantic XML Filtering by Ontology Combination.",
                    "Genre and Domain Processing in an Information Retrieval Perspective.",
                    "An Architecture for Semantics-Based Interaction of Spontaneously Connecting Software.",
                    "Integration of Spatial XML Documents with RDF.",
                    "Foundations of a New Proposal for Querying Relational Databases and XML Documents.",
                    "Selection of Ontologies for the Semantic Web.",
                    "Modeling Applications for the Semantic Web.",
                    "Automatic Derivation of DAML-S Service Specifications from UML Business Models.",
                    "Swarm Intelligent Surfing in the Web.",
                    "The Cooperative Web: A Step towards Web Intelligence.",
                    "Partitioning the Navigational Model: A Component-Driven Approach.",
                    "A Component-Oriented Framework for the Implementation of Navigational Design Patterns.",
                    "An Internet-Based Collaborative Engineering System.",
                    "Data Integration Based WWW with XML and CORBA.",
                    "Experiences in Web Site Development with Multidisciplinary Teams. From XML to JST.",
                    "The NDT Development Process.",
                    "Essential Use Cases in the Design of Multi-channel Service Offerings - A Study of Internet Banking.",
                    "Modelling Dynamic Personalization in Web Applications.",
                    "Towards Self-Describing Web Services.",
                    "User Profiling Capabilities in OOWS.",
                    "Towards a Common Metamodell for the Development of Web Appliactions.",
                    "The Spanish Morphology in Internet.",
                    "Morphoanalysis of Spanish Texts: Two Applications for Web Pages.",
                    "Agile Web Engineering (AWE) Process: Multidisciplinary Stakeholders and Team Communication.",
                    "Serverless Web-Multicast Chat System for Multi-users.",
                    "The Multimedia Home Platform (MHP) Framework for Web Access through Digital TV.",
                    "DEMOS Tools for Online Discussion and Decision Making.",
                    "Hera: Development of Semantic Web Information Systems.",
                    "Development of an Application to Support WEB Navigation.",
                    "Critical Information Systems Authentication Based on PKC and Biometrics.",
                    "Electronic Patient Record Virtually Unique Based on a Crypto Smart Card.",
                    "Publish-Subscribe for Mobile Environments."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "2. ICWE 2002",
        "info": "Santa Fe, Argentina",
        "venues": []
    },
    {
        "year": "2001",
        "name": "1. ICWE 2001",
        "info": "Cáceres, Spain",
        "venues": []
    }
]