[
    {
        "year": "2021",
        "name": "28th IEEE ICWS 2021",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2021",
                "sub_name": "2021 IEEE International Conference on Web Services, ICWS 2021, Chicago, IL, USA, September 5-10, 2021.",
                "count": 91,
                "papers": [
                    "Hybrid Quantum Applications Need Two Orchestrations in Superposition: A Software Architecture Perspective.",
                    "Services for Zero Trust Architectures - A Research Roadmap.",
                    "SLO Script: A Novel Language for Implementing Complex Cloud-Native Elasticity-Driven SLOs.",
                    "A Uniform Quantum Computing Model based on Virtual Quantum Processors.",
                    "Crowd-Powered Hybrid Classification Services: Calibration is all you need.",
                    "Deserv: Decentralized Serverless Computing.",
                    "R-CASS: Using Algorithm Selection for Self-Adaptive Service Oriented Systems.",
                    "Towards an adaptive curation services composition based on machine learning.",
                    "TWLR: A Novel Truth Inference Approach based on Worker Representations for Crowdsourcing in the Low Redundancy Situation.",
                    "SRaSLR: A Novel Social Relation Aware Service Label Recommendation Model.",
                    "ServeNet-LT: A Normalized Multi-head Deep Neural Network for Long-tailed Web Services Classification.",
                    "Intention-oriented Hierarchical Bundle Recommendation with Preference Transfer.",
                    "Sequence and Distance Aware Transformer for Recommendation Systems.",
                    "Time-aware User Modeling with Check-in Time Prediction for Next POI Recommendation.",
                    "WSGCN4SLP: Weighted Signed Graph Convolutional Network for Service Link Prediction.",
                    "MatTrip: Multi-functional Attention-based Neural Network for Semantic Travel Route Recommendation.",
                    "To Wait or To Buy: A Recommendation Service for Airline Ticket Purchase Timing.",
                    "WorP: A Novel Worker Performance Prediction Model for General Tasks on Crowdsourcing Platforms.",
                    "Relational Graph Neural Network with Neighbor Interactions for Bundle Recommendation Service.",
                    "Alleviating the Matthew Effect in O2O Service Matching Process.",
                    "Heterogeneous Graph Attention Network-Enhanced Web Service Classification.",
                    "Transfer Learning for Web Services Classification.",
                    "Proactive Composition of Mobile IoT Energy Services.",
                    "NETR-Tree: An Efficient Framework for Social-Based Time-Aware Spatial Keyword Query.",
                    "CUBIST: High-Quality 360-Degree Video Streaming Services via Tile-based Edge Caching and FoV-Adaptive Prefetching.",
                    "Energy-effective IoT Services in Balanced Edge-Cloud Collaboration Systems.",
                    "Provider-centric Allocation of Drone Swarm Services.",
                    "SiaSL: A Siamese Neural Network for Service Level Prediction.",
                    "An API Learning Service for Inexperienced Developers Based on API Knowledge Graph.",
                    "CONFECT: Computation Offloading for Tasks with Hard/Soft Deadlines in Edge Computing.",
                    "Optimal User Migration upon Server failures in Edge Computing Environment.",
                    "Lightweight and Context-aware Modeling of Microservice-based Internet of Things.",
                    "Mixed Priority Queue Scheduling Based on Spectral Clustering in Spatial Crowdsourcing.",
                    "Conflict Detection in IoT-based Smart Homes.",
                    "GHTRec: A Personalized Service to Recommend GitHub Trending Repositories for Developers.",
                    "QoE-aware Data Caching Optimization with Budget in Edge Computing.",
                    "DGPF: A Dialogue Goal Planning Framework for Cognitive Service Conversational Bot.",
                    "Game Theory-Based Task Offloading and Resource Allocation for Vehicular Networks in Edge-Cloud Computing.",
                    "Dealing with Label Uncertainty in Web Service Anti-patterns Detection using a Possibilistic Evolutionary Approach.",
                    "Combining Label-wise Attention and Adversarial Training for Tag Prediction of Web Services.",
                    "A Generic Method to Rapidly Release Internet Services on Commercial Platforms.",
                    "Service Composition Considering QoS Fluctuations and Anchoring Cost.",
                    "CTL-Based Dynamic IoT Service Composition.",
                    "Data & Computation-Intensive Service Re-Scheduling In Edge Networks.",
                    "Service Recommendation for Composition Creation based on Collaborative Attention Convolutional Network.",
                    "Alliance-Aware Service Composition with Efficient Matching Search.",
                    "COPA: A Combined Autoscaling Method for Kubernetes.",
                    "An Efficient Algorithm for Service Function Chains Reconfiguration in Mobile Edge Cloud Networks.",
                    "Sieve: Attention-based Sampling of End-to-End Trace Data in Distributed Microservice Systems.",
                    "User Allocation in Mobile Edge Computing: A Deep Reinforcement Learning Approach.",
                    "LETO: An Efficient Load Balanced Strategy for Task Offloading in IoT-Fog Systems.",
                    "QoA4ML - A Framework for Supporting Contracts in Machine Learning Services.",
                    "QoS-based Trust Evaluation for Data Services as a Black Box.",
                    "An Assurance-Based Risk Management Framework for Distributed Systems.",
                    "PRADA-TF: Privacy-Diversity-Aware Online Team Formation.",
                    "An Edge based Federated Learning Framework for Person Re-identification in UAV Delivery Service.",
                    "Multiple Features Driven Author Name Disambiguation.",
                    "Incremental Update of Knowledge Graph Embedding by Rotating on Hyperplanes.",
                    "Efficient Grammatical Error Correction with Hierarchical Error Detections and Correction.",
                    "A Holistic Auto-Scaling Algorithm for Multi-Service Applications Based on Balanced Queuing Network.",
                    "Online Cost-effective Edge Service Renting for Content Providers in Cloud and Edge Environments.",
                    "QoS Prediction for Web Services via Combining Multi-component Graph Convolutional Collaborative Filtering and Deep Factorization Machine.",
                    "Instance-Frequency-Weighted Regularized, Nonnegative and Adaptive Latent Factorization of Tensors for Dynamic QoS Analysis.",
                    "Microservice Pre-Deployment Based on Mobility Prediction and Service Composition in Edge.",
                    "GoDeep: Intelligent IoV Service Deployment and Execution with Privacy Preservation in Cloud-edge Computing.",
                    "Incentive-driven Edge Cooperation for Service Provision.",
                    "MemTrust: Find Deep Trust in Your Mind.",
                    "Blockchain-based Trust Information Storage in Crowdsourced IoT Services.",
                    "NPS-AntiClone: Identity Cloning Detection based on Non-Privacy-Sensitive User Profile Data.",
                    "Trust Management for Reliable Cross-Platform Cooperation Based on Blockchain.",
                    "A Certificateless Searchable Public Key Encryption Scheme for Multiple Receivers.",
                    "A Visualization Interface for Exploring Similar Brands on a Fashion E-Commerce Platform.",
                    "Automatic Control Network Anomaly Detection Based on Behavior Understanding.",
                    "Video Quality and Popularity-aware Video Caching in Content Delivery Networks.",
                    "A Privacy-aware Stackelberg Game Approach for Joint Pricing, Investment, Computation Offloading and Resource Allocation in MEC-enabled Smart Cities.",
                    "Mining Temporal Dependency among Proactive Data Services and Its Delivery to System-level Anomaly Prediction.",
                    "Adaptive Priority-based Conflict Resolution of IoT Services.",
                    "A Holistic Service Provision Strategy for Drone-as-a-Service in MEC-based UAV Delivery.",
                    "Robust Composition of Drone Delivery Services under Uncertainty.",
                    "Web Page Information Extraction Service Based on Graph Convolutional Neural Network and Multimodal Data Fusion.",
                    "Quantum Token for Network Authentication.",
                    "Best-approximation error for parametric quantum circuits.",
                    "Software Services Engineering Manifesto - A Cross-Cutting Declaration.",
                    "Edge Intelligence.",
                    "Service Defined Software in E-SBOT.",
                    "Attaining Meta-self-awareness through Assessment of Quality-of-Knowledge.",
                    "MinerRepu: A Reputation Model for Miners in Blockchain Networks.",
                    "Efficient penetration of API sequences to test stateful RESTful services.",
                    "A Measurement Study on Serverless Workflow Services.",
                    "An Empirical Study on Underlying Correlations between Runtime Performance Deficiencies and \"Bad Smells\" of Microservice Systems.",
                    "Monolith to Microservice Candidates using Business Functionality Inference."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "27th IEEE ICWS 2020",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2020",
                "sub_name": "2020 IEEE International Conference on Web Services, ICWS 2020, Beijing, China, October 19-23, 2020.",
                "count": 74,
                "papers": [
                    "Just-in-Time Memoryless Trust for Crowdsourced IoT Services.",
                    "EventWarden: A Decentralized Event-driven Proxy Service for Outsourcing Arbitrary Transactions in Ethereum-like Blockchains.",
                    "An Auction-Based Incentive Mechanism with Blockchain for IoT Collaboration.",
                    "Affinitive Diversity-Aware Task Allocation in Spatial Crowdsourcing.",
                    "PB-Worker: A Novel Participating Behavior-based Worker Ability Model for General Tasks on Crowdsourcing Platforms.",
                    "Answer Aggregation for Crowdsourcing Microtasks using Approximate Global Optimal Searching.",
                    "Signature-based Selection of IaaS Cloud Services.",
                    "Integrating EMD with Multivariate LSTM for Time Series QoS Prediction.",
                    "Distance-aware Edge User Allocation with QoE Optimization.",
                    "GDPR: When the Right to Access Personal Data Becomes a Threat.",
                    "METING: A Robust Log Parser Based on Frequent n-Gram Mining.",
                    "Running Transactional Business Processes with Blockchain's Smart Contracts.",
                    "A Simulation-based Comparison between Industrial Autoscaling Solutions and COCOS for Cloud Applications.",
                    "On the Maintenance of a Scientific Application based on Microservices: an Experience Report.",
                    "Location-Aware and Budget-Constrained Application Replication and Deployment in Multi-Cloud Environment.",
                    "A Co-Attention Model with Sequential Behaviors and Side Information for Session- based Recommendation.",
                    "POEM: Position Order Enhanced Model for Session-based Recommendation Service.",
                    "MR-UI: A Mobile Application Recommendation Based on User Interaction.",
                    "Root-Cause Metric Location for Microservice Systems via Log Anomaly Detection.",
                    "Fitness-guided Resilience Testing of Microservice-based Applications.",
                    "Multi-Agent Deep Reinforcement Learning Based Pricing Strategy for Competing Cloud Platforms in the Evolutionary Market.",
                    "ServeNet: A Deep Neural Network for Web Services Classification.",
                    "PhishTrim: Fast and adaptive phishing detection based on deep representation learning.",
                    "Cognitive Service in Mobile Edge Computing.",
                    "Multivariate QoS Monitoring in Mobile Edge Computing based on Bayesian Classifier and Rough Set.",
                    "Budgeted Data Caching based on k-Median in Mobile Edge Computing.",
                    "A Multi-Stage Approach for Virtual Network Function Migration and Service Function Chain Reconfiguration in NFV-enabled Networks.",
                    "Joint Availability- and Traffic-aware Placement of Parallelized Service Chain in NFV-enabled Data Center.",
                    "A Conflict Detection Framework for IoT Services in Multi-resident Smart Homes.",
                    "Location-Aware Feature Interaction Learning for Web Service Recommendation.",
                    "A Category Aware Non-negative Matrix Factorization Approach for App Permission Recommendation.",
                    "Ordinal Preferences Driven Reputation Measurement for Online Services with User Incentive.",
                    "FATP: Fairness-Aware Task Planning in Spatial Crowdsourcing.",
                    "An integrative multi-dimensional evaluation of Service Ecosystem.",
                    "User Intention Recognition and Requirement Elicitation Method for Conversational AI Services.",
                    "A Novel Dual-Graph Convolutional Network based Web Service Classification Framework.",
                    "A Big Service with Network Represent Learning for Quantified Flight Delay Prediction.",
                    "A Decentralized Collaborative Approach to Online Edge User Allocation in Edge Computing Environments.",
                    "Security-Aware QoS Forecasting in Mobile Edge Computing based on Federated Learning.",
                    "Trace-driven Modeling and Verification of a Mobility-Aware Service Allocation and Migration Policy for Mobile Edge Computing.",
                    "Computing Admissible Temporal SLAs for Web Service Compositions.",
                    "A Self-Organising Multi-Agent Knowledge Base.",
                    "NAFM: Neural and Attentional Factorization Machine for Web API Recommendation.",
                    "A-HSG: Neural Attentive Service Recommendation based on High-order Social Graph.",
                    "Time-aware Service Recommendation Based on Dynamic Preference and QoS.",
                    "A Practical Defense against Attribute Inference Attacks in Session-based Recommendations.",
                    "WGT: Thwarting Web Attacks Through Web Gene Tree-based Moving Target Defense.",
                    "Dynamic Task Offloading with Minority Game for Internet of Vehicles in Cloud-Edge Computing.",
                    "Computation Offloading and Content Caching with Traffic Flow Prediction for Internet of Vehicles in Edge Computing.",
                    "Leveraging Social Networks to Enhance Effective Coverage for Mobile Crowdsensing.",
                    "Computing Power Allocation and Traffic Scheduling for Edge Service Provisioning.",
                    "ORHRC: Optimized Recommendations of Heterogeneous Resource Configurations in Cloud-Fog Orchestrated Computing Environments.",
                    "Investigating the Evolution of Web API Cooperative Communities in the Mashup Ecosystem.",
                    "Detecting Temporal Anomaly and Interestingness in Timed Business Process Models.",
                    "Hierarchical Business Process Discovery: Identifying Sub-processes Using Lifecycle Information.",
                    "A-BPS: Automatic Business Process Discovery Service using Ordered Neurons LSTM.",
                    "bi-HPTM: An Effective Semantic Matchmaking Model for Web Service Discovery.",
                    "Swarm-based Drone-as-a-Service (SDaaS) for Delivery.",
                    "A Game-Theoretic Drone-as-a-Service Composition for Delivery.",
                    "Efficient Search for Moving Object Devices in Internet of Things Networks.",
                    "Event Detection on Monitoring Internet of Things Services by Fusing Multiple Observations.",
                    "IoT Services Configuration in Edge-Cloud Collaboration Networks.",
                    "BrowserVM: Running Unmodified Operating Systems and Applications in Browsers.",
                    "Lead Time-Aware Proactive Adaptation for Service-Oriented Systems.",
                    "A-SARSA: A Predictive Container Auto-Scaling Algorithm Based on Reinforcement Learning.",
                    "A Novel Data Placement Strategy for Data-Sharing Scientific Workflows in Heterogeneous Edge-Cloud Computing Environments.",
                    "PrTaurus: An Availability-Enhanced EMR Service on Preemptible Cloud Instances.",
                    "An Attention-based Neural Model for Popularity Prediction in Social Service.",
                    "Enhancing Cross-domain Recommendation through Preference Structure Information Sharing.",
                    "Latent Group Recommendation based on Double Fuzzy Clustering and Matrix Tri-factorization.",
                    "Structure Reinforcing and Attribute Weakening Network based API Recommendation Approach for Mashup Creation.",
                    "Efficient and Privacy-Preserving Federated QoS Prediction for Cloud Services.",
                    "Remaining Time Prediction of Business Processes based on Multilayer Machine Learning.",
                    "A Deep Concept-aware Model for predicting and explaining restaurant future status."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "26th IEEE ICWS 2019",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2019",
                "sub_name": "2019 IEEE International Conference on Web Services, ICWS 2019, Milan, Italy, July 8-13, 2019.",
                "count": 70,
                "papers": [
                    "P-STM: Privacy-Protected Social Tie Mining of Individual Trajectories.",
                    "Privacy-Preserving Architecture for Cloud-IoT Platforms.",
                    "Federated AI for the Enterprise: A Web Services Based Implementation.",
                    "Composing Drone-as-a-Service (DaaS) for Delivery.",
                    "A Semantic Approach for Automating Knowledge in Policies of Cyber Insurance Services.",
                    "Effect-Driven Dynamic Selection of Physical Media for Visual IoT Services Using Reinforcement Learning.",
                    "IoT Service Composition for Concurrent Timed Applications.",
                    "Service Specification and Discovery in IoT Networks.",
                    "MS-Rank: Multi-Metric and Self-Adaptive Root Cause Diagnosis for Microservice Applications.",
                    "Microscaler: Automatic Scaling for Microservices with an Online Learning Approach.",
                    "Reg: An Ultra-Lightweight Container That Maximizes Memory Sharing and Minimizes the Runtime Environment.",
                    "Service Capacity Enhanced Task Offloading and Resource Allocation in Multi-Server Edge Computing Environment.",
                    "Mobility-Aware and Migration-Enabled Online Edge User Allocation in Mobile Edge Computing.",
                    "Data Caching Optimization in the Edge Computing Environment.",
                    "Availability-Aware Service Chain Composition and Mapping in NFV-Enabled Networks.",
                    "Pre-Joined Semantic Indexing Graph for QoS-Aware Service Composition.",
                    "Identifying and Estimating Technical Debt for Service Composition in SaaS Cloud.",
                    "Diversified Quality Centric Service Recommendation.",
                    "Deep Attentive Factorization Machine for App Recommendation Service.",
                    "SocialST: Social Liveness and Trust Enhancement Based Social Recommendation.",
                    "Automatic K-Resources Discovery for Hybrid Web Connected Environments.",
                    "Multiple Energy Harvesting Devices Enabled Joint Computation Offloading and Dynamic Resource Allocation for Mobile-Edge Computing Systems.",
                    "A Community-Based Collaborative Filtering Method for Social Recommender Systems.",
                    "Towards a Service-Oriented Architecture for Pre-Processing Crowd-Sourced Sentiment from Twitter.",
                    "Adaptive Trust: Usage-Based Trust in Crowdsourced IoT Services.",
                    "Reputation Evaluation with Malicious Feedback Prevention Using a HITS-Based Model.",
                    "Machine Learning-Driven Trust Prediction for MEC-Based IoT Services.",
                    "A Mobility-Aware Cross-Edge Computation Offloading Framework for Partitionable Applications.",
                    "Mobility-Aware Service Selection in Mobile Edge Computing Systems.",
                    "A Multi-Objective Crowdsourcing Method for Mobile Video Streaming.",
                    "Block Chain-Based Data Audit and Access Control Mechanism in Service Collaboration.",
                    "A Full-Spectrum Blockchain-as-a-Service for Business Collaboration.",
                    "Services as Enterprise Smart Contracts in the Digital Factory.",
                    "A Conceptual Architecture and Model for Smart Manufacturing Relying on Service-Based Digital Twins.",
                    "Crossover Service Fusion Approach Based on Microservice Architecture.",
                    "Bandwidth Planning of Web Services in Changing Contexts Based on Network Simulation.",
                    "Relationship Network Augmented Web Services Clustering.",
                    "FASS: A Fairness-Aware Approach for Concurrent Service Selection with Constraints.",
                    "Clustering Based Approach for Web Service Selection Using Skyline Computations.",
                    "Generative Adversarial Network Based Service Recommendation in Heterogeneous Information Networks.",
                    "Recommending Packages of Multi-Criteria Items to Groups.",
                    "CSSAP: Software Aging Prediction for Cloud Services Based on ARIMA-LSTM Hybrid Model.",
                    "DCStore: A Deduplication-Based Cloud-of-Clouds Storage Service.",
                    "An Online Algorithm for Selling Your Reserved IaaS Instances in Amazon EC2 Marketplace.",
                    "Long-Term IaaS Provider Selection Using Short-Term Trial Experience.",
                    "Deep Representation Learning of Activity Trajectory Similarity Computation.",
                    "Edge-Based Shortest Path Caching for Location-Based Services.",
                    "A First Look at Instant Service Consumption with Quick Apps on Mobile Devices.",
                    "ElfStore: A Resilient Data Storage Service for Federated Edge and Fog Resources.",
                    "A Data-Driven Service Creation Approach for Effectively Capturing Events from Multiple Sensor Streams.",
                    "Data-Intensive Application Deployment at Edge: A Deep Reinforcement Learning Approach.",
                    "Outcome-Oriented Predictive Process Monitoring with Attention-Based Bidirectional LSTM Neural Networks.",
                    "Selecting Publishing Points for the Optimal Sharing of Predictive Monitoring Information of a Service Process.",
                    "AIMS: A Predictive Web API Invocation Behavior Monitoring System.",
                    "A Novel Part of Speech Tagging Framework for NLP Based Business Process Management.",
                    "Filtering Out Noise Logs for Process Modelling Based on Event Dependency.",
                    "On-the-Fly Collaboration for Legacy Business Process Systems in an Open Service Environment.",
                    "Deep Multimodal Learning: An Effective Method for Video Classification.",
                    "Promoting Higher Revenues for Both Crowdsourcer and Crowds in Crowdsourcing via Contest.",
                    "KS-Diff: A Key Structure Based Difference Detection Method for Process Models.",
                    "Value Attribution through Provenance Tracking in Blockchain Networks.",
                    "On Computing Throttling Rate Limits in Web APIs through Statistical Inference.",
                    "Equivalence-Enhanced Microservice Workflow Orchestration to Efficiently Increase Reliability.",
                    "DeepWSC: A Novel Framework with Deep Neural Network for Web Service Clustering.",
                    "Adaptable Deep Learning Generation by Automatic Service Composition.",
                    "Deep Learning for Web Services Classification.",
                    "Checking Temporal Service Level Agreements for Web Service Compositions with Temporal Parameters.",
                    "Customizing Multi-Tenant SaaS by Microservices: A Reference Architecture.",
                    "GTAA: A Geo-Aware Task Allocation Approach in Cloud Workflow.",
                    "VCA-Optimizer: SOA-Based Customizable Virtual Cluster Allocation in the Cloud Datacenter."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "25th IEEE ICWS 2018",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2018",
                "sub_name": "2018 IEEE International Conference on Web Services, ICWS 2018, San Francisco, CA, USA, July 2-7, 2018.",
                "count": 59,
                "papers": [
                    "DKEM: A Distributed Knowledge Based Evolution Model for Service Ecosystem.",
                    "URoad: An Efficient Algorithm for Large-Scale Dynamic Ridesharing Service.",
                    "CCRS: Web Service for Chinese Character Recognition.",
                    "A Hybrid Memetic Approach for Fully Automated Multi-Objective Web Service Composition.",
                    "Personalized LSTM Based Matrix Factorization for Online QoS Prediction.",
                    "PRNN: Piecewise Recurrent Neural Networks for Predicting the Tendency of Services Invocation.",
                    "Linked USDL Privacy: Describing Privacy Policies for Services.",
                    "Confidential Business Process Execution on Blockchain.",
                    "X-Diag: Automated Debugging Cross-Browser Issues in Web Applications.",
                    "Energy-Efficient WSN Service Composition for Concurrent Applications.",
                    "MeCo-TSM: Multi-Entity Complex Process-Oriented Service Modeling Method.",
                    "A Recommendation Algorithm Based on Dynamic User Preference and Service Quality.",
                    "Log2Sim: Automating What-If Modeling and Prediction for Bandwidth Management of Cloud Hosted Web Services.",
                    "A Service Annotation Quality Improvement Approach Based on Efficient Human Intervention.",
                    "Factorization Machine Based Service Recommendation on Heterogeneous Information Networks.",
                    "GHTraffic: A Dataset for Reproducible Research in Service-Oriented Computing.",
                    "Formal Verification of Stateful Services with REST APIs Using Event-B.",
                    "QCSS: A QoE-Aware Control Plane for Adaptive Streaming Service over Mobile Edge Computing Infrastructures.",
                    "Cloud-Based Framework for Scalable and Real-Time Multi-Robot SLAM.",
                    "Seamless Integration of Cloud and Edge with a Service-Based Approach.",
                    "Quality Based Data Integration for Enriching User Data Sources in Service Lakes.",
                    "FMSR: A Fairness-Aware Mobile Service Recommendation Method.",
                    "Clothes Collocation Recommendations by Compatibility Learning.",
                    "IFTM - Unsupervised Anomaly Detection for Virtualized Network Function Services.",
                    "Enhanced Web Application and Browsing Performance through Service-Worker Infusion Framework.",
                    "Configurable Event Correlation for Process Discovery from Object-Centric Event Data.",
                    "Functionality-Oriented Microservice Extraction Based on Execution Trace Clustering.",
                    "Subscription or Pay-as-You-Go: Optimally Purchasing IaaS Instances in Public Clouds.",
                    "Performance Analysis of Service Clouds Serving Composite Service Application Jobs.",
                    "NL2API: A Framework for Bootstrapping Service Recommendation Using Natural Language Queries.",
                    "A Sequential Recommendation for Mobile Apps: What Will User Click Next App?",
                    "PFS: A Personalized Flight Recommendation Service via Cross-Domain Triadic Factorization.",
                    "Hitting Three Birds with One System: A Voice-Based CAPTCHA for the Modern User.",
                    "A Web Service for Author Name Disambiguation in Scholarly Databases.",
                    "Domino: Graph Processing Services on Energy-Efficient Hardware Accelerator.",
                    "Semantic-Based Information Sharing in Vehicular Networks.",
                    "(WIP) Correlation-Driven Service Event Routing for Predictive Industrial Maintenance.",
                    "A Truthful Mechanism for Scheduling and Pricing Pleasingly Parallel Jobs in a Service Cloud.",
                    "CommuteShare: A Ridesharing Service for Daily Commuters Using Cross-Domain Urban Big Data.",
                    "A Probabilistic Model for Service Clustering - Jointly Using Service Invocation and Service Characteristics.",
                    "Microservice Based Video Cloud Platform with Performance-Aware Service Path Selection.",
                    "Schema Slicing Methods to Reduce Development Costs of WSDL-Based Web Services.",
                    "When to Invoke a Prediction Service? A Reinforcement Learning-Based Approach.",
                    "HPC2-ARS: An Architecture for Real-Time Analytic of Big Data Streams.",
                    "A Service-Based Fog Execution Environment for the IoT-Aware Business Process Applications.",
                    "A Web Service to Generate Intelligent Previews of Web Links.",
                    "Web Services for Emergencies: Multi-Transport, Multi-Cloud, Multi-Role.",
                    "I Like Your Tagged Photos, But Do We Know Each Other?: Analyzing the Role of Tags in Like Networks.",
                    "An Efficient Distributed-Computing Framework for Association-Rule-Based Recommendation.",
                    "A User-Oriented Approach toward Price Prediction for IaaS Service.",
                    "Discovering Spatio-Temporal Relationships among IoT Services.",
                    "Improving Service Recommendation by Alleviating the Sparsity with a Novel Ontology-Based Clustering.",
                    "Service Selection for Composition in Mobile Edge Computing Systems.",
                    "Trust in Social-Sensor Cloud Service.",
                    "Extinguishing the Backfire Effect: Using Emotions in Online Social Collaborative Argumentation for Fact Checking.",
                    "Adaptive Cache Replacement in Efficiently Querying Semantic Big Data.",
                    "On Integrating Knowledge Graph Embedding into SPARQL Query Processing.",
                    "High Performance Visual Inspection Service Architecture - Squeezing the Most Out of Commodity Servers.",
                    "Pipekit: A Deployment Tool with Advanced Scheduling and Inter-Service Communication for Multi-Tier Applications."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "24th ICWS 2017",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2017",
                "sub_name": "2017 IEEE International Conference on Web Services, ICWS 2017, Honolulu, HI, USA, June 25-30, 2017.",
                "count": 126,
                "papers": [
                    "On the Effects of User Ratings on the Profitability of Cloud Services.",
                    "WE-LDA: A Word Embeddings Augmented LDA Model for Web Services Clustering.",
                    "CARP: Context-Aware Reliability Prediction of Black-Box Web Services.",
                    "An Approach for Anomaly Diagnosis Based on Hybrid Graph Model with Logs for Distributed Services.",
                    "Drain: An Online Log Parsing Approach with Fixed Depth Tree.",
                    "RaaS and Hierarchical Aggregation Revisited.",
                    "Privacy-Preserving Distributed Service Recommendation Based on Locality-Sensitive Hashing.",
                    "Recommendation for Newborn Services by Divide-and-Conquer.",
                    "A Novel Framework for Service Set Recommendation in Mashup Creation.",
                    "What Biscuits to Put in the Basket? Features Prediction in Release Management for Android System.",
                    "Online Reliability Prediction via Long Short Term Memory for Service-Oriented Systems.",
                    "Freelancer Influence Evaluation and Gig Service Quality Prediction in Fiverr.",
                    "Linking Design-Time and Run-Time: A Graph-Based Uniform Workflow Provenance Model.",
                    "Propagation-Aware Temporal Verification for Parallel Business Cloud Workflows.",
                    "Estimation of Distribution with Restricted Boltzmann Machine for Adaptive Service Composition.",
                    "A Novel Data Set Importance Based Cost-Effective and Computation-Efficient Storage Strategy in the Cloud.",
                    "Selling Reserved Instances through Pay-as-You-Go Model in Cloud Computing.",
                    "Linked REST APIs: A Middleware for Semantic REST API Integration.",
                    "A Web Service QoS Forecasting Approach Based on Multivariate Time Series.",
                    "Nash Equilibrium and Decentralized Pricing for QoS Aware Service Composition in Cloud Computing Environments.",
                    "A Learning Approach to QoS Prediction via Multi-Dimensional Context.",
                    "Web Service Interface Decomposition Using Formal Concept Analysis.",
                    "Self-Awareness for Dynamic Knowledge Management in Self-Adaptive Volunteer Services.",
                    "The Aspect of Data Translation in Service Similarity.",
                    "Efficient Caching for Peer-to-Peer Service Discovery in Internet of Things.",
                    "An Agent-Based Decentralised Service Monitoring Approach in Multi-Tenant Service-Based Systems.",
                    "QoECenter: A Visual Platform for QoE Evaluation of Streaming Video Services.",
                    "A Fine-Grained API Link Prediction Approach Supporting Mashup Recommendation.",
                    "Correlation-Aware Multi-Label Active Learning for Web Service Tag Recommendation.",
                    "An Experimental Study of a Biosequence Big Data Analysis Service.",
                    "CrowdDefense: A Trust Vector-Based Threat Defense Model in Crowdsourcing Environments.",
                    "AppCheck: A Crowdsourced Testing Service for Android Applications.",
                    "Mobile Application Rating Prediction via Feature-Oriented Matrix Factorization.",
                    "Oblivious Multi-Keyword Search for Secure Cloud Storage Service.",
                    "Extracting Fine-Grained Service Value Features and Distributions for Accurate Service Recommendation.",
                    "Service Recommendation Based on Targeted Reconstruction of Service Descriptions.",
                    "Interactive Data Exploration as a Service for the Smart Factory.",
                    "ProductRec: Product Bundle Recommendation Based on User's Sequential Patterns in Social Networking Service Environment.",
                    "GTRM: A Top-N Recommendation Model for Smartphone Applications.",
                    "Expert as a Service: Software Expert Recommendation via Knowledge Domain Embeddings in Stack Overflow.",
                    "Formulating Criticality-Based Cost-Effective Monitoring Strategies for Multi-Tenant Service-Based Systems.",
                    "Light Weight Key-Value Store for Efficient Services on Local Distributed Mobile Devices.",
                    "On the Value of Quality of Service Attributes for Detecting Bad Design Practices.",
                    "EAaaS: Edge Analytics as a Service.",
                    "Constraint-Driven Dynamic Workflow for Automation of Big Data Analytics Based on GraphPlan.",
                    "Detecting Refactorings among Multiple Web Service Releases: A Heuristic-Based Approach.",
                    "xFilter: A Temporal Locality Accelerator for Intrusion Detection System Services.",
                    "Recommending Services for New Mashups through Service Factors and Top-K Neighbors.",
                    "Log-based Abnormal Task Detection and Root Cause Analysis for Spark.",
                    "Identifying Key Resources in a Social Network Using f-PageRank.",
                    "Natural Language Processing Service Based on Stroke-Level Convolutional Networks for Chinese Text Classification.",
                    "SaaS for Automated Job Performance Appraisals Using Service Technologies and Big Data Analytics.",
                    "Evaluation and Trade-offs of Graph Processing for Cloud Services.",
                    "MURS: Mitigating Memory Pressure in Service-Oriented Data Processing System.",
                    "How Web Services Can Be Tolerant to Intruders through Diversification.",
                    "Probability Matrix of Request-Solution Mapping for Efficient Service Selection.",
                    "Indoor Localization Service Based on Hybrid Fingerprint Map.",
                    "QoS Based Framework for Configurable IaaS Cloud Services Discovery.",
                    "Blockchain Based Data Integrity Service Framework for IoT Data.",
                    "Fuzzy QoS Modeling of IT Maintenance Tickets.",
                    "From Open API to Semantic Specifications and Code Adapters.",
                    "Real-Time Soft Resource Allocation in Multi-Tier Web Service Systems.",
                    "Characterizing the Impacts of Application Layer DDoS Attacks.",
                    "Social-Sensor Cloud Service Selection.",
                    "Subjective Evaluation of Market-Driven Cloud Services.",
                    "Extraction of Microservices from Monolithic Software Architectures.",
                    "A Machine Learning-Based Approach to Detect Web Service Design Defects.",
                    "Improving Web Services Design Quality Using Heuristic Search and Machine Learning.",
                    "RestSep: Towards a Test-Oriented Privilege Partitioning Approach for RESTful APIs.",
                    "Multi-Client Verifiable Computation Service for Outsourced Data.",
                    "A Map-Matching Service Designed for Courier Trajectories.",
                    "A Service-Based Approach to Situational Correlation and Analyses of Stream Sensor Data.",
                    "A Cross-Layer Security Solution for Publish/Subscribe-Based IoT Services Communication Infrastructure.",
                    "Multi-Constrained Top-K Graph Pattern Matching in Contextual Social Graphs.",
                    "Automated Holistic Service Composition: Modeling and Composition Reasoning Techniques.",
                    "FB-Diff: A Feature Based Difference Detection Algorithm for Process Models.",
                    "Security Mechanism for Packaged Web Applications.",
                    "Gig Services Recommendation Method for Fuzzy Requirement Description.",
                    "RedLiner: Measuring Service Capacity with Live Production Traffic.",
                    "Early Air Pollution Forecasting as a Service: An Ensemble Learning Approach.",
                    "Enabling Multi-Topic and Cross-Language Browsing Using Web-Semantics Service.",
                    "A Location and Reputation Aware Matrix Factorization Approach for Personalized Quality of Service Prediction.",
                    "Sentiment Analysis as a Service: A Social Media Based Sentiment Analysis Framework.",
                    "Linking Services to Websites by Leveraging Semantic Data.",
                    "A Bayesian Nash Equilibrium of QoS-Aware Web Service Composition.",
                    "\"Learning Relevance\" as a Service for Improving Search Results in Technical Discussion Forums.",
                    "Learning Transportation Mode Choice for Context-Aware Services with Directed-Graph-Guided Fused Lasso from GPS Trajectory Data.",
                    "A Hierarchical Categorization Approach for System Operation Services.",
                    "Hierarchical RNN Networks for Structured Semantic Web API Model Learning and Extraction.",
                    "WSO: Developer-Oriented Transactional Orchestration of Web-Services.",
                    "Grouping Users Using a Combination-Based Clustering Algorithm in the Service Environment.",
                    "I Know You Are Watching Me: Stackelberg-Based Adaptive Intrusion Detection Strategy for Insider Attacks in the Cloud.",
                    "On Automating Decentralized Multi-Step Service Combination.",
                    "Improving Web Service Clustering through a Novel Ontology Generation Method by Domain Specificity.",
                    "Correctness Verification for Service-Based Business Processes.",
                    "An Approach towards Task Abstraction and Aggregation in Business Processes.",
                    "PD-TRP: A Service Composition Approach for the Personalized and Optimized Door-to-Door Travel Plan Recommendation.",
                    "Automatically Learning User Preferences for Personalized Service Composition.",
                    "EWS: A Pattern Prediction-Based Elastic Workflow Service in the Cloud.",
                    "INTENSE: INteroperability TEstiNg as a SErvice.",
                    "User Requirements Based Service Identification for Big Data.",
                    "Proactive Personalized Services in Large-Scale IoT-Based Healthcare Application.",
                    "GenServ: Genome Sequencing Services on Scalable Energy Efficient Accelerators.",
                    "SmartDODS: A Smart Dynamic Order Dispatch System for Short-Distance Instant Logistics Service.",
                    "SES-LSH: Shuffle-Efficient Locality Sensitive Hashing for Distributed Similarity Search.",
                    "Towards a Visualization Framework for Service Selection in Cloud E-Marketplaces.",
                    "Genetic-Based Configurable Cloud Resource Allocation in QoS-Aware Business Process Development.",
                    "An Online Data-Oriented Authentication Based on Merkle Tree with Improved Reliability.",
                    "A Case for Memory Frequency Sensitivity.",
                    "Towards Reliable Online Services Analyzing Mobile Sensor Big Data.",
                    "Hybrid Measurement of Air Quality as a Mobile Service: An Image Based Approach.",
                    "Unlicensed Taxis Detection Service Based on Large-Scale Vehicles Mobility Data.",
                    "Intrusion Detection with Unsupervised Heterogeneous Ensembles Using Cluster-Based Normalization.",
                    "Spotting Fake News: A Social Argumentation Framework for Scrutinizing Alternative Facts.",
                    "Visual Configuration for RESTful Mobile Web Mashups.",
                    "A Keyword-Driven Data Service Composition Sequence Generation Approach on Ad-Hoc Data Query.",
                    "Multi-Level Privacy-Preserving Access Control as a Service for Personal Healthcare Monitoring.",
                    "Data Flow-Oriented Multi-Path Semantic Web Service Composition Using Extended SPARQL.",
                    "Penalty Based Mathematical Models for Web Service Composition in a Geo-Distributed Cloud Environment.",
                    "Service2vec: A Vector Representation for Web Services.",
                    "Towards Uncertain QoS-Aware Service Composition via Multi-Objective Optimization.",
                    "Parallelized Mobility-Aware Complex Event Processing.",
                    "Service Hyperlink: Modeling and Reusing Partial Process Knowledge by Mining Event Dependencies among Sensor Data Services.",
                    "Pursuing Differentiated Services in a SDN-Based IoT-Oriented Pub/Sub System.",
                    "SPEC2REST: An Approach for Eliciting Web API Resources from Existing Applications.",
                    "A Benchmark Dataset for Evaluating Process Similarity Search Methods."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "23rd ICWS 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2016",
                "sub_name": "IEEE International Conference on Web Services, ICWS 2016, San Francisco, CA, USA, June 27 - July 2, 2016.",
                "count": 102,
                "papers": [
                    "CrowdRec: Trust-Aware Worker Recommendation in Crowdsourcing Environments.",
                    "Group Recommendations Based on Comprehensive Latent Relationship Discovery.",
                    "A Service Recommendation Algorithm Based on Modeling of Implicit Demands.",
                    "SeCo-LDA: Mining Service Co-occurrence Topics for Recommendation.",
                    "iBalloon: Efficient VM Memory Balancing as a Service.",
                    "A Dispute Arbitration Protocol Based on a Peer-to-Peer Service Contract Management Scheme.",
                    "An LDA-SVM Active Learning Framework for Web Service Classification.",
                    "Automatic Hierarchical Reinforcement Learning for Efficient Large-Scale Service Composition.",
                    "Mining Bilateral Patterns as Priori Knowledge for Efficient Service Composition.",
                    "Probabilistic Approach for Diversifying Web Services Discovery and Composition.",
                    "A Bloom Filter-Powered Technique Supporting Scalable Semantic Service Discovery in Service Networks.",
                    "SIM: An Automated Approach to Improve Web Service Interface Modularization.",
                    "Multi-tenant Access and Information Flow Control for SaaS.",
                    "Strong Social Component-Aware Trust Sub-network Extraction in Contextual Social Networks.",
                    "SocialMix: Supporting Privacy-Aware Trusted Social Networking Services.",
                    "X-Check: A Novel Cross-Browser Testing Service Based on Record/Replay.",
                    "What Do Client Developers Concern When Using Web APIs? An Empirical Study on Developer Forums and Stack Overflow.",
                    "An Intelligent QoS Identification for Untrustworthy Web Services via Two-Phase Neural Networks.",
                    "Scaling Up Web Service Composition with the Skyline Operator.",
                    "BPCS: A Block-Based Service Process Caching Strategy to Accelerate the Execution of Service Processes.",
                    "FairPlay: Services Migration with Lock-Free Mechanisms for Load Balancing in Cloud Architectures.",
                    "On Implementing a Text-Database-as-a-Service.",
                    "Indoor Localization Service Based on the Data Fusion of Wi-Fi and RFID.",
                    "User Preference Based Link Inference for Social Network.",
                    "Time-Aware Collaborative Poisson Factorization for Service Recommendation.",
                    "Asymmetric Correlation Regularized Matrix Factorization for Web Service Recommendation.",
                    "Mashup Service Clustering Based on an Integration of Service Content and Network via Exploiting a Two-Level Topic Model.",
                    "A Personalized Service for Scheduling Express Delivery Using Courier Trajectories.",
                    "Constraints-Driven Service Composition in Mobile Cloud Computing.",
                    "Incremental Composition for Adaptive By-Design Service Based Systems.",
                    "A Study on Online Social Networks Theme Semantic Computing Model.",
                    "A Temporal-Aware Hybrid Collaborative Recommendation Method for Cloud Service.",
                    "Joint Modeling Users, Services, Mashups, and Topics for Service Recommendation.",
                    "Efficient Promotion Algorithm by Exploring Group Preference in Recommendation.",
                    "Service Recommendation for User Groups in Internet of Things Environments Using Member Organization-Based Group Similarity Measures.",
                    "Identifying Core Users Based on Trust Relationships and Interest Similarity in Recommender System.",
                    "CAMER: A Context-Aware Mobile Service Recommendation System.",
                    "Exploring the Effectiveness of True Abnormal Data Elimination in Context-Aware Web Services Recommendation.",
                    "Self-Organization Based Service Discovery Approach Considering Intermediary Utility.",
                    "Inferring Service Recommendation from Natural Language API Descriptions.",
                    "Big Data Analytic Service Discovery Using Social Service Network with Domain Ontology and Workflow Awareness.",
                    "MISDA: Web Services Discovery Approach Based on Mining Interface Semantics.",
                    "Alliance-Aware Service Composition Based on Quotient Space.",
                    "Mining User Intents to Compose Services for End-Users.",
                    "Model Checking of Composite Cloud Services.",
                    "A Management Life Cycle for Data-Aware Service Choreographies.",
                    "Building Blocks of Mayan: Componentizing the eScience Workflows through Software-Defined Service Composition.",
                    "An Optimal Engine Component Placement Strategy for Cloud Workflow Service.",
                    "QSCAS: QoS Aware Web Service Composition Algorithms with Stochastic Parameters.",
                    "SVM-Based Efficient QoS-Aware Runtime Adaptation for Service Oriented Systems.",
                    "A Reliability-Oriented Web Service Discovery Scheme with Cross-Layer Design in MANET.",
                    "Privacy Preserving Access Control in Service-Oriented Architecture.",
                    "Toward Discovering and Exploiting Private Server-Side Web APIs.",
                    "PVSAE: A Public Verifiable Searchable Encryption Service Framework for Outsourced Encrypted Data.",
                    "Exploiting Heterogeneous Information for Tag Recommendation in API Management.",
                    "A Probabilistic Topic Model for Mashup Tag Recommendation.",
                    "Service Package Recommendation for Mashup Creation via Mashup Textual Description Mining.",
                    "An Event-B Based Approach for Ensuring Correct Configurable Business Processes.",
                    "Representative BPMN 2.0 Process Model Generation from Recurring Structures.",
                    "Statically Detect Data Races for WS-BPEL Web Services by Constraint Solver.",
                    "Adaptive Analytic Service for Real-Time Internet of Things Applications.",
                    "AppReco: Behavior-Aware Recommendation for iOS Mobile Applications.",
                    "Method for Fast and Accurate Extraction of Key Information from Webpages.",
                    "An Uncertainty-Aware Evolutionary Scheduling Method for Cloud Service Provisioning.",
                    "RTA: Real Time Actionable Events Detection as a Service.",
                    "Integrating Theoretical Modeling and Experimental Measurement for Soft Resource Allocation in Multi-tier Web Systems.",
                    "Persistence and Recovery for In-Memory NoSQL Services: A Measurement Study.",
                    "Shilling Attacks Analysis in Collaborative Filtering Based Web Service Recommendation Systems.",
                    "Efficient Computation of Ordering Relations with Time and Probability Constraints for Workflow Models.",
                    "Aggregating Ordinal User Preferences for Effective Reputation Computation of Online Services.",
                    "On Instant Knowledge Evolution from Learning User Search Intent.",
                    "Spark-Based Parallel Cooperative Co-evolution Particle Swarm Optimization Algorithm.",
                    "Sakura: Services for Efficient Data-Consumption in Support of Incremental Web-Service Development.",
                    "Identification of Web Service Refactoring Opportunities as a Multi-objective Problem.",
                    "A Framework to Improve the Availability of Stream Computing.",
                    "A Hybrid Web Rendering Framework on Cloud.",
                    "Ozy: A General Orchestration Container.",
                    "A Generic Framework for Recommendations Based on User Data Aggregation.",
                    "PLMwsp: Probabilistic Latent Model for Web Service QoS Prediction.",
                    "An Exact Cover-Based Approach for Service Composition.",
                    "Time-Aware and Sparsity-Tolerant QoS Prediction Based on Collaborative Filtering.",
                    "Using Collaborative Filtering to Automate Worker-Job Recommendations for Crowdsourcing Services.",
                    "InnerCache: A Tactful Cache Mechanism for RDMA-Based Key-Value Store.",
                    "On the Expandability and Fidelity of Distributed Line Graphs.",
                    "Discovering Web Services with Reliable Quality: System Architecture and Algorithms.",
                    "Intelligent Web Push Architecture with Push Flow Control and Push Continuity.",
                    "SOLAR: Services-Oriented Learning Architectures.",
                    "RestPL: Towards a Request-Oriented Policy Language for Arbitrary RESTful APIs.",
                    "Minimally Invasive Semantification of Light Weight Service Descriptions.",
                    "Scheduling Stochastic Multi-stage Jobs on Elastic Computing Services in Hybrid Clouds.",
                    "MonValley: An Unified Monitoring and Management Framework for Cloud Services.",
                    "Semantic SLAs for Services with Q-SLA.",
                    "Optimized Composite Service Transactions through Execution Results Prediction.",
                    "Layer-Hierarchical Scientific Workflow Recommendation.",
                    "Cost Optimization Oriented Dynamic Resource Allocation for Service-based System in the Cloud Environment.",
                    "An Approach for Service Selection Based on Developers' Ranking.",
                    "An Efficient and Effective Overlapping Communities Discovery Based on Agglomerative Graph.",
                    "Interval Number Based Service Selection for Multi-users' Requirements.",
                    "USER: A Usage-Based Service Recommendation Approach.",
                    "An Adaptive Decision Making Approach Based on Reinforcement Learning for Self-Managed Cloud Applications.",
                    "Cloud-of-Clouds Storage Made Efficient: A Pipeline-Based Approach.",
                    "User-Specific Rating Prediction for Mobile Applications via Weight-Based Matrix Factorization."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "22nd ICWS 2015",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2015",
                "sub_name": "2015 IEEE International Conference on Web Services, ICWS 2015, New York, NY, USA, June 27 - July 2, 2015.",
                "count": 102,
                "papers": [
                    "Stabilising Performance in Cloud Services Composition Using Portfolio Theory.",
                    "A Scalable and Approximate Mechanism for Web Service Composition.",
                    "Formal Behavioral Modeling for Verifying SCA Composition with Event-B.",
                    "Set-Based Bi-level Optimisation for QoS-Aware Service Composition in Ubiquitous Environments.",
                    "A Collaborative Approach to Predicting Service Price for QoS-Aware Service Selection.",
                    "A QoS and Trust Prediction Framework for Context-Aware Composed Distributed Systems.",
                    "Predicting Dynamic Requests Behavior in Long-Term IaaS Service Composition.",
                    "Self-Adaptive Volunteered Services Composition through Stimulus- and Time-Awareness.",
                    "Heuristic Based Time-Aware Service Selection Approach.",
                    "SPL-TQSSS: A Software Product Line Approach for Stateful Service Selection.",
                    "Using WADL Specifications to Develop and Maintain REST Client Applications.",
                    "Climate Analytics Workflow Recommendation as a Service - Provenance-Driven Automatic Workflow Mashup.",
                    "Integrator: An Architecture for an Integrated Cloud/On-Premise Data-Service.",
                    "Heuristic Recovery of Missing Events in Process Logs.",
                    "A Diffusion Model with Constant Source and Sinks for Social Graph Partitioning.",
                    "Crowd Trust: A Context-Aware Trust Model for Worker Selection in Crowdsourcing Environments.",
                    "Mapping Elements with the Hungarian Algorithm: An Efficient Method for Querying Business Process Models.",
                    "Linked USDL Agreement: Effectively Sharing Semantic Service Level Agreements on the Web.",
                    "A Novel QoS Monitoring Approach Sensitive to Environmental Factors.",
                    "Extracting, Ranking, and Evaluating Quality Features of Web Services through User Review Sentiment Analysis.",
                    "QoS Prediction of Web Services Based on Two-Phase K-Means Clustering.",
                    "A Learning Approach to the Prediction of Reliability Ranking for Web Services.",
                    "Location-Based Web Service QoS Prediction via Preference Propagation for Improving Cold Start Problem.",
                    "Incorporating User, Topic, and Service Related Latent Factors into Web Service Recommendation.",
                    "WS-HFS: A Heterogeneous Feature Selection Framework for Web Services Mining.",
                    "Learning Sparse Functional Factors for Large-Scale Service Clustering.",
                    "Service Recommendation for Mashup Creation Based on Time-Aware Collaborative Domain Regression.",
                    "Service Recommendation for Mashup Composition with Implicit Correlation Regularization.",
                    "Modeling Temporal Effectiveness for Context-Aware Web Services Recommendation.",
                    "Web Service Recommendation Based on Time Series Forecasting and Collaborative Filtering.",
                    "A Privacy-Preserving QoS Prediction Framework for Web Service Recommendation.",
                    "Predicting QoS Values via Multi-dimensional QoS Data for Web Service Recommendations.",
                    "Clustering Service Networks with Entity, Attribute, and Link Heterogeneity.",
                    "Accelerated Sparse Learning on Tag Annotation for Web Service Discovery.",
                    "Enhanced Service Discovery via Shared Context in a Distributed Architecture.",
                    "K-Anonymity Based Approach for Privacy-Preserving Web Service Selection.",
                    "DAG: A Model for Privacy Preserving Computation.",
                    "A Privacy-Preserving Framework for Constrained Choreographed Service Composition.",
                    "Measuring the Potential for Victimization in Malicious Content.",
                    "Opacity Preserving Abstraction for Web Services and Their Composition Using SOGs.",
                    "BiNet: Trust Sub-network Extraction Using Binary Ant Colony Algorithm in Contextual Social Networks.",
                    "Optimal and Effective Web Service Composition with Trust and User Preference.",
                    "Characterizing RESTful Web Services Usage on Smartphones: A Tale of Native Apps and Web Apps.",
                    "Architecturing Dynamic Data Race Detection as a Cloud-Based Service.",
                    "Location Analytics as a Service: Providing Insights for Heterogeneous Spatiotemporal Data.",
                    "A Novel Lifecycle Framework for Semantic Web Service Annotation Assessment and Optimization.",
                    "COSS: Content-Based Subscription as an IoT Service.",
                    "Regression-Based Bootstrapping of Web Service Reputation Measurement.",
                    "User Familiar Degree Aware Recommender System.",
                    "QoS-Aware Web Service Recommendation Using Collaborative Filtering with PGraph.",
                    "A Collaborative Filtering Method for Personalized Preference-Based Service Recommendation.",
                    "Service Recommendation Using Customer Similarity and Service Usage Pattern.",
                    "An Integrated-Model QoS-Based Graph for Web Service Recommendation.",
                    "Time-Aware API Popularity Prediction via Heterogeneous Features.",
                    "Manifold-Learning Based API Recommendation for Mashup Creation.",
                    "Personal Preference and Trade-Off Based Additive Manufacturing Web Service Selection.",
                    "Service Mining from Legacy Database Applications.",
                    "A Context-Aware Trust-Oriented Influencers Finding in Online Social Networks.",
                    "A Study of Caching Strategies for Web Service Discovery.",
                    "Netcoin: A Traceable P2P Electronic Cash System.",
                    "Supporting End-User Service Composition: A Systematic Review of Current Activities and Tools.",
                    "An XML Based Monadic Framework for REST Service Compositions.",
                    "Ontology-Based Workflow Generation for Intelligent Big Data Analytics.",
                    "A Framework for Transmission Cost Aware Service Selection.",
                    "Toward a Real-Time Service for Landslide Detection: Augmented Explicit Semantic Analysis and Clustering Composition Approaches.",
                    "A Formal Approach for Verifying QoS Variability in Web Services Composition Using EVENT-B.",
                    "A Scalable Approach for Context Based Complex Service Discovery.",
                    "Generating Executable Workflows from Solution Plans.",
                    "An Efficient Resource Allocation Approach Based on a Genetic Algorithm for Composite Services in IoT Environments.",
                    "A Parallel Approach for Service Composition with Complex Structures in Pervasive Environments.",
                    "Paving the Way towards Semi-automatic Design-Time Business Process Model Obfuscation.",
                    "A Model Checking Approach to Analyzing Timed Compatibility in Mediation-Aided Composition of Web Services.",
                    "Hierarchical Aggregation of Consumer Ratings for Service Ecosystem.",
                    "User-QoS-Based Web Service Clustering for QoS Prediction.",
                    "WSWalker: A Random Walk Method for QoS-Aware Web Service Recommendation.",
                    "CAPred: A Prediction Model for Timely QoS.",
                    "QoE Evaluation Based on QoS and QoBiz Parameters Applied to an OTT Service.",
                    "SLA-Aware Tenant Placement and Dynamic Resource Provision in SaaS.",
                    "A Hybrid Complex Event Service Based on IoT Resource Models.",
                    "Designing Large Scale REST APIs Based on REST Chart.",
                    "An Energy-Efficient Inter-organizational Wireless Sensor Data Collection Framework.",
                    "A PT-SOA Model for CPS/IoT Services.",
                    "Intelligent Push Notification for Converged Mobile Computing and Internet of Things.",
                    "A Resilient Framework for Fault Handling in Web Service Oriented Systems.",
                    "A Risk-Evaluation Assisted System for Service Selection.",
                    "Nomads - Enabling Distributed Analytical Service Environments for the Smart City Domain.",
                    "Enabling the Extraction and Insertion of Reusable Choreography Fragments.",
                    "Learning to Reuse User Inputs in Service Composition.",
                    "A Maturity Model for Semantic RESTful Web APIs.",
                    "goDiscovery: Web Service Discovery Made Efficient.",
                    "Canonical Computational Models Based on Formal Concept Analysis for Social Network Analysis and Representation.",
                    "Recommending a Credible Web Service.",
                    "Mash Droid: An Approach to Mobile-Oriented Dynamic Services Discovery and Composition by In-App Search.",
                    "Web Service Composition Based on Reinforcement Learning.",
                    "A Hybrid Local-Global Optimization Strategy for QoS-Aware Service Composition.",
                    "A Non-intrusive Solution to Guarantee Runtime Behavior of Open SCADA Systems.",
                    "Discovering Web Services to Improve Requirements Decomposition.",
                    "STaaS: Spatio Temporal Historian as a Service.",
                    "A Service-Based Framework for Mobile Social Messaging in PaaS Systems.",
                    "An Agent-Based Approach for Invoking Service in Environments with Limited Network Bandwidth.",
                    "Conversion Infrastructure for Maintaining High Availability of Web Services Using Multiple Service Providers.",
                    "A Smart Physical World Based on Service Technologies, Big Data, and Game-Based Crowd Sourcing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "21st ICWS 2014",
        "info": "Anchorage, AK, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2014",
                "sub_name": "2014 IEEE International Conference on Web Services, ICWS, 2014, Anchorage, AK, USA, June 27 - July 2, 2014.",
                "count": 105,
                "papers": [
                    "Partial Selection: An Efficient Approach for QoS-Aware Web Service Composition.",
                    "Pruning Based Service Selection Approach Under QoS and Temporal Constraints.",
                    "Personalized Decision Making for QoS-Based Service Selection.",
                    "Time-Aware Service Recommendation for Mashup Creation in an Evolving Service Ecosystem.",
                    "A Time-Aware and Data Sparsity Tolerant Approach for Web Service Recommendation.",
                    "A Graph-Based Data Model for API Ecosystem Insights.",
                    "Verifying Multiagent-Based Web Service Compositions Regulated by Commitment Protocols.",
                    "Quality of Experience: What End-Users Say about Web Services?",
                    "Inferring Data Contract for Web-Based API.",
                    "Automatic Propagation of User Inputs in Service Composition for End-Users.",
                    "Context-Aware Cloud Service Selection Based on Comparison and Aggregation of User Subjective Assessment and Objective Performance Assessment.",
                    "Context-Aware Filtering and Visualization of Web Service Clusters.",
                    "Landslide Detection Service Based on Composition of Physical and Social Information Services.",
                    "A Web Service for Scholarly Big Data Information Extraction.",
                    "Virtual Location-Based Services: Merging the Physical and Virtual World.",
                    "An Efficient Multiple Trust Paths Finding Algorithm for Trustworthy Service Provider Selection in Real-Time Online Social Network Environments.",
                    "A Model-Driven Approach for REST Compliant Services.",
                    "Secure Web Service Composition with Untrusted Broker.",
                    "Incorporating Invocation Time in Predicting Web Service QoS via Triadic Factorization.",
                    "Leveraging Formal Concept Analysis with Topic Correlation for Service Clustering and Discovery.",
                    "Modelling and Predicting the Data Availability in Decentralized Online Social Networks.",
                    "Delay-Aware Cost Optimization for Dynamic Resource Provisioning in Hybrid Clouds.",
                    "Impacts of Pheromone Modification Strategies in Ant Colony for Data-Intensive Service Provision.",
                    "Learning Efficient Compositions for QoS-Aware Service Provisioning.",
                    "Unraveling and Learning Workflow Models from Interleaved Event Logs.",
                    "Service Evolution Patterns.",
                    "SCKY: A Method for Reusing Service Process Fragments.",
                    "Wire-Speed Differential SOAP Encoding.",
                    "Web Service Orchestration Topic Mining.",
                    "Is XML-Based Test Case Prioritization for Validating WS-BPEL Evolution Effective in Both Average and Adverse Scenarios?",
                    "Spatio-temporal Composition of Sensor Cloud Services.",
                    "TSAaaS: Time Series Analytics as a Service on IoT.",
                    "SDN Northbound REST API with Efficient Caches.",
                    "Time-Aware Collaborative Filtering for QoS-Based Service Recommendation.",
                    "Time-Aware Web Service Recommendations Using Implicit Feedback.",
                    "Web Service Recommendation Based on Watchlist via Temporal and Tag Preference Fusion.",
                    "A Novel Approach for API Recommendation in Mashup Development.",
                    "Location-Based Hierarchical Matrix Factorization for Web Service Recommendation.",
                    "Combining Global and Local Trust for Service Recommendation.",
                    "A Hybrid Fuzzy Framework for Cloud Service Selection.",
                    "Service Composition Pattern Generation for Cloud Migration: A Graph Similarity Analysis Approach.",
                    "Exploring Cloud Service Brokering from an Interface Perspective.",
                    "Cutting Your Cloud Computing Cost for Deadline-Constrained Batch Jobs.",
                    "A Trust Evaluation Method for Cloud Service with Fluctuant QoS and Flexible SLA.",
                    "Modeling Accountable Cloud Services.",
                    "Towards Heuristic Optimization of Complex Service-Based Workflows for Stochastic QoS Attributes.",
                    "Flexible Execution of Adaptable Composed Services.",
                    "Collaborative Web Service QoS Prediction on Unbalanced Data Distribution.",
                    "Data Mining from NoSQL Document-Append Style Storages.",
                    "Effectiveness Assessment of Solid-State Drive Used in Big Data Services.",
                    "Runtime Enforcement of Data-centric Properties for Concurrent Service-Based Applications.",
                    "ITWS: An Extensible Tool for Interoperability Testing of Web Services.",
                    "Web Services and Performance: For eBay Item Visibility Framework.",
                    "Measuring Credit of Web Service.",
                    "Categorial Link: REST Service Composition Based on Category Theory.",
                    "Domain-Aware Service Recommendation for Service Composition.",
                    "Adaptive and Dynamic Service Composition via Multi-agent Reinforcement Learning.",
                    "MagEl: A Magneto-Electric Effect-Inspired Approach for Web Service Composition.",
                    "Improved Genetic Algorithm Based Approach for QoS Aware Web Service Composition.",
                    "Developing a Meta-model to Support End-User Service Composition.",
                    "Towards Flexibility in Transactional Service Compositions.",
                    "A Context-Based Autonomous Construction Approach for Procedural Mashups.",
                    "Discovering Diversity Corrections for Incompatible Web Services.",
                    "S-ABC - A Service-Oriented Artificial Bee Colony Algorithm for Global Optimal Services Selection in Concurrent Requests Environment.",
                    "Correlation-Supported Composite Service Reselection.",
                    "Towards Effectively Identifying RESTful Web Services.",
                    "Low-Latency Service Data Aggregation Using Policy Obligations.",
                    "Policy Conflict Detection in Composite Web Services with RBAC.",
                    "Rule-Based Web Service Validation.",
                    "QoS Uncertainty Filtering for Fast and Reliable Web Service Selection.",
                    "Energy Efficient Dynamic Service Selection for Large-Scale Web Service Systems.",
                    "Quality Failure Prediction for the Self-Healing of Service-Oriented System of Systems.",
                    "Performance Functions for QoS Prediction in Web Service Composites.",
                    "A Novel Online Reliability Prediction Approach for Service-Oriented Systems.",
                    "Parameter Tuning for ABC-Based Service Composition with End-to-End QoS Constraints.",
                    "A Resource-Oriented Services Platform for Managing Software Supply Chains and Its Experience.",
                    "PEESOS: A Web Tool for Planning and Execution of Experiments in Service Oriented Systems.",
                    "A Novel Web Service Directory Framework for Mobile Environments.",
                    "Annotating Web Service Sections with Combined Classification.",
                    "A Framework for Semantic Description of RESTful Web APIs.",
                    "Ranking Web Services with Limited and Noisy Information.",
                    "Utilizing Web Services Networks for Web Service Innovation.",
                    "Hoop: Offloading HTTP(S) POSTs from User Devices onto Residential Gateways.",
                    "A Context-Aware Intentional Service Prediction Mechanism in PIS.",
                    "Application Configuration Repository for Adaptive Service-Based Systems: Overcoming Challenges in an Evolutionary Online Advertising Environment.",
                    "Dynamic Web Service Composition with QoS Clustering.",
                    "Fast Selection of Web Services with QoS Using a Distributed Parallel Semantic Approach.",
                    "A Utility-Aware Runtime Conflict Resolver for Composite Web Services.",
                    "Trustworthy Service Composition in Service-Oriented Mobile Social Networks.",
                    "Automatic Mining Data-Aware Web Services Properties.",
                    "Supporting End-User Service Composition with Automatically Generated Composite Service Descriptions.",
                    "Component-Based Information Service Platform for Heating Industry.",
                    "RESTful Web Service Mining: Simple Algorithm Supporting Resource-Oriented Systems.",
                    "An Intelligent Admission Control Framework for Composite Services.",
                    "Services Adaptation Based on Domain Ontology and Feature Configuration.",
                    "Constraints Based Web Service Semantic Augmentation.",
                    "Property-Based Testing of JSON Based Web Services.",
                    "A Web Service Selection Framework Based on User's Context and QoS.",
                    "Change-centric Model for Web Service Evolution.",
                    "Service Reconfiguration Architecture Based on Probabilistic Modeling Checking.",
                    "The WSDarwin Toolkit for Service-Client Evolution.",
                    "An Architecture for a Centralized Mediation in Dynamic Manufacturing Networks.",
                    "A Study Case of Restful Frameworks in Raspberry Pi: A Performance and Energy Overview.",
                    "Frequent Pattern Mining Using Semantic FP-Growth for Effective Web Service Ranking.",
                    "A Graph-Based Approach to Assisting Creation of Mobile Web Applications."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "20th ICWS 2013",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2013",
                "sub_name": "2013 IEEE 20th International Conference on Web Services, Santa Clara, CA, USA, June 28 - July 3, 2013.",
                "count": 85,
                "papers": [
                    "Revenue Optimization of Service Compositions Using Conditional Request Retries.",
                    "Dynamic Service Composition with Service-Dependent QoS Attributes.",
                    "Variable Granularity Index on Massive Service Processes.",
                    "Ranking Services by Service Network Structure and Service Attributes.",
                    "Trace Norm Regularized Matrix Factorization for Service Recommendation.",
                    "Recommending Web Services via Combining Collaborative Filtering with Content-Based Features.",
                    "SLIM: A Scalable Location-Sensitive Information Monitoring Service.",
                    "Online Role Mining without Over-Fitting for Service Recommendation.",
                    "Geographic Location-Based Network-Aware QoS Prediction for Service Composition.",
                    "Selecting Top-k Composite Web Services Using Preference-Aware Dominance Relationship.",
                    "Event-Based Multi-level Service Monitoring.",
                    "Agent-Based Green Web Service Selection and Dynamic Speed Scaling.",
                    "Mashup Service Recommendation Based on User Interest and Social Network.",
                    "A Social-Aware Service Recommendation Approach for Mashup Creation.",
                    "A Framework for Web Service Usage Profiles Discovery.",
                    "Reflecting User Privacy Preferences in Context-Aware Web Services.",
                    "Privacy-Aware Web Service Composition and Ranking.",
                    "Respecting Privacy in Web Service Composition.",
                    "Prioritizing Structurally Complex Test Pairs for Validating WS-BPEL Evolutions.",
                    "An Intrusion Tolerant Identity Management Infrastructure for Cloud Computing Services.",
                    "Formal Abstraction and Compatibility Checking of Web Services.",
                    "Incorporating User Behavior Patterns to Discover Workflow Models from Event Logs.",
                    "A Low-Delay, Lightweight Publish/Subscribe Architecture for Delay-Sensitive IOT Services.",
                    "Efficient Service Substitutions with Behavior-Based Similarity Metrics.",
                    "Finding Preferred Skyline Solutions for SLA-Constrained Service Composition.",
                    "Web Service Composition Integrating QoS Optimization and Redundancy Removal.",
                    "A QoS-Based Trust Approach for Service Selection and Composition via Bayesian Networks.",
                    "Facing Uncertainty in Web Service Compositions.",
                    "Service Composition in Multi-domain Environment under Time Constraint.",
                    "QoS Composition and Analysis in Reconfigurable Web Services Choreographies.",
                    "Data-Flow Requirements for Dynamic Service Composition.",
                    "Event-B Based Approach for Verifying Dynamic Composite Service Transactional Behavior.",
                    "Intention-Based Automated Composition Approach for Coordination Protocol.",
                    "Minimizing Waiting Time for Service Composition: A Frictional Approach.",
                    "Execution Recovery in Transactional Composite Service.",
                    "Stateful Web Services - Auto Modeling and Composition.",
                    "Toward Ontology and Service Paradigm for Enhanced Carbon Footprint Management and Labeling.",
                    "How Does Web Service API Evolution Affect Clients?",
                    "A Change Impact Analysis Approach for Workflow Repository Management.",
                    "A Maximal Common Subgraph Based Method for Process Retrieval.",
                    "Adaptive Process Execution in a Service Cloud: Service Selection and Scheduling Based on Machine Learning.",
                    "Formal Methods for Data-centric Web Services: From Model to Implementation.",
                    "Web-Service Clustering with a Hybrid of Ontology Learning and Information-Retrieval-Based Term Similarity.",
                    "Scenario-Based Validation of Requirements for Context-Aware Adaptive Services.",
                    "Prioritised Stakeholder Analysis for Software Service Lifecycle Management.",
                    "Interleaving Execution into Model Driven Service Design.",
                    "Establishing Tool Chains Above the Service Cloud with Integration Models.",
                    "Recommending Web Service Based on User Relationships and Preferences.",
                    "Policy-Compliant Search Query Routing for Web Service Discovery in Peer to Peer Networks.",
                    "An Improved Artificial Bee Colony Approach to QoS-Aware Service Selection.",
                    "Adapting Web Services to Maintain QoS Even When Faults Occur.",
                    "Reliability-Aware Energy Efficiency in Web Service Provision and Placement.",
                    "Maintaining a Dynamic View of Semantic Web Services Representing Factory Automation Systems.",
                    "User Interface Design in Semi-automated Ontology Construction.",
                    "HyperMash: A Heterogeneous Service Composition Approach for Better Support of the End Users.",
                    "CSCE: A Crawler Engine for Cloud Services Discovery on the World Wide Web.",
                    "Efficient Search for Web Browsing Recipes.",
                    "Modeling the Dynamic Trust of Online Service Providers Using HMM.",
                    "An Efficient Trust Propagation Scheme for Predicting Trustworthiness of Service Providers in Service-Oriented Social Networks.",
                    "Security Certification of Composite Services: A Test-Based Approach.",
                    "A Self-Optimizing Workload Management Solution for Cloud Applications.",
                    "A New Approach towards DoS Penetration Testing on Web Services.",
                    "Optimal Time-Cost Tradeoff of Parallel Service Workflow in Federated Heterogeneous Clouds.",
                    "Service Recommendation in an Evolving Ecosystem: A Link Prediction Approach.",
                    "Location: A Feature for Service Selection in the Era of Big Data.",
                    "Validation and Interactivity of Web API Documentation.",
                    "Secure Combination of XML Signature Application with Message Aggregation in Multicast Settings.",
                    "Security Assurance of Services through Digital Security Certificates.",
                    "SeDL-C: A Language for Modeling Business Terms in Service Descriptions.",
                    "Non-functional Requirement Analysis and Recommendation for Software Services.",
                    "Decentralized Information Flow Verification Framework for the Service Chain Composition in Mobile Computing Environments.",
                    "Domain Objects for Continuous Context-Aware Adaptation of Service-Based Systems.",
                    "From Algebraic Specification to Ontological Description of Service Semantics.",
                    "Evaluating Quality of Web Services: A Short Survey.",
                    "Untether: Middleware Components to Support Intermittently Connected Web-Applications.",
                    "An Architecture for Decentralised Orchestration of Web Service Workflows.",
                    "Genetic Algorithm for Context-Aware Service Composition Based on Context Space Model.",
                    "Towards Multi-user and Network-Aware Web Services Composition.",
                    "Towards a Capability Model for Web Service Composition.",
                    "Towards a Flexible Schema Matching Approach for Semantic Web Service Discovery.",
                    "Service Matching under Consideration of Explicitly Specified Service Variants.",
                    "Service Value Broker Patterns: Integrating Business Modeling and Economic Analysis with Knowledge Management.",
                    "LISA: Linked Services Architecture Based on the Linked Data and Service Broker.",
                    "Coarse Grained Web Service Availability, Consistency, and Durability.",
                    "RESTful Web Services for High Speed Intrusion Detection Systems."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "19th ICWS 2012",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2012",
                "sub_name": "2012 IEEE 19th International Conference on Web Services, Honolulu, HI, USA, June 24-29, 2012.",
                "count": 110,
                "papers": [
                    "Efficient Correlation-Aware Service Selection.",
                    "Behind the Curtain: Service Selection via Trust in Composite Services.",
                    "Trustworthy Web Service Selection Using Probabilistic Models.",
                    "Verifying GSM-Based Business Artifacts.",
                    "Dynamic Adaptation of Fragment-Based and Context-Aware Business Processes.",
                    "Data-centric Web Services Based on Business Artifacts.",
                    "Continuous Query for QoS-Aware Automatic Service Composition.",
                    "Shapley Value Based Impression Propagation for Reputation Management in Web Service Composition.",
                    "Cost-Driven Optimization of Complex Service-Based Workflows for Stochastic QoS Parameters.",
                    "An Approach to Forecasting QoS Attributes of Web Services Based on ARIMA and GARCH Models.",
                    "A Hybrid Diagnosis Approach for QoS Management in Service-Oriented Architecture.",
                    "WSP: A Network Coordinate Based Web Service Positioning Framework for Response Time Prediction.",
                    "Scaling Spatial Alarm Services on Road Networks.",
                    "Negotiation Strategies for Probabilistic Contracts in Web Services Orchestrations.",
                    "Enabling Message Security for RESTful Services.",
                    "A Low-Cost Security Certification Scheme for Evolving Services.",
                    "Architecting Web Service Attack Detection Handlers.",
                    "Enabling the Delivery of Customizable Web Services.",
                    "Migrating Component-Based Web Applications to Web Services: Towards Considering a \"Web Interface as a Service\".",
                    "Automatic Abstract Service Generation from Web Service Communities.",
                    "Disk-Offload Middleware for Web-Services Using the Application-Caching Paradigm.",
                    "An Infrastructure Based in Virtualization for Intrusion Tolerant Services.",
                    "Green Web Services: Modeling and Estimating Power Consumption of Web Services.",
                    "AWSR: Active Web Service Recommendation Based on Usage History.",
                    "Decision Tree Learning from Incomplete QoS to Bootstrap Service Recommendation.",
                    "Location-Aware Collaborative Filtering for QoS-Based Service Recommendation.",
                    "Computing Strategic Trade-Offs in Web Service Deployment and Selection.",
                    "Large-Scale Longitudinal Analysis of SOAP-Based and RESTful Web Services.",
                    "Measuring Change Impact Based on Usage Profiles.",
                    "Multi-objective Service Composition with Time- and Input-Dependent QoS.",
                    "Web Services Composition Verification Using Satisfiability Solving.",
                    "Optimizing QoS-Aware Services Composition for Concurrent Processes in Dynamic Resource-Constrained Environments.",
                    "A Probabilistic Approach for Long-Term B2B Service Compositions.",
                    "A Dynamic Web Service Composition Method Based on Viterbi Algorithm.",
                    "Towards Multimodal Query in Web Service Search.",
                    "Discovery of Semantic Web Services Compositions Based on SAWSDL Annotations.",
                    "Ontology Alignment by Combining Lexical Analysis with Consequences from Reasoners.",
                    "Rep4WS: A Paxos Based Replication Framework for Building Consistent and Reliable Web Services.",
                    "Transactional Recovery Support for Robust Exception Handling in Business Process Services.",
                    "On Recommendation of Process Mining Algorithms.",
                    "Rigorous Analysis of Service Composability by Embedding WS-BPEL into the BIP Component Framework.",
                    "Towards Optimal and Scalable Non-functional Service Matchmaking Techniques.",
                    "Web Service Selection Algorithm Using Vickrey Auction.",
                    "Behavior Classes for Specification and Search of Complex Services and Processes.",
                    "Identifying Test Requirements by Analyzing SLA Guarantee Terms.",
                    "Analytic Profit Optimization of Service-Based Systems.",
                    "From Abstract to Executable BPEL Processes with Continuity Support.",
                    "Linked Context: A Linked Data Approach to Personalised Service Provisioning.",
                    "Discovering Trust Networks for the Selection of Trustworthy Service Providers in Complex Contextual Social Networks.",
                    "Analyzing the Evolution of Web Services Using Fine-Grained Changes.",
                    "Personalized Services Recommendation Based on Context-Aware QoS Prediction.",
                    "Domain-Independent Data Validation and Content Assistance as a Service.",
                    "Tenant Onboarding in Evolving Multi-tenant Software-as-a-Service Systems.",
                    "A Financial Compensation Based Transaction Management Model for Service-Oriented Business Collaborations.",
                    "Redundant Service Removal in QoS-Aware Service Composition.",
                    "QoS-Aware Adaptive Service Orchestrations.",
                    "A Specialized Search Engine for Web Service Discovery.",
                    "User-Centered QoS Computation for Web Service Selection.",
                    "Collaborative Web Service QoS Prediction with Location-Based Regularization.",
                    "TASS: Transaction Assurance in Service Selection.",
                    "Enabling Advanced Loading Strategies for Data Intensive Web Services.",
                    "Information Diffusion in Web Services Networks.",
                    "Formal Evolution of XML Schemas with Inheritance.",
                    "Andes: A Highly Scalable Persistent Messaging System.",
                    "A Cost-Effective Approach to Delivering Analytics as a Service.",
                    "Service Discovery Mechanism for an Intentional Pervasive Information System.",
                    "Towards Automatic Tagging for Web Services.",
                    "How to Design a Global SOA Infrastructure: Coping with Challenges in a Global Context.",
                    "Intelligent Database Placement in Cloud Environment.",
                    "An Empirical Study of Programmable Web: A Network Analysis on a Service-Mashup System.",
                    "OWL-S Based Semantic Cloud Service Broker.",
                    "COnTag: A Framework for Personalized Context-Aware Search of Ontology-Based Tagged Data.",
                    "Effect of Data Validity on the Reliability of Data-centric Web Services.",
                    "Modeling and Analyzing the Reliability and Cost of Service Composition in the IoT: A Probabilistic Approach.",
                    "Towards Simplifying and Automating Business Process Lifecycle Management in Hybrid Clouds.",
                    "Towards Decentralized Monitoring of Supply Chains.",
                    "Servicization of Australian Privacy Act for Improving Business Compliance.",
                    "SocFeedViewer: A Novel Visualization Technique for Social News Feeds Summarization on Social Network Services.",
                    "Linked Social Service: Evolving from an Isolated Service into a Global Social Service Network.",
                    "RESTful Web Service Mashup Based Coal Mine Safety Monitoring and Control Automation with Wireless Sensor Network.",
                    "Trust Computation in Web Service Compositions Using Bayesian Networks.",
                    "A Service Pattern Model for Flexible Service Composition.",
                    "An Approach of QoS-Guaranteed Web Service Composition Based on a Win-Win Strategy.",
                    "Flexible Construction of Complex Service Compositions from Reusable Semantic Knowledge.",
                    "WSCRec: Utilizing Historical Information to Facilitate Web Service Composition.",
                    "Selecting Skyline Web Services for Multiple Users Preferences.",
                    "Identifying and Managing Variation Scope in Service Management.",
                    "Advanced Case Management Enabled by Business Provenance.",
                    "Kachako: Towards a Data-centric Platform for Full Automation of Service Selection, Composition, Scalable Deployment and Evaluation.",
                    "A Relational Taxonomy of Services for Large Scale Service Repositories.",
                    "Binding Optimization of Web Services: A Quantitative Study of Local Repository-Based Approach.",
                    "Cloud Based Test Coverage Service.",
                    "Testing Optimization in Service EcoSystems (TEOS).",
                    "MapReduce-Based Balanced Mining for Closed Frequent Itemset.",
                    "Overcoming Large Data Transfer Bottlenecks in RESTful Service Orchestrations.",
                    "Describing and Verifying Integrity Constraints in XML Using OCL.",
                    "An Approach for Producing Privacy-Aware Reusable Business Process Fragments.",
                    "Privacy-Preserving Business Process Outsourcing.",
                    "Service Contracts: Current State and Future Directions.",
                    "Identifying the Relevance of Social Issues to a Target.",
                    "Cirrus: Towards Business Provenance As-a-Service in the Cloud.",
                    "Checking Compatibility of Web Services Using SOGs.",
                    "Parallel Computing Framework as a Cloud Service.",
                    "Automatic DAG-Based Service Composition: A Model Checking Approach.",
                    "Towards Service Atomization for Analyzing Information.",
                    "Highly Resilient Systems for Cloud.",
                    "Dodai-Deploy: Fast Cluster Deployment Tool.",
                    "Popularity Based Web Service Search.",
                    "A Framework for Self-Healing Service Compositions in Cloud Computing Environments.",
                    "Toward Exposing and Accessing HPC Applications in a SaaS Cloud."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "18th ICWS 2011",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2011",
                "sub_name": "IEEE International Conference on Web Services, ICWS 2011, Washington, DC, USA, July 4-9, 2011.",
                "count": 116,
                "papers": [
                    "Differential SOAP Multicasting.",
                    "Enhancing the Caching of Web Service Responses on Wireless Clients.",
                    "Opportunistic Composition of Sequentially-Connected Services in Mobile Computing Environments.",
                    "Defending Web Services against Denial of Service Attacks Using Client Puzzles.",
                    "A Privacy-Preserving Approach for Web Service Selection and Provisioning.",
                    "Finding K Optimal Social Trust Paths for the Selection of Trustworthy Service Providers in Complex Social Networks.",
                    "An Empirical Study on Web Service Evolution.",
                    "LoST: Local State Transfer - An Architectural Style for the Distributed Enactment of Business Protocols.",
                    "Towards Privacy-Preserving XML Transformation.",
                    "Dynamic Composition of Pervasive Process Fragments.",
                    "Automatic Web Service Composition with a Heuristic-Based Search Algorithm.",
                    "QoS-Aware Automatic Service Composition by Applying Functional Clustering.",
                    "Service Selection with Combinational Use of Functionally-Equivalent Services.",
                    "WebNeg: A Genetic Algorithm Based Approach for Service Negotiation.",
                    "Combining Configuration and Query Rewriting for Web Service Composition.",
                    "A Multi-tenant Architecture for Business Process Executions.",
                    "Refactoring and Publishing WS-BPEL Processes to Obtain More Partners.",
                    "Modeling and Executing Business Processes with Annotated Security Requirements in the Cloud.",
                    "A QoS-Aware Service Evaluation Method for Co-selecting a Shared Service.",
                    "Timed Web Services Analysis after Removing Complex Implicit Transitions.",
                    "Runtime Monitoring of Data-centric Temporal Properties for Web Services.",
                    "Has WS-I's Work Resulted in Ws-* Interoperability?",
                    "Retrieving Compatible Web Services.",
                    "DIEGO: A Tool for DerIving chorEoGraphy-cOnforming Web Service Systems.",
                    "Collaborative Filtering Based Service Ranking Using Invocation Histories.",
                    "A QoS-Based Fuzzy Model for Ranking Real World Web Services.",
                    "An Effective Web Service Recommendation Method Based on Personalized Collaborative Filtering.",
                    "Semi-empirical Service Composition: A Clustering Based Approach.",
                    "Efficient Multi-granularity Service Composition.",
                    "On the Optimal Petri Net Representation for Service Composition.",
                    "Composing Data-Driven Service Mashups with Tag-Based Semantic Annotations.",
                    "A Learning Ontology Method for RESTful Semantic Web Services.",
                    "Personalizing Access to Semantic Web Services.",
                    "Identifying Optimal Composite Services by Decomposing the Service Composition Problem.",
                    "A Transaction Management Model Based on Compensation Planning Graph for Web Services Composition.",
                    "Metamorphic Testing for Web Services: Framework and a Case Study.",
                    "Automatic Sampling of Web Services.",
                    "Modelling Collaborative Services for Business and QoS Compliance.",
                    "Verifying OWL-S Service Process Models.",
                    "An Automatic Approach for Extracting Process Knowledge from the Web.",
                    "A Framework for Building Privacy-Conscious DaaS Service Mashups.",
                    "Composing Non-functional Concerns in Composite Web Services.",
                    "Adaptive Service Composition Based on Runtime Requirements Monitoring.",
                    "Inferring Data Flow in Semantic Web Service Composition.",
                    "Web Service Composition Techniques in a Health Care Service Platform.",
                    "Taxonomic Clustering and Query Matching for Efficient Service Discovery.",
                    "Toward Semantics Empowered Biomedical Web Services.",
                    "A Hybrid Approach to Recommending Semantic Software Services.",
                    "Web Service Selection for Resolving Conflicting Service Requests.",
                    "Selection of Composable Web Services Driven by User Requirements.",
                    "AWSP: An Automatic Web Service Planner Based on Heuristic State Space Search.",
                    "Improving Web Service Discovery by a Functional and Structural Approach.",
                    "CoWS: An Internet-Enriched and Quality-Aware Web Services Search Engine.",
                    "A QoS-Aware Web Service Selection Algorithm Based on Clustering.",
                    "Efficient Heuristic Approach with Improved Time Complexity for Qos-Aware Service Composition.",
                    "Non-cooperative Game Based QoS-Aware Web Services Composition Approach for Concurrent Tasks.",
                    "QoS-Aware Service Composition for Work?ow-Based Data-Intensive Applications.",
                    "A Hierarchical Approach to Service Negotiation.",
                    "Automated State-Space Exploration for Configuration Management of Service-Oriented Applications.",
                    "Optimizing the Tradeoff between Discovery, Composition, and Execution Cost in Service Composition.",
                    "Regression Testing as a Service.",
                    "A Multi-layered Approach for the Declarative Development of Data Providing Services.",
                    "Transaction Similarity-Based Contextual Trust Evaluation in E-Commerce and E-Service Environments.",
                    "Design and Describe REST API without Violating REST: A Petri Net Based Approach.",
                    "Modeling Business Process of Web Services with an Extended STRIPS Operations to Detection Feature Interaction Problems Runtime.",
                    "Rule-Based Run-Time Information Flow Control in Service Cloud.",
                    "Progressive Reliability Forecasting of Service-Oriented Software.",
                    "On the Use of Fuzzy Dominance for Computing Service Skyline Based on QoS.",
                    "On the Verification of Behavioral and Probabilistic Web Services Using Transformation.",
                    "A Service-Oriented Framework for Hybrid Immersive Web Applications.",
                    "A Dynamic Resource Allocation Algorithm for Database-as-a-Service.",
                    "Long-Term Benefit Driven Adaptation in Service-Based Software Systems.",
                    "An Attribute Assurance Framework to Define and Match Trust in Identity Attributes.",
                    "Fine-Grained Metrics of Cohesion Lack for Service Interfaces.",
                    "Automated Security Service Orchestration for the Identity Management in Web Service Based Systems.",
                    "A Subjective Probability Based Deductive Approach to Global Trust Evaluation in Composite Services.",
                    "Dynamic Identity Delegation Using Access Tokens in Federated Environments.",
                    "StreamWeb: Real-Time Web Monitoring with Stream Computing.",
                    "An Event-Based Reasoning Approach to Web Services Monitoring.",
                    "Test Case Prioritization for Audit Testing of Evolving Web Services Using Information Retrieval Techniques.",
                    "Differential Caches for Web Services in Mobile Environments.",
                    "Providing Light Weight Distributed Web Services from Mobile Hosts.",
                    "WS-Eventing SOAP-over-UDP Multicast Extension.",
                    "A History Record-Based Service Optimization Method for QoS-Aware Service Composition.",
                    "Identification of Semistructured Abstract Nonfunctional Properties for Automatic Service Composition.",
                    "A Policy-Based Framework for Automated Service Level Agreement Negotiation.",
                    "Implementation of Communities of Web Service Registries.",
                    "Aggregated Privacy-Preserving Identity Verification for Composite Web Services.",
                    "Privacy Preserving Personalized Access Control Service at Third Service Provider.",
                    "Apply WS-Management to Manage Real Resources: MAPE Use Case Study.",
                    "CLAM: Cross-Layer Management of Adaptation Decisions for Service-Based Applications.",
                    "Social-Based Web Services Discovery and Composition for Step-by-Step Mashup Completion.",
                    "NRCF: A Novel Collaborative Filtering Method for Service Recommendation.",
                    "Reputation-Driven Web Service Selection Based on Collaboration Network.",
                    "Web Services Discovery and Composition: A Schema Matching Approach.",
                    "Data-Dependency Aware Trust Evaluation for Service Choreography.",
                    "A Formal Model of Service Computing and Its Applications on Service Discovery.",
                    "Ontology-Driven Query Expansion Using Map/Reduce Framework to Facilitate Federated Queries.",
                    "Generating Workflow Models from OWL-S Service Descriptions with a Partial-Order Plan Construction.",
                    "Constructing Operation-Level Ontologies for Web Services.",
                    "A Petri Net Based Hybrid Optimal Controller for Deadlock Prevention in Web Service Composition.",
                    "An Event-Based Functionality Integration Framework.",
                    "Conformance Verification between Web Service Choreography and Implementation Using Learning and Model Checking.",
                    "A Framework for Ontology Evolution Management in SSOA-Based Systems.",
                    "A New QoS Prediction Approach Based on User Clustering and Regression Algorithms.",
                    "On-the-Fly Detection Approach of Control Dependency Deadlocks in BPEL.",
                    "An Abstract Transaction Model for Testing the Web Services Transactions.",
                    "CloudDB AutoAdmin: Towards a Truly Elastic Cloud-Based Data Store.",
                    "A Web Service Performance Evaluation Approach Based on Users Experience.",
                    "Predicting Software Service Availability: Towards a Runtime Monitoring Approach.",
                    "Mobility-Aware Selection of Mobile Web Services.",
                    "An Event Driven Model for Context-Aware Service.",
                    "A Comprehensive Device Collaboration Model for Integrating Devices with Web Services under Internet of Things.",
                    "Improving Web API Discovery by Leveraging Social Information.",
                    "Service Evolution Management Based on Usage Profile.",
                    "Multiple Representations of Web Services: Discovery, Clustering and Recommendation."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "17th ICWS 2010",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2010",
                "sub_name": "IEEE International Conference on Web Services, ICWS 2010, Miami, Florida, USA, July 5-10, 2010.",
                "count": 103,
                "papers": [
                    "Service Selection Based on Customer Rating of Quality of Service Attributes.",
                    "RegionKNN: A Scalable Hybrid Collaborative Filtering Algorithm for Personalized Web Service Recommendation.",
                    "HyperService: Linking and Exploring Services on the Web.",
                    "DISC: A Declarative Framework for Self-Healing Web Services Composition.",
                    "Combining Local Optimization and Enumeration for QoS-aware Web Service Composition.",
                    "QSynth: A Tool for QoS-aware Automatic Service Composition.",
                    "Policy-Driven Service Composition with Information Flow Control.",
                    "SOA4All: An Innovative Integrated Approach to Services Composition.",
                    "Detecting Data Inconsistency Failure of Composite Web Services Through Parametric Stateful Aspect.",
                    "Automated Runtime Verification for Web Services.",
                    "Distributed QoS Evaluation for Real-World Web Services.",
                    "WSExpress: A QoS-aware Search Engine for Web Services.",
                    "Variability Modeling and QoS Analysis of Web Services Orchestrations.",
                    "Towards Data-Aware QoS-driven Adaptation for Service Orchestrations.",
                    "Web Services Selection in Support of Reliable Web Service Choreography.",
                    "Highly Scalable Web Service Composition Using Binary Tree-Based Parallelization.",
                    "Formal Specification and Verification of Data-Centric Service Composition.",
                    "Decentralized Approach for Execution of Composite Web Services Using the Chemical Paradigm.",
                    "Clustering WSDL Documents to Bootstrap the Discovery of Web Services.",
                    "Measuring Similarity of Web Services Based on WSDL.",
                    "An Approach for Context-Aware Service Discovery and Recommendation.",
                    "Enhancing Scalability and Performance of Mashups Through Merging and Operator Reordering.",
                    "Scalable and Reliable IPTV Service Through Collaborative Request Dispatching.",
                    "EDS: An Elastic Data-Service for Situational Applications.",
                    "Script-Based Generation of Dynamic Testbeds for SOA.",
                    "Benchmarking Vulnerability Detection Tools for Web Services.",
                    "Taking Advantage of Service Selection: A Study on the Testing of Location-Based Web Services Through Test Case Prioritization.",
                    "Apto: A MDD-Based Generic Framework for Context-Aware Deeply Adaptive Service-Based Processes.",
                    "QoS-based Late-Binding of Service Invocations in Adaptive Business Processes.",
                    "Reducing User Perceived Latency in Mobile Processes.",
                    "A Pattern-Driven Generation of Security Policies for Service-Oriented Architectures.",
                    "A Trust and Reputation Model Based on Bayesian Network for Web Services.",
                    "Message Correlation and Web Service Protocol Mining from Inaccurate Logs.",
                    "Semantic Support for Adaptive Long Term Composed Services.",
                    "From Specification to Adaptation: An Integrated QoS-driven Approach for Dynamic Adaptation of Web Service Compositions.",
                    "On Service Community Learning: A Co-clustering Approach.",
                    "Document Based Modeling of Web Services Choreographies Using Active XML.",
                    "From Representational State Transfer to Accountable State Transfer Architecture.",
                    "Semi-automatic Integration of Web Service Interfaces.",
                    "Trust Assessment for Web Services Collaboration.",
                    "A Fuzzy Trust Management Framework for Service Web.",
                    "Analyzing the Relationships between some Parameters of Web Services Reputation.",
                    "A Distributed Planning Approach for Web Services Composition.",
                    "QoS Aware Semantic Web Service Composition Approach Considering Pre/Postconditions.",
                    "Adaptive Goals for Self-Adaptive Service Compositions.",
                    "Towards a Formal Verification Approach for Business Process Coordination.",
                    "Monitoring, Prediction and Prevention of SLA Violations in Composite Services.",
                    "WebMov: A Dedicated Framework for the Modelling and Testing of Web Services Composition.",
                    "Towards Integrated Service Adaptation.",
                    "A Feature-Oriented Approach for Web Service Customization.",
                    "A MVC Framework for Policy-Based Adaptation of Workflow Processes: A Case Study on Confidentiality.",
                    "Checking Compatibility and Replaceability in Web Services Business Protocols with Access Control.",
                    "Generating Minimal Protocol Adaptors for Loosely Coupled Services.",
                    "An Effective Heuristic for On-line Tenant Placement Problem in SaaS.",
                    "Estimating the Cost of Developing Customizations to Packaged Application Software Using Service Oriented Architecture.",
                    "Analyzing Behavioral Substitution of Web Services Based on Pi-calculus.",
                    "Semantic Annotations for WS-Policy.",
                    "Performance Evaluation for SOAP and RFC in SAP Netweaver Platform.",
                    "User Experience in Added Value Location-Based Mobile Music Service.",
                    "Use Cases to Process Specifications in Business Process Modeling Notation.",
                    "Computing Service Skylines over Sets of Services.",
                    "DISCE: A Declarative Inter-ESB Service-Connectivity Configuration Engine.",
                    "Two-Staged Approach for Semantically Annotating and Brokering TV-related Services.",
                    "Designing a Broker for QoS-driven Runtime Adaptation of SOA Applications.",
                    "Design Patterns for RESTful Communication Web Services.",
                    "Towards Improved Data Dissemination of Publish-Subscribe Systems.",
                    "An Aspect-Oriented Approach to Consistency-Preserving Caching and Compression of Web Service Response Messages.",
                    "Automating QoS Based Service Selection.",
                    "Utility-Based Optimal Service Selection for Business Processes in Service Oriented Architectures.",
                    "Business Process Personalization Through Web Widgets.",
                    "Mashing-Up Rich User Interfaces for Human-Interaction in WS-BPEL.",
                    "A Collectional Data Model for Scientific Workflow Composition.",
                    "Confucius: A Scientific Collaboration System Using Collaborative Scientific Workflows.",
                    "An Insuanrance Model for Guranteeing Service Assurance, Integrity and QoS in Cloud Computing.",
                    "Timed Extended Invariants for the Passive Testing of Web Services.",
                    "A Hybrid Scheme for Controlling Transactional Composite Services.",
                    "Context Model Based SOA Policy Framework.",
                    "Extending BPMN for Supporting Customer-Facing Service Quality Requirements.",
                    "Self-Adaptive Service Composition Through Graphplan Repair.",
                    "Survey of the Tools for Automating Service Composition.",
                    "Compose Real Web Services with Context.",
                    "Agile Service Oriented Architecture with Adaptive Processes Using Semantically Annotated Workflow Templates.",
                    "Compatibility and Reparation of Web Service Processes.",
                    "A BPEL Observability Enhancement Method.",
                    "OWL-S Process Model Matchmaking.",
                    "A Web 2.0-Based Scientific Application Framework.",
                    "A Tripartite Security Model for Dynamic Service-Oriented Systems Using DynaSOAr.",
                    "A Framework for Delivering Rigorously Trusted Services.",
                    "Development of a Novel Software Architecture for Active Internet Applications Based on Fusion of Mobile Agent, Web Services and BPEL Technologies.",
                    "A Uniform Device Information Access for Context-Aware Middleware.",
                    "Implementing Attribute-Based Encryption in Web Services.",
                    "Enabling Publish/Subscribe with COTS Web Services across Heterogeneous Networks.",
                    "Seamless Cross-Domain Connectivity for Enabling Domain Autonomy in a Federated SOA.",
                    "Monitoring Decentralized Interacting Services with a Global State Choreography Model.",
                    "Evaluating the Survivability of SOA Systems Based on HMM.",
                    "A Novel Cloud-Oriented WS-Management-Based Resource Management Model.",
                    "An Approach for Mining Web Service Composition Patterns from Execution Logs.",
                    "Distributed Web Services Discovery Middleware for Edges of Internet.",
                    "Recommendation on Uncertain Services.",
                    "Optimizing the Data-Traffic of Centrally Coordinated Scientific Workflow Systems.",
                    "Everett: Providing Branch-Isolation for a Data Evolution Service.",
                    "jGASW: A Service-Oriented Framework Supporting HTC and Non-functional Concerns.",
                    "Design and Implementation for Communication Component Based Open Multimedia Conferencing Web Service over IP."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "16th ICWS 2009",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2009",
                "sub_name": "IEEE International Conference on Web Services, ICWS 2009, Los Angeles, CA, USA, 6-10 July 2009.",
                "count": 143,
                "papers": [
                    "The SCIFC Model for Information Flow Control in Web Service Composition.",
                    "Markov-HTN Planning Approach to Enhance Flexibility of Automatic Web Service Composition.",
                    "Control Flow Requirements for Automated Service Composition.",
                    "WS-OBJECTS: Extending Service-Oriented Architecture with Hierarchical Composition of Client-Side Asynchronous Event-Processing Logic.",
                    "A Plug-in Architecture for Self-Adaptive Web Service Compositions.",
                    "Selective Querying for Adapting Hierarchical Web Service Compositions Using Aggregate Volatility.",
                    "What are the Problem Makers: Ranking Activities According to their Relevance for Process Changes.",
                    "Distributed Cross-Domain Change Management.",
                    "Applying Sanitizable Signature to Web-Service-Enabled Business Processes: Going Beyond Integrity Protection.",
                    "MACE: A Dynamic Caching Framework for Mashups.",
                    "Wrap Scientific Applications as WSRF Grid Services Using gRAVI.",
                    "Web Service Mashup Middleware with Partitioning of XML Pipelines.",
                    "Towards Probabilistic Estimation of Quality of Online Services.",
                    "Flexible Probabilistic QoS Management of Transaction Based Web Services Orchestrations.",
                    "Service Provenance in QoS-Aware Web Service Runtimes.",
                    "Scenario-Driven Approach for Business Process Modeling.",
                    "From Workflow Models to Executable Web Service Interfaces.",
                    "Privacy Time-Related Analysis in Business Protocols.",
                    "Discovery of Optimized Web Service Configurations Using a Hybrid Semantic and Statistical Approach.",
                    "An Efficient Service Discovery Algorithm for Counting Bloom Filter-Based Service Registry.",
                    "Efficient Discovery of Collision-Free Service Combinations.",
                    "Towards a Model-Driven Process for Designing ReSTful Web Services.",
                    "RETRO: A Consistent and Recoverable RESTful Transaction Model.",
                    "Towards Automated RESTful Web Service Composition.",
                    "Efficient Testing of Service-Oriented Applications Using Semantic Service Stubs.",
                    "An Abstract GFSM Model for Optimal and Incremental Conformance Testing of Web Services.",
                    "Timed Model Checking Based Approach for Web Services Analysis.",
                    "BPEL'n'Aspects: Adapting Service Orchestration Logic.",
                    "Dynamo + Astro: An Integrated Approach for BPEL Monitoring.",
                    "Service Supervision: Coordinating Web Services in Open Environment.",
                    "Domain-Specific Processing of Policies or: WS-Policy Intersection Revisited.",
                    "Integrating Abductive Logic Programming and Description Logics in a Dynamic Contracting Architecture.",
                    "An Automated Method for Web Service Orchestration Based on Reusable Building Blocks.",
                    "QoS-Driven Adaptation of BPEL Scenario Execution.",
                    "Towards Adaptation of Service Interface Semantics.",
                    "An Adaptive Tradeoff Model for Service Performance and Security in Service-Based Systems.",
                    "Reputation Propagation in Composite Services.",
                    "An Approach to Incentive-Based Reputation for Communities of Web Services.",
                    "Applying Knowledge Sharing for Business Intelligence Collaboration.",
                    "Discovery of Semantic Web Service Flow Based on Computation.",
                    "Exploiting Metrics for Similarity-Based Semantic Web Service Discovery.",
                    "SAWSDL-MX2: A Machine-Learning Approach for Integrating Semantic Web Service Matchmaking Variants.",
                    "Behavioral Attestation for Business Processes.",
                    "Interoperability Changes in an Adaptive Service Orchestration.",
                    "A Dependency Impact Analysis Model for Web Services Evolution.",
                    "Reducing User Perceived Latency with a Middleware for Mobile SOA Access.",
                    "A Mobility-Based Clustering and Discovery of Web Services in Mobile Ad-hoc Networks.",
                    "Efficient Access to Composite M-services.",
                    "Scalable Optimized Composition of Web Services with Complexity Analysis.",
                    "Improving Web Services Robustness.",
                    "Enforcement from the Inside: Improving Quality of Business in Process Management.",
                    "Scientific Workflows as Services in caGrid: A Taverna and gRAVI Approach.",
                    "SPA: A Comprehensive Framework for Hybrid Solution Provisioning.",
                    "DIALOG: Distributed Auditing Logs.",
                    "WSRec: A Collaborative Filtering Based Web Service Recommender System.",
                    "Personalized Web Service Ranking via User Group Combining Association Rule.",
                    "Integrating Behavioral Trust in Web Service Compositions.",
                    "Modeling Cost-Aware Web Services Composition Using PTCCS.",
                    "Towards Scalability of Quality Driven Semantic Web Service Composition.",
                    "DHT-Based Range Query Processing for Web Service Discovery.",
                    "Gradual Removal of QoS Constraint Violations by Employing Recursive Bargaining Strategy for Optimizing Service Composition Execution Path.",
                    "A Framework for Optimal Decentralized Service-Choreography.",
                    "Equivalence of Web Services in Process-Aware Service Compositions.",
                    "Building Collaboration Applications that Mix Web Services Hosted Content with P2P Protocols.",
                    "Application of Management Frameworks to Manage Workflow-Based Systems: A Case Study on a Large Scale E-science Project.",
                    "Collaborative Scientific Workflows.",
                    "Identity Attribute-Based Role Provisioning for Human WS-BPEL Processes.",
                    "Towards More Secure Web Services: Pitfalls of Various Approaches to XML Signature Verification Process.",
                    "A Web Service Architecture for Decentralised Identity- and Attribute-Based Access Control.",
                    "Aspect-Oriented Quality of Service for Web Services: A Model-Driven Approach.",
                    "Design of SOA Based Web Service Systems Using QFD for Satisfaction of Quality of Service Requirements.",
                    "Analysis of Signature Wrapping Attacks and Countermeasures.",
                    "Discovery and On-demand Provisioning of Real-World Web Services.",
                    "Contract-First Design Techniques for Building Enterprise Web Services.",
                    "Rapid Identification Approach for Reusable SOA Assets Using Component Business Maps.",
                    "CCOA: Cloud Computing Open Architecture.",
                    "Virtualizing Services and Resources with ProBus: The WS-Policy-Aware Service and Resource Bus.",
                    "Vulnerable Cloud: SOAP Message Security Validation Revisited.",
                    "Scalable and Reliable Location Services through Decentralized Replication.",
                    "A Contract-Based Accountability Service Model.",
                    "User-Perceived Service Availability: A Metric and an Estimation Approach.",
                    "A Dynamic Approach toward QoS-Aware Service Workflow Composition.",
                    "A MapReduce-Enabled Scientific Workflow Composition Framework.",
                    "An Abstraction Framework for Service Composition in Event-Driven SOA Systems.",
                    "LiveMig: An Approach to Live Instance Migration in Composite Service Evolution.",
                    "Using Model Customization for Variability Management in Service Compositions.",
                    "An Approach to Composing Web Services with Context Heterogeneity.",
                    "Infoset for Service Abstraction and Lightweight Message Processing.",
                    "A Novel Dynamic Priority Scheduling Algorithm of Process Engine in SOA.",
                    "A Relational Approach for Ef?cient Service Selection.",
                    "Mobile In-store Personalized Services.",
                    "A Service-Oriented System for Optimizing Residential Energy Use.",
                    "The Web Service Browser: Automatic Client Generation and Efficient Data Transfer for Web Services.",
                    "A Conceptual Modeling Approach to Business Service Mashup Development.",
                    "Intelligent Matching for Public Internet Web Services Towards Semi-Automatic Internet Services Mashup.",
                    "Service-Oriented Architecture for Privacy-Preserving Data Mashup.",
                    "Reiki: Serviceability Architecture and Approach for Reduction and Management of Product Service Incidents.",
                    "Establishing and Monitoring SLAs in Complex Service Based Systems.",
                    "Inferring Behavioural Models from Traces of Business Applications.",
                    "A Performance Evaluation Study for Web Services Attachments.",
                    "Analytic Architecture Assessment in SOA Solution Design and its Engineering Application.",
                    "SOA Middleware Support for Service Process Reconfiguration with End-to-End QoS Constraints.",
                    "Composing Services for Third-party Service Delivery.",
                    "An Extensible Abstract Service Orchestration Framework.",
                    "Pat: A P2P Based Publish/Subscribe System for QoS Information Dissemination of Web Services.",
                    "A Flexible Approach for Automatic Process Decentralization Using Dependency Tables.",
                    "A Tool for Choreography Analysis Using Collaboration Diagrams.",
                    "Supporting Rebinding in BPEL.",
                    "Web Service Ranking Using Semantic Profile Information.",
                    "A Unified Test Framework for Continuous Integration Testing of SOA Solutions.",
                    "Service Composition as Generative Constraint Satisfaction.",
                    "Collaborative Web Data Record Extraction.",
                    "Adaptive Prefetching Scheme Using Web Log Mining in Cluster-Based Web Systems.",
                    "RDF Data-Centric Storage.",
                    "Static vs. Dynamic Validation of BSP Conformance.",
                    "A Process Modeling-Based Approach for Web Service Management.",
                    "WS-Policy: On Conditional and Custom Assertions.",
                    "Design Quality Analytics of Traceability Enablement in Service-Oriented Solution Design Environment.",
                    "A Petri Net Siphon Based Solution to Protocol-Level Service Composition Mismatches.",
                    "Dynamic Collaborative Business Process Formulation via Ontologised Hierarchical Task Network (HTN) Planning.",
                    "SOA-Based Integration of the Internet of Things in Enterprise Services.",
                    "Patterns for Enterprise Mashups in B2B Collaborations to Foster Lightweight Composition and End User Development.",
                    "BlueInfo: Open Architecture for Deploying Web Services in WPAN Hotspots.",
                    "XDM-Compatible Service Repository for User-Centric Service Creation and Discovery.",
                    "Risk Management Framework for Service-Oriented Architecture.",
                    "An Approach to Non-functional Property Evaluation of Web Services.",
                    "Mutation Test Based on OWL-S Requirement Model.",
                    "Modeling and Analysis of Flexible Transaction for Web Services.",
                    "Formal Analysis for Multimedia Conferencing Communication Services Orchestration.",
                    "Change Detection and Correction Facilitation for Web Applications and Services.",
                    "Deactivation of Unwelcomed Deep Web Extraction Services through Random Injection.",
                    "Web Services SIP Based Open Multimedia Conferencing on Internet.",
                    "A Framework for Building Reliable Distributed Bioinformatics Service Repositories.",
                    "A Governance Model for SOA.",
                    "Out of the Confusion of Tongues: A Unified Database Programming Paradigm.",
                    "A Semantic Repository for Geological Modeling Workflows.",
                    "Generic Web Services Extensible Functionality with Stable Interface.",
                    "GroupSpeak: High-level Language Extension for Workflow Capability.",
                    "Enabling Scaleable, Efficient, Non-visual Web Browsing Services.",
                    "The Fourth Party Service Platform and Service Charging.",
                    "MWS-MCS: A Novel Multi-agent-assisted and WS-Management-based Composite Service Management Scheme.",
                    "A Policy-Based Middleware for Web Services SLA Negotiation.",
                    "Research on WS-Management-based System and Network Resource Management Middleware Model."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "15th ICWS 2008",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2008",
                "sub_name": "2008 IEEE International Conference on Web Services (ICWS 2008), September 23-26, 2008, Beijing, China.",
                "count": 139,
                "papers": [
                    "Web Services: Software-as-a-Service (SaaS), Communication.",
                    "Net-Enabled Applications for Commercial Aviation.",
                    "Mobile Services Business and Technology Trends.",
                    "Services Computing: A New Thinking Style of Education and Engineering.",
                    "Cloud Computing and IT as a Service: Opportunities and Challenges.",
                    "Smarter SOA.",
                    "How Can Web Services Help Civil Aviation?",
                    "Common Business Components and Services toward More Agile and Flexible Industry Solutions and Assets.",
                    "Practical SOA: Service Modeling, Enterprise Service Bus and Governance.",
                    "Make the Consumable Services via REST.",
                    "Web Service-Based Business Process Development, Threat Modeling and Security Assessment Tool.",
                    "Orchestrating caGrid Services in Taverna.",
                    "A Dependable Infrastructure for Cooperative Web Services Coordination.",
                    "Towards Scalable Web Service Composition with Partial Matches.",
                    "A Temporal Data-Mining Approach for Discovering End-to-End Transaction Flows.",
                    "Discovering Reference Process Models by Mining Process Variants.",
                    "Modeling and Discovery of Data Providing Services.",
                    "A Hybrid Approach to QoS-Aware Service Composition.",
                    "An Adaptive Service Selection Approach to Service Composition.",
                    "Using User Interface Design to Enhance Service Identification.",
                    "A Context-Driven Content Adaptation Planner for Improving Mobile Internet Accessibility.",
                    "Realizing an Open Ubiquitous Environment in a RESTful Way.",
                    "A QoS-Oriented Reconfigurable Middleware for Self-Healing Web Services.",
                    "Exploiting Semantics for Analyzing and Verifying Business Rules in Web Services Composition and Contracting.",
                    "On Extending Semantic Matchmaking to Include Preconditions and Effects.",
                    "A Semantic QoS-Aware Discovery Framework for Web Services.",
                    "An Overview and Evaluation of Web Services Security Performance Optimizations.",
                    "A Distributed Replication Strategy Evaluation and Selection Framework for Fault Tolerant Web Services.",
                    "A Rule-Based Approach for Availability of Web Service.",
                    "Automatically Determining Compatibility of Evolving Services.",
                    "Adaptive Quality Recommendation Mechanism for Software Service Provisioning.",
                    "A Faceted Classification Based Approach to Search and Rank Web APIs.",
                    "Communications Semantics for WSBPEL Processes.",
                    "A Formal Model of Human Workflow.",
                    "Service Level Agreement Based Grid Scheduling.",
                    "Semantic and Syntactic Data Flow in Web Service Composition.",
                    "Generalized Semantics-Based Service Composition.",
                    "A Framework for the Semantic Composition of Web Services Handling User Constraints.",
                    "Towards Heuristic Web Services Composition Using Immune Algorithm.",
                    "Automatic Service Composition Based on Enhanced Service Dependency Graph.",
                    "Towards Verifying Contract Regulated Service Composition.",
                    "Multimedia Content Provisioning Using Service Oriented Architectures.",
                    "A Trust Vector Approach to Service-Oriented Applications.",
                    "Measurement, Modeling, and Analysis of Internet Video Sharing Site Workload: A Case Study.",
                    "High-Performance XML Parsing and Validation with Permutation Phrase Grammar Parsers.",
                    "Lazy XML Parsing/Serialization Based on Literal and DOM Hybrid Representation.",
                    "Emergency Response Framework for Aviation XML Services on MANET.",
                    "Extending WS-Notification with an Expressive Event Notification Broker.",
                    "A Theory of Role Composition.",
                    "On Synchronizing with Web Service Evolution.",
                    "Mashup Advisor: A Recommendation Tool for Mashup Development.",
                    "A Hybrid Integrated Architecture for Language Service Composition.",
                    "Approaches to Improving Reliability in e-Engineering Framework.",
                    "Redundant-Free Web Services Composition Based on a Two-Phase Algorithm.",
                    "A Faceted Requirements-Driven Approach to Service Design and Composition.",
                    "Composing Adaptive Web Services on COTS Middleware.",
                    "Performance Comparison of Web Service Engines in PHP, Java and C.",
                    "A Meta-model for Non-functional Property Descriptions of Web Services.",
                    "Evaluation of WSML Service Retrieval with WSMO-MX.",
                    "Communication over IP Based on Web Services.",
                    "Design and Development of a University-Oriented Personalizable Web 2.0 Mashup Portal.",
                    "CAFISE-S: An Approach to Deploying SOA in Scientific Information Integration.",
                    "Classification of SOA Contract Specification Languages.",
                    "SoftAlloc: A Work Allocation Language with Soft Constraints.",
                    "Publishing Dynamic State Changes of Resources through State Aware WSDL.",
                    "A Framework for Verifying SLA Compliance in Composed Services.",
                    "Ontology-Based Test Modeling and Partition Testing of Web Services.",
                    "Control Flow Analysis and Coverage Driven Testing for Web Services.",
                    "Algorithm for Extrapolating Blogger's Interests through Library Classification Systems.",
                    "Building Profit-Aware Service-Oriented Business Applications.",
                    "A Model-Driven Framework for Enabling Self-Service Configuration of Business Services.",
                    "Hybrid Parallelism for XML SAX Parsing.",
                    "InfoParser: Infoset Driven XML Processing for Web Services.",
                    "Facilitating Dynamic Collaborations with eContract Services.",
                    "A Distributed-SOA Model for Unified Communication Services.",
                    "A Unified Design Method of Asynchronous Service-Oriented Architecture Based on the Models and Patterns of Asynchronous Message Exchanges.",
                    "Enhancing Security Modeling for Web Services Using Delegation and Pass-On.",
                    "Coding-Free Model-Driven Enablement Framework and Engineering Practices of a Context-Aware SOA Modeling Environment.",
                    "Toward a Model-Based Approach to Dynamic Adaptation of Composite Services.",
                    "Toward the Development of Contextually Aware Business Applications via Model-Driven Transformations.",
                    "Flexible Pattern Monitoring for WS-BPEL through Stateful Aspect Extension.",
                    "Dynamic Thread Count Adaptation for Multiple Services in SMP Environments.",
                    "Dynamic Exception Handling Based on Web Services and OPC XML-DA.",
                    "Development of Service Control Server for Web-Telecom Coordination Service.",
                    "Creating Bioinformatics Semantic Web Services from Existing Web Services: A Real-World Application of SAWSDL.",
                    "Information as a Service in a Data Analytics Scenario - A Case Study.",
                    "Transparent Reputation Management for Composite Web Services.",
                    "A Monitoring Framework of WS-Resource Properties in WS-GRAM.",
                    "Declarative Constraint Framework for SOA Deployment and Configuration.",
                    "Dynamic Availability Estimation for Service Selection Based on Status Identification.",
                    "QoS-Driven Selection of Web Services for Transactional Composition.",
                    "Autonomic Ranking and Selection of Web Services by Using Single Value Decomposition Technique.",
                    "Integration and Data Sharing between WS-Based Workflows.",
                    "SCWIM an Integrity Model for SOA Networks.",
                    "A Consistency-Preserving Mechanism for Web Services Response Caching.",
                    "An Efficient Syntactic Web Service Composition Algorithm Based on the Planning Graph Model.",
                    "An Approach to Check Choreography with Channel Passing in WS-CDL.",
                    "A Policy-Driven Distributed Framework for Monitoring Quality of Web Services.",
                    "Tool Support for Safety Analysis of Service Composition and Deployment Models.",
                    "Interoperability among Service Registry Implementations: Is UDDI Standard Enough?",
                    "Anchor Semantics Enabled Ranking Method for Service Discovery and Integration.",
                    "Web Services Discovery Based on Latent Semantic Approach.",
                    "Model-Driven Quality of Service for Web Services: An Aspect-Oriented Approach.",
                    "Data-Enriched Modeling and Verification of WS-CDL Based on UML Models.",
                    "A Modeling Approach for Service-Oriented Application Based on Extensive Reuse.",
                    "Exploiting Independence in Design of Web Service Composition.",
                    "Support Web Services Composition with Optimal Cost Using PPA.",
                    "Automated Web Service Composition Using Extended Representation of Planning Domain.",
                    "Transforming Abstract QoS Requirements, Preferences, and Logic Constraints for Automatic Web Service Composition.",
                    "Specify and Compose Web Services by TLA.",
                    "A Tree-Based Method of Web Service Composition.",
                    "A Fast Method to Find Solution for Service Composition.",
                    "A User-Oriented Approach to Automated Service Composition.",
                    "Change Sequence Mining for Context Aware Service Process Customization.",
                    "An Architecture for Context-Aware Semantic Web Services.",
                    "WS-CCDL: A Framework for Web Service Collaborative Context Definition Language for Dynamic Collaborations.",
                    "Composition Context for Web Services Selection.",
                    "A DDL-Based Model for Web Service Composition in Context-Aware Environment.",
                    "Optimised Mobile Reasoning for Pervasive Service Discovery.",
                    "A Distributed e-Education System Based on the Service Oriented Architecture.",
                    "Service Design for 3D Virtual World Learning Applications.",
                    "Middleware for Communication and Deployment of Time Independent Mobile Web Services.",
                    "Integrating Information-Providing Web Services into the Data Integration System.",
                    "Services Characterization with Statistical Study on Existing Web Services.",
                    "Explaining Reputation for Informed Web Services Selection.",
                    "Identifying Security Aspects in Web-Based Federations.",
                    "Mining the Web of Trust for Web Services Selection.",
                    "New Broadcasting System Combined with Radio Broadcasting and WWW.",
                    "Reliability Analysis of Component-Based Software Based on Relationships of Components.",
                    "An Acknowledgement-Based Approach to Synthesizing Reliable Service Mediators.",
                    "Trust Management for Web Services.",
                    "A Comprehensive Six-Dimensional Quality of Web Services Assessment Model.",
                    "Choreography = Orchestration with Scripts + Conversations.",
                    "Developing Process Mediator for Web Service Interactions.",
                    "Service Differentiation for Business Process by Value Based Service Scheduling.",
                    "Towards a Reversible BPEL Debugger.",
                    "Control Flow Intervention for Semantic Failure Handling during Composite Serice Execution.",
                    "SWFilter: Semantic Web Services Filtering System.",
                    "A Clustering-Based Approach for Assisting Semantic Web Service Retrieval."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "14th ICWS 2007",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2007",
                "sub_name": "2007 IEEE International Conference on Web Services (ICWS 2007), July 9-13, 2007, Salt Lake City, Utah, USA.",
                "count": 189,
                "papers": [
                    "Services Research at IBM.",
                    "Web Services: Meeting the Software Challenge of Future Hardware and Global Business Trends.",
                    "Message from the IEEE ICWS/SCC/SERVICES 2007 Plenary Panel Program Co-Chairs.",
                    "Services Computing in Daily Work: Service Engineering vs. Software Engineering.",
                    "Services Computing in Action: Services Architectures.",
                    "SOA Solution Reference Architecture.",
                    "State of the Art in Modeling and Deployment of Electronic Contracts.",
                    "Web Services Security and Privacy.",
                    "Build Your Mashup with Web Services.",
                    "Semantic SOA in Action: A Practical Demonstration.",
                    "An Access Control System for Web Service Compositions.",
                    "Information Flow Control with Decentralized Service Compositions.",
                    "Efficient and Secure Search of Enterprise File Systems.",
                    "Uniform Dynamic Deployment of Web and Grid Services.",
                    "An Evaluation of Multiversion Concurrency Control forWeb Service Directories.",
                    "Capacity Management and Demand Prediction for Next Generation Data Centers.",
                    "Modeling and Diagnosing OrchestratedWeb Service Processes.",
                    "User Tasks and Access Control overWeb Services.",
                    "Workload-aware Business Process Simulation with Statistical Service Analysis and Timed Petri Net.",
                    "ModelingWeb Services using Semantic Graph Transformations to aid Automatic Composition.",
                    "Improved Matchmaking Algorithm for Semantic Web Services Based on Bipartite Graph Matching.",
                    "Applying Abduction in Semantic Web Service Composition.",
                    "A Framework for Multi-Platform SOA Security Analyses.",
                    "Automated Functional Conformance Test Generation for Semantic Web Services.",
                    "Learning Ontologies to Improve the Quality of Automatic Web Service Matching.",
                    "Probabilistic QoS and soft contracts for transaction based Web services.",
                    "Efficient Implementation of XML Security for Mobile Devices.",
                    "A Stateful Web Service Firewall for BPEL.",
                    "Automatic Composition of SemanticWeb Services.",
                    "Improving the Performance of Web Services Using Deployment-Time Binding Selection.",
                    "A protocol for QoS contract negotiation and its implementation using Web Services.",
                    "Rich Services: The Integration Piece of the SOA Puzzle.",
                    "On Composing a Reliable Composite Web Service: A Study of Dynamic Web Service Selection.",
                    "On Context-Specific Substitutability of Web Services.",
                    "A-SOAP: Adaptive SOAP Message Processing and Compression.",
                    "Extending Web Services Semantics to Support Asynchronous Invocations and Continuation.",
                    "The Web Services-BusinessActivity-Initiator (WS-BA-I) Protocol: an Extension to the Web Services-BusinessActivity Specification.",
                    "Handling User Preferences and Added Value in Discovery of Semantic Web Services.",
                    "A Platform for Context Aware Runtime Web Service Discovery.",
                    "A Practical Approach to Web Service Discovery and Retrieval.",
                    "Reputation-Enhanced QoS-based Web Services Discovery.",
                    "Inverted Indexing for Composition-Oriented Service Discovery.",
                    "Web Service Discovery Using General-Purpose Search Engines.",
                    "A Declarative Approach to Enhancing the Reliability of BPEL Processes.",
                    "ANGEL: Optimal Configuration for High Available Service Composition.",
                    "Scale-Free Web Services.",
                    "BPEL4Chor: Extending BPEL for Modeling Choreographies.",
                    "Dynamic Web Service Composition within a Service-Oriented Architecture.",
                    "Haley: A Hierarchical Framework for Logical Composition ofWeb Services.",
                    "Model-driven Composition of Context-aware Web Services Using ContextUML and Aspects.",
                    "An Approach to Debugging Grid or Web Services.",
                    "A Model to support SPKI Federations management through XKMS.",
                    "A Hierarchical Model for TransactionalWeb Service Composition in P2P Networks.",
                    "Requirements-driven Verification of WSBPEL Processes.",
                    "Automated Choreographer Synthesis for Web Services Composition Using I/O Automata.",
                    "Web Services Methods for Communication over IP.",
                    "An Exploratory Study of Web Services on the Internet.",
                    "Comparing Web Services with other Software Components.",
                    "A Self-Healing Framework for Web Services.",
                    "A Version-aware Approach for Web Service Directory.",
                    "Autonomic Web Service Platform with Dynamic Multi-Layer Control.",
                    "Utility-based QoS Brokering in Service Oriented Architectures.",
                    "Performance Evaluation and Modeling of Web Services Security.",
                    "Personalized QoS Prediction forWeb Services via Collaborative Filtering.",
                    "A Policy-Based Authorization Framework for Web Services: Integrating XGTRBAC and WS-Policy.",
                    "Guarding Sensitive Information Streams through the Jungle of Composite Web Services.",
                    "An Operational Model and Language Support for Securing Web Services.",
                    "SOAP-based Secure Conversation and Collaboration.",
                    "Reasoning about Events to Specify Authorization Policies forWeb Services Composition.",
                    "Towards Secure Execution Orders for CompositeWeb Services.",
                    "Verifying the Consistency of Security Policies by Abstracting into Security Types.",
                    "ServiceJ A Java Extension for ProgrammingWeb Services Interactions.",
                    "Generic Security Policy Transformation Framework for WS-Security.",
                    "Specifying Semantic Web Service Compositions using UML and OCL.",
                    "Describing Semantic Web Services: From UML to OWL-S.",
                    "A Semantic Web Services-based Infrastructure for Context-Adaptive Process Support.",
                    "A Semantic Framework for Identifying Events in a Service Oriented Architecture.",
                    "On communication and coordination issues of Semantic Web Services.",
                    "A Dynamic Concept Interpretation Approach for OWL Extension.",
                    "A SOA Approach to Counter DDoS Attacks.",
                    "A Web Service Recommender System Using Enhanced Syntactical Matching.",
                    "Hosting Web Services on Resource Constrained Devices.",
                    "Axis2-based Replication Middleware forWeb Services.",
                    "Delivering Promises for Web Services Applications.",
                    "An Aspect Oriented Approach for Applying Features to Web Services.",
                    "Virtualised Trusted Computing Platform for Adaptive Security Enforcement of Web Services Interactions.",
                    "Comparing Web Services Performance and Recovery in the Presence of Faults.",
                    "Deriving Transactional Properties of CompositeWeb Services.",
                    "Discovering Conversations in Web Services Using Semantic Correlation Analysis.",
                    "Automated Testing and Response Analysis ofWeb Services.",
                    "Automatic Assertion of Actor State in Service Oriented Architectures.",
                    "A Timed Extension of WSCoL.",
                    "Visual Analysis of Privacy Risks in Web Services.",
                    "ReliableWeb Services: Methodology, Experiment and Modeling.",
                    "Context-Aware Service Composition and Component Change-over using Semantic Web Techniques.",
                    "A Semantic Specification Framework for Analyzing Functional Composability of Autonomous Web Services.",
                    "QoS-aware Service Composition in Service Overlay Networks.",
                    "A Soft Constraints-Based Approach for Reconciliation of Non-Functional Requirements in Web Services-Based Multi-Agent Systems.",
                    "Protocol Selection alongside Service Selection and Composition.",
                    "MASC - .NET-Based Middleware for Adaptive Composite Web Services.",
                    "Guiding the Service Composition Process with Temporal Business Rules.",
                    "Flow-Based Service Selection forWeb Service Composition Supporting Multiple QoS Classes.",
                    "Enhancing BPEL scenarios with Dynamic Relevance-Based Exception Handling.",
                    "A Query-based System for Automatic Invocation of Web Services.",
                    "AutomatedWeb Service Composition at Work: the Amazon/MPS Case Study.",
                    "CoordinatedWeb Services Orchestration.",
                    "Improved Adaptation of Web Service Compositions Using Value of Changed Information.",
                    "Improving the Reuse of ScientificWorkflows and Their By-products.",
                    "On Completeness of Web Service Compositions.",
                    "PSR : Pre-computing Solutions in RDBMS for FastWeb Services Composition Search.",
                    "Integrating Discovery and Automated Composition: from Semantic Requirements to Executable Code.",
                    "AutomaticWorkflows Composition of Mobile Services.",
                    "An Application ofWeb-Service Interfaces.",
                    "An Integrated Development Environment for Web Service Composition.",
                    "Entrepreneurial View of Automated Process Composition.",
                    "An Automated Generation of XForms Interfaces for Web Servic.",
                    "Raising Programming Abstraction from Objects to Services.",
                    "Improving Web Services Interoperability with Binding Extensions.",
                    "Automatic Message Flow Analyses for Web Services Based on WSDL.",
                    "Modeling the 3-Tier E-Learning System on Power Line Network.",
                    "Evolving Existing Systems to Service-Oriented Architectures: Perspective and Challenges.",
                    "A Service Supporting Universal Access to Mobile Internet with Unit of Information-Based Intelligent Content Adaptation.",
                    "Human Interactions in Dynamic Environments through Mobile Web Services.",
                    "Modeling and Generating Mobile Business Processes.",
                    "WS-CDL+: An Extended WS-CDL Execution Engine for Web Service Collaboration.",
                    "Context Aware Service Policy Orchestration.",
                    "Service-Oriented Virtual Private Networks for Grid Applications.",
                    "Practical DACSWeb Service for User's Free Portal Page Creation.",
                    "Stochastic Modeling Study for Competitive Web Services Market.",
                    "Service HyperChain Architecture of Web X.o and A Case Study.",
                    "Data-Grey-BoxWeb Services in Data-Centric Environments.",
                    "A Service Oriented HLA RTI on the Grid.",
                    "Towards a Fine-Grained Access Control Model and Mechanisms for Semantic Databases.",
                    "XML Document Retrieval System Supporting Multimedia Web Service for Digital Museum.",
                    "Developing a Distributed e-Monitoring System for Enterprise Website and Web Services: An Experience Report with Free Libraries and Tools.",
                    "DIA: A Web Services-based Infrastructure for Semantic Integration in Geoinformatics.",
                    "Transactional Coordination of Dynamic Processes in Service-Oriented Environments.",
                    "Towards automatic mediation of OWL-S process models.",
                    "Efficient Service Data Management in Dynamic Environment.",
                    "Privacy-Aware Web Service Protocol Replaceability.",
                    "A Situation-aware Access Control based Privacy-Preserving Service Matchmaking Approach for Service-Oriented Architecture.",
                    "Access Control for Collaborative Systems: A Web Services Based Approach.",
                    "Managing Top-down Changes in Service-Oriented Enterprises.",
                    "Designing a Generic Collaborative Working Environment.",
                    "Supporting Differentiated ServicesWith Configurable Business Processes.",
                    "A Web Service Mining Framework.",
                    "WSCE: A Crawler Engine for Large-Scale Discovery of Web Services.",
                    "Enabling Runtime Adaptation ofWorkflows to External Events in Enterprise Environments.",
                    "On Demand Network and Application Provisioning ThroughWeb Services.",
                    "Performance Evaluations of Geospatial Web Services Composition and Invocation.",
                    "Asynchronously Rendering Interoperable Remote Portlets.",
                    "Towards Response Time Estimation in Web Services.",
                    "Model Checking Expressive Web Service Descriptions.",
                    "Concurrency Issues in Automating RTS for Web Services.",
                    "Using Scenario Oriented Response-time Management for Composite Web Services.",
                    "Dependency-aware Service Oriented Architecture and Service Composition.",
                    "Session Management for Cross-protocol Identity Federation.",
                    "Behavioral Queries for Service Selection: An Agile Approach to SOC.",
                    "A Graph-BasedWeb Service Composition Technique Using Ontological Information.",
                    "A Framework for Smooth Composition of Choreographies of Web Services.",
                    "A Feedback Control Framework of Service Composition Execution for Response Time Guarantee.",
                    "Efficient Web Services Composition and Optimization Techniques.",
                    "Automatic Web Service Composition Based on Logical Inference of Horn Clauses in Petri Net Models.",
                    "OWL-T: A Task Ontology Language for Automatic Service Composition.",
                    "A Pragmatic Methodology to Web Service Discovery.",
                    "Search Algorithms for Discovery of Web Services.",
                    "Design and Implementation of an Extended UDDI Registration Center for Web Service Graph.",
                    "Using Web Services to Exchange Security Tokens for Federated Trust Management.",
                    "Toward Situational Secure Web Services Design Methods.",
                    "A policy-based evaluation framework for Quality and Security in Service Oriented Architectures.",
                    "Intelligent Agents as Trust Negotiators for Federated Security.",
                    "BPMO: Semantic Business Process Modeling and WSMO Extension.",
                    "Research on Service-Oriented Workflow and Performance Evaluation.",
                    "Aspect Separation in Web Service Orchestration: A Reflective Approach and its Application to Decentralized Execution.",
                    "Policy-based Runtime Partner Management in ProcessBased Services.",
                    "Integrating a Context Model in Web Services.",
                    "Efficient XML-Based Grid Middleware Design for Multi-Core Processors.",
                    "Aspect-Oriented Web Services for Distributed Resource Monitoring in Utility Computing.",
                    "On the method for realizing globally and locally accessible resource management for WS-GRAM.",
                    "Modeling and Inversion of Geophysical Well Logging Tool Responses in a Service-Oriented High Performance Computing Architecture.",
                    "Web Services Variation Façade - Domain Specific Reference Architecture for Increasing Integration Usability.",
                    "XML Schemas Based Flexible Distributed Code Generation Framework.",
                    "Design and Verification ofWeb Services Compositions in the Telecommunication Domain.",
                    "Ocean Observing Data Web Service and Application in Shipwreck Salvation of Taiwan Strait.",
                    "An MDA-based Approach for Specifying Semantic Portals.",
                    "Using the Functional Model for Customizable Web Services Specification.",
                    "Modeling Autonomic Recovery in Web Services with Multi-tier Reboots.",
                    "Mobile SOA: Service Orientation on Lightweight Mobile Devices.",
                    "Web Service Orchestration for Bioinformatics Systems: Challenges and Current Workflow Definition Approaches."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "13th ICWS 2006",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2006",
                "sub_name": "2006 IEEE International Conference on Web Services (ICWS 2006), 18-22 September 2006, Chicago, Illinois, USA.",
                "count": 144,
                "papers": [
                    "Message from the General Chairs.",
                    "Message from the Program Chairs.",
                    "Message from the Application Services and Industry Track Chair.",
                    "Technical Steering Committee.",
                    "IEEE Computer Society Technical Committee on Services Computing.",
                    "Conference Officers.",
                    "Program Committee.",
                    "External Reviewers.",
                    "Keynote Speaker 1: Web Services at Amazon.com.",
                    "Keynote Speaker 2: Business Drivers for Services Computing.",
                    "Keynote Speaker 3: Service Computing: The AppExchange Platform.",
                    "Panel Session 1: Software and Services: Where Do They Meet?",
                    "Panel Session 2: Web Services - A View from the Top.",
                    "Panel Session 3: Event-Driven Architectures and Complex Event Processing.",
                    "Panel Session 4: Mobile Web Services Trend Perspectives.",
                    "Tutorial 1: SOA and Web Services.",
                    "Tutorial 2: SOA Services and Solutions.",
                    "Tutorial 3: Automatic Web Service Composition.",
                    "Tutorial 4: Web Services on Rails: Using Ruby and Rails for Web Services Development and Mashups.",
                    "Tutorial 5: Business Agility and Process Management.",
                    "Tutorial 6: Security in SOA and Web Services.",
                    "Flex-SwA: Flexible Exchange of Binary Data Based on SOAP Messages with Attachments.",
                    "Lightweight Checkpointing for Faster SOAP Deserialization.",
                    "Compressing SOAP Messages by using Pushdown Automata.",
                    "Semantic-Driven Matchmaking of Web Services Using Case-Based Reasoning.",
                    "SEMAPLAN: Combining Planning with Semantic Matching to Achieve Web Service Composition.",
                    "Automatic Matchmaking of Web Services.",
                    "Modelling and Solving QoS Composition Problem Using Fuzzy DisCSP.",
                    "Run-Time Monitoring of Instances and Classes of Web Service Compositions.",
                    "Heuristics for QoS-aware Web Service Composition.",
                    "Static Verification of Control and Data inWeb Service Compositions.",
                    "Augmenting Web Services Composition with Transactional Requirements.",
                    "Discovering and Improving Recovery Mechanisms of CompositeWeb Services.",
                    "IntegratingWeb Services and Messaging.",
                    "Strategic Web-Service Agreements.",
                    "Automated Syntactic Medation forWeb Service Integration.",
                    "Transforming OWL-S Process Model into EDFA for Service Discovery.",
                    "Behavioral matchmaking for service retrieval.",
                    "Adding OWL-S Support to the Existing UDDI Infrastructure.",
                    "Bridging Trust Relationships with Web Service Enhancements.",
                    "A Service-Oriented Trust Management Model on Application Server.",
                    "Quantitative Trust Based on Actions.",
                    "Recovery Policies for Enhancing Web Services Reliability.",
                    "A Table-Driven Streaming XML Parsing Methodology for High-Performance Web Services.",
                    "Bootstrapping Performance and Dependability Attributes of Web Services.",
                    "PWSSec: Process for Web Services Security.",
                    "Semantic Modeling and Design Patterns for Asynchronous Events in Web Service Interaction.",
                    "Developing a Selection Model for Interactive Web Services.",
                    "WSBen: A Web Services Discovery and Composition Benchmark.",
                    "Exploring Remote Object Coherence in XMLWeb Services.",
                    "Optimal Adaptation in Web Processes with Coordination Constraints.",
                    "Towards Service-Oriented Ontology-Based Coordination.",
                    "Access Control and Authorization Constraints for WS-BPEL.",
                    "From BPMN Process Models to BPEL Web Services.",
                    "Reliable Messaging for BPEL Processes.",
                    "Indexing Business Processes based on Annotated Finite State Automata.",
                    "Workflow discovery: the problem, a case study from e-Science and a graph-based solution.",
                    "DSCWeaver: Synchronization-Constraint Aspect Extension to Procedural Process Specification Languages.",
                    "A Lightweight Framework forWeb Services Invocation over Bluetooth.",
                    "A Cooperative and Adaptive System for Caching Web Service Responses in MANETs.",
                    "Metadata-Based XML Serialization for Embedded C++.",
                    "Discovery of Semantic Relations between Web Services.",
                    "An Approach for Specifying Capability ofWeb Services based on Environment Ontology.",
                    "Semantic Interoperability of Web Services - Challenges and Experiences.",
                    "Extensible Web Services Architecture for Notification in Large-Scale Systems.",
                    "A Service-oriented Middleware for Runtime Web Services Interoperability.",
                    "A Mixed Initiative Approach to Semantic Web Service Discovery and Composition: SAP's Guided Procedures Framework.",
                    "A Lightweight Software Design Process for Web Services Workflows.",
                    "Web Services versus Distributed Objects: A Case Study of Performance and Interface Design.",
                    "A Framework for Collecting Provenance in Data-Centric Scientific Workflows.",
                    "Evaluation and Modeling of Web Services Performance.",
                    "BizCast: Business Process Performance Model with Workload Overlap Analysis.",
                    "Modelling End-to-end Quality-of-Service for Transaction-Based Services in Multi-Domain Environments.",
                    "Proactive Service Discovery and Execution Using Agents.",
                    "User Feedback-Based Refinement for Web Services Retrieval using Multiple Instance Learning.",
                    "Process Mining, Discovery, and Integration using Distance Measures.",
                    "Security Conscious Web Service Composition.",
                    "Representation, Verification, and Computation of Timed Properties in Web.",
                    "Service Congestion: The Problem, and an Optimized Service Composition Architecture as a Solution.",
                    "WIP: Web Service Initiation Protocol for Multimedia and Voice Communication over IP.",
                    "Communication Web Services Composition and Integration.",
                    "Investigating Web Services Composition Applied to Network Management.",
                    "Composing Business Processes with Partial Observable Problem Space in Web Services Environments.",
                    "Adaptation inWeb Service Composition and Execution.",
                    "Process Guided Service Composition in Building SoA Solutions: A Data Driven Approach.",
                    "A Web Services Secure Conversation Establishment Protocol Based on Forwarded Trust.",
                    "Preventing Service Oriented Denial of Service (PreSODoS): A Proposed Approach.",
                    "Adding Authentication to Model Driven Security.",
                    "Towards a Reliable Distributed Web Service Execution Engine.",
                    "High Performance Web Services Based on Service-Specific SOAP Processor.",
                    "Analysis of Transport Optimization Techniques.",
                    "A Quality- and Cost-based Selection Model for Multimedia Service Composition in Mobile Environments.",
                    "TARGET: Two-way Web Service Router Gateway.",
                    "On Encrypting and Signing Binary XML Messages in the Wireless Environment.",
                    "Measuring Privacy Protection in Web Services.",
                    "A Framework for Building Privacy-Conscious Composite Web Services.",
                    "Trust-based Resource Allocation in Web Services.",
                    "Situated Web Service: Context-Aware Approach to High-Speed Web Service Communication.",
                    "Analyzing XML Parser Memory Characteristics: Experiments towards ImprovingWeb Services Performance.",
                    "Improving the performance of XML based technologies by caching and reusing information.",
                    "Mapping Service Level Agreements in 3-tier settings.",
                    "Early Capacity Testing of an Enterprise Service Bus.",
                    "Exploring Perturbation Based Testing for Web Services.",
                    "An Approach to Exception Handling for Service-Oriented Systems.",
                    "A Flexible and Efficient Approach to Reconcile Different Web Services-based Event Notification Specifications.",
                    "Using constraint hierarchies to support QoS-guided service composition.",
                    "Implementing a Flexible Compensation Mechanism for Business Processes in Web Service Environment.",
                    "Dynamic Regeneration of Workflow Specification with Access Control Requirements in MANET.",
                    "E Role-based Decomposition of Business Processes using BPEL.",
                    "Differential QoS support in Web Services Management.",
                    "A Model-driven WSDL Extension for Describing the QoS ofWeb Services.",
                    "QoS Explorer: A Tool for Exploring QoS in Composed Services.",
                    "Business Process Development based on Web Services: a Web Information System for Medical Image Management and Processing.",
                    "An SOA-based Framework for Instrument Management for Large-scale Observing Systems (USArray Case Study).",
                    "Opal: SimpleWeb Services Wrappers for Scientific Applications.",
                    "Axis2, Middleware for Next Generation Web Services.",
                    "Service-Oriented Order-to-Cash Solution with Business RSS Information Exchange Framework.",
                    "Adapting Legacy Home Appliances to Home Network Systems UsingWeb Services.",
                    "Decomposition and Abstraction of Web Applications for Web Service Extraction and Composition.",
                    "Decentralized Orchestration of CompositeWeb Services.",
                    "A Two Steps Method For Analyzing Dependency of Business Services On IT Services Within A Service Life Cycle.",
                    "Towards Aspect-based Modeling of Self-Healing Web Services.",
                    "Model Driven Design of Distribution Patterns forWeb Service Compositions.",
                    "Toward UML Profiles for Web Services and their Extra-Functional Properties.",
                    "A Formal Model forWeb Service Choreography Description Language (WS-CDL).",
                    "A Method for Formal Verification of Service Interoperability.",
                    "A Unified Approach for the Discovery of Web and Peer-to-Peer Services.",
                    "Community-Based Service Discovery.",
                    "Inferring, Validating, and Coordinating the Commitments in aWorkflow.",
                    "ComposingWeb Services with Nondeterministic Behavior.",
                    "Grounding OWL-S in WSDL-S.",
                    "Expressing and Reasoning about Service Contracts in Service-Oriented Computing.",
                    "Fortified Web Services Contracts for Trusted Components.",
                    "Adaptive Service Agreement and Process Management.",
                    "Easy SOA: Rapid Prototyping environment withWeb Services for End Users.",
                    "A Two-Layered Software Architecture for Distributed Workflow Coordination over Web Services.",
                    "A Semantic Web Services Approach Towards Automated Software Engineering.",
                    "SOA and the Enterprise -- Lessons from the City.",
                    "Runtime Integration of Reconfigurable Hardware in Service-Oriented Grids.",
                    "A Transaction Model for Service Grid Environment and Implementation Considerations.",
                    "UsingWeb Services for Configuration and Deployment according to the CDDLM Standard.",
                    "Task Delegation in Active Web Intermediary Network.",
                    "Taming Web Services in the Wild.",
                    "A Framework for Intelligent Web Services: Combined HTN and CSP Approach."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "12th ICWS 2005",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2005",
                "sub_name": "2005 IEEE International Conference on Web Services (ICWS 2005), 11-15 July 2005, Orlando, FL, USA.",
                "count": 137,
                "papers": [
                    "Copyright Page.",
                    "Message from the General Chairs.",
                    "Message from the Industry Program Co-Chairs.",
                    "Conference Committees.",
                    "Conference Officers.",
                    "Program Committee.",
                    "External Reviewers.",
                    "XML Data Services.",
                    "Web Services Composition: A Story of Models, Automata, and Logics.",
                    "Services Ecosystem.",
                    "Five Years of Software as a Service: The Good, the Bad, and the Ugly.",
                    "Services Science: Services Innovation Research and Education.",
                    "Service-Based Computing Strategy and Planning by IT Professionals.",
                    "Quality of Manageability of Web Services.",
                    "Experiences with Service Computing--A View from the Business World.",
                    "Flexible and Efficient Matchmaking and Ranking in Service Directories.",
                    "Searching Service Repositories by Combining Semantic and Ontological Matching.",
                    "A Grammar-Based Index for Matching Business Processes.",
                    "Batch is Back: CasJobs, Serving Multi-TB Data on the Web.",
                    "Enterprise Application Integration Using Extensible Web Services.",
                    "A Reservation-Based Coordination Protocol for Web Services.",
                    "Using Aspects for Security Engineering of Web Service Compositions.",
                    "Extending the Security Assertion Markup Language to Support Delegation for Web Services and Grid Services.",
                    "WSEmail: Secure Internet Messaging Based on Web Services.",
                    "Verifiable Web Services with Hierarchical Interfaces.",
                    "Tool Support for Model-Based Engineering of Web Service Compositions.",
                    "BPEL4WS Unit Testing: Framework and Implementation.",
                    "A QoS Broker Based Architecture for Efficient Web Services Selection.",
                    "QoS-Aware Replanning of Composite Web Services.",
                    "Improving Web Service QoS for Wireless Pervasive Devices.",
                    "JClarens: A Java Framework for Developing and Deploying Web Services for Grid Computing.",
                    "CredEx: User-Centric Credential Management for Grid and Web Services.",
                    "Web Services Mobility in a Pocket.",
                    "Mobile Code Enabled Web Services.",
                    "Transparent Caching for Nomadic WS Clients.",
                    "Optimizing Web Services Performance by Differential Deserialization.",
                    "Enhanced Transport Bindings for Efficient SOAP Messaging.",
                    "Decentralized Decision-Making Protocol for Service Composition.",
                    "Orchestrating Composite Web Services under Data Flow Constraints.",
                    "Weaving Aspects into Web Service Orchestrations.",
                    "A Non-Invasive Approach to Dynamic Web Services Provisioning.",
                    "Fresco: A Web Services based Framework for Configuring Extensible SLA Management Systems.",
                    "Web Services Proxy: An Extensible Platform for Intermediaries of XML Networks.",
                    "Run-time Monitoring of Requirements for Systems Composed of Web-Services: Initial Implementation and Evaluation Experience.",
                    "Self-Reconfiguration of Service-Based Systems: A Case Study for Service Level Agreements and Resource Optimization.",
                    "Modeling, Quantifying, and Testing Complex Aggregate Service Chains.",
                    "Configuration-Based Workflow Composition.",
                    "Automated Synthesis of Composite BPEL4WS Web Services.",
                    "Web Services Automatic Composition with Minimal Execution Price.",
                    "A Model-Driven Approach for Specifying Semantic Web Services.",
                    "WSMX - A Semantic Service-Oriented Architecture.",
                    "An Architecture for Personal Semantic Web Information Retrieval System--Integrating Web Services and Web Contents.",
                    "Dealing with Scale and Adaptation of Global Web Services Management.",
                    "Web Service Management Using System Dynamics.",
                    "A Broker-Based Approach for Improving Web Services Reliability.",
                    "Establishing a Standard Business Process Execution Architecture for Integrating Web Services.",
                    "A Robust Application-Level Approach for Responsiveness Differentiation.",
                    "A Generic Cost Model and Infrastructure for Improving Web Service Efficiency through Dynamic Relocation.",
                    "Message from the General Chairs.",
                    "Message from the Industry Program Co-Chairs.",
                    "Distributed System Development Using Web Service and Enterprise Java Beans.",
                    "Designing and Implementing Enterprise Service Bus (ESB) and SOA Solutions.",
                    "Semantic Web Services Tutorial.",
                    "Quality of Service Specification and Management for XML Web Services.",
                    "Perspectives on Service-Oriented Architecture.",
                    "Collaborative Business Transactions Management: Issues and Challenges.",
                    "Web Service Enablement of Communication Services.",
                    "A Novel Web Service for Presence and its Implementation in an IETF SIMPLE Protocol Environment.",
                    "Performance Impact of Web Service Migration in Embedded Environments.",
                    "Towards a Web Service Composition Management Framework.",
                    "Fully Automated Web Services Orchestration in a Resource Retrieval Scenario.",
                    "Autonomic Execution of Web Service Compositions.",
                    "WSCF: A Framework for Web Service-Based Application Supporting Environment.",
                    "UML-Based Modeling and Validity Checking of Web Service Descriptions.",
                    "A Semantic Template Based Designer for Web Processes.",
                    "Partner and Service Discovery for Collaboration Establishment with Semantic Web Services.",
                    "Domain-Specific Web Service Discovery with Service Class Descriptions.",
                    "A Methodology for Engineering Collaborative Applications over Mobile Web Objects using SyD Middleware.",
                    "Resilient Trust Management for Web Service Integration.",
                    "A Web Service Authentication Control System Based on SRP and SAML.",
                    "Mediation of Trust across Web Services.",
                    "Two-Way Web Service: From Interface Design to Interface Verification.",
                    "Modelling Inter-organizational Workflow Security in a Peer-to-Peer Environment.",
                    "Supporting Adaptive Web-Service Orchestration with an Agent Conversation Framework.",
                    "A Service-Oriented, Scalable Approach to Grid-Enabling of Legacy Scientific Applications.",
                    "Attributed Based Access Control (ABAC) for Web Services.",
                    "CoFrame: A Framework for CSCW Applications Based on Grid and Web Services.",
                    "Improving WS-Security Performance with a Template-Based Approach.",
                    "3PAC: Enforcing Access Policies for Web Services.",
                    "Nedgty: Web Services Firewall.",
                    "Negotiated Security Policies for E-Services and Web Services.",
                    "Policy Lifecycle and Policy Enabled Telecom Open Service Delivery Platform.",
                    "Criteria Analysis and Validation of the Reliability of Web Services-Oriented Systems.",
                    "A Middleware for Replicated Web Services.",
                    "Service Platform for Rapid Development and Deployment of Context-Aware, Mobile Applications.",
                    "Middleware Architecture for Evaluation and Selection of 3rd-Party Web Services for Service Providers.",
                    "Dynamic Stochastic Models for Workflow Response Optimization.",
                    "Schema Based Enhancement of XPath Engine.",
                    "Modeling Response Time of SOAP over HTTP.",
                    "Shared Data Services: An Architectural Approach.",
                    "How to Bridge the Last Gap of Detail for a Complete Integration of Web Services into Users' Tasks.",
                    "Context-Based Web Ontology Service for TCM Information Sharing.",
                    "3D Medical Volume Reconstruction Using Web Services.",
                    "A Study of Service Composition with QoS Management.",
                    "Controlling Remote Instruments Using Web Services for Online Experiment Systems.",
                    "A Small Listener for Heterogeneous Mobile Devices: A Service Enabler with a Uniform Web Object View.",
                    "WS-Attestation: Efficient and Fine-Grained Remote Attestation on Web Services.",
                    "Towards Intelligent Services: A Case Study in Chemical Emergency Response.",
                    "SLL: Running My Web Services on Your WS Platforms.",
                    "M2M Interface: A Web Services-based Framework for Federated Enterprise Management.",
                    "A Multi-Agents System to Implement E-Business.",
                    "Enterprise Transformation to a Service Oriented Architecture: Successful Patterns.",
                    "An E-Mail Client Implementation with Spam Filtering and Security Mechanisms.",
                    "SOA-Based Integration of IT Service Management Applications.",
                    "Main Business Service Dimensions In an E-commerce Environment.",
                    "BPIMS-WS: A Service-Oriented Architecture for Trading Partners Integration.",
                    "Service-Oriented Development and Integration: Toward Web Services-Based Business Information Systems.",
                    "SPL: An Structured Pipeline Method for Frequent Remote Service Interactions in Bioinformatics Workflows.",
                    "i2Map: An Approach to Model the Landscape of Federated Systems.",
                    "On Improving Performance and Conserving Power in Cluster-Based Web Servers.",
                    "Evaluating the Process Control-Flow Complexity Measure.",
                    "Global and Local QoS Constraints Guarantee in Web Service Selection.",
                    "QoS-Aware Composition of Web Services: A Look at Selection Algorithms.",
                    "Dynamic Trust Establishment with Privacy Protection for Web Services.",
                    "Beyond Web Services: Towards On-Demand Complex Adaptive Environments.",
                    "Composing Web Services on the Basis of Natural Language Requests.",
                    "Toward Fundamental Primitives and Infrastructure Enhancements for Distributed Web Object Coordination and Workflows.",
                    "Validating Compositions of Geospatial Processing Web Services in a Scientific Workflow Environment.",
                    "A Universal Service Description Language.",
                    "OWL-S Based Autonomic Services for Grid Computing.",
                    "A Framework for Applications Utilizing Web Services with Callbacks.",
                    "Temporal Aggregates for Web Services on the Semantic Web.",
                    "Semantic Management of Web Services.",
                    "Formalized Model and Implementation of Service Virtualization.",
                    "Service-Oriented Software Reengineering: Bertie3 as Web Services.",
                    "ELIN: A Framework to Deliver Media Content in an Efficient Way Based in MPEG Standards.",
                    "A Web Service for Efficient Ontology Comparison."
                ]
            },
            {
                "sub_name_abbr": "conf/icws/2005sdwp",
                "sub_name": "Proceedings of the ICWS 2005 Second International Workshop on Semantic and Dynamic Web Processes, SDWP@ICWS 2005, Orlando, Florida, USA, July 11, 2005.",
                "count": 12,
                "papers": [
                    "Dynamic Business: an Opportunity and Challenge for Dynamic Web Processes.",
                    "Web Service Interactions: Analysis and Design.",
                    "Rebuilding the Semantic Web Service Architecture.",
                    "Selecting Web Services for Optimal Composition.",
                    "SOPHIE - A Conceptual Model for a Semantic Choreography Framework.",
                    "Semi-Automatic Web Service Generation and Classification.",
                    "Structuring the Web to Cope with Dynamic Changes.",
                    "Semantic Matching of Web Service Policies.",
                    "A B2B formal conversation language based on Semantic Web Services.",
                    "Semantically Annotating Reactive Web Services with Temporal Specifications.",
                    "Linking Semantics Web Service Efforts.",
                    "A CAN-Based P2P Infrastructure for Semantic Web Services."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "11th ICWS 2004",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2004",
                "sub_name": "Proceedings of the IEEE International Conference on Web Services (ICWS'04), June 6-9, 2004, San Diego, California, USA.",
                "count": 124,
                "papers": [
                    "Convergence of Web Services, Grid Services and Business Processes.",
                    "Extending the Innovation Ecosystem.",
                    "Going Public with Software-as-a-Service.",
                    "Business Services Networks.",
                    "Managing the Intelligent Enterprise.",
                    "Net Traveler: A Framework for Autonomic Web Services Collaboration, Orchestration and Choreography in E-Government Information Systems.",
                    "Web Services as Information Systems Innovation: A Theoretical Framework for Web Service Technology Adoption.",
                    "WS-I Basic Profile: A Practitioner's View.",
                    "Scalable Peer-to-Peer Process Management - The OSIRIS Approach.",
                    "Protocol-Based Business Process Modeling and Enactment.",
                    "Describing and Reasoning on Web Services using Process Algebra.",
                    "A Framework for Collaborative Product Commerce using Web Services.",
                    "Monitoring E-Business Web Services Usage through a Log Based Architecture.",
                    "Web Services and Multi-Channel Integration: A Proposed Framework.",
                    "Managing Asynchronous Web Services Interactions.",
                    "On Feature Interactions among Web Services.",
                    "Realizability of Conversation Protocols With Message Contents.",
                    "Web-Service Semantic Enabled Implementation of Machine vs.Machine Business Negotiation.",
                    "Ad-hoc Invocation of Semantic Web Services.",
                    "Specification of Invocable Semantic Web Resources.",
                    "Code Generation for WSLAs using AXpect.",
                    "An Adaptive Process Allocation Strategy for Proportional Responsiveness Differentiation on Web Servers.",
                    "Dynamic Invocation Model of Web Services Using Subsumption Relations.",
                    "Privacy Policy Compliance for Web Services.",
                    "Providing Privacy for Web Services by Anonymous Group Identification.",
                    "Towards Standardized Web Services Privacy Technologies.",
                    "A Trust-based Context-Aware Access Control Model for Web-Services.",
                    "A Peer-to-Peer Framework for Web Service Discovery with Ranking.",
                    "Reputation = f(User Ranking, Compliance, Verity).",
                    "Constraint Specification and Processing in Web Services Publication and Discovery.",
                    "Comparison of UDDI Registry Replication Strategies.",
                    "External Matching in UDDI.",
                    "Managing and Securing Web Services with VPNs.",
                    "Best-Practice Patterns and Tool Support for Configuring Secure Web Services Messaging.",
                    "Adapting the Communication of Web Services to the Language of Their User Community.",
                    "Dynamic Data Integration Using Web Services.",
                    "Discovery of Web Services in a Federated Registry Environment.",
                    "Web Services for Information Extraction from the Web.",
                    "Using Workflows to Coordinate Web Services in Pervasive Computing Environments.",
                    "Introducing Dynamic Distributed Coordination in Web Services for Next Generation Service Platforms.",
                    "Designing Web Services with Tropos.",
                    "Transforming BPEL into Annotated Deterministic Finite State Automata for Service Discovery.",
                    "Model-based Discovery of Web Services.",
                    "An Algorithm for Web Service Discovery through Their Composition.",
                    "Behavior Descriptions of Mobile Agents for Web Services Integration.",
                    "Wireless Reliable Messaging Protocol for Web Services (WS-WRM).",
                    "Hyperdatabases for Peer-to-Peer Data Stream Processing.",
                    "A DAML-Based Repository for QoS-Aware Semantic Web Service Selection.",
                    "Service Selection in Dynamic Demand-Driven Web Services.",
                    "Towards Intelligent Web Services for Automating Medical Service Composition.",
                    "Services Ecosystem: Towards a Resilient Infrastructure for On Demand Services Provisioning in Grid.",
                    "Grid Resources for Industrial Applications.",
                    "A Polyarchical Middleware for Self-Regenerative Invocation of Multi-Standard Ubiquitous Services.",
                    "WS-Net: A Petri-net Based Specification Model for Web Services.",
                    "WSCE: A Flexible Web Service Composition Environment.",
                    "A Method for Composing Process of Non-deterministic Web Services.",
                    "Logic-based Web Services Composition: From Service Description to Process Model.",
                    "Automatic Composition of Web Services with Contingency Plans.",
                    "A Multi-Level Model for Web Service Composition.",
                    "DAML-QoS Ontology for Web Services.",
                    "Provisioning Resilient, Adaptive Web Services-based Workflow: A Semantic Modeling Approach.",
                    "RAWS: Reflective Engineering for Web Services.",
                    "Reusable Functional Composition Patterns for Web Services.",
                    "Large Scale, Type-Compatible Service Composition.",
                    "Triana: A Graphical Web Service Composition and Execution Toolkit.",
                    "Enhancing Web Services with Message-Oriented Middleware.",
                    "IDSim: An Extensible Framework for Interoperable Distributed Simulation.",
                    "Compressing SOAP Messages by using Differential Encoding.",
                    "Towards Autonomous Service Composition in A Grid Environment.",
                    "Adaptive Grid Service Flow Management: Framework and Model.",
                    "The Design and Implementation of An OGSA-based Grid Information Service.",
                    "Dynamic Workflow Composition using Markov Decision Processes.",
                    "Manners Externalize Semantics for On-demand Composition of Context-aware Services.",
                    "SRN: An Extended Petri-Net-Based Workflow Model for Web Service Composition.",
                    "The Evolution of Composition Framework in a Distributed System Toolkit.",
                    "SLA Management - Challenges in the Context of Web-Service-Based Infrastructures.",
                    "Web Service Authorization Framework.",
                    "Efficient Model-Driven Service Brokering using Web Services.",
                    "A Dynamic Services Discovery Framework for Traversing Web Services Representation Chain.",
                    "Evolution of Web Services Approach in SFMS - A Case Study.",
                    "Web Service Gateway - A Step Forward to E-Business.",
                    "Adapting Web Services in a Heterogeneous Environment.",
                    "Web Services, Grid Computing, and Business Process Management: Exploiting Complementarities for Business Agility.",
                    "Polimatica: Abstraction for Customizable Private Virtual Organizations in Global Grids.",
                    "Targeting Heterogeneous Multimedia Environments with Web Services.",
                    "WSIP - Web Service SIP Endpoint for Converged Multimedia/Multimodal Communication over IP.",
                    "Context Disambiguation in Web Search Results.",
                    "3D Visualization for Software Development.",
                    "JClarens: A Java Based Interactive Physics Analysis Environment for Data Intensive Applications.",
                    "A Survey of J2EE Application Performance Management Systems.",
                    "Semantics Based Verification and Synthesis of BPEL4WS Abstract Processes.",
                    "Compatibility Verification for Web Service Choreography.",
                    "A Semantic Approach for Designing E-Business Protocols.",
                    "Mapping a Business Process Model to a Semantic Web Service Model.",
                    "IRIS: A Framework for Mediator-Based Composition of Service-Oriented Software.",
                    "A CP-nets-based Design and Verification Framework for Web Services Composition.",
                    "Facilitating Automated Search for Web Services.",
                    "Building Desktop Applications with Web Services in a Message-based MVC Paradigm.",
                    "Access Control for Semantic Web Services.",
                    "Authorization Service for Web Services and its Implementation.",
                    "JULIET: A Distributed Fault Tolerant Load Balancer for.NET Web Services.",
                    "Team-based Agents for Proactive Failure Handling in Dynamic Composition of Web Services.",
                    "Combining Query and Preference - An Approach to Fully Automatize Dynamic Service Binding.",
                    "Anonymizing Web Services through a Club Mechanism with Economic Incentives.",
                    "A Meta-Modeling Approach to Web Services.",
                    "A Dynamic Data Structure for Geospatial Web Services Integration.",
                    "Web Services Container Reference Architecture (WSCRA).",
                    "WS-QDL Containing Static, Dynamic, and Statistical Factors of Web Services Quality.",
                    "Net-Centric Human-Robotics Operations - Integration of Business/Military Process Management, Grid Computing, and Robotics.",
                    "An Approach for Parallel Execution of Web Services.",
                    "A Web Service Composition and Deployment Framework for Scientific Workflows.",
                    "Web Services and Workflow Automation for the Air Force.",
                    "Sound-Based Mobile Payment System.",
                    "Location-Mediated Coordination of Web Services in Ubiquitous Computing.",
                    "Extending the Web Services Model to IT Services.",
                    "Specification and Execution of Policies for Grid Service Selection.",
                    "Web Services-Based Data Management: Evaluating the Performance of UDDI Registries.",
                    "Response Time Histograms for Composite Web Services.",
                    "A Semantic Web Services Enabled Web Portal Architecture.",
                    "Services Oriented Architecture and Semantic Web Processes.",
                    "Data Grid and Gridflow Management Systems.",
                    "Complex Event Processing.",
                    "Migrating to a Service-oriented Architecture with Web Services: Beyond the Hype.",
                    "Semantic Web Services: Current Status and Future Directions."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "10th ICWS 2003",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icws/2003",
                "sub_name": "Proceedings of the International Conference on Web Services, ICWS '03, June 23 - 26, 2003, Las Vegas, Nevada, USA.",
                "count": 83,
                "papers": [
                    "Application of Linear Logic to Web Service Composition.",
                    "Workflow-Based Information Integration in a Web Services Environment.",
                    "Proteus: A System for Dynamically Composing and Intelligently Executing Web Services.",
                    "Towards a Semantic Choreography of Web Services: From WSDL to DAML-S.",
                    "Service Composition Issues for Distributed Business Processes.",
                    "Explicit Representation of Service Semantics: Towards Automated Composition Through a Dynamically Re-Configurable Architectural Style for On Demand Computing.",
                    "Automatic Composition of Semantic Web Services.",
                    "Towards a Context-Based Service Composition Framework.",
                    "A Method to Extend BPEL4WS to Enable Business Performance Measurement.",
                    "Workflow Execution History Data Management: A Framework.",
                    "Web Services Evolution and Enterprise Adoption: Service Oriented Architecture Approach Holds the Key.",
                    "Web Services Enabled E-Market Access Control (EMAC).",
                    "Coordination of Cooperative Processes with the Synchronization Point Concept.",
                    "Integration of Business Event and Rule Management with the Web Services Model.",
                    "Towards Web Services Standards for Fault Tolerance Capabilities in Inter-organizational Workflow Management Systems.",
                    "Developing e-Negotiation Process Support by Web Services.",
                    "Expressiveness of Workflow Description Languages.",
                    "Web Services and BPEL4WS for Dynamic eBusiness Negotiation Processes.",
                    "Alliance or Independence: When to Leverage Web Services Architecture.",
                    "Adaptive Workflow Management with Open Kernel Framework Based on Web Services.",
                    "Adaptive Workflow = Web Services + Agents.",
                    "Inter-Organizational Business Process Management Using Web Services - A Case Study and Research Issues.",
                    "Alert-Driven Process Integration in a Web Services Environment.",
                    "A Query Paradigm for Web Services.",
                    "The Framework Supporting QoS-Enabled Web Services.",
                    "Service Oriented Meta Platform: Web Services Construction, Deployment and Management Platform.",
                    "Environment from the Molecular Level e-Science Project and its Use of CCLRC's Web Services Based Data Portal.",
                    "UX- An Architecture Providing QoS-Aware and Federated Support for UDDI.",
                    "A Community-Based Approach for Selecting Service Providers.",
                    "Extending UDDI with Context-Aware Features Based on Semantic Service Descriptions.",
                    "Cooperative Discovery for User-Centered Web Service Provisioning.",
                    "Ontology Validation in OPAL.",
                    "Using DAML-S for P2P Discovery.",
                    "A Framework for Discovering Web Services with Desired Quality of Services Attributes.",
                    "Providing Taxonomy Browsing in UDDI.",
                    "A Flexible Authentication Method for UDDI Registries.",
                    "Web Service Integration Platform with Privacy Preferences for One-Stop Application.",
                    "Securing Web Services with SOAP Security Proxies.",
                    "A Stateless Network Architecture for Inter-Enterprise Authentication, Authorization and Accounting.",
                    "Access Control in Dynamic XML-Based Web-Services with X-RBAC.",
                    "An Overview of Web Service Security in ASP.NET.",
                    "Implementation of WS-Security and Its Performance Improvements.",
                    "Architecture-Based Development of Web Service Based Applications.",
                    "A Spanning Tree Based Approach to Identifying Web Services.",
                    "Web Services in Wireless Networks - What Happened to the Performance?",
                    "The CCLRC Dataportal.",
                    "A Web Services Specification for the Healthcare Enterprise as a Unified Approach to the Exchange of Medical Information.",
                    "Security System for Enterprise-Spanning Collaboration.",
                    "Experiences Developing a Collaborative Travel Planning Application with .NET Web Services.",
                    "Illustrating Conflict of Interest Assertions in WS-Policy with a Financial Application Example.",
                    "A Micro-Services Framework on Mobile Devices.",
                    "Web Services Based Mediators for Digital Libraries.",
                    "A Web Service Approach to Universal Accessibility in Collaboration Services.",
                    "Web Services Communication within the PROGRESS Grid-Portal Environment.",
                    "Pushing the SOAP Envelope with Web Services for Scientific Computing.",
                    "A Gateway for Grid Services Access.",
                    "Mobile ISAW.",
                    "Interactive Grid Architecture for Application Service Providers.",
                    "WSOL - A Language for the Formal Specification of Classes of Service for Web Services.",
                    "Role and Expression of Consent in Web Services.",
                    "The Study of Home Networking Resource Sharing Using OSGi.",
                    "Adding Semantics to Web Services Standards.",
                    "Web Services for Teaching: A Case Study.",
                    "Designing a Web Service Benchmark.",
                    "Implementing Watermark Token in WS-Security for Digital Content Distribution.",
                    "A Web Service Approach to Grid Information Service.",
                    "Web Services in the Context of MDA.",
                    "A Peer to Peer (P2P) Dynamic Workflow Management System Based on Web Services.",
                    "Policy and Quality of Service Management for Enterprise Web Services: Using Policy-Based Information Management to Meet Diverse Mission Objectives for the Department of Defense.",
                    "Integration of SIP VoIP and Messaging Systems with AccessGrid and H.323.",
                    "Tradeoffs of Streaming XML.",
                    "Accelerated Information Sharing for Law Enforcement (AISLE) Using Web Services.",
                    "User Service Extension for Web View Materialized Model in Distributed Environment.",
                    "Design and Implementation of Video Retrieval System Supporting Adaptive Streaming Service.",
                    "Building a Loosely Coupled Infrastructure for Web Services.",
                    "Web Services: An Aerospace & Defense Perspective.",
                    "Web Service Oriented Architecture: \"Smart Operations\" and IT Strategy.",
                    "Accessing COM-Based Applications from Java Using Web Services.",
                    "Dynamic Adaptive Migration of Web Services.",
                    "Performance of Java Web Services Implementations.",
                    "Web Services Technology and Learning Technology- A Web-Services Model for Constructing Decentralized Virtual Learning Environments.",
                    "Build W3C XML Schema for UN/EDIFACT Messages with Multilayer and Modular Architecture.",
                    "SOAP Optimization via Client Side Caching."
                ]
            }
        ]
    }
]