[
	{
		"name": "IET Software",
		"year": "2022",
		"info": "Volume 16: 2022",
		"count": 8,
		"papers": [
			"Systematic review of question answering over knowledge bases.",
			"A 20-year mapping of Bayesian belief networks in software project management.",
			"Software defect prediction based on stacked sparse denoising autoencoders and enhanced extreme learning machine.",
			"An improved K-means algorithm for big data.",
			"Managing non-functional requirements in agile software development.",
			"Applying usability recommendations when developing mobile instant messaging applications.",
			"Mining detailed information from the description for App functions comparison.",
			"Vulcont: A recommender system based on context history ontology."
		]
	},
	{
		"name": "IET Software",
		"year": "2021",
		"info": "Volume 15: 2021",
		"count": 31,
		"papers": [
			"Benefits management in software development: A systematic review of empirical studies.",
			"Automated class diagram elicitation using intermediate use case template.",
			"Concurrency coverage criteria for activity diagrams.",
			"Correlation feature and instance weights transfer learning for cross project software defect prediction.",
			"Empirical studies on the impact of filter-based ranking feature selection on security vulnerability prediction.",
			"Hot question prediction in Stack Overflow.",
			"Requirements engineering for crossover services: Issues, challenges and research directions.",
			"Searching relevant papers for software engineering secondary studies: Semantic Scholar coverage and identification role.",
			"VP_TT: A value propagation based equivalence checker for testability transformations.",
			"FindCmd: A personalised command retrieval tool.",
			"An empirical study of local-decision-making-based software customization in distributed development.",
			"Long short-term memory on abstract syntax tree for SQL injection detection.",
			"Improving source code suggestion with code embedding and enhanced convolutional long short-term memory.",
			"Social loafing prevention in agile software development teams using team expectations agreements.",
			"Enhanced framework for ensemble effort estimation by using recursive-based classification.",
			"Systematic literature review on software architecture of educational websites.",
			"MeidyaCoM-policy: Approach for modelling and checking repair policies for self-healing systems.",
			"Prioritization of global software requirements' engineering barriers: An analytical hierarchy process.",
			"Adaptive multi-agent smart academic advising framework.",
			"Mining Stack Overflow for API class recommendation using DOC2VEC and LDA.",
			"A new population initialisation method based on the Pareto 80/20 rule for meta-heuristic optimisation algorithms.",
			"Emerging and multidisciplinary approaches to software engineering.",
			"Using system dynamics to teach about dependencies, correlation and systemic thinking on the software process workflows.",
			"A hybrid model for prediction of software effort based on team size.",
			"Assessment of process capabilities in transition to a data-driven organisation: A multidisciplinary approach.",
			"What have we learnt from the challenges of (semi-) automated requirements traceability? A discussion on blockchain applicability.",
			"Beyond factors that motivate the adoption of the ISO/IEC 29110 in Mexico: An exploratory study of the implementation pace of this standard and the benefits observed.",
			"Design of a gamification strategy to intervene in social and human factors associated with software process improvement change resistance.",
			"Measuring teamwork quality in large-scale agile organisations evaluation and integration of the aTWQ approach.",
			"Towards a privacy debt.",
			"Applying virtual reality to teach the software development process to novice software engineers."
		]
	},
	{
		"name": "IET Software",
		"year": "2020",
		"info": "Volume 14: 2020",
		"count": 81,
		"papers": [
			"Impact of design patterns on software quality: a systematic literature review.",
			"Requirement patterns: a tertiary study and a research agenda.",
			"Automated tests for cross-platform mobile apps in multiple configurations.",
			"Combining goal model with reviews for supporting the evolution of apps.",
			"e-VOL BPMN: a technique to support the evolution and learning of BPMN diagrams.",
			"Probabilistic analysis of QoS-aware service composition with explicit environment models.",
			"Guest Editorial: Software Engineering Applications to Solve Organisations Issues.",
			"Implementing ISO/IEC 29110 to reinforce four very small entities of Mexico under an agile approach.",
			"Stochastic gradient boosting for predicting the maintenance effort of software-intensive systems.",
			"Zeus - a tool for generating rule-based serious games with gamification techniques.",
			"Composite pattern to handle variation points in software architectural design of evolving application systems.",
			"Academic approach to transform organisations: one engineer at a time.",
			"Evaluation of a model-based testing platform for Java applications.",
			"QCPW: a quality centric process workflow improvement approach for a legacy healthcare information system.",
			"ITSM model for very small organisation: an empirical validation.",
			"Improving the quality and quantity of functional and non-functional requirements obtained during requirements elicitation stage for the development of e-commerce mobile applications: an alternative reference process model.",
			"Framework to support the Data Science of smart city models for decision-making oriented to the efficient dispatch of service petitions.",
			"Multiple software product lines to configure applications of internet of things.",
			"Image recognition in UAV videos using convolutional neural networks.",
			"Guest Editorial: Knowledge Discovery for Software Development (KDSD).",
			"Within-project and cross-project just-in-time defect prediction based on denoising autoencoder and convolutional neural network.",
			"Predicting the bug fixing time using word embedding and deep long short term memories.",
			"Discovering software developer's coding expertise through deep learning.",
			"Organising the knowledge from stack overflow about location-sensing of Android applications.",
			"Ontology for knowledge condensation to support expertise location in the code phase during software development process.",
			"Requirements knowledge acquisition from online user forums.",
			"Using health data repositories for developing clinical system software: a multi-objective fuzzy genetic approach.",
			"Toward successful agile requirements change management process in global software development: a client-vendor analysis.",
			"Comprehensive complexity metric for data warehouse multidimensional model understandability.",
			"Process metrics for software defect prediction in object-oriented programs.",
			"Impacts of process audit review and control efforts on software project outcomes.",
			"Modified fuzzy sentiment analysis approach based on user ranking suitable for online social networks.",
			"Towards the implementation of requirements management specific practices (SP 1.1 and SP 1.2) for small- and medium-sized software development organisations.",
			"Empirical investigation: performance and power-consumption based dual-level model for exascale computing systems.",
			"Software development effort estimation: a systematic mapping study.",
			"Systematic literature review on intent-driven systems.",
			"Checklist-based techniques with gamification and traditional approaches for inspection of interaction models.",
			"Efficient improved ant colony optimisation algorithm for dynamic software rejuvenation in web services.",
			"Detecting application logic vulnerabilities via finding incompatibility between application design and implementation.",
			"Analytic Hierarchy Process Based Prioritisation and Taxonomy of Success Factors for Scaling Agile Methods in Global Software Development.",
			"New internal metric for software clustering algorithms validity.",
			"SmartVisual: a visualisation tool for SmartThings IoT Apps using static analysis.",
			"Overlap-aware rapid type analysis for constructing one-to-one matched call graphs in regression test selection.",
			"Determining the best-fit programmers using Bayes' theorem and artificial neural network.",
			"Software defect prediction via LSTM.",
			"Usability and user experience evaluation of natural user interfaces: a systematic mapping study.",
			"Dynamic software updating: a systematic mapping study.",
			"Aspect-based requirements mining technique to improve prioritisation process: multi-stakeholder perspective.",
			"Adaptive random testing based on flexible partitioning.",
			"Multi-view city-based approach for code-smell evolution visualisation.",
			"Software ageing prediction using neural network with ridge.",
			"Categorisation-based approach for predicting the fault-proneness of object-oriented classes in software post-releases.",
			"SW-Context: a model to improve developers' situational awareness.",
			"Classifying design-level requirements using machine learning for a recommender of interaction design patterns.",
			"Cloud testing automation: industrial needs and ElasTest response.",
			"Taxonomy of secure data dissemination techniques for IoT environment.",
			"Evolution of quality assessment in SPL: a systematic mapping.",
			"Towards a reference process for software architecture reconstruction.",
			"Understanding requirements prioritisation: literature survey and critical evaluation.",
			"Factors influencing the requirements engineering process in offshore software development outsourcing environments.",
			"Resource allocation mechanisms in cloud computing: a systematic literature review.",
			"Literature survey of deep learning-based vulnerability analysis on source code.",
			"Retrieving and mining professional experience of software practice from grey literature: an exploratory review.",
			"Practices connected to perceived client benefits of software projects.",
			"Qualitative analysis of virtual reality adoption by tourism operators in low-density regions.",
			"Supporting the teaching of design thinking techniques for requirements elicitation through a recommendation tool.",
			"Software ageing process as an evolving dynamic system.",
			"Automatic summarising of user stories in order to be reused in future similar projects.",
			"Comparison of threshold identification techniques for object-oriented software metrics.",
			"Predicting co-change probability in software applications using historical metadata.",
			"Investigating the information value of different sources of evidence of developers' expertise for bug assignment in open-source projects.",
			"Software crowdsourcing task pricing based on topic model analysis.",
			"Software defect prediction using K-PCA and various kernel-based extreme learning machine: an empirical study.",
			"Changes in artefact-centric business process instances and their correctness prediction.",
			"Code review effectiveness: an empirical study on selected factors influence.",
			"WSEMQT: a novel approach for quality-based evaluation of web data sources for a data warehouse.",
			"Deep learning-based prototyping of android GUI from hand-drawn mockups.",
			"Manifold embedded distribution adaptation for cross-project defect prediction.",
			"Mining social collaboration patterns in developer social networks.",
			"Customer reviews as the measure of software quality.",
			"Organisational climate assessments of Agile teams - a qualitative multiple case study."
		]
	},
	{
		"name": "IET Software",
		"year": "2019",
		"info": "Volume 13: 2019",
		"count": 62,
		"papers": [
			"Guest Editorial: Adaptive and Reconfigurable Service-Oriented, Cloud and Virtualised Architectures.",
			"E2SM: a security tool for adaptive cloud-based service-oriented applications.",
			"State of runtime adaptation in service-oriented systems: what, where, when, how and right.",
			"Formal modelling and verifying elasticity strategies in cloud systems.",
			"Modelling and verifying time-aware processes for cyber-physical environments.",
			"Smart and safe self-adaption of connected devices based on discrete controllers.",
			"Software fault localisation: a systematic mapping study.",
			"Generating contextual help for user interfaces from software requirements.",
			"Application of extent analysis FAHP to determine the relative weights of evaluation indices for library website usability acceptance model.",
			"Guest Editorial: Gamification and Persuasive Games for Software Engineering.",
			"Applying gamification elements to build teams for software development.",
			"Agile software process improvement: a collaborative game toolbox.",
			"Gamification for software process improvement: a practical approach.",
			"Proposal of an assessment framework for gamified environments: a case study.",
			"Case study of the introduction of game design techniques in software development.",
			"Designing game scenarios for software project management education and assessment.",
			"Interactive three-dimensional virtual environment to reduce the public speaking anxiety levels of novice software engineers.",
			"Improving software security awareness using a serious game.",
			"Guest Editorial: Security and Privacy in Cloud-based Systems.",
			"Agile risk management for multi-cloud software development.",
			"Optical PUFs as physical root of trust for blockchain-driven applications.",
			"Effective convolution method for privacy preserving in cloud over big data using map reduce framework.",
			"Assessing source code vulnerabilities in a cloud-based system for health systems: OpenNCP.",
			"Requirements elicitation for secure and interoperable cross-border health data exchange: the KONFIDO study.",
			"Service level agreement-based GDPR compliance and security assurance in (multi)Cloud-based systems.",
			"Emerging trends in cloud computing security: a bibliometric analyses.",
			"Critical influential determinants of IT innovation adoption at organisational level in local government context.",
			"Live interactive queries to a software application's memory profile.",
			"Pattern detection and design rationale traceability: an integrated approach to software design quality.",
			"Process diversity in software development: an industrial study.",
			"Code generator framework for smart TV platforms.",
			"Counter-example generation procedure for path-based equivalence checkers.",
			"Adapting the elitism on greedy algorithm for variable strength combinatorial test cases generation.",
			"Development of content-based SMS classification application by using Word2Vec-based feature extraction.",
			"Development and evaluation of adaptive metacognitive scaffolding for algorithm-learning system.",
			"Prioritising abstract test cases: an empirical study.",
			"MBT in agile/lightweight processes: a process-centred review.",
			"Are the UML modelling tools powerful enough for practitioners? A literature review.",
			"Software structure evolution and relation to subgraph defectiveness.",
			"Search-based software engineering for optimising usability of user interfaces within model transformations.",
			"Recommending human resources to project leaders using a collaborative filtering-based recommender system: Case study of gitHub.",
			"Auction-based serious game for bug tracking.",
			"Joint distribution matching model for distribution-adaptation-based cross-project defect prediction.",
			"Demand Based Test Case Generation for Object Oriented System.",
			"Methodology for the quantification of the effect of patterns and anti-patterns association on the software quality.",
			"Combining genetic algorithm and pairwise testing for optimised test generation from UML ADs.",
			"Dealing with crosscutting and dynamic features in component software using aspect-orientation: requirements and experiences.",
			"Tool support for managing repetitive program changes in evolving software.",
			"Introducing gamification to increase staff involvement and motivation when conducting SPI initiatives in small-sized software enterprises.",
			"APIUaaS: a reference architecture for facilitating API usage from a data analytics perspective.",
			"Systematic literature review of preprocessing techniques for imbalanced data.",
			"Software development methodologies and practices in start-ups.",
			"Why use case specifications are hard to use in generating prototypes?",
			"Classification as an approach to public key infrastructure requirements analysis.",
			"Labelling issue reports in mobile apps.",
			"Proposed framework for planning software releases using fuzzy rule-based system.",
			"Maturity model based on CMMI for governance and management of Green IT.",
			"Improving software requirements reasoning by novices: a story-based approach.",
			"UML2Merge: a UML extension for model merging.",
			"Are MAs profitable to search-based PLA design?",
			"Code-aware combinatorial interaction testing.",
			"Investigation into the effectiveness of white-box T-way testing."
		]
	},
	{
		"name": "IET Software",
		"year": "2018",
		"info": "Volume 12: 2018",
		"count": 56,
		"papers": [
			"Reliability analysis of safety-critical and control systems: a state-of-the-art review.",
			"Comparative analysis of soft computing techniques for predicting software effort based use case points.",
			"Mobile agent-based regression test case generation using model and formal specifications.",
			"Variance analysis of software ageing problems.",
			"Characterising text mining: a systematic mapping review of the Portuguese language.",
			"Study on service selection effort estimation in service oriented architecture-based applications powered by information entropy weight fuzzy comprehensive evaluation model.",
			"Extending the SEMAT Kernel with the TDD practice.",
			"Selecting a biodiversity conservation area with a limited budget using the binary African buffalo optimisation algorithm.",
			"Systematic adaptation of dynamically generated source code via domain-specific examples.",
			"Empirical study of the evaluation of perspectives to knowledge capitalisation in Brazilian software industry.",
			"Domain-specific language for automatic generation of UML models.",
			"COEUS 2.0: automated platform to integrate and publish biomedical data as nanopublications.",
			"Diagnosis of transportation modes on mobile phone using logistic regression classification.",
			"A method for handwritten word spotting based on particle swarm optimisation and multi-layer perceptron.",
			"Progress on approaches to software defect prediction.",
			"Performance study of real-time operating systems for internet of things devices.",
			"SamEn-SVR: using sample entropy and support vector regression for bug number prediction.",
			"How test suites impact fault localisation starting from the size.",
			"Model-based approach to develop learning exercises in language-learning applications.",
			"Improved pairwise test suites for non-prime-power orders.",
			"Bayes-TDG: effective test data generation using Bayesian belief network: toward failure-detection effectiveness and maximum coverage.",
			"Reliability evaluation of UML/DAM software architectures under parameter uncertainty.",
			"Simulation research for telecommunication data mining based on mobile information node.",
			"Assisted surface redesign by perturbing its point cloud representation.",
			"Empirical study on developer factors affecting tossing path length of bug reports.",
			"DIV-TBAT algorithm for test suite reduction in software testing.",
			"Technique for representing requirements using personas: a controlled experiment.",
			"Guest Editorial: Search-Based Software Engineering.",
			"Threats to validity in search-based predictive modelling for software engineering.",
			"Test cases generation for multiple paths based on PSO algorithm with metamorphic relations.",
			"Evolutionary approach to generating test data for data flow test.",
			"Search-based software engineering for constructing covering arrays.",
			"Systematic literature study for dimensional classification of success factors affecting process improvement in global software development: client-vendor perspective.",
			"Multiple-components weights model for cross-project software defect prediction.",
			"Domain-specific modelling language for belief-desire-intention software agents.",
			"Requirements elicitation techniques: a systematic literature review based on the maturity of the techniques.",
			"Guest Editorial: Software Architecture for the Web of Things (SAWoT).",
			"Architecting the Web of Things for the fog computing era.",
			"Software architecture pattern selection model for Internet of Things based systems.",
			"Description and reasoning for vague ontologies using logic programming.",
			"Fighting network restrictions of request-response pattern with MQTT.",
			"Real-time P300-based BCI in mechatronic control by using a multi-dimensional approach.",
			"EUDroid: a formal language specifying the behaviour of IoT devices.",
			"An acceptance testing approach for Internet of Things systems.",
			"Comparative analysis of variability modelling approaches in component models.",
			"Fault analysis of service-oriented systems: a systematic literature review.",
			"Systematic mapping study on question answering frameworks over linked data.",
			"Flexible approach to schedule tasks in cloud-computing environments.",
			"On-line tracing of XACML-based policy coverage criteria.",
			"A cost-effective adaptive random testing approach by dynamic restriction.",
			"Efficient approach for view materialisation in a data warehouse by prioritising data cubes.",
			"Discover deeper bugs with dynamic symbolic execution and coverage-based fuzz testing.",
			"Feature extraction based on information gain and sequential pattern for English question classification.",
			"Low-rank representation for semi-supervised software defect prediction.",
			"Empirical study on software process variability modelling with SMartySPEM and vSPEM.",
			"MS-guided many-objective evolutionary optimisation for test suite minimisation."
		]
	},
	{
		"name": "IET Software",
		"year": "2017",
		"info": "Volume 11: 2017",
		"count": 40,
		"papers": [
			"Critical challenges in managing offshore software development outsourcing contract from vendors' perspectives.",
			"Inference network building and movements prediction based on analysis of induced dependencies.",
			"Integration of artificial intelligence activities in software development processes and measuring effectiveness of integration.",
			"UML models change impact analysis using a text similarity technique.",
			"Multiple paths test data generation based on particle swarm optimisation.",
			"Approach to mine influential functions based on software execution sequence.",
			"ASCAA: API-level security certification of android applications.",
			"Ontology-based service discovery framework for dynamic environments.",
			"Guest Editorial: Advances in Knowledge and Information Software Management.",
			"Review of approaches to manage architectural knowledge in Agile Global Software Development.",
			"Product review management software based on multiple classifiers.",
			"Prediction of leptospirosis cases using classification algorithms.",
			"Intelligent generator of big data medical imaging repositories.",
			"Solving the manufacturing cell design problem using the modified binary firefly algorithm and the egyptian vulture optimisation algorithm.",
			"Using CSTPNs to model traffic control CPS.",
			"Follow a guide to solve urban problems: the creation and application of urban knowledge graph.",
			"Blended versus face-to-face: comparing student performance in a therapeutics class.",
			"Systematic mapping study on MBT: tools and models.",
			"Formal model for user-centred adaptive mobile devices.",
			"Equilibrium with predictive routeing in the online version of the Braess paradox.",
			"Power-efficient real-time scheduling based on multi-granularity resource reservation for multimedia services.",
			"CIM for data warehouse requirements using an UML profile.",
			"Building the foundations for 'MDE as Service'.",
			"Clustering ECG heartbeat using improved semi-supervised affinity propagation.",
			"Word cloud segmentation for simplified exploration of trending topics on Twitter.",
			"Evaluation of an approach to define elicitation guides of non-functional requirements.",
			"The Impact of Sentiment Orientations on Successful Crowdfunding Campaigns through Text Analytics.",
			"Resource optimised workflow scheduling in Hadoop using stochastic hill climbing technique.",
			"Task assignment to distributed teams aided by a hybrid methodology of verbal decision analysis.",
			"To what extent can prescriptions be meaningfully exchanged between primary care terminologies? A case study of four western European classification systems.",
			"Support vector regression for predicting the productivity of higher education graduate students from individually developed software projects.",
			"Privacy preserving big data publishing: a scalable k-anonymization approach using MapReduce.",
			"Survey of communication and awareness as the most relevant socio-technical aspects of requirements-driven collaboration among software development teams.",
			"Efficient parameter estimation of software reliability growth models using harmony search.",
			"Applying selective mutation strategies to the AsmetaL language.",
			"Modelling emergency response process using case management model and notation.",
			"Data-driven business process similarity.",
			"PLATEM: a method for mobile applications testing.",
			"Analysing change profiles of open source software projects using burst detection.",
			"Dependable composition of transactional web services using fault-tolerance patterns and service scheduling."
		]
	},
	{
		"name": "IET Software",
		"year": "2016",
		"info": "Volume 10: 2016",
		"count": 20,
		"papers": [
			"Zero-inflated prediction model in software-fault data.",
			"Early stage software effort estimation using random forest technique based on use case points.",
			"Approach for integrated modular avionics reconfiguration modelling and reliability analysis based on AADL.",
			"Towards a method engineering approach for business process reengineering.",
			"Semantic integration of wireless sensor networks into open geospatial consortium sensor observation service to access and share environmental monitoring systems.",
			"Auditing buffer overflow vulnerabilities using hybrid static-dynamic analysis.",
			"Software development efforts prediction using artificial neural network.",
			"Regression test selection using class, sequence and activity diagrams.",
			"Two-stage tamper response in tamper-resistant software.",
			"Using static and dynamic impact analysis for effort estimation.",
			"Smart fuzzing method for detecting stack-based buffer overflow in binary codes.",
			"Improving semantic compression specification in large relational database.",
			"Lightweight approach for multi-objective web service composition.",
			"Systematic review of success factors and barriers for software process improvement in global software development.",
			"Fuzzy analysis and prediction of commit activity in open source software projects.",
			"Empirical study of communication structures and barriers in geographically distributed teams.",
			"Intention preservation in deterministic multithreading: a partial solution.",
			"Automatic code generation using unified modeling language activity and sequence models.",
			"Using triple graph grammars to realise incremental round-trip engineering.",
			"Efficient and fair scheduler of multiple resources for MapReduce system."
		]
	},
	{
		"name": "IET Software",
		"year": "2015",
		"info": "Volume 9: 2015",
		"count": 18,
		"papers": [
			"Towards a software component assembly evaluation.",
			"Evaluation of nine heuristic algorithms with data-intensive jobs and computing-intensive jobs in a dynamic environment.",
			"Dependability approach for evaluating software development risks.",
			"Empirical study of the effects of different profiles on regression test case reduction.",
			"Analogy-based effort estimation: a new method to discover set of analogies from dataset characteristics.",
			"Visualisation environment for global software development management.",
			"Approach for parameter estimation in Markov model of software reliability for early prediction: a case study.",
			"Measuring stability of object-oriented software architectures.",
			"Fuzzy stochastic Petri nets and analysis of the reliability of multi-state systems.",
			"Teaching global software engineering: experiences and lessons learned.",
			"Constrained multi-objective test data generation based on set evolution.",
			"Model to estimate the software development effort based on in-depth analysis of project attributes.",
			"Recursive ECATNets-based approach for formally verifying System Modelling Language activity diagrams.",
			"Understanding personality differences in software organisations using Keirsey temperament sorter.",
			"Empirical investigation of the challenges of the existing tools used in global software development projects.",
			"Semantic modelling and automated reasoning of non-functional requirement conflicts in the context of softgoal interdependencies.",
			"From pragmatic to systematic software process improvement: an evaluated approach.",
			"Analysis of task effort estimation accuracy based on use case point size."
		]
	},
	{
		"name": "IET Software",
		"year": "2014",
		"info": "Volume 8: 2014",
		"count": 27,
		"papers": [
			"Case study on software refactoring tactics.",
			"Power evaluation methods for data encryption algorithms.",
			"Framework for the declarative implementation of native mobile applications.",
			"Improved document ranking in ontology-based document search engine using evidential reasoning.",
			"Malware detection: program run length against detection rate.",
			"Errata 'Value of ranked voting methods for estimation by analogy', IET Softw., 2013, 7, (4), pp 195-202.",
			"Situation assessment model for inter-domain routing system.",
			"Dual-expansion indexing for moving objects.",
			"An ontology-based approach towards comprehensive workflow modelling.",
			"Integrating human-computer interaction and business practices for mixed reality systems design: a case study.",
			"Fuzzy entropy-based framework for multi-faceted test case classification and selection: an empirical study.",
			"Empirical study of fault prediction for open-source systems using the Chidamber and Kemerer metrics.",
			"Computation of alias sets from shape graphs for comparison of shape analysis precision.",
			"Automatic trust calculation for service-oriented systems.",
			"Role of unified modelling language in software development in Greece ?? results from an exploratory study.",
			"What makes service oriented requirements engineering challenging? a qualitative study.",
			"Intercultural challenges in offshore software development outsourcing relationships: an exploratory study using a systematic literature review.",
			"Web-based learning object selection software using analytical hierarchy process.",
			"Software agents for peer-to-peer video streaming.",
			"Runtime verification monitoring for automotive embedded systems using the ISO 26262 functional safety standard as a guide for the definition of the monitored properties.",
			"Dealing with information quality in software package selection: an empirically based approach.",
			"Cost-aware execution of transactional web services using labelled transition systems.",
			"Case study on risk management practice in large offshore-outsourced Agile software projects.",
			"Applications of case-based reasoning in Software Engineering: a systematic mapping study.",
			"Improving automatic bug assignment using time-metadata in term-weighting.",
			"Analysis of risks faced by information technology offshore outsourcing service providers.",
			"Effects of incorporating special methods into cohesion measurement on class instantiation reuse-proneness prediction."
		]
	},
	{
		"name": "IET Software",
		"year": "2013",
		"info": "Volume 7: 2013",
		"count": 29,
		"papers": [
			"Conflict resolution support for parallel software development.",
			"Automatic code generation from unified modelling language sequence diagrams.",
			"Risk analysis: a guiding force in the improvement of testing.",
			"Tailoring a large-sized software process using process slicing and case-based reasoning technique.",
			"On-chip support for software verification and debug in multi-core embedded systems.",
			"Empirical study of software component integration process activities.",
			"Does software error/defect identification matter in the italian industry?",
			"Test suite prioritisation using trace events technique.",
			"Validating dimension hierarchy metrics for the understandability of multidimensional models for data warehouse.",
			"Metaheuristic approach for constructing functional test-suites.",
			"Early performance assessment in component-based software systems.",
			"Program analysis too loopy? Set the loops aside.",
			"I2SD: reverse engineering Sequence Diagrams Enterprise Java Beans from with interceptors.",
			"Conflict-aware optimal scheduling of prioritised code clone refactoring.",
			"Analysing the quality of object-oriented models from novice modellers.",
			"Value of ranked voting methods for estimation by analogy.",
			"Automated testing of eXtensible Access Control Markup Language-based access control systems.",
			"Supporting the adaptation of open-source database applications through extracting data lifecycles.",
			"Web services property sequence chart monitor: a tool chain for monitoring BPEL-based web service composition with scenario-based specifications.",
			"Interactive animation system for virtual maize dynamic simulation.",
			"Formal framework for specifying dynamic reconfiguration of adaptive systems.",
			"QP test: a dependence test for quadratic array subscripts.",
			"Establishing trust in offshore software outsourcing relationships: an exploratory study using a systematic literature review.",
			"Editorial.",
			"Externalising tacit knowledge of the systematic review process.",
			"Light-weight resource leak testing based on finalisers.",
			"Machine learning approaches for predicting software maintainability: a fuzzy-based transparent model.",
			"Critical success factors for offshore software outsourcing contract management from vendors' perspective: an exploratory study using a systematic literature review.",
			"On the relationship of class stability and maintainability."
		]
	},
	{
		"name": "IET Software",
		"year": "2012",
		"info": "Volume 6: 2012",
		"count": 51,
		"papers": [
			"Empirical investigation of success factors for offshore software development outsourcing vendors.",
			"Transformation contracts in practice.",
			"ReAjax: a reverse engineering tool for Ajax Web applications.",
			"Apply ant colony to event-flow model for graphical user interface test case generation.",
			"Software online bug detection: applying a new kernel method.",
			"Service identification guideline for developing distributed embedded real-time systems.",
			"Towards conceptual foundations for service-oriented requirements engineering: bridging requirements and services ontologies.",
			"From intentions to code: exploring the life of user goals in two web-based systems.",
			"From requirements to implementation of ad-hoc social Web applications: an empirical pattern-based approach.",
			"MCTest: towards an improvement of match algorithms for models.",
			"Calculating return on investment of training using process variation.",
			"Quality of service measure approach of web service for service selection.",
			"Usefulness of acceptance testing information for component-based system maintenance.",
			"Analysis of cultural and gender influences on teamwork performance for software requirements analysis in multinational environments.",
			"Optimising virtual team leadership in global software development.",
			"Selective availability: Coordinating interaction initiation in distributed software development.",
			"Mixing continents, competences and roles: Five years of lessons for software engineering education.",
			"Towards an ontology for global software development.",
			"Usability bugs in open-source software and online forums.",
			"Applying dynamic separation of aspects to distributed systems security: A case study.",
			"Quantifying value of adding inspection effort early in the development process: A case study.",
			"Evaluating relationship categories for clustering object-oriented software systems.",
			"Survey on software testing practices.",
			"Enhancing comprehensibility of software clustering results.",
			"Symptom matching for event streams.",
			"Heuristic optimisation algorithm for Java dynamic compilation.",
			"Web application for recommending personalised mobile tourist routes.",
			"Framework for evaluation and validation of software complexity measures.",
			"Efficient effort estimation system viz. function points and quality assurance coverage.",
			"Efficient top-k algorithm for eXtensible Markup Language keyword search.",
			"Multidimentional size measure for design of component-based software system.",
			"Agile software development methodology for medium and large projects.",
			"Model-based testing of embedded systems in hardware in the loop environment.",
			"Auditing the XSS defence features implemented in web application programs.",
			"Model-driven approach to developing domain functional requirements in software product lines.",
			"Design of a competence model for testing teams.",
			"Improving agility and discipline of software development with the Scrum and CMMI.",
			"Process reference model construction: implementing an evolutionary multi-method research approach.",
			"Software process improvement to assist medical device software development organisations to comply with the amendments to the medical device directive.",
			"Metrics-based control in outsourced software development projects.",
			"Analysing the corporate responsibility Web pages of consumer electronics companies: implications for process improvement.",
			"Increasing the accuracy of software development effort estimation using projects clustering.",
			"Investigations on implementation of web applications with different techniques.",
			"Artificial neural network-based metric selection for software fault-prone prediction model.",
			"Supporting program comprehension in large preprocessor-based software product lines.",
			"Systematic literature review: teaching novices programming using robots.",
			"Exploration of the effects of soft errors from dynamic software behaviours.",
			"Significance of depth of inspection and inspection performance metrics for consistent defect management in software industry.",
			"Web service matchmaking for the development of context-aware applications.",
			"Reflections on the NASA MDP data sets.",
			"Model and software tool for automatic generation of user interface based on use case and data model."
		]
	},
	{
		"name": "IET Software",
		"year": "2011",
		"info": "Volume 5: 2011",
		"count": 47,
		"papers": [
			"Using autonomous components to improve runtime qualities of software.",
			"Weather data sharing system: an agent-based distributed data management.",
			"Formalisation and verification of programmable logic controllers timers in Coq.",
			"Systems engineering and safety - a framework.",
			"Nine-areas-tree-bit-patterns-based method for continuous range queries over moving objects.",
			"Functional testing of feature model analysis tools: a test suite.",
			"Nomenclature unification of software product measures.",
			"Software cost estimation for componentbased fourth-generation-language software applications.",
			"Automation of software test (AST '09) [Editorial].",
			"Automated generation of test cases using a performability model.",
			"Standards compliance testing for unified modelling language tools.",
			"Lazy symbolic execution for test data generation.",
			"UML interaction model-driven runtime verification of Java programs.",
			"Tool to facilitate appropriate interaction in global software development.",
			"Modelling software process variability: an empirical study.",
			"Concurrent usability evaluation and design of software component: a digraph and matrix approach.",
			"Predicting the software performance during feasibility study.",
			"Effort estimation of component-based software development - a survey.",
			"Using lightweight virtual machines to achieve resource adaptation in middleware.",
			"Detecting and resolving email feature interactions through constraints.",
			"Improving the graph grammar parser of Rekers and Schürr.",
			"When to stop testing: A study from the perspective of software reliability models.",
			"Software refactoring at the package level using clustering techniques.",
			"Automated requirements engineering: Use case patterns-driven approach.",
			"Process mining through dynamic analysis for modernising legacy systems.",
			"Metrics suite for maintainability of eXtensible Markup Language web services.",
			"Design and implementation of a Byzantine fault tolerance framework for non-deterministic applications.",
			"Investigation on performance testing and evaluation of PReWebD: a .NET technique for implementing web application.",
			"Study on the relevance of the warnings reported by Java bug-finding tools.",
			"Automatic object deployment for software performance enhancement.",
			"Suffix tree-based approach to detecting duplications in sequence diagrams.",
			"Software reliability prediction based on support vector regression using a hybrid genetic algorithm and simulated annealing algorithm.",
			"Design and implementation of an OLE for process control unified architecture aggregating server for a group of flexible manufacturing systems.",
			"Towards measuring object-oriented class stability.",
			"Dynamic slicing of distributed object-oriented programs.",
			"Investigation on performance testing and evaluation of PReWebN: a java technique for implementing web application.",
			"Alleviating information overload caused by volumes of numerical web data: the concept and development process.",
			"Web-based decision-support system methodology for smart provision of adaptive digital energy services over cloud technologies.",
			"Reputation measure approach of web service for service selection.",
			"Framework for component model selection.",
			"Using soft systems methodology to improve requirements practices: an exploratory case study.",
			"Supporting commonality-based analysis of software product lines.",
			"Improving artefact quality management in advanced artefact management system with distributed inspection.",
			"Empirical study to assess whether the use of routes facilitates the navigability of web information systems.",
			"Exploiting java scientific libraries with the scala language within the scalalab environment.",
			"Crosscutting concern mining in business processes.",
			"Parameterised trace selection technique for process model recovering."
		]
	},
	{
		"name": "IET Software",
		"year": "2010",
		"info": "Volume 4: 2010",
		"count": 35,
		"papers": [
			"Empirical support for the generation of domain-oriented quality models.",
			"Empirical comparison of graphical and annotation-based re-documentation approaches.",
			"Judy - a mutation testing tool for Java.",
			"Mathematical basis for the chaining of lossy interface adapters.",
			"Integrated state-based dynamic slicing technique for UML models.",
			"Improving interpretation of component-based systems quality through visualisation techniques.",
			"Iterative criteria-based approach to engineering the requirements of software development methodologies.",
			"Framework for high-quality software design and development: a systematic approach.",
			"Design tool to express failure detection protocols.",
			"Assessing communication media richness in requirements negotiation.",
			"Formal analysis and design for engineering security automated derivation of formal software security specifications from goal-oriented security requirements.",
			"Understanding the complexity embedded in large routine call traces with a focus on program comprehension tasks.",
			"Editorial: automated compositional verification.",
			"Compositional verification for component-based systems and application.",
			"Environment generation for validating event-driven software using model checking.",
			"Assume-guarantee verification of software components in SOFA 2 framework.",
			"Synthesising certificates in networks of timed automata.",
			"Using a web-based tool to define and implement software process improvement initiatives in a small industrial setting.",
			"Component co-evolution and component dependency: speculations and verifications.",
			"Including both static and dynamic typing in the same programming language.",
			"Design principles of web-based distance education system and sample application in Afyon Kocatepe University.",
			"Metamorphic testing of decision support systems: a case study.",
			"Unified modelling and analysis of collaboration business process based on Petri nets and Pi calculus.",
			"Evaluation of the 'replace constructors with creation methods' refactoring in Java systems.",
			"Automated software test optimisation framework - an artificial bee colony optimisation-based approach.",
			"Systematic selection of software architecture styles.",
			"Automatic detection of infeasible paths in software testing.",
			"Social semantic web support for software development [Editorial].",
			"Exploitation of social semantic technology for software development team configuration.",
			"Semantic wiki for quality management in software development projects.",
			"Using the semantic web to define a language for modelling controlled flexibility in software processes.",
			"Usage of social and semantic web technologies to design a searching architecture for software requirement artefacts.",
			"AQUA: hybrid architecture for question answering services.",
			"Knowledge repository to improve agile development processes learning.",
			"Shaping human capital in software development teams: the case of mentoring enabled by semantics."
		]
	},
	{
		"name": "IET Software",
		"year": "2009",
		"info": "Volume 3: 2009",
		"count": 41,
		"papers": [
			"Virtual machine framework for constructing domain-specific languages.",
			"AB-HCI: an interface multi-agent system to support human-centred computing.",
			"Measuring the evolutionary stability of software systems: case studies of Linux and FreeBSD.",
			"Simple lossless preprocessing algorithms for text compression.",
			"Software similarity-based functional cohesion metric.",
			"Impact of release intervals on empirical research into software evolution, with application to the maintainability of Linux.",
			"Editorial: Selected papers from SBES '07.",
			"Refactoring to improve the understandability of specifications written in object constraint language.",
			"Comparing finite state machine test.",
			"Web usability inspection technique based on design perspectives.",
			"Interaction laws for dependability explicit computing in open multi-agent systems.",
			"Monitoring embedded software timing properties with an SoC-resident monitor.",
			"Proactive service migration for long-running Byzantine fault-tolerant systems.",
			"Editorial domain specific aspect languages.",
			"Automating deployment planning with an aspect weaver.",
			"Domain-specific aspect languages for modularising crosscutting concerns in grammars.",
			"Disentangling virtual machine architecture.",
			"Making aspect-orientation accessible through syntax-based language composition.",
			"Infrastructure for domain-specific aspect languages: the relax case study.",
			"Automatic vehicle location tracking system based on GIS environment.",
			"Contextual paradigm for ad hoc retrieval of user-centric web data.",
			"Towards automated verification of layered graph transformation specifications.",
			"Approach for solving the feature location problem by measuring the component modification impact.",
			"Formal specification and validation of railway network components using Z notation.",
			"Dynamic aspect mining.",
			"Evaluation and assessment in software engineering [Editorial].",
			"Empirical study of Sommerville and Sawyer's requirements engineering practices.",
			"Software project initiation and planning - an empirical study.",
			"Applying a reusable framework for software selection.",
			"Evaluating distributed inspection through controlled experiments.",
			"Relationship between design patterns defects and crosscutting concern scattering degree: an empirical study.",
			"Cross-domain investigation of empirical practices.",
			"Investigating the use of chronological split for software effort estimation.",
			"Preliminary study of sequence effects in judgment-based software development work-effort estimation.",
			"Performance engineering - editorial.",
			"Which battery model to use?",
			"Fine-grain stochastic modelling of dynamic power management policies and analysis of their power - latency tradeoffs.",
			"Performance of locality-aware topologies for peer-to-peer live streaming.",
			"Analytical TCP throughput model for high-speed downlink packet access.",
			"Transient calculations on process algebra derived Markov chains.",
			"Performance prediction and procurement in practice: assessing the suitability of commodity cluster components for wavefront codes."
		]
	},
	{
		"name": "IET Software",
		"year": "2008",
		"info": "Volume 2: 2008",
		"count": 39,
		"papers": [
			"Special Section on Natural Language in Software Engineering.",
			"Text mining and software engineering: an integrated source code and document analysis approach.",
			"Semantic software metrics computed from natural language design specifications.",
			"Analysing source code: looking for useful verbdirect object pairs in all the right places.",
			"Length and readability of structured software engineering abstracts.",
			"A lightweight technique for assessing risks in requirements analysis.",
			"Agile methods in European embedded software development organisations: a survey on the actual use and usefulness of Extreme Programming and Scrum.",
			"Mining execution relations for crosscutting concerns.",
			"Automatic test case generation using unified modeling language (UML) state diagrams.",
			"Multiple-view modelling and meta-modelling of software product lines.",
			"Implementation specification for software process improvement supportive knowledge management tool.",
			"Object-oriented concept analysis for software modularisation.",
			"Generative aspect-oriented component adaptation.",
			"Editorial - Software language engineering.",
			"Extending grammars and metamodels for reuse: the Reuseware approach.",
			"Ontological approach for the semantic recovery of traceability links between software artefacts.",
			"Formalising model transformation rules for UML/MOF 2.",
			"Learning context-free grammar rules from a set of program.",
			"Aspect-oriented prolog in a language processing context.",
			"Integration of safety analysis in model-driven software development.",
			"Evaluating formal properties of feature diagram languages.",
			"In special section on software evolvability - editorial software evolvability.",
			"Story-driven approach to software evolution.",
			"Software evolutionary dynamics modelled as the activity of an actor-network.",
			"Towards a software maintenance methodology using Semantic Web techniques and paradigmatic documentation modelling.",
			"Framework for quiescence management in support of reconfigurable multi-threaded component-based systems.",
			"Performance-driven object-oriented program re-modularisation.",
			"Software process fusion by combining pair and solo programming.",
			"Theory for classifying equivalences of unified modelling language activity diagrams.",
			"The pi measure.",
			"Implementing a software measurement program in small and medium enterprises: a suitable framework.",
			"Software reliability allocation of digital relay for transmission line protection using a combined system hierarchy and fault tree approach.",
			"Conflict-aware schedule of software refactorings.",
			"Types for task-based access control in workflow systems.",
			"Faithful mapping of model classes to mathematical structures.",
			"Verification of class liveness properties with java modelling language.",
			"Reducing the use of nullable types through non-null by default and monotonic non-null.",
			"Formal verification of systems with an unlimited number of components.",
			"Assume-guarantee testing for software components."
		]
	},
	{
		"name": "IET Software",
		"year": "2007",
		"info": "Volume 1: 2007",
		"count": 25,
		"papers": [
			"Translating a typical business process modelling language to a web services ontology through lightweight mapping.",
			"Adaptive runtime fault management for service instances in component-based software applications.",
			"Detecting overlapping use cases.",
			"Petri-nets for formal verification of MAC protocols.",
			"Scientific programming with Java classes supported with a scripting interpreter.",
			"Survey of component-based software development.",
			"WebML modelling in UML.",
			"Bridging WebML to model-driven engineering: from document type definitions to meta object facility.",
			"Classification of model transformation techniques used in UML-based Web engineering.",
			"Designing and constructing modifiable middleware using component frameworks.",
			"Modelling and verification of program logic controllers using timed automata.",
			"Efficient software review process for small and medium enterprises.",
			"Merging partial system behaviours: composition of use-case automata.",
			"Large-scale software engineering questions expert opinion or empirical evidence?",
			"Runtime verification and monitoring of embedded systems.",
			"Impact of aspect-oriented programming on software development efficiency and design quality: an empirical study.",
			"Analysing inaccurate artifact usages in workflow specifications.",
			"Language-based access control approach for component-based software applications.",
			"On the interplay of .NET and contemporary software engineering techniques [Editorial].",
			"Validation of web service compositions.",
			"Hidden truth behind .NETs exception handling today.",
			"Aspect-oriented weaving and the .NET common language runtime.",
			"Complete distributed garbage collection using DGC-consistent cuts and .NET AOP-support.",
			"Computer games software factory and edutainment platform for microsoft .NET.",
			"Integration of RE and MDE paradigms: the ProjectIT approach and tools."
		]
	},
	{
		"name": "IETS",
		"year": "2006",
		"info": "2006: Volume 153",
		"count": 23,
		"papers": [
			"Editorial: Role based access control - a solution with its own challenges.",
			"Role-based access control in TOBIAS and NESS.",
			"Functionality and implementation issues for complex authorisation models.",
			"OASIS role-based access control for electronic health records.",
			"Service-enabled access control for distributed data.",
			"Architectural translucency in service-oriented architectures.",
			"Agent-based subsystem for multimedia communications.",
			"Attribute grammar-based interactive system to retrieve information from XML documents.",
			"Addressing quality attributes in domain analysis for product lines.",
			"Shruti: an embedded text-to-speech system for Indian languages.",
			"Three control flow obfuscation methods for Java software.",
			"Comparison of software development life cycles: a multiproject experiment.",
			"Computer-aided dispatch system family architecture and verification: an integrated formal approach.",
			"Measuring software flexibility.",
			"Formalising design patterns composition.",
			"Information system evolvability, feedback and pattern languages.",
			"Non-intrusive end-to-end runtime path tracing for J2EE systems.",
			"Abstraction classes in software design.",
			"Deriving specifications from requirements through problem reduction.",
			"Block-structured stochastic process algebra and its applications to queueing systems.",
			"Identifying tacit knowledge-based requirements.",
			"Framework for performance engineering of OSPF software.",
			"Domain-specific language approach to modelling UI architecture of mobile telephony systems."
		]
	},
	{
		"name": "IETS",
		"year": "2005",
		"info": "2005: Volume 152",
		"count": 32,
		"papers": [
			"Editorial reusable software libraries.",
			"Template-based construction of verified software.",
			"Development and use of dynamic product-line architectures.",
			"Taxonomy-based software construction of SPARE Time: a case study.",
			"Reflective designs.",
			"Language definitions and tool generation.",
			"Automatic generation of language-based tools using the LISA system.",
			"Generator of efficient strongly typed abstract syntax trees in Java.",
			"Constructive Action Semantics for Core ML.",
			"Approach to modelling feature variability and dependencies in software product lines.",
			"Java-based component framework for dynamic reconfiguration.",
			"Diversity of structures and adaptive methods on an evolutionary hypermedia system.",
			"Constructing multiple unique input/output sequences using metaheuristic optimisation techniques.",
			"Relating software requirements and architectures.",
			"Deriving architectural flexibility requirements in safety-critical systems.",
			"Designing software architectures to achieve quality attribute requirements.",
			"Using real options to select stable middleware-induced software architectures.",
			"Global Analysis: moving from software requirements specification to structural views of the software architecture.",
			"Architectural patterns for problem frames.",
			"Editorial - Microsoft Research embedded systems.",
			"CERO: CE RObots community.",
			"Robotics4.NET: software body for controlling robots.",
			"Design and implementation of a Bluetooth ad hoc network for indoor positioning.",
			"Real-time robotics and process control experiments in the Distributed Control Lab.",
			"Adaptive video streaming for embedded devices.",
			"MoMo: enabling hybrid museums.",
			"Estimating size in incremental software development projects.",
			"Engineering multicast group key distribution: a review.",
			"Dynamic coupling metric: proof of concept.",
			"Metarule-guided association rule mining for program understanding.",
			"Distributed CTL model checking.",
			"Implementing non-strict evaluation on OOVMs."
		]
	},
	{
		"name": "IETS",
		"year": "2004",
		"info": "2004: Volume 151",
		"count": 23,
		"papers": [
			"Implementing functional languages on object-oriented virtual machines.",
			"UML profile to support requirements engineering with KAOS.",
			"DRASTIC and GRUMPS: design and implementation of two run-time evolution frameworks.",
			"Tools for making impossible changes - experiences with a tool for transforming large Smalltalk programs.",
			"Sustainable architectures by combining flexibility and strictness in Object Teams.",
			"Pattern language for the design of aspect languages and aspect composition frameworks.",
			"Market-driven approach based on Markov decision theory for optimal use of resources in software development.",
			"Disconnected service architecture for unanticipated run-time evolution of code.",
			"Semantics-directed implementation of method-call interception.",
			"Scalable locality-aware event dispatching mechanism for network servers.",
			"Classifying Web pages employing a probabilistic neural network.",
			"Special issue on Early aspects: aspect-oriented requirements engineering and architecture design.",
			"Scenario modelling with aspects.",
			"Aspect-oriented approach to early design modelling.",
			"First class feature abstractions for product derivation.",
			"Building fully customisable middleware using an aspect-oriented approach.",
			"Optimal restart times for moments of completion time.",
			"Hybrid performance-based workload management for multiclusters and grids.",
			"Stochastic analysis of scheduling strategies in a Grid-based resource model.",
			"Stochastic modelling of random early detection based congestion control mechanism for bursty and correlated traffic.",
			"Internet QoS and traffic modelling.",
			"Taxonomy of directed graph representations.",
			"View through MetaLens: usage patterns for a meta-recommendation system."
		]
	},
	{
		"name": "IETS",
		"year": "2003",
		"info": "2003: Volume 150",
		"count": 39,
		"papers": [
			"Comments on the probability model for the modified condition/decision coverage method of testing software.",
			"Fine tuning the scheduling of tasks through a genetic algorithm: application to Posix1003.1b compliant systems.",
			"Combining abductive reasoning and inductive learning to evolve requirements specifications.",
			"Design methodology for construction of asynchronous pipelines with Handel-C.",
			"Extending CSP: denotational semantics.",
			"CSP extended: imperative state and true concurrency.",
			"View-centric reasoning for Linda and Tuple Space computation.",
			"Predicate transformers in the semantics of Circus.",
			"The Honeysuckle programming language: an overview.",
			"Graphical modelling language for specifying concurrency based on CSP.",
			"Prioritised dynamic communicating and mobile processes.",
			"Wait-free cache-affinity thread scheduling.",
			"Java PastSet: a structured distributed shared memory system.",
			"Configuration discovery and mapping of a home network.",
			"Formulating software engineering as a search problem.",
			"Evaluation of a perspective based review method applied in an industrial setting.",
			"Comparative study of clustering algorithms and abstract representations for software remodularization.",
			"Translating smalltalk blocks into Java.",
			"Performance engineering.",
			"Modelling the performance of large-scale systems.",
			"Trends, challenges and opportunities for performance engineering with modern business software.",
			"Bandwidth-efficient routing protocol for mobile ad hoc networks.",
			"Search strategies for Java bottleneck location by dynamic instrumentation.",
			"Performance evaluation of a grid resource monitoring and discovery service.",
			"Personalised Grid service discovery.",
			"Multicast communication in grid computing networks with background traffic.",
			"Benchmarking the CLI for high performance computing.",
			"Multistage programming support in CLI.",
			"Complete distributed garbage collection: an experience with Rotor.",
			"Server based application level authorisation for Rotor.",
			"Dynamic recompilation and profile-guided optimisations for a .NET JIT compiler.",
			"Software security: experiments on the .NET common language run-time and the shared source common language infrastructure.",
			"Concurrent object-oriented programming on .NET.",
			"Activities and channels: C# language extensions for concurrency control and remote object communication.",
			"Compiler generation tools for C#.",
			"Design and implementation of assertions for the common language infrastructure.",
			"35 years on: to what extent has software engineering design achieved its goals?.",
			"Effort estimation in incremental software development.",
			"Managing embedded software project team knowledge."
		]
	},
	{
		"name": "IETS",
		"year": "2002",
		"info": "2002: Volume 149",
		"count": 21,
		"papers": [
			"Open source software projects as virtual organisations: competency rallying for software development.",
			"Maintainability of the Linux kernel.",
			"Understanding the requirements for developing open source software systems.",
			"A study of configuration management in open source software projects.",
			"Trust and vulnerability in open source software.",
			"Talking about OSS: Making Sense of the Bazaar: 1st Workshop on Open Source Software Engineering - Workshop Report.",
			"ODP computational-to-information viewpoint mappings: a translation of CORBA IDL to Z.",
			"Classification-tree restructuring methodologies: a new perspective.",
			"Framework based on design patterns for providing persistence in object-oriented programming languages.",
			"Comparison of Web size measures for predicting Web design and authoring effort.",
			"Experience of applying statistical control techniques to the function test phase of a large telecommunications system.",
			"Hypothesis-based concept assignment in software maintenance.",
			"Investigating the influence of software inspection process parameters on inspection meeting performance.",
			"Making inferences with small numbers of training sets.",
			"Experiment about test-first programming.",
			"Benchmarking of processes for managing product platforms: a case study.",
			"Aggregating viewpoints for strategic software process improvement-a method and a case study.",
			"Requirements problems in twelve software companies: an empirical analysis.",
			"Validating metrics for data warehouses.",
			"Experience with statically-generated proxies for facilitating Java runtime specialisation.",
			"Design philosophy for self-repair of electronic systems using the UML."
		]
	},
	{
		"name": "IETS",
		"year": "2001",
		"info": "2001: Volume 148",
		"count": 21,
		"papers": [
			"Evaluating composite events using shared trees.",
			"High-level Petri net for incremental analysis of object-oriented system requirements.",
			"Introducing monitoring events to timed-CSP.",
			"Hardware compilation for software engineers: an ATM example.",
			"Towards a self-structuring software library.",
			"Employing data flow testing on object-oriented classes.",
			"Configuring distributed systems in a Java-based environment.",
			"Evolutionary algorithm with modifications in the reproduction phase.",
			"What accuracy statistics really measure.",
			"Aspect-oriented and component-based software engineering.",
			"Formal support for dynamic QoS management in the development of open component-based distributed systems.",
			"Component-based software engineering for distributed embedded real-time systems.",
			"Connectors for bridging mismatches between the components of a software engineering environment.",
			"Permabase: predicting the performance of distributed systems at the design stage.",
			"Rate-based packet scheduling paradigm.",
			"Specification and validation of dynamic systems using temporal logic.",
			"Formal semantics of an industrially applicable variant of the Specification and Description Language.",
			"Real-time design in a distributed control network application layer environment.",
			"Aspect-orientation and database systems: an effective customisation approach.",
			"Using simulated data sets to compare data analysis techniques used for software cost modelling.",
			"Semantic characterisation of dead control-flow paths."
		]
	},
	{
		"name": "IETS",
		"year": "2000",
		"info": "2000: Volume 147",
		"count": 25,
		"papers": [
			"Qualitative formal method for requirements specification and validation of hybrid real-time safety systems.",
			"Supporting dynamic QoS management functions in a reflective middleware platform.",
			"Structural performance measure of evolutionary testing applied to worst-case timing of real-time systems.",
			"Software as a corporate asset.",
			"Analysis prediction template toolkit (APTT) for object-based computation.",
			"Object-oriented preprocessor fit for C++.",
			"Early generation of performance models for object-oriented systems.",
			"The logic of software design.",
			"Faulty version recovery in object-oriented N-version programming.",
			"FADI: a fault tolerant environment for open distributed computing.",
			"Tool support for integrating extended enterprises.",
			"Using domain specific languages to instantiate object-oriented frameworks.",
			"Design and specification of role based access control policies.",
			"Interactive multimedia synchronisation in the distributed environment using the formal approach.",
			"Knowledge edition and reuse in Diagen: a relational approach.",
			"Model-based verification of knowledge-based systems: a case study.",
			"Applying knowledge modelling and case-based reasoning to software reuse.",
			"What can program supervision do for program reuse?",
			"Automated software module reconfiguration through the use of artificial intelligence planning techniques.",
			"Causality levels in SCHEMA: a knowledge edition interface.",
			"Architecture-driven software engineering: Specifying, generating, and evolving component- based software systems.",
			"Supporting architectural concerns in component interoperability standards.",
			"Component-based perspective on software mismatch detection and resolution.",
			"Engineering components for ease of customisation and evolution.",
			"Software evolution in the age of component-based software engineering."
		]
	},
	{
		"name": "IETS",
		"year": "1999",
		"info": "1999: Volume 146",
		"count": 32,
		"papers": [
			"The unified modelling language.",
			"Experiences with the PEPA performance modelling.",
			"SWAP, a performance evaluation tool.",
			"PNiQ: Intergration of queuing networks in generalised stochastic Petri nets.",
			"Video-on-demand server: Strategies for improving performance.",
			"Differential QoS and pricing in networks: Where flow control meets game theory.",
			"Restructuring requirement specifications.",
			"Editorial real-time systems - multidisciplinary engineering [Editorial].",
			"Fail-aware datagram service.",
			"Integrated design approach for real-time embedded systems.",
			"Applicability of SIGNAL in safety critical system development.",
			"Modelling a distributed real-time system for feedback control in a nuclear fusion experiment.",
			"The deadline command.",
			"The stack resource protocol based on real-time transactions.",
			"Dynamic acceptance of aperiodic tasks with periodic tasks under resource sharing constraints.",
			"Elements of distributed algorithms-modeling and analysis with petri nets Wolfgang Reisig [Book review].",
			"Editorial: Systems engineering for business process change.",
			"CONVERSE: A change-oriented process for engine controllers.",
			"RAMESES: A method for evaluating change in small organisations.",
			"Identifying nd communicting expertise in systems reengineering: a patterns approach.",
			"Decision model for legacy systems.",
			"Case for an explicit co-ordination layer in modern business information systems architectures.",
			"Hybrid approach to software interworking problems: managing interactions between legacy and evolving telecommunications software.",
			"Editorial: The Software Engineering Association.",
			"Software engineering research: A critical appraisal.",
			"Test cases generation from UML state diagrams.",
			"Effects of structure on the comprehensivility of formal specifications.",
			"Multiple view environment supporting VDM and Ada.",
			"Object-oriented user-interface development.",
			"Quality of service enforcement for distributed objects.",
			"Developing multicast, multiple-stream, multimedia presentations using a formal approach.",
			"Methods and tools for the automated configuration of distributed applications from reusable software architectures and components."
		]
	},
	{
		"name": "IETS",
		"year": "1998",
		"info": "1998: Volume 145",
		"count": 29,
		"papers": [
			"Preparing students for industrial teamwork: a seasoned software engineering curiculum.",
			"Performance driven allocation of objects to processor nodes in a distributed system.",
			"Component-based development CORBA and RM-ODP.",
			"Evaluating software development effort model-building techniques for application in a real-time telecommunications environment.",
			"Assesing dependability of safety critical systems using diverse evidence.",
			"Java's reliability: An Analysis of software defects in Java.",
			"Plastic transformations: A method for building dependable distributed Applications.",
			"Constraint-oriented style for object-oriented formal specification.",
			"Visualising action contracts in object-oriented modelling.",
			"COO approach to support cooperation in software developments.",
			"Incremental language design.",
			"An information system won the war.",
			"Selection and evaluation of information systems methologies: the gap between theory and practice.",
			"Integrating rapid application development and participatory design.",
			"Method intergration: the need for a learning perspective.",
			"StoryNet: an evolving network of cases to learn information systems design.",
			"Towards a chemical model for software architecture reconfiguration.",
			"On the role of software architectures in runtime system reconfiguration.",
			"Analysing dynamic change in distributed software architectures.",
			"Architectural support for dynamic reconfiguration of distributed workflow applications.",
			"Software architecture for adaptive distributive multimedia systems.",
			"Managing inconsistency in reconfigurable systems.",
			"Configuration management for highly-customisable software.",
			"Reliability-oriented software engineering: design, testing, and evaluation techniques.",
			"Using two-level stable storge for efficient checkpointing.",
			"Software tool combining fault masking with user-defined recovery strategies.",
			"Analysis and evaluation of distributed checkpoint algorithms to avoid rollback propagation.",
			"Experimental investigation of message latencies in the Totem protocol in the Presence of faults.",
			"Generating diverse software versions with genetic programming: and experimental study."
		]
	},
	{
		"name": "IETS",
		"year": "1997",
		"info": "1997: Volume 144",
		"count": 27,
		"papers": [
			"Research and development challenges for agend-based systems.",
			"Towards a social level characterisation of socially responsible agents.",
			"Agent-based software engineering.",
			"Towards agent-based software engineering for information-depended enterprise applications.",
			"Application of multi-agent systems in traffic and transportation.",
			"The agent architecture of the Univercity of Michingan Digital Library.",
			"Cooperative information-gathering: a distributed problem-solving approach.",
			"CCS specification of a Linda behavioural model debugger.",
			"Usability requirements as specification constrains: an example of WYSIWYG.",
			"Views of software quality: a field report.",
			"Formal methods into practice: case studies in the application of the B method.",
			"Coordinated backward between client processes and data servers.",
			"Improving the engineering of model tracing based intelligent program diagnosis.",
			"IusWare: a methodology for the evaluation and selection of software products.",
			"Formal framework for hypertext systems.",
			"From logic to manuals again.",
			"Modelling versions in collaborative work.",
			"Formal approach to specification and verification of task management in interactive systems.",
			"Viscosity as a metaphor for measuring modifiability.",
			"Comparing the MVC and PAC architectures: a formal perspective.",
			"Exploiting architectural style to develop a family of applications.",
			"VOCAL: A frame work for test identification and deployment.",
			"Towards an integrated method for hybrid information system development.",
			"Optimal improvement of the lower bound performance of partition testing strategies.",
			"The danger of using axioms in software metrics.",
			"Bringing the \"real world\" of software engineering to univercity undergraduate courses.",
			"testing from semi-independent communicating finite state machines with a slow environment."
		]
	}
]