[
    {
        "name": "IJSEKE",
        "year": "2021",
        "info": "Volume 31, 2021",
        "count": 44,
        "papers": [
            "Editorial: A New Emphasis on Software Engineering and Knowledge Engineering Education.",
            "Guest Editor's Introduction.",
            "Trusted Service Provider Discovery Based on Data, Information, Knowledge, and Wisdom.",
            "A General Framework to Detect Design Patterns by Combining Static and Dynamic Analysis Techniques.",
            "Improved Entity Linking for Simple Question Answering Over Knowledge Graph.",
            "Constructing Bug Knowledge Graph as a Service for Bug Search.",
            "The Technical Debt Density Over Multiple Releases and the Refactoring Story.",
            "Data-Driven Persona Retrospective Based on Persona Significance Index in B-to-B Software Development.",
            "Predicting of Open Source Software Component Reusability Level Using Object-Oriented Metrics by Taguchi Approach.",
            "Automated Visual Testing of Application User Interfaces Using Static Analysis of Screenshots.",
            "Predicting Software Defects for Object-Oriented Software Using Search-based Techniques.",
            "Refactoring Legacy Software for Layer Separation.",
            "Positive Influence Maximization in the Signed Social Networks Considering Polarity Relationship and Propagation Probability.",
            "Refactoring Cost Estimation for Architectural Technical Debt.",
            "DEJIT: A Differential Evolution Algorithm for Effort-Aware Just-in-Time Software Defect Prediction.",
            "Investigating Different Metrics for Evaluation and Selection of Mutation Operators for Java.",
            "Parallel Execution of Programs as a Support for Mutation Testing: A Replication Study.",
            "A Unifying Coalgebraic Semantics Framework for Quantum Systems.",
            "Applying Class Distance to Decide Similarity on Information Models for Automated Data Interoperability.",
            "iMER-FM: Iterative Process of System Feature Model Extraction from the Requirements.",
            "Search for Compatible Source Code.",
            "Guest Editors' Introduction.",
            "Semantic Discovery of Composite GIS Services.",
            "An Effective Method of Evaluating Pension Service Quality Using Multi-Dimension Attention Convolutional Neural Networks.",
            "Lecture Information Service Based on Multiple Features Fusion.",
            "Urban Region Function Mining Service Based on Social Media Text Analysis.",
            "Using API Call Sequences for IoT Malware Classification Based on Convolutional Neural Networks.",
            "Memory-Aware Scheduling Parallel Real-Time Tasks for Multicore Systems.",
            "Leveraging SPARQL Queries for UML Consistency Checking.",
            "VeRA: Verifying RBAC and Authorization Constraints Models of Web Applications.",
            "Using an Experimental Framework to Support Variables Selection: An Exploratory Study.",
            "Handling Quantity in Variability Models for System-of-Systems.",
            "MuSim: Mutation-based Fault Localization Using Test Case Proximity.",
            "Reverse Engineering of Object Oriented Systems to ALF.",
            "Deep Understanding of Runtime Configuration Intention.",
            "Identifying the Optimal Refactoring Dependencies Using Heuristic Search Algorithms to Maximize Maintainability.",
            "Code Clone Detection with Hierarchical Attentive Graph Embedding.",
            "On Representing Resilience Requirements of Microservice Architecture Systems.",
            "Semi-supervised Heterogeneous Defect Prediction with Open-source Projects on GitHub.",
            "dSubSign: Classification of Instance-Feature Data Using Discriminative Subgraphs as Class Signatures.",
            "DHLBT: Efficient Cross-Modal Hashing Retrieval Method Based on Deep Learning Using Large Batch Training.",
            "Static Privacy Analysis by Flow Reconstruction of Tainted Data.",
            "Verifiable Model Construction for Business Processes.",
            "An Extensible Compiler for Implementing Software Design Patterns as Concise Language Constructs."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2020",
        "info": "Volume 30, 2020",
        "count": 78,
        "papers": [
            "Feedback2Code: A Deep Learning Approach to Identifying User-Feedback-Related Source Code Files.",
            "Applicability of Machine Learning Methods on Mobile App Effort Estimation: Validation and Performance Evaluation.",
            "Story Point-Based Effort Estimation Model with Machine Learning Techniques.",
            "Software Analysis Method for Assessing Software Sustainability.",
            "Thread Scheduling Sequence Generation Based on All Synchronization Pair Coverage Criteria.",
            "A Case Representation and Similarity Measurement Model with Experience-Grounded Semantics.",
            "Building a Credit Scoring Model Based on Data Mining Approaches.",
            "Usability Requirements Extraction Method from Software Document.",
            "Case Study Investigation of the Fault Detection and Error Locating Effects of Architecture-based Software Testing.",
            "Knowledge Deduction and Reuse Application to the Products' Design Process.",
            "Log-Based Anomaly Detection with the Improved K-Nearest Neighbor.",
            "A Model-Based Test Case Prioritization Approach Based on Fault Urgency and Severity.",
            "Regression Test Case Prioritization Based on Fixed Size Candidate Set ART Algorithm.",
            "Social Network Analysis in Software Development Projects: A Systematic Literature Review.",
            "Generation and Application of Constrained Interaction Test Suites Using Base Forbidden Tuples with a Mixed Neighborhood Tabu Search.",
            "Automated Test Input Generation via Model Inference Based on User Story and Acceptance Criteria for Mobile Application Development.",
            "AppPerm Analyzer: Malware Detection System Based on Android Permissions and Permission Groups.",
            "Towards Generating Realistic and High Coverage Test Data for Constraint-Based Fault Injection.",
            "Guest Editor's Introduction.",
            "A Computation Model for Senior Citizen Health Self-Care.",
            "Mutual Inference Model for User Roles and Urban Functional Zones.",
            "An Intelligent Service Middleware Based on Sensors in IoT Environments.",
            "Smart Street Litter Detection and Classification Based on Faster R-CNN and Edge Computing.",
            "Winning Strategy Tree Construction for BDD-Based ATL Model Checkers.",
            "An Automated Approach for Constructing Framework Instantiation Documentation.",
            "An Approach to Software Maintenance: A Case Study in Small and Medium-Sized Businesses IT Organizations.",
            "Categorization of Multiple Documents Using Fuzzy Overlapping Clustering Based on Formal Concept Analysis.",
            "Deep Transfer Learning for Source Code Modeling.",
            "Concurrent Bug Finding Based on Bounded Model Checking.",
            "Software Crucial Functions Ranking and Detection in Dynamic Execution Sequence Patterns.",
            "Guest Editor's Introduction.",
            "Integrated Formal Tools for Software Architecture Smell Detection.",
            "Semantic Service Search in IT Crowdsourcing Platform: A Knowledge Graph-Based Approach.",
            "Exploiting Declarative Mapping Rules for Generating GraphQL Servers with Morph-GraphQL.",
            "Semantics-Driven Programming of Self-Adaptive Reactive Systems.",
            "Semantic Restful Service Composition Using Task Specification.",
            "Software Agent-Centric Semantic Social Network for Cyber-Physical Interaction and Collaboration.",
            "Guest Editors' Introduction.",
            "An Integration of Train Timetabling, Platforming and Routing-Based Cooperative Adjustment Methodology for Dealing with Train Delay.",
            "A Data-Driven Two-Stage Prediction Model for Train Primary-Delay Recovery Time.",
            "An Improved Faster R-CNN for UAV-Based Catenary Support Device Inspection.",
            "The Turnout Abnormality Diagnosis Based on Semi-Supervised Learning Method.",
            "Impact Analysis About Response Time Considering Deployment Change of SaaS Software.",
            "An Automated Hybrid Approach for Generating Requirements Trace Links.",
            "Guest Editor's Introduction.",
            "A New Semantic-based Multi-Level Classification Approach for Activity Recognition Using Smartphones.",
            "Scalable Influence Maximization Meets Efficiency and Effectiveness in Large-Scale Social Networks.",
            "Two Improved Topic Word Detection Algorithms.",
            "Investigating the Relationship Between Mutants and Real Faults with Respect to Mutated Code.",
            "A Revisit of Metrics for Test Case Prioritization Problems.",
            "A Proactive Approach to Test Case Selection - An Efficient Implementation of Adaptive Random Testing.",
            "Context-Dependent Feature Values in Text Categorization.",
            "Split Attention Pointer Network for Source Code Language Modeling.",
            "An Effective Approach for Context Driven Testing in Practice - A Case Study.",
            "Algorithmic Transparency of Large-Scale *AIDA Programs.",
            "ABMMRS Eradicator: Improving Accuracy in Recommending Move Methods for Web-based MVC Projects and Libraries Using Method's External Dependencies.",
            "AutoWPR: An Automatic Web Page Recoloring Method.",
            "Agent-Oriented Methodologies Evaluation Frameworks: A Review.",
            "Guest Editor's Introduction: Software Mathematical Models for Human Understanding.",
            "Linear Software Models: An Occam's Razor Set of Algebraic Connectors Integrates Modules into a Whole Software System.",
            "Semantic Recovery of Traceability Links between System Artifacts.",
            "Regular Expression Learning from Positive Examples Based on Integer Programming.",
            "A Generic Approach on How to Formally Specify and Model Check Path Finding Algorithms: Dijkstra, A* and LPA.",
            "Design and Implementation of Phylotastic, a Service Architecture for Evolutionary Biology.",
            "Method for Predicting Mobile Service Evolution from User Reviews and Update Logs.",
            "Guest Editor's Introduction.",
            "Guidelines for Quality Assurance of Machine Learning-Based Artificial Intelligence.",
            "Analyzing the Stationarity Process in Software Effort Estimation Datasets.",
            "Enabling Reliability-Driven Optimization Selection with Gate Graph Attention Neural Network.",
            "Plagiarism Detection of Multi-threaded Programs Using Frequent Behavioral Pattern Mining.",
            "Prediction of Regional Commercial Activeness and Entity Condition Based on Online Reviews.",
            "Automatic Voter Recommendation Method for Closing Questions in Stack Overflow.",
            "Identifying Similar Users Based on Their Check-in Data: A Graph Embedding Approach.",
            "An Experimental Study of Spammer Detection on Chinese Microblogs.",
            "Is Bug Severity in Line with Bug Fixing Change Complexity?",
            "Conversion-based Approach to Obtain an SNN Construction.",
            "Modeling and Selecting Frameworks in Terms of Patterns, Tactics and System Qualities.",
            "An Attribute-Based Cross-Domain Access Control Model for a Distributed Multiple Autonomous Network."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2019",
        "info": "Volume 29, 2019",
        "count": 78,
        "papers": [
            "A Method for Measuring the Constraint Complexity of Components in Automotive Embedded Software Systems.",
            "Representation of Robots in Matlab.",
            "Permission-Based Malware Detection System for Android Using Machine Learning Techniques.",
            "Improving Classification of Interlinked Entities Using Only the Network Structure.",
            "The Influence Ranking for Testers in Bug Tracking Systems.",
            "Business Process Modeling and Analysis Based on Queue Logical Petri Nets.",
            "Identify Severity Bug Report with Distribution Imbalance by CR-SMOTE and ELM.",
            "Document Summarization Using Sentence-Level Semantic Based on Word Embeddings.",
            "SmartShell: Automated Shell Scripts Synthesis from Natural Language.",
            "Preservation of Class Invariants in Refactoring UML Models.",
            "Permission-based Android Malware Detection System Using Feature Selection with Genetic Algorithm.",
            "Native Code Generation as a Service.",
            "Machine Learning Techniques for Code Smells Detection: A Systematic Mapping Study.",
            "Crowdsourcing-Based Evaluation of Automatic References Between WordNet and Wikipedia.",
            "Knowledge Management Strategies and Processes in Agile Software Development: A Systematic Literature Review.",
            "Practices to Improve Risk Management in Agile Projects.",
            "Investigating the Relationship Between SLOC and Logical Database Measures to Improve the Early Estimation of Software Cost.",
            "A Novel Algorithm for Identifying Key Function Nodes in Software Network Based on Evidence Theory.",
            "A Framework-Driven Comparison of Automata-Based Tools for Identifying Business Rule Conflicts.",
            "A Commit Messages-Based Bug Localization for Android Applications.",
            "A Parallel Framework of Combining Satisfiability Modulo Theory with Indicator-Based Evolutionary Algorithm for Configuring Large and Real Software Product Lines.",
            "An Empirical Study on the Architecture Instability of Software Projects.",
            "PASER: A Pattern-Based Approach to Service Requirements Analysis.",
            "A Modified Similarity Metric for Unit Testing of Object-Oriented Software Based on Adaptive Random Testing.",
            "A Unified Framework for Bug Report Assignment.",
            "Guest Editors' Introduction.",
            "CkLR Algorithm for Improvement of Data Prediction and Accuracy Based on Clustering Data.",
            "State Estimation Based on Ensemble DA-DSVM in Power System.",
            "Formal Interoperability Models of Sensor Networks Based on Logical Workflow Nets.",
            "Efficiency Improvement of Classification Model Based on Altered K-Means Using PCA and Outlier.",
            "Spatial Drawing Framework Design for VR-Based Painting Application.",
            "Machine Learning Methods for Ranking.",
            "A Novel Approach to Publishing Tasks for Collaboratively Crowdsourcing Workflows.",
            "A Refactoring Catalog for Lambda Expressions in Java.",
            "Towards Optimizing Hospital Patient Transports by Automatically Identifying Interpretable Causes of Delays.",
            "A Knowledge Integrated Case-Based Classifier.",
            "Binary Independence Language Model in a Relevance Feedback Environment.",
            "SMOTE and Feature Selection for More Effective Bug Severity Prediction.",
            "Guest Editors' Introduction.",
            "Synchronization of Uncertain Complex Dynamical Networks.",
            "Optimization Location Selection Analysis of Energy Storage Unit in Energy Internet System Based on Tabu Search.",
            "Performance of AEB System on a Slope Using an Extended Kalman Filter.",
            "Measuring Class Cohesion Using Internal and External Class Relationships.",
            "Prioritized Process Test: An Alternative to Current Process Testing Strategies.",
            "LSTM-Based with Deterministic Negative Sampling for API Suggestion.",
            "Research Notes - Software Process Selection Based Upon Abstract Machines for Slow Intelligence Systems.",
            "Guest Editor's Introduction.",
            "An Introductory Study on an Architecture-Based Software Product Line Test Generation Method.",
            "Virtually Zero Delay Interaction Between Online Game Players Using Kalman Filter-Based Dead Reckoning with Density and Distance Gain Control Adaptation.",
            "Classification of the Era Emotion Reflected on the Image Using Characteristics of Color and Color-Based Classification Method.",
            "Fault Detection Prediction Using a Deep Belief Network-Based Multi-Classifier in the Semiconductor Manufacturing Process.",
            "Combinatorial Test Design Using Design-Time Decisions for Variability.",
            "An Outlier Degree Shilling Attack Detection Algorithm Based on Dynamic Feature Selection.",
            "A Formalization Model Transformation Approach on Workflow Automatic Execution from CIM Level to PIM Level.",
            "Software Defect Prediction Based on Cost-Sensitive Dictionary Learning.",
            "Log Data Modeling and Acquisition in Supporting SaaS Software Performance Issue Diagnosis.",
            "Improvements of Directed Automated Random Testing in Test Data Generation for C++ Projects.",
            "USLTG: Test Case Automatic Generation by Transforming Use Cases.",
            "Mutation with Local Searching and Elite Inheritance Mechanism in Multi-Objective Optimization Algorithm: A Case Study in Software Product Line.",
            "Aspect-Oriented Approach for Testing Software Applications and Automatic Aspect Creation.",
            "ARES: An Agile Requirements Specification Process for Regulated Environments.",
            "Key Classes in Object-Oriented Systems: Detection and Assessment.",
            "A PSO-Based CEGAR Framework for Stochastic Model Checking.",
            "Communication Problems in Software Development - A Model and Its Industrial Application.",
            "WAAC: An End-to-End Web API Automatic Calls Approach for Goal-Oriented Intelligent Services.",
            "A Privacy Awareness System for Software Design.",
            "Guest Editor's Introduction.",
            "A Case-Based Reasoning Approach for the Cybersecurity Incident Recording and Resolution.",
            "Using Bayesian Network to Estimate the Value of Decisions within the Context of Value-Based Software Engineering: A Multiple Case Study.",
            "Evaluation Techniques for Chatbot Usability: A Systematic Mapping Study.",
            "Exposing IoT Objects in the Internet Using the Resource Management Architecture.",
            "Multistep Flow Prediction on Car-Sharing Systems: A Multi-Graph Convolutional Neural Network with Attention Mechanism.",
            "Formalization and Verification of TESAC Using CSP.",
            "API Misuse Detection in C Programs: Practice on SSL APIs.",
            "Point-of-Interest Recommendation Based on User Contextual Behavior Semantics.",
            "Improve Language Modeling for Code Completion Through Learning General Token Repetition of Source Code with Optimized Memory.",
            "A Robust Visual Tracker Based on DCF Algorithm.",
            "Piecewise Aggregation for HMM Fitting: A Pre-Fitting Model for Seamless Integration with Time-Series Data."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2018",
        "info": "Volume 28, 2018",
        "count": 81,
        "papers": [
            "Message from the Editor-in-Chief.",
            "Identification of Potential Reusable Subroutines in Recorded Automated Test Scripts.",
            "MultiCoS - A Requirements Engineering Tool.",
            "Architecture-Based Software Testing.",
            "Role-Based Modeling for Designing Agent Behavior in Self-Organizing Multi-Agent Systems.",
            "Empirical Study on the Distribution of Bugs in Software Systems.",
            "Metrics Visualization Techniques Based on Historical Origins and Functional Layers for Developments by Multiple Organizations.",
            "Guest Editors' Introduction.",
            "Detecting Domain-Flux Malware Using DNS Failure Traffic.",
            "Research Notes: User Identification Model Based on Mouse Behaviors.",
            "Research Notes: Distributed Shadow for Router Security Defense.",
            "Research Notes: User Influence in Microblog Based on Interest Graph.",
            "Size and Effort Estimation Based on Problem Domain Measures for Object-Oriented Software.",
            "Android-SRV: Scenario-Based Runtime Verification of Android Applications.",
            "Towards Dynamic Evolution of Runtime Variability Based on Computational Reflection.",
            "Identifying Multiple Entity Columns in Web Tables.",
            "Predicting Code Hotspots in Open-Source Software from Object-Oriented Metrics Using Machine Learning.",
            "A Medical Documents Rewriting Model Based on Medical Knowledge Demanders' Feelings and Emotions.",
            "EMSA: Extensibility Metric for Software Architecture.",
            "Quantitative Measurement of Scientific Software Quality: Definition of a Novel Quality Model.",
            "Guest Editors' Introduction.",
            "Multistate Reliability Evaluation of Bogie on High Speed Railway Vehicle Based on the Network Flow Theory.",
            "A Risk-Based Maintenance Decision-Making Approach for Railway Asset Management.",
            "An Optimization Method for Train Seat Inventory Control.",
            "Optimization of Conflicting Tram Signal Priority Requests Based on Spatiotemporal Interlocking Logic Using Microscopic Simulation.",
            "Development of Real-Time Simulation Application Software for Four-Quadrant Converter System Based on MATLAB.",
            "Predicting the Severity of Bug Reports Based on Feature Selection.",
            "A Systematic Literature Review on the Application of Ontologies in Automatic Programming.",
            "Fuzzy Clustering with Feature Weight Preferences for Load Balancing in Cloud.",
            "Distributed Frequent Interactive Pattern-Based Complex Software Group Network Stability Measurement.",
            "Interactive Sand Art Drawing Using RGB-D Sensor.",
            "Evaluating the Quality of Drupal Software Modules.",
            "A Business Software Testing Process-Based Model Design.",
            "Crowdsourced Web Application Testing Under Real-Time Constraints.",
            "An Adaptation of Context and Trust Aware Workflow Oriented Access Control for Remote Healthcare.",
            "An Empirical Study on Software Defect Prediction Using Over-Sampling by SMOTE.",
            "Test Case Prioritization Technique Based on Error Probability and Severity of UML Models.",
            "Network-Based Ranking for Open Source Software Developer Prediction.",
            "Multi-Objective Reconstruction of Software Architecture.",
            "Guest Editor's Introduction.",
            "Linear Software Models: Bipartite Isomorphism between Laplacian Eigenvectors and Modularity Matrix Eigenvectors.",
            "An ISM Approach for Modeling the Issues and Factors of Mobile App Development.",
            "Conceptual Integrity Without Concepts.",
            "Controlling Occurrence Frequencies of Parameter Values in Pair-Wise Testing.",
            "Image-Based Approach to Determining Regression Test Results of Dynamic Web Applications.",
            "Delivering Usability in IT Products: Empirical Lessons from the Field.",
            "Knowledge-Based Model of Expert Systems Using Rela-Model.",
            "Assessing the Effectiveness of Coverage-Based Fault Localizations Using Mutants.",
            "Knowledge Recommendation Method for Concept Development of Manufacturing Technology Using Morphological Similarity.",
            "Testing Multi-Threaded Applications Using Answer Set Programming.",
            "Feature Selection Method Based on Weighted Mutual Information for Imbalanced Data.",
            "Enriching SPARQL Queries by User Preferences for Results Adaptation.",
            "Guest Editor's Introduction.",
            "Multimode Process Monitoring Based on Geodesic Distance.",
            "A Knowledge-Based Real-Time Vision System for Monitoring the Inside of a Fluid Bed Heat Exchanger Chamber.",
            "A Type Information Reconstruction Scheme Based on Long Short-Term Memory for Weakness Analysis in Binary File.",
            "Refactoring UML Models of Object-Oriented Software: A Systematic Review.",
            "Research Notes: Binary Test-Suites Using Covering Arrays.",
            "Weighted Bayesian Runtime Monitor: A Novel QoS Monitoring Approach Sensitive to Environmental Factors.",
            "Automated Quantitative Verification for Service-Based System Design: A Visualization Transform Tool Perspective.",
            "Adaptive Random Testing in Detecting Layout Faults of Web Applications.",
            "Software Evolution Rules with Condition Constrains to Support Component Type Matching Based on Bigraph.",
            "Evaluation of Software Reusability Based on Coupling and Cohesion.",
            "Exploring the Impact of Code Smells on Fine-Grained Structural Change-Proneness.",
            "Estimation and Generation of Software Architectural Specification to Handle Variation Points.",
            "Guest Editors' Introduction.",
            "Developing Self-Adaptive Service-Oriented Mobile Applications: A Framework Based on Dynamic Deployment.",
            "Multiple Relational Topic Modeling for Noisy Short Texts.",
            "Schedulability Analysis of Graph-Based Real-Time Task Model with Precedence Constraints.",
            "Experimental Evaluation of Redundancy in Android Mutation Testing.",
            "Modeling and Verification of IEEE 802.11i Security Protocol in UPPAAL for Internet of Things.",
            "An Ensemble Approach for Detecting Anomalous User Behaviors.",
            "Formalization and Verification of the OpenFlow Bundle Mechanism Using CSP.",
            "Learning Conceptual Modeling Design Through the Classutopia Serious Game.",
            "Expediting Binary Fuzzing with Symbolic Analysis.",
            "Gated Hierarchical LSTMs for Target-Based Sentiment Analysis.",
            "Evolutionary Propositionalization of Multi-Relational Data - Research Notes.",
            "SmartClean: Smart City Street Cleanliness System Using Multi-Level Assessment Model - Research Notes.",
            "Object-Oriented Modeling with Ontologies Around: A Survey of Existing Approaches.",
            "Influence Factors in Software Productivity - A Tertiary Literature Review.",
            "Effort Estimation in Agile Software Development: An Updated Review."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2017",
        "info": "Volume 27, 2017",
        "count": 66,
        "papers": [
            "Improving Resilience of Software Systems: A Case Study in 3D-Online Game System.",
            "An Adaptive Semantic Descriptive Model for Multi-Document Representation to Enhance Generic Summarization.",
            "Identification of Extract Method Refactoring Opportunities through Analysis of Variable Declarations and Uses.",
            "Partial k-Anonymity for Privacy-Preserving Social Network Data Publishing.",
            "Characterizing Individualized Coding Contributions of OSS Developers from Topic Perspective.",
            "A Design Theory for Cognitive Workflow Systems.",
            "Structural Process Pattern Matching Based on Graph Morphism Detection.",
            "Dynamic Software Product Line Engineering: A Reference Framework.",
            "A User eXperience Evaluation Framework for Mobile Usability.",
            "Association-Oriented Database Model - n-ary Associations.",
            "QTwig: A Structural Join Algorithm for Efficient Query Retrieval Based on Region-Based Labeling.",
            "Automatic Mining of Quantitative Association Rules with Gravitational Search Algorithm.",
            "A Specification and Detection Approach for Parallel Evolution Conflicts of Software Architectures.",
            "Semantic Trajectory Knowledge Discovery: A Promising Way to Extract Meaningful Patterns from Spatiotemporal Data.",
            "Utilization of Dependence and Weight to Improve Fault Localization Method of Regression Test Cases.",
            "Optimal Design of Wide Area Based on Fuzzy Controller and Intelligent Method.",
            "A Framework for Selecting Architectural Tactics Using Fuzzy Measures.",
            "Web Pages Classification with Parliamentary Optimization Algorithm.",
            "Enhancing Software Maintenance via Early Prediction of Fault-Prone Object-Oriented Classes.",
            "SXM-Based Web Test Generation with Respect to Logic Coverage Criteria.",
            "A Method for Prioritizing Integration Testing in Software Product Lines Based on Feature Model.",
            "Cost and Effectiveness of Search-Based Techniques for Model-Based Testing: An Empirical Analysis.",
            "A Proof of Concept Study for Criminal Network Analysis with Interactive Strategies.",
            "An Effort Estimation Taxonomy for Agile Software Development.",
            "Revealing the Gap Between Skills of Students and the Evolving Skills Required by the Industry of Information and Communication Technology.",
            "Learning Frameworks in a Social-Intensive Knowledge Environment - An Empirical Study.",
            "A Review of Tacit Knowledge: Current Situation and the Direction to Go.",
            "Investigating the Effect of Aspect-Oriented Refactoring on the Unit Testing Effort of Classes: An Empirical Evaluation.",
            "Adaptation Architecture for Self-Healing Computer Systems.",
            "Software Product Line Testing Based on Feature Model Mutation.",
            "An Evaluation Method for Content Analysis Based on Twitter Content Influence.",
            "PRST: A PageRank-Based Summarization Technique for Summarizing Bug Reports with Duplicates.",
            "Probabilistic Model Checking-Based Service Selection Method for Business Process Modeling.",
            "Augmenting Bug Localization with Part-of-Speech and Invocation.",
            "An Efficient Method to Generate Test Data for Software Structural Testing Using Artificial Bee Colony Optimization Algorithm.",
            "Generalized Software Reliability Model Considering Uncertainty and Dynamics: Model and Applications.",
            "Parametrization and Evaluation of Intermediate Level Obfuscator.",
            "Structure2Content: An Incremental Method for Detecting Outlier Correlation in Heterogeneous Network.",
            "Search-Based Approaches for Software Module Clustering Based on Multiple Relationship Factors.",
            "Software Quality and Community Structure in Java Software Networks.",
            "Alternatives to the Knowledge Discovery Metamodel: An Investigation.",
            "Automatic Software Categorization Using Ensemble Methods and Bytecode Analysis.",
            "Test Focus Selection for Integration Testing.",
            "Supporting Continuous Changes to Business Intents.",
            "Requirements Engineering Based on Knowledge Management: Theoretical Aspects and a Practical Proposal.",
            "Detecting Implicit Security Exceptions Using an Improved Variable-Length Sequential Pattern Mining Method.",
            "Fault Localizations Through Feature Selections.",
            "Enterprise WAE: A Lightweight UML Extension for the Characterization of the Presentation Tier of Enterprise Applications with MDD-Based Mockup Generation.",
            "Comparative Search of Entities.",
            "Guest Editors' Introduction.",
            "A Framework for Developing Cyber-Physical Systems.",
            "Automated Learning Content Generation from Knowledge Bases in the STUDYBATTLES Environment.",
            "Developer Identity Linkage and Behavior Mining Across GitHub and StackOverflow.",
            "Improving Cross-Company Defect Prediction with Data Filtering.",
            "Context Model Acquisition from Spoken Utterances.",
            "A Method to Analyze Predicate Transition Nets Using SPIN Model Checker.",
            "Localization of Linearizability Faults on the Coarse-Grained Level.",
            "Comparing Software Bugs in Clone and Non-clone Code: An Empirical Study.",
            "The Relationship Between Code Smells and Traceable Patterns - Are They Measuring the Same Thing?",
            "Enhancing Call-Level Interfaces with Thread-Safe Local Memory Structures.",
            "Mining Hidden Interests from Twitter Based on Word Similarity and Social Relationship for OLAP.",
            "An Approach to Generate Software Agents for Health Data Mining.",
            "Query Expansion via Intent Predicting.",
            "Random GUI Testing of Android Application Using Behavioral Model.",
            "Argumentation Schemes for Collaborative Debate of Requirement Risks in Software Projects.",
            "Formal Approach to Assertion-Based Code Generation."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2016",
        "info": "Volume 26, 2016",
        "count": 69,
        "papers": [
            "Automated and Optimized Software Test Suite Generation Technique for Structural Testing.",
            "Capturing Requirements from Expected Interactions Between Software and Its Interactive Environment: An Ontology Based Approach.",
            "A Semi-Automated Approach to the Recovery of SOA System Structure from Low-Level Artifacts.",
            "Accounting for Product Similarity in Software Project Duration Estimation.",
            "Traceability Guideline for Software Requirements and UML Design.",
            "OAM: An Ontology Application Management Framework for Simplifying Ontology-Based Semantic Web Application Development.",
            "Cloud-Based Mobile Testing as a Service.",
            "Towards Measuring the Change Impact in ATL Model Transformations.",
            "Input Contract Testing of Graphical User Interfaces.",
            "Growing Hierarchical Self-Organizing Map Using Category Utility.",
            "An Automated Approach for Scheduling Bug Fix Tasks.",
            "Formally Modeling and Analyzing the Reliability of Cloud Applications.",
            "Structural Code Clone Detection Methodology Using Software Metrics.",
            "On the Semantics of Architectural Decisions.",
            "An Integrated Design Method for SOA-Based Business Modeling and Software Modeling.",
            "Knowledge-Driven User Behavior Pattern Discovery for System Security Enhancement.",
            "Guiding Bug Triage through Developer Analysis in Bug Reports.",
            "Configuration Management Model in Evolutionary Software Product Line.",
            "Effective Social Productivity Measurements during Software Development - An Empirical Study.",
            "SysML-Based Requirement Management to Improve Software Development.",
            "Aspect Oriented Re-engineering of Legacy Software Using Cross-Cutting Concern Characterization and Significant Code Smells Detection.",
            "Guest Editors' Introduction.",
            "A Sub Chunk-Confusion Based Privacy Protection Mechanism for Association Rules in Cloud Services.",
            "Fepchecker: An Automatic Model Checker for Verifying Fairness and Non-Repudiation of Security Protocols in Web Service.",
            "An Evolutionary Method for the Formal Specification Construction of Service-Based Software.",
            "QoS Prediction for Web Service Recommendation with Network Location-Aware Neighbor Selection.",
            "A Novel Framework of Using Petri Net to Timed Service Business Process Modeling.",
            "Markov Chain-Like Model for Prediction Service Based on Improved Hierarchical Particle Swarm Optimization Cluster Algorithm.",
            "15 Years of Software Regression Testing Techniques - A Survey.",
            "Summarizing Personal Dataspace Based on User Interests.",
            "The Use of an Ontotrigger for Designing the Ontology of a Model Maturity Capsule.",
            "Regression Test Cases Prioritization Using Clustering and Code Change Relevance.",
            "Design of Secure Software Architectures with Secure Connectors.",
            "Regression Analysis Based Software Effort Estimation Method.",
            "Generating Intelligent Summary Terms for Improving Knowledge Discovery in Software Bug Repositories.",
            "Novel Research on a Fibration Knowledge-Based Solution for Engineered Surface Tolerances within the Modern GPS Context.",
            "A Method for Materials Knowledge Extraction from HTML Tables Based on Sibling Comparison.",
            "Suggesting Alternative Scenarios Using Use Case Specification Patterns for Requirement Completeness.",
            "A Modified Hill-Climbing Algorithm for Knowledge Test Assembly Based on Classified Criteria.",
            "Code Comment Quality Analysis and Improvement Recommendation: An Automated Approach.",
            "ComboRT: A New Approach for Generating Regression Test Cases for Evolving Programs.",
            "Unsupervised Bug Report Categorization Using Clustering and Labeling Algorithm.",
            "An Attribute-Based Development Framework of Node Software for Various Operating Systems in Sensor Network Environment.",
            "Web Service Discovery for Cloud-Based Mobile Application Using Multi-Level Clustering and QoS-Based Ranking.",
            "Multi-Resource Modeling of Real-Time Software Based on Resource Timed Process Algebra.",
            "Counterexample Generation in Stochastic Model Checking Based on PSO Algorithm with Heuristic.",
            "Prosumer Framework for Knowledge Management Based on Prosumer Service Patterns.",
            "How Agile Developers Integrate User-Centered Design Into Their Processes: A Literature Review.",
            "User eXperience Management from Early Stages of Computer Game Development.",
            "Software Maintainability: Systematic Literature Review and Current Trends.",
            "Analysis of Policy-Based Systems with AGILE Policies Using Petri Nets.",
            "Efficiently Updating the Discovered Sequential Patterns for Sequence Modification.",
            "Design of the Tableau Reasoner TGC2 for Description Logics.",
            "Guest Editor's Introduction.",
            "Public Sentiments Analysis Based on Fuzzy Logic for Text.",
            "Time Series Classification with Discrete Wavelet Transformed Data.",
            "Using Closed Patterns to Solve the Consensus Clustering Problem.",
            "A Machine Learning Based Approach for Evaluating Clone Detection Tools for a Generalized and Accurate Precision.",
            "An Algorithm for Forward Reduction in Sequence-Based Software Specification.",
            "Exploring and Enabling DevOps for Data Analytical System with Essential Demands Elicitation.",
            "Linking Design Model with Code.",
            "Automatically Modeling Developer Programming Ability and Interest Across Software Communities.",
            "An Empirical Study of Ranking-Oriented Cross-Project Software Defect Prediction.",
            "An Improved Regional Traffic Volume Dynamic Feedback Control.",
            "Traffic Safety Region Estimation Based on SFS-PCA-LSSVM: An Application to Highway Crash Risk Evaluation.",
            "Exploiting Correlation Subspace to Predict Heterogeneous Cross-Project Defects.",
            "Mining Feature-Opinion from Reviews Based on Dependency Parsing.",
            "A Multi-Source Approach for Bug Triage.",
            "Building a Model-Based GUI Test Automation System for Mobile Applications."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2015",
        "info": "Volume 25, 2015",
        "count": 90,
        "papers": [
            "Guest Editor's Introduction.",
            "Human Resource Allocation in Software Project with Practical Considerations.",
            "A Proposal for the Improvement of Project's Cost Predictability Using Earned Value Management and Historical Data of Cost - An Empirical Study.",
            "Multi-Perspective Exploratory Analysis of Software Development Data.",
            "Feature-Level Change Impact Analysis Using Formal Concept Analysis.",
            "An Empirical Investigation on Wrapper-Based Feature Selection for Predicting Software Quality.",
            "Investigating Two Approaches for Adding Feature Ranking to Sampled Ensemble Learning for Software Quality Estimation.",
            "Clustering-Based Topical Web Crawling for Topic-Specific Information Retrieval Guided by Incremental Classifier.",
            "On the Effect of Exploiting GPUs for a More Eco-Sustainable Lease of Life.",
            "Guest Editors' Introduction.",
            "Emergence in Interactive Artistic Visualization.",
            "Interactive Exploration of Data with Visual Metaphors.",
            "Visualized Awareness Support for Collaborative Software Development on Mobile Devices.",
            "Generating Reusable Visual Notations Using Model Transformation.",
            "A Tool Supporting End-User Development of Access Control in Web Applications.",
            "Generating 3D Visual Language Editors: Encapsulating Interaction Techniques in Visual Patterns.",
            "IGA-Based Interactive Framework Using Conjoint Analysis and SOM for Designing Room Layout.",
            "Using Your Fingers to Think: Enabling Subjective Routing with a Rubber Band Metaphor.",
            "Future Research Directions of Software Engineering and Knowledge Engineering.",
            "Guest Editors' Introduction.",
            "An Improved Potential Field Based Method for Crowd Simulation.",
            "A Short-Text Oriented Clustering Method for Hot Topics Extraction.",
            "Multiple Depth Maps Integration for 3D Reconstruction Using Geodesic Graph Cuts.",
            "An Online Quantified Safety Assessment Method for Train Service State Based on Safety Region Estimation and Hybrid Intelligence Technologies.",
            "EMITS: An Experience Management System for IT Management Support.",
            "Cloud Computing Research Analysis Using Bibliometric Method.",
            "Mining Class Temporal Specification Dynamically Based on Extended Markov Model.",
            "Efficient Mining of Data Streams Using Associative Classification Approach.",
            "EFSM-Based Test Case Generation: Sequence, Data, and Oracle.",
            "Specification Patterns: Formal and Easy.",
            "Reconstructing Software High-Level Architecture by Clustering Weighted Directed Class Graph.",
            "Reusable Solutions for Implementing Usability Functionalities.",
            "Generation of Business Event Data Sets for Testing RFID Information Services.",
            "Using Neural Networks to Forecast Available System Resources: An Approach and Empirical Investigation.",
            "Guest Editors' Introduction.",
            "FASICA Framework: Service Selection Using K-d Tree and Cache.",
            "Machine Learning Models and Statistical Measures for Predicting the Progression of IgA Nephropathy.",
            "Leveraging Active-Guided Evolutionary Games for Adaptive and Stable Deployment of DVFS-Aware Cloud Applications.",
            "Configurable Domain Objects for Resource Modelling in Treatment Scheduling.",
            "SyncAS: A Virtual Block Approach to Tame Asynchronous Programming.",
            "Visual Text Mining: Ensuring the Presence of Relevant Studies in Systematic Literature Reviews.",
            "Book Review: Scientific Object and Its Shadow.",
            "A Collaborative Approach for Minimal-Cost Monitor Deployment in Cloud Environment.",
            "Improving Search-Based Schematic Layout by Parameter Manipulation.",
            "Working and Playing with Scrum.",
            "Probabilistic Approach to Predicting Risk in Software Projects Using Software Repository Data.",
            "An Approach for Cluster-Based Retrieval of Tests Using Cover-Coefficients.",
            "Software Risk Modeling by Clustering Project Metrics.",
            "An Analysis of Problem-Solving Patterns in Open Source Software.",
            "An Algebraic Framework for the Verification of Context-Aware Adaptive Systems.",
            "Test Generation for Programs with Binary Tree Structure as Input.",
            "Do Outsourcing Service Providers Need a Methodology for Service Delivery?",
            "Improving Similarity Measure for Java Programs Based on Optimal Matching of Control Flow Graphs.",
            "A Methodology to Analyze Multi-Agent Systems Modeled in High Level Petri Nets.",
            "IPR Centered Institutional Service and Tools for Content and Metadata Management.",
            "CBIR Based Testing Oracles: An Experimental Evaluation of Similarity Functions.",
            "Reliability and Performance Analysis of Architecture-Based Software Implementing Restarts and Retries Subject to Correlated Component Failures.",
            "Knowledge Adaptability Evaluation in View of Patent Citation in Technological Evolutionary Process: A Case Study of Fuel Cell.",
            "Web Service Clustering Using Relational Database Approach.",
            "Linear Software Models: Decoupled Modules from Modularity Matrix Eigenvectors.",
            "Guest Editor's Introduction.",
            "Application of Slow Intelligence Framework for Smart Pet Care System Design.",
            "A Slow Intelligence System Test Bed Enhanced with Super-Components.",
            "On the Stability of Feature Selection Methods in Software Quality Prediction: An Empirical Investigation.",
            "A Software Reliability Model for Cloud-Based Software Rejuvenation Using Dynamic Fault Trees.",
            "DAEH: A Tool for Specifying and Monitoring the Exception Handling Policy.",
            "Aggregating Data Sampling with Feature Subset Selection to Address Skewed Software Defect Data.",
            "Detecting Incorrect Uses of Combining Algorithms in XACML 3.0 Policies.",
            "Improving the Accuracy of Integer Signedness Error Detection Using Data Flow Analysis.",
            "Flexible and Extensible Runtime Verification for Java (Extended Version).",
            "Reliable and Secure Distributed Cloud Data Storage Using Reed-Solomon Codes.",
            "Understanding the Causes of Architecture Changes Using OSS Mailing Lists.",
            "NeoIDL: A Domain Specific Language for Specifying REST Contracts Detailed Design and Extended Evaluation.",
            "Evaluating Architectural Design Decision Paradigms in Global Software Development.",
            "Ranking Developers' Importance Factors Based on Team Leader Perspective.",
            "A Study of Cross-National Differences in Happiness Factors Using Machine Learning Approach.",
            "Secure, Dynamic and Distributed Access Control Stack for Database Applications.",
            "Fine-Grained Access Control via XACML Policy Optimization in Cloud Computing.",
            "The CoCoME Platform: A Research Note on Empirical Studies in Information System Evolution.",
            "Using Learning Styles of Software Professionals to Improve Their Inspection Team Performance.",
            "Unanticipated Software Evolution: Evaluating the Impact on Development Cost and Quality.",
            "A Behavior Marker for Measuring Non-Technical Skills of Software Professionals: An Empirical Study.",
            "Coding Productivity in MapReduce Applications for Distributed and Shared Memory Architectures.",
            "Investigating the Impact of Stakeholders' Commitment on Requirements Elicitation.",
            "CARE: A Computer-Aided Requirements Engineering Tool for Problem-Oriented Software Development.",
            "Research Notes on the Architectural Evolution of a Software Product Line.",
            "Evaluating the Feasibility of MAX: A Method Using Cards and a Board for Assessing the Post-Use UX.",
            "Comparison of Design Models: A Systematic Mapping Study.",
            "User Scenarios Through User Interaction Diagrams.",
            "Finding and Emulating Keyboard, Mouse, and Touch Interactions and Gestures while Crawling RIAs."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2014",
        "info": "Volume 24, 2014",
        "count": 67,
        "papers": [
            "A Versatile Approach for the Estimation of Software Development Effort Based on SRS Document.",
            "Efficient Reliability Analysis of Concurrent Software Applications Considering Software Architecture.",
            "Investigating Associative Classification for Software Fault Prediction: An Experimental Perspective.",
            "Comparison of Selected Swarm Intelligence Algorithms in Student Courses Recommendation Application.",
            "A Comparative Study of Bug Classification Algorithms.",
            "A New Pattern-Based Flexible Approach for Maintaining a Constrained Workflow.",
            "Developing Web Applications Based on Model Driven Architecture.",
            "Linear Software Models: Standard Modularity Highlights Residual Coupling.",
            "Architecture-Based Planning of Software Evolution.",
            "Towards a Reusable Fault Handling in WS-BPEL.",
            "Learning Bayesian Network Structure Using a MultiExpert Approach.",
            "Addressing the Construction of Z and Object-Z with Use Case Maps (UCMs).",
            "Ontology for Systems Development.",
            "Combining the Strengths of BPEL and Mule ESB.",
            "NMMp: A Model-Driven UML Extension for the Description of Navigation Maps for Web Applications.",
            "Using High Level Petri Nets in the Modelling, Simulation and Verification of Reconfigurable Manufacturing Systems.",
            "Investigation of Developer's Perceptions in XML Schema Development Using Textual and Visual Tool Types.",
            "A Strategy to Formalize Specification and Its Application to an Advanced Railway System.",
            "Enhancing Navigability in Websites Built Using Web Content Management Systems.",
            "Book Review: Can We Improve the Ability to Improve?",
            "A Refinement Technique for Duplication and Collision Between Features in Software Product Line Engineering.",
            "Validating and Improving a Knowledge Acquisition Approach for Architectural Decisions.",
            "XDMA: A Dual Indexing and Mutual Summation Based Keyword Search Algorithm for XML Databases.",
            "Extraction and Analysis of Crucial Fraction in Software Networks.",
            "An Iterative Approach to Managing Uncertain Mappings in Dataspace Support Platforms.",
            "Test Case Selection: A Systematic Literature Review.",
            "A Comparison of Software Product Line Traceability Approaches from End-to-End Traceability Perspectives.",
            "A Calculus for (Meta)Models and Transformations.",
            "A \"Resource Package\"-Oriented Approach for Remote Sensing Analysis Modeling - Dust Storm Monitoring Model as Example.",
            "Analysis of Susceptibility to the Consensus for a Few Representations of Collective Knowledge.",
            "A Constrained, Possibilistic Logical Approach for Software System Survivability Evaluation.",
            "Intelligent Architecture for Comparative Analysis of Public Companies Using Semantics and XBRL Data.",
            "Context-aware Fuzzy Control Systems.",
            "Guest Editors' Introduction.",
            "Study of Factors Influencing the Adoption of Agile Processes When Using Wikis.",
            "MIN-ITs: A Framework for Integration of IT Management Standards in Mature Environments.",
            "A Methodology for Establishing Multi-Model Environments in Order to Improve Organizational Software Processes.",
            "Proposing an Effective Artificial Neural Network Architecture to Improve the Precision of Software Cost Estimation Model.",
            "A Sliding-Window Method to Discover Recent Frequent Query Patterns from XML Query Streams.",
            "Guest Editors' Introduction.",
            "Very High Data Rate Support for Mobile Cloud Services Using SDN-Based Heterogeneous Carrier Aggregation.",
            "Heterogeneous and Elastic Computation Framework for Mobile Cloud Computing.",
            "Seamless QoE Support for Mobile Cloud Services Using IEEE802.21 MIH and the GENI Future Internet Framework.",
            "Towards Improvement of Analogy-Based Software Development Effort Estimation: A Review.",
            "A Clustering-Based Bipartite Graph Privacy-Preserving Approach for Sharing High-Dimensional Data.",
            "Guest Editors' Introduction.",
            "Semi-Automatic Online Tagging with K-Medoid Clustering.",
            "Overcoming Heterogeneity in Business Process Modeling with Rule-Based Semantic Mappings.",
            "Learning Non-Taxonomic Relations on Demand for Ontology Extension.",
            "ModelCC - A Pragmatic Parser Generator.",
            "Clustering Analysis of Function Call Sequence for Regression Test Case Reduction.",
            "Development of Energy-aware Mobile Applications Based on Resource Outsourcing.",
            "Guest Editor's Introduction.",
            "The Use of Ensemble-Based Data Preprocessing Techniques for Software Defect Prediction.",
            "Continuous CMMI Assessment Using Non-Invasive Measurement and Process Mining.",
            "Discovering Perceptions in Online Social Media: A Probabilistic Approach.",
            "A Generic Process for the Design and Generation of Software Product Line Skeleton Architectures.",
            "A Causal Model for Analyzing the Impact of Graphical Modeling Languages on Usability.",
            "Activity-Based Software Process Lines Tailoring.",
            "Guest Editor's Introduction.",
            "A Cooperative Coevolution Approach to Automate Pattern-based Software Architectural Synthesis.",
            "Automatic Documentation of [Mined] Feature Implementations from Source Code Elements and Use-Case Diagrams with the REVPLINE Approach.",
            "Addressing Non-Functional Properties in Feature Models: A Goal-Oriented Approach.",
            "Characterizing the Problem of Developers' Assignment for Merging Branches.",
            "Assessing and Evolving a Domain Specific Language for Formalizing Software Engineering Experiments: An Empirical Study.",
            "Systematic Knowledge Engineering: Building Bodies of Knowledge from Published Research.",
            "User Profile Visualization to Facilitate MSLIM-Model-Based Social Influence Analysis Based on Slow Intelligence Approach."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2013",
        "info": "Volume 23, 2013",
        "count": 64,
        "papers": [
            "Guest Editors' Introduction.",
            "Knowledge Management and Semantic Modeling: a Role of Information Granularity.",
            "Integration of Modal and Fuzzy Methods of Knowledge Representation in Artificial Agents.",
            "Experts Search and Rank with Social Network: an Ontology-Based Approach.",
            "Semantic Wiki-Based Knowledge Management System by Interleaving Ontology Mapping Tool.",
            "Shortest Paths Anonymization on Weighted Graphs.",
            "Parallel Combinatorial Algorithms for Multi-Sets and their Applications.",
            "A Data Partition Method for MEMS-Based Storage Devices in a Distributed Computing Environment.",
            "Ontology-Based Semantic Verification for UML Behavioral Models.",
            "Integrating Action-Based Defect Prediction to Provide Recommendations for Defect Action Correction.",
            "Entropy of some CK Metrics to Assess Object-Oriented Software Quality.",
            "Comparison of Open Source Tools for Project Management.",
            "Software Performance Engineering by Simulated-Based Object Deployment.",
            "Sybel: a System Modelling Language Enhancing Automatic Support in the Software Development Process.",
            "Analyzing Impact Rules of Different Change Types to Support Change Impact Analysis.",
            "Developmental Size estimation for Object-Oriented Software Based on Analysis Model.",
            "Refactoring with Ordered Collections of Fine-Grain Transformations.",
            "Using OCL in the Formal Specification of the Library Standards.",
            "Using Test Oracles and Formal Specifications with Test-Driven Development.",
            "Software Engineering Job Productivity - a Systematic Review.",
            "Guest Editor's Introduction.",
            "An Empirical Study into the Accuracy of IT Estimations and its Influencing Factors.",
            "Focusing Testing by using Inspection and Product Metrics.",
            "Development of Scientific Software: a Systematic Mapping, a bibliometrics Study, and a Paper Repository.",
            "Maintainability Predictors for Relational Database-Driven Software Applications: Extended Results from a Survey.",
            "Risk Management in Software Product Line Engineering: a Mapping Study.",
            "Software Architecture Recovery through Similarity-Based Graph Clustering.",
            "Guest Editor's Introduction.",
            "A Comprehensive Survey of Petri Net Modeling in Software Engineering.",
            "A RAID-Based Secure and Fault-Tolerant Model for Cloud Information Storage.",
            "Verifying Aspect-Oriented Models against Crosscutting Properties.",
            "Resource Oriented Workflow Nets and Workflow Resource Requirement Analysis.",
            "Enhancing Goal-Oriented Security Requirements Analysis using Common Criteria-Based Knowledge.",
            "A Clustering-Based Strategy to Identify Coincidental Correctness in Fault Localization.",
            "Statistical Comparison of Modelling Methods for Software Maintainability Prediction.",
            "Modeling and Verifying Composite Dynamic Evolution of Software Architectures using Hypergraph Grammars.",
            "Design and Implementation of an Editor/Interpreter for a Visual Logic Programming Language.",
            "Rationalization of Business Software Systems Development and enhancement Projects Investment Decisions on the Basis of Functional Size Measurement.",
            "An Effective fuzzy Clustering Algorithm for Web Document Classification: a Case Study in Cultural Content Mining.",
            "Granularities and Inconsistencies in Big Data Analysis.",
            "A Novel Approach for Optimal Grouping of Reusable Software Components for Component Based Software Development Systems.",
            "Quantifying the effects of Aspectual Decompositions on Design by Contract Modularization: a Maintenance Study.",
            "Proqrass: a Process-Based Approach to Quality Requirements Analysis for Service Systems.",
            "A Fault Localization Framework to Alleviate the Impact of Execution Similarity.",
            "Design, Build and Evaluation of an Ontology-Based KMS for Supporting CMMI-DEV Understanding: Benefits and Limitations.",
            "Useful Specification-Based Logic Coverage criteria.",
            "Quality System for production Software (QSPS): an Innovative Approach to Improve the Quality of production Software.",
            "A Survey of Privacy-Preserving Collaborative Filtering Schemes.",
            "Information Extraction versus Text Segmentation for Web Content Mining.",
            "An Approach to Checking the Compliance of User Permission Policy in Software Development.",
            "Organizational Learning Applied to Software Engineering: a Systematic Review.",
            "A literature Review on Feature Diagram Product Counting and its Usage in Software Product Line Economic Models.",
            "Risk Taxonomy Related to Software Acquisition: a Case Study.",
            "A Systematic Mapping Study of Empirical studies on the Use of Pair Programming in Industry.",
            "An Analysis of the Root Causes of Defects Injected into the Software by the Software Team: an Industrial Study of the Distributed Health-Care System.",
            "Factors Affecting Distributed Agile Projects: a Systematic Review.",
            "Absim: an Automated Business Service Identification Method.",
            "A bibliometric/Geographic Assessment of 40 Years of Software Engineering Research (1969-2009).",
            "Evaluation of an Automated Multi-phase Approach for Patterns Discovery.",
            "Incremental Development of Fault Prediction Models.",
            "Prioritization of Combinatorial Test Cases by Incremental Interaction Coverage.",
            "Code-Change Impact Analysis using Counterfactuals: Theory and Implementation.",
            "Analysis and Design of programmatic Interfaces for Integration of Diverse Web Contents.",
            "A Systematic Review of the Empirical Validation of Object-Oriented Metrics towards Fault-proneness Prediction."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2012",
        "info": "Volume 22, 2012",
        "count": 49,
        "papers": [
            "Multi-Granularity Knowledge Mining on the Web.",
            "Practice Selection Framework.",
            "Component Security Testing Approach Based on Extended Chemical Abstract Machine.",
            "A Version Management Framework for RDF Triple Stores.",
            "Alembik - a Framework for the Adaptive Transcoding of Multimedia Content in Mobile Environments: from Requirements to Architecture and Performance Evaluation.",
            "Modeling, Deploying, and Controlling Volatile Functionalities in Web Applications.",
            "Guest Editors' Introduction.",
            "An Empirical Study of Feature Ranking Techniques for Software Quality Prediction.",
            "A Comparative Study of absent Features and Unobserved Values in Software Effort Data.",
            "Resampling Methods in Software Quality Classification.",
            "Program Matching through Code Analysis and Artificial Neural Networks.",
            "Defining Reusable Administrative Processes Using a Generic Ontology.",
            "Equivalence Checking of Communicating UML Statechart Diagrams.",
            "Expanding Approach to Information Retrieval Using Semantic Similarity Analysis Based on WordNet and Wikipedia.",
            "Guest Editors' Introduction.",
            "Improved Linked Data Interaction through an Automatic Information Architecture.",
            "Connecting Closed World Research Information Systems through the Linked Open Data Web.",
            "Towards a Pan-European E-Procurement Platform to Aggregate, Publish and Search Public Procurement Notices Powered by Linked Open Data: the Moldeas Approach.",
            "Requirements Traceability: a Systematic Review and Industry Case Study.",
            "A Hybrid Software Cost Estimation Approach Utilizing Decision Trees and Fuzzy Logic.",
            "Applying Expert Judgment to Improve an Individual's Ability to Predict Software Development Effort.",
            "Uml Representation for Rule-Based Application Models with XTT2-Based Business Rules.",
            "An Empirical Study of Software Metrics for Assessing the Phases of an Agile Project.",
            "A Contribution to Continual Software Service Improvement Based on the Six-Step Service Improvement Method.",
            "The Application of a Hierarchical Tree Method to Ontology Knowledge Engineering.",
            "Risk Assessment and Adaptive Group Testing of Semantic Web Services.",
            "Learning Better Inspection Optimization Policies.",
            "Integrated Framework for Seamless Modeling of Business and Technical Aspects in Process-Oriented Enterprise Applications.",
            "A Framework for Automated Construction of Node Software using Low-Level Attributes in USN Application Development.",
            "Automated Debugging of Verilog Designs.",
            "Guest Editors' Introduction.",
            "In Loving Memory of Daniel Cooke.",
            "Detecting Emergent Behavior in Distributed Systems using Scenario-Based Specifications.",
            "Defect Prediction using Case-Based Reasoning: an Attribute Weighting Technique Based upon sensitivity Analysis in Neural Networks.",
            "Towards a Hybrid Approach for Adapting Web Graphical User Interfaces to Heterogeneous Devices using Context.",
            "Double-State Based Business Process Description Model and its Operational Semantics.",
            "Towards a Calculus for Nondeterministic Schemas in Z.",
            "Comparing and Improving the Synthesis of State-Based Specifications from Scenario-Based Specifications.",
            "A Methodology for Modeling Multi-Agent Systems using Nested Petri Nets.",
            "Detecting Emulated Environments.",
            "Feature-Based Rationale Management System for Supporting Software Architecture Adaptation.",
            "A Study Investigating Challenges in the Interface between Product Development and manufacturing in the Development of Software-Intensive Automotive Systems.",
            "Guest Editors' Introduction.",
            "Assisted Knowledge Base Generation, Management and Competence Retrieval.",
            "Modeling Human Intelligence with Slow Intelligence Systems.",
            "A Meta-Tool to Support the Development of Knowledge Engineering Methodologies and Projects.",
            "Mbtdd: Model Based Test Driven Development.",
            "Impact of Software Complexity on Development Productivity.",
            "Industrial Case Studies for Evaluating Search Based Structural Testing."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2011",
        "info": "Volume 21, 2011",
        "count": 51,
        "papers": [
            "Guest Editors' Introduction.",
            "Exploiting Intelligent Content via AXMEDIS/MPEG-21 for Modelling and Distributing News.",
            "A Self-Adaptable Indoor Localization Scheme for Wireless Sensor Networks.",
            "An Intelligent and Effective Mechanism for Mental Disorder Treatment by Using Biofeedback Analysis and Web Technologies.",
            "Semantic Description of Web 3D Worlds through Social Tagging.",
            "Model Checking for Verification of Mandatory Access Control Models and Properties.",
            "Time-Aware and Weighted Fault Severity Based Metrics for Test Case Prioritization.",
            "Unified Cohesion Measures for Aspect-Oriented Systems.",
            "Guest Editors' Introduction.",
            "Requirement Risk Level Forecast Using Bayesian Networks Classifiers.",
            "A Test Case Prioritization Based on Degree of Risk Exposure and its Empirical Study.",
            "Risk Assessment in Multi-disciplinary (Software+) Engineering Projects.",
            "Metric Selection for Software Defect Prediction.",
            "A Framework for Integrating Formal Specification, Review, and Testing to Enhance Software Reliability.",
            "Automatic Verification of Optimization Algorithms: a Case Study of a Quadratic Assignment Problem Solver.",
            "Guest Editors' Introduction.",
            "Measuring Software Functional Size from Business Process Models.",
            "Early Usability Measurement in Model-Driven Development: Definition and Empirical Evaluation.",
            "An Empirical Study of Development Visualization for Procurement by in-Process Measurement during Integration and Testing.",
            "Uncertain Context Factors in ERP Project Estimation are an Asset: Insights from a Semi-Replication Case Study in a Financial Services Firm.",
            "An Exploration of Functional Size Based Effort Estimation Models.",
            "Applying Visual Learning in the Teaching of Software Measurement Concepts.",
            "An Integrated GUI-Business Component Modeling Method for the MDD- and MVC-Based Hierarchical Designs.",
            "Adaptable Multi-Agent Systems: the Case of the Gaia Methodology.",
            "Retrieving Deep Web Data through Multi-Attributes Interfaces with Structured Queries.",
            "An Approach for Designing, Modeling and Realizing ETL Processes Based on Unified Views Model.",
            "Utilizing Multifaceted Requirement Traceability Approach: a Case Study.",
            "Verifying Java Object Invariants at Runtime.",
            "An OCL-Based Approach to Derive Constraint Test Cases for Database Applications.",
            "A Model for Predicting Class Movement in an Inheritance Hierarchy.",
            "Pg-Trust: a Self-Adaptive and Scalable Trust Computing Model for Large-Scale Peer-to-Peer Grid Computing.",
            "Leveraging Software Reuse with Knowledge Management in Software Development.",
            "Exploring the Effort of General Software Project Activities with Data Mining.",
            "Guest Editors' Introduction.",
            "Using Program Slicing to Improve the Efficiency and Effectiveness of Cluster Test Selection.",
            "A Simulation Network Model to Evaluate RFID Middlewares.",
            "Ties within Fault Localization rankings: Exposing and Addressing the Problem.",
            "Cost-Cognizant Combinatorial Test Case Prioritization.",
            "Prediction Phase in Associative Classification Mining.",
            "Question-Oriented Answer Summarization via Term Hierarchical Structure.",
            "The Dsaw Aspect-Oriented Software Development Platform.",
            "Variability Management for Software Product-Line Architecture Development.",
            "Managing Concern Knowledge in Software Systems.",
            "Spy-Tec+ : an Integrated Index Structure for k-Nearest Neighbor Queries with Semantic Predicates in Multimedia Database.",
            "A P2P Based Architecture for Semantic Web Service Discovery.",
            "A Novel Approach for Semantic Interoperability in the Web Based on the Semantic Triangle Communication Model.",
            "Research on Trust Prediction Model for Selecting Web Services Based on Multiple Decision Factors.",
            "Deriving System Complexity Metric from Events and its Validation.",
            "Capturing Interface Protocols to Support Comprehension and Evaluation of C++ Libraries.",
            "Automatic Ontology Construction in Fiction-Based Domain.",
            "Processing Continuous Queries on Sensor-Based Multimedia Data Streams by Multimedia Dependency Analysis and Ontological Filtering."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2010",
        "info": "Volume 20, 2010",
        "count": 54,
        "papers": [
            "Editorial: a General Framework for Slow Intelligence Systems.",
            "Guest Editors' Introduction.",
            "Integrated Security Framework for Industrial R&d Environments.",
            "Software Quality Evaluation for Security COTS Products.",
            "Security Requirement Representation Method for Confidence of Systems and Networks.",
            "Assessing Test Suites for Buffer Overflow Vulnerabilities.",
            "Assessment on Security Risks of Customer Relationship Management Systems.",
            "Guest Editors' Introduction.",
            "Feature Selection for Datasets with Imbalanced Class Distributions.",
            "Semi-Supervised Dynamic Classification for Intrusion Detection.",
            "Integrating Multimedia Semantic Content Analysis of YouTube Videos with Hurricane Wind Analysis for Public Situation Awareness and outreach.",
            "An Empirical Evaluation of Repetitive Undersampling Techniques.",
            "Using Contextual Information to Clarify Cross-Species Gene Normalization Ambiguity.",
            "An Efficient Web-Based Wrapper and Annotator for Tabular Data.",
            "Extensible Syntax-Oriented Verifier with Context-Dependent Recursive Verification.",
            "Proof Score Approach to Analysis of Electronic Commerce Protocols.",
            "Activity Based CIM Modeling and Transformation for Business Process Systems.",
            "Formal Specification and Analysis of an Agent-Based Medical Image Processing System.",
            "An Object-Oriented Security Knowledge Framework for the Nuclear Safety System Project.",
            "Predicting Software Development Effort Using Artificial Neural Network.",
            "Concurrent Data Materialization for XML-Enabled Database with Semantic Metadata.",
            "COSABuilder and COSAInstantiator: An Extensible Tool for Architectural Description.",
            "Guest Editors' Introduction.",
            "Automated Staged Configuration with Semantic Web Technologies.",
            "Enhancing Knowledge Management in Online Collaborative Learning.",
            "Engineering the Life-Cycle of Semantic Services-Enhanced Learning Systems.",
            "Harmonization between Personal and Shared Memories.",
            "Defining Software Process Model Constraints with Rules Using OWL and SWRL.",
            "Analysing the Performance of a Resource Reservation Protocol Specification Using a GSPN Method.",
            "The Metamodel: a Starting Point for Design Processes Construction.",
            "A Theoretical and Empirical Analysis of Three Slice-Based Metrics for Cohesion.",
            "A Comparison of Software Product Line Scoping Approaches.",
            "Project Reliability Growth Model Based on Curves of Accumulated Communication Topics for Software Development.",
            "Formal Analysis of UML 2.0 Activities Using Graph Transformation Systems.",
            "Formalization of Textual Use Cases Based on Petri Nets.",
            "Knowledge-Based Representation of 3D Media.",
            "Dynamic Knowledge Extraction from Software Systems Using Sequential Pattern Mining.",
            "Aspect-Oriented Specification: a Case Study in Space Domain.",
            "Towards Composable Location Models in Ubiquitous Computing Applications.",
            "Exploiting a Generic Approach to Construct Component-Based Systems Software in Linux Environments.",
            "Uml-Based Modeling and Analysis of Security Threats.",
            "A System Maintenance Process for Faciliating Requests Management and Conflicts Resolution.",
            "Generating Test Cases of Composite Services Based on OWL-S and eh-CPN.",
            "Reasoning under Uncertainty for Shill Detection in Online Auctions Using Dempster-Shafer Theory.",
            "Using Rule Structure to Evaluate the Completeness of Rule-Based System Testing: a Case Study.",
            "Formal Analysis of BPMN Models: a NuSMV-Based Approach.",
            "A Fine Grained Aspect Coordination Mechanism.",
            "Guest Editors' Introduction.",
            "Exploration and Optimization of User Experience in Viewing Videos on a Mobile Phone.",
            "A Visual Attention Model for Natural Scenes Based on Dynamic Feature Combination.",
            "Automatic Image Completion with Structure Propagation and Texture Synthesis.",
            "Model and Verification of WS-CDL Based on UML Diagrams.",
            "Automating a Design Methodology for Reusable Business Process Components through a Genetic Algorithm.",
            "BOOK REVIEW: \"Press on: Principles of Interaction Programming\" by Harold Thimbleby."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2009",
        "info": "Volume 19, 2009",
        "count": 47,
        "papers": [
            "Evolving More Representative Programs with Genetic Programming.",
            "User Interface Prototype Generation Technique Supporting Usage-Centered Design.",
            "Procedures and Algorithms for Continuous Integration in an Agile Specification Environment.",
            "A Novel Approach of Requirement Gathering and Analysis for Agent Oriented Software Engineering (AOSE).",
            "Change Management and Software Reuse Supportive 'Genetic Information System Development and Maintenance' Model.",
            "Master: an Intelligent Ontology-Based Multi-Agent System for Sightseer.",
            "Design of Decoupled Clinical Decision Support for Service-Oriented Architectures.",
            "Modeling and Analysis of Knowledge Flows in Software Processes through the Extension of the Software Process Engineering Metamodel.",
            "A Proposed Architecture for Self-Adaptive Expert Systems.",
            "Methodology for Data Conversion from XML Documents to Relations Using Extensible Stylesheet Language Transformation.",
            "A Framework for Tool-Based Software Architecture Reconstruction.",
            "Framework for Data Quality Assurance between Composite Services.",
            "An Inference-Enabled Access Control Model for RDF Ontology.",
            "A Multiple-Layer Knowledge Management System Framework Considering User Knowledge Privileges.",
            "Maintainability Metrics for Aspect-Oriented Software.",
            "Monitoring cumulated Anomaly in Databases.",
            "Requirement Based System Test Case Prioritization of New and Regression Test Cases.",
            "Guest Editor's Introduction.",
            "A Segment Based Approach for the Reduction of the Number of Test Cases for Performance Evaluation of Components.",
            "Trap.Net: a Realization of Transparent Shaping in .Net.",
            "Design of Wrapper for Self-Management of COTS Components.",
            "An Approach to Constructing High-Available Decentralized Systems via Self-Adaptive Components.",
            "Bp Neural Network-Based Effective Fault Localization.",
            "Automated Test Code Generation from Class State Models.",
            "Guest Editors' Introduction.",
            "Controlling the Usability of Web Services.",
            "An Intelligent Control Architecture for Adaptive Service-Based Software Systems.",
            "An Improved Approach to Adaptive Testing.",
            "Efficiently Mining Recent Frequent Patterns over Online Transactional Data Streams.",
            "The Si* Modeling Framework: Metamodel and Applications.",
            "Software Defect Prediction Using Intertransaction Association Rule Mining.",
            "An Efficient LOTOS-Based Framework for Describing and Solving (Temporal) CSPs.",
            "Ontology-Guided Service-Oriented Architecture Composition to Support Complex and Tailorable Process Definitions.",
            "A Review of Design Pattern Mining Techniques.",
            "A Novel Approach to Verify Graph Schema-Based Software Systems.",
            "Using Genetic Algorithm to Solve Multiple Sequence Alignment Problem.",
            "A Template-Driven Approach for Maintainable Service-Oriented Information Systems Integration.",
            "Event Normalization Methodology for Computer Game Environment Simulation.",
            "An Object-Oriented Development Method for Consumer Support Systems.",
            "A Holistic Semantic Framework for the Provision of Services in the Domain of eGovernment.",
            "Temporal Software Change Prediction Using Neural Networks.",
            "Agent Based Decision Tree Learning: a Novel Approach.",
            "Entailment-Based Linear Segmentation in Summarization.",
            "Ontology-Based Distributed Case-Based Reasoning in Virtual Enterprises.",
            "Rdf(S) Interoperability Results for Semantic Web Technologies.",
            "Ontology-Based Domain Engineering for Trajectory Simulation Reuse.",
            "Hybrid-Based Maintainability Impact Analysis for Evolving Systems."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2008",
        "info": "Volume 18, 2008",
        "count": 50,
        "papers": [
            "Software Effort Estimation by Analogy Using Attribute Selection Based on Rough Set Analysis.",
            "A Software Component Representation Model for Compositional Reuse.",
            "Measurement in Software Engineering: from the Roadmap to the Crossroads.",
            "Design of a CIL Connector to Spin.",
            "An Approach to Testing Black-Box Components Using Contract-Based Mutation.",
            "Composing Multi-Perspective Software Requirements Specifications.",
            "Guest Editor's Introduction.",
            "Software Engineering for Web Services Workflow Systems.",
            "Web Services Interactions: Analysis, Modeling, and Management.",
            "Dynamic Service Composition: a Discovery-Based Approach.",
            "An Approach to Checking Behavioral Compatibility between Web Services.",
            "A Loosely Coupled Aspect Language for SOA Applications.",
            "A Modeling Methodology for Conflict Control in Multi-Agent Systems.",
            "Designing Customized and Tailorable Visual Interactive Systems.",
            "Enhancing OWL Ontologies with Relation Semantics.",
            "On the Online Parameter Estimation Problem in Adaptive Software Testing.",
            "An Ontological Framework for Web Service Processes.",
            "Testing Aspect-Oriented Programs with UML Design Models.",
            "Guest Editors' Introduction.",
            "Knowledge-Based Reasoning Enhanced Control System for in-situ Bioremediation Processes.",
            "An Integrated Game-Theory Based Model for Trans-Boundary water Resources Management in North China: a Case Study in the Guanting Reservoir Basin (GRB), Beijing.",
            "An Intelligent Agent Mobile emissions Model for Urban Environmental Management.",
            "Developing a GIS-Based Information Management System for on-Site wastewater Treatment Facilities.",
            "Reliability Model for Component-Based Systems in COSMIC (a Case Study).",
            "On pi-Calculus Semantics as a Formal Basis for UML Activity Diagrams.",
            "Guest Editors' Introduction.",
            "Integrating Agent, Service and Organizational Computing.",
            "Agent Based Data Storage and Distribution in Data Warehouses.",
            "Experimental Analysis of the Effects of Agent Synchronization in Asynchronous Search Algorithms.",
            "Intelligent Positioning and Optimal Diversity Schemes for Mobile Agents in Ubiquitous Networks.",
            "Verification of the Mobile Agent Network Simulator - a Tool for Simulating Multi-Agent Systems.",
            "Model Checking of Component Based Software Using Compositional Reductions.",
            "A Tool Based on DL for UML Model Consistency Checking.",
            "Verification of Dataflow Scheduling.",
            "Optimizing Reflective Primitives of Dynamic Languages.",
            "A New Approach to Verify Statechart Specifications for Reactive Systems.",
            "Reachability Graph-Based Test Sequence Generation for Concurrent Programs.",
            "An XML Based Methodology to Model and Use Scenarios in the Software Development Process.",
            "Supporting Formal Verification of DIMA Multi-Agents Models: towards a Framework Based on Maude Model Checking.",
            "My Architecture: a Knowledge Representation Meta-Model for Software Architecture.",
            "A Transformation-Based Approach to Application Model Development: Class Diagram Generation.",
            "Empirical Evaluation and Validation of Interface Complexity Metrics for Software Components.",
            "A Quantitative-Based Comparison of MaSE and OPM/MAS Design Results.",
            "Improving Software Reliability Modeling Using Machine Learning Techniques.",
            "State-Based Composition in UML 2.",
            "A Review Approach to Detecting Violations of Consistency between Specification and Program Structures.",
            "Applying Association Mining to Change Propagation.",
            "Software Reusability Model for Procedure Based Domain-Specific Software Components.",
            "A High-Efficiency Knowledge Management System Based on Habitual Domains and Intelligent Agents.",
            "The Application-Based Domain Analysis Approach and its Object-Process Methodology Implementation."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2007",
        "info": "Volume 17, 2007",
        "count": 43,
        "papers": [
            "Guest Editors' Introduction.",
            "Specification and Verification of Workflows with Rbac Mechanism and Sod Constraints.",
            "Systematic Functional Decomposition in a Product Line Using Aspect-oriented Software Development: a Case Study.",
            "Automatic Failure Analysis Using Safecharts.",
            "Systematic Construction of I* Strategic Dependency Models for Socio-technical Systems.",
            "Generating Properties for Runtime Monitoring from Software Specification Patterns.",
            "Performance Evaluation of Imputation Methods for Incomplete Datasets.",
            "Detecting Fault Modules Using Bioinformatics Techniques.",
            "Guest Editors: Introduction.",
            "The Radar Architecture for Personal Cognitive Assistance.",
            "User Profiling in the Chronobot/Virtual Classroom System.",
            "A Model-Based Design-for-Verification Approach to Checking for Deadlock in Multi-Threaded Applications.",
            "An Empirical Analysis of the Open Source Development Process Based on Mining of Source Code Repositories.",
            "Abstract Logic Tree Based Framework for Component Based Solution Composition Design and Execution.",
            "From Hippocratic Databases to Secure Tropos: a Computer-Aided Re-Engineering Approach.",
            "Secure Tropos: a Security-Oriented Extension of the Tropos Methodology.",
            "Guest Editors' Introduction.",
            "A Flexible Strategy for Embedding and Configuring Run-Time Contract Checks in .Net Components.",
            "Automating Functional Testing of Components from UML Specifications.",
            "Improving Class Firewall Regression Test Selection by Removing the Class Firewall.",
            "A Framework for Statistical Testing of Software Components.",
            "An Ontology for Understanding and Applying Object-Oriented Design Knowledge.",
            "Design Optimization Metrics for UML Based Object-Oriented Systems.",
            "Guest Editors' Introduction.",
            "Composite Algorithms in Image Content Searches.",
            "Assessment of Linux' Data Path Implementations for Download and Streaming.",
            "Protect Virtual Property in Online Gaming System.",
            "Rbs: a Robust Bimodal System for Face Recognition.",
            "A Pattern Framework for Software Quality Assessment and Tradeoff Analysis.",
            "A Pilot Study of Productive versus Nonproductive Knowledge Acquisition in Embedded Software Development.",
            "Ic Card: Visual Specification for Rapid Prototyping of Time-Critical Applications.",
            "Xml Schema Matching.",
            "Software Architecture Decomposition Using Attributes.",
            "Formal Specification Approach of Role Dynamics in Agent Organisations: Application to the Satisfaction-Altruism Model.",
            "On the Software and Knowledge Engineering Aspects of the Educational Process.",
            "It-Outsourcing and IT-Offshoring: Trends and Impacts on SE/KE Curricula.",
            "Guest Editors' Introduction.",
            "A Statistical Methodology to Simplify Software Metric Models Constructed Using Incomplete Data Samples.",
            "A Translator of Software Architecture Design from SAM to Java.",
            "Towards Automatic Testing of Imaging Software by Means of Random and Metamorphic Testing.",
            "CrÈme: an Automatic Invariant Prover of Behavioral Specifications.",
            "On Favourable Conditions for Adaptive Random Testing.",
            "A Survey of Existing Requirements Engineering Technologies and their Coverage."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2006",
        "info": "Volume 16, 2006",
        "count": 42,
        "papers": [
            "Guest Editors' Introduction.",
            "Visualizing the Evolution of Software Using Softchange.",
            "Understanding the Evolution and Co-evolution of Classes in Object-oriented Systems.",
            "Detecting Noisy Instances with the Ensemble Filter: a Study in Software Quality Estimation.",
            "Analysis of Meta-programs: an Example.",
            "Level-wise Construction of Decision Trees for Classification.",
            "A Comparison of Effort Estimation Methods for 4gl Programs: Experiences with Statistics and Data Mining.",
            "An Integrity Checking Mechanism of Mobile Agents under a Closed Environment with Trusted Hosts.",
            "Formal Verification of Bundle Authentication Mechanism in Osgi Service Platform: Ban Logic.",
            "Generalization and Instantiation for Component Reuse.",
            "Translating Relational Schema with Constraints into Xml Schema.",
            "A Grammar-guided Genetic Programming Framework Configured for Data Mining and Software Testing.",
            "Using Genetic Algorithms and Decision Tree Induction to Classify Software Failures.",
            "How Distribution Affects the Success of Pair Programming.",
            "Guest Editors' Introduction.",
            "Join Point Designation Diagrams: a Graphical Representation of Join Point Selections.",
            "Modeling and Analysis of Performance Aspects for Software Architecture: a Uml-based Approach.",
            "Composition of Aspects Based on a Relation Model: Synergy of Multiple Paradigms.",
            "Weaving Deployment Aspects into Domain-specific Models.",
            "Variability Design Techniques for Enhancing Component Reusability.",
            "Modeling Secure Systems Using an Agent-oriented Approach and Security Patterns.",
            "Towards Automatic Establishment of Model Dependencies Using Formal Concept Analysis.",
            "A Repository for Component-based Embedded Software Development.",
            "Restricted Random Testing: Adaptive Random Testing by Exclusion.",
            "A Tool to Automatically Map Implementation-based Testing Techniques to Classes.",
            "A Laboratory for Prototyping and Testing Multimedia Presentations.",
            "Conceptual Model of the Physical Structure of Manufacturing Systems.",
            "Guest Editors' Introduction.",
            "Cost Simulation and Performance Optimization of Web-based Applications on Mobile Channels.",
            "Integration Testing of Context-sensitive Middleware-based Applications: a Metamorphic Approach.",
            "Action Machines: a Framework for Encoding and Composing Partial Behaviors.",
            "Model-based Testing of Concurrent Programs with Predicate Sequencing Constraints.",
            "Slicing Execution for Model Checking C Programs.",
            "A Framework for the Pragmatic Quality of Z Specifications.",
            "Guest Editors' Introduction.",
            "Aligning Software Project Decisions: a Case Study.",
            "Hierarchical Cumulative Voting (hcv) - Prioritization of Requirements in Hierarchies.",
            "Building Decision Support Problem Domain Ontology from Natural Language Requirements for Software Assurance.",
            "Case Studies in Process Improvement through Retrospective Analysis of Release Planning Decisions.",
            "Icrad: an Integrated Process for the Solution of Requirements Conflicts and Architectural Design.",
            "Bringing the Agile Philosophy to Formal Specification Settings.",
            "A Framework for the Evaluation of Real-time Specification Techniques."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2005",
        "info": "Volume 15, 2005",
        "count": 78,
        "papers": [
            "A Survey Of Xml Applications On Science And Technology.",
            "Analyzing Dynamic Behavior Of Large-Scale Systems Through Model Transformation.",
            "A Generic Formal Framework For Constructing Agent Interaction Protocols.",
            "Filmification Of Methods And An Example Of Its Applications.",
            "Similarity Of Xml-Schema Elements Supported By Domain Ontologies.",
            "Towards Pervasive Robotics: Compliant Motion in Human Environments.",
            "Modeling and Motion Control of Robotic Hand for Telemanipulation Application.",
            "Design Analysis of The Propulsion and Control System of an Underactuated Remotely Operated Vehicle Using Axiomatic Design Theory - Part 1.",
            "Design Analysis of the Propulsion and Control System of an Underactuated Remotely Operated Vehicle Using Axiomatic Design Theory - Part 2.",
            "Mobile Computing with Personal Area Network and Human Power Generation.",
            "Sleep Monitoring Devices Using Electric Field (E-Field) Mattress for Children with Eczema.",
            "Smart Shirt That Can Call for Help After A Fall.",
            "Lilliputian Hardware Platform For Scientific Applications.",
            "The Development of an Embedded, Integrated Ins/Gps System.",
            "Pda Based Human Motion Recognition System.",
            "Multi-Channel Biotelemetry System Using Microcontroller with Uhf Transmit Function.",
            "Ltcc Technology For Photonic and Millimeter Wave Module Integration.",
            "Dynamic Behaviors of High-G Mems Accelerometer Incorporated with Novel Micro-Flexures.",
            "Theoretical Analysis and Experiment of A Novel Dep Chip With 3-D Silicon Electrodes.",
            "Modeling and Analysis of Nanotips for Thermoelectric Coolers.",
            "Model and Application of Impact Wave in Measuring Dynamic Characteristic of Microstructure.",
            "Control-Oriented Modeling of 2d Torsional Micromirror.",
            "A New Approach in Designing Interprocess Communication for Real-Time Systems.",
            "An Evolvable Operating System for Wireless Sensor Networks.",
            "Design of Seamless Protocol Switching Layer for Voice Over Internet Protocol (Voip) That Switches Between Bluetooth and Ieee 802.11.",
            "An Embedded System to Support Tele-Medical Activity.",
            "Predictive Traces in Hybrid Systems.",
            "Case Studies in The Hybrid Process Algebra Hypa.",
            "Verification of Embedded Supervisory Controllers Considering Hybrid Plant Dynamics.",
            "Dsp-Based Motion Control of a Non-Commutated Dc Linear Motor Module.",
            "Microcontroller Based Light Control.",
            "The Rapid Development of A Closed-Loop Control System.",
            "Hw/Sw Co-Design for Low Power Arithmetic and Logic Units.",
            "An Evaluation of Model-Based Software Synthesis from Simulink Models for Embedded Video Applications.",
            "Combining Modelica Models with Discrete Event Formalisms for Simulation Using the Des/M Environmentc.",
            "Madd Operation Aware Redundancy Elimination.",
            "Extendable and Dynamically Reconfigurable Multi-Protocol Firewall.",
            "Formal Designs for Embedded and Hybrid Systems.",
            "Efficient State-Saving Architectures for Power-Mode Switching.",
            "Formal Models in Industry Standard Tools: an Argos Block within Simulink.",
            "A Reachability-Based Technique for Idle Speed Control Synthesis.",
            "A New Model for Heterogeneous Embedded Systems - What Esterel and SyncCharts Need to Become a Suitable Specification Platform.",
            "Design of 3-Valued R-S & D Flip-Flops Based on Simple Ternary Gates.",
            "Method Of Interaction In A Modular Architecture For Sensor Systems (Mass).",
            "High Performance Mac Unit Using Modified Sign Extension Algorithm and A New High-Speed Alu in Dsp-Core.",
            "Multi-Key Index for Distributed Database System.",
            "High-Speed Rt Monitoring System Using Neural Networks.",
            "A Hybrid Elastic Net Method for Solving the Traveling Salesman Problem.",
            "Pareto Simulated Annealing (Sa)-Based Multi-Objective Optimization for Mems Design and Application.",
            "Device-Centric Low-Power Scheduling for Real-Time Embedded Systems.",
            "Global Optimization Of Linear Hybrid Systems With Varying Time Events.",
            "Guest Editors' Introduction.",
            "Ubic2 - Towards Ubiquitous Bio-Information Computing: Data Protocols, Middleware, and Web Services for Heterogeneous Biological Information Integration and Retrieval.",
            "A Language-Based Approach for Comprehensively Supporting the In Silico Experimental Process.",
            "Genewebex: Gene Annotation Web Extraction, Aggregation, and Updating From Web-Interfaced Biomolecular Databanks.",
            "A Fast Protein Structure Retrieval System Using Image-Based Distance Matrices and Multidimensional Index.",
            "Semantic Analysis and Synthesis of Complex Biological Systems.",
            "A Software Architecture for Finding Motifs Using Genetic Algorithm.",
            "The Technique of Business Model Driven Analysis and Test Design for Development of Web Applications.",
            "Arifs Methodology Reusing Incomplete Models at the Requirements Specification Stage.",
            "A Data Mining Application Analysis of Problems Occurring during a Software Project Development Process.",
            "Using Cultural Algorithms to re-engineer Large-scale Semantic Networks.",
            "A Bayesian Network Approach to Rational Architectural Design.",
            "A Security Based Model for Mobile Agent Software Systems.",
            "Guest Editors' Introduction.",
            "A Framework for Comparing Requirements Tracing Experiments.",
            "Supporting Software Understanding with Automated Requirements Traceability.",
            "Recovery of Traceability Links between Software Documentation and Source Code.",
            "Retrieval by Construction: a Traceability Technique to Support Verification and Validation of Uml Formalizations.",
            "Formal Method for Automated Transformation of Lotos Specifications to Estelle Specifications.",
            "The Viability of Fuzzy Logic Modeling in Software Development Effort Estimation: Opinions and Expectations of Project Managers.",
            "Guest Editor's Introduction.",
            "Understanding and Communicating It Security Specifications with Uml.",
            "\"cyber-film\": a Visual Approach that Facilitates Program Comprehension.",
            "Document-oriented Development of Content-intensive Applications.",
            "Rapid Construction of Software Comprehension Tools.",
            "Programming Style Based Program Partition.",
            "A Decision-making Specification Language for Verifiable User-interface Adaptation Logic."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2004",
        "info": "Volume 14, 2004",
        "count": 32,
        "papers": [
            "Guest Editor'S Introduction.",
            "Tagging Knowledge Acquisition Sessions To Facilitate Knowledge Traceability.",
            "Supporting Elicitation And Specification Of Software Properties Through Patterns And Composite Propositions.",
            "A Systematic Design Method For High Quality Process-Control Systems Development.",
            "Coo-Flow: A Process Technology To Support Cooperative Processes.",
            "Peer-To-Peer Information Workspaces In Infotop.",
            "Customizing Component-Based Software Using Component Coordination Model: A Use-Context Driven Approach Toward Role-Based Model.",
            "Evidential Diagnosis Of Inconsistencies In Object-Oriented Designs.",
            "The Dynamical Models For Software Technology Transition.",
            "Design Level Hypothesis Testing Through Reverse Engineering Of Object-Oriented Software.",
            "A Domain Analysis And Modeling Methodology For Component Development.",
            "Redesigning Legacy Systems Into The Object-Oriented Paradigm.",
            "Design Of Object Model Reuse System By Cbr In System Analysis.",
            "Association-Based Information Flow Control In Object-Oriented Systems.",
            "An Ontology For The Management Of Software Maintenance Projects.",
            "What Will Affect Software Reuse: A Causal Model Analysis.",
            "Guest Editors' Introduction.",
            "Using Data Mining For Automated Software Testing.",
            "Software Warehouse: Its Design, Management And Application.",
            "Data Mining For Validation In Software Engineering: An Example.",
            "Application Of Clustering Techniques To Software Component Architecture Design.",
            "Identifying Software Component Association With Genetic Algorithm.",
            "Expressing Product Diversification -- Categorizing And Classifying Variability In Software Product Family Engineering.",
            "Constraint Propagation And Progressive Verification For Component-Based Process Model.",
            "An Rpcl-Based Indexing Approach For Software Component Classification.",
            "Intelligent Semantic Concept Mapping For Semantic Query Rewriting/Optimization In Ontology-Based Information Integration System.",
            "Guest Editors' Introduction.",
            "Hsgs: An Interactive System For High-Level Specification And Generation Of Hypermedia Presentations.",
            "Conceptualization, Prototyping And Process Of Hypermedia Applications.",
            "From Knowledge Modeling To Ontology Construction.",
            "Language-Driven System Design.",
            "Data Mining For The Management Of Software Development Process."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2003",
        "info": "Volume 13, 2003",
        "count": 33,
        "papers": [
            "Visualizing Animation Databases.",
            "On-Line Visualization and Navigation of the Global Web Structure.",
            "Automated Requirements Elicitation: Combining a Model-Driven Approach with Concept Reuse.",
            "A Visual System Supporting Software Reuse in the Banking Legacy System Context.",
            "Modeling and Analyzing Multi-Agent Behaviors Using Predicate/Transition Nets.",
            "Softarch: Tool Support for Integrated Software Architecture Development.",
            "A Business Process Centered Software Analysis Method.",
            "A Tool for Creating Design Models from Web Site Code.",
            "A Layered Metamodel for Hierarchical Modeling in UML.",
            "Etifis: An Innovative e-Forecasting Web Application.",
            "An XML Definition Language to Support Scenario-Based Requirements Engineering.",
            "Concurrent Data Materialization for Object-Relational Database with Semantic Metadata.",
            "Knowledge and Case-Based Reasoning for Customization of Software Processes - A Hybrid Approach.",
            "Adding Flexibility in Information Flow Control for Object-Oriented Systems Using Versions.",
            "Apply Market Mechanism to Agent-Based Grid Resource Management.",
            "Guest Editors' Introduction.",
            "Trade-off Analysis for Requirements Selection.",
            "The Role of Middleware in Architecture-Based Software Development.",
            "Towards Industrially Relevant Fault-Proneness Models.",
            "Template-Based Generation of Multimedia Presentations.",
            "A Service Architecture for Mobile Teamwork.",
            "Guest Editor's Introduction.",
            "Investigating Conflicts in Cots Decision-Making.",
            "Software Product and Process Assessment through Profile-Based Evaluation.",
            "Supporting Software Process Decisions Using Bi-Directional Simulation.",
            "Supporting Decision-Making in Software Engineering with Process Simulation and Empirical Studies.",
            "A Quality-Driven Decision-Support Method for Identifying Software Architecture Candidates.",
            "Guest Editor'S Introduction.",
            "Model-Based Clustering In Gene Expression Microarrays: An Application To Breast Cancer Data.",
            "Data Mining For Gene Expression Profiles From Dna Microarray.",
            "A Tool For Analyzing Magnetoencephalography-Data Based On Different Artificial Neural Networks.",
            "A Procedure To Translate Paradigm Specifications To Propositional Linear Temporal Logic And Its Application To Verification.",
            "Towards The Algebraic Analysis Of Hyperlink Structures."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2002",
        "info": "Volume 12, 2002",
        "count": 31,
        "papers": [
            "Binary Encoding of Discernibility Patterns to Find Minimal Coverings.",
            "Use Case Patterns.",
            "A Compositional Knowledge Level Process Model of Requirements Engineering.",
            "Evaluating Theories for Managing Imperfect Knowledge in Human-Centric Database Reengineering Environments.",
            "Guest Editors' Introduction: Special Issue on Embedded Software Engineering.",
            "Component-Based Embedded Software Engineering: Development Framework, Quality Assurance and a Generic Assessment Environment.",
            "Development of Wireless Embedded Systems Using Component Based Software.",
            "From Scenarios to Hierarchical Broadcasting Software Architectures Using UML-RT.",
            "Automated Generation of Test Trajectories for Embedded Flight Control Systems.",
            "Predicting Fault-Prone Modules in Embedded Systems Using Analogy-Based Classification Models.",
            "A Software Test and Evaluation Environment Based on Longitudinal Database.",
            "A Formal Framework to Support Workflow Adaptation.",
            "Test Agent System.",
            "Association Analysis of Software Measures.",
            "A Feature-Oriented Copyright Owner Proving Technique for Still Images.",
            "A Hierarchical Measurement Framework for the Evaluation of Automated Business Processes.",
            "An Object-Based Approach to Managing Domain Specific Thesauri: Semiautomatic Thesaurus Construction and Query-Based Browsing.",
            "A Survey of Case Studies of the Use of Knowledge Management in Software Engineering.",
            "Relational Deductive Object-Oriented Modeling (RDOOM) Approach for Finding, Representing and Integrating Application-Specific Concepts.",
            "Component Contract-Based Interface Specification Technique Using Z.",
            "A Multimedia Model Based on Structured Media and Sub-Elements for Complex Multimedia Authoring and Presentation.",
            "HEAT: Hierarchical Entropy Approach for Texture Indexing in Image Databases.",
            "A Methodology for Modeling Multimedia Databases.",
            "ProActNet: Modeling Processes Through Activity Networks.",
            "A Synthesis of Evaluation Criteria for Software Specifications and Specification Techniques.",
            "Supporting Agent-Oriented Modelling with UML.",
            "A Methodology for Modeling Interactions in Cooperative Information Systems Using Coloured Petri Nets.",
            "Defect Detection for Executable Specifications - An Experiment.",
            "What Information is Relevant When Selecting Software Testing Techniques?",
            "Bayesian-Learning Based Guidelines to Determine Equivalent Mutants.",
            "Automatic Test Data Generation for Program Paths Using Genetic Algorithms."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2001",
        "info": "Volume 11, 2001",
        "count": 36,
        "papers": [
            "Internet Multimedia Computing - Guest Editors' Introduction.",
            "Self-Explanatory Components: A New Programming Paradigm.",
            "Towards a Natural Internet-Based Collaborative Environment with Support of Object Physical and Social Characteristics.",
            "EVCS - A Complete Electronic Virtual Conference System.",
            "Middleware for Building Adaptive Migratory Continuous Media Applications.",
            "Quality Software - Guest Editor's Introduction.",
            "A Study on a Path-based Strategy for Selecting Black-box Generated Test Cases.",
            "A Constraint Solver and Its Application to Path Feasibility Analysis.",
            "An Object-based Data Flow Testing Approach for Web Applications.",
            "Component-based Verification in a Synchronous Setting.",
            "Agent-Based Software Engineering - Guest Editors' Introduction.",
            "Agent UML: A Formalism for Specifying Multiagent Software Systems.",
            "Multiagent Systems Engineering.",
            "Interaction-Oriented Software Development.",
            "Roles in Agent-Oriented Modeling.",
            "Organisational Rules as an Abstraction for the Analysis and Design of Multi-Agent Systems.",
            "Translating OODB Method to RDB Routine.",
            "Incremental Scenario Modeling Using Hierarchical Object-Oriented Petri Net.",
            "Software Architecture - Guest Editors' Introduction.",
            "Malleable Services.",
            "Software Resource Architecture.",
            "Architecture-Level Dependence Analysis for Software Systems.",
            "Viewpoints on Modifiability.",
            "Applying Case-Based Reasoning to Support Dynamic Framework Documentation.",
            "Guest Editors' Introduction: Agentization and Coordination.",
            "A Dynamic Inference Model for Intelligent Agents.",
            "SLABS: A Formal Specification Language for Agent-Based Systems.",
            "Deliberative Evolution in Multi-Agent Systems.",
            "A Quantitative and Qualitative Comparison of Distributed Information Processing Using Mobile Agents Realised in RMI and Voyager.",
            "An Optimistic Third Party Protocol to Protect a Mobile Agent's Binary Code.",
            "High Performance Service Discovery in Large-Scale Multi-Agent and Mobile-Agent Systems.",
            "Formalization of Object Behavior and Interactions from UML Models.",
            "Towards a Unified Version Model Using the Resource Description Framework (RDF).",
            "A Metric-Based Approach for Predicting Conceptual Data Models Maintainability.",
            "Preventing Mismatch of Homogeneous Components in the Design of Software Architecture.",
            "Processes and Products in a Multi-Level Metamodeling Architecture."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "2000",
        "info": "Volume 10, 2000",
        "count": 36,
        "papers": [
            "Guest Editors' Introduction - Best Papers from SEKE'98.",
            "Formalizing the Functional Model within Object-Oriented Design.",
            "Planning Support to Software Process Evolution.",
            "Formal Support for an Informal Business Modelling Method.",
            "Specification of Software Architecture.",
            "An Approach to Quantitative Software Architecture Sensitivity Analysis.",
            "Using Fuzzy Reasoning to Support Automated Program Understanding.",
            "Case-Based Software Quality Prediction.",
            "Creating Tools in a Software Environment Based on Graph Rewriting Rules.",
            "Test Scenario Generation Based on Formal Specification and Usage Profile.",
            "Constructing Flow-Based Tools with Generative and Compositional Techniques.",
            "From Software Reuse to Database Reuse.",
            "Verifying Requirements Through Mathematical Modelling and Animation.",
            "Integrated Software Engineering and Knowledge Engineering Teaching Experiences.",
            "Knowledge Engineering of a Monitoring and Control Decision Support System.",
            "Supporting Distributed Individual Tasks in Cooperative Specification Development.",
            "Distributed Information and Control in a Concurrent Hypermedia-Oriented Architecture.",
            "Guest Editor's Introduction: 11th International Conference on Software Engineering and Knowledge Engineering (SEKE'99).",
            "Formal Specification and Prototyping of Multimedia Applications.",
            "Specifying Software Architectural Connectors in SAM.",
            "Using Incremental Planning to Foster Application Framework Reuse.",
            "Uml as Domain Specific Language for the Construction of Knowledge-Based Configuration Systems.",
            "Object Modeling to Re-Engineer Legacy Systems.",
            "Knowledge Acquisition and Process Guidance for Building System Dynamics Simulation Models: an Experience Report from Software Industry.",
            "Distributed Process Planning Support with MILOS.",
            "Issues and Models in Software Product Lines.",
            "From Software Experience Databases to Learning Organizations.",
            "Issues with Meta-Knowledge.",
            "Multiple Views Analysis of Software Designs.",
            "A Metric for the Size Estimation of Object-Oriented Graphical User Interfaces.",
            "Production and Maintenance of Goal-Oriented Software Measurement Models.",
            "A Design Rationale Based Environment for Cooperative Maintenance.",
            "An Integrated Classification-Tree Methodology for Test Case Generation.",
            "An Infrastructure for Engineering Cooperative Agents.",
            "Multi-Perspective Specification, Design and Implementation of Software Components Using Aspects.",
            "Performance Analysis of Traffic Control Systems Based upon Stochastic Timed Petri Net Models."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1999",
        "info": "Volume 9, 1999",
        "count": 35,
        "papers": [
            "An Incremental Object-Oriented Migration Strategy for RPG Legacy Systems.",
            "A Framework for Object-Oriented Reverse Engineering of Legacy Information Systems.",
            "Using the Web for Software Annotations.",
            "An Approach to Automated Building of Software System Configurations.",
            "Protocol Specification Design Using an Object-Based Petri Net Formalism.",
            "An Automated Tool (IDAF) to Manipulate Interaction Diagrams and Fragmentations for Multi-Agent Systems.",
            "Analytical Partition of Software Components for Evolvable and Reliable MEMS Design Tools.",
            "A Firewalling Scheme for Securing MPOA-Based Enterprise Networks.",
            "The Design and Implementation of a Customizable Fault Tolerance Framework.",
            "An Incremental Verification Algorithm for Real-Time Systems.",
            "Using Classification Trees for Software Quality Models: Lessons Learned.",
            "Specifying and Verifying Temporal Behavior of High Assurance Systems Using Reachability Tree Logic.",
            "Real-Time Object-Oriented Distributed Software Engineering and the TMO Scheme.",
            "SOORLS: A Software Reuse Approach on the Web.",
            "Reusable Knowledge-Based Components for Building Software Applications: A Knowledge Modelling Approach.",
            "Knowledge and Experience Reuse Through Communication Among Competent (Peer) Agents.",
            "Advanced Conceptual Clustering and Associated Querying Facilities in Object-Oriented Databases.",
            "A Frame Model Approach for Expert and Database System Integration.",
            "Visual Programming for Message-Passing Systems.",
            "Visual Specification and Monitoring of Software Agents in Decentralized Process-Centred Environments.",
            "Genereation of Object-Oriented Software Process Using Milestones.",
            "Grammatical Inference for the Automatic Generation of Visual Languages.",
            "Mining for Program Structure.",
            "Automatically Exploring Hypotheses About Fault Prediction: A Comparative Study of Inductive Logic Programming Methods.",
            "Data Mining for Predictors of Software Quality.",
            "An Investigation on the Use of Machine Learned Models for Estimating Software Correctability.",
            "Empirical Investigation of Innovation Diffusion in a Software Process.",
            "Maintaining Shared Workspaces Consistency during Software Development.",
            "Adding Form to Real-Time System Specification and Simulation.",
            "Process Model Applicable to Software Engineering and Knowledge Engineering.",
            "Engineering via Discourse: Content Structure as an Essential Component for Multimedia Documents.",
            "Situation-Dependent Metaphor for Personal Multimedia Information.",
            "Designing Hypermedia Applications with Objects and Patterns.",
            "Specification of Multimedia Software Systems Using an Object Oriented Architecture Description Language.",
            "Industry Practices in Project Management for Multimedia Information Systems."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1998",
        "info": "Volume 8, 1998",
        "count": 28,
        "papers": [
            "Guest Editors' Introduction.",
            "An Evaluation of Knowledge Engineering Approaches to the Maintenance of Evolutionary Software.",
            "The Design of an Expert System for Domain Knowledge Engineering and Decision Making: A Case Study in the Criminal Justice System.",
            "REINAS: A Real-Time System for Managing Environmental Data.",
            "Distributed Systems Management Software-in-the-Loop.",
            "Scientific Data Mining: A Case Study.",
            "A Fast 3-D Visualization Methodology Using Characteristic Views of Objects.",
            "A Large Memory Storage and Retrieval Neural Network for Adaptive Retrieval and Diagnosis.",
            "An Active Multimedia Information System for Information Retrieval, Discovery and Fusion.",
            "Metrics for Concept-Oriented Knowledge Bases.",
            "Deriving Identity from Extensionality.",
            "Task Analysis and Design Plans in Formal Specification Design.",
            "A Formal Definition of FRSM and Applications.",
            "A Formal Methodology for Analyzing Tradeoffs of Imprecise Requirements.",
            "Guest Editors' Introduction.",
            "A Quality of Service Framework for Object-Oriented Architectures.",
            "An Approach for Adaptive Fault Tolerance in Object-Oriented Open Distributed Systems.",
            "Incremental Verification of Architecture Specification Language for Real-Time Systems.",
            "Sequence Specification for Concurrent Object-Oriented Applications.",
            "The Role of Nonmonotonic Representations in Requirements Engineering.",
            "Matching Single-Sort Algebraic Specifications for Software Reuse.",
            "Guest Editor's Introduction.",
            "Enhancing CASE Environments by Using Linguistics.",
            "Results of the Application of a Linguistic Approach to Object-Oriented Analysis.",
            "Organizing the Software Development Process Knowledge: An Approach Based on Patterns.",
            "Software Configuration Management for a Reusable Software Library within a Software Maintenance Environment.",
            "ISF: A Visual Formalism for Specifying Interconnection Styles for Software Design.",
            "An Object-Oriented Design Complexity Metric Based on Inheritance Relationships."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1997",
        "info": "Volume 7, 1997",
        "count": 29,
        "papers": [
            "Formal Requirements and Design Specifications: The Clepsydra Methodology.",
            "Data Flow Analysis of System Specifications in Lotos.",
            "Writing and Analyzing System Specifications by Integrated Linguistic Tools.",
            "Specifying Active Database Systems in an Object-Oriented Framework.",
            "Integration Object-Oriented Software Testing and Metrics.",
            "Transforming an HCI Model to a Software Design Model.",
            "Guest Editors' Introduction.",
            "A New Framework for Improving Software Development Process on Small Computer Systems.",
            "Enriching Software Process Support by Knowledge-Based Techniques.",
            "Guest Editors' Introduction.",
            "Method of Cumulative Sums and Problems of Optimal Control by Technological Processes.",
            "Knowledge Aspects of Resource Allocation Problems with Saturation.",
            "The Stabilization Problem for Certain Class of Ecological Systems.",
            "An Experience with the Use of Systems Engineer Case Tool.",
            "Guest Editors' Introduction.",
            "Multimedia Technologies in Japan: General Status and Future Trends.",
            "Knowledge-Assisted Retrieval of Spatiotemporal Content in Multimedia Databases.",
            "A Survey of Access Methods for Image Data.",
            "An Efficient Conflict-Resolution Approach to Support Read/Write Operations in a Video Server.",
            "A Framework for Multi-Agent Systems with Multi-Modal User Interfaces in Distributed Computing Environments.",
            "User Control and Dynamic Reorganization of Multimedia Presentations During Playout.",
            "Guest Editors' Introduction.",
            "Application of Graph Grammars in an Educational Software Engineering Game: A Case Study in Pragmatic Adoption.",
            "Graph-Based Software Process Management.",
            "A Combined Reference Model- and View-Based Approach to System Specification.",
            "Nested Graph Transformation Units.",
            "A Formal Object Specification Technique Integrating Object and Functional Model.",
            "Generating an Algebraic Specification from an ER-Model.",
            "Managing Software Projects by Structured Project Planning."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1996",
        "info": "Volume 6, 1996",
        "count": 30,
        "papers": [
            "Guest Editor's Introduction.",
            "Animating LOTOS Specifications Using Amlog.",
            "Specifying Industrial Real-Time Systems with a Temporal Logic Framework.",
            "On the Animation of \"not Executable\" Specifications by Prolog.",
            "Towards a Theory of Elaboration Tolerance: Logic Programming Approach.",
            "Representing COBOL in Prolog - towards Program Comprehension and Reengineering.",
            "The Impact of Intelligent Tools on Simulation Methodology.",
            "Software Engineering Practices and Tools for Real-Time Systems (Part I): Guest Editor's Introduction.",
            "Perts: a Prototyping Environment for Real-Time Systems.",
            "A Software Engineering Design Tool for Modeling Hard Real-Time Performance.",
            "Domain-Specific Software Architectures for Guidance, Navigation and Control.",
            "Specification and Analysis of Real-Time Systems Using CSP and Petri Nets.",
            "The Chimera Methodology: Designing Dynamically Reconfigurable and Reusable Real-Time Software Using Port-Based Objects.",
            "A Framework for Method Evolution and Behavior Consistency in Object-Oriented Databases.",
            "Reverse Engineering Graphical Representations of X Source Code.",
            "Software Engineering Practices and Tools for Real-Time Systems (Part II): Guest Editor's Introduction.",
            "A Development Environment for Hard Real-Time Applications.",
            "A System for Visualizing and Debugging Distributed Real-Time Systems with Monitoring Support.",
            "A Methodology and Support Tools for Analysis of Real-Time Specifications.",
            "Modeling and Developing Real-Time Concurrent Applications.",
            "Object Oriented Design, Modular Analysis, and Fault-Tolerance of Real-Time Control Software Systems.",
            "Using Domain Knowledge to Improve Reverse Engineering.",
            "Object Extensions to Z: a Survey.",
            "Reverse Engineering of Computer-Based Control Systems.",
            "A Graph-Based System for Managing Configurations of Engineering Design Documents.",
            "A Performance Evaluation of Heuristics-Based Test Case Generation Methods for Software Branch Coverage.",
            "Parforman - an Assertion Language for Specifying Behavior when Debugging Parallel Applications.",
            "A Knowledge-Assisted Approach to Parameterized Reuse.",
            "Eliminating Redundancy, Conflict, and Incompleteness from Knowledge-Based Systems.",
            "Designing Knowledge-Base Tools for Program Comprehension: a Comparison of EDATS & IMCA."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1995",
        "info": "Volume 5, 1995",
        "count": 31,
        "papers": [
            "Guest Editor's Introduction: Adding Pieces to the Software Evolution Puzzle.",
            "Multi-Valued Constant Propagation Analysis for User Interface Reengineering.",
            "Formal Methods to Aid the Evolution of Software.",
            "Iesem: Integrated Environment for Software Evolution Management.",
            "Automating Software Evolution.",
            "How to Combine Nonmonotonic Logic and Rapid Prototyping to Help Maintain Software.",
            "Applying Concept Formation Methods to Software Reuse.",
            "Advances in Network Information Discovery and Retrieval.",
            "Guest Editors Introduction: .",
            "Automatic Programming and Program Maintenance with Genetic Programming.",
            "An Evolutionary Approach to Program Transformation and Synthesis.",
            "Heuristic Organization and Domain Analysis of Software Repositories.",
            "An Evolution-Based Approach to Program Understanding Using Cultural Algorithms.",
            "A Functional Representation for Software Reuse and Design.",
            "Formal Transformational Program Developments Directed by Operational Properties Evaluations.",
            "Reverse Engineering, Reengineering, and Concurrent Engineering of Software.",
            "Guest Editor's Introduction.",
            "Generating Data Access Programs from PCTE Schemas with Constraints.",
            "Scalability for Graph-Based Case Tools.",
            "Cooad: a Case Tool for Object-Oriented Analysis and Design.",
            "When to Inherit and when not to.",
            "Parts: a Temporal Logic-Based Real-Time Software Specification Method Supporting Multiple Viewpoints.",
            "Towards an Open Software Conversion Architecture.",
            "Trends in Life-Cycle Models for SE and KE: Proposal for a Spiral-conical Life-Cycle Approach.",
            "Fact Updates in Logic Databases.",
            "Reachability Testing: an Approach to Testing Concurrent Software.",
            "Dynamic Evolution of Distributed Systems Specifications Using Reflective Language.",
            "An Adaptive User Navigation Mechanism and its Evaluation.",
            "Bootstrap: a Software Process Assessment and Improvement Methodology.",
            "Software Process Representation to Support Multiple Views.",
            "Cogito: a Methodology and System for Formal Software Development."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1994",
        "info": "Volume 4, 1994",
        "count": 27,
        "papers": [
            "Whorf: a Hypertext Tool for Software Maintenance.",
            "Matisse: a Knowledge-Based Team Programming Environment.",
            "Structured Design of a Knowledge-Based Message Dissemination System.",
            "Computer Simulation Software Reuse by Generic/Specific Domain Modeling Approach.",
            "Applying Conventional Unit Testing Techniques to Abstract Data Type Operations.",
            "Trends in Structure-Oriented Environments.",
            "Comparing Two Hybrid Expert System Shells.",
            "Safety-Critical Software: a Research Agenda.",
            "Facilitating the Maintenance of Safety-Critical Systems.",
            "Debugging Logic-Based Requirements Specifications for Safety-Critical Systems - a FRORL Approach.",
            "The FUNSOFT Net Approach to Software Process Management.",
            "Modularity and Correctness for Logic Programs and Knowledge Bases.",
            "A Formalism for Structured Planning of a Software Project.",
            "Reverse Engineering Guest Editor's Introductions.",
            "Reverse Engineering Distributed Applications: an Event Abstraction Tool.",
            "Supporting Queries on Source Code: a Formal Framework.",
            "Restructuring Programs through Program Slicing.",
            "Design of Redundant Formal Specifications by Logic Programming: Merging Formal Text and Good Comments.",
            "Semal: a Cost Language Based on the Calculus of Self-Modifiable Algorithms.",
            "Measurement Support in Software Engineering Environments.",
            "Executable Specification and Analysis for the Design of Concurrent Object-Oriented Systems.",
            "A Knowledge-Based Framework of Object-Oriented Software Development Environments.",
            "Software Process Monitoring Mechanisms in Oikos.",
            "Programmable Reverse Engineering.",
            "The Extensible Dependency Analysis Tool Set: a Knowledge Base for Understanding Industrial Software.",
            "Partial Evaluation for the Understanding of Fortran Programs.",
            "Using Mathematical Induction in Systematic Program Development."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1993",
        "info": "Volume 3, 1993",
        "count": 28,
        "papers": [
            "Enhancing the Software Life Cycle of Knowledge-Based Systems Using a Task-Based Specification Methodology.",
            "Specifications and Tools for Building Reliable Expert Systems.",
            "Rigorous Engineering Practice and Formal Reasoning of Deep Domain Knowledge - the Basis of Dependable Knowledge Based Systems for Process Plant Control.",
            "A Software Reliability Model for Artificial Intelligence Programs.",
            "A Knowledge-Based System for Correcting Users' Misconceptions in Database Retrieval.",
            "Meta-Environments for Software Production.",
            "Guest Editor's Introduction.",
            "Software Components for Object-Oriented Database Systems.",
            "Common Interface Models for Reusable Software.",
            "On Specification of Reusable Software Components.",
            "A Two-Level Metadata Dictionary Approach for Semantic Query Processing in Multidatabase Systems.",
            "The Frame Problem from an Engineering Perspective.",
            "Specification of Real-Time Systems.",
            "Ada Reusability and System Design Assessment Using the Data Binding Tool.",
            "Object-Oriented Analysis: Criteria and Case Study.",
            "A Framework for Modeling Software Engineering Processes.",
            "An Abstract, Shared and Persistent Data Structure for Supporting Database Management and Multilingual Natural Language Processing.",
            "Possible Effects of the Next Generation Programming Language on the Software Process Model.",
            "A Survey and Assessment of Software Process Representation Formalisms.",
            "Guest Editor's Introduction.",
            "Delta-Plan-Es - the Interactive System of Numerical Analysis of improper Linear Programs.",
            "The \"kvazar\" Package for Pattern Recognition and its Applications.",
            "Modeling under Local Structure Hypotheses.",
            "Determination of Solvability Boundaries of Optimization Problems in Parameter Space.",
            "Linear Programming Cutting Problems.",
            "The Universal Solutions of Interval Systems of Linear Algebraical Equations.",
            "The Program System for Solving Optimal Control Problems with Phase Constraints.",
            "CDL - a Component Description Language for Reuse."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1992",
        "info": "Volume 2, 1992",
        "count": 31,
        "papers": [
            "Guest Editors' Introduction.",
            "Transobj: Software Prototyping Environment for Real-Time Transaction-Based Software System Applications.",
            "Viewpoints: A Framework for Integrating Multiple Perspectives in System Development.",
            "Scaling up Rule-Based Software Development Environments.",
            "A Knowledge-Based Software Development Environment Supporting Cooperative Work.",
            "Reasoning Types and AI Programming Paradigms.",
            "Proving Properties of Rule-Based Systems.",
            "An Object-Oriented Software Requirements Analysis Method.",
            "Guest Editor's Introduction.",
            "Texpros: an Intelligent Document Processing System.",
            "Samea: Object-Oriented Software Maintenance Environment for Assembly Programs.",
            "Integrating User Interface Development and Modern Software Development.",
            "Project Management Utilizing an Advanced Case Environment.",
            "The Impact of undergraduate Software Engineering Education on Advancing Case Tools.",
            "On the Power of Query-Independent Compilation.",
            "Knowledge-Based Support for Requirements Engineering.",
            "The Evolution from Software Components to Domain Analysis.",
            "Constraint Propagation in Software Libraries of Transformation Systems.",
            "Implementing a Domain Model for Data Structures.",
            "Criteria for Comparing Reuse-Oriented Domain Analysis Approaches.",
            "On the Refinement of Logic Specifications.",
            "A Management Discipline of Software Metrics and the Software Quality Manager.",
            "Assessing Repository Technology: Where do We Go from Here?",
            "Book Review: \"software Engineering: a Holistic View\".",
            "Guest Editor's Introduction.",
            "Object-Oriented Analysis as Design: a Case Study.",
            "Using Automated Reasoning Techniques to Determine Software Reuse.",
            "Using ATMS to Efficiently Verify the Termination of Rewrite Rule Programs.",
            "Performance-Parameterized Reusable Software Components.",
            "An Efficient Test for the Validity of Unbiased Hybrid Knowledge Fragmentation in Distributed Databases.",
            "Expert Systems Implementation: Rules are Bad, Objects are Good."
        ]
    },
    {
        "name": "IJSEKE",
        "year": "1991",
        "info": "Volume 1, 1991",
        "count": 29,
        "papers": [
            "From Software Engineering to Knowledge Engineering: The Shape of the Software Industry in the 1990s.",
            "On Issues in Software Engineering and Artificial Intelligence.",
            "On the Development of a Method to Synthesize Programs from Requirements Specifications.",
            "Towards a Uniform Structured Representation for Application Generation.",
            "Access Control Strategies for Coordinating Teams of Software Engineers.",
            "A Tool for Constructing Interactive Software.",
            "Computer Aided Software Engineering: Facilitating the Path for True Software and Knowledge Engineering.",
            "Book Review: \"fundamentals of Computing for Software Engineers\", by Eric S. Chan and Murat M. Tanik.",
            "Guest Editor's Introduction: the Impact of Case on Software Development Processes.",
            "System Development as a Wicked Problem.",
            "The Role of Prototyping Languages in Case.",
            "Case and its Challenge for Change.",
            "The Organizational Impact of Integrating Multiple Tools.",
            "Assessing Proximity to Fruition: a Case Study of Phases in Case Technology Transfer.",
            "A Framework for the Modeling and Prototyping of Distributed Information Systems.",
            "An Inexact Reasoning Algorithm for Dealing with Inexact Knowledge.",
            "Integrating Process Description and Execution with an Object-Oriented Paradigm.",
            "Identifying Reusable Software Components by Induction.",
            "Understanding Software Productivity: towards a Knowledge-Based Approach.",
            "Book Review: \"tedium and the Software Process\", by Bruce I. Blum.",
            "Guest Editor's Introduction: Acquisition of Software Engineering Knowledge.",
            "Automatic, Rapid Generation of Design Prototypes from Logic Specifications.",
            "A Learning-Based Software Engineering Environment for Reusing Design Knowledge.",
            "Transforming Conjunctive Match into Rete: a Call-Graph Caching Approach.",
            "Guest Editor's Introduction: Induction Algorithms.",
            "On the Choice of the Best Test for Attribute Dependency in Programs for Learning from Examples.",
            "Incremental Learning of Production Rules from Examples under Uncertainty: a Rough Set Approach.",
            "Software Metrics in Software Engineering and Artificial Intelligence.",
            "Book Review: \"software Conflict: Essays on the Art and Science of Software Engineering\"."
        ]
    }
]