[
    {
        "year": "2021",
        "name": "36th ASE 2021",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2021",
                "sub_name": "36th IEEE/ACM International Conference on Automated Software Engineering, ASE 2021, Melbourne, Australia, November 15-19, 2021.",
                "count": 166,
                "papers": [
                    "Explainable AI for Software Engineering.",
                    "Tackling Flaky Tests: Understanding the Problem and Providing Practical Solutions.",
                    "Automating User Notice Generation for Smart Contract Functions.",
                    "End-to-End Automation of Feedback on Student Assembly Programs.",
                    "Is Historical Data an Appropriate Benchmark for Reviewer Recommendation Systems? : A Case Study of the Gerrit Community.",
                    "An Empirical Study of Bugs in WebAssembly Compilers.",
                    "Detecting TensorFlow Program Bugs in Real-World Industrial Environment.",
                    "Why Do Developers Remove Lambda Expressions in Java?",
                    "Context Debloating for Object-Sensitive Pointer Analysis.",
                    "Dynamic Generation of Python Bindings for HPC Kernels.",
                    "Testing Your Question Answering Software via Asking Recursively.",
                    "Improving Test Case Generation for REST APIs Through Hierarchical Clustering.",
                    "VizSmith: Automated Visualization Synthesis by Mining Data-Science Notebooks.",
                    "ISPY: Automatic Issue-Solution Pair Extraction from Community Live Chats.",
                    "EditSum: A Retrieve-and-Edit Framework for Source Code Summarization.",
                    "Interactive Cross-language Code Retrieval with Auto-Encoders.",
                    "Data-Driven Design and Evaluation of SMT Meta-Solving Strategies: Balancing Performance, Accuracy, and Cost.",
                    "Reducing Bug Triaging Confusion by Learning from Mistakes with a Bug Tossing Knowledge Graph.",
                    "ASE: A Value Set Decision Procedure for Symbolic Execution.",
                    "CorbFuzz: Checking Browser Security Policies with Fuzzing.",
                    "SMARTIAN: Enhancing Smart Contract Fuzzing with Static and Dynamic Data-Flow Analyses.",
                    "Restoring the Executability of Jupyter Notebooks by Automatic Upgrade of Deprecated APIs.",
                    "Adversarial Attacks to API Recommender Systems: Time to Wake Up and Smell the Coffeeƒ.",
                    "REPFINDER: Finding Replacements for Missing APIs in Library Update.",
                    "Targeting Requirements Violations of Autonomous Driving Systems by Dynamic Evolutionary Search.",
                    "On the Real-World Effectiveness of Static Bug Detectors at Finding Null Pointer Exceptions.",
                    "Subtle Bugs Everywhere: Generating Documentation for Data Wrangling Code.",
                    "Distribution Models for Falsification and Verification of DNNs.",
                    "SATune: A Study-Driven Auto-Tuning Approach for Configurable Software Verification Tools.",
                    "Efficient SMT-Based Model Checking for Signal Temporal Logic.",
                    "DeepMetis: Augmenting a Deep Learning Test Set to Increase its Mutation Score.",
                    "Efficient state synchronisation in model-based testing through reinforcement learning.",
                    "Faster Mutation Analysis with Fewer Processes and Smaller Overheads.",
                    "FRUGAL: Unlocking Semi-Supervised Learning for Software Analytics.",
                    "PyExplainer: Explaining the Predictions of Just-In-Time Defect Models.",
                    "Groot: An Event-graph-based Approach for Root Cause Analysis in Industrial Settings.",
                    "Graph-based Incident Aggregation for Large-Scale Online Service Systems.",
                    "On Multi-Modal Learning of Editing Source Code.",
                    "Learning Highly Recursive Input Grammars.",
                    "Automated Testing for Machine Translation via Constituency Invariance.",
                    "Race Detection for Event-Driven Node.js Applications.",
                    "Log-based Anomaly Detection Without Log Parsing.",
                    "Finding the Missing Piece: Permission Specification Analysis for Android NDK.",
                    "Characterizing and Detecting Configuration Compatibility Issues in Android Apps.",
                    "Where to Start: Studying Type Annotation Practices in Python.",
                    "APIzation: Generating Reusable APIs from StackOverflow Code Snippets.",
                    "FIGCPS: Effective Failure-inducing Input Generation for Cyber-Physical Systems with Deep Reinforcement Learning.",
                    "InstruGuard: Find and Fix Instrumentation Errors for Coverage-based Greybox Fuzzing.",
                    "RULF: Rust Library Fuzzing via API Dependency Graph Traversal.",
                    "PyNose: A Test Smell Detector For Python.",
                    "JSTAR: JavaScript Specification Type Analyzer using Refinement.",
                    "Can Neural Clone Detection Generalize to Unseen Functionalitiesƒ.",
                    "Characterizing Transaction-Reverting Statements in Ethereum Smart Contracts.",
                    "\"What makes my queries slow?\": Subgroup Discovery for SQL Workload Analysis.",
                    "AID: Efficient Prediction of Aggregated Intensity of Dependency in Large-scale Cloud Systems.",
                    "Performance Testing for Cloud Computing with Dependent Data Bootstrapping.",
                    "Nekara: Generalized Concurrency Testing.",
                    "QDiff: Differential Testing of Quantum Software Stacks.",
                    "Finding A Needle in a Haystack: Automated Mining of Silent Vulnerability Fixes.",
                    "DeepCVA: Automated Commit-level Vulnerability Assessment with Deep Multi-task Learning.",
                    "Automated Repair of Size-Based Inaccessibility Issues in Mobile Applications.",
                    "Mining Cross-Domain Apps for Software Evolution: A Feature-based Approach.",
                    "UI Test Migration Across Mobile Platforms.",
                    "Intelligent Change Operators for Multi-Objective Refactoring.",
                    "Refactorings and Technical Debt in Docker Projects: An Empirical Study.",
                    "FirmGuide: Boosting the Capability of Rehosting Embedded Linux Kernels through Model-Guided Kernel Execution.",
                    "IFIZZ: Deep-State and Efficient Fault-Scenario Generation to Test IoT Firmware.",
                    "Learning Patterns in Configuration.",
                    "Transcode: Detecting Status Code Mapping Errors in Large-Scale Systems.",
                    "Evolutionary-Guided Synthesis of Verified Pareto-Optimal MDP Policies.",
                    "Automating Developer Chat Mining.",
                    "Thinking Like a Developer? Comparing the Attention of Humans with Neural Models of Code.",
                    "Detecting Memory-Related Bugs by Tracking Heap Memory Management of C++ Smart Pointers.",
                    "Understanding and Detecting Performance Bugs in Markdown Compilers.",
                    "Deep GUI: Black-box GUI Input Generation with Deep Learning.",
                    "Towards Exploring the Limitations of Active Learning: An Empirical Study.",
                    "Learning Domain-Specific Edit Operations from Model Repositories with Frequent Subgraph Mining.",
                    "Unsupervised Labeling and Extraction of Phrase-based Concepts in Vulnerability Descriptions.",
                    "A Compositional Deadlock Detector for Android Java.",
                    "Binary Diffing as a Network Alignment Problem via Belief Propagation.",
                    "CiFi: Versatile Analysis of Class and Field Immutability.",
                    "Modeling Team Dynamics for the Characterization and Prediction of Delays in User Stories.",
                    "DeepMemory: Model-based Memorization Analysis of Deep Neural Language Models.",
                    "Automated Verification of Go Programs via Bounded Model Checking.",
                    "A Prediction Model for Software Requirements Change Impact.",
                    "DSInfoSearch: Supporting Experimentation Process of Data Scientists.",
                    "Towards the generation of machine learning defect reports.",
                    "Leveraging Code Clones and Natural Language Processing for Log Statement Prediction.",
                    "An Automated Pipeline for Privacy Leak Analysis of Android Applications.",
                    "Training Automated Test Oracles to Identify Semantic Bugs.",
                    "Binary Code Similarity Detection.",
                    "API Compatibility Issue Detection, Testing and Analysis for Android Apps.",
                    "Effectively Analyzing Evolving Software with Differential Facts.",
                    "Automated Approach for System-level Testing of Unmanned Aerial Systems.",
                    "Cross-Lingual Transfer Learning Framework for Program Analysis.",
                    "Fuzzing Methods Recommendation Based on Feature Vectors.",
                    "Gas Estimation and Optimization for Smart Contracts on Ethereum.",
                    "Quality analysis of mobile applications with special focus on security aspects.",
                    "Semi-automated Cross-Component Issue Management and Impact Analysis.",
                    "How Can Subgroup Discovery Help AIOps?",
                    "Improving Configurability of Unit-level Continuous Fuzzing: An Industrial Case Study with SAP HANA.",
                    "Access Control Tree for Testing and Learning.",
                    "FinFuzzer: One Step Further in Fuzzing Fintech Systems.",
                    "Evaluating Semantic Autocompletion of Business Processes with Domain Experts.",
                    "Learning-based Assistant for Data Migration of Enterprise Information Systems.",
                    "Reducing Time-To-Fix For Fuzzer Bugs.",
                    "Automatically Deciding on the Integration of Commits Based on Their Descriptions.",
                    "BeeSwarm: Enabling Parallel Scaling Performance Measurement in Continuous Integration for HPC Applications.",
                    "Lessons learned from hyper-parameter tuning for microservice candidate identification.",
                    "Learning GraphQL Query Cost.",
                    "Automatic HMI Structure Exploration Via Curiosity-Based Reinforcement Learning.",
                    "Towards a Serverless Java Runtime.",
                    "BIFF: Practical Binary Fuzzing Framework for Programs of IoT and Mobile Devices.",
                    "Infrastructure in Code: Towards Developer-Friendly Cloud Applications.",
                    "Metamorphic Testing on Multi-module UAV Systems.",
                    "Decoupling Server and Client Code Through Cloud-Native Domain-Specific Functions.",
                    "Automatically Annotating Sentences for Task-specific Bug Report Summarization.",
                    "Genetic Optimisation of C++ Applications.",
                    "Revisiting Textual Feature of Bug-Triage Approach.",
                    "A First Look at the Effect of Deep Learning in Coverage-guided Fuzzing.",
                    "Counterexample Guided Inductive Repair of Reactive Contracts.",
                    "AST-Transformer: Encoding Abstract Syntax Trees Efficiently for Code Summarization.",
                    "Detecting Adversarial Samples with Graph-Guided Testing.",
                    "Using Static Analysis to Address Microservice Architecture Reconstruction.",
                    "Business Process Extraction Using Static Analysis.",
                    "Improving Mutation-Based Fault Localization with Plausible-code Generating Mutation Operators.",
                    "Using Version Control and Issue Tickets to detect Code Debt and Economical Cost.",
                    "Human-in-the-Loop XAI-enabled Vulnerability Detection, Investigation, and Mitigation.",
                    "BeAFix: An Automated Repair Tool for Faulty Alloy Models.",
                    "FLACK: Localizing Faults in Alloy Models.",
                    "IncBL: Incremental Bug Localization.",
                    "Q&A MAESTRO: Q&A Post Recommendation for Fixing Java Runtime Exceptions.",
                    "GenTree: Inferring Configuration Interactions using Decision Trees.",
                    "Quito: a Coverage-Guided Test Generator for Quantum Programs.",
                    "Revizor: A Data-Driven Approach to Automate Frequent Code Changes Based on Graph Matching.",
                    "Scalable Fuzzing of Program Binaries with E9AFL.",
                    "EvoMe: A Software Evolution Management Engine Based on Differential Factbase.",
                    "FixMe: A GitHub Bot for Detecting and Monitoring On-Hold Self-Admitted Technical Debt.",
                    "Automated Code Refactoring upon Database-Schema Changes in Web Applications.",
                    "Muskit: A Mutation Analysis Tool for Quantum Software Testing.",
                    "JTDog: a Gradle Plugin for Dynamic Test Smell Detection.",
                    "RefactorInsight: Enhancing IDE Representation of Changes in Git with Refactorings Information.",
                    "Shaker: a Tool for Detecting More Flaky Tests Faster.",
                    "DEVIATE: A Deep Learning Variance Testing Framework.",
                    "SoManyConflicts: Resolve Many Merge Conflicts Interactively and Systematically.",
                    "A Mocktail of Source Code Representations.",
                    "Empowering Web Applications with WebAssembly: Are We There Yet?",
                    "Property-based Test for Part-of-Speech Tagging Tool.",
                    "Understanding Code Fragments with Issue Reports.",
                    "An Empirical Study on Obsolete Issue Reports.",
                    "Did You Do Your Homework? Raising Awareness on Software Fairness and Discrimination.",
                    "Shake Those System Parameters! On the Need for Parameter Coverage for Decision Systems.",
                    "What do pre-trained code models know about code?",
                    "Towards Systematic and Dynamic Task Allocation for Collaborative Parallel Fuzzing.",
                    "Systematic Testing of Autonomous Driving Systems Using Map Topology-Based Scenario Classification.",
                    "Adaptation2: Adapting Specification Learners in Assured Adaptive Systems.",
                    "Log Anomaly to Resolution: AI Based Proactive Incident Remediation.",
                    "HyperGI: Automated Detection and Repair of Information Flow Leakage.",
                    "Privacy as first-class requirements in software development: A socio-technical approach.",
                    "Towards Fluid Software Architectures: Bidirectional Human-AI Interaction.",
                    "Bugs4Q: A Benchmark of Real Bugs for Quantum Programs.",
                    "Assessing Robustness of ML-Based Program Analysis Tools using Metamorphic Program Transformations.",
                    "Defeating Program Analysis Techniques via Ambiguous Translation.",
                    "A Program Synthesis Approach for Adding Architectural Tactics to An Existing Code Base.",
                    "Program Synthesis with Algorithm Pseudocode Guidance.",
                    "py2src: Towards the Automatic (and Reliable) Identification of Sources for PyPI Package."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2021w",
                "sub_name": "36th IEEE/ACM International Conference on Automated Software Engineering, ASE 2021 - Workshops, Melbourne, Australia, November 15-19, 2021.",
                "count": 46,
                "papers": [
                    "Automatic Repair of Java Code with Timing Side-Channel Vulnerabilities.",
                    "Statistical Analysis of Refactoring Bug Reports in Eclipse Bugzilla.",
                    "The IntelliJ Platform: A Framework for Building Plugins and Mining Software Data.",
                    "Toward a Smell-aware Prediction Model for CI Build Failures.",
                    "An Empirical Study on Code Smells Co-occurrences in Android Applications.",
                    "Android Malware Detection: Looking beyond Dalvik Bytecode.",
                    "So {U} R CERER: Developer-Driven Security Testing Framework for Android Apps.",
                    "Accelerating Symbolic Analysis for Android Apps.",
                    "A First Step Towards Detecting Human Values-violating Defects in Android APIs.",
                    "A First Look at Security Risks of Android TV Apps.",
                    "Automated game testing using computer vision methods.",
                    "Rebuilding games at runtime.",
                    "Towards a Framework to Assist Iterative and Adaptive Design in Gameful Systems.",
                    "Metrics for Assessing Gamers' Satisfaction: Exploring the Graphics Factor.",
                    "JavaBERT: Training a Transformer-Based Model for the Java Programming Language.",
                    "Task Distribution and Human Resource Management Using Reinforcement Learning.",
                    "Classification of UML Diagrams to Support Software Engineering Education.",
                    "Fairer Software Made Easier (using \"Keys\").",
                    "Splitting, Renaming, Removing: A Study of Common Cleaning Activities in Jupyter Notebooks.",
                    "Pre-Trained Neural Language Models for Automatic Mobile App User Feedback Answer Generation.",
                    "Readability and Understandability of Snippets Recommended by General-purpose Web Search Engines: A Comparative Study.",
                    "Recommending Code Understandability Improvements Based on Code Reviews.",
                    "An Investigation of Compound Variable Names Toward Automated Detection of Confusing Variable Pairs.",
                    "An Eye Tracking Perspective on How Developers Rate Source Code Readability Rules.",
                    "Decision-Making Biases and Cyber Attackers.",
                    "ACSIMA: A Cyber Security Index for Mobile Health Apps.",
                    "Oppositional Human Factors in Cybersecurity: A Preliminary Analysis of Affective States.",
                    "Virtual Reality Enabled Human-Centric Requirements Engineering.",
                    "A Methodology for Human-Centred IoT Collectives Based on Socio-Ethical Policies.",
                    "\"I need to know I'm safe and protected and will check\": Users Want Cues to Signal Data Custodians' Trustworthiness.",
                    "Crypto Experts Advise What They Adopt.",
                    "Worrisome Patterns in Developers: A Survey in Cryptography.",
                    "Identifying non-natural language artifacts in bug reports.",
                    "Extracting Software Change Requests from Mobile App Reviews.",
                    "Sentiment Analysis of User Feedback on Business Processes.",
                    "AWARE: Aspect-Based Sentiment Analysis Dataset of Apps Reviews for Requirements Elicitation.",
                    "Generating Context-Aware API Calls from Natural Language Description Using Neural Embeddings and Machine Translation.",
                    "Merging Datasets for Emotion Analysis.",
                    "Enhancing Lexical Representation of Test Coverage for Failure Clustering.",
                    "Learning Sentiment Analysis for Accessibility User Reviews.",
                    "GPPT: A Power Prediction Tool for CUDA Applications.",
                    "PowDroid: Energy Profiling of Android Applications.",
                    "On the Runtime and Energy Performance of WebAssembly: Is WebAssembly superior to JavaScript yet?",
                    "A Preliminary Study of the Impact of Code Coverage on Software Energy Consumption.",
                    "Sustainable AI in the Cloud: Exploring Machine Learning Energy Use in the Cloud.",
                    "Sustainable software engineering - have we neglected the software engineer's perspective?"
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "35th ASE 2020",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2020",
                "sub_name": "35th IEEE/ACM International Conference on Automated Software Engineering, ASE 2020, Melbourne, Australia, September 21-25, 2020.",
                "count": 158,
                "papers": [
                    "Safety and Robustness for Deep Learning with Provable Guarantees.",
                    "Is Software Engineering Research Addressing Software Engineering Problems? (Keynote).",
                    "Accelerating All-SAT Computation with Short Blocking Clauses.",
                    "A Predictive Analysis for Detecting Deadlock in MPI Programs.",
                    "Learning to Handle Exceptions.",
                    "BUILDFAST: History-Aware Build Outcome Prediction for Fast Feedback and Reduced Cost in Continuous Integration.",
                    "LEGION: Best-First Concolic Testing.",
                    "Plug the Database & Play With Automatic Testing: Improving System Testing by Exploiting Persistent Data.",
                    "Enhanced Compiler Bug Isolation via Memoized Search.",
                    "M3: Semantic API Migrations.",
                    "The Impact of Generic Data Structures: Decoding the Role of Lists in the Linux Kernel.",
                    "Pending Constraints in Symbolic Execution for Better Exploration and Seeding.",
                    "Broadening Horizons of Multilingual Static Analysis: Semantic Summary Extraction from C Code for JNI Program Analysis.",
                    "Assessing and Restoring Reproducibility of Jupyter Notebooks.",
                    "Verified from Scratch: Program Analysis for Learners' Programs.",
                    "Interval Change-Point Detection for Runtime Probabilistic Model Checking.",
                    "UNCHARTIT: An Interactive Framework for Program Recovery from Charts.",
                    "Demystifying Diehard Android Apps.",
                    "UI Obfuscation and Its Effects on Automated UI Analysis for Android Apps.",
                    "Good Things Come In Threes: Improving Search-based Crash Reproduction With Helper Objectives.",
                    "Subdomain-Based Generality-Aware Debloating.",
                    "Revisiting the Relationship Between Fault Detection, Test Adequacy Criteria, and Test Set Size.",
                    "Synthesis of Infinite-State Systems with Random Behavior.",
                    "Demystifying Loops in Smart Contracts.",
                    "Patching as Translation: the Data and the Metaphor.",
                    "DeepTC-Enhancer: Improving the Readability of Automatically Generated Tests.",
                    "Hybrid Deep Neural Networks to Infer State Models of Black-Box Systems.",
                    "Representing and Reasoning about Dynamic Code.",
                    "ER Catcher: A Static Analysis Framework for Accurate and Scalable Event-Race Detection in Android.",
                    "A Deep Multitask Learning Approach for Requirements Discovery and Annotation from Open Forum.",
                    "Retrieve and Refine: Exemplar-based Neural Comment Generation.",
                    "Where Shall We Log? Studying and Suggesting Logging Locations in Code Blocks.",
                    "How Incidental are the Incidents? Characterizing and Prioritizing Incidents for Large-Scale Online Service Systems.",
                    "Stay Professional and Efficient: Automatically Generate Titles for Your Bug Reports.",
                    "Owl Eyes: Spotting UI Display Issues via Visual Understanding.",
                    "Multiple-Boundary Clustering and Prioritization to Promote Neural Network Retraining.",
                    "Marble: Model-based Robustness Analysis of Stateful Deep Learning Systems.",
                    "MockSniffer: Characterizing and Recommending Mocking Decisions for Unit Tests.",
                    "Defect Prediction Guided Search-Based Software Testing.",
                    "API-Misuse Detection Driven by Fine-Grained API-Constraint Knowledge Graph.",
                    "Multi-task Learning based Pre-trained Language Model for Code Completion.",
                    "Audee: Automated Testing for Deep Learning Frameworks.",
                    "Towards Interpreting Recurrent Neural Networks through Probabilistic Abstraction.",
                    "Continuous Compliance.",
                    "SADT: Syntax-Aware Differential Testing of Certificate Validation in SSL/TLS Implementations.",
                    "CoFI: Consistency-Guided Fault Injection for Cloud Systems.",
                    "ChemTest: An Automated Software Testing Framework for an Emerging Paradigm.",
                    "Automatic Extraction of Cause-Effect-Relations from Requirements Artifacts.",
                    "BiLO-CPDP: Bi-Level Programming for Automated Model Discovery in Cross-Project Defect Prediction.",
                    "Automating Just-In-Time Comment Updating.",
                    "Automated Implementation of Windows-related Security-Configuration Guides.",
                    "Identifying Software Performance Changes Across Variants and Versions.",
                    "CP-Detector: Using Configuration-related Performance Properties to Expose Performance Bugs.",
                    "Just-In-Time Reactive Synthesis.",
                    "JISET: JavaScript IR-based Semantics Extraction Toolchain.",
                    "FlashRegex: Deducing Anti-ReDoS Regexes from Examples.",
                    "Inferring and Applying Def-Use Like Configuration Couplings in Deployment Descriptors.",
                    "Mastering Uncertainty in Performance Estimations of Configurable Software Systems.",
                    "Team Discussions and Dynamics During DevOps Tool Adoptions in OSS Projects.",
                    "TestMC: Testing Model Counters using Differential and Metamorphic Testing.",
                    "BigFuzz: Efficient Fuzz Testing for Data Analytics Using Framework Abstraction.",
                    "Scaling Client-Specific Equivalence Checking via Impact Boundary Search.",
                    "Code to Comment \"Translation\": Data, Metrics, Baselining & Evaluation.",
                    "Exploring the Architectural Impact of Possible Dependencies in Python Software.",
                    "Problems and Opportunities in Training Deep Learning Software Systems: An Analysis of Variance.",
                    "NEURODIFF: Scalable Differential Verification of Neural Networks using Fine-Grained Approximation.",
                    "Identifying and Describing Information Seeking Tasks.",
                    "Predicting Code Context Models for Software Development Tasks.",
                    "SCDetector: Software Functional Clone Detection Based on Semantic Tokens Analysis.",
                    "Generating Concept based API Element Comparison Using a Knowledge Graph.",
                    "Multiplex Symbolic Execution: Exploring Multiple Paths by Solving Once.",
                    "Zeror: Speed Up Fuzzing with Coverage-sensitive Tracing and Scheduling.",
                    "Detecting and Explaining Self-Admitted Technical Debts with Attention-based Neural Networks.",
                    "OCoR: An Overlapping-Aware Code Retriever.",
                    "Understanding Performance Concerns in the API Documentation of Data Science Libraries.",
                    "On the Effectiveness of Unified Debugging: An Extensive Study on 16 Program Repair Systems.",
                    "Automated Third-Party Library Detection for Android Applications: Are We There Yet?",
                    "CCGraph: a PDG-based code clone detector with approximate graph matching.",
                    "Towards Generating Thread-Safe Classes Automatically.",
                    "No Strings Attached: An Empirical Study of String-related Software Bugs.",
                    "Automated Patch Correctness Assessment: How Far are We?",
                    "Evaluating Representation Learning of Code Changes for Predicting Patch Correctness in Program Repair.",
                    "Scalable Multiple-View Analysis of Reactive Systems via Bidirectional Model Transformations.",
                    "Trace-Checking Signal-based Temporal Properties: A Model-Driven Approach.",
                    "Attend and Represent: A Novel View on Algorithm Selection for Software Verification.",
                    "Cross-Contract Static Analysis for Detecting Practical Reentrancy Vulnerabilities in Smart Contracts.",
                    "Cats Are Not Fish: Deep Learning Testing Calls for Out-Of-Distribution Awareness.",
                    "Metamorphic Object Insertion for Testing Object Detection Systems.",
                    "Seven Reasons Why: An In-Depth Study of the Limitations of Random Test Input Generation for Android.",
                    "Test Automation in Open-Source Android Apps: A Large-Scale Empirical Study.",
                    "Synthesis-Based Resolution of Feature Interactions in Cyber-Physical Systems.",
                    "MoFuzz: A Fuzzer Suite for Testing Model-Driven Software Engineering Tools.",
                    "Prober: Practically Defending Overflows with Page Protection.",
                    "MinerRay: Semantics-Aware Analysis for Ever-Evolving Cryptojacking Detection.",
                    "Summary-Based Symbolic Evaluation for Smart Contracts.",
                    "Applying Learning Techniques to Oracle Synthesis.",
                    "Automated Generation of Client-Specific Backends Utilizing Existing Microservices and Architectural Knowledge.",
                    "SAT-Based Arithmetic Support for Alloy.",
                    "Towards Robust Production Machine Learning Systems: Managing Dataset Shift.",
                    "Towards Transparency-Encouraging Partial Software Disclosure to Enable Trust in Data Usage.",
                    "Using Defect Prediction to Improve the Bug Detection Capability of Search-Based Software Testing.",
                    "The New Approach to IT Testing : Real Transaction-Based Automated Validation Solution.",
                    "Automatic Generation of IFTTT Mashup Infrastructures.",
                    "Towards Building Robust DNN Applications: An Industrial Case Study of Evolutionary Data Augmentation.",
                    "Industry Practice of JavaScript Dynamic Analysis on WeChat Mini-Programs.",
                    "Lightweight MBT Testing for National e-Health Portal in Norway.",
                    "Code-Based Vulnerability Detection in Node.js Applications: How far are we?",
                    "A Framework for Automated Test Mocking of Mobile Apps.",
                    "A Hybrid Analysis to Detect Java Serialisation Vulnerabilities.",
                    "BugPecker: Locating Faulty Methods with Deep Learning on Revision Graphs.",
                    "Closer to the Edge: Testing Compilers More Thoroughly by Being Less Conservative About Undefined Behaviour.",
                    "Generating Highly-structured Input Data by Combining Search-based Testing and Grammar-based Fuzzing.",
                    "Making Fair ML Software using Trustworthy Explanation.",
                    "On Benign Features in Malware Detection.",
                    "Proving Termination by k-Induction.",
                    "SRRTA: Regression Testing Acceleration via State Reuse.",
                    "An Automated Assessment of Android Clipboards.",
                    "Edge4Sys: A Device-Edge Collaborative Framework for MEC based Smart Systems.",
                    "Efficient Multiplex Symbolic Execution with Adaptive Search Strategy.",
                    "Managing App Testing Device Clouds: Issues and Opportunities.",
                    "Styx: A Data-Oriented Mutation Framework to Improve the Robustness of DNN.",
                    "Synthesizing Smart Solving Strategy for Symbolic Execution.",
                    "The Symptom, Cause and Repair of Workaround.",
                    "Towards Immersive Comprehension of Software Systems Using Augmented Reality - An Empirical Evaluation.",
                    "Towards Programming and Verification for Activity-Oriented Smart Home Systems.",
                    "AirMochi - A Tool for Remotely Controlling iOS Devices.",
                    "Botsing, a Search-based Crash Reproduction Framework for Java.",
                    "Express: An Energy-Efficient and Secure Framework for Mobile Edge Computing and Blockchain based Smart Systems**This research is in part supported by the National Natural Science Foundation of China Project No. 61972001.",
                    "Edge4Real: A Cost-Effective Edge Computing based Human Behaviour Recognition System for Human-Centric Software Engineering.",
                    "FILO: FIx-LOcus Localization for Backward Incompatibilities Caused by Android Framework Upgrades.",
                    "GUI2WiRe: Rapid Wireframing with a Mined and Large-Scale GUI Repository using Natural Language Requirements.",
                    "HomoTR: Online Test Recommendation System Based on Homologous Code Matching.",
                    "ImpAPTr: A Tool For Identifying The Clues To Online Service Anomalies.",
                    "OSLDetector: Identifying Open-Source Libraries through Binary Analysis.",
                    "Sosed: a tool for finding similar software projects.",
                    "WASim: Understanding WebAssembly Applications through Classification.",
                    "MetPurity: A Learning-Based Tool of Pure Method Identification for Automatic Test Generation.",
                    "STIFA: Crowdsourced Mobile Testing Report Selection Based on Text and Image Fusion Analysis.",
                    "JITBot: An Explainable Just-In-Time Defect Prediction Bot.",
                    "Speeding up GUI Testing by On-Device Test Generation.",
                    "PerfCI: A Toolchain for Automated Performance Testing during Continuous Integration of Python Projects.",
                    "SmartBugs: A Framework to Analyze Solidity Smart Contracts.",
                    "RepoSkillMiner: Identifying software expertise from GitHub repositories using Natural Language Processing.",
                    "A Machine Learning based Approach to Autogenerate Diagnostic Models for CNC machines.",
                    "A Program Verification based Approach to Find Data Race Vulnerabilities in Interrupt-driven Program.",
                    "A Unified Framework to Learn Program Semantics with Graph Neural Networks.",
                    "Anti-patterns for Java Automated Program Repair Tools.",
                    "CrossPriv: User Privacy Preservation Model for Cross-Silo Federated Software.",
                    "Discovering UI Display Issues with Visual Understanding.",
                    "Dynamic Algorithm Selection for SMT.",
                    "FLUX: From SQL to GQL query translation tool.",
                    "Finding Ethereum Smart Contracts Security Issues by Comparing History Versions.",
                    "Formal Verification of Masking Countermeasures for Arithmetic Programs.",
                    "Identifying Mutation Subsumption Relations.",
                    "Scalability and Precision Improvement of Neural Program Synthesis.",
                    "The Classification and Propagation of Program Comments.",
                    "Source Code and Binary Level Vulnerability Detection and Hot Patching.",
                    "When Deep Learning Meets Smart Contracts."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2020w",
                "sub_name": "35th IEEE/ACM International Conference on Automated Software Engineering Workshops, ASE Workshops 2020, Melbourne, Australia, September 21-25, 2020.",
                "count": 28,
                "papers": [
                    "Zimbabwean non-uptake of protective point-of-sale behaviours: is this a risk homeostasis response?",
                    "Designing a serious game: teaching developers to embed privacy into software systems.",
                    "Vulnerability discovery strategies used in software projects.",
                    "An informed consent model for managing the privacy paradox in smart buildings.",
                    "Characterizing co-located insecure coding patterns in infrastructure as code scripts.",
                    "Exploring the requirements of pandemic awareness systems: a case study of COVID-19 using social media data.",
                    "mHealth4U: designing for health and wellbeing self-management.",
                    "Reducing delay penalty of multiple concurrent software projects based on overtime planning.",
                    "Towards better understanding of agile teams through behavior change models.",
                    "A vision to mitigate bioinformatics software development challenges.",
                    "A framework for the automatic execution of measurement-based experiments on Android devices.",
                    "Ecosystem evolution analysis and trend prediction of projects in Android application framework.",
                    "KnowledgeZooClient: constructing knowledge graph for Android.",
                    "Market-level analysis of government-backed COVID-19 contact tracing apps.",
                    "Enforcing green code with Android lint.",
                    "Boosting component-based synthesis with API usage knowledge.",
                    "Collective intelligence for smarter neural program synthesis.",
                    "Predicting software design patterns from text using neural embedding.",
                    "NLP-based enhancement of information security in ITO: a diffusion of innovation theory perspective.",
                    "AutoEPRS-20: extracting business process redesign suggestions from natural language text.",
                    "Emotion detection in Roman Urdu text using machine learning.",
                    "Mapping textual feedback to process model elements.",
                    "Roman Urdu reviews dataset for aspect based opinion mining.",
                    "Energy efficiency in robotics software: a systematic literature review.",
                    "Gesture driven smart home solution for bedridden people.",
                    "Energy wars - Chrome vs. Firefox: which browser is more energy efficient?",
                    "Sustainability in migrating workloads to public clouds.",
                    "E-Debitum: managing software energy debt."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "34th ASE 2019",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2019",
                "sub_name": "34th IEEE/ACM International Conference on Automated Software Engineering, ASE 2019, San Diego, CA, USA, November 11-15, 2019.",
                "count": 154,
                "papers": [
                    "Assessing the Generalizability of Code2vec Token Embeddings.",
                    "Multi-modal Attention Network Learning for Semantic Source Code Retrieval.",
                    "Experience Paper: Search-Based Testing in Automated Driving Control Applications.",
                    "AutoFocus: Interpreting Attention-Based Neural Networks by Code Perturbation.",
                    "Test Transfer Across Mobile Apps Through Semantic Mapping.",
                    "Test Migration Between Mobile Apps with Similar Functionality.",
                    "DaPanda: Detecting Aggressive Push Notifications in Android Apps.",
                    "Automatic Self-Validation for Code Coverage Profilers.",
                    "Efficient Test Generation Guided by Field Coverage Criteria.",
                    "A Qualitative Analysis of Android Taint-Analysis Results.",
                    "Goal-Driven Exploration for Android Applications.",
                    "RANDR: Record and Replay for Android Applications via Targeted Runtime Instrumentation.",
                    "MalScan: Fast Market-Wide Mobile Malware Scanning by Social-Network Centrality Analysis.",
                    "Discovering, Explaining and Summarizing Controversial Discussions in Community Q&A Sites.",
                    "Automating App Review Response Generation.",
                    "Automatic Generation of Pull Request Descriptions.",
                    "Systematically Covering Input Structure.",
                    "SEGATE: Unveiling Semantic Inconsistencies between Code and Specification of String Inputs.",
                    "Detecting Error-Handling Bugs without Error Specification Input.",
                    "Grading-Based Test Suite Augmentation.",
                    "Emotions Extracted from Text vs. True Emotions-An Empirical Evaluation in SE Context.",
                    "Learning from Examples to Find Fully Qualified Names of API Elements in Code Snippets.",
                    "Inferring Program Transformations From Singular Examples via Big Code.",
                    "Performance-Boosting Sparsification of the IFDS Algorithm with Applications to Taint Analysis.",
                    "Characterizing Android App Signing Issues.",
                    "OAUTHLINT: An Empirical Study on OAuth Bugs in Android Applications.",
                    "History-Guided Configuration Diversification for Compiler Test-Program Generation.",
                    "ReduKtor: How We Stopped Worrying About Bugs in Kotlin Compiler.",
                    "Targeted Example Generation for Compilation Errors.",
                    "Understanding Exception-Related Bugs in Large-Scale Cloud Systems.",
                    "iFeedback: Exploiting User Feedback for Real-Time Issue Detection in Large-Scale Online Service Systems.",
                    "Continuous Incident Triage for Large-Scale Online Service Systems.",
                    "Apricot: A Weight-Adaptation Approach to Fixing Deep Learning Models.",
                    "Re-Factoring Based Program Repair Applied to Programming Assignments.",
                    "InFix: Automatically Repairing Novice Program Inputs.",
                    "Understanding Automatically-Generated Patches Through Symbolic Invariant Differences.",
                    "Regexes are Hard: Decision-Making, Difficulties, and Risks in Programming Regular Expressions.",
                    "Testing Regex Generalizability And Its Implications: A Large-Scale Many-Language Measurement Study.",
                    "Accurate String Constraints Solution Counting with Weighted Automata.",
                    "Subformula Caching for Model Counting and Quantitative Program Analysis.",
                    "ACTGAN: Automatic Configuration Tuning for Software Systems with Generative Adversarial Networks.",
                    "V2: Fast Detection of Configuration Drift in Python.",
                    "Feature-Interaction Aware Configuration Prioritization for Configurable Code.",
                    "Combining Spectrum-Based Fault Localization and Statistical Debugging: An Empirical Study.",
                    "SCMiner: Localizing System-Level Concurrency Faults from Large System Call Traces.",
                    "Root Cause Localization for Unreproducible Builds via Causality Analysis Over System Call Tracing.",
                    "Mutation Analysis for Coq.",
                    "Verifying Arithmetic in Cryptographic C Programs.",
                    "Model Checking Embedded Control Software using OS-in-the-Loop CEGAR.",
                    "Get Rid of Inline Assembly through Verification-Oriented Lifting.",
                    "CodeKernel: A Graph Kernel Based Approach to the Selection of API Usage Examples.",
                    "Machine Learning Based Recommendation of Method Names: How Far are We.",
                    "MARBLE: Mining for Boilerplate Code to Identify API Usability Problems.",
                    "DIRE: A Neural Approach to Decompiled Identifier Naming.",
                    "Accurate Modeling of Performance Histories for Evolving Software Systems.",
                    "An Industrial Experience Report on Performance-Aware Refactoring on a Database-Centric Web Application.",
                    "How Do API Selections Affect the Runtime Performance of Data Analytics Tasks?",
                    "An Experience Report of Generating Load Tests Using Log-Recovered Workloads at Varying Granularities of User Behaviour.",
                    "Demystifying Application Performance Management Libraries for Android.",
                    "Predicting Licenses for Changed Source Code.",
                    "Empirical Evaluation of the Impact of Class Overlap on Software Defect Prediction.",
                    "Combining Program Analysis and Statistical Language Model for Code Statement Completion.",
                    "MAP-Coverage: A Novel Coverage Criterion for Testing Thread-Safe Classes.",
                    "Automating Non-Blocking Synchronization In Concurrent Data Abstractions.",
                    "Automating CUDA Synchronization via Program Transformation.",
                    "Efficient Transaction-Based Deterministic Replay for Multi-threaded Programs.",
                    "Wuji: Automatic Online Combat Game Testing Using Evolutionary Deep Reinforcement Learning.",
                    "A Study of Oracle Approximations in Testing Deep Learning Libraries.",
                    "Property Inference for Deep Neural Networks.",
                    "An Empirical Study Towards Characterizing Deep Learning Development and Deployment Across Different Frameworks and Platforms.",
                    "RefBot: Intelligent Software Refactoring Bot.",
                    "Automated Refactoring to Reactive Programming.",
                    "Empirical Study of Programming to an Interface.",
                    "Statistical Log Differencing.",
                    "Logzip: Extracting Hidden Structures via Iterative Clustering for Log Compression.",
                    "Code-First Model-Driven Engineering: On the Agile Adoption of MDE Tooling.",
                    "Size and Accuracy in Model Inference.",
                    "Debreach: Mitigating Compression Side Channels via Static Analysis and Transformation.",
                    "Fine-Grain Memory Object Representation in Symbolic Execution.",
                    "RENN: Efficient Reverse Execution with Neural-Network-Assisted Alias Analysis.",
                    "Batch Alias Analysis.",
                    "Improving the Decision-Making Process of Self-Adaptive Systems by Accounting for Tactic Volatility.",
                    "Learning-Guided Network Fuzzing for Testing Cyber-Physical System Defences.",
                    "Cautious Adaptation of Defiant Components.",
                    "Active Hotspot: An Issue-Oriented Model to Monitor Software Evolution and Degradation.",
                    "Automated Trainability Evaluation for Smart Software Functions.",
                    "The Impact of Structure on Software Merging: Semistructured Versus Structured Merge.",
                    "Semistructured Merge in JavaScript Systems.",
                    "CLCDSA: Cross Language Code Clone Detection using Syntactical Features and API Documentation.",
                    "B2SFinder: Detecting Open-Source Software Reuse in COTS Software.",
                    "CoRA: Decomposing and Describing Tangled Code Changes for Reviewer.",
                    "A Quantitative Analysis Framework for Recurrent Neural Network.",
                    "LIRAT: Layout and Image Recognition Driving Automated Mobile Testing of Cross-Platform.",
                    "Humanoid: A Deep Learning-Based Approach to Automated Black-box Android App Testing.",
                    "TestCov: Robust Test-Suite Execution and Coverage Measurement.",
                    "VisFuzz: Understanding and Intervening Fuzzing with Interactive Visualization.",
                    "Developer Reputation Estimator (DRE).",
                    "CocoQa: Question Answering for Coding Conventions Over Knowledge Graphs.",
                    "MutAPK: Source-Codeless Mutant Generation for Android Apps.",
                    "SWAN_ASSIST: Semi-Automated Detection of Code-Specific, Security-Relevant Methods.",
                    "Sip4J: Statically Inferring Access Permission Contracts for Parallelising Sequential Java Programs.",
                    "Visual Analytics for Concurrent Java Executions.",
                    "NeuralVis: Visualizing and Interpreting Deep Learning Models.",
                    "Kotless: A Serverless Framework for Kotlin.",
                    "FogWorkflowSim: An Automated Simulation Toolkit for Workflow Performance Evaluation in Fog Computing.",
                    "PraPR: Practical Program Repair via Bytecode Mutation.",
                    "SPrinter: A Static Checker for Finding Smart Pointer Errors in C++ Programs.",
                    "FPChecker: Detecting Floating-Point Exceptions in GPU Applications.",
                    "Pangolin: An SFL-Based Toolset for Feature Localization.",
                    "SiMPOSE - Configurable N-Way Program Merging Strategies for Superimposition-Based Analysis of Variant-Rich Software.",
                    "VeriAbs : Verification by Abstraction and Test Generation.",
                    "SGUARD: A Feature-Based Clustering Tool for Effective Spreadsheet Defect Detection.",
                    "PeASS: A Tool for Identifying Performance Changes at Code Level.",
                    "VeriSmart 2.0: Swarm-Based Bug-Finding for Multi-threaded Programs with Lazy-CSeq.",
                    "CONVUL: An Effective Tool for Detecting Concurrency Vulnerabilities.",
                    "DeepMutation++: A Mutation Testing Framework for Deep Learning Systems.",
                    "Coverage-Guided Fuzzing for Feedforward Neural Networks.",
                    "Prema: A Tool for Precise Requirements Editing, Modeling and Analysis.",
                    "TsmartGP: A Tool for Finding Memory Defects with Pointer Analysis.",
                    "Ares: Inferring Error Specifications through Static Analysis.",
                    "PMExec: An Execution Engine of Partial UML-RT Models.",
                    "mCUTE: A Model-Level Concolic Unit Testing Engine for UML State Machines.",
                    "Manticore: A User-Friendly Symbolic Execution Framework for Binaries and Smart Contracts.",
                    "BuRRiTo: A Framework to Extract, Specify, Verify and Analyze Business Rules.",
                    "XRaSE: Towards Virtually Tangible Software using Augmented Reality.",
                    "MuSC: A Tool for Mutation Testing of Ethereum Smart Contract.",
                    "Lancer: Your Code Tell Me What You Need.",
                    "PHANTA: Diversified Test Code Quality Measurement for Modern Software Development.",
                    "Test Automation and Its Limitations: A Case Study.",
                    "PTracer: A Linux Kernel Patch Trace Bot.",
                    "Trusted Software Supply Chain.",
                    "A Journey Towards Providing Intelligence and Actionable Insights to Development Teams in Software Delivery.",
                    "Better Development of Safety Critical Systems: Chinese High Speed Railway System Development Experience Report.",
                    "Improving Collaboration Efficiency in Fork-Based Development.",
                    "Inference of Properties from Requirements and Automation of Their Formal Verification.",
                    "Generating Tests to Analyse Dynamically-Typed Programs.",
                    "Improving Patch Quality by Enhancing Key Components of Automatic Program Repair.",
                    "Automatic Generation of Graphical User Interface Prototypes from Unrestricted Natural Language Requirements.",
                    "Automatically Repairing Binary Programs Using Adapter Synthesis.",
                    "Tackling Build Failures in Continuous Integration.",
                    "Enabling Continuous Improvement of a Continuous Integration Process.",
                    "Retrieve and Refine: Exemplar-Based Neural Comment Generation.",
                    "API Design Implications of Boilerplate Client Code.",
                    "Compile-Time Detection of Machine Image Sniping.",
                    "An Image-Inspired and CNN-Based Android Malware Detection Approach.",
                    "Toward Practical Automatic Program Repair.",
                    "User Preference Aware Multimedia Pricing Model using Game Theory and Prospect Theory for Wireless Communications.",
                    "An Approach for Investigating Emotion Dynamics in Software Development.",
                    "Verifying Determinism in Sequential Programs.",
                    "Empirical Study of Python Call Graph.",
                    "Crowdsourced Report Generation via Bug Screenshot Understanding.",
                    "Boosting Neural Commit Message Generation with Code Semantic Analysis.",
                    "Towards Comprehensible Representation of Controllers using Machine Learning.",
                    "A Machine Learning Based Approach to Identify SQL Injection Vulnerabilities."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2019w",
                "sub_name": "34th IEEE/ACM International Conference on Automated Software Engineering Workshops, ASE Workshops 2019, San Diego, CA, USA, November 11-15, 2019.",
                "count": 25,
                "papers": [
                    "Android App Merging for Benchmark Speed-Up and Analysis Lift-Up.",
                    "BenchPress: Analyzing Android App Vulnerability Benchmark Suites.",
                    "SeMA: A Design Methodology for Building Secure Android Apps.",
                    "Automatic Components Separation of Obfuscated Android Applications: An Empirical Study of Design Based Features.",
                    "Explaining Static Analysis - A Perspective.",
                    "Explaining Business Process Software with Fulib-Scenarios.",
                    "Don't Forget Your Roots! Using Provenance Data for Transparent and Explainable Development of Machine Learning Models.",
                    "A Hybrid Editor for Fast Robot Mission Prototyping.",
                    "Framework for Trustworthy Software Development.",
                    "Towards Automated Security Design Flaw Detection.",
                    "Security-Related Commits in Open Source Web Browser Projects.",
                    "Challenges in Secure Engineering of Critical Infrastructure Systems.",
                    "The Effect of Weighted Moving Windows on Security Vulnerability Prediction.",
                    "Securing Smart Contracts in Blockchain.",
                    "On Secret Management and Handling in Mobile Application Development Life Cycle: A Position Paper.",
                    "Synthesizing Mutable Configurations: Setting up Systems for Success.",
                    "Encoding Adaptability of Software Engineering Tools as Algorithm Configuration Problem: A Case Study.",
                    "Toward Evaluation of Deployment Architecture of ML-Based Cyber-Physical Systems.",
                    "Where Does LDA Sit for GitHub?",
                    "Predicting Defects with Latent and Semantic Features from Commit Logs in an Industrial Setting.",
                    "Mining Text in Incident Repositories: Experiences and Perspectives on Adopting Machine Learning Solutions in Practice.",
                    "Project Achilles: A Prototype Tool for Static Method-Level Vulnerability Detection of Java Source Code Using a Recurrent Neural Network.",
                    "Can AI Close the Design-Code Abstraction Gap?",
                    "On the Engineering of AI-Powered Systems.",
                    "Service Application Knowledge Graph and Dependency System."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "33rd ASE 2018",
        "info": "Montpellier, France",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2018",
                "sub_name": "Proceedings of the 33rd ACM/IEEE International Conference on Automated Software Engineering, ASE 2018, Montpellier, France, September 3-7, 2018.",
                "count": 112,
                "papers": [
                    "Software heritage: collecting, preserving, and sharing all our source code (keynote).",
                    "Automated requirements engineering challenges with examples from small unmanned aerial systems (keynote).",
                    "Implementation science for software engineering: bridging the gap between research and practice (keynote).",
                    "The need for context in software engineering (IEEE CS Harlan Mills award keynote).",
                    "On adopting linters to deal with performance concerns in Android apps.",
                    "PerfLearner: learning from bug reports to understand and generate performance test frames.",
                    "AutoConfig: automatic configuration tuning for distributed message systems.",
                    "Is this class thread-safe? inferring documentation using graph-based learning.",
                    "A large-scale study of test coverage evolution.",
                    "Effectiveness and challenges in generating concurrent tests for thread-safe classes.",
                    "Scalable incremental building with dynamic task dependencies.",
                    "Noise and heterogeneity in historical build data: an empirical study of Travis CI.",
                    "Automated directed fairness testing.",
                    "Concolic testing for deep neural networks.",
                    "DeepGauge: multi-granularity testing criteria for deep learning systems.",
                    "DeepRoad: GAN-based metamorphic testing and input validation framework for autonomous driving systems.",
                    "Testing autonomous cars for feature interaction failures using many-objective search.",
                    "Tackling combinatorial explosion: a study of industrial needs and practices for analyzing highly configurable systems.",
                    "Understanding and detecting evolution-induced compatibility issues in Android apps.",
                    "Characterizing the natural language descriptions in software logging statements.",
                    "Assessing the type annotation burden.",
                    "Mining file histories: should we consider branches?",
                    "Tell them apart: distilling technology differences from crowd-scale comparison discussions.",
                    "ReScue: crafting regular expression DoS attacks.",
                    "TDroid: exposing app switching attacks in Android with control flow specialization.",
                    "Model-driven run-time enforcement of complex role-based access control policies.",
                    "ContractFuzzer: fuzzing smart contracts for vulnerability detection.",
                    "SEEDE: simultaneous execution and editing in a development environment.",
                    "Effective API recommendation without historical software repositories.",
                    "API method recommendation without worrying about the task-API knowledge gap.",
                    "An automated approach to estimating code coverage measures via execution logs.",
                    "How many of all bugs do we find? a study of static bug detectors.",
                    "TRIMMER: application specialization for code debloating.",
                    "A unified lattice model and framework for purity analyses.",
                    "Control flow-guided SMT solving for program verification.",
                    "PaMpeR: proof method recommendation system for Isabelle/HOL.",
                    "Neural-machine-translation-based commit message generation: how far are we?",
                    "Deep learning based feature envy detection.",
                    "Improving automatic source code summarization via deep reinforcement learning.",
                    "Template-guided concolic testing via online learning.",
                    "Android testing via synthetic symbolic execution.",
                    "PARTI: a multi-interval theory solver for symbolic execution.",
                    "Client-specific equivalence checking.",
                    "Replay without recording of production bugs for service oriented applications.",
                    "Reducing interactive refactoring effort via clustering-based multi-objective search.",
                    "FairFuzz: a targeted mutation strategy for increasing greybox fuzz testing coverage.",
                    "Efficiently manifesting asynchronous programming errors in Android apps.",
                    "Expandable group identification in spreadsheets.",
                    "Break the dead end of dynamic slicing: localizing data and control omission bug.",
                    "A genetic algorithm for goal-conflict identification.",
                    "Understanding and detecting callback compatibility issues for Android applications.",
                    "Detecting and summarizing GUI changes in evolving mobile apps.",
                    "Empirically assessing opportunities for prefetching and caching in mobile apps.",
                    "Safe stream-based programming with refinement types.",
                    "Automated model repair for Alloy.",
                    "PFix: fixing concurrency bugs based on memory access patterns.",
                    "Generating reusable web components from mockups.",
                    "Semantic crash bucketing.",
                    "A symbolic model checking approach to the analysis of string and length constraints.",
                    "Domain-independent multi-threaded software model checking.",
                    "Scheduling constraint based abstraction refinement for weak memory models.",
                    "Datalog-based scalable semantic diffing of concurrent programs.",
                    "αDiff: cross-version binary code similarity detection with DNN.",
                    "ClDiff: generating concise linked code differences.",
                    "Characterizing and identifying misexposed activities in Android applications.",
                    "A tale of two cities: how WebView induces bugs to Android applications.",
                    "Dual-force: understanding WebView malware via cross-language forced execution.",
                    "Self-protection of Android systems from inter-component communication attacks.",
                    "An empirical study of Android test generation tools in industrial cases.",
                    "Achieving test automation with testers without coding skills: an industrial report.",
                    "Navigating the maze: the impact of configurability in bioinformatics software.",
                    "Automatically testing implementations of numerical abstract domains.",
                    "Experiences applying automated architecture analysis tool suites.",
                    "Continuous code quality: are we (really) doing that?",
                    "RUDSEA: recommending updates of Dockerfiles via software environment analysis.",
                    "Delta debugging microservice systems.",
                    "Personalized teammate recommendation for crowdsourced software developers.",
                    "S-gram: towards semantic-aware security auditing for Ethereum smart contracts.",
                    "An evolutionary approach for analyzing Alloy specifications.",
                    "A neural framework for retrieval and summarization of source code.",
                    "An empirical investigation into learning bug-fixing patches in the wild via neural machine translation.",
                    "Loop path reduction by state pruning.",
                    "node2defect: using network embedding to improve software defect prediction.",
                    "Towards automating disambiguation of regulations: using the wisdom of crowds.",
                    "jStanley: placing a green thumb on Java collections.",
                    "SRCIROR: a toolset for mutation testing of C source code and LLVM intermediate representation.",
                    "Lightweight source code monitoring with Triggr.",
                    "OCELOT: a search-based test-data generation tool for C.",
                    "Live versioning of web applications through refactoring.",
                    "code_call_lens: raising the developer awareness of critical code.",
                    "Code2graph: automatic generation of static call graphs for Python source code.",
                    "The electrum analyzer: model checking relational first-order temporal specifications.",
                    "ESBMC 5.0: an industrial-strength C model checker.",
                    "L-CMP: an automatic learning-based parameterized verification tool.",
                    "VulSeeker: a semantic learning based vulnerability seeker for cross-platform binary.",
                    "CPA-SymExec: efficient symbolic execution in CPAchecker.",
                    "CANAL: a cache timing analysis framework via LLVM transformation.",
                    "Descartes: a PITest engine to detect pseudo-tested methods: tool demonstration.",
                    "DKVF: a framework for rapid prototyping and evaluating distributed key-value stores.",
                    "DroidMate-2: a platform for Android test generation.",
                    "Assessing and evaluating functional suitability of software.",
                    "Automatic mining of constraints for monitoring systems of systems.",
                    "Towards automatic restrictification of CUDA kernel arguments.",
                    "A DSL for requirements in the context of a seamless approach.",
                    "A multi-objective framework for effective performance fault injection in distributed systems.",
                    "Top-down model-driven engineering of web services from extended OpenAPI models.",
                    "Differential program analysis with fuzzing and symbolic execution.",
                    "Software engineering techniques applied to relational databases.",
                    "Automatically quantifying the impact of a change in systems (journal-first abstract).",
                    "Estimating the number of remaining links in traceability recovery (journal-first abstract).",
                    "Bounded model checking of C++ programs based on the Qt cross-platform framework (journal-first abstract).",
                    "Understanding Semi-structured merge conflict characteristics in open-source Java projects (journal-first abstract)."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2018swmi",
                "sub_name": "Proceedings of the 7th International Workshop on Software Mining, ASE 2018, Montpellier, France, September 3, 2018.",
                "count": 4,
                "papers": [
                    "Extracting implicit programming rules: comparing static and dynamic approaches.",
                    "Who plays with whom? ... and how? mining API interaction patterns from source code.",
                    "Within-ecosystem issue linking: a large-scale study of rails.",
                    "Commits as a basis for API misuse detection."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2018mases",
                "sub_name": "Proceedings of the 1st International Workshop on Machine Learning and Software Engineering in Symbiosis, MASES@ASE 2018, Montpellier, France, September 3, 2018.",
                "count": 6,
                "papers": [
                    "Applying graph kernels to model-driven engineering problems.",
                    "Learning-based testing for autonomous systems using spatial and temporal requirements.",
                    "Automatically assessing vulnerabilities discovered by compositional analysis.",
                    "A deep learning approach to program similarity.",
                    "A language-agnostic model for semantic source code labeling.",
                    "Fast deployment and scoring of support vector machine models in CPU and GPU."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2018iwor",
                "sub_name": "Proceedings of the 2nd International Workshop on Refactoring, IWoR@ASE 2018, Montpellier, France, September 4, 2018.",
                "count": 8,
                "papers": [
                    "Migrating towards microservices: migration and architecture smells.",
                    "Support for architectural smell refactoring.",
                    "Architectural refactoring as a strategic tool in the evolution of a web-based SaaS product.",
                    "A metamodel for the specification and verification of model refactoring actions.",
                    "Test behaviour detection as a test refactoring safety.",
                    "An empirical investigation of how and why developers rename identifiers.",
                    "A study on developer perception of transformation languages for refactoring.",
                    "Automatic recommendation of move method refactorings using clustering ensembles."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2018amobile",
                "sub_name": "Proceedings of the 1st International Workshop on Advances in Mobile App Analysis, A-Mobile@ASE 2018, Montpellier, France, September 4, 2018.",
                "count": 6,
                "papers": [
                    "Configurations in Android testing: they matter.",
                    "SPEjs: a symbolic partial evaluator for JavaScript.",
                    "Exploring the effects of ad schemes on the performance cost of mobile phones.",
                    "Poking the bear: lessons learned from probing three Android malware datasets.",
                    "Repackman: a tool for automatic repackaging of Android apps.",
                    "AppSeer: discovering flawed interactions among Android components."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "32nd ASE 2017",
        "info": "Urbana, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2017",
                "sub_name": "Proceedings of the 32nd IEEE/ACM International Conference on Automated Software Engineering, ASE 2017, Urbana, IL, USA, October 30 - November 03, 2017.",
                "count": 117,
                "papers": [
                    "Cobra - an interactive static code analyzer.",
                    "Mining structures from massive text data: will it help software engineering?",
                    "Software engineering without borders.",
                    "Systematically testing background services of mobile apps.",
                    "Crowd intelligence enhances automated mobile testing.",
                    "EHBDroid: beyond GUI testing for Android applications.",
                    "Sketch-guided GUI test generation for mobile applications.",
                    "Saying 'hi!' is not enough: mining inputs for effective test generation.",
                    "Learn&Fuzz: machine learning for input fuzzing.",
                    "The impact of continuous integration on other software development practices: a large-scale empirical study.",
                    "Perceived language complexity in GitHub issue discussions and their effect on issue resolution.",
                    "Can automated pull requests encourage software developers to upgrade out-of-date dependencies?",
                    "Are developers aware of the architectural impact of their changes?",
                    "SentiCR: a customized sentiment analysis tool for code review interactions.",
                    "Detecting fragile comments.",
                    "Improving software text retrieval using conceptual knowledge in source code.",
                    "Automatically generating commit messages from diffs using neural machine translation.",
                    "Improving missing issue-commit link recovery using positive and unlabeled data.",
                    "APIBot: question answering bot for API documentation.",
                    "Automatic summarization of API reviews.",
                    "iCoq: regression proof selection for large-scale verification projects.",
                    "More effective interpolations in software model checking.",
                    "Proof-based coverage metrics for formal verification.",
                    "Model checker execution reports.",
                    "Modular verification of interrupt-driven software.",
                    "BProVe: a formal verification framework for business process models.",
                    "Static detection of asymptotic resource side-channel vulnerabilities in web applications.",
                    "PAD: programming third-party web advertisement censorship.",
                    "All about activity injection: threats, semantics, and detection.",
                    "Detecting information flow by mutating input data.",
                    "Automatically assessing crashes from heap overflows.",
                    "Learning to share: engineering adaptive decision-support for online social networks.",
                    "UI driven Android application reduction.",
                    "SimplyDroid: efficient event sequence simplification for Android application.",
                    "Automated cross-platform inconsistency detection for mobile apps.",
                    "In-memory fuzzing for binary code similarity analysis.",
                    "DSIbin: identifying dynamic data structures in C/C++ binaries.",
                    "Towards robust instruction-level trace alignment of binary code.",
                    "Testing intermediate representations for binary analysis.",
                    "Comprehensive failure characterization.",
                    "TrEKer: tracing error propagation in operating system kernels.",
                    "RuntimeSearch: Ctrl+F for a running program.",
                    "Mining implicit design templates for actionable code reuse.",
                    "Exploring regular expression comprehension.",
                    "Automatically assessing code understandability: how far are we?",
                    "Improved query reformulation for concept location using CodeRank and document structures.",
                    "Understanding feature requests by leveraging fuzzy method and linguistic analysis.",
                    "O2O service composition with social collaboration.",
                    "Gremlin-ATL: a scalable model transformation framework.",
                    "Diagnosing assumption problems in safety-critical products.",
                    "Software performance self-adaptation through efficient model predictive control.",
                    "Transfer learning for performance modeling of configurable systems: an exploratory analysis.",
                    "A comprehensive study of real-world numerical bug characteristics.",
                    "A comprehensive study on real world concurrency bugs in Node.js.",
                    "Generating simpler AST edit scripts by considering copy-and-paste.",
                    "Renaming and shifted code in structured merging: looking ahead for precision and performance.",
                    "Semantics-assisted code review: an efficient toolchain and a user study.",
                    "Detecting unknown inconsistencies in web applications.",
                    "Why and how JavaScript developers use linters.",
                    "Automatic testing of symbolic execution engines via program generation and differential testing.",
                    "Floating-point symbolic execution: a case study in n-version programming.",
                    "Rethinking pointer reasoning in symbolic execution.",
                    "Leveraging abstract interpretation for efficient dynamic symbolic execution.",
                    "Tortoise: interactive system configuration repair.",
                    "Contract-based program repair without the contracts.",
                    "ELIXIR: effective object oriented program repair.",
                    "Leveraging syntax-related code for automated program repair.",
                    "Boosting complete-code tool for partial program.",
                    "A language model for statements of software code.",
                    "Context-aware integrated development environment command recommender systems.",
                    "Predicting relevance of change recommendations.",
                    "AnswerBot: automated generation of answer summary to developersź technical questions.",
                    "Recommending crowdsourced software developers in consideration of skill improvement.",
                    "The rise of the (modelling) bots: towards assisted modelling via social networks.",
                    "UNDEAD: detecting and preventing deadlocks in production software.",
                    "Promoting secondary orders of event pairs in randomized scheduling using a randomized stride.",
                    "Parallel bug-finding in concurrent programs via reduced interleaving instances.",
                    "Understanding and overcoming parallelism bottlenecks in ForkJoin applications.",
                    "Quick verification of concurrent programs by iteratively relaxed scheduling.",
                    "Automatic loop-invariant generation and refinement through selective sampling.",
                    "FiB: squeezing loop invariants by interpolation between Forward/Backward predicate transformers.",
                    "SymInfer: inferring program invariants using symbolic states.",
                    "Parsimony: an IDE for example-guided synthesis of lexers and parsers.",
                    "Mining constraints for event-based monitoring in systems of systems.",
                    "Programming bots by synthesizing natural language expressions into API invocations.",
                    "Test suite parallelization in open-source projects: a study on its usage and impact.",
                    "Systematic reduction of GUI test sequences.",
                    "Automatically reducing tree-structured test inputs.",
                    "Synthetic data generation for statistical testing.",
                    "SEALANT: a detection and visualization tool for inter-app security vulnerabilities in Android.",
                    "Visualization support for requirements monitoring in systems of systems.",
                    "A demonstration of simultaneous execution and editing in a development environment.",
                    "TREM: a tool for mining timed regular specifications from system traces.",
                    "ModelWriter: text and model-synchronized document engineering platform.",
                    "Incrementally slicing editable submodels.",
                    "DSSynth: an automated digital controller synthesis tool for physical plants.",
                    "A static analysis tool with optimizations for reachability determination.",
                    "CogniCrypt: supporting developers in using cryptography.",
                    "BProVe: tool support for business process verification.",
                    "taco: a tool to generate tensor algebra kernels.",
                    "STARTS: STAtic regression test selection.",
                    "EventFlowSlicer: a tool for generating realistic goal-driven GUI tests.",
                    "ANDROFLEET: testing WiFi peer-to-peer mobile apps in the large.",
                    "FEMIR: a tool for recommending framework extension examples.",
                    "TiQi: a natural language interface for querying software project data.",
                    "Opiner: an opinion search and summarization engine for APIs.",
                    "Defaultification refactoring: a tool for automatically converting Java methods to default.",
                    "Kobold: web usability as a service.",
                    "IntPTI: automatic integer error repair with proper-type inference.",
                    "Learning effective changes for software projects.",
                    "Characterizing and taming non-deterministic bugs in JavaScript applications.",
                    "Towards API-specific automatic program repair.",
                    "Managing software evolution through semantic history slicing.",
                    "Towards the automatic classification of traceability links.",
                    "Towards a software vulnerability prediction model using traceable code patterns and software metrics.",
                    "Towards search-based modelling and analysis of requirements and architecture decisions.",
                    "Privacy-aware data-intensive applications."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "31st ASE 2016",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2016",
                "sub_name": "Proceedings of the 31st IEEE/ACM International Conference on Automated Software Engineering, ASE 2016, Singapore, September 3-7, 2016.",
                "count": 100,
                "papers": [
                    "Program generation for performance.",
                    "Changing microsoft's build: revolution or evolution.",
                    "The power of probabilistic thinking.",
                    "An empirical investigation into the nature of test smells.",
                    "Evaluating non-adequate test-case reduction.",
                    "Optimizing customized program coverage.",
                    "What makes killing a mutant hard.",
                    "Test case permutation to improve execution time.",
                    "Predicting semantically linkable knowledge in developer online forums via convolutional neural network.",
                    "Testing advanced driver assistance systems using multi-objective search and neural networks.",
                    "Privacy preserving via interval covering based subclass division and manifold learning based bi-directional obfuscation for effort estimation.",
                    "Deep learning code fragments for code clone detection.",
                    "Automatically recommending code reviewers based on their expertise: an empirical comparison.",
                    "Evaluating the evaluations of code recommender systems: a reality check.",
                    "Too much automation? the bellwether effect and its implications for transfer learning.",
                    "Automatic microbenchmark generation to prevent dead code elimination and constant folding.",
                    "Visualization of combinatorial models and test plans.",
                    "Finding access control bugs in web applications with CanCheck.",
                    "SOFIA: an automated security oracle for black-box testing of SQL-injection vulnerabilities.",
                    "Supporting oracle construction via static analysis.",
                    "Local-based active classification of test report to assist crowdsourced testing.",
                    "Multi-objective test report prioritization using image understanding.",
                    "CrowdService: serving the individuals through mobile crowdsourcing and service composition.",
                    "QUICKAR: automatic query reformulation for concept location using crowdsourced knowledge.",
                    "Taming Android fragmentation: characterizing and detecting compatibility issues for Android apps.",
                    "Automated model-based Android GUI testing using multi-level GUI comparison criteria.",
                    "HybriDroid: static analysis framework for Android hybrid applications.",
                    "Locus: locating bugs from software changes.",
                    "Fine-tuning spectrum based fault localisation with frequent method item sets.",
                    "Recommending relevant classes for bug reports using multi-objective search.",
                    "An empirical study on dependence clusters for effort-aware fault-proneness prediction.",
                    "StraightTaint: decoupled offline symbolic taint analysis.",
                    "IncA: a DSL for the definition of incremental program analyses.",
                    "What developers want and need from program analysis: an empirical study.",
                    "DistIA: a cost-effective dynamic impact analysis for distributed programs.",
                    "Radius aware probabilistic testing of deadlocks with guarantees.",
                    "LockPeeker: detecting latent locks in Java APIs.",
                    "Sound static deadlock analysis for C/Pthreads.",
                    "Static race detection for device drivers: the Goblint approach.",
                    "An empirical evaluation of two user interfaces of an interactive program verifier.",
                    "Traceability maintenance: factors and guidelines.",
                    "Usage, costs, and benefits of continuous integration in open-source projects.",
                    "DSL-maps: from requirements to design of domain-specific languages.",
                    "The IDE as a scriptable information system.",
                    "Inferring annotations for device drivers from verification histories.",
                    "Array length inference for C library bindings.",
                    "APEx: automated inference of error specifications for C APIs.",
                    "On essential configuration complexity: measuring interactions in highly-configurable systems.",
                    "Precise semantic history slicing through dynamic delta refinement.",
                    "Goal-conflict detection based on temporal satisfiability checking.",
                    "Symbolic execution of stored procedures in database management systems.",
                    "Conc-iSE: incremental symbolic execution of concurrent software.",
                    "Model-based whitebox fuzzing for program binaries.",
                    "Symbolic execution of complex program driven by machine learning based constraint solving.",
                    "Towards bounded model checking using nonlinear programming solver.",
                    "Identifying domain elements from textual specifications.",
                    "Continuous detection of design flaws in evolving object-oriented programs using incremental multi-pattern matching.",
                    "Efficient detection of inconsistencies in a multi-developer engineering environment.",
                    "How good are the specs? a study of the bug-finding effectiveness of existing Java API specifications.",
                    "Greedy combinatorial test case generation using unsatisfiable cores.",
                    "Towards automatically generating descriptive names for unit tests.",
                    "Applying combinatorial test data generation to big data applications.",
                    "Generating test cases to expose concurrency bugs in Android applications.",
                    "Automatic test image generation using procedural noise.",
                    "Move-optimized source code tree differencing.",
                    "Migrating cascading style sheets to preprocessors by introducing mixins.",
                    "Automatic runtime recovery via error handler synthesis.",
                    "Mining revision histories to detect cross-language clones without intermediates.",
                    "Battery-aware transformations in mobile applications.",
                    "Bugram: bug detection with n-gram language models.",
                    "Mining input grammars from dynamic taints.",
                    "Phrase-based extraction of user opinions in mobile app reviews.",
                    "Practical guidelines for change recommendation using association rule mining.",
                    "Learning a dual-language vector space for domain-specific cross-lingual question retrieval.",
                    "Reflection-aware static analysis of Android apps.",
                    "Relda2: an effective static analysis tool for resource leak detection in Android apps.",
                    "An end-user oriented tool suite for development of mobile applications.",
                    "Model driven design of heterogeneous synchronous embedded systems.",
                    "MACKE: compositional analysis of low-level vulnerabilities with symbolic execution.",
                    "BovInspector: automatic inspection and repair of buffer overflow vulnerabilities.",
                    "CORRECT: code reviewer recommendation at GitHub for Vendasta technologies.",
                    "ProcessPAIR: a tool for automated performance analysis and improvement recommendation in software development.",
                    "CVExplorer: identifying candidate developers by mining and exploring their open source contributions.",
                    "Lightweight collection and storage of software repository data with DataRover.",
                    "Visual contract extractor: a tool for reverse engineering visual contracts using dynamic analysis.",
                    "SuperMod: tool support for collaborative filtered model-driven software product line engineering.",
                    "AnModeler: a tool for generating domain models from textual specifications.",
                    "SimilarTech: automatically recommend analogical libraries across different programming languages.",
                    "TeeVML: tool support for semi-automatic integration testing environment emulation.",
                    "The interactive verification debugger: effective understanding of interactive proof attempts.",
                    "Verifying simulink stateflow model: timed automata approach.",
                    "GUICat: GUI testing as a service.",
                    "An automated collaborative requirements engineering tool for better validation of requirements.",
                    "An extensible framework for variable-precision data-flow analyses in MPS.",
                    "Towards efficient and effective automatic program repair.",
                    "Automated testing and notification of mobile app privacy leak-cause behaviours.",
                    "Factoring requirement dependencies in software requirement selection using graphs and integer programming.",
                    "Statistical analysis of large sets of models.",
                    "Developer targeted analytics: supporting software development decisions with runtime information.",
                    "API recommendation system for software development."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2016swmi",
                "sub_name": "Proceedings of the 5th International Workshop on Software Mining, SoftwareMining@ASE 2016, Singapore, Singapore, September 3, 2016.",
                "count": 8,
                "papers": [
                    "Mining apps for anomalies.",
                    "Code migration with statistical machine translation.",
                    "Mining timed regular expressions from system traces.",
                    "By the power of SMT! mining function contracts to better bounded model checking.",
                    "Automatic prediction of bug fixing effort measured by code churn size.",
                    "Duplicate issue detection for the Android open source project.",
                    "Mining testing questions on stack overflow.",
                    "On the feasibility of detecting cross-platform code clones via identifier similarity."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2016formabs",
                "sub_name": "Proceedings of the International Workshop on Formal Methods for Analysis of Business Systems, ForMABS@ASE 2016, Singapore, Singapore, September 4, 2016.",
                "count": 6,
                "papers": [
                    "Flexible, adaptable, and compliant business systems with dynamic condition response graphs.",
                    "SemFix and beyond: semantic techniques for program repair.",
                    "Business process adaptation using discrete event controller synthesis.",
                    "Static analysis to enable verification and transformation of data-intensive business applications.",
                    "Improving configurable software testing with statistical test selection.",
                    "Domain-independent method of detecting inconsistencies in SBVR-based business rules."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2016iwor",
                "sub_name": "Proceedings of the 1st International Workshop on Software Refactoring, IWoR@ASE 2016, Singapore, Singapore, September 4, 2016.",
                "count": 7,
                "papers": [
                    "Refactoring for software architecture smells.",
                    "Empirical evaluation of code smells in open source projects: preliminary results.",
                    "Measuring refactoring benefits: a survey of the evidence.",
                    "Graph-based approach for detecting impure refactoring from version commits.",
                    "Refactoring verification using model transformation.",
                    "Automated translation among EPSILON languages for performance-driven UML software model refactoring.",
                    "Full application of the extract interface refactoring: conceptual structures in the hands of master students."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2016sctdcp",
                "sub_name": "Proceedings of the 1st International Workshop on Specification, Comprehension, Testing, and Debugging of Concurrent Programs, SCTDCP@ASE 2016, Singapore, Singapore, September 3, 2016.",
                "count": 5,
                "papers": [
                    "An algebraic specification language for organizational behavior of OOMAS.",
                    "A model for systematic monitoring and debugging of starvation bugs in multicore software.",
                    "A leader election based deadlock detection algorithm in distributed systems.",
                    "Dynamic cohesion measurement for distributed system.",
                    "MD-ART: a test case generation method without test oracle problem."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "30th ASE 2015",
        "info": "Lincoln, NE, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2015",
                "sub_name": "30th IEEE/ACM International Conference on Automated Software Engineering, ASE 2015, Lincoln, NE, USA, November 9-13, 2015.",
                "count": 100,
                "papers": [
                    "Learning to Rank for Question-Oriented Software Text Retrieval (T).",
                    "Development Emails Content Analyzer: Intention Mining in Developer Discussions (T).",
                    "CodeExchange: Supporting Reformulation of Internet-Scale Code Queries in Context (T).",
                    "How do Developers Document Database Usages in Source Code? (N).",
                    "Efficient Data Model Verification with Many-Sorted Logic (T).",
                    "Synthesising Interprocedural Bit-Precise Termination Proofs (T).",
                    "Interpolation Guided Compositional Verification (T).",
                    "Crust: A Bounded Verifier for Rust (N).",
                    "General LTL Specification Mining (T).",
                    "Have We Seen Enough Traces? (T).",
                    "Extracting Visual Contracts from Java Programs (T).",
                    "Synergizing Specification Miners through Model Fissions and Fusions (T).",
                    "Evolutionary Robustness Testing of Data Processing Systems Using Models and Data Mutation (T).",
                    "Dynamically Testing GUIs Using Ant Colony Optimization (T).",
                    "Test Analysis: Searching for Faults in Tests (N).",
                    "Array Shadow State Compression for Precise Dynamic Race Detection (T).",
                    "Fast and Precise Symbolic Analysis of Concurrency Bugs in Device Drivers (T).",
                    "JaConTeBe: A Benchmark Suite of Real-World Java Concurrency Bugs (T).",
                    "Generating Fixtures for JavaScript Unit Testing (T).",
                    "Do Automatically Generated Unit Tests Find Real Faults? An Empirical Study of Effectiveness and Challenges (T).",
                    "GRT: Program-Analysis-Guided Random Testing (T).",
                    "Study and Refactoring of Android Asynchronous Programming (T).",
                    "Tracking the Software Quality of Android Applications Along Their Evolution (T).",
                    "Reverse Engineering Mobile Application User Interfaces with REMAUI (T).",
                    "CodeHow: Effective Code Search Based on API Understanding and Extended Boolean Model (E).",
                    "SpyREST: Automated RESTful API Documentation Using an HTTP Proxy Server (N).",
                    "Tracking and Analyzing Cross-Cutting Activities in Developers' Daily Work (N).",
                    "An Automated Framework for Recommending Program Elements to Novices (N).",
                    "Automated Tagging of Software Projects Using Bytecode and Dependencies (N).",
                    "Repairing Programs with Semantic Code Search (T).",
                    "Fixing Recurring Crash Bugs via Analyzing Q&A Sites (T).",
                    "Search-Based Synthesis of Probabilistic Models for Quality-of-Service Software Engineering (T).",
                    "Synthesizing Web Element Locators (T).",
                    "Cost-Efficient Sampling for Performance Prediction of Configurable Systems (T).",
                    "Predicting Delays in Software Projects Using Networked Classification (T).",
                    "Performance Prediction of Configurable Software Systems by Fourier Learning (T).",
                    "Model-Driven Allocation Engineering (T).",
                    "Configuration-Aware Change Impact Analysis (T).",
                    "Automating the Extraction of Model-Based Software Product Lines from Model Variants (T).",
                    "Scaling Size and Parameter Spaces in Variability-Aware Software Performance Models (T).",
                    "Executing Model-Based Tests on Platform-Specific Implementations (T).",
                    "Automated Test Input Generation for Android: Are We There Yet? (E).",
                    "Testing Cross-Platform Mobile App Development Frameworks (T).",
                    "CLAMI: Defect Prediction on Unlabeled Datasets (T).",
                    "Mutation-Based Fault Localization for Real-World Multilingual Programs (T).",
                    "Combining Deep Learning with Information Retrieval to Localize Buggy Files for Bug Reports (N).",
                    "Fuzzing the Rust Typechecker Using CLP (T).",
                    "TCA: An Efficient Two-Mode Meta-Heuristic Algorithm for Combinatorial Test Generation (T).",
                    "Automatically Generating Test Templates from Test Names (N).",
                    "Region and Effect Inference for Safe Parallelism (T).",
                    "Optimistic Shared Memory Dependence Tracing (T).",
                    "Model Checking Task Parallel Programs Using Gradual Permissions (N).",
                    "Practically Tunable Static Analysis Framework for Large-Scale JavaScript Applications (T).",
                    "Static Analysis of JavaScript Web Applications in the Wild via Practical DOM Modeling (T).",
                    "Variable Feature Usage Patterns in PHP (T).",
                    "Learning to Generate Pseudo-Code from Source Code Using Statistical Machine Translation (T).",
                    "Divide-and-Conquer Approach for Multi-phase Statistical Migration for Source Code (T).",
                    "Experiences from Designing and Validating a Software Modernization Transformation (E).",
                    "Exploiting Domain and Program Structure to Synthesize Efficient and Precise Data Flow Analyses (T).",
                    "Access-Path Abstraction: Scaling Field-Sensitive Data-Flow Analysis with Unbounded Access Paths (T).",
                    "Copy and Paste Redeemed (T).",
                    "Detecting Broken Pointcuts Using Structural Commonality and Degree of Interest (N).",
                    "Covert Communication in Mobile Applications (T).",
                    "Static Window Transition Graphs for Android (T).",
                    "Static Analysis of Implicit Control Flow: Resolving Java Reflection and Android Intents (T).",
                    "String Analysis of Android Applications (N).",
                    "Semantic Slicing of Software Version Histories (T).",
                    "Development History Granularity Transformations (N).",
                    "Quantification of Software Changes through Probabilistic Symbolic Execution (N).",
                    "Automatic Detection of Potential Layout Faults Following Changes to Responsive Web Pages (N).",
                    "Developing a DSL-Based Approach for Event-Based Monitoring of Systems of Systems: Experiences and Lessons Learned (E).",
                    "Generating Qualifiable Avionics Software: An Experience Report (E).",
                    "How Verified is My Code? Falsification-Driven Verification (T).",
                    "Mining User Opinions in Mobile App Reviews: A Keyword-Based Approach (T).",
                    "\"What Parts of Your Apps are Loved by Users?\" (T).",
                    "Ensemble Methods for App Review Classification: An Approach for Software Evolution (N).",
                    "The ReMinds Tool Suite for Runtime Monitoring of Systems of Systems.",
                    "DRIVER - A Platform for Collaborative Framework Understanding.",
                    "Tool Support for Analyzing Mobile App Reviews.",
                    "Recommending API Usages for Mobile Apps with Hidden Markov Model.",
                    "FLYAQ: Enabling Non-expert Users to Specify and Generate Missions of Autonomous Multicopters.",
                    "Lazy-CSeq: A Context-Bounded Model Checking Tool for Multi-threaded C-Programs.",
                    "SpyREST in Action: An Automated RESTful API Documentation Tool.",
                    "Clone Merge - An Eclipse Plugin to Abstract Near-Clone C++ Methods.",
                    "Pseudogen: A Tool to Automatically Generate Pseudo-Code from Source Code.",
                    "CIVL: Formal Verification of Parallel Programs.",
                    "Refactorings for Android Asynchronous Programming.",
                    "GRT: An Automated Test Generator Using Orchestrated Program Analysis.",
                    "LED: Tool for Synthesizing Web Element Locators.",
                    "SiPL - A Delta-Based Modeling Framework for Software Product Line Engineering.",
                    "Model-Based Testing of Stateful APIs with Modbat.",
                    "ActivitySpace: A Remembrance Framework to Support Interapplication Information Needs.",
                    "Investigating Program Behavior Using the Texada LTL Specifications Miner.",
                    "The iMPAcT Tool: Testing UI Patterns on Mobile Applications.",
                    "Measuring Object-Oriented Design Principles.",
                    "Stability of Self-Adaptive Software Architectures.",
                    "MetaMod: A Modeling Formalism with Modularity at Its Core.",
                    "A Generic Framework for Concept-Based Exploration of Semi-Structured Software Engineering Data.",
                    "Understanding, Refactoring, and Fixing Concurrency in C#.",
                    "A Message-Passing Architecture without Public Ids Using Send-to-Behavior."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2015w",
                "sub_name": "30th IEEE/ACM International Conference on Automated Software Engineering Workshops, ASE Workshops 2015, Lincoln, NE, USA, November 9-13, 2015.",
                "count": 22,
                "papers": [
                    "Probabilistic Quality Models to Improve Communication and Actionability.",
                    "Data Mining Methods and Cost Estimation Models: Why is it So Hard to Infuse New Ideas?",
                    "Software Development Analytics: Experiences and the Way Forward.",
                    "Actionable = Cluster + Contrast?",
                    "Analytics for Software Project Management - Where are We and Where do We Go?",
                    "A Method to Evaluate Estimates Produced by the Capture-Recapture Model.",
                    "Empirical Analysis on Parallel Tasks in Crowdsourcing Software Development.",
                    "Extending Manual GUI Testing Beyond Defects by Building Mental Models of Software Behavior.",
                    "Testing Approach for Mobile Applications through Reverse Engineering of UI Patterns.",
                    "A Conceptual Framework for the Comparison of Fully Automated GUI Testing Techniques.",
                    "Towards Automatic Constraint Elicitation in Test Design: Preliminary Evaluation Based on Collective Intelligence.",
                    "Which of My Failures are Real? Using Relevance Ranking to Raise True Failures to the Top.",
                    "Comparing Model Coverage and Code Coverage in Model Driven Testing: An Exploratory Study.",
                    "An Automated Contextual Collaboration Approach for Distributed Agile Delivery.",
                    "RepMine: A System for Transferrable Analyses of Collaboration Activities in Software Engineering.",
                    "Using Collective Intelligence to Support Multi-objective Decisions: Collaborative and Online Preferences.",
                    "When It Breaks, It Breaks: How Ecosystem Developers Reason about the Stability of Dependencies.",
                    "CrossPare: A Tool for Benchmarking Cross-Project Defect Predictions.",
                    "DRAT: An Unobtrusive, Scalable Approach to Large Scale Software License Analysis.",
                    "Mining Software Dependency Networks for Agent-Based Simulation of Software Evolution.",
                    "An Empirical Study of Long Method and God Method in Industrial Projects.",
                    "Automatically Mining Negative Code Examples from Software Developer Q & A Forums."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "29th ASE 2014",
        "info": "Vasteras, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2014",
                "sub_name": "ACM/IEEE International Conference on Automated Software Engineering, ASE '14, Vasteras, Sweden - September 15 - 19, 2014.",
                "count": 107,
                "papers": [
                    "Keynote talk: the logic of information design.",
                    "Keynote talk: EasyChair.",
                    "Keynote talk: experiences from developing industrial software systems with long lifecycles.",
                    "Automated analysis of multithreaded programs for performance modeling.",
                    "Behavioral resource-aware model inference.",
                    "Targeted test input generation using symbolic-concrete backward execution.",
                    "Discriminating influences among instructions in a dynamic slice.",
                    "Dompletion: DOM-aware JavaScript code completion.",
                    "Continuous test generation: enhancing continuous integration with automated test generation.",
                    "Leveraging existing tests in automated test generation for web applications.",
                    "Automated unit test generation for classes with environment dependencies.",
                    "Finding HTML presentation failures using image comparison techniques.",
                    "Accelerated test execution using GPUs.",
                    "Seeking the user interface.",
                    "Interrogative-guided re-ranking for question-oriented software text retrieval.",
                    "An empirical study on reducing omission errors in practice.",
                    "Fusion fault localizers.",
                    "Automated variability analysis and testing of an E-commerce site.: an experience report.",
                    "PrefFinder: getting the right preference in configurable software systems.",
                    "MiL testing of highly configurable continuous controllers: scalable search using surrogate models.",
                    "Assertion guided abstraction: a cooperative optimization for dynamic partial order reduction.",
                    "Symbolic state validation through runtime data.",
                    "Verifying self-adaptive applications suffering uncertainty.",
                    "Automated synthesis and deployment of cloud applications.",
                    "Concurrent transformation components using contention context sensors.",
                    "Assigning time budgets to component functions in the design of time-critical automotive systems.",
                    "symMMU: symbolically executed runtime libraries for symbolic memory access.",
                    "Evaluation of string constraint solvers in the context of symbolic execution.",
                    "Incremental symbolic execution for automated test suite maintenance.",
                    "Program analysis for secure big data processing.",
                    "Multi-objective optimization in rule-based design space exploration.",
                    "Understanding performance stairs: elucidating heuristics.",
                    "Fine-grained and accurate source code differencing.",
                    "Combining rule-based and information retrieval techniques to assign software change requests.",
                    "Recommendation system for software refactoring using innovization and interactive dynamic optimization.",
                    "Recommending refactorings based on team co-maintenance patterns.",
                    "Diver: precise dynamic impact analysis using dependence-based trace pruning.",
                    "Automating regression verification.",
                    "An empirical evaluation and comparison of manual and automated test selection.",
                    "Taming test inputs for separation assurance.",
                    "Transferring an automated test generation tool to practice: from pex to fakes and code digger.",
                    "Angels and monsters: an empirical investigation of potential test effectiveness and efficiency improvement from strongly subsuming higher order mutation.",
                    "Scaling exact multi-objective combinatorial optimization by parallelization.",
                    "42 variability bugs in the linux kernel: a qualitative analysis.",
                    "Automating the formalization of product comparison matrices.",
                    "Tracking load-time configuration options.",
                    "Statistical learning approach for mining API usage mappings for code migration.",
                    "Compatibility testing using patterns-based trace comparison.",
                    "Personas in the middle: automated support for creating personas as focal points in feature gathering forums.",
                    "Constructing adaptive configuration dialogs using crowd data.",
                    "Validating ajax applications using a delay-based mutation technique.",
                    "Static, lightweight includes resolution for PHP.",
                    "Information flows as a permission mechanism.",
                    "Improving the accuracy of oracle verdicts through automated model steering.",
                    "Automated domain-specific C verification with mbeddr.",
                    "Pattern-based auto-completion of UML modeling activities.",
                    "Abstraction-aware verifying compiler for yet another MDD.",
                    "Docovery: toward generic automatic document recovery.",
                    "Exact and approximate probabilistic symbolic execution for nondeterministic programs.",
                    "Derailer: interactive security analysis for web applications.",
                    "Tracking down root causes of defects in simulink models.",
                    "The confidence in our k-tails.",
                    "Localization of concurrency bugs using shared memory access pairs.",
                    "Towards self-healing smartphone software via automated patching.",
                    "Minimal strongly unsatisfiable subsets of reactive system specifications.",
                    "Droidmarking: resilient software watermarking for impeding android application repackaging.",
                    "From out-place transformation evolution to in-place model patching.",
                    "Using visual dataflow programming for interactive model comparison.",
                    "NeedFeed: taming change notifications by modeling code relevance.",
                    "Active code search: incorporating user feedback to improve code search relevance.",
                    "Resilient user interface level tests.",
                    "Studying task allocation decisions of novice agile teams with data from agile project management tools.",
                    "PiE: programming in eliza.",
                    "Search-based inference of polynomial metamorphic relations.",
                    "A dynamic analysis to support object-sharing code refactorings.",
                    "Language fuzzing using constraint logic programming.",
                    "Tracing software build processes to uncover license compliance inconsistencies.",
                    "Automatic verification of interactions in asynchronous systems with unbounded buffers.",
                    "Towards an intelligent domain-specific traceability solution.",
                    "Automated requirements analysis for a molecular watchdog timer.",
                    "Formalisation of the integration of behavior trees.",
                    "Automatic early defects detection in use case documents.",
                    "SymCrash: selective recording for reproducing crashes.",
                    "Potential biases in bug localization: do they matter?",
                    "MIMIC: locating and understanding bugs by analyzing mimicked executions.",
                    "Workspace updates of visual models.",
                    "Meta-Model validation and verification with MetaBest.",
                    "A web based UML modeling tool with touch screens.",
                    "SeSAME: modeling and analyzing high-quality service compositions.",
                    "MPAnalyzer: a tool for finding unintended inconsistencies in program source code.",
                    "Firecrow: a tool for web application analysis and reus.",
                    "HUSACCT: architecture compliance checking with rich sets of module and rule types.",
                    "CoCoTest: a tool for model-in-the-loop testing of continuous controllers.",
                    "8Cage: lightweight fault-based test generation for simulink.",
                    "PBGT tool: an integrated modeling and testing environment for pattern-based GUI testing.",
                    "A tool chain for generating the description files of highly available software.",
                    "DupFinder: integrated tool support for duplicate bug report detection.",
                    "Determining the most probable root causes of run-time errors in simulink models.",
                    "Utilizing feature location techniques for feature addition and feature enhancement.",
                    "AugIR: the conceptual design and evaluation of an augmented interaction room.",
                    "A requirements monitoring infrastructure for systems of systems.",
                    "Embrace your issues: compassing the software engineering landscape using bug reports.",
                    "Issues of automated software composition in AI planning.",
                    "A proposal for revisiting coverage testing metrics.",
                    "Variability-aware change impact analysis of multi-language product lines.",
                    "Improvement of applications' stability through robust APIs.",
                    "Model-driven development of content management systems based on Joomla."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2014wise",
                "sub_name": "WISE'14, Proceedings of the 2014 ACM International Workshop on Long-term Industrial Collaboration on Software Engineering, Vasteras, Sweden, September 16, 2014.",
                "count": 12,
                "papers": [
                    "Academia-industry collaboration: ways to a strong and beneficial partnership.",
                    "Embedding research in the industrial field: a case of a transition to a software product line.",
                    "Towards automatic model-in-the-loop testing of electronic vehicle information centers.",
                    "Finding relevant research solutions for practical problems: the serp taxonomy architecture.",
                    "The 4+1 view model of industry-academia collaboration.",
                    "Get the cogs in synch: time horizon aspects of industry-academia collaboration.",
                    "Improving code coverage in android apps testing by exploiting patterns and automatic test case generation.",
                    "A running leap for embedded signal processing to future parallel platforms.",
                    "Foundations for long-term collaborative research.",
                    "Enablers and impediments for collaborative research in software testing: an empirical exploration.",
                    "Action research as a model for industry-academia collaboration in the software engineering context.",
                    "CodeFu: coding competition as a tool for industry university collaboration."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "28th ASE 2013",
        "info": "Silicon Valley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2013",
                "sub_name": "2013 28th IEEE/ACM International Conference on Automated Software Engineering, ASE 2013, Silicon Valley, CA, USA, November 11-15, 2013.",
                "count": 94,
                "papers": [
                    "BOOM: Experiences in language and tool design for distributed systems (keynote).",
                    "The challenges of verification and validation of automated planning systems (keynote).",
                    "Big problems in industry (panel).",
                    "Round-up: Runtime checking quasi linearizability of concurrent data structures.",
                    "Constraint-based automatic symmetry detection.",
                    "Proving MCAPI executions are correct using SMT.",
                    "Efficient data race prediction with incremental reasoning on time-stamped lock history.",
                    "PIEtrace: Platform independent executable trace.",
                    "Improving efficiency of dynamic analysis with dynamic dependence summaries.",
                    "Efficient parametric runtime verification with deterministic string rewriting.",
                    "Identifying execution points for dynamic analyses.",
                    "Operator-based and random mutant selection: Better together.",
                    "Testing properties of dataflow program operators.",
                    "Bita: Coverage-guided, automatic testing of actor programs.",
                    "SABRINE: State-based robustness testing of operating systems.",
                    "BLITZ: Compositional bounded model checking for real-world programs.",
                    "Ranger: Parallel analysis of alloy models by range partitioning.",
                    "Automated verification of pattern-based interaction invariants in Ajax applications.",
                    "Software model checking for distributed systems with selector-based, non-blocking communication.",
                    "A study of repetitiveness of code changes in software evolution.",
                    "Consistency-preserving edit scripts in model versioning.",
                    "JFlow: Practical refactorings for flow-based parallelism.",
                    "Automated planning for software architecture evolution.",
                    "Automatically synthesizing SQL queries from input-output examples.",
                    "SEDGE: Symbolic example data generation for dataflow programs.",
                    "Characteristic studies of loop problems for structural test generation via symbolic execution.",
                    "Entropy-based test generation for improved fault localization.",
                    "Detecting bad smells in source code using change history information.",
                    "Personalized defect prediction.",
                    "Automatic recommendation of API methods from feature requests.",
                    "Variability-aware performance prediction: A statistical learning approach.",
                    "A scalable approach for malware detection through bounded feature space behavior modeling.",
                    "Automatically partition software into least privilege components using dynamic data dependency analysis.",
                    "Finding architectural flaws using constraints.",
                    "Improving bug localization using structured information retrieval.",
                    "Leveraging program equivalence for adaptive program repair: Models and first results.",
                    "Detecting and characterizing semantic inconsistencies in ported code.",
                    "Lightweight control-flow instrumentation and postmortem analysis in support of debugging.",
                    "Characterizing and detecting resource leaks in Android applications.",
                    "Dangling references in multi-configuration and dynamic PHP-based Web applications.",
                    "Dynamically transforming data structures.",
                    "Towards precise metrics for predicting graph query performance.",
                    "TzuYu: Learning stateful typestates.",
                    "Mining branching-time scenarios.",
                    "Measuring the structural complexity of feature models.",
                    "Scalable product line configuration: A straw to break the camel's back.",
                    "Software analytics for incident management of online services: An experience report.",
                    "A comparative analysis of software architecture recovery techniques.",
                    "Towards contextual and on-demand code clone management by continuous monitoring.",
                    "The potential of polyhedral optimization: An empirical study.",
                    "Automated unit testing of large industrial embedded software using concolic testing.",
                    "Minimizing CPU time shortage risks in integrated embedded software.",
                    "Model based test validation and oracles for data acquisition systems.",
                    "Automated verification of interactive rule-based configuration systems.",
                    "AutoComment: Mining question and answer sites for automatic comment generation.",
                    "Detecting system use cases and validations from documents.",
                    "Multi-user variability configuration: A game theoretic approach.",
                    "From comparison matrix to Variability Model: The Wikipedia case study.",
                    "Learning effective query transformations for enhanced requirements trace retrieval.",
                    "Environment rematching: Toward dependability improvement for self-adaptive applications.",
                    "Cloud Twin: Native execution of android applications on the Windows Phone.",
                    "SBFR: A search based approach for reproducing failures of programs with grammar based input.",
                    "PYTHIA: Generating test cases with oracles for JavaScript applications.",
                    "Randomizing regression tests using game theory.",
                    "Automated inference of classifications and dependencies for combinatorial testing.",
                    "Adding context to fault localization with integration coverage.",
                    "Using automatically generated invariants for regression testing and bug localization.",
                    "Class level fault prediction using software clustering.",
                    "ExPort: Detecting and visualizing API usages in large source code repositories.",
                    "Flow Permissions for Android.",
                    "A pattern-based approach to parametric specification mining.",
                    "Semi-automatic generation of metamodels from model sketches.",
                    "Assessing the maturity of requirements through argumentation: A good enough approach.",
                    "Natural language requirements quality analysis based on business domain models.",
                    "Model/code co-refactoring: An MDE approach.",
                    "Recovering model transformation traces using multi-objective optimization.",
                    "Model repair and transformation with Echo.",
                    "Smart Cloud Broker: Finding your home in the clouds.",
                    "OCRA: A tool for checking the refinement of temporal contracts.",
                    "The bounded model checker LLBMC.",
                    "CSeq: A concurrency pre-processor for sequential C verification tools.",
                    "Automated testing of cloud-based elastic systems with AUToCLES.",
                    "Tool support for automatic model transformation specification using concrete visualisations.",
                    "CCmutator: A mutation generator for concurrency constructs in multithreaded C/C++ applications.",
                    "Crushinator: A framework towards game-independent testing.",
                    "Pex4Fun: A web-based environment for educational gaming via automated test generation.",
                    "Developing self-verifying service-based systems.",
                    "TRAM: A tool for transforming textual requirements into analysis models.",
                    "iProbe: A lightweight user-level dynamic instrumentation tool.",
                    "Detecting and fixing emergent behaviors in Distributed Software Systems using a message content independent method.",
                    "Synthesizing fault-tolerant programs from deontic logic specifications.",
                    "Supporting bug investigation using history analysis.",
                    "Context-aware task allocation for distributed agile team.",
                    "Preventing erosion of architectural tactics through their strategic implementation, preservation, and visualization."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "27th ASE 2012",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2012",
                "sub_name": "IEEE/ACM International Conference on Automated Software Engineering, ASE'12, Essen, Germany, September 3-7, 2012.",
                "count": 68,
                "papers": [
                    "The GISMOE challenge: constructing the pareto program surface using genetic programming to find better programs (keynote paper).",
                    "Re-founding software engineering - SEMAT at the age of three (keynote abstract).",
                    "Practical isolation of failure-inducing changes for debugging regression faults.",
                    "Diversity maximization speedup for fault localization.",
                    "Improving the effectiveness of spectra-based fault localization using specifications.",
                    "To what extent could we detect field defects? an empirical study of false negatives in static bug finding tools.",
                    "Diagnosys: automatic generation of a debugging interface to the Linux kernel.",
                    "Duplicate bug report detection with a combination of information retrieval and topic modeling.",
                    "User-aware privacy control via extended static-information-flow analysis.",
                    "Automatic query performance assessment during the retrieval of software artifacts.",
                    "Supporting automated vulnerability analysis using formalized vulnerability signatures.",
                    "A qualitative study on user guidance capabilities in product configuration tools.",
                    "Structured merge with auto-tuning: balancing precision and performance.",
                    "An automated approach to forecasting QoS attributes based on linear and non-linear time series modeling.",
                    "Puzzle-based automatic testing: bringing humans into the loop by solving puzzles.",
                    "Using unfoldings in automated testing of multithreaded programs.",
                    "Runtime monitoring of software energy hotspots.",
                    "Can I clone this piece of code here?",
                    "Predicting recurring crash stacks.",
                    "Automated inference of goal-oriented performance prediction functions.",
                    "Code patterns for automatically validating requirements-to-code traces.",
                    "Unbounded data model verification using SMT solvers.",
                    "Computing repair trees for resolving inconsistencies in design models.",
                    "Supporting automated software re-engineering using re-aspects.",
                    "Supporting operating system kernel data disambiguation using points-to analysis.",
                    "Automatic recovery of statecharts from procedural code.",
                    "Locating distinguishing features using diff sets.",
                    "Slicing and replaying code change history.",
                    "Generating model transformation rules from examples using an evolutionary algorithm.",
                    "Augmented dynamic symbolic execution.",
                    "Using GUI ripping for automated testing of Android applications.",
                    "kbe-anonymity: test data anonymization for evolving programs.",
                    "Selection of regression system tests for security policy evolution.",
                    "Fast and precise points-to analysis with incremental CFL-reachability summarisation: preliminary experience.",
                    "Automatically securing permission-based software by reducing the attack surface: an application to Android.",
                    "Support vector machines for anti-pattern detection.",
                    "Detection of embedded code smells in dynamic web applications.",
                    "Boreas: an accurate and scalable token-based approach to code clone detection.",
                    "Refactorings without names.",
                    "Automated API migration in a user-extensible refactoring tool for Erlang programs.",
                    "Using mobile devices for collaborative requirements engineering.",
                    "Automatically generating and adapting model constraints to support co-evolution of design models.",
                    "Adaptability of model comparison tools.",
                    "Predicting common web application vulnerabilities from input validation and sanitization code patterns.",
                    "Software defect prediction using semi-supervised learning with dimension reduction.",
                    "Healing online service systems via mining historical issue repositories.",
                    "Automated evaluation of syntax error recovery.",
                    "MaramaAI: tool support for capturing and managing consistency of multi-lingual requirements.",
                    "GUITest: a Java library for fully automated GUI robustness testing.",
                    "Observatory of trends in software related microblogs.",
                    "Arcade.PLC: a verification platform for programmable logic controllers.",
                    "Test suite selection based on traceability annotations.",
                    "PuMoC: a CTL model-checker for sequential programs.",
                    "Weave droid: aspect-oriented programming on Android devices: fully embedded or in the cloud.",
                    "Caprice: a tool for engineering adaptive privacy.",
                    "JStereoCode: automatically identifying method and class stereotypes in Java code.",
                    "CHESS: a model-driven engineering tool environment for aiding the development of complex industrial systems.",
                    "SYMake: a build code analysis and refactoring tool for makefiles.",
                    "Quokka: visualising interactions of enterprise software environment emulators.",
                    "Communicating continuous integration servers for increasing effectiveness of automated testing.",
                    "GZoltar: an eclipse plug-in for testing and debugging.",
                    "Semantic patch inference.",
                    "REInDetector: a framework for knowledge-based requirements engineering.",
                    "Formal verification techniques for model transformations specified by-demonstration.",
                    "A model-driven parser generator with reference resolution support.",
                    "Property-preserving program refinement.",
                    "Predicting software complexity by means of evolutionary testing.",
                    "Identifying refactoring sequences for improving software maintainability."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "26th ASE 2011",
        "info": "Lawrence, KS, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2011",
                "sub_name": "26th IEEE/ACM International Conference on Automated Software Engineering (ASE 2011), Lawrence, KS, USA, November 6-10, 2011.",
                "count": 112,
                "papers": [
                    "Wikipedia and how to use it for semantic document representation.",
                    "Unifying testing and analysis through behavioral coverage.",
                    "Automated web application testing using search based software engineering.",
                    "Auto-locating and fix-propagating for HTML validation errors to PHP server-side code.",
                    "Scaling up automated test generation: Automatically generating maintainable regression unit tests for programs.",
                    "Heap cloning: Enabling dynamic symbolic execution of java programs.",
                    "Automatic generation of load tests.",
                    "Symbolic search-based testing.",
                    "Automated documentation inference to explain failed tests.",
                    "Generating program inputs for database application testing.",
                    "Prioritizing tests for fault localization through ambiguity group reduction.",
                    "Identifying future field accesses in exhaustive state space traversal.",
                    "Model checking distributed systems by combining caching and process checkpointing.",
                    "Supporting domain-specific state space reductions through local partial-order reduction.",
                    "Scalable and precise symbolic analysis for atomicity violations.",
                    "DC2: A framework for scalable, scope-bounded software verification.",
                    "Formalizing hardware/software interface specifications.",
                    "Safe asynchronous multicore memory operations.",
                    "A rule-based approach to the semantic lifting of model differences in the context of model versioning.",
                    "A model-driven framework for guided design space exploration.",
                    "Automated extraction of architecture-level performance models of distributed component-based systems.",
                    "Precomputing possible configuration error diagnoses.",
                    "An optimal strategy for algorithmic debugging.",
                    "Localizing SQL faults in database applications.",
                    "Improving automated documentation to code traceability by combining retrieval techniques.",
                    "Iterative mining of resource-releasing specifications.",
                    "Flexible design pattern detection based on feature types.",
                    "Towards more accurate retrieval of duplicate bug reports.",
                    "A topic-based approach for narrowing the search space of buggy files from a bug report.",
                    "Specifying and detecting meaningful changes in programs.",
                    "Self-adaptive software meets control theory: A preliminary approach supporting reliability requirements.",
                    "Generalizing evolutionary coupling with stochastic dependencies.",
                    "Differential precondition checking: A lightweight, reusable analysis for refactoring tools.",
                    "A performance comparison of contemporary algorithmic approaches for automated analysis operations on feature models.",
                    "Finding relevant answers in software forums.",
                    "Software process evaluation: A machine learning approach.",
                    "Local vs. global models for effort estimation and defect prediction.",
                    "Capacity planning for event-based systems using automated performance predictions.",
                    "Ecological inference in empirical software engineering.",
                    "Detection of feature interactions using feature-aware verification.",
                    "Querying source code with natural language.",
                    "Coverage rewarded: Test input generation via adaptation-based programming.",
                    "Mendel: Source code recommendation based on a genetic metaphor.",
                    "Optimizing the automatic test generation by SAT and SMT solving for Boolean expressions.",
                    "Code-based automated program fixing.",
                    "Taming changes With 1.x-Way architecture-implementation mapping.",
                    "Evaluating test selection strategies for end-user specified flow-based applications.",
                    "Towards dynamic backward slicing of model transformations.",
                    "Mining test oracles of web search engines.",
                    "AutoODC: Automated generation of Orthogonal Defect Classifications.",
                    "Observations on the connectedness between requirements-to-code traces and calling relationships for trace validation.",
                    "Proximity based weighting of test cases to improve spectrum based fault localization.",
                    "Slicing feature models.",
                    "Using model checking to analyze static properties of declarative models.",
                    "Finding the merits and drawbacks of software resources from comments.",
                    "Combining search-based and constraint-based testing.",
                    "Stateful testing: Finding more errors in code and contracts.",
                    "Do software engineers benefit from source code navigation with traceability? - An experiment in software change management.",
                    "Automating analysis of qualitative preferences in goal-oriented requirements engineering.",
                    "History slicing.",
                    "Analyzing temporal API usage patterns.",
                    "Isomorphism in model tools and editors.",
                    "A case for alloy annotations for efficient incremental analysis via domain specific solvers.",
                    "Exploring caching for efficient collection operations.",
                    "Tracing requirements to tests with high precision and recall.",
                    "Extracting structured data from natural language documents with island parsing.",
                    "GRoundTram: An integrated framework for developing well-behaved bidirectional model transformations.",
                    "Run-time systems failure prediction via proactive monitoring.",
                    "Towards an approach and framework for test-execution plan derivation.",
                    "Statistical debugging with elastic predicates.",
                    "Diagnosis of software failures using computational geometry.",
                    "GitBAC: Flexible access control for non-modular concerns.",
                    "Client-side web application slicing.",
                    "Supporting activity based computing paradigm in global software development.",
                    "Inferred dependence coverage to support fault contextualization.",
                    "Using model-based assurance to strengthen diagnostic procedures.",
                    "Fault-localization using dynamic slicing and change impact analysis.",
                    "Improving source code search with natural language phrasal representations of method signatures.",
                    "Deviation management during process execution.",
                    "PRECIS: Inferring invariants using program path guided clustering.",
                    "Automated planning for feature model configuration based on stakeholders' business concerns.",
                    "An adaptive approach to impact analysis from change requests to source code.",
                    "Domain and value checking of web application invocation arguments.",
                    "Mixed constraints for test input generation - An initial exploration.",
                    "Enhancing architectural recovery using concerns.",
                    "Search-based fault localization.",
                    "Towards requirements aware systems: Run-time resolution of design-time assumptions.",
                    "Generating essential user interface prototypes to validate requirements.",
                    "Automatically exploring how uncertainty impacts behavior of dynamically adaptive systems.",
                    "iDiff: Interaction-based program differencing tool.",
                    "CloneDifferentiator: Analyzing clones by differentiation.",
                    "Implementing efficient model validation in EMF tools.",
                    "JPF-AWT: Model checking GUI applications.",
                    "The CORE system: Animation and functional correctness of pointer programs.",
                    "APIExample: An effective web search based usage example recommendation system for java APIs.",
                    "BEST: A symbolic testing tool for predicting multi-threaded program failures.",
                    "Decomposing feature models: language, environment, and applications.",
                    "SAUML: A tool for symbolic analysis of UML-RT models.",
                    "TestEra: A tool for testing Java programs using alloy specifications.",
                    "MAJOR: An efficient and extensible tool for mutation analysis in a Java compiler.",
                    "jCT: A Java Code Tomograph.",
                    "Generating realistic test models for model processing tools.",
                    "Guided test visualization: Making sense of errors in concurrent programs.",
                    "The Capture Calculus Toolset.",
                    "A model checking framework for hierarchical systems.",
                    "Automatically detecting the quality of the query and its implications in IR-based concept location.",
                    "Using Formal Concept Analysis to support change analysis.",
                    "A framework for managing uncertainty in self-adaptive software systems.",
                    "Toward consistency checking of natural language temporal requirements.",
                    "Analyzing temporal properties of abstract models.",
                    "Improving spectrum-based fault localization using proximity-based weighting of test cases.",
                    "Automatic assessment of software documentation quality."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "25th ASE 2010",
        "info": "Antwerp, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2010",
                "sub_name": "ASE 2010, 25th IEEE/ACM International Conference on Automated Software Engineering, Antwerp, Belgium, September 20-24, 2010.",
                "count": 87,
                "papers": [
                    "Keynote address: toward compositional software engineering.",
                    "Analyzing security architectures.",
                    "VikiBuilder: end-user specification and generation of visual wikis.",
                    "Software design sketching with calico.",
                    "Automatically documenting program changes.",
                    "Towards automatically generating summary comments for Java methods.",
                    "Automatic detection of nocuous coordination ambiguities in natural language requirements.",
                    "Flexible and scalable consistency checking on product line variability models.",
                    "Variability modeling in the real: a perspective from the operating systems domain.",
                    "RESISTing reliability degradation through proactive reconfiguration.",
                    "Automatic construction of an effective training set for prioritizing static analysis warnings.",
                    "An automated approach for finding variable-constant pairing bugs.",
                    "Deviance from perfection is a better criterion than closeness to evil when identifying risky code.",
                    "Seamlessly integrated, but loosely coupled: building user interfaces from heterogeneous components.",
                    "Tool support for quality-driven development of software architectures.",
                    "MiTV: multiple-implementation testing of user-input validators for web applications.",
                    "Model comparison with GenericDiff.",
                    "Eliminating products to test in a software product line.",
                    "A visual interactive debugger based on symbolic execution.",
                    "Model-driven reverse engineering of legacy graphical user interfaces.",
                    "A two-step technique for extract class refactoring.",
                    "Detecting user-visible failures in AJAX web applications by analyzing users' interaction behaviors.",
                    "Architectural style as an independent variable.",
                    "Text mining in supporting software systems risk assurance.",
                    "JCCD: a flexible and extensible API for implementing custom code clone detectors.",
                    "PeerUnit: a framework for testing peer-to-peer systems.",
                    "Reconfigurable run-time support for distributed service component architectures.",
                    "MoDisco: a generic and extensible framework for model driven reverse engineering.",
                    "Tool support for continuous maintenance of state machine models in program code.",
                    "Reac2o: a runtime for enterprise system models.",
                    "Symbolic PathFinder: symbolic execution of Java bytecode.",
                    "Enumeration refactoring: a tool for automatically converting Java constants to enumerated types.",
                    "Keynote address: the actual implementation will be derived from the formal specification -- KBSA, 1983.",
                    "Verification-driven slicing of UML/OCL models.",
                    "Automated support for repairing input-model faults.",
                    "Security-driven model-based dynamic adaptation.",
                    "JRF-E: using model checking to give advice on eliminating memory model-related bugs.",
                    "A bounded statistical approach for model checking of unbounded until properties.",
                    "Eliminating navigation errors in web applications via model checking and runtime enforcement of navigation state machines.",
                    "Towards mining replacement queries for hard-to-retrieve traces.",
                    "Tool support for essential use cases to better capture software requirements.",
                    "Timesheet assistant: mining and reporting developer effort.",
                    "An experience report on scaling tools for mining software repositories using MapReduce.",
                    "iMashup: assisting end-user programming for the service-oriented web.",
                    "MODA: automated test generation for database applications via mock objects.",
                    "Random unit-test generation with MUT-aware sequence recommendation.",
                    "End-user oriented critic specification for domain-specific visual language tools.",
                    "Checking roundoff errors using counterexample-guided narrowing.",
                    "Realizing architecture frameworks through megamodelling techniques.",
                    "Recovering inter-project dependencies in software ecosystems.",
                    "Automated program repair through the evolution of assembly code.",
                    "Integrating model verification and self-adaptation.",
                    "When to use data from other projects for effort estimation.",
                    "Kadre: domain-specific architectural recovery for scientific software systems.",
                    "Automated SQL query generation for systematic testing of database engines.",
                    "Tag and prune: a pragmatic approach to software product line implementation.",
                    "Reducing estimation uncertainty with continuous assessment: tracking the \"cone of uncertainty\".",
                    "Using transitive changesets to support feature location.",
                    "RuMoR: monitoring and recovery for BPEL applications.",
                    "Model/analyzer: a tool for detecting, visualizing and fixing design errors in UML.",
                    "CoGenTe: a tool for code generator testing.",
                    "Impendulo: debugging the programmer.",
                    "SpecDiff: debugging formal specifications.",
                    "Deriving behavior of multi-user processes from interactive requirements validation.",
                    "Tool support for code generation from a UMLsec property.",
                    "PlayGo: towards a comprehensive tool for scenario based programming.",
                    "REMES tool-chain: a set of integrated tools for behavioral modeling and analysis of embedded systems.",
                    "C2O: a tool for guided decision-making.",
                    "Keynote address: model engineering for model-driven engineering.",
                    "Search-carrying code.",
                    "Solving string constraints lazily.",
                    "Scenario-based and value-based specification mining: better together.",
                    "Test generation to expose changes in evolving programs.",
                    "How did you specify your test suite.",
                    "Dynamic and transparent analysis of commodity production systems.",
                    "Apt-pbo: solving the software dependency problem using pseudo-boolean optimization.",
                    "A sentence-matching method for automatic license identification of source code files.",
                    "Detection of recurring software vulnerabilities.",
                    "Matching dependence-related queries in the system dependence graph.",
                    "PLASMA: a plan-based layered architecture for software model-driven adaptation.",
                    "A program differencing algorithm for verilog HDL.",
                    "Error-avoiding adaptors for black-box software components.",
                    "Automated model grouping.",
                    "Automatic inference of abstract type behavior.",
                    "Extraction and visualization of traceability relationships between documents and source code.",
                    "Model checking graph representation of precise boolean inter-procedural flow analysis.",
                    "The influence of multiple artifacts on the effectiveness of software testing."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2010lwi",
                "sub_name": "Proceedings of the 3rd Workshop on Living with Inconsistencies in Software Development, LWI@ASE 2010, Antwerp, Belgium, September 21st, 2010.",
                "count": 7,
                "papers": [
                    "Approaches to Software Model Inconsistency Management.",
                    "Inconsistency Detection in Distributed Model Driven Software Engineering Environments.",
                    "Resolving Model Inconsistencies with Automated Planning.",
                    "Tolerating Inconsistency in Feature Models.",
                    "New Strategies to Resolve Inconsistencies between Models of Decoupled Tools.",
                    "Reasoning about Consistency in Model Merging.",
                    "Utilizing the Relationships Between Inconsistencies for more Effective Inconsistency Resolution."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "24th ASE 2009",
        "info": "Auckland, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2009",
                "sub_name": "ASE 2009, 24th IEEE/ACM International Conference on Automated Software Engineering, Auckland, New Zealand, November 16-20, 2009.",
                "count": 89,
                "papers": [
                    "A Petri Net Based Debugging Environment for QVT Relations.",
                    "Validating Automotive Control Software Using Instrumentation-Based Verification.",
                    "Semi-automated Test Planning for e-ID Systems by Using Requirements Clustering.",
                    "A Quantum Algorithm for Software Engineering Search.",
                    "Understanding the Value of Software Engineering Technologies.",
                    "Type Inference for Soft-Error Fault-Tolerance Prediction.",
                    "Evaluating the Accuracy of Fault Localization Techniques.",
                    "Spectrum-Based Multiple Fault Localization.",
                    "Towards a Comprehensive Test Suite for Detectors of Design Patterns.",
                    "Improving API Usage through Automatic Detection of Redundant Code.",
                    "Clone-Aware Configuration Management.",
                    "SMT-Based Bounded Model Checking for Embedded ANSI-C Software.",
                    "Static Validation of C Preprocessor Macros.",
                    "Looper: Lightweight Detection of Infinite Loops at Runtime.",
                    "Improving the Efficiency of Dependency Analysis in Logical Decision Models.",
                    "Explicit Concern-Driven Development with ArchEvol.",
                    "Design Rule Hierarchies and Parallelism in Software Development Tasks.",
                    "Automated Test Order Generation for Software Component Integration Testing.",
                    "A Divergence-Oriented Approach to Adaptive Random Testing of Java Programs.",
                    "Adaptive Random Test Case Prioritization.",
                    "Model-Based Customization and Deployment of Eclipse-Based Tools: Industrial Experiences.",
                    "Self-Repair through Reconfiguration: A Requirements Engineering Approach.",
                    "Model Checking of Domain Artifacts in Product Line Engineering.",
                    "Alattin: Mining Alternative Patterns for Detecting Neglected Conditions.",
                    "Mining Temporal Specifications from Object Usage.",
                    "Inferring Resource Specifications from Natural Language API Documentation.",
                    "Specification and Control of Interface Responses to User Input in Rich Internet Applications.",
                    "Code Completion from Abbreviated Input.",
                    "Task-First or Context-First? Tool Integration Revisited.",
                    "Mining Hierarchical Scenario-Based Specifications.",
                    "Automatic Generation of Object Usage Specifications from Large Method Traces.",
                    "Efficient Formalism-Independent Monitoring of Parametric Properties.",
                    "Automatically Recommending Triage Decisions for Pragmatic Reuse Tasks.",
                    "Mining Health Models for Performance Monitoring of Services.",
                    "Inferring Method Effect Summaries for Nested Heap Regions.",
                    "ReAssert: Suggesting Repairs for Broken Unit Tests.",
                    "Cache-Based Model Checking of Networked Applications: From Linear to Branching Time.",
                    "State-Space Coverage Estimation.",
                    "A Framework for State-Space Exploration of Java-Based Actor Programs.",
                    "Symbolic Deadlock Analysis in Concurrent Libraries and Their Clients.",
                    "Precise Data Race Detection in a Relaxed Memory Model Using Heuristic-Based Model Checking.",
                    "A Formal Syntax for Probabilistic Timed Property Sequence Charts.",
                    "Let the Ants Deploy Your Software - An ACO Based Deployment Optimisation Strategy.",
                    "Using String Distances for Test Case Prioritisation.",
                    "Reggae: Automated Test Generation for Programs Using Complex Regular Expressions.",
                    "A Methodology and Framework to Simplify Usability Analysis of Mobile Applications.",
                    "An Open Source-Based Approach to Software Development Infrastructures.",
                    "EA-Analyzer: Automating Conflict Detection in Aspect-Oriented Requirements.",
                    "An Automated Passive Testing Approach for the IMS PoC Service.",
                    "Adding Examples into Java Documents.",
                    "Enhanced Automation for Managing Model and Metamodel Inconsistency.",
                    "Generating Fixes from Object Behavior Anomalies.",
                    "Service Substitution Revisited.",
                    "A Verification-Driven Approach to Traceability and Documentation for Auto-Generated Mathematical Software.",
                    "Towards Augmenting Requirements Models with Preferences.",
                    "Automated Comprehension Tasks in Software Exploration.",
                    "Pointcut Rejuvenation: Recovering Pointcut Expressions in Evolving Aspect-Oriented Software.",
                    "Applications of Simulation and AI Search: Assessing the Relative Merits of Agile vs Traditional Software Development.",
                    "Automating the Implementation of Analysis Concerns in Workflow Applications.",
                    "Static Typing for Ruby on Rails.",
                    "Towards Automating Class-Splitting Using Betweenness Clustering.",
                    "Reducing Features to Improve Bug Prediction.",
                    "Generating Vulnerability Signatures for String Manipulating Programs Using Automata-Based Forward and Backward Symbolic Analyses.",
                    "Weaving Context Sensitivity into Test Suite Construction.",
                    "Optimizing a Structural Constraint Solver for Efficient Software Checking.",
                    "A Case for Automated Debugging Using Data Structure Repair.",
                    "Generation of Simulation Views for Domain Specific Modeling Languages Based on the Eclipse Modeling Framework.",
                    "Using Spectrum-Based Fault Localization for Test Case Grouping.",
                    "Cluster-Based I/O-Efficient LTL Model Checking.",
                    "A Linear Programming Approach for Automated Localization of Multiple Faults.",
                    "Lost in Translation: Forgetful Semantic Anchoring.",
                    "An IDE-based, Integrated Solution to Schema Evolution of Object-Oriented Software.",
                    "KaitoroBase: Visual Exploration of Software Architecture Documents.",
                    "phpModeler - A Web Model Extractor.",
                    "Zoltar: A Toolset for Automatic Fault Localization.",
                    "Supporting Requirements Validation: The EuRailCheck Tool.",
                    "Loopfrog: A Static Analyzer for ANSI-C Programs.",
                    "A Tool Suite for the Generation and Validation of Configurations for Software Availability.",
                    "A Tool for Attributed Goal-Oriented Requirements Analysis.",
                    "Jtop: Managing JUnit Test Cases in Absence of Coverage Information.",
                    "An Automated Tool for Generating UML Models from Natural Language Requirements.",
                    "AOWP: Web-Specific AOP Framework for PHP.",
                    "A Modelling Language for Interactive Web Applications.",
                    "Automated Software Tool Support for Checking the Inconsistency of Requirements.",
                    "A Holistic Approach to Mobile Service Provisioning.",
                    "Secure and Usable Requirements Engineering.",
                    "Goal-Based Testing of Semantic Web Services.",
                    "Migration from Procedural Programming to Aspect Oriented Paradigm.",
                    "Improving Component Dependency Resolution with Soft Constraints, Validation and Verification."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "23rd ASE 2008",
        "info": "L'Aquila, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2008",
                "sub_name": "23rd IEEE/ACM International Conference on Automated Software Engineering (ASE 2008), 15-19 September 2008, L'Aquila, Italy.",
                "count": 93,
                "papers": [
                    "Swarm Verification.",
                    "Reflections on, and Predictions for, Support Systems for the Development of Programs.",
                    "Increasing Test Granularity by Aggregating Unit Tests.",
                    "Random Test Run Length and Effectiveness.",
                    "Program Analysis with Dynamic Precision Adjustment.",
                    "IR-Based Traceability Recovery Processes: An Empirical Comparison of \"One-Shot\" and Incremental Processes.",
                    "Enabling Automated Traceability Maintenance by Recognizing Development Activities Applied to Models.",
                    "Incremental Latent Semantic Indexing for Automatic Traceability Link Evolution Management.",
                    "Automated Verification of Multi-Agent Programs.",
                    "Validating Real Time Specifications using Real Time Event Queue Modeling.",
                    "Automatic Inference of Frame Axioms Using Static Analysis.",
                    "Generating and Evaluating Choices for Fixing Inconsistencies in UML Design Models.",
                    "Mining Scenario-Based Triggers and Effects.",
                    "Refining Real-Time System Specifications through Bounded Model- and Satisfiability-Checking.",
                    "Evaluating Models for Model-Based Debugging.",
                    "Error Reporting Logic.",
                    "Efficient Monitoring of Parametric Context-Free Patterns.",
                    "A Framework for Dynamic Service Discovery.",
                    "A Methodology and Framework for Creating Domain-Specific Development Infrastructures.",
                    "Connecting Programming Environments to Support Ad-Hoc Collaboration.",
                    "Reducing False Positives by Combining Abstract Interpretation and Bounded Model Checking.",
                    "Unit Testing of Flash Memory Device Driver through a SAT-Based Model Checker.",
                    "Effort Estimation in Capturing Architectural Knowledge.",
                    "Test-Suite Augmentation for Evolving Software.",
                    "Reducing the Cost of Path Property Monitoring Through Sampling.",
                    "Query-Aware Test Generation Using a Relational Constraint Solver.",
                    "Inferring Finite-State Models with Temporal Constraints.",
                    "Type-Checking Software Product Lines - A Formal Approach.",
                    "Using Simulation to Investigate Requirements Prioritization Strategies.",
                    "Automated Aspect Recommendation through Clustering-Based Fan-in Analysis.",
                    "Predictive Typestate Checking of Multithreaded Java Programs.",
                    "Improving Structural Testing of Object-Oriented Programs via Integrating Evolutionary Testing and Symbolic Execution.",
                    "Automatic Debugging of Concurrent Programs through Active Sampling of Low Dimensional Random Projections.",
                    "How Program History Can Improve Code Completion.",
                    "SpotWeb: Detecting Framework Hotspots and Coldspots via Mining Open Source Code on the Web.",
                    "Generic Patch Inference.",
                    "Configuration Lifting: Verification meets Software Configuration.",
                    "Product Line Tools are Product Lines Too: Lessons Learned from Developing a Tool Suite.",
                    "A Specification Language for Static Analysis of Student Exercises.",
                    "A Case Study on the Automatic Composition of Network Application Mashups.",
                    "Predicting Effectiveness of Automatic Testing Tools.",
                    "Distributed Constraints Maintenance in Collaborative UML Modeling Environments.",
                    "Software Cost Estimation using Fuzzy Decision Trees.",
                    "Rhizome: A Feature Modeling and Generation Platform.",
                    "Combining the Analysis of Spatial Layout and Text to Support Design Exploration.",
                    "Using Cluster Analysis to Improve the Design of Component Interfaces.",
                    "Augmenting Counterexample-Guided Abstraction Refinement with Proof Templates.",
                    "An Assume Guarantee Verification Methodology for Aspect-Oriented Programming.",
                    "Living with the Law: Can Automation give us Moore with Less?",
                    "VCR: Virtual Capture and Replay for Performance Testing.",
                    "A Case for Automatic Exception Handling.",
                    "DiffGen: Automated Regression Unit-Test Generation.",
                    "An Automated Test Code Generation Method for Web Applications using Activity Oriented Approach.",
                    "The Consistency of Web Conversations.",
                    "Testing Peers' Volatility.",
                    "Automated Continuous Integration of Component-Based Software: An Industrial Experience.",
                    "A Two-Step Approach for Modelling Flexibility in Software Processes.",
                    "A Generic Approach for Class Model Normalization.",
                    "XE (eXtreme Editor) - Bridging the Aspect-Oriented Programming Usability Gap.",
                    "Rapid: Identifying Bug Signatures to Support Debugging Activities.",
                    "Heuristics for Scalable Dynamic Test Generation.",
                    "Managing Models through Macromodeling.",
                    "Cleman: Comprehensive Clone Group Evolution Management.",
                    "Composition of Qualitative Adaptation Policies.",
                    "A System for Supporting Development of Large Scaled Rich Internet Applications.",
                    "Discovering Patterns of Change Types.",
                    "Model-Driven Development of Mobile Personal Health Care Applications.",
                    "Enforcing Structural Regularities in Source Code using IntensiVE.",
                    "QuARS Express - A Tool Demonstration.",
                    "MTSA: The Modal Transition System Analyser.",
                    "MaramaEML: An Integrated Multi-View Business Process Modelling Environment with Tree-Overlays, Zoomable Interfaces and Code Generation.",
                    "PtYasm: Software Model Checking with Proof Templates.",
                    "Semi-Automating Pragmatic Reuse Tasks.",
                    "DUALLY: A framework for Architectural Languages and Tools Interoperability.",
                    "Automated Mapping from Goal Models to Self-Adaptive Systems.",
                    "ADDSS: Architecture Design Decision Support System Tool.",
                    "APPAREIL: A Tool for Building Automated Program Translators Using Annotated Grammars.",
                    "Rapid Model-Driven Prototyping and Verification of High-Integrity Real-Time Systems.",
                    "Save-IDE: An Integrated Development Environment for Building Predictable Component-Based Embedded Systems.",
                    "The Clem Toolkit.",
                    "Tool Support for Parametric Analysis of Large Software Simulation Systems.",
                    "ReqsCov: A Tool for Measuring Test-Adequacy over Requirements.",
                    "AspectM: UML-Based Extensible AOM Language.",
                    "Tools for Traceability in Secure Software Development.",
                    "Unifying Analysis Tools with Rosetta.",
                    "Model-Driven Development of Mobile Applications.",
                    "Automated Web Performance Analysis.",
                    "Automatic Test Generation for LUSTRE/SCADE Programs.",
                    "Feature Interaction Detection in the Automotive Domain.",
                    "Towards Good Enough Testing: A Cognitive-Oriented Approach Applied to Infotainment Systems.",
                    "ARAMIS 2008: The First Int. Workshop on Automated engineeRing of Autonomic and run-tiMe evolvIng Systems.",
                    "First International Workshop on Social Software Engineering and Applications (SoSEA 2008).",
                    "4th International ERCIM Workshop on Software Evolution and Evolvability (Evol'08)."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2008w",
                "sub_name": "23rd IEEE/ACM International Conference on Automated Software Engineering - Workshop Proceedings (ASE Workshops 2008), 15-16 September 2008, L'Aquila, Italy.",
                "count": 34,
                "papers": [
                    "Algorithms for efficient symbolic detection of faults in context-aware applications.",
                    "A development process for context-aware adaptive services.",
                    "Building autonomic components: The SelfLets approach.",
                    "Self-healing strategies for component integration faults.",
                    "Incremental verification of inductive invariants for the run-time evolution of self-adaptive software-intensive systems.",
                    "Architecture support for runtime integration and verification of component-based Systems of Systems.",
                    "SAVVY-WS at a glance: Supporting verifiable dynamic service compositions.",
                    "Introducing service-oriented coverage testing.",
                    "PLASTIC: Providing lightweight & adaptable service technology for pervasive information & communication.",
                    "SHADOWS: Self-healing complex software systems.",
                    "Towards supporting evolution of service-oriented architectures through quality impact prediction.",
                    "A survey of social software engineering.",
                    "Bridging ontologies and folksonomies to leverage knowledge sharing on the social Web: A brief survey.",
                    "Social thinking to design social software: A course experience report.",
                    "Mashups and modularity: Towards secure and reusable web applications.",
                    "genSpace: Exploring social networking metaphors for knowledge sharing and scientific collaborative work.",
                    "Exploiting social software to build open source communities.",
                    "Incorporating social software into distributed agile development environments.",
                    "Utilizing Firm-Hosted Online Communities: Research challenges and needs.",
                    "Introduction to the 4th international ERCIM workshop on software evolution and evolvability (Evol '08).",
                    "Towards software analysis as a service.",
                    "Exploring the composition of unit test suites.",
                    "Raising healthy software systems.",
                    "Dependence Anti Patterns.",
                    "Software migration projects in Italian industry: Preliminary results from a state of the practice survey.",
                    "Using n-grams to rapidly characterise the evolution of software code.",
                    "Becoming responsive to service usage and performance changes by applying service feedback metrics to software maintenance.",
                    "On the nature of commits.",
                    "Architecting for evolvability by means of traceability and features.",
                    "Using dependency model to support software architecture evolution.",
                    "European Laboratory for Software Evolution (ELSE) : Vision statement.",
                    "Position paper: Meaningful updates to executing programs.",
                    "Evaluating the relation between changeability decay and the characteristics of clones and methods.",
                    "A specialisation of the SQuaRE quality model for the evaluation of the software evolution and maintenance activity."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "22nd ASE 2007",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2007",
                "sub_name": "22nd IEEE/ACM International Conference on Automated Software Engineering (ASE 2007), November 5-9, 2007, Atlanta, Georgia, USA.",
                "count": 102,
                "papers": [
                    "Toward automated software development.",
                    "Specifying and verifying software.",
                    "The embarrassing truth about software automation and what should be done about it.",
                    "Scalable automatic test data generation from modeling diagrams.",
                    "Exploring the neighborhood with dora to expedite software maintenance.",
                    "Netstub: a framework for verification of distributed java applications.",
                    "Modeling bug report quality.",
                    "Diconic addition of failsafe fault-tolerance.",
                    "Ensuring consistency in long running transactions.",
                    "Assertion-based repair of complex data structures.",
                    "Automatic code stylizing.",
                    "Keyword programming in java.",
                    "Towards supporting awareness of indirect conflicts across software configuration management workspaces.",
                    "Combined static and dynamic mutability analysis.",
                    "Sequential circuits for program analysis.",
                    "Residual dynamic typestate analysis exploiting static analysis: results to reformulate and reduce the cost of dynamic analysis.",
                    "Directed test generation using symbolic grammars.",
                    "Nighthawk: a two-level genetic-random unit test data generator.",
                    "An aspect-oriented weaving mechanism based on component and connector architecture.",
                    "Towards automatic model synchronization from model transformations.",
                    "An automated model-based debugging approach.",
                    "Context-aware statistical debugging: from bug predictors to faulty control flow paths.",
                    "Object ownership profiling: a technique for finding and fixing memory leaks.",
                    "Parseweb: a programmer assistant for reusing open source code on the web.",
                    "Automatic extraction of framework-specific models from framework-based application code.",
                    "Pallino: automation to support regression test selection for cots-based applications.",
                    "Feature location via information retrieval based filtering of a single scenario execution trace.",
                    "Clustering support for automated tracing.",
                    "Inferring structural patterns for concern traceability in evolving software.",
                    "Finding errors in components that exchange xml data.",
                    "A dynamic birthmark for java.",
                    "Effective memory protection using dynamic tainting.",
                    "An automated approach to monitoring and diagnosing requirements.",
                    "The business case for automated software engineering.",
                    "Testing concurrent programs using value schedules.",
                    "Effective random testing of concurrent programs.",
                    "Automated gui testing guided by usage profiles.",
                    "Efficiently monitoring data-flow test coverage.",
                    "Synthesizing client load models for performance engineering via web crawling.",
                    "Synthesis of test purpose directed reactive planning tester for nondeterministic systems.",
                    "Towards automated consistency checks of product line requirements specifications.",
                    "Automated detection of api refactorings in libraries.",
                    "Improving evolutionary class testing in the presence of non-public methods.",
                    "Behavioral adaptation of component compositions based on process algebra encodings.",
                    "A buffer overflow benchmark for software model checkers.",
                    "Checking threat modeling data flow diagrams for implementation conformance and security.",
                    "Coevolving programs and unit tests from their specification.",
                    "Combining environment generation and slicing for modular software model checking.",
                    "Covering array sampling of input event sequences for automated gui testing.",
                    "Direct-dependency-based software compatibility testing.",
                    "Driving the selection of cots components on the basis of system requirements.",
                    "Efficient unit test case minimization.",
                    "An energy consumption framework for distributed java-based systems.",
                    "Evacon: a framework for integrating evolutionary and concolic testing for object-oriented programs.",
                    "Extracting rights and obligations from regulations: toward a tool-supported process.",
                    "Extraction of bug localization benchmarks from history.",
                    "Feature interaction analysis: a maintenance perspective.",
                    "A framework and tool supports for testing modularity of software design.",
                    "Improving uml profile design practices by leveraging conceptual domain models.",
                    "An infrastructure for autonomic system development: the selflet approach.",
                    "Iterative model-driven development of adaptable service-based applications.",
                    "An approach to mining call-usage patternswith syntactic context.",
                    "Mining concepts from code with probabilistic topic models.",
                    "Mining modal scenario-based specifications from execution traces of reactive systems.",
                    "Model-driven derivation of product architectures.",
                    "Modular and generic programming with interpreterlib.",
                    "Reducing irrelevant trace variations.",
                    "Rteq: modeling and validating infinite-state hard-real-time systems.",
                    "IMP: a meta-tooling platform for creating language-specific ides in eclipse.",
                    "Scheduling of conflicting refactorings to promote quality improvement.",
                    "An evaluation scheme of adaptive configuration techniques.",
                    "Assisting potentially-repetitive small-scale changes via semi-automated heuristic search.",
                    "Model checking concurrent linux device drivers.",
                    "Test automation for kernel code and disk arrays with virtual devices.",
                    "Towards leveraging model transformation to support model-based testing.",
                    "Unit testing concurrent software.",
                    "Validating system properties exhibited in execution traces.",
                    "Verifying C++ with STL containers via predicate abstraction.",
                    "CodeGenie: using test-cases to search and reuse source code.",
                    "Decor: a tool for the detection of design defects.",
                    "DESERT: a decentralized monitoring tool generator.",
                    "Formal specification generator for KAOS: model transformation approach to generate formal specifications from KAOS requirements models.",
                    "Integrated tool support for software product line engineering.",
                    "Mastering combinatorial explosion with the tobias-2 test generator.",
                    "Smart: a tool for application reference testing.",
                    "Test suite reduction and prioritization with call trees.",
                    "The eureka tool for software model checking.",
                    "Tool support for the compile-time execution structure of object-oriented programs with ownership annotations.",
                    "Tools for model-based security engineering: models vs. code.",
                    "UMLtoCSP: a tool for the formal verification of UML/OCL models using constraint programming.",
                    "Visualizing clone detection results.",
                    "Adaptation hiding modularity.",
                    "Automating the identification of variability realisation techniques from feature models.",
                    "Improving change prediction with fine-grained source code mining.",
                    "Using information retrieval to support design of incremental change of software.",
                    "Using traceability to support model-based regression testing.",
                    "Concolic testing.",
                    "Tutorial on JML, the java modeling language.",
                    "Empirical research methods for software engineering.",
                    "Software reuse and evolution with generative techniques.",
                    "Meta tools for implementing domain specific visual languages.",
                    "Rosetta: language support for system-level design."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "21st ASE 2006",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2006",
                "sub_name": "21st IEEE/ACM International Conference on Automated Software Engineering (ASE 2006), 18-22 September 2006, Tokyo, Japan.",
                "count": 69,
                "papers": [
                    "Preface.",
                    "Conference Committee.",
                    "Steering Committee.",
                    "Program Committee.",
                    "Expert Reviewer Panel.",
                    "Introduction to Tool Demonstrations.",
                    "Verifying Specifications with Proof Scores in CafeOBJ.",
                    "Winning the DARPA Grand Challenge: A Robot Race through the Mojave Desert.",
                    "Automatic Property Checking for Software: Past, Present and Future.",
                    "Automated Information Aggregation for Scaling Scale-Resistant Services.",
                    "Generating Domain-Specific Visual Language Editors from High-level Tool Specifications.",
                    "An Automated Formal Approach to Managing Dynamic Reconfiguration.",
                    "Differencing and Merging of Architectural Views.",
                    "An Empirical Comparison of Automated Generation and Classification Techniques for Object-Oriented Unit Testing.",
                    "Command-Form Coverage for Testing Database Applications.",
                    "Automatic Identification of Bug-Introducing Changes.",
                    "Modularity Analysis of Logical Design Models.",
                    "A Portable Compiler-Integrated Approach to Permanent Checking.",
                    "Integrating and Scheduling an Open Set of Static Analyses.",
                    "Reverse Engineering of Design Patterns from Java Source Code.",
                    "ArchTrace: Policy-Based Support for Managing Evolving Architecture-to-Implementation Traceability Links.",
                    "Automating Software Traceability in Very Small Companies: A Case Study and Lessons Learne.",
                    "Bogor/Kiasan: A k-bounded Symbolic Execution for Checking Strong Heap Properties of Open Systems.",
                    "Security Analysis of Crypto-based Java Programs using Automated Theorem Provers.",
                    "Accurate Centralization for Applying Model Checking on Networked Applications.",
                    "Using Decision Trees to Predict the Certification Result of a Build.",
                    "Managing the Complexity of Large Free and Open Source Package-Based Software Distributions.",
                    "Concurrent Engineering support in Software Engineering.",
                    "Mining Aspects from Version History.",
                    "Identifying Refactorings from Source-Code Changes.",
                    "Sieve: A Tool for Automatically Detecting Variations Across Program Versions.",
                    "From Capability Specifications to Code for Multi-Agent Software.",
                    "An Instant Message-Driven User Interface Framework for Thin Client Applications.",
                    "Using communicative acts in interaction design specifications for automated synthesis of user interfaces.",
                    "Annotation Inference for Safety Certification of Automatically Generated Code (Extended Abstract).",
                    "A Unified Model for Product Data Management and Software Configuration Management.",
                    "Human-Friendly Line Routing for Hierarchical Diagrams.",
                    "Contradiction Finding and Minimal Recovery for UML Class Diagrams.",
                    "Programming Language Inherent Support for Constrained XML Schema Definition Data Types and OWL DL.",
                    "A methodology for automated test generation guided by functional coverage constraints at specification level.",
                    "An Automated Approach for Goal-driven, Specification-based Testing.",
                    "Effective Generation of Interface Robustness Properties for Static Analysis.",
                    "Automatic Generation of Detection Algorithms for Design Defects.",
                    "Software Library Usage Pattern Extraction Using a Software Model Checker.",
                    "Automated Round-trip Software Engineering in Aspect Weaving Systems.",
                    "Towards Automatic Assertion Refinement for Separation Logic.",
                    "Automated Reasoning on Aspects Interactions.",
                    "Detecting Precedence-Related Advice Interference.",
                    "Round-Trip Engineering of Framework-Based Software using Framework-Specific Modeling Languages.",
                    "Integrated Variability Modeling of Features and Architecture in Software Product Line Engineering.",
                    "Software Connectors for Highly Distributed and Voluminous Data Intensive Systems.",
                    "Coverage Metrics to Measure Adequacy of Black-Box Test Suites.",
                    "Management of Incomplete and Inconsistent Views.",
                    "Energy-Awareness in Distributed Java-Based Software Systems.",
                    "LSS: A Tool for Large Scale Scenarios.",
                    "A new web browser including a transferable function to Ajax codes.",
                    "Tobias-Z: An executable formal specification of a test generator.",
                    "Model-driven Monitoring: Generating Assertions from Visual Contracts.",
                    "The Rearranger - A New Assembler Utility.",
                    "TOPCASED Combining Formal Methods with Model-Driven Engineering.",
                    "UML-based Service Discovery Tool.",
                    "Automated Verification Tool for DHTML.",
                    "Mock-object generation with behavior.",
                    "Domain-specific Model Checking Using The Bogor Framework.",
                    "Testing Tools and Techniques: A Mini-Tutorial on Evaluation Methods for ASE.",
                    "2nd Asian Workshop on Aspect-Oriented Software Development (AOAsia).",
                    "Second International Workshop on Supporting Knowledge Collaboration in Software Development (KCSD2006).",
                    "Japanese Workshop on Leveraging Web2.0 Technologies in Software Development Environments (WebSDE).",
                    "Japanese Workshop on Requirements Engineering Tools (JWRET)."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th ASE 2005",
        "info": "Long Beach, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2005",
                "sub_name": "20th IEEE/ACM International Conference on Automated Software Engineering (ASE 2005), November 7-11, 2005, Long Beach, CA, USA.",
                "count": 81,
                "papers": [
                    "The power of software.",
                    "Virtual humans: lessons learned in integrating a large-scale AI project.",
                    "Designing and implementing a family of intrusion detection systems.",
                    "Exploiting predicate structure for efficient reachability detection.",
                    "Application of design for verification with concurrency controllers to air traffic control software.",
                    "Efficient temporal-logic query checking for presburger systems.",
                    "A component model for internet-scale applications.",
                    "Automating the performance management of component-based enterprise systems through the use of redundancy.",
                    "UMLDiff: an algorithm for object-oriented design differencing.",
                    "Identifying traits with formal concept analysis.",
                    "Precise identification of composition relationships for UML class diagrams.",
                    "On dynamic feature location.",
                    "Blowtorch: a framework for firewall test automation.",
                    "An analysis of rule coverage as a criterion in generating minimal test suites for grammar-based software.",
                    "Automatic test factoring for java.",
                    "ClassSheets: automatic generation of spreadsheet applications from object-oriented specifications.",
                    "Generation of visual editors as eclipse plug-ins.",
                    "Clearwater: extensible, flexible, modular code generation.",
                    "Secure sharing between untrusted users in a transparent source/binary deployment model.",
                    "Automating experimentation on distributed testbeds.",
                    "AMNESIA: analysis and monitoring for NEutralizing SQL-injection attacks.",
                    "Timna: a framework for automatically combining aspect mining analyses.",
                    "A parameterized interpreter for modeling different AOP mechanisms.",
                    "A generic approach to supporting diagram differencing and merging for collaborative design.",
                    "Visualization-based analysis of quality for large-scale software systems.",
                    "Automatic verification of design patterns in Java.",
                    "Optimized run-time race detection and atomicity checking using partial discovered types.",
                    "Reasoning about real-time statecharts in the presence of semantic variations.",
                    "Automated replay and failure detection for web applications.",
                    "Locating faulty code using failure-inducing chops.",
                    "Empirical evaluation of the tarantula automatic fault-localization technique.",
                    "Automated test generation for engineering applications.",
                    "Let's agree to disagree.",
                    "A similarity-aware approach to testing based fault localization.",
                    "Process support to help novices design software faster and better.",
                    "The PLUSS toolkit - extending telelogic DOORS and IBM-rational rose to support product line use case modeling.",
                    "A strategy for efficient verification of relational specifications, based on monotonicity analysis.",
                    "Quasi-random testing.",
                    "Constraint-based test data generation in the presence of stack-directed pointers.",
                    "QoS-aware dynamic service composition in ambient intelligence environments.",
                    "A visual language and environment for composing web services.",
                    "Learning to verify branching time properties.",
                    "Simon: modeling and analysis of design space structures.",
                    "Lattice-based adaptive random testing.",
                    "A unified fitness function calculation rule for flag conditions to improve evolutionary testing.",
                    "A threat-driven approach to modeling and verifying secure software.",
                    "Automated path generation for software fault localization.",
                    "EA-Miner: a tool for automating aspect-oriented requirements identification.",
                    "yagg: an easy-to-use generator for structured test inputs.",
                    "Determining the cost-quality trade-off for automated software traceability.",
                    "A uniform deductive approach for parameterized protocol safety.",
                    "A component-based development framework for supporting functional and non-functional analysis in control system design.",
                    "A rigorous approach for proving model refactorings.",
                    "Compositional reasoning for port-based distributed systems.",
                    "Model-based self-monitoring embedded programs with temporal logic specifications.",
                    "Specialization and extrapolation of software cost models.",
                    "NFRs-aware architectural evolution of component-based software.",
                    "Code security analysis with assertions.",
                    "Data mining and cross-checking of execution traces: a re-interpretation of Jones, Harrold and Stasko test information.",
                    "Properties and scopes in web model checking.",
                    "Synthesis of correct and distributed adaptors for component-based systems: an automatic approach.",
                    "A context-sensitive structural heuristic for guided search model checking.",
                    "Test input generation for red-black trees using abstraction.",
                    "Testing in resource constrained execution environments.",
                    "Prufrock: a framework for constructing polytypic theorem provers.",
                    "Bamboo: an architecture modeling and code generation framework for configuration management systems.",
                    "Using communicative acts in high-level specifications of user interfaces for their automated synthesis.",
                    "A tool for automatic UML model consistency checking.",
                    "Automated population of causal models for improved software risk assessment.",
                    "Introduction to doctoral symposium.",
                    "Automated generation of testing tools for domain-specific languages.",
                    "Constructing interaction test suites with greedy algorithms.",
                    "Verifying the correctness of hume programs: an approach combining deductive and algorithmic reasoning.",
                    "A model transformation approach to automatic model construction and evolution.",
                    "Formal support for merging and negotiation.",
                    "In regression testing selection when source code is not available.",
                    "Specification and automated processing of security requirements (SAPS'05).",
                    "Software security assurance tools, techniques and metrics (SSATTM).",
                    "3rd international workshop on traceability in emerging forms of software engineering (TEFSE 2005).",
                    "Software certificate management (SoftCeMent'05).",
                    "2nd Workshop on the state of the art in automated software engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/kbse/2005tefse",
                "sub_name": "The 3rd International Workshop on Traceability in Emerging Forms of Software Engineering, co-located with the ASE 2005 Conference, TEFSE@ASE 2005, Long Beach, CA, USA, November 88, 2005.",
                "count": 13,
                "papers": [
                    "A value-based approach for understanding cost-benefit trade-offs during automated software traceability.",
                    "Textual and behavioral views of function changes.",
                    "Toward improved traceability of non-functional requirements.",
                    "Humans in the traceability loop: can't live with 'em, can't live without 'em.",
                    "Using scenarios to support traceability.",
                    "UML formalization is a traceability problem.",
                    "Reconstructing requirements coverage views from design and test using traceability recovery via LSI.",
                    "Traceability in viewpoint merging: a model management perspective.",
                    "A reusable traceability framework using patterns.",
                    "When and how to visualize traceability links?",
                    "Concordance, conformance, versions, and traceability.",
                    "An XML based approach to support the evolution of model-to-model traceability links.",
                    "On feature traceability in object oriented programs."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "19th ASE 2004",
        "info": "Linz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2004",
                "sub_name": "19th IEEE International Conference on Automated Software Engineering (ASE 2004), 20-25 September 2004, Linz, Austria.",
                "count": 65,
                "papers": [
                    "A Differencing Algorithm for Object-Oriented Programs.",
                    "Data-Mining Synthesised Schedulers for Hard Real-Time Systems.",
                    "Automating Traceability for Generated Software Artifacts .",
                    "Experiences Integrating and Scaling a Performance Test Bed Generator with an Open Source CASE Tool.",
                    "Computational Framework for Supporting Software Inspections.",
                    "Validating Personal Requirements by Assisted Symbolic Behavior Browsing .",
                    "Automated Support for Framework Selection and Customization.",
                    "Adaptable Concern-Based Framework Specialization in UML.",
                    "ScriptEase: Generative Design Patterns for Computer Role-Playing Games.",
                    "Modeling Web-Based Dialog Flows for Automatic Dialog Control .",
                    "Establishment of Automated Regression Testing at ABB: Industrial Experience Report on 'Avoiding the Pitfalls'.",
                    "Property-Oriented Test Generation from UML Statecharts.",
                    "Scalable Approach to User-Session based Testing of Web Applications through Concept Analysis.",
                    "Inferring Specifications to Detect Errors in Code.",
                    "Analyzing Interaction Orderings with Model Checking.",
                    "Verifying Interactive Web Programs.",
                    "Test-Suite Reduction for Model Based Tests: Effects on Test Quality and Implications for Testing.",
                    "Using Transient/Persistent Errors to Develop Automated Test Oracles for Event-Driven Software.",
                    "Rostra: A Framework for Detecting Redundant Object-Oriented Unit Tests.",
                    "Automated Data Mapping Specification via Schema Heuristics and User Interaction.",
                    "Dataflow Language for Scriptable Debugging.",
                    "Automatic Method Completion.",
                    "Consistency Checking in an Infrastructure for Large-Scale Generative.",
                    "Verifiable Concurrent Programming Using Concurrency Controllers.",
                    "Parameterized Interfaces for Open System Verification of Product Lines.",
                    "An Architecture for Generating Web-Based, Thin-Client Diagramming Tools.",
                    "A Statistical Model to Locate Faults at Input Level.",
                    "Helping Object-Oriented Framework Use and Evaluation by means of Historical Use Information.",
                    "Heuristic Search with Reachability Tests for Automated Generation of Test Programs.",
                    "COMPASS: Tool-Supported Adaptation of Interactions.",
                    "On-the-Fly Generation of K-Path Tests for C Functions.",
                    "Case Study in JML-Based Software Validation.",
                    "Automated Performance Validation of Software Design: An Industrial Experience.",
                    "CHET: A System for Checking Dynamic Specifications.",
                    "From Testing to Diagnosis: An Automated Approach.",
                    "Aspect Mining Using Event Traces.",
                    "Case Study of Coverage-Checked Random Data Structure Testing.",
                    "Mapping Template Semantics to SMV.",
                    "Refactoring Use Case Models on Episodes.",
                    "Understanding Aspects via Implicit Invocation.",
                    "Evaluating Clone Detection Techniques from a Refactoring Perspective.",
                    "Combining the Box Structure Development Method and CSP.",
                    "Using a Genetic Algorithm and Formal Concept Analysis to Generate Branch Coverage Test Data Automatically.",
                    "Automated Analysis of Timing Information in UML Diagrams.",
                    "Combination Model Checking: Approach and a Case Study.",
                    "Context-Aware Code Certification.",
                    "Instant and Incremental Transformation of Models.",
                    "RCAT: A Performance Analysis Tool.",
                    "Modeling Behavior in Compositions of Software Architectural Primitives.",
                    "Evaluation of Tool Support for Architectural Evolution.",
                    "Requirements Monitoring for Service-Based Systems: Towards a framework based on Event Calculus.",
                    "ScriptEase: Generating Scripting Code for Computer Role-Playing Games.",
                    "Using a Structure-based Configuration Tool for Product Derivation.",
                    "ISPIS: A Framework Supporting Software Inspection Processes.",
                    "CodeCrawler - Polymetric Views in Action.",
                    "T-UPPAAL: Online Model-based Testing of Real-Time Systems.",
                    "An Environment for Building a System out of its Requirements.",
                    "Automated Dynamic Reconfiguration using AI Planning.",
                    "Decision Support for Test Management in Iterative and Evolutionary Development.",
                    "Formal Framework for Automated Analysis and Verification of Web-Based Applications.",
                    "Decompositional Verification of Component-based Systems-A Hybrid Approach.",
                    "Interactive Visualization of Concurrents Programs.",
                    "Group Support for Distributed Collaborative Concurrent Software Modeling.",
                    "Collaborative Tools for Mobile Requirements Acquisition.",
                    "Modeling and Simulation of Context-Aware Mobile Systems."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "18th ASE 2003",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2003",
                "sub_name": "18th IEEE International Conference on Automated Software Engineering (ASE 2003), 6-10 October 2003, Montreal, Canada.",
                "count": 54,
                "papers": [
                    "An Empirical Study on Groupware Support for Software Inspection Meetings.",
                    "Analysis of Inconsistency in Graph-Based Viewpoints: A Category-Theoretic Approach.",
                    "Deriving User Interface Requirements from Densely Interleaved Scientific Computing Applications.",
                    "Fault Localization With Nearest Neighbor Queries.",
                    "Tool-Assisted Unit Test Selection Based on Operational Violations.",
                    "A New Structural Coverage Criterion for Dynamic Detection of Program Invariants.",
                    "DeCo: A Declarative Coordination Framework for Scientific Model Federations.",
                    "A Programmable Client-Server Model: Robust Extensibility via DSLs.",
                    "Specification and Synthesis of Hybrid Automata for Physics-Based Animation.",
                    "Debugging Overconstrained Declarative Models Using Unsatisfiable Cores.",
                    "Parallel Breadth-First Search LTL Model-Checking.",
                    "Automated Environment Generation for Software Model Checking.",
                    "Aspectizing Server-Side Distribution.",
                    "Automating Component Adaptation for Reuse.",
                    "Model-based Verification of Web Service Compositions.",
                    "What Test Oracle Should I Use for Effective GUI Testing?",
                    "A Type System for Statically Detecting Spreadsheet Errors.",
                    "Testing Database Transaction Concurrency.",
                    "On the automatic evolution of an OS kernel using temporal logic and AOP.",
                    "Unspeculation.",
                    "SPQR: Flexible Automated Design Pattern Extraction From Source Code.",
                    "Automatically Inferring Concern Code from Program Investigation Activities.",
                    "A Model-Driven Approach to Non-Functional Analysis of Software Architectures.",
                    "Extending Diagnosis to Debug Programs with Exceptions.",
                    "Generating Design Pattern Detectors from Pattern Specifications.",
                    "Predicting Fault Prone Modules by the Dempster-Shafer Belief Networks.",
                    "Semi-Automatic Fault Localization and Behavior Verification for Physical System Simulation Models.",
                    "Automatic Generation of Content Management Systems from EER-Based Specifications.",
                    "Automated Requirements-based Generation of Test Cases for Product Families.",
                    "XRay Views: Understanding the Internals of Classes.",
                    "Visual Constraint Diagrams: Runtime Conformance Checking of UML Object Models versus Implementations.",
                    "A Pragmatic Study of Binary Class Relationships.",
                    "The Feature Signatures of Evolving Programs.",
                    "Test Suite Design for Code Generation Tools.",
                    "Theoretical Foundations of Updating Systems.",
                    "An Incremental Approach to Task-Specific Information Delivery in SE Processe.",
                    "Architecture Style-Based Calculi for Non-functional Properties.",
                    "Certifying Measurement Unit Safety Polic.",
                    "Automated Software Testing Using a Metaheuristic Technique Based on Tabu Search.",
                    "Model Checking Software Requirement Specifications using Domain Reduction Abstraction.",
                    "An Approach for Tracing and Understanding Asynchronous Architectures.",
                    "Refactoring C with Conditional Compilation.",
                    "A Java Component Model for Evolving Software Systems.",
                    "Depiction and Playout of Multi-threaded Program Executions.",
                    "Applying AutoBayes to the Analysis of Planetary Nebulae Images.",
                    "Automation for Exception Freedom Proofs.",
                    "Overview of OpenModel-based Validation with Partial Information.",
                    "Detecting Requirements Interactions: A Three-Level Framework.",
                    "Automating Relative Debugging.",
                    "Communicating Requirements Using End-User GUI Constructions with Argumentation.",
                    "Graph Rewriting And Transformation (GReAT): A Solution For The Model Integrated Computing (MIC) Bottleneck.",
                    "Visual Specification of Concurrent Systems.",
                    "VUML : a Viewpoint oriented UML Extension.",
                    "An Infrastructure to Support Meta-Differencing and Refactoring of Source Code."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "17th ASE 2002",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2002",
                "sub_name": "17th IEEE International Conference on Automated Software Engineering (ASE 2002), 23-27 September 2002, Edinburgh, Scotland, UK.",
                "count": 45,
                "papers": [
                    "Assumption Generation for Software Component Verification.",
                    "An Approach to Rapid Prototyping of Large Multi-Agent Systems.",
                    "Generative Design Patterns.",
                    "Deviation Analysis Through Model Checking.",
                    "Automatic Validation of Deployed J2EE Components Using Aspects.",
                    "On CASE Tool Usage at Nokia.",
                    "Experience Report on Automated Procedure Construction for Deductive Synthesis.",
                    "Generating Product-Lines of Product-Families.",
                    "Knowledge-Based Synthesis of Numerical Programs for Simulation of Rigid-Body Systems in Physics-Based Animation.",
                    "CPPROFJ: Aspect-Capable Call Path Profiling of Multi-Threaded Java Applications.",
                    "No Java without Caffeine: A Tool for Dynamic Analysis of Java Programs.",
                    "Constructing Corba-Supported Oracles for Testing: A Case Study in Automated Software Testing.",
                    "Generating Expected Results for Automated Black-Box Testing.",
                    "Generating Test Data for Functions with Pointer Inputs.",
                    "Automating Requirements Traceability: Beyond the Record & Replay Paradigm.",
                    "Enabling Iterative Software Architecture Derivation Using Early Non-Functional Property Evaluation.",
                    "Model-Based Tests of Truisms.",
                    "Interfaces for Modular Feature Verification.",
                    "Automated Validation of Class Invariants in C ++ Applications.",
                    "A Framework for Automatic Debugging.",
                    "Towards Usable and Relevant Model Checking Techniques for the Analysis of Dependable Interactive Systems.",
                    "Automatic Verification of any Number of Concurrent, Communicating Processes.",
                    "System Testing for Object-Oriented Frameworks Using Hook Technology.",
                    "What Makes Finite-State Models More (or Less) Testable?",
                    "Analyzing Dependencies in Large Component-Based Systems.",
                    "Identifying Cause & Effect Relations between Events in Concurrent Event-Based Components.",
                    "Systematic Bridging the Gap between Requirements and OO Design.",
                    "Automatic Test Cases Optimization Using a Bacteriological Adaptation Model: Application to .NET Component.",
                    "From Early Requirements to User Interface Prototyping: A Methodological Approach.",
                    "SeDiTeC - Testing Based on Sequence Diagrams.",
                    "VIATRA - Visual Automated Transformations for Formal Verification and Validation of UML Models.",
                    "A Temporal Logic Approach to the Specification of Reconfigurable Component-Based Systems.",
                    "Adding Value to Formal Test Oracles.",
                    "Dependence Management for Dynamic Reconfiguration of Component-Based Distributed Systems.",
                    "Combining and Adapting Software Quality Predictive Models by Genetic Algorithms.",
                    "Towards Certifying Domain-Specific Properties of Synthesized Code.",
                    "Predicting Software Stability Using Case-Based Reasoning.",
                    "Report on the Workshop on the State of the Art in Automated Software Engineering.",
                    "A Model of Planning and Enactment Support in Complex Software Development Projects.",
                    "Distributed Modular Model Checking.",
                    "Adapting Applications on the Fly.",
                    "Process Support for Tools Interoperability.",
                    "Automatic Synthesis of Distributed Systems.",
                    "Automatic Inter-Procedural Test Case Generation.",
                    "Semantic Links and Co-Evolution in Object-Oriented Software Development."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "16th ASE 2001",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2001",
                "sub_name": "16th IEEE International Conference on Automated Software Engineering (ASE 2001), 26-29 November 2001, Coronado Island, San Diego, CA, USA.",
                "count": 68,
                "papers": [
                    "A New Way of Automating Statistical Testing Methods.",
                    "Automatic Test Data Generation for Programs with Integer and Float Variables.",
                    "TestEra: A Novel Framework for Automated Testing of Java Programs.",
                    "Generating EDI Message Translations from Visual Specifications.",
                    "The Synthesis of a Java Card Tokenization Algorithm.",
                    "Wins and Losses of Algebraic Transformations of Software Architectures.",
                    "Session II-A: Verification and Validation/High-Assurance Systems Acceptance-Based Assurance.",
                    "Specification Modeling and Validation Applied to a Family of Network Security Products.",
                    "Certifying Domain-Specific Policies.",
                    "Automated Validation of Software Models.",
                    "Context-Aware Browsing of Large Component Repositories.",
                    "Identification of High-Level Concept Clones in Source Code.",
                    "Static Consistency Checking for Distributed Specifications.",
                    "Test Purposes: Adapting the Notion of Specification to Testing.",
                    "Monitoring Programs Using Rewriting.",
                    "Program Execution-Based Module Cohesion Measurement.",
                    "Composition and Refinement of Behavioral Specifications.",
                    "Instantiating and Detecting Design Patterns: Putting Bits and Pieces Together.",
                    "Connectors Synthesis for Deadlock-Free Component-Based Architectures.",
                    "Modeling and Verification of Distributed Real-Time Systems Based on CafeOBJ.",
                    "Generation of Distributed System Test-Beds from High-Level Software Architecture Descriptions.",
                    "Tailoring a COTS Group Support System for Software Requirements Inspection.",
                    "Automatically Restructuring Programs for the We.",
                    "Unfriendly COTS Integration-Instrumentation and Interfaces for Improved Plugability.",
                    "Adequate Reverse Engineering.",
                    "Enhancing Partial-Order Reduction via Process Clustering.",
                    "Exploiting Heap Symmetries in Explicit-State Model Checking of Software.",
                    "Combining Static Analysis and Model Checking for Software Analysis.",
                    "Towards a Precise Definition of the OMG/MDA Framework.",
                    "Shared Variables Interaction Diagrams.",
                    "Modeling Class Operations in B: Application to UML Behavioral Diagrams.",
                    "Automated Software Engineering Using Concurrent Class Machines.",
                    "Higher Order Function Synthesis Through Proof Planning.",
                    "AGATE, Access Graph-Based Tools for Handling Encapsulation.",
                    "A UML Validation Toolset Based on Abstract State Machines.",
                    "Semi-Automated Verification of Erlang Code.",
                    "Automatic Verification of Java Design Patterns.",
                    "Tracing Execution of Software for Design Coverage.",
                    "Model Checking for an Executable Subset of UML.",
                    "A Technique for Mutation of Java Objects.",
                    "Providing Early Feedback in the Development Cycle Through Automated Application of Model Checking to Software Architectures.",
                    "Automated Check of Architectural Models Consistency Using SPIN.",
                    "Automating the Performance and Reliability Analysis of Enterprise Information Systems.",
                    "An Analysis-Revision Cycle to Evolve Requirements Specifications.",
                    "Knowledge Base Approach to Consistency Management of UML Specification.",
                    "Strategies for Automated Specification-Based Testing of Synchronous Software.",
                    "Developing Generative Frameworks Using XML.",
                    "A Tool for Lazy Verification of Security Protocols.",
                    "Generation of Functional Test Sequences from B Formal Specifications-Presentation and Industrial Case Study.",
                    "Action Language Verifier.",
                    "Scalable Consistency Checking Between Diagrams-The ViewIntegra Approach.",
                    "Better Reasoning About Software Engineering Activities.",
                    "Amphion/NAV: Deductive Synthesis of State Estimation Software.",
                    "Programs Are Abstract Data Types.",
                    "An Automated Tool for Analyzing Petri Nets Using SPIN.",
                    "Formally Testing Fail-Safety of Electronic Purse Protocols.",
                    "Automata-Based Verification of Temporal Properties on Running Programs.",
                    "Towards an Evolutionary Formal Software Development.",
                    "A Concurrency Test Tool for Java Monitors.",
                    "Enforcing Business Policies Through Automated Reconfiguration.",
                    "Design Rationale for Software Maintenanc.",
                    "Security Specification and Verification.",
                    "Implementation of Specification Conjunction and Domain Interaction in Rosetta.",
                    "Automatic Translation from UML Specifications to B.",
                    "Automated Conversion from a Requirements Document to an Executable Formal Specification.",
                    "Automated Test-Data Generation from Formal Models of Software.",
                    "Model-Checking Real-Time Concurrent Systems.",
                    "Verify Properties of Mobile Code."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "15th ASE 2000",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/2000",
                "sub_name": "The Fifteenth IEEE International Conference on Automated Software Engineering, ASE 2000, Grenoble, France, September 11-15, 2000.",
                "count": 45,
                "papers": [
                    "Model Checking Programs.",
                    "Exploring the Design of an Intentional Naming Scheme with an Automatic Constraint Analyzer.",
                    "Management of Change in Structured Verification.",
                    "A Comparison of Questionnaire-Based and GUI-Based Requirements Gathering.",
                    "CM-Builder: An Automated NL-Based CASE Tool.",
                    "Finding Comparatively Important Concepts between Texts.",
                    "Upgrading Legacy Instances of Reactive Systems.",
                    "Renaming Detection.",
                    "Mutation Operators for Specifications.",
                    "The Use of Abduction and Recursion-Editor Techniques for the Correction of Faulty Conjectures.",
                    "A DSL Approach to Improve Productivity and Safety in Device Drivers Development.",
                    "A Declarative Approach for Designing and Developing Adaptive Components.",
                    "Circular Coinductive Rewriting.",
                    "Formal Construction of the Mathematically Analyzed Separation Kernel.",
                    "Simultaneous Checking of Completeness and Ground Confluence.",
                    "Using Little-JIL to Coordinate Agents in Software Engineering.",
                    "Practical Large Scale What-If Queries: Case Studies with Software Risk Assessment.",
                    "Exploring and Validating the Contributions of Real-World Knowledge to the Diagnostic Performance of Automated Database Design Tools.",
                    "Using Graph Rewriting to Specify Software Architectural Transformations.",
                    "Specialization Patterns.",
                    "Identification of Potentially Infeasible Program Paths by Monitoring the Search for Test Data.",
                    "Generating Test Data for Branch Coverage.",
                    "Test Sequences Generation from LUSTRE Descriptions: GATeL.",
                    "Automating the Composition of Middleware Configurations.",
                    "pi-SPACE: A Formal Architecture Description Language Based on Process Algebra for Evolving Software Systems.",
                    "Towards Explicit Representation of Architectural Design Assumptions.",
                    "Java Model Checking.",
                    "Non-Interference Analysis for Mixed Criticality Code in Avionics Systems.",
                    "Automated Security Checking and Patching Using TestTalk.",
                    "Controlled Automation of Consistency Enforcement.",
                    "An Overview of a Method and Its Support Tool for Generating B Specifications from UML Notations.",
                    "A Transformational Viewpoint on Design Patterns.",
                    "Issues for the Automatic Generation of Safety Critical Software.",
                    "An Experiment in Scientific Program Understanding.",
                    "Representing Technology to Promote Reuse in the Software Design Process.",
                    "Towards the Automatic Assessment of Evolvability for Reusable Class Libraries.",
                    "Translating Use Cases to Sequence Diagrams.",
                    "New Visual Interface for Engineering Use Case Models.",
                    "Semantic Abstraction Rules for Class Diagrams.",
                    "Automatic Derivation of Petri Net Based Distributed Specification with Optimal Allocation of Resources.",
                    "Combining the Best Attributes of Qualitative and Quantitative Risk Management Tool Support.",
                    "A Group Critic System for Object-Oriented Analysis and Design.",
                    "Computing Interfaces in Java.",
                    "Extending UML to Support Domain Analysis.",
                    "Systematic Generation of Dependable Change Coordination Plans for Automated Switching of Coordination Policies."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "14th ASE 1999",
        "info": "Cocoa Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1999",
                "sub_name": "The 14th IEEE International Conference on Automated Software Engineering, ASE 1999, Cocoa Beach, Florida, USA, 12-15 October 1999.",
                "count": 52,
                "papers": [
                    "Can Model Checking Scale to Software? (Panel).",
                    "Evaluation of Automated Software Engineering Systems? (Panel).",
                    "Exploration Harnesses: Tool-Supported Interactive Discovery of Commercial Component Properties.",
                    "An Approach to Software Requirements Elicitation Using the Precepts from Activity Theory.",
                    "Data Mining Library Reuse Patterns in User-Selected Applications.",
                    "Industrial Applications of Software Synthesis via Category Theory.",
                    "Towards Automatic Imperative Program Synthesis Through Proof Planning.",
                    "An Integration of Deductive Retrieval into Deductive Synthesis.",
                    "Automatic Generation of Test Oracles-From Pilot Studies to Application.",
                    "An Automatic and Optimized Test Generation Technique Applying to TCP/IP Protocol.",
                    "Siddhartha: A Method for Developing Domain-Specific Test Driver Generators.",
                    "Modular and Incremental Analysis of Concurrent Software Systems.",
                    "Automated Translation of UML Models of Architectures for Verification and Simulation Using SPIN.",
                    "A Visualization Tool for Constraint Program Debugging.",
                    "Advanced Modelling and Verification Techniques Applied to a Cluster File System.",
                    "Verification of Picture Generated Code.",
                    "Combining Fault Avoidance, Fault Removal and Fault Tolerance: An Integrated Model.",
                    "Fixing Some Transformation Problems.",
                    "Retrenchment: Extending the Reach of Refinement.",
                    "An ML Editor Based on Proofs-As-Programs.",
                    "Evolving Object-Oriented Designs with Refactorings.",
                    "AML: An Architecture Meta-Language.",
                    "Automatically Detecting Mismatches During Component-based and Model-based Development.",
                    "Separating Concerns in Direct Manipulation User Interfaces.",
                    "An Overview of Lutess: A Specification-based Tool for Testing Synchronous Software.",
                    "Applying Test Automation to Type Acceptance Testing of Telecom Networks: A Case Study with Customer Participation.",
                    "UNA Based Iterative Test Data Generation and Its Evaluation.",
                    "Beyond Components-Connections-Constraints: Dealing with Software Architecture Difficulties.",
                    "Enhancing Annotation Visibility for Software Inspection.",
                    "Automatic Synthesis of Control Software for an Industrial Automation Control System.",
                    "Automatic Software Clustering via Latent Semantic Analysis.",
                    "vUML: A Tool for Verifying UML Models.",
                    "A Formal Ontology for Re-Use of Software Architecture Documents.",
                    "Rule-Based Strategic Reflection: Observing and Modifying Behavior at the Architectural Level.",
                    "Development of a Constraint-Based Airlift Scheduler by Program Synthesis from Formal Specifications.",
                    "Automatically Structuring Textual Requirement Scenarios.",
                    "UMLAUT: An Extendible UML Transformation Framework.",
                    "Software Test Generation Using Refinement Types.",
                    "Automatic Proofs of Properties of Simple C- Modules.",
                    "Dynamic Accommodation of Change: Automated Architecture Configuration of Distributed Systems.",
                    "Architectural Element Matching Using Concept Analysis.",
                    "Controlled Natural Language Can Replace First-Order Logic.",
                    "A Comparative Study between Linear Programming Validation (LPV) and other Verification Methods.",
                    "Component-based Systems as an Aid to Design Validation.",
                    "A Metric Based Technique for Design Flaws Detection and Correction.",
                    "Deductive Synthesis of Event-Based Software Architectures.",
                    "An Approach to Automatic Code Generation for Safety-Critical Systems.",
                    "Implementing Effective Automatic Cryptographic Protocol Analysis.",
                    "System for Automated Validation of Embedded Software in Multiple Operating Configurations.",
                    "NAVCo: Negotiation-based Adaptive View Coordination.",
                    "Towards Discovery, Specification, and Verification of Component Usage.",
                    "Towards Adaptive Web Agents."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "13th ASE 1998",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1998",
                "sub_name": "The Thirteenth IEEE Conference on Automated Software Engineering, ASE 1998, Honolulu, Hawaii, USA, October 13-16, 1998.",
                "count": 44,
                "papers": [
                    "A Tool for Automated System Analysis based on Modular Specifications.",
                    "Management of Evolving Specifications using Category Theory.",
                    "Specification-based Testing of Ada Units with Low Encapsulation.",
                    "Identifying Pre-Conditions with the Z/EVES Theorem Prover.",
                    "Planning Equational Verification in CCS.",
                    "Don't Verify, Abstract!",
                    "A Design Pattern based Approach to Generating Synchronization Adaptors from Annotated IDL.",
                    "Towards a Theory for Integration of Mathematical Verification and Empirical Testing.",
                    "Specification-based Browsing of Software Component Libraries.",
                    "Reusability Hypothesis Verification using Machine Learning Techniques: A Case Study.",
                    "An Automated Approach for Supporting Software Reuse via Reverse Engineering.",
                    "Towards the Automated Debugging and Maintenance of Logic-based Requirements Models.",
                    "Explanation-based Scenario Generation for Reactive System Models.",
                    "Automated Integrative Analysis of State-based Requirements.",
                    "Automated Software Test Data Generation for Complex Programs.",
                    "Programmatic Testing of the Standard Template Library Containers.",
                    "Testing using Log File Analysis: Tools, Methods, and Issues.",
                    "Schema-Guided Synthesis of Constraint Logic Programs.",
                    "Automating UI Generation by Model Composition.",
                    "On Detecting and Handling Inconsistencies in Integrating Software Architecture Design and Performance Evaluation.",
                    "Synthesizing Software Architecture Descriptions from Message Sequence Chart Specifications.",
                    "Component-based Software Process Support.",
                    "Illustrating Object-Oriented Library Reuse by Example: A Tool-based Approach.",
                    "Dowsing: A Tool Framework for Domain-Oriented Browsing of Software Artifacts.",
                    "From Z to BON/Eiffel.",
                    "Detection of Exclusive OR Global Predicates.",
                    "Statically Checkable Design Level Traits.",
                    "Parameterising (Algebraic) Specifications on Diagrams.",
                    "A Visualization Concept for Hierarchical Object Models.",
                    "Task Oriented Software Understanding.",
                    "Explaining Synthesized Software.",
                    "A Configurable Automatic Instrumentation Tool for ANSI C.",
                    "The Very Idea of Software Development Environments: A Conceptual Architecture for the ARTS Environment Paradigm.",
                    "Planware - Domain-Specific Synthesis of High-Performance Schedulers.",
                    "ASSISTing Exit Decisions in Software Inspection.",
                    "An Automated Framework for Structural Test-Data Generation.",
                    "ADLscope: An Automated Specification-based Unit Testing Tool.",
                    "An Empirical Study of the Evolution of a Software System.",
                    "A Coordination System Approach to Software Workflow Process Evolution.",
                    "Requirements Engineering and Verification using Specification Animation.",
                    "Automated Knowledge Acquisition and Application for Software Development Projects.",
                    "Developing the Designer's Toolkit with Software Comprehension Models.",
                    "Development, Assessment, and Reengineering of Language Descriptions.",
                    "Brewing Fresh JAVA from Legacy Lisp - An Experiment in Automated Reverse Engineering."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "12th ASE 1997",
        "info": "Lake Tahoe, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1997",
                "sub_name": "1997 International Conference on Automated Software Engineering, ASE 1997, Lake Tahoe, CA, USA, November 2-5, 1997.",
                "count": 47,
                "papers": [
                    "Automatic Synthesis of Recursive Programs: The Proof-Planning Paradigm.",
                    "Moving Proofs-As-Programs into Practice.",
                    "A Structured Approach for Synthesizing Planners from Specifications.",
                    "Formal Specification of Human-Computer Interaction by Graph Grammars under Consideration of Information Resources.",
                    "Processing Natural Language Requirements.",
                    "Tools Supporting the Creation and Evolution of Software Development Knowledge.",
                    "Distributed Cooperative Formal Methods Tools.",
                    "Specification and Verification of the Co4 Distributed Knowledge System using LOTOS.",
                    "Using KIV to Specify and Verify Architectures of Knowledge-Based Systems.",
                    "A Metric-based Approach to Detect Abstract Data Types and State Encapsulations.",
                    "Automatic High-Quality Reengineering of Database Programs by Temporal Abstraction.",
                    "Extracting Objects from Legacy Imperative Code.",
                    "Notes on Refinement, Interpolation and Uniformity.",
                    "Exploiting Domain-Specific Knowledge to Refine Simulation Specifications.",
                    "Augmenting Abstract Syntax Trees for Program Understanding.",
                    "A Contribution to Program Comprehension by Program Analysis: Application to Numerical Programs.",
                    "Precise Specification and Automatic Application of Design Patterns.",
                    "Correct-Schema-Guided Synthesis of Steadfast Programs.",
                    "Application of Formal Methods to the Development of a Software Maintenance Tool.",
                    "TESS: Automated Support for the Evolution of Persistent Types.",
                    "Mapping Software Architectures to Efficient Implementations via Partial Evaluation.",
                    "Automated Configuration of Distributed Applications from Reusable Software Architectures.",
                    "Declarative Specification of Software Architectures.",
                    "Applying Concept Formation Methods to Object Identification in Procedural Code.",
                    "A Formal Automated Approach for Reverse Engineering Programs with Pointers.",
                    "Data Flow Analysis within the ITOC Information System Design Recovery Tool.",
                    "Facilitating an Automated Approach to Architecture-based Software Reuse.",
                    "NORA/HAMMR: Making Deduction-Based Software Component Retrieval Practical.",
                    "Retrieving Software Components that Minimize Adaptation Effort.",
                    "Modular Flow Analysis for Concurrent Software.",
                    "Research Directions for Automated Software Verification: Using Trusted Hardware.",
                    "On the Verification of VDM Specification and Refinement with PVS.",
                    "Modeling the Application Domains of Software Engineering Technologies.",
                    "Interactive Component-Based Software Development with Espresso.",
                    "Towards Semantic-Based Object-Oriented CASE Tools.",
                    "A Static Analysis for Program Understanding and Debugging.",
                    "Reactive System Validation using Automated Reasoning over a Fragment Library.",
                    "Feedback Handling in Dynamic Task Nets.",
                    "Mechanising Requirements Engineering: Reuse and the Application of Domain Analysis Technology.",
                    "Strategies of Structural Synthesis of Programs.",
                    "Genetic Algorithms for Dynamic Test Data Generation.",
                    "From Formal Specifications to Natural Language: A Case Study.",
                    "Towards a Design Assistant for Distributed Embedded Systems.",
                    "Enhancing the Component Reusability in Data-Intensive Business Programs through Interface Separation.",
                    "An Automated Object-Oriented Testing for C++ Inheritance Hierarchy.",
                    "Formally Specifying Engineering Design Rationale.",
                    "Modeling Software Processes by using Process and Object Ontologies."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "11th KBSE 1996",
        "info": "Syracuse, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1996",
                "sub_name": "Proceedings of the 11th Knowledge-Based Software Engineering Conference, KBSE 1996, Syracuse, NY, USA, September 25-28, 1996.",
                "count": 15,
                "papers": [
                    "Deductive synthesis of numerical simulation programs from networks of algebraic and ordinary differential equations.",
                    "Synthesis of schedulers for planned shutdowns of power plants.",
                    "Synthesis of local search algorithms by algebraic means.",
                    "Constructing transition models of AI planner behavior.",
                    "Trusting your assistant.",
                    "Complementing semi-formal specifications with Z.",
                    "Extending design environments to software architecture design.",
                    "Addressing complexity, coordination, and automation in software development with the KBSA/ADM.",
                    "Integrating software process models and design rationales.",
                    "Applying plan recognition algorithms to program understanding.",
                    "Knowledge-based re-engineering of legacy programs for robustness in automated design.",
                    "Using knowledge-based transformations to reverse-engineer COBOL programs.",
                    "A knowledge-based toolkit for software visualisation.",
                    "Set differentiation: a method for the automatic generation of filtering algorithms.",
                    "Software synthesis for trade-off design."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "10th KBSE 1995",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1995",
                "sub_name": "Proceedings KBSE'95, the Tenth Knowledge-Based Software Engineering Conference, Boston, Massachusetts, USA, November 12-15, 1995.",
                "count": 23,
                "papers": [
                    "META-AMPHION: Synthesis of Efficient Domain-Specific Program Synthesis Systems.",
                    "Knowledge-Based Program Synthesis for a Geometric Constraint Satisfaction System.",
                    "CACHET: An Interactive, Incremental-Attribution-Based Program Transformation System for Deriving Incremental Programs.",
                    "Representing Object Models as Theories.",
                    "Logical Frameworks as a Basis for Verification Tools: A Case Study.",
                    "A Transformation System for Interactive Reformulation of Design Optimization Strategies.",
                    "Searching for a Global Algorithm.",
                    "Legal Issues on Knowledge-Based Software Engineering.",
                    "An Empirical Evaluation of KBSA Technology.",
                    "An Interface Between Different Software Development Environments.",
                    "From Object-Oriented to Knowledge-Based Programming (NUT System Development Experience).",
                    "Domain-Oriented Software Process Re-engineering with Software Synthesis Shell SOFTEX/S.",
                    "A Model for Decision Maintenance in the WinWin Collaboration Framework.",
                    "Application of a Decision Support Mechanism to the Business Rules Lifecycle.",
                    "Portability by Automatic Translation - A Large-Scale Case Study.",
                    "Classification and Retrieval of Reusable Components Using Semantic Features.",
                    "Classifying Software Components Using Design Characteristics.",
                    "Towards an Epistemology for Software Representations.",
                    "Interactive Explanation of Software Systems.",
                    "Automating Changes of Data Type in Functional Programs.",
                    "Towards High-Level Deductive Program Synthesis Based on Type Theory.",
                    "Test Sequences as Plans: An Experiment in Using an AI Planner to Generate System Tests.",
                    "Specification and Animation of a Bank Transfer."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "9th KBSE 1994",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1994",
                "sub_name": "Proceedings KBSE'94, the Ninth Knowledge-Based Software Engineering Conference, Monterey, California, USA, September 20-23, 1994.",
                "count": 24,
                "papers": [
                    "AMPHION: Automatic Programming for Subroutine Libraries.",
                    "Knowledge-Based Software Assistant - Advanced Development Model Demonstrations.",
                    "Application of REFINE Language ToolsTM to Software Quality Assurance.",
                    "A Framework for Distributed System Designs.",
                    "Intelligent Assistance for Software Construction: A Case Study.",
                    "Agent-Based Support for Communication Between Developers and Users in Software Design.",
                    "Using Machine Learning to Synthesize Search Programs.",
                    "Composing Reusable Software Components Through Views.",
                    "A Formal Approach to Domain-Oriented Software Design Environments.",
                    "Formal Specification Tools for Test Coverage Analysis.",
                    "Systematic Incremental Validation of Rule-Based Reactive Systems.",
                    "A Flexible Rule-Chaining Engine for Process-Based Software Engineering.",
                    "A Formal Approach to Reusing More General Components.",
                    "Task Oriented and Similarity-Based Retrieval.",
                    "Evolution and Reuse of Formal Specification Using Decision Structures.",
                    "Graphical Support for Code-Level Software Understanding.",
                    "A Cooperative Program Understanding Environment.",
                    "Abstract Data Structure Recognition.",
                    "User Interface Design Assistance For Large-Scale Software Development.",
                    "An Augmented Pattern Matcher as a Tool to Synthesize Conceptual Descriptions of Programs.",
                    "Integrating Object-Oriented Paradigms and Logic Programming: The OPLA Language.",
                    "Critical Success Factors for Knowledge-Based Software Engineering Applications.",
                    "Knowledge-Based Risk Assessment and Cost Estimation.",
                    "Software Technology Risk Advisor."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "8th KBSE 1993",
        "info": "Chicago, Illinios",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1993",
                "sub_name": "Proceedings of the Eighth Knowledge-Based Software Engineering Conference, KBSE 1993, Chicago, IL, USA, September 20-23, 1993.",
                "count": 21,
                "papers": [
                    "Knowledge requirements for the automatic generation of project management reports.",
                    "Diagrams for software synthesis.",
                    "Towards supporting design phase synthesis.",
                    "Validation of rule-based reactive systems by sound scenario generalization.",
                    "The ARIES Simulation Component (ASC).",
                    "A knowledge base for software test refinement.",
                    "Transformational approach to transportation scheduling.",
                    "A knowledge based framework for developing and customizing schedulers.",
                    "Articulation: an integrated approach to the diagnosis, replanning, and rescheduling of software process failures.",
                    "The knowledge base maintenance assistant.",
                    "Interactive elaboration of generic designs.",
                    "Operations for evolving specifications.",
                    "An implementation of bounded obligations.",
                    "GRIT-an extended REFINE for more executable specifications.",
                    "A common architecture to encourage reuse of natural language/text processing tools.",
                    "Inquire: predicate-based use and reuse.",
                    "An analogy-based retrieval mechanism for software design reuse.",
                    "Accelerating browsing by automatically inferring a user's search goal.",
                    "Observations on using empirical studies on developing a knowledge-based software engineering tool.",
                    "An experiment in applying knowledge-based software engineering technology.",
                    "Development of an expert assistant for software evaluation using a hybrid approach."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "7th KBSE 1992",
        "info": "McLean, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1992",
                "sub_name": "Proceedings of the Seventh Knowledge-Based Software Engineering Conference, KBSE 1992, McLean, VA, USA, September 20-23, 1992.",
                "count": 25,
                "papers": [
                    "Knowledge-based support for scientific programming.",
                    "A code synthesis experiment.",
                    "Knowledge-based constraint-driven software synthesis.",
                    "Software synthesis shell SOFTEX/S.",
                    "Transformation of a semi-formal specification to VDM.",
                    "Prototyping VDM specifications with KIDS.",
                    "Track assignment in an air traffic control system: a rational reconstruction of system design.",
                    "Software reuse through view type clusters.",
                    "Reusing database queries in analogical domains.",
                    "CAESAR: a system for case based software reuse.",
                    "Software design by reusing architectures.",
                    "Domain abstractions in requirements engineering: an exemplar approach?",
                    "A knowledge-based software process library for process-driven software development.",
                    "Towards a logic-based reconstruction of software configuration management.",
                    "Simulating the Gries/Dijkstra design process.",
                    "Explorations on the formal frontier of distributed system design.",
                    "Managing design knowledge to provide assistance to large-scale software development.",
                    "Efficiently computing derived performance data.",
                    "Automatic composition of data structures to represent relations.",
                    "A knowledge-based software development environment for scientific model-building.",
                    "Domain-oriented design environments.",
                    "Program concept recognition.",
                    "Educating knowledge-based software engineers.",
                    "Program understanding - does it offer hope for aging software?",
                    "DoD's software technology plans: what do they mean for KBSE, and what does it mean for them?"
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "6th KBSE 1991",
        "info": "Syracuse, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/kbse/1991",
                "sub_name": "Proceedings 6th Annual Knowledge-Based Software Engineering Conference, KBSE 1991, Syracuse, New York, USA, September 22-25, 1991.",
                "count": 29,
                "papers": [
                    "The Knowledge-Based Software Assistant: A Program Summary.",
                    "Complex Objects in Knowledge-Based Requirements Engineering.",
                    "Composite System Design: The Good News and the Bad News.",
                    "Active Assistance for Domain Modeling.",
                    "KBRAS: A Knowledge-Based Requirements Acquisition System.",
                    "The KBSA Requirements/Specifications Facet: ARIES.",
                    "Sharing and Reuse of Requirements Knowledge.",
                    "Lockheed Environment for Automatic Programming.",
                    "Using Domain Knowledge to Synthesize Routing Software.",
                    "Directions for Future KBSA Research.",
                    "Motivating Adoption of KBSA: Issues, Arguments, and Strategies.",
                    "Domain-Specific Representations in the KBSA Concept Demo.",
                    "Analogical Matching for Specification Reuse.",
                    "The Role of Analogy in Specification Derivation.",
                    "A Knowledge and Deduction Based Software Retrieval Tool.",
                    "Functional Representation and Program Debugging.",
                    "Requirement Directed Automatic Instrumentation Generation for Program Monitoring and Measuring.",
                    "CTPLAN: A Planning-Based Approach to Automatically Detecting Flaws in Concurrent Algorithms.",
                    "A Knowledge-Based Approach to Software System Understanding.",
                    "LARGE Software System Maintenance.",
                    "A Knowledge-Based Interface to Promote Software Understanding.",
                    "Acquiring Software Design Schemas: A Machine Learning Perspective.",
                    "A Learning-Based Software Engineering Environment.",
                    "Implementation of an Activity Coordination System.",
                    "Rule Chaining in MARVEL: Dynamic Binding of Parameters.",
                    "Representation and Maintenance of Process Knowledge for Large Scale Systems Development.",
                    "Domain Modeling - Evolving Research.",
                    "Encouraging the Adoption of KBSE Technology: What Needs to Happen First?",
                    "Knowledge-Based Design."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "5th KBSA 1990",
        "info": "Syracuse, New York, USA",
        "venues": []
    }
]