[
    {
        "year": "2021",
        "name": "ISPASS 2021",
        "info": "Stony Brook, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2021",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2021, Stony Brook, NY, USA, March 28-30, 2021.",
                "count": 42,
                "papers": [
                    "GenomicsBench: A Benchmark Suite for Genomics.",
                    "GNNMark: A Benchmark Suite to Characterize Graph Neural Network Training on GPUs.",
                    "AIBench Training: Balanced Industry-Standard AI Training Benchmarking.",
                    "CoCoPeLia: Communication-Computation Overlap Prediction for Efficient Linear Algebra on GPUs.",
                    "Learning Sparse Matrix Row Permutations for Efficient SpMM on GPU Architectures.",
                    "Analyzing Secure Memory Architecture for GPUs.",
                    "MicroGrad: A Centralized Framework for Workload Cloning and Stress Testing.",
                    "ViStA: Video Streaming and Analytics Benchmark.",
                    "Analysis of Factors Affecting Power Consumption and Energy Efficiency of SGEMM on the Low-Power Myriad-2 VPU.",
                    "A Defense-Inspired Benchmark Suite.",
                    "An Automated Traffic Generation Framework for Performance Evaluation of Networks-on-Chip for Real World Use Cases.",
                    "How Do Graph Relabeling Algorithms Improve Memory Locality?",
                    "Designing GPU Architecture for Memory Bandwidth Reservation.",
                    "Reducing BERT Computation by Padding Removal and Curriculum Learning.",
                    "Efficient Split Counter Mode Encryption for NVM.",
                    "AI Tax in Mobile SoCs: End-to-end Performance Analysis of Machine Learning in Smartphones.",
                    "Performance Characterization of .NET Benchmarks.",
                    "Performance Analysis of Graph Neural Network Frameworks.",
                    "Loopapalooza: Investigating Limits of Loop-Level Parallelism with a Compiler-Driven Approach.",
                    "Real-Time Characterization of Data Access Correlations.",
                    "Comparative Code Structure Analysis using Deep Learning for Performance Prediction.",
                    "Understanding Capacity-Driven Scale-Out Neural Recommendation Inference.",
                    "Re-establishing Fetch-Directed Instruction Prefetching: An Industry Perspective.",
                    "Enabling Reproducible and Agile Full-System Simulation.",
                    "A Case Against Hardware Managed DRAM Caches for NVRAM Based Systems.",
                    "Characterizing Massively Parallel Polymorphism.",
                    "Pinpointing the Memory Behaviors of DNN Training.",
                    "Thermal-Aware Overclocking for Smartphones.",
                    "The Impact of SoC Integration and OS Deployment on the Reliability of Arm Processors.",
                    "Memory-Efficient Hardware Performance Counters with Approximate-Counting Algorithms.",
                    "Architecture-Level Energy Estimation for Heterogeneous Computing Systems.",
                    "Sparseloop: An Analytical, Energy-Focused Design Space Exploration Methodology for Sparse Tensor Accelerators.",
                    "Splash-4: Improving Scalability with Lock-Free Constructs.",
                    "Accelerating Fully Homomorphic Encryption Through Microarchitecture-Aware Analysis and Optimization.",
                    "Efficient Management of Scratch-Pad Memories in Deep Learning Accelerators.",
                    "Hardware Acceleration for DBMS Machine Learning Scoring: Is It Worth the Overheads?",
                    "TPUPoint: Automatic Characterization of Hardware-Accelerated Machine-Learning Behavior for Cloud Computing.",
                    "Pitfalls of InfiniBand with On-Demand Paging.",
                    "Analyzing the Interplay Between Random Shuffling and Storage Devices for Efficient Machine Learning.",
                    "E3: A HW/SW Co-design Neuroevolution Platform for Autonomous Learning in Edge Device.",
                    "FireMarshal: Making HW/SW Co-Design Reproducible and Reliable.",
                    "COBRA: A Framework for Evaluating Compositions of Hardware Branch Predictors."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ISPASS 2020",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2020",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2020, Boston, MA, USA, August 23-25, 2020.",
                "count": 40,
                "papers": [
                    "Altis: Modernizing GPGPU Benchmarks.",
                    "SAGA-Bench: Software and Hardware Characterization of Streaming Graph Analytics Workloads.",
                    "Demystifying the MLPerf Training Benchmark Suite.",
                    "nanoBench: A Low-Overhead Tool for Running Microbenchmarks on x86 Systems.",
                    "BST: A BookSim-Based Toolset to Simulate NoCs with Single- and Multi-Hop Bypass.",
                    "A Systematic Methodology for Characterizing Scalability of DNN Accelerators using SCALE-Sim.",
                    "SeqPoint: Identifying Representative Iterations of Sequence-Based Neural Networks.",
                    "ASTRA-SIM: Enabling SW/HW Co-Design Exploration for Distributed DL Training Platforms.",
                    "CLAN: Continuous Learning using Asynchronous Neuroevolution on Commodity Edge Devices.",
                    "Horus: A Modular GPU Emulator Framework.",
                    "Architecturally-Independent and Time-Based Characterization of SPEC CPU 2017.",
                    "NVIDIA GPGPUs Instructions Energy Consumption.",
                    "C^2AFE: Capacity Curve Annotation and Feature Extraction for Shared Cache Analysis.",
                    "An Architecture-Level Energy and Area Estimator for Processing-In-Memory Accelerator Designs.",
                    "Geomancy: Automated Performance Enhancement through Data Layout Optimization.",
                    "Characterization of Data Generating Neural Network Applications on x86 CPU Architecture.",
                    "Specializing Coherence, Consistency, and Push/Pull for GPU Graph Analytics.",
                    "LiveSim: A Fast Hot Reload Simulator for HDLs.",
                    "MosaicSim: A Lightweight, Modular Simulator for Heterogeneous Systems.",
                    "Mediating Power Struggles on a Shared Server.",
                    "Data Direct I/O Characterization for Future I/O System Exploration.",
                    "On the Application Level Impact of SSD Performance Anomalies.",
                    "Evaluation of an InfiniBand Switch: Choose Latency or Bandwidth, but Not Both.",
                    "From Flash to 3D XPoint: Performance Bottlenecks and Potentials in RocksDB with Storage Evolution.",
                    "Evaluating Intel 3D-Xpoint NVDIMM Persistent Memory in the Context of a Key-Value Store.",
                    "Understanding the Software and Hardware Stacks of a General-Purpose Cognitive Drone.",
                    "Performance Analysis of 5G NR vRAN Platform and its Implications on Edge Computing.",
                    "A Study on Mesh Hybrid Memory Cube Network.",
                    "Performance Characterization of Lattice-Based Cryptography Workloads.",
                    "Performance Optimization of Lattice Post-Quantum Cryptographic Algorithms on Many-Core Processors.",
                    "SimTrace: Capturing over Time Program Phase Behavior.",
                    "Orpheus: A New Deep Learning Framework for Easy Deployment and Evaluation of Edge Inference.",
                    "Performance Characterization of Simultaneous Multi-Threading and Index Partitioning for an Online Document Search Application.",
                    "CETUS: Towards Proportional Capacity Provisioning and Cost-Effectiveness in Frontend Servers.",
                    "Modeling Architectural Support for Tightly-Coupled Accelerators.",
                    "Fused: Closed-Loop Performance and Energy Simulation of Embedded Systems.",
                    "Rapid Memory Footprint Access Diagnostics.",
                    "A Loop-Aware Autotuner for High-Precision Floating-Point Applications.",
                    "Identification of an Entire Workload's CPU-Vmin from the n-First Seconds of its Execution Based on Performance Counters.",
                    "Performance Prediction for Multi-Application Concurrency on GPUs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ISPASS 2019",
        "info": "Madison, WI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2019",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2019, Madison, WI, USA, March 24-26, 2019.",
                "count": 34,
                "papers": [
                    "GeST: An Automatic Framework For Generating CPU Stress-Tests.",
                    "Characterization of Unnecessary Computations in Web Applications.",
                    "Demystifying Crypto-Mining: Analysis and Optimizations of Memory-Hard PoW Algorithms.",
                    "One Size Does Not Fit All: Quantifying and Exposing the Accuracy-Latency Trade-Off in Machine Learning Cloud Service APIs via Tolerance Tiers.",
                    "The POP Detector: A Lightweight Online Program Phase Detection Framework.",
                    "Racing to Hardware-Validated Simulation.",
                    "Full-System Simulation of Mobile CPU/GPU Platforms.",
                    "Modeling Deep Learning Accelerator Enabled GPUs.",
                    "Emulating and Evaluating Hybrid Memory for Managed Languages on NUMA Hardware.",
                    "On the Impact of Instruction Address Translation Overhead.",
                    "Quantifying Process Variations and Its Impacts on Smartphones.",
                    "Assessing the Effects of Low Voltage in Branch Prediction Units.",
                    "Tango: A Deep Neural Network Benchmark Suite for Various Accelerators.",
                    "PARADISE - Post-Moore Architecture and Accelerator Design Space Exploration Using Device Level Simulation and Experiments.",
                    "A Detailed Model for Contemporary GPU Memory Systems.",
                    "DSMM: A Dynamic Setting for Memory Management in Apache Spark.",
                    "Fast Modeling of the L2 Cache Reuse Distance Histograms from Software Traces.",
                    "FlexCPU: A Configurable Out-of-Order CPU Abstraction.",
                    "Hierarchical Page Eviction Policy for Unified Memory in GPUs.",
                    "Analyzing Machine Learning Workloads Using a Detailed GPU Simulator.",
                    "Empirical Investigation of Stale Value Tolerance on Parallel RNN Training.",
                    "Characterizing Sources of Ineffectual Computations in Deep Learning Networks.",
                    "Demystifying Bayesian Inference Workloads.",
                    "Workload Characterization of Nondeterministic Programs Parallelized by STATS.",
                    "Parallelism Analysis of Prominent Desktop Applications: An 18- Year Perspective.",
                    "µqSim: Enabling Accurate and Scalable Simulation for Interactive Microservices.",
                    "Distributed Software Defined Networking Controller Failure Mode and Availability Analysis.",
                    "A Model Driven Approach Towards Improving the Performance of Apache Spark Applications.",
                    "An Improved Dynamic Vertical Partitioning Technique for Semi-Structured Data.",
                    "RPPM: Rapid Performance Prediction of Multithreaded Workloads on Multicore Processors.",
                    "HeteroMap: A Runtime Performance Predictor for Efficient Processing of Graph Analytics on Heterogeneous Multi-Accelerators.",
                    "mRNA: Enabling Efficient Mapping Space Exploration for a Reconfiguration Neural Accelerator.",
                    "DeLTA: GPU Performance Model for Deep Learning Applications with In-Depth Memory System Traffic Analysis.",
                    "Timeloop: A Systematic Approach to DNN Accelerator Evaluation."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ISPASS 2018",
        "info": "Belfast, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2018",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2018, Belfast, United Kingdom, April 2-4, 2018.",
                "count": 28,
                "papers": [
                    "Behind the Scenes: Memory Analysis of Graphical Workloads on Tile-Based GPUs.",
                    "Performance Analysis of NVMe SSD-Based All-flash Array Systems.",
                    "Doppio: I/O-Aware Performance Analysis, Modeling and Optimization for In-memory Computing Framework.",
                    "MAPS: Understanding Metadata Access Patterns in Secure Memory.",
                    "Hardware-Validated CPU Performance and Energy Modelling.",
                    "Micro-Viruses for Fast System-Level Voltage Margins Characterization in Multicore CPUs.",
                    "DORA: Optimizing Smartphone Energy Efficiency and Web Browser Performance under Interference.",
                    "Proctor: Detecting and Investigating Interference in Shared Datacenters.",
                    "SuperSim: Extensible Flit-Level Simulation of Large-Scale Interconnection Networks.",
                    "Performance Implications of NoCs on 3D-Stacked Memories: Insights from the Hybrid Memory Cube.",
                    "Characterizing the Runtime Effects of Object-Oriented Workloads on GPUs.",
                    "PowerSensor 2: A Fast Power Measurement Tool.",
                    "HMCSP: Reducing Transaction Latency of CSR-based SPMV in Hybrid Memory Cube.",
                    "Evaluating Memory Performance of Emerging Scale-Out Applications Using C-AMAT.",
                    "Shifting the Barrier: Extending the Boundaries of the BarrierPoint Methodology.",
                    "Algorithmic Performance-Accuracy Trade-off in 3D Vision Applications.",
                    "Impact of System Resources on Performance of Deep Neural Network.",
                    "Understanding the Characteristics of Mobile Augmented Reality Applications.",
                    "Performance Characterisation and Simulation of Intel's Integrated GPU Architecture.",
                    "A Workload Characterization of the SPEC CPU2017 Benchmark Suite.",
                    "The Alberta Workloads for the SPEC CPU 2017 Benchmark Suite.",
                    "Towards Cross-Framework Workload Analysis via Flexible Event-Driven Interfaces.",
                    "Extending the Performance Analysis Tool Box: Multi-stage CPI Stacks and FLOPS Stacks.",
                    "Low-Overhead Dynamic Instruction Mix Generation Using Hybrid Basic Block Profiling.",
                    "Performance Characterization of Multi-threaded Graph Processing Applications on Many-Integrated-Core Architecture.",
                    "Evaluating Performance Tradeoffs on the Radeon Open Compute Platform.",
                    "A Cross-platform Evaluation of Graphics Shader Compiler Optimization.",
                    "Characterizing a Commercial Multidimensional Heterogeneous Processor Under GPGPU Workloads."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ISPASS 2017",
        "info": "Santa Rosa, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2017",
                "sub_name": "2017 IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2017, Santa Rosa, CA, USA, April 24-25, 2017.",
                "count": 35,
                "papers": [
                    "Machine learning for performance and power modeling/prediction.",
                    "Sharing the instruction cache among lean cores on an asymmetric CMP for HPC applications.",
                    "Performance competitiveness of a statically compiled language for server-side Web applications.",
                    "Analyzing the scalability of managed language applications with speedup stacks.",
                    "PMAL: Enabling lightweight adaptation of legacy file systems on persistent memory systems.",
                    "Chai: Collaborative heterogeneous applications for integrated-architectures.",
                    "Performance analysis of CNN frameworks for GPUs.",
                    "GaaS workload characterization under NUMA architecture for virtualized GPU.",
                    "Fast IPC estimation for performance projections using proxy suites and decision trees.",
                    "Accurate address streams for LLC and beyond (SLAB): A methodology to enable system exploration.",
                    "Clone morphing: Creating new workload behavior from existing applications.",
                    "Crossing the architectural barrier: Evaluating representative regions of parallel HPC applications.",
                    "Characterization of GPGPU workloads on a multidimensional heterogeneous processor.",
                    "Service capacity measurement by redlining with live production traffic.",
                    "Predicting memory page stability and its application to memory deduplication and live migration.",
                    "Analyzing OpenCL 2.0 workloads using a heterogeneous CPU-GPU simulator.",
                    "Microarchitecture level reliability comparison of modern GPU designs: First findings.",
                    "DARTS: Performance-counter driven sampling using binary translators.",
                    "Docker characterization on high performance SSDs.",
                    "A taxonomy of out-of-order instruction commit.",
                    "PTAT: An efficient and precise tool for collecting detailed TLB miss traces.",
                    "Proxy benchmarks for emerging big-data workloads.",
                    "MaxSim: A simulation platform for managed applications.",
                    "dist-gem5: Distributed simulation of computer clusters.",
                    "Prefetching for cloud workloads: An analysis based on address patterns.",
                    "Toolbox for exploration of energy-efficient event processors for human-computer interaction.",
                    "HW/SW co-designed processors: Challenges, design choices and a simulation infrastructure for evaluation.",
                    "OpenSMART: Single-cycle multi-hop NoC generator in BSV and Chisel.",
                    "StressRight: Finding the right stress for accurate in-development system evaluation.",
                    "SimBench: A portable benchmarking methodology for full-system simulators.",
                    "Treelogy: A benchmark suite for tree traversals.",
                    "Evaluating and mitigating bandwidth bottlenecks across the memory hierarchy in GPUs.",
                    "SASSIFI: An architecture-level fault injection tool for GPU application resilience evaluation.",
                    "Exploring GPU performance, power and energy-efficiency bounds with Cache-aware Roofline Modeling.",
                    "Multi2Sim Kepler: A detailed architectural GPU simulator."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ISPASS 2016",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2016",
                "sub_name": "2016 IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2016, Uppsala, Sweden, April 17-19, 2016.",
                "count": 39,
                "papers": [
                    "Message from the general chair.",
                    "Message from the program chair.",
                    "Performance analysis of accelerated biophysically-meaningful neuron simulations.",
                    "DVFS performance prediction for managed multithreaded applications.",
                    "Addressing service interruptions in memory with thread-to-rank assignment.",
                    "Characterization and bottleneck analysis of a 64-bit ARMv8 platform.",
                    "Analyzing the energy-efficiency of sparse matrix multiplication on heterogeneous systems: A comparative study of GPU, Xeon Phi and FPGA.",
                    "FastCap: An efficient and fair algorithm for power capping in many-core systems.",
                    "Anatomy of microarchitecture-level reliability assessment: Throughput and accuracy.",
                    "EmerGPU: Understanding and mitigating resonance-induced voltage noise in GPU architectures.",
                    "GUFI: A framework for GPUs reliability assessment.",
                    "Splash-3: A properly synchronized benchmark suite for contemporary research.",
                    "Workload characterization and optimization of TPC-H queries on Apache Spark.",
                    "Demystifying cloud benchmarking.",
                    "Analysis of PARSEC workload scalability.",
                    "MLC PCM main memory with accelerated read.",
                    "Characterization and architectural implications of big data workloads.",
                    "Elastic traces for fast and accurate system performance exploration.",
                    "CoolSim: Eliminating traditional cache warming with fast, virtualized profiling.",
                    "Compositional model of coherence and NUMA effects for optimizing thread and data placement.",
                    "Characterizing Hadoop applications on microservers for performance and energy efficiency optimizations.",
                    "RTHpower: Accurate fine-grained power models for predicting race-to-halt effect on ultra-low power embedded systems.",
                    "Agave: A benchmark suite for exploring the complexities of the Android software stack.",
                    "Storage consolidation: Not always a panacea, but can we ease the pain?",
                    "Observations and opportunities in architecting shared virtual memory for heterogeneous systems.",
                    "GSI: A GPU Stall Inspector to characterize the sources of memory stalls for tightly coupled GPUs.",
                    "A comprehensive performance analysis of HSA and OpenCL 2.0.",
                    "OpenSoC Fabric: On-chip network generator.",
                    "NyuziRaster: Optimizing rasterizer performance and energy in the Nyuzi open source GPU.",
                    "AnyCore: A synthesizable RTL model for exploring and fabricating adaptive superscalar cores.",
                    "Performance analysis of a hardware accelerator of dependence management for task-based dataflow programming models.",
                    "Evaluating asymmetric multiprocessing for mobile applications.",
                    "MofySim: A mobile full-system simulation framework for energy consumption and performance analysis.",
                    "NoMali: Simulating a realistic graphics driver stack using a stub GPU.",
                    "X-Mem: A cross-platform and extensible memory characterization tool for the cloud.",
                    "Interactive visualization of cross-layer performance anomalies in dynamic task-parallel applications and systems.",
                    "JIT-assisted fast-forward embedding and instrumentation to enable fast, accurate, and agile simulation.",
                    "TaskPoint: Sampled simulation of task-based programs.",
                    "An automated framework for characterizing and subsetting GPGPU workloads."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ISPASS 2015",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2015",
                "sub_name": "2015 IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2015, Philadelphia, PA, USA, March 29-31, 2015.",
                "count": 42,
                "papers": [
                    "Message from the general chair.",
                    "Message from the program chair.",
                    "Critical-path candidates: scalable performance modeling for MPI workloads.",
                    "DELPHI: a framework for RTL-based architecture design evaluation using DSENT models.",
                    "Where does the time go? characterizing tail latency in memcached.",
                    "Micro-architecture independent analytical processor performance and power modeling.",
                    "Graph Processing Platforms at Scale: Practices and Experiences.",
                    "Graph-matching-based simulation-region selection for multiple binaries.",
                    "A modeling framework for reuse distance-based estimation of cache performance.",
                    "Multi-program benchmark definition.",
                    "Precise computer comparisons via statistical resampling methods.",
                    "Pairminer: mining for paired functions in Kernel extensions.",
                    "Self-monitoring overhead of the Linux perf_ event performance counter interface.",
                    "Hierarchical cycle accounting: a new method for application performance tuning.",
                    "Revisiting symbiotic job scheduling.",
                    "Micro-architecture independent branch behavior characterization.",
                    "Non-volatile memory host controller interface performance analysis in high-performance I/O systems.",
                    "Analyzing graphics processor unit (GPU) instruction set architectures.",
                    "ARACompiler: a prototyping flow and evaluation framework for accelerator-rich architectures.",
                    "Can RDMA benefit online data processing workloads on memcached and MySQL?",
                    "Characterization and cross-platform analysis of high-throughput accelerators.",
                    "Eliminating on-chip traffic waste: are we there yet?",
                    "Estimation-based profiling for code placement optimization in sensor network programs.",
                    "Factors affecting scalability of multithreaded Java applications on manycore systems.",
                    "On latency in GPU throughput microarchitectures.",
                    "An updated performance comparison of virtual machines and Linux containers.",
                    "Nyami: a synthesizable GPU architectural model for general-purpose and graphics-specific workloads.",
                    "DRAW: investigating benefits of adaptive fetch group size on GPU.",
                    "DNOC: an accurate and fast virtual channel and deflection routing network-on-chip simulator.",
                    "Performance evaluation of a DySER FPGA prototype system spanning the compiler, microarchitecture, and hardware implementation.",
                    "Mosaic: cross-platform user-interaction record and replay for the fragmented android ecosystem.",
                    "A study of mobile device utilization.",
                    "A full-system approach to analyze the impact of next-generation mobile flash storage.",
                    "QTrace: a framework for customizable full system instrumentation.",
                    "Pydgin: generating fast instruction set simulators from simple architecture descriptions with meta-tracing JIT compilers.",
                    "Reciprocal abstraction for computer architecture co-simulation.",
                    "Synchrotrace: synchronization-aware architecture-agnostic traces for light-weight multicore simulation.",
                    "Performance and energy evaluation of data prefetching on intel Xeon Phi.",
                    "Emulating cache organizations on real hardware using performance cloning.",
                    "Prometheus: scalable and accurate emulation of task-based applications on many-core systems.",
                    "Analyzing communication models for distributed thread-collaborative processors in terms of energy and time.",
                    "Characterization and analysis of a web search benchmark."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ISPASS 2014",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2014",
                "sub_name": "2014 IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2014, Monterey, CA, USA, March 23-25, 2014.",
                "count": 33,
                "papers": [
                    "Bridging the energy-efficiency gap in a future of massive data.",
                    "BarrierPoint: Sampled simulation of multi-threaded applications.",
                    "Sources of error in full-system simulation.",
                    "Exploiting spatial architectures for edit distance algorithms.",
                    "A Top-Down method for performance analysis and counters architecture.",
                    "Moby: A mobile benchmark suite for architectural simulators.",
                    "The design space of ultra-low energy asymmetric cryptography.",
                    "Optimized hardware for suboptimal software: The case for SIMD-aware benchmarks.",
                    "Applying the roofline model.",
                    "Extending statistical cache models to support detailed pipeline simulators.",
                    "Modeling cache coherence misses on multicores.",
                    "Manifold: A parallel simulation framework for multicore systems.",
                    "PriME: A parallel and distributed simulator for thousand-core chips.",
                    "A study of Thread Level Parallelism on mobile devices.",
                    "Transforming Java programs for concurrency using Double-Checked Locking pattern.",
                    "ParTejas: A parallel simulator for multicore processors.",
                    "Power modeling and other new features in the Graphite simulator.",
                    "Accelerating network-on-chip simulation via sampling.",
                    "A case for resource efficient prefetching in multicores.",
                    "Evaluating trace aggregation for performance visualization of large distributed systems.",
                    "Reverse engineering of cache replacement policies in Intel microprocessors and their evaluation.",
                    "Energy Introspector: A parallel, composable framework for integrated power-reliability-thermal modeling for multicore architectures.",
                    "Characterizing the latency hiding ability of GPUs.",
                    "Life lessons and datacenter performance analysis.",
                    "A software based profiling method for obtaining speedup stacks on commodity multi-cores.",
                    "MIAMI: A framework for application performance diagnosis.",
                    "Quality Time: A simple online technique for quantifying multicore execution efficiency.",
                    "Variability of data dependences and control flow.",
                    "NDC: Analyzing the impact of 3D-stacked memory+logic devices on MapReduce workloads.",
                    "Simulating DRAM controllers for future system architecture exploration.",
                    "Energy-efficient reconfigurable cache architectures for accelerator-enabled embedded systems.",
                    "GPU-Qin: A methodology for evaluating the error resilience of GPGPU applications.",
                    "Understanding the tradeoffs between software-managed vs. hardware-managed caches in GPUs."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ISPASS 2013",
        "info": "Austin, TX, USA",
        "venues": []
    },
    {
        "year": "2012",
        "name": "ISPASS 2012",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2013",
                "sub_name": "2012 IEEE International Symposium on Performance Analysis of Systems & Software, Austin, TX, USA, 21-23 April, 2013.",
                "count": 37,
                "papers": [
                    "Peta Thread Computing [Keynote I].",
                    "Sampled simulation of multi-threaded applications.",
                    "XAMP: An eXtensible Analytical Model Platform.",
                    "Synergistic coupling of SSD and hard disk for QoS-aware virtual memory.",
                    "Increasing the Transparent Page Sharing in Java.",
                    "Understanding the implications of virtual machine management on processor microarchitecture design.",
                    "An analytical framework for estimating TCO and exploring data center design space.",
                    "Interactive analysis of large distributed systems with scalable topology-based visualization.",
                    "McSimA+: A manycore simulator with application-level+ simulation and detailed microarchitecture modeling.",
                    "A detailed and flexible cycle-accurate Network-on-Chip simulator.",
                    "How a single chip causes massive power bills GPUSimPow: A GPGPU power simulator.",
                    "Parallel GPU architecture simulation framework exploiting work allocation unit parallelism.",
                    "Evaluating cache coherent shared virtual memory for heterogeneous multicore chips.",
                    "Exascale workload characterization and architecture implications.",
                    "EMERALD: Characterization of emerging applications and algorithms for low-power devices.",
                    "PAPI 5: Measuring power, energy, and the cloud.",
                    "Energy efficiency of lossless data compression on a mobile device: An experimental evaluation.",
                    "Virtual Power Management simulation framework for computer systems.",
                    "Characterizing the microarchitectural side effects of operating system calls.",
                    "QTrace: An interface for customizable full system instrumentation.",
                    "Trace filtering of multithreaded applications for CMP memory simulation.",
                    "A statistical machine learning based modeling and exploration framework for run-time cross-stack energy optimization.",
                    "Use of simple analytic performance models for streaming data applications deployed on diverse architectures.",
                    "A circuit-architecture co-optimization framework for evaluating emerging memory hierarchies.",
                    "Advancing computer systems without technology progress.",
                    "A mathematical hard disk timing model for full system simulation.",
                    "Wall-clock based synchronization: A parallel simulation technology for cluster systems.",
                    "Performance analysis of broadcasting algorithms on the Intel Single-Chip Cloud Computer.",
                    "Selecting benchmark combinations for the evaluation of multicore throughput.",
                    "Pinpointing data locality bottlenecks with low overhead.",
                    "Power measurement techniques on standard compute nodes: A quantitative comparison.",
                    "Power/performance evaluation of energy efficient Ethernet (EEE) for High Performance Computing.",
                    "Non-determinism and overcount on modern hardware performance counter implementations.",
                    "Characterizing scalar opportunities in GPGPU applications.",
                    "Quantifying the energy efficiency of FFT on heterogeneous platforms.",
                    "ISA-independent workload characterization and its implications for specialized architectures.",
                    "Evaluating STT-RAM as an energy-efficient main memory alternative."
                ]
            },
            {
                "sub_name_abbr": "conf/ispass/2012",
                "sub_name": "2012 IEEE International Symposium on Performance Analysis of Systems & Software, New Brunswick, NJ, USA, April 1-3, 2012.",
                "count": 29,
                "papers": [
                    "Keynote: Systems management in the age of cloud.",
                    "Stargazer: Automated regression-based GPU design space exploration.",
                    "A mechanistic performance model for superscalar in-order processors.",
                    "An LTE Uplink Receiver PHY benchmark and subframe-based power management.",
                    "BigHouse: A simulation infrastructure for data center systems.",
                    "A lightweight hybrid hardware/software approach for object-relative memory profiling.",
                    "Lynx: A dynamic instrumentation system for data-parallel applications on GPGPU architectures.",
                    "An FPGA-based multi-core platform for testing and analysis of architectural techniques.",
                    "Comparing the power and performance of Intel's SCC to state-of-the-art CPUs and GPUs.",
                    "Characterizing and evaluating a key-value store application on heterogeneous CPU-GPU systems.",
                    "Selective commitment and selective margin: Techniques to minimize cost in an IaaS cloud.",
                    "Exploiting temporal locality in network traffic using commodity multi-cores.",
                    "Power and performance analysis of network traffic prediction techniques.",
                    "A cycle-level SIMT-GPU simulation framework.",
                    "Bandwidth bandit: Understanding memory contention.",
                    "Performance modeling and characterization of large last level caches.",
                    "SLA-guided energy savings for enterprise servers.",
                    "Understanding the communication characteristics in HBase: What are the fundamental bottlenecks?",
                    "Keynote: Parallelism, heterogeneity, communication: Emerging challenges for performance analysis.",
                    "Data sharing in multi-threaded applications and its impact on chip design.",
                    "Using utility prediction models to dynamically choose program thread counts.",
                    "Speedup stacks: Identifying scaling bottlenecks in multi-threaded applications.",
                    "Performance analysis of thread mappings with a holistic view of the hardware resources.",
                    "A single-pass cache simulation methodology for two-level unified caches.",
                    "Fast and cycle-accurate modeling of a multicore processor.",
                    "FPGA modeling of diverse superscalar processors.",
                    "Evaluating FPGA-acceleration for real-time unstructured search.",
                    "Combined profiling: A methodology to capture varied program behavior across multiple inputs.",
                    "Architectural characterization and similarity analysis of sunspider and Google's V8 Javascript benchmarks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ISPASS 2011",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2011",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2011, 10-12 April, 2011, Austin, TX, USA.",
                "count": 34,
                "papers": [
                    "Keynote I: The era of heterogeneity: Are we prepared?",
                    "Characterization and dynamic mitigation of intra-application cache interference.",
                    "A semi-preemptive garbage collector for solid state drives.",
                    "PRISM: Zooming in persistent RAM storage behavior.",
                    "Evaluation and optimization of multicore performance bottlenecks in supercomputing applications.",
                    "Minimizing interference through application mapping in multi-level buffer caches.",
                    "Analyzing the impact of useless write-backs on the endurance and energy consumption of PCM main memory.",
                    "Memory access pattern-aware DRAM performance model for multi-core systems.",
                    "Characterizing multi-threaded applications based on shared-resource contention.",
                    "Trace-driven simulation of multithreaded applications.",
                    "Efficient memory tracing by program skeletonization.",
                    "Portable trace compression through instruction interpretation.",
                    "Finding cool code: An analysis of source-level causes of temperature effects.",
                    "A reconfigurable simulator for large-scale heterogeneous multicore architectures.",
                    "Towards a scalable data center-level evaluation methodology.",
                    "Storage I/O generation and replay for datacenter applications.",
                    "VMAD: A virtual machine for advanced dynamic analysis of programs.",
                    "A comparative benchmarking of the FFT on Fermi and Evergreen GPUs.",
                    "Supply voltage emulation platform for DVFS voltage drop compensation explorations.",
                    "Performance characterization of mobile-class nodes: Why fewer bits is better.",
                    "Keynote II: Integrated modeling challenges in extreme-scale computing.",
                    "Where is the data? Why you cannot debate CPU vs. GPU performance without the answer.",
                    "Accelerating search and recognition workloads with SSE 4.2 string and text processing instructions.",
                    "A comprehensive analysis and parallelization of an image retrieval algorithm.",
                    "Performance evaluation of adaptivity in software transactional memory.",
                    "Scalable, accurate multicore simulation in the 1000-core era.",
                    "A single-specification principle for functional-to-timing simulator interface design.",
                    "WiLIS: Architectural modeling of wireless systems.",
                    "Detecting race conditions in asynchronous DMA operations with full system simulation.",
                    "Mechanistic-empirical processor performance modeling for constructing CPI stacks on real hardware.",
                    "Power signature analysis of the SPECpower_ssj2008 benchmark.",
                    "Analyzing throughput of GPGPUs exploiting within-die core-to-core frequency variation.",
                    "Universal rules guided design parameter selection for soft error resilient processors.",
                    "A dynamic energy management scheme for multi-tier data centers."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ISPASS 2010",
        "info": "White Plains, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2010",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2010, 28-30 March 2010, White Plains, NY, USA.",
                "count": 30,
                "papers": [
                    "The big pileup.",
                    "Dynamic program analysis of Microsoft Windows applications.",
                    "LagAlyzer: A latency profile analysis and visualization tool.",
                    "Characterizing the design and performance of interactive java applications.",
                    "Synthesizing memory-level parallelism aware miniature clones for SPEC CPU2006 and ImplantBench workloads.",
                    "ArchExplorer.org: A methodology for facilitating a fair Comparison of research ideas.",
                    "StatStack: Efficient modeling of LRU caches.",
                    "Modeling memory concurrency for multi-socket multi-core systems.",
                    "Cache contention and application performance prediction for multi-core systems.",
                    "Memphis: Finding and fixing NUMA-related performance problems on multi-core platforms.",
                    "Understanding transactional memory performance.",
                    "Influences of SIMD architectures for scattered data interpolation algorithm.",
                    "Hardware prediction of OS run-length for fine-grained resource customization.",
                    "Program behavior characterization in large memory systems.",
                    "Simulation environment for studying overlap of communication and computation.",
                    "Scalability comparison of commodity operating systems on multi-cores.",
                    "Incorporating Instruction-Based Sampling into AMD CodeAnalyst.",
                    "Using special-purpose hardware to achieve a hundred-fold speedup in molecular dynamics simulations of proteins.",
                    "The Hadoop distributed filesystem: Balancing portability and performance.",
                    "Scaling OLTP applications on commodity multi-core platforms.",
                    "A study of hardware assisted IP over InfiniBand and its impact on enterprise data center performance.",
                    "Weak execution ordering - exploiting iterative methods on many-core GPUs.",
                    "Visualizing complex dynamics in many-core accelerator architectures.",
                    "PEBIL: Efficient static binary instrumentation for Linux.",
                    "High-level performance modeling of task-based algorithms.",
                    "Exploiting FPGAs for technology-aware system-level evaluation of multi-core architectures.",
                    "Runahead execution vs. conventional data prefetching in the IBM POWER6 microprocessor.",
                    "An analysis of hard to predict branches.",
                    "Performance-effective operation below Vcc-min.",
                    "Demystifying GPU microarchitecture through microbenchmarking."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ISPASS 2009",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2009",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2009, April 26-28, 2009, Boston, Massachusetts, USA, Proceedings.",
                "count": 26,
                "papers": [
                    "Accelerating architecture research.",
                    "Performance analysis in the real world of on line services.",
                    "Differentiating the roles of IR measurement and simulation for power and temperature-aware design.",
                    "User- and process-driven dynamic voltage and frequency scaling.",
                    "Accuracy of performance counter measurements.",
                    "GARNET: A detailed on-chip network model inside a full-system simulator.",
                    "Cetra: A trace and analysis framework for the evaluation of Cell BE systems.",
                    "Zesto: A cycle-level simulator for highly detailed microarchitecture exploration.",
                    "Lonestar: A suite of parallel irregular programs.",
                    "Exploring speculative parallelism in SPEC2006.",
                    "Machine learning based online performance prediction for runtime parallelization and task scheduling.",
                    "WARP: Enabling fast CPU scheduler development and evaluation.",
                    "CMPSched$im: Evaluating OS/CMP interaction on shared cache management.",
                    "Understanding the cost of thread migration for multi-threaded Java applications running on a multicore platform.",
                    "The data-centricity of Web 2.0 workloads and its impact on server performance.",
                    "Characterizing and optimizing the memory footprint of de novo short read DNA sequence assembly.",
                    "An analytic model of optimistic Software Transactional Memory.",
                    "Analyzing CUDA workloads using a detailed GPU simulator.",
                    "Evaluating GPUs for network packet signature matching.",
                    "Online compression of cache-filtered address traces.",
                    "Analysis of the TRIPS prototype block predictor.",
                    "Experiment flows and microbenchmarks for reverse engineering of branch predictor structures.",
                    "Analyzing the impact of on-chip network traffic on program phases for CMPs.",
                    "SuiteSpecks and SuiteSpots: A methodology for the automatic conversion of benchmarking programs into intrinsically checkpointed assembly code.",
                    "Accurately approximating superscalar processor performance from traces.",
                    "QUICK: A flexible full-system functional model."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ISPASS 2008",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2008",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2008, April 20-22, 2008, Austin, Texas, USA, Proceedings.",
                "count": 22,
                "papers": [
                    "Quick Performance Models Quickly: Closely-Coupled Partitioned Simulation on FPGAs.",
                    "Program Phase Detection based on Critical Basic Block Transitions.",
                    "An Adaptive Synchronization Technique for Parallel Simulation of Networked Clusters.",
                    "Conservative vs. Optimistic Parallelization of Stateful Network Intrusion Detection.",
                    "Computer Aided Engineering of Cluster Computers.",
                    "An Analysis of I/O And Syscalls In Critical Sections And Their Implications For Transactional Memory.",
                    "Full-System Critical Path Analysis.",
                    "Explaining the Impact of Network Transport Protocols on SIP Proxy Performance.",
                    "Performance Analysis of ARQ Protocols using a Theorem Prover.",
                    "Investigating the TLB Behavior of High-end Scientific Applications on Commodity Microprocessors.",
                    "Scientific Computing Applications on a Stream Processor.",
                    "Pinpointing and Exploiting Opportunities for Enhancing Data Reuse.",
                    "Processor Performance Modeling using Symbolic Simulation.",
                    "Next-Generation Performance Counters: Towards Monitoring Over Thousand Concurrent Events.",
                    "Configurational Workload Characterization.",
                    "Characterizing the Unique and Diverse Behaviors in Existing and Emerging General-Purpose and Domain-Specific Benchmark Suites.",
                    "Independent Component Analysis and Evolutionary Algorithms for Building Representative Benchmark Subsets.",
                    "Characterization of SPEC CPU2006 and SPEC OMP2001: Regression Models and their Transferability.",
                    "Dynamic Thermal Management through Task Scheduling.",
                    "Metrics for Architecture-Level Lifetime Reliability Analysis.",
                    "Trace-based Performance Analysis on Cell BE.",
                    "HMMer-Cell: High Performance Protein Profile Searching on the Cell/B.E. Processor."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ISPASS 2007",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2007",
                "sub_name": "2007 IEEE International Symposium on Performance Analysis of Systems and Software, April 25-27, 2007, San Jose, California, USA, Proceedings.",
                "count": 26,
                "papers": [
                    "Workloads, Scalability, and QoS Considerations in CMP Platforms.",
                    "Performance Modeling and Analysis for AMD's High Performance Microprocessors.",
                    "Accelerating Full-System Simulation through Characterizing and Predicting Operating System Performance.",
                    "A Comparison of Two Approaches to Parallel Simulation of Multiprocessors.",
                    "PTLsim: A Cycle Accurate Full System x86-64 Microarchitectural Simulator.",
                    "Understanding the Memory Performance of Data-Mining Workloads on Small, Medium, and Large-Scale CMPs Using Hardware-Software Co-simulation.",
                    "Characterizing a Complex J2EE Workload: A Comprehensive Analysis and Opportunities for Optimizations.",
                    "Performance Characterization of Decimal Arithmetic in Commercial Java Workloads.",
                    "Performance Impact of Unaligned Memory Operations in SIMD Extensions for Video Codec Applications.",
                    "Combining Simulation and Virtualization through Dynamic Sampling.",
                    "Phase-Guided Small-Sample Simulation.",
                    "DRAM-Level Prefetching for Fully-Buffered DIMM: Design, Performance and Power Saving.",
                    "Last-Touch Correlated Data Streaming.",
                    "Using Model Trees for Computer Architecture Performance Analysis of Software Applications.",
                    "Modeling and Single-Pass Simulation of CMP Cache Capacity and Accessibility.",
                    "Using Wavelet Domain Workload Execution Characteristics to Improve Accuracy, Scalability and Robustness in Program Phase Analysis.",
                    "Modeling and Characterizing Power Variability in Multicore Architectures.",
                    "Complete System Power Estimation: A Trickle-Down Approach Based on Performance Events.",
                    "An Analysis of Microarchitecture Vulnerability to Soft Errors on Simultaneous Multithreaded Architectures.",
                    "Cross Binary Simulation Points.",
                    "Reverse State Reconstruction for Sampled Microarchitectural Simulation.",
                    "An Analysis of Performance Interference Effects in Virtual Environments.",
                    "Performance Analysis of Cell Broadband Engine for High Memory Bandwidth Applications.",
                    "Benefits of I/O Acceleration Technology (I/OAT) in Clusters.",
                    "CA-RAM: A High-Performance Memory Substrate for Search-Intensive Applications.",
                    "Simplifying Active Memory Clusters by Leveraging Directory Protocol Threads."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ISPASS 2006",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2006",
                "sub_name": "2006 IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2006, March 19-21, 2006, Austin, Texas, USA, Proceedings.",
                "count": 26,
                "papers": [
                    "RAMP: research accelerator for multiple processors - a community vision for a shared experimental parallel HW/SW platform.",
                    "Simulation sampling with live-points.",
                    "Accelerating architectural exploration using canonical instruction segments.",
                    "Branch trace compression for snapshot-based simulation.",
                    "Critical path analysis of the TRIPS architecture.",
                    "Characterizing the branch misprediction penalty.",
                    "Revisiting the performance impact of branch predictor latencies.",
                    "Evaluating the efficacy of statistical simulation for design space exploration.",
                    "Comparing simulation techniques for microarchitecture-aware floorplanning.",
                    "A statistical multiprocessor cache model.",
                    "Power efficient resource scaling in partitioned architectures through dynamic heterogeneity.",
                    "Compiler-based adaptive fetch throttling for energy-efficiency.",
                    "Modeling TCAM power for next generation network devices.",
                    "Quantitative system design.",
                    "Comparing multinomial and k-means clustering for SimPoint.",
                    "Considering all starting points for simultaneous multithreading simulation.",
                    "Automatic testcase synthesis and performance model validation for high performance PowerPC processors.",
                    "Improved stride prefetching using extrinsic stream characteristics.",
                    "Friendly fire: understanding the effects of multiprocessor prefetches.",
                    "MESA: reducing cache conflicts by integrating static and run-time methods.",
                    "Performance modeling and prediction for scientific Java applications.",
                    "Assessing the impact of reactive workloads on the performance of Web applications.",
                    "Workload sanitation for performance evaluation.",
                    "ATTILA: a cycle-level execution-driven simulator for modern GPU architectures.",
                    "Acquisition and evaluation of long DDR2-SDRAM access sequences.",
                    "Aestimo: a feedback-directed optimization evaluation tool."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ISPASS 2005",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2005",
                "sub_name": "IEEE International Symposium on Performance Analysis of Systems and Software, ISPASS 2005, March 20-22, 2005, Austin, Texas, USA, Proceedings.",
                "count": 30,
                "papers": [
                    "EEMBC and the Purposes of Embedded Processor Benchmarking.",
                    "BioBench: A Benchmark Suite of Bioinformatics Applications.",
                    "Measuring Program Similarity: Experiments with SPEC CPU Benchmark Suites.",
                    "Simulation Differences Between Academia and Industry: A Branch Prediction Case Study.",
                    "PowerFITS: Reduce Dynamic and Static I-Cache Power Using Application Specific Instruction Set Synthesis.",
                    "A High Performance, Energy Efficient GALS ProcessorMicroarchitecture with Reduced Implementation Complexity.",
                    "Studying Thermal Management for Graphics-Processor Architectures.",
                    "Accelerating Multiprocessor Simulation with a Memory Timestamp Record.",
                    "Intrinsic Checkpointing: A Methodology for Decreasing Simulation Time Through Binary Modification.",
                    "Enhancing Multiprocessor Architecture Simulation Speed Using Matched-Pair Comparison.",
                    "Panel Discussion: Architectures for the Future.",
                    "Insight, not (random) numbers.",
                    "Performance Characterization of Java Applications on SMT Processors.",
                    "Partitioning Multi-Threaded Processors with a Large Number of Threads.",
                    "Power-Performance Implications of Thread-level Parallelism on Chip Multiprocessors.",
                    "Motivation for Variable Length Intervals and Hierarchical Phase Behavior.",
                    "Fast, Accurate Microarchitecture Simulation Using Statistical Phase Detection.",
                    "A Trace-Driven Simulator For Palm OS Devices.",
                    "On the Scalability of 1- and 2-Dimensional SIMD Extensions for Multimedia Applications.",
                    "Dataflow: A Complement to Superscalar.",
                    "Scalarization on Short Vector Machines.",
                    "Anatomy and Performance of SSL Processing.",
                    "Architectural Characterization of Processor Affinity in Network Processing.",
                    "Performance Analysis of a New Packet Trace Compressor based on TCP Flow Clustering.",
                    "Analysis of Network Processing Workloads.",
                    "The Strong correlation Between Code Signatures and Performance.",
                    "Pro-active Page Replacement for Scientific Applications: A Characterization.",
                    "Reaping the Benefit of Temporal Silence to Improve Communication Performance.",
                    "Balancing Performance and Reliability in the Memory Hierarchy.",
                    "On the provision of prioritization and soft qos in dynamically reconfigurable shared data-centers over infiniband."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ISPASS 2004",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2004",
                "sub_name": "2004 IEEE International Symposium on Performance Analysis of Systems and Software, March 10-12, 2004, Austin, Texas, USA, Proceedings.",
                "count": 23,
                "papers": [
                    "Opening and keynote 1.",
                    "Eccentric and fragile benchmarks.",
                    "Communication breakdown: analyzing CPU usage in commercial Web workloads.",
                    "StatCache: a probabilistic approach to efficient and accurate data locality analysis.",
                    "Sockets Direct Protocol over InfiniBand in clusters: is it beneficial?",
                    "The BlueGene/L pseudo cycle-accurate simulator.",
                    "A co-phase matrix to guide simultaneous multithreading simulation.",
                    "Structures for phase classification.",
                    "Deconstructing commit.",
                    "Dynamically reducing pressure on the physical register file through simple register sharing.",
                    "Performance evaluation of exclusive cache hierarchies.",
                    "Keynote II.",
                    "Effectiveness of simple memory models for performance prediction.",
                    "Using cache mapping to improve memory performance handheld devices.",
                    "Characterization of the data access behavior for TPC-C traces.",
                    "Cache implications of aggressively pipelined high performance microprocessors.",
                    "Dynamic pretenuring schemes for generational garbage collection.",
                    "Selective profiling of Java applications using dynamic bytecode instrumentation.",
                    "Spectral analysis for characterizing program power and performance.",
                    "Compiler-directed physical address generation for reducing dTLB power.",
                    "The future of simulation: A field of dreams.",
                    "Efficient architectural design of high performance microprocessors.",
                    "Architectures and compilers for multimedia."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "ISPASS 2003",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2003",
                "sub_name": "2003 IEEE International Symposium on Performance Analysis of Systems and Software, March 6-8, 2003, Austin, Texas, USA, Proceedings.",
                "count": 22,
                "papers": [
                    "Integrating complete-system and user-level performance/power simulators: the SimWattch approach.",
                    "Inferno: a functional simulation infrastructure for modeling microarchitectural data speculations.",
                    "Performance potentials of compiler-directed data speculation.",
                    "Empirical evaluation of capacity estimation tools.",
                    "Mathematical modelling of adaptive wormhole routing in the presence of self-similar traffic.",
                    "An MPEG-4 performance study for non-SIMD, general purpose architectures.",
                    "Accelerating private-key cryptography via multithreading on symmetric multiprocessors.",
                    "TCP performance re-visited.",
                    "A new synthetic web server trace generation methodology.",
                    "1D performance analysis and tracing of technical and Java applications on the Itanium2 processor.",
                    "Evaluating the importance of virtual memory for Java.",
                    "On evaluating request-distribution schemes for saving energy in server clusters.",
                    "Interplay of energy and performance for disk arrays running transaction processing workloads.",
                    "Performance study of a cluster runtime system for dynamic interactive stream-oriented applications.",
                    "Performance modelling of distributed e-business applications using Queuing Petri Nets.",
                    "Performance analysis and optimization of a distributed Video on Demand service.",
                    "Complete instrumentation requirements for performance analysis of Web based technologies.",
                    "Performance implications of chipset caches in web servers.",
                    "Web applications and dynamic reconfiguration in UNIX servers.",
                    "Memory reference reuse latency: Accelerated warmup for sampled microarchitecture simulation.",
                    "A statistical model of skewed-associativity.",
                    "A hybrid allocator."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "ISPASS 2001",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2001",
                "sub_name": "2001 IEEE International Symposium on Performance Analysis of Systems and Software, November 4-6,2001, Tucson, Arizona, USA, Proceedings.",
                "count": 24,
                "papers": [
                    "MASE: a novel infrastructure for detailed microarchitectural modeling.",
                    "Early design phase power/performance modeling through statistical simulation.",
                    "Performance analysis using pipeline visualization.",
                    "Implementation and evaluation of a best-effort scheduling algorithm in an embedded real-time system.",
                    "An evaluation of the POSIX trace standard implemented in RT-linux.",
                    "Cycle accurate thread timer for linux environment.",
                    "About the sensitivity of the HLRC-DU protocol on diff and page sizes.",
                    "Geist: a generator for e-commerce & internet server traffic.",
                    "Performance characterization experience of multi-tier e-business systems using queuing operational analysis.",
                    "Understanding control flow transfer and its predictability in java processing.",
                    "The effects of context switching on branch predictor performance.",
                    "Estimating internal memory fragmentation for java programs under the binary buddy policy.",
                    "An evaluation of search tree techniques in the presence of caches.",
                    "Automatic memory hierarchy characterization.",
                    "Using program and user information to improve file prediction performance.",
                    "Efficient profile-based evaluation of randomising set index functions for cache memories.",
                    "Workload characterization of multithreaded java servers.",
                    "Behavior and performance of interactive multi-player game servers.",
                    "Parallel simulation of multiprocessor execution: implementation and results for simplescalar.",
                    "Locality-aware predictive scheduling of network processors.",
                    "Statistical usage testing applied to mobile network verification.",
                    "Balancing thoughput and fairness in SMT processors.",
                    "An empirical study of the scalability aspects of instruction distribution algorithms for clustered processors.",
                    "How to compare the performance of two SMT microarchitectures."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "ISPASS 2000",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ispass/2000",
                "sub_name": "2000 IEEE International Symposium on Performance Analysis of Systems and Software, April 24-35, 2000, Austin, Texas, USA, Proceedings.",
                "count": 29,
                "papers": [
                    "Performance analysis through synthetic trace generation.",
                    "Extracting fine-grain profiles of in-order executions of instruction level parallel programs.",
                    "Accurate simulation and evaluation of code reordering.",
                    "Quantifying instruction-level parallelism limits on an EPIC architecture.",
                    "Performance evaluation of real-time scheduling on a multicomputer architecture.",
                    "Performance evaluation of middleware bridging technologies.",
                    "A practitioner report on the evaluation of the performance of the C, C++ and Java compilers on the OS/390 platform.",
                    "DB2 for OS/390 V5 vs. V6 outer join performance.",
                    "Checking order-insensitivity using ternary simulation in synchronous programs.",
                    "Do generational schemes improve the garbage collection efficiency?",
                    "A quantitative simulator for dynamic memory managers.",
                    "Real-time image on QoS Web.",
                    "Issues in the design of store buffers in dynamically scheduled processors.",
                    "Performance tradeoffs in sequencer design on a new G4 PowerPCTM microprocessor.",
                    "Instruction overhead and data locality effects in superscalar processors.",
                    "Modeling load address behaviour through recurrences.",
                    "Methodology to optimize the cost/performance of disk subsystems.",
                    "Invocation profile characterization of Java applications.",
                    "Some observations based on simple models of MP scaling.",
                    "Performance scalability in multiprocessor systems with resource contention.",
                    "An efficient solver for Cache Miss Equations.",
                    "An analytical model for loop tiling and its solution.",
                    "CommBench-a telecommunications benchmark for network processors.",
                    "Simplified workload characterization using unified prediction.",
                    "A new approach in the analysis and modeling of disk access patterns.",
                    "Mobile functionality in a pervasive world.",
                    "Design alternatives for scalable Web server accelerators.",
                    "Web latency reduction via client-side prefetching.",
                    "A server performance model for static Web workloads."
                ]
            }
        ]
    }
]