[
    {
        "year": "2021",
        "name": "32nd ISSRE 2021",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2021",
                "sub_name": "32nd IEEE International Symposium on Software Reliability Engineering, ISSRE 2021, Wuhan, China, October 25-28, 2021.",
                "count": 52,
                "papers": [
                    "Tensfa: Detecting and Repairing Tensor Shape Faults in Deep Learning Systems.",
                    "Expanding Fix Patterns to Enable Automatic Program Repair.",
                    "Lessons Learned from the Development of a Mechanical Ventilator for COVID-19.",
                    "How Long Will it Take to Mitigate this Incident for Online Service Systems?",
                    "BEIRUT: Repository Mining for Defect Prediction.",
                    "Multi-source Cross Project Defect Prediction with Joint Wasserstein Distance and Ensemble Learning.",
                    "GCN2defect : Graph Convolutional Networks for SMOTETomek-based Software Defect Prediction.",
                    "LogFlash: Real-time Streaming Anomaly Detection and Diagnosis from System Logs for Large-scale Software Systems.",
                    "Identifying Root-Cause Metrics for Incident Diagnosis in Online Service Systems.",
                    "Robust KPI Anomaly Detection for Large-Scale Software Services with Partial Labels.",
                    "Contextual-Semantic-Aware Linkable Knowledge Prediction in Stack Overflow via Self-Attention.",
                    "Optimizing Selective Protection for CNN Resilience.",
                    "Dependency-aware Form Understanding.",
                    "Out-of-Distribution Detection through Relative Activation-Deactivation Abstractions.",
                    "ReFixar: Multi-version Reasoning for Automated Repair of Regression Errors.",
                    "Usability and Aesthetics: Better Together for Automated Repair of Web Pages.",
                    "An Empirical Study on Common Bugs in Deep Learning Compilers.",
                    "A Comparative Study of Automatic Program Repair Techniques for Security Vulnerabilities.",
                    "More Reliable Test Suites for Dynamic APR by using Counterexamples.",
                    "Evaluating Natural Language Inference Models: A Metamorphic Testing Approach.",
                    "Black-Box and White-Box Test Case Generation for RESTful APIs: Enemies or Allies?",
                    "An Efficient Approximation for Quantitative Analysis of Dynamic Fault Trees.",
                    "Ahead of Time Mutation Based Fault Localisation using Statistical Inference.",
                    "What to Blame? On the Granularity of Fault Localization for Deep Neural Networks.",
                    "A Novel Automatic Query Expansion with Word Embedding for IR-based Bug Localization.",
                    "Vall-nut: Principled Anti-Grey box - Fuzzing.",
                    "Fuzz Testing the Compiled Code in R Packages.",
                    "Black-Box Testing of Deep Neural Networks.",
                    "EVIL: Exploiting Software via Natural Language.",
                    "Automatically Identifying Bug Reports with Tactical Vulnerabilities by Deep Feature Learning.",
                    "Eager Falsification for Accelerating Robustness Verification of Deep Neural Networks.",
                    "PyMTDEvaluator: A Tool for Time-Based Moving Target Defense Evaluation: Tool description paper.",
                    "CloudPin: A Root Cause Localization Framework of Shared Bandwidth Package Traffic Anomalies in Public Cloud Networks.",
                    "Peculiar: Smart Contract Vulnerability Detection Based on Crucial Data Flow Graph and Pre-training Techniques.",
                    "Static Bound Analysis of Dynamically Allocated Resources for C Programs.",
                    "Simplify Array Processing Loops for Efficient Program Verification.",
                    "The Behavioral Diversity of Java JSON Libraries.",
                    "Static Type Inference for Foreign Functions of Python.",
                    "Suraksha: A Framework to Analyze the Safety Implications of Perception Design Choices in AVs.",
                    "Secure and Efficient White-box Encryption Scheme for Data Protection against Shared Cache Attacks in Cloud Computing.",
                    "Vu1SPG: Vulnerability detection based on slice property graph representation learning.",
                    "PyGuard: Finding and Understanding Vulnerabilities in Python Virtual Machines.",
                    "iReview: an Intelligent Code Review Evaluation Tool using Biofeedback.",
                    "Improving Code Summarization Through Automated Quality Assurance.",
                    "Characterizing Sensor Leaks in Android Apps.",
                    "A Characteristic Study of Deadlocks in Database-Backed Web Applications.",
                    "One Step Further: Investigating Problematic Files of Architecture Anti-patterns.",
                    "Characterizing and Understanding Software Developer Networks in Security Development.",
                    "Fast Change-Based Alarm Reporting for Evolving Software Systems.",
                    "Nondeterministic Impact of CPU Multithreading on Training Deep Learning Systems.",
                    "HawkEye: User-Guided Enumeration of Scenarios.",
                    "Peeking into the Gray Area of Mobile World: An Empirical Study of Unlabeled Android Apps."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2021w",
                "sub_name": "IEEE International Symposium on Software Reliability Engineering, ISSRE 2021 - Workshops, Wuhan, China, October 25-28, 2021.",
                "count": 78,
                "papers": [
                    "Within-Project Software Aging Defect Prediction Based on Active Learning.",
                    "Semi-automated model extraction from observations for dependability analysis.",
                    "RusBox: Towards Efficient and Adaptive Sandboxing for Rust.",
                    "Sensitivity Analysis of Software Rejuvenation Model with Markov Regenerative Process.",
                    "Aging and Rejuvenation Models of Load Changing Attacks in Micro-Grids.",
                    "On the Necessity of Explicit Artifact Links in Safety Assurance Cases for Machine Learning.",
                    "Evaluation of software aging in component-based Web Applications subject to soft errors over time.",
                    "Memory Degradation Analysis in Private and Public Cloud Environments.",
                    "My Services Got Old! Can Kubernetes Handle the Aging of Microservices?",
                    "Software Testing Strategies for Detecting Hypercall Handlers' Aging-related Bugs.",
                    "Recommendations for the Usage of Design Models in Aviation Software.",
                    "(WiP) LLTFI: Low-Level Tensor Fault Injector.",
                    "From Application Security Verification Standard (ASVS) to Regulation Compliance: A Case Study in Financial Services Sector.",
                    "Software Requirement Criteria based on Human Errors.",
                    "A Test Case Generation Method of Combinatorial Testing based on τ-way Testing with Adaptive Random Testing.",
                    "An efficient dual ensemble software defect prediction method with neural network.",
                    "KS-TCP: An Efficient Test Case Prioritization Approach based on K-medoids and Similarity.",
                    "Input/Output Check Bugs Taxonomy: Injection Errors in Spotlight.",
                    "Genetic Algorithm for Scheduling Communication Networks in Time-Triggered Systems-of-Systems.",
                    "Automatic Extraction of Behavioral Features for Test Program Similarity Analysis.",
                    "IDEA: Runtime Collection of Android Data.",
                    "Migration of Monoliths through the Synthesis of Microservices using Combinatorial Optimization.",
                    "Issue Categorization and Analysis of an Open-Source Driving Assistant System.",
                    "MC-FGSM: Black-box Adversarial Attack for Deep Learning System.",
                    "Semantic Learning and Understanding of multivehicle interaction patterns Using Primitive Driving Patterns With Bayesian Nonparametric Approaches.",
                    "Safe and Secure: Mutually Supporting Safety and Security Analyses with Model-Based Suggestions.",
                    "A Combinatorial Reliability Analysis of Dynamic Fault Trees with Priority-AND Gates.",
                    "$^{\\prime}\\mathbf{R}$: Towards Detecting and Understanding Code-Document Violations in Rust.",
                    "Computation Offloading and Task Scheduling with Fault-Tolerance for Minimizing Redundancy in Edge Computing.",
                    "Reliability Analysis of Systems Subject to Imperfect Fault Coverage Considering Failure Propagation and Component Relevancy.",
                    "Methods for deep learning model failure detection and model adaption: A survey.",
                    "Predicting gray fault based on context graph in container-based cloud.",
                    "MindFI: A Fault Injection Tool for Reliability Assessment of MindSpore Applicacions.",
                    "Important-unit Coverage for Recurrent Neural Network.",
                    "Multi-Scale Software Network Model for Software Safety of the Intended Functionality.",
                    "Network Intrusion Detection by an Approximate Logic Neural Model.",
                    "Meaningful color image encryption algorithm based on compressive sensing and chaotic map.",
                    "Detection of IoT Devices That Mine Cryptocurrency.",
                    "Rustpi: A Rust-powered Reliable Micro-kernel Operating System.",
                    "Targeted Code Inspection based on Human Errors.",
                    "Assurance Carrying Code for Software Supply Chain.",
                    "A Static Analysis Framework for Detecting Bugs in Introductory Programs.",
                    "Multi-Feature Fusion based Image Steganography using GAN.",
                    "Exception Handling Recommendation Based on Self-Attention Network.",
                    "When is Continuous Integration Useful? Empirical Study on Team Size and Reporters in Development.",
                    "Hierarchical Scheduling for Real-Time Containers in Mixed-Criticality Systems.",
                    "SourceSnippet2Binary: A Method for Searching Vulnerable Source Code Snippets in Binaries.",
                    "Eye Tracking Sensors as a Contactless Interfaces in Wireless Security Protocols.",
                    "Information Hiding using Bucket Steganography.",
                    "Dynamic Filtering and Prioritization of Static Code Analysis Alerts.",
                    "ColocationSim: Simulate Colocation Datacenter with Microservices and Performance Interference.",
                    "Software Security Readiness and Deployment.",
                    "A Runtime Monitoring Based Fuzzing Framework for Temporal Properties.",
                    "Online Log Parsing: Preliminary Literature Review.",
                    "TSAI - Test Selection using Artificial Intelligence for the Support of Continuous Integration.",
                    "Mining Numerical Relations for Improving Software Reliability.",
                    "A next-generation platform for Cyber Range-as-a-Service.",
                    "Failure Prediction for Cloud Applications through Ensemble Learning.",
                    "Generation and Verification of Executable Assurance Case by Model-based Engineering.",
                    "System-specific risk rating of software vulnerabilities in industrial automation & control systems.",
                    "Patternika: A Pattern-Mining-Based Tool For Automatic Library Migration.",
                    "Innovation evaluation framework using state transition probability of the product.",
                    "The protection of LP-WAN Endpoints via TEE: a Chemical Storage Case Study.",
                    "Genetic Algorithm-based Testing of Industrial Elevators under Passenger Uncertainty.",
                    "MultiCode: A Unified Code Analysis Framework based on Multi-type and Multi-granularity Semantic Learning.",
                    "Diktat: Lightweight Static Analysis for Kotlin.",
                    "Towards a Secure Software Lifecycle for Autonomous Vehicles.",
                    "Continuous Testing and SLA Management of 5G Networks for Industrial Automation.",
                    "Disclosing the Fragility Problem of Virtual Safety Testing for Autonomous Driving Systems.",
                    "SHA-3-LPHP: Hardware Acceleration of SHA-3 for Low-Power High-Performance Systems.",
                    "ReSwitcher: Automatically Refactoring Java Programs for Switch Expression.",
                    "Evolution of the IEEE P7009 Standard: Towards Fail-Safe Design of Autonomous Systems.",
                    "Kubernetes for Cloud Container Orchestration Versus Containers as a Service (CaaS): Practical Insights.",
                    "Classification of Testable and Valuable User Stories by using Supervised Machine Learning Classifiers.",
                    "The Necessity of Low-code Engineering for Industrial Software Development: A Case Study and Reflections.",
                    "Automatic Issue Classifier: A Transfer Learning Framework for Classifying Issue Reports.",
                    "How Far Have We Come in Fault Tolerance for Distributed Graph Processing: A Quantitative Assessment of Fault Tolerance Effectiveness.",
                    "Changes in Intent: Behavioral Predictions of Distributed SDN Controller Reconfiguration."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st ISSRE 2020",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2020",
                "sub_name": "31st IEEE International Symposium on Software Reliability Engineering, ISSRE 2020, Coimbra, Portugal, October 12-15, 2020.",
                "count": 38,
                "papers": [
                    "Fault Triggers in the TensorFlow Framework: An Experience Report.",
                    "On failures of RGB cameras and their effects in autonomous driving applications.",
                    "AV-FUZZER: Finding Safety Violations in Autonomous Driving Systems.",
                    "LogTransfer: Cross-System Log Anomaly Detection for Software Systems with Transfer Learning.",
                    "Unsupervised Detection of Microservice Trace Anomalies through Service-Level Deep Bayesian Networks.",
                    "How Far Have We Come in Detecting Anomalies in Distributed Systems? An Empirical Study with a Statement-level Fault Injection Method.",
                    "Understanding Merge Conflicts and Resolutions in Git Rebases.",
                    "AFLTurbo: Speed up Path Discovery for Greybox Fuzzing.",
                    "SwissLog: Robust and Unified Deep Learning Based Log Anomaly Detection for Diverse Faults.",
                    "QoS-aware Metamorphic Testing: An Elevation Case Study.",
                    "Fault Injection to Generate Failure Data for Failure Prediction: A Case Study.",
                    "Modelling Machine Learning Components for Mapping and Scheduling of AUTOSAR Runnables.",
                    "Connecting Software Reliability Growth Models to Software Defect Tracking.",
                    "Probabilistic Symbolic Analysis of Neural Networks.",
                    "Designing Neural Networks Using Logical Specs.",
                    "An Exploratory Study of Bugs in Extended Reality Applications on the Web.",
                    "Deep Learning Based Valid Bug Reports Determination and Explanation.",
                    "HINDBR: Heterogeneous Information Network Based Duplicate Bug Report Prediction.",
                    "A Reactive Batching Strategy of Apache Kafka for Reliable Stream Processing in Real-time.",
                    "Dependability Evaluation of Middleware Technology for Large-scale Distributed Caching.",
                    "Identifying and Prioritizing Chaos Experiments by Using Established Risk Analysis Techniques.",
                    "Correlating UI Contexts with Sensitive API Calls: Dynamic Semantic Extraction and Analysis.",
                    "An Empirical Evaluation of GDPR Compliance Violations in Android mHealth Apps.",
                    "Exposing Android Event-Based Races by Selective Branch Instrumentation.",
                    "FSCS-SIMD: An efficient implementation of Fixed-Size-Candidate-Set adaptive random testing using SIMD instructions.",
                    "Cost-Effective Testing of a Deep Learning Model through Input Reduction.",
                    "Investigating the Configurations of an Industrial Path Planner in Terms of Collision Avoidance.",
                    "Detecting Implementation Bugs in Graph Convolutional Network based Node Classifiers.",
                    "Cross-Project Aging-Related Bug Prediction Based on Joint Distribution Adaptation and Improved Subclass Discriminant Analysis.",
                    "Locating the Clues of Declining Success Rate of Service Calls.",
                    "An Empirical Study of Thresholds for Code Measures.",
                    "On-board Diagnosis: A First Step from Detection to Prevention of Intrusions on Avionics Applications.",
                    "Evaluation of RESTful frameworks under soft errors.",
                    "SACC - A property driven approach to expose undesired behaviors among system's components.",
                    "Fault Localization for Declarative Models in Alloy.",
                    "Understanding Reproducibility and Characteristics of Flaky Tests Through Test Reruns in Java Projects.",
                    "Model-Driven Fault Injection in Java Source Code.",
                    "TensorFI: A Flexible Fault Injection Framework for TensorFlow Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2020w",
                "sub_name": "2020 IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Coimbra, Portugal, October 12-15, 2020.",
                "count": 75,
                "papers": [
                    "Testing and Debugging Autonomous Driving: Experiences with Path Planner and Future Challenges.",
                    "ISSRE 2020 Doctoral Symposium Keynote : How to Get Your Paper Rejected.",
                    "How do Ordinary Coding Errors Contribute to Security Vulnerabilities?",
                    "Fuzzing C++ class interfaces for generating and running tests with libFuzzer.",
                    "SAR Handbook Chapter: Experimental Tools for Software Aging Analysis.",
                    "K-Detector: Identifying Duplicate Crash Failures in Large-Scale Software Delivery.",
                    "BP-IDS: Using business process specification to leverage intrusion detection in critical infrastructures.",
                    "ADF2T: an Active Disk Failure Forecasting and Tolerance Software.",
                    "When Failure is (Not) an Option: Reliability Models for Microservices Architectures.",
                    "CRESCO Framework and Checker: Automatic generation of Reflective UML State Machine's C++ Code and Checker.",
                    "Applying Modular Decomposition in Simulink.",
                    "Multi-label Classification of Commit Messages using Transfer Learning.",
                    "Using Semantic Analysis and Graph Mining Approaches to Support Software Fault Fixation.",
                    "A Human Error Based Approach to Understanding Programmer-Induced Software Vulnerabilities.",
                    "Independent Verification and Validation for the Space Industry: Guide Evolution Experience.",
                    "A Process to Support Safety Analysis for a System-of-Systems.",
                    "Time-Series-Based Clustering for Failure Analysis in Hardware-in-the-Loop Setups: An Automotive Case Study.",
                    "Instrumenting Compiler Pipeline to Synthesise Traceable Runtime Memory Layouts in Mixed-critical Applications.",
                    "Static and Verifiable Memory Partitioning for Safety-Critical Systems.",
                    "Systematic Software Testing of Critical Embedded Digital Devices in Nuclear Power Applications.",
                    "RSX: Reproduction Scenario Extraction Technique for Business Application Workloads in DBMS.",
                    "ConstBin: A Tool for Automatic Fixing of Unreproducible Builds.",
                    "An improved fuzzing approach based on adaptive random testing.",
                    "Migrating Large Deep Learning Models to Serverless Architecture.",
                    "eAPT: enhancing APT with a mirror site resolver.",
                    "Techniques and Tools for Advanced Software Vulnerability Detection.",
                    "Reliability Evaluation of ML systems, the oracle problem.",
                    "Improving the Security of Microservice Systems by Detecting and Tolerating Intrusions.",
                    "Towards safety monitoring of ML-based perception tasks of autonomous systems.",
                    "A Fault Localization and Debugging Support Framework driven by Bug Tracking Data.",
                    "Engineering Resilience: Predicting The Change Impact on Performance and Availability of Reconfigurable Systems.",
                    "Using Metamorphic Testing to Evaluate DNN Coverage Criteria.",
                    "SIDE: Security-aware Integrated Development Environment.",
                    "Applying Machine Learning with Chaos Engineering.",
                    "Multi-Language Web Vulnerability Detection.",
                    "Challenges Faced with Application Performance Monitoring (APM) when Migrating to the Cloud.",
                    "Modelling CI/CD Pipeline Through Agent-Based Simulation.",
                    "Automated Tool for Revising Masking MC/DC Test Suite.",
                    "Test-First for Abstracted Behavior of Software Using Extended Finite State Machine.",
                    "Model-based Quantitative Fault Tree Analysis based on FIDES Reliability Prediction.",
                    "Unit Lemmas for Detecting Requirement and Specification Flaws.",
                    "TDABD: Test-Driven-Assurance-Based Development.",
                    "Should we \"safely\" handle the uncertainties at runtime? - A rather seldom asked question.",
                    "Similarity Calculation of Executable Using Intel Pin Instrumentation Framework.",
                    "Root cause prediction based on bug reports.",
                    "Multi-Level Execution Trace Based Lock Contention Analysis.",
                    "AHPCap: A Framework for Automated Hardware Profiling and Capture of Mobile Application States.",
                    "Domain Metric Driven Decomposition of Data-Intensive Applications.",
                    "Towards the synthesis of context-aware choreographies.",
                    "Towards Anomaly Detectors that Learn Continuously.",
                    "Standing on the Shoulders of Software Product Line Research for Testing Systems of Systems.",
                    "Declarative Dashboard Generation.",
                    "A Reconfiguration Approach for Open Adaptive Systems-of-Systems.",
                    "Towards Declarative Decentralised Application Management in the Fog.",
                    "Vulnerability Analysis as Trustworthiness Evidence in Security Benchmarking: A Case Study on Xen.",
                    "Evaluating the Accuracy of Password Strength Meters using Off-The-Shelf Guessing Attacks.",
                    "EARNEST: A challenge-based intrusion prevention system for CAN messages.",
                    "Considering Reliability of Deep Learning Function to Boost Data Suitability and Anomaly Detection.",
                    "Evaluating Deep Learning Classification Reliability in Android Malware Family Detection.",
                    "A flexible simulation-based framework for model-based/data-driven dependability evaluation.",
                    "Resilience, Survivability, and Elasticity: A Taxonomy for Change Impact Quantification of Reconfigurable Systems.",
                    "Ensuring Dataset Quality for Machine Learning Certification.",
                    "New Wine in an Old Bottle: N-Version Programming for Machine Learning Components.",
                    "Towards Automated Evidence Generation for Rapid and Continuous Software Certification.",
                    "Checkable Safety Cases: Enabling Automated Consistency Checks between Safety Work Products.",
                    "Safety-Critical Software - Quantification of Test Results.",
                    "Generating test cases to evaluate and improve processes of safety-critical systems development.",
                    "Chapter 1: Software Aging and Rejuvenation: A Genesis - Extended Abstract.",
                    "Chapter 3: Software Rejuvenation: Key Concepts and Granularity.",
                    "SAR Handbook Chapter: Measurements-based aging analysis.",
                    "Markov chains and Petri nets for software rejuvenation systems.",
                    "Chapter 8: Software Aging Monitoring and Rejuvenation for the Assessment of High Availability Systems - Extended Abstract.",
                    "Detecting Struct Member-Related Memory Leaks Using Error Code Analysis in Linux Kernel.",
                    "How Robust is the Optimal Software Rejuvenation Timing?",
                    "Software Aging in Image Classification Systems on Cloud and Edge."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th ISSRE 2019",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2019",
                "sub_name": "30th IEEE International Symposium on Software Reliability Engineering, ISSRE 2019, Berlin, Germany, October 28-31, 2019.",
                "count": 42,
                "papers": [
                    "Charting a Course Through Uncertain Environments: SEA Uses Past Problems to Avoid Future Failures.",
                    "Assessing the Safety and Reliability of Autonomous Vehicles from Road Testing.",
                    "A Safety Analysis Method for Perceptual Components in Automated Driving.",
                    "FluxRank: A Widely-Deployable Framework to Automatically Localizing Root Cause Machines for Software Service Failure Mitigation.",
                    "Generic and Robust Localization of Multi-dimensional Root Causes.",
                    "How to Explain a Patch: An Empirical Study of Patch Explanations in Open Source Projects.",
                    "Inferring Performance Bug Patterns from Developer Commits.",
                    "Engineering a Better Fuzzer with Synergically Integrated Optimizations.",
                    "Spotting Problematic Code Lines using Nonintrusive Programmers' Biofeedback.",
                    "An Empirical Study of Common Challenges in Developing Deep Learning Applications.",
                    "TripleAgent: Monitoring, Perturbation and Failure-Obliviousness for Automated Resilience Improvement in Java Applications.",
                    "Fuzzing Error Handling Code in Device Drivers Based on Software Fault Injection.",
                    "Enhancing Failure Propagation Analysis in Cloud Computing Systems.",
                    "A Tale of Two Injectors: End-to-End Comparison of IR-Level and Assembly-Level Fault Injection.",
                    "Supervised Representation Learning Approach for Cross-Project Aging-Related Bug Prediction.",
                    "Propheticus: Machine Learning Framework for the Development of Predictive Models for Reliable and Secure Software.",
                    "Identifying Crashing Fault Residence Based on Cross Project Model.",
                    "Learning Marked Markov Modulated Poisson Processes for Online Predictive Analysis of Attack Scenarios.",
                    "Test Case Generation Based on Client-Server of Web Applications by Memetic Algorithm.",
                    "Machine Learning and Constraint Solving for Automated Form Testing.",
                    "Understanding and Improving Regression Test Selection in Continuous Integration.",
                    "Textout: Detecting Text-Layout Bugs in Mobile Apps via Visualization-Oriented Learning.",
                    "Integrating Safety Certification Into Model-Based Testing of Safety-Critical Systems.",
                    "Mirage: Towards a Metasploit-Like Framework for IoT.",
                    "Estimating Return on Investment for GUI Test Automation Frameworks.",
                    "Amplifying Integration Tests with CAMP.",
                    "TCD: Statically Detecting Type Confusion Errors in C++ Programs.",
                    "OpenErrorPro: A New Tool for Stochastic Model-Based Reliability and Resilience Analysis.",
                    "Symbolic Execution for Importance Analysis and Adversarial Generation in Neural Networks.",
                    "How Do Developers Act on Static Analysis Alerts? An Empirical Study of Coverity Usage.",
                    "Analyzing the Context of Bug-Fixing Changes in the OpenStack Cloud Computing Platform.",
                    "On the Density and Diversity of Degradation Symptoms in Refactored Classes: A Multi-case Study.",
                    "FILO: FIx-LOcus Recommendation for Problems Caused by Android Framework Upgrade.",
                    "HiRec: API Recommendation using Hierarchical Context.",
                    "Criteria to Systematically Evaluate (Safety) Assurance Cases.",
                    "The Impact of Data Preparation on the Fairness of Software Systems.",
                    "Back to Basics - Redefining Quality Measurement for Hybrid Software Development Organizations.",
                    "Benefits and Challenges of Model-Based Software Engineering: Lessons Learned Based on Qualitative and Quantitative Findings.",
                    "TamperNN: Efficient Tampering Detection of Deployed Neural Nets.",
                    "Trustworthiness Assessment of Web Applications: Approach and Experimental Study using Input Validation Coding Practices.",
                    "Evaluation of Anomaly Detection Algorithms Made Easy with RELOAD.",
                    "MPro: Combining Static and Symbolic Analysis for Scalable Testing of Smart Contract."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2019w",
                "sub_name": "IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops 2019, Berlin, Germany, October 27-30, 2019.",
                "count": 77,
                "papers": [
                    "Applying Modified Code Entity-Based Regression Test Selection for Manual End-to-End Testing of Commercial Web Applications.",
                    "Concurrency Defect Localization in Embedded Systems using Static Code Analysis: An Evaluation.",
                    "Adapting SQuaRE for Quality Assessment of Artificial Intelligence Systems.",
                    "Towards Rust for Critical Systems.",
                    "Dependency Graph Based Failure Analysis for Private Clouds.",
                    "Engineering and Hardening of Functional Fail-Operational Architectures for Highly Automated Driving.",
                    "Go-Sanitizer: Bug-Oriented Assertion Generation for Golang.",
                    "Learning from Time Series with Outlier Correction for Malicious Domain Identification.",
                    "Detecting and Diagnosing Anomalous Behavior in Large Systems with Change Detection Algorithms.",
                    "Coordinated Analysis of Heterogeneous Monitor Data in Enterprise Clouds for Incident Response.",
                    "Triforce QNX Syscall Fuzzer.",
                    "DC-SRGM: Deep Cross-Project Software Reliability Growth Model.",
                    "Functionality and Safety Weaknesses in Integration of Physics-Based Models on Critical Embedded Systems.",
                    "Building Resource Adaptations via Test-Based Software Minimization: Application, Challenges, and Opportunities.",
                    "Advances in Artefact Quality Analysis for Safety-Critical Systems.",
                    "A Framework for Resilient Data Management for Smart Grids.",
                    "Recommendation of Refactorings for Improving Dependability Attributes.",
                    "From Monolithic Architecture to Microservices Architecture.",
                    "Multi-objective Optimization Research and Applied in Cloud Computing.",
                    "Search-Based Testing using EFSMs.",
                    "Simulation-Based Testing to Improve Safety of Autonomous Robots.",
                    "The Performance and Dependability of Control Plane in OpenFlow Networks.",
                    "Research Proposal: Reliability Evaluation of the Apache Kafka Streaming System.",
                    "ISSRE Cares: How the Software Reliability Engineering Community Can Give Back to Society.",
                    "On the Use of API Calls for Detecting Repackaged Malware Apps: Challenges and Ideas.",
                    "Quantification of the Impact of Random Hardware Faults on Safety-Critical AI Applications: CNN-Based Traffic Sign Recognition Case Study.",
                    "A Clone Code Detection Method Based on Software Complex Network.",
                    "Advancing Monitoring in Microservices Systems.",
                    "A State Space Suppression Method for Formal Verification of Secure Routing Protocols With SPIN.",
                    "A Proposal for Security Assessment of Trustzone-M Based Software.",
                    "Design for Testability of ERMTS Applications.",
                    "Toward In-Vivo Testing of Mobile Applications.",
                    "Governing Regression Testing in Systems of Systems.",
                    "Introducing Trust in Service-Oriented Distributed Systems through Blockchain.",
                    "Big-Data Applications as Self-Adaptive Systems of Systems.",
                    "Automatic Performance Monitoring and Regression Testing During the Transition from Monolith to Microservices.",
                    "Avoiding Faults due to Dangling Dependencies by Synchronization in Microservices Applications.",
                    "Resilient Reactive Systems Based on Runtime Semantic Models.",
                    "A Hybrid Framework for Web Services Reliability and Performance Assessment.",
                    "Anomaly Detection As-a-Service.",
                    "Towards Runtime Monitoring for Malicious Behaviors Detection in Smart Ecosystems.",
                    "Analysis of Software Aging Impacts on Plant Anomaly Detection with Edge Computing.",
                    "Stochastic Model for Availability Analysis of Service Function Chains using Rejuvenation and Live Migration.",
                    "Towards Testing the Software Aging Behavior of Hypervisor Hypercall Interfaces.",
                    "Rejuvenation and the Age of Information.",
                    "Software Longevity in the Wild: Folklore and Law.",
                    "A Configurable Software Aging Detection and Rejuvenation Agent for Android.",
                    "MemDefender: An Allocation Monitoring and Memory Leak Injection Tool for Java.",
                    "Auto-Encoding Robot State Against Sensor Spoofing Attacks.",
                    "Mobile App to SGX Enclave Secure Channel.",
                    "Lost in Disclosure: On the Inference of Password Composition Policies.",
                    "The Challenges of Labeling Vulnerability-Contributing Commits.",
                    "Empirical Notes on the Interaction Between Continuous Kernel Fuzzing and Development.",
                    "To Coerce or Not to Coerce? A Quantitative Investigation on Cybersecurity and Cybercrime Legislations Towards Large-Scale Vulnerability Notifications.",
                    "Synthetic Dataset Generation with Itemset-Based Generative Models.",
                    "Software Framework for Data Fault Injection to Test Machine Learning Systems.",
                    "Analyzing and Improving Customer-Side Cloud Security Certifiability.",
                    "Isolating Real-Time Safety-Critical Embedded Systems via SGX-Based Lightweight Virtualization.",
                    "EN-50128 Certification-Oriented Design of a Safety-Critical Hard Real-Time Kernel.",
                    "Continuous Deployment for Dependable Systems with Continuous Assurance Cases.",
                    "Integration of Tool Support for Assurance and Certification and for Knowledge-Centric Systems Engineering.",
                    "ExplicitCase: Tool-Support for Creating and Maintaining Assurance Arguments Integrated with System Models.",
                    "Modelling DO-178C Assurance Needs: A Design Assurance Level-Sensitive DSL.",
                    "On Computer-Aided Techniques for Supporting Safety and Security Co-Engineering.",
                    "Extending Automated FLTL Test Oracles with Diagnostic Support.",
                    "An Analysis of Factors Affecting Software Safety in the Aerospace Industry.",
                    "Automated Repair of Cross-Site Scripting Vulnerabilities through Unit Testing.",
                    "An Empirical Comparison of Two Different Strategies to Automated Fault Detection: Machine Learning Versus Dynamic Analysis.",
                    "Pinpoint Data Races via Testing and Classification.",
                    "TRAK: A Testing Tool for Studying the Reliability of Data Delivery in Apache Kafka.",
                    "Automatic Cause Detection of Performance Problems in Web Applications.",
                    "TRIADE A Three-Factor Trace Segmentation Method to Support Program Comprehension.",
                    "Multiple Fault-Tolerance Mechanisms in Cloud Systems: A Systematic Review.",
                    "Safe Compilation for Hidden Deterministic Hardware Aliasing.",
                    "Chaotic Compilation: A (Statistical) Cloak for a Secret Computer.",
                    "SHCoT: Secure (and Verified) Hybrid Chain of Trust to Protect from Malicious Software in LightWeight Devices.",
                    "Flexible Soft Error Mitigation Strategy for Memories in Mixed-Critical Systems."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th ISSRE 2018",
        "info": "Memphis, TN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2018",
                "sub_name": "29th IEEE International Symposium on Software Reliability Engineering, ISSRE 2018, Memphis, TN, USA, October 15-18, 2018.",
                "count": 23,
                "papers": [
                    "Fully Automated HTML and Javascript Rewriting for Constructing a Self-Healing Web Proxy.",
                    "Robust and Rapid Adaption for Concept Drift in Software System Anomaly Detection.",
                    "Run-Time Reliability Estimation of Microservice Architectures.",
                    "Online Model-Based Testing under Uncertainty.",
                    "Reliability Evaluation of Functionally Equivalent Simulink Implementations of a PID Controller under Silent Data Corruption.",
                    "A Natural Language Programming Approach for Requirements-Based Security Testing.",
                    "Safe-AR: Reducing Risk While Augmenting Reality.",
                    "Worst-Case Execution Time Testing via Evolutionary Symbolic Execution.",
                    "Search-Based Test Data Generation for JavaScript Functions that Interact with the DOM.",
                    "DeepMutation: Mutation Testing of Deep Learning Systems.",
                    "Evaluating Regression Test Selection Opportunities in a Very Large Open-Source Ecosystem.",
                    "Substate Profiling for Effective Test Suite Reduction.",
                    "A Study of Regression Test Selection in Continuous Integration Environments.",
                    "ReTEST: A Cost Effective Test Case Selection Technique for Modern Software Development.",
                    "FTMES: A Failed-Test-Oriented Mutant Execution Strategy for Mutation-Based Fault Localization.",
                    "Causal Distance-Metric-Based Assistance for Debugging after Compiler Fuzzing.",
                    "Bugaroo: Exposing Memory Model Bugs in Many-Core Systems.",
                    "RedDroid: Android Application Redundancy Customization Based on Static Analysis.",
                    "DroidEH: An Exception Handling Mechanism for Android Applications.",
                    "MoonlightBox: Mining Android API Histories for Uncovering Release-Time Inconsistencies.",
                    "Detection of Mirai by Syntactic and Behavioral Analysis.",
                    "You Are Where You App: An Assessment on Location Privacy of Social Applications.",
                    "Iris Template Protection Based on Randomized Response Technique and Aggregated Block Information."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2018w",
                "sub_name": "2018 IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Memphis, TN, USA, October 15-18, 2018.",
                "count": 65,
                "papers": [
                    "Use of Self-Healing Techniques to Improve the Reliability of a Dynamic and Geo-Distributed Ad Delivery Service.",
                    "Trap-Based Software Review: How Will Engineers Embed Bugs Due to Cognitive Error?",
                    "Using Supervised Learning to Guide the Selection of Software Inspectors in Industry.",
                    "UFO - Hidden Backdoor Discovery and Security Verification in IoT Device Firmware.",
                    "A Smart Context-Aware Program Assistant Based on Dynamic Programming Event Modeling.",
                    "KEREP: Experience in Extracting Knowledge on Distributed System Behavior through Request Execution Path.",
                    "AppWrapper: Patching Security Functions with Dynamic Policy on Your Insecure Android Apps.",
                    "A Comprehensive Framework for Security in Engineering Projects - Based on IEC 62443.",
                    "A Concept of QCD Prediction and Control in Agile Software Development for Portfolio Management.",
                    "Training Industry Practitioners to Investigate the Human Error Causes of Requirements Faults.",
                    "Friend or Foe: Strong Consistency vs. Overload in High-Availability Distributed Systems and SDN.",
                    "SFRAT - An Extendable Software Reliability Assessment Tool.",
                    "A Fault Injection Approach to Evaluate Soft-Error Dependability of System Calls.",
                    "Recent Advances in Software Reliability Assurance.",
                    "How Reliable Is My Software-Defined Network? Models and Failure Impacts.",
                    "Empirical Study on Tendencies for Unstable Situations in Application Results of Software Reliability Growth Model.",
                    "Challenges and Directions in Security Information and Event Management (SIEM).",
                    "Enhancing HPC System Log Analysis by Identifying Message Origin in Source Code.",
                    "Machine Deserves Better Logging: A Log Enhancement Approach for Automatic Fault Diagnosis.",
                    "Visualisation to Support Fault Localisation in Distributed Embedded Systems within the Automotive Industry.",
                    "Using Ontologies for Test Suites Generation for Automated and Autonomous Driving Functions.",
                    "An Approach to Identifying Error Patterns for Infrastructure as Code.",
                    "Model Checking the Uncertainties in Software Systems Introduced by Intelligent Components.",
                    "Evaluation and Construction of Covering Arrays Utilizing Prior Information.",
                    "Predicting Software Defects Based on Cognitive Error Theories.",
                    "Software Reliability Evaluation Method Based on a Software Network.",
                    "Probing the Security of DNA Origami.",
                    "Enhancing the Analysis of Error Propagation and Failure Modes in Cloud Systems.",
                    "An Adaptive PID Control for QoS Management in Cloud Computing System.",
                    "Model Fusion: Weighted N-Version Programming for Resilient Autonomous Vehicle Steering Control.",
                    "ORCAS: Efficient Resilience Benchmarking of Microservice Architectures.",
                    "Dynamic Random Testing Strategy for Test Case Optimization in Cloud Environment.",
                    "Enhancing Security and Reliability for Smart- Systems' Architectures.",
                    "Safety Analysis for Highly Automated Driving.",
                    "Testing Extract-Transform-Load Process in Data Warehouse Systems.",
                    "Prioritization of Metamorphic Relations Based on Test Case Execution Properties.",
                    "Software Reliability Assessment: Modeling and Algorithms.",
                    "Modelling, Design and Optimization of Dependable Softwarized Networks for Industrial Applications.",
                    "Taming Exceptions in Android Applications.",
                    "Machine Learning Augmented Fuzzing.",
                    "Reduce Before You Localize: Delta-Debugging and Spectrum-Based Fault Localization.",
                    "Spectrum-Based Fault Localization for Logic-Based Reasoning.",
                    "SeTCHi: Selecting Test Cases to Improve History-Guided Fault Localization.",
                    "CFAAR: Control Flow Alteration to Assist Repair.",
                    "DDS: Deadlock Detector and Solver.",
                    "ConfGuru - A System for Fully Automated Debugging of Configuration Errors.",
                    "An Approach for Predicting Bug Report Fields Using a Neural Network Learning Model.",
                    "Establishment of Methods for Information Security System Policy Using Benchmarking.",
                    "The DevSecOps and Agency Theory.",
                    "Graphite: A Greedy Graph-Based Technique for Regression Test Case Prioritization.",
                    "A Literature Review of Software Test Cases and Future Research.",
                    "Software Aging and Rejuvenation in the Cloud: A Literature Review.",
                    "A Systematic Mapping Review of Memory Leak Detection Techniques.",
                    "An Empirical Study on Software Aging Indicators Prediction in Android Mobile.",
                    "Extracting Interaction-Related Failure Indicators for Online Detection and Prediction of Content Failures.",
                    "The Role of Similarity in Detecting Feature Interaction in Software Product Lines.",
                    "A New Software Rejuvenation Model for Android.",
                    "Interacting SRN Models for Availability Evaluation of VM Migration as Rejuvenation on a System under Varying Workload.",
                    "Robotics Software Engineering and Certification: Issues and Challenges.",
                    "TensorFI: A Configurable Fault Injector for TensorFlow Applications.",
                    "Dependability Certification Guidelines for NFVIs through Fault Injection.",
                    "Toward a Systematic and Safety Evidence Productive Verification Approach for Safety-Critical Systems.",
                    "Towards Agile Yet Regulatory-Compliant Development of Medical Software.",
                    "Verifiable Self-Certifying Autonomous Systems.",
                    "Model-Based Computer-Aided Monitoring for ISO26262 Compliant Systems."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28th ISSRE 2017",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2017",
                "sub_name": "28th IEEE International Symposium on Software Reliability Engineering, ISSRE 2017, Toulouse, France, October 23-26, 2017.",
                "count": 34,
                "papers": [
                    "Chizpurfle: A Gray-Box Android Fuzzer for Vendor Service Customizations.",
                    "Reflection Analysis for Java: Uncovering More Reflective Targets Precisely.",
                    "GEMS: An Extract Method Refactoring Recommender.",
                    "A Generalized Bivariate Modeling Framework of Fault Detection and Correction Processes.",
                    "A Stochastic Modeling Approach for an Efficient Dependability Evaluation of Large Systems with Non-anonymous Interconnected Components.",
                    "Understanding the Impacts of Influencing Factors on Time to a DataRace Software Failure.",
                    "An Exploratory Study of Field Failures.",
                    "Learning from Imbalanced Data for Predicting the Number of Software Defects.",
                    "A Fault Correlation Approach to Detect Performance Anomalies in Virtual Network Function Chains.",
                    "Experience Report: Fault Triggers in Linux Operating System: from Evolution Perspective.",
                    "Simultaneous Fault Models for the Generation of Efficient Error Detection Mechanisms.",
                    "Which Packages Would be Affected by This Bug Report?",
                    "Experience Report: On the Impact of Software Faults in the Privileged Virtual Machine.",
                    "WAP: SAT-Based Computation of Minimal Cut Sets.",
                    "Experience Report: Security Vulnerability Profiles of Mission Critical Software: Empirical Analysis of Security Related Bug Reports.",
                    "WAP: Does Reviewer Age Affect Code Review Performance?",
                    "Practical Evaluation of Static Analysis Tools for Cryptography: Benchmarking Method and Case Study.",
                    "Interactive Runtime Verification - When Interactive Debugging Meets Runtime Verification.",
                    "Formal Development of Policing Functions for Intelligent Systems.",
                    "Experience Report: Study of Vulnerabilities of Enterprise Operating Systems.",
                    "Software Metrics as Indicators of Security Vulnerabilities.",
                    "Models of Reliability of Fault-Tolerant Software Under Cyber-Attacks.",
                    "Experience Report: How to Design Web-Based Competitions for Legal Proceedings: Lessons from a Court Case.",
                    "Perman: Fine-Grained Permission Management for Android Applications.",
                    "AQAT: The Architecture Quality Assurance Tool for Critical Embedded Systems.",
                    "Experience Report: Evaluating Fault Detection Effectiveness and Resource Efficiency of the Architecture Quality Assurance Framework and Tool.",
                    "Experience Report: Log-Based Behavioral Differencing.",
                    "Experience Report: Verifying MPI Java Programs Using Software Model Checking.",
                    "On FSM-Based Testing: An Empirical Study: Complete Round-Trip Versus Transition Trees.",
                    "COCOON: Crowdsourced Testing Quality Maximization Under Context Coverage Constraint.",
                    "Toward Rigorous Object-Code Coverage Criteria.",
                    "Automatically Repairing Web Application Firewalls Based on Successful SQL Injection Attacks.",
                    "Experience Report: Log Mining Using Natural Language Processing and Application to Anomaly Detection.",
                    "Learning Feature Representations from Change Dependency Graphs for Defect Prediction."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2017w",
                "sub_name": "2017 IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Toulouse, France, October 23-26, 2017.",
                "count": 69,
                "papers": [
                    "An Overview of Numalis Software Suite for Reliable Numerical Computation.",
                    "Industrial Evaluation of Search-Based Test Generation Techniques for Control Systems.",
                    "Reliable Inspection of an Autonomous System At System Runtime with Built-in Data Probes.",
                    "Gherkin Syntax Extension for Parameterization of Network Switch Configurations in Test Specification.",
                    "CrashOS: Hypervisor Testing Tool.",
                    "A Configurable Validation Environment for Refactored Embedded Software: An Application to the Vertical Transport Domain.",
                    "Assert Use and Defectiveness in Industrial Code.",
                    "A Static Analyzer for Industrial Robotic Applications.",
                    "GUI-Profiling for Performance and Coverage Analysis.",
                    "IV&V Case: Empirical Study of Software Independent Verification and Validation Based on Safety Case.",
                    "Appwrapping Providing Fine-Grained Security Policy Enforcement Per Method Unit in Android.",
                    "A Practical Approach Towards Validating HIL Simulation of a Safety-Critical System.",
                    "Getting Defect Prediction Into Industrial Practice: the ELFF Tool.",
                    "Rich Network Anomaly Detection Using Multivariate Data.",
                    "Diagnosing Development Turbulence in Agile Processes.",
                    "Experience Report: Testing Private Cloud Reliability Using a Public Cloud Validation SaaS.",
                    "BRACE: Cloud-Based Software Reliability Assurance.",
                    "SRC Ratio Method: Benchmarking Software Reliability.",
                    "A Comparative Study of Static Analysis Tools for AUTOSAR Automotive Software Components Development.",
                    "Principles for Systematic Development of an Assurance Case Template from ISO 26262.",
                    "Control Parameter Optimization for Autonomous Vehicle Software Using Virtual Prototyping.",
                    "Visualization of Specification Coverage: A Case Study of a Web Application Development in Industry.",
                    "Applying software reliability engineering process to software development in Korea defense industry.",
                    "Towards Embedded System Agile Development Challenging Verification, Validation and Accreditation: Application in a Healthcare Company.",
                    "SIRIUS: Systematic Investigation for Reliability Improvement Upon Software.",
                    "Testing Proportional-Integral-Derivative (PID) Controller with Metamorphic Testing.",
                    "Identifying Failed Test Cases Through Metamorphic Testing.",
                    "The Future of Automated Debugging - Focus on the Niches First.",
                    "Integrating Safety-Aware Route Optimisation and Run-Time Safety Monitoring in Controlling Swarms of Drones.",
                    "MASSE: Modular Automated Syntactic Signature Extraction.",
                    "Why Securing Your Code Architecture: Detection of Architectural Vulnerabilities in Industrial Products.",
                    "Benchmarking the Security of Virtualization Infrastructures: Motivation and Approach.",
                    "Model-Based Architecture Robustness Analysis for Software-Intensive Autonomous Systems.",
                    "Finite State Machine Testing Complete Round-Trip Versus Transition Trees: On the Road of Finding the Most Effective Criterion.",
                    "First Insights into Testing Autonomous Robot in Virtual Worlds.",
                    "Towards Multi-layered Reliability Analysis in Smart Grids.",
                    "Living Safety Arguments for Open Systems.",
                    "Interactive Runtime Verification - A Ph.D to Improve Bug Detection and Understanding.",
                    "Multi-level Isolation for Android Applications.",
                    "Adding Correctness Checking to Test Automation Platform.",
                    "Analytics-Enhanced Automated Code Verification for Dependability of Software-Defined Networks.",
                    "Using TLA+ in the Development of a Safety-Critical Fault-Tolerant Middleware.",
                    "Safety Verification of Modern Railway Signalling with the SafeCap Platform.",
                    "An IDE for the Design, Verification and Implementation of Security Protocols.",
                    "Experiences with Academic-Industrial Collaboration on Empirical Studies of Software Systems.",
                    "Empirical Study on Recognition of Project Situations by Monitoring Application Results of Software Reliability Growth Model.",
                    "Revisiting the Practical Use of Automated Software Fault Localization Techniques.",
                    "Back-in-Time Debugging in Heterogeneous Software Stacks.",
                    "Qualitative Deviation Models for Spreadsheet Debugging.",
                    "Removing Coincidental Correctness in Spectrum-Based Fault Localization for Circuit and Spreadsheet Debugging.",
                    "How is IF Statement Fixed Through Code Review? A Case Study of Qt Project.",
                    "Empirical Study of Abnormalities in Local Variables of Change-Prone Java Methods.",
                    "Workload Dependent Fault Analysis.",
                    "Accelerated Simulated Fault Injection Testing.",
                    "Estimation of the Total Number of Software Failures from Test Data and Code Coverage: A Bayesian Approach.",
                    "Toward an Embedded Multi-agent System Methodology and Positioning on Testing.",
                    "Trigger and Impact Profiles Enable Outcome Focused Defect Discovery to Manage Software Quality.",
                    "Detection of Memory Leaks in C/C++ Code via Machine Learning.",
                    "The Automatic Classification of Fault Trigger Based Bug Report.",
                    "Monitoring and Mitigating Software Aging on IBM Cloud Controller System.",
                    "A Rejuvenation Strategy in Android.",
                    "Efficient Software Rejuvenation of In-memory Key-Value Storages.",
                    "Challenges in Certification of Autonomous Driving Systems.",
                    "Observation Based Creation of Minimal Test Suites for Autonomous Vehicles.",
                    "Establishing Verification and Validation Objectives for Safety-Critical Bayesian Networks.",
                    "Non-determinism and Failure Modes in Machine Learning.",
                    "Towards Efficiently Checking Compliance Against Automotive Security and Safety Standards.",
                    "Pioneering the Creation of ISO 26262-Compliant OSLC-Based Safety Cases.",
                    "A Layered Argument Strategy for Software Security Case Development."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27th ISSRE 2016",
        "info": "Ottawa, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2016",
                "sub_name": "27th IEEE International Symposium on Software Reliability Engineering, ISSRE 2016, Ottawa, ON, Canada, October 23-27, 2016.",
                "count": 45,
                "papers": [
                    "On Adaptive Sampling-Based Testing for Software Reliability Assessment.",
                    "Experience Report: Automated System Level Regression Test Prioritization Using Multiple Factors.",
                    "Frequent Subgraph Based Familial Classification of Android Malware.",
                    "SCOUT: A Multi-objective Method to Select Components in Designing Unit Testing.",
                    "The Effect of Test Suite Type on Regression Test Selection.",
                    "WAP: A Novel Automatic Test Generation Technique Based on Moth Flame Optimization.",
                    "Using a Cognitive Psychology Perspective on Errors to Improve Requirements Quality: An Empirical Investigation.",
                    "On the Personality Traits of GitHub Contributors.",
                    "WAP: Understanding the Brain at Software Debugging.",
                    "Distance-Integrated Combinatorial Testing.",
                    "Evaluating the Effects of Compiler Optimizations on Mutation Testing at the Compiler IR Level.",
                    "Automatically Classifying Test Results by Semi-Supervised Learning.",
                    "Combining Word Embedding with Information Retrieval to Recommend Similar Bug Reports.",
                    "Experience Report: Understanding Cross-Platform App Issues from User Reviews.",
                    "CoLUA: Automatically Predicting Configuration Bug Reports and Extracting Configuration Options.",
                    "RRF: A Race Reproduction Framework for Use in Debugging Process-Level Races.",
                    "Cause Points Analysis for Effective Handling of Alarms.",
                    "ORPLocator: Identifying Read Points of Configuration Options via Static Analysis.",
                    "Anomaly Detection and Root Cause Localization in Virtual Network Functions.",
                    "Experience Report: System Log Analysis for Anomaly Detection.",
                    "SV-AF - A Security Vulnerability Analysis Framework.",
                    "Proving Concurrent Data Structures Linearizable.",
                    "Detecting, Exposing, and Classifying Sequential Consistency Violations.",
                    "Approximate Lock: Trading off Accuracy for Performance by Skipping Critical Sections.",
                    "Goal-Driven Deception Tactics Design.",
                    "Quantifying the Attack Detection Accuracy of Intrusion Detection Systems in Virtualized Environments.",
                    "Using Approximate Bayesian Computation to Empirically Test Email Malware Propagation Models Relevant to Common Intervention Actions.",
                    "MHCP Model for Quality Evaluation for Software Structure Based on Software Complex Network.",
                    "The Impact of Feature Selection on Defect Prediction Performance: An Empirical Comparison.",
                    "Experience Report: Practical Software Availability Prediction in Telecommunication Industry.",
                    "Dodging Unsafe Update Points in Java Dynamic Software Updating Systems.",
                    "Fixing Resource Leaks in Android Apps with Light-Weight Static Analysis and Low-Overhead Instrumentation.",
                    "Predicting Consistent Clone Change.",
                    "Failure Models for Testing Continuous Controllers.",
                    "Evaluation Metrics of Service-Level Reliability Monitoring Rules of a Big Data Service.",
                    "Bear: A Framework for Understanding Application Sensitivity to OS (Mis) Behavior.",
                    "Switching to Git: The Good, the Bad, and the Ugly.",
                    "Does Geographical Distance Effect Distributed Development Teams: How Aggregation Bias in Software Artifacts Causes Contradictory Findings.",
                    "Experience Report: An Empirical Study of API Failures in OpenStack Cloud Environments.",
                    "Domain Arguments in Safety Critical Software Development.",
                    "Experience Report: Model-Based Test Automation of a Concurrent Flight Software Bus.",
                    "Peeking into the Past: Efficient Checkpoint-Assisted Time-Traveling Debugging.",
                    "Risk Assessment of User-Defined Security Configurations for Android Devices.",
                    "Software Aging Analysis of the Android Mobile OS.",
                    "Experience Report: Detecting Poor-Responsive UI in Android Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2016w",
                "sub_name": "2016 IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops 2016, Ottawa, ON, Canada, October 23-27, 2016.",
                "count": 47,
                "papers": [
                    "Dependability Challenges in the Model-Driven Engineering of Automotive Systems.",
                    "A Platform for Automating Chaos Experiments.",
                    "Using Learning Styles to Staff and Improve Software Inspection Team Performance.",
                    "An Amanat-Based Multi-party Certification Protocol for Outsourced Software in Automotive Systems.",
                    "Time and Space Partitioning Using On-Board Software Reference Architecture.",
                    "A Framework to Support Generation and Maintenance of an Assurance Case.",
                    "A Model Based Systems Engineering Approach to Resiliency Analysis of a Cyberphysical System.",
                    "Bug Bash: An Efficient Approach to Increase Test Coverage and Ensure Product Quality in an Agile Environment.",
                    "Lessons Learned: Using a Static Analysis Tool within a Continuous Integration System.",
                    "Case Study: Project Management Using Cross Project Software Reliability Growth Model Considering System Scale.",
                    "Error Abstraction Accuracy and Fixation during Error-Based Requirements Inspections.",
                    "Analysis on Causal-Effect Relationship in Effort Metrics Using Bayesian LiNGAM.",
                    "Software Reliability Modeled on Contagion.",
                    "A Study of Redundant Metrics in Defect Prediction Datasets.",
                    "Verifying the Consistency of UML Models.",
                    "Software Reliability and Security: Challenges and Crosscutting Themes.",
                    "A Systematic Mapping Review of the First 20 Years of Software Aging and Rejuvenation Research.",
                    "Antipattern-Based Problem Injection for Assessing Performance and Reliability Evaluation Techniques.",
                    "Software Aging Detection Based on Differential Analysis: An Experimental Study.",
                    "Analysis of Software Aging in Android.",
                    "An Empirical Study of Software Aging Manifestations in Android.",
                    "NPI-Based Adaptive Software Rejuvenation Schedule under Random Censoring.",
                    "A Phase Expansion Approach for Transient Analysis of Software Rejuvenation Model.",
                    "An Experimental Implementation of Software Rejuvenation in Time Warp Simulation.",
                    "Workload-Dependent Software Aging Impact on Performance and Energy Consumption in Server Virtualized Systems.",
                    "The Relationship between Software Bug Type and Number of Factors Involved in Failures.",
                    "Programming the Network: Application Software Faults in Software-Defined Networks.",
                    "On Automatic Detection of Performance Bugs.",
                    "GPU Acceleration of Document Similarity Measures for Automated Bug Triaging.",
                    "Healing Data Loss Problems in Android Apps.",
                    "TestEX: A Search Tool for Finding and Retrieving Example Unit Tests from Open Source Projects.",
                    "Replaying Harmful Data Races in Android Apps.",
                    "Static Spreadsheet Analysis.",
                    "The Slice Navigator: Focused Debugging with Interactive Dynamic Slicing.",
                    "Bayesian Network Based Program Dependence Graph for Fault Localization.",
                    "A Study of Failures in Community Clusters: The Case of Conte.",
                    "An Automated (F) LTL Test Oracle for Testing with Requirements.",
                    "An Adaptive Sequence Approach for OOS Test Case Prioritization.",
                    "Advances in the Characterization of Cognitive Support for Unit Testing: The Bug-Hunting Game and the Visualization Arsenal.",
                    "Integrated Formal Methods for Constructing Assurance Cases.",
                    "On the Exploration of Model-Based Support for DO-178C-Compliant Avionics Software Development and Certification.",
                    "Model-Based Software Engineering and Certification: Some Open Issues.",
                    "Certification of Medical Information Systems: Towards a Foundational Framework and Methodology.",
                    "Safety Assurance for Emergent Collaboration of Open Distributed Systems.",
                    "Considering Testing-Coverage and Fault Removal Efficiency Subject to the Random Field Environments with Imperfect Debugging in Software Reliability Assessment.",
                    "Insights for Practicing Engineers from a Formal Verification Study of the Linux Kernel.",
                    "A Formal Model for Stateful and Variant-Rich Automotive Functions."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26th ISSRE 2015",
        "info": "Gaithersbury, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2015",
                "sub_name": "26th IEEE International Symposium on Software Reliability Engineering, ISSRE 2015, Gaithersbury, MD, USA, November 2-5, 2015.",
                "count": 55,
                "papers": [
                    "Anomaly detection in computer systems using compressed measurements.",
                    "AtomChase: Directed search towards atomicity violations.",
                    "Experience report: Anomaly detection of cloud application operations using log and cloud metric correlation analysis.",
                    "PAID: Prioritizing app issues for developers by tracking user reviews over versions.",
                    "Mutation-based test-case prioritization in software evolution.",
                    "A similarity-based approach for test case prioritization using historical failure data.",
                    "Exciting FPGA cryptographic Trojans using combinatorial testing.",
                    "Model generation to support model-based testing applied on the NASA DAT Web-application - An experience report.",
                    "Discovering model transformation pre-conditions using automatically generated test models.",
                    "WAP: Unreasonable distributions of execution time under reasonable conditions.",
                    "WAP: What activates a bug? A refinement of the Laprie terminology model.",
                    "Using normalized compression distance to measure the evolutionary stability of software systems.",
                    "Towards comprehensive software reliability evaluation in open source software.",
                    "Conservative claims about the probability of perfection of software-based systems.",
                    "Experience report: An application-specific checkpointing technique for minimizing checkpoint corruption.",
                    "Experience report: Memory accesses for avionic applications and operating systems on a multi-core platform.",
                    "A safe generic adaptation mechanism for smart cars.",
                    "Automated resource release in device drivers.",
                    "Contrasting exception handling code across languages: An experience report involving 50 open source projects.",
                    "Experience report: How do techniques, programs, and tests impact automated program repair?",
                    "Studying the influence of standard compiler optimizations on symbolic execution.",
                    "How hard does mutation analysis have to be, anyway?",
                    "Efficient observability-based test generation by dynamic symbolic execution.",
                    "Boundary value analysis in automatic white-box test generation.",
                    "Experience report: How do structural dependencies influence change propagation? An empirical study.",
                    "Experience report: Evaluating the effectiveness of decision trees for detecting code smells.",
                    "Efficient elimination of false positives using static analysis.",
                    "Event-based formalization of safety-critical operating system standards: An experience report on ARINC 653 using Event-B.",
                    "Experience report: Formal verification and testing in the development of embedded software.",
                    "Specifying and verifying real-time self-adaptive systems.",
                    "Experience report: A field analysis of user-defined security configurations of Android devices.",
                    "WAP: Digital dependability identities.",
                    "WAP: Models and metrics for the assessment of critical-infrastructure-targeted malware campaigns.",
                    "Enhancing privacy protection in fault replication systems.",
                    "SpyAware: Investigating the privacy leakage signatures in app execution traces.",
                    "Experience report: Can software testing education lead to more reliable code?",
                    "Experience report: An industrial experience report on test outsourcing practices.",
                    "Software reliability growth model based on Bohrbugs and Mandelbugs.",
                    "WAP: Cognitive aspects in unit testing: The hunting game and the hunter's perspective.",
                    "UPMOA: An improved search algorithm to support user-preference multi-objective optimization.",
                    "Experience report: Mining test results for reasons other than functional correctness.",
                    "Classifying faulty modules with an extension of the H-index.",
                    "Should fixing these failures be delegated to automated program repair?",
                    "Piecing together app behavior from multiple artifacts: A case study.",
                    "Detecting inconsistencies in multi-platform mobile apps.",
                    "SIG-Droid: Automated system input generation for Android applications.",
                    "MoIO: Run-time monitoring for I/O protocol violations in storage device drivers.",
                    "Detecting latent cross-platform API violations.",
                    "Discovering specification violations in networked software systems.",
                    "Experience report: How do bug characteristics differ across severity classes: A multi-platform study.",
                    "Experience report: A characteristic study on out of memory errors in distributed data-parallel applications.",
                    "Fast reproducing web application errors.",
                    "An evidential reasoning approach for assessing confidence in safety evidence.",
                    "Security slicing for auditing XML, XPath, and SQL injection vulnerabilities.",
                    "Pushing the limits on automation in GUI regression testing."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2015w",
                "sub_name": "2015 IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Gaithersburg, MD, USA, November 2-5, 2015.",
                "count": 40,
                "papers": [
                    "Countdown graph: Estimating completion of testing.",
                    "Detection of unexpected situations by applying software reliability growth models to test phases.",
                    "Resource/schedule/content model: Improving testing effectiveness.",
                    "Static analysis of physical properties in Simulink models.",
                    "Test suites for benchmarks of static analysis tools.",
                    "Formal methods for informal developpers: A case-study driven by the French defense agency (DGA).",
                    "Optimizing resiliency of distributed video surveillance system for safer city.",
                    "Upgrade of the IaaS cloud: Issues and potential solutions in the context of high-availability.",
                    "Software-defined networking (SDN) control message classification, verification, and optimization system.",
                    "Automated generation of failure modes and effects analysis for a medical device.",
                    "Integrating formal methods with testing for reliability estimation of component based systems.",
                    "C-SEC (Cyber SCADA evaluation capability): Securing critical infrastructures.",
                    "Operational softwarized networks reliability management.",
                    "Knowledge transition: Discovering workflow models from functional tests.",
                    "Effective management of work in a geographically dispersed team using Tasks in Agile methodology.",
                    "An analysis and extension of Category partition testing for constrained systems.",
                    "Analyzing failure mechanism for complex software-intensive systems.",
                    "On validating UML consistency rules.",
                    "A scalable and accurate hybrid vulnerability analysis framework.",
                    "Analyzing the reduction of test suite redundancy.",
                    "Conditional slicing: Reducing dynamic slices.",
                    "S-CBAC: A secure access control model supporting group access for Internet of Things.",
                    "UML consistency rules in technical books.",
                    "Getting more in less: The power of single/error annotations in category partition.",
                    "Practical null pointer dereference detection via value-dependence analysis.",
                    "RC-Tree: A variant avoiding all the redundancy in Reiter's minimal hitting set algorithm.",
                    "Disqover: Debugging via code sequence covers.",
                    "Applying spectrum-based fault localization to generate debugging suggestions for student programmers.",
                    "Parse tree structure in LTL requirements diagnosis.",
                    "The software aging and rejuvenation repository: Http: //openscience.us/repo/software-aging/.",
                    "Survivability modeling to assess deployment alternatives accounting for rejuvenation.",
                    "Detecting sustainable programming languages through forking on open source projects for survivability.",
                    "Software aging in mobile devices: Partial computation offloading as a solution.",
                    "An optimal stopping problem for software rejuvenation in a job processing system.",
                    "Efficient reachability graph development for qualitive analysis of state/event fault trees.",
                    "Automated compositional safety analysis using component fault trees.",
                    "Qualitative evaluation of fault hypotheses with non-intrusive fault injection.",
                    "Process improvement in governmental agencies: Toward CMMI certification.",
                    "SysML-based and Prolog-supported FMEA.",
                    "Preventing recurrence of industrial control system accident using assurance case."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25th ISSRE 2014",
        "info": "Naples, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2014",
                "sub_name": "25th IEEE International Symposium on Software Reliability Engineering, ISSRE 2014, Naples, Italy, November 3-6, 2014.",
                "count": 31,
                "papers": [
                    "Security Benchmarks for Web Serving Systems.",
                    "Zen-CC: An Automated and Incremental Conformance Checking Solution to Support Interactive Product Configuration.",
                    "Predicting Vulnerable Components: Software Metrics vs Text Mining.",
                    "Uncovering Errors in ATL Model Transformations Using Static Analysis and Constraint Solving.",
                    "On the Long-Term Predictive Capability of Data-Driven Software Reliability Model: An Empirical Evaluation.",
                    "Deadlock and Temporal Properties Analysis in Mixed Reality Applications.",
                    "Program Logic Based Software Plagiarism Detection.",
                    "A Systematic Approach for Software Interference Analysis.",
                    "WPBOUND: Enforcing Spatial Memory Safety Efficiently at Runtime with Weakest Preconditions.",
                    "Experience Report: An Analysis of Hypercall Handler Vulnerabilities.",
                    "Why Does my Spreadsheet Compute Wrong Values?",
                    "Effective Bug Triage Based on Historical Bug-Fix Information.",
                    "More Debugging in Parallel.",
                    "Norming to Performing: Failure Analysis and Deployment Automation of Big Data Software Developed by Highly Iterative Models.",
                    "Experience Report: Orthogonal Classification of Safety Critical Issues.",
                    "Failure Analysis of Jobs in Compute Clouds: A Google Cluster Case Study.",
                    "Analysis and Diagnosis of SLA Violations in a Production SaaS Cloud.",
                    "Mutations: How Close are they to Real Faults?",
                    "A Survey on Unit Testing Practices and Problems.",
                    "Assessing Direct Monitoring Techniques to Analyze Failures of Critical Industrial Systems.",
                    "Experience Report: Verifying Data Interaction Coverage to Improve Testing of Data-Intensive Systems: The Norwegian Customs and Excise Case Study.",
                    "Runtime Verification of Web Services for Interconnected Medical Devices.",
                    "Access Control Policy Evolution: An Empirical Study.",
                    "Experience Report: A Safety Engineering Tool Supporting Error Model Creation and Visualization.",
                    "Reproducibility of Environment-Dependent Software Failures: An Experience Report.",
                    "An Empirical Study on the Scalability of Selective Mutation Testing.",
                    "Multi-objective Construction of an Entire Adequate Test Suite for an EFSM.",
                    "Using Pre-Release Test Failures to Build Early Post-Release Defect Prediction Models.",
                    "Defect Prediction between Software Versions with Active Learning and Dimensionality Reduction.",
                    "An Orchestrated Survey of Available Algorithms and Tools for Combinatorial Testing.",
                    "Predicting Effectiveness of IR-Based Bug Localization Techniques."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2014w",
                "sub_name": "25th IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Naples, Italy, November 3-6, 2014.",
                "count": 113,
                "papers": [
                    "Soft-LLFI: A Comprehensive Framework for Software Fault Injection.",
                    "Fault Injection Experiments with the CLAMR Hydrodynamics Mini-App.",
                    "Event Logging in an Industrial Development Process: Practices and Reengineering Challenges.",
                    "Event Based Robot Prognostics Using Principal Component Analysis.",
                    "Proving Model Equivalence in Model Based Design.",
                    "Developing Software Reliability Models in the Architecture Phase of the Software Lifecycle.",
                    "Architecture for a Hard-Real-Time System Enabling Non-intrusive Tests.",
                    "Handling Soft Error in Embedded Software for Networking System.",
                    "Safety Critical Robot Programming and Testing for Operations in Industrial Co-Production.",
                    "NAPOLI FUTURA: Novel Approaches for Protecting Critical Infrastructures from Cyber Attacks.",
                    "Network Function Virtualization: Challenges and Directions for Reliability Assurance.",
                    "Towards an Evaluation Framework for Availability Solutions in the Cloud.",
                    "Verifying Response Times in Networked Automation Systems Using Jitter Bounds.",
                    "Performability Comparison of Lustre and HDFS for MR Applications.",
                    "Reliability Models for the Internet of Things: A Paradigm Shift.",
                    "Predicting Release Quality.",
                    "Automated Generation of Failure Modes and Effects Analysis from SysML Models.",
                    "MBT for Global Platform Compliance Testing: Experience Report and Lessons Learned.",
                    "Assessing the Threat Landscape for Software Libraries.",
                    "Security Evaluation of a Linux System: Common Criteria EAL4+ Certification Experience.",
                    "Balanced Measurement Sets: Criteria for Improving Project Management Practices.",
                    "CAMDIT: A Toolkit for Integrating Heterogeneous Data for Enhanced Service Provisioning.",
                    "Applying Metrics to Identify and Monitor Technical Debt Items during Software Evolution.",
                    "Quantitative Evaluation of Static Analysis Tools.",
                    "Code Analysis as an Enabler for SW Quality Improvement: The SELEX ES SW Engineering Experience.",
                    "Supporting Reviewing of Warnings in Presence of Shared Variables: Need and Effectiveness.",
                    "A Formal Method Applied to the Automated Software Engineering with Quality Guarantees.",
                    "Planning of Prioritized Test Procedures in Large Integrated Systems: Best Strategy of Defect Discovery and Early Stop of Testing Session, The Selex-ES Experience.",
                    "Understanding DO-178C Software Certification: Benefits Versus Costs.",
                    "Challenges in Future Avionic Systems on Multi-Core Platforms.",
                    "Model-Checking Real-Time Properties of an Auto Flight Control System Function.",
                    "Practical Behavioral Inconsistency Detection between Source Code and Specification Using Model Checking.",
                    "Early Conflict Detection with Mined Models.",
                    "Analysis of Functional Software Dependencies through Supervised Execution.",
                    "Applying Parameter Value Weighting to a Practical Application.",
                    "Regression Testing Approach for Large-Scale Systems.",
                    "Automatic Testing Framework for Virtualization Environment.",
                    "Mapping the Software Errors and Effects Analysis Method to ISO26262 Requirements for Software Architecture Analysis.",
                    "Is Cut Sequence Necessary in Dynamic Fault Trees?",
                    "Exploiting Behavior Models for Availability Analysis of Interactive Systems.",
                    "Evaluating Embedded-Software Specifications - Quantitative and Structured Assessment of Declarative Interface Descriptions.",
                    "Are the Classical Disaster Recovery Tiers Still Applicable Today?",
                    "Describing Software Specification by Combining SysML with the B Method.",
                    "A Runtime Verification Based Trace-Oriented Monitoring Framework for Cloud Systems.",
                    "Towards Fault Propagation Analysis in Cloud Computing Ecosystems.",
                    "Towards Making Safety-Critical Systems Safer: Learning from Mistakes.",
                    "A Research Agenda for Benchmarking the Resilience of Software Defined Networks.",
                    "Do Injected Faults Cause Real Failures? A Case Study of Linux.",
                    "The Definition and Assessment of a Safety Argument.",
                    "Building Blocks for Assurance Cases.",
                    "Linking Traceability with GSN.",
                    "Retrieving Information from a Document Repository for Constructing Assurance Cases.",
                    "A Model-Driven Safety Certification Method for Process Compliance.",
                    "A Technique for Demonstrating Safety and Correctness of Program Translators: Strategy and Case Study.",
                    "SCT: A Safety Case Toolkit.",
                    "A Security Argument Pattern for Medical Device Assurance Cases.",
                    "Arguing Software Compliance with ISO 26262.",
                    "Pinpointing Failure Inducing Event Orderings.",
                    "Trace Reduction and Pattern Analysis to Assist Debugging in Model-Based Testing.",
                    "Program Debugging: Research and Practice.",
                    "Defect Analysis and Reliability Assessment for Transactional Web Applications.",
                    "A Memory Model Based on Three-Valued Matrix for Static Defect Detection.",
                    "Debugging with Dynamic Temporal Assertions.",
                    "Spectrum-Based Fault Localization for Spreadsheets: Influence of Correct Output Cells on the Fault Localization Quality.",
                    "Studying the Advancement in Debugging Practice of Professional Software Developers.",
                    "Evaluation of Risk for Complex Systems Using Attack Surface.",
                    "Structuring Compliance Risk Identification Using the CORAS Approach: Compliance as an Asset.",
                    "Towards Safety Risk Assessment of Socio-Technical Systems via Failure Logic Analysis.",
                    "Risk Management for Outsourcing to the Cloud: Security Risks and Safeguards as Selection Criteria for Extern Cloud Services.",
                    "CRSTIP - An Assessment Scheme for Security Assessment Processes.",
                    "Expressing Best Practices in (Risk) Analysis and Testing of Safety-Critical Systems Using Patterns.",
                    "Schematic Generation of English-Prose Semantics for a Risk Analysis Language Based on UML Interactions.",
                    "How Does the UML Testing Profile Support Risk-Based Testing.",
                    "Predicting Buffer Overflow Vulnerabilities through Mining Light-Weight Static Code Attributes.",
                    "Mining Security Vulnerabilities from Linux Distribution Metadata.",
                    "Detection of Compromised Email Accounts Used by a Spam Botnet with Country Counting and Theoretical Geographical Travelling Speed Extracted from Metadata.",
                    "An Experiment with Conceptual Clustering for the Analysis of Security Alerts.",
                    "Failure Prediction of Jobs in Compute Clouds: A Google Cluster Case Study.",
                    "Supporting Decision-Making for Biometric System Deployment through Visual Analysis.",
                    "Record and Replay GUI-Based Applications with Less Overhead.",
                    "Combining Black Box Testing with White Box Code Analysis: A Heterogeneous Approach for Testing Enterprise SaaS Applications.",
                    "Avoiding Hardware Aliasing: Verifying RISC Machine and Assembly Code for Encrypted Computing.",
                    "Integrating the Security Aspect into Design Space Exploration of Embedded Systems.",
                    "On the Equivalence of SOA Rollback-Recovery Consistency Models.",
                    "Using Invariants for Anomaly Detection: The Case Study of a SaaS Application.",
                    "Bypassing Censorship: A Proven Tool against the Recent Internet Censorship in Turkey.",
                    "Finding Domain-Generation Algorithms by Looking at Length Distribution.",
                    "Multi-agent System for APT Detection.",
                    "Power Grid Outlier Treatment through Kalman Filter.",
                    "Software Rejuvenation in Cloud Systems.",
                    "Rejuvenation and the Spread of Epidemics in General Topologies.",
                    "Detection and Analysis of Performance Deterioration in Mobile Offloading System.",
                    "Software Maintenance Optimization Based on Stackelberg Game Methods.",
                    "The Dual Nature of Software Aging: Twenty Years of Software Aging Research.",
                    "Towards Patching Memory Leak Bugs in Off-The-Shelf Software.",
                    "A Novel Hybridization of Artificial Neural Networks and ARIMA Models for Forecasting Resource Consumption in an IIS Web Server.",
                    "A Practice of Forecasting Software Aging in an IIS Web Server Using SVM.",
                    "Reducing Web Test Cases Aging by Means of Robust XPath Locators.",
                    "An Evaluation of Assuring Test Case Sufficiency Using a D-Case Pattern.",
                    "A Supplemental Notation of GSN Aiming for Dealing with Changes of Assurance Cases.",
                    "Run-Time Adaptive Error and State Management for Open Automotive Systems.",
                    "Toward SIL Evaluation for a Resilience Strategy.",
                    "Prediction of the Complexity of Code Changes Based on Number of Open bugs, New Feature and Feature Improvement.",
                    "Assessment Techniques, Certification and [What Else We Need for] Confidence in Software.",
                    "Argument Evaluation in the Context of Assurance Case Confidence Modeling.",
                    "Towards Certification of Automotive Software.",
                    "Automotive SPICE Assessments in Safety-Critical Contexts: An Experience Report.",
                    "Process Model Tailoring and Assessment for Automotive Certification Objectives.",
                    "Cost Optimisation in Certification of Software Product Lines.",
                    "Reducing Certification Costs through Assured Dynamic Software Configuration.",
                    "Adding Security Concerns to Safety Critical Certification.",
                    "Safety ADD: A Tool for Safety-Contract Based Design.",
                    "Improving Usability of Fault Injection."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th ISSRE 2013",
        "info": "Pasadena, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2013",
                "sub_name": "IEEE 24th International Symposium on Software Reliability Engineering, ISSRE 2013, Pasadena, CA, USA, November 4-7, 2013.",
                "count": 47,
                "papers": [
                    "Keynote speaker 1: The economics of systems and software reliability.",
                    "Using machine learning techniques to detect metamorphic relations for programs without test oracles.",
                    "An empirical comparison of the fault-detection capabilities of internal oracles.",
                    "Model-driven synthesis of monitoring infrastructure for reliable adaptive multi-agent systems.",
                    "Analysis of local re-execution in mobile offloading system.",
                    "Design of distribution automation networks using survivability modeling and power flow equations.",
                    "Composing hierarchical stochastic model from SysML for system availability analysis.",
                    "Towards fast OS rejuvenation: An experimental evaluation of fast OS reboot techniques.",
                    "Request success rate of multipathing I/O with a paired storage controller.",
                    "Nonparametric bootstrapping interval estimations for software release planning with reliability objective.",
                    "Quantifying the influence of failure repair/mitigation costs on service-based systems.",
                    "SRATS: Software reliability assessment tool on spreadsheet (Experience report).",
                    "Quantifying software test process and product reliability simultaneously.",
                    "Predicting defects using change genealogies.",
                    "Predicting risk of pre-release code changes with Checkinmentor.",
                    "Filtering noise in mixed-purpose fixing commits to improve defect prediction and localization.",
                    "Fault localization in embedded software based on a single cyclic trace.",
                    "Stress testing of task deadlines: A constraint programming approach.",
                    "Fault localization based on failure-inducing combinations.",
                    "Fault triggers in open-source software: An experience report.",
                    "Got issues? Who cares about it? A large scale investigation of issue trackers from GitHub.",
                    "Characterizing configuration problems in Java EE application servers: An empirical study with GlassFish and JBoss.",
                    "A fusion approach for classifying duplicate problem reports.",
                    "Experience report: Assessing the reliability of an industrial avionics software: Results, insights and recommendations.",
                    "Evaluating long-term predictive power of standard reliability growth models on automotive systems.",
                    "A structured and model-based hazard analysis and risk assessment method for automotive systems.",
                    "Combining testing and proof to gain high assurance in software: A case study.",
                    "Sinfer: Inferring information flow lattices for checking self-stabilization.",
                    "Relevant inputs analysis and its applications.",
                    "Feedback-directed exploration of web applications to derive test models.",
                    "A pattern-based approach for GUI modeling and testing.",
                    "Model-based testing of NASA's OSAL API - An experience report.",
                    "An experience report for software quality evaluation in highly iterative development methodology using traditional metrics.",
                    "Automatic skeleton generation for data-aware service choreographies.",
                    "An empirical study of the effect of learning styles on the faults found during the software requirements inspection.",
                    "Constructing subtle higher order mutants for Java and AspectJ programs.",
                    "Finding test data with specific properties via metaheuristic search.",
                    "Improving search-based test suite generation with dynamic symbolic execution.",
                    "Search-based data-flow test generation.",
                    "Is bytecode instrumentation as good as source code instrumentation: An empirical study with industrial tools (Experience Report).",
                    "Help, help, i'm being suppressed! The significance of suppressors in software testing.",
                    "Permlyzer: Analyzing permission usage in Android applications.",
                    "Systematic testing for resource leaks in Android applications.",
                    "Keep it moving: Proactive workload management for reducing SLA violations in large scale SaaS clouds.",
                    "A host-based anomaly detection approach by representing system calls as states of kernel modules.",
                    "A study of the relationship between antivirus regressions and label changes.",
                    "Static analysis versus penetration testing: A controlled experiment."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2013w",
                "sub_name": "IEEE 24th International Symposium on Software Reliability Engineering, ISSRE 2013, Pasadena, CA, USA, November 4-7, 2013 - Supplemental Proceedings.",
                "count": 78,
                "papers": [
                    "Finding related events for specification mining.",
                    "Persistence of relevance: A missing issue in imperfect coverage models.",
                    "Automated classification of NASA anomalies using natural language processing techniques.",
                    "A study on the effectiveness of peer review meeting.",
                    "Comparative analysis of Bayesian and classical approaches for software reliability measurement.",
                    "Characteristic analysis of quantitative definition of resiliency measure.",
                    "An initial evaluation of model-based testing.",
                    "Certification of embedded systems: Quantitative analysis and irrefutable evidences.",
                    "A new model to capture security threat patterns by complying with standards and lesson learned - Archiving dependability for security assurance cases.",
                    "Monitoring system calls for anomaly detection in modern operating systems.",
                    "Non-operational testing of software for security issues.",
                    "Using software reliability models for security assessment - Verification of assumptions.",
                    "Dependability of open systems.",
                    "Conditional software specification & assurance: A practical assessment of contract-based approaches.",
                    "ARRL: A criterion for compositional safety and systems engineering: A normative approach to specifying components.",
                    "Using ODC to diagnose an Agile enterprise application development project.",
                    "International standardization of Open Systems Dependability.",
                    "Radio Diagnostic tool: IDoctor.",
                    "Improving reliability of data protection software with integrated multilayered fault Injection testing.",
                    "A novel mechanism to continuously scan field logs and gain real-time feedback.",
                    "Using capture-recapture models to make objective post-inspection decisions.",
                    "To branch or not to branch that is the question.",
                    "Design of a dependable peer-to-peer system for numerical optimization.",
                    "Smart defect classification for better analysis using tagging mechanisms.",
                    "Directed graph as a model for unit testing.",
                    "Automating software validation of a GPON network.",
                    "Predicting multi-platform release quality.",
                    "Detection of missing requirements using base requirements pairs.",
                    "Computational modeling to detect software sabotage: A discussion of technical challenges and a demonstration of innovative technology.",
                    "Reliability feedback through system log analysis.",
                    "Fault-class-aware fault tree generation and analysis.",
                    "Modeling of Failure detection and recovery in SysML.",
                    "A statistical approach for software resource leak detection and prediction.",
                    "Space systems modeling using the Architecture Analysis & Design Language (AADL).",
                    "Diagnosing development software release to predict field failures.",
                    "Failure data analytics to build failure prediction mechanisms.",
                    "Predicting field experience of releases on specific platforms.",
                    "Forensic study of the Curiosity Flight Software anomalies.",
                    "Using error information to improve software quality.",
                    "Mining A change history to quickly identify bug locations : A case study of the Eclipse project.",
                    "Coincidental correctness: An interference or interface to successful fault localization?",
                    "Cues for scent intensification in debugging.",
                    "Bug localisation through diverse sources of information.",
                    "Mutation-based spreadsheet debugging.",
                    "An empirical study on clustering for isolating bugs in fault localization.",
                    "Program behavior characterization and clustering: An empirical study for failure clustering.",
                    "Scalable isolation of failure-inducing changes via version comparison.",
                    "Improving the accuracy of static analysis based on state partition.",
                    "Automated diagnosis of software misconfigurations based on static analysis.",
                    "Integration of software reliability engineering, risk management and safety assurance case.",
                    "Medical device software risk assessment requires cross functional personnel.",
                    "An extended notation of FTA for risk assessment of software-intensive medical devices.: Recognition of the risk class before and after the risk control measure.",
                    "Safety assessment of software-intensive medical devices: Introducing a safety quality model approach.",
                    "Testing distortion estimations in Retinal Prostheses.",
                    "Use software reliability growth models wisely.",
                    "Performance degradation analysis of a supercomputer.",
                    "On the effectiveness of Mann-Kendall test for detection of software aging.",
                    "Software rejuvenation impacts on a phased-mission system for Mars exploration.",
                    "Estimating response time distribution of server application in software aging phenomenon.",
                    "Comparing four case studies on Bohr-Mandel characteristics using ODC.",
                    "Identifying silent failures of SaaS services using finite state machine based invariant analysis.",
                    "A new method of consensus building for open systems dependability.",
                    "A chain of accountabilities in open systems based on assured entrustments.",
                    "A method for assuring service grade with Assurance case: An experiment on a portal service.",
                    "A comparative study of d∗framework and GSN.",
                    "Exploring possibilities to analyse microblogs for dependability information in variability-intensive open source software systems.",
                    "D-Script : Dependable scripting with DEOS process.",
                    "Qualitative comparison of aerospace standards: An objective approach.",
                    "Accelerated reliability testing approach for high-reliablity software based on the reinforced operational profile.",
                    "An improved SFMEA method integrated with assistive techniques.",
                    "Requirements engineering in rail transit production: An experience report.",
                    "Qualitative analysis of state/event fault trees for supporting the certification process of software-intensive systems.",
                    "Strong and weak contract formalism for third-party component reuse.",
                    "Safety contract based design of software components.",
                    "A monitoring and testing framework for critical off-the-shelf applications and services.",
                    "Evidence arguments for using formal methods in software certification.",
                    "Reference architecture for high dependability on-board computers.",
                    "Taking a page from the law books: Considering evidence weight in evaluating assurance case confidence."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "23rd ISSRE 2012",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2012",
                "sub_name": "23rd IEEE International Symposium on Software Reliability Engineering, ISSRE 2012, Dallas, TX, USA, November 27-30, 2012.",
                "count": 38,
                "papers": [
                    "An Exploratory Study of Higher Order Mutation Testing in Aspect-Oriented Programming.",
                    "Using Non-redundant Mutation Operators and Test Suite Prioritization to Achieve Efficient and Scalable Mutation Analysis.",
                    "Mutation Testing of Event Processing Queries.",
                    "Detection of Software Failures through Event Logs: An Experimental Study.",
                    "An Empirical Study of the Effectiveness of \"Forcing\" Diversity Based on a Large Population of Diverse Programs.",
                    "Hybrid Statistical Model Checking Technique for Reliable Safety Critical Systems.",
                    "On the Verification and Validation of Signature-Based, Network Intrusion Detection Systems.",
                    "Using Population Characteristics to Build Forecasting Models for Computer Security Incidents.",
                    "Using Multiclass Machine Learning Methods to Classify Malicious Behaviors Aimed at Web Systems.",
                    "Dynamic Analysis of Upgrades in C/C++ Software.",
                    "Speculative Symbolic Execution.",
                    "Automated Checking of Web Application Invocations.",
                    "Improving Coverage-Based Localization of Multiple Faults Using Algorithms from Integer Linear Programming.",
                    "Software Life-Extension: A New Countermeasure to Software Aging.",
                    "What Is System Hang and How to Handle It.",
                    "Data Loss Prevention Based on Data-Driven Usage Control.",
                    "Lightweight Automated Testing with Adaptation-Based Programming.",
                    "Overlap and Synergy in Testing Software Components across Loosely Coupled Communities.",
                    "On the Relative Strengths of Model-Based and Dynamic Event Extraction-Based GUI Testing Techniques: An Empirical Study.",
                    "Are Computer Focused Crimes Impacted by System Configurations? An Empirical Study.",
                    "Evaluating and Improving Penetration Testing in Web Services.",
                    "On the Aging Effects Due to Concurrency Bugs: A Case Study on MySQL.",
                    "Shared Execution for Efficiently Testing Product Lines.",
                    "Recycling Test Cases to Detect Security Vulnerabilities.",
                    "Revolution: Automatic Evolution of Mined Specifications.",
                    "AutoInSpec: Using Missing Test Coverage to Improve Specifications in GUIs.",
                    "A Light-Weight Defect Classification Scheme for Embedded Automotive Software and Its Initial Evaluation.",
                    "An Empirical Study of Bugs in Machine Learning Systems.",
                    "A Comprehensive Code-Based Quality Model for Embedded Systems: Systematic Development and Validation by Industrial Projects.",
                    "Static Analysis of Model Transformations for Effective Test Generation.",
                    "Lightweight Static Analysis for GUI Testing.",
                    "Oracle-Centric Test Case Prioritization.",
                    "State-Based Testing: Industrial Evaluation of the Cost-Effectiveness of Round-Trip Path and Sneak-Path Strategies.",
                    "The Nature of the Times to Flight Software Failure during Space Missions.",
                    "On the Use of Boundary Scan for Code Coverage of Critical Embedded Software.",
                    "Compositional Verification of Sensor Software Using Uppall.",
                    "An Assertions-Based Approach to Verifying the Absence Property Pattern.",
                    "A MARTE Extension for Global Scheduling Analysis of Multiprocessor Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2012w",
                "sub_name": "23rd IEEE International Symposium on Software Reliability Engineering Workshops, ISSRE Workshops, Dallas, TX, USA, November 27-30, 2012.",
                "count": 75,
                "papers": [
                    "A Resilience Design Model for IMS-based Services.",
                    "Combinatorial Analysis of Dynamic Fault Trees with Priority-AND Gates.",
                    "Bohrbugs, Mandelbugs, Exhaustive Testing and Unintended Automobile Acceleration.",
                    "Entropy Metrics for Agile Development Processes.",
                    "TEAMS: A Special-Purpose AOP Framework for Runtime Monitoring.",
                    "Assessing AUTOSAR Systems Using Fault Injection.",
                    "Toward Baselining Software Anomalies in NASA Missions.",
                    "Safety and Performance Co-engineering: New MDE Challenge for Critical Applications Design?",
                    "Ontology-Based Reuse of Failure Modes for FMEA: Methodology and Tool.",
                    "Assessing Disaster Recovery Alternatives: On-Site, Colocation or Cloud.",
                    "Evidence-Based Security in Aerospace: From Safety to Security and Back Again.",
                    "Formal Analysis of Device-Delay Error in User-Device Interaction under Uncertainty.",
                    "Software at Scale for Building Resilient Wireless Sensor Networks.",
                    "Applying Software Reliability Growth Models to DOD Systems.",
                    "Software Reliability Classes: A Basis for Release and Product Quality Expectations.",
                    "Cost Effective Reliability Centric Validation Model for Automotive ECUs.",
                    "Early Performance Estimation for Industrial Component-Based Design of Reliable Software Defined Radio System.",
                    "Bug Detection in Large-Scale Nuclear Power Software.",
                    "Quality Playbook: Ensuring Release to Release Improvement.",
                    "Metric-Based Quality Evaluations for Iterative Software Development Approaches Like Agile.",
                    "Targeting Specific Customer Satisfactions Issues with ODC Analysis.",
                    "A Software Quality Evaluation Method Using the Change of Source Code Metrics.",
                    "Smart Unit Testing Framework.",
                    "Customer Scenario Focused End-to-End Testing.",
                    "Applying Test Data Generation Using SMT Solver to COBOL.",
                    "Overview of 10 Years of ISVV Findings in Safety-Critical Systems.",
                    "Independent Assessment of Safety-Critical Systems: We Bring Data!",
                    "Modeling and Prediction of Performability of Safety Critical Computer Based Systems Using Petri Nets.",
                    "Assessing the Performance of Networked Computer Based Systems.",
                    "Measurements-Based Analysis of Workload-Error Relationship in a Production SaaS Cloud.",
                    "Assessing Product Quality through PMR Analysis: A Perspective.",
                    "A Practical Extension of Pairwise Testing.",
                    "Managing Automated End to End Testing in Bitwise Heterogenous Environments.",
                    "Comparison of Static Analysis Tools for Finding Concurrency Bugs.",
                    "Detecting Vulnerabilities in Service Oriented Architectures.",
                    "Accelerate the Software Software Reliability Testing Execution Process with Fuzzy Discrimination.",
                    "Using Profiling Metrics to Categorise Peer Review Types in the Android Project.",
                    "Program Debugging with Effective Software Fault Localization (Invited Talk).",
                    "The Effect of Testability on Fault Proneness: A Case Study of the Apache HTTP Server.",
                    "Debugging Spreadsheets: A CSP-based Approach.",
                    "Detection of Interferences in Aspect-Oriented Programs Using Executable Assertions.",
                    "A Topology-Based Model for Estimating the Diagnostic Efficiency of Statistics-Based Approaches.",
                    "Predicting Data Dependences for Slice Inspection Prioritization.",
                    "A Static Detecting Model for Invalid Arithmetic Operation Based on Alias Analysis.",
                    "Wielding Statistical Fault Localization Statistically.",
                    "Baggy Bounds with Accurate Checking.",
                    "Design-Model-Based Test Data Generation for Database Applications.",
                    "Automatic GUI Model Generation: State of the Art.",
                    "Automated Risk-Based Testing by Integrating Safety Analysis Information into System Behavior Models.",
                    "Integrating Model-Based and Constraint-Based Testing Using SpecExplorer.",
                    "Integrating MDT in an Industrial Process in the Air Traffic Control Domain.",
                    "A Review of Two Experiences from Applying Model Based Testing in Practice.",
                    "A Pragmatic Approach on Combined Safety and Security Risk Analysis.",
                    "Monitoring Memory-Related Software Aging: An Exploratory Study.",
                    "An Advanced Methodology for Measuring and Characterizing Software Aging.",
                    "Cost Optimality in Testing and Rejuvenation.",
                    "Monitoring of Aging Software Systems Affected by Integer Overflows.",
                    "Multiformalism to Support Software Rejuvenation Modeling.",
                    "Modeling Software Rejuvenation on a Redundant System Using Monte Carlo Simulation.",
                    "Optimization of Opportunity-Based Software Rejuvenation Policy.",
                    "Aging-Related Bugs in Cloud Computing Software.",
                    "Characterization of Software Aging Effects in Elastic Storage Mechanisms for Private Clouds.",
                    "Software Rejuvenation: Do IT & Telco Industries Use It?",
                    "A Proposal on a Method for Reviewing Operation Manuals of Supercomputer.",
                    "Application of D-Case to the Data-Upload Flow Diagram Scenario of the Distributed E-Learning System Called KISSEL.",
                    "A Study of Converting Risk to Assurance Case.",
                    "Reconfigurable Scripting Language with Programming Risk.",
                    "Requirements and Evaluation of Safety Analysis Techniques for Ambient Assisted Living Systems.",
                    "Handling Language Variations in Open Source Bug Reporting Systems.",
                    "Combination of Static and Dynamic Analyses for the Certification of Avionics Software.",
                    "A Method to Formally Evaluate Safety Case Evidences against a System Architecture Model.",
                    "Composable Safety-Critical Systems Based on Pre-certified Software Components.",
                    "Industrial Experiences of Building a Safety Case in Compliance with ISO 26262.",
                    "Agile Practices in Regulated Railway Software Development.",
                    "10 Years of ISVV: What's Next?"
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22nd ISSRE 2011",
        "info": "Hiroshima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2011",
                "sub_name": "IEEE 22nd International Symposium on Software Reliability Engineering, ISSRE 2011, Hiroshima, Japan, November 29 - December 2, 2011.",
                "count": 27,
                "papers": [
                    "Using Behavioral Profiles to Detect Software Flaws in Network Servers.",
                    "Diversity for Security: A Study with Off-the-Shelf AntiVirus Engines.",
                    "Server Side Detection of Content Sniffing Attacks.",
                    "A Model-Driven Engineering Approach to Support the Verification of Compliance to Safety Standards.",
                    "The Early Identification of Detector Locations in Dependable Software.",
                    "Experiences with Assurance Cases for Spacecraft Safing.",
                    "Mining Cause-Effect-Chains from Version Histories.",
                    "Statistical Evaluation of Complex Input-Output Transformations.",
                    "Uncertainty Propagation through Software Dependability Models.",
                    "Feature Interaction Faults Revisited: An Exploratory Study.",
                    "JavaScript Errors in the Wild: An Empirical Study.",
                    "Efficiently Running Test Suites Using Abstract Undo Operations.",
                    "PACOGEN: Automatic Generation of Pairwise Test Configurations from Feature Models.",
                    "Adaptive Regression Testing Strategy: An Empirical Study.",
                    "Impact Analysis of Configuration Changes for Test Case Selection.",
                    "A Hybrid Directed Test Suite Augmentation Technique.",
                    "LOFT: Redundant Synchronization Event Removal for Data Race Detection.",
                    "An Empirical Study of JUnit Test-Suite Reduction.",
                    "Rigorous Development of Dependable Systems Using Fault Tolerance Views.",
                    "PAT 3: An Extensible Architecture for Building Multi-domain Model Checkers.",
                    "Safety Analysis of Trampoline OS Using Model Checking: An Experience Report.",
                    "WSPred: A Time-Aware Personalized QoS Prediction Framework for Web Services.",
                    "Software Reliability Growth Models Based on Local Polynomial Modeling with Kernel Smoothing.",
                    "Efficient Analysis of Fault Trees with Voting Gates.",
                    "Workload Characterization for Software Aging Analysis.",
                    "Optimal Resource Allocation in a Virtualized Software Aging Platform with Software Rejuvenation.",
                    "Injecting Memory Leaks to Accelerate Software Failures."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21st ISSRE 2010",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2010",
                "sub_name": "IEEE 21st International Symposium on Software Reliability Engineering, ISSRE 2010, San Jose, CA, USA, 1-4 November 2010.",
                "count": 42,
                "papers": [
                    "Improving the Precision of Dependence-Based Defect Mining by Supervised Learning of Rule and Violation Graphs.",
                    "Computing the Number of Calls Dropped Due to Failures.",
                    "Propagating Bug Fixes with Fast Subgraph Matching.",
                    "A Multi-factor Software Reliability Model Based on Logistic Regression.",
                    "Assessing Asymmetric Fault-Tolerant Software.",
                    "Flexible, Any-Time Fault Tree Analysis with Component Logic Models.",
                    "Errors on Space Software Requirements: A Field Study and Application Scenarios.",
                    "Software Aging Analysis of the Linux Operating System.",
                    "Evaluating the Use of Requirement Error Abstraction and Classification Method for Preventing Errors during Artifact Creation: A Feasibility Study.",
                    "As-If Infinitely Ranged Integer Model.",
                    "Towards a Bayesian Approach in Modeling the Disclosure of Unique Security Faults in Open Source Projects.",
                    "Security Trend Analysis with CVE Topic Models.",
                    "Automatic Mutation Test Case Generation via Dynamic Symbolic Execution.",
                    "Constraint-Based Test Input Generation for Java Bytecode.",
                    "An Industrial Investigation of Similarity Measures for Model-Based Test Case Selection.",
                    "A 2-Phase Method for Validation of Matching Pair Property with Case Studies of Operating Systems.",
                    "Detecting Dependences and Interactions in Feature-Oriented Design.",
                    "A Consistency Check Algorithm for Component-Based Refinements of Fault Trees.",
                    "Automating System Tests Using Declarative Virtual Machines.",
                    "DoDOM: Leveraging DOM Invariants for Web 2.0 Application Robustness Testing.",
                    "Pinpointing the Subsystems Responsible for the Performance Deviations in a Load Test.",
                    "Using Accelerated Life Tests to Estimate Time to Software Aging Failure.",
                    "The Importance of Data Quality in Software Reliability Modeling.",
                    "An Efficient Method for Architecture-Based Reliability Evaluation for Evolving Systems with Changing Parameters.",
                    "Log-Based Reliability Analysis of Software as a Service (SaaS).",
                    "Characterizing Failures in Mobile OSes: A Case Study with Android and Symbian.",
                    "Empirical Evaluation of Factors Affecting Distinction between Failing and Passing Executions.",
                    "A Case Study on Safety Cases in the Automotive Domain: Modules, Patterns, and Models.",
                    "A Large-Scale Industrial Case Study on Architecture-Based Software Reliability Analysis.",
                    "Comparing SQL Injection Detection Tools Using Attack Injection: An Experimental Study.",
                    "The Web Attacker Perspective - A Field Study.",
                    "Change Bursts as Defect Predictors.",
                    "Calibrating Probabilistic GUI Testing Models Based on Experiments and Survival Analysis.",
                    "The Impact of Coupling on the Fault-Proneness of Aspect-Oriented Programs: An Empirical Study.",
                    "Preventing Overflow Attacks by Memory Randomization.",
                    "Automata-Based Verification of Security Requirements of Composite Web Services.",
                    "Client-Side Detection of Cross-Site Request Forgery Attacks.",
                    "Is Data Privacy Always Good for Software Testing?",
                    "Prioritizing Mutation Operators Based on Importance Sampling.",
                    "On the Round Trip Path Testing Strategy.",
                    "FTCloud: A Component Ranking Framework for Fault-Tolerant Cloud Applications.",
                    "Optimizing Incremental Scope-Bounded Checking with Data-Flow Analysis."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20th ISSRE 2009",
        "info": "Mysuru, Karnataka, India",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2009",
                "sub_name": "ISSRE 2009, 20th International Symposium on Software Reliability Engineering, Mysuru, Karnataka, India, 16-19 November 2009.",
                "count": 21,
                "papers": [
                    "A Complexity Reliability Model.",
                    "Wavelet-Based Approach for Estimating Software Reliability.",
                    "Estimating the Probability of Failure When Software Runs Are Dependent: An Empirical Study.",
                    "Applying the Composition Filter Model for Runtime Verification of Multiple-Language Software.",
                    "Efficiently Extracting Operational Profiles from Execution Logs Using Suffix Arrays.",
                    "Optimal Adaptive System Health Monitoring and Diagnosis for Resource Constrained Cyber-Physical Systems.",
                    "Reducing Field Failures in System Configurable Software: Cost-Based Prioritization.",
                    "Harnessing Web-Based Application Similarities to Aid in Regression Testing.",
                    "On the Effectiveness of Unit Test Automation at Microsoft.",
                    "Approximating Deployment Metrics to Predict Field Defects and Plan Corrective Maintenance Activities.",
                    "Variance Analysis in Software Fault Prediction Models.",
                    "Putting It All Together: Using Socio-technical Networks to Predict Failures.",
                    "Optimal Security Patch Release Timing under Non-homogeneous Vulnerability-Discovery Processes.",
                    "Looking at Web Security Vulnerabilities from the Programming Language Perspective: A Field Study.",
                    "Towards a Unifying Approach in Understanding Security Problems.",
                    "Fault Tree Analysis of Software-Controlled Component Systems Based on Second-Order Probabilities.",
                    "Issues on the Design of Efficient Fail-Safe Fault Tolerance.",
                    "Insights on Fault Interference for Programs with Multiple Bugs.",
                    "Towards Behavioral Reflexion Models.",
                    "Automated Identification of LTL Patterns in Natural Language Requirements.",
                    "Event-Based Input Validation Using Design-by-Contract Patterns."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19th ISSRE 2008",
        "info": "Seattle/Redmond, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2008",
                "sub_name": "19th International Symposium on Software Reliability Engineering (ISSRE 2008), 11-14 November 2008, Seattle/Redmond, WA, USA.",
                "count": 58,
                "papers": [
                    "How Economics Shape Reliability: Lessons and Opportunities from Windows Development.",
                    "Software Reliability - 40 Years of Avoiding the Question.",
                    "Using Measures and Risk Indicators for Early Insight into Software Product Characteristics such as Software Safety.",
                    "Anything You Want to Ask about Software Reliability Engineering.",
                    "A Model-Driven Approach to Assuring Process Reliability.",
                    "Predicting Defect Content and Quality Assurance Effectiveness by Combining Expert Judgment and Defect Data - A Case Study.",
                    "Using an RBF Neural Network to Locate Program Bugs.",
                    "Concurrent Contracts for Java in JML.",
                    "Changing Java's Semantics for Handling Null Pointer Exceptions.",
                    "Resolving JavaScript Vulnerabilities in the Browser Runtime.",
                    "Trace Normalization.",
                    "Analysis of Computer Security Incident Data Using Time Series Models.",
                    "Detection and Prediction of Resource-Exhaustion Vulnerabilities.",
                    "A QoS-Aware Middleware for Fault Tolerant Web Services.",
                    "Operating System Robustness Forecast and Selection.",
                    "Automated Identification of Failure Causes in System Logs.",
                    "Profiling the Operational Behavior of OS Device Drivers.",
                    "RUGRAT: Runtime Test Case Generation Using Dynamic Compilers.",
                    "All-Paths TestGenerationfor Programs with Internal Aliases.",
                    "Finding Faults: Manual Testing vs. Random+ Testing vs. User Reports.",
                    "A Framework for Testing Peer-to-Peer Systems.",
                    "Testing of User-Configurable Software Systems Using Firewalls.",
                    "Automated Support for Propagating Bug Fixes.",
                    "Cost Curve Evaluation of Fault Prediction Models.",
                    "A Joinpoint Coverage Measurement Tool for Evaluating the Effectiveness of Test Inputs for AspectJ Programs.",
                    "Exploring Quality Metrics to Support Defect Management Process in a Multi-site Organization - A Case Study.",
                    "Comparison of Empirical Data from Two Honeynets and a Distributed Honeypot Network.",
                    "The Feasibility of Automated Feedback-Directed Specification-Based Test Generation: A Case Study of a High-Assurance Operating System.",
                    "Automated Generation of Pointcut Mutants for Testing Pointcuts in AspectJ Programs.",
                    "Testing Software Product Lines Using Incremental Test Generation.",
                    "Using Statistical Models to Predict Software Regressions.",
                    "Reliability Assessment of Mass-Market Software: Insights from Windows Vista®.",
                    "Using Fault Modeling in Safety Cases.",
                    "E-RACE, A Hardware-Assisted Approach to Lockset-Based Data Race Detection for Embedded Products.",
                    "An Effective Software Reliability Analysis Framework for Weapon System Development in Defense Domain.",
                    "A Modified Genetic Algorithm for Parameter Estimation of Software Reliability Growth Models.",
                    "Reliability Assessment of Translated VMF/Link-16 Messages.",
                    "An Algebra-Based Reliability Prediction Approach for Composite Web Services.",
                    "Architecting for Reliability - Recovery Mechanisms.",
                    "Replication vs. Failure Prevention - How to Boost Service Availability?",
                    "Assessing the Effect of Software Failures on Trust Assumptions.",
                    "GB Coverage Criteria: The Measurement for Testing a \"Go Back\" Function Based on a Pushdown Automaton.",
                    "Discovering the Fault Origin from Field Traces.",
                    "Seasonality in Vulnerability Discovery in Major Software Systems.",
                    "Vulnerability Discovery Modeling Using Weibull Distribution.",
                    "An Analysis Framework for Inter-system Interaction Behavior.",
                    "Static Detection of Redundant Test Cases: An Initial Study.",
                    "The Effect of the Number of Defects on Estimates Produced by Capture-Recapture Models.",
                    "Modeling the Software Failure Correlations When Test Automation Is Adopted during the Software Development.",
                    "Using UML Sequence Diagrams and State Machines for Test Input Generation.",
                    "Automated Fix Generator for SQL Injection Attacks.",
                    "Efficient Operational Profiling of Systems Using Suffix Arrays on Execution Logs.",
                    "Ranking Attack-Prone Components with a Predictive Model.",
                    "Comparative Study of Fault-Proneness Filtering with PMD.",
                    "Software Reliability Modeling with Logistic Test Coverage Function.",
                    "A Hardware-Assisted Tool for Fast, Full Code Coverage Analysis.",
                    "Reusing Existing Test Cases for Security Testing.",
                    "On Reliability Analysis of Open Source Software - FEDORA."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/2008w",
                "sub_name": "IEEE International Conference on Software Reliability Engineering Workshops, ISSRE Workshops 2008, Seattle, WA, USA, November 11-14, 2008.",
                "count": 11,
                "papers": [
                    "The fundamentals of software aging.",
                    "An experiment in memory leak analysis with a mission-critical middleware for air traffic control.",
                    "A feedback control approach for software rejuvenation in a web server.",
                    "Toward optimal virtual machine placement and rejuvenation scheduling in a virtualized data center.",
                    "Availability optimization in operational software system with aperiodic time-based software rejuvenation scheme.",
                    "Compositional fluid stochastic Petri net model for operational software system performance.",
                    "Methods and opportunities for rejuvenation in aging distributed software systems.",
                    "Availability and reliability estimation for a system undergoing minimal, perfect and failed rejuvenation.",
                    "A queuing model for service availability of systems with rejuvenation.",
                    "Non-parametric predictive inference of adaptive software rejuvenation schedule.",
                    "Analysis and application of conditional software rejuvenation - A new approach."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18th ISSRE 2007",
        "info": "Trollhättan, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2007",
                "sub_name": "ISSRE 2007, The 18th IEEE International Symposium on Software Reliability, Trollhättan, Sweden, 5-9 November 2007.",
                "count": 26,
                "papers": [
                    "Sensitivity of Website Reliability to Usage Profile Changes.",
                    "Measuring Software Reliability in Practice: An Industry Case Study.",
                    "Software Reliability Modeling with Test Coverage: Experimentation and Measurement with A Fault-Tolerant Software Project.",
                    "Coordinated Atomic Actions for Dependable Distributed Systems: the Current State in Concepts, Semantics and Verification Means.",
                    "Towards Self-Protecting Enterprise Applications.",
                    "Reliability Modeling of a 1-Out-Of-2 System: Research with Diverse Off-The-Shelf SQL Database Servers.",
                    "Corroborating User Assessments of Software Behavior to Facilitate Operational Testing.",
                    "Requirement Error Abstraction and Classification: A Control Group Replicated Study.",
                    "Prioritization of Regression Tests using Singular Value Decomposition with Empirical Change Records.",
                    "Testing Security Policies: Going Beyond Functional Testing.",
                    "Integrated Software Vulnerability and Security Functionality Assessment.",
                    "A Comparison between Internal and External Malicious Traffic.",
                    "Automated Oracle Comparators for TestingWeb Applications.",
                    "On the Impact of Injection Triggers for OS Robustness Evaluation.",
                    "Using Machine Learning to Support Debugging with Tarantula.",
                    "Statistical Inference of Computer Virus Propagation Using Non-Homogeneous Poisson Processes.",
                    "Applying Software Reliability Models on Security Incidents.",
                    "Generating Trace-Sets for Model-based Testing.",
                    "Improving Constraint-Based Testing with Dynamic Linear Relaxations.",
                    "Intra-Class Testing of Abstract Class Features.",
                    "Correlations between Internal Software Metrics and Software Dependability in a Large Population of Small C/C++ Programs.",
                    "Using In-Process Testing Metrics to Estimate Post-Release Field Quality.",
                    "Data Mining Techniques for Building Fault-proneness Models in Telecom Java Software.",
                    "Predicting Subsystem Failures using Dependency Graph Complexities.",
                    "Fault Prediction using Early Lifecycle Data.",
                    "Non-parametric Predictive Inference of Preventive Rejuvenation Schedule in Operational Software Systems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17th ISSRE 2006",
        "info": "Raleigh, North Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2006",
                "sub_name": "17th International Symposium on Software Reliability Engineering (ISSRE 2006), 7-10 November 2006, Raleigh, North Carolina, USA.",
                "count": 41,
                "papers": [
                    "Disaster Hardening for Software Systems.",
                    "A Perspective on Software Consumability.",
                    "Software Security: Building Security In.",
                    "Scaling a Dataflow Testing Methodology to the MultiparadigmWorld of Commercial Spreadsheets.",
                    "Memoized Forward Computation of Dynamic Slices.",
                    "Call Stack Coverage for GUI Test-Suite Reduction.",
                    "Stabilization Time - A Quality Metric for Software Products.",
                    "Metrics-Based Software Reliability Models Using Non-homogeneous Poisson Processes.",
                    "Using Historical In-Process and Product Metrics for Early Estimation of Software Failures.",
                    "BPEL4WS Unit Testing: Test Case Generation Using a Concurrent Path Analysis Approach.",
                    "Metamodel-based Test Generation for Model Transformations: an Algorithm and a Tool.",
                    "A Systematic Approach to Generate Inputs to Test UML Design Models.",
                    "Using CLP to Automatically Generate Test Sequences for Synchronous Programs with Numeric Inputs and Outputs.",
                    "Evaluating the Reliability of Credential Hardening through Keystroke Dynamics.",
                    "A Novel SOAP Attachment-Oriented Security Model.",
                    "An Attack Simulator for Systematically Testing Program-based Security Mechanisms.",
                    "Monitoring the Security Health of Software Systems.",
                    "Studying the Characteristics of a \"Good\" GUI Test Suite.",
                    "A Candidate Fault Model for AspectJ Pointcuts.",
                    "Detecting Redundant Unit Tests for AspectJ Programs.",
                    "\"Tail-Splitting\" to Predict Failing Software Modules - with a Case Study on an Operating Systems Product.",
                    "Adequacy, Accuracy, Scalability, and Uncertainty of Architecture-based Software Reliability: Lessons Learned from Large Empirical Case Studies.",
                    "Assessing the Relationship between Software Assertions and Faults: An Empirical Investigation.",
                    "Tool-Supported Verification of Contingency Software Design in Evolving, Autonomous Systems.",
                    "Testing During Refactoring: Adding Aspects to Legacy Systems.",
                    "Model Simulation for Test Execution Capacity Estimation.",
                    "Modeling the Performance of Border Inspections with Electronic Travel Documents.",
                    "On the Effect of Fault Removal in Software Testing - Bayesian Reliability Estimation Approach.",
                    "A State Exploration-Based Approach to Testing Java Monitors.",
                    "Web Application Testing with Customized Test Requirements - An Experimental Comparison Study.",
                    "Combining Replication with Transaction Processing for Enhanced Reliability in J2EE.",
                    "Building Phase-Type Software Reliability Models.",
                    "Reliability and Performance of Component Based Software Systems with Restarts, Retries, Reboots and Repairs.",
                    "Mining Interface Specifications for Generating Checkable Robustness Properties.",
                    "Effectively Combining Software Verification Strategies: Understanding Different Assumptions.",
                    "Probe Distribution Techniques to Profile Events in Deployed Software.",
                    "Measuring and Enhancing Prediction Capabilities of Vulnerability Discovery Models for Apache and IIS HTTP Servers.",
                    "Queuing Models for Field Defect Resolution Process.",
                    "Softgoal Traceability Patterns.",
                    "DevCOP: A Software Certificate Management System for Eclipse.",
                    "CAA-DRIP: a framework for implementing Coordinated Atomic Actions."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16th ISSRE 2005",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2005",
                "sub_name": "16th International Symposium on Software Reliability Engineering (ISSRE 2005), 8-11 November 2005, Chicago, IL, USA.",
                "count": 42,
                "papers": [
                    "Welcome from the General Co-Chairs.",
                    "Welcome from the Program Committee Co-Chairs.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "How Should Software Reliability Engineering Be Taught?",
                    "Teaching SRE to Software Practitioners.",
                    "Teaching an Active-Participation University Course in Software Reliability and Testing.",
                    "Software Development SRE Needs.",
                    "Teaching SRE in a Diverse Graduate Student Context.",
                    "Designing an SRE Program for Commercial Software Organizations.",
                    "Benchmarking the Dependability of Windows and Linux Using PostMark Workloads.",
                    "Safety Analysis of Software Product Lines Using State-Based Modeling.",
                    "Helping End-Users \"Engineer\" Dependable Web Applications.",
                    "Large Empirical Case Study of Architecture-Based Software Reliability.",
                    "Error Propagation in the Reliability Analysis of Component Based Systems.",
                    "Study of the Impact of Hardware Fault on Software Reliability.",
                    "Prioritize Code for Testing to Improve Code Coverage of Complex Software.",
                    "Providing Test Quality Feedback Using Static Source Code and Automatic Test Suite Metrics.",
                    "Improving Statechart Testing Criteria Using Data Flow Information.",
                    "Assessing the Crash-Failure Assumption of Group Communication Protocols.",
                    "PORT: A Price-Oriented Reliable Transport Protocol for Wireless Sensor Networks.",
                    "Modeling the Vulnerability Discovery Process.",
                    "Automated Checking for Windows Host Vulnerabilities.",
                    "Markovian Modeling and Analysis of Internet Worm Propagation.",
                    "An Experimental Evaluation on Reliability Features of N-Version Programming.",
                    "Modeling Software Reliability Growth with Genetic Programming.",
                    "High Available Mobile Infrastructure Applications.",
                    "Forecasting Field Defect Rates Using a Combined Time-Based and Metrics-Based Approach: A Case Study of OpenBSD.",
                    "Software Defect Rediscoveries: A Discrete Lognormal Model.",
                    "A Novel Method for Early Software Quality Prediction Based on Support Vector Machine.",
                    "An Initial Study of a Lightweight Process for Change Identification and Regression Test Selection When Source Code Is Not Available.",
                    "Improved Test Generation Algorithms for Pair-Wise Testing.",
                    "Data Dependence Based Testability Transformation in Automated Test Generation.",
                    "Testing Web Services by XML Perturbation.",
                    "Minimization of Randomized Unit Test Cases.",
                    "Automatically Identifying Special and Common Unit Tests for Object-Oriented Programs.",
                    "Classifying Requirements: Towards a More Rigorous Analysis of Natural-Language Specifications.",
                    "Lustructu: A Tool for the Automatic Coverage Assessment of Lustre Programs.",
                    "Visualizing Similarity between Program Executions.",
                    "Synchronous Testing of Multimodal Systems: An Operational Profile-Based Approach.",
                    "Covering Transitions of Concurrent Systems through Queues.",
                    "A New Algorithm for Reachability Testing of Concurrent Programs."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15th ISSRE 2004",
        "info": "Saint-Malo, Bretagne, France",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2004",
                "sub_name": "15th International Symposium on Software Reliability Engineering (ISSRE 2004), 2-5 November 2004, Saint-Malo, Bretagne, France.",
                "count": 39,
                "papers": [
                    "Unit Testing in Practice.",
                    "Deriving Test Sets from Partial Proofs.",
                    "A Generic Method for Statistical Testing.",
                    "Statistical Software Testing with Parallel Modeling: A Case Study.",
                    "Reliability Growth in Software Products.",
                    "Reliability Estimation for Statistical Usage Testing using Markov Chains.",
                    "Validation of a Methodology for Assessing Software Reliability.",
                    "Performability Modeling of Mobile Software Systems.",
                    "Are Found Defects an Indicator of Software Correctness? An Investigation in a Controlled Case Study.",
                    "An Exploration of Software Faults and Failure Behaviour in a Large Population of Programs.",
                    "Empirical Studies of Test Case Prioritization in a JUnit Testing Environment.",
                    "An Empirical Study on Reliability Modeling for Diverse Software Systems.",
                    "Boundary Coverage Criteria for Test Generation from Formal Models.",
                    "Model-Based Test Driven Development of the Tefkat Model-Transformation Engine.",
                    "Test-Adequacy and Statistical Testing: Combining Different Properties of a Test-Set.",
                    "Plannable Test Selection Criteria for FSMs Extracted From Operational Specifications.",
                    "Bypass Testing of Web Applications.",
                    "Detecting and Debugging Insecure Information Flows.",
                    "An Approach to Facilitate Reliability Testing of Web Services Components.",
                    "Non-Detrimental Web Application Security Scanning.",
                    "Reducing Coverage Collection Overhead With Disposable Instrumentation.",
                    "A Comparison of Bug Finding Tools for Java.",
                    "Coverage Metrics for Continuous Function Charts.",
                    "GERT: An Empirical Reliability Estimation and Testing Feedback Tool.",
                    "Multiple Profile Evaluation Using a Single Test Suite in Random Testing.",
                    "From Test Count to Code Coverage using the Lognormal Failure Rate.",
                    "Validation and Reliability Estimation of a Fingerprint Image Registration Software.",
                    "An Extended Operational Profile Model.",
                    "An Effective Method to Detect Software Memory Leakage Leveraged from Neuroscience Principles Governing Human Memory Behavior.",
                    "Automatically Inferring Temporal Properties for Program Evolution .",
                    "Middleware Transparent Development of Dependable CORBA Applications.",
                    "Survivability Analysis of Telephone Access Network.",
                    "Updates to the Schneidewind Software Reliability Model in SMERFS.",
                    "Towards a Unified Approach to the Representation of, and Reasoning with, Probabilistic Risk Information about Software and Its System Interface.",
                    "Empirical Study of Session-Based Workload and Reliability for Web Servers.",
                    "Robust Prediction of Fault-Proneness by Random Forests.",
                    "Preliminary Results On Using Static Analysis Tools For Software Inspection.",
                    "Software Release Control using Defect Based Quality Estimation.",
                    "Tree-Based Methods for Classifying Software Failures."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14th ISSRE 2003",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2003",
                "sub_name": "14th International Symposium on Software Reliability Engineering (ISSRE 2003), 17-20 November 2003, Denver, CO, USA.",
                "count": 42,
                "papers": [
                    "Detection or Isolation of Defects? An Experimental Comparison of Unit Testing and Code Inspection.",
                    "A Comprehensive and Systematic Methodology for Client-Server Class Integration Testing.",
                    "Optimal Resource Allocation for the Quality Control Process.",
                    "Test-Driven Development as a Defect-Reduction Practice.",
                    "Building a Requirement Fault Taxonomy: Experiences from a NASA Verification and Validation Research Project.",
                    "A New Software Testing Approach Based on Domain Analysis of Specifications and Programs.",
                    "Static Specification Analysis for Termination of Specification-Based Data Structure Repair.",
                    "Requirements by Contracts allow Automated System Testing.",
                    "Coverage Criteria for Logical Expressions.",
                    "Anomalies as Precursors of Field Failures.",
                    "An Empirical Study on Testing and Fault Tolerance for Software Reliability Engineering.",
                    "Forensic Analysis for Tamper Resistant Software.",
                    "A Framework for Tamper Detection Marking of Mobile Applications.",
                    "High-Assurance Synthesis of Security Services from Basic Microservices.",
                    "Shared Semantic Domains for Computational Reliability Engineering.",
                    "Enhanced Testing of Domain Specific Applications by Automatic Extraction of Axioms from Functional Specifications.",
                    "Thoroughness of Specification-Based Testing of Synchronous Programs.",
                    "Automating the Analysis of Voting Systems.",
                    "A Bayesian Belief Network for Assessing the Likelihood of Fault Content.",
                    "An Exploratory Study of Component Reliability Using Unit Testing.",
                    "Using a Log-normal Failure Rate Distribution for Worst Case Bound Reliability Prediction.",
                    "An Iterative Scheme for Maximum Likelihood Estimation in Software Reliability Modeling.",
                    "Fault Correction Profiles.",
                    "Early Warning of Failures through Alarm Analysis - A Case Study in Telecom Voice Mail Systems.",
                    "Reducing wasted development time via continuous testing.",
                    "User-Oriented Reliability Modeling for a Web System.",
                    "Assessing Uncertainty in Reliability of Component-Based Software Systems.",
                    "When Does It Pay to Make Software More Reliable?.",
                    "Test Adequacy Assessment for UML Design Model Testing.",
                    "Open Source Software - A Recipe for Vulnerable Software, or The Only Way to Keep the Bugs and the Bad Guys Out?",
                    "A Parameterized Cost Model to Order Classes for Class-based Testing of C++ Applications.",
                    "Exploiting Symmetries to Test Programs.",
                    "Non-Intrusive Debug Technique for Embedded Programming.",
                    "Composition Analysis of QoS Properties for Adaptive Integration of Embedded Software Components.",
                    "Augmenting Simulated Annealing to Build Interaction Test Suites.",
                    "DARX - A Framework For The Fault-Tolerant Support Of Agent Software.",
                    "Investigating Java Type Analyses for the Receiver-Classes Testing Criterion.",
                    "Incremental Dynamic Impact Analysis for Evolving Software Systems.",
                    "A Comparison of Coverage-Based and Distribution-Based Techniques for Filtering and Prioritizing Test Cases.",
                    "Integrating Software into PRA.",
                    "New Quality Estimations in Random Testing.",
                    "Maximizing Interval Reliability in Operational Software System with Rejuvenation."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13th ISSRE 2002",
        "info": "Annapolis, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2002",
                "sub_name": "13th International Symposium on Software Reliability Engineering (ISSRE 2002), 12-15 November 2002, Annapolis, MD, USA.",
                "count": 33,
                "papers": [
                    "Testing Processes from Formal Specifications with Inputs, Outputs and Data Types.",
                    "Saturation Effects in Testing of Formal Models.",
                    "Informal Proof Analysis Towards Testing Enhancement.",
                    "Heterogeneous Software Reliability Modeling.",
                    "A Reliability Estimator for Model Based Software Testing.",
                    "Reliability Prediction and Sensitivity Analysis Based on Software Architecture.",
                    "Automatic Failure Detection, Logging, and Recovery for High-Availability Java Servers.",
                    "The Impact of Recovery Mechanisms on the Likelihood of Saving Corrupted State.",
                    "A Flexible Generator Architecture for Improving Software Dependability.",
                    "Metrics for Measuring the Effectiveness of Software-Testing Tools.",
                    "Optimal Allocation of Testing Resources for Modular Software Systems.",
                    "On Estimating Testing Effort Needed to Assure Field Quality in Software Development.",
                    "A Framework for Live Software Upgrade.",
                    "Modeling and Analysis of Software Rejuvenation in Cable Modem Termination Systems.",
                    "Dependability Analysis of a Client/Server Software System with Rejuvenation.",
                    "Data Coverage Testing of Programs for Container Classes.",
                    "Genes and Bacteria for Automatic Test Cases Optimization in the .NET Environment.",
                    "Fault Detection Capabilities of Coupling-based OO Testing.",
                    "Improving Usefulness of Software Quality Classification Models Based on Boolean Discriminant Functions.",
                    "Fault Contribution Trees for Product Families.",
                    "Automatic Synthesis of Dynamic Fault Trees from UML System Models.",
                    "Test Reuse in the Spreadsheet Paradigm.",
                    "A Case Study Using the Round-Trip Strategy for State-Based Class Testing.",
                    "An Empirical Study of Tracing Techniques from a Failure Analysis Perspective.",
                    "Worst Case Reliability Prediction Based on a Prior Estimate of Residual Defects.",
                    "A Vector Markov Model for Structural Coverage Growth and the Number of Failure Occurrences.",
                    "Blocking-based Simultaneous Reachability Analysis of Asynchronous Message-passing Programs.",
                    "Emulation of Software Faults by Educated Mutations at Machine-Code Level.",
                    "Mutation of Java Objects.",
                    "Inter-Class Mutation Operators for Java.",
                    "Reliability Assessment of Framework-Based Distributed Embedded Software Systems.",
                    "Effect of Disturbances on the Convergence of Failure Intensity.",
                    "Toward A Quantifiable Definition of Software Faults."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "12th ISSRE 2001",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2001",
                "sub_name": "12th International Symposium on Software Reliability Engineering (ISSRE 2001), 27-30 November 2001, Hong Kong, China.",
                "count": 38,
                "papers": [
                    "An Approach to Higher Reliability Using Software Components.",
                    "A Bayesian Approach to Reliability Prediction and Assessment of Component Based Systems.",
                    "Many architecture-based software reliability modelsComparison of Architecture-Based Software Reliability Models.",
                    "Finite-State Testing and Analysis of Graphical User Interfaces.",
                    "Incorporating Software Reliability Engineering into the Test Process for an Extensive GUI-Based Network Management System.",
                    "User-Based Testing of GUI Sequences and Their Interactions.",
                    "An Application of Zero-Inflated Poisson Regression for Software Fault Prediction .",
                    "A Fault Model for Fault Injection Analysis of Dynamic UML Dynamic Specifications.",
                    "A Fault Model for Subtype Inheritance and Polymorphism.",
                    "Modeling and Analysis of Using Memory Management Unit to Improve Software Reliability.",
                    "Modeling and Verifying Strong Cache Consistency for Mobile Data Access .",
                    "Recovery Proxy for Wireless Applications.",
                    "Estimation of Software Diversity by Fault Simulation and Failure Searching.",
                    "Fault Tolerant Distributed Information Systems.",
                    "Increasing the Reliability of Three-Tier Applications.",
                    "Low-Cost Flexible Software Fault Tolerance for Distributed Computing.",
                    "A Simulation Based Trainer for Software Reliability Modeling.",
                    "Analysis of Hypergeometric Distribution Software Reliability Model.",
                    "Discrete Equations and Software Reliability Growth Models.",
                    "Modelling the Fault Correction Process.",
                    "An Auto-Generating Tool for the MPEG-2 Formatted Test Data: ATEP.",
                    "Generating Test Cases for XML-Based Web Component Interactions Using Mutation Analysis.",
                    "Toward Generic Timing Tests for Distributed Multimedia Software Systems.",
                    "Efficient Deadlock Analysis of Clients/Server Systems with Two-Way Communication.",
                    "Feedback Control of the Software Test Process Through Measurements of Software Reliability.",
                    "Tool Support for Production Use of Formal Techniques.",
                    "An Empirical Evaluation of Statistical Testing Designed from UML State Diagrams: The Flight Guidance System Case Study.",
                    "Evaluating the Software Test Strategy for the 2000 Sydney Olympics.",
                    "Coverage Analysis for Message Flows.",
                    "Revisiting Strategies for Ordering Class Integration Testing in the Presence of Dependency Cycles.",
                    "Automated and Portable Native Code Isolation.",
                    "Deriving Tests From Software Architectures.",
                    "Reliability of Systems of Independently Developable End-User Assessable Logical (IDEAL) Programs.",
                    "Towards a 'Safe' Use of Design Patterns to Improve OO Software Testability.",
                    "Accounting for Realities When Estimating the Field Failure Rate of Software.",
                    "Defect Content Estimation for Two Reviewers.",
                    "Measurement-Based Availability of Unix Systems in a Distributed Environment.",
                    "Quantitative Evaluation and Operative Usage of Interactive Systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "11th ISSRE 2000",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/2000",
                "sub_name": "11th International Symposium on Software Reliability Engineering (ISSRE 2000), 8-11 October 2000, San Jose, CA, USA.",
                "count": 34,
                "papers": [
                    "Discard the Bathtub Model for the Shower Model.",
                    "Everything You Wanted to Know About Software Reliability Engineering but Didn't Know Who to Ask.",
                    "Building Trust into OO Components Using a Genetic Analogy.",
                    "Criteria for Testing Polymorphic Relationships.",
                    "Thresholds for Object-Oriented Measures.",
                    "Heuristic Self-Organization Algorithms for Software Reliability Assessment and Their Applications.",
                    "Estimating the Failure Rate of Evolving Software Systems.",
                    "Module Size Distribution and Defect Density.",
                    "Quantitative Software Reliability Modeling from Testing to Operation.",
                    "Structural Testing of Web Applications.",
                    "Evaluation of Regressive Methods for Automated Generation of Test Trajectories.",
                    "Generating Test Cases for GUI Responsibilities Using Complete Interaction Sequences.",
                    "Assessing the Cost-Effectiveness of Inspections by Combining Project Data and Expert Opinion.",
                    "Contributing to the Bottom Line: Optimizing Reliability-Cost-Schedule Tradeoff and Architecture Scalability through Test Technology.",
                    "How to Measure the Impact of Specific Development Practices on Fielded Defect Density.",
                    "Analyzing Testability on Data Flow Designs.",
                    "A Software Falsifier.",
                    "Planner Based Error Recovery Testing.",
                    "Improving Tree-Based Models of Software Quality with Principal Components Analysis.",
                    "A Methodology for Architectural-Level Risk Assessment Using Dynamic Metrics.",
                    "Testing Nondeterminate Systems.",
                    "On the Repeatability of Metric Models and Metrics across Software Builds.",
                    "Ranking Software Engineering Measures Related to Reliability Using Expert Opinion.",
                    "Modeling Fault-Prone Modules of Subsystems.",
                    "Formal Semantics for Computational Engineering: A Case Study on Dynamic Fault Trees.",
                    "Extending Fault Trees with an AND-THEN Gate.",
                    "Risk Bands - A Novel Feature of Safecharts.",
                    "SALT - An Integrated Environment to Automate Generation of Function Tests for APIs.",
                    "Assessing the Sensitivity to Usage Profile Changes in Test Planning.",
                    "ATACOBOL: A COBOL Test Coverage Analysis Tool and Its Applications.",
                    "Software Reliability and Maintenance Concept Used for Automatic Call Distributor MEDIO ACD.",
                    "Can Intuition Become Rigorous? Foundations for UML Model Verification Tools.",
                    "Formal Limits on Determining Reliabilities of Component-Based Software Systems.",
                    "Software Black Box: An Alternative Mechanism for Failure Analysis."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "10th ISSRE 1999",
        "info": "Boca Raton, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1999",
                "sub_name": "10th International Symposium on Software Reliability Engineering, ISSRE, 1999, Boca Raton, FL, USA, November 1-4, 1999.",
                "count": 33,
                "papers": [
                    "Challenges & solutions for 24/7 system availability.",
                    "Practical issues in implementing software reliability measurement.",
                    "Confidence interval estimation of NHPP-based software reliability models.",
                    "Rare failure-state in a Markov chain model for software reliability.",
                    "Scenario-based reliability analysis of component-based software.",
                    "Building a system failure rate estimator by identifying component failure rates.",
                    "Applying adaptive safety analysis techniques [for embedded software].",
                    "An exception handling mechanism for developing dependable object-oriented software based on a meta-level approach.",
                    "Software reliability modeling and cost estimation incorporating testing-effort and efficiency.",
                    "Testing object-oriented programs - an integrated approach.",
                    "A measurement-based model for estimation of resource exhaustion in operational software systems.",
                    "A stochastic model of human errors in software development: impact of repair times.",
                    "Exploring cost and reliability tradeoffs in architectural alternatives using a genetic algorithm.",
                    "Classification tree models of software quality over multiple releases.",
                    "An empirical study of experience-based software defect content estimation methods.",
                    "Predicting deviations in software quality by using relative critical value deviation metrics.",
                    "Using simulation for assessing the real impact of test coverage on defect coverage.",
                    "Efficient regression testing of multi-panel systems.",
                    "An approach to testing COTS software for robustness to operating system exceptions and errors.",
                    "Software development and testing methodology used for subscriber digital concentrator ACK-2000.",
                    "Guiding resource constrained software testing.",
                    "Robustness testing of a distributed simulation backplane.",
                    "Increased software reliability through input validation analysis and testing.",
                    "Mutation testing applied to validate specifications based on statecharts.",
                    "Developing a high-quality software tool for fault tree analysis.",
                    "Failure correlation in software reliability models.",
                    "Cost of software design diversity an empirical evaluation.",
                    "Generating test cases from an OO model with an AI planning system.",
                    "Efficient strategies for integration and regression testing of OO systems.",
                    "Regression testing on object-oriented programs.",
                    "Experience report on early software reliability prediction and estimation.",
                    "Requirements volatility and defect density.",
                    "Deriving a fault architecture from defect history."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "9th ISSRE 1998",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1998",
                "sub_name": "Ninth International Symposium on Software Reliability Engineering, ISSRE 1998, Paderborn, Germany, November 4-7, 1998.",
                "count": 48,
                "papers": [
                    "Digital Product Evolution - Models And Trends.",
                    "Should/could software be more reliable than the \"world\" in which it is used?",
                    "Software reliability predictions for distributed software.",
                    "Estimating the number of undetected errors: Bayesian model selection.",
                    "A comparison and integration of capture-recapture models and the detection profile method.",
                    "On the inadequacy of ordinary preconditions for the practical design and verification of programs.",
                    "Understanding software defect detection in the Personal Software Process.",
                    "To maintain a reliable software specification.",
                    "Derivation of an integrated operational profile and use case model.",
                    "Industrial application of criticality predictions in software development.",
                    "Applying testability to reliability estimation.",
                    "Panel: Issues in the next generation of dependability standards.",
                    "Software reliability modeling by concatenating failure rates.",
                    "Pragmatic study of parametric decomposition models for estimating software reliability growth.",
                    "The lognormal distribution of software failure rates: origin and evidence.",
                    "The lognormal distribution of software failure rates: application to software reliability growth modeling.",
                    "Comparing the effectiveness of testing methods in improving programs: the effect of variations in program quality.",
                    "Resource-constrained non-operational testing of software.",
                    "Identifying high-risk scenarios of complex systems using input domain partitioning.",
                    "Model-based testing of a highly programmable system.",
                    "Does software reliability engineering (SRE) offer any benefits to mobile code's security woes?",
                    "On certifying mobile code for secure applications.",
                    "Mobile agent security and reliability.",
                    "Software reliability engineering for mobile code.",
                    "Protecting mobile code.",
                    "Lightweight guided random simulation.",
                    "Reliability simulation of component-based software systems.",
                    "Software reliability analysis incorporating fault detection and debugging activities.",
                    "Testing production system programs.",
                    "Expressing and implementing operational profiles for reactive software validation.",
                    "Testing the robustness of Windows NT software.",
                    "Studying the effects of code inspection and structural testing on software quality.",
                    "A modular implementation model of the Primary-Shadow TMO replication scheme and a testing approach using a real-time environment simulator.",
                    "Software diagnosability.",
                    "Reliability analysis of clustered computing systems.",
                    "Applying design metrics to a large-scale software system.",
                    "A methodology for detection and estimation of software aging.",
                    "Reliability optimization of redundant software with correlated failures.",
                    "Panel: Reliability Assesment for Emerging Technique.",
                    "Determining fault insertion rates for evolving software systems.",
                    "Exploring defect data from development and customer usage on software modules over multiple releases.",
                    "The repeatability of code defect classifications.",
                    "Predicting fault-prone classes with design measures in object-oriented systems.",
                    "Predicting the order of fault-prone modules in legacy software.",
                    "Using statistics of the extremes for software reliability analysis of safety critical systems.",
                    "Critical software for nuclear reactors: 11 years of field experience analysis.",
                    "An experimental comparison of fault and error injection.",
                    "Panel: Everything You Wanted to Know About SRE But Didn't Know Who To Ask."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "8th ISSRE 1997",
        "info": "Albuquerque, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1997",
                "sub_name": "Eighth International Symposium on Software Reliability Engineering, ISSRE 1997, Albuquerque, NM, USA, November 2-5, 1997.",
                "count": 43,
                "papers": [
                    "Statistical quality control: how to detect unreliable software components.",
                    "Evolutionary neural networks: a robust approach to software reliability problems.",
                    "Predicting fault-prone modules with case-based reasoning.",
                    "Detection of response time failures of real-time software.",
                    "Hierarchical supervisors for automatic detection of software failures.",
                    "Xept: a software instrumentation method for exception handling.",
                    "Program segmentation for controlling test coverage.",
                    "Automatic test generation using checkpoint encoding and antirandom testing.",
                    "Testing strategies for form-based visual programs.",
                    "Input requirements needed to produce an operational profile for a new telecommunications system (Abstract).",
                    "Guiding reengineering with the operational profile (Abstract).",
                    "Successful application of software reliability engineering for the NASA Space Shuttle (Abstract).",
                    "Software reliability in weapon systems (Abstract).",
                    "A practical method for the estimation of software reliability growth in the early stage of testing.",
                    "What do the software reliability growth model parameters represent?",
                    "Software reliability growth models: assumptions vs. reality.",
                    "Panel: Qualifying The Reliability Of COTS Software Components.",
                    "On the estimation of reliability of a software system using reliabilities of its components.",
                    "An example of risk assessment of software systems specifications.",
                    "Automatic simulation to predict software architecture reliability.",
                    "Using reversible computing to achieve fail-safety.",
                    "An approach to measuring and assessing dependability for critical software systems.",
                    "An operational profile for the Cartridge Support Software.",
                    "Keynote: Software Reliability In Theory And Practice.",
                    "Building software quality classification trees: approach, experimentation, evaluation.",
                    "Quantitative evaluation of capture-recapture models to control software inspections.",
                    "Empirical performance analysis of computer-supported code-reviews.",
                    "STL: a tool for on-line software update and rejuvenation (Abstract).",
                    "A top-down approach to high-consequence fault analysis for software systems (Abstract).",
                    "Use of software triggers to evaluate software process effectiveness and capture customer usage profiles (Abstract).",
                    "A study of effective regression testing in practice.",
                    "Effect of class testing on the reliability of object-oriented programs.",
                    "Confidence-based reliability and statistical coverage estimation.",
                    "Assessing software reliability performance under highly critical but infrequent event occurrences.",
                    "Reducing uncertainty about common-mode failures.",
                    "An architectural model for software reliability quantification.",
                    "Optimization of reliability allocation and testing schedule for software systems.",
                    "Reliability analysis of systems based on software and human resources.",
                    "Using proxy failure times with the Jelinski-Moranda software reliability model.",
                    "A non-parametric approach to software reliability prediction.",
                    "Analysis of a software reliability growth model with logistic testing-effort function.",
                    "Enforcing quality of service of distributed objects.",
                    "Software metrics model for integrating quality control and prediction."
                ]
            },
            {
                "sub_name_abbr": "conf/issre/1997cs",
                "sub_name": "Eighth International Symposium on Software Reliability Engineering - Case Studies, ISSRE 1997, Albuquerque, NM, USA, November 2-5, 1997.",
                "count": 9,
                "papers": [
                    "Introduction to software reliability engineering and testing.",
                    "Guiding reengineering with the operational profile.",
                    "Input requirements needed to produce an operational profile for a new telecommunications system.",
                    "Reliability behavior of a large network based education system.",
                    "Application of software reliability engineered testing (SRET) to project accounting application (PAA).",
                    "Successful application of software reliability engineering for the NASA Space Shuttle.",
                    "EMERALD: a case study in enhancing software reliability.",
                    "Software reliability in weapon systems.",
                    "Use of software triggers to evaluate software process effectiveness and capture customer usage profiles."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "7th ISSRE 1996",
        "info": "White Plains, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1996",
                "sub_name": "Seventh International Symposium on Software Reliability Engineering, ISSRE 1996, White Plains, NY, USA, October 30, 1996-Nov. 2, 1996.",
                "count": 41,
                "papers": [
                    "Automatic failure detection with Conditional-Belief supervisors.",
                    "Analyze-NOW-an environment for collection and analysis of failures in a network of workstations.",
                    "Towards automation of checklist-based code-reviews.",
                    "Sensitivity of reliability growth models to operational profile errors.",
                    "On reducing the sensitivity of software reliability to variations in the operational profile.",
                    "Avionics software problem occurrence rates.",
                    "Automatic test generation for predicates.",
                    "Object state testing and fault analysis for reliable software systems.",
                    "Residual fault density prediction using regression methods.",
                    "Integrating metrics and models for software risk assessment.",
                    "Assessing the reliability impacts of software fault-tolerance mechanisms.",
                    "Design of reliable software via general combination of N-version programming and acceptance testing.",
                    "Integration testing using interface mutation.",
                    "Task decomposition testing and metrics for concurrent programs.",
                    "Software reliability models: an approach to early reliability prediction.",
                    "Designing reliable systems from reliable components using the context-dependent constraint concept.",
                    "Using the genetic algorithm to build optimal neural networks for fault-prone module detection.",
                    "Using fault injection to increase software test coverage.",
                    "Error injection aimed at fault removal in fault tolerance mechanisms-criteria for error selection using field data on software faults.",
                    "Comparing disk and memory's resistance to operating system crashes.",
                    "Validating software architectures for high reliability.",
                    "Reliability of a commercial telecommunications system.",
                    "Reliability and availability of a wide area network-based education system.",
                    "DQS's experience with SRE.",
                    "Software reliability engineering for client-server systems.",
                    "Policy-driven fault management in distributed systems.",
                    "A practical strategy for testing pair-wise coverage of network interfaces.",
                    "Method for designing and placing check sets based on control flow analysis of programs.",
                    "A replication technique based on a functional and attribute grammar computation model.",
                    "An on-line algorithm for checkpoint placement.",
                    "Panel: How Can Software Reliability Engineering (SRE) Help System Engineers and SofWare Architects?",
                    "Efficient allocation of testing resources for software module testing based on the hyper-geometric distribution software reliability growth model.",
                    "Unification of finite failure non-homogeneous Poisson process models through test coverage.",
                    "A conservative theory for long term reliability growth prediction.",
                    "Primary-shadow consistency issues in the DRB scheme and the recovery time bound.",
                    "An empirical evaluation of maximum likelihood voting in failure correlation conditions.",
                    "Supervision of real-time software systems using optimistic path prediction and rollbacks.",
                    "Panel: Deploying SRE in Your Organization or Company.",
                    "Data partition based reliability modeling.",
                    "Detection of software modules with high debug code churn in a very large legacy system.",
                    "Fault exposure ratio estimation and applications."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "6th ISSRE 1995",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1995",
                "sub_name": "Sixth International Symposium on Software Reliability Engineering, ISSRE 1995, Toulouse, France, October 24-27, 1995.",
                "count": 45,
                "papers": [
                    "Dependability of computer systems: concepts, limits, improvements.",
                    "An integrated approach for criticality prediction.",
                    "Detection of fault-prone program modules in a very large telecommunications system.",
                    "Analysis of review's effectiveness based on software metrics.",
                    "Analysis of failures in the Tandem NonStop-UX Operating System.",
                    "An experience report on requirements reliability engineering using formal methods.",
                    "The role of testing in the B formal development process.",
                    "Systems specification, analysis, and validation by means of timed predicate/transition nets and logic programming.",
                    "An approach to safety and correctness verification of software design specification.",
                    "Antirandom testing: getting the most out of black-box testing.",
                    "System testing with an AI planner.",
                    "Test generation for Boolean expressions.",
                    "On the correlation between code coverage and software reliability.",
                    "A test coverage notion for logic programming.",
                    "Fault localization using execution slices and dataflow tests.",
                    "Software Reliability in COTS-Based Systems.",
                    "Dependable computing depends on structured fault tolerance.",
                    "Dependability of modular software in a multiuser operational environment.",
                    "Analysis of software rejuvenation using Markov Regenerative Stochastic Petri Net.",
                    "An additive reliability model for the analysis of modular software failure data.",
                    "Hyper-geometric distribution software reliability growth model with imperfect debugging.",
                    "A new method for increasing the reliability of multiversion software systems using software breeding.",
                    "Performability modeling of N version programming technique.",
                    "The effect of testing on the reliability of single version and 1-out-of-2 software systems.",
                    "Predicting software's minimum-time-to-hazard and mean-time-to-hazard for rare input events.",
                    "An assessment of software quality in a C++ environment.",
                    "Software reliability growth analysis: application of NHPP models and its evaluation.",
                    "BNR/NORTEL: path to improve product quality, reliability and customer satisfaction.",
                    "Software Error Data Collection and Analysis in Industry.",
                    "Defect reduction in VSE-methodology and results.",
                    "Towards a unified approach to the testability of co-designed systems.",
                    "Constructing operational profiles for synchronous critical software.",
                    "Dependability of safety-critical systems: contribution of the synchronous approach.",
                    "An experiment in determining software reliability model applicability.",
                    "An approach to automatic detection of software failures.",
                    "Parameter estimation of hyper-geometric distribution software reliability growth model by genetic algorithms.",
                    "MICOM IV&V planning approach and experience involving software reliability.",
                    "A software reliability engineering success story. AT&T's Definity PBX.",
                    "Telecommunications network operations systems: experiences in software reliability engineering.",
                    "Software reliability engineering study of a large-scale telecommunications software system.",
                    "An analysis of system level software availability during test.",
                    "A data analysis and representation engine to support software reliability engineering.",
                    "ROBUST: a next generation software reliability engineering tool.",
                    "M-elopee: a CASE tool for software reliability study.",
                    "A specification and validation method to improve concurrent systems reliability based on object messaging and rewriting logic."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "5th ISSRE 1994",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1994",
                "sub_name": "5th International Symposium on Software Reliability Engineering, ISSRE 1994, Monterey, CA, USA, November 6-9, 1994.",
                "count": 39,
                "papers": [
                    "Applying various learning curves to hyper-geometric distribution software reliability growth model.",
                    "A framework for reliability estimation.",
                    "An exploratory analysis of system test data.",
                    "Experimental analysis of models for correlation in multiversion software.",
                    "A process for software requirements safety analysis.",
                    "Empirical studies of predicate-based software testing.",
                    "Software reliability: to use or not to use?",
                    "Methodology of independent software nuclear safety analysis.",
                    "V&V in defense and commercial projects.",
                    "Assessment of a sampling method for measuring safety-critical software reliability.",
                    "On the impact of software product dissimilarity on software quality models.",
                    "Temporal complexity and software faults.",
                    "Fault modeling using the program dependence graph.",
                    "Software trustability.",
                    "Putting assertions in their place.",
                    "Connecting test coverage to software dependability.",
                    "Estimating the software reliability of smoothly degrading systems.",
                    "Modelling an imperfect debugging phenomenon with testing effort.",
                    "The relationship between test coverage and reliability.",
                    "On input profile selection for software testing.",
                    "Testing applications using domain based testing and Sleuth.",
                    "Mutation analysis testing for finite state machines.",
                    "Effect of test set size and block coverage on the fault detection effectiveness.",
                    "Testing synchronous critical software.",
                    "Using formal methods to validate C programs.",
                    "CLAIRE: an event-driven simulation tool for testing software.",
                    "A generalized software reliability process simulation technique and tool.",
                    "A case study to investigate sensitivity of reliability estimates to errors in operational profile.",
                    "Identifying risk using ODC based growth models.",
                    "System reliability policy at Motorola Codex.",
                    "FIABILOG: a software reliability tool and its application to space projects.",
                    "The Automatic Efficient Test Generator (AETG) system.",
                    "An automated environment for software testing and reliability estimation.",
                    "More efficient software testing through the application of design of experiments (DOE).",
                    "Reliability growth modelling of software for process control systems.",
                    "Adjusting measured field failure intensity for operational profile variation.",
                    "Sensitivity of field failure intensity to operational profile errors.",
                    "Some effects of fault recovery order on software reliability models.",
                    "Assessing the dynamic strength of software systems using interference analysis."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th ISSRE 1993",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1993",
                "sub_name": "Fourth International Symposium on Software Reliability Engineering, ISSRE 1993, Denver, CO, USA, November 3-6, 1993.",
                "count": 35,
                "papers": [
                    "Current trends of the software reliability in Japan and needs of future related activities.",
                    "Automated testing support for a robot tape library.",
                    "INRETS experience of the highly critical software validation of the MAGGALY subway.",
                    "A coverage analysis tool for the effectiveness of software testing.",
                    "Engineering reliable software.",
                    "Designing reliable software.",
                    "Controlling software reliability during development.",
                    "A systematic approach to software reliability modeling.",
                    "Enhancing accuracy of software reliability prediction.",
                    "The effect of correlated faults on software reliability.",
                    "Reliability prediction of distributed embedded fault-tolerant systems.",
                    "System reliability analysis of an N-version programming application.",
                    "Dependability modeling and evaluation of recovery block systems.",
                    "Panel: Field Failures And Reliability In Operation.",
                    "Complexity metrics for distributed programs.",
                    "Optimal selection of failure data for predicting failure counts.",
                    "Software recreate problems estimated to range 10-20 percent: A case study on two operating system products.",
                    "Reliability of uniprocessor and multiprocessor real-time artificial intelligence planning systems.",
                    "A hierarchical object-oriented approach to fault tolerance in distributed systems.",
                    "Adding capability checks enhances error detection and isolation in object-based systems.",
                    "A mathematical comparison of Software Breeding and Community Error Recovery in multiversion software.",
                    "A new fault tolerant distributed algorithm for longest paths in a DAG.",
                    "System simulation testing: Pre-delivery testing to ensure system dependability.",
                    "Robustness of optimum software release policies.",
                    "Using algebraic specifications to find sequencing defects.",
                    "Experience in software reliability: From data collection to quantitative evaluation.",
                    "A quantitative risk assessment method for space flight software systems.",
                    "Software reliability measurement and modeling for multiple releases of commercial software.",
                    "On the need for simulation for better characterization of software reliability.",
                    "TERSE: A tool for evaluating software reliability models.",
                    "Infinite failure models for a finite world: A simulation study of the fault discovery process.",
                    "Panel: Achieving Success in Measurement and Reliability Modeling.",
                    "A neural network modeling methodology for the detection of high-risk programs.",
                    "A neural network approach for software reliability growth modeling in the presence of code churn.",
                    "Testing and reliability of logic programs."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3rd ISSRE 1992",
        "info": "Research Triangle Park, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1992",
                "sub_name": "Third International Symposium on Software Reliability Engineering, ISSRE 1992, Research Triangle Park, NC, USA, October 7-10, 1992.",
                "count": 35,
                "papers": [
                    "An 'extended execution time' software reliability model.",
                    "On the log-power NHPP software reliability model.",
                    "The nature of fault exposure ratio.",
                    "Optimizing software reliability management process.",
                    "Software engineering malpractice and its avoidance.",
                    "Concurrent engineering aspects of software development.",
                    "The discrete time hyperexponential model for software reliability growth evaluation.",
                    "The scaling problem in neural networks for software reliability prediction.",
                    "A neural network approach for predicting software development faults.",
                    "Analysis of large system black-box test data.",
                    "Control-flow based testing of Prolog programs.",
                    "Improving the software development process using testability research.",
                    "For a product-in-a-process approach to software reliability evaluation.",
                    "The operational profile in software reliability engineering: an overview.",
                    "A method proposal for early software reliability estimation.",
                    "An improved classification tree analysis of high cost modules based upon an axiomatic definition of complexity.",
                    "Minimizing risk in applying metrics on multiple projects.",
                    "The Schneidewind software reliability model revisited.",
                    "Test coverage dependent software reliability estimation by the HGD model.",
                    "Solving maximum likelihood equations for two-parameter software reliability models using grouped data.",
                    "Analysis of the VAX/VMS error logs in multicomputer environments-a case study of software dependability.",
                    "Analysis of software halts in the tandem GUARDIAN operating system.",
                    "Development of a benchmark to measure system robustness: experiences and lessons learned.",
                    "Software reliability measurements in N-Version software execution environment.",
                    "Designing fault tolerant application in Maruti.",
                    "Error-free software development for critical systems using the B-Methodology.",
                    "Implementing operational profiles to measure system reliability.",
                    "Software quality metrics in space systems.",
                    "Reliability and maintainability related software coupling metrics in C++ programs.",
                    "Standards and practices for reliable safety-related software systems.",
                    "Providing an empirical basis for optimizing the verification and testing phases of software development.",
                    "Enhanced availability of transaction oriented systems using failure tests.",
                    "Measuring the field quality of wide-distribution commercial software.",
                    "On operational availability of a large software-based telecommunications system.",
                    "Bicriterion release policy for exponential software reliability growth model."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd ISSRE 1991",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/issre/1991",
                "sub_name": "Second International Symposium on Software Reliability Engineering, ISSRE 1991, Austin, TX, USA, May 17-18, 1991.",
                "count": 29,
                "papers": [
                    "The use of software complexity metrics in software reliability modeling.",
                    "A framework for selecting system design metrics.",
                    "The influence of syntactic and semantic errors on the quality of software.",
                    "Parameter estimation of the hyper-geometric distribution model for real test/debug data.",
                    "Reliability models for very large software systems in industry.",
                    "Safety arguments, software and system reliability.",
                    "A micro software reliability model for prediction and test apportionment.",
                    "Poisson processes with nearly constant failure intensity.",
                    "Realistic assumptions for software reliability models.",
                    "Practical applications of software reliability models.",
                    "A survey of software reliability measurement tools.",
                    "A data collection environment for software reliability research.",
                    "EDF: a formalism for describing and reusing software experience.",
                    "Timing errors in real-time systems and their detection.",
                    "Prediction of software reliability using neural networks.",
                    "A mechanical verifier for supporting the design of reliable reactive systems.",
                    "Formal specifications and reliability: an experimental study.",
                    "Quality assurance experience data base.",
                    "Software reliability practices at Cray Research Inc.",
                    "Reliability evaluation using NHPP models.",
                    "Metrics evaluation of software reliability growth models.",
                    "A heuristic approach for software reliability prediction: the equally-weighted linear combination model.",
                    "Software reliability model selection: a cast study.",
                    "On some reliability estimation problems in random and partition testing.",
                    "Comparative analysis of concurrent fault tolerance techniques for real-time applications.",
                    "A new Markov model of N version programming systems.",
                    "On the determination of optimum software release time.",
                    "Validating software metrics: producing quality discriminators.",
                    "How faults cause software failures: implications for software reliability engineering."
                ]
            }
        ]
    }
]