[
	{
		"name": "JLAP",
		"year": "2022",
		"info": "2022: Volumes\n124,\n125,\n126,",
		"count": 23,
		"papers": [
			"Formalizing Moessner's theorem and generalizations in Nuprl.",
			"Comparing type systems for deadlock freedom.",
			"Reversible computation in nets with bonds.",
			"A probabilistic approximate logic for neuro-symbolic learning and reasoning.",
			"Event structures for the reversible early internal -calculus.",
			"Simulating and model checking membrane systems using strategies in Maude.",
			"Metalevel transformation of strategies.",
			"Optimization of rewrite theories by equational partial evaluation.",
			"Components and acyclicity of graphs. An exercise in combining precision with concision.",
			"Session-typed concurrent contracts.",
			"Graded epistemic logic with public announcement.",
			"Static checking of GDPR-related privacy compliance for object-oriented distributed systems.",
			"Coalgebraic tools for randomness-conserving protocols.",
			"A process calculus for privacy-preserving protocols in location-based service systems.",
			"A formal treatment of the role of verified compilers in secure computation.",
			"A tableau construction for finite linear-time temporal logic.",
			"CONCUR test-of-time award for the period 1994-97 interview with Uwe Nestmann and Benjamin C. Pierce.",
			"Unification and combination of a class of traversal strategies made with pattern matching and fixed-points.",
			"Automated construction of security integrity wrappers for Industry 4.0 applications.",
			"Associative unification in Maude.",
			"The power of Tarski's relation algebra on trees.",
			"Proving and disproving confluence of context-sensitive rewriting.",
			"Monk algebras and Ramsey theory."
		]
	},
	{
		"name": "JLAP",
		"year": "2021",
		"info": "2021: Volumes\n118,\n119,\n120,\n121,\n122,\n123",
		"count": 52,
		"papers": [
			"Soft constraint automata with memory.",
			"A navigational logic for reasoning about graph properties.",
			"Actor-based model checking for Software-Defined Networks.",
			"Runtime verification for dynamic architectures.",
			"(Co)inductive proof systems for compositional proofs in reachability logic.",
			"Composition and decomposition of multiparty sessions.",
			"Checking deadlock-freedom of parametric component-based systems.",
			"The C-calculus: A model for confidential name passing.",
			"Well-structuredness, safeness and soundness: A formal classification of BPMN collaborations.",
			"Conflict vs causality in event structures.",
			"Semantics of temporal constrained objects.",
			"Deciding the consistency of non-linear real arithmetic constraints with a conflict driven search using cylindrical algebraic coverings.",
			"Synthesis of sorting algorithms using multisets in Theorema.",
			"Computer says no: Verdict explainability for runtime monitors using a local proof system.",
			"A message-passing interpretation of adjoint logic.",
			"Matching logic explained.",
			"A structural approach to graph transformation based on symmetric Petri nets.",
			"On checking equivalence of simulation scripts.",
			"A fixed-points based framework for compliance of behavioural contracts.",
			"Verification of dynamic bisimulation theorems in Coq.",
			"Schreier split extensions of preordered monoids.",
			"Many-sorted hybrid modal languages.",
			"Semantics of multiway dataflow constraint systems.",
			"Simpler proofs with decentralized invariants.",
			"A dynamic epistemic logic analysis of equality negation and other epistemic covering tasks.",
			"Tribute to Anna Labella.",
			"Scalable optimal deployment in the cloud of component-based applications using optimization modulo theory, mathematical programming and symmetry breaking.",
			"Certifying Findel derivatives for blockchain.",
			"Reasoning about distributed information with infinitely many agents.",
			"On primitives for compensation handling as adaptable processes.",
			"Explaining safety failures in NetKAT.",
			"Operational semantics with semicommutations.",
			"Formal verification of timed synchronous dataflow graphs using Lustre.",
			"Non-dual modal operators as a basis for 4-valued accessibility relations in Hybrid logic.",
			"Applications and extensions of context-sensitive rewriting.",
			"Automated verification of reactive and concurrent programs by calculation.",
			"Resource separation in dynamic logic of propositional assignments.",
			"Event-Based Time-Stamped Claim Logic.",
			"Event structure semantics of (controlled) reversible CCS.",
			"The origins of the halting problem.",
			"Expressing discrete spatial relations under granularity.",
			"Formalizing and analyzing security ceremonies with heterogeneous devices in ANP and PDL.",
			"Determinization of inverted grammar programs via context-free expressions.",
			"Belief base change as priority change: A study based on dynamic epistemic logic.",
			"Observational interpretations of hybrid dynamic logic with binders and silent transitions.",
			"A Perron-Frobenius theorem for deciding matrix growth.",
			"Strategies, model checking and branching-time properties in Maude.",
			"Stit semantics for epistemic notions based on information disclosure in interactive settings.",
			"Resource provisioning strategies for BPMN processes: Specification and analysis using Maude.",
			"An abstract framework for choreographic testing.",
			"Defining behaviorizeable relations to enable inference in semi-automatic program synthesis.",
			"Guest Editor's foreword."
		]
	},
	{
		"name": "JLAP",
		"year": "2020",
		"info": "2020: Volumes\n110,\n111,\n112,\n113,\n114,\n115,\n116,\n117",
		"count": 44,
		"papers": [
			"A linear-time-branching-time spectrum for behavioral specification theories.",
			"Leveraging access mode declarations in a model for memory consistency in heterogeneous systems.",
			"A calculus of concurrent graph-rewriting processes.",
			"Programming and symbolic computation in Maude.",
			"Generalized rewrite theories, coherence completion, and symbolic methods.",
			"A partial evaluation framework for order-sorted equational programs modulo axioms.",
			"Partial predicate abstraction and counter-example guided refinement.",
			"Combining free choice and time in Petri nets.",
			"Model checking for hybrid branching-time logics.",
			"Consistency in Parametric Interval Probabilistic Timed Automata.",
			"Introducing complexity to formal testing.",
			"A formal approach to the engineering of domain-specific distributed systems.",
			"Abstracting models of strong normalization for classical calculi.",
			"Ground confluence of order-sorted conditional specifications modulo axioms.",
			"DaL铆 - Dynamic Logic, new trends and applications.",
			"Determinizing monitors for HML with recursion.",
			"Preface to the special issue on the 11th International Conference on Graph Transformation.",
			"Spreading nets: A uniform approach to unfoldings.",
			"Process calculi as a tool for studying coordination, contracts and session types.",
			"On the expressiveness of multiplicities in data-based coordination languages.",
			"The complexity of identifying characteristic formulae.",
			"A verified proof checker for higher-order logic.",
			"Twenty years of coordination technologies: COORDINATION contribution to the state of art.",
			"Interval-valued fuzzy reasoning method based on similarity measure.",
			"Instantaneous reaction-time in dynamic consistency checking of conditional simple temporal networks.",
			"Specifying with syntactic theory functors.",
			"Knowledge representation and update in hierarchies of graphs.",
			"Realizable causal-consistent reversible choreographies for systems with first-in-first-out communication channels.",
			"Replicated data types that unify eventual consistency and observable atomic consistency.",
			"A collaborative access control framework for online social networks.",
			"Hybrid search plan generation for generalized graph pattern matching.",
			"Constructing optimized constraint-preserving application conditions for model transformation rules.",
			"Double-pushout-rewriting in S-Cartesian functor categories: Rewriting theory and application to partial triple graphs.",
			"Preface to the special issue on the 12th International Conference on Graph Transformation.",
			"From global choreographies to verifiable efficient distributed implementations.",
			"Algebraic solution of minimax single-facility constrained location problems with Chebyshev and rectilinear distances.",
			"Replacement freeness: A criterion for separating process calculi.",
			"Preface to the special issue on Formal Approaches to Parallel and Distributed Systems 2018.",
			"Specifying reversibility with TLA+.",
			"Calculational relation-algebraic proofs in the teaching tool CalcCheck.",
			"Relational characterisations of paths.",
			"Relation algebras of Sugihara, Belnap, Meyer, and Church.",
			"On the group memory complexity of extended finite automata over groups.",
			"Free Kleene algebras with domain."
		]
	},
	{
		"name": "JLAP",
		"year": "2019",
		"info": "2019: Volumes\n102,\n103,\n104,\n105,\n106,\n107,\n108,\n109",
		"count": 70,
		"papers": [
			"Sequential pattern mining for ICT risk assessment and management.",
			"Cryptomorphic topological structures: A computational, relation-algebraic approach.",
			"Stubborn versus structural reductions for Petri nets.",
			"Axiomatising infinitary probabilistic weak bisimilarity of finite-state behaviours.",
			"Session types and subtyping for orchestrated interactions.",
			"Tracking CSP computations.",
			"Operational semantics of a weak memory model with channel synchronization.",
			"Model-based fault injection for testing gray-box systems.",
			"Verification and control for probabilistic hybrid automata with finite bisimulations.",
			"Domain and range for angelic and demonic compositions.",
			"Designing context-aware systems: A method for understanding and analysing context in practice.",
			"Granularity of conflicts and dependencies in graph transformation systems: A two-dimensional approach.",
			"On series-parallel pomset languages: Rationality, context-freeness and automata.",
			"An evaluation of interaction paradigms for active objects.",
			"Executable component-based semantics.",
			"The PBPO graph transformation approach.",
			"Keep it fair: Equivalence and composition.",
			"Towards a categorical representation of reversible event structures.",
			"Nested-unit Petri nets.",
			"Higher-order linearisability.",
			"A general overview of formal languages for individual-based modelling of ecosystems.",
			"Precise subtyping for synchronous multiparty sessions.",
			"Preface to the special issue on the 10th International Conference on Graph Transformation.",
			"Specifying graph languages with type graphs.",
			"Pattern-based and composition-driven automatic generation of logical specifications for workflow-oriented software models.",
			"A stable non-interleaving early operational semantics for the pi-calculus.",
			"Automated test case generation for the Paxos single-decree protocol using a Coloured Petri Net model.",
			"Geographic wayfinders and space-time algebra.",
			"Formalization and correctness of predictive shift-reduce parsers for graph grammars based on hyperedge replacement.",
			"Time analysis of actor programs.",
			"Model checking and synthesis for branching multi-weighted logics.",
			"Some decidability results on one-pass reductions.",
			"A reduction semantics for direct-style asynchronous observables.",
			"A (co)algebraic theory of succinct automata.",
			"NWPT 2017 - Special issue.",
			"Modal transition system encoding of featured transition systems.",
			"Formalization of functional variation in HOL Light.",
			"Latent semantic analysis of game models using LSTM.",
			"Program algebra for quantitative information flow.",
			"Logical characterisations, rule formats and compositionality for input-output conformance simulation.",
			"A uniform approach to completions of posets.",
			"A logical study of group-size based social network creation.",
			"Logics for Actor Networks: A two-stage constrained-hybridisation approach.",
			"Multilevel coupled model transformations for precise and reusable definition of model behaviour.",
			"Special issue on the tenth Workshop on Programming Language Approaches to Concurrency- and Communication-cEntric Software.",
			"Relational and algebraic methods in computer science.",
			"A core Erlang semantics for declarative debugging.",
			"Input urgent semantics for asynchronous timed session types.",
			"Probabilistic software product lines.",
			"Dynamic structural operational semantics.",
			"On the modeling of optimal and automatized cloud application deployment.",
			"A calculus for modeling floating authorizations.",
			"Special Issue on Trends in Concurrency Theory (selected invited contributions from the workshops TRENDS 2015 and 2016).",
			"Selected papers from the 28th Nordic Workshop on Programming Theory (NWPT'16).",
			"Introspection as an action in relational models.",
			"A modular framework for verifying versatile distributed systems.",
			"Axiomatization and computability of a variant of iteration-free PDL with fork.",
			"Realisability of pomsets.",
			"A denotational semantics of textually aligned SPMD programs.",
			"A coordination protocol language for power grid operation control.",
			"Axiomatization and characterization of BSP algorithms.",
			"From distributed coordination to field calculus and aggregate computing.",
			"A dynamic logic for learning theory.",
			"Connecting open systems of communicating finite state machines.",
			"Graph transformation through graph surfing in reaction systems.",
			"On the essence and initiality of conflicts in M-adhesive transformation systems.",
			"CoReS: A tool for computing core graphs via SAT/SMT solvers.",
			"Ensuring liveness properties of distributed systems: Open problems.",
			"Preface for the special issue on Interaction and Concurrency Experience 2017.",
			"Guest editors' foreword."
		]
	},
	{
		"name": "JLAP",
		"year": "2018",
		"info": "2018: Volumes\n94,\n95,\n96,\n97,\n98,\n99,\n100,\n101",
		"count": 58,
		"papers": [
			"Formally verifying exceptions for low-level code with separation logic.",
			"Programming from metaphorisms.",
			"On the accuracy of formal verification of selective defenses for TDoS attacks.",
			"Recursion versus tail recursion over 攫p.",
			"To every manifest domain a CSP expression - a r么le for mereology in computer science.",
			"Virtually timed ambients: A calculus of nested virtualization.",
			"Reversible computation in term rewriting.",
			"ULTraS at work: Compositionality metaresults for bisimulation and trace semantics.",
			"Preface.",
			"A complete logic for behavioural equivalence in coalgebras of finitary set functors.",
			"From probability monads to commutative effectuses.",
			"Optimised determinisation and completion of finite tree automata.",
			"Semantics of global view of choreographies.",
			"Fixed points of functors.",
			"A modular reasoning system using uninterpreted predicates for code reuse.",
			"Field-sensitive sharing.",
			"Deconstructing Lawvere with distributive laws.",
			"Guest editors' foreword.",
			"System-level state equality detection for the formal dynamic verification of legacy distributed applications.",
			"Labelled graph strategic rewriting for social networks.",
			"Reduction semantics in Markovian process algebra.",
			"Verification of finite-state machines: A distributed approach.",
			"Metalevel algorithms for variant satisfiability.",
			"Convergence: Integrating termination and abort-freedom.",
			"A theoretical framework for cardinality-based feature models: The semantics and computational aspects.",
			"Multiparty session types, beyond duality.",
			"Algorithmic debugging generalized.",
			"Termination and complexity analysis for programs with bitvector arithmetic by symbolic execution.",
			"Embeddability into relational lattices is undecidable.",
			"A perspective on specifying and verifying concurrent modules.",
			"Preface for the special issue on Interaction and Concurrency Experience 2016.",
			"Inferring regular languages and -languages.",
			"A secrecy-preserving language for distributed and object-oriented systems.",
			"Complete algebraic solution of multidimensional optimization problems in tropical semifield.",
			"When are stochastic transition systems tameable?",
			"Instrumenting a weakest precondition calculus for counterexample generation.",
			"On clock-aware LTL parameter synthesis of timed automata.",
			"Modularizing behavioral and architectural crosscutting concerns in formal component-based systems - Application to the Behavior Interaction Priority framework.",
			"Best-by-simulations: A framework for comparing efficiency of reconfigurable architectures on workloads with deadlines.",
			"A type checking algorithm for concurrent object protocols.",
			"On the metric-based approximate minimization of Markov Chains.",
			"Demand-driven interprocedural analysis for map-based abstract domains.",
			"A theory of reversibility for Erlang.",
			"Finding models through graph saturation.",
			"Relation Algebra as programming language using the Ampersand compiler.",
			"Bestow and atomic: Concurrent programming using isolation, delegation and grouping.",
			"An axiomatic semantics for iocos_ conformance relation.",
			"The quintuple implication principle of fuzzy reasoning based on interval-valued S-implication.",
			"Data-driven modelling and probabilistic analysis of interactive software usage.",
			"A Hybrid Automata model of social networking addiction.",
			"Logic programming: Laxness and saturation.",
			"Declarative debugging of concurrent Erlang programs.",
			"Editor's foreword.",
			"Lock-free concurrent binomial heaps.",
			"A logic-algebraic tool for reasoning with Knowledge-Based Systems.",
			"Probabilistic timed graph transformation systems.",
			"Verifying minimum spanning tree algorithms with Stone relation algebras.",
			"Preemptive type checking."
		]
	},
	{
		"name": "JLAP",
		"year": "2017",
		"info": "2017: Volumes \n86,\n87,\n88,\n89,\n90,\n91,\n92,\n93",
		"count": 63,
		"papers": [
			"Preface for the special issue on Interaction and Concurrency Experience 2015.",
			"Configuration logics: Modeling architecture styles.",
			"Orchestrated session compliance.",
			"Contextual equivalences in configuration structures and reversibility.",
			"Belief, knowledge, lies and other utterances in an algebra for space and extrusion.",
			"Combine and conquer: Relating BIP and Reo.",
			"Rewriting Logic and its Applications (extended selected papers from WRLA 2014).",
			"Verifiable abstractions for contract-oriented systems.",
			"Amalgamation of domain specific languages with behaviour.",
			"Dependency pairs for proving termination properties of conditional term rewriting systems.",
			"Rewriting modulo SMT and open system analysis.",
			"Robustness of interval-valued fuzzy inference triple I algorithms based on normalized Minkowski distance.",
			"An analysis of the equational properties of the well-founded fixed point.",
			"Formalizing semantic bidirectionalization and extensions with dependent types.",
			"Dynamic Rebinding for Concurrent Object Groups: Theory and practice.",
			"Logic programming approach to automata-based decision procedures.",
			"An extended framework for passive asynchronous testing.",
			"Conflicting accounts of 位-definability.",
			"Editorial comments on the short note by Barry Jay.",
			"Preface for the 27th Nordic Workshop on Programming Theory (NWPT 2015).",
			"Content dependent information flow control.",
			"Join inverse categories and reversible recursion.",
			"Automated specification and verification of Web-based applications.",
			"An experience in using machine learning for short-term predictions in smart transportation systems.",
			"A language-based approach to modelling and analysis of Twitter interactions.",
			"Preface: Special issue on Trends in Concurrency Theory (selected invited contributions from the workshops TRENDS 2014 and 2015).",
			"Some undecidable properties of SOS specifications.",
			"Formal methods for web security.",
			"A survey of symbolic methods for establishing equivalence-based properties in cryptographic protocols.",
			"Solving computational tasks on finite topologies by means of relation algebra and the RelView tool.",
			"From description-logic programs to multi-context systems.",
			"An algebraic approach to multirelations and their properties.",
			"A stochastic interpretation of game logic.",
			"Causal-consistent rollback in a tuple-based language.",
			"Automatic distributed code generation from formal models of asynchronous processes interacting by multiway rendezvous.",
			"From imperative to rule-based graph programs.",
			"Flag-based big-step semantics.",
			"Behavioural semantics for asynchronous components.",
			"Revisiting concurrent separation logic.",
			"Tiling algebra for constraint-based layout editing.",
			"Stateful applied pi calculus: Observational equivalence and labelled bisimilarity.",
			"Algebraic solution of tropical optimization problems via matrix sparsification with application to scheduling.",
			"Guest editors' foreword.",
			"Reversibility in session-based concurrency: A fresh look.",
			"Data-driven adaptation for smart sessions.",
			"Formalization of Habanero phasers using Coq.",
			"Certifying data in multiparty session types.",
			"Kleisli, Parikh and Peleg compositions and liftings for multirelations.",
			"Using relation-algebraic means and tool support for investigating and computing bipartitions.",
			"Formalising privacy policies in social networks.",
			"On detecting over-eager concurrency in asynchronously communicating concurrent object systems.",
			"Relations in linear algebra.",
			"Completeness and incompleteness in nominal Kleene algebra.",
			"Modelling and analysis of normative documents.",
			"Algebraic modal correspondence: Sahlqvist and beyond.",
			"A process algebraic approach to the schedulability analysis and workload abstraction of hierarchical real-time systems.",
			"Functional BIP: Embedding connectors in functional programming languages.",
			"Observational and behavioural equivalences for soft concurrent constraint programming.",
			"A unified rule format for bounded nondeterminism in SOS with terms as labels.",
			"Coalgebraic completeness-via-canonicity for distributive substructural logics.",
			"Exploring nominal cellular automata.",
			"Thresholded semantic framework for a fully integrated fuzzy logic language.",
			"Executing and verifying higher-order functional-imperative programs in Maude."
		]
	},
	{
		"name": "JLAP",
		"year": "2016",
		"info": "2016: Volume 85",
		"count": 66,
		"papers": [
			"Rewriting logic and its applications (extended selected papers from WRLA 2014).",
			"Termination criteria for tree automata completion.",
			"Modeling and analyzing mobile ad hoc networks in Real-Time Maude.",
			"Normal forms and normal theories in conditional rewriting.",
			"Language definitions as rewrite theories.",
			"Foreword to the Special Issue on Formal Methods for Software Product Line Engineering.",
			"Editorial preface for the JLAMP Special Issue on Formal Methods for Software Product Line Engineering.",
			"Variability encoding: From compile-time to load-time variability.",
			"On the weaving process of aspect-oriented product family algebra.",
			"Resource-usage-aware configuration in software product lines.",
			"Product line process theory.",
			"Cost-related interface for software product lines.",
			"Incremental model checking of delta-oriented software product lines.",
			"Cardinality of relations and relational approximation algorithms.",
			"Modelling and analysing variability in product families: Model checking of modal transition systems with variability constraints.",
			"Incremental reasoning on monadic second-order logics with logic programming.",
			"PTL: A model transformation language based on logic programming.",
			"Preface for the special issue on Interaction and Concurrency Experience 2014.",
			"Declarative event based models of concurrency and refinement in psi-calculi.",
			"Contracts as games on event structures.",
			"Relating two automata-based models of orchestration and choreography.",
			"Relational and algebraic methods in computer science.",
			"\"Keep definition, change category\" - A practical approach to state-based system calculi.",
			"Relation lifting, a survey.",
			"A bi-intuitionistic modal logic: Foundations and automation.",
			"An algebraic approach to computations with progress.",
			"Relational lattices: From databases to universal algebra.",
			"Algorithms for Kleene algebra with converse.",
			"Canonical finite models of Kleene algebra with tests.",
			"Developments in concurrent Kleene algebra.",
			"Concurrent Kleene algebra with tests and branching automata.",
			"Automated verification of programs and Web systems.",
			"Implementing type systems for the IDE with Xsemantics.",
			"A descriptive type foundation for RDF Schema.",
			"Debugging Maude programs via runtime assertion checking and trace slicing.",
			"Declarative layout constraints for testing web applications.",
			"Realizable temporal logics for web service choreography.",
			"Ping-pong protocols as prefix grammars: Modelling and verification via program transformation.",
			"Quien sabe por Algebra, sabe scientificamente: A tribute to Jos茅 Nuno Oliveira.",
			"Does this fault lead to failure? Combining refinement and input-output conformance checking in fault-oriented test-case generation.",
			"Factor theory and the unity of opposites.",
			"Product programs and relational program logics.",
			"Diversity and adjudication.",
			"Why mathematics needs engineering.",
			"Formal derivation of Greedy algorithms from relational specifications: A tutorial.",
			"A calculational approach to path-based properties of the Eisenstein-Stern and Stern-Brocot trees via matrix algebra.",
			"Kernels, in a nutshell.",
			"Equational reasoning with lollipops, forks, cups, caps, snakes, and speedometers.",
			"Extended Feature Algebra.",
			"Possible values: Exploring a concept for concurrency.",
			"The evolution of VDM tools from the 1990s to 2015 and the influence of CAMILA.",
			"Gaussian elimination is not optimal, revisited.",
			"An exercise on the generation of many-valued dynamic logics.",
			"Towards patterns for heaps and imperative lambdas.",
			"Continuity as a computational effect.",
			"A divertimento on MonadPlus and nondeterminism.",
			"Dependencies in relational models of databases.",
			"Guest editors' foreword.",
			"Reduction of event structures under history preserving bisimulation.",
			"Input-output conformance testing for software product lines.",
			"Trustworthy variant derivation with translation validation for safety critical product lines.",
			"Abstract categorical semantics for resourceful functional reactive programming.",
			"ST-structures.",
			"Effect-polymorphic behaviour inference for deadlock checking.",
			"Structural congruence for bialgebraic semantics.",
			"LCTD: Test-guided proofs for C programs on LLVM."
		]
	},
	{
		"name": "JLAP",
		"year": "2015",
		"info": "2015: Volume 84",
		"count": 49,
		"papers": [
			"Foreword.",
			"An approach to multicore parallelism using functional programming: A case study based on Presburger Arithmetic.",
			"Verification and code generation for invariant diagrams in Isabelle.",
			"A proof system for adaptable class hierarchies.",
			"A succinct canonical register automaton model.",
			"Integrating deployment architectures and resource consumption in timed object-oriented models.",
			"An optimal resource sharing protocol for generalized multiframe tasks.",
			"Preface.",
			"Programming with algebraic effects and handlers.",
			"Characterizations of semicomputable sets of real numbers.",
			"Full abstraction for non-deterministic and probabilistic extensions of PCF I: The angelic cases.",
			"On topologies defined by irreducible sets.",
			"A framework for computing finite SLD trees.",
			"Models of computation for partial functions on the reals.",
			"A unified framework for differential aggregations in Markovian process algebra.",
			"Monoids with tests and the algebra of possibly non-halting programs.",
			"The structure of finite meadows.",
			"Relational and algebraic methods in computer science.",
			"On the relation between Concurrent Separation Logic and Concurrent Kleene Algebra.",
			"Extended transitive separation logic.",
			"Infinite executions of lazy and strict computations.",
			"Combining relation algebra and data refinement to develop rectangle-based functional programs for reflexive-transitive closures.",
			"Point axioms and related conditions in Dedekind categories.",
			"Deciding Kleene algebra terms equivalence in Coq.",
			"Completeness results for omega-regular algebras.",
			"Multirelational representation theorems for complete idempotent left semirings.",
			"Symmetric Heyting relation algebras with applications to hypergraphs.",
			"An algebra of database preferences.",
			"Editorial for the JLAMP Special Issue on automated specification and verification of web systems.",
			"Minimal type inference for Linked Data consumers.",
			"Executable rewriting logic semantics of Orc and formal analysis of Orc programs.",
			"Lightweight formalization and validation of ORM models.",
			"Symbol different term rewrite systems.",
			"Automated type-based analysis of injective agreement in the presence of compromised principals.",
			"A calculus of quality for robustness against unreliable communication.",
			"Automatic promotional specialization, generalization and analysis of extended feature models with cardinalities in Alloy.",
			"Observationally-induced lower and upper powerspace constructions.",
			"Selected papers on Programming Language Approaches to Concurrency and Communication-cEntric Software (PLACES 2014).",
			"Reversible session-based pi-calculus.",
			"Lightening global types.",
			"Editorial for the Special Issue on Open Problems in Concurrency Theory.",
			"The role of concurrency in an evolutionary view of programming abstractions.",
			"Revisiting sequential composition in process calculi.",
			"Combining behavioural types with security analysis.",
			"Reversibility and asymmetric conflict in event structures.",
			"A behavioural theory for a -calculus with preorders.",
			"Behavioural equivalences for coalgebras with unobservable moves.",
			"A coalgebraic semantics for causality in Petri nets.",
			"Concurrent weighted logic."
		]
	},
	{
		"name": "JLAP",
		"year": "2014",
		"info": "2014: Volume 83",
		"count": 32,
		"papers": [
			"Stuttering for Abstract Probabilistic Automata.",
			"An extended constraint deductive database: Theory and implementation.",
			"Conversion to tail recursion in term rewriting.",
			"SOS rule formats for idempotent terms and idempotent unary operators.",
			"Publisher's Note.",
			"Editor's Note.",
			"Editor's Note.",
			"Preface.",
			"Programming and automating mathematics in the Tarski-Kleene hierarchy.",
			"Computing minimal extending sets by relation-algebraic modeling and development.",
			"Spatial voting games, relation algebra and RelView.",
			"Exploring modal worlds.",
			"Relational style laws and constructs of linear algebra.",
			"Discrete dualities for some algebras with relations.",
			"Inference engine based on closure and join operators over Truth Table Binary Relations.",
			"Multirelations with infinite computations.",
			"Hopscotch - reaching the target hop by hop.",
			"Towards \"mouldable code\" via nested code graph transformation.",
			"Arrow's Theorem for incomplete relations.",
			"A relation-algebraic approach to the \"Hoare logic\" of functional dependencies.",
			"Relations into algebras of probabilistic distributions.",
			"Relational properties of sequential composition of coalgebras.",
			"Gunther Schmidt's life as a mathematician and computer scientist.",
			"On nothing.",
			"Foundations for structuring behavioural specifications.",
			"Algebraic properties of stochastic effectivity functions.",
			"Guest Editor's foreword.",
			"A sound and complete reasoning system for asynchronous communication with shared futures.",
			"Maximizing entropy over Markov processes.",
			"Deadlock checking by data race detection.",
			"Towards the flexible reuse of model transformations: A formal approach based on graph transformation.",
			"Certified CYK parsing of context-free languages."
		]
	},
	{
		"name": "JLAP",
		"year": "2014",
		"info": "2014: Volume 83",
		"count": 32,
		"papers": [
			"Stuttering for Abstract Probabilistic Automata.",
			"An extended constraint deductive database: Theory and implementation.",
			"Conversion to tail recursion in term rewriting.",
			"SOS rule formats for idempotent terms and idempotent unary operators.",
			"Publisher's Note.",
			"Editor's Note.",
			"Editor's Note.",
			"Preface.",
			"Programming and automating mathematics in the Tarski-Kleene hierarchy.",
			"Computing minimal extending sets by relation-algebraic modeling and development.",
			"Spatial voting games, relation algebra and RelView.",
			"Exploring modal worlds.",
			"Relational style laws and constructs of linear algebra.",
			"Discrete dualities for some algebras with relations.",
			"Inference engine based on closure and join operators over Truth Table Binary Relations.",
			"Multirelations with infinite computations.",
			"Hopscotch - reaching the target hop by hop.",
			"Towards \"mouldable code\" via nested code graph transformation.",
			"Arrow's Theorem for incomplete relations.",
			"A relation-algebraic approach to the \"Hoare logic\" of functional dependencies.",
			"Relations into algebras of probabilistic distributions.",
			"Relational properties of sequential composition of coalgebras.",
			"Gunther Schmidt's life as a mathematician and computer scientist.",
			"On nothing.",
			"Foundations for structuring behavioural specifications.",
			"Algebraic properties of stochastic effectivity functions.",
			"Guest Editor's foreword.",
			"A sound and complete reasoning system for asynchronous communication with shared futures.",
			"Maximizing entropy over Markov processes.",
			"Deadlock checking by data race detection.",
			"Towards the flexible reuse of model transformations: A formal approach based on graph transformation.",
			"Certified CYK parsing of context-free languages."
		]
	},
	{
		"name": "JLAP",
		"year": "2013",
		"info": "2013: Volume 82",
		"count": 17,
		"papers": [
			"Syntax and semantics of the compositional interchange format for hybrid systems.",
			"Comparing approaches to free dcpo-algebra constructions.",
			"Rewriting preserving recognizability of finite tree languages.",
			"ITL semantics of composite Petri nets.",
			"Free inductive K-semialgebras.",
			"Computing and visualizing banks sets of dominance relations using relation algebra and RelView.",
			"Processes with infinite liveness requirements.",
			"Guest Editors' Foreword.",
			"Contracts for cross-organizational workflows as timed Dynamic Condition Response Graphs.",
			"Distributed system contract monitoring.",
			"A framework for conflict analysis of normative texts written in controlled natural language.",
			"Special issue on Automated Specification and Verification of Web Systems.",
			"Survey on JavaScript security policies and their enforcement mechanisms in a web browser.",
			"Algorithmic type checking for a pi-calculus with name matching and session types.",
			"Session types for safe Web service orchestration.",
			"Using the words/leafs ratio in the DOM tree for content extraction.",
			"Rewriting-based repairing strategies for XML repositories."
		]
	},
	{
		"name": "JLAP",
		"year": "2012",
		"info": "2012: Volume 81",
		"count": 43,
		"papers": [
			"Preface: Special Issue QFM 2009.",
			"Linking operational semantics and algebraic semantics for a probabilistic timed shared-variable language.",
			"Generating counterexamples for quantitative safety specifications in probabilistic B.",
			"Extended beam search for non-exhaustive state space analysis.",
			"Guest Editors' Foreword.",
			"A trace-based model for multiparty contracts.",
			"Synthesis of secure adaptors.",
			"A centralized and a decentralized method to automatically derive choreography-conforming web service systems.",
			"Guest Editors' Foreword.",
			"Computing strong and weak bisimulations for psi-calculi.",
			"Deriving a Floyd-Hoare logic for non-local jumps from a formul忙-as-types notion of control.",
			"Consistency and refinement for Interval Markov Chains.",
			"Observable behavior of distributed systems: Component reasoning for concurrent objects.",
			"Safe locking for multi-threaded Java with exceptions.",
			"Formal modeling and validation of a power-efficient grouping protocol for WSNs.",
			"Reachability analysis for timed automata using max-plus algebra.",
			"Reverse Universal Resolving Algorithm and inverse driving.",
			"Deadlock checking by a behavioral effect system for lock handling.",
			"Guest Editor's foreword.",
			"Three-valued abstraction for probabilistic systems.",
			"Automated debugging based on a constraint model of the program and a test case.",
			"Modal transition systems with weight intervals.",
			"A formal approach to the specification and transformation of constraints in MDE.",
			"A dynamic deontic logic for complex contracts.",
			"A relational realizability model for higher-order stateful ADTs.",
			"Static Analysis of IMC.",
			"Termination detection for active objects.",
			"Semantics of structured normal logic programs.",
			"On the analysis of compensation correctness.",
			"A versatile concept for the analysis of loops.",
			"Relational and algebraic methods in computer science.",
			"Relation-algebraic modeling and solution of chessboard independence and domination problems.",
			"Typing theorems of omega algebra.",
			"Partiality II: Constructed relation algebras.",
			"Programming from Galois connections.",
			"Left omega algebras and regular equations.",
			"Preface.",
			"Twenty years of rewriting logic.",
			"Rewriting logic bibliography by topic: 1990-2011.",
			"On the Church-Rosser and coherence properties of conditional order-sorted rewrite theories.",
			"Declarative debugging of rewriting logic specifications.",
			"Folding variant narrowing and optimal variant termination.",
			"Rewriting semantics of production rule sets."
		]
	},
	{
		"name": "JLAP",
		"year": "2011",
		"info": "2011: Volume\n80",
		"count": 26,
		"papers": [
			"Guest Editors' Foreword.",
			"On the potential advantages of exploiting behavioural information for contract-based service discovery and composition.",
			"QoS negotiation in service composition.",
			"Validation and verification of Web services choreographies by using timed automata.",
			"Permission to speak: A logic for access control and conformance.",
			"Axiomatizability of representable domain algebras.",
			"Decidability of strong equivalence for subschemas of a class of linear, free, near-liberal program schemas.",
			"A decentralised graphical implementation of mobile ambients.",
			"Guest Editors' Foreword.",
			"Passage retrieval in legal texts.",
			"Contracts for security adaptation.",
			"A contract-based approach to adaptivity.",
			"Building Distributed Controllers for Systems with Priorities.",
			"Relations and Kleene algebras in computer science.",
			"Algebraic separation logic.",
			"Fixpoints for general correctness.",
			"Concurrent Kleene Algebra and its Foundations.",
			"Collagories: Relation-algebraic reasoning for gluing constructions.",
			"Contact, closure, topology, and the linking of row and column types of relations.",
			"Normal forms in total correctness for while programs and action systems.",
			"Timed Mobility in process algebra and Petri nets.",
			"Structural operational semantics through context-dependent behaviour.",
			"On system rollback and totalized fields: An algebraic approach to system change.",
			"Efficiency issues in the kbmag procedure.",
			"Simple feature engineering via neat default retrenchments.",
			"Characterizing minimal semantics-preserving slices of predicate-linear, free, liberal program schemas."
		]
	},
	{
		"name": "JLAP",
		"year": "2010",
		"info": "2010: Volume\n79",
		"count": 49,
		"papers": [
			"Preface.",
			"Continuity and Lipschitz constants for projections.",
			"Similarity, topology, and uniformity.",
			"Computing combinatorial types of trajectories in Pfaffian Dynamics.",
			"On computable presentations of some functional lattices.",
			"Implicit characterizations of FPTIME and NC revisited.",
			"MO2A; unlocking the potential of compositional static average-case analysis.",
			"Problems, solutions, and completions.",
			"On the Wadge reducibility of k-partitions.",
			"Algebraic simulations.",
			"Normal design algebra.",
			"Quasi-boolean encodings and conditionals in algebraic specification.",
			"Axiomatizing the equational theory of regular tree languages.",
			"Stronger compositions for retrenchments.",
			"Relating fair testing and accordance for service replaceability.",
			"A precongruence format for should testing preorder.",
			"The proof monad.",
			"Reversing computation in membrane systems.",
			"Membrane computing and programming.",
			"A quick introduction to membrane computing.",
			"Rule-based and object-based event structures for membrane systems.",
			"Compositional semantics of spiking neural P systems.",
			"Simulating a P system based efficient solution to SAT by using GPUs.",
			"P systems with control nuclei: The concept.",
			"P systems and the Byzantine agreement.",
			"Test generation from P systems using model checking.",
			"Metabolic approximation of real periodical functions.",
			"A P-Lingua based simulator for tissue P systems.",
			"An extensible, maintainable and elegant approach to hardware source code generation in Reconfig-P.",
			"An overview of the K semantic framework.",
			"Guest Editors' Foreword.",
			"Engineering constraint solvers for automatic analysis of probabilistic hybrid automata.",
			"Composing model programs for analysis.",
			"Relational bytecode correlations.",
			"Eager and delayed contract monitoring for call-by-value and call-by-name evaluation.",
			"Termination in higher-order concurrent calculi.",
			"Lazy behavioral subtyping.",
			"Synchronous Kleene algebra.",
			"A formalisation of the copy-modify-merge approach to version control in MDE.",
			"Characterizing and proving operational termination of deterministic conditional term rewriting systems.",
			"Quantitative analysis of weighted transition systems.",
			"Relations and Kleene algebras in computer science.",
			"Boolean logics with relations.",
			"Relation-algebraic specification and solution of special university timetabling problems.",
			"Abstract representation theorems for demonic refinement algebras.",
			"Imperative abstractions for functional actions.",
			"Algebraic notions of nontermination: Omega and divergence in idempotent semirings.",
			"Determinisation of relational substitutions in ordered categories with domain.",
			"Cardinality functions in allegories."
		]
	},
	{
		"name": "JLAP",
		"year": "2009",
		"info": "2009: Volume\n78",
		"count": 41,
		"papers": [
			"Logic programming with solution preferences.",
			"Operational semantics of Framed Tempura.",
			"Luca Aceto, Anna Ing贸lfsd贸ttir, Kim Guldstrand Larsen and Jiri Srba, Reactive Systems: Modelling, Specification and Verification , Cambridge University Press (2007) ISBN 9780521875462.",
			"Guest Editors' Foreword: Selected papers on \"Streams and Algebra\".",
			"A domain-specific language for cryptographic protocols based on streams.",
			"An algebra of hybrid systems.",
			"Testing from a stochastic timed system with a fault model.",
			"Processes with local and global liveness requirements.",
			"Distributed semantics for the pi-calculus based on Petri nets with inhibitor arcs.",
			"Revivals, stuckness and the hierarchy of CSP models.",
			"Preface.",
			"Assisting the design of a groupware system.",
			"A metamodel for the design of polychronous systems.",
			"Improving performance in flexible manufacturing systems.",
			"Search algorithms for automated validation.",
			"Guest Editors' Foreword.",
			"Formal languages and analysis of contract-oriented software.",
			"A brief account of runtime verification.",
			"Provably correct runtime monitoring.",
			"Matching in security-by-contract for mobile code.",
			"A Petri net approach for the design and analysis of Web Services Choreographies.",
			"POETS: Process-oriented event-driven transaction systems.",
			"Schedulability of asynchronous real-time concurrent objects.",
			"A brief history of A-MOST Special Issue containing selected papers from A-MOST 2008.",
			"Formally transforming user-model testing problems into implementer-model testing problems and viceversa.",
			"Automatically testing interactive applications using extended task trees.",
			"On the order of test goals in specification-based testing.",
			"Guest Editors' Foreword.",
			"Behavioral interface description of an object-oriented language with futures and promises.",
			"A Hardware Independent Parallel Programming Model.",
			"Ready to preorder: an algebraic and general proof.",
			"What is a Sorting Function?",
			"Transfinite Semantics in the Form of Greatest Fixpoint.",
			"Securing interaction between threads and the scheduler in the presence of synchronization.",
			"Proof optimization for partial redundancy elimination.",
			"Dependently typed array programs don't go wrong.",
			"Dynamic management of capabilities in a network aware coordination language.",
			"Cryptographically-enforced hierarchical access control with multiple keys.",
			"Dual Systems of Tableaux and Sequents for PLTL.",
			"Completion of Boolean algebras in MSet.",
			"A barred operational semantics for a subset of WS-CDL with time restrictions."
		]
	},
	{
		"name": "JLAP",
		"year": "2008",
		"info": "2008: Volumes\n74, 75, 76, 77, 78",
		"count": 80,
		"papers": [
			"Piecewise initial algebra semantics.",
			"Algebraic models of behaviour and correctness of SMT and CMT processors.",
			"HOTL: Hypotheses and observations testing logic.",
			"Denotational semantics for thread algebra.",
			"Soundness in verification of algebraic specifications with OBJ.",
			"Guest Editors' Foreword.",
			"Automated verification of selected equivalences for security protocols.",
			"A process algebraic view of shared dataspace coordination.",
			"Behavioural equivalences for dynamic Web data.",
			"CCS with priority guards.",
			"Communicating by compatibility.",
			"Tree automata with equality constraints modulo equational theories.",
			"Composition mechanisms for retrenchment.",
			"Relations and Kleene Algebras in Computer Science.",
			"Local variable scoping and Kleene algebra with tests.",
			"Distributive contact lattices: Topological representations.",
			"Algebraic Neighbourhood Logic.",
			"Relational semigroupoids: Abstract relation-algebraic interfaces for finite relations between infinite types.",
			"Using probabilistic Kleene algebra pKA for protocol verification.",
			"Relational measures and integration in preference modeling.",
			"Relational state transition dynamics.",
			"Products in categories of relations.",
			"Preface.",
			"A Hofmann-Mislove theorem for bitopological spaces.",
			"Primitive recursive selection functions for existential assertions over abstract algebras.",
			"Ordering the order of a distributive lattice by itself.",
			"A duality involving Borel spaces.",
			"Cut-free sequent systems for temporal logic.",
			"Soft Linear Set Theory.",
			"On the closure of the diagonal of a T1-space.",
			"A double completion for an arbitrary T0-quasi-metric space.",
			"Canonical completeness of infinitary mu.",
			"Guest Editors' Foreword.",
			"Models and formal verification of multiprocessor system-on-chips.",
			"Comparing disjunctive modal transition systems with an one-selecting variant.",
			"Backwards type analysis of asynchronous method calls.",
			"Cryptographic protocol logic: Satisfaction for (timed) Dolev-Yao cryptography.",
			"Pathway analysis for BioAmbients.",
			"Program and proof optimizations with type systems.",
			"Logic programming with solution preferences.",
			"Operational semantics of Framed Tempura.",
			"Luca Aceto, Anna Ing贸lfsd贸ttir, Kim Guldstrand Larsen and Jiri Srba, Reactive Systems: Modelling, Specification and Verification , Cambridge University Press (2007) ISBN 9780521875462.",
			"Guest Editors' Foreword: Selected papers on \"Streams and Algebra\".",
			"A domain-specific language for cryptographic protocols based on streams.",
			"An algebra of hybrid systems.",
			"Testing from a stochastic timed system with a fault model.",
			"Processes with local and global liveness requirements.",
			"Distributed semantics for the pi-calculus based on Petri nets with inhibitor arcs.",
			"Revivals, stuckness and the hierarchy of CSP models.",
			"Preface.",
			"Assisting the design of a groupware system.",
			"A metamodel for the design of polychronous systems.",
			"Improving performance in flexible manufacturing systems.",
			"Search algorithms for automated validation.",
			"Guest Editors' Foreword.",
			"Formal languages and analysis of contract-oriented software.",
			"A brief account of runtime verification.",
			"Provably correct runtime monitoring.",
			"Matching in security-by-contract for mobile code.",
			"A Petri net approach for the design and analysis of Web Services Choreographies.",
			"POETS: Process-oriented event-driven transaction systems.",
			"Schedulability of asynchronous real-time concurrent objects.",
			"A brief history of A-MOST Special Issue containing selected papers from A-MOST 2008.",
			"Formally transforming user-model testing problems into implementer-model testing problems and viceversa.",
			"Automatically testing interactive applications using extended task trees.",
			"On the order of test goals in specification-based testing.",
			"Guest Editors' Foreword.",
			"Behavioral interface description of an object-oriented language with futures and promises.",
			"A Hardware Independent Parallel Programming Model.",
			"Ready to preorder: an algebraic and general proof.",
			"What is a Sorting Function?",
			"Transfinite Semantics in the Form of Greatest Fixpoint.",
			"Securing interaction between threads and the scheduler in the presence of synchronization.",
			"Proof optimization for partial redundancy elimination.",
			"Dependently typed array programs don't go wrong.",
			"Dynamic management of capabilities in a network aware coordination language.",
			"Cryptographically-enforced hierarchical access control with multiple keys.",
			"Dual Systems of Tableaux and Sequents for PLTL.",
			"Completion of Boolean algebras in MSet.",
			"A barred operational semantics for a subset of WS-CDL with time restrictions."
		]
	},
	{
		"name": "JLAP",
		"year": "2007",
		"info": "2007: Volumes\n70, 71, 72, 73",
		"count": 35,
		"papers": [
			"Guest editor's introduction: Special issue on Web Services and Formal Methods.",
			"Service oriented computing from a process algebraic perspective.",
			"Structural and behavioural compatibility of graphical service specifications.",
			"Formal specification of a Web services protocol.",
			"Reasoning about interaction protocols for customizing web service selection and composition.",
			"A core calculus for correlation in orchestration languages.",
			"A pi-calculus based semantics for WS-BPEL.",
			"Guest Editors' Foreword.",
			"The SL synchronous language, revisited.",
			"Duplication of constants in process algebra.",
			"Preferential choice and coordination conditions.",
			"Performance of pipelined asynchronous systems.",
			"A generalization of ACP using Belnap's logic.",
			"Model checking a cache coherence protocol of a Java DSM implementation.",
			"Universality and semicomputability for nondeterministic programming languages over abstract algebras.",
			"Deaccumulation techniques for improving provability.",
			"An efficient abstract machine for Safe Ambients.",
			"Guest Editors' Foreword.",
			"Non-bisimulation-based Markovian behavioral equivalences.",
			"Behavioral complexity indicators for process algebra: The NKS approach.",
			"A compositional coalgebraic model of fusion calculus.",
			"Resources in process algebra.",
			"Special issue on Programming Language Interference and Dependence.",
			"Typing noninterference for reactive programs.",
			"Characterizing minimal semantics-preserving slices of function-linear, free, liberal program schemas.",
			"Tempus fugit: How to plug it.",
			"A non-standard semantics for program slicing and dependence analysis.",
			"Linearity and bisimulation.",
			"Guest Editors' Foreword.",
			"Denotational semantics of hybrid automata.",
			"A theory for observational fault tolerance.",
			"Propositional dynamic logic with recursive programs.",
			"Reversing algebraic process calculi.",
			"A finite model construction for coalgebraic modal logic.",
			"A logic of reachable patterns in linked data-structures."
		]
	},
	{
		"name": "JLAP",
		"year": "2006",
		"info": "2006: Volumes\n66, 67, 68, 69",
		"count": 27,
		"papers": [
			"Indexed induction-recursion.",
			"Exact real arithmetic using centred intervals and bounded error terms.",
			"Guest editor's introduction: Special issue on Relation Algebra and Kleene Algebra.",
			"Regular algebra applied to language problems.",
			"Relation-algebraic computation of fixed points with applications.",
			"Kleene under a modal demonic star.",
			"Interpretability of first-order linear temporal logics in fork algebras.",
			"Kleene modules and linear languages.",
			"On the complemented disk algebra.",
			"Partiality I: Embedding relation algebras.",
			"Abstract abstract reduction.",
			"Thirty years of algebraic specification.",
			"Constructor-based observational logic.",
			"A formally grounded software specification method.",
			"An institution of modal logics for coalgebras.",
			"Development graphs - Proof management for structured specifications.",
			"Algebraic-coalgebraic specification in CoCasl.",
			"Petri net modules in the transformation-based component framework.",
			"Executable structural operational semantics in Maude.",
			"Guest editors' introduction: Special issue on Process Theory for Hybrid Systems.",
			"Continuity controlled hybrid automata.",
			"Linearization of hybrid processes.",
			"Compositional modeling and refinement for hierarchical hybrid systems.",
			"Syntax and consistent equation semantics of hybrid Chi.",
			"On testing UML statecharts.",
			"Verifying an infinite systolic algorithm using third-order equational methods.",
			"Tree regular model checking: A simulation-based approach."
		]
	},
	{
		"name": "JLAP",
		"year": "2005",
		"info": "2005: Volumes\n62, 63, 64, 65",
		"count": 35,
		"papers": [
			"Generating two-terminal directed acyclic graphs with a given complexity index by constraint logic programming.",
			"Agenda control for heterogeneous reasoners.",
			"Computable total functions on metric algebras, universal algebraic specifications and dynamical systems.",
			"De Bruijn's syntax and reductional behaviour of lambda-terms: the untyped case.",
			"The converse of a stochastic relation.",
			"De Bruijn's syntax and reductional behaviour of lambda-terms: the typed case.",
			"Hybrid process algebra.",
			"Network algebra in Java.",
			"Guest editors' introduction: Special issue on The pi-calculus.",
			"The security pi-calculus and non-interference.",
			"Analysing input/output-capabilities of mobile processes with a generic type system.",
			"Abstract interpretation of mobile systems.",
			"A hierarchy of equivalences for asynchronous calculi.",
			"Guest editors' introduction: Special issue on Process Algebra and System Architecture.",
			"An \"abstract process\" approach to algebraic dynamic architecture description.",
			"A framework for specifying and verifying the behaviour of open systems.",
			"Encapsulation and behavioral inheritance in a synchronous model of computation for embedded system services adaptation.",
			"An object based algebra for specifying a fault tolerant software architecture.",
			"Guest editors' introduction: Special issue on practical development of exact real number computation.",
			"The constructive reals as a Java library.",
			"Arbitrary precision real arithmetic: design and algorithms.",
			"Efficient exact computation of iterated maps.",
			"Real number computation with committed choice logic programming languages.",
			"Recent progress in exact geometric computation.",
			"Precise numerical computation.",
			"Taylor models and floating-point arithmetic: proof that arithmetic operations are validated in COSY.",
			"Guest editor's introduction: Special issue on Modelling and Verification of Cryptographic Protocols.",
			"Unifying simulatability definitions in cryptographic systems under different timing assumptions.",
			"Contract signing, optimism, and advantage.",
			"Abstraction and resolution modulo AC: How to verify Diffie-Hellman-like protocols automatically.",
			"Verifying security protocols with PVS: widening the rank function approach.",
			"A static analysis of cryptographic processes: the denotational approach.",
			"A symbolic decision procedure for cryptographic protocols with time stamps.",
			"Computable scalar fields: A basis for PDE software.",
			"Analyzing a chi model of a turntable system using Spin, CADP and Uppaal."
		]
	},
	{
		"name": "JLAP",
		"year": "2004",
		"info": "2004: Volumes\n58, 59, 60-61",
		"count": 21,
		"papers": [
			"Guest editors' introduction: Special issue on Formal Methods for Smart Cards.",
			"Operational semantics of the Java Card Virtual Machine.",
			"Verified bytecode verification and type-certifying compilation.",
			"Weakest pre-condition reasoning for Java programs with JML annotations.",
			"The KRAKATOA tool for certificationof JAVA/JAVACARD programs annotated in JML.",
			"Source code verification of a secure payment applet.",
			"Guest editor's introduction: Special issue on Annotated Terms (ATerms).",
			"GC2: a generational conservative garbage collector for the ATImage library.",
			"Generation of abstract programming interfaces from syntax definitions.",
			"Manipulating algebraic specifications with term-based and graph-based representations.",
			"Guesteditors'introduction: Special issue on Structural Operational Semantics.",
			"The origins of structural operational semantics.",
			"A structural approach to operational semantics.",
			"Evolution of rule-based programs.",
			"Modular structural operational semantics.",
			"The meaning of negative premises in transition system specifications II.",
			"Adding recursive constructs to bialgebraic semantics.",
			"Sequent calculi for process verification: Hennessy-Milner logic for an arbitrary GSOS.",
			"Axiomatizing GSOS with termination.",
			"Rule formats for compositional non-interference properties.",
			"Process languages with discrete relative time based on the Ordered SOS format and rooted eager bisimulation."
		]
	},
	{
		"name": "JLAP",
		"year": "2003",
		"info": "2003: Volumes\n54, 55, 56, 57",
		"count": 15,
		"papers": [
			"Typed generic traversal with term rewriting strategies.",
			"Revisiting the notion of function.",
			"Revisiting timing in process algebra.",
			"An alternative formulation of operational conservativity with binding terms.",
			"Analysis of a distributed system for lifting trucks.",
			"Algebraic theory of probabilistic and nondeterministic processes.",
			"Guest editors' introduction: Special issue on Probabilistic Techniques for the Design and Analysis of Systems.",
			"Verification of the Miller-Rabin probabilistic primality test.",
			"On the use of MTBDDs for performability analysis and verification of stochastic systems.",
			"Model-checking large structured Markov chains.",
			"Continuous stochastic logic characterizes bisimulation of continuous-time Markov processes.",
			"Algebraic theory of probabilistic processes.",
			"Binary decision diagrams for first-order predicate logic.",
			"Inheritance in the join calculus.",
			"Algebraic models of correctness for abstract pipelines."
		]
	},
	{
		"name": "JLAP",
		"year": "2002",
		"info": "2002: Volumes\n50, 51, 52-53",
		"count": 17,
		"papers": [
			"Preface.",
			"A hidden Herbrand theorem: combining the object and logic paradigms.",
			"Modular semantics for a UML statechart diagrams kernel and its extension to multicharts and branching time model-checking.",
			"A performance-based methodology to early evaluate the effectiveness of mobile software architectures.",
			"Recursive tables and effective definition schemes.",
			"Program algebra for sequential code.",
			"Program algebra with unit instruction operators.",
			"Combining programs and state machines.",
			"Molecular dynamics.",
			"Guest editors' introduction: Model checking in a nutshell.",
			"Is your model checker on time? On the complexity of model checking for timed modal logics.",
			"Symbolic model checking of timed guarded commands using difference decision diagrams.",
			"Positive loop-closed automata: a decidable class of hybrid systems.",
			"Iterating transducers.",
			"Syntax-directed model checking of sequential programs.",
			"Automated verification of an audio-control protocol using UPPAAL.",
			"Linear parametric model checking of timed automata."
		]
	},
	{
		"name": "JLAP",
		"year": "2001",
		"info": "2001: Volumes\n47, 48, 49",
		"count": 9,
		"papers": [
			"A sharp threshold for the phase transition of a restricted Satisfiability problem for Horn clauses.",
			"Variable binding operators in transition system specifications.",
			"Inheritance of behavior.",
			"Real time process algebra with time-dependent conditions.",
			"Linearization in parallel pCRL.",
			"Formalizing non-termination of recursive programs.",
			"Algebraic proofs of cut elimination.",
			"Focus points and convergent process operators: a proof strategy for protocol verification.",
			"A rewriting approach to binary decision diagrams."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "2000",
		"info": "2000: Volumes\n42, 43, 44, 45, 46",
		"count": 36,
		"papers": [
			"Operational and Goal-Independent Denotational Semantics for Prolog with Cut.",
			"Defeasible Logic versus Logic Programming without Negation as Failure.",
			"Ultrametric Spaces and Logic Programming.",
			"Subset Logic Programs and Their Implementation.",
			"An Algebraic Approach to Sharing Analysis of Logic Programs.",
			"Compositionality of Normal Open Logic Programs.",
			"Demand Transformation Analysis for Concurrent Constraint Programs.",
			"Abstract Domains for Reordering CLP(RLin) Programs.",
			"Guest Editor's Introduction: Logic-based Heterogeneous Information Systems.",
			"Using MedLan to Integrate Geographical Data.",
			"A Logical Approach to Cooperative Information Systems.",
			"Recursive Query Plans for Data Integration.",
			"Expressive Capabilities Description Languages and Query Rewriting Algorithms.",
			"Interprocedural Analyses: A Comparison.",
			"Tracing Prolog Programs by Source Instrumentation is Efficient Enough.",
			"Or-Parallel Prolog on a Distributed Memory Architecture.",
			"Hybrid Probabilistic Programs.",
			"Improving Program Analyses, by Structure Untupling.",
			"Erratum to: \"Conjunctive Partial Deduction: Foundations, Control, Algorithms and Experiments\".",
			"Special issue: abductive logic programming.",
			"Abducing through negation as failure: stable models within the independent choice logic.",
			"Conditional reasoning in logic programming.",
			"Abductive logic programming and disjunctive logic programming: their relationship and transferability.",
			"An abductive approach to disjunctive logic programming.",
			"ACLP: Abductive Constraint Logic Programming.",
			"Computing abduction by using TMS with top-down expectation.",
			"An abductive event calculus planner.",
			"An abstract machine for efficiently computing queries to well-founded models.",
			"Dynamic updates of non-monotonic knowledge bases.",
			"Introduction to the constraint language NCL.",
			"Argumentation-based abduction in disjunctive logic programming.",
			"A simple polynomial groundness analysis for logic programs.",
			"Meta-agent programs.",
			"More on tractable disjunctive Datalog.",
			"Decidability of logic program semantics and applications to testing.",
			"Pair-sharing over rational trees."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1999",
		"info": "1999: Volumes\n38, 39, 40, 41",
		"count": 41,
		"papers": [
			"Return Value Placement and Tail Call Optimization in High Level Languages.",
			"Efficient Access Mechanisms for Tabled Logic Programs.",
			"Set Constructors, Finite Sets, and Logical Semantics.",
			"Stable Inference as Intuitionistic Validity.",
			"Reasoning on Constraints in CLP(FD).",
			"A General Modal Framework for the Event Calculus and Its Skeptical and Credulous Variants.",
			"Automatic Compile-Time Parallelization of Logic Programs for Restricted, Goal Level, Independent and Parallelism.",
			"Extremal Problems in Logic Programming and Stable Model Computation.",
			"Termination of Well-Moded Programs.",
			"Steadfast Logic Programs.",
			"Constructive Negation Under the Well-Founded Semantics.",
			"LogiMOO: An Extensible Multi-user Virtual World with Natural Language Control.",
			"Efficient Goal Directed Bottom-Up Evaluation of Logic Programs.",
			"Sharing is Optimal.",
			"Automated Verification of Prolog Programs.",
			"Abstract Diagnosis.",
			"Termination of Logic Programs with Delay Declarations.",
			"Verification of Logic Programs.",
			"Opium: An Extendable Trace Analyzer for Prolog.",
			"Layered Modes.",
			"Semantics of (disjunctive) Logic Programs Based on Partial Evaluation.",
			"An Approach to Declarative Programming Based on a Rewriting Logic.",
			"An Algebraic Framework for the Definition of Compositional Semantics of Normal Logic Programs.",
			"Guest Editors' Introduction: Inductive Logic Programming.",
			"Generalization by Absorption of Definite Clauses.",
			"Induction of Logic Programs by Example-Guided Unfolding.",
			"Numerical Reasoning with an ILP System Capable of Lazy Evaluation and Customised Search.",
			"A Study of Relevance for Learning in Deductive Databases.",
			"Optimizing General Chain Programs.",
			"The Complexity of Revising Logic Programs.",
			"Stable Generated Models, Partial Temporal Logic and Disjunctive Defaults.",
			"A Declarative Semantics for Depth-First Logic Programs.",
			"A Pragmatic Reconstruction of lambda-Prolog.",
			"A Semantic Basis for the Termination Analysis of Logic Programs.",
			"Worst-Case Groundness Analysis Using Positive Boolean Functions.",
			"On the Floyd-Warshall Algorithm for Logic Programs.",
			"Guest Editors' Introduction Special Issue: Synthesis, Transformation and Analysis of Logic Rrograms 2.",
			"Inductive Synthesis of Recursive Logic Programs: Achievements and Prospects.",
			"Synthesis and Transformation of Logic Programs Using Unfold/Fold Proofs.",
			"Conjunctive Partial Deduction: Foundations, Control, Algorithms, and Experiments.",
			"Abstract Multiple Specialization and Its Application to Program Parallelization."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1998",
		"info": "1998: Volumes\n34, 35, 36, 37",
		"count": 33,
		"papers": [
			"Transformational Methodology for Proving Termination of Logic Programs.",
			"A New Term Representation Method for Prolog.",
			"The Horn Basis of a Set of Clauses.",
			"Tabulated Resolution for the Well-Founded Semantics.",
			"SLDNFA: An Abductive Procedure for Abductive Logic Programs.",
			"Abstract Metaprolog Engine.",
			"Completeness and Properness of Refinement Operators in Inductive Logic Programming.",
			"SLR Inference an Inference System for Fixed-Mode Logic Programs Based on SLR Parsing.",
			"Differential Methods in Logic Program Analysis.",
			"Negation as Failure in the Head.",
			"Datalog with Non-Deterministic Choice Computers NDB-PTIME.",
			"Data-Parallel Concurrent Constraint Programming.",
			"A Logical Foundation for Logic Programming I: Biconsequence Relations and Nonmonotonic Completion.",
			"A Logical Foundation for Logic Programming II: Semantics of General Logic Programs.",
			"Expanding Queries to Incomplete Databases by Interpolating General Logic Programs.",
			"Deductive Query Languages for Recursively Typed Complex Objects.",
			"Datalog with Integer Periodicity Constraints.",
			"Polymorphic Type Analysis in Logic Programs by Abstract Intepretation.",
			"Subsumption-Stratified Datalog.",
			"Combining Negation as Failure and Embedded Implications in Logic Programs.",
			"Creating Specialised Integrity Checks Through Partial Evaluation of Meta-Interpreters.",
			"LogicWeb: Enhancing the Web with Logic Programming.",
			"The Theoretical Foundations of LPTP (A Logic Program Theorem Prover).",
			"Relationlog: A Typed Extension to Datalog with Sets and Tuples.",
			"The Semantics of Constraint Logic Programs.",
			"A Framework to Incorporate Non-Monotonic Reasoning Into Constraint Logic Programming.",
			"CLP(chi) for Automatically Proving Program Properties.",
			"Theory and Practice of Constraint Handling Rules.",
			"Design, Implementation, and Evaluation of the Constraint Language cc(FD).",
			"Dynamic Optimization of Interval Narrowing Algorithms.",
			"Experiments in Reactive Constraint Logic Programming.",
			"Automated Reasoning with a Constraint-Based Metainterpreter.",
			"Mechanising Shared Configuration and Diagnosis Theories Through Constraint Logic Programming."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1997",
		"info": "1997: Volumes\n30, 31, 32, 33",
		"count": 39,
		"papers": [
			"From Context-Free to Definite-Clause Grammars: A Type-Theoretic Approach.",
			"Parallel Execution of Logic Programs by Load Sharing.",
			"A Confluent Semantic Basis for the Analysis of Concurrent Constraint Logic Programs.",
			"Embedding Revision Programs in Logic Programming Situation Calculus.",
			"Order Sorted Feature Theory Unification.",
			"Update by Means of Inference Rules.",
			"On Delphi Lemmas and other Memoing Techniques for Deterministic Logic Programs.",
			"Stable Models Are Generated by a Stabel Chain.",
			"Incremental Algorithms for Optimizing Model Computation Based on Partial Instantiation.",
			"On Integrating Objects and Relations Using Multimethods.",
			"Magic Sets with Full Sharing.",
			"The Relationship Between Logic Programs and Specifications - The Subset Example Revisited.",
			"On the Relation Between Situation Calculus and Event Calculus.",
			"Reconciling the Event Calculus With the Situation Calculus.",
			"GOLOG: A Logic Programming Language for Dynamic Domains.",
			"Reasoning About Effects of Concurrent Actions.",
			"Explicit and Implicit Indeterminism: Reasoning About Uncertain and Contradictory Specifications of Dynamic Systems.",
			"A Simple Declarative Language for Describing Narratives With Actions.",
			"Representing Actions: Laws, Observations and Hypotheses.",
			"Representing Actions in Logic Programs and Default Theories: A Situation Calculus Approach.",
			"Rules as Actions: A Situation Calculus Semantics for Logic Programs.",
			"Applying Interval Arithmetic to Real, Integer, and Boolean Constraints.",
			"A Simple Approach to Supporting Untagged Objects in Dynamically Typed Languages.",
			"Model Generation and State Generation for Disjunctive Logic Programs.",
			"Algebraic and Logical Semantics for CLP Languages with Dynamic Scheduling.",
			"Constructive Negation by Pruning.",
			"A Logical Semantics for Hypothetical Rulebases with Deletion.",
			"Well-Founded Ordered Search: Goal-Directed Bottom-Up Evaluation of Well-Founded Models.",
			"Characterizations of the Disjunctive Stable Semantics by Partial Evaluation.",
			"Partial Deduction in Disjunctive Logic Programming.",
			"Exploiting Goal Independence in the Analysis of Logic Programs.",
			"Intuitionistic Deductive Databases and the Polynomial Time Hierarchy.",
			"A Parallel Prolog System for Distributed Memory.",
			"A Platform for Restriction Mapping.",
			"Logic and Algebraic Languages for Interoperability in Multidatabase Systems.",
			"The Iff Proof Procedure for Abductive Logic Programming.",
			"Expressiveness of Stable Model Semantics for Disjuncitve Logic Programs with Functions.",
			"Directional Types and the Annotation Method.",
			"Meta-Programming in CLP(R)."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1996",
		"info": "1996: Volumes\n26, 27, 28, 29",
		"count": 41,
		"papers": [
			"Optimizing Bottom-Up Evaluation of Constraint Queries.",
			"Extending Negation As Failure by Abduction: A Three-Valued Stable Model Semantics.",
			"On Termination of General Logic Programs w.r.t. Constructive Negation.",
			"Guest Editor's Introduction Special Issue: Applications of Logic Programming.",
			"Computer Support for Protocol-Based Treatment of Cancer.",
			"The NRL Protocol Analyzer: An Overview.",
			"Prolog for Structured Character Description and Font Design.",
			"A Tool for Developing Interactive Configuration Applications.",
			"Intelligent Data Retrieval in Prolog: An Illuminating Idea.",
			"Using Logic Programming and Coroutining for Electronic CAD.",
			"Constraint Logic Programming for Examination Timetabling.",
			"Characterizing Logic Grammars: A Substructural Logic Approach.",
			"Nondeterminism Through Well-Founded Choice.",
			"In Memoriam: Paris C. Kanellakis.",
			"Stable Models and Their Computation for Logic Programming with Inheritance and True Negation.",
			"Cuts and Side-Effects in And-Or Parallel Prolog.",
			"Matching of Bounded Set Terms in the Logic Language LDL++.",
			"Completeness of SLDNF-Resolution for Nonfloundering Queries.",
			"A Fixpoint Characterization of Abductive Logic Programs.",
			"Optimal Groundness Analysis Using Propositional Logic.",
			"Extending Prolog with Nonmonotonic Reasoning.",
			"Compiling Constraints in clp(FD).",
			"Smallest Horn Clause Programs.",
			"A Language for Programming in Logic with Finite Sets.",
			"Amalgamating Knowledge Bases, III: Algorithms, Data Structures, and Query Processing.",
			"Automatic Finite Unfolding Using Well-Founded Measures.",
			"A Closer Look at Declarative Interpretations.",
			"On the Design of a Correct Freeness Analysis for Logic Programs.",
			"A Note on Semantics of Logic Programs with Equality Based on Complete Sets of E-Unifiers.",
			"Polyvariant Detection of Uninitialized Arguments of Prolog Predicates.",
			"Logic Programming as a Basis for Lean Automated Deduction.",
			"Guest Editors' Introduction: High-Performance Implementations of Logic Programming Systems.",
			"Parma - Bridging the Performance GAP Between Imperative and Logic Programming.",
			"The Execution Algorithm of Mercury, an Efficient Purely Declarative Logic Programming Language.",
			"Partial Translation: Towards a Portable and Efficient Prolog Implementation Technology.",
			"The Vienna Abstract Machine.",
			"Design and Analysis of Hardware for High-Performance Prolog.",
			"Experience with the Super Monaco Optimizing Compiler.",
			"Detection and Optimization of Suspension-Free Logic Programs.",
			"Multilog and Data or-Parallelism.",
			"Overview of Daswam: Exploitation of Dependent and-Parallelism."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1995",
		"info": "1995: Volumes\n22, 23, 24, 25",
		"count": 32,
		"papers": [
			"Strict and Nonstrict Independent And-Parallelism in Logic Programs: Correctness, Efficiency, and Compile-Time Conditions.",
			"Why Untyped Nonground Metaprogramming Is Not (Much Of) A Problem.",
			"Autoepistemic Logics as a Unifying Framework for the Semantics of Logic Programs.",
			"An Argumentation-Theoretic Foundations for Logic Programming.",
			"Type Analysis of Prolog Using Type Graphs.",
			"On the Equivalence of Semantics for Normal Logic Programs.",
			"Analyses of Unsatisfiability for Equational Logic Programming.",
			"A Language for Updating Logic Programs and its Implementation.",
			"Negation and Minimality in Disjunctive Databases.",
			"Guest Editors' Introduction: Special Section: Ten Years of Logic Programming.",
			"The Deevolution of Concurrent Logic Programming Languages.",
			"A survey of deductive database systems.",
			"Automata-Driven Indexing of Prolog Clauses.",
			"On Decompositions of Chain Datalog Programs into P (left-)linear 1-rule Components.",
			"Evaluation of the Domain Prop.",
			"Special Issue: Computational Linguistics and Logic Programming.",
			"Principles and Implementation of Deductive Parsing.",
			"A Complete Axiomatization of a Theory with Feature and Arity Constraints.",
			"String Variable Grammar: A Logic Grammar Formalism for the Biological Language of DNA.",
			"Unified Logic Programming Approach to the Abduction of Plans and Intentions in Information-Seeking Dialogues.",
			"On the Use of Advanced Logic Programming Languages in Computational Linguistics.",
			"Efficient Top-Down Computation of Queries under the Well-Founded Semantics.",
			"On the Correctness of Unfold/Fold Transformation of Normal and Extended Logic Programs.",
			"Analysis of Residuating Logic Programs.",
			"Depth-Bounded Bottom-Up Evaluation of Logic Program.",
			"Bottom-Up Compuation of Perfect Models for Disjunctive Theories.",
			"On Specifying Database Updates.",
			"SLDR-Resolution: Parallelizing Structural Recursion in Logic Programs.",
			"Scoping Constructs in Logic Programming: Implementation Problems and their Solutions.",
			"Undecidable Boundedness Problems for Datalog Programs.",
			"Generalized Semantics and Abstract Interpretation for Constraint Logic Programs.",
			"Analyzing Logic Programs Using \"PROP\"-ositional Logic Programs and a Magic Wand."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1994",
		"info": "1994: Volumes\n18, 19/20, 21",
		"count": 32,
		"papers": [
			"Partial Deduction of Updateable Definite Logic Programs.",
			"On Negation in HiLog.",
			"Hierarchical Representation of Legal Knowledge with Metaprogramming in Logic.",
			"On the Relationship between Indexed Grammars and Logic Programs.",
			"Correctness of Unification Without Occur Check in Prolog.",
			"Run-Time Type Computations in the Warren Abstract Machine.",
			"Abstract Interpretation of Logic Programs using Magic Transformations.",
			"A New Definition of SNDNF-Resolution.",
			"Hypothetical Reasoning in Logic Programs.",
			"Records for Logic Programming.",
			"Guest Editor's Introduction.",
			"Introduction: 10th Birthday Special Issue of The Journal of Logic Programming.",
			"Logic Programming and Negation: A Survey.",
			"Logic Programming and Knowledge Representation.",
			"The s-Semantics Approach: Theory and Applications.",
			"Termination of Logic Programs: The Never-Ending Story.",
			"Transformation of Logic Programs: Foundations and Techniques.",
			"Logic Program Synthesis.",
			"Logic Programming Environments: Dynamic Program Analysis and Debugging.",
			"1983-1993: The Wonder Years of Sequential Prolog Implementation.",
			"Modularity in Logic Programming.",
			"Constraint Logic Programming: A Survey.",
			"The Integration of Functions into Logic Programming: From Theory to Practice.",
			"Inductive Logic Programming: Theory and Methods.",
			"Natural Language Processing and Logic Programming.",
			"A Methodology for Provin Termination of Logic Programs.",
			"A Semantics for a Class of Stratified Production System Programs.",
			"Structuring Logic Programs: A Modal Approach.",
			"Equivalence of Well-Founded and Stable Semantics.",
			"Metric Methods Three Examples and a Theorem.",
			"The Stable Models of a Predicate Logic Program.",
			"On the Power of Rule-Based Query Languages for Nested Data Models."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1993",
		"info": "1993: Volumes\n15, 16, 17",
		"count": 39,
		"papers": [
			"Abstract Interpretation based on OLDT Resolution.",
			"Abstract Interpretation Based on Alexander Templates.",
			"The Defining Power of Stratified and Hierarchical Logic Programs.",
			"Strong Termination of Logic Programs.",
			"A Simple Test Improves Checking Satisfiability.",
			"A Temporal Extension of Prolog.",
			"Loop Checking and Negation.",
			"Solving the incremental satisfiability problem.",
			"HILOG: A Foundation for Higher-Order Logic Programming.",
			"Equivalence of DATALOG Queries is Undecidable.",
			"Tight, Consistent and Computable Completions for Unrestricted Logic Programs.",
			"Global Optimizations in a Prolog Compiler for the TOAM.",
			"Distributed Logic Programming.",
			"A Completeness Result for SLDNF-Resolution.",
			"Guest Editor's Introduction.",
			"Unfold/Fold Transformation of General Logic Programs for the Well-Founded Semantics.",
			"Loop checking in partial deduction.",
			"Basic Transformation Operations which Preserve Computed Answer Substitutions of Logic Programs.",
			"Partial Deduction for Structured Logic Programming.",
			"The Loop Absorption and the Generalization Strategies for the Development of Logic Programs and Partial Deduction.",
			"Towards a Methodology for the Design of Abstract Machines for Logic Programming Languages.",
			"Towards a Meaning of LIFE.",
			"An Algorithm for Linear Constraint Solving: Its Incorporation in a Prolog Meta-Interpreter for CLP.",
			"Interval Computation as Deduction in CHIP.",
			"Hierarchical Constraint Logic Programming.",
			"Generalized Constraint Propagation over the CLP Scheme.",
			"Pushing Constraint Selections.",
			"Success and Failure for Hereditary Harrop Formulae.",
			"Lower Bounds for the Lengths of Refutations.",
			"And-Or Parallelism on Shared-Memory Multiprocessors.",
			"An Overview of Nonmonotonic Reasoning and Logic Programming.",
			"A Survey of Complexity Results for Nonmonotonic Logics.",
			"Commonsense Axiomatizations for Logic Programs.",
			"The Family of Stable Models.",
			"Non-Monotonic Reasoning with Logic Programming.",
			"Proof Method of Partial Correctness and Weak Completeness for Normal Logic Programs.",
			"A Goal-Oriented Approach to Computing the Well-Founded Semantics.",
			"Representing Action and Change by Logic Programs.",
			"Circumscribing Embedded Implications (without Stratifications)."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1992",
		"info": "1992: Volumes\n12, 13, 14",
		"count": 44,
		"papers": [
			"A Linear Axiomatization of Negation as Failure.",
			"A Comparison of Three Prolog Extensions.",
			"Feature-Constraint Logics for Unification Grammars.",
			"Compilation of Set Terms in the Logic Data Language (LDL).",
			"Database Updates in the Event Calculus.",
			"A Calculus for the Construction of Modular Prolog Programs.",
			"The Expressive Power of Side Effects in Prolog.",
			"Introduction - ALP 1988.",
			"Logic Programming with Functions and Predicates: The Language BABEL.",
			"Boolean Valued Models and Incomplete Specifications.",
			"Nondeterministic Algebraic Specifications and Nonconfluent Term Rewriting.",
			"Programming with Equalitiers, Subsorts, Overloading and Parametrization in OBJ.",
			"Rewrite Rule Systems for Modal Propositional Logic.",
			"Implementation of Subset-Equational Programs.",
			"Logic-Programming Specification and Execution of Dynamic-Programming Problems.",
			"Theory of Generalized Annotated Logic Programming and its Applications.",
			"Parallel Evaluation of Datalog Programs by Load Sharing.",
			"A Prodedural Semantics for Well-Founded Negation in Logic Programs.",
			"Deterministic and Nondeterministic Computation and Horn Programs, on Abstract Data Types.",
			"A Simple Code Improvement Scheme for Prolog.",
			"Short Note: Procedural Semantics and Negative Information of Elementary Formal System.",
			"Guest Editor's Introduction.",
			"Abstract Interpretation and Application to Logic Programs.",
			"Bottom-Up Dataflow Analysis of Normal Logic Programs.",
			"Deriving Descriptions of Possible Values of Program Variables by Means of Abstract Interpretation.",
			"Multiple Specialization using Minimal-Function Graph Semantics.",
			"Static Analysis of Logic Programs for Independent And-Parallelism.",
			"Compile-Time Derivation of Variable Dependency Using Abstract Interpretation.",
			"Global Flow Analysis as a Practical Compilation Tool.",
			"A Verified Prolog Compiler for the Warren Abstract Machine.",
			"Towards a Unified Theory of Intensional Logic Programming.",
			"Proving Termination Properties of Prolog Programs: A Semantic Approach.",
			"Efficient Run-Time Type Checking of Typed Logic Programs.",
			"The Term Rewriting Approach to Automated Theorem Proving.",
			"Parallel Bottom-Up Processing of Datalog Queries.",
			"What Should a Database Know?",
			"On Rewrite Programs: Semantics and Relationship with Prolog.",
			"Short Note: On Van Gelder's Loop Detection Algorithm.",
			"Short Note: Van Gelder's Response.",
			"An Extended Warren Abstract Machine for the Execution of Structured Logic Programs.",
			"Commutativity and its Role in the Processing of Linear Recursion.",
			"Narrowing Grammar: Theory, Implementation, and Applications.",
			"A Prescribed Cut for Prolog that Ensures Soundness.",
			"Short Note: Preferred Extensions are Partial Stable Models."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1991",
		"info": "1991: Volumes\n10, 11",
		"count": 28,
		"papers": [
			"Definite-Clause Set Grammars: A Formalism for Problem Solving.",
			"Unsolvable Problems for SLDNF Resolution.",
			"Enhancing Unification in Prolog through Clause Indexing.",
			"A Declarative State Transition System.",
			"On-Line Algorithms for Polynomially Solvable Satisfiability Problems.",
			"A Practical Framework for the Abstract Interpretation of Logic Programs.",
			"A Type System for Logic Programs.",
			"AND-Parallel Execution of Logic Programs on a Shared-Memory Multiprocessor.",
			"Database Logic Programming.",
			"Set Constructors in a Logic Database Language.",
			"A Simple Characterization of Uniform Boundedness for a Class of Recursions.",
			"On the Power of Magic.",
			"Efficient Evaluation for a Subset of Recursive Queries.",
			"Comparison of Methods for Logic-Query Implementation.",
			"Automated Theorem Proving and Logic Programming.",
			"The Reduce-Or Process Model for Parallel Execution of Logic Programs.",
			"Comments on \"Logic-Programming with Equations\".",
			"Bilattices and the Semantics of Logic Programming.",
			"A Linear Control Algorithm for a Class of Rule-Based Systems.",
			"Memory- and Buffer-Referencing Characteristics of a WAM-Based Prolog.",
			"On Derived Dependencies and Connected Databases.",
			"Magic Templates: A Spellbinding Approach To Logic Programs.",
			"Partial Evaluation in Logic Programming.",
			"Constraint Logic Programming for Reasoning About Discrete Event Processes.",
			"Negative Subgoals with Free Variables.",
			"Efficient Bottom-UP Computation of Queries on Stratified Databases.",
			"Decomposability and its Role in Parallel Logic Program Evaluation.",
			"Correct Answers to Allowed Programs and Queries are Ground."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1990",
		"info": "1990: Volumes\n8, 9",
		"count": 28,
		"papers": [
			"Guest Editor's Introduction.",
			"AUNT: A Universal Netlist Translator.",
			"PYTHON: An Expert Squeezer.",
			"Modeling Simultaneous Events with Default Reasoning and Tight Derivations.",
			"Logic-Based Configuration with a Semantic Network.",
			"Solving Large Combinatorial Problems in Logic Programming.",
			"Mockingbird: A Logical Methodology for Testing.",
			"Logic Programming for Real-Time Control of Telecommunication Switching Systems.",
			"An Expert System for Harmonizing Chorales in the Style of J. S. Bach.",
			"Equivalent Logic Programs.",
			"A Transformational Approach to Negation in Logic Programming.",
			"Annotations on the Consistency of the Closed World Assumption.",
			"An Abstract Machine to Implement OR-AND Parallel Prolog Efficiently.",
			"A Note on Dowling and Gallier's Top-Down Algorithm for Propositional Horn Satisfiability.",
			"Absys: The First Logic Programming Language - A Retrospective and a Commentary.",
			"Minimal Consequence in Sentential Logic.",
			"Completed Logic Programs and their Consistency.",
			"A Fixpoint Semantics for Disjunctive Logic Programs.",
			"Inference Rules and Proof Procedures for Inequations.",
			"Representing Knowledge with Theories about Theories.",
			"Editorial.",
			"Problem Specification and Program Synthesis in the System SPORA.",
			"Efficient Program Synthesis in Computational Models.",
			"Propositional Logic Programming and Priz System.",
			"Deductive Synthesis of Solutions for Technological Tasks.",
			"Models of Inductive Synthesis.",
			"Machine Synthesis of Mathematical Theorems.",
			"Refutation Search for Horn Sets by a Subgoal-Extraction Method."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1989",
		"info": "1989: Volumes\n6, 7",
		"count": 22,
		"papers": [
			"Preface to the Special Issue - Papers Presented at the Third Symposium on Logic Programming.",
			"Extending SLD Resolution to Equational Horn Clauses using E-Unification.",
			"Prolog: Subsumption of Equality Axioms by the Homogeneous Form.",
			"An Implementation of Narrowing.",
			"A Logical Analysis of Modules in Logic Programming.",
			"Negation as Failure using Tight Derivations for General Logic Programs.",
			"Compiling Control.",
			"Metainterpreters for Expert System Construction.",
			"A High-Performance Low Risc Machine for Logic Programming.",
			"Term Matching on Parallel Computers.",
			"Some Results on the Complexity of Exploiting Data Dependency in Parallel Logic Programs.",
			"Or-Parallel Prolog in Flat Concurrent Prolog.",
			"A Computable Semantics for General Logic Programs.",
			"Formal Synthesis of a Unification Algorithm by the Deductive-Tableau Method.",
			"Algorithms for Testing the Satisfiability of Propositional Formulae.",
			"Proving Properties of Committed Choice Logic Programs.",
			"A Sequential Abstract Machine for Flat Concurrent Prolog.",
			"Or-Parallel Prolog on Shared Memory Multiprocessors.",
			"Flow Analysis of Dynamic Logic Programs.",
			"A Completeness Theorem for SLDNF Resolution.",
			"Global Compilation of Prolog.",
			"Signed Data Dependencies in Logic Programs."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1988",
		"info": "Volume 5, 1988",
		"count": 13,
		"papers": [
			"Clausal Intuitionistic Logic I - Fixed-Point Semantics.",
			"Perspectives in Deductive Databases.",
			"Denotational and Operational Semantics for Prolog.",
			"Clausal Intuitionistic Logic II - Tableau Proof Procedures.",
			"Efficient Unification of Quantified Terms.",
			"Toward a Declarative Semantics for Infinite Objects in Logic Programming.",
			"A Data-Dependency-Based Intelligent Backtracking Scheme for Prolog.",
			"An Algebraic Evaluation Method for Deduction in Incomplete Data Bases.",
			"Automatic Mode Inference for Logic Programs.",
			"A Technique for Translating Clausal Specifications of Numerical Methods into Efficient Programs.",
			"The Occur-Check Problem Revisited.",
			"Complete Logic Programs with Domain-Closure Axiom.",
			"The Transparent Prolog Machine (TPM): An Execution Model and Graphical Debugger for Logic Programming."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1987",
		"info": "Volume 4, 1987",
		"count": 19,
		"papers": [
			"A Note of the Complexity of the Satisfiability of Modal Horn Clauses.",
			"Enumeration Operators and Modular Logic Programming.",
			"Efficient Loop Detection in Prolog using the Tortoise-and-Hare Technique.",
			"On Determining the Cause of Nonunifiability.",
			"Logic Programming and Digital Circuit Analysis.",
			"Book Review: Prolog for Programmers, by Feliks Kluzniak and Stanislaw Szpakowicz.",
			"A Program Transformation from Equational Programs into Logic Programs.",
			"Unification as a Complexity Measure for Logic Programming.",
			"Hornlog: A Graph-Based Interpreter for General Horn Clauses.",
			"Logic Continuations.",
			"Error Diagnosis in Logic Programming, an Adaption of E. Y. Shapiro's Method.",
			"Extended Unification Algorithms for the Integration of Functional Programming into Logic Programming.",
			"Intelligent Query Answering in Rule Based Systems.",
			"A Generalization of the Differential Approach to Recursive Query Evaluation.",
			"Logic Programming with Equations.",
			"Negation in Logic Programming.",
			"Operational and Denotational Semantics of Prolog.",
			"Integrity Constraint Checking in Stratified Databases.",
			"Compiling Associativity into Logic Programs."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1986",
		"info": "Volume 3, 1986",
		"count": 18,
		"papers": [
			"Negation as Inconsistency I.",
			"Quantitative Deduction and its Fixpoint Theory.",
			"A Basis for Deductive Database Systems II.",
			"A Constructive View of Prolog.",
			"Pressing for Parallelism: A Prolog Program made Concurrent.",
			"The Consistency of Negation as Failure.",
			"Comments on \"General Failure of Logic Programs\".",
			"Analysis of Sequential Prolog Programs.",
			"Canonical Logic Programs.",
			"Implementing Parallel Algorithms in Concurrent Prolog: The MAXFLOW Experience.",
			"LOGIN: A Logic Programming Language with Built-In Inheritance.",
			"The Relation between Logic and Functional Languages: A Survey.",
			"Natural Deduction as Higher-Order Resolution.",
			"A Technique for Doing Lazy Evaluation in Logic.",
			"Introduction to Special Issue on Natural Language and Logic Programming.",
			"Cooperating Rewrite Processes for Natural-Language Analysis.",
			"Conjunction in Meta-Restriction Grammar.",
			"An Approach to Natural-Language Semantics in Logic Programming."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1985",
		"info": "Volume 2, 1985",
		"count": 18,
		"papers": [
			"Horn Clauses Queries and Generalizations.",
			"Notes on the Implementation of Parlog.",
			"Some Global Optimizations for a Prolog Compiler.",
			"Top-Down Semantics of Fair Computations of Logic Programs.",
			"Prolog Program Transformations and Tree Manipulation Algorithms.",
			"A Basis for Deductive Database Systems.",
			"A Deterministic Prolog Fixpoint Semantics.",
			"Relating Logic Programs and Attribute Grammars.",
			"General Failure of Logic Programs.",
			"Automating Control for Logic Programs.",
			"Negation as Failure II.",
			"Metalogical Control for Logic Programs.",
			"Integrity Constraints for Logic Databases.",
			"Review of Foundations of Logic Programs.",
			"Computing Protected Circumscription.",
			"N-Prolog: An Extension of Prolog with Hypothetical Implication II - Logical Foundations, and Negation as Failure.",
			"Negation-As-Failure Rule for General Logic Programs With Equality.",
			"A Kripke-Kleene Semantics for Logic Programs."
		]
	},
	{
		"name": "Journal of Logic Programming",
		"year": "1984",
		"info": "Volume 1, 1984",
		"count": 19,
		"papers": [
			"Editor's Introduction.",
			"Synthesis of a Unification Algorithm in a Logic Programming Calculus.",
			"Alternation and the Computational Complexity of Logic Programs.",
			"On the Sequential Nature of Unification.",
			"Negation as Failure: A Comparison of Clark's Completed Data Base and Reiter's Closed World Assumption.",
			"A KWIC (Key Word in Context) Bibliography on Prolog and Logic Programming.",
			"A Logical Reconstruction of Prolog II.",
			"Logical Levels of Problem Solving.",
			"Oriented Equational Clauses as a Programming Language.",
			"Equality, Types, Modules, and (Why not ?) Generics for Logic Programming.",
			"A Theory of Complete Logic Programs with Equality.",
			"Making Prolog more Expressive.",
			"An Extension of Lambda-Calculus for Functional Programming.",
			"Parser Generation and Grammar Manipulation Using Prolog's Infinite Trees.",
			"Linear-Time Algorithms for Testing the Satisfiability of Propositional Horn Formulae.",
			"Associative Concurrent Evaluation of Logic Programs.",
			"Heterogeneous SLD Resolution.",
			"Transformations of Logic Programs.",
			"N-Prolog: An Extension of Prolog with Hypothetical Implications I."
		]
	}
]