[
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2022",
        "info": "Volume 34, 2022",
        "count": 13,
        "papers": [
            "Savalan: Multi objective and homogeneous method for software modules clustering.",
            "Transformation of sequence diagram to timed Petri net using Atlas Transformation Language metamodel approach.",
            "A graph sequence neural architecture for code completion with semantic structure features.",
            "On the relation between architectural smells and source code changes.",
            "Blending agile methodologies to support automotive SPICE compliance.",
            "Formalizing model transformation patterns.",
            "On the analysis of power law distribution in software component sizes.",
            "Further investigation of the survivability of code technical debt items.",
            "Predictive BPaaS management with quantum and neural computing.",
            "A systematic mapping study on the employment of neural networks on software engineering projects: Where to go next?",
            "Understanding software architecture erosion: A systematic mapping study.",
            "FlexParser - The adaptive log file parser for continuous results in a changing world.",
            "Anti-bloater class restructuring: An exploratory study."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2021",
        "info": "Volume 33, 2021",
        "count": 71,
        "papers": [
            "Hybrid and evolving processes for software and systems - ICSSP 2019 special issue.",
            "Effort estimation of open source Android projects via transaction analysis.",
            "Towards the statistical construction of hybrid development methods.",
            "Are Product Owners communicators? A multi-method research approach to provide a more comprehensive picture of Product Owners in practice.",
            "Metrics in automotive software development: A systematic literature review.",
            "Evolution in dynamic software product lines.",
            "Software process selection system based on multicriteria decision making.",
            "A service-oriented method for domain and business process modelling.",
            "ArchiRev - Reverse engineering of information systems toward ArchiMate models. An industrial case study.",
            "A user-centered behavioral software development model.",
            "A robust framework for cloud-based software development outsourcing factors using analytical hierarchy process.",
            "Antecedents and consequences of knowledge sharing for software process improvement in the Indian software industry.",
            "A fuzzy analytical hierarchy process to prioritize the success factors of requirement change management in global software development.",
            "Empirical studies on software traceability: A mapping study.",
            "Software smell detection techniques: A systematic literature review.",
            "Improving deep-learning-based fault localization with resampling.",
            "Developing a tool for process-oriented appraisals and rewards: Design science research.",
            "App recommendation based on both quality and security.",
            "DevOps workflow verification and duration prediction using non-Markovian stochastic Petri nets.",
            "Team-external coordination in large-scale software development projects.",
            "An empirical study on Green BPM adoption: Contextual factors and performance.",
            "Using software metrics for predicting vulnerable classes and methods in Java projects: A machine learning approach.",
            "Analytic hierarchy process-based prioritization framework for vendor's reliability challenges in global software development.",
            "Investigating the criticality of user-reported issues through their relations with app rating.",
            "Social network sites and requirements engineering: A systematic literature review.",
            "Business process management approach for improving agile software process and agile maturity.",
            "A formal approach to rigorous development of critical systems.",
            "Understanding the relation between repeat developer interactions and bug resolution times in large open source ecosystems: A multisystem study.",
            "Evolution of technical debt remediation in Python: A case study on the Apache Software Ecosystem.",
            "Systems Thinking Approach to Implementing Kanban: A case study.",
            "Readiness model for DevOps implementation in software organizations.",
            "Estimating software development effort using fuzzy clustering-based analogy.",
            "Knowledge governance maturity assessment can help software engineers during the design of business digitalization projects.",
            "MPT-embedding: An unsupervised representation learning of code for software defect prediction.",
            "Security and provenance for Internet of Health Things: A systematic literature review.",
            "Automated generation of terminological dictionary from textual business rules.",
            "Toward more accurate developer recommendation via inference of development activities from interaction with bug repair process.",
            "Digital for real: A multicase study on the digital transformation of companies in the embedded systems domain.",
            "A new disjunctive literal insertion fault detection strategy in boolean specifications.",
            "Towards evidence-based decision-making for identification and usage of assets in composite software: A research roadmap.",
            "Quantitative software project management with mixed data: A comparison of radial, nonradial, and ensemble data envelopment analysis models.",
            "Predicting the lifetime of pull requests in open-source projects.",
            "On the value of filter feature selection techniques in homogeneous ensembles effort estimation.",
            "Multi-upgradation software reliability growth model with dependency of faults under change point and imperfect debugging.",
            "A model-driven approach for semantic web service modeling using web service modeling languages.",
            "An exploratory semantic analysis of logging questions.",
            "Enhancing agile software development in the banking sector - A comprehensive case study at LHV.",
            "Effort prediction for the software project construction phase.",
            "Software defect prediction with imbalanced distribution by radius-synthetic minority over-sampling technique.",
            "Crowdsourcing usage, task assignment methods, and crowdsourcing platforms: A systematic literature review.",
            "A framework for modeling structural association among De-Motivators of scaling agile.",
            "An empirical comparison of validation methods for software prediction models.",
            "image2emmet: Automatic code generation from web user interface image.",
            "Safe and secure cyber-physical systems.",
            "Language evolution and healthiness for critical cyber-physical systems.",
            "Ensuring safe and consistent coengineering of cyber-physical production systems: A case study.",
            "A model to discipline autonomy in cyber-physical systems-of-systems and its application.",
            "A goal-driven approach for the joint deployment of safety and security standards for operators of essential services.",
            "Security risks in cyber physical systems - A systematic mapping study.",
            "The impact of traceability on software maintenance and evolution: A mapping study.",
            "A comprehensive study on security bug characteristics.",
            "A case study of industry-academia communication in a joint software engineering research project.",
            "Application programming interface recommendation according to the knowledge indexed by app feature mined from app stores.",
            "Goals and challenges in hybrid software development approaches.",
            "Risks and risk mitigation in global software development: An update.",
            "Deployment of a change-level software defect prediction solution into an industrial setting.",
            "Open source software reliability model with nonlinear fault detection and fault introduction.",
            "Formal methods by stealth: The INSPEX experience.",
            "Implementing game requirements using design patterns.",
            "Identification and prioritization of security challenges of big data on cloud computing based on SLR: A fuzzy-TOPSIS analysis approach.",
            "Evolving software forges: An experience report from Apache Allura."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2020",
        "info": "Volume 32, 2020",
        "count": 66,
        "papers": [
            "Engineering cyber-physical systems through performance-based modelling and analysis: A case study experience report.",
            "An automated model-based approach for unit-level performance test generation of mobile applications.",
            "SFLA-based heuristic method to generate software structural test data.",
            "Use case specifications: How complete are they?",
            "Application of rule-based expert systems in hardware-in-the-loop simulation case study: Software and performance validation of an engine electronic control unit.",
            "Security- and safety-critical cyber-physical systems.",
            "A security risk mitigation framework for cyber physical systems.",
            "Design and validation of a C++ code generator from Abstract State Machines specifications.",
            "Formal design of scalable conversation protocols using Event-B: Validation, experiments, and benchmarks.",
            "Security assessment of data management systems for cyber physical system applications.",
            "Analysing encryption mechanisms and functional safety in a ROS-based architecture.",
            "Addressing evolving requirements faced by the software industry.",
            "Health, safety, and well-being through ethical behaviours in computer and information systems development and deployment.",
            "Validating effectiveness of safety requirements' compliance evaluation in process assessments.",
            "A mechanism to explore proactive knowledge retention in open source software communities.",
            "Quantitative evaluation of tailoring within SPICE-compliant security-informed safety-oriented process lines.",
            "Managing security debt across PLC phases in a VSE context.",
            "DRIVES - EU blueprint project for the automotive sector - A literature review of drivers of change in automotive industry.",
            "Automatically identifying valid API versions for software development tutorials on the Web.",
            "Empirical study of abnormality in local variables and its application to fault-prone Java method analysis.",
            "GitHub's milestone tool: A mixed-methods analysis on its use.",
            "Group maturity, team efficiency, and team effectiveness in software development: A case study in a CMMI-DEV Level 5 organization.",
            "Systematic literature review and empirical investigation of motivators for requirements change management process in global software development.",
            "srcDiff: A syntactic differencing approach to improve the understandability of deltas.",
            "A machine learning approach for classification of equivalent mutants.",
            "Practitioner's view of barriers to software outsourcing partnership formation: An empirical exploration.",
            "Do different cross-project defect prediction methods identify the same defective modules?",
            "Evolution of functional size measures through ICONIX process phases.",
            "Challenges of gamification in software process improvement.",
            "A systematic mapping of test case generation techniques using UML interaction diagrams.",
            "A framework for modelling structural association amongst barriers to software outsourcing partnership formation: An interpretive structural modelling approach.",
            "Agile ways of working: A team maturity perspective.",
            "Going digital: Disruption and transformation in software-intensive embedded systems ecosystems.",
            "A systematic review of studies on use case points and expert-based estimation of software development effort.",
            "A proposed framework for improved software requirements elicitation process in SCRUM: Implementation by a real-life Norway-based IT project.",
            "A hybrid DevOps process supporting software reuse: A pilot project.",
            "Cost-driven software migration: An experience report.",
            "Requirement change management challenges in GSD: An analytical hierarchy process approach.",
            "Addressing sustainability in the requirements engineering process: From elicitation to functional decomposition.",
            "Bad smell detection using quality metrics and refactoring opportunities.",
            "Updating the goal model with user reviews for the evolution of an app.",
            "Exploring the industry's challenges in software testing: An empirical study.",
            "A multivocal study to improve the implementation of global requirements change management process: A client-vendor prospective.",
            "Measuring the maturity of Indian small and medium enterprises for unofficial readiness for capability maturity model integration-based software process improvement.",
            "Pattern-based software process modeling for dependability.",
            "Data-driven benchmarking in software development effort estimation: The few define the bulk.",
            "Fuzzy case-based-reasoning-based imputation for incomplete data in software engineering repositories.",
            "Investigating diversity and impact of the popularity metrics for ranking software packages.",
            "Guidelines for evaluating bug-assignment research.",
            "Global software development governance: Challenges and solutions.",
            "Selecting best predictors from large software repositories for highly accurate software effort estimation.",
            "Multicriteria decision-making taxonomy for DevOps challenging factors using analytical hierarchy process.",
            "Readiness model for requirements change management in global software development.",
            "An empirical analysis of source code metrics and smart contract resource consumption.",
            "Current perspectives on the software engineering process.",
            "The sociocultural dimension of the Software Process Improvement Manifesto: Pilot validation by experts.",
            "Analysis of 13 implementations of the software engineering management and engineering basic profile guide of ISO/IEC 29110 in very small entities using different life cycles.",
            "Quality improvement mechanism for cyber physical systems - An evaluation.",
            "A critical review on blockchain assessment initiatives: A technology evolution viewpoint.",
            "Evolution and prospects of the Comprehensive R Archive Network (CRAN) package ecosystem.",
            "Managing the social aspects of software development ecosystems: An industrial case study on personality.",
            "De-motivators for the adoption of agile methodologies for large-scale software development teams: An SLR from management perspective.",
            "Automated generation of oracled test cases with regular expressions and combinatorial techniques.",
            "Conceptualising, extracting and analysing requirements arguments in users' forums: The CrowdRE-Arg framework.",
            "Toward ontology-based risk management framework for software projects: An empirical study.",
            "GLOB: A global project management readiness framework."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2019",
        "info": "Volume 31, 2019",
        "count": 67,
        "papers": [
            "Advances in system, software and service process improvement and innovation.",
            "ISO 31000-based integrated risk management process assessment model for IT organizations.",
            "GSEPIM: A roadmap for software process assessment and improvement in the domain of global software development.",
            "Integration of accessibility design patterns with the software implementation process of ISO/IEC 29110.",
            "Taxonomy-based testing and validation of a new defect classification for health software.",
            "Formulation of process improvement knowledge: 7 components of a good PI story.",
            "Lean and agile software process improvement in traditional and agile environments.",
            "Correlations study and clustering from SPI experiences in small settings.",
            "Approaching Green BPM characterisation.",
            "A porting method for coordinated multiplatform evolution.",
            "Evaluating filter fuzzy analogy homogenous ensembles for software development effort estimation.",
            "Effort estimation model for software development projects based on use case reuse.",
            "Blended Scrum model for software development organizations.",
            "Using reverse engineering techniques to infer a system use case model.",
            "Testing MapReduce programs: A systematic mapping study.",
            "A survey on UML model smells detection techniques for software refactoring.",
            "Misaligned values in software engineering organizations.",
            "Empirical evaluation of an entropy-based approach to estimation variation of software development effort.",
            "A unified approach of testing coverage-based software reliability growth modelling with fault detection probability, imperfect debugging, and change point.",
            "Process maturity models: Classification by application sectors and validities studies.",
            "Supporting software evolution through feedback on executing/skipping energy tests for proposed source code changes.",
            "Test activities in the continuous integration and delivery pipeline.",
            "A measurement framework for software product maturity assessment.",
            "ICSSP 2018 - Special issue introduction.",
            "Stepwise transition to agile: From three agile practices to Kanban adaptation.",
            "Continuous software engineering and its support by usage and decision knowledge: An interview study with practitioners.",
            "Transformation towards agile software product line engineering in large companies: A literature review.",
            "An evaluation of effort estimation supported by change impact analysis in agile software development.",
            "Boundary objects and their use in agile systems engineering.",
            "Innovative process paradigms and data driven analytics: A new horizon for software and systems process.",
            "Predicting process performance: A white-box approach based on process models.",
            "The parallel agile process: Applying parallel processing techniques to software engineering.",
            "Using tool integration for improving traceability management testing processes: An automotive industrial experience.",
            "Impact of requirements volatility on software architecture: How do software teams keep up with ever-changing requirements?",
            "Investigating the factors which impact SPI implementation initiatives in software SMEs - A systematic map and review.",
            "Integration of properties of virtual reality, artificial neural networks, and artificial intelligence in the automation of software tests: A review.",
            "Monitoring the software bug-fixing process through the process mining approach.",
            "Discovering common bug-fix patterns: A large-scale observational study.",
            "The new era of software reuse.",
            "A formal framework for measuring technical lag in component repositories - and its application to npm.",
            "A delta-oriented approach to support the safe reuse of black-box code rewriters.",
            "Variability management in safety-critical systems design and dependability analysis.",
            "REI: An integrated measure for software reusability.",
            "Opportunities for software reuse in an uncertain world: From past to emerging trends.",
            "Introduction to the special issue on \"Machine Learning Techniques for Software Quality Evaluation\".",
            "An extensive evaluation of ensemble techniques for software change prediction.",
            "Maintenance process modeling and dynamic estimations based on Bayesian networks and association rules.",
            "Branch coverage prediction in automated testing.",
            "The impact of feature types, classifiers, and data balancing techniques on software vulnerability prediction models.",
            "A systematic literature review of software effort prediction using machine learning methods.",
            "A systematic mapping study on crowdsourced requirements engineering using user feedback.",
            "Investigation of the requirements change management challenges in the domain of global software development.",
            "An automation framework design for secure software development.",
            "Investigating the use of duration-based windows and estimation by analogy for COCOMO.",
            "An improved transfer adaptive boosting approach for mixed-project defect prediction.",
            "A model of owner estimate cost for software development project in Indonesia.",
            "Using blog-like documents to investigate software practice: Benefits, challenges, and research directions.",
            "An MDD-based method for building context-aware applications with high reusability.",
            "Reactive behavioural adaptation of service compositions.",
            "How has SPI changed in times of agile development? Results from a multi-method study.",
            "On comparing manual and automatic generated textual descriptions of business process models.",
            "Parallel debugging: An investigative study.",
            "Designing a \"software quality model\" based on RCCA of defects and validating based on \"quality algorithm\".",
            "Analysis of cluster center initialization of 2FA-kprototypes analogy-based software effort estimation.",
            "Watch out for this commit! A study of influential software changes.",
            "Identifying and predicting key features to support bug reporting.",
            "Multitask defect prediction."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2018",
        "info": "Volume 30, 2018",
        "count": 87,
        "papers": [
            "Prioritizing key success factors of software projects using fuzzy AHP.",
            "Impact of structural weighting on a latent Dirichlet allocation-based feature location technique.",
            "Identifying unusual commits on GitHub.",
            "Grouping environmental factors influencing individual decision-making behavior in software projects: A cluster analysis.",
            "The connections between group maturity, software development velocity, and planning effectiveness.",
            "Finding an effective classification technique to develop a software team composition model.",
            "Special edition of the Journal of Software: Evolution and Process for the 4th IEEE Working Conference on Software Visualization (VISSOFT 2016).",
            "A systematic mapping study of information visualization for software product line engineering.",
            "Towards actionable visualization for software developers.",
            "Jsvee & Kelmu: Creating and tailoring program animations for computing education.",
            "Merge-Tree: Visualizing the integration of commits into Linux.",
            "Emerging high assurance solutions for safe, secure, and reliable software systems.",
            "Systems-of-systems modeling using a comprehensive viewpoint-based SysML profile.",
            "Resilient computing on ROS using adaptive fault tolerance.",
            "Online verification in cyber-physical systems: Practical bounds for meaningful temporal costs.",
            "Managing risk in high assurance systems by optimizing topological resources.",
            "Protecting Internet users from becoming victimized attackers of click-fraud.",
            "Labelling relevant events to support the crisis management operator.",
            "Formal verification of probabilistic SystemC models with statistical model checking.",
            "Comparative modelling and verification of Pthreads and Dthreads.",
            "Extending Category Partition's Base Choice criterion to better support constraints.",
            "Model refactoring by example: A multi-objective search based software engineering approach.",
            "Context-dependent reconfiguration of autonomous vehicles in mixed traffic.",
            "Database engines: Evolution of greenness.",
            "Internal quality assurance for external contributions in GitHub: An empirical investigation.",
            "Onboarding software developers and teams in three globally distributed legacy projects: A multi-case study.",
            "Evaluating Pred(p) and standardized accuracy criteria in software development effort estimation.",
            "Selected functional safety and cybersecurity concerns in system, software, and service process improvement and innovation.",
            "Extending Automotive SPICE 3.0 for the use in ADAS and future self-driving service architectures.",
            "Software quality model for a research-driven organization - An experience report.",
            "More effective sprint retrospective with statistical analysis.",
            "A systematic literature review of the use of formal methods in medical software systems.",
            "Quantitative and qualitative safety analysis of a hemodialysis machine with S#.",
            "Towards functional safety and security for adaptive and flexible business processes.",
            "Cybersecurity in safety-critical systems.",
            "Introduction to the special issue on program comprehension.",
            "Context-based approach to prioritize code smells for prefactoring.",
            "A comprehensive model for code readability.",
            "Special issue on software engineering for Connected Health: Challenges and research roadmap.",
            "A hybrid assessment approach for medical device software development companies.",
            "Software architectures for health care cyber-physical systems: A systematic literature review.",
            "Sustainability requirements for connected health applications.",
            "Cloud-based performance management of community care services.",
            "Automated conflict detection between medical care pathways.",
            "A hybrid approach for aspect-oriented business process modeling.",
            "How is agile development currently being used in regulated embedded domains?",
            "Reusing process patterns in software process models modification.",
            "Using agile methods for the development of green and sustainable software: Success factors for GSD vendors.",
            "Challenges in the development of green and sustainable software for software multisourcing vendors: Findings from a systematic literature review and industrial survey.",
            "Security-aware SaaS placement using swarm intelligence.",
            "Cover Image.",
            "Five recommendations for software evolvability.",
            "Spreadsheet guardian: An approach to protecting semantic correctness throughout the evolution of spreadsheets.",
            "Agile practices and the promotion of entrepreneurial skills in software development.",
            "Analysis of the changes in communication and social interactions during the transformation of a traditional team into an agile team.",
            "Literature review of flexibility attributes: A flexibility framework for software developing organization.",
            "Security policy monitoring of BPMN-based service compositions.",
            "Multicloud service composition: A survey of current approaches and issues.",
            "Automated parallel GUI testing as a service for mobile applications.",
            "Empirical study of software process improvement in Malaysian small and medium enterprises: The human aspects.",
            "Agile practices for global software development vendors in the development of green and sustainable software.",
            "Clone refactoring inspection by summarizing clone refactorings and detecting inconsistent changes during software evolution.",
            "Correct-by-construction specification to verified code.",
            "Scaling agile in large organizations: Practices, challenges, and success factors.",
            "Towards a benefits dependency network for DevOps based on a systematic literature review.",
            "Program comprehension through reverse-engineered sequence diagrams: A systematic review.",
            "Assessing and improving the quality of security methodologies for distributed systems.",
            "Ecosystem traps and where to find them.",
            "Prioritizing challenges of agile process in distributed software development environment using analytic hierarchy process.",
            "Approaches, success factors, and barriers for technology transfer in software engineering - Results of a systematic literature review.",
            "HCI in practice: An empirical study with software process capability maturity model consultants in Brazil.",
            "Do code data sharing dependencies support an early prediction of software actual change impact set?",
            "An exploratory study on the evolution of Android malware quality.",
            "Concrete hyperheuristic framework for test case prioritization.",
            "Cover Image.",
            "The state-of-the-art in software development effort estimation.",
            "A model-based solution for process modeling in practice environments: PLM4BS.",
            "Requirements elicitation and refinement in collaborative research projects.",
            "Trustworthiness requirement-oriented software process modeling.",
            "Framework for empirical examination and modeling structural dependencies among inhibitors that impact SPI implementation initiatives in software SMEs.",
            "Multicriteria decision aid for agile methods evaluation using fuzzy PROMETHEE.",
            "Software change-proneness prediction through combination of bagging and resampling methods.",
            "Project productivity evaluation in early software effort estimation.",
            "Experimentation growth: Evolving trustworthy A/B testing capabilities in online software companies.",
            "Support vector regression-based imputation in analogy-based software development effort estimation.",
            "An empirical study on how project context impacts on code cloning.",
            "Analyzing reviews guided by App descriptions for the software development and evolution."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2017",
        "info": "Volume 29, 2017",
        "count": 62,
        "papers": [
            "Editorial: A five year retrospective.",
            "An empirical study on developer-related factors characterizing fix-inducing commits.",
            "The formal semantics of program slicing for nonterminating computations.",
            "Exploiting spatial code proximity and order for improved source code retrieval for bug localization.",
            "Dynamics of task allocation in global software development.",
            "Editorial: Reality check for software engineering for sustainability - pragmatism required.",
            "Cloud architecture continuity: Change models and change rules for sustainable cloud software architectures.",
            "BEFTIGRE: Behaviour-driven full-tier green evaluation of mobile cloud applications.",
            "Investigating the effect of design patterns on energy consumption.",
            "Energy efficiency on the product roadmap: An empirical study across releases of a software product.",
            "Uncovering sustainability concerns in software product lines.",
            "GreCo: Green code of ethics.",
            "Foreword to the SANER 2015 special issue.",
            "Understanding systematic and collaborative code changes by mining evolutionary trajectory patterns.",
            "Work fragmentation in developer interaction data.",
            "Detecting duplicate bug reports with software engineering domain knowledge.",
            "A bug reproduction approach based on directed model checking and crash traces.",
            "A model for assessing and re-assessing the value of software reuse.",
            "A meta-model of software development project states behavioral study of software projects.",
            "A method of requirements elicitation and analysis for Global Software Development.",
            "Simplifying the construction of source code transformations via automatic syntactic restructurings.",
            "There and back again: Can you compile that snapshot?",
            "The relationship between evolutionary coupling and defects in large industrial software.",
            "MORE: A multi-objective refactoring recommendation approach to introducing design patterns and fixing code smells.",
            "The long-term growth rate of evolving software: Empirical results and implications.",
            "Enabling code transformations with FermaT on simplified bytecode.",
            "A comprehensive framework for modeling requirements of CSCW systems.",
            "Future directions in Agile research: Alignment and divergence between research and practice.",
            "Assisting the continuous improvement of Scrum projects using metrics and Bayesian networks.",
            "An empirical study of portfolio management and Kanban in agile and lean software companies.",
            "Cluster-based test cases prioritization and selection technique for agile regression testing.",
            "Assessing the adoption level of scaled agile development: a maturity model for Scaled Agile Framework.",
            "A qualitative study of DevOps usage in practice.",
            "The evolution of open-source mobile applications: An empirical study.",
            "Using discriminative feature in software entities for relevance identification of code changes.",
            "Analysis of task allocation in distributed software development through a hybrid methodology of verbal decision analysis.",
            "From ad hoc to strategic ecosystem management: the \"Three-Layer Ecosystem Strategy Model\" (TeLESM).",
            "Identifying Classes in Legacy JavaScript Code.",
            "Motivators for adopting social computing in global software development: An empirical study.",
            "Automated support for reuse-based requirements engineering in global software engineering.",
            "Software integration in global software development: Challenges for GSD vendors.",
            "Of software and change.",
            "Toward automated quality-centric product line configuration using intentional variability.",
            "Analyzing the relationship between project productivity and environment factors in the use case points method.",
            "A replicated empirical study to evaluate software testing methods.",
            "On the interest of architectural technical debt: Uncovering the contagious debt phenomenon.",
            "An investigation of effort distribution among development phases: A four-stage progressive software cost estimation model.",
            "An empirical assessment of technical debt practices in industry.",
            "Corrigendum: Empirical analysis of the relationship between CC and SLOC in a large corpus of Java methods and C functions published on 9 December 2015.",
            "ICSSP 2016 - Special Issue Introduction.",
            "Comparing pre-commit reviews and post-commit reviews using process simulation.",
            "Software process models vs descriptions: What do practitioners use and need?",
            "The changing balance of technology and process: A case study on a combined setting of model-driven development and classical C coding.",
            "Coadapting multidimension process properties.",
            "Continuous software engineering - A microservices architecture perspective.",
            "Effort estimation in agile software development: Case study and improvement framework.",
            "Mobile medical app development with a focus on traceability.",
            "Guest editor's introduction to the Special Issue on Source Code Analysis and Manipulation (SCAM 2015).",
            "Mining unit test cases to synthesize API usage examples.",
            "TMAP: Discovering relevant API methods through text mining of API documentation.",
            "Purity analysis for JavaScript through abstract interpretation.",
            "Parsing Excel formulas: A grammar and its application on 4 large datasets."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2016",
        "info": "Volume 28, 2016",
        "count": 57,
        "papers": [
            "A multiple case study on the inter-group interaction speed in large, embedded software companies employing agile.",
            "The impact of the representatives of three types of process modeling tools on modeler's perceptions and performance.",
            "A differential evolution-based model to estimate the software services development effort.",
            "Characterizing software development method using metrics.",
            "A runtime fault survival method for deployed software during production runs.",
            "Automated feature discovery via sentence selection and source code summarization.",
            "Combining text mining and data mining for bug report classification.",
            "Robula+: an algorithm for generating robust XPath locators for web testing.",
            "Co-located and distributed natural-language requirements specification: traditional versus reuse-based techniques.",
            "Guest editors' introduction.",
            "Software processes for a changing world.",
            "On the use of variability operations in the V-Modell XT software process line.",
            "A model for analyzing performance problems and root causes in the personal software process.",
            "When to automate software testing? A decision-support approach based on process simulation.",
            "Workflow temporal verification for monitoring parallel business processes.",
            "Mining static and dynamic crosscutting concerns: a role-based approach.",
            "Testing the theory of relative dependency from an evolutionary perspective: higher dependencies concentration in smaller modules over the lifetime of software products.",
            "Understanding SPI in small organizations: a study of Mexican software enterprises.",
            "In two minds: how reflections influence software design thinking.",
            "TuneR: a framework for tuning software engineering tools with hands-on instructions in R.",
            "Towards a multi-criteria decision support method for consumer electronics software ecosystems.",
            "EXACT: A tool for comprehending VBA-based Excel spreadsheet applications.",
            "Introduction to the special issue on software maintenance and evolution.",
            "A Simple, Efficient, Context-sensitive Approach for Code Completion.",
            "An empirical study on how expert knowledge affects bug reports.",
            "How does code obfuscation impact energy usage?",
            "Empirical analysis of the relationship between CC and SLOC in a large corpus of Java methods and C functions.",
            "A method for investigating the quality of evolving object-oriented software using defects in global software development projects.",
            "Pragmatic source code reuse via execution record and replay.",
            "Integrating firefly algorithm in artificial neural network models for accurate software cost predictions.",
            "PAM-SMEs: process assessment method for small to medium enterprises.",
            "ICSSP 2015-Special Issue Introduction.",
            "Integrated and iterative systems engineering and software requirements engineering for technical systems.",
            "Software product assurance at the German space agency.",
            "Integrating run-time changes into system and software process enactment.",
            "The v-algorithm for discovering software process lines.",
            "Development and benefits of MDevSPICE®, the medical device software process assessment framework.",
            "The MedITNet assessment framework: development and validation of a framework for improving risk management of medical IT networks.",
            "Guest editor's introduction to the Special Issue on Program Comprehension (ICPC 2014).",
            "Framing program comprehension as fault localization.",
            "Searching crowd knowledge to recommend solutions for API usage tasks.",
            "Source code analysis with LDA.",
            "AmaLgam+: Composing Rich Information Sources for Accurate Bug Localization.",
            "Results and lessons learned in System, Software & Service Process Improvement & Innovation.",
            "Experience report: implementing requirement traceability throughout the software development life cycle.",
            "Objective-driven process appraisals: an educational experiment.",
            "Refactoring technical support to reduce interrupts of developers.",
            "Assessing ISO/IEC29110 by means of ITMark: results from an experience factory.",
            "Lessons learned from 4-year empowering project management with TALAIA OpenPPM.",
            "Software development practices in small entities: an ISO29110-based survey.",
            "Effectivity and economical aspects for agile quality assurance in large enterprises.",
            "Creation of an IEC 62304 compliant software development plan.",
            "A method to realize traceability in development processes.",
            "Introduction to the special issue on search-based software engineering (NasBASE 2015).",
            "An empirical investigation of single-objective and multiobjective evolutionary algorithms for developer's assignment to bugs.",
            "Error leakage and wasted time: sensitivity and effort analysis of a requirements consistency checking process.",
            "Search-based model transformations."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2015",
        "info": "Volume 27, 2015",
        "count": 49,
        "papers": [
            "A proposed model for reuse of software requirements in requirements catalog.",
            "Defect analysis in mission-critical software systems: a detailed investigation.",
            "How software development competences change in global settings - an explorative study.",
            "Information sharing for effective IT incident resolving in IT service provider networks: a financial service case study.",
            "Deriving metrics thresholds using log transformation.",
            "Crafting a software process improvement approach - a retrospective systematization.",
            "Quantifying fair payment after outsourcing - a case study.",
            "Supporting requirements update during software evolution.",
            "Dual analysis for recommending developers to resolve bugs.",
            "Collaborative tools: computer science students' skills versus software industry needs.",
            "Lean quality improvement model for quality practices in software industry in Pakistan.",
            "The impact of vocabulary normalization.",
            "Applying software process modeling to improve customer support processes.",
            "A model-driven approach to detect faults in FOSS systems.",
            "A roadmap to ISO 14971 implementation.",
            "A systematic literature review on SOA migration.",
            "Accounting for data encapsulation in the measurement of object-oriented class cohesion.",
            "Preface special section on software clones (IWSC'13).",
            "A parallel and efficient approach to large scale clone detection.",
            "Big data clone detection using classical detectors: an exploratory study.",
            "Software productivity and effort estimation.",
            "Do feelings matter? On the correlation of affects and the self-assessed productivity in software engineering.",
            "On the effectiveness of weighted moving windows: Experiment on linear regression based software effort estimation.",
            "Process improvement approaches fertilised by advances in SPI.",
            "Identifying correlations of findings for building process improvement packages using graph clustering.",
            "ITIL in small to medium-sized enterprises software companies: towards an implementation sequence.",
            "Experience with teaching and applying process appraisals at a university.",
            "ECQA Governance SPICE assessor skills for evaluating integrated risk management scenarios.",
            "Towards relating delivery methods and examination success: lessons learned from the VALO LLP project case study.",
            "Development of MDevSPICE® - the medical device software process assessment framework.",
            "Choosing change strategy for ISO/IEC 33014.",
            "Where does all this waste come from?",
            "Assessing traceability - practical experiences and lessons learned.",
            "Web framework points: an effort estimation methodology for Web application development using a content management framework.",
            "The impact of software process consistency on residual defects.",
            "Exploring factors affecting decision outcome and lead time in large-scale requirements engineering.",
            "An optimization-based tool to support the cost-effective production of software architecture documentation.",
            "A comparative study of software process improvement implementation success factors.",
            "A systematic review of distributed Agile software engineering.",
            "A conceptual framework of challenges and solutions for managing global software maintenance.",
            "Identifying functions in binary code with reverse extended control flow graphs.",
            "Model transformation testing: a bi-level search-based software engineering approach.",
            "Can method data dependencies support the assessment of traceability between requirements and source code?",
            "A review of code smell mining techniques.",
            "Successful process improvement projects are no accidents.",
            "Delta-based regression testing: a formal framework towards model-driven regression testing.",
            "Involving user perspective in a software risk management process.",
            "Systems dynamics model for decision support in risk assessment in software projects.",
            "Time series trends in software evolution."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2014",
        "info": "Volume 26, 2014",
        "count": 83,
        "papers": [
            "Special issue: a selection of distinguished papers from the 18th Working Conference on Reverse Engineering 2011.",
            "An exploratory study of the evolution of communicated information about the execution of large software systems.",
            "Automatic Segmentation of Method Code into Meaningful Blocks: Design and Evaluation.",
            "Predicting dependences using domain-based coupling.",
            "Detecting asynchrony and dephase change patterns by mining software repositories.",
            "Comparing text-based and dependence-based approaches for determining the origins of bugs.",
            "A lean and mean strategy: a data migration industrial study.",
            "Extended comprehensive study of association measures for fault localization.",
            "Towards a hybrid testing process unifying exploratory testing and scripted testing.",
            "A conceptual framework for SPI evaluation.",
            "Application themes of software process assessment and improvement.",
            "Social responsibility aspects supporting the success of SPI.",
            "Maturity differences between customer and supplier - challenges, problems, and possible solutions.",
            "Report on an assessment experience based on ISO/IEC 29110.",
            "Process communication in medical software development.",
            "Rule-based requirements management methodology.",
            "Skills and abilities for working in a global software development team: a competence model.",
            "Modeling software development practices using reusable project patterns: a case study.",
            "Technical issues in test process assessment and their current handling in TestSPICE.",
            "Toward nuclear SPICE - integrating IEC 61508, IEC 60880 and SPICE.",
            "ICSSP 2011 Special issue: processes for tomorrow's systems and software engineering: an evolving dynamic domain.",
            "Integrating inspection and test processes based on context-specific assumptions.",
            "MDE-based process tailoring strategy.",
            "Agile coaching for global software development.",
            "Embedded software product lines: domain and application engineering model-based analysis processes.",
            "Avispa: a tool for analyzing software process models.",
            "An empirical study of process knowledge: coherence as a static process property.",
            "Software process improvement leveraged in various application domains.",
            "Successfully transitioning a research project to a commercial spin-out using an agile software process.",
            "Methodological framework for the allocation of work packages in global software development.",
            "Experience report: implementation of a multi-standard compliant process improvement program.",
            "Maturity assessment and process improvement for information security management in small and medium enterprises.",
            "Adopting agile practices when developing software for use in the medical domain.",
            "Agile maturity model: analysing agile maturity characteristics from the SPICE perspective.",
            "Proposal and practice of software process improvement framework - Toshiba's software process improvement history since 2000.",
            "Guest editorial for the special issue on source code analysis and manipulation, SCAM 2012.",
            "An optimization-based approach to lookup table program transformations.",
            "GUI code tracing through direct program interaction.",
            "Impact analysis in the presence of dependence clusters using Static Execute After in WebKit.",
            "Studying the laws of software evolution in a long-lived FLOSS project.",
            "On the evolution of Lehman's Laws.",
            "Challenges and opportunities for software change request repositories: a systematic mapping study.",
            "Classification and comparison of architecture evolution reuse knowledge - a systematic review.",
            "Model refactoring using examples: a search-based approach.",
            "Process mining support for Capability Maturity Model Integration-based software process assessment, in principle and in practice.",
            "CSMR 2012 Special issue - Guest editorial.",
            "The Linux kernel: a case study of build system variability.",
            "Large-scale inter-system clone detection using suffix trees and hashing.",
            "Snapshot of industrial experiences shared at the 20th anniversary EuroSPI conference.",
            "Understanding sprint velocity fluctuations for improved project plans with Scrum: a case study.",
            "Transition to a product line infrastructure: experience at Akari Software.",
            "Using social media as a tool for business improvement and certification of knowledge workers.",
            "Assessing partially outsourced processes - lessons learned from TIPA assessments.",
            "High-maturity levels: achieving CMMI ML-5 in a consultancy company.",
            "Agile practices adapted to mass-market application development.",
            "An approach to manage the concept phase of ISO 26262.",
            "An industrial assessment for a multimodel framework.",
            "A project management improvement program according to ISO/IEC 29110 and PMBOK®.",
            "Empirical evidence and state of practice of software agile teams.",
            "Guest editors' introduction.",
            "Learning about application software by studying processes.",
            "A generalized duration forecasting model of test-and-fix cycles.",
            "Supporting collaborative development using process models: a tooled integration-focused approach.",
            "Taxonomy for software teamwork measurement.",
            "Software process simulation - at a crossroads?",
            "A selection of distinguished papers from the 19th Working Conference on Reverse Engineering 2012.",
            "srcSlice: very efficient and scalable forward static slicing.",
            "SCAN: an approach to label and relate execution trace segments.",
            "An empirical study of the effect of file editing patterns on software quality.",
            "A study of library migrations in Java.",
            "A mapping study on the feasibility of method engineering.",
            "Extending value stream mapping through waste definition beyond customer perspective.",
            "Improving IT incident handling performance with information visibility.",
            "Ontology-based similarity applied to business process clustering.",
            "Early identification of bottlenecks in very large scale system of systems software development.",
            "Pattern detection for conceptual schema recovery in data-intensive systems.",
            "Detecting and analyzing I/O performance regressions.",
            "Mobile situation-aware framework for developing smart mobile software.",
            "Design pattern detection using a DSL-driven graph matching approach.",
            "A method for aggregating ordinal process assessment measures.",
            "Horizontal traceability for just-in-time requirements: the case for open source feature requests.",
            "A simplified model for software inspection.",
            "An evaluation of the process capability implications of the requirements of ISO/IEC 20000-1."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2013",
        "info": "Volume 25, 2013",
        "count": 63,
        "papers": [
            "Empirical taxonomy of refactoring methods for aspect-oriented programming.",
            "Design patterns: a survey on their micro-structures.",
            "Feature location in source code: a taxonomy and survey.",
            "Maintenance of service oriented architecture composite applications: static and dynamic support.",
            "Introduction to the Special Issue of the 13th European Conference on Software Maintenance and Reengineering (CSMR 2009).",
            "Cluster-based modularization of processes recovered from web applications.",
            "Studying software evolution of large object-oriented software systems using an ETGM algorithm.",
            "Studying clone evolution using incremental clone detection.",
            "Towards a better understanding of software evolution: an empirical study on open-source software.",
            "Supporting software architects to improve their software system's decomposition - lessons learned.",
            "A top-down approach to construct execution views of a large software-intensive system.",
            "Clone evolution: a systematic review.",
            "Increasing software development efficiency and maintainability for complex industrial systems - A case study.",
            "Combining metrics for software evolution assessment by means of Data Envelopment Analysis.",
            "Industrial experiences with software process assessment and improvement: (Special Issue with Selected Industrial Experience Papers of EuroSPI2 2010).",
            "IT-supported innovation management in the automotive supplier industry to drive idea generation and leverage innovation.",
            "Improving safety and availability of complex systems by using an integrated design approach in development.",
            "Contextualizing agile software development.",
            "A lightweight traceability assessment method for medical device software.",
            "Automotive and medical: can we learn from each other?",
            "The people aspects in modern process improvement management approaches.",
            "A framework for evaluation and control of the factors that influence the software process improvement in small organizations.",
            "A suite of metrics for quantifying historical changes to predict future change-prone classes in object-oriented software.",
            "On the evolution of Linux kernels: a complex network perspective.",
            "A standards-based model of system maintainability requirements.",
            "Software modernization by recovering Web services from legacy databases.",
            "A survey of dynamic software updating.",
            "A retrospective view of software maintenance and reengineering research - a selection of papers from European Conference on Software Maintenance and Reengineering 2010.",
            "TIDIER: an identifier splitting approach using speech recognition techniques.",
            "Incremental reflexion analysis.",
            "Realizing service migration in industry - lessons learned.",
            "Cohesive software measurement planning framework using ISO standards: a case study from logistics service sector.",
            "Regression test suite selection using dependence analysis.",
            "The software value map - an exhaustive collection of value aspects for the development of software intensive products.",
            "Improving IR-based traceability recovery via noun-based indexing of software artifacts.",
            "The BSCBAS: a Balanced Scorecard-based appraisal system for improving the performance of software organizations.",
            "Special issue: selected papers from the 12th International Symposium on Web Systems Evolution (WSE 2010).",
            "Web applications design recovery and evolution with RE-UWA.",
            "Automated evaluation of website navigability: an empirical validation of multilevel quality models.",
            "An approach for mining service composition patterns from execution logs.",
            "A performance evaluation framework for Web applications.",
            "Similarities, challenges and opportunities of Wikipedia content and open source projects.",
            "LAPPI: A light-weight technique to practical process modeling and improvement target identification.",
            "Micro process analysis of maintenance effort: an open source software case study using metrics based on program slicing.",
            "Evolution styles: using architectural knowledge as an evolution driver.",
            "An empirical examination of the extent of software process improvement in software SMEs.",
            "Uses and applications of Software & Systems Process Engineering Meta-Model process models. A systematic mapping study.",
            "Metrics for quantifying evolutionary changes in Z specifications.",
            "Cloned code: stable code.",
            "Automatic conformance checking for migrating software systems to cloud infrastructures and platforms.",
            "Software quality metrics aggregation in industry.",
            "Special section on ICSM 2011.",
            "An empirical study of faults in late propagation clone genealogies.",
            "Evaluating test-to-code traceability recovery methods through controlled experiments.",
            "How developers perform feature location tasks: a human-centric and process-oriented exploratory study.",
            "Simulation of software maintenance process, with and without a work-in-process limit.",
            "Design and implementation of a dynamic symbolic execution tool for windows executables.",
            "Managing changes in requirements: an empirical investigation.",
            "Embracing the C preprocessor during refactoring.",
            "Improving globally distributed software development and support processes - A workflow view.",
            "A case study of software process improvement with CMMI-DEV and Scrum in Spanish companies.",
            "Automating the maintenance of nonfunctional system properties using demonstration-based model transformation.",
            "FaultTracer: a spectrum-based approach to localizing failure-inducing program edits."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2012",
        "info": "Volume 24, 2012",
        "count": 57,
        "papers": [
            "Software: evolution and process A new journal is born.",
            "Assigning change requests to software developers.",
            "Evaluating testing effectiveness during software evolution: a time-series cross-section approach.",
            "Discovering programming rules and violations by mining interprocedural dependences.",
            "A demand-driven approach to slicing legacy COBOL systems.",
            "Introduction of a process maturity model for market-driven product management and requirements engineering.",
            "Research directions for global software engineering - where to next?",
            "Propinquity in global software engineering: examining perceived distance in globally distributed project teams.",
            "Knowledge sharing practices and the impact of cultural factors: reflections on two case studies of offshoring in SME.",
            "The impact of geographic distribution and the nature of technical coupling on the quality of global software development projects.",
            "Quality indicators on global software development projects: does 'getting to know you' really matter?",
            "Fear and distrust in global software engineering projects.",
            "A framework for groupware-supported software architecture evaluation process in global software development.",
            "Special issue on business process lifecycle: design, deployment, operation and evaluation.",
            "From business processes to software services and vice versa - an improved transition through service-oriented requirements engineering.",
            "Service selection and horizontal multi-sourcing in process-oriented capability outsourcing.",
            "Toward enhanced life-cycle support for declarative processes.",
            "Supporting business process analysis via data warehousing.",
            "Process warehouses in practice: a goal-driven method for business process analysis.",
            "Towards a method for business process and informal business rules compliance.",
            "Meta-service support for the business process life cycle.",
            "Formalizing interactive staged feature model configuration.",
            "Process attribute rating and sensitivity analysis in process assessment.",
            "Integration test effort in sap r/3 systems.",
            "A review of methods for evaluation of maturity models for process improvement.",
            "Topics in Software, Systems and Services Process Improvement.",
            "Software disasters - understanding the past, to improve the future.",
            "Make test process assessment similar to software process assessment - the Test SPICE approach.",
            "Managing the software process with a software process improvement tool in a small enterprise.",
            "Lessons learned from an ISO/IEC 15504 SPI programme in a company.",
            "Additional requirements for process assessment in safety-critical software and systems domain.",
            "Methodology for process improvement through basic components and focusing on the resistance to change.",
            "The SPI manifesto and the ECQA SPI manager certification scheme.",
            "Improving the software development for multiple projects by applying a platform strategy for mechatronic systems.",
            "Process and product innovation needs integrated engineering collaboration skills.",
            "An agile process model for product derivation in software product line engineering.",
            "KASL-II: a dynamic four-loop model for knowledge sharing and learning.",
            "Measurement and quantification are not the same: ISO 15939 and ISO 9126.",
            "Special issue on global software engineering.",
            "Lessons learned from transferring software products to India.",
            "An evidence-based model of distributed software development project management: results from a systematic mapping study.",
            "Global software engineering and agile practices: a systematic review.",
            "A rule-based model for customized risk identification and evaluation of task assignment alternatives in distributed software development projects.",
            "Reflecting the choice and usage of communication tools in global software development projects with media synchronicity theory.",
            "An empirical study of learning by osmosis in global software engineering.",
            "Cultural and linguistic problems in GSD: a simulator to train engineers in these issues.",
            "Guest editors' introduction.",
            "Hybrid modeling and simulation for trustworthy software process management: a stakeholder-oriented approach.",
            "Toward trustworthy software process models: an exploratory study on transformable process modeling.",
            "Achieving process modeling and execution through the combination of aspect and model-driven engineering approaches.",
            "Improving software testing process: feature prioritization to make winners of success-critical stakeholders.",
            "Defectivity profiling with dynamic COQUALMO: An explication and product quality retrospective.",
            "A component-based development process for trustworthy systems.",
            "Dynamic capability for trustworthy software development.",
            "A software maintenance methodology for small organizations: Agile_MANTEMA.",
            "An exploratory study of software process improvement implementation risks.",
            "Identifying criteria for multimodel software process improvement solutions - based on a review of current problems and initiatives."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2011",
        "info": "Volume 23, 2011",
        "count": 28,
        "papers": [
            "Preparing for a new era.",
            "A profile-based approach for maintaining software architecture: an industrial experience report.",
            "Optimal software maintenance policy considering unavailable time.",
            "Modeling and scenario simulation for decision support in management of requirements activities in software projects.",
            "UML-based regression testing for OO software.",
            "Classification of software patches: a text mining approach.",
            "Developing measurement systems: an industrial case study.",
            "Relationship model: a network model for integrating human expertise with systematic distributed processes.",
            "In memory of Manny Lehman, 'Father of Software Evolution'.",
            "Mismatch handling for COTS selection: a case study.",
            "Code Bad Smells: a review of current knowledge.",
            "Special Issue on BPM 2009 Workshops.",
            "PHILharmonicFlows: towards a framework for object-aware process management.",
            "Model checking timed properties of healthcare processes.",
            "A framework for the collaborative specification of semantically annotated business processes.",
            "Key challenges for enabling agile BPM with social software.",
            "ICMM - a maturity model for software inspections.",
            "Stable cohesion metrics for evolving ontologies.",
            "Evaluation of multi-tasking software system performance with consideration of module dependency.",
            "Reducing the risk of requirements volatility: findings from an empirical survey.",
            "Defining a catalog of indicators to support process performance analysis.",
            "Agile methods and organizational culture: reflections about cultural levels.",
            "An information systems design product theory for the class of integrated requirements and release management systems.",
            "Test coverage analysis based on an object-oriented program model.",
            "A method for alignment evaluation of product strategies among stakeholders (MASS) in software intensive product development.",
            "The multiple quality models paradox: how much 'best practice' is just enough?",
            "Economies and diseconomies of scale in software development.",
            "Complex software project development: agile methods adoption."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2010",
        "info": "Volume 22, 2010",
        "count": 34,
        "papers": [
            "Finding software metrics threshold values using ROC curves.",
            "Investigating the role of CMMI with expanding company size for small- to medium-sized enterprises.",
            "Social networks in software process improvement.",
            "The impact of agile principles on market-driven software product development.",
            "Viability for codifying and documenting architectural design decisions with tool support.",
            "BBN based approach for improving the software development process of an SME - a case study.",
            "Introduction to the special issue on reverse engineering (WCRE 2008).",
            "Recommending change clusters to support software investigation: an empirical study.",
            "Near-miss function clones in open source software: an empirical study.",
            "Software Cartography: thematic software visualization with consistent layout.",
            "Migrating legacy data structures based on variable overlay to Java.",
            "Software process improvement and capability determination: selected articles from SPICE 2009.",
            "Organisational theory perspective on process capability measurement scales.",
            "Medi SPICE development.",
            "A European scheme for software process improvement manager training and certification.",
            "Harmonizing maturity levels from CMMI-DEV and ISO/IEC 15504.",
            "Studies on the assessment process: usage of objective evidence in assessing process capability.",
            "Integrating ISO/IEC 15504 conformant process assessment and organizational reuse enhancement.",
            "Process Management.",
            "Balancing uncertainty of context in ERP project estimation: an approach and a case study.",
            "An examination of change profiles in reusable and non-reusable software systems.",
            "Goal-oriented customization of software cockpits.",
            "Software cost estimation inhibitors - a case study in automotive context.",
            "Introduction to the Special Issue with Best Papers from BPM 2008 Workshops.",
            "Information and communication technology for process management in healthcare: a contribution to change the culture of blame.",
            "Combining BPM and social software: contradiction or chance?",
            "Peer-to-peer business processes - conception, construction, tooling.",
            "Using classification methods to label tasks in process mining.",
            "Capturing variability in business process models: the Provop approach.",
            "Business process modeling with continuous validation.",
            "A biting-down approach to hierarchical decomposition of object-oriented systems based on structure analysis.",
            "Identification of behavioural and creational design motifs through dynamic analysis.",
            "Software project effort assessment.",
            "Exploratory inspection - a user-based learning method for improving open source software usability."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2009",
        "info": "Volume 21, 2009",
        "count": 17,
        "papers": [
            "An architecture-centric software maintainability assessment using information theory.",
            "DynaQoS(c)-RDF: a best effort for QoS-assurance of dynamic reconfiguration of dataflow systems.",
            "Modeling software evolution defects: a time series approach.",
            "Software Maintenance Management: Evaluation and Continuous Improvement Authored by Alain April and Alain Abran Wiley-Interscience, Hoboken NJ, U.S.A., and IEEE Computer Society, Los Alamitos CA, U.S.A. Copyright (c) 2008; 314 pages ISBN 978-0470-14707-8 (soft cover) US$65.00.",
            "Special issue on the 12th conference on software maintenance and reengineering (CSMR 2008).",
            "Dynamic update of Java applications - balancing change flexibility vs programming transparency.",
            "Splitting a large software repository for easing future software evolution - an industrial experience report.",
            "An evaluation of code similarity identification for the grow-and-prune model.",
            "User Interface Migration of Microsoft Windows Applications.",
            "Comprehend and analyze knowledge networks to improve software evolution.",
            "Visual software evolution reconstruction.",
            "Optimizing header file include directives.",
            "Regression testing with UML software designs: A survey.",
            "Assessing the efficacy of user and developer activities in facilitating the development of OSS projects.",
            "Recovering business processes from business applications.",
            "Understanding software maintenance and evolution by analyzing individual changes: a literature review.",
            "Regression test suite reduction based on SDL models of system requirements."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2008",
        "info": "Volume 20, 2008",
        "count": 21,
        "papers": [
            "Improving Web site understanding with keyword-based clustering.",
            "Assessing maintainability change over multiple software releases.",
            "Towards a deeper understanding of test coverage.",
            "Concept location in formal specifications.",
            "Encapsulating targeted component abstractions using software Reflexion Modelling.",
            "Improving change tolerance through Capabilities-based design: an empirical analysis.",
            "An empirical validation of object-oriented class complexity metrics and their ability to predict error-prone classes in highly iterative, or agile, software: a case study.",
            "A segmentation-based approach for temporal analysis of software version repositories.",
            "Introduction to the special issue on program comprehension through dynamic analysis (PCODA).",
            "Mining temporal rules for software maintenance.",
            "An automated approach for abstracting execution logs to execution events.",
            "Improving dynamic software analysis by applying grammar inference principles.",
            "A survey and evaluation of tool features for understanding reverse-engineered sequence diagrams.",
            "Special Issue on Search-Based Software Maintenance.",
            "Search-based many-to-one component substitution.",
            "Search-based refactoring: an empirical study.",
            "Optimized staffing for product releases and its application at Chartwell Technology.",
            "Automatic identification of key classes in a software system using webmining techniques.",
            "Extended firewall for regression testing: an experience report.",
            "A metric-based approach to identifying refactoring opportunities for merging code clones in a Java software system.",
            "Software Maintenance: Concepts and Practice Authored by Penny Grubb and Armstrong A. Takang World Scientific, New Jersey. Copyright (c) 2003; 349 pages ISBN 981-238-426-X (paperback) US$40."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2007",
        "info": "Volume 19, 2007",
        "count": 19,
        "papers": [
            "How software process automation affects software evolution: a longitudinal empirical analysis.",
            "The process of software maintenance: a comparison of object-oriented and third-generation development languages.",
            "Indicating ontology data quality, stability, and completeness throughout ontology evolution.",
            "A survey and taxonomy of approaches for mining software repositories in the context of software evolution.",
            "The application of product measures in directing software maintenance activity.",
            "Parametric Fortran: program generation in scientific computing.",
            "Experience report on using object-oriented design for software maintenance.",
            "Special issue on source code analysis and manipulation (SCAM 2006).",
            "An empirical study of rules for well-formed identifiers.",
            "Automatic construction of accurate application call graph with library call abstraction for Java.",
            "AVal: an extensible attribute-oriented programming validator for Java.",
            "Special Issue on Web Site Evolution (WSE 2006).",
            "Identifying similar pages in Web applications using a competitive clustering algorithm.",
            "The design and use of WSDL-Test: a tool for testing Web services.",
            "Mining evolutionary dependencies from web-localization repositories.",
            "How design notations affect the comprehension of Web applications.",
            "Software evolution in open source projects - a large-scale investigation.",
            "An MDA-based approach for database re-engineering.",
            "Empirical-based recovery and maintenance of input error-correction features."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2006",
        "info": "Volume 18, 2006",
        "count": 20,
        "papers": [
            "Evolution in software systems: foundations of the SPE classification scheme.",
            "On the effectiveness of clone detection by string matching.",
            "IEEE International Conference on Software Maintenance (ICSM2005).",
            "Supporting the analysis of clones in software systems.",
            "How do APIs evolve? A story of refactoring.",
            "Refactoring a legacy component for reuse in a software product line: a case study.",
            "Integrated development and maintenance for the release, delivery, deployment, and customization of product software: a case study in mass-market ERP software.",
            "Automatic support for the alignment of multilingual Web sites.",
            "A component-based approach to online software evolution.",
            "Modeling history to analyze software evolution.",
            "Assessing design instability in iterative (agile) object-oriented projects.",
            "Unifying clones with a generative programming technique: a case study.",
            "Organizational evolution of digital signal processing software development.",
            "Managing Corporate Information Systems Evolution and Maintenance.",
            "Indirectly predicting the maintenance effort of open-source software.",
            "Measuring the complexity of class diagrams in reverse engineering.",
            "Continuous evolution through software architecture evaluation: a case study.",
            "An influence model for factors in outsourced software maintenance.",
            "Analyzing software evolution through feature views.",
            "Industrial tools for the feature location problem: an exploratory study."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2005",
        "info": "Volume 17, 2005",
        "count": 17,
        "papers": [
            "Analyzing the Evolution of Large-Scale Software.",
            "Architectural support in industry: a reflection using C-POSH.",
            "Automating regression testing for evolving GUI software.",
            "An approach to the measurement of software evolution.",
            "A database evolution taxonomy for object-oriented databases.",
            "Development and evolution of a heterogeneous continuous media server: a case study.",
            "Reusing class-based test cases for testing object-oriented framework interface classes.",
            "Software Maintenance Maturity Model (SMmm): the software maintenance process model.",
            "Assessing the capability of internal metrics as early indicators of maintenance effort through experimentation.",
            "Formalizing refactorings with graph transformations.",
            "Design preservation over subsequent releases of a software product: a case study of Baan ERP.",
            "Unanticipated Software Evolution.",
            "Towards a taxonomy of software change.",
            "KERIS: evolving software with extensible modules.",
            "Component composition errors and update atomicity: static analysis.",
            "Software vulnerability mitigation as a proper subset of software maintenance.",
            "Pair designing as practice for enforcing and diffusing design knowledge."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2004",
        "info": "Volume 16, 2004",
        "count": 20,
        "papers": [
            "Web Site Evolution.",
            "Modelling the evolution of legacy systems to Web-based systems.",
            "On the business value and technical challenges of adopting Web services.",
            "Migrating to Web services: a performance engineering approach.",
            "Reverse engineering Web applications: the WARE approach.",
            "Statistical testing of Web applications.",
            "Analysis of Web-usage behavior for focused Web sites: a case study.",
            "Displaying dependence graphs: a hierarchical approach.",
            "Hypertext support for the information needs of software maintainers.",
            "Seventh European Conference on Software Maintenance and Reengineering (CSMR 2003).",
            "Revitalizing modifiability of legacy assets.",
            "An assessment strategy for identifying legacy system evolution requirements in eBusiness context.",
            "A debugging strategy based on the requirements of testing.",
            "Problems within front-end support.",
            "Improving design quality using meta-pattern transformations: a metric-based approach.",
            "Analyzing the Evolution of Large-Scale Software.",
            "Using software trails to reconstruct the evolution of software.",
            "Visualizing feature evolution of large-scale software based on problem and modification report data.",
            "A metrics suite for grammar-based software.",
            "Expectation-based, inference-based, and bottom-up software comprehension."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2003",
        "info": "Volume 15, 2003",
        "count": 19,
        "papers": [
            "Process diversity.",
            "Latitudinal and longitudinal process diversity.",
            "Tailoring the software maintenance process to better support complex systems evolution projects.",
            "Test processes in software product evolution - a qualitative survey on the state of practice.",
            "Maintaining electronic commerce systems: the legal issues.",
            "The software maintenance project effort estimation model based on function points.",
            "Software visualization in software maintenance, reverse engineering, and re-engineering: a research survey.",
            "Integrating diverse paradigms in evolution and maintenance by an XML-based unified model.",
            "Architecture-based semantic evolution of embedded remotely controlled systems.",
            "Determinants of software volatility: a field study.",
            "Feed-forward and recurrent neural networks for source code informal information analysis.",
            "A case study on the adaptive maintenance of an Internet application.",
            "A user-assisted approach to component clustering.",
            "Observe-mine-adopt (OMA): an agile way to enhance software maintainability.",
            "An effective strategy for legacy systems evolution.",
            "Dimensions of reengineering environment infrastructures.",
            "Advances in Software Maintenance Management: Technologies and Solutions.",
            "Automated elicitation of inclusion dependencies from the source code for database transactions.",
            "Guaranteed inconsistency avoidance during software evolution."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2002",
        "info": "Volume 14, 2002",
        "count": 22,
        "papers": [
            "Piecemeal legacy migrating with an architectural pattern language: a case study.",
            "Field studies using functional size measurement in building estimation models for software maintenance.",
            "An empirical study of the influence of departmentalization and organizational position on software maintenance.",
            "Experimental evaluation of hypertext access structures.",
            "Maintenance issues in the Web site development process.",
            "Impact of experience on maintenance skills.",
            "Metrics for maintainability of class inheritance hierarchies.",
            "Predicting project delivery rates using the Naive-Bayes classifier.",
            "Testing and maintaining de-localized software systems in a multi-site environment using Web-based tools.",
            "Problem management maturity within corrective maintenance.",
            "Automating the management of software maintenance workflows in a large software enterprise: a case study.",
            "Graph-based tools for re-engineering.",
            "A semantic entropy metric.",
            "Separation of concerns for software evolution.",
            "Change impact analysis to support architectural evolution.",
            "Behavioural modelling of long-lived evolution processes - some issues and an example.",
            "Separating computation, coordination and configuration.",
            "Relating functional requirements and software architecture: separation and consistency of concerns.",
            "Evolving hypermedia systems: a layered software architecture.",
            "A model of factors affecting an information system's change in state.",
            "Identifying high maintenance legacy software.",
            "Consistent database sampling as a database prototyping approach."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2001",
        "info": "Volume 13, 2001",
        "count": 23,
        "papers": [
            "Announcement.",
            "Types of software evolution and software maintenance.",
            "A concept-oriented belief revision approach to domain knowledge recovery from source code.",
            "An approach for extracting code fragments that implement functionality from source programs.",
            "MANTOOL: a tool for supporting the software maintenance process.",
            "Case study: a maintenance practice used with real-time telecommunications software.",
            "A case study in repeated maintenance.",
            "Software Maintenance: Concepts and Practice.",
            "Evaluation of a scenario-based reading technique for analysing process components.",
            "Modelling fault-proneness statistically over a sequence of releases: a case study.",
            "Interview with Girish Parikh.",
            "Function-point analysis using design specifications based on the Unified Modelling Language.",
            "A model of factors affecting an information system's change in state.",
            "Computing ripple effect for software maintenance.",
            "Ageing of a data-intensive legacy system: symptoms and remedies.",
            "Inference of object-oriented design patterns.",
            "An improved method of selecting regression tests for C++ programs.",
            "Large packaged application software maintenance: a research framework.",
            "Emergent maintenance of ERP: new roles and relationships.",
            "Characteristics of ERP software maintenance: a multiple case study.",
            "The maintenance implications of the customization of ERP software.",
            "A decision framework for enterprise resource planning maintenance and upgrade: A client perspective.",
            "Policy analysis for warranty, maintenance, and upgrade of software systems."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "2000",
        "info": "Volume 12, 2000",
        "count": 19,
        "papers": [
            "Preventive actions for residual Y2K defects: a case study.",
            "A maintenance-oriented approach to software construction.",
            "Measure-driven processes and architecture for the empirical evaluation of software technology.",
            "Stability assessment of evolving industrial object-oriented frameworks.",
            "Software maintenance from a service perspective.",
            "Pattern-based software reengineering: a case study.",
            "Maintaining a legacy: towards support at the architectural level.",
            "Evaluating regression test suites based on their fault exposure capability.",
            "Review of Frank Niessink's thesis.",
            "Review of Perspectives on Improving Software Maintenance by Frank Niessink.",
            "Abstraction: a key notion for reverse engineering in a system reengineering approach.",
            "Test case selection for simulations in the maintenance of real-time systems.",
            "Practical Software Maintenance.",
            "Software problem reporting and resolution process at ABB Robotics AB: state of practice.",
            "Deriving fault architectures from defect history.",
            "Object localization in procedural programs: a graph-based approach.",
            "A formal approach for component retrieval and integration analysis.",
            "Metrics in the development and maintenance of software: an application in a large scale environment.",
            "Complex COTS-based software systems: practical steps for their maintenance."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1999",
        "info": "Volume 11, 1999",
        "count": 20,
        "papers": [
            "Which Software Modules have Faults which will be Discovered by Customers?",
            "Simulated Annealing and Genetic Algorithms for Optimal Regression Testing.",
            "Experimental Evaluation of Agreement among Programmers in Applying the Rules of Cohesion.",
            "Design Metrics as an Aid to Software Maintenance: An Empirical Study.",
            "An evaluation of the cognitive processes of programmers engaged in software debugging.",
            "Automated regression testing using DBT and Sleuth.",
            "Variable-precision reaching definitions analysis.",
            "Disposable information systems: the future of software maintenance?",
            "Application of cluster algorithms for batching of proposed software changes.",
            "Dynamic analysis methods for the year 2000 problem.",
            "Isolating faults in complex COTS-based systems.",
            "Recovering software architecture from the names of source files.",
            "Removing clones from the code.",
            "A quantitative framework for software restructuring.",
            "Software process improvement: practical guidelines for business success, Addison Wesley Longman, UK, 1997, 447 pp.",
            "An examination of the effects of requirements changes on software maintenance releases.",
            "VSAM conversion for COBOL programs.",
            "ART: an architectural reverse engineering environment.",
            "Towards an ontology of software maintenance.",
            "Evolution in software product lines: two cases."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1998",
        "info": "Volume 10, 1998",
        "count": 19,
        "papers": [
            "New co-editor and board members.",
            "Business rule extraction techniques for COBOL programs.",
            "Traceability aspects of impact analysis in object-oriented systems.",
            "Attitudes of maintenance personnel towards maintenance work: a comparative analysis.",
            "Little languages: little maintenance?",
            "Using application understanding to support impact analysis.",
            "Debugging program failure exhibited by voluminous data.",
            "Assessing software maintenance tool utilization using task-technology fit and fitness-for-use models.",
            "An incremental approach to software systems re-engineering.",
            "Framework for tool evaluation for a maintenance environment.",
            "Incremental delivery reduces maintenance cost: a COCOMO-based study.",
            "Q-MOPP: qualitative evaluation of maintenance organizations, processes and products.",
            "Documentu:  a flexible architecture for documentation production based on a reverse-engineering strategy.",
            "An evaluation of reverse engineering tool capabilities.",
            "Building infrastructure for fixing the year 2000 bug: a case study.",
            "Model-based design of reverse engineering tools.",
            "Training for software maintenance.",
            "Knowledge base clustering for KBS maintenance.",
            "A new algorithm for slicing unstructured programs."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1997",
        "info": "Volume 9, 1997",
        "count": 20,
        "papers": [
            "Porting COBOL Programs Using a Transformational Approach.",
            "On Program Dicing.",
            "GOTO Removal Based on Regular Expressions.",
            "An Empirical Study of Software Reuse in Reconstructive Maintenance.",
            "Model-based Assessments Applied to Software Maintenance Processes.",
            "MSE: A Methodology for Software Evolution.",
            "Development and Application of an Automated Source Code Maintainability Index.",
            "A Method for Estimating Maintenance Cost in a Software Project: A Case Study.",
            "Interview with David E. Peercy.",
            "Maintenance of COTS-intensive software systems.",
            "A technique for the selective revalidation of OO software.",
            "Determinants of software maintenance profiles: an empirical investigation.",
            "Interview with Takashi Sano.",
            "Software licensing models amid market turbulence.",
            "A quantitative comparison of perfective and corrective software maintenance.",
            "Program understanding behaviour during enhancement of large-scale software.",
            "Using COBOL defensive traps.",
            "Using risk analysis to manage software maintenance.",
            "Software maintenance management strategies: observations from the field.",
            "Software maintenance and global competitiveness."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1996",
        "info": "Volume 8, 1996",
        "count": 21,
        "papers": [
            "DECODE: A Co-operative Program Understanding Environment.",
            "Regression Control Charts to Manage Software Maintenance.",
            "From Software Configuration to Application Management - Improving the Maturity of the Maintenance of Embedded Software.",
            "Defining and Implementing a Measurement-based Software Maintenance Process.",
            "Effective Size: An Example of Use from Legacy Systems.",
            "Reverse Engineering Distributed Algorithms.",
            "A Specification Driven Slicing Process for Identifying Reusable Functions.",
            "Offshore Software Maintenance Methodology.",
            "Software Metrics and Microcode: A Case Study.",
            "The GUMP Process for Software Maintenance and Maintenance Education.",
            "An Exploratory Study of Common Coding Faults in C Progams.",
            "Live Shortand Prosper: Applying Cost Analysis to Routine Software Maintenance Procedures.",
            "Evolutionary Method of Delivery as Applied to a Large Re-engineering Effort.",
            "A Risk Index for Software Producers.",
            "Methodologies and Software Maintenance.",
            "Methods of Measuring Software Reuse for the Prediction of Maintenance Effort.",
            "Converting From Mainframe to Client/Server at Telogy Inc.",
            "Improving the Maintainability of Software.",
            "Identifying Polymorphism Change and Impact in Object-orientated Software Maintenance.",
            "A Toolset for Maintaining Hybrid C++ Programs.",
            "A Software Tool for Maintaining File and Macro Build Dependencies."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1995",
        "info": "Volume 7, 1995",
        "count": 32,
        "papers": [
            "Announcement.",
            "Resolving the software maintenance paradox.",
            "An empirical study of software maintenance tasks.",
            "Software reconnaissance: Mapping program features to code.",
            "Maintenance management: From product to process.",
            "Announcement.",
            "Measuring the readability and maintainability of hyperdocuments.",
            "Decision-driven Maintenance.",
            "A road map for migrating legacy systems to client/server.",
            "An empirical study of maintenance activities in two object-oriented systems.",
            "Announcement.",
            "A new algorithm for the calculation of transitive dependences.",
            "Context-dependent flow-sensitive interprocedural dataflow analysis.",
            "Formal methods for legacy systems.",
            "Software inspection, Tom Gilb and Dorothy Graham, Addison Wesley, 1993 ISBN 0-20163181-4 Price £24.95 (paperback).",
            "Announcement.",
            "An examination of software maintenance practices in a U.S. government organization.",
            "Program view generation and change analysis using attributed dependency graphs.",
            "Measurement of functional reuse in maintenance.",
            "Improving reverse-engineering through the use of multiple knowledge sources.",
            "Announcement.",
            "Interview with E. Burton Swanson.",
            "Assessing modularization and code scavenging techniques.",
            "Software maintenance - an industrial experience.",
            "Abstraction refinement: A model of software evolution discussion by M. Ward.",
            "Reply to discussion by B. Keller and R. Nance.",
            "Again, that maintenance 'iceberg'.",
            "Announcement.",
            "On the distinction between functional development and functional maintenance.",
            "Understanding software through numbers: A metric based approach to program comprehension.",
            "A survey instrument for understanding the complexity of software maintenance.",
            "A definition of abstraction."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1994",
        "info": "Volume 6, 1994",
        "count": 23,
        "papers": [
            "Software configuration management issues in the maintenance of existing systems.",
            "A semantics-based method for revalidating modified programs.",
            "An early impact analysis technique for software maintenance.",
            "RE2: Reverse-engineering and reuse re-engineering.",
            "A software maintenance management model based on queueing networks.",
            "Independent verification and validation, Robert O. Lewis. John Wiley & Sons, Chichester, 1992, ISBN 0-971-57011-7. Price: £47.50.",
            "Sofware quality: Theory and management, A.C. Gillies. Chapman & Hall, Andover, 1992, ISBN 0-412-951301. Price: £19.95.",
            "The cleanroom approach to software quality development, Michael Dyer. John Wiley & Sons, Chichester, 1992, ISBN 0471-54823-5. Price: £23.50.",
            "Methods and tools for software configuration management, D. Whitgift. John Wiley & Sons, Chichester, 1991, ISBN 0471 929 409. Price: £29.95.",
            "Object oriented design, P. Robinson. Unicom Applied Technology, Chapman and Hall, Andover, 1992, ISBN 041 240 5202. Price: £65.",
            "An investigation into software maintenance - Perception and practices.",
            "A decision model to choose between software maintenance and software redevelopment.",
            "A design for information systems which can adapt to changing organizational requirements.",
            "Geriatric care for aging software, T. Capers Jones in Knowledge Base 1, 1 (May 1992). Software Productivity Research Inc, Burlington, MA. ISSN none. Price: free.",
            "Testing computer software, Cem Kaner, Jack Falk and Hung Quoc Nguyen, Second edition, Van Nostrand Reinhold, 1993. ISBN 0-442-01361-2. £25.00.",
            "Reusability in software maintenance: A Japan - USA comparison.",
            "The economic impact of software reuse on maintenance.",
            "Inverse-engineering a simple real-time program.",
            "Downsizing large application programs.",
            "A new approach to finding objects in programs.",
            "An object finder for program structure understanding in software maintenance.",
            "Life-cycle approach to strategic re-engineering of software.",
            "Cooperative work in large-scale software systems."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1993",
        "info": "Volume 5, 1993",
        "count": 15,
        "papers": [
            "Total quality management for maintenance process improvement.",
            "Reverse-engineering Cobol via formal methods.",
            "pRETS: A parallel reverse-engineering toolset for FORTRAN.",
            "Software metrics: A rigorous approach, Norman E. Fenton. Chapman & Hall (London) 1991. ISBN 0 412 48440 0. Price £19.95 (paperback).",
            "Sofiware sizing and estimating MKII FPA, Charles R. Symons. John Wiley & Sons (Chichester). ISBN 0 471 92985 9. Price £36.50 (hardback).",
            "Sofiware design techniques for large Ada systems, W. E. Byme. Digital Press (Prentice Hall, Hemel Hempstead). ISBN 0 138 16174 7. Price £39.00 (hardback).",
            "Measurement of the maintenance process from a demand-based perspective.",
            "Software maintenance characteristics and effective management.",
            "Abstracting a specification from code.",
            "Abstraction refinement: A model of software evolution.",
            "Specifications and reverse-engineering.",
            "Data linkage maps.",
            "Business domain knowledge libraries to support software maintenance activities.",
            "A reverse-engineering approach to subsystem structure identification.",
            "From programs to object code and back again using logic programming: Compilation and decompilation."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1992",
        "info": "Volume 4, 1992",
        "count": 15,
        "papers": [
            "Intelligent search and acquisition of business knowledge from programs.",
            "A conceptual design for a code analysis knowledge base.",
            "Reverse-engineering and intermodular data flow: A theoretical approach.",
            "Athena: A software measurement and metrics environment.",
            "The maintenance problem of application software: An empirical analysis.",
            "A framework for software maintenance: A foundation for scientific inquiry.",
            "A formal approach to perfective software maintenance: Integration using a basis.",
            "Document quality indicators: A framework for assessing documentation adequacy.",
            "On the re-engineering of transaction systems.",
            "Report on the conference on software maintenance 1991, Sorrento, Italy, 14-17 october 1991.",
            "New co-editor for journal of software maintenance.",
            "Application of automatic decomposition schemes in proof maintenance for evolving programs.",
            "MACS: Maintenance assistance capability for software.",
            "Capturing design and maintenance decisions with MACS.",
            "Software Maintenance: 1990 status."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1991",
        "info": "Volume 3, 1991",
        "count": 16,
        "papers": [
            "Characteristics of empirical software maintenance studies: 1980-1989.",
            "Decision-based software development.",
            "Report on the fourth European software maintenance workshop.",
            "Reverse Engineering: Markets, Methods and Tools, Rosemary Rock-Evans and Keith Hales. Published by OVUM Ltd (7 Rathbone Street, London. Tel: 071 255 2670), 1990. ISBN 0 903969 53 X, 750 pages, 2 volumes. Price: £995 (U$1850) cased.",
            "European special interest group in software maintenance.",
            "Editorial.",
            "An approach for developing an integrated modelling environment: A case investigation.",
            "Towards a model of programmers' cognitive processes in software maintenance: A structural learning theory approach for debugging.",
            "Window user interfaces and software maintenance.",
            "Conference on software maintenance - 1990: A report.",
            "Predicting maintainability with software quality metrics.",
            "Creating specifications from code: Reverse-engineering techniques.",
            "Economics of software re-engineering.",
            "The role of symbolic execution in software maintenance.",
            "A specification-based approach to maintenance.",
            "Design metrics and software maintainability: An experimental investigation."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1990",
        "info": "Volume 2, 1990",
        "count": 15,
        "papers": [
            "A model for assembly program maintenance.",
            "Lurking within COBOL PERFORMs.",
            "Modelling and maintenance software systems at the teleological level.",
            "Producing better maintainable JSD specifications by grouping common aspects.",
            "Practice case study.",
            "SOFTM: A software maintenance expert system in Prolog.",
            "On the benefits and difficulties of a maintainability via metrics methodology.",
            "Software metrics and software maintenance.",
            "Conference on software maintenance - 1989: A reprot.",
            "Cognitive approach to systems engineering and re-engineering: Integrating new designs with old systems.",
            "Software maintenance management: Changes in the last decade.",
            "Problems of maintenance of JSP structures.",
            "Enhancements through design transformations: A retroactive case study.",
            "Insights into testing and regression testing global variables.",
            "Measures for maintenance management: A case study."
        ]
    },
    {
        "name": "Journal of Software： Evolution and Process",
        "year": "1989",
        "info": "Volume 1, 1989",
        "count": 9,
        "papers": [
            "Editorial.",
            "Uncertainty in computer application and its control through the engineering of software.",
            "Altering without change.",
            "Organizational foundations for maintenance.",
            "Dynamic program updating: A software maintenance technique for minimizing software, downtime.",
            "Two module factoring techniques.",
            "Software enhancement modelling.",
            "Harmonizing the development, maintenance and enhancement of application systems.",
            "Dynamic change management and Ada."
        ]
    }
]