[
    {
        "name": "JWE",
        "year": "2022",
        "info": "Volume 21: 2022",
        "count": 31,
        "papers": [
            "Editorial: Scalable and Dynamic Big Data Processing and Service Provision in Edge Cloud Environments.",
            "JITA4DS: Disaggregated Execution of Data Science Pipelines Between the Edge and the Data Centre.",
            "GAIN-QoS: A Novel QoS Prediction Model for Edge Computing.",
            "Using Federated Learning to Achieve Proactive Context-Aware IoT Environments.",
            "In-Network Convolution in Grid Shaped Sensor Networks.",
            "Spatial Path Selection and Network Topology Optimisation in P2P Anonymous Routing Protocols.",
            "Morpheus Web Testing: A Tool for Generating Test Cases for Widget Based Web Applications.",
            "Evaluating Annotated Dataset of Customer Reviews for Aspect Based Sentiment Analysis.",
            "Efficient Pre-Processing Techniques for Improving Classifiers Performance.",
            "Semantic Based Weighted Web Session Clustering Using Adapted K-Means and Hierarchical Agglomerative Algorithms.",
            "Side-channel Attack Using Word Embedding and Long Short Term Memories.",
            "Mining Simple Path Traversal Patterns in Knowledge Graph.",
            "RealTE: Real-time Trajectory Estimation Over Large-Scale Road Networks.",
            "Credibility Evaluation of Web Big Data Information Based on Particle Swarm Optimization.",
            "Video Face Detection Based on Improved SSD Model and Target Tracking Algorithm.",
            "Time-Sensitive Satellite Internet Based on Uniform Content Labels.",
            "Botnet Attack Detection Using A Hybrid Supervised Fast-Flux Killer System.",
            "A Scheme of Selecting Vehicles to Assist Download Based on WebGIS for VANET.",
            "Hybrid CTC-Attention Network-Based End-to-End Speech Recognition System for Korean Language.",
            "Performance of Digital Drone Signage System Based on DUET.",
            "Enhancement of 3D Point Cloud Contents Using 2D Image Super Resolution Network.",
            "Contactless Elevator Button Control System Based on Weighted K-NN Algorithm for AI Edge Computing Environment.",
            "Image Link Through Adaptive Encoding Data Base and Optimized GPU Algorithm for Real-time Image Processing of Artificial Intelligence.",
            "Convolutional Neural Networks Using Log Mel-Spectrogram Separation for Audio Event Classification with Unknown Devices.",
            "A New Semi-Automated Method for Service Identification.",
            "Differential and Access Policy Based Privacy-Preserving Model in Cloud Environment.",
            "A Hybrid Recommendation System Based on the Supply Chain in Social Networks.",
            "Video Streaming Based on Blockchain State Channel with IoT Camera.",
            "AMR-CNN: Abstract Meaning Representation with Convolution Neural Network for Toxic Content Detection.",
            "An Efficient and Secure Authentication for Ambient Assisted Living System.",
            "Effective Algorithm to Control Depth Level for Performance Improvement of Sound Tracing."
        ]
    },
    {
        "name": "JWE",
        "year": "2021",
        "info": "Volume 20: 2021",
        "count": 105,
        "papers": [
            "Enhance the ICS Network Security Using the Whitelist-based Network Monitoring Through Protocol Analysis.",
            "Modified Firefly Algorithm and Fuzzy C-Mean Clustering Based Semantic Information Retrieval.",
            "Improved IDR Response System for Sensor Network.",
            "Data Analysis for Thermal Disease Wearable Devices.",
            "Development of Converged Device-Based Exercise Program for Preventing Fall and Increasing Physical Activity for the Elderly.",
            "Theoretical and Empirical Analysis of Crime Data.",
            "Suspicious Action Detection in Intelligent Surveillance System Using Action Attribute Modelling.",
            "Keyframe Generation Method via Improved Clustering and Silhouette Coefficient for Video Summarization.",
            "Detecting APT Attacks Based on Network Traffic Using Machine Learning.",
            "Chirp Spreading Spectrum in Imperfect Environment and Wireless Tree Topology Network.",
            "An Ontology Representation Language for Multimedia Event Applications.",
            "Intelligent Model-based Integrity Assessment of Nonstationary Mechanical System.",
            "Machine Learning Modeling: A New Way to do Quantitative Research in Social Sciences in the Era of AI.",
            "A New Collaborative Filtering Approach Based on Game Theory for Recommendation Systems.",
            "Enriching Web Services Tags to Improve Data-Driven Web Services Composition.",
            "Distributed Energy Transaction Model Based on the Alliance Blockchain in Case of China.",
            "Construction and Application of the User Behavior Knowledge Graph in Software Platforms.",
            "Trajectory Data Restoring: A Way of Visual Analysis of Vessel Identity Base on OPTICS.",
            "A General Framework of LSTM and Transfer Learning Based CFDAMA Strategy in Broadband Satellite System.",
            "News Recommendation Systems in the Era of Information Overload.",
            "A High Autonomous Sea Front Detection Algorithm Based on SAR Data.",
            "Application Research of Tethered UAV Platform in Marine Emergency Communication Network.",
            "Design and Analysis of Low Delay Deterministic Network Based on Data Mining Association Analysis.",
            "Dynamic Recognition and Tracking of Barium Flow Field Based on Deglutition Video.",
            "Design and Implementation of Smart Ocean Visualization System Based on Extended Reality Technology.",
            "Recognition Method of Abnormal Behavior of Marine Fish Swarm Based on In-Depth Learning Network Model.",
            "Fine-Grained User Location Prediction using Meta-Path Context with Attention Mechanism.",
            "An Algorithm with Efficiently Collecting and Aggregating Data for Wireless Sensor Networks.",
            "Information Credibility Evaluation in Presence of Users' Safety in New Retailing.",
            "Joint Representations of Texts and Labels with Compositional Loss for Short Text Classification.",
            "Research on Data Release and Location Monitoring Technology of Sensor Network Based on Internet of Things.",
            "Key Distribution Strategy of Wireless Sensor Network Based on Multi-Hash Chain.",
            "Research on Outlier Detection for High-Dimensional Data Based on PPCLOF.",
            "Multi-Rhythm Capsule Network Recognition Structure for Motor Imagery Classification.",
            "Digital Forensics Security Analysis on iOS Devices.",
            "News Article Based Industry Risk Index Prediction for Industry-Specific Evaluation.",
            "A Prescriptive Model for Migration to Microservices Based on SDLC Artifacts.",
            "Rice Disease Recognition Using Effective Deep Neural Networks.",
            "Crawling the Deep Web Using Asynchronous Advantage Actor Critic Technique.",
            "Bayesian Probability and Tanimoto Based Recurrent Neural Network for Question Answering System.",
            "Secure Browsing in Local Government: The Case of Portugal.",
            "A New Semantic Approach to Improve Webpage Segmentation.",
            "Creating and Capturing Artificial Emotions in Autonomous Robots and Software Agents.",
            "An An Empirical Study of Web Page Structural Properties.",
            "Geospatially Partitioning Public Transit Networks for Open Data Publishing.",
            "Optimal Design of Electrical Capacitance Tomography Sensor and Improved ART Image Reconstruction Algorithm Based On the Internet of Things.",
            "Application of the LDA Model to Semantic Annotation of Web-based English Educational Resources.",
            "Wireless Sensor Network Node Localization Algorithm Based on PSO-MA.",
            "Photographic Image Intelligent Fuzzy Assistant Teaching System Based on Augmented Reality and Web.",
            "Multi-image Reorganization Encryption Based on S-L-F Cascade Chaos and Bit Scrambling.",
            "Research on Web Data Mining Based on Topic Crawler.",
            "Integration of \"Offline + Online\" Teaching Method of College English Based on Web Search Technology.",
            "Named Entity Recognition with Gating Mechanism and Parallel BiLSTM.",
            "A Deep Convolutional Neural Network to Limit Virus Spread Using Facial Mask Segmentation.",
            "A Probability Distribution and Location-aware ResNet Approach for QoS Prediction.",
            "Patterns for Migration of SOA Based Applications to Microservices Architecture.",
            "Transformation Approach of Open Web Data to Linked Open Data.",
            "Web Usage Mining by Neural Hybrid Prediction with Markov Chain Components.",
            "Performance Analysis of Routing Protocols On IPv4 and IPv6 Addressing Networks.",
            "Managing Factors to Stages of the Online Customer Journey Influence on Brand Trust.",
            "Comparisons of Machine Learning Methods of Statistical Downscaling Method: Case Studies of Daily Climate Anomalies in Thailand.",
            "Blockchain-Based Access Control and Data Sharing Mechanism in Cloud Decentralized Storage System.",
            "Elastic Performance Test Method of Web Server in Cloud Computing Environment.",
            "Intrusion Detection Using Few-shot Learning Based on Triplet Graph Convolutional Network.",
            "Research on data fusion method of multi-source complex system.",
            "Research on End-to-end Voiceprint Recognition Model Based on Convolutional Neural Network.",
            "Web Service Access Control Based on Browser Fingerprint Detection.",
            "Hot-Rolled, Heavy-Rail Image Recognition Based on Deep-Learning Network.",
            "The Collaborative Production Management System of Power Enterprises Based on Online Information Sharing.",
            "Unified Model for Learning Style Recommendation.",
            "A Survey of Ontologies and Their Applications in e-Learning Environments.",
            "Internet of Things (IoTs) Security: Intrusion Detection using Deep Learning.",
            "An Efficient Method for Automatic Antipatterns Detection of REST Web Services.",
            "Water Moth Search Algorithm-based Deep Training for Intrusion Detection in IoT.",
            "ARMPatch: A Binary Patching Framework for ARM-based IoT Devices.",
            "The Application of Artificial Intelligence Technology in Cloud Computing Environment Resources.",
            "A Novel Negative Sampling Based on Frequency of Relational Association Entities for Knowledge Graph Embedding.",
            "Research on Mining and Application of Group Events Based on Network Public Opinion Big Data.",
            "A Study on Hybrid Hierarchical Network Representation Learning.",
            "A K-means Text Clustering Algorithm Based on Subject Feature Vector.",
            "A New Geometric Data Perturbation Method for Data Anonymization Based on Random Number Generators.",
            "Research on the Design of Mass Recommendation System Based on Lambda Architecture.",
            "Lossless Compression Algorithm and Architecture for Reduced Memory Bandwidth Requirement with Improved Prediction Based on the Multiple DPCM Golomb-Rice Algorithm.",
            "Special Issue on Advanced Practices in Web Engineering 2021.",
            "Comparing Voice Assistant Risks and Potential with Technology-Based Users: A Study from Germany and Spain.",
            "Development of Digital Libraries with Software Product Line Engineering.",
            "Blockchain Smart Contract Meta-modeling.",
            "An MDA Proposal To Integrate the Measurement Lifecycle Into the Process Lifecycle.",
            "Knowledge Based Deep Inception Model for Web Page Classification.",
            "F-ONTOCOM: A Fuzzified Cost Estimation Approach for Ontology Engineering.",
            "T-DSES: A Blockchain-powered Trusted Decentralized Service Eco-System.",
            "Towards the Importance of the Type of Deep Neural Network and Employment of Pre-trained Word Vectors for Toxicity Detection: An Experimental Study.",
            "Dynamic Resource Allocation Method for Load Balance Scheduling Over Cloud Data Center Networks.",
            "Efficient Retrieval of Data Using Semantic Search Engine Based on NLP and RDF.",
            "Deep Learning-Based Encrypted Network Traffic Classification and Resource Allocation in SDN.",
            "How to Retrieve Music using Mood Tags in a Folksonomy.",
            "Sibelius as a Tool to Improve Student's Ability of Making Counterpoint Melody.",
            "Tiny Drone Tracking Framework Using Multiple Trackers and Kalman-based Predictor.",
            "Enhanced Real-Time Intermediate Flow Estimation for Video Frame Interpolation.",
            "Delay and Energy Consumption Optimization Oriented Multi-service Cloud Edge Collaborative Computing Mechanism in IoT.",
            "Analysis and Mining of Internet Public Opinion Based on LDA Subject Classification.",
            "Research on the Methods and Key Techniques of Web Archive Oriented Social Media Information Collection.",
            "A Novel Automated Guided Vehicle (AGV) Remote Path Planning Based on RLACA Algorithm in 5G Environment.",
            "Research on Semantic Similarity of Short Text Based on Bert and Time Warping Distance.",
            "A Novel Processing Model for P300 Brainwaves Detection."
        ]
    },
    {
        "name": "JWE",
        "year": "2020",
        "info": "Volume 19: 2020",
        "count": 32,
        "papers": [
            "On Modelling for Bias-Aware Sentiment Analysis and Its Impact in Twitter.",
            "Lightweight Messaging for Efficient Service Discovery in Mobile IoT Environments Using Hierarchical Bloom Filters.",
            "A Checklist for the Evaluation of Web Accessibility and Usability for Brazilian Older Adults.",
            "Special Issue on Advanced Practices in Web Engineering 2020.",
            "LiveSankey: Advanced Web Visualization in Data Intelligence Multi Domain Contexts.",
            "A Human-centric and Environment-aware Testing Framework for Providing Safe and Reliable Cyber-Physical System Services.",
            "Developing Web-based Geographic Information Systems with a DSL: Proposal and Case Study.",
            "Machine Learning and Semantic Orientation Ensemble Methods for Egyptian Telecom Tweets Sentiment Analysis.",
            "The Importance of Testing in the Early Stages of Smart Contract Development Life Cycle.",
            "Applying Importance-Performance Analysis (IPA) to Interpret the Results of the User Experience Questionnaire (UEQ).",
            "FlakyLoc: Flakiness Localization for Reliable Test Suites in Web Applications.",
            "A Testability and Observability Framework to Assure Traceability Requirements on System of Systems.",
            "A Unified Model Representation of Machine Learning Knowledge.",
            "A Metrics Framework for Evaluating Microservices Architecture Designs.",
            "GenDE: A CRF-Based Data Extractor.",
            "GitHubNet: Understanding the Characteristics of GitHub Network.",
            "Abstract Concept Instantiation with Context Relevance Measurement.",
            "Information Flow Control with Decentralized Labeling Model in Information Security \"In Prepress\".",
            "DYNAMIC QUERY PROCESSING FOR HIDDEN WEB DATA EXTRACTION FROM ACADEMIC DOMAIN \"In Prepress\".",
            "Scheduling Algorithm Based on Heterogeneity and Confidence for Mimic Defense \"In Prepress\".",
            "An Optimized Algorithm to Construct QC-LDPC Matrix in Compressed Sensing \"In Prepress\".",
            "Research on Indoor Wireless Positioning Precision Optimization Based on UWB \"In Prepress\".",
            "Fault-tolerant and congestion balanced routing algorithm for 2D mesh NoCs \"In Prepress\".",
            "Robust Optimization of Best-worst Multi-criteria Decision-making Method \"In Prepress\".",
            "Artificial Neural Network Controller for Automatic Ship Berthing Using Separate Route \"In Prepress\".",
            "Eye Tracking and ROI Detection within a Computer Screen Using a Monocular Camera \"In Prepress\".",
            "Model-based generation of Web Application Programming Interfaces to access open data \"In Prepress\".",
            "Dynamic Evaluation of Recommendation Trust in Open Networks \"In Prepress\".",
            "An Efficient Authentication Protocol for Wireless Mesh Networks \"In Prepress\".",
            "Compound Attack Prediction Method Based On Improved Algorithm Of Hidden Markov Model \"In Prepress\".",
            "Research On Network Security Situation Assessment And Forecasting Technology \"In Prepress\".",
            "Heterogeneous Identity Expression and Association Method Based on Attribute Aggregation \"In Prepress\"."
        ]
    },
    {
        "name": "JWE",
        "year": "2019",
        "info": "Volume 18: 2019",
        "count": 25,
        "papers": [
            "Integrating Semantic Run-Time Modelsfor Adaptive Software Systems.",
            "RiAiR: A Framework for Sensitive RDFProtection.",
            "A Boxology of Design Patterns forHybrid Learningand Reasoning Systems.",
            "Temporal Extensions to RDF.",
            "OPT+: A Monotonic Alternativeto OPTIONAL in SPARQL.",
            "Citation CountPrediction using Abstracts.",
            "LOD Construction Through SupervisedWeb Relation Extractionand Crowd Validation.",
            "Leveraging Conceptual Data Modelsto Ensure the Integrity of CassandraDatabases.",
            "A Semantic Web Approach to Enable a Smart Route to Historical Archives.",
            "A Brief Overview on the Strategiesto Fight Back the Spreadof False Information.",
            "Model-Driven Skills Assessmentin Knowledge Management Systems.",
            "Model-Driven Integration Testingof Hypermedia Systems.",
            "Traceability Management of Systems of Systems: A Systematic Reviewin the Assisted Reproduction Domain.",
            "Applying Feature-Oriented SoftwareDevelopment in SaaS Systems: RealExperience, Measurements, and Findings.",
            "Design Guidelines forWeb Interfacesof Home Automation SystemsAccessible via Screen Reader.",
            "PLEC, A Participative Processfor GUI Prototyping.",
            "Towards Improving Productivity in NMapSecurity Audits.",
            "Discovery and Analysis About the Evolutionof Service Composition Patterns.",
            "Ontology-Driven News Classification with Aethalides.",
            "Model Driven Development of Gamified Applications.",
            "Privacy-Preserving Reengineeringof Model-View-Controller ApplicationArchitectures Using Linked Data.",
            "Automatic Detection and Analysis of the \"Game Hack\" Scam.",
            "Multi-Device Complementary View Adaptation with Liquid Media Queries.",
            "On Twitter Bots Behaving Badly: A Manual and Automated Analysis of Python Code Patterns on GitHub.",
            "DotCHA: An Interactive 3D Text-based CAPTCHA."
        ]
    },
    {
        "name": "JWE",
        "year": "2018",
        "info": "Volume 17: 2018",
        "count": 27,
        "papers": [
            "A Framework for Product Description Classification in E-commerce.",
            "Text-Mining and Pattern-Matching based Prediction Models for Detecting Vulnerable Files in Web Applications.",
            "A Quantitative Analysis of the Use of Microdata for Semantic Annotations on Educational Resources.",
            "Semantic Emotion-Topic Model Based Social Emotion Mining.",
            "Unsupervised Keyword Extraction from Microblog Posts via Hashtags.",
            "A Graph Based Technique of Process Partitioning.",
            "Editorial.",
            "Challenges for the Adoption of Model-Driven Web Engineering Approaches in Industry.",
            "MARIA: A Process to Model Entity Reconciliation Problems.",
            "An Approach for Guesstimating the Deployment Cost in Cloud Infrastructures at Design Phase in Web Engineering.",
            "OntoNavShop: An Ontology-Based Approach for Web-Shop Navigation.",
            "Hidden Webpages Detection Using Distributed Learning Automata.",
            "Learning Style and Web Page Features.",
            "Filesync and Era Literaria: Realistic OpenSourceWebs To DevelopWeb Security Skills.",
            "Acquisition and Modelling of Short-TermUser Behaviour on theWeb: A Survey.",
            "STAFF: Automated Signature Generationfor Fine-Grained FunctionTraffic Identification.",
            "Enhancing theWeb WithAdvanced Engineering.",
            "The LiquidWebWorker API for Horizontal Offloading of Stateless Computations.",
            "Fine-grainedWeb Content Classificationvia Entity-level Analytics: The Case ofSemantic Fingerprinting.",
            "Evaluating the Effect of Developers'Personality and Productivity on theirIntention to Use Model-DrivenWebEngineering Techniques: An ExploratoryObservational Study.",
            "OakStreaming: A Peer-to-PeerVideo Streaming Library.",
            "Auto-Extraction and Integration ofMetrics forWeb User Interfaces.",
            "Trust and theWeb - A Decline or a Revival?",
            "Secure Semantic Smart HealthCare (S3HC).",
            "Data of SemanticWeb as Unit of Knowledge.",
            "A Novel Framework for Semantic OrientedAbstractive Text Summarization.",
            "A Review of Question Answering Systems."
        ]
    },
    {
        "name": "JWE",
        "year": "2017",
        "info": "Volume 16: 2017",
        "count": 29,
        "papers": [
            "A Model-based Approach for Describing Offline Navigation of Web Applications.",
            "Association Link Network Based Semantic Coherence Measurement for Short Texts of Web Events.",
            "On the Value of Purpose-Orientation and Focus on Locals in Recommending Leisure Activities.",
            "An approach for building Mobile Web Applications through Web Augmentation.",
            "Constraint-based Context Modeling and Management for Personalized Mobile Systems.",
            "An Automated Web Page Classifier and an Algorithm for the Extraction of Navigational Pattern from the Web Data.",
            "Verifying Soundness of Geodata Web Service Composition Based on Petri Nets.",
            "Mixed-Opinion Classification of Web Forum Posts using Lexical and Non-Lexical Features.",
            "Editorial.",
            "Towards Fast Metamodel Evolution in LIQUIDML.",
            "Applying a Model-Based Methodology to Develop Web-Based Systems of Systems.",
            "Identifying Functional Requirements Inconsistencies in Multi-Terms Projects Framed into a Model-Based Methodolog.",
            "An Approach of Web Service Organization Using Bayesian Network Learning.",
            "A Complete Privacy Preservation System for Data Mining Using Function Approximation.",
            "Prediction of Defect Density for Open Source Software using Repository Metrics.",
            "Load-Time Reduction Techniques for Device-Agnostic Web Sites.",
            "Editorial.",
            "Relaxation of Keyword Pattern Graphs on RDF Data.",
            "Getting the Query Right for Crisis Informatics Design Issues for Web-Based Analysis Environments.",
            "Architecting Liquid Software.",
            "A Semantic Framework for Sequential Decision Making.",
            "Identifying the Influential Bloggers: A modular approach based on Sentiment Analysis.",
            "Web Access Mining through Dynamic Decision Trees with Markovian Features.",
            "A Taxonomy of Web Effort Predictors.",
            "An SMIL-Timesheets based temporal behavior model for the visual development of Web user interfaces.",
            "Service Recommendation Based on Separated Time-aware Collaborative Poisson Factorization.",
            "A Metric Based Automatic Selection of Ontology Matchers Using Bootstrapped Patterns.",
            "Discover Semantic Topics in Patents within a Specific Domain.",
            "A Hybrid Approach for Automatic Mashup Tag Recommendation."
        ]
    },
    {
        "name": "JWE",
        "year": "2016",
        "info": "Volume 15: 2016",
        "count": 21,
        "papers": [
            "Deriving Fault Trigger Metric for Web based Systems.",
            "K, P)-Shortest Path Algorithm in the Cloud Maintaining Neighborhood Privacy.",
            "XANUI: a Textural Platform-Indepedent Model for Rich User Interfaces.",
            "A Lexical Approach for Taxonomy Mapping.",
            "Semantic Similarity Based Context-Aware Web Service Discovery Using NLP Techniques.",
            "A Survey of RESTful Transaction Models: One Model Does not Fit All.",
            "Enhancing Keyword Suggestion of Web Search by Leveraging Microblog Data.",
            "Privacy-Preserving Collaborative Web Services QoS Prediction via Yao's Garbled Circuits and Homomorphic Encryption.",
            "Outbreak Power Measurement for Evolution Course of Web Events.",
            "Searching for Relevant Tweets Based on Topic-Related User Activities.",
            "A Description-Based Hybrid Composition Method of Mashup Applications for Mobile Devices.",
            "A Semantic Approach for Dynamically Determining Complex Composed Service Behaviour.",
            "Multimedia Data Retrieving based on SOA Architecture.",
            "Ontology-Assisted Discovery of Hierarchical Topic Clusters on the Social Web.",
            "Studying the Performance of QoS Specific Web Service Recommendation System Using Virtural Regions.",
            "Web Application Editor: A User-Experience Design Framework for Knowledge-Intensive Organizations.",
            "Quality Views and Stragegy Patterns for Evaluation and Improving Quality: Usability and User Experience Case.",
            "Total Privacy Preservation and Search Quality Improvement in Personalized Web Search.",
            "System Modeling and Evaluation on Factors Influencing Power and Performance Management of Cloud Load Balancing Algorithms.",
            "Exploring Web Services from a Network Perspective Using Multi-Level Views.",
            "Detecting and Containing Malicious Services in an Intercloud Environment."
        ]
    },
    {
        "name": "JWE",
        "year": "2015",
        "info": "Volume 14: 2015",
        "count": 26,
        "papers": [
            "Editorial.",
            "Surfing the Web Using Browser Interface Facilities: A Performance Evaluation Approach.",
            "Exploiting Emoticons in Polarity Classification of Text.",
            "Keyboard Navigation Mechanisms in Widgets: an Investigation on ARIA's Implementations.",
            "Multilevel Analysis for Agent-Based Service Composition.",
            "Type-Ahead Exploratory Search through Typo and Word Order Tolerant Autocompletion.",
            "An Interactive Web Based Toolkit For Multi Focus Image Fusion.",
            "Prevention of Fault Propagation in Web Service: a Complex Network Approach.",
            "Analyzing Topological Characteristics of The Korean Blogosphere.",
            "Organizing Information in Medical Blogs Using a Hybrid Taxonomy-Folksonomy Approach.",
            "Machine Learning in Efficient and Effective Web Service Discovery.",
            "An Online System for Notification of Changes to Blogging Space to Achieve Information Domination.",
            "A Novel Twig-Join Swift Using SST-Based Representation for Efficient Retrieval of Internet XML.",
            "Assisting developers to build high-quality code-first Web Service APIs.",
            "Comparison of Hybrid Approaches with Traditional Algorithms for Improving Scaleability.",
            "A Novel Ontology Evolution Methodology.",
            "Semantic-based Clustering of Web Services.",
            "Credential Purpose-based Access Control for Personal Data Protection.",
            "Editorial.",
            "Patterns in Eyetracking Scanpaths and the Affecting Factors.",
            "From TMR to Turtle: Predicting Result Relevance from Mouse Cursor Interactions in Web Search.",
            "Identifying Web Performance Degradations through Synthetic and Real-User Monitoring.",
            "Designing Complex Crowdsourcing Applications Covering Multiple Platforms and Tasks.",
            "Web Browsing Automation for Applications Quality Control.",
            "Modified PageRank for Concept Based Search.",
            "Bayesian Based Type Discrimination of Web Events."
        ]
    },
    {
        "name": "JWE",
        "year": "2014",
        "info": "Volume 13: 2014",
        "count": 27,
        "papers": [
            "Enhanced LBS Discovery in a Decentralized Registry Based Web Services Environment.",
            "Query Intent Detection Based on Query Log Mining.",
            "Processing Mutliple Requests to Construct Skyline Composite Services.",
            "Web Application for an Adaptive Multi-Agent e-Learning System: a Continuous Improvement of e-Content.",
            "C1: an Automated Online Eduication Management System Based on an Object-Oriented Approach.",
            "A Fast Approach to Querying Multiple Ontology Versions Based on Concept Lattice.",
            "Empirical Study of Load Time Factor in Search Engine Ranking.",
            "Towards a Homogeneous Characterization of the Model-Driven Web Development Methodologies.",
            "ACOTA: A Multilingual and Semi-Automatic Collaborative Tagging Web-based Approach.",
            "Editorial.",
            "Component-based Web Engineering using Shared Components and Connectors.",
            "DireWolf Framework for Widget-based Distributed User Interfaces.",
            "Sharing Presentation and Business Logic Between Server and Client.",
            "Model-Based Rich Internet Applications Crawling: \"Menu\" and \"Probability\" Models.",
            "An Improved Ant Colony Algorithm for Effective Mining of Frequent Items.",
            "Improving Search and Exploration in Tag Spaces Using Automated Tag Clustering.",
            "A Conceptual Cohesion Metric for Service Oriented Systems.",
            "Webpage Clustering - Taking the Zero Step: a Case Study of an Iranian Website.",
            "Towards Automatic Construction of Skyline Composite Services.",
            "Gathering Web Pages of Entities with High Precision.",
            "Finding News-Topic Oriented Influential Twitter Users Based on Topic Related Hashtag Community Detection.",
            "An Optimal Constraint Based Web Service Composition Using Intelligent Backtracking.",
            "Learning-Based Web Service Composition in Uncertain Environment.",
            "The Roles of Decision Making and Empowerment in Jordanian Web-Based Development Organisations.",
            "Web Event State Prediction Model: Combining Prior Knowledge with Real Time Data.",
            "Web Page Prediction Enhanced with Confidence Mechanism.",
            "The Modified Concept based Focused Crawling using Ontology."
        ]
    },
    {
        "name": "JWE",
        "year": "2013",
        "info": "Volume 12: 2013",
        "count": 20,
        "papers": [
            "A Survey and Analysis of Current CAPTCHA Approaches.",
            "A Survey of Faceted Search.",
            "Personalizing Search Using Socially Enhanced Interest Model Built from the Stream of User's Activity.",
            "A Description-Based Composition Method for Mobile and Tethered Mashup Applications.",
            "An Approach for Web Service Discoverability Anti-Patterns Detection.",
            "Scalable RDF Graph Querying Using Cloud Computing.",
            "Supporting Accessibility in Web Engineering Methods: A Methodological Approach.",
            "Topical Crawling on the Web through Local Site-Searches.",
            "A Conceptual Graph Based Approach for Mappings among Multiple Fuzzy Ontologies.",
            "A Model for Analysing DataPportal Performance: The Biodiversity Case.",
            "A Hybrid Approach Using PSO and K-Means for Semantic Clustering of Web Documents.",
            "Slash-Based Relevance Propagation Model for Topic Distillation.",
            "A Secure Proxy-Based Cross-Domain Communication for Web Mashup.",
            "AlexandRIA: A Visual Tool for Generating Multi-device Rich Internet Applications.",
            "Editorial.",
            "A Structural Approach to Extracting Chinese Position Relations from Web Pages.",
            "Using Hybrid Semantic Information Filtering Approach in CoPEs.",
            "SemGsearch: An Approach to Semantically Retrieve Geospatial Objects from Different Geographic Servers.",
            "A Framework for Detecting and Removing Knowledge Overlaps in a Collaborative Environment.",
            "Semantic Web for Supporting Personal Work and Learning Environment Creation."
        ]
    },
    {
        "name": "JWE",
        "year": "2012",
        "info": "Volume 11: 2012",
        "count": 18,
        "papers": [
            "A Framework for Interactively Helpful Web Forms.",
            "Domain Specific Language for the Generation of Learning Management Systems Modules.",
            "A Feature-Opinion Extraction Approach to Opinion Mining.",
            "Prediction Algorithms for Prefetching in the Current Web.",
            "Predictive Self-Healing of Web Services Using Health Score.",
            "A Non-monotonic Expressiveness Extension on the Semantic Web Rule Language.",
            "A Caching Mechanism for QoS-aware Service Composition.",
            "MAXLCA: A New Query Semantic Model for XML Keyword Search.",
            "A Novel Approach for Service Performance Analysis and Forecast.",
            "Editorial.",
            "A Core Quality Model for Web Applications.",
            "Updating Quality Models for Evaluating New Generation Web Applications.",
            "Quality-driven Extraction, Fusion and Matchmaking of Semantic Web API Descriptions.",
            "Ontology Learning: Revisited.",
            "WebFDM: a Situational Method for the Development of Web Applications.",
            "The Design of E-Speranto - A Computer Language for Recording Multilingual Texts on the Web.",
            "Reuse of JIT Compiled Code in JavaScript Engine.",
            "Popularity-Based Relevance Propagation."
        ]
    },
    {
        "name": "JWE",
        "year": "2011",
        "info": "Volume 10: 2011",
        "count": 13,
        "papers": [
            "Using Traceability Links and Higher Order Transformations for Easing Regression Testing of Web Applications.",
            "Offline Web Browsing for Mobile Devices.",
            "A Novel Multi-Aspect Consitency Measurement for Ontologies.",
            "State-of-the Art and trends in the Systematic Development of Rich Internet Applications.",
            "Enterprise Frameworks for Data Intensive Web Applications: an End-User Development Model Based Approach.",
            "Model-Driven Web Development for Multiple Platforms.",
            "Automatic maintenance of Web directories.",
            "Exception Handling in Pervasive Service Composition Using Normative Agents.",
            "A New End-User Composition Model to Empower Knowledge Workers to Develop Rich Internet Applications.",
            "Migration Desktop Applications to the Internet: A Novel Virtualization Paradigm Based on Web Operating Systems.",
            "A Crowdsourced Approach for Concern-Sensitive Integration of Information across the Web.",
            "Using Web Quality Models and a Strategy for Purpose-Oriented Evaluations.",
            "A Finite-State Machine Approach for Modeling and Analyzing RESTful Systems."
        ]
    },
    {
        "name": "JWE",
        "year": "2010",
        "info": "Volume 9: 2010",
        "count": 18,
        "papers": [
            "Practical Elimination of External Interaction Vulnerabilities in Web Applications.",
            "Investigating the Distributional Property of the Session Workload.",
            "Augmenting a Web-Based Learning Environment through Blending Formative Assessment Services.",
            "Empirically Assessing the Impact of DI on the Development of Web Service Applications.",
            "Comparison of Common XML-Based Web User Interface Languages.",
            "Schema-based Cache Validation to Improve Query Performance of Web Services.",
            "Incorporating Usability Requirements In a Test/Model-Driven Web Engineering Approach.",
            "Engineering Concern-Sensitive Navigation Structures, Concepts, Tools and Examples.",
            "A QOS Enhanced Framework and Trust Model for Effective Web Services Selection.",
            "Editorial.",
            "Partitioning Web Applications Between the Server and the Client.",
            "Server Push for Web Applications via Instant Messaging.",
            "Toward Semantic Web Services as MVC Applications: from OWL-S via UML.",
            "A TS-Based 2PC for Web Services Using Rest Architectural Style.",
            "Web Site Metadata.",
            "An i*-based Approach for Modeling and Testing Web Requirements.",
            "A QOS Enhanced Framework and Trust Model for Effective Web Services Selection.",
            "Visual Web Mining for Website Evaluation."
        ]
    },
    {
        "name": "JWE",
        "year": "2009",
        "info": "Volume 8: 2009",
        "count": 17,
        "papers": [
            "Editorial.",
            "Enriching Information Retrieval Results with Web Accessibility Measurement.",
            "Oblivious Integration of Volatile Functionality in Web Application Interfaces.",
            "Fine-Grained Specification and Control of Data Flow in Web-Based User Interfaces.",
            "Finding Unexpected Navigation Behaviour in Clickstream Data for Website Design Improvement.",
            "WUM Approach to Detect Student's Collaborative Skills.",
            "Ontology-Driven Personalized Query Refinement.",
            "Measures and Techniques for Effort Estimation of Web Applications: an Empirical Study Based on a Single-Company Dataset.",
            "A Semantic Web Services-based Infrastructure for Ubiquitous Service Systems.",
            "A Survey of Cookie Technology Adoption Amongst Nations.",
            "Ontology-Based Search for eGovernment Services Using Citizen Profile Information.",
            "An Automatic Web News Article Contents Extraction System Based on RSS Feeds.",
            "Editorial.",
            "Performance Testing of Data Delivery Techniques for AJAX Applications.",
            "An Empirical Validation of a Web Fault Taxonomy and its Usage for Web Testing.",
            "An Investigation of Clustering Algorithms in the Comprehension of Legacy Web Applications.",
            "Systematic Improvement of Web Applications Design."
        ]
    },
    {
        "name": "JWE",
        "year": "2008",
        "info": "Volume 7: 2008",
        "count": 17,
        "papers": [
            "Ontology and Database Mapping: A Survey of Current Implementations and Future Directions.",
            "Reasoning on the Semantic Web for Adaptive Hypermedia.",
            "Boosting Computer Managed Instruction Functionalities Adoption in e-Learning Systems.",
            "A Situational Methodology for Addressing the Pragmatic Quality of Web Applications by Integration of Patterns.",
            "Reactivity-based Approaches To Improve Web System's QoS.",
            "Obstacles Reveal the Needs of Mobile Internet Services.",
            "Semantic spam filtering from personalized ontologies.",
            "Editorial.",
            "Managing Runtime Adaptivity through Active Rules: the Bellerofonte Framework.",
            "Supporting Different Patterns of Interaction through Context-Aware Data Management.",
            "A Migration Platform Based On Web Services For Migratory Web Applications.",
            "Enriching model-based Web applications presentation.",
            "Editorial.",
            "Web Application Evaluation and Refactoring: A Quality-Oriented Improvement Approach.",
            "An investigation of tool support for accessibility assessment throughout the development process of Web sites.",
            "Quality and Potential for Adoption of Usability Evaluation Methods.",
            "An Intelligent Visual Dictionary for Italian Sign Language."
        ]
    },
    {
        "name": "JWE",
        "year": "2007",
        "info": "Volume 6: 2007",
        "count": 21,
        "papers": [
            "Editorial.",
            "Selecting Services for Web Applications: the Open Hypermedia Case.",
            "Engineering Web Applications Using Roles.",
            "Crawling the Infinite Web.",
            "Industrial A cceptability of Web D esign M ethods: an E mpirical S tudy.",
            "Editorial.",
            "Towards a Systematic Approach for the Credibility of Human-Centric Web Applications.",
            "Alternative Path Selection in Resilient Web Infrastructure Using Performances Dependencies.",
            "A Web Services Based Architecture for Supporting Mobile Users in Large Enterprises.",
            "Ontology Development for the Semantic Web: an HTML Form-Based Reverse Engineering Approach.",
            "Rapid Development of Knowledge-Based Conversational Recommender Applications with Advisor Suite.",
            "Editorial.",
            "Integrating Interaction Design and Log an Analysis: Bridging the Gap with UML, XML, and XMI.",
            "Behavior-Based Web Page Evaluation.",
            "Instrumenting the Dynamic Web.",
            "An Integrated Technique for Web Site Usage Semantic Analysis: the Organ System.",
            "Editorial.",
            "An Infrastructure for Semantic Web Portals.",
            "A Model-Driven Approach of Ontological Components for On-line Semantic Web Information Retrieval.",
            "VQL - the Query Language for Semantically Information Retrieval in the SemanticLIFE Digital Memory Framework.",
            "A Cluster-Based Approach to Web Adaptation in Context-Aware Applications."
        ]
    },
    {
        "name": "JWE",
        "year": "2006",
        "info": "Volume 5: 2006",
        "count": 21,
        "papers": [
            "Editorial.",
            "Reactivity on the Web: Paradigms and Applications of the Language XChange.",
            "Supporting Web Applications development with a PLA.",
            "Extending Web Engineering Models and Tools for Automatic Usability Validation.",
            "Contracts for Cooperation between Web Service Programmers and HTML Designers.",
            "Editorial.",
            "A COSMIC-FFP Approach to Predict Web Application Development Effort.",
            "The WebSA Approach: Applying Model Driven Engineering to Web Applications.",
            "Identifying Cloned Navigational Patterns in Web Applications.",
            "HPG: the Hera Presentation Generator.",
            "Editorial.",
            "A Discussion of the Role of User Trails in Web Applications.",
            "An Engineering Perspective on Structural Computing: Developing Structure Services for the Web.",
            "On Cultural Differences in Local Web Interfaces.",
            "Contemporary Web Service Discovery Mechanisms.",
            "Editorial.",
            "Effectiveness, Productivity and Satisfaction of Persons with Sight and Motor Disabilities when Using Dynamic Text-Only Pages.",
            "Web Composition with Accessibility in Mind.",
            "Adaptation of Multimedia Resources Supported by Metadata.",
            "Accessibility Summarization & Simplification in a Template-based WEB Transcoder.",
            "Using Context to Support Effective Use of Web Content Accessibility Guidelines."
        ]
    },
    {
        "name": "JWE",
        "year": "2005",
        "info": "Volume 4: 2005",
        "count": 21,
        "papers": [
            "Editorial.",
            "A Comparison of Two Approaches for Automatic Construction of Web Applications.",
            "Adding Client-Side Adaptation to the Conceptual Design of e-Learning Web Applications.",
            "Fundamentals of Exception Handling within Workflow-Based Web Applications.",
            "Interplay of Content and Context.",
            "Accelerating Dynamic Web Content Delivery Using Keyword-based Fragment Detection.",
            "Editorial.",
            "Automated Web Evaluation by Guideline Review.",
            "Bridging MDA and OWL Ontologies.",
            "Towards assuring quality attributes of client dynamic Web applications: Identifying and addressing the challenges.",
            "The Static Absorbing Model for the Web.",
            "Editorial.",
            "Heterogeneous Data Translation through XML Conversion.",
            "A Generic Framework for Extracting XML Data from Legacy Databases.",
            "An Agent-oriented Approach to the Integration of Information Sources.",
            "OntoWeaver: an Ontology-based Approach to the Design of Data-intensive Web Sites.",
            "Sharing Learner Information through a Web Services-based Learning Architecture.",
            "Editorial.",
            "Agile Web Engineering (AWE) Process: Perceptions within a Fortune 500 Financial Services Company.",
            "Impacts of Web Systems on their Domain.",
            "Server Enforced Program Safety for Web Applications."
        ]
    },
    {
        "name": "JWE",
        "year": "2004",
        "info": "Volume 3: 2004",
        "count": 18,
        "papers": [
            "Editorial & In This Issue.",
            "Function Clone Detection in Web Applications: A Semiautomated Approach.",
            "Integration of Business Processes in Web Application Models.",
            "A Genre Perspective on OnlineNewspaper FrontPage Design.",
            "Editorial & In This Issue.",
            "e-Prototyping: Iterative Analysis of Web User Requirements.",
            "Quantification of Authentication Mechanisms: a Usability Perspective.",
            "Model-Driven Web Usage Analysis for the Evaluation of Web Application Quality.",
            "On the Image Content of a Web Segment: Chile as a Case Study.",
            "Introduction.",
            "Why Is Web Search So Hard... to Evaluate?",
            "The Effect of Specialized Multimedia Collections on Web Searching.",
            "Measuring the Identification Capability of Acronyms on the World Wide Web: a Comparative Study.",
            "Ranking Search Results by Web Quality Dimensions.",
            "Cybergenre: Automatic Identification of Home Pages on the Web.",
            "Three Pillars for Congenial Web Searching - Continuous Evaluation for enhancing Web Search Effectiveness.",
            "Web-based Visualization Interface Testing: Similarity Judgments.",
            "Toward Enabling Users to Visually Evaluate the Effectiveness of Different Search Methods."
        ]
    },
    {
        "name": "JWE",
        "year": "2003",
        "info": "Volume 2: 2003/2004",
        "count": 19,
        "papers": [
            "In This Issue.",
            "Engineering Semantic Web Information Systems in Hera.",
            "A Progressive Access Approach for Web-based Information Systems.",
            "A Component-based Approach for Adaptive, Dynamic Web Documents.",
            "Link-Independent Navigation Support in Web-Based Adaptive Hypermedia.",
            "Techniques and Metrics For Improving Website Structure.",
            "The 2QCV3Q Quality Model for the Analysiy of Web site Requirements.",
            "In This Issue.",
            "Dynamic Service Matchmaking in Intelligent Web.",
            "A Web Services Based Architecture for Digital Time Stamping.",
            "A Preprocessing Framework and Approach for Web Applications.",
            "Requirements Engineering for Web Applications - A Comparative Study.",
            "Editorial.",
            "Discovering Search Engine Related Queries Using Association Rules.",
            "On The Evolution of Clusters of Near-Duplicate Web Pages.",
            "Retrieving Similar Documents from the Web.",
            "Ontology for Software Metrics and Indicators.",
            "Designing Virtual Environments to Support Collaborative Work in Real Spaces.",
            "Structuring Information on the Web from Below: The case of Educational Organizations in Chile."
        ]
    },
    {
        "name": "JWE",
        "year": "2002",
        "info": "Volume 1: 2002/2003",
        "count": 13,
        "papers": [
            "In This Issue.",
            "Web Engineering.",
            "A Proposed Curriculum for a Masters in Web Engineering.",
            "Client Needs and the Design Process in Web Projects.",
            "A Software Architecture for Structuring Complex Web Applications.",
            "Towards a Reusable Repository for Web Metrics.",
            "Characterizing E-business Workloads Using Fractal Methods.",
            "In This Issue.",
            "Enhancing Hyperlink Structure for Improving Web Performance.",
            "An Enhanced Service Oriented Architecture for Developing Web-based Applications.",
            "An XML-Based Platform for E-Government Services Deployment.",
            "Specification and Design of Workflow-Driven Hypertexts.",
            "Book Review: On \"Web Engineering: Managing Diversity and Complexity of Web Application Development\" ed by S. Murugesan and Y. Deshpande."
        ]
    }
]