[
    {
        "year": "2021",
        "name": "24th MoDELS 2021",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2021",
                "sub_name": "24th International Conference on Model Driven Engineering Languages and Systems, MODELS 2021, Fukuoka, Japan, October 10-15, 2021.",
                "count": 31,
                "papers": [
                    "Scalable N-Way Model Matching Using Multi-Dimensional Search Trees.",
                    "Automated Patch Generation for Fixing Semantic Errors in ATL Transformation Rules.",
                    "Identifying Metamodel Inaccurate Structures During Metamodel/Constraint Co-Evolution.",
                    "Identifying manual changes to generated code: Experiences from the industrial automation domain.",
                    "Repository Mining for Changes in Simulink Models.",
                    "Towards the Characterization of Realistic Model Generators using Graph Neural Networks.",
                    "A GNN-based Recommender System to Assist the Specification of Metamodels and Models.",
                    "Towards Reinforcement Learning for In-Place Model Transformations.",
                    "Efficient Replay-based Regression Testing for Distributed Reactive Systems in the Context of Model-driven Development.",
                    "Restricted Natural Language and Model-based Adaptive Test Generation for Autonomous Driving.",
                    "Integrated and Iterative Requirements Analysis and Test Specification: A Case Study at Kostal.",
                    "Execution Trace Analysis for a Precise Understanding of Latency Violations.",
                    "DataTime: a Framework to smoothly Integrate Past, Present and Future into Models.",
                    "Applying Declarative Analysis to Software Product Line Models: An Industrial Study.",
                    "Towards Control Flow Analysis of Declarative Graph Transformations with Symbolic Execution.",
                    "A Concept for a Qualifiable (Meta)-Modeling Framework Deployable in Systems and Tools of Safety-Critical and Cyber-Physical Environments.",
                    "Exploring Architectural Design Decisions in Industry 4.0: A Literature Review and Taxonomy.",
                    "MoDALAS: Model-Driven Assurance for Learning-Enabled Autonomous Systems.",
                    "A Lean Approach to Building Valid Model-Based Safety Arguments.",
                    "Synthesizing Verified Components for Cyber Assured Systems Engineering.",
                    "OSTRICH - A Type-Safe Template Language for Low-Code Development.",
                    "On Designing Applied DSLs for Non-Programming Experts in Evolving Domains.",
                    "Designing a Modeling Language for Customer Journeys: Lessons Learned from User Involvement.",
                    "Leveraging Model-Driven Technologies for JSON Artefacts: The Shipyard Case Study.",
                    "Collaborative Software Modeling in Virtual Reality.",
                    "Collaborative Model-Driven Software Engineering: A Systematic Update.",
                    "Quality Guidelines for Research Artifacts in Model-Driven Engineering.",
                    "Assessing the Usefulness of a Visual Programming IDE for Large-Scale Automation Software.",
                    "Model-Based Development of Engine Control Systems: Experiences and Lessons Learnt.",
                    "Monte Carlo Tree Search and GR(1) Synthesis for Robot Tasks Planning in Automotive Production Lines.",
                    "Model-Driven Simulation-Based Analysis for Multi-Robot Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2021c",
                "sub_name": "ACM/IEEE International Conference on Model Driven Engineering Languages and Systems Companion, MODELS 2021 Companion, Fukuoka, Japan, October 10-15, 2021.",
                "count": 118,
                "papers": [
                    "Preface to the 1st International Hands-on Workshop on Collaborative Modeling (HoWCoM 2021).",
                    "Towards Personalized Change Propagation for Collaborative Modeling.",
                    "Mind Maps sans Frontières.",
                    "Real-Time Collaborative Modeling across Language Workbenches - a Case on Jetbrains MPS and Eclipse Spoofax.",
                    "Collaborative modelling and metamodelling with MetaEdit+.",
                    "Towards Conflict-Free Collaborative Modelling using VS Code Extensions.",
                    "LowCode 2021: 2nd Workshop on Modeling in Low-Code Development Platforms.",
                    "Solution Discovery over Feature Toggling with Built-in Abstraction in OutSystems.",
                    "In Search of the Essence of Low-Code: An Exploratory Study of Seven Development Platforms.",
                    "Using Microsoft PowerApps, Mendix and OutSystems in Two Development Scenarios: An Experience Report.",
                    "Cloud-based modeling in IoT domain: a survey, open challenges and opportunities.",
                    "Towards Scalable Validation of Low-Code System Models: Mapping EVL to VIATRA Patterns.",
                    "Proposing a Framework for Impact Analysis for Low-Code Development Platforms.",
                    "Towards Automated Semantic Grouping in Workflows for Multi-Disciplinary Analysis.",
                    "From Builders to Editors: Bidirectional Transformations of Low-code Models.",
                    "MDEForgeWL: Towards cloud-based discovery and composition of model management services.",
                    "Interactive Behavior-driven Development: a Low-code Perspective.",
                    "Improving Collaboration Efficiency Between UX/UI Designers and Developers in a Low-Code Platform.",
                    "MDE Intelligence 2021: 3rd Workshop on Artificial Intelligence and Model-Driven Engineering.",
                    "Detecting Quality Problems in Data Models by Clustering Heterogeneous Data Values.",
                    "A Model-Driven Engineering Approach for Monitoring Machine Learning Models.",
                    "A Model Driven Approach to Building Domain Specific Search Engines.",
                    "Automated Requirements Formalisation for Agile MDE.",
                    "Preface of the 15th International Workshop on Models@run.time'21.",
                    "Process Prediction with Digital Twins.",
                    "Model Based Coupling of Context Aware Middleware and Ambient Assisted Healthcare Systems.",
                    "GOURMET: A Methodology for Realizing Goal-Driven Self-Adaptation.",
                    "Consistent Resource Utilization for Cross-Platform and Replicable Load-Testing: a Position Paper.",
                    "MoDDiT 2021: 1st International Workshop on Model-Driven Engineering for Digital Twins.",
                    "Using UML and OCL Models to Realize High-Level Digital Twins.",
                    "Inference of Simulation Models in Digital Twins by Reinforcement Learning.",
                    "Models Meet Data: Challenges to Create Virtual Entities for Digital Twins.",
                    "Air Quality Management: An Exemplar for Model-Driven Digital Twin Engineering.",
                    "Using Ptolemy II as a Framework for Virtual Entity Integration and Orchestration in Digital Twins.",
                    "Digital Twin Operational Platform for Connectivity and Accessibility using Flask Python.",
                    "Summary of Workshop on Model Driven Engineering, Verification and Validation (MoDeVVa'21).",
                    "Towards Facilitating the Exploration of Informal Concepts in Formal Modeling Tools.",
                    "Software Performance Engineering with Performance Antipatterns and Code-level Probabilistic Analysis.",
                    "Trace-based Timing Analysis of Automotive Software Systems: an Experience Report.",
                    "Synchronous Execution Semantics for Component & Connector Models.",
                    "Multi-layered Model-based Design Approach towards System Safety and Security Co-engineering.",
                    "Preface to the 3rd Multi-Paradigm Modeling for Cyber-Physical Systems (MPM4CPS 2021).",
                    "Developing a Physical and Digital Twin: An Example Process Model.",
                    "Modeling the Engineering Process of an Agent-based Production System: An Exemplar Study.",
                    "FTG+PM for the Model-Driven Development of Wireless Sensor Network based IoT Systems.",
                    "Supporting the Engineering of Multi-Fidelity Simulation Units With Simulation Goals.",
                    "On the Need for Multi-Level ADS Scenarios.",
                    "Knowledge Base Development and Application Processes Applied on Product-Assembly Co-design.",
                    "Fifth International Workshop on Human Factors in Modeling / Modeling of Human Factors (HuFaMo'21).",
                    "IoT Cooking Workflows for End-Users: A Comparison Between Behaviour Trees and the DX-MAN Model.",
                    "Rethinking the Traditional Design of Meta-Models: Layout Matters for the Graphical Modeling of Technical Systems.",
                    "ModRec: A Tool to Support Empirical Study Design for Papyrus and the Eclipse Modeling Framework.",
                    "Goal Modeling and MDSE for Behavior Assistance.",
                    "From Prose to Prototype: Synthesising Executable UML Models from Natural Language.",
                    "The Design of a Study Concerning the Capture of Important Design Bits at the Whiteboard.",
                    "Towards Checking Consistency-Breaking Updates between Models and Generated Artifacts.",
                    "Towards the Co-Evolution of Models and Artefacts of Industrial Tools Through External Views.",
                    "Automated Refactoring of Unbounded Queries in Software Automation Platforms.",
                    "Simulink Model Transformation for Backwards Version Compatibility.",
                    "Modeling Relationships Between Feature Model Views.",
                    "Towards Continuous Consistency Checking of DevOps Artefacts.",
                    "From Monolithic to Microservice Architecture: The Case of Extensible and Domain-Specific IDEs.",
                    "Preface to the OpenMBEE International Workshop.",
                    "Bridging the Gap between OpenMBEE and Git.",
                    "Digital Engineering Hub Pathfinder.",
                    "A Lightweight Approach for the Automated Classification and Clustering of Metamodels.",
                    "EOQ: An Open Source Interface for a More DAMMMMN Domain-specific Model Utilization.",
                    "Preface to the 8th International Workshop on Multi-Level Modelling (MULTI 2021).",
                    "The MULTI Collaborative Comparison Challenge.",
                    "A Note on Properties in Multi-Level Modeling.",
                    "Associations in Multi-Level-Modelling: Motivation, Conceptualization, Modelling Guidelines, and Implications for Model Management.",
                    "A General Methodology for Internalising Multi-Level Model Typing.",
                    "Prolegomena of a Multi-Level Modeling Method Illustrated with the FMMLx.",
                    "Towards an Empirical Perspective on Multi-Level Modeling and a Comparison with Conventional Meta Modeling.",
                    "Unifying multi-level modeling: A position paper.",
                    "Towards Multi-level Modeling of Just-in-Time Adaptive Interventions (JITAIs) in Mobile Health.",
                    "Leveraging Multi-Level Modeling for Multi-Domain Quality Assessment.",
                    "Melanee and DMLA - A Contribution to the MULTI 2021 Collaborative Comparison Challenge.",
                    "SuMo: A Supportive Modeling Language Environment for Guided Model Transformations.",
                    "Towards the Black-Box Aggregation of Language Components.",
                    "Enhancing syntax expressiveness in domain-specific modelling.",
                    "DoMoBOT: An AI-Empowered Bot for Automated and Interactive Domain Modelling.",
                    "Wodel-Edu: An MDE Solution for the Generation and Evaluation of Diagram-based Exercises.",
                    "POLYGLOT for Gamified Education: Mixing Modelling and Programming Exercises.",
                    "From Conceptual Models to Knowledge Graphs: A Generic Model Transformation Platform.",
                    "AnimUML as a UML Modeling and Verification Teaching Tool.",
                    "MRegTest: A Replay-Based Regression Testing Tool for Distributed UML-RT Models.",
                    "Multi-Language Support in TouchCORE.",
                    "A modeling assistant for cognifying MBSE tools.",
                    "MM-cat: A Tool for Modeling and Transformation of Multi-Model Data using Category Theory.",
                    "Connecting Regulatory Requirements to Audit Outcomes: A Model-driven Approach to Auditable Compliance.",
                    "Goal-Oriented Machine Learning-Based Component Development Process.",
                    "Towards a Spreadsheet-Based Language Workbench.",
                    "Heterogeneous Model Query Optimisation.",
                    "Domain-Specific Modelling Languages for Participatory Agent-Based Modelling in Healthcare.",
                    "Efficient Model Loading through Static Analysis.",
                    "Towards behavioral consistency in heterogeneous modeling scenarios.",
                    "A model-driven middleware approach to reduce the semantic gap between application domains and the generic infrastructure of smart cities.",
                    "Secure MDE for Ethereum-based Decentralized Applications (ÐApps) Development.",
                    "A Model-Driven Approach for Early Verification and Validation of Embedded Systems.",
                    "Development of a Meta-language and its Qualifiable Implementation for the Use in Safety-critical Software.",
                    "17th Educators Symposium at MODELS 2021.",
                    "Mini Programming Worlds: Teaching MDSD via the Hamster Simulator.",
                    "From In-Person to Distance Learning: Teaching Model-Driven Software Engineering in Remote Settings.",
                    "An empirical study on the impact of introducing a modeling tool in a Requirement Engineering course.",
                    "How to merge gamification efforts for programming and modelling: a tool implementation perspective.",
                    "Modeling Autonomic Systems in the time of ML, DevOps and Microservices.",
                    "On the Conception of Executable Design Languages for Distributed Real-time Systems.",
                    "Combining Low-Code Programming and SDL-Based Modeling with Snap! in the Industry 4.0 Context.",
                    "Identification and Optimisation of Type-Level Model Queries.",
                    "Modeling self-adaptative IoT architectures.",
                    "UCM4IoT: A Use Case Modelling Environment for IoT Systems.",
                    "Modelling Data Protection in Fog Computing Systems using UMLsec and SysML-Sec.",
                    "(Not) Yet Another Metamodel For Traceability.",
                    "Metamodel Refactoring using Constraint Solving: a Quality-based Perspective.",
                    "From a Series of (Un)fortunate Events to Global Explainability of Runtime Model-Based Self-Adaptive Systems.",
                    "Artifact Analysis of Smell Evolution and Maintenance Tasks in Simulink Models.",
                    "Towards Modelling Acceptance Tests as a Support for Software Measurement."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd MoDELS 2020",
        "info": "Virtual Event, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2020",
                "sub_name": "MoDELS '20: ACM/IEEE 23rd International Conference on Model Driven Engineering Languages and Systems, Virtual Event, Canada, 18-23 October, 2020.",
                "count": 35,
                "papers": [
                    "To build, or not to build: ModelFlow, a build solution for MDE projects.",
                    "Efficient generation of graphical model views via lazy model-to-text transformation.",
                    "An extensible framework for customizable model repair.",
                    "A compositional framework for systematic modeling language reuse.",
                    "Template based model engineering in UML.",
                    "MAR: a structure-based search engine for models.",
                    "Interactive metamodel/model co-evolution using unsupervised learning and multi-objective search.",
                    "Modeling mechanical functional architectures in SysML.",
                    "Model-driven digital twin construction: synthesizing the integration of cyber-physical systems with their information systems.",
                    "AC-ROS: assurance case driven adaptation for the robot operating system.",
                    "SceML: a graphical modeling framework for scenario-based testing of autonomous vehicles.",
                    "A model-based approach for developing event-driven architectures with AsyncAPI.",
                    "Model-based fleet deployment of edge computing applications.",
                    "A parametric model for creating customized fabrication machines.",
                    "Supporting robotic software migration using static analysis and model-driven engineering.",
                    "Semantic comparisons of Alloy models.",
                    "A scalable querying scheme for memory-efficient runtime models with history.",
                    "Automated generation of consistent models with structural and attribute constraints.",
                    "mel- model extractor language for extracting facts from models.",
                    "Designing, animating, and verifying partial UML Models.",
                    "Leveraging natural-language requirements for deriving better acceptance criteria from models.",
                    "From text to visual BPMN process models: design and evaluation.",
                    "Variability representations in class models: an empirical assessment.",
                    "\"Union is power\": analyzing families of goal models using union models.",
                    "Co-evolution of simulink models in a model-based product line.",
                    "Synthesis of state machine models.",
                    "Efficient reordering and replay of execution traces of distributed reactive systems in the context of model-driven development.",
                    "Certifying a rule-based model transformation engine for proof preservation.",
                    "An exploratory study on performance engineering in model transformations.",
                    "Automating test schedule generation with domain-specific languages: a configurable, model-driven approach.",
                    "Automating the early detection of security design flaws.",
                    "Scenario-based specification of security protocols and transformation to security model checkers.",
                    "Detecting quality problems in research data: a model-driven approach.",
                    "Is automated grading of models effective?: assessing automated grading of class diagrams.",
                    "A model-driven alternative to programming in blocks using rule-based transformations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2020c",
                "sub_name": "MODELS '20: ACM/IEEE 23rd International Conference on Model Driven Engineering Languages and Systems, Virtual Event, Canada, 18-23 October, 2020, Companion Proceedings.",
                "count": 94,
                "papers": [
                    "Gentleman: a light-weight web-based projectional editor generator.",
                    "TyphonML: a modeling environment to develop hybrid polystores.",
                    "A profiler for the matching process of henshin.",
                    "Automated video game world map synthesis by model-based techniques.",
                    "Papyrus for gamers, let's play modeling.",
                    "MReplayer: a trace replayer of distributed UML-RT models.",
                    "User-centred tooling for modelling of big data applications.",
                    "CyprIoT project: an open source toolset to model and generate a network of things.",
                    "ModelMine: a tool to facilitate mining models from open source repositories.",
                    "Insights collaboration space: a team collaboration app for the design of data-driven services.",
                    "Concrete syntax-based find for graphical DSLs.",
                    "Using Benji to systematically evaluate model comparison algorithms.",
                    "Strengthening validation of model behavior through filmstrip templates in the tool USE.",
                    "Enhancing development and consistency of UML models and model executions with USE studio.",
                    "MMINT-A 2.0: tool support for the lifecycle of model-based safety artifacts.",
                    "Metamodel specialization based DSL for DL lifecycle data management.",
                    "Enabling language engineering for the masses.",
                    "What's the grade of your diagram?: towards a streamlined approach for grading UML diagrams.",
                    "From things' modeling language (ThingML) to things' machine learning (ThingML2).",
                    "Automatic assessment of students' software models using a simple heuristic and machine learning.",
                    "Towards a better understanding of interactions with a domain modeling assistant.",
                    "From classic to agile: experiences from more than a decade of project-based modeling education.",
                    "On teaching descriptive and prescriptive modeling.",
                    "Automated generation of test scenario models for the system-level safety assurance of autonomous vehicles.",
                    "A feature-oriented approach: from usage scenarios to automated system of systems validation in the automotive domain.",
                    "Artificial intelligence empowered domain modelling bot.",
                    "A model-driven approach for cobotic cells based on Petri nets.",
                    "A concern-oriented software engineering methodology for micro-service architectures.",
                    "Multi-language systems based on perspectives to promote modularity, reusability, and consistency.",
                    "Enhancing collaborative modeling.",
                    "Creating an accessible and understandable modelling language for cell-based simulations.",
                    "Mining of DSLs and generator templates from reference applications.",
                    "Automatically learning formal models: an industrial case from autonomous driving development.",
                    "Risk-based compatibility analysis in automotive systems engineering.",
                    "Scenarios in the loop: integrated requirements analysis and automotive system validation.",
                    "Assisted authoring of model-based systems engineering documents.",
                    "Model checking as a service: towards pragmatic hidden formal methods.",
                    "Breesse: bridging EMF, simulink and stateflow for model-based design of safety-critical systems.",
                    "Towards boosting the OpenMBEE platform with model-code consistency.",
                    "Runtime modeling and analysis of IoT systems.",
                    "A composition algorithm for reusable workflow models.",
                    "Time semantics of executable activity diagrams for relativized conformance testing.",
                    "CouchEdit: a relaxed conformance editing approach.",
                    "A survey on service composition languages.",
                    "DoMoBOT: a bot for automated and interactive domain modelling.",
                    "Enhancing model transformation synthesis using natural language processing.",
                    "A comparative study of reinforcement learning techniques to repair models.",
                    "Towards an assessment grid for intelligent modeling assistance.",
                    "Metamodel deprecation to manage technical debt in model co-evolution.",
                    "An extensible tool-chain for analyzing datasets of metamodels.",
                    "Edelta 2.0: supporting live metamodel evolutions.",
                    "LUV is not the answer: continuous delivery of a model driven development platform.",
                    "Automated provenance graphs for models@run.time.",
                    "Towards model-based development of decentralised peer-to-peer data vaults.",
                    "Operational design for advanced persistent threats.",
                    "Detecting human vulnerably in socio-technical systems: a naval case study.",
                    "Towards a model driven formal approach for merging data, access control and business processes.",
                    "Method and framework for security risks analysis guided by safety criteria.",
                    "Evaluating tool support for embedded operating system security: an experience feedback.",
                    "An empirical study on visual programming docker compose configurations.",
                    "Closing the gap between designers and developers in a low code ecosystem.",
                    "Towards a low-code solution for monitoring machine learning model performance.",
                    "Understanding the role of model transformation compositions in low-code development platforms.",
                    "Intelligent run-time partitioning of low-code system models.",
                    "Towards the next generation of reactive model transformations on low-code platforms: three research lines.",
                    "Towards automating the construction of recommender systems for low-code development platforms.",
                    "Towards access control for collaborative modelling apps.",
                    "Democratizing the development of recommender systems by means of low-code platforms.",
                    "DevOpsML: towards modeling DevOps processes and platforms.",
                    "Challenges & opportunities in low-code testing.",
                    "Automated migration of EuGENia graphical editors to the web.",
                    "Towards transparent combination of model management execution strategies for low-code development platforms.",
                    "Efficiently querying large-scale heterogeneous models.",
                    "Low-code engineering for internet of things: a state of research.",
                    "Test mocks for low-code applications built with OutSystems.",
                    "Positioning of the low-code movement within the field of model-driven engineering.",
                    "TL: an abstract specification language for bidirectional transformations.",
                    "A language agnostic approach to modeling requirements: specification and verification.",
                    "SysML models: studying safety and security measures impact on performance using graph tainting.",
                    "Validity frame concept as effort-cutting technique within the verification and validation of complex cyber-physical systems.",
                    "Modular deployment of UML models for V&V activities and embedded execution.",
                    "Metrics for OCL expressions: development, realization, and applications for validation.",
                    "Deductive reconstruction of MLT* for multi-level modeling.",
                    "Join potency: a way of combining separate multi-level models.",
                    "Meaningful metrics for multi-level modelling.",
                    "Contingent level classes: motivation, conceptualization, modeling guidelines, and implications for model management.",
                    "Implicit requirements for ontological multi-level types in the UNICLASS classification.",
                    "Connecting conceptual models using relational reference attribute grammars.",
                    "Towards a digital twin for cyber-physical production systems: a multi-paradigm modeling approach in the postal industry.",
                    "Towards employing ABM and MAS integrated with MBSE for the lifecycle of sCPSoS.",
                    "Toward client-agnostic hybrid model editor tools as a service.",
                    "Step-wise refinement in multi-paradigm modeling.",
                    "Towards adaptive abstraction for continuous time models with dynamic structure.",
                    "TwinOps - DevOps meets model-based engineering and digital twins for the engineering of CPS."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd MoDELS 2019",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2019",
                "sub_name": "22nd ACM/IEEE International Conference on Model Driven Engineering Languages and Systems, MODELS 2019, Munich, Germany, September 15-20, 2019.",
                "count": 30,
                "papers": [
                    "Using Models to Enable Compliance Checking Against the GDPR: An Experience Report.",
                    "Pitfalls Analyzer: Quality Control for Model-Driven Data Science Pipelines.",
                    "Secure Data-Flow Compliance Checks between Models and Code Based on Automated Mappings.",
                    "Exploiting Multi-level Modelling for Designing and Deploying Gameful Systems.",
                    "Model-Driven Design of City Spaces via Bidirectional Transformations.",
                    "Applying MDD in the Content Management System Domain: Scenarios and Empirical Assessment.",
                    "A Model-Based Testing Approach for Cockpit Display Systems of Avionics.",
                    "Towards Effective Mutation Testing for ATL.",
                    "Towards System-Level Testing with Coverage Guarantees for Autonomous Vehicles.",
                    "Bootstrapping MDE Development from ROS Manual Code - Part 2: Model Generation.",
                    "Automatic Generation of Atomic Consistency Preserving Search Operators for Search-Based Model Engineering.",
                    "Guided Architecture Trade Space Exploration: Fusing Model Based Engineering & Design by Shopping.",
                    "Model-Based Resource Analysis and Synthesis of Service-Oriented Automotive Software Architectures.",
                    "A Modelling Language to Support the Evolution of Multi-tenant Cloud Data Architectures.",
                    "Domain-Level Observation and Control for Compiled Executable DSLs.",
                    "Verifying and Monitoring UML Models with Observer Automata: A Transformation-Free Approach.",
                    "Model-Based, Platform-Independent Logging for Heterogeneous Targets.",
                    "A Focus+Context Approach to Alleviate Cognitive Challenges of Editing and Debugging UML Models.",
                    "Querying and Annotating Model Histories with Time-Aware Patterns.",
                    "On-the-Fly Translation and Execution of OCL-Like Queries on Simulink Models.",
                    "RaM: Causally-Connected and Requirements-Aware Runtime Models using Bayesian Learning.",
                    "Modeling Approach and Evaluation Criteria for Adaptable Architectural Runtime Model Instances.",
                    "Towards WCET Estimation of Graph Queries@Run.time.",
                    "Bridging the Gap between Requirements Modeling and Behavior-Driven Development.",
                    "CONDEnSe: Contract Based Design Synthesis.",
                    "Goal-Based Modeling and Analysis of Non-Functional Requirements.",
                    "Automated Classification of Metamodel Repositories: A Machine Learning Approach.",
                    "Modeling and Training of Neural Processing Systems.",
                    "An LSTM-Based Neural Network Architecture for Model Transformations.",
                    "Meta-Modelling Meta-Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2019c",
                "sub_name": "22nd ACM/IEEE International Conference on Model Driven Engineering Languages and Systems Companion, MODELS Companion 2019, Munich, Germany, September 15-20, 2019.",
                "count": 118,
                "papers": [
                    "Message from the MASE 2019 Chair.",
                    "Querying Automotive System Models and Safety Artifacts with MMINT and Viatra.",
                    "Test-Driven Scenario Specification of Automotive Software Components.",
                    "Validating Industrial Requirements with a Contract-Based Approach.",
                    "Simulation as a Service for Cooperative Vehicles.",
                    "Towards Model-Based Generation and Optimization of AUTOSAR Runnable-to-Task Mapping.",
                    "Model-Based Timing Analysis and Deployment Optimization for Heterogeneous Multi-core Systems using Eclipse APP4MC.",
                    "Security Patterns for Automotive Systems.",
                    "Preface to the 6th International Workshop on Multi-Level Modelling (MULTI 2019).",
                    "DeepTelos for ConceptBase: A Contribution to the MULTI Process Challenge.",
                    "Coordinate Systems: Level Ascending Ontological Options.",
                    "A Foundation for the Composition of Multilevel Domain-Specific Languages.",
                    "DeepTelos Demonstration.",
                    "A Multilevel Modelling Approach for Tourism Flows Detection.",
                    "On the Rules for Inheritance in LML.",
                    "Multi-level Modeling with DMLA - A Contribution to the MULTI Process Challenge.",
                    "Applying Multilevel Modeling to the Development of Geographic Information Systems.",
                    "By Multi-layer to Multi-level Modeling.",
                    "Preserving Multi-level Semantics in Conventional Two-Level Modeling Techniques.",
                    "Multilevel Modelling with MultEcore: A Contribution to the MULTI Process Challenge.",
                    "The MULTI Process Challenge.",
                    "Preface to MDE Intelligence 2019: 1st Workshop on Artificial Intelligence and Model-Driven Engineering.",
                    "On Artificial Intelligence for Simulation and Design Space Exploration in Gas Turbine Design.",
                    "Personalized and Automatic Model Repairing using Reinforcement Learning.",
                    "Heuristic Inference of Model Transformation Definitions from Type Mappings.",
                    "Towards Scalable Search-Based Model Engineering with MDEOptimiser Scale.",
                    "Modeling Deep Reinforcement Learning Based Architectures for Cyber-Physical Systems.",
                    "A Case Study of Model-Driven Engineering for Automated Timetabling.",
                    "A Model Checkable UML Soccer Player.",
                    "Solving the RoboSoccer Challenge Problem with UML-RT and Papyrus-RT.",
                    "Usability of Development Tools: A CASE-Study.",
                    "Towards Concrete Syntax Based Find for Graphical Domain Specific Languages.",
                    "Using Behavioural Programming with Solver, Context, and Deep Reinforcement Learning for Playing a Simplified RoboCup-Type Game.",
                    "Voice-Driven Modeling: Software Modeling Using Automated Speech Recognition.",
                    "JSOI: A JSON-Based Interchange Format for Efficient Model Management.",
                    "Preface to the 13th Workshop on Models and Evolution (ME2019).",
                    "Consistency Control for Model Versions in Evolving Model-Driven Software Product Lines.",
                    "Multifaceted Consistency Checking of Collaborative Engineering Artifacts.",
                    "An Integrated Model-Based Tool Chain for Managing Variability in Complex System Design.",
                    "Inferring Metamodel Relaxations Based on Structural Patterns to Support Model Families.",
                    "BESMER: An Approach for Bad Smells Summarization in Systems Models.",
                    "Towards Platform Specific Energy Estimation for Executable Domain-Specific Modeling Languages.",
                    "Executable Modelling for Highly Parallel Accelerators.",
                    "Engineering Hybrid Graphical-Textual Languages with Sirius and Xtext: Requirements and Challenges.",
                    "A Proposal of Features to Support Analysis and Debugging of Declarative Model Transformations with Graphical Syntax by Embedded Visualizations.",
                    "Simulation of Model Execution for Embedded Systems.",
                    "Firmware Synthesis for Ultra-Thin IoT Devices Based on Model Integration.",
                    "On the Challenges of Model Decorations for Capturing Complex Metadata.",
                    "Converting Executable Floating-Point Models to Executable and Synthesizable Fixed-Point Models.",
                    "TrueChange (TM) Under the Hood: How We Check the Consistency of Large Models (Almost) Instantly.",
                    "Preface to the 1st Workshop on View-Oriented Software Engineering (VoSE).",
                    "Commonalities for Preserving Consistency of Multiple Models.",
                    "A Generic Language for Query and Viewtype Generation By-Example.",
                    "Towards Modular Combination and Reuse of Languages with Perspectives.",
                    "Intensional View Definition with Constrained Incremental Transformation Rules.",
                    "Preface to the Fourth International Workshop on Human Factors in Modeling (HuFaMo'19).",
                    "Insights for Improving Diagram Editing Gained from an Empirical Study.",
                    "UmpleOnline as a Testbed for Modeling Empirical Studies: A Position Paper.",
                    "Position Paper: Knowledge Sharing and Distances in Collaborative Modeling.",
                    "Preface to the 1st Multi-Paradigm Modeling for Cyber-Physical Systems (MPM4CPS 2019).",
                    "Towards a Formal Specification of Multi-paradigm Modelling.",
                    "Blended Modelling - What, Why and How.",
                    "Model-Driven Systems Engineering for Virtual Product Design.",
                    "Towards Sketching Interfaces for Multi-paradigm Modeling.",
                    "Challenges for Automation in Adaptive Abstraction.",
                    "The Computational Notebook Paradigm for Multi-paradigm Modeling.",
                    "Towards Flexible, Rigorous Refinement in Metamodeling.",
                    "Simplified Specification Languages for Flexible and Agile Modelling.",
                    "Modeling Moods.",
                    "Flexible Modelling using Conversational Agents.",
                    "Towards Reasoning About Product Lines with Design Choices.",
                    "Shall We Test Service-Based Models or Generated Code?",
                    "Using the SCADE Toolchain to Generate Requirements-Based Test Cases for an Adaptive Cruise Control System.",
                    "Verification and Validation Approaches for Model-Based Software Engineering.",
                    "A Catalogue of Scenario Patterns for Validating and Verifying Model Behavior.",
                    "Optimizing Hierarchical, Concurrent State Machines in Umple for Model Checking.",
                    "Bridging the Gap between Smart Home Platforms and Machine Learning using Relational Reference Attribute Grammars.",
                    "Towards Self-Explainable Cyber-Physical Systems.",
                    "A Domain-Specific Language for the Development of Heterogeneous Multi-robot Systems.",
                    "A Matlab-Internal DSL for Modelling Hybrid Rigid-Continuum Robots with TMTDyn.",
                    "A Model-Driven Approach to Automate Tuning of Continuous Controller Parameters.",
                    "Design-Time Safety Assessment of Robotic Systems Using Fault Injection Simulation in a Model-Driven Approach.",
                    "Preface to the 1st Workshop on DevOps@MODELS.",
                    "Detecting Architectural Issues During the Continuous Integration Pipeline.",
                    "Towards Continuous Delivery for Domain Experts: Using MDE to Integrate Non-Programmers into a Software Delivery Pipeline.",
                    "When DevOps Meets Meta-Learning: A Portfolio to Rule them all.",
                    "Towards Model-Based Continuous Deployment of Secure IoT Systems.",
                    "A Model-Driven Engineering Framework to Support the Functional Safety Process.",
                    "Towards Model-Driven Self-Explanation for Autonomous Decision-Making Systems.",
                    "Automatic Network Configuration for Real-Time, Distributed Industrial Automation Systems.",
                    "User-Centered Performance Engineering of Model Transformations.",
                    "How to Live with Inconsistencies in Industrial Model-Based Development Practice.",
                    "Improving MBSE Tools UX with AI-Empowered Software Assistants.",
                    "Improving Solution Reuse in Automotive Embedded Applications using a Pattern Library Based Approach.",
                    "Modeling Adaptive Learning Agents for Domain Knowledge Transfer.",
                    "Automated Suggestions of Security Enhancing Improvements for Software Architectures.",
                    "Use of Personalized Feedback Reports in a Blended Conceptual Modelling Course.",
                    "A Study of Modeling Perception in a First-Time Modeling Class.",
                    "Teaching Software Modelling in an Undergraduate Introduction to Software Engineering.",
                    "Automated Grading of Class Diagrams.",
                    "An Idealistic Plan for Transforming Media Sources Into Books, Slides and Videos: Position Statement on \"Textbooks 10 Years From Now\".",
                    "Teaching Modelling Literacy: An Artificial Intelligence Approach.",
                    "SML4C: Fully Automatic Classification of State Machine Models for Model Inspection in Education.",
                    "A Semantic Model to Fight Social Exclusion.",
                    "Formal Verification and Mathematical Optimization for Autonomous Vehicle Group Controllers.",
                    "Continuous Delivery of Software on IoT Devices.",
                    "Generating Heterogeneous Codes for IoT Systems Based on CAPS.",
                    "ARGON: A Model-Driven Infrastructure Provisioning Tool.",
                    "Live-UMLRT: A Tool for Live Modeling of UML-RT Models.",
                    "WAPIml: Towards a Modeling Infrastructure for Web APIs.",
                    "GDF: A Gamification Design Framework Powered by Model-Driven Engineering.",
                    "MAPLE-T: A Tool for Process Enactment with Traceability Support.",
                    "Verifying Deadlock and Nondeterminism in Activity Diagrams.",
                    "A Model Driven Tool for Requirements and Hardware Engineering.",
                    "Quality Improvement for UML and OCL Models Through Bad Smell and Metrics Definition.",
                    "UCAnDoModels: A Context-Based Model Editor for Editing and Debugging UML Class and State-Machine Diagrams.",
                    "Semantics of Co-simulation Algorithms with Simulator Contracts.",
                    "Meta Model Application for Consistency Management of Models for Avionic Systems Design."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2019mde4iot",
                "sub_name": "Joint Proceedings of the Workshop on Model-Driven Engineering for the Internet of Things (MDE4IoT) & of the Workshop on Interplay of Model-Driven and Component-Based Software Engineering (ModComp) Co-located with the IEEE/ACM 22nd International Conference on Model Driven Engineering Languages and Systems (MODELS 2019), Munich, Germany, September 15 and 17, 2019.",
                "count": 12,
                "papers": [
                    "Bringing Intelligence to Sociotechnical IoT Sytems.",
                    "Challenges of DevOps ready IoT Testbed.",
                    "A Model-Driven Approach for System Administration.",
                    "Towards Privacy-Preserving IoT Systems Using Model Driven Engineering.",
                    "Model-based Privacy-related Continuous Risk Control for Trustworthy Smart IoT Systems.",
                    "Automated Code Generation for NFC-based Access Control.",
                    "Tagging Model Properties for Flexible Communication.",
                    "Towards IoT Diversity via Automated Fleet Management.",
                    "A Little Look Outside of the Box.",
                    "Towards Semantic Model-to-model Mapping of Cross-Domain Component Interfaces for Interoperability of Vehicle Applications.",
                    "Towards Continuous Evolution through Automatic Detection and Correction of Service Incompatibilities.",
                    "Automatic Software Synthesis of Static and Dynamic Dataflow Process Networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st MoDELS 2018",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2018",
                "sub_name": "Proceedings of the 21th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems, MODELS 2018, Copenhagen, Denmark, October 14-19, 2018.",
                "count": 45,
                "papers": [
                    "Exploring Potency.",
                    "From (Imperfect) Object Diagrams to (Imperfect) Class Diagrams: New Ideas and Vision Paper.",
                    "On the Quest for Flexible Modelling.",
                    "Mathematical Programming for Anomaly Analysis of Clafer Models.",
                    "From Single- to Multi-Variant Model Transformations: Trace-Based Propagation of Variability Annotations.",
                    "Expressing Confidence in Models and in Model Transformation Elements.",
                    "Model Transformation Product Lines.",
                    "Expressive and Efficient Model Transformation with an Internal DSL of Xtend.",
                    "Evolutionary Algorithm for Bug Localization in the Reconfigurations of Models at Runtime.",
                    "Integrating the Designer in-the-loop for Metamodel/Model Co-Evolution via Interactive Computational Search.",
                    "Unified LTL Verification and Embedded Execution of UML Models.",
                    "A Model-Driven Solution to Support Smart Mobility Planning.",
                    "Lessons Learned from Model-Based Safety Assessment with SysML and Component Fault Trees.",
                    "Digital Behavioral Twins for Safe Connected Cars.",
                    "Engineering Software Diversity: a Model-Based Approach to Systematically Diversify Communications.",
                    "Extending Complex Event Processing to Graph-structured Information.",
                    "Enabling Model Testing of Cyber-Physical Systems.",
                    "Towards Testing from Finite State Machines with Symbolic Inputs and Outputs.",
                    "Measures to report the Location Problem of Model Fragment Location.",
                    "Improving the Developer Experience with a Low-Code Process Modelling Language.",
                    "A Feature-based Survey of Model View Approaches.",
                    "Model-Based Software Engineering: A Multiple-Case Study on Challenges and Development Efforts.",
                    "An Empirical Investigation to Understand the Difficulties and Challenges of Software Modellers When Using Modelling Tools.",
                    "Effort Used to Create Domain-Specific Modeling Languages.",
                    "A Decade of Software Design and Modeling: A Survey to Uncover Trends of the Practice.",
                    "Recommending Model Refactoring Rules from Refactoring Examples.",
                    "Refactoring Architecture Models for Compliance with Custom Requirements.",
                    "Model-Driven Trace Diagnostics for Pattern-based Temporal Specifications.",
                    "On Computing Instructions to Repair Failed Model Refinements.",
                    "Towards sound, optimal, and flexible building from megamodels.",
                    "Robust Hashing for Models.",
                    "Incremental View Model Synchronization Using Partial Models.",
                    "Towards Scalable Model Views on Heterogeneous Model Resources.",
                    "Slicing UML-based Models of Real-time Embedded Systems.",
                    "HITECS: A UML Profile and Analysis Framework for Hardware-in-the-Loop Testing of Cyber Physical Systems.",
                    "Hybrid Co-simulation: It's About Time.",
                    "Towards a Language Server Protocol Infrastructure for Graphical Modeling.",
                    "Visualizations of Evolving Graphical Models in the Context of Model Review.",
                    "Dissimilarity Measures for Clustering Space Mission Architectures.",
                    "Change Propagation-based and Composition-based Co-evolution of Transformations with Evolving Metamodels.",
                    "Integration of Visual Contracts and Model Transformation for Enhanced MDE Development.",
                    "Assurance via model transformations and their hierarchical refinement.",
                    "From Deployment to Platform Exploration: Automatic Synthesis of Distributed Automotive Hardware Architectures.",
                    "Highly-Optimizing and Multi-Target Compiler for Embedded System Models: C++ Compiler Toolchain for the Component and Connector Language EmbeddedMontiArc.",
                    "Efficient use of local energy: An activity oriented modeling to guide Demand Side Management."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2018c",
                "sub_name": "Proceedings of the 21st ACM/IEEE International Conference on Model Driven Engineering Languages and Systems: Companion Proceedings, MODELS 2018, Copenhagen, Denmark, October 14-19, 2018.",
                "count": 35,
                "papers": [
                    "A tool for automatically selecting optimal model transformation chains.",
                    "Towards an adaptive city journey planner with MDE.",
                    "MDEoptimiser: a search based model engineering tool.",
                    "Optimal mapping of task-based computation models over heterogeneous hardware using placer.",
                    "Supporting systematic literature reviews in computer science: the systematic literature review toolkit.",
                    "Incquery server for teamwork cloud: scalable query evaluation over collaborative model repositories.",
                    "Modularizing and layering metamodels with the modular EMF designer.",
                    "Collaborative creation and versioning of modeling languages with MetaEdit+.",
                    "Simgen: a tool for generating simulations and visualizations of embedded systems on the unity game engine.",
                    "Documenting Simulink designs of embedded systems.",
                    "Static extraction of IFML models for Android apps.",
                    "Data mining meets system modelling.",
                    "Ensuring models consistency in a smart grid cosimulation approach.",
                    "BPjs: an extensible, open infrastructure for behavioral programming research.",
                    "Evolution towards teaching a holistic course in model-driven system development: modeling for enterprise architecture with business and system architecture and platform-based development.",
                    "Using MOOC technology and formative assessment in a conceptual modelling course: an experience report.",
                    "Teaching model-based systems engineering for industry 4.0: student challenges and expectations.",
                    "Towards a body of knowledge for model-based software engineering.",
                    "The impact of opt-in gamification on students' grades in a software design course.",
                    "Teaching software language engineering and usability through students peer reviews.",
                    "Practicing domain-specific languages: from code to models.",
                    "How to improve the understanding of roles in modeling.",
                    "How do we teach modelling and model-driven engineering?: a survey.",
                    "We'll make modelers out of 'em yet: introducing modeling into a curriculum.",
                    "Adapting Kirkpatrick's evaluation model to technology enhanced learning.",
                    "Teaching and learning about abstraction.",
                    "Exploration of hardware topologies based on functions, variability and timing.",
                    "A modular approach to integrate verification tools in model based development.",
                    "Multi-model consistency preservation.",
                    "Model-driven development of condition monitoring software.",
                    "Tooling advances inspired to address observed challenges of developing UML-like models when using modelling tools.",
                    "Context-aware traceability across heterogeneous modelling environments.",
                    "Optimization and reconfiguration of IEC 61499-based software architectures.",
                    "Model-driven round-trip software dependability engineering.",
                    "Tolerant consistency management in model-driven engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2018w",
                "sub_name": "Proceedings of MODELS 2018 Workshops: ModComp, MRT, OCL, FlexMDE, EXE, COMMitMDE, MDETools, GEMOC, MORSE, MDE4IoT, MDEbug, MoDeVVa, ME, MULTI, HuFaMo, AMMoRe, PAINS co-located with ACM/IEEE 21st International Conference on Model Driven Engineering Languages and Systems (MODELS 2018), Copenhagen, Denmark, October, 14, 2018.",
                "count": 94,
                "papers": [
                    "Interface protocol inference to aid understanding legacy software components.",
                    "On the Model-driven Synthesis of Adaptable Choreographies.",
                    "A Model-Based Approach to Managing Feature Binding Time in Software Product Line Engineering.",
                    "Teaching Playground for C&C Language EmbeddedMontiArc.",
                    "Compiling Protocols to Promela and Verifying their LTL Properties.",
                    "A Component-Based and Model-Driven Approach to Deal with Non-Functional Properties through Global QoS Metrics.",
                    "Reflecting on the past and the present with temporal graph-based models.",
                    "On the Transition from Design Time to Runtime Model-Based Assurance Cases.",
                    "Model Synchronization with the Role-oriented Single Underlying Model.",
                    "Towards software architecture runtime models for continuous adaptive monitoring.",
                    "Blackbox Learning of Parametric Dependencies for Performance Models.",
                    "A text model - Use your favourite M2M for M2T.",
                    "Multi-Level Constraints.",
                    "Goal-driven elaboration of OCL enriched UML class diagrams.",
                    "Parallel execution of first-order operations.",
                    "Introducing the Active Map operation to unify and improve efficiency of active operations.",
                    "Using process algebra to statically analyze incremental propagation graphs.",
                    "vOCL: A novel approach for UML constraints modeling.",
                    "Efficient validation of large models using the Mogwaı̈ tool.",
                    "Model Finding and Model Completion with USE.",
                    "Comparative case studies in agile model-driven development.",
                    "Stakeholder specific visualisation from heterogeneous modeling tools.",
                    "Towards a modular and flexible human-usable textual syntax for EMF models.",
                    "Towards flexible object and class modeling tools: an experience report.",
                    "Execution of UTP test cases using fUML.",
                    "A generic solution for weaving business code into executable models.",
                    "On executable models that are integrated with program code.",
                    "EmbeddedMontiArc: Textual modeling alternative to Simulink (Tool Demonstration).",
                    "COMMitMDE 2018 - 3rd International Workshop on Collaborative Modelling in MDE.",
                    "Continuous integration support in modeling tools.",
                    "Challenges for reuse in collaborative modeling environments.",
                    "Handling constraints in model versioning.",
                    "Delta-driven collaborative modeling.",
                    "Preface to the 2nd International Workshop on Model Driven Engineering Tools (MDETools 2018).",
                    "Developing a Modeling Tool Someone Wants to Use: Challenges, trends and solutions for how to develop modeling tools that people actually can and want to use.",
                    "Improved traceability for bidirectional model transformations.",
                    "Robotic system testing with AMSA framework.",
                    "An LSP infrastructure to build EMF language servers for web-deployable model editors.",
                    "A study design template for identifying usability issues in graphical modeling tools.",
                    "Implementing the MDETools'18 challenge with ThingML.",
                    "Controlling a virtual rover using AutoFOCUS3.",
                    "An evaluation of Papyrus-RT for solving the leader-follower challenge problem.",
                    "Modeling and programming a leader-follower challenge problem with scenario-based tools.",
                    "Applying Umple to the rover control challenge problem: A case study in model-driven engineering.",
                    "Navigating the rover with xtUML.",
                    "Model Consistency ensured by Metamodel Integration.",
                    "A Common Integrated Framework for Heterogeneous Modeling Services.",
                    "Tool-Support of Socio-Technical Coordination in the Context of Heterogeneous Modeling.",
                    "CPS simulation models categories in Extended Enterprises.",
                    "Adding a HenshinEngine to GEMOC Studio: An experience report.",
                    "CommonLang: A DSL for Defining Robot Tasks.",
                    "Embedding Scenario-based Modeling in Statecharts.",
                    "Continuous Integration for Testing Full Robotic Behaviours in a GUI-stripped Simulation.",
                    "Towards the use of Quality-of-Service Metrics in Reinforcement Learning: A Robotics Example.",
                    "Using IEC 61499 to Implement a Self-Organising Plug and Produce System.",
                    "A Context-Based Behavioral Language for IoT.",
                    "Static Analysis of Complex Event Processing Programs.",
                    "Domain Model-Based Data Stream Validation for Internet of Things Applications.",
                    "DSML4TinyOS: Code Generation for Wireless Devices.",
                    "ML4CREST: Machine Learning for CPS Models.",
                    "ThingML+: Augmenting Model-Driven Software Engineering for the Internet of Things with Machine Learning.",
                    "An Initial Mapping Study on MDE4IoT.",
                    "Debugging of Model Transformations and Contracts in SyVOLT.",
                    "Towards Providing Debugging in the Domain-Specific Modeling Languages for Software Agents.",
                    "A Generalized Stepping Semantics for Model Debugging.",
                    "Towards an Automated Fault Localizer while Designing Meta-models.",
                    "ProVer: an SMT-based approach for process verification.",
                    "Generation of test strategies for Model-based Functional Safety testing using an Artifact-centric approach.",
                    "Balancing Model Usability and Verifiability with SBVR and Answer Set Programming.",
                    "Semantic Differencing of Activity Diagrams by a Translation into Finite Automata.",
                    "Improving Trace-Based Propagation of Feature Annotations in Model Transformations.",
                    "Towards Hybrid Model Persistence.",
                    "Towards a Metamodel for Modular Simulation Environments.",
                    "Reuse Considerations in Evolving Software Products: The Software Product Line Perspective.",
                    "Resilience in Sirius Editors: Understanding the Impact of Metamodel Changes.",
                    "A tool for the convergence of multilevel modelling approaches.",
                    "The bicycle challenge in DMLA, where validation means correct modeling.",
                    "Multi-level modeling with MELANEE.",
                    "Multilevel modelling of coloured petri nets.",
                    "A story of levels.",
                    "Context-aware factors in rearchitecting two-level models into multilevel models.",
                    "Multilevel modeling: what's in a level? A position paper.",
                    "Practical experiences with multi-level modeling using FMMLx: a hierarchy of domain-specific modeling languages in support of life-cycle assessment.",
                    "Multi-level modeling with XML.",
                    "Toward a unified conception of multi-level modelling: advanced requirements.",
                    "Modeling and Analyzing Information Flow in Development Teams as a Pipe System.",
                    "Comparing the comprehensibility of numeric versus symbolic contribution labels in goal models: an experimental design.",
                    "The visual inheritance structure to support the design of visual notations.",
                    "Using sketch recognition for capturing developer's mental models.",
                    "ModelByVoice - towards a general purpose model editor for blind people.",
                    "Comparing the Developer Experience with two Multi-Agents Systems DSLs: SEA_ML++ and DSML4MAS - Study Design.",
                    "Automatic model repair using reinforcement learning.",
                    "Model analytics for feature models: case studies for S.P.L.O.T. repository.",
                    "Exploring model repositories by means of megamodel-aware search operators."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th MoDELS 2017",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2017",
                "sub_name": "20th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems, MODELS 2017, Austin, TX, USA, September 17-22, 2017.",
                "count": 38,
                "papers": [
                    "Bidirectional Transformations in the Large.",
                    "Translating Target to Source Constraints in Model-to-Model Transformations.",
                    "On Additivity in Transformation Languages.",
                    "How is ATL Really Used? Language Feature Use in the ATL Zoo.",
                    "Language Design with Intent.",
                    "SQL-PL4OCL: An Automatic Code Generator from OCL to SQL Procedural Language.",
                    "A Fuzzy Logic Based Approach for Model-Based Regression Test Selection.",
                    "Partial Evaluation of OCL Expressions.",
                    "Reusable Specification Templates for Defining Dynamic Semantics of DSLs.",
                    "Active Domain-Specific Languages: Making Every Mobile User a Modeller.",
                    "Experiences with Teaching MPS in Industry: Towards Bringing Domain Specific Languages Closer to Practitioners.",
                    "Software Product Lines with Design Choices: Reasoning about Variability and Design Uncertainty.",
                    "Transformations of Software Product Lines: A Generalizing Framework Based on Category Theory.",
                    "Revisiting Visitors for Modular Extension of Executable DSMLs.",
                    "From Secure Business Process Modeling to Design-Level Security Verification.",
                    "Why is My Component and Connector Views Specification Unsatisfiable?",
                    "Tool Support for Live Formal Verification.",
                    "Model-Driven Development of Safety Architectures.",
                    "Component and Connector Views in Practice: An Experience Report.",
                    "Synthesis and Exploration of Multi-level, Multi-perspective Architectures of Automotive Embedded Systems (SoSYM Abstract).",
                    "Managing Design-Time Uncertainty.",
                    "The Next Evolution of MDE: A Seamless Integration of Machine Learning into Domain Modeling.",
                    "Raising Time Awareness in Model-Driven Engineering: Vision Paper.",
                    "Co-Evolution of Meta-Modeling Syntax and Informal Semantics in Domain-Specific Modeling Environments - A Case Study of AUTOSAR.",
                    "Property-Based Locking in Collaborative Modeling.",
                    "Heuristic-Based Recommendation for Metamodel - OCL Coevolution.",
                    "Ecoreification: Making Arbitrary Java Code Accessible to Metamodel-Based Tools.",
                    "User Experience for Model-Driven Engineering: Challenges and Future Directions.",
                    "Bridging Proprietary Modelling and Open-Source Model Management Tools: The Case of PTC Integrity Modeller and Epsilon.",
                    "Ontology-Based Pattern for System Engineering.",
                    "DREAMS Toolchain: Model-Driven Engineering of Mixed-Criticality Systems.",
                    "Bringing DSE to Life: Exploring the Design Space of an Industrial Automotive Use Case.",
                    "A Systematic Mapping Study on Modeling for Industry 4.0.",
                    "An Empirical Study on the Maturity of the Eclipse Modeling Ecosystem.",
                    "A Survey of Tool Use in Modeling Education.",
                    "Symbolic Execution for Realizability-Checking of Scenario-Based Specifications.",
                    "A Model-Driven Approach to Trace Checking of Pattern-Based Temporal Properties.",
                    "Removal of Redundant Elements within UML Activity Diagrams."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2017s",
                "sub_name": "Proceedings of MODELS 2017 Satellite Event: Workshops (ModComp, ME, EXE, COMMitMDE, MRT, MULTI, GEMOC, MoDeVVa, MDETools, FlexMDE, MDEbug), Posters, Doctoral Symposium, Educator Symposium, ACM Student Research Competition, and Tools and Demonstrations co-located with ACM/IEEE 20th International Conference on Model Driven Engineering Languages and Systems (MODELS 2017), Austin, TX, USA, September, 17, 2017.",
                "count": 94,
                "papers": [
                    "Model-based Design of Reusable Secure Connectors.",
                    "A Classification of Dynamic Reconfiguration in Component and Connector Architecture Description.",
                    "Model-driven Development of Adaptive IoT Systems.",
                    "OCL Framework to Verify Extra-Functional Properties in Component and Connector Models.",
                    "Model-driven Generation of a BPMS Portal Based on Interaction Flow Modeling Language Models.",
                    "A Multipurpose Framework for Model-based Reuse-oriented Software Integration Synthesis.",
                    "A Look-Ahead Strategy for Rule-Based Model Transformations.",
                    "A Graph Transformation Approach to Introducing Aspects into Software Architectures.",
                    "Metamodels Relaxation for Model Family Support.",
                    "Edelta: An Approach for Defining and Applying Reusable Metamodel Refactorings.",
                    "Create and Play Your Pac-Man Game with the GEMOC Studio.",
                    "Executing Models by Filmstripping: Enhancing Validation by Filmstrip Templates and Transformation Alternatives.",
                    "Executing Robot Task Models in Dynamic Environments.",
                    "Towards One Model Interpreter for Both Design and Deployment.",
                    "Simulation Framework for Executing Component and Connector Models of Self-Driving Vehicles.",
                    "Consistency Recovery in Interactive Modeling.",
                    "Supporting Consensus-based Sofware Development: a Vision Paper.",
                    "Towards Efficient Evaluation of Rule-based Permissions for Fine-grained Access Control in Collaborative Modeling.",
                    "Modeling and Enactment Support for Early Detection of Inconsistencies in Engineering Processes.",
                    "Towards Collaborative Modeling Using a Concern-driven Version Control System.",
                    "Feature Model for Collaborative Modeling Environments.",
                    "Active System Integrity Fences.",
                    "Reflexive and Evolutional Digital Service Ecosystems with Models at Runtime.",
                    "Run-time Software Architectural Models for Adaptation, Recovery and Evolution.",
                    "Using Models at Run Time to Detect Incomplete and Inconsistent Requirements.",
                    "Validated Multi-layer Meta-modeling via Intrinsically Modeled Operations.",
                    "A Multi-level Approach for Model-based User Interface Development.",
                    "Developing an Ontological Sandbox: Investigating Multi-level Modelling's Possible Metaphysical Structures.",
                    "Applying Multi-level Modeling to Data Integration in Product Line Engineering.",
                    "Maintenance of Multi-level Models - An Analysis of Elementary Change Operations.",
                    "Extending a UML and OCL Tool for Multi-levels: Applications Towards Model Quality Assessment.",
                    "DeepRuby: Extending Ruby with Dual Deep Instantiation.",
                    "An Example Application of a Multi-level Concrete Syntax Specification with Copy-and-Complete Semantics.",
                    "Multilevel Modelling with MultEcore: A Contribution to the MULTI 2017 Challenge.",
                    "On Evaluating Multi-level Modeling.",
                    "Bridging Engineering and Formal Modeling: WebGME and Formula Integration.",
                    "CREST - A Continuous, REactive SysTems DSL.",
                    "Modeling Co-simulation: A First Experiment.",
                    "Modular Transformation from AF3 to nuXmv.",
                    "Supporting Model Refinement with Equivalence Checking in the Context of Model-driven Engineering with UML-RT.",
                    "Modeling Frames.",
                    "Architecture-driven Reduction of Specification Overhead for Verifying Confidentiality in Component-based Software Systems.",
                    "Adding Random Operations to OCL.",
                    "Hierarchical Model Exploration for Exposing Off-nominal Behaviors.",
                    "Challenges and Research Directions for Successfully Applying MBE Tools in Practice.",
                    "ReMoDD Eclipse Plug-in: Collaborative Modeling Using a Model Repository.",
                    "Engineering a ROVER Language in GEMOC STUDIO & MONTICORE: A Comparison of Language Reuse Support.",
                    "A Scenario-based MDE Process for Developing Reactive Systems: A Cleaning Robot Example.",
                    "Modeling as a Service: A Survey of Existing Tools.",
                    "Investigating the Effects of Integrating Handcrafted Code in Model-Driven Engineering.",
                    "Visual Variables in UML: a First Empirical Assessment.",
                    "Agile Model-driven Engineering of Financial Applications.",
                    "Explicitly Modelling the Type/Instance Relation.",
                    "Practical Aspects of the Integration of Agile Development and Model-driven Development: An Exploratory Study.",
                    "Process-Aware Model-driven Development Environments.",
                    "A Process for Integrating Agile Software Development and Model-driven Development.",
                    "The Conformance Relation Challenge: Building Flexible Modelling Frameworks.",
                    "Towards Agile Model-based Systems Engineering.",
                    "Turning Models Inside Out.",
                    "Enhancing Flexibility in User Interaction Modeling by Adding Design Uncertainty to IFML.",
                    "Report on the 1st International Workshop on Debugging in Model-Driven Engineering (MDEbug'17).",
                    "Moldable Debugging.",
                    "Transformations Debugging Transformations.",
                    "Towards Debugging the Matching of Henshin Model Transformations Rules.",
                    "Domain-level Debugging for Compiled DSLs with the GEMOC Studio.",
                    "Debugging Non-determinism: a Petrinets Modelling, Analysis, and Debugging Tool.",
                    "Model-driven Automated Deployment of Large-scale CPS Co-simulations in the Cloud.",
                    "A Resource Oriented Modeling Approach for the Internet of Things: A Business Process Perspective.",
                    "Survey on Template-based Code Generation.",
                    "A Case of Industrial vs. Open-source OCL: Not So Different After All.",
                    "JAVACHECK: A Domain Specific Language for the Static Analysis of Java Code.",
                    "MDE-based Automated Provisioning and Management of Cloud Applications.",
                    "Model Driven Design of IT Systems for Smart Grids.",
                    "Towards a Model-driven Approach for Context-aware Software.",
                    "Modeling Language Evolution for Model Family Support.",
                    "Feature-oriented Modeling for Collaborative Virtual Environment Construction.",
                    "Towards Model Driven Verifiable Deployment of Distributed Simulations in Cloud.",
                    "Verification of Non-functional Requirements Using Formal Semantics.",
                    "Improving Model-based Regression Test Selection.",
                    "UML Class Diagram Composition Using Software Requirements Specifications.",
                    "On Understanding Teaching Modeling in Computer Science as an Ecosystem.",
                    "Modeling in Agile Project Courses.",
                    "Challenges in Teaching Modeling in Agile Software Engineering Courses.",
                    "In Praise of Use Cases.",
                    "Teaching Model Views with UML and OCL.",
                    "Influence of Programming Style in Transformation Bad Smells: Mining of ETL Repositories.",
                    "Teaching Software Modeling and Design.",
                    "Advanced Techniques and Tools for Secure Collaborative Modeling.",
                    "MaRTS: A Model-Based Regression Test Selection Approach.",
                    "Assisted Modelling Over Social Networks with SOCIO.",
                    "EARS-CTRL: Generating Controllers for Dummies.",
                    "A Tool to Edit and Verify IoT System Architecture Model.",
                    "Generating Filmstrip Models from Actor-Based Systems.",
                    "Extending Osate 2 for Custom Simulation of Virtual Devices."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th MoDELS 2016",
        "info": "Saint-Malo, France",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2016",
                "sub_name": "Proceedings of the ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems, Saint-Malo, France, October 2-7, 2016.",
                "count": 42,
                "papers": [
                    "Multi-variability modeling and realization for software derivation in industrial automation management.",
                    "A model-based approach for multi-device user interactions.",
                    "Using free modeling as an agile method for developing domain specific modeling languages.",
                    "Supporting the model-driven development of real-time embedded systems with run-time monitoring and animation via highly customizable code generation.",
                    "Model-driven performance prediction of systems of systems.",
                    "Automatic generation of detailed flight plans from high-level mission descriptions.",
                    "Towards a categorical approach for meta-modelling epistemic game theory.",
                    "OCL2MSFOL: a mapping to many-sorted first-order logic for efficiently checking the satisfiability of OCL constraints.",
                    "On the synthesis of protocol state machines from contracts.",
                    "Towards the characterization of realistic models: evaluation of multidisciplinary graph metrics.",
                    "Unifying explanatory and constructive modeling: towards removing the gulf between ontologies and conceptual models.",
                    "Metamodel specialization for graphical modeling language support.",
                    "Visual modeling of RESTful conversations with RESTalk.",
                    "Formalizing knowledge in multi-scale agent-based simulations.",
                    "Process mining using BPMN: relating event logs and process models.",
                    "ThingML: a language and code generation framework for heterogeneous targets.",
                    "Modern C++ as a modeling language for automated driving and human-robot collaboration.",
                    "Handling index-out-of-bounds in safety-critical embedded C code using model-based development.",
                    "Controlled experiment on the comprehension of runtime phenomena using models created at design time.",
                    "Technical debt in MDE: a case study on GMF/EMF-based projects.",
                    "The quest for open source projects that use UML: mining GitHub.",
                    "Incremental diagram layout for automated model migration.",
                    "A model management approach for assurance case reuse due to system evolution.",
                    "Towards the verification of industrial communication protocols through a simulation environment based on QEMU and systemC.",
                    "Descriptive vs prescriptive models in industry.",
                    "The problems with eclipse modeling tools: a topic analysis of eclipse forums.",
                    "Model-driven software engineering in the openETCS project: project experiences and lessons learned.",
                    "Extracting domain models from natural-language requirements: approach and industrial evaluation.",
                    "Ground setting properties for an efficient translation of OCL in SMT-based model finding.",
                    "Feature location in models through a genetic algorithm driven by information retrieval techniques.",
                    "A generic transformation algorithm to simplify the development of mapping models.",
                    "Automated refactoring of ATL model transformations: a search-based approach.",
                    "Model transformation for end-user modelers with VMTL.",
                    "Incremental backward change propagation of view models by logic solvers.",
                    "PrefetchML: a framework for prefetching and caching models.",
                    "Partial loading of XMI models.",
                    "Integration of a graph-based model indexer in commercial modelling tools.",
                    "Query-based access control for secure collaborative modeling using bidirectional transformations.",
                    "Towards mutation analysis for use cases.",
                    "A generic framework for model-set selection for the unification of testing and learning MDE tasks.",
                    "Automatic detection of incomplete requirements via symbolic analysis.",
                    "A requirement driven testing method for multi-disciplinary system design."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016pame-volt",
                "sub_name": "Joint Proceedings of the Second International Workshop on Patterns in Model Engineering and the Fifth International Workshop on the Verification of Model Transformation, PAME/VOLT 2016, co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2016), Saint-Malo, France, October 2-3, 2016.",
                "count": 8,
                "papers": [
                    "Towards the integration of security patterns in UML component-based applications.",
                    "Model-based diagnosis patterns for model checking.",
                    "Applying UI patterns for modeling dialogs.",
                    "Real-time model-driven engineering: an overview.",
                    "Verified bidirectional transformations by construction.",
                    "Towards incremental deductive verification for ATL.",
                    "Generating effective test suites for model transformations using classifying terms.",
                    "On reducing model transformation testing overhead."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016flexmde",
                "sub_name": "Proceedings of the 2nd Workshop on Flexible Model Driven Engineering co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2016), Saint-Malo, France, October 2, 2016.",
                "count": 5,
                "papers": [
                    "A Metamodeling Framework for Promoting Flexibility and Creativity Over Strict Model Conformance.",
                    "A Bottom Up Approach to Model Based Program Validation.",
                    "Towards Flexible Parsing of Structured Textual Model Representations.",
                    "Extending UML Templates Towards Flexibility.",
                    "JSMF: a Javascript Flexible Modelling Framework."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016me",
                "sub_name": "Proceedings of the 10th Workshop on Models and Evolution co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint-Malo, France, October 2, 2016.",
                "count": 10,
                "papers": [
                    "Version Control for Models: From Research to Industry and Back Again.",
                    "DSL/Model Co-Evolution in Industrial EMF-Based MDSE Ecosystems.",
                    "Software Evolution Management: Industrial Practices.",
                    "Automatic Change Recommendation of Models and Meta Models Based on Change Histories.",
                    "On Leveraging UML/OCL for Model Synchronization.",
                    "Challenges in the Evolution of Metamodels: Smells and Anti-Patterns of a Historically-Grown Metamodel.",
                    "Semantic-based Model Matching with EMFCompare.",
                    "Heterogeneous Megamodel Slicing for Model Evolution.",
                    "Evolving Multi-Tenant SaaS Cloud Applications Using Model-Driven Engineering.",
                    "Towards a Software Product Line for Machine Learning Workflows: Focus on Supporting Evolution."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016multi",
                "sub_name": "Proceedings of the 3rd International Workshop on Multi-Level Modelling co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2016), Saint-Malo, France, October 4, 2016.",
                "count": 6,
                "papers": [
                    "Designing Models and Systems to Support IT Management: A Case for Multilevel Modeling.",
                    "A Feature-based Comparison of Melanee and Metadepth.",
                    "An Evaluation of Multi-Level Modeling Frameworks for Extensible Graphical Editing Tools.",
                    "A Feature-based Categorization of Multi-Level Modeling Approaches and Tools.",
                    "Multi-level Language Descriptions.",
                    "MultEcore: Combining the Best of Fixed-Level and Multilevel Metamodelling."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016ocl",
                "sub_name": "Proceedings of the 16th International Workshop on OCL and Textual Modelling co-located with 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint-Malo, France, October 2, 2016.",
                "count": 12,
                "papers": [
                    "On the Support of Qualified Associations in OCL.",
                    "Encapsulation, Operator Overloading, and Error Class Mechanisms in OCL.",
                    "On the Functional Interpretation of OCL.",
                    "Extendable Toolchain for Automatic Compatibility Checks.",
                    "A Comparison of Textual Modeling Languages: OCL, Alloy, FOML.",
                    "Modeling and Reasoning with Multirelations, and their encoding in Alloy.",
                    "Integrating UML/OCL Derived Properties into Validation and Verification Processes.",
                    "Declarative Model Transformation Execution Planning.",
                    "Efficient OCL-based Incremental Transformations.",
                    "Models from Code, or Code as Models?",
                    "Re-Implementing Apache Thrift using Model-Driven Engineering Technologies: An Experience Report.",
                    "Recent Developments in OCL and Textual Modelling."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016modevva",
                "sub_name": "Proceedings of the 13th Workshop on Model-Driven Engineering, Verification and Validation co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint-Malo, France, October 3, 2016.",
                "count": 7,
                "papers": [
                    "Mapping Component Models on Distributed Architectures: Correctness Checking.",
                    "Discovering Timing Feature Interactions with Timed UML 2 Interactions.",
                    "Abstract Interpretation for Block Diagrams - Two Case Studies.",
                    "A DSL to Feedback Formal Verification Results.",
                    "Integrating an SMT-Based ModelFinder into USE.",
                    "Modeling State Diagrams with And-Cross Transitions.",
                    "A Systematic Approach for Designing Mutation Operators for MDE Languages."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016modcomp",
                "sub_name": "Proceedings of the 3rd International Workshop on Interplay of Model-Driven and Component-Based Software Engineering co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2016), Saint-Malo, France, October 2nd, 2016.",
                "count": 6,
                "papers": [
                    "Feature-Oriented Modelling in BIP: A Case Study.",
                    "Towards a Meta-Model for Quality-aware Self-Adaptive Systems Design.",
                    "Consistent Extra-Functional Properties Tagging for Component and Connector Models.",
                    "Fault-aware Pareto Frontier Exploration for Dependable System Architectures.",
                    "Towards Concern-Oriented Design of Component-Based Systems.",
                    "Performance Modeling in the Age of Big Data: Some reflections on current limitations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016commitmde",
                "sub_name": "Proceedings of the 1st International Workshop on Collaborative Modelling in MDE (COMMitMDE 2016) co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2016), St. Malo, France, October 4, 2016.",
                "count": 5,
                "papers": [
                    "Engineering Process Transformation to Manage (In)consistency.",
                    "Deriving Effective Permissions for Modeling Artifacts from Fine-grained Access Control Rules.",
                    "Approaching Collaborative Modeling as an Uncertainty Reduction Process.",
                    "Towards Inconsistency Tolerance by Quantification of Semantic Inconsistencies.",
                    "A Model-Driven Approach for the Development of CSCL Tools that Considers Pedagogical Usability."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016dp",
                "sub_name": "Proceedings of the MoDELS 2016 Demo and Poster Sessions co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2016), Saint-Malo, France, October 2-7, 2016.",
                "count": 13,
                "papers": [
                    "NeoEMF: a Multi-database Model Persistence Framework for Very Large Models.",
                    "txtUML.",
                    "Scenario-Based Modeling and Synthesis for Reactive Systems with Dynamic System Structure in ScenarioTools.",
                    "iOCL: An Interactive Tool for Specifying, Validating and Evaluating OCL Constraints.",
                    "Tsmart-BIPEX: An Integrated Graphical Design Toolkit for Software Systems.",
                    "SAC-OCL: A Tool for A Semi Automatic Co-evolution of OCL Constraints.",
                    "C Code Verification based on the Extended Labeled Transition System Model.",
                    "ArchFeature: A Modeling Environment Integrating Features into Product Line Architecture.",
                    "Reifier: Model-Driven Engineering of Component-Based and Service-Oriented JEE Applications.",
                    "ModifRoundtrip: A Model-Based tool to reuse legacy transformations.",
                    "Operators for Template-Based MDE.",
                    "An Approach for Synthesizing Energy-Efficient Controllers for Production Systems from Scenario-Based Specifications.",
                    "Six (Im)possible Things before Breakfast: Building-Blocks and Design-Principles for Wise Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016ds",
                "sub_name": "Proceedings of the Doctoral Symposium at the 19th ACM/IEEE International Conference of Model-Driven Engineering Languages and Systems 2016 (MoDELS 2016), Saint Malo, France, October 2, 2016.",
                "count": 7,
                "papers": [
                    "Gamification of Software Modelling Learning.",
                    "Chronos - Scalable Model Versioning, Querying & Persistence.",
                    "Decomposition of Design Space Exploration Problems in the Context of model-based Development.",
                    "A DSL for Model Mutation and its Applications to Different Domains.",
                    "Traceability of Information Flow Requirements in Cyber-Physical Systems Engineering.",
                    "Constructing Scalable Domain-Specific Graphical Modelling Languages.",
                    "Early Timing Analysis of Vehicular Systems: the Road from Single-core to Multi-core."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016gemoc",
                "sub_name": "Proceedings of the 4th International Workshop on the Globalization Of Modeling Languages co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint Malo, France, October 4th, 2016.",
                "count": 6,
                "papers": [
                    "Report of the Fourth Workshop on the Globalization of Modeling Languages (GEMOC 2016).",
                    "Embedding Component Behavior DSLs into the MontiArcAutomaton ADL.",
                    "Alignment of viewpoint heterogeneous design models: \"Emergency Department\" Case Study.",
                    "Towards Semantic Integration of Plant Behavior Models with AutomationML's Intermediate Modeling Layer.",
                    "fSysML: Foundational Executable SysML for Cyber-Physical System Modeling.",
                    "A New Approach of Qualitative Simulation for the Validation of Hybrid Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016src",
                "sub_name": "Proceedings of the ACM Student Research Competition at MODELS 2016 co-located with the 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), St. Malo, France, October 3-4, 2016.",
                "count": 7,
                "papers": [
                    "Scalable Graph Query Evaluation and Benchmarking with Realistic Models.",
                    "Foundations for Continuous Time Hierarchical Co-simulation.",
                    "Efficient Persistence and Query Techniques for Very Large Models.",
                    "A Multi-Paradigm Modeling Foundation for Collaborative Multi-view Model/System Development.",
                    "Formal Validation and Model Synthesis for Domain-specific Languages by Logic Solvers.",
                    "Two Opportunities and Challenges of Automatic Layout in Visual Languages.",
                    "Validating Emergent Behaviours in Systems-of-Systems through Model Transformations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016exe",
                "sub_name": "Proceedings of the 2nd International Workshop on Executable Modeling co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint-Malo, France, October 3, 2016.",
                "count": 9,
                "papers": [
                    "Resource Analysis and Automated Verification for the Thirty Meter Telescope using Executable SysML Models.",
                    "Defining Semantic Variations of Diagrammatic Languages Using Behavioral Programming and Queries.",
                    "Concurrency-aware Executable Domain-Specific Modeling Languages as Models of Concurrency.",
                    "Interactive Debugging for Extensible Languages in Multi-Stage Transformation Environments.",
                    "Local Optimizations in Eclipse QVTc and QVTr using the Micro-Mapping Model of Computation.",
                    "xtUML: Current and Next State of a Modeling Dialect.",
                    "SimQRi - A Query-oriented Tool for the Efficient Simulation and Analysis of Process Models.",
                    "On Leveraging Executable Language Engineering for Domain-Specific Transformation Languages.",
                    "On the Executable Nature of Models."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016hufamo",
                "sub_name": "Proceedings of the Second International Workshop on Human Factors in Modeling co-located with ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint Malo, France, October 4, 2016.",
                "count": 6,
                "papers": [
                    "Second International Workshop on Human Factors in Modeling (HuFaMo 2016) - Preface.",
                    "Towards a New Generation of Software Design Environments: Supporting the Use of Informal and Formal Notations with OctoUML.",
                    "A Controlled Experiment Template for Evaluating the Understandability of Model Transformation Languages.",
                    "Comparing Value-Driven Methods: an Experiment Design.",
                    "Comparing Reuse Mechanisms for Model Transformation Languages: Design for an Empirical Study.",
                    "Empirical Activity: Assessing the Perceptual Properties of the Size Visual Variation in UML Sequence Diagram."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2016edusym",
                "sub_name": "Joint Proceedings of the 12th Educators Symposium (EduSymp 2016) and 3rd International Workshop on Open Source Software for Model Driven Engineering (OSS4MDE 2016) co-located with the ACM/IEEE 19th International Conference on Model Driven Engineering Languages and Systems (MODELS 2016), Saint Malo, France, October 3, 2016.",
                "count": 9,
                "papers": [
                    "Constructive Alignment in Teaching Modeling.",
                    "Quantitative Conceptual Model Analysis for Evaluating Simple Class Diagrams made by Novices.",
                    "Towards a Corpus of Use-Cases for Model-Driven Engineering Courses.",
                    "Teaching Domain-Specific Language Engineering and Model-Driven Software Development: A Competence-oriented Approach.",
                    "From Document-Based to Model-Based System and Software Engineering: Experience Report of a Selective Catalytic Reduction System Development.",
                    "Run-time Monitoring of a Rover: MDE Research with Open Source Software and Low-cost Hardware.",
                    "Community-based Software Development for MDE Tools.",
                    "Usable Design Space Exploration in AutoFOCUS3.",
                    "CHESS: an Open Source Methodology and Toolset for the Development of Critical Systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th MoDELS 2015",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2015",
                "sub_name": "18th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems, MoDELS 2015, Ottawa, ON, Canada, September 30 - October 2, 2015.",
                "count": 53,
                "papers": [
                    "Modelling the climate system: Is model-based science like model-based engineering? (Keynote).",
                    "Software supply chains (keynote).",
                    "Automobile: Aircraft or smartphone? Modeling challenges and opportunities in Automotive Systems (keynote).",
                    "Reusable event types for models at runtime to support the examination of runtime phenomena.",
                    "Incremental symbolic execution of evolving state machines.",
                    "A framework for relating syntactic and semantic model differences.",
                    "Engineering tagging languages for DSLs.",
                    "Process mining in software systems: Discovering real-life business transactions and process models from distributed systems.",
                    "State machine antipatterns for UML-RT.",
                    "Enhancing the communication value of UML models with graphical layers.",
                    "A model-based framework for probabilistic simulation of legal policies.",
                    "Stream my models: Reactive peer-to-peer distributed models@run.time.",
                    "Beyond discrete modeling: A continuous and efficient model for IoT.",
                    "Infrastructure as runtime models: Towards Model-Driven resource management.",
                    "Fragmenta: A theory of fragmentation for MDE.",
                    "Consistent co-evolution of models and transformations.",
                    "Synthesizing tests for combinatorial coverage of modal scenario specifications.",
                    "Systematically deriving domain-specific transformation languages.",
                    "Quick fixing ATL model transformations.",
                    "A-posteriori typing for Model-Driven Engineering.",
                    "Pattern-based development of Domain-Specific Modelling Languages.",
                    "Checking concurrent behavior in UML/OCL models.",
                    "A Behavioral Coordination Operator Language (BCOoL).",
                    "Textual diagram layout language and visualization algorithm.",
                    "A controlled experiment with Usability Inspection Techniques applied to Use Case Specifications: comparing the MIT 1 and the UCE techniques.",
                    "A unifying approach to connections for multi-level modeling.",
                    "A statistical analysis approach to assist model transformation evolution.",
                    "Enriching megamodel management with collection-based operators.",
                    "SoSPa: A system of Security design Patterns for systematically engineering secure systems.",
                    "Fully verifying transformation contracts for declarative ATL.",
                    "Extracting frame conditions from operation contracts.",
                    "Identification of Simulink model antipattern instances using model clone detection.",
                    "Concern-oriented interfaces for model-based reuse of APIs.",
                    "On the use of UML documentation in software maintenance: Results from a survey in industry.",
                    "Performance prediction upon toolchain migration in model-based software.",
                    "Employing classifying terms for testing model transformations.",
                    "Pattern-based debugging of declarative models.",
                    "Integrating goal-oriented and use case-based requirements engineering: The missing link.",
                    "Applying product line Use case modeling in an industrial automotive embedded system: Lessons learned and a refined approach.",
                    "Systematic generation of standard compliant tool support of diagrammatic modeling languages.",
                    "Improving reuse by means of asymmetrical model migrations: An application to the Orcc case study.",
                    "Toward overcoming accidental complexity in organisational decision-making.",
                    "Modeling user intentions for in-car infotainment systems using Bayesian networks.",
                    "Feature modeling of two large-scale industrial software systems: Experiences and lessons learned.",
                    "Formalizing the ISO/IEC/IEEE 29119 Software Testing Standard.",
                    "A megamodel for Software Process Line modeling and evolution.",
                    "Modular model-based supervisory controller design for wafer logistics in lithography machines.",
                    "An automated model based testing approach for platform games.",
                    "Model-driven regulatory compliance: A case study of \"Know Your Customer\" regulations.",
                    "Identifying duplicate functionality in textual use cases by aligning semantic actions (SoSyM abstract).",
                    "Enhanced graph rewriting systems for complex software domains (SoSyM abstract).",
                    "A situational method for semi-automated enterprise architecture documentation (SoSyM abstract).",
                    "Formalizing and verifying stochastic system architectures using Monterey Phoenix (SoSyM abstract)."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015amt",
                "sub_name": "Proceedings of the 4th Workshop on the Analysis of Model Transformations co-located with the 18th International Conference on Model Driven Engineering Languages and Systems (MODELS 2015), Ottawa, Canada, September 28, 2015.",
                "count": 7,
                "papers": [
                    "Iterative Development of Transformation Models by Using Classifying Terms.",
                    "Transformation Reuse: What is the Intent?",
                    "Towards Benchmarking Evolution Support in Model-to-Text Transformation Systems.",
                    "Finding and Fixing Bugs in Model Transformations with Formal Verification: An Experience Report.",
                    "Towards the Automatic Verification of Behavior Preservation at the Transformation Level for Operational Model Transformations.",
                    "Analysis of Source-to-Target Model Transformations in QueST.",
                    "A Diagrammatic Approach to Model Completion."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015gemoc",
                "sub_name": "Joint Proceedings of the 3rd International Workshop on the Globalization Of Modeling Languages and the 9th International Workshop on Multi-Paradigm Modeling co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems, GEMOC+MPM@MoDELS 2015, Ottawa, Canada, September 28, 2015.",
                "count": 8,
                "papers": [
                    "Property-Based Methods for Collaborative Model Development.",
                    "Programming against Multi-Version Metamodels: A Model Differencing and Virtualization Approach.",
                    "Towards a Formal Semantics of the TESL Specification Language.",
                    "Analyzing Regulatory Conformance in Medical Research Systems Using Multi-Paradigm Modeling.",
                    "Towards Inconsistency Management by Process-Oriented Dependency Modeling.",
                    "Towards a Unifying Approach for Performance-Driven Software Model Refactoring.",
                    "An Expeditious Approach to Modeling IDE Interaction Design.",
                    "Towards a Unifying Model Transformation Bus."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015multi",
                "sub_name": "Proceedings of the 2nd International Workshop on Multi-Level Modelling co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2015), Ottawa, Canada, September 27-28, 2015.",
                "count": 6,
                "papers": [
                    "Experimenting with Multi-Level Models in a Two-Level Modeling Tool.",
                    "Aspect-oriented Concrete Syntax Definition for Deep Modeling Languages.",
                    "Exploring Multi-Level Modeling Relations Using Variability Mechanisms.",
                    "Multi-Language Modelling with Second Order Intensions.",
                    "Practical Multi-level Modeling on MOF-compliant Modeling Frameworks.",
                    "An Algebraic Instantiation Technique Illustrated by Multilevel Design Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015modevva",
                "sub_name": "Proceedings of the 12th Workshop on Model-Driven Engineering, Verification and Validation co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems, MoDeVVa@MoDELS 2015, Ottawa, Canada, September 29, 2015.",
                "count": 6,
                "papers": [
                    "Active World Model for Testing Autonomous Systems Using CEFSM.",
                    "Towards Safe Model Transformation for Constraint-driven Modeling.",
                    "Domain-Specific Model Checking for Cyber-Physical Systems.",
                    "Towards User-Friendly and Efficient Analysis with Alloy.",
                    "Merging Features in Featured Transition Systems.",
                    "Towards an Automatic Approach for Restricting UML/OCL Invariability Clauses."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015src",
                "sub_name": "Proceedings of the ACM Student Research Competition at MODELS 2015 co-located with the ACM/IEEE 18th International Conference MODELS 2015, Ottawa, Canada, September 29, 2015.",
                "count": 11,
                "papers": [
                    "Generating Examples for Knowledge Abstraction in MDE: a Multi-Objective Framework.",
                    "Testing M2M/M2T/T2M Transformations.",
                    "Automated Metamodel/Model Co-Evolution using a Multi-Objective Optimization Approach.",
                    "Change-driven Incremental Symbolic Execution of Evolving State Machines.",
                    "Explicitly Modelling Model Debugging Environments.",
                    "Generating Model with Uncertainty by Means of JTL.",
                    "Architectural and Analytic Integration of Cyber-Physical System Models.",
                    "Model-Based Reuse of APIs using Concern-Orientation.",
                    "Automatic Generation of Transformations for Software Process Tailoring.",
                    "Foundations of a Multi-Paradigm Modelling Tool.",
                    "A Behavioral Programming Approach to Search Based Software Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015acesmb",
                "sub_name": "Joint Proceedings of the 8th International Workshop on Model-based Architecting of Cyber-physical and Embedded Systems and 1st International Workshop on UML Consistency Rules (ACES-MB 2015 & WUCOR 2015) co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2015), Ottawa, Canada, September 28, 2015.",
                "count": 7,
                "papers": [
                    "Introduction to ACES-MB 2015.",
                    "Analytic Dependency Loops in Architectural Models of Cyber-Physical Systems.",
                    "Behavioral Types for Space-aware Systems.",
                    "AutoFOCUS 3: Tooling Concepts for Seamless, Model-based Development of Embedded Systems.",
                    "Introduction to WUCOR 2015.",
                    "Consistency Rules for UML-based Domain-specific Language Models: A Literature Review.",
                    "Proposal for Improving the UML Abstract Syntax."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015flexmde",
                "sub_name": "Proceedings of the Workshop on Flexible Model Driven Engineering co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2015), Ottawa, Canada, September 29, 2015.",
                "count": 7,
                "papers": [
                    "Maximizing the Amount of Information Not Modelled in MDE.",
                    "MUTANT: Model-Driven Unit Testing using ASCII-art as Notational Text.",
                    "Agile Bottom-Up Development of Domain-Specific IDEs for Model-Driven Development.",
                    "Type Inference Using Concrete Syntax Properties in Flexible Model-Driven Engineering.",
                    "Flexible Modelling for Requirements Engineering.",
                    "Taxonomy of Flexible Linguistic Commitments.",
                    "Prototizer: Agile on Steroids."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015ds",
                "sub_name": "Proceedings of the Doctoral Symposium at the 18th ACM/IEEE International Conference of Model-Driven Engineering Languages and Systems 2015 (MoDELS 2015), Ottawa, Canada, September 29, 2015.",
                "count": 9,
                "papers": [
                    "A Model-Based Framework for Legal Policy Simulation and Legal Compliance Checking.",
                    "Integrating Formal Methods with Model-Driven Engineering.",
                    "Privacy Requirement Modeling and Verification in Cloud Computing.",
                    "Multi-Perspective Modeling and Performance Analysis of Software Product Lines.",
                    "Debugging Models in the Context of Automotive Software Development.",
                    "Extended Traits for Model Driven Software Development.",
                    "Optimizing the Symbolic Execution of Communicating and Evolving State Machines.",
                    "A Flexible Approach for Adding Middleware Completions to Software Performance Models.",
                    "Towards Integration of Modeling Methods for Cyber-Physical Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015hufamo",
                "sub_name": "Proceedings of the First International Workshop on Human Factors in Modeling co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2015), Ottawa, Canada, September 28, 2015.",
                "count": 7,
                "papers": [
                    "First International Workshop on Human Factors in Modeling (HuFaMo 2015) - Preface.",
                    "UML Modeling for Visually-Impaired Persons.",
                    "A Vision on a New Generation of Software Design Environments.",
                    "Comparing Comprehensibility of Modelling Languages for Specifying Behavioural Requirements.",
                    "Empirical Study: Comparing Hasselt with C# to Describe Multimodal Dialogs.",
                    "How Do Developers Solve Software-engineering Tasks on Model-based Code Generators? An Empirical Study Design.",
                    "The Effects of Education on Students' Perception of Modeling in Software Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015mase",
                "sub_name": "Proceedings of the International Workshop on Modelling in Automotive Software Engineering co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2015), Ottawa, Canada. September 27, 2015.",
                "count": 7,
                "papers": [
                    "Partitioning Embedded Real-Time Control Software based on Communication Dependencies.",
                    "Detection and Handling of Model Smells for MATLAB/Simulink models.",
                    "Efficient Ontology-Based Modeling of Context-Aware In-Car Infotainment Systems - Benchmark Infrastructure and Design Guidelines.",
                    "Analysis of ISO 26262 Compliant Techniques for the Automotive Domain.",
                    "From Simulation to Operation: Using Design Time Artifacts to Ensure the Safety of Advanced Driving Assistance Systems at Runtime.",
                    "Enhancing Model-Based Engineering of Product Lines by Adding Functional Safety.",
                    "Anticipating Implementation-Level Timing Analysis for Driving Design-Level Decisions in EAST-ADL."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015modcomp",
                "sub_name": "Proceedings of the 2nd International Workshop on Model-Driven Engineering for Component-Based Software Systems co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2015), Ottawa, Canada, September 28, 2015.",
                "count": 7,
                "papers": [
                    "Keynote - Model-driven Analytics with Models@run.time: The Case of Cyber-Physical-Systems.",
                    "Challenges for Model-Integrating Components.",
                    "Towards a Deep Metamodelling Based Formalization of Component Models.",
                    "Generating Domain-Specific Transformation Languages for Component & Connector Architecture Descriptions.",
                    "Towards a Generic Modeling Language for Contract-Based Design.",
                    "Transforming Platform-Independent to Platform-Specific Component and Connector Software Architecture Models.",
                    "A Modular Reference Structure for Component-based Architecture Description Languages."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015oss4mde",
                "sub_name": "Proceedings of the International Workshop on Open Source Software for Model Driven Engineering co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MODELS 2015), Ottawa, Canada, September 29, 2015.",
                "count": 8,
                "papers": [
                    "The Future of Modeling: User-Driven Open Source.",
                    "5 Years of 'Papyrusing' - Migrating Industrial Development from a Proprietary Commercial Tool to Papyrus (Invited Presentation).",
                    "CLARITY: Open-Sourcing the Model-Based Systems Engineering Solution Capella.",
                    "Assessing the Use of Eclipse MDE Technologies in Open-Source Software Projects.",
                    "Integrating Open-Source Modeling Projects: Collaborative Modeling with Papyrus and EMF Compare.",
                    "Papyrus for Education (Invited Presentation).",
                    "Dethroning Programming Languages as Endorsed Means for Fine-grained UML Behaviour Modelling in Open Source MDE.",
                    "PapyrusRT: Modelling and Code Generation (Invited Presentation)."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015exe",
                "sub_name": "Proceedings of the 1st International Workshop on Executable Modeling co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MODELS 2015), Ottawa, Canada, September 27, 2015.",
                "count": 6,
                "papers": [
                    "Executable Modeling with fUML and Alf in Papyrus: Tooling and Experiments.",
                    "UML Model Execution via Code Generation.",
                    "UmpleRun: a Dynamic Analysis Tool for Textually Modeled State Machines using Umple.",
                    "Coping with Semantic Variation Points in Domain-Specific Modeling Languages.",
                    "On the Execution of Deep Models.",
                    "Testing Extensible Language Debuggers."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015edusym",
                "sub_name": "Proceedings of the MODELS Educators Symposium co-located with the ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MODELS 2015), Ottawa, Canada, September 29, 2015.",
                "count": 7,
                "papers": [
                    "UML@Classroom: An Introduction to Object-Oriented Modeling.",
                    "An Approach to Employ Modeling in a Traditional Computer Science Curriculum or: Why Posing Essentials of the Object Constraint Language without Objects and Constraints?",
                    "Flipped Top-Down is Systematic Bottom-Up.",
                    "Uncovering Students' Common Difficulties and Strategies During a Class Diagram Design Process: an Online Experiment.",
                    "Experiences of Teaching Model-based Development.",
                    "Quality Assessment of UML Class Diagrams - A Study Comparing Experts and Students.",
                    "Evaluating Student Work in Modelling Courses."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015pd",
                "sub_name": "Proceedings of the MoDELS 2015 Demo and Poster Session co-located with ACM/IEEE 18th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2015), Ottawa, Canada, September 27, 2015.",
                "count": 15,
                "papers": [
                    "A Tool for Clustering Metamodel Repositories.",
                    "Consolas: A Model-Based Tool for Automatic Configuration and Deployment of Cloud Applications.",
                    "Eclipse Sirius Demonstration.",
                    "Reflecting on Model-based Code Generators Using Traceability Information.",
                    "MMINT: A Graphical Tool for Interactive Model Management.",
                    "A Tool for the Automatic Generation of Multimodel Editors.",
                    "SyVOLT: Full Model Transformation Verification Using Contracts.",
                    "Support for Evaluation of Impact Models in Reuse Hierarchies with jUCMNav and TouchCORE.",
                    "REAssistant: a Tool for Identifying Crosscutting Concerns in Textual Requirements.",
                    "A Usable MDE-based Tool for Software Process Tailoring.",
                    "Executable models for Embedded Controllers Development - A Cloud Based Development Framework.",
                    "A Model-Driven Based Environment for Automatic Model Coordination.",
                    "UML-VT: A Formal Verification Environment for UML Activity Diagrams.",
                    "Facilitating Agile Prototyping of Cloud Applications - A Model-based Approach.",
                    "Simulation-Based Verification of Avionic Systems Deployed on IMA Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2015cloudmde",
                "sub_name": "Proceedings of the 3rd International Workshop on Model-Driven Engineering on and for the Cloud 18th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2015), Ottawa, Canada, September 29, 2015.",
                "count": 7,
                "papers": [
                    "Optimization of Incremental Queries in the Cloud.",
                    "Facilitating Migration of Cloud Infrastructure Services: A Model-Based Approach.",
                    "The Evolution of CloudML and its Applications.",
                    "Building MDE Cloud Services with Distil.",
                    "Code Generation as a Service.",
                    "Towards an MDA Mechanism for RESTful Services Development.",
                    "Model Repositories: Will They Become Reality?"
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th MoDELS 2014",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2014",
                "sub_name": "Model-Driven Engineering Languages and Systems - 17th International Conference, MODELS 2014, Valencia, Spain, September 28 - October 3, 2014. Proceedings.",
                "count": 41,
                "papers": [
                    "Model-Driven Development of Mobile Applications Allowing Role-Driven Variants.",
                    "A Model-Based System to Automate Cloud Resource Allocation and Optimization.",
                    "An Evaluation of the Effectiveness of the Atomic Section Model.",
                    "Parsing in a Broad Sense.",
                    "Streaming Model Transformations By Complex Event Processing.",
                    "On the Use of Signatures for Source Incremental Model-to-text Transformation.",
                    "Modeling Systemic Behavior by State-Based Holonic Modular Units.",
                    "Semantic Model Differencing Utilizing Behavioral Semantics Specifications.",
                    "Formalizing Execution Semantics of UML Profiles with fUML Models.",
                    "Who Knows/Uses What of the UML: A Personal Opinion Survey.",
                    "Assessing the State-of-Practice of Model-Based Engineering in the Embedded Systems Domain.",
                    "The Relevance of Model-Driven Engineering Thirty Years from Now.",
                    "Model-Driven Verifying Compilation of Synchronous Distributed Applications.",
                    "Environment-Centric Contracts for Design of Cyber-Physical Systems.",
                    "Removing Redundancies and Deducing Equivalences in UML Class Diagrams.",
                    "A Native Versioning Concept to Support Historized Models at Runtime.",
                    "Modelling Adaptation Policies as Domain-Specific Constraints.",
                    "Scalable Armies of Model Clones through Data Sharing.",
                    "Three Cases of Feature-Based Variability Modeling in Industry.",
                    "Supporting Multiplicity and Hierarchy in Model-Based Configuration: Experiences and Lessons Learned.",
                    "Propagating Decisions to Detect and Explain Conflicts in a Multi-step Configuration Process.",
                    "An MDA Approach for the Generation of Communication Adapters Integrating SW and FW Components from Simulink.",
                    "A UML Model-Driven Approach to Efficiently Allocate Complex Communication Schemes.",
                    "Model-Integrating Software Components.",
                    "Experiences in Applying Model Driven Engineering to the Telescope and Instrument Control System Domain.",
                    "Model Driven Grant Proposal Engineering.",
                    "Agile Model-Driven Engineering in Mechatronic Systems - An Industrial Case Study.",
                    "Using UML for Modeling Procedural Legal Rules: Approach and a Study of Luxembourg's Tax Law.",
                    "Resolution of Interfering Product Fragments in Software Product Line Engineering.",
                    "Ontology-Based Modeling of Context-Aware Systems.",
                    "Comprehending Feature Models Expressed in CVL.",
                    "On the Impact of Layout Quality to Understanding UML Diagrams: Size Matters.",
                    "Enabling the Development of Cognitive Effective Visual DSLs.",
                    "JUMP - From Java Annotations to UML Profiles.",
                    "SIGMA: Scala Internal Domain-Specific Languages for Model Manipulations.",
                    "A Framework to Benchmark NoSQL Data Stores for Large-Scale Model Persistence.",
                    "Automated Chaining of Model Transformations with Incompatible Metamodels.",
                    "Classification of Model Transformation Tools: Pattern Matching Techniques.",
                    "Learning Implicit and Explicit Control in Model Transformations by Example.",
                    "IncQuery-D: A Distributed Incremental Model Query Framework in the Cloud.",
                    "Translating OCL to Graph Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014modevva",
                "sub_name": "Proceedings of the 11th Workshop on Model-Driven Engineering, Verification and Validation co-located with 17th International Conference on Model Driven Engineering Languages and Systems, MoDeVVa@MODELS 2014, Valencia, Spain, September 30, 2014.",
                "count": 9,
                "papers": [
                    "Assessing the Quality of Meta-models.",
                    "Towards Scalable Multidimensional Execution Traces for xDSMLs.",
                    "Verifying Modelling Languages using Lightning: a Case Study.",
                    "Scalable Verification of Model Transformations.",
                    "A Viewpoint-Based Approach for Formal Safety & Security Assessment of System Architectures.",
                    "Modeling Spatial Aspects of Safety-Critical Systems with Focus-ST.",
                    "Towards a Base Model for UML and OCL Verification.",
                    "Bayesian Reasoning Over Models.",
                    "Colored Petri Net-based Modeling and Formal Analysis of Component-based Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014gemoc",
                "sub_name": "Proceedings of the 2nd International Workshop on The Globalization of Modeling Languages co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems, GEMOC@Models 2014, Valencia, - Spain, September 28, 2014.",
                "count": 9,
                "papers": [
                    "Unification or Integration? The Challenge of Semantics in Heterogeneous Modeling Languages.",
                    "Supporting Diverse Notations in MPS' Projectional Editor.",
                    "Putting the Pieces Together - Technical, Organisational and Social Aspects of Language Integration for Complex Systems.",
                    "Towards Integrating Modeling and Programming Languages: The Case of UML and Java.",
                    "A Declarative Approach to Heterogeneous Multi-Mode Modelling Languages.",
                    "Extensible Global Model Management with Meta-model Subsets and Model Synchronization.",
                    "Towards an Ontology-based Approach for Heterogeneous Model Matching.",
                    "Supporting Debugging in a Heterogeneous, Globally Distributed Environment.",
                    "Understanding Metalanguage Integration by Renarrating a Technical Space Megamodel."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014mpm",
                "sub_name": "Proceedings of the 8th Workshop on Multi-Paradigm Modeling co-located with the 17th International Conference on Model Driven Engineering Languages and Systems, MPM@MODELS 2014, Valencia, Spain, September 30, 2014.",
                "count": 8,
                "papers": [
                    "Integrating System Modeling and Cost Models Using Meta-Modeling Techniques.",
                    "Discrete-Continuous Semantic Adaptations for Simulating SysML Models in VHDL-AMS.",
                    "ProMoBox in Practice : A Case Study on the GISMO Domain-Specific Modelling Language.",
                    "On Synergies between Model Transformations and Semantic Web Technologies.",
                    "Next Generation (Meta)Modeling: Web- and Cloud-based Collaborative Tool Infrastructure.",
                    "Towards an Approach for Orchestrating Design Space Exploration Problems to Fix Multi-Paradigm Inconsistencies.",
                    "Taming Multi-Paradigm Integration in a Software Architecture Description Language.",
                    "Integrating Language and Ontology Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014acvi",
                "sub_name": "Proceedings of the First International Workshop on Architecture Centric Virtual Integration co-located with the 17th International Conference on Model Driven Engineering Languages and Systems, ACVI@MoDELS 2014, Valencia, Spain, September 29, 2014.",
                "count": 9,
                "papers": [
                    "The Story of AADL.",
                    "Contract-Based Specification and Analysis of AADL Models.",
                    "An Extension for AADL to Model Mixed-Criticality Avionic Systems Deployed on IMA architectures with TTEthernet.",
                    "A Discrete-Event Simulator for Early Validation of Avionics Systems.",
                    "Multi-Core Code Generation from Polychronous Programs with Time-Predictable Properties.",
                    "Modeling Shared-Memory Multiprocessor Systems with AADL.",
                    "Executable AADL: Real-Time Simulation of AADL Models.",
                    "Automatic Derivation of AADL Product Architectures in Software Product Line Development.",
                    "Towards an Architecture-Centric Approach Dedicated to Model-Based Virtual Integration for Embedded Software Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014cloudmde",
                "sub_name": "Proceedings of the 2nd International Workshop on Model-Driven Engineering on and for the Cloud co-located with the 17th International Conference on Model Driven Engineering Languages and Systems, CloudMDE@MoDELS 2014, Valencia, Spain, September 30, 2014.",
                "count": 8,
                "papers": [
                    "MDE Opportunities in Multi-Tenant Cloud Applications.",
                    "Towards Cloud-Based Software Process Modelling and Enactment.",
                    "Towards Pattern-Based Optimization of Cloud Applications.",
                    "Modeling Cloud Messaging with a Domain-Specific Modeling Language.",
                    "Cloud DSL: A Language for Supporting Cloud Portability by Describing Cloud Entities.",
                    "Automated Provisioning of Customized Cloud Service Stacks using Domain-Specific Languages.",
                    "UML-based Cloud Application Modeling with Libraries, Profiles, and Templates.",
                    "MDEForge: an Extensible Web-Based Modeling Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014psrc",
                "sub_name": "Joint Proceedings of MODELS 2014 Poster Session and the ACM Student Research Competition (SRC) co-located with the 17th International Conference on Model Driven Engineering Languages and Systems (MODELS 2014), Valencia, Spain, September 28 - October 3, 2014.",
                "count": 15,
                "papers": [
                    "Hypersonic - Model Analysis as a Service.",
                    "A Cloud Architecture for an Extensible Multi-Paradigm Modeling Environment.",
                    "Scalable Model Edition, Query and Version Control Through Embedded Database Persistence.",
                    "A Generic Framework for Realizing Semantic Model Differencing Operators.",
                    "Addressing Multi-Domain Integration Challenge in Robotics using Model-Based Approach.",
                    "Modeling Requirements with RED.",
                    "On the Impact of Diagram Layout: How Are Models Actually Read?",
                    "An Index for Software Engineering Models.",
                    "Towards Model-Defined Cloud of Clouds.",
                    "Framework for Dynamic Architecture Reconfiguration of Cloud Services.",
                    "Model-Driven Engineering Meets the Platform-as-a-Service Model.",
                    "Model-Driven Design of Ensemble-Based Component Systems.",
                    "Exploring Omniscient Debugging for Model Transformations.",
                    "Towards the Automatic Resolution of Architectural Variability in Software Product Line Architectures through Model Transformations.",
                    "Transition from EBNF to Xtext."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014acesmb",
                "sub_name": "Proceedings of the 7th International Workshop on Model-based Architecting and Construction of Embedded Systems co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2014), Valencia, Spain, September 30th, 2014.",
                "count": 5,
                "papers": [
                    "Design Specification of Cyber-Physical Systems: Towards a Domain-Specific Modeling Language based on Simulink, Eclipse Modeling Framework, and Giotto.",
                    "Reusing a Functional Safety Concept in Variable System Architectures.",
                    "Towards Automating Interface Control Documents Elaboration and Management.",
                    "fUML-Driven Performance Analysis through the MOSES Model Library.",
                    "Formal Verification of SystemC Designs using the BLAST Software Model Checker."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014md2p2",
                "sub_name": "Proceedings of the 1st International Workshop on Model-Driven Development Processes and Practices co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2014), Valencia, Spain, September 28, 2014.",
                "count": 5,
                "papers": [
                    "Model-Driven Development Processes and Practices: Foundations and Research Perspectives.",
                    "Introducing Usability Concerns Early in the DSL Development Cycle: FlowSL Experience Report.",
                    "A Qualitative Study of Model Transformation Development Approaches: Supporting Novice Developers.",
                    "Model-Driven Software Development of Safety-Critical Avionics Systems: an Experience Report.",
                    "Towards Enabling Cross-Organizational Modeling in Automotive Ecosystems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014d",
                "sub_name": "Proceedings of the Demonstrations Track of the ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2014), Valencia, Spain, October 1st and 2nd, 2014.",
                "count": 9,
                "papers": [
                    "Bridging Java Annotations and UML Profiles with JUMP.",
                    "DPLfw: A Framework for the Product-Line-Based Generation of Variable Content Documents.",
                    "Combining Textual and Web-Based Modeling.",
                    "Tool Support for Collaborative Software Quality Management.",
                    "DSLFORGE: Textual Modeling on the Web.",
                    "Umple: An Open-Source Tool for Easy-To-Use Modeling, Analysis, and Code Generation.",
                    "Automatic Generation of Consistency-Preserving Edit Operations for MDE Tools.",
                    "From Pen-and-Paper Sketches to Prototypes: The Advanced Interaction Design Environment.",
                    "Concern-Driven Software Development with jUCMNav and TouchRAM."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014oss4mde",
                "sub_name": "Proceedings of the 1st Workshop on Open Source Software for Model Driven Engineering co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages & Systems, OSS4MDE@MoDELS 2014, Valencia, Spain, September 28, 2014.",
                "count": 7,
                "papers": [
                    "Open Source: Innovation Platforms for MBSE?",
                    "Model-Based Engineering: A New Era Based on Papyrus and Open Source Tooling.",
                    "On Developing Open Source MDE Tools: Our Eclipse Stories and Lessons Learned.",
                    "The Influence of the Generator's License on Generated Artifacts.",
                    "On Open Source Tools for Behavioral Modeling and Analysis with fUML and Alf.",
                    "Collected Experience and Thoughts on Long Term Development of an Open Source MDE Tool.",
                    "Software Analytics for MDE Communities."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014multi",
                "sub_name": "Proceedings of the Workshop on Multi-Level Modelling co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2014), Valencia, Spain, September 28, 2014.",
                "count": 12,
                "papers": [
                    "Abstract vs concrete clabjects in dual deep instantiation.",
                    "On metamodel superstructures employing UML generalization features.",
                    "Instance specialization - a pattern for multi-level metamodelling.",
                    "An implementation of multi-level modelling in F-logic.",
                    "A foundation for multi-level modelling.",
                    "Comparing multi-level modeling approaches.",
                    "Towards automating the analysis of integrity constraints in multi-level models.",
                    "Towards flexible, incremental, and paradigm-agnostic consistency checking in multi-level modeling environments.",
                    "Multi-level modelling in the Modelverse.",
                    "Multilevel modelling for interoperability.",
                    "Using multi level-modeling techniques for managing mapping information.",
                    "Modeling techniques for enterprise architecture documentation: experiences from practice."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014modcomp",
                "sub_name": "Proceedings of the 1st International Workshop on Model-Driven Engineering for Component-Based Software Systems co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2014), Valencia, Spain, September 29, 2014.",
                "count": 9,
                "papers": [
                    "Component-Based and Model-Driven Engineering: what is the difference? A CBSE perspective.",
                    "Using Component Frameworks for Model Transformations by an Internal DSL.",
                    "Specifying Intra-Component Dependencies for Synthesizing Component Behaviors.",
                    "Multi-Platform Generative Development ofComponent & Connector Systems using Model and Code Libraries.",
                    "Interaction Components Between Components based on a Middleware.",
                    "Towards a Metamodel for the Rubus Component Model.",
                    "Translating Timing Constraints during Vehicular Distributed Embedded Systems Development.",
                    "Synthesizing an Automata-based Representation of BPMN2 Choreography Diagrams.",
                    "A Lightweight Framework for Testing Safety-critical Component-based Systems on Embedded Targets."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014amt",
                "sub_name": "Proceedings of the Workshop on Analysis of Model Transformations co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages & Systems (MoDELS 2014), Valencia, Spain, September 29, 2014.",
                "count": 9,
                "papers": [
                    "Remodularizing Legacy Model Transformations with Automatic Clustering Techniques.",
                    "Unit Testing of Model to Text Transformations.",
                    "On Static and Dynamic Analysis of UML and OCL Transformation Models.",
                    "Towards Testing Model Transformation Chains Using Precondition Construction in Algebraic Graph Transformation.",
                    "Towards Approximate Model Transformations.",
                    "A Query Structured Approach for Model Transformation.",
                    "Towards Verified Java Code Generation from Concurrent State Machines.",
                    "Towards Rigorously Faking Bidirectional Model Transformations.",
                    "Towards Analysing Non-Determinism in Bidirectional Transformations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014docsymp",
                "sub_name": "Proceedings of Doctoral Symposium co-located with 17th International Conference on Model Driven Engineering Languages and Systems (2014), Valencia, Spain, September 30, 2014.",
                "count": 11,
                "papers": [
                    "A Multi-Paradigm Modelling Approach for the Engineering of Modelling Languages.",
                    "Variability Management in Domain-Specific Languages.",
                    "GECO: Automatic Generator-Composition for Aspect-oriented DSLs.",
                    "Seamless Model-Based Safety Engineering from Requirement to Implementation.",
                    "An Approach to Extend NDT in the Development of Web Applications into SOA-based Organizations.",
                    "A Domain Specific Transformation Language to Support the Interactive Definition of Model Transformation Rules.",
                    "A Model-Driven Approach for Mobile Business Information Systems Applications.",
                    "Model-based software Refactoring Driven by Performance Analysis.",
                    "Towards a Structured Workflow Language for Model Management.",
                    "Enhancing Xtext for General Purpose Languages.",
                    "Explicit Modelling of Model Debugging and Experimentation."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014cmseba",
                "sub_name": "Proceedings of the First International Workshop on Combining Modelling with Search- and Example-Based Approaches co-located with 17th International Conference on Model Driven Engineering Languages and Systems (MODELS 2014), Valencia, Spain, September 28, 2014.",
                "count": 6,
                "papers": [
                    "CMSEBA 2014 Workshop Report.",
                    "Efficient Model Querying with VMQL.",
                    "Graph Query by Example.",
                    "Crepe Complete: Multi-objective Optimization for Your Models.",
                    "EXEMPLAR: an Experimental Information Repository for SBSE Research.",
                    "Design-Space Exploration in MDE: An Initial Pattern Catalogue."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014edusym",
                "sub_name": "Proceedings of the MODELS Educators Symposium co-located with the ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MODELS 2014), Valencia, Spain, September 29, 2014.",
                "count": 10,
                "papers": [
                    "Bad Modelling Teaching Practices.",
                    "Teaching in a Software Design Studio: Implications for Modeling Education.",
                    "CASE Tools versus Pencil and Paper: A Student's Perspective on Modeling Software Design.",
                    "Introductory Software Engineering with a Focus on Dependency Management.",
                    "Real Projects with Informal Models.",
                    "Exploiting the Internet of Things to Teach Domain-Specific Languages and Modeling: The ArduinoML project.",
                    "Reflections on Courses for Software Language Engineering.",
                    "Model-based Student Admission.",
                    "Symbolic Representation of Models Improves Model Understanding and Tendency to Use Models.",
                    "The MOOC Hype: Can We Ignore It? Reflections on the Current Use of Massive Open Online Courses in Software Modeling Education."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2014me",
                "sub_name": "Proceedings of the Workshop on Models and Evolution co-located with ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2014), Valencia, Spain, Sept 28, 2014.",
                "count": 6,
                "papers": [
                    "A Systematic Taxonomy of Metamodel Evolution Impacts on OCL Expressions.",
                    "A Generic Framework for Analyzing Model Co-Evolution.",
                    "Dealing with the Coupled Evolution of Metamodels and Model-to-text Transformations.",
                    "User-defined Signatures for Source Incremental Model-to-text Transformation.",
                    "Grammar Maturity Model.",
                    "Towards a Model-Driven Dynamic Architecture Reconfiguration Process for Cloud Services Integration."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th MoDELS 2013",
        "info": "Miami, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2013",
                "sub_name": "Model-Driven Engineering Languages and Systems - 16th International Conference, MODELS 2013, Miami, FL, USA, September 29 - October 4, 2013. Proceedings.",
                "count": 47,
                "papers": [
                    "Industrial Adoption of Model-Driven Engineering: Are the Tools Really the Problem?",
                    "Generic Model Assist.",
                    "Adding Spreadsheets to the MDE Toolkit.",
                    "Model-Driven Extraction and Analysis of Network Security Policies.",
                    "SafetyMet: A Metamodel for Safety Standards.",
                    "A Generic Fault Model for Quality Assurance.",
                    "Towards an Operationalization of the \"Physics of Notations\" for the Analysis of Visual Languages.",
                    "Teaching Model Driven Engineering from a Relational Database Perspective.",
                    "Big Metamodels Are Evil - Package Unmerge - A Technique for Downsizing Metamodels.",
                    "Integrating Modeling Tools in the Development Lifecycle with OSLC: A Case Study.",
                    "Recommending Auto-completions for Software Modeling Activities.",
                    "Automatically Searching for Metamodel Well-Formedness Rules in Examples and Counter-Examples.",
                    "Testing M2T/T2M Transformations.",
                    "An Approach to Testing Java Implementation against Its UML Class Model.",
                    "Automated Test Case Selection Using Feature Model: An Industrial Case Study.",
                    "Customizable Model Migration Schemes for Meta-model Evolutions with Multiplicity Changes.",
                    "Fine-Grained Software Evolution Using UML Activity and Class Models.",
                    "Supporting the Co-evolution of Metamodels and Constraints through Incremental Constraint Management.",
                    "Model Checking of UML-RT Models Using Lazy Composition.",
                    "Behavioural Verification in Embedded Software, from Model to Source Code.",
                    "Formal Verification Integration Approach for DSML.",
                    "Composing Your Compositions of Variability Models.",
                    "Constraints: The Core of Supporting Automated Product Configuration of Cyber-Physical Systems.",
                    "Defining and Validating a Multimodel Approach for Product Architecture Derivation and Improvement.",
                    "Evolution of the UML Interactions Metamodel.",
                    "A Graph-Pattern Based Approach for Meta-Model Specific Conflict Detection in a General-Purpose Model Versioning System.",
                    "On the Complex Nature of MDE Evolution.",
                    "Simplification and Correctness of UML Class Diagrams - Focusing on Multiplicity and Aggregation/Composition Constraints.",
                    "Specification of Cyber-Physical Components with Formal Semantics - Integration and Composition.",
                    "Endogenous Metamodeling Semantics for Structural UML 2 Concepts.",
                    "Computer Assisted Integration of Domain-Specific Modeling Languages Using Text Analysis Techniques.",
                    "Towards the Notation-Driven Development of DSMLs.",
                    "Validation of Derived Features and Well-Formedness Constraints in DSLs - By Mapping Graph Queries to an SMT-Solver.",
                    "Self-adaptation with End-User Preferences: Using Run-Time Models and Constraint Solving.",
                    "Runtime Model Based Management of Diverse Cloud Resources.",
                    "The Semantic Web as a Software Modeling Tool: An Application to Citizen Relationship Management.",
                    "Concern-Oriented Software Design.",
                    "Analyzing Enterprise Models Using Enterprise Architecture-Based Ontology.",
                    "Analyzing the Effort of Composing Design Models of Large-Scale Software in Industrial Case Studies.",
                    "Parallel Execution of ATL Transformation Rules.",
                    "Transformation of Models Containing Uncertainty.",
                    "Automated Verification of Model Transformations in the Automotive Industry.",
                    "Data-Flow Based Model Analysis and Its Applications.",
                    "Contract-Aware Slicing of UML Class Models.",
                    "Usability Inspection in Model-Driven Web Development: Empirical Validation in WebML.",
                    "Model-Driven Approach for Supporting the Mapping of Parallel Algorithms to Parallel Computing Platforms.",
                    "Compositional Synthesis of Controllers from Scenario-Based Assume-Guarantee Specifications."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013modevva",
                "sub_name": "Proceedings of the 10th International Workshop on Model Driven Engineering, Verification and Validation MoDeVVa 2013, co-located with 16th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2013), Miami, Florida, USA, October 1st, 2013.",
                "count": 9,
                "papers": [
                    "A Framework for Testing UML Activities Based on fUML.",
                    "Building Test Harness From Service-based Component Models.",
                    "Feature-based Development of State Transition Diagrams with Property Preservation.",
                    "Global State Checker: Towards SAT-Based Reachability Analysis of Communicating State Machines.",
                    "Applying Model Transformation and Event-B for Specifying an Industrial DSL.",
                    "Ensuring OSGi Component Based Properties at Runtime with Behavioral Types.",
                    "Symbolic Execution of Satellite Control Procedures in Graph-Transformation-Based EMF Ecosystems.",
                    "Research Questions for Validation and Verification in the Context of Model-Based Engineering.",
                    "An Approach to Analyzing Temporal Properties in UML Class Models."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013nimalp",
                "sub_name": "Proceedings of the 5th International Workshop Non-functional Properties in Modeling: Analysis, Languages and Processes co-located with 16th International Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, USA, September 29, 2013.",
                "count": 5,
                "papers": [
                    "Continual Verification of Non-Functional Properties in Cloud-Based Systems.",
                    "Resource Contention Analysis of Cloud-based System through fUML-driven Model Execution.",
                    "Performance Modeling of Distributed Collaboration Services with Independent Inputs/Outpus.",
                    "Stochastic Performance Analysis of Distributed Activities.",
                    "Co-Evolution of Software Architecture and Fault Tree models: An Explorative Case Study on a Pick and Place Factory Automation System."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013docsymp",
                "sub_name": "Proceedings of the MODELS 2013 Doctoral Symposium co-located with the 16th International ACM/IEEE Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, USA, October 1, 2013.",
                "count": 7,
                "papers": [
                    "Evaluating the Quality in the Use of Domain-Specific Languages in an Agile Way.",
                    "Concurrent and Distributed Model Transformations based on Linda.",
                    "Debugging for Model Transformations.",
                    "Model Transformation Design Patterns.",
                    "Towards Declarative and Incremental Model Transformation.",
                    "Decomposition of Test Cases in Model-Based Testing.",
                    "Architectural Templates: Engineering Scalable SaaS Applications Based on Architectural Styles."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013gemoc",
                "sub_name": "Joint Proceedings of the First International Workshop On the Globalization of Modeling Languages (GEMOC 2013) and the First International Workshop: Towards the Model Driven Organization (AMINO 2013) Co-located with the 16th International Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, USA, September 29 - October 04, 2013.",
                "count": 10,
                "papers": [
                    "Report on the First Workshop On the Globalization of Modeling Languages (GEMOC 2013).",
                    "Introduction.",
                    "Goals, Domains, and Enterprise Architecture in the Model-Driven Organization.",
                    "Multimodel-Driven Software Engineering for Evolving Enterprise Systems.",
                    "UML/OCL based Design and Analysis of Role-Based Access Control Policies.",
                    "Meta-model Patterns for Expressing Relationships Between Organization Model Concepts and Software Implementation Concepts.",
                    "MDE Support for Enterprise Architecture in an Industrial Context: the TEAP Framework Experience.",
                    "Introducing Argumentative and Discursive Enterprise Leading and Management.",
                    "(Multi-) Modeling Enterprises for Better Decisions.",
                    "Enterprise Models as Drivers for IT Security Management at Runtime."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013me",
                "sub_name": "Proceedings of the Workshop on Models and Evolution co-located with ACM/IEEE 16th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2013), Miami, Florida, USA, October 1, 2013.",
                "count": 10,
                "papers": [
                    "Learning on the Job: Supporting the Evolution of Designse.",
                    "A Survey on Incremental Model Transformation Approaches.",
                    "Co-evolution of Metamodels and Models through Consistent Change Propagation.",
                    "Automating Instance Migration in Response to Ontology Evolution.",
                    "Generating Edit Operations for Profiled UML Models.",
                    "Evolution of Model Clones in Simulink.",
                    "Proactive Quality Guidance for Model Evolution in Model Libraries.",
                    "Towards a Novel Model Versioning Approach Based on the Separation Between Linguistic and Ontological Aspects.",
                    "Analyzing Behavioral Refactoring of Class Models.",
                    "Specification of a Legacy Tool by Means of a Dependency Graph to Improve its Reusability."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013mdebe",
                "sub_name": "Proceedings of the First International Workshop on Model-driven Engineering By Example co-located with ACM/IEEE 16th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2013), Miami, Florida, USA, September 29, 2013.",
                "count": 6,
                "papers": [
                    "Tackling Model-Based Software Testing and Verification as a Search Problem.",
                    "Applying MTBE Manually: a Method and an Example.",
                    "Enabling Model Recommenders for Command-Enabled Editors.",
                    "Generating Metamodels from Grammars by Chaining Translational and By-Example Techniques.",
                    "Example-Driven Modeling using Clafer.",
                    "Test Cases Generation for Model Transformations from Structural Information."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013cma",
                "sub_name": "Proceedings of the Fourth International Comparing Modeling Approaches Workshop 2013 co-located with the ACM/IEEE 16th International Conference on Model Driven Engineering Languages and Systems ( MODELS 2013), Miami, Florida, USA, October 1, 2013.",
                "count": 7,
                "papers": [
                    "Modeling bCMS Product Line Using Feature Model, Component Family Model and UML.",
                    "Modeling Crisis Management System With the Restricted Use Case Modeling Approach.",
                    "Key Properties for Comparing Modeling Languages and Tools: Usability, Completeness and Scalability.",
                    "On Properties of Modeling Approaches.",
                    "On the Scalability Criterion for Comparing Modeling Approaches.",
                    "Revising the Comparison Criteria for Composition.",
                    "How to Analyze Modeling Approach Comparison Criteria."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013amt",
                "sub_name": "Proceedings of the Second Workshop on the Analysis of Model Transformations (AMT 2013), Miami, FL, USA, September 29, 2013.",
                "count": 9,
                "papers": [
                    "A Traceability-Driven Approach to Model Transformation Testing.",
                    "Using Meta-model Coverage to Qualify Test Oracles.",
                    "A Method for Testing Model to Text Transformations.",
                    "Rule Chains Coverage for Testing QVT-Relations Transformations.",
                    "Reality Check for Model Transformation Reuse: The ATL Transformation Zoo Case Study.",
                    "Automatic Impact Analysis of Software Architecture Migration on Model Driven Software Development.",
                    "Correctness and Completeness of Generalised Concurrent Model Synchronisation Based on Triple Graph Grammars.",
                    "Towards a Catalog of Non-Functional Requirements in Model Transformation Languages.",
                    "Detecting Performance Bad Smells for Henshin Model Transformations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013essmod",
                "sub_name": "Proceedings of the 3rd International Workshop on Experiences and Empirical Studies in Software Modeling co-located with 16th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2013), Miami, USA, October 1, 2013.",
                "count": 8,
                "papers": [
                    "What are the used UML diagrams? A Preliminary Survey.",
                    "Model-based Simplified Functional Size Measurement - an Experimental Evaluation with COSMIC Function Points.",
                    "UML Usage in Open Source Software Development : A Field Study.",
                    "Exploring Costs and Benefits of Using UML on Maintenance: Preliminary Findings of a Case Study in a Large IT Department.",
                    "Towards Reconstructing Architectural Models of Software Tools by Runtime Analysis.",
                    "Industrial Adoption of Automatically Extracted GUI Models for Testing.",
                    "What do Metamodels Really Look Like?",
                    "Online Img2UML Repository: An Online Repository for UML Models."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013acesmb",
                "sub_name": "Proceedings of the 6th International Workshop on Model Based Architecting and Construction of Embedded Systems co-located with ACM/IEEE 16th International Conference on Model Driven Engineering Languages and Systems (MoDELS 2013), Miami, Florida, USA, September 29th, 2013.",
                "count": 8,
                "papers": [
                    "Modeling and Verification of Redundancy Policies.",
                    "Modeling Executable Architectural Design Patterns for Software Product Lines.",
                    "Combinations of Antipattern Heuristics in Software Architecture Optimization for Embedded Systems.",
                    "Requirements as First-Class Citizens: Integrating Requirements closely with Implementation Artifacts.",
                    "Model-based Power Consumption Analysis of Smartphone Applications.",
                    "Automatic Synthesis of Heterogeneous CPU-GPU Embedded Applications from a UML Profile.",
                    "Interface Verification Using Executable Reference Models: An Application in the Automotive Infotainment.",
                    "Integrating verifiable Assume/Guarantee contracts in UML/SysML."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013mdhpcl",
                "sub_name": "Proceedings of the 2nd International Workshop on Model-Driven Engineering for High Performance and CLoud computing co-located with 16th International Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, Florida, USA, September 29, 2013.",
                "count": 7,
                "papers": [
                    "Towards a solution avoiding Vendor Lock-in to enable Migration Between Cloud Platforms.",
                    "Modeling Cloud Architectures as Interactive Systems.",
                    "VehicleFORGE: A Cloud-Based Infrastructure for Collaborative Model-Based Design.",
                    "A Model-driven Approach for Price/Performance Tradeoffs in Cloud-based MapReduce Application Deployment.",
                    "Towards Domain-Specific Testing Languages for Software-as-a-Service.",
                    "Architecture Framework for Mapping Parallel Algorithms to Parallel Computing Platforms.",
                    "Model-Driven Transformations for Mapping Parallel Algorithms on Parallel Computing Platforms."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013mpm",
                "sub_name": "Proceedings of the 7th Workshop on Multi-Paradigm Modeling co-located with the 16th International Conference on Model Driven Engineering Languages and Systems, MPM@MoDELS 2013, Miami, Florida, USA, September 30, 2013.",
                "count": 8,
                "papers": [
                    "Towards Compositional Domain Specific Languages.",
                    "A Domain-Specific Language for Dependency Management in Model-Based Systems Engineering.",
                    "Integrating Prose as First-Class Citizens with Models and Code.",
                    "Towards a Multi-Domain Model-Driven Traceability Approach.",
                    "A Hyperdense Semantic Domain for Discontinuous Behavior in Physical System Models.",
                    "A DSL for Explicit Semantic Adaptation.",
                    "A Multiparadigm Approach to Integrate Gestures and Sound in the Modeling Framework.",
                    "Towards Bidirectional Engineering of Satellite Control Procedures Using Triple Graph Grammars."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013jp",
                "sub_name": "Joint Proceedings of MODELS'13 Invited Talks, Demonstration Session, Poster Session, and ACM Student Research Competition co-located with the 16th International Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, USA, September 29 - October 4, 2013.",
                "count": 23,
                "papers": [
                    "Union and Difference of Models, 10 years later.",
                    "Scribbler: From Collaborative Sketching to Formal Domain Specific Models and Back Again.",
                    "Tool Support for Conflict Resolution of Models for Automated Enterprise Architecture Documentation.",
                    "A Configurator for Visual Analysis of Enterprise Architectures.",
                    "AToMPM: A Web-based Modeling Environment.",
                    "Demonstration of Runtime Model Based Management of Diverse Cloud Resources.",
                    "clooca : Web based tool for Domain Specific Modeling.",
                    "Interactive Dependency Graphs for Model Transformation Analysis.",
                    "Zen-RUCM: A Tool for Supporting a Comprehensive and Extensible Use Case Modeling Framework.",
                    "xMOF: A Semantics Specification Language for Metamodeling.",
                    "Concern-Oriented Software Design with TouchRAM.",
                    "Automated Product Line Methodologies to Support Model-Based Testing.",
                    "An Extensible Use Case Modeling Approach for Cyber-Physical Systems (CPSs).",
                    "MDA Game Design for Video Game Development by Genre.",
                    "Towards a Search-based Interactive Configuration of Cyber Physical System Product Lines.",
                    "TractsTool: Testing Model Transformations based on Contracts.",
                    "Domain Specific Analysis of Statemachine Models of Reactive Systems.",
                    "Using fUML as Semantics Specification Language in Model Driven Engineering.",
                    "Semantic Specifications for Domain-Specific Modeling Languages.",
                    "Iterative Evaluation of Domain-Specific Languages.",
                    "Concern Driven Software Development.",
                    "A Framework for Specifying and Analyzing Temporal Properties of UML Class Models.",
                    "Complexity- and Performance Analysis of Different Controller Implementations on a Soft PLC."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2013edusym",
                "sub_name": "Proceedings of the Educators' Symposium co-located with ACM/IEEE 16th International Conference on Model Driven Engineering Languages and Systems (MODELS 2013), Miami, USA, September 30th, 2013.",
                "count": 6,
                "papers": [
                    "Making UML \"hip\": A First Experience Report on Using Modern Teaching Tools for Object-Oriented Modelling.",
                    "Using Model-Driven Development Tools for Object-Oriented Modeling Education.",
                    "Evaluation of Students' Modeling and Programming Skills.",
                    "Multi-faceted Practical Modeling Education for Software Engineering.",
                    "Assessing Software Design Skills and their Relation with Reasoning Skills.",
                    "Tool Use in Software Modelling Education."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th MoDELS 2012",
        "info": "Innsbruck, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2012",
                "sub_name": "Model Driven Engineering Languages and Systems - 15th International Conference, MODELS 2012, Innsbruck, Austria, September 30-October 5, 2012. Proceedings.",
                "count": 51,
                "papers": [
                    "Quantitative Reactive Models.",
                    "Bottom-Up Meta-Modelling: An Interactive Approach.",
                    "FacadeMetamodel: Masking UML.",
                    "T□: A Domain Specific Language for Rapid Workflow Development.",
                    "Relaxing Claims: Coping with Uncertainty While Evaluating Assumptions at Run Time.",
                    "Dynamic Evolution of Context-Aware Systems with Models at Runtime.",
                    "An Eclipse Modelling Framework Alternative to Meet the Models@Runtime Requirements.",
                    "Automated and Transparent Model Fragmentation for Persisting Large Models.",
                    "Formally Defining and Iterating Infinite Models.",
                    "Query-Driven Soft Interconnection of EMF Models.",
                    "Modeling the Linguistic Architecture of Software Products.",
                    "Cross-Language Support Mechanisms Significantly Aid Software Development.",
                    "Do Professional Developers Benefit from Design Pattern Documentation? A Replication in the Context of Source Code Comprehension.",
                    "Incremental Consistency Checking for Complex Design Rules and Larger Model Changes.",
                    "Evaluating the Impact of Aspects on Inconsistency Detection Effort: A Controlled Experiment.",
                    "On Integrating Structure and Behavior Modeling with OCL.",
                    "Multi-perspectives on Feature Models.",
                    "Generating Better Partial Covering Arrays by Modeling Weights on Sub-product Lines.",
                    "Towards Business Application Product Lines.",
                    "Inter-association Constraints in UML2: Comparative Analysis, Usage Recommendations, and Modeling Guidelines.",
                    "The Coroutine Model of Computation.",
                    "Assume-Guarantee Scenarios: Semantics and Synthesis.",
                    "An Exploratory Study of Forces and Frictions Affecting Large-Scale Model-Driven Development.",
                    "A Model-Driven Approach to Support Engineering Changes in Industrial Robotics Software.",
                    "Managing Related Models in Vehicle Control Software Development.",
                    "Detecting Specification Errors in Declarative Languages with Constraints.",
                    "From UML and OCL to Relational Logic and Back.",
                    "On Verifying ATL Transformations Using 'off-the-shelf' SMT Solvers.",
                    "ATLTest: A White-Box Test Generation Approach for ATL Transformations.",
                    "Empirical Evaluation on FBD Model-Based Test Coverage Criteria Using Mutation Analysis.",
                    "Seeing Errors: Model Driven Simulation Trace Visualization.",
                    "A Modeling Approach to Support the Similarity-Based Reuse of Configuration Data.",
                    "Model Driven Configuration of Fault Tolerance Solutions for Component-Based Software System.",
                    "Applying a Consistency Checking Framework for Heterogeneous Models and Artifacts in Industrial Product Lines.",
                    "Generation of Operational Transformation Rules from Examples of Model Transformations.",
                    "Using Feature Model to Build Model Transformation Chains.",
                    "A Generic Approach Simplifying Model-to-Model Transformation Chains.",
                    "An Approach for Synchronizing UML Models and Narrative Text in Literate Modeling.",
                    "Model Matching for Trace Link Generation in Model-Driven Software Development.",
                    "Matching Business Process Workflows across Abstraction Levels.",
                    "Experiences of Applying UML/MARTE on Three Industrial Projects.",
                    "Cost Estimation for Model-Driven Engineering.",
                    "Evaluating the Effort of Composing Design Models: A Controlled Experiment.",
                    "Transition to Model-Driven Engineering - What Is Revolutionary, What Remains the Same?",
                    "Towards an Automatic Service Discovery for UML-Based Rich Service Descriptions.",
                    "A Product Line Modeling and Configuration Methodology to Support Model-Based Testing: An Industrial Case Study.",
                    "Sensitivity Analysis in Model-Driven Engineering.",
                    "Modeling and Analysis of CPU Usage in Safety-Critical Embedded Systems to Support Stress Testing.",
                    "Weaving-Based Configuration and Modular Transformation of Multi-layer Systems.",
                    "Research-Based Innovation: A Tale of Three Projects in Model-Driven Engineering.",
                    "An Industrial System Engineering Process Integrating Model Driven Architecture and Model Based Design."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012mdsec",
                "sub_name": "Model-Driven Security Workshop, MDsec 2012, In conjunction with MoDELS 2012, Innsbruck, Austria, October 1, 2012.",
                "count": 10,
                "papers": [
                    "Model-driven security: MDsec '12 Workshop at MoDELS 2012, Innsbruck, Austria.",
                    "Architecting a security strategy measurement and management system.",
                    "Model-driven architectural risk analysis using architectural and contextualised attack patterns.",
                    "Towards model-driven development of access control policies for web applications.",
                    "A model-driven approach for the extraction of network access-control policies.",
                    "Toward a model-driven access-control enforcement mechanism for pervasive systems.",
                    "Security asset elicitation for collaborative models.",
                    "Augmented enterprise models as a foundation for generating security-related software: requirements and objectives.",
                    "Incremental development of large, secure smart card applications.",
                    "A tool for the synthesis of cryptographic orchestrators."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012edusym",
                "sub_name": "Proceedings of the 8th edition of the Educators' Symposium, EduSym 2012, Innsbruck, Austria, October 01, 2012.",
                "count": 7,
                "papers": [
                    "The 8th Educators' Symposium @ MODELS 2012: software modeling in education.",
                    "Teaching Tornado: from communication models to releases.",
                    "Model-driven paradigms: the evolution of a university course.",
                    "Replacing traditional classroom lectures with lecture videos: an experience report.",
                    "On explaining modeling principles with modeling examples: a classification catalog.",
                    "How should teaching modeling and programming intertwine?",
                    "Improving software engineering education by modeling real-world implementations."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012mdhpcl",
                "sub_name": "Proceedings of the 1st International Workshop on Model-Driven Engineering for High Performance and CLoud computing co-located with 15th International Conference on Model Driven Engineering Languages and Systems (MODELS 2012), Innsbruck, Austria, October 01 - 05, 2012.",
                "count": 8,
                "papers": [
                    "MDHPCL 2012 workshop summary.",
                    "CASE 2.0: on key success factors for cloud-aided software engineering.",
                    "Modelling and comparing cloud computing service level agreements.",
                    "Model-driven specification of adaptive cloud-based systems.",
                    "Cloud risk analysis by textual models.",
                    "HPCML: a modeling language dedicated to high-performance scientific computing.",
                    "Map/reduce on EMF models.",
                    "Transitioning to the cloud?: a model-driven analysis and automated deployment capability for cloud services."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012mpm",
                "sub_name": "Proceedings of the 6th International Workshop on Multi-Paradigm Modeling, MPM@MoDELS 2012, Innsbruck, Austria, October 1-5, 2012.",
                "count": 13,
                "papers": [
                    "Summary of the 6th International Workshop on Multi-Paradigm Modeling (MPM'12).",
                    "Industrial experiences from multi-paradigmatic modelling of signal processing.",
                    "The FTG+PM framework for multi-paradigm modelling: an automotive case study.",
                    "Heterogeneous modeling of gesture-based 3D applications.",
                    "An overseer control methodology for data adaptable embedded systems.",
                    "Composing textual modelling languages in practice.",
                    "QAML: a multi-paradigm DSML for quantitative analysis of embedded system architecture models.",
                    "Maintaining consistency between system architecture and dynamic system models with SysML4Modelica.",
                    "Viewpoints, formalisms, languages, and tools for cyber-physical systems.",
                    "Model-based specification, analysis and synthesis of servo controllers for lithoscanners.",
                    "Renarrating linguistic architecture: a case study.",
                    "A build server for model-driven engineering.",
                    "Component-based modeling of dynamic systems using heterogeneous composition."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012motpw",
                "sub_name": "Proceedings of the Modelling of the Physical World Workshop, MOTPW 2012, Innsbruck, Austria, October 1-5, 2012.",
                "count": 6,
                "papers": [
                    "Overview of the Modelling of the Physical World (MOTPW) Workshop at MODELS 2012.",
                    "Modeling cyber-physical systems: model-driven specification of energy efficient buildings.",
                    "On the application of software modelling principles on ISO 15926.",
                    "Q: why is a raven like a writing desk?: A: they're both objects.",
                    "EMF modeling in traffic surveillance experiments.",
                    "Choosing and adapting design notations in the principled development of complex systems simulations for research."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012me",
                "sub_name": "Proceedings of the 6th International Workshop on Models and Evolution, ME@MoDELS 2012, Innsbruck, Austria, October 1-5, 2012.",
                "count": 11,
                "papers": [
                    "Summary of the 6th International Workshop on Models and Evolution (ME 2012).",
                    "Making sense of UML class model changes by textual difference presentation.",
                    "A two-steps model transformation to extend the scope of an analysis framework to standard modeling languages.",
                    "Bridging state-based differencing and co-evolution.",
                    "Using composite feature models to support agile software product line evolution.",
                    "Coevolution assistance for enterprise architecture models.",
                    "Evolution in a context of an model-integrated tool environment.",
                    "Searching for model migration strategies.",
                    "Towards migration-aware filtering in model differences application.",
                    "Towards the automatic discovery of platform transformation templates of legacy object-oriented systems.",
                    "Invariant preservation in iterative modeling."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012amt",
                "sub_name": "Proceedings of the First Workshop on the Analysis of Model Transformations, AMT@MODELS 2012, Innsbruck, Austria, October 2, 2012.",
                "count": 9,
                "papers": [
                    "Summary of the First Workshop on the Analysis of Model Transformations (AMT 2012).",
                    "Towards a model transformation intent catalog.",
                    "Chaining model transformations.",
                    "Early experiences on model transformation testing.",
                    "Model transformation testing: the state of the art.",
                    "Towards tracking \"guilty\" transformation rules: a requirements perspective.",
                    "The MDELab tool framework for the development of correct model transformations with triple graph grammars.",
                    "Developing and visualizing live model queries.",
                    "Towards refactoring of rule-based, in-place model transformation systems."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012acesmb",
                "sub_name": "Proceedings of the 5th International Workshop on Model Based Architecting and Construction of Embedded Systems, ACES-MB@MoDELS 2012, Innsbruck, Austria, September 30, 2012.",
                "count": 10,
                "papers": [
                    "Tool-supported model-driven validation process for system architectures.",
                    "HiLeS-T: an ADL for early requirement verification of embedded systems.",
                    "Functional validation of AADL models via model transformation to SystemC with ATL.",
                    "Automatic SysML-based safety analysis.",
                    "Real-time design models to RTOS-specific models refinement verification.",
                    "Component-based models for runtime control and monitoring of embedded systems.",
                    "Model-based development of embedded systems' user interfaces.",
                    "Formal execution semantics for asynchronous constructs of AADL.",
                    "Automatic synthesis from UML/MARTE models using channel semantics.",
                    "Automatic transformation of abstract AUTOSAR architectures to timed automata."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2012eessmod",
                "sub_name": "Proceedings of the Second Edition of the International Workshop on Experiences and Empirical Studies in Software Modelling, EESSMod@MoDELS 2012, Innsbruck, Austria, October 1-5, 2012.",
                "count": 10,
                "papers": [
                    "EESSMOD 2012 Workshop Summary.",
                    "Benefits from modelling and MDD adoption: expectations and achievements.",
                    "The use of UML class diagrams and its effect on code change-proneness.",
                    "Lessons learned from evaluating MDE abstractions in an industry field study.",
                    "Does the combined use of class and sequence diagrams improve the source code comprehension?: results from a controlled experiment.",
                    "UML class diagram simplification: what is in the developer's mind?",
                    "Making the case for measuring mental effort.",
                    "Micro-business behavior patterns associated with components in a requirements approach.",
                    "Business process modelling: five styles and a method to choose the most suitable one.",
                    "Modelling and managing variability with feature assembly: an experience report."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th MoDELS 2011",
        "info": "Wellington, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2011",
                "sub_name": "Model Driven Engineering Languages and Systems, 14th International Conference, MODELS 2011, Wellington, New Zealand, October 16-21, 2011. Proceedings.",
                "count": 52,
                "papers": [
                    "The Value in Muddling Around Modelling.",
                    "Towards Quality Driven Exploration of Model Transformation Spaces.",
                    "Automated Model-to-Metamodel Transformations Based on the Concepts of Deep Instantiation.",
                    "Lazy Execution of Model-to-Model Transformations.",
                    "Measuring UML Models Using Metrics Defined in OCL within the SQUAM Framework.",
                    "Modeling Model Slicers.",
                    "Morsa: A Scalable Approach for Persisting and Accessing Large Models.",
                    "Expressing Aspectual Interactions in Design: Experiences in the Slot Machine Domain.",
                    "An Industrial Application of Robustness Testing Using Aspect-Oriented Modeling, UML/MARTE, and Search Algorithms.",
                    "Aspect-Oriented Modelling for Distributed Systems.",
                    "A Precise Style for Business Process Modelling: Results from Two Controlled Experiments.",
                    "Semantically Configurable Consistency Analysis for Class and Object Diagrams.",
                    "Identifying the Weaknesses of UML Class Diagrams during Data Model Comprehension.",
                    "Engineering Android Applications Based on UML Activities.",
                    "Domain-Specific Model Transformation in Building Quantity Take-Off.",
                    "Improving Scalability and Maintenance of Software for High-Performance Scientific Computing by Combining MDE and Frameworks.",
                    "A Critical Review of Applied MDA for Embedded Devices: Identification of Problem Classes and Discussing Porting Efforts in Practice.",
                    "Designing Heterogeneous Component Based Systems: Evaluation of MARTE Standard and Enhancement Proposal.",
                    "Semantic Clone Detection for Model-Based Development of Embedded Systems.",
                    "Instant and Incremental QVT Transformation for Runtime Models.",
                    "Service-Oriented Architecture Modeling: Bridging the Gap between Structure and Behavior.",
                    "From State- to Delta-Based Bidirectional Model Transformations: The Symmetric Case.",
                    "Enforcing S&D Pattern Design in RCES with Modeling and Formal Approaches.",
                    "A Model-Based and Automated Approach to Size Estimation of Embedded Software Components.",
                    "MDE to Manage Communications with and between Resource-Constrained Systems.",
                    "Diagram Definition: A Case Study with the UML Class Diagram.",
                    "Reducing Multiplicities in Class Diagrams.",
                    "Creating Models for Simulating the Face.",
                    "EUnit: A Unit Testing Framework for Model Management Tasks.",
                    "Verifying UML-RT Protocol Conformance Using Model Checking.",
                    "Model-Based Coverage-Driven Test Suite Generation for Software Product Lines.",
                    "Constraint-Based Model Refactoring.",
                    "Supporting Design Model Refactoring for Improving Class Responsibility Assignment.",
                    "Vision Paper: The Essence of Structural Models.",
                    "Vision Paper: Towards Model-Based Energy Testing.",
                    "Vision Paper: Make a Difference! (Semantically).",
                    "Automatic Derivation of Utility Functions for Monitoring Software Requirements.",
                    "Logic-Based Model-Level Software Development with F-OML.",
                    "Formal Verification of QVT Transformations for Code Generation.",
                    "Model-Based (Mechanical) Product Design.",
                    "Applying a Model-Based Approach to IT Systems Development Using SysML Extension.",
                    "Early Experience with Agile Methodology in a Model-Driven Approach.",
                    "Finding Models in Model-Based Development - (Abstract).",
                    "CD2Alloy: Class Diagrams Analysis Using Alloy Revisited.",
                    "Model-Driven Engineering and Optimizing Compilers: A Bridge Too Far?",
                    "Towards a General Composition Semantics for Rule-Based Model Transformation.",
                    "Properties of Realistic Feature Models Make Combinatorial Testing of Product Lines Feasible.",
                    "Reasoning about Metamodeling with Formal Specifications and Automatic Proofs.",
                    "Correctness of Model Synchronization Based on Triple Graph Grammars.",
                    "A Toolchain for the Detection of Structural and Behavioral Latent System Properties.",
                    "Defining MARTE's VSL as an Extension of Alf.",
                    "Using Delta Model for Collaborative Work of Industrial Large-Scaled E/E Architecture Models."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2011w",
                "sub_name": "Models in Software Engineering - Workshops and Symposia at MODELS 2011, Wellington, New Zealand, October 16-21, 2011, Reports and Revised Selected Papers.",
                "count": 27,
                "papers": [
                    "Doctoral Symposium at MoDELS 2011.",
                    "Supporting Software Language Engineering by Automated Domain Knowledge Acquisition.",
                    "Interoperability of Software Engineering Metamodels.",
                    "Software Modeling in Education: The 7th Educators' Symposium at MoDELS 2011.",
                    "Using Constraints in Teaching Software Modeling.",
                    "Mismatches between Industry Practice and Teaching of Model-Driven Software Development.",
                    "VARY - Variability for You.",
                    "Towards Evolution of Generic Variability Models.",
                    "Feature-Based Variability Meta-modeling for Service-Oriented Product Lines.",
                    "Summary of the Workshop on Multi-Paradigm Modelling: Concepts and Tools.",
                    "Supporting Incremental Synchronization in Hybrid Multi-view Modelling.",
                    "Semantic Adaptation Using CCSL Clock Constraints.",
                    "Summary of the First International Workshop on Experiences and Empirical Studies in Software Modelling.",
                    "Assessing the Impact of Hierarchy on Model Understandability - A Cognitive Perspective.",
                    "Does the Level of Detail of UML Models Affect the Maintainability of Source Code?",
                    "Summary of the 6th International Workshop on Models@run.time.",
                    "Runtime Monitoring of Functional Component Changes with Behavior Models.",
                    "Requirements and Assessment of Languages and Frameworks for Adaptation Models.",
                    "MoDeVVa 2011 Workshop Summary.",
                    "Specifying a Testing Oracle for Train Stations - Going beyond with Product Line Technology.",
                    "Use Cases for Context Aware Model-Checking.",
                    "Comparing Six Modeling Approaches.",
                    "Summary of the Second International Workshop on Models and Evolution.",
                    "Towards Semantics-Aware Merge Support in Optimistic Model Versioning.",
                    "Model Based Architecting and Construction of Embedded Systems (ACES-MB 2011).",
                    "Model-Based Consistency Checks of Electric and Electronic Architectures against Requirements.",
                    "A Model-Driven Approach for Software Parallelization."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2011eessmod",
                "sub_name": "Proceedings of the First Workshop on Experiences and Empirical Studies in Software Modelling, Wellington, New Zealand, October 17, 2011.",
                "count": 6,
                "papers": [
                    "What do 449 MDE Practitioners Think About MDE?",
                    "Does the Level of Detail of UML Models Affect the Maintainability of Source Code?",
                    "Assessing the Impact of Hierarchy on Model - A Cognitive Perspective.",
                    "Assessing the Frequency of Empirical Evaluation in Software Modeling Research.",
                    "Building VECM-based Systems with a Model Driven Approach: an Experience Report.",
                    "Empirical Evaluation of the Conjunct Use of MOF and OCL."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2011modevva",
                "sub_name": "Proceedings of the 8th International Workshop on Model-Driven Engineering, Verification and Validation, MoDeVVa, Wellington, New Zealand, October 17, 2011.",
                "count": 9,
                "papers": [
                    "Partial models: a position paper.",
                    "Towards automatic determination of problem bounds for object instantiation in static model verification.",
                    "On the interaction of inter-relationship constraints.",
                    "Improving formal verification practicability through user oriented models and context-awareness.",
                    "Specifying a testing oracle for train stations.",
                    "Analyzing realizability of choreographies using initiating and responding flows.",
                    "Runtime model validation with parallel object constraint language.",
                    "Natural language generation from class diagrams.",
                    "On validation of ATL transformation rules by transformation models."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th MoDELS 2010",
        "info": "Oslo, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2010-1",
                "sub_name": "Model Driven Engineering Languages and Systems - 13th International Conference, MODELS 2010, Oslo, Norway, October 3-8, 2010, Proceedings, Part I.",
                "count": 28,
                "papers": [
                    "A Unified Approach to Modeling and Programming.",
                    "Generic Meta-modelling with Concepts, Templates and Mixin Layers.",
                    "An Observer-Based Notion of Model Inheritance.",
                    "MDE-Based Approach for Generalizing Design Space Exploration.",
                    "A Comparison of Model Migration Tools.",
                    "Incremental Evaluation of Model Queries over EMF Models.",
                    "Active Operations on Collections.",
                    "transML: A Family of Languages to Model Model Transformations.",
                    "Henshin: Advanced Concepts and Tools for In-Place EMF Model Transformations.",
                    "A Technique for Automatic Validation of Model Transformations.",
                    "Static- and Dynamic Consistency Analysis of UML State Chart Models.",
                    "Verifying Semantic Conformance of State Machine-to-Java Code Generators.",
                    "A Dynamic-Priority Based Approach to Fixing Inconsistent Feature Models.",
                    "Taming Graphical Modeling.",
                    "Taming EMF and GMF Using Model Transformation.",
                    "A Visual Traceability Modeling Language.",
                    "Application Logic Patterns - Reusable Elements of User-System Interaction.",
                    "A Metamodel-Based Approach for Automatic User Interface Generation.",
                    "Rapid UI Development for Enterprise Applications: Combining Manual and Model-Driven Techniques.",
                    "Environment Modeling with UML/MARTE to Support Black-Box System Testing for Real-Time Embedded Systems: Methodology and Industrial Case Studies.",
                    "Improving Test Models for Large Scale Industrial Systems: An Inquisitive Study.",
                    "Automatically Discovering Properties That Specify the Latent Behavior of UML Models.",
                    "Towards a Semantics of Activity Diagrams with Semantic Variation Points.",
                    "An AADL-Based Approach to Variability Modeling of Automotive Control Systems.",
                    "Extending Variability for OCL Interpretation.",
                    "Inter-modelling: From Theory to Practice.",
                    "Consistent Modeling Using Multiple UML Profiles.",
                    "A Systematic Review on the Definition of UML Profiles."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2010-2",
                "sub_name": "Model Driven Engineering Languages and Systems - 13th International Conference, MODELS 2010, Oslo, Norway, October 3-8, 2010, Proceedings, Part II.",
                "count": 29,
                "papers": [
                    "Modeling the Internet.",
                    "Transformation-Based Parallelization of Request-Processing Applications.",
                    "Model Driven Orchestration: Design for Service Compatibility.",
                    "Embedded Software Development with Projectional Language Workbenches.",
                    "Concern-Based (de)composition of Model-Driven Software Development Processes.",
                    "Flexible Model Element Introduction Policies for Aspect-Oriented Modeling.",
                    "Role-Based Generic Model Refactoring.",
                    "Precise Detection of Conflicting Change Operations Using Process Model Terms.",
                    "Capturing the Intention of Model Changes.",
                    "Selective and Consistent Undoing of Model Changes.",
                    "Modeling Features at Runtime.",
                    "Metamodel-Based Information Integration at Industrial Scale.",
                    "Inferring Meta-models for Runtime System Data from the Clients of Management APIs.",
                    "A Meta Model for Artefact-Orientation: Fundamentals and Lessons Learned in Requirements Engineering.",
                    "A Common Framework for Synchronization in Requirements Modelling Languages.",
                    "A Systematic Review of the Use of Requirements Engineering Techniques in Model-Driven Development.",
                    "Slicing of UML Models Using Model Transformations.",
                    "An Adjustable Transformation from OWL to Ecore.",
                    "Transforming Process Models: Executable Rewrite Rules versus a Formalized Java Program.",
                    "Disciplined Heterogeneous Modeling - Invited Paper.",
                    "Design Guidelines for the Development of Quality-Driven Model Transformations.",
                    "Early Deviation Detection in Modeling Activities of MDE Processes.",
                    "Artifact or Process Guidance, an Empirical Study.",
                    "Scaling Up Model Driven Engineering - Experience and Lessons Learnt.",
                    "Mod4J: A Qualitative Case Study of Model-Driven Software Development.",
                    "Modeling Issues: a Survival Guide for a Non-expert Modeler.",
                    "Monarch: Model-Based Development of Software Architectures.",
                    "Model-to-Metamodel Transformation for the Development of Component-Based Systems.",
                    "Architectural Descriptions as Boundary Objects in System and Design Work."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2010w",
                "sub_name": "Models in Software Engineering - Workshops and Symposia at MODELS 2010, Oslo, Norway, October 2-8, 2010, Reports and Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "The Doctoral Symposium at MODELS 2010.",
                    "ReuseMe - Towards Aspect-Driven Reuse in Modelling Method Development.",
                    "A Model-Based Framework for Software Performance Feedback.",
                    "Software Modeling in Education: The 6th Educators' Symposium at MODELS 2010.",
                    "Novel Communication Channels in Software Modeling Education.",
                    "Implementation of the Concept-Driven Approach in an Object-Oriented Analysis and Design Course.",
                    "Model Based Architecting and Construction of Embedded Systems (ACES-MB 2010).",
                    "Virtual Verification of System Designs against System Requirements.",
                    "From Interaction Overview Diagrams to Temporal Logic.",
                    "Report of the 15th International Workshop on Aspect-Oriented Modeling.",
                    "Aspect-Oriented Feature Models.",
                    "Mapping Aspect-Oriented Models to Aspect-Oriented Code.",
                    "Equation-Based Object-Oriented Modeling Languages and Tools - Report on the Workshop EOOLT 2010 at MODELS 2010 Oslo, Norway, October 3, 2010.",
                    "Model-Driven Interoperability: MDI 2010.",
                    "From the Heterogeneity Jungle to Systematic Benchmarking.",
                    "Specifying Overlaps of Heterogeneous Models for Global Consistency Checking.",
                    "Models and Evolution - ME2010.",
                    "Conflicts as First-Class Entities: A UML Profile for Model Versioning.",
                    "A Manifesto for Semantic Model Differencing.",
                    "Summary of the 5th International Workshop on Models@run.time.",
                    "Meta-modeling Runtime Models.",
                    "The Role of Models and Megamodels at Runtime.",
                    "MoDeVVa 2010 Workshop Summary.",
                    "Efficient Test Suite Reduction by Merging Pairs of Suitable Test Cases.",
                    "Traceability for Mutation Analysis in Model Transformation.",
                    "Summary of the Workshop on Multi-Paradigm Modelling: Concepts and Tools.",
                    "Model-Based System Verification: A Formal Framework for Relating Analyses, Requirements, and Tests.",
                    "Simplifying Model Transformation Chains by Rule Composition.",
                    "The 3rd International Workshop on Non-functional System Properties in Domain Specific Modeling Languages (NFPinDSML2010).",
                    "Integration of Component Fault Trees into the UML.",
                    "QVTR2: A Rational and Performance-Aware Extension to the Relations Language.",
                    "Tenth International Workshop on OCL and Textual Modelling.",
                    "A Specification-Based Test Case Generation Method for UML/OCL.",
                    "Integrating OCL and Textual Modelling Languages.",
                    "Quality of Service-Oriented Software Systems (QUASOSS 2010).",
                    "An Accuracy Information Annotation Model for Validated Service Behavior Specifications.",
                    "Focussing Multi-Objective Software Architecture Optimization Using Quality of Service Bounds.",
                    "First International Workshop on Model Based Engineering for Robotics (RoSym'10).",
                    "Integrating Ontological Domain Knowledge into a Robotic DSL."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2010mdi",
                "sub_name": "Proceedings of the First International Workshop on Model-Driven Interoperability, MDI@MoDELS 2010, Oslo, Norway, October 3-5, 2010.",
                "count": 13,
                "papers": [
                    "Editorial to the Proceedings of the First International Workshop on Model-Driven Interoperability.",
                    "Model driven interoperability in practice: preliminary evidences and issues from an industrial project.",
                    "Semantic interoperability of clinical data.",
                    "A process model discovery approach for enabling model interoperability in signal engineering.",
                    "Efficient analysis and execution of correct and complete model transformations based on triple graph grammars.",
                    "Towards an expressivity benchmark for mappings based on a systematic classification of heterogeneities.",
                    "Specifying overlaps of heterogeneous models for global consistency checking.",
                    "Anticipating unanticipated tool interoperability using role models.",
                    "Aligning business and IT models in service-oriented architectures using BPMN and SoaML.",
                    "Domain-specific templates for refinement transformations.",
                    "Advanced modelling made simple with the Gmodel metalanguage.",
                    "Model-driven rule-based mediation in XML data exchange.",
                    "Behavioural interoperability to support model-driven systems integration."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th MoDELS 2009",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2009",
                "sub_name": "Model Driven Engineering Languages and Systems, 12th International Conference, MODELS 2009, Denver, CO, USA, October 4-9, 2009. Proceedings.",
                "count": 62,
                "papers": [
                    "Models. Models. Models. So What?",
                    "Modeling Modeling.",
                    "Representation and Traversal of Large Clabject Models.",
                    "Meta-model Pruning.",
                    "A UML/MARTE Model Analysis Method for Detection of Data Races in Concurrent Systems.",
                    "Model Driven Performance Measurement and Assessment with MoDePeMART.",
                    "Security Analysis of a Biometric Authentication System Using UMLsec and JML.",
                    "Automatically Discovering Hidden Transformation Chaining Constraints.",
                    "CSP(M): Constraint Satisfaction Problem over Models.",
                    "Parsing SBVR-Based Controlled Languages.",
                    "SLIM - A Lightweight Environment for Synchronous Collaborative Modeling.",
                    "Language-Independent Change Management of Process Models.",
                    "Requirements for Practical Model Merge - An Industrial Perspective.",
                    "Evaluating the Impact of UML Modeling on Software Quality: An Industrial Case Study.",
                    "Concern Visibility in Base Station Development - An Empirical Investigation.",
                    "Influencing Factors in Model-Based Testing with UML State Machines: Report on an Industrial Cooperation.",
                    "Towards Composite Model Transformations Using Distributed Graph Transformation Concepts.",
                    "On-the-Fly Construction, Correctness and Completeness of Model Transformations Based on Triple Graph Grammars.",
                    "Formal Support for QVT-Relations with Coloured Petri Nets.",
                    "An Example Is Worth a Thousand Words: Composite Operation Modeling By-Example.",
                    "Refactoring-Safe Modeling of Aspect-Oriented Scenarios.",
                    "Model-Based Testing Using LSCs and S2A.",
                    "Model Driven Development of Graphical User Interfaces for Enterprise Business Applications - Experience, Lessons Learnt and a Way Forward.",
                    "Business Process Models as a Showcase for Syntax-Based Assistance in Diagram Editors.",
                    "Rule-Enhanced Business Process Modeling Language for Service Choreographies.",
                    "Change-Driven Model Transformations.",
                    "An Incremental Algorithm for High-Performance Runtime Model Consistency.",
                    "Traceability-Based Change Awareness.",
                    "Interaction Design and Model-Driven Development.",
                    "Towards Test-Driven Semantics Specification.",
                    "Scalable Semantic Annotation Using Lattice-Based Ontologies.",
                    "OntoDSL: An Ontology-Based Framework for Domain-Specific Languages.",
                    "Domain-Specific Languages in Practice: A User Study on the Success Factors.",
                    "Evaluating Context Descriptions and Property Definition Patterns for Software Formal Validation.",
                    "Anatomy of a Visual Domain-Specific Language Project in an Industrial Context.",
                    "A Goal-Based Modeling Approach to Develop Requirements of an Adaptive System with Environmental Uncertainty.",
                    "A Use Case Modeling Approach to Facilitate the Transition towards Analysis Models: Concepts and Empirical Evaluation.",
                    "Polymorphic Scenario-Based Specification Models: Semantics and Applications.",
                    "Aspect Model Unweaving.",
                    "Model Composition Contracts.",
                    "Abstracting Complex Languages through Transformation and Composition.",
                    "An Approach for Evolving Transformation Chains.",
                    "Deterministic UML Models for Interconnected Activities and State Machines.",
                    "Automated Encapsulation of UML Activities for Incremental Development and Verification.",
                    "Using UML Statecharts with Knowledge Logic Guards.",
                    "A Modeling Language for Activity-Oriented Composition of Service-Oriented Software Systems.",
                    "A Domain Specific Modeling Language Supporting Specification, Simulation and Execution of Dynamic Adaptive Systems.",
                    "Executable Domain Specific Language for Message-Based System Integration.",
                    "Architectural Mining: The Other Side of the MDD.",
                    "Generic Model Refactorings.",
                    "Constraining Type Parameters of UML 2 Templates with Substitutable Classifiers.",
                    "Generating Assertion Code from OCL: A Transformational Approach Based on Similarities of Implementation Languages.",
                    "OCLLib, OCLUnit, OCLDoc: Pragmatic Extensions for the Object Constraint Language.",
                    "Variability within Modeling Language Definitions.",
                    "Variability Modelling throughout the Product Line Lifecycle.",
                    "Weaving Variability into Domain Metamodels.",
                    "Automatic Domain Model Migration to Manage Metamodel Evolution.",
                    "Model Transformation by Demonstration.",
                    "Reviving QVT Relations: Model-Based Debugging Using Colored Petri Nets.",
                    "Incremental Development of Model Transformation Chains Using Automated Testing.",
                    "Test-Driven Development of Model Transformations.",
                    "Educators' Symposium at MODELS 2009."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2009w",
                "sub_name": "Models in Software Engineering, Workshops and Symposia at MODELS 2009, Denver, CO, USA, October 4-9, 2009, Reports and Revised Selected Papers.",
                "count": 32,
                "papers": [
                    "The Doctoral Symposium at MODELS 2009.",
                    "Catch Me If You Can - Debugging Support for Model Transformations.",
                    "A Coordination-Based Model-Driven Method for Parallel Application Development.",
                    "Essentials of the 5th Educators' Symposium at MODELS 2009.",
                    "Teaching Object-Oriented Modeling and UML to Various Audiences.",
                    "Teaching Modeling: Why, When, What?",
                    "Model Based Architecting and Construction of Embedded Systems (ACES-MB 2009).",
                    "Using Higher-Order Transformations to Derive Variability Mechanism for Embedded Systems.",
                    "Model-Based Extension of AUTOSAR for Architectural Online Reconfiguration.",
                    "Report of the 14th International Workshop on Aspect-Oriented Modeling.",
                    "HiLA: High-Level Aspects for UML State Machines.",
                    "4th International Workshop on Models@run.time.",
                    "Incremental Model Synchronization for Efficient Run-Time Monitoring.",
                    "Generating Synchronization Engines between Running Systems and Their Model-Based Views.",
                    "MoDeVVa Workshop Summary.",
                    "From UML to Alloy and Back Again.",
                    "Generating Class Contracts from Deterministic UML Protocol Statemachines.",
                    "\"Models and Evolution\": Joint MoDSE-MCCM 2009 Workshop on Model-Driven Software Evolution (MoDSE) Model Co-Evolution and Consistency Management (MCCM).",
                    "Model Patches in Model-Driven Engineering.",
                    "Limitations of Automating Model Migration in Response to Metamodel Adaptation.",
                    "Recent Advances in Multi-paradigm Modeling.",
                    "Deriving Correspondence Relationships to Guide a Multi-view Heterogeneous Composition.",
                    "Explicit Transformation Modeling.",
                    "Ninth International Workshop on the Pragmatics of OCL and Other Textual Specification Languages.",
                    "Extending OCL with Null-References.",
                    "On Better Understanding OCL Collections or An OCL Ordered Set Is Not an OCL Set.",
                    "The 2nd International Workshop on Non-functional System Properties in Domain Specific Modeling Languages (NFPinDSML2009).",
                    "On the Specification of Non-functional Properties of Systems by Observation.",
                    "Modeling Heterogeneous Points of View with ModHel'X.",
                    "Second Workshop on Transforming and Weaving Ontologies in Model Driven Engineering (TWOMDE 2009).",
                    "Towards Semantic Modeling of Network Physical Devices.",
                    "Using Ontology Reasoning for Reverse Engineering Design Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2009modevva",
                "sub_name": "Proceedings of the 6th International Workshop on Model-Driven Engineering, Verification and Validation, MoDeVVa '09, Denver, Colorado, USA, October 5, 2009.",
                "count": 9,
                "papers": [
                    "Finite satisfiability of class diagrams: practical occurrence and scalability of the FiniteSat algorithm.",
                    "A formalism for describing modeling transformations for verification.",
                    "Verification of DSMLs using graph transformation: a case study with Alloy.",
                    "From UML to Alloy and back again.",
                    "Model transformations to satisfy all-configurations-transitions on statecharts.",
                    "Automated model-based testing using the UML testing profile and QVT.",
                    "From design models to test models by means of test ideas.",
                    "Generating class contracts from UML protocol statemachines.",
                    "Supporting inconsistency resolution through predictive change impact analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2009acesmb",
                "sub_name": "Proceedings of the 2nd International Workshop on Model Based Architecting and Construction of Embedded Systems ( ACES-MB 2009 ), held as part of the 2009 International Conference on Model Driven Engineering Languages and Systems ( MoDELS'09 ) Denver, Colorado, USA, October 6, 2009.",
                "count": 11,
                "papers": [
                    "preface.",
                    "SOPHIA: a Modeling Language for Model-Based Safety Engineering.",
                    "PaNeCS: A Modeling Language for Passivity-based Design of Networked Control Systems.",
                    "Formal Design Models for Distributed Embedded Control Systems.",
                    "Improving Timing Analysis for Matlab Simulink/Stateflow.",
                    "Prototyping of Distributed Embedded Systems Using AADL.",
                    "Towards Intelligent Tool-Support for AADL Based Modeling of Embedded Systems.",
                    "Model-Based Codesign of Critical Embedded Systems.",
                    "Design Complexity Management in Embedded System Design.",
                    "Using Higher-order Transformations to Derive Variability Mechanism for Embedded Systems.",
                    "Model-Based Extension of AUTOSAR for Architectural Online Reconfiguration."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2009twomde",
                "sub_name": "Proceedings of the 2nd International Workshop on Transforming and Weaving Ontologies in Model Driven Engineering, TWOMDE@MoDELS 2009, Denver, CO, USA, October 4, 2009.",
                "count": 5,
                "papers": [
                    "Preface.",
                    "Ontologies and Software Modeling: Potentials, Experience and Challenges.",
                    "Mapping MOF-based Requirements Representations to Ontologies for Software Reuse.",
                    "Combining Ontology-enriched Domain-Specific Languages.",
                    "Towards a Model-driven Approach for Reverse Engineering Design Patterns."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th MoDELS 2008",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2008",
                "sub_name": "Model Driven Engineering Languages and Systems, 11th International Conference, MoDELS 2008, Toulouse, France, September 28 - October 3, 2008. Proceedings.",
                "count": 66,
                "papers": [
                    "The Objects and Arrows of Computational Design.",
                    "Algebraic Models for Bidirectional Model Synchronization.",
                    "An Invariant-Based Method for the Analysis of Declarative Model-to-Model Transformations.",
                    "Precise Semantics of EMF Model Transformations by Graph Transformation.",
                    "A Formal Metamodel for Problem Frames.",
                    "Visualization of Use Cases through Automatically Generated Activity Diagrams.",
                    "Requirements Modeling and Validation Using Bi-layer Use Case Descriptions.",
                    "WebWorkFlow: An Object-Oriented Workflow Modeling Language for Web Applications.",
                    "The Future of Train Signaling.",
                    "NAOMI - An Experimental Platform for Multi-modeling.",
                    "Abstraction and Modelling - A Complementary Partnership.",
                    "Model Transformation as an Optimization Problem.",
                    "Example-Based Program Transformation.",
                    "Detecting Patterns of Poor Design Solutions Using Constraint Propagation.",
                    "A General Approach for Scenario Integration.",
                    "Behavioral Modelling and Composition of Object Slices Using Event Observation.",
                    "Scenario-Based Static Analysis of UML Class Models.",
                    "Constructing Models with the Human-Usable Textual Notation.",
                    "X3D-UML: 3D UML State Machine Diagrams.",
                    "Assessing the Influence of Stereotypes on the Comprehension of UML Sequence Diagrams: A Controlled Experiment.",
                    "3D Parametric Models for Aeroplanes - From Idea to Design.",
                    "MOOGLE: A Model Search Engine.",
                    "Managing Model Conflicts in Distributed Development.",
                    "Metamodel Matching for Automatic Model Transformation Generation.",
                    "Sufficient Criteria for Consistent Behavior Modeling with Refined Activity Diagrams.",
                    "Implementation of the Conformance Relation for Incremental Development of Behavioural Models.",
                    "A Model-Based Framework for Statically and Dynamically Checking Component Interactions.",
                    "Formal Definition of MOF 2.0 Metamodel Components and Composition.",
                    "Interfaces and Metainterfaces for Models and Metamodels.",
                    "Model&Metamodel, Metadata and Document Repository for Software and Data Integration.",
                    "Model Construction with External Constraints: An Interactive Journey from Semantics to Syntax.",
                    "A Benchmark for OCL Engine Accuracy, Determinateness, and Efficiency.",
                    "Contrary-to-Duties Constraints: From UML to Relational Model.",
                    "A UML/SPT Model Analysis Methodology for Concurrent Systems Based on Genetic Algorithms.",
                    "Integrating Performance Analysis in the Model Driven Development of Software Product Lines.",
                    "A Model-Driven Measurement Approach.",
                    "Specifying Service Composition Using UML 2.x and Composition Policies.",
                    "A Model-Based Framework for Security Policy Specification, Deployment and Testing.",
                    "A Pattern Language Verifier for Web-Based Enterprise Applications.",
                    "Automatically Generating Behavioral Models of Adaptive Systems to Address Uncertainty.",
                    "Autonomic Management Policy Specification: From UML to DSML.",
                    "Empirical Analysis of the Relation between Level of Detail in UML Models and Defect Density.",
                    "An Empirical Investigation on Dynamic Modeling in Requirements Engineering.",
                    "Heterogeneous Coupled Evolution of Software Languages.",
                    "Automatability of Coupled Evolution of Metamodels and Models in Practice.",
                    "Enriching Reverse Engineering with Annotations.",
                    "Towards a Formal Account of a Foundational Subset for Executable UML Models.",
                    "A Lightweight Approach for Defining the Formal Semantics of a Modeling Language.",
                    "Semantically Configurable Code Generation.",
                    "Safety Hazard Identification by Misuse Cases: Experimental Comparison of Text and Diagrams.",
                    "Adding Dependability Analysis Capabilities to the MARTE Profile.",
                    "Visual ScatterUnit: A Visual Model-Driven Testing Framework of Wireless Sensor Networks Applications.",
                    "Aspect-Oriented Model Weaving Beyond Model Composition and Model Transformation.",
                    "An Aspect-Oriented and Model-Driven Approach for Managing Dynamic Variability.",
                    "Managing Variability Complexity in Aspect-Oriented Modeling.",
                    "Mapping the UML2 Semantics of Associations to a Java Code Generation Model.",
                    "Meaningful Composite Structures.",
                    "A Systematic Approach to Connectors in a Multi-level Modeling Environment.",
                    "Model-Based Quality Assurance of Automotive Software.",
                    "Ontology Guided Evolution of Complex Embedded Systems Projects in the Direction of MDA.",
                    "General Mode Controller for Software on Artificial Satellite with Model-Based Validation Tool.",
                    "Workshops at MODELS 2008.",
                    "Educators Symposium at MODELS 2008.",
                    "Doctoral Symposium at MODELS 2008.",
                    "Tutorials at MODELS 2008.",
                    "Panels at MODELS 2008."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2008w",
                "sub_name": "Models in Software Engineering, Workshops and Symposia at MODELS 2008, Toulouse, France, September 28 - October 3, 2008. Reports and Revised Selected Papers.",
                "count": 41,
                "papers": [
                    "Model Based Architecting and Construction of Embedded Systems.",
                    "Translating AADL into BIP - Application to the Verification of Real-Time Systems.",
                    "Towards Model-Based Integration of Tools and Techniques for Embedded Control System Design, Verification, and Implementation.",
                    "Challenges in Model-Driven Software Engineering.",
                    "The Grand Challenge of Scalability for Model Driven Engineering.",
                    "MDE Adoption in Industry: Challenges and Success Criteria.",
                    "Behavior, Time and Viewpoint Consistency: Three Challenges for MDE.",
                    "Embedded System Construction - Evaluation of Model-Driven and Component-Based Development Approaches.",
                    "Assessing the Power of a Visual Modeling Notation - Preliminary Contemplations on Designing a Test.",
                    "Third International Workshop on Models@run.time.",
                    "Modeling and Validating Dynamic Adaptation.",
                    "Model-Based Traces.",
                    "Model Co-evolution and Consistency Management (MCCM'08).",
                    "On Integrating OCL and Triple Graph Grammars.",
                    "Triple Graph Grammars or Triple Graph Transformation Systems?.",
                    "Model-Driven Web Engineering (MDWE 2008).",
                    "Model Transformations for Performability Analysis of Service Configurations.",
                    "A Transformation Framework to Bridge Domain Specific Languages to MDA.",
                    "First International Modeling Security Workshop.",
                    "Security Requirements Elicitation Using Method Weaving and Common Criteria.",
                    "Second International Workshop on the Model-Based Design of Trustworthy Health Information Systems MOTHIS 2008.",
                    "Experiences from Model-Driven Development of Homecare Services: UML Profiles and Domain Models.",
                    "Ontology-Based Assessment of Functional Redundancy in Health Information Systems.",
                    "The First International Workshop on Non-Functional System Properties in Domain Specific Modeling Languages (NFPinDSML2008).",
                    "FPTC: Automated Safety Analysis for Domain-Specific Languages.",
                    "From Access Control Policies to an Aspect-Based Infrastructure: A Metamodel-Based Approach.",
                    "Eighth International Workshop on OCL Concepts and Tools.",
                    "Shortcomings of the Embedding of OCL into QVT ImperativeOCL.",
                    "Optimization Patterns for OCL-Based Model Transformations.",
                    "Third International Workshop on Quality in Modeling.",
                    "Description and Implementation of a UML Style Guide.",
                    "Empirical Validation of Measures for UML Class Diagrams: A Meta-Analysis Study.",
                    "First Workshop on Transforming and Weaving Ontologies in Model Driven Engineering (TWOMDE 2008).",
                    "Using an Ontology to Suggest Software Design Patterns Integration.",
                    "Using Ontologies in the Domain Analysis of Domain-Specific Languages.",
                    "Model-Driven Development of Context-Aware Web Applications Based on a Web Service Context Management Architecture.",
                    "DSL Tool Development with Transformations and Static Mappings.",
                    "Current Issues in Teaching Software Modeling: Educators Symposium at MODELS 2008.",
                    "The UML Is More Than Boxes and Lines.",
                    "Automatic Checklist Generation for the Assessment of UML Models.",
                    "MODELS Research Projects Symposium."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2008twomd",
                "sub_name": "Proceedings of the 1st International Workshop on Transforming and Weaving Ontologies in Model Driven Engineering TWOMDE 2008, Toulouse, France, September 28, 2008.",
                "count": 7,
                "papers": [
                    "Preface.",
                    "Potential Applications of Ontologies and Reasoning for Modeling and Software Engineering.",
                    "Using an Ontology to Suggest Design Patterns Integration.",
                    "Using Ontologies in the Domain Analysis of Domain-Specific Languages.",
                    "MDE for Publishing Data on the Semantic Web.",
                    "Bringing Ontology Awareness into Model Driven Engineering Platforms.",
                    "Designing MAS Organisation through an Integrated MDA/Ontology Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2008modsec",
                "sub_name": "Proceedings of the Workshop on Modeling Security ( MODSEC08 ) held as part of the 2008 International Conference on Model Driven Engineering Languages and Systems ( MODELS ) Toulouse, France, September 28, 2008.",
                "count": 19,
                "papers": [
                    "SECTISSIMO: A Platform-Independent Framework for Security Services.",
                    "Specifying Security Aspects in UML Models.",
                    "Transforming Security Audit Requirements into a Software Architecture.",
                    "Mutating DAC and MAC Security Policies: A Generic Metamodel Based Approach.",
                    "Experiences Threat Modeling at Microsoft.",
                    "Using Common Criteria as Reusable Knowledge in Security Requirements Elicitation.",
                    "Curriculum for Modeling Security: Experiences and Lessons Learned.",
                    "A Security Domain Model for Implementing Trusted Subject Behaviors.",
                    "Modeling Security Protocols using UML2.",
                    "Modeling and Assessment of Systems Security.",
                    "Model Driven Security Management: Making Security Management Manageable in Complex Distributed Systems.",
                    "Towards an Integrated Framework for Model-Driven Security Engineering.",
                    "Incorporating Security Requirements from Legal Regulations into UMLsec model.",
                    "IT Security Risk Analysis based on Business Process Models enhanced with Security Requirements.",
                    "Towards a Measurement Framework for Security Risk Management.",
                    "On the Inability of Existing Security Models to Cope with Data Mobility in Dynamic Organizations.",
                    "A Server Side SOA Meta Model for Assigning Aspect Services.",
                    "SPML: A Visual Approach for Modeling Firewall Configurations.",
                    "Automatic Generation of Secure Multidimensional Code for Data Warehouses by using QVT Transformations: an MDA Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2008mdwe",
                "sub_name": "Proceedings of the 4th International Workshop on Model-Driven Web Engineering, MDWE@MoDELS 2008, Tolouse, France, September 30 , 2008.",
                "count": 8,
                "papers": [
                    "Towards Modeling Role-Based Pageflow Definitions within Web Applications.",
                    "A Comparative Analysis of Graph Transformation Engines for User Interface Development.",
                    "Towards a Semi-Automated Model-Driven Method for the Generation of Web-based Applications from Use Cases.",
                    "From Real Computational Independent Models to Information System Models: An MDE approach.",
                    "Model Driven Performability Analysis of Service Configurations with Reliable Messaging.",
                    "Leveraging Modes and UML2 for Service Brokering Specifications.",
                    "A Metamodel Transformation Framework for the Migration of WebML Models to MDA.",
                    "Designing Web Content Management Systems Using the Method Association Approach."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th MoDELS 2007",
        "info": "Nashville, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2007",
                "sub_name": "Model Driven Engineering Languages and Systems, 10th International Conference, MoDELS 2007, Nashville, USA, September 30 - October 5, 2007, Proceedings.",
                "count": 48,
                "papers": [
                    "Bidirectional Model Transformations in QVT: Semantic Issues and Open Questions.",
                    "Reconciling TGGs with QVT.",
                    "UniTI: A Unified Transformation Infrastructure.",
                    "Guided Development with Multiple Domain-Specific Languages.",
                    "Model-Driven, Network-Context Sensitive Intrusion Detection.",
                    "An Empirical Study of the Impact of OCL Smells and Refactorings on the Understandability of OCL Specifications.",
                    "On Metamodeling in Megamodels.",
                    "Magritte - A Meta-driven Approach to Empower Developers and End Users.",
                    "Matching Model-Snippets.",
                    "Improving Inconsistency Resolution with Side-Effect Evaluation and Costs.",
                    "Model Composition in Product Lines and Feature Interaction Detection Using Critical Pair Analysis.",
                    "Automated Semantic Analysis of Design Models.",
                    "Piecewise Modelling with State Subtypes.",
                    "Deriving Operation Contracts from UML Class Diagrams.",
                    "Finding the Pattern You Need: The Design Pattern Intent Ontology.",
                    "Model-Driven Approach for Managing Human Interface Design Life Cycle.",
                    "Integrating Heterogeneous Tools into Model-Centric Development of Interactive Applications.",
                    "A Business-Process-Driven Approach for Generating E-Commerce User Interfaces.",
                    "Enhancing UML Extensions with Operational Semantics.",
                    "Integrated Definition of Abstract and Concrete Syntax for Textual Languages.",
                    "Architectural Aspects in UML.",
                    "Domain Specific Modeling Methodology for Reconfigurable Networked Systems.",
                    "A Modelling Method for Rigorous and Automated Design of Large-Scale Industrial Systems.",
                    "Relating Navigation and Request Routing Models in Web Applications.",
                    "A UML2 Profile for Service Modeling.",
                    "Automatic Generation of Workflow-Extended Domain Models.",
                    "A Practical Perspective on the Design and Implementation of Service-Oriented Solutions.",
                    "Constructive Techniques for Meta- and Model-Level Reasoning.",
                    "A Metamodel-Based Approach for Analyzing Security-Design Models.",
                    "UML2Alloy: A Challenging Model Transformation.",
                    "i2MAP : An Incremental and Iterative Modeling and Analysis Process.",
                    "A Model-Driven Measurement Procedure for Sizing Web Applications: Design, Automation and Validation.",
                    "Model-Driven Engineering for Software Migration in a Large Industrial Context.",
                    "Introducing Variability into Aspect-Oriented Modeling Approaches.",
                    "An Expressive Aspect Composition Language for UML State Diagrams.",
                    "Enhancing UML State Machines with Aspects.",
                    "Complementary Use Case Scenario Representations Based on Domain Vocabularies.",
                    "Modeling Time(s).",
                    "A UML Profile for Developing Airworthiness-Compliant (RTCA DO-178B), Safety-Critical Software.",
                    "Forensic Debugging of Model Transformations.",
                    "Runtime Debugging Using Reverse-Engineered UML.",
                    "Formally Defining a Graphical Language for Monitoring and Checking Object Interactions.",
                    "Statechart Development Beyond WYSIWYG.",
                    "Model-Based Design of Computer-Controlled Game Character Behavior.",
                    "Model-Driven Construction of Certified Binaries.",
                    "Workshops and Symposia at MODELS 2007.",
                    "Tutorials at MODELS 2007.",
                    "Panels at MODELS 2007."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2007w",
                "sub_name": "Models in Software Engineering, Workshops and Symposia at MoDELS 2007, Nashville, TN, USA, September 30 - October 5, 2007, Reports and Revised Selected Papers.",
                "count": 33,
                "papers": [
                    "11th International Workshop on Aspect-Oriented Modeling.",
                    "A Generic Approach for Automatic Model Composition.",
                    "MATA: A Tool for Aspect-Oriented Modeling Based on Graph Transformation.",
                    "4th International Workshop on Language Engineering (ATEM 2007).",
                    "Designing Syntax Embeddings and Assimilations for Language Libraries.",
                    "A Comparison of Standard Compliant Ways to Define Domain Specific Languages.",
                    "Third International Workshop on Model Driven Development of Advanced User Interfaces.",
                    "Domain-Specific Methods and Tools for the Design of Advanced Interactive Techniques.",
                    "Transforming Discourse Models to Structural User Interface Models.",
                    "Second International Workshop on Model Size Metrics.",
                    "On the Relation between Class-Count and Modeling Effort.",
                    "Measuring the Level of Abstraction and Detail of Models in the Context of MDD.",
                    "First International Workshop on the Model-Based Design of Trustworthy Health Information Systems.",
                    "Rigorously Defining and Analyzing Medical Processes: An Experience Report.",
                    "Modeling and Enforcing Advanced Access Control Policies in Healthcare Systems with Sectet.",
                    "4th International Workshop on Model Driven Engineering, Verification, and Validation: Integrating Verification and Validation in MDE.",
                    "Deriving Input Partitions from UML Models for Automatic Test Generation.",
                    "Putting Performance Engineering into Model-Driven Engineering: Model-Driven Performance Engineering.",
                    "7th International Workshop on Ocl4All: Modelling Systems with OCL.",
                    "Model-Level Integration of the OCL Standard Library Using a Pivot Model with Generics Support.",
                    "Evaluation of OCL for Large-Scale Modelling: A Different View of the Mondex Purse.",
                    "Second International Workshop on Models@run.time.",
                    "AMOEBA-RT: Run-Time Verification of Adaptive Software.",
                    "Model-Based Run-Time Error Detection.",
                    "Second International Workshop on Multi-Paradigm Modeling: Concepts and Tools.",
                    "ModHel'X: A Component-Oriented Approach to Multi-Formalism Modeling.",
                    "Domain-Specific Model Editors with Model Completion.",
                    "Third Intenational Workshop on Quality in Modeling.",
                    "Developing a Quality Framework for Model-Driven Engineering.",
                    "Doctoral Symposium.",
                    "Models in Conflict - Towards a Semantically Enhanced Version Control System for Models.",
                    "Aspect-Oriented User Requirements Notation: Aspects in Goal and Scenario Models.",
                    "Educators' Symposium."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2007ds",
                "sub_name": "Proceedings of the Doctoral Symposium at the ACM/IEEE 10th International Conference on Model-Driven Engineering Languages and Systems, Nashville (TN), USA, October 1st, 2007.",
                "count": 10,
                "papers": [
                    "Doctoral Symposium Foreword.",
                    "Towards a Formal Framework for Multimodeling in Software Engineering.",
                    "Definition of Visual Language Editors Using Declarative Languages.",
                    "Slicing the Three-layer Architecture: A Semantic Foundation for Behavioural Specification.",
                    "Models in Conflict - A Semantically Enhanced Version Control System for Models.",
                    "Scenario Integration via the Transformation and Manipulation of Higher-order Graphs.",
                    "A Methodological Approach to Developing Model Transformations.",
                    "Validation of System Behavior from an Integrated Semantics of Use Case and Design Models.",
                    "Semantics Preserving Model Composition.",
                    "Aspect Oriented User Requirements Notation."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2007mddaui",
                "sub_name": "Proceedings of the MoDELS 2007 Workshop on Model Driven Development of Advanced User Interfaces, Nashville, Tennessee, USA, October 1, 2007.",
                "count": 9,
                "papers": [
                    "Domain Specific Methods and Tools for the Design of Advanced Interactive Techniques.",
                    "Useware Modeling for Ambient Intelligent Production Environments.",
                    "Using Domain-Specific Modeling to Generate User Interfaces for Wizards.",
                    "Model and Formalism Driven Development of Collaborative Applications.",
                    "Transforming a Discourse Model to an Abstract User Interface Model.",
                    "GrTP: Transformation Based Graphical Tool Building Platform.",
                    "Model Driven Development of Complex User Interface.",
                    "A Framework for Incorporating Usability into Model Transformations.",
                    "Model Based Reengineering Of User Interfaces."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th MoDELS 2006",
        "info": "Genova, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/models/2006",
                "sub_name": "Model Driven Engineering Languages and Systems, 9th International Conference, MoDELS 2006, Genova, Italy, October 1-6, 2006, Proceedings.",
                "count": 56,
                "papers": [
                    "A Software Modeling Odyssey: Designing Evolutionary Architecture-Centric Real-Time Systems and Product Lines.",
                    "Uses and Abuses of the Stereotype Mechanism in UML 1.x and 2.0.",
                    "An Experimental Investigation of UML Modeling Conventions.",
                    "Improving the Definition of UML.",
                    "Adopting Model Driven Software Development in Industry - A Case Study at Two Companies.",
                    "Use Case Driven Iterative Development: Hurdles and Solutions.",
                    "Model-Driven Development with SDL - Process, Tools, and Experiences.",
                    "Model-Driven Analysis and Synthesis of Concrete Syntax.",
                    "Correctly Defined Concrete Syntax for Visual Modeling Languages.",
                    "Compositional MDA.",
                    "CUP 2.0: High-Level Modeling of Context-Sensitive Interactive Applications.",
                    "Domain Models Are NOT Aspect Free.",
                    "A Slice of MDE with AOP: Transforming High-Level Business Rules to Aspects.",
                    "Package Merge in UML 2: Practice vs. Theory?",
                    "Detecting and Resolving Model Inconsistencies Using Transformation Dependency Analysis.",
                    "Merging Models with the Epsilon Merging Language (EML).",
                    "Mappings, Maps and Tables: Towards Formal Semantics for Associations in UML2.",
                    "Semantic Variations Among UML StateMachines.",
                    "Facilitating the Definition of General Constraints in UML.",
                    "Towards a MOF/QVT-Based Domain Architecture for Model Driven Security.",
                    "MDA-Based Re-engineering with Object-Z.",
                    "A Model Transformation Semantics and Analysis Methodology for SecureUML.",
                    "Incremental Model Transformation for the Evolution of Model-Driven Systems.",
                    "A Plugin-Based Language to Experiment with Model Transformation.",
                    "SiTra: Simple Transformations in Java.",
                    "Analysis and Visualization of Behavioral Dependencies Among Distributed Objects Based on UML Models.",
                    "Model Extraction Using Context Information.",
                    "Dynamic and Generic Manipulation of Models: From Introspection to Scripting.",
                    "Model Transformation by Example.",
                    "Graphical Definition of In-Place Transformations in the Eclipse Modeling Framework.",
                    "Model Transformations? Transformation Models!",
                    "A Mapping Language from Models to DI Diagrams.",
                    "Basic Operations over Models Containing Subset and Union Properties.",
                    "A Metamodeling Approach to Pattern Specification.",
                    "Immune System Computation and the Immunological Homunculus.",
                    "Building Abstractions in Class Models: Formal Concept Analysis in a Model-Driven Approach.",
                    "Lifting Metamodels to Ontologies: A Step to the Semantic Integration of Modeling Languages.",
                    "Incremental Model Synchronization with Triple Graph Grammars.",
                    "Model-Driven Assessment of Use Cases for Dependable Systems.",
                    "A Graphical Approach to Risk Identification, Motivated by Empirical Investigations.",
                    "Reusable MDA Components: A Testing-for-Trust Approach.",
                    "Using Smalltalk as a Reflective Executable Meta-language.",
                    "UML Model Interchange in Heterogeneous Tool Environments: An Analysis of Adoptions of XMI 2.",
                    "Applying Model Fragment Copy-Restore to Build an Open and Distributed MDA Environment.",
                    "An OCL-Based Technique for Specifying and Verifying Refinement-Oriented Transformations in MDE.",
                    "An OCL Semantics Specified with QVT.",
                    "Specification of Invariability in OCL.",
                    "Framework-Specific Modeling Languages with Round-Trip Engineering.",
                    "A Visualization Framework for the Modeling and Formal Analysis of High Assurance Systems.",
                    "Layered Class Diagrams: Supporting the Design Process.",
                    "Using UML Activities for System-on-Chip Design and Synthesis.",
                    "Modeling and Early Performance Estimation for Network Processor Applications.",
                    "A Formal Semantics of UML-RT.",
                    "Workshops and Symposia at MoDELS 2006.",
                    "Tutorials at MoDELS 2006.",
                    "Panels at MoDELS 2006."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2006w",
                "sub_name": "Models in Software Engineering, Workshops and Symposia at MoDELS 2006, Genoa, Italy, October 1-6, 2006, Reports and Revised Selected Papers.",
                "count": 42,
                "papers": [
                    "9th International Workshop on Aspect-Oriented Modeling.",
                    "Modeling Features in Aspect-Based Product Lines with Use Case Slices: An Exploratory Case Study.",
                    "Join Point Patterns: A High-Level Join Point Selection Mechanism.",
                    "Critical Systems Development Using Modeling Languages - CSDUML 2006 Workshop Report.",
                    "Modeling an Electronic Throttle Controller Using the Timed Abstract State Machine Language and Toolset.",
                    "Model Checking of UML 2.0 Interactions.",
                    "3rd International Workshop on Metamodels, Schemas, Grammars and Ontologies.",
                    "A Unified Ontology-Based Process Model for Software Maintenance and Comprehension.",
                    "Formalizing the Well-Formedness Rules of EJB3QL in UML + OCL.",
                    "The 1st Workshop on Quality in Modeling.",
                    "Consistency of Business Process Models and Object Life Cycles.",
                    "A Qualitative Investigation of UML Modeling Conventions.",
                    "Model Driven Development of Advanced User Interfaces (MDDAUI) - MDDAUI'06 Workshop Report.",
                    "A Model-Driven Approach to the Engineering of Multiple User Interfaces.",
                    "Model-Driven Dynamic Generation of Context-Adaptive Web User Interfaces.",
                    "Modelling and Analysis of Real Time and Embedded Systems - Using UML.",
                    "Time Exceptions in Sequence Diagrams.",
                    "Applying Model Intelligence Frameworks for Deployment Problem in Real-Time and Embedded Systems.",
                    "OCL for (Meta-)Models in Multiple Application Domains.",
                    "OCL-Based Validation of a Railway Domain Profile.",
                    "OCL Support in an Industrial Environment.",
                    "Report on the 3rd MoDeVa Workshop - Model Design and Validation.",
                    "Towards Model-Driven Unit Testing.",
                    "Validation of Model Transformations - First Experiences Using a White Box Approach.",
                    "Summary of the 2006 Model Size Metrics Workshop.",
                    "Model Size Matters.",
                    "On the Application of Software Metrics to UML Models.",
                    "Summary of the Workshop Models@run.time at MoDELS 2006.",
                    "Using Runtime Models to Unify and Structure the Handling of Meta-information in Reflective Middleware.",
                    "Applying OMG D&C Specification and ECA Rules for Autonomous Distributed Component-Based Systems.",
                    "Summary of the Workshop on Multi-Paradigm Modeling: Concepts and Tools.",
                    "Think Global, Act Local: Implementing Model Management with Domain-Specific Integration Languages.",
                    "MoDELS 2006 Doctoral Symposium.",
                    "Model Driven Security Engineering for the Realization of Dynamic Security Requirements in Collaborative Systems.",
                    "Educators' Symposium at MoDELS 2006.",
                    "If You're Not Modeling, You're Just Programming: Modeling Throughout an Undergraduate Software Engineering Program.",
                    "Teaching Software Modeling in a Simulated Project Environment.",
                    "Repository for Model Driven Development (ReMoDD).",
                    "2nd UML 2 Semantics Symposium: Formal Semantics for UML.",
                    "A UML Simulator Based on a Generic Model Execution Engine.",
                    "Queries and Constraints: A Comprehensive Semantic Model for UML2.",
                    "Analysis of UML Activities with Dynamic Meta Modeling Techniques."
                ]
            },
            {
                "sub_name_abbr": "conf/models/2006mddaui",
                "sub_name": "Proceedings of the MoDELS'06 Workshop on Model Driven Development of Advanced User Interfaces Genova, Italy, October 2, 2006.",
                "count": 12,
                "papers": [
                    "A Model-Driven Approach to the Engineering of Multiple User Interfaces.",
                    "Open Issues for the development of 3D Multimodal Applications from an MDE perspective.",
                    "Dynamic Generation of Context-Adaptive Web User Interfaces through Model Interpretation.",
                    "Using Domain-Specific Languages in the Design of HMIs: Experiences and Lessons Learned.",
                    "Model-based Generation of Interactive Digital TV Applications.",
                    "Model-Driven Development of Digital Libraries: Generating the User Interface.",
                    "GuiBuilder - A Tool for Model-Driven Development of Multimedia User Interfaces.",
                    "Multi-paradigm modelling and synthesis of user interfaces.",
                    "Event-based Synchronization of Model-Based Multimodal User Interfaces.",
                    "Metamodel-based definition of interaction with visual environments.",
                    "Using HCI-Patterns with Model-based Generation of Advanced User-Interfaces.",
                    "Mapping Model: A First Step to Ensure Usability for sustaining User Interface Plasticity."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8th MoDELS 2005",
        "info": "Montego Bay, Jamaica",
        "venues": [
            {
                "sub_name_abbr": "conf/uml/2005",
                "sub_name": "Model Driven Engineering Languages and Systems, 8th International Conference, MoDELS 2005, Montego Bay, Jamaica, October 2-7, 2005, Proceedings.",
                "count": 54,
                "papers": [
                    "Model Driven Development for Distributed Real-Time and Embedded Systems.",
                    "Activity Diagram Patterns for Modeling Quality Constraints in Business Processes.",
                    "UML4SPM: A UML2.0-Based Metamodel for Software Process Modelling.",
                    "Realizing Model Driven Security for Inter-organizational Workflows with WS-CDL and UML 2.0.",
                    "Code Generation from UML Models with Semantic Variation Points.",
                    "Composing Domain-Specific Languages for Wide-Scope Software Engineering Applications.",
                    "Model Typing for Improving Reuse in Model-Driven Engineering.",
                    "UML Vs. Classical Vs. Rhapsody Statecharts: Not All Models Are Created Equal.",
                    "Evaluating the Effect of Composite States on the Understandability of UML Statechart Diagrams.",
                    "Computing Refactorings of Behavior Models.",
                    "Dynamic Secure Aspect Modeling with UML: From Models to Code.",
                    "Performance Analysis of UML Models Using Aspect-Oriented Modeling Techniques.",
                    "Domain Models Are Aspect Free.",
                    "Representing and Applying Design Patterns: What Is the Problem?.",
                    "Properties of Stereotypes from the Perspective of Their Role in Designs.",
                    "A Modelling and Simulation Based Approach to Dependable System Design.",
                    "Extending Profiles with Stereotypes for Composite Concepts.",
                    "Transformation from CIM to PIM: A Feature-Oriented Component-Based Approach.",
                    "Weaving Executability into Object-Oriented Meta-languages.",
                    "Keynote Address II: Domain-Specific Modeling: No One Size Fits All.",
                    "Refactoring OCL Annotated UML Class Diagrams.",
                    "Replicators: Transformations to Address Model Scalability.",
                    "Simplifying Transformations of OCL Constraints.",
                    "Lessons Learned from Automated Analysis of Industrial UML Class Models (An Experience Report).",
                    "Reliability Prediction in Model-Driven Development.",
                    "Model-Based Scalability Estimation in Inception-Phase Software Architecture.",
                    "Explicit Platform Models for MDA.",
                    "Integrated Model-Based Software Development, Data Access, and Data Migration.",
                    "Invited Presentation I: Lessons Learned, New Directions, and Migration Plans for Model-Driven Development of Large Scale Software Based Systems.",
                    "Concepts for Comparing Modeling Tool Architectures.",
                    "Scenario Construction Tool Based on Extended UML Metamodel.",
                    "Invited Presentation II: Experiences in Applying Model Based System Testing Generation.",
                    "The Impact of UML 2.0 on Existing UML 1.4 Models.",
                    "Towards UML 2 Extensions for Compact Modeling of Regular Complex Topologies.",
                    "Using UML 2.0 Collaborations for Compositional Service Specification.",
                    "Model-Driven Engineering in a Large Industrial Context - Motorola Case Study.",
                    "Using a Domain-Specific Language and Custom Tools to Model a Multi-tier Service-Oriented Application - Experiences and Challenges.",
                    "Invited Presentation III: The Architects' Workbench - Research in the Trenches.",
                    "Uniform Support for Modeling Crosscutting Structure.",
                    "Modeling Crosscutting Services with UML Sequence Diagrams.",
                    "A Formal Enforcement Framework for Role-Based Access Control Using Aspect-Oriented Programming.",
                    "A Domain Model for Dynamic System Reconfiguration.",
                    "Exceptional Use Cases.",
                    "Modeling Turnpike Frontend System: A Model-Driven Development Framework Leveraging UML Metamodeling and Attribute-Oriented Programming.",
                    "Simplifying Autonomic Enterprise Java Bean Applications Via Model-Driven Development: A Case Study.",
                    "Automated Invariant Maintenance Via OCL Compilation.",
                    "SelfSync: A Dynamic Round-Trip Engineering Environment.",
                    "UML for Document Modeling: Designing Document Structures for Massive and Systematic Production of XML-based Web Contents.",
                    "Metamodel Reuse with MOF.",
                    "Modeling the User Interface of Multimedia Applications.",
                    "An Ontology-Based Approach for Evaluating the Domain Appropriateness and Comprehensibility Appropriateness of Modeling Languages.",
                    "Workshops at the MODELS 2005 Conference.",
                    "Tutorials at the MODELS 2005 Conference.",
                    "Panels at the MODELS 2005 Conference."
                ]
            },
            {
                "sub_name_abbr": "conf/uml/2005se",
                "sub_name": "Satellite Events at the MoDELS 2005 Conference, MoDELS 2005 International Workshops, Doctoral Symposium, Educators Symposium, Montego Bay, Jamaica, October 2-7, 2005, Revised Selected Papers.",
                "count": 43,
                "papers": [
                    "Tool Support for OCL and Related Formalisms - Needs and Trends.",
                    "Lessons Learned from Developing a Dynamic OCL Constraint Enforcement Tool for Java.",
                    "OCL and Graph-Transformations - A Symbiotic Alliance to Alleviate the Frame Problem.",
                    "Report on the 2nd Workshop on Model Development and Validation - MoDeVa.",
                    "Using Process Algebra to Validate Behavioral Aspects of Object-Oriented Models.",
                    "Automated Analysis of Natural Language Properties for UML Models.",
                    "Modeling and Analysis of Real-Time and Embedded Systems.",
                    "Modular Verification of Safe Online-Reconfiguration for Proactive Components in Mechatronic UML.",
                    "Annotating UML Models with Non-functional Properties for Quantitative Analysis.",
                    "Report of the 7th International Workshop on Aspect-Oriented Modeling.",
                    "Modeling Aspect-Oriented Compositions.",
                    "Towards a Generic Aspect Oriented Design Process.",
                    "Model Transformations in Practice Workshop.",
                    "Transforming Models with ATL.",
                    "Practical Declarative Model Transformation with Tefkat.",
                    "Essentials of the 4th UML/MoDELS Workshop in Software Model Engineering (WiSME'2005).",
                    "Bridging Grammarware and Modelware.",
                    "sNets: A First Generation Model Engineering Platform.",
                    "Workshop Report: Model Driven Development of Advanced User Interfaces (MDDAUI).",
                    "Towards Model Driven Engineering of Plastic User Interfaces.",
                    "UML Model Mappings for Platform Independent User Interface Design.",
                    "Workshop on Models for Non-functional Properties of Component-Based Software - NfC.",
                    "Abstraction-Raising Transformation for Generating Analysis Models.",
                    "Explicit Architectural Policies to Satisfy NFRs Using COTS.",
                    "Workshop 9 Summary.",
                    "Addressing Domain Evolution Challenges in Software Product Lines.",
                    "From Requirements Documents to Feature Models for Aspect Oriented Product Line Implementation.",
                    "Use Cases in Model-Driven Software Engineering.",
                    "Use Cases, Actions, and Roles.",
                    "Specifying Precise Use Cases with Use Case Charts.",
                    "Summary of the Educator's Symposium.",
                    "Teaching UML Is Teaching Software Engineering Is Teaching Abstraction.",
                    "Best Practices for Teaching UML Based Software Development.",
                    "MoDELS 2005 Doctoral Symposium Summary.",
                    "Preening: Reflection of Models in the Mirror a Meta-modelling Approach to Generate Reflective Middleware Configurations.",
                    "Transformation-Based Structure Model Evolution.",
                    "Software Hazard Analysis for X-by-Wire Applications.",
                    "Enhancement of Development Technologies for Agent-Based Software Engineering.",
                    "Modeling Reactive Systems and Aspect-Orientation.",
                    "SelfSync: A Dynamic Round-Trip Engineering Environment.",
                    "A Framework for Composable Security Definition, Assurance, and Enforcement.",
                    "Ontology-Based Model Transformation.",
                    "Modeling Turnpike: A Model-Driven Framework for Domain-Specific Software Development."
                ]
            },
            {
                "sub_name_abbr": "conf/uml/2005md",
                "sub_name": "MDDAUI '05, Model Driven Development of Advanced User Interfaces 2005, Proceedings of the MoDELS'05 Workshop on Model Driven Development of Advanced User Interfaces, Montego Bay, Jamaica, October 2, 2005.",
                "count": 9,
                "papers": [
                    "Capturing Common and Variable Design Aspects for Ubiquitous Computing with MB-UID.",
                    "Tool Support for Model-Based Generation of Advanced User Interfaces.",
                    "Extending the Boundaries of Model-Based Development to Account for Errors.",
                    "Integrate Model-driven UI with Business Transformations: Shifting focus of Model-driven UI.",
                    "Towards Model-driven Engineering of Plastic User Interfaces.",
                    "Towards Employing UML Model Mappings for Platform Indepedent User Interface Design.",
                    "Using UML 2.0 and Profiles for Modelling Context-Sensitive User Interfaces.",
                    "Visualization in the Context of Model Driven Engineering.",
                    "Modelling Software Applications and User Interfaces Using Metaphorical Entities."
                ]
            }
        ]
    }
]