[
    {
        "year": "2021",
        "name": "OOPSLA 2021",
        "info": "Virtual Event / Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 5(OOPSLA)",
                "count": 167,
                "papers": [
                    "Cyclic proofs, system t, and the power of contraction.",
                    "Diamonds are not forever: liveness in reactive programming with guarded recursion.",
                    "𝜆ₛ: computable semantics for differentiable programming with higher-order functions and datatypes.",
                    "Verifying observational robustness against a c11-style memory model.",
                    "On algebraic abstractions for concurrent separation logics.",
                    "Efficient and provable local capability revocation using uninitialized capabilities.",
                    "Fully abstract from static to gradual.",
                    "Deciding accuracy of differential privacy schemes.",
                    "A computational interpretation of compact closed categories: reversible programming with negative and fractional types.",
                    "Mechanized logical relations for termination-insensitive noninterference.",
                    "Probabilistic programming semantics for name generation.",
                    "Internalizing representation independence with univalence.",
                    "Transfinite step-indexing for termination.",
                    "Generating collection transformations from proofs.",
                    "Learning the boundary of inductive invariants.",
                    "Precise subtyping for asynchronous multiparty sessions.",
                    "Verifying correct usage of context-free API protocols.",
                    "Provably space-efficient parallel functional programming.",
                    "Data flow refinement type inference.",
                    "Simplifying dependent reductions in the polyhedral model.",
                    "On the semantic expressiveness of recursive types.",
                    "Intrinsically typed compilation with nameless labels.",
                    "egg: Fast and extensible equality saturation.",
                    "Asynchronous effects.",
                    "Modeling and analyzing evaluation cost of CUDA kernels.",
                    "Dijkstra monads forever: termination-sensitive specifications for interaction trees.",
                    "A unifying type-theory for higher-order (amortized) cost analysis.",
                    "Automatic differentiation in PCF.",
                    "An approach to generate correctly rounded math libraries for new floating point variants.",
                    "Semantics-guided synthesis.",
                    "An abstract interpretation for SPMD divergence on reducible control flow graphs.",
                    "Intersection types and (positive) almost-sure termination.",
                    "A separation logic for effect handlers.",
                    "The fine-grained and parallel complexity of andersen's pointer analysis.",
                    "Giving semantics to program-counter labels via secure effects.",
                    "Optimal prediction of synchronization-preserving races.",
                    "A verified optimizer for Quantum circuits.",
                    "Automata and fixpoints for asynchronous hyperproperties.",
                    "Relatively complete verification of probabilistic programs: an expressive language for expectation-based reasoning.",
                    "Verified code generation for the polyhedral model.",
                    "Petr4: formal foundations for p4 data planes.",
                    "Distributed causal memory: modular specification and verification in higher-order distributed separation logic.",
                    "PerSeVerE: persistency semantics for verification under ext4.",
                    "Context-bounded verification of liveness properties for multithreaded shared-memory programs.",
                    "A practical mode system for recursive definitions.",
                    "Formally verified speculation and deoptimization in a JIT compiler.",
                    "Taming x86-TSO persistency.",
                    "Deciding ω-regular properties on linear recurrence sequences.",
                    "Automatically eliminating speculative leaks from cryptographic code with blade.",
                    "A graded dependent type system with a usage-aware semantics.",
                    "The (In)Efficiency of interaction.",
                    "A pre-expectation calculus for probabilistic sensitivity.",
                    "Corpse reviver: sound and efficient gradual typing via contract verification.",
                    "Combining the top-down propagation and bottom-up enumeration for inductive program synthesis.",
                    "Intensional datatype refinement: with application to scalable verification of pattern-match safety.",
                    "Deciding reachability under persistent x86-TSO.",
                    "Functorial semantics for partial theories.",
                    "Paradoxes of probabilistic programming: and how to condition on events of measure zero with infinitesimal probabilities.",
                    "On the complexity of bidirected interleaved Dyck-reachability.",
                    "The taming of the rew: a type theory with computational assumptions.",
                    "Abstracting gradual typing moving forward: precise and space-efficient.",
                    "An order-aware dataflow model for parallel Unix pipelines.",
                    "Getting to the point: index sets and parallelism-preserving autodiff for pointful array programming.",
                    "Of JavaScript AOT compilation performance.",
                    "Generalized evidence passing for effect handlers: efficient compilation of effect handlers to C.",
                    "Symbolic and automatic differentiation of languages.",
                    "Algebras for weighted search.",
                    "Reasoning about effect interaction by fusion.",
                    "Compositional optimizations for CertiCoq.",
                    "Contextual modal types for algebraic effects and handlers.",
                    "Higher-order probabilistic adversarial computations: categorical semantics and program logics.",
                    "Newly-single and loving it: improving higher-order must-alias analysis with heap fragments.",
                    "Efficient tree-traversals: reconciling parallelism and dense data representations.",
                    "Formal verification of a concurrent bounded queue in a weak memory model.",
                    "Steel: proof-oriented programming in a dependently typed concurrent separation logic.",
                    "A theory of higher-order subtyping with type intervals.",
                    "Propositions-as-types and shared state.",
                    "Theorems for free from separation logic specifications.",
                    "Modular, compositional, and executable formal semantics for LLVM IR.",
                    "Catala: a programming language for the law.",
                    "Persistent software transactional memory in Haskell.",
                    "CPS transformation with affine types for call-by-value implicit polymorphism.",
                    "ProbNV: probabilistic verification of network control planes.",
                    "How to evaluate blame for gradual types.",
                    "GhostCell: separating permissions from data in Rust.",
                    "Distributing intersection and union types with splits and duality (functional pearl).",
                    "Automatic amortized resource analysis with the Quantum physicist's method.",
                    "On continuation-passing transformations and expected cost analysis.",
                    "Skipping the binder bureaucracy with mixed embeddings in a semantics course (functional pearl).",
                    "Calculating dependently-typed compilers (functional pearl).",
                    "Grafs: declarative graph analytics.",
                    "An existential crisis resolved: type inference for first-class existential types.",
                    "Client-server sessions in linear logic.",
                    "Certifying the synthesis of heap-manipulating programs.",
                    "Deriving efficient program transformations from rewrite rules.",
                    "Reasoning about the garden of forking paths.",
                    "Static detection of silent misconfigurations with deep interaction analysis.",
                    "Data-driven abductive inference of library specifications.",
                    "What we eval in the shadows: a large-scale study of eval in R programs.",
                    "ECROs: building global scale systems from sequential code.",
                    "Reconciling optimization with secure compilation.",
                    "Compilation of sparse array programming models.",
                    "Making pointer analysis more precise by unleashing the power of selective context sensitivity.",
                    "VESPA: static profiling for binary optimization.",
                    "SimTyper: sound type inference for Ruby using type equality prediction.",
                    "LooPy: interactive program synthesis with control structures.",
                    "A multiparty session typing discipline for fault-tolerant event-driven distributed programming.",
                    "Much ADO about failures: a fault-aware model for compositional verification of strongly consistent distributed systems.",
                    "Efficient compilation of algebraic effect handlers.",
                    "Copy-and-patch compilation: a fast compilation algorithm for high-level languages and bytecode.",
                    "Programming and execution models for parallel bounded exhaustive testing.",
                    "Interpretable noninterference measurement and its application to processor designs.",
                    "Reachability types: tracking aliasing and separation in higher-order functional programs.",
                    "Rewrite rule inference using equality saturation.",
                    "Type stability in Julia: avoiding performance pathologies in JIT compilation.",
                    "Multi-modal program inference: a marriage of pre-trained language models and component-based synthesis.",
                    "Fully automated functional fuzzing of Android apps for detecting non-crashing logic bugs.",
                    "SecRSL: security separation logic for C11 release-acquire concurrency.",
                    "Generative type-aware mutation for testing SMT solvers.",
                    "Modular specification and verification of closures in Rust.",
                    "Synthesizing contracts correct modulo a test generator.",
                    "Well-typed programs can go wrong: a study of typing-related bugs in JVM compilers.",
                    "Specifying and testing GPU workgroup progress models.",
                    "Study of the subtyping machine of nominal subtyping with variance.",
                    "A derivative-based parser generator for visibly Pushdown grammars.",
                    "Automatic migration from synchronous to asynchronous JavaScript APIs.",
                    "Compacting points-to sets through object clustering.",
                    "Durable functions: semantics for stateful serverless.",
                    "Semantic programming by example with pre-trained models.",
                    "UDF to SQL translation through compositional lazy inductive synthesis.",
                    "Permchecker: a toolchain for debugging memory managers with typestate.",
                    "Rich specifications for Ethereum smart contract verification.",
                    "Making weak memory models fair.",
                    "The semantics of shared memory in Intel CPU/FPGA systems.",
                    "Coarsening optimization for differentiable programming.",
                    "APIfix: output-oriented program synthesis for combating breaking changes in libraries.",
                    "Transitioning from structural to nominal code with efficient gradual typing.",
                    "Generalizable synthesis through unification.",
                    "One down, 699 to go: or, synthesising compositional desugarings.",
                    "The reads-from equivalence for the TSO and PSO memory models.",
                    "JavaDL: automatically incrementalizing Java bug pattern detection.",
                    "How statically-typed functional programmers write code.",
                    "Scalability and precision by combining expressive type systems and deductive verification.",
                    "Program analysis via efficient symbolic abstraction.",
                    "Dynaplex: analyzing program complexity using dynamically inferred recurrence relations.",
                    "Compiling with continuations, correctly.",
                    "Promises are made to be broken: migrating R to strict semantics.",
                    "Efficient automatic scheduling of imaging and vision pipelines for the GPU.",
                    "Gauss: program synthesis by reasoning over graphs.",
                    "QuickSilver: modeling and parameterized verification for distributed agreement-based systems.",
                    "SpecSafe: detecting cache side channels in a speculative world.",
                    "Label dependent lambda calculus and gradual typing.",
                    "Not so fast: understanding and mitigating negative impacts of compiler optimizations on code reuse gadget sets.",
                    "FPL: fast Presburger arithmetic through transprecision.",
                    "Translating C to safer Rust.",
                    "Relational nullable types with Boolean unification.",
                    "LXM: better splittable pseudorandom number generators (and almost as fast).",
                    "Safer at any speed: automatic context-aware safety enhancement for Rust.",
                    "Verifying concurrent multicopy search structures.",
                    "Formal verification of high-level synthesis.",
                    "Synbit: synthesizing bidirectional programs using unidirectional sketches.",
                    "Statically bounded-memory delayed sampling for probabilistic streams.",
                    "Solver-based gradual type migration.",
                    "Symbolic value-flow static analysis: deep, precise, complete modeling of Ethereum smart contracts.",
                    "A type system for extracting functional specifications from memory-safe imperative programs.",
                    "Gradually structured data.",
                    "MonkeyDB: effectively testing correctness under weak isolation levels."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "OOPSLA 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 4(OOPSLA)",
                "count": 233,
                "papers": [
                    "Taylor subsumes Scott, Berry, Kahn and Plotkin.",
                    "Deductive verification with ghost monitors.",
                    "Dependent type systems as macros.",
                    "The next 700 relational program logics.",
                    "Complexity and information in invariant inference.",
                    "Actris: session-type based reasoning in separation logic.",
                    "Formal verification of a constant-time preserving C compiler.",
                    "Coq Coq correct! verification of type checking and erasure for Coq, in Coq.",
                    "Undecidability of d<:  and its decidable fragments.",
                    "Incorrectness logic.",
                    "Persistency semantics of the Intel-x86 architecture.",
                    "Program synthesis by type-guided abstraction refinement.",
                    "Reductions for safety proofs.",
                    "Deterministic parallel fixpoint computation.",
                    "Recurrence extraction for functional programs through call-by-push-value.",
                    "Towards verified stochastic variational inference for probabilistic programs.",
                    "Fast, sound, and effectively complete dynamic race prediction.",
                    "Par means parallel: multiplicative linear logic proofs as concurrent functional programs.",
                    "Trace types and denotational semantics for sound programmable inference in probabilistic languages.",
                    "Virtual timeline: a formal abstraction for verifying preemptive schedulers with temporal isolation.",
                    "Relational proofs for quantum programs.",
                    "Seminaïve evaluation for a higher-order functional language.",
                    "CompCertM: CompCert with C-assembly linking and lightweight modular verification.",
                    "Liquidate your assets: reasoning about resource usage in liquid Haskell.",
                    "Proving expected sensitivity of probabilistic programs with randomized variable-dependent termination time.",
                    "Parameterized verification under TSO is PSPACE-complete.",
                    "The weak call-by-value λ-calculus is reasonable for both time and space.",
                    "Abstract extensionality: on the properties of incomplete abstract interpretations.",
                    "What is decidable about gradual types?",
                    "Decomposition diversity with symmetric data and codata.",
                    "Reduction monads and their signatures.",
                    "The high-level benefits of low-level sandboxing.",
                    "Spy game: verifying a local generic solver in Iris.",
                    "RustBelt meets relaxed memory.",
                    "Deciding memory safety for single-pass heap-manipulating programs.",
                    "Optimal approximate sampling from discrete probability distributions.",
                    "Aiming low is harder: induction for lower bounds in probabilistic program verification.",
                    "A simple differentiable programming language.",
                    "PλωNK: functional probabilistic NetKAT.",
                    "Partial type constructors: or, making ad hoc datatypes less ad hoc.",
                    "Stacked borrows: an aliasing model for Rust.",
                    "Abstract interpretation of distributed network control planes.",
                    "Executable formal semantics for the POSIX shell.",
                    "Mechanized semantics and verified compilation for a dataflow synchronous language with reset.",
                    "The future is ours: prophecy variables in separation logic.",
                    "Graduality and parametricity: together again for the first time.",
                    "Disentanglement in nested-parallel programs.",
                    "Binders by day, labels by night: effect instances via lexically scoped handlers.",
                    "Visualization by example.",
                    "A language for probabilistically oblivious computation.",
                    "Interaction trees: representing recursive and impure programs in Coq.",
                    "Synthesizing replacement classes.",
                    "Kind inference for datatypes.",
                    "Synthesis of coordination programs from linear temporal specifications.",
                    "A probabilistic separation logic.",
                    "Augmented example-based synthesis using relational perturbation properties.",
                    "Semantics of higher-order probabilistic programs with conditioning.",
                    "The fire triangle: how to mix substitution, dependent elimination, and effects.",
                    "SyTeCi: automating contextual equivalence for higher-order programs with references.",
                    "Detecting floating-point errors via atomic conditions.",
                    "Guarded Kleene algebra with tests: verification of uninterpreted programs in nearly linear time.",
                    "Provenance-guided synthesis of Datalog programs.",
                    "Full abstraction for the quantum lambda-calculus.",
                    "Backpropagation in the simply typed lambda-calculus with linear negation.",
                    "Does blame shifting work?",
                    "Decidable subtyping for path dependent types.",
                    "Label-dependent session types.",
                    "Pointer life cycle types for lock-free data structures with memory reclamation.",
                    "APL since 1978.",
                    "Thriving in a crowded and changing world: C++ 2006-2020.",
                    "A history of Clojure.",
                    "History of coarrays and SPMD parallelism in Fortran.",
                    "Origins of the D programming language.",
                    "Evolution of Emacs Lisp.",
                    "The early history of F#.",
                    "A history of the Groovy programming language.",
                    "JavaScript: the first 20 years.",
                    "LabVIEW.",
                    "History of Logo.",
                    "Hygienic macro technology.",
                    "A history of MATLAB.",
                    "The origins of Objective-C at PPI/Stepstone and its evolution at NeXT.",
                    "A history of the Oz multiparadigm language.",
                    "S, R, and data science.",
                    "The evolution of Smalltalk: from Smalltalk-72 through Squeak.",
                    "The history of Standard ML.",
                    "Verilog HDL and its ancestors and descendants.",
                    "A general approach to define binders using matching logic.",
                    "A quick look at impredicativity.",
                    "A unified view of modalities in type systems.",
                    "A dependently typed calculus with pattern matching and erasure inference.",
                    "Achieving high-performance the functional way: a functional pearl on expressing high-performance optimizations as rewrite strategies.",
                    "Compiling effect handlers in capability-passing style.",
                    "Composing and decomposing op-based CRDTs with semidirect products.",
                    "Computation focusing.",
                    "Cosmo: a concurrent separation logic for multicore OCaml.",
                    "Denotational recurrence extraction for amortized analysis.",
                    "Duplo: a framework for OCaml post-link optimisation.",
                    "Effect handlers, evidently.",
                    "Effects for efficiency: asymptotic speedup with first-class control.",
                    "Elaboration with first-class implicit function types.",
                    "Higher-order demand-driven symbolic evaluation.",
                    "Kindly bent to free us.",
                    "Kinds are calling conventions.",
                    "Liquid information flow control.",
                    "Liquid resource types.",
                    "Lower your guards: a compositional pattern-match coverage checker.",
                    "Parsing with zippers (functional pearl).",
                    "Program sketching with live bidirectional evaluation.",
                    "Raising expectations: automating expected cost analysis with types.",
                    "Recovering purity with comonads and capabilities.",
                    "Regular language type inference with term rewriting.",
                    "Retrofitting parallelism onto OCaml.",
                    "Scala step-by-step: soundness for DOT with step-indexed logical relations in Iris.",
                    "Sealing pointer-based optimizations behind pure functions.",
                    "Separation logic for sequential programs (functional pearl).",
                    "Signature restriction for polymorphic algebraic effects.",
                    "Sparcl: a language for partially-invertible computation.",
                    "Stable relations and abstract interpretation of higher-order programs.",
                    "Staged selective parser combinators.",
                    "SteelCore: an extensible concurrent separation logic for effectful dependently typed programs.",
                    "Strong functional pearl: Harper's regular-expression matcher in Cedille.",
                    "TLC: temporal logic of distributed components.",
                    "The simple essence of algebraic subtyping: principal type inference with subtyping made easy (functional pearl).",
                    "Fixpoints for the masses: programming with first-class Datalog constraints.",
                    "Effects as capabilities: effect handlers and lightweight effect polymorphism.",
                    "A systematic approach to deriving incremental type checkers.",
                    "Proving highly-concurrent traversals correct.",
                    "Certified and efficient instruction scheduling: application to interlocked VLIW processors.",
                    "Enabling accuracy-aware Quantum compilers using symbolic resource estimation.",
                    "Semiring optimizations: dynamic elision of expressions with identity and absorbing elements.",
                    "Can advanced type systems be usable? An empirical study of ownership, assets, and typestate in Obsidian.",
                    "Assertion-based optimization of Quantum programs.",
                    "Multiparty motion coordination: from choreographies to robotics programs.",
                    "Automated policy synthesis for system call sandboxing.",
                    "How do programmers use unsafe rust?",
                    "Learning semantic program embeddings with graph interval neural network.",
                    "Mossad: defeating software plagiarism detection.",
                    "Handling bidirectional control flow.",
                    "Scaling exact inference for discrete probabilistic programs.",
                    "Formulog: Datalog for SMT-based static analysis.",
                    "Precise inference of expressive units of measurement types.",
                    "WATCHER: in-situ failure diagnosis.",
                    "A model for detecting faults in build specifications.",
                    "Guided linking: dynamic linking without the costs.",
                    "Satune: synthesizing efficient SAT encoders.",
                    "Exposing cache timing side-channel leaks through out-of-order symbolic execution.",
                    "Statically verified refinements for multiparty protocols.",
                    "Featherweight go.",
                    "Projection-based runtime assertions for testing and debugging Quantum programs.",
                    "Persistent Owicki-Gries reasoning: a program logic for reasoning about persistent programs on Intel-x86.",
                    "Igloo: soundly linking compositional refinement and separation logic for distributed system verification.",
                    "DiffStream: differential output testing for stream processing programs.",
                    "Polymorphic types and effects with Boolean unification.",
                    "CAMP: cost-aware multiparty session protocols.",
                    "The anchor verifier for blocking and non-blocking concurrent software.",
                    "Automatic and efficient variability-aware lifting of functional programs.",
                    "A sparse iteration space transformation framework for sparse tensor algebra.",
                    "Programming with a read-eval-synth loop.",
                    "LiveDroid: identifying and preserving mobile app state in volatile runtime environments.",
                    "Towards a unified proof framework for automated fixpoint reasoning using matching logic.",
                    "Adversarial examples for models of code.",
                    "Towards a formal foundation of intermittent computing.",
                    "Compiling symbolic execution with staging and algebraic effects.",
                    "Testing differential privacy with dual interpreters.",
                    "Verifying and improving Halide's term rewriting system with program synthesis.",
                    "Dynamic dispatch of context-sensitive optimizations.",
                    "Eliminating abstraction overhead of Java stream pipelines using ahead-of-time program optimization.",
                    "Build scripts with perfect dependencies.",
                    "Deductive optimization of relational data storage.",
                    "Program equivalence for assisted grading of functional programs.",
                    "A modular cost analysis for probabilistic programs.",
                    "Geometry types for graphics programming.",
                    "Hidden inheritance: an inline caching design for TypeScript performance.",
                    "A type-and-effect system for object initialization.",
                    "Sound garbage collection for C using pointer provenance.",
                    "Dataflow-based pruning for speeding up superoptimization.",
                    "FlowCFL: generalized type-based reachability analysis: graph reduction and equivalence of CFL-based and type-based reachability.",
                    "Learning graph-based heuristics for pointer analysis without handcrafting application-specific features.",
                    "Knowing when to ask: sound scheduling of name resolution in type checkers derived from declarative specifications.",
                    "Designing types for R, empirically.",
                    "Shiftry: RNN inference in 2KB of RAM.",
                    "StreamQL: a query language for processing streaming time series.",
                    "Incremental predicate analysis for regression verification.",
                    "Perfectly parallel fairness certification of neural networks.",
                    "Fuzzing channel-based concurrency runtimes using types and effects.",
                    "Detecting locations in JavaScript programs affected by breaking library changes.",
                    "Rethinking safe consistency in distributed object-oriented programming.",
                    "DynamiTe: dynamic termination and non-termination proofs.",
                    "Precise static modeling of Ethereum \"memory\".",
                    "Taming type annotations in gradual typing.",
                    "Inter-theory dependency analysis for SMT string solvers.",
                    "On the unusual effectiveness of type-aware operator mutations for testing SMT solvers.",
                    "Pomsets with preconditions: a simple model of relaxed memory.",
                    "Fast linear programming through transprecision computing on small and sparse data.",
                    "Random testing for C and C++ compilers with YARPGen.",
                    "CompCertELF: verified separate compilation of C programs into ELF object files.",
                    "Scalable and serializable networked multi-actor programming.",
                    "Termination analysis for evolving programs: an incremental approach by reusing certified modules.",
                    "Programming and reasoning with partial observability.",
                    "Interactive synthesis of temporal specifications from examples and natural language.",
                    "A large-scale longitudinal study of flaky tests.",
                    "Differentially-private software frequency profiling under linear constraints.",
                    "Do you have space for dessert? a verified space cost semantics for CakeML programs.",
                    "Digging for fold: synthesis-aided API discovery for Haskell.",
                    "Resolution as intersection subtyping via Modus Ponens.",
                    "World age in Julia: optimizing method dispatch in the presence of eval.",
                    "ιDOT: a DOT calculus with object initialization.",
                    "Taming callbacks for smart contract modularity.",
                    "Testing consensus implementations using communication closure.",
                    "Finding bugs in database systems via query partitioning.",
                    "Structure interpretation of text formats.",
                    "Programming at the edge of synchrony.",
                    "Actor concurrency bugs: a comprehensive study on symptoms, root causes, API usages, and differences.",
                    "A structural model for contextual code changes.",
                    "Verifying replicated data types with typeclass refinements in Liquid Haskell.",
                    "Unifying execution of imperative generators and declarative specifications.",
                    "Regex matching with counting-set automata.",
                    "Feedback-driven semi-supervised synthesis of program transformations.",
                    "Contextual dispatch for function specialization.",
                    "Counterexample-guided correlation algorithm for translation validation.",
                    "Adding interactive visual syntax to textual code.",
                    "Revisiting iso-recursive subtyping.",
                    "Guiding dynamic programing via structural probability for accelerating programming by example.",
                    "Neural reverse engineering of stripped binaries using augmented control flow graphs.",
                    "Foundations of empirical memory consistency testing.",
                    "Just-in-time learning for bottom-up enumerative synthesis.",
                    "Gradual verification of recursive heap data structures.",
                    "Macros for domain-specific languages.",
                    "Learning-based controlled concurrency testing.",
                    "TacTok: semantics-aware proof synthesis.",
                    "Koord: a language for programming and verifying distributed robotics application.",
                    "Flow2Vec: value-flow-based precise code embedding."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "OOPSLA 2019",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 3(OOPSLA)",
                "count": 189,
                "papers": [
                    "Higher inductive types in cubical computational type theory.",
                    "Constructing quotient inductive-inductive types.",
                    "Definitional proof-irrelevance without K.",
                    "Bisimulation as path type for guarded recursive types.",
                    "Abstraction-safe effect handlers via tunneling.",
                    "Abstracting algebraic effects.",
                    "Intersection types and runtime errors in the pi-calculus.",
                    "Principality and approximation under dimensional bound.",
                    "Sound and complete bidirectional typechecking for higher-rank polymorphism with existentials and indexed types.",
                    "Fully abstract module compilation.",
                    "Polymorphic symmetric multiple dispatch with variance.",
                    "Abstracting extensible data types: or, rows by any other name.",
                    "Type-guided worst-case input generation.",
                    "Live functional programming with typed holes.",
                    "Gradual type theory.",
                    "Gradual typing: a new perspective.",
                    "Gradual parametricity, revisited.",
                    "Dynamic type inference for gradual Hindley-Milner typing.",
                    "StkTokens: enforcing well-bracketed control flow and stack encapsulation using linear capabilities.",
                    "Modalities, cohesion, and information flow.",
                    "Familial monads and structural operational semantics.",
                    "Bindings as bounded natural functors.",
                    "Categorical combinatorics of scheduling and synchronization in game semantics.",
                    "Better late than never: a fully-abstract semantics for classical processes.",
                    "Diagrammatic algebra: from linear to concurrent systems.",
                    "Fixpoint games on continuous lattices.",
                    "Two sides of the same coin: session types and game semantics: a synchronous side and an asynchronous side.",
                    "Exceptional asynchronous session types: session types without tiers.",
                    "Distributed programming using role-parametric session types in go: statically-typed endpoint APIs for dynamically-instantiated communication structures.",
                    "Less is more: multiparty session types revisited.",
                    "Quantitative robustness analysis of quantum programs.",
                    "Game semantics for quantum programming.",
                    "Quantum relational Hoare logic.",
                    "Quantitative separation logic: a logic for reasoning about probabilistic pointer programs.",
                    "Probabilistic programming with densities in SlicStan: efficient, flexible, and deterministic.",
                    "A domain theory for statistical probabilistic programming.",
                    "Bayesian synthesis of probabilistic programs for automatic data modeling.",
                    "Formal verification of higher-order probabilistic programs: reasoning about approximation, convergence, Bayesian inference, and optimization.",
                    "Trace abstraction modulo probability.",
                    "code2vec: learning distributed representations of code.",
                    "An abstract domain for certifying neural networks.",
                    "A²I: abstract² interpretation.",
                    "Concerto: a framework for combined concrete and abstract interpretation.",
                    "Skeletal semantics and their interpretations.",
                    "Refinement of path expressions for static analysis.",
                    "Decidable verification of uninterpreted programs.",
                    "Inferring frame conditions with static correlation analysis.",
                    "Context-, flow-, and field-sensitive data-flow analysis using synchronized Pushdown systems.",
                    "Decision procedures for path feasibility of string-manipulating programs with complex operations.",
                    "Modular quantitative monitoring.",
                    "Bounded model checking of signal temporal logic properties using syntactic separation.",
                    "Adventures in monitorability: from branching to linear time and back again.",
                    "Efficient parameterized algorithms for data packing.",
                    "Fast and exact analysis for LRU caches.",
                    "Closed forms for numerical loops.",
                    "Efficient automated repair of high floating-point errors in numerical libraries.",
                    "A true positives theorem for a static race detector.",
                    "Decoupling lock-free data structures from memory reclamation for static analysis.",
                    "Pretend synchrony: synchronous verification of asynchronous distributed programs.",
                    "Weak-consistency specification via visibility relaxation.",
                    "A calculus for Esterel: if can, can. if no can, no can.",
                    "An abstract stack based approach to verified compositional compilation to machine code.",
                    "A verified, efficient embedding of a verifiable assembly language.",
                    "A separation logic for concurrent randomized programs.",
                    "Iron: managing obligations in higher-order concurrent separation logic.",
                    "JaVerT 2.0: compositional symbolic execution for JavaScript.",
                    "Exploring C semantics and pointer provenance.",
                    "On library correctness under weak memory consistency: specifying and verifying concurrent libraries under declarative consistency models.",
                    "Bridging the gap between programming languages and hardware weak memory models.",
                    "Grounding thin-air reads with event structures.",
                    "ISA semantics for ARMv8-a, RISC-v, and CHERI-MIPS.",
                    "Structuring the synthesis of heap-manipulating programs.",
                    "FrAngel: component-based synthesis with control structures.",
                    "Hamsaz: replication coordination analysis and synthesis.",
                    "LWeb: information flow security for multi-tier web applications.",
                    "From fine- to coarse-grained dynamic information flow control and back.",
                    "CT-wasm: type-driven secure cryptography for the web ecosystem.",
                    "Rebuilding racket on chez scheme (experience report).",
                    "Compiling with continuations, or without? whatever.",
                    "Lambda calculus with algebraic simplification for reduction parallelization by equational reasoning.",
                    "Fairness in responsive parallelism.",
                    "Narcissus: correct-by-construction derivation of decoders and encoders from binary formats.",
                    "Closure conversion is safe for space.",
                    "Linear capabilities for fully abstract compilation of separation-logic-verified code.",
                    "The next 700 compiler correctness theorems (functional pearl).",
                    "Equations reloaded: high-level dependently-typed functional programming and proving in Coq.",
                    "Cubical agda: a dependently typed programming language with univalence and higher inductive types.",
                    "Approximate normalization for gradual dependent types.",
                    "Simple noninterference from parametricity.",
                    "Selective applicative functors.",
                    "Coherence of type class resolution.",
                    "Relational cost analysis for functional-imperative programs.",
                    "Fuzzi: a three-level logic for differential privacy.",
                    "Synthesizing differentially private programs.",
                    "Synthesizing symmetric lenses.",
                    "Demystifying differentiable programming: shift/reset the penultimate backpropagator.",
                    "Efficient differentiable programming in a functional array-processing language.",
                    "From high-level inference algorithms to efficient code.",
                    "Sound and robust solid modeling via exact real arithmetic and continuity.",
                    "Dependently typed Haskell in industry (experience report).",
                    "A role for dependent types in Haskell.",
                    "Higher-order type-level programming in Haskell.",
                    "A predicate transformer semantics for effects (functional pearl).",
                    "Dijkstra monads for all.",
                    "Mechanized relational verification of concurrent programs with continuations.",
                    "Sequential programming for replicated data stores.",
                    "Implementing a modal dependent type theory.",
                    "A reasonably exceptional type theory.",
                    "Simply RaTT: a fitch-style modal calculus for reactive programming without space leaks.",
                    "Quantitative program reasoning with graded modal types.",
                    "Mixed linear and non-linear recursive types.",
                    "A mechanical formalization of higher-ranked polymorphic type inference.",
                    "An efficient algorithm for type-safe structural diffing.",
                    "Call-by-need is clairvoyant call-by-value.",
                    "Teaching the art of functional programming using automated grading (experience report).",
                    "Lambda: the ultimate sublanguage (experience report).",
                    "CLOTHO: directed test generation for weakly consistent database systems.",
                    "Probabilistic verification of fairness properties via concentration.",
                    "Verifying safety and accuracy of approximate parallel programs via canonical sequentialization.",
                    "Qubit allocation as a combination of subgraph isomorphism and token swapping.",
                    "Modular verification of heap reachability properties in separation logic.",
                    "Complete monitors for gradual types.",
                    "TLA+ model checking made symbolic.",
                    "Value-centric dynamic partial order reduction.",
                    "Seq: a high-performance language for bioinformatics.",
                    "Staged abstract interpreters: fast and modular whole-program analysis via meta-programming.",
                    "Derivative grammars: a symbolic approach to parsing with derivatives.",
                    "Efficient lock-free durable sets.",
                    "Modular verification for almost-sure termination of probabilistic programs.",
                    "IVT: an efficient method for sharing subtype polymorphic objects.",
                    "Refinement kinds: type-safe programming with practical type-level computation.",
                    "Program synthesis with algebraic library specifications.",
                    "Weakening WebAssembly.",
                    "Generating a fluent API with syntax checking from an LR grammar.",
                    "Weak persistency semantics from the ground up: formalising the persistency semantics of ARMv8 and transactional models.",
                    "DeepSEA: a language for certified system software.",
                    "BDA: practical dependence analysis for binary executables by unbiased whole-program path sampling and per-path abstract interpretation.",
                    "Asphalion: trustworthy shielding against Byzantine faults.",
                    "Automatic repair of regular expressions.",
                    "Static analysis with demand-driven value refinement.",
                    "Relational verification using reinforcement learning.",
                    "A formalization of Java's concurrent access modes.",
                    "On the fly synthesis of edit suggestions.",
                    "A fault-tolerant programming model for distributed interactive applications.",
                    "A path to DOT: formalizing fully path-dependent types.",
                    "Reliable and fast DWARF-based stack unwinding.",
                    "Leveraging rust types for modular specification and verification.",
                    "Precision-preserving yet fast object-sensitive pointer analysis with partial context sensitivity.",
                    "Formal foundations of serverless computing.",
                    "Optimal stateless model checking for reads-from equivalence under sequential consistency.",
                    "Modular verification of web page layout.",
                    "Aroma: code recommendation via structural code search.",
                    "On the design, implementation, and use of laziness in R.",
                    "Mergeable replicated data types.",
                    "Compiler fuzzing: how much does it matter?",
                    "DProf: distributed profiler with strong guarantees.",
                    "Precise reasoning with structured time, structured heaps, and collective operations.",
                    "Casting about in the dark: an empirical study of cast operations in Java programs.",
                    "Getafix: learning to fix bugs automatically.",
                    "Generating precise error specifications for C: a zero shot learning approach.",
                    "Specifying concurrent programs in separation logic: morphisms and simulations.",
                    "Improving bug detection via context-based code representation learning and attention-based neural networks.",
                    "Scala implicits are everywhere: a large-scale study of the use of Scala implicits in the wild.",
                    "Optimization of swift protocols.",
                    "On the complexity of checking transactional consistency.",
                    "System FR: formalized foundations for the stainless verifier.",
                    "Language-integrated privacy-aware distributed queries.",
                    "AutoPandas: neural-backed generators for program synthesis.",
                    "Ryū revisited: printf floating point conversion.",
                    "IntelliMerge: a refactoring-aware software merging technique.",
                    "Certifying graph-manipulating C programs via localizations within data structures.",
                    "Duet: an expressive higher-order language and linear type system for statically enforcing differential privacy.",
                    "Effective lock handling in stateless model checking.",
                    "FuzzFactory: domain-specific fuzzing with waypoints.",
                    "AL: autogenerating supervised learning programs.",
                    "Sound and reusable components for abstract interpretation.",
                    "Design, implementation, and application of GPU-based Java bytecode interpreters.",
                    "Specification and inference of trace refinement relations.",
                    "Dependence-aware, unbounded sound predictive race detection.",
                    "Trace aware random testing for distributed systems.",
                    "Coverage guided, property based testing.",
                    "PlanAlyzer: assessing threats to the validity of online experiments.",
                    "I/O dependent idempotence bugs in intermittent systems.",
                    "Initialize once, start fast: application initialization at build time.",
                    "Safer smart contract programming with Scilla.",
                    "ApproxHPVM: a portable compiler IR for accuracy-aware optimizations.",
                    "Reflection-aware static regression test selection.",
                    "Automatic and scalable detection of logical errors in functional programming assignments.",
                    "Detecting nondeterministic payment bugs in Ethereum smart contracts."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "OOPSLA 2018",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 2(OOPSLA)",
                "count": 166,
                "papers": [
                    "Synthesizing bijective lenses.",
                    "WebRelate: integrating web data with spreadsheets using examples.",
                    "What is decidable about string constraints with the ReplaceAll function.",
                    "String constraints with concatenation and transducers solved efficiently.",
                    "Linear Haskell: practical linearity in a higher-order polymorphic language.",
                    "Polyadic approximations, fibrations and intersection types.",
                    "Handling fibred algebraic effects.",
                    "Handle with care: relational interpretation of algebraic effects and handlers.",
                    "Automated lemma synthesis in symbolic-heap separation logic.",
                    "Foundations for natural proofs and quantifier instantiation.",
                    "Higher-order constrained horn clauses for verification.",
                    "Relatively complete refinement type system for verification of higher-order non-deterministic programs.",
                    "Unifying analytic and statically-typed quasiquotes.",
                    "Jones-optimal partial evaluation by specialization-safe normalization.",
                    "Migrating gradual types.",
                    "Intrinsically-typed definitional interpreters for imperative languages.",
                    "Effective stateless model checking for C/C++ concurrency.",
                    "Transactions in relaxed memory architectures.",
                    "Simplifying ARM concurrency: multicopy-atomic axiomatic and operational models for ARMv8.",
                    "Progress of concurrent objects with partial methods.",
                    "A principled approach to ornamentation in ML.",
                    "Type-preserving CPS translation of Σ and Π types is not not possible.",
                    "Decidability of conversion for type theory in type theory.",
                    "Safety and conservativity of definitions in HOL and Isabelle/HOL.",
                    "Sound, complete, and tractable linearizability monitoring for concurrent collections.",
                    "Reducing liveness to safety in first-order logic.",
                    "Alone together: compositional reasoning and inference for weak isolation.",
                    "Programming and proving with distributed protocols.",
                    "Inference of static semantics for incomplete C programs.",
                    "Optimal Dyck reachability for data-dependence and alias analysis.",
                    "Data-centric dynamic partial order reduction.",
                    "Analytical modeling of cache behavior for affine programs.",
                    "A new proof rule for almost-sure termination.",
                    "Lexicographic ranking supermartingales: an efficient approach to termination of probabilistic programs.",
                    "Algorithmic analysis of termination problems for quantum programs.",
                    "Monadic refinements for relational cost analysis.",
                    "Go with the flow: compositional abstractions for concurrent data structures.",
                    "Parametricity versus the universal type.",
                    "Linearity in higher-order recursion schemes.",
                    "Symbolic types for lenient symbolic execution.",
                    "An axiomatic basis for bidirectional programming.",
                    "Simplicitly: foundations and applications of implicit function types.",
                    "Up-to techniques using sized types.",
                    "Univalent higher categories via complete Semi-Segal types.",
                    "Generating good generators for inductive relations.",
                    "Why is random testing effective for partition tolerance bugs?",
                    "On automatically proving the correctness of math.h implementations.",
                    "Online detection of effectively callback free objects with applications to smart contracts.",
                    "Correctness of speculative optimizations with dynamic deoptimization.",
                    "JaVerT: JavaScript verification toolchain.",
                    "Soft contract verification for higher-order stateful programs.",
                    "Collapsing towers of interpreters.",
                    "Refinement reflection: complete verification with SMT.",
                    "Non-linear reasoning for invariant synthesis.",
                    "A practical construction for decomposing numerical abstract domains.",
                    "Verifying equivalence of database-driven applications.",
                    "Proving expected sensitivity of probabilistic programs.",
                    "Synthesizing coupling proofs of differential privacy.",
                    "Measurable cones and stable, measurable functions: a model for probabilistic higher-order programming.",
                    "Denotational validation of higher-order Bayesian inference.",
                    "Strategy synthesis for linear arithmetic games.",
                    "Bonsai: synthesis-based reasoning for type systems.",
                    "Program synthesis using abstraction refinement.",
                    "A logical relation for monadic encapsulation of state: proving contextual equivalences in the presence of runST.",
                    "Recalling a witness: foundations and applications of monotonic state.",
                    "RustBelt: securing the foundations of the rust programming language.",
                    "Versatile event correlation with algebraic effects.",
                    "Parametric polymorphism and operational improvement.",
                    "Handling delimited continuations with dependent types.",
                    "The simple essence of automatic differentiation.",
                    "A spectrum of type soundness and performance.",
                    "Compositional soundness proofs of abstract interpreters.",
                    "Graduality from embedding-projection pairs.",
                    "Incremental relational lenses.",
                    "Elaborating dependent (co)pattern matching.",
                    "Capturing the future by replaying the past (functional pearl).",
                    "MoSeL: a general, extensible modal framework for interactive proofs in separation logic.",
                    "Mtac2: typed tactics for backward reasoning in Coq.",
                    "Build systems à la carte.",
                    "Synthesizing quotient lenses.",
                    "Finitary polymorphism for optimizing type-directed compilation.",
                    "Teaching how to program using automated assessment and functional glossy games (experience report).",
                    "Functional programming for modular Bayesian inference.",
                    "What you needa know about Yoneda: profunctor optics and the Yoneda lemma (functional pearl).",
                    "Generic deriving of generic traversals.",
                    "Relational algebra by way of adjunctions.",
                    "Contextual equivalence for a probabilistic language with continuous random variables and recursion.",
                    "Strict and lazy semantics for effects: layering monads and comonads.",
                    "Ready, set, verify! applying hs-to-coq to real-world Haskell code (experience report).",
                    "A type and scope safe universe of syntaxes with binding: their semantics and proofs.",
                    "Parallel complexity analysis with temporal session types.",
                    "Equivalences for free: univalent parametricity for effective transport.",
                    "Prototyping a functional language using higher-order logic programming: a functional pearl on learning the ways of λProlog/Makam.",
                    "Tight typings and split bounds.",
                    "Competitive parallelism: getting your priorities right.",
                    "Fault tolerant functional reactive programming (functional pearl).",
                    "Static interpretation of higher-order modules in Futhark: functional GPU programming in the large.",
                    "Casts and costs: harmonizing safety and performance in gradual typing.",
                    "Functional programming for compiling and decompiling computer-aided design.",
                    "Partially-static data as free extension of algebras.",
                    "What's the difference? a functional pearl on subtracting bijections.",
                    "Keep your laziness in check.",
                    "Merlin: a language server for OCaml (experience report).",
                    "Generic zero-cost reuse for dependent types.",
                    "Refunctionalization of abstract abstract machines: bridging the gap between abstract abstract machines and abstract definitional interpreters (functional pearl).",
                    "Reasonably programmable literal notation.",
                    "Thread-safe reactive programming.",
                    "Parallelization of dynamic languages: synchronizing built-in collections.",
                    "Virtual machine design for parallel dynamic programming languages.",
                    "goSLP: globally optimized superword level parallelism framework.",
                    "Effect handlers for the masses.",
                    "Empowering union and intersection types with integrated subtyping.",
                    "Julia subtyping: a rational reconstruction.",
                    "Scopes as types.",
                    "A derivation framework for dependent security label inference.",
                    "MadMax: surviving out-of-gas conditions in Ethereum smart contracts.",
                    "Faster variational execution with transparent bytecode transformation.",
                    "Secure serverless computing using dynamic information flow control.",
                    "AnyDSL: a partial evaluation framework for programming high-performance libraries.",
                    "Julia: dynamism and performance reconciled by design.",
                    "GraphIt: a high-performance graph DSL.",
                    "One tool, many languages: language-parametric transformation with incremental parametric syntax.",
                    "Format abstraction for sparse tensor algebra compilers.",
                    "ShareJIT: JIT code cache sharing across processes and its practical implementation.",
                    "Reconciling high-level optimizations and low-level code in LLVM.",
                    "An empirical study of the effect of source-level loop transformations on compiler stability.",
                    "Bidirectional evaluation with direct manipulation.",
                    "BioScript: programming safe chemistry on laboratories-on-a-chip.",
                    "Distributed system development with ScalaLoci.",
                    "Concurrency-aware object-oriented programming with roles.",
                    "Horn-ICE learning for synthesizing invariants and contracts.",
                    "Gradual liquid type inference.",
                    "Collapsible contracts: fixing a pathology of gradual typing.",
                    "The root cause of blame: contracts for intersection and union types.",
                    "Optimal stateless model checking under the release-acquire semantics.",
                    "Towards understanding the costs of avoiding out-of-thin-air results.",
                    "Persistence semantics for weak memory: integrating epoch persistency with the TSO memory model.",
                    "Identifying refactoring opportunities for replacing type code with subclass and state.",
                    "Incrementalizing lattice-based program analyses in Datalog.",
                    "Precise and scalable points-to analysis via data-driven context tunneling.",
                    "Precision-guided context sensitivity for pointer analysis.",
                    "Refinement in object-sensitivity points-to analysis via slicing.",
                    "Every data structure deserves lock-free memory reclamation.",
                    "RacerD: compositional static race detection.",
                    "What happens-after the first race? enhancing the predictive power of happens-before based dynamic race detection.",
                    "Sound deadlock prediction.",
                    "DeepBugs: a learning approach to name-based bug detection.",
                    "ExceLint: automatically finding spreadsheet formula errors.",
                    "Finding code that explodes under symbolic evaluation.",
                    "FlashProfile: a framework for synthesizing data profiles.",
                    "Cross-component garbage collection.",
                    "Reactive caching for composed services: polling at the speed of push.",
                    "Object-oriented recovery for non-volatile memory.",
                    "Software multiplexing: share your libraries and statically link them too.",
                    "Relational program synthesis.",
                    "Robust relational layout synthesis from examples for Android.",
                    "Speeding up symbolic reasoning for relational queries.",
                    "Automatic diagnosis and correction of logical errors for functional programming assignments.",
                    "Compositional programming and testing of dynamic distributed systems.",
                    "Randomized testing of distributed systems with probabilistic guarantees.",
                    "Test generation for higher-order functions in dynamic languages.",
                    "Finding broken promises in asynchronous JavaScript programs.",
                    "Leto: verifying application-specific hardware fault tolerance with programmable execution models.",
                    "Safe replication through bounded concurrency verification.",
                    "Verified three-way program merge.",
                    "Conflict resolution for structured merge via version space algebra."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "OOPSLA 2017",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 1(OOPSLA)",
                "count": 110,
                "papers": [
                    "Herbarium Racketensis: a stroll through the woods (functional pearl).",
                    "Testing and debugging functional reactive programming.",
                    "Lock-step simulation is child's play (experience report).",
                    "Scaling up functional programming education: under the hood of the OCaml MOOC.",
                    "Faster coroutine pipelines.",
                    "A pretty but not greedy printer (functional pearl).",
                    "Generic functional parallel algorithms: scan and FFT.",
                    "A unified approach to solving seven programming problems (functional pearl).",
                    "Prototyping a query compiler using Coq (experience report).",
                    "A framework for adaptive differential privacy.",
                    "Symbolic conditioning of arrays in probabilistic programs.",
                    "Abstracting definitional interpreters (functional pearl).",
                    "On the expressive power of user-defined effects: effect handlers, monadic reflection, delimited control.",
                    "Imperative functional programs that explain their work.",
                    "Effect-driven QuickChecking of compilers.",
                    "Persistence for the masses: RRB-vectors in a systems language.",
                    "Verified low-level programming embedded in F.",
                    "Verifying efficient function calls in CakeML.",
                    "Better living through operational semantics: an optimizing compiler for radio protocols.",
                    "Foundations of strong call by need.",
                    "A relational logic for higher-order programs.",
                    "How to prove your calculus is decidable: practical applications of second-order algebraic theories and computation.",
                    "No-brainer CPS conversion (functional pearl).",
                    "Kami: a platform for high-level parametric hardware specification and its modular verification.",
                    "SpaceSearch: a library for building and verifying solver-aided tools.",
                    "Local refinement typing.",
                    "Compiling to categories.",
                    "Visitors unchained.",
                    "Staged generic programming.",
                    "Super 8 languages for making movies (functional pearl).",
                    "A specification for dependent types in Haskell.",
                    "Parametric quantifiers for dependent type theory.",
                    "Normalization by evaluation for sized dependent types.",
                    "A metaprogramming framework for formal verification.",
                    "Chaperone contracts for higher-order sessions.",
                    "Whip: higher-order contracts for modern services.",
                    "Manifest sharing with session types.",
                    "Gradual session types.",
                    "Theorems for free for free: parametricity, with and without types.",
                    "On polymorphic gradual typing.",
                    "Gradual typing with union and intersection types.",
                    "Constrained type families.",
                    "Automating sized-type inference for complexity analysis.",
                    "Inferring scope through syntactic sugar.",
                    "SAVI objects: sharing and virtuality incorporated.",
                    "A simple soundness proof for dependent object types.",
                    "Unifying typing and subtyping.",
                    "Fast and precise type checking for JavaScript.",
                    "A volatile-by-default JVM for server applications.",
                    "Static placement of computation on heterogeneous devices.",
                    "Skip blocks: reusing execution history to accelerate web scripts.",
                    "Virtual machine warmup blows hot and cold.",
                    "Model checking copy phases of concurrent copying garbage collection with various memory models.",
                    "Sound gradual typing: only mostly dead.",
                    "The VM already knew that: leveraging compile-time knowledge to optimize gradual typing.",
                    "Sound gradual typing is nominally alive and well.",
                    "Effective interactive resolution of static analysis alarms.",
                    "Abridging source code.",
                    "Evaluating and improving semistructured merge.",
                    "Learning to blame: localizing novice type errors with data-driven diagnosis.",
                    "Model-assisted machine-code synthesis.",
                    "Synthesis of data completion scripts using finite tree automata.",
                    "SQLizer: query synthesis from natural language.",
                    "Synthesizing configuration file specifications with association rule learning.",
                    "Natural synthesis of provably-correct data-structure manipulations.",
                    "Practical initialization race detection for JavaScript web applications.",
                    "Efficient logging in non-volatile memory by exploiting coherency protocols.",
                    "Heaps don't lie: countering unsoundness with heap snapshots.",
                    "Instrumentation bias for dynamic data race detection.",
                    "Familia: unifying interfaces, type classes, and family polymorphism.",
                    "Static stages for heterogeneous programming.",
                    "Orca: GC and type system co-design for actor languages.",
                    "Monadic composition for deterministic, parallel batch processing.",
                    "GLORE: generalized loop redundancy elimination upon LER-notation.",
                    "Verifying spatial properties of array computations.",
                    "TreeFuser: a framework for analyzing and fusing general recursive tree traversals.",
                    "The tensor algebra compiler.",
                    "Seam: provably safe local edits on graphs.",
                    "TiML: a functional language for practical complexity analysis with invariants.",
                    "FairSquare: probabilistic verification of program fairness.",
                    "Reasoning on divergent computations with coaxioms.",
                    "Restricting grammars with tree automata.",
                    "Exploiting implicit beliefs to resolve sparse usage problem in usage-based specification mining.",
                    "DéjàVu: a map of code duplicates on GitHub.",
                    "Understanding the use of lambda expressions in Java.",
                    "A model for reasoning about JavaScript promises.",
                    "A verified messaging system.",
                    "Who guards the guards? formal validation of the Arm v8-m architecture specification.",
                    "Robust and compositional verification of object capability patterns.",
                    "Type test scripts for TypeScript testing.",
                    "A solver-aided language for test input generation.",
                    "Transforming programs and tests in tandem for fault localization.",
                    "Automated testing of graphics shader compilers.",
                    "Bounded exhaustive test-input generation on GPUs.",
                    "Project snowflake: non-blocking safe manual memory management in .NET.",
                    "Alpaca: intermittent execution without checkpoints.",
                    "An auditing language for preventing correlated failures in the cloud.",
                    "Reliable and automatic composition of language extensions to C: the ableC extensible language framework.",
                    "IDEal: efficient and precise alias-aware dataflow analysis.",
                    "Data-driven context-sensitivity for points-to analysis.",
                    "Automatically generating features for learning program analysis heuristics for C-like languages.",
                    "P/Taint: unified points-to and taint analysis.",
                    "Deadlock avoidance in parallel programs with futures: why parallel tasks should not wait for strangers.",
                    "Detecting argument selection defects.",
                    "How type errors were fixed and what students did?",
                    "Learning user friendly type-error messages.",
                    "Geo-distribution of actor-based services.",
                    "Paxos made EPR: decidable reasoning about distributed protocols.",
                    "Verifying strong eventual consistency in distributed systems.",
                    "Verifying distributed programs via canonical sequentialization."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "OOPSLA 2016",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2016",
                "sub_name": "Proceedings of the 2016 ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2016, part of SPLASH 2016, Amsterdam, The Netherlands, October 30 - November 4, 2016.",
                "count": 52,
                "papers": [
                    "A compiler for throughput optimization of graph algorithms on GPUs.",
                    "Automatic parallelization of pure method calls via conditional future synthesis.",
                    "Portable inter-workgroup barrier synchronisation for GPUs.",
                    "Parallel incremental whole-program optimizations for Scala.js.",
                    "Semantics-based program verifiers for all languages.",
                    "Hoare-style specifications as correctness conditions for non-linearizable concurrent objects.",
                    "An operational semantics for C/C++11 concurrency.",
                    "Modeling and analysis of remote memory access programming.",
                    "Deriving divide-and-conquer dynamic programming algorithms using solver-aided transformations.",
                    "Speeding up machine-code synthesis.",
                    "Automated reasoning for web page layout.",
                    "FIDEX: filtering spreadsheet data using examples.",
                    "Extensible access control with authorization contracts.",
                    "Gentrification gone too far? affordable 2nd-class values for fun and (co-)effect.",
                    "Incremental forest: a DSL for efficiently managing filestores.",
                    "LaCasa: lightweight affinity and object capabilities in Scala.",
                    "Purposes, concepts, misfits, and a redesign of git.",
                    "Apex: automatic programming assignment error explanation.",
                    "Asserting reliable convergence for configuration management scripts.",
                    "Dependent partitioning.",
                    "Accelerating program analyses by cross-program training.",
                    "An improved algorithm for slicing machine code.",
                    "Call graphs for languages with parametric polymorphism.",
                    "Type inference for static compilation of JavaScript.",
                    "Directed synthesis of failing concurrent executions.",
                    "Maximal causality reduction for TSO and PSO.",
                    "Precise and maximal race detection from incomplete traces.",
                    "Stateless model checking with data-race preemption points.",
                    "Automatic enforcement of expressive security policies using enclaves.",
                    "Chain: tasks and channels for reliable intermittent programs.",
                    "GEMs: shared-memory parallel programming for Node.js.",
                    "OrcO: a concurrency-first approach to objects.",
                    "Semantic subtyping for imperative object-oriented languages.",
                    "Parsing with first-class derivatives.",
                    "The missing link: explaining ELF static linking, semantically.",
                    "Type soundness for dependent object types (DOT).",
                    "Efficient and thread-safe objects for dynamically-typed languages.",
                    "Hybrid STM/HTM for nested transactions on OpenJDK.",
                    "Makalu: fast recoverable allocation of non-volatile memory.",
                    "Prioritized garbage collection: explicit GC support for software caches.",
                    "Computing repair alternatives for malformed programs using constraint attribute grammars.",
                    "Probabilistic model for code with decision trees.",
                    "Ringer: web automation by demonstration.",
                    "Scalable verification of border gateway protocol configurations with an SMT solver.",
                    "A practical framework for type inference error explanation.",
                    "Dynamically diagnosing type errors in unsafe code.",
                    "First-class effect reflection for effect-guided programming.",
                    "Java and scala's type systems are unsound: the existential crisis of null pointers.",
                    "Finding compiler bugs via live code mutation.",
                    "Finding resume and restart errors in Android applications.",
                    "Low-overhead and fully automated statistical debugging with abstraction refinement.",
                    "To be precise: regression aware debugging."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "OOPSLA 2015",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2015",
                "sub_name": "Proceedings of the 2015 ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2015, part of SPLASH 2015, Pittsburgh, PA, USA, October 25-30, 2015.",
                "count": 53,
                "papers": [
                    "Detecting redundant CSS rules in HTML5 applications: a tree rewriting approach.",
                    "SATCheck: SAT-directed stateless model checking for SC and TSO.",
                    "Programming with enumerable sets of structures.",
                    "Stateless model checking of event-driven applications.",
                    "Synthesis of layout engines from relational constraints.",
                    "A sound and optimal incremental build system with dynamic dependencies.",
                    "FlashMeta: a framework for inductive program synthesis.",
                    "Scrap your boilerplate with object algebras.",
                    "Conditionally correct superoptimization.",
                    "Selective control-flow abstraction via jumping.",
                    "Automating grammar comparison.",
                    "Reasoning about the POSIX file system: local update and global pathnames.",
                    "AutoMO: automatic inference of memory order parameters for C/C++11.",
                    "Valor: efficient, software-only region conflict exceptions.",
                    "Automatic memory reclamation for lock-free data structures.",
                    "Protocol-based verification of message-passing parallel programs.",
                    "Interactively verifying absence of explicit information flows in Android apps.",
                    "ShamDroid: gracefully degrading functionality in the presence of limited resource access.",
                    "Scalable race detection for Android applications.",
                    "Versatile yet lightweight record-and-replay for Android.",
                    "Declarative fence insertion.",
                    "Finding deep compiler bugs via guided stochastic program mutation.",
                    "Vectorization of apply to reduce interpretation overhead of R.",
                    "Synthesizing Java expressions from free-form queries.",
                    "Accurate profiling in the presence of dynamic compilation.",
                    "Fast, multicore-scalable, low-fragmentation memory allocation through large virtual memory and global data structures.",
                    "Probability type inference for flexible approximate programming.",
                    "Cross-layer memory management for managed language applications.",
                    "Static analysis of event-driven Node.js JavaScript applications.",
                    "EXPLORER : query- and demand-driven exploration of interprocedural control flow properties.",
                    "Giga-scale exhaustive points-to analysis for Java in under a minute.",
                    "Galois transformers and modular abstract interpreters: reusable metatheory for program analysis.",
                    "Learning a strategy for adapting a program analysis via bayesian optimisation.",
                    "Runtime pointer disambiguation.",
                    "Performance problems you can fix: a dynamic analysis of memoization opportunities.",
                    "RAIVE: runtime assessment of floating-point instability by vectorization.",
                    "Automated backward error analysis for numerical code.",
                    "Using C language extensions for developing embedded software: a case study.",
                    "How scale affects structure in Java programs.",
                    "Use at your own risk: the Java unsafe API in the wild.",
                    "Approximate computation with outlier detection in Topaz.",
                    "Remote-scope promotion: clarified, rectified, and verified.",
                    "Incremental computation with names.",
                    "Checks and balances: constraint solving without surprises in object-constraint programming languages.",
                    "Optimizing hash-array mapped tries for fast and lean immutable JVM collections.",
                    "Automating ad hoc data representation transformations.",
                    "Tracing vs. partial evaluation: comparing meta-compilation approaches for self-optimizing interpreters.",
                    "Effectively mapping linguistic abstractions for message-passing concurrency to threads on the Java virtual machine.",
                    "Partial evaluation of machine code.",
                    "A co-contextual formulation of type rules and its application to incremental type checking.",
                    "Disjointness domains for fine-grained aliasing.",
                    "The chemical approach to typestate-oriented programming.",
                    "Customizable gradual polymorphic effects for Scala."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "OOPSLA 2014",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2014",
                "sub_name": "Proceedings of the 2014 ACM International Conference on Object Oriented Programming Systems Languages & Applications, OOPSLA 2014, part of SPLASH 2014, Portland, OR, USA, October 20-24, 2014.",
                "count": 52,
                "papers": [
                    "Checking correctness of TypeScript interfaces for JavaScript libraries.",
                    "Determinacy in static analysis for jQuery.",
                    "EventBreak: analyzing the responsiveness of user interfaces through performance-guided test generation.",
                    "Using web corpus statistics for program analysis.",
                    "Tardis: affordable time-travel debugging in managed runtimes.",
                    "Phosphor: illuminating dynamic data flow in commodity jvms.",
                    "Rubah: DSU for Java on a stock JVM.",
                    "Fast conservative garbage collection.",
                    "Region-based memory management for GPU programming languages: enabling rich data structures on a spartan host.",
                    "Smten with satisfiability-based search.",
                    "StreamJIT: a commensal compiler for high-performance stream programming.",
                    "SurveyMan: programming and automatically debugging surveys.",
                    "Rate types for stream programs.",
                    "Foundations of path-dependent types.",
                    "Confined gradual typing.",
                    "Refactoring Java generics by inferring wildcards, in practice.",
                    "Continuously measuring critical section pressure with the free-lunch profiler.",
                    "Chisel: reliability- and accuracy-aware optimization of approximate computational kernels.",
                    "An experimental survey of energy management across the stack.",
                    "Understanding energy behaviors of thread management constructs.",
                    "Distributed REScala: an update algorithm for distributed reactive programming.",
                    "From object algebras to attribute grammars.",
                    "Late data layout: unifying data representation transformations.",
                    "i3QL: language-integrated live data views.",
                    "Atlas: leveraging locks for non-volatile memory consistency.",
                    "Fast splittable pseudorandom number generators.",
                    "Multithreaded test synthesis for deadlock detection.",
                    "Symbolic execution of multithreaded programs from arbitrary program contexts.",
                    "CheckCell: data debugging for spreadsheets.",
                    "Finding minimum type error sources.",
                    "Flint: fixing linearizability violations.",
                    "Statistical debugging for real-world performance problems.",
                    "Adaptive LL(*) parsing: the power of dynamic analysis.",
                    "Automated migration of build scripts using dynamic analysis and search-based refactoring.",
                    "MIX10: compiling MATLAB to X10 for high performance.",
                    "Staged parser combinators for efficient data processing.",
                    "Bounded exhaustive test input generation from hybrid invariants.",
                    "Compiler verification meets cross-language linking via data abstraction.",
                    "GPS: navigating weak memory with ghosts, protocols, and separation.",
                    "Natural proofs for asynchronous programs using almost-synchronous reductions.",
                    "Accelerating iterators in optimizing AST interpreters.",
                    "Call sequence prediction through probabilistic calling automata.",
                    "Space-efficient multi-versioning for input-adaptive feedback-driven program optimizations.",
                    "The hiphop virtual machine.",
                    "Validation of memory accesses through symbolic analyses.",
                    "Abstract semantic differencing via speculative correlation.",
                    "Efficient subcubic alias analysis for C.",
                    "Static analysis for independent app developers.",
                    "ASPIRE: exploiting asynchronous parallelism in iterative algorithms using a relaxed consistency based DSM.",
                    "Alembic: automatic locality extraction via migration.",
                    "Cybertron: pushing the limit on I/O reduction in data-parallel programs.",
                    "Translating imperative code to MapReduce."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "OOPSLA 2013",
        "info": "Indianapolis, IN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2013",
                "sub_name": "Proceedings of the 2013 ACM SIGPLAN International Conference on Object Oriented Programming Systems Languages & Applications, OOPSLA 2013, part of SPLASH 2013, Indianapolis, IN, USA, October 26-31, 2013.",
                "count": 50,
                "papers": [
                    "Empirical analysis of programming language adoption.",
                    "Steering symbolic execution to less traveled paths.",
                    "Verifying quantitative reliability for programs that execute on unreliable hardware.",
                    "Efficient context sensitivity for dynamic analyses via calling context uptrees and customized memory management.",
                    "Miniboxing: improving the speed to code size tradeoff in parametric polymorphism translations.",
                    "Taking off the gloves with reference counting Immix.",
                    "Resurrector: a tunable object lifetime profiling technique for optimizing real-world programs.",
                    "CDSchecker: checking concurrent data structures written with C/C++ atomics.",
                    "Effective race detection for event-driven programs.",
                    "Storage strategies for collections in dynamically typed languages.",
                    "Instant pickles: generating object-oriented pickler combinators for fast and extensible serialization.",
                    "Interacting with dead objects.",
                    "Python: the full monty.",
                    "Forsaking inheritance: supercharged delegation in DelphJ.",
                    "Set-based pre-processing for points-to analysis.",
                    "MrCrypt: static analysis for secure cloud computations.",
                    "Ironclad C++: a library-augmented type-safe subset of c++.",
                    "Flexible access control for javascript.",
                    "Semi-automatic rename refactoring for JavaScript.",
                    "Refactoring with synthesis.",
                    "Bottle graphs: visualizing scalability bottlenecks in multi-threaded applications.",
                    "Ball-Larus path profiling across multiple loop iterations.",
                    "Data-driven equivalence checking.",
                    "Synthesis modulo recursive functions.",
                    "Code optimizations using formally verified properties.",
                    "Inductive invariant generation via abductive inference.",
                    "Do developers benefit from generic types?: an empirical comparison of generic and raw types in java.",
                    "Option contracts.",
                    "Language support for dynamic, hierarchical data partitioning.",
                    "Class hierarchy complementation: soundly completing a partial type graph.",
                    "Multiverse: efficiently supporting distributed high-level speculation.",
                    "Fully concurrent garbage collection of actors on many-core machines.",
                    "Isolation for nested task parallelism.",
                    "Turning nondeterminism into parallelism.",
                    "Barrier invariants: a shared state abstraction for the analysis of data-dependent GPU kernels.",
                    "Guided GUI testing of android apps with minimal restart and approximate learning.",
                    "Targeted and depth-first exploration for systematic testing of android apps.",
                    "The latency, accuracy, and battery (LAB) abstraction: programmer productivity and energy efficiency for continuous mobile context sensing.",
                    "Input-covering schedules for multithreaded programs.",
                    "OCTET: capturing and controlling cross-thread dependences efficiently.",
                    "Online feedback-directed optimizations for parallel Java code.",
                    "River trail: a path to parallelism in JavaScript.",
                    "Combining concern input with program analysis for bloat detection.",
                    "Injecting mechanical faults to localize developer faults for evolving software.",
                    "Efficient concurrency-bug detection across inputs.",
                    "Detecting API documentation errors.",
                    "On-the-fly detection of instability problems in floating-point program execution.",
                    "Bounded partial-order reduction.",
                    "On-the-fly capacity planning.",
                    "Relaxed separation logic: a program logic for C11 concurrency."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "OOPSLA 2012",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2012",
                "sub_name": "Proceedings of the 27th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2012, part of SPLASH 2012, Tucson, AZ, USA, October 21-25, 2012.",
                "count": 59,
                "papers": [
                    "Type-based safe resource deallocation for shared-memory concurrency.",
                    "Uniqueness and reference immutability for safe parallelism.",
                    "Safe compiler-driven transaction checkpointing and recovery.",
                    "Towards a practical secure concurrent language.",
                    "Predicate abstraction of Java programs with collections.",
                    "Reducing the barriers to writing verified specifications.",
                    "GPUVerify: a verifier for GPU kernels.",
                    "Modular and verified automatic program repair.",
                    "Mitigating the compiler optimization phase-ordering problem using machine learning.",
                    "Optimization coaching: optimizers learn to communicate with programmers.",
                    "Adaptive multi-level compilation in a trace-based Java JIT compiler.",
                    "On the benefits and pitfalls of extending a statically typed language JIT compiler for dynamic scripting languages.",
                    "An abstract interpretation framework for refactoring with application to extract methods with contracts.",
                    "Refactoring android Java code for on-demand computation offloading.",
                    "Kitsune: efficient, general-purpose dynamic software updating for C.",
                    "Automating object transformations for dynamic software updating.",
                    "Exploring multi-threaded Java application performance on multicore hardware.",
                    "Work-stealing without the baggage.",
                    "Molecule: using monadic and streaming I/O to compose process networks on the JVM.",
                    "A black-box approach to understanding concurrency in DaCapo.",
                    "Automatically enhancing locality for tree traversals with traversal splicing.",
                    "Elixir: a system for synthesizing concurrent graph programs.",
                    "From clarity to efficiency for distributed algorithms.",
                    "Program extrapolation with jennisys.",
                    "Bolt: on-demand infinite loop escape in unmodified binaries.",
                    "LEAN: simplifying concurrency bug reproduction via replay-supported execution reduction.",
                    "IFRit: interference-free regions for dynamic data-race detection.",
                    "Maple: a coverage-driven testing tool for multithreaded programs.",
                    "Taming MATLAB.",
                    "Scaling symbolic execution using ranged analysis.",
                    "Higher-order symbolic execution via contracts.",
                    "Checking reachability using matching logic.",
                    "The HipHop compiler for PHP.",
                    "Dependent types for JavaScript.",
                    "Eval begone!: semi-automated removal of eval from javascript programs.",
                    "Formal specification of a JavaScript module system.",
                    "AutoMan: a platform for integrating human-based and digital computation.",
                    "Talk versus work: characteristics of developer collaboration on the jazz platform.",
                    "Speculative analysis of integrated development environment recommendations.",
                    "An empirical study of the influence of static type systems on the usability of undocumented software.",
                    "Software data-triggered threads.",
                    "Efficiently combining parallel software using fine-grained, language-level, hierarchical resource management policies.",
                    "Execution privatization for scheduler-oblivious concurrent programs.",
                    "Integrating task parallelism with actors.",
                    "A variability-aware module system.",
                    "Gradual typing for first-class classes.",
                    "Constrained kinds.",
                    "Energy types.",
                    "Exploiting inter-sequence correlations for program behavior prediction.",
                    "k-Calling context profiling.",
                    "Reim & ReImInfer: checking and inference of reference immutability and method purity.",
                    "White box sampling in uncertain data processing enabled by program analysis.",
                    "Detecting problematic message sequences and frequencies in distributed systems.",
                    "Reusing debugging knowledge via trace-based bug search.",
                    "Chaperones and impersonators: run-time support for reasonable interposition.",
                    "Open and efficient type switch for C++.",
                    "Understanding the behavior of database operations under program control.",
                    "Typestate-based semantic code search over partial programs.",
                    "Finding reusable data structures."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "OOPSLA 2011",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2011",
                "sub_name": "Proceedings of the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2011, part of SPLASH 2011, Portland, OR, USA, October 22 - 27, 2011.",
                "count": 62,
                "papers": [
                    "The sequential prison.",
                    "SHERIFF: precise detection and automatic mitigation of false sharing.",
                    "Accentuating the positive: atomicity inference and enforcement using correct executions.",
                    "SOS: saving time in dynamic race detection with stationary analysis.",
                    "Testing atomicity of composed concurrent operations.",
                    "Data-driven synthesis for object-oriented frameworks.",
                    "Synthesis of first-order dynamic programming algorithms.",
                    "Kind analysis for MATLAB.",
                    "Tool-supported refactoring for JavaScript.",
                    "Integrated language definition testing: enabling test-driven language development.",
                    "Catch me if you can: performance bug detection in the wild.",
                    "PREFAIL: a programmable tool for multiple-failure injection.",
                    "Synthesizing method sequences for high-coverage testing.",
                    "HAWKEYE: effective discovery of dataflow impediments to parallelization.",
                    "Automatic fine-grain locking using shape properties.",
                    "Safe parallel programming using dynamic dependence hints.",
                    "Sprint: speculative prefetching of remote data.",
                    "Asynchronous assertions.",
                    "Ribbons: a partially shared memory programming model.",
                    "Why nothing matters: the impact of zeroing.",
                    "Trustworthy numerical computation in Scala.",
                    "JET: exception checking in the Java native interface.",
                    "Immutable specifications for more concise and precise verification.",
                    "Hybrid partial evaluation.",
                    "SugarJ: library-based syntactic language extensibility.",
                    "Reactive imperative programming with dataflow constraints.",
                    "Two for the price of one: a model for parallel and incremental computation.",
                    "A step towards transparent integration of input-consciousness into dynamic program optimizations.",
                    "Enhancing locality for recursive traversals of recursive structures.",
                    "Flow-sensitive type recovery in linear-log time.",
                    "Oracle scheduling: controlling granularity in implicitly parallel languages.",
                    "Kismet: parallel speedup estimates for serial programs.",
                    "Efficiently speeding up sequential computation through the n-way programming model.",
                    "Exploiting coarse-grain speculative parallelism.",
                    "Scalable join patterns.",
                    "Product lines of theorems.",
                    "Gradual typing for generics.",
                    "A theory of substructural types and control.",
                    "Benefits and barriers of user evaluation in software engineering research.",
                    "Da capo con scala: design and analysis of a scala benchmark suite for the java virtual machine.",
                    "Automated construction of JavaScript benchmarks.",
                    "Declaratively programming the mobile web with Mobl.",
                    "First-class state change in plaid.",
                    "Cedalion: a language for language oriented programming.",
                    "Self-adjusting stack machines.",
                    "JIT compilation policy for modern machines.",
                    "Reducing trace selection footprint for large-scale Java applications without performance loss.",
                    "Variability-aware parsing in the presence of lexical macros and conditional compilation.",
                    "Safe and atomic run-time code evolution for Java and its application to dynamic AOP.",
                    "A simple abstraction for complex concurrent indexes.",
                    "Composable, nestable, pessimistic atomic statements.",
                    "Delegated isolation.",
                    "AC: composable asynchronous IO for native languages.",
                    "Virtual values for language extension.",
                    "Backstage Java: making a difference in metaprogramming.",
                    "Flexible object layouts: enabling lightweight language extensions by intercepting slot access.",
                    "Type checking modular multiple dispatch with parametric polymorphism and multiple inheritance.",
                    "A syntactic type system for recursive modules.",
                    "Freedom before commitment: a lightweight type system for object initialisation.",
                    "Null dereference verification via over-approximated weakest pre-conditions analysis.",
                    "F4F: taint analysis of framework-based web applications.",
                    "RoleCast: finding missing security checks when you do not know what checks are."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2011c",
                "sub_name": "Companion to the 26th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2011, part of SPLASH 2011, Portland, OR, USA, October 22 - 27, 2011.",
                "count": 79,
                "papers": [
                    "Automatically fixing security vulnerabilities in Java code.",
                    "DrHJ: the cure to your multicore programming woes.",
                    "Sensor composer: composing intelligent virtual sensors for collaborative sensing.",
                    "A HIP and SLEEK verification system.",
                    "Distributed ray tracing in x10.",
                    "Parallel programming by hints.",
                    "The language of languages research project: unifying concepts expressed across different notations.",
                    "Library-based model-driven software development with SugarJ.",
                    "BeneFactor: a flexible refactoring tool for eclipse.",
                    "An 'explicit type enforcement' program transformation tool for preventing integer vulnerabiliites.",
                    "Mobl: the new language of the mobile web.",
                    "Testing domain-specific languages.",
                    "KonohaScript: static scripting for practical use.",
                    "Cedalion 101: \"i want my DSL now\".",
                    "Modularizing crosscutting concerns with ptolemy.",
                    "Guidance trees: a new programming paradigm for non-programmers.",
                    "JP2: collecting dynamic bytecode metrics in JVMs.",
                    "Changing state in the plaid language.",
                    "Keshmesh: a tool for detecting and fixing java concurrency bug patterns.",
                    "Extending the graal compiler to optimize libraries.",
                    "Software objects fairy tales: merging design and runtime objects into the cloud with mydraft.",
                    "Object recognition in the enterprise: structural and behavioral capabilities of patient-centered medical homes.",
                    "A demonstration-based approach for designing domain-specific modeling languages.",
                    "CUDACL+: a framework for GPU programs.",
                    "Generic ownership: the case of java collections.",
                    "Cloning in ownership.",
                    "Composing locks by decomposing deadlocks.",
                    "Towards client-aware interface specifications.",
                    "Alternate annotation checkers using fractional permissions.",
                    "The case for teaching functional programming in discrete math.",
                    "Mining student capstone projects with FRASR and ProM.",
                    "Harnessing collective software development.",
                    "Virtual machines with sharable operating system.",
                    "Crossfire: multiprocess, cross-browser, open-web debugging protocol.",
                    "Moving back to scrum and scaling to scrum of scrums in less than one year.",
                    "A case study for prioritizing features in environments with multiple stakeholders.",
                    "Classifiers: a simple framework for accelerating application development.",
                    "A regression testing framework for financial time-series databases: an effective combination of fitnesse, scala, and kdb/q.",
                    "Coping with distance: an empirical study of communication on the jazz platform.",
                    "Multicore, manycore, and cloud computing: is a new programming language paradigm required?",
                    "Going green with refactoring: sustaining the \"worldwide virtual machine\".",
                    "Industry-academic research partnerships.",
                    "The ink language meta-metamodel for adaptive object-model frameworks: [extended abstract].",
                    "Plaid: a permission-based programming language.",
                    "The design and implementation of the habanero-java parallel programming language.",
                    "SugarJ: library-based language extensibility.",
                    "Refactoring towards the good parts of javascript.",
                    "Smaller footprint for Java collections.",
                    "CREST: principled foundations for decentralized systems.",
                    "McLAB: enabling programming language, compiler and software engineering research for matlab.",
                    "Babylscript: multilingual javascript.",
                    "A case study of language oriented programming with cedalion: [extended abstract].",
                    "Learning CUDA: lab exercises and experiences, part 2.",
                    "A comparative study of parallel sort algorithms.",
                    "Observationally cooperative multithreading.",
                    "Automatic protocol-conformance recommendations.",
                    "Efficient implementation of the plaid language.",
                    "Creating domain-specific modeling languages using by-demonstration technique.",
                    "Safira: a tool for evaluating behavior preservation.",
                    "Misfits in abstractions: towards user-centered design in domain-specific languages for end-user programming.",
                    "Coarse-grain speculation for emerging processors.",
                    "Exploring developer's tool path.",
                    "The JavaScript world domination plan at 16 years.",
                    "Improving user experience by infusing web technologies into desktops.",
                    "To inclusive design through contextually extended IoC: infusion IoC, a JavaScript library and mentality for scalable development of accessible and maintainable systems.",
                    "Strict serializability is harmless: a new architecture for enterprise applications.",
                    "Naming anonymous javascript functions.",
                    "A framework for analyzing programs written in proprietary languages.",
                    "Emscripten: an LLVM-to-JavaScript compiler.",
                    "COOMP 2011: first international workshop on combined object-oriented modeling and programming.",
                    "The 11th workshop on domain-specific modeling.",
                    "2011 international workshop on foundations of object-oriented languages (fool'11): splash/oopsla '11 workshop summary.",
                    "Workshop: beyond green-field software development: reuse, recycle, refactor.",
                    "Workshop on transitioning to multicore: (TMC 2011).",
                    "AGERE! (actors and agents reloaded): splash 2011 workshop on programming systems, languages and applications based on actors, agents and decentralized control.",
                    "Agile and object oriented practices in embedded systems.",
                    "Workshop on NExt-generation applications of smartphones (NEAT).",
                    "ACM SIGPLAN international workshop on programming language and systems technologies for internet clients: (PLASTIC 2011).",
                    "VMIL 2011: the 5th workshop on virtual machines and intermediate languages."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "OOPSLA 2010",
        "info": "Reno/Tahoe, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2010",
                "sub_name": "Proceedings of the 25th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2010, October 17-21, 2010, Reno/Tahoe, Nevada, USA.",
                "count": 62,
                "papers": [
                    "The case for evolvable software.",
                    "Art, science, and fear.",
                    "To achieve our highest goals, we must be willing to abandon them.",
                    "Efficient modular glass box software model checking.",
                    "An experiment about static and dynamic type systems: doubts about the positive impact of static type systems on development time.",
                    "A simple inductive synthesis methodology and its applications.",
                    "A domain-specific approach to architecturing error handling in pervasive computing.",
                    "G-Finder: routing programming questions closer to the experts.",
                    "Agility in context.",
                    "Lime: a Java-compatible and synthesizable language for heterogeneous architectures.",
                    "From OO to FPGA: fitting round objects into square hardware?",
                    "An input-centric paradigm for program dynamic optimizations.",
                    "Composable specifications for structured shared-memory communication.",
                    "Do I use the wrong definition?: DeFuse: definition-use invariants for detecting concurrency and sequential bugs.",
                    "Scalable and systematic detection of buggy inconsistencies in source code.",
                    "A study of Java's non-Java memory.",
                    "Hera-JVM: a runtime system for heterogeneous multi-core architectures.",
                    "Cross-language, type-safe, and transparent object sharing for co-located managed runtimes.",
                    "Instrumentation and sampling strategies for cooperative concurrency bug isolation.",
                    "What can the GC compute efficiently?: a language for heap assertions at GC time.",
                    "Monitor optimization via stutter-equivalent loop transformation.",
                    "Specifying and implementing refactorings.",
                    "A graph-based approach to API usage adaptation.",
                    "Component adaptation and assembly using interface relations.",
                    "Type classes as objects and implicits.",
                    "Supporting dynamic, third-party code customizations in JavaScript using aspects.",
                    "Dynamic parallelization of recursive code: part 1: managing control flow interactions with the continuator.",
                    "Symbolic heap abstraction with demand-driven axiomatization of memory invariants.",
                    "A dynamic evaluation of the precision of static heap abstractions.",
                    "Parallel inclusion-based points-to analysis.",
                    "The spoofax language workbench: rules for declarative specification of languages and IDEs.",
                    "MetaFJig: a meta-circular composition language for Java-like classes.",
                    "Modular logic metaprogramming.",
                    "Reasoning about multiple related abstractions with MultiStar.",
                    "Homogeneous family sharing.",
                    "Mostly modular compilation of crosscutting concerns by contextual predicate dispatch.",
                    "Random testing for higher-order, stateful programs.",
                    "The two-state solution: native and serializable continuations accord.",
                    "Back to the futures: incremental parallelization of existing sequential runtime systems.",
                    "Ownership and immutability in generic Java.",
                    "Tribal ownership.",
                    "A time-aware type system for data-race protection and guaranteed initialization.",
                    "Automatic atomic region identification in shared memory SPMD programs.",
                    "Task types for pervasive atomicity.",
                    "Concurrent programming with revisions and isolation types.",
                    "SPUR: a trace-based JIT compiler for CIL.",
                    "Refactoring references for library migration.",
                    "Performance analysis of idle programs.",
                    "Registration-based language abstractions.",
                    "Pinocchio: bringing reflection to life with first-class interpreters.",
                    "Concurrency by modularity: design patterns, a case in point.",
                    "Patterns and statistical analysis for understanding reduced resource computing.",
                    "Programming with time: cyber-physical programming with impromptu.",
                    "Language virtualization for heterogeneous parallel computing.",
                    "Flexible modeling tools for pre-requirements analysis: conceptual architecture and research challenges.",
                    "To upgrade or not to upgrade: impact of online upgrades across multiple administrative domains.",
                    "Managing ambiguity in programming by finding unambiguous examples.",
                    "Better science through art.",
                    "Rubber ducks, nightmares, and unsaturated predicates: proto-scientific schemata are good for agile.",
                    "Pure and declarative syntax definition: paradise lost and regained.",
                    "Faith, hope, and love: an essay on software science's neglect of human factors.",
                    "The Tower of Babel did not fail."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2010c",
                "sub_name": "Companion to the 25th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2010, part of SPLASH 2010, October 17-21, 2010, Reno/Tahoe, Nevada, USA.",
                "count": 77,
                "papers": [
                    "now happens-before later: static schedule analysis of fine-grained parallelism with explicit happens-before relationships.",
                    "Emergent feature modularization.",
                    "Harnessing emergence for manycore programming: early experience integrating ensembles, adverbs, and object-based inheritance.",
                    "Collaborative model merging.",
                    "Sonifying performance data to facilitate tuning of complex systems: performance tuning: music to my ears.",
                    "A recommender for conflict resolution support in optimistic model versioning.",
                    "Inferring arbitrary distributions for data and computation.",
                    "Ficticious: MicroLanguages for interactive fiction.",
                    "Physics as freedom.",
                    "Gource: visualizing software version control history.",
                    "Pinocchio: a virtual symphony orchestra game.",
                    "Letters from the edge of an agile transition.",
                    "Object-oriented software considerations in airborne systems and equipment certification.",
                    "Migrating a large modeling environment from XML/UML to Xtext/GMF.",
                    "Software evolution in agile development: a case study.",
                    "Application frameworks: how they become your enemy.",
                    "MDSD for the iPhone: developing a domain-specific language and IDE tooling to produce real world applications for mobile devices.",
                    "Stop the software architecture erosion: building better software systems.",
                    "Textual modeling tools: overview and comparison of language workbenches.",
                    "Students' cooperation in teamwork: binding the individual and the team interests.",
                    "Mutation analysis vs. code coverage in automated assessment of students' testing skills.",
                    "Compiler construction with a dash of concurrency and an embedded twist.",
                    "Understanding abstraction: a means of leveling the playing field in CS1?",
                    "Teaching and training developer-testing techniques and tool support.",
                    "Learning CUDA: lab exercises and experiences.",
                    "Learning OOP with weakly typed web programming languages: adding concrete strategies to a PHP strategy design pattern.",
                    "Using a web-based repository to integrate testing tools into programming courses.",
                    "Panel: designing the next educational programming language.",
                    "Designing language-oriented programming languages.",
                    "Metamodel evolution through metamodel inference.",
                    "Model scalability using a model recording and inference engine.",
                    "Verifying configuration files.",
                    "OOGIE: ownership object graph interactive editor.",
                    "Extending abstract GPU APIs to shared memory.",
                    "Encapsulation and locality: a foundation for concurrency support in multi-language virtual machines?",
                    "Unsticking the web.",
                    "Towards feature modularization.",
                    "Enabling expressive aspect oriented modular reasoning by translucid contracts.",
                    "Metamodel-driven evolution.",
                    "Supporting the evolution of software knowledge with adaptive software artifacts.",
                    "Dynamic tainting for deployed Java programs.",
                    "Typelets.",
                    "The Spoofax language workbench.",
                    "Many-core virtual machines: decoupling abstract from concrete concurrency.",
                    "Guiding modelers through conflict resolution: a recommender for model versioning.",
                    "Reconciling concurrency and modularity with Panini's asynchronous typed events.",
                    "Translucid contracts for modular reasoning about aspect-oriented programs.",
                    "Towards a tool-based development methodology for sense/compute/control applications.",
                    "Almost free concurrency! (using GOF patterns).",
                    "Hamster: making grid middleware fault-tolerant.",
                    "Collaboration.",
                    "The object-oriented trivia show (TOOTS).",
                    "Evaluation and usability of programming languages and tools (PLATEAU).",
                    "9th workshop on parallel/high-performance object-oriented scientific computing.",
                    "The 10th workshop on domain-specific modeling.",
                    "The 2nd workshop on human aspects of software engineering (HAoSE2010).",
                    "VMIL 2010: 4th workshop on virtual machines and intermediate languages.",
                    "KOPLE: knowledge-oriented product line engineering.",
                    "Concurrency for the application programmer.",
                    "Ontology-driven software engineering 2010.",
                    "Curricula in concurrency and parallelism.",
                    "SPLASH 2010 workshop on flexible modeling tools.",
                    "2010 international workshop on foundations of object-oriented languages (FOOL'10): SPLASH/OOPSLA'10 workshop summary.",
                    "Building the right cloud solutions.",
                    "Workshop: architecture in an agile world.",
                    "Workshop on experimental evaluation of software and systems in computer science (Evaluate 2010).",
                    "Programming support innovations for emerging distributed applications (PSI EtA - upsiloneta): a splash 2010 workshop summary.",
                    "Stop the software architecture erosion.",
                    "XUnit test patterns and smells: improving the ROI of test code.",
                    "Language extension and composition with language workbenches.",
                    "Better planning via tasking as a team.",
                    "Xtext: implement your language faster than the quick and dirty way.",
                    "Bridging software languages and ontology technologies: tutorial summary.",
                    "An architecturally-evident coding style: making your design visible in your code.",
                    "Rulemakers and toolmakers: adaptive object-models as an agile division of labor.",
                    "iPhone application development.",
                    "Skills for the agile designer: seeing, shaping and discussing design ideas."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "24th OOPSLA 2009",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2009",
                "sub_name": "Proceedings of the 24th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2009, October 25-29, 2009, Orlando, Florida, USA.",
                "count": 33,
                "papers": [
                    "Flapjax: a programming language for Ajax applications.",
                    "CZ: multiple inheritance without diamonds.",
                    "Empirical assessment of object-oriented implementations with multiple inheritance and static typing.",
                    "Parallel programming with object assemblies.",
                    "Grace: safe multithreaded programming for C/C++.",
                    "A type and effect system for deterministic parallel Java.",
                    "Thorn: robust, concurrent, extensible scripting on the JVM.",
                    "How a Java VM can get more from a hardware performance monitor.",
                    "A concurrent dynamic analysis framework for multicore hardware.",
                    "Inferred call path profiling.",
                    "Accelerating the creation of customized, language-Specific IDEs in Eclipse.",
                    "Debug all your code: portable mixed-environment debugging.",
                    "The design of a task parallel library.",
                    "Strictly declarative specification of sophisticated points-to analyses.",
                    "Self type constructors.",
                    "Profile-guided static typing for dynamic scripting languages.",
                    "Enhancing source-level programming tools with an awareness of transparent program transformations.",
                    "Static extraction and conformance analysis of hierarchical runtime architectural structure using annotations.",
                    "Demystifying model transformations: an approach based on automated rule inference.",
                    "Allocation wall: a limiting factor of Java applications on emerging multi-core platforms.",
                    "NUMA-aware memory manager with dominant-thread-based copying GC.",
                    "Executing code in the past: efficient in-memory object graph versioning.",
                    "Optimizing programs with intended semantics.",
                    "Minimizing dependencies within generic classes for faster and smaller programs.",
                    "Providing rapid feedback in generated modular language environments: adding error recovery to scannerless generalized-LR parsing.",
                    "Design pattern density defined.",
                    "Writing code for other people: cognitive psychology and the fundamentals of good software design principles.",
                    "Regrowing a language: refactoring tools allow programming languages to evolve.",
                    "pi: a pattern language.",
                    "Software evolution and the moving picture metaphor.",
                    "Agile anthropology and Alexander's architecture: an essay in three voices.",
                    "An exploration of program as language.",
                    "On understanding data abstraction, revisited."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2009c",
                "sub_name": "Companion to the 24th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2009, October 25-29, 2009, Orlando, Florida, USA.",
                "count": 121,
                "papers": [
                    "Agile development: overcoming a short-term focus in implementing best practices.",
                    "Making SOA work in a healthcare company.",
                    "Scalable nonblocking concurrent objects for mission critical code.",
                    "Bit syntax for Java.",
                    "Using a recursive traversal algorithm with an active composite pattern in swing applications.",
                    "Toward cloud-agnostic middlewares.",
                    "Using RESTful web-services and cloud computing to create next generation mobile applications.",
                    "Refactoring UML models: using openarchitectureware to measure uml model quality and perform pattern matching on UML models with OCL queries.",
                    "An extensible framework for tracing model evolution in SOA solution design.",
                    "Reverse generation and refactoring of fit acceptance tests for legacy code.",
                    "A different kind of programming languages course.",
                    "Using python and QuickDraw to foster student engagement in CS1.",
                    "Easing up on the introductory computer science syllabus: a shift from syntax to concepts.",
                    "Using metaphors with software teams.",
                    "Reflection in software engineering education.",
                    "Third international workshop on web APIs and services Mashups (Mashups'09).",
                    "Towards best practices in designing for the cloud.",
                    "Towards best practices in implementing and operating for the cloud.",
                    "VMIL: workshop on virtual machines and intermediate languages.",
                    "Curricula for concurrency and parallelism.",
                    "Second ACM workshop on hot topics in software upgrades (HotSWUp 2009).",
                    "The 9th OOPSLA workshop on domain-specific modeling.",
                    "Knowledge industry survival strategy (KISS): fundamental principles and interoperability requirements for domain specific modeling languages.",
                    "Good examples for exposing bad practice: a \"killer examples\" workshop.",
                    "Overview of the 3rd international workshop on software patterns and quality ((SPAQu'09).",
                    "3rd workshop on assessment of contemporary modularization techniques (ACoM 2009).",
                    "The 3rd ACM workshop on refactoring tools (WRT'09).",
                    "Architecture in an agile world.",
                    "SEARIS: software engineering and architectures for realtime interactive systems.",
                    "Ontology-driven software engineering.",
                    "Workshop on human aspects of software engineering.",
                    "Extravagaria V: photographing conferences (advanced).",
                    "Fault-based combinatorial testing of web services.",
                    "The future is dynamic: adaptive runtime resource management for heterogeneous computer platforms.",
                    "The habanero multicore software research project.",
                    "Modular typestate checking in concurrent Java programs.",
                    "By-example adaptation of the generic model versioning system AMOR: how to include language-specific features for improving the check-in process.",
                    "Improving safety when refactoring aspect-oriented programs.",
                    "Dependable, online upgrades in enterprise systems.",
                    "InTml: a case study on virtual reality development.",
                    "Harmony-oriented smalltalk.",
                    "Integrating static analysis and testing for firewall policies.",
                    "An interpretive domain specific language workbench.",
                    "Best practices in cloud computing: implementation and operational implications for the cloud.",
                    "Mining scenario-based specifications with value-based invariants.",
                    "The observer effect of profiling on dynamic Java optimizations.",
                    "Preserving the separation of concerns while composing aspects on shared joinpoints.",
                    "S.P.L.O.T.: software product lines online tools.",
                    "Query-point debugging.",
                    "How lock contention affects energy use in a CMP server.",
                    "@composite: macro annotations for Java C.",
                    "Building a semantic virtual museum: from Wiki to semantic Wiki using named entity recognition.",
                    "Executing code in the past: efficient in-memory object graph versioning.",
                    "Dynamically inferring, refining, and checking API usage protocols.",
                    "Best practices in cloud computing: designing for the cloud.",
                    "The eighth \"killer examples\" workshop: good examples for exposing bad practice.",
                    "Supporting model evolution through demonstration-based model transformation.",
                    "Centralizing clone group representation and maintenance.",
                    "TROPIC: a framework for model transformations on petri nets in color.",
                    "The future is dynamic: adaptive runtime resource management for heterogeneous computer platforms.",
                    "Thorn: robust concurrent scripting on the JVM.",
                    "The operation recorder: specifying model refactorings by-example.",
                    "Relooper: refactoring for loop parallelism in Java.",
                    "From platform-independent to platform-specific models using democles.",
                    "Weaving web applications with WebDSL: (demonstration).",
                    "ModelTalk: a DSL workbench in action.",
                    "Declarative web-applications without server: demonstration of how a fully functional web-application can be built in an hour with only HTML, CSS & Javascript Library.",
                    "ORTS: a tool for optimized regression testing selection.",
                    "IBM altocumulus: a cross-cloud middleware and platform.",
                    "Consultant assistant: a tool for collaborative requirements gathering and business process documentation.",
                    "The SmaCC transformation engine: how to convert your entire code base into a different programming language.",
                    "The anti-goldilocks debugger: helping the average bear debug transparently transformed programs.",
                    "Trailblazer: a tool for automated annotation refactoring.",
                    "MT-scribe: a tool for recording and inferring model transformations.",
                    "Get to know your clones with CeDAR.",
                    "MetaEdit+: defining and using integrated domain-specific modeling languages.",
                    "The good, the bad, and the ugly: three ways to use a semantic code query system.",
                    "Versatile language semantics with reflective embedding.",
                    "Defining communication in SOA based on discourse models.",
                    "Model transformation by demonstration.",
                    "Semantic framework for DSLs.",
                    "Dependable, online upgrades in enterprise systems.",
                    "Preserving the separation of concerns while composing aspects on shared joinpoints.",
                    "Architecture in an agile world.",
                    "OOPSLA idol: a contest to determine the most innovative idea at OOPSLA 2009.",
                    "Cloud computing beyond objects: seeding the cloud.",
                    "The knowledge worker of the future.",
                    "The OOPSLA trivia show (TOOTS).",
                    "The commenting practice of open source.",
                    "Polymorphic system architecture summary.",
                    "How does project managers' personality matter?: building the linkage between project managers' personality and the success of software development projects.",
                    "Modern meeting management and information retrieval: automatic protocol generation and meeting work.",
                    "The mythical matched modules: overcoming the tyranny of inflexible software construction.",
                    "To pull or not to pull.",
                    "What is wrong with the software development?: research trends and a new software engineering paradigm.",
                    "Challenges for agile development of large systems in the aviation industry.",
                    "Traditional assignment considered harmful.",
                    "Silhouette: visual language for meaningful shape.",
                    "Coherent reaction.",
                    "Concurrency by default: using permissions to express dataflow in stateful programs.",
                    "Modelling software processes: a focus on objectives.",
                    "Language factories.",
                    "Provenance: a future history.",
                    "Towards automation of iteration planning.",
                    "A market-based approach to software evolution.",
                    "When users become collaborators: towards continuous and context-aware user input.",
                    "Harmony-oriented programming and software evolution.",
                    "Agile specifications.",
                    "Reimagining literate programming.",
                    "Typestate-oriented programming.",
                    "Gaining insight into programs that analyze programs: by visualizing the analyzed program.",
                    "Monterey Phoenix, or how to make software architecture executable.",
                    "Dolli 2: project presentation.",
                    "The puppet and the probe.",
                    "Software cinema: stories from the lab.",
                    "Video-based requirements engineering for pervasive computing applications: an example of preventing water damage.",
                    "Reflections and retrospectives in software development environments.",
                    "Fragile ideas.",
                    "Evaluation and usability of programming languages and tools (plateau).",
                    "The culture of programming languages.",
                    "First international workshop on software research and climate change."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "23rd OOPSLA 2008",
        "info": "Nashville, TN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2008",
                "sub_name": "Proceedings of the 23rd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2008, October 19-23, 2008, Nashville, TN, USA.",
                "count": 36,
                "papers": [
                    "Caching and incrementalisation in the java query language.",
                    "Interprocedural query extraction for transparent persistence.",
                    "Deep typechecking and refactoring.",
                    "Join patterns for visual basic.",
                    "Whiteoak: introducing structural typing into java.",
                    "Mixing source and bytecode: a case for compilation by normalization.",
                    "Tolerating memory leaks.",
                    "Jolt: lightweight dynamic analysis and removal of object churn.",
                    "QVM: an efficient runtime for detecting defects in deployed systems.",
                    "Contention-aware scheduler: unlocking execution parallelism in multithreaded java programs.",
                    "Dynamic optimization for efficient strong atomicity.",
                    "Design and implementation of transactional constructs for C/C++.",
                    "jStar: towards practical verification for java.",
                    "Verifying correct usage of atomic blocks and typestate.",
                    "Enforcing object protocols by combining static and runtime analysis.",
                    "The impact of static-dynamic coupling on remodularization.",
                    "Sound and extensible renaming for java.",
                    "Annotation refactoring: inferring upgrade transformations for legacy applications.",
                    "Enabling static analysis for partial java programs.",
                    "Safer unsafe code for .NET.",
                    "Typestate-like analysis of multiple interacting objects.",
                    "Java performance evaluation through rigorous replay compilation.",
                    "Analysis and reduction of memory inefficiencies in Java strings.",
                    "Analyzing the performance of code-copying virtual machines.",
                    "Generics of a higher kind.",
                    "The visitor pattern as a reusable, generic, type-safe component.",
                    "Constrained types for object-oriented languages.",
                    "Efficient local type inference.",
                    "Efficient software model checking of soundness of type systems.",
                    "Java type inference is broken: can we fix it?",
                    "Delegation-based semantics for modularizing crosscutting concerns.",
                    "A theory of aspects as latent topics.",
                    "Multiple dispatch in practice.",
                    "A tag-based approach for the design and composition of information processing applications.",
                    "Towards adaptive programming: integrating reinforcement learning into a programming language.",
                    "Designed as designer."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2008c",
                "sub_name": "Companion to the 23rd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2008, October 19-13, 2007, Nashville, TN, USA.",
                "count": 86,
                "papers": [
                    "Agile architecture methodology: long term strategy interleaved with short term tactics.",
                    "Retaining comments when refactoring code.",
                    "Decentralized control of automatic guided vehicles: applying multi-agent systems in practice.",
                    "NOAO imaging meta data quality improvement: a case study of the evolution of a service oriented system.",
                    "Performance pitfalls in large-scale java applications translated from COBOL.",
                    "Processing heterogeneous abstract syntax trees with the mutable class pattern.",
                    "A workload model for topic-based publish/subscribe systems.",
                    "SyQL: an object oriented, fuzzy, temporal query language for repositories of software artifacts.",
                    "Aspect weaving for OSGi.",
                    "Automated testing of non-functional requirements.",
                    "Axiom-based testing for C++.",
                    "Compile-time type-checking for custom type qualifiers in Java.",
                    "Enforcing reference and object immutability in Java.",
                    "Refactoring support for the groovy-eclipse plug-in.",
                    "Interactive exploration of compacted visualizations for understanding behavior in complex software.",
                    "JAxT and JDI: the simplicity of junit applied to axioms and data invariants.",
                    "PEM: experience management tool for software companies.",
                    "Quota queue: a new queue data structure that provides prioritized, predictable, guaranteed and fair dequeue mechanism.",
                    "Supporting software product lines development: FLiP - product line derivation tool.",
                    "The maxine virtual machine and inspector.",
                    "Tool support for statically checking the structural conformance of an object-oriented system to its runtime architecture.",
                    "Tool support for the static extraction of sound hierarchical representations of runtime object graphs.",
                    "Understanding code architectures via interactive exploration and layout of layered diagrams.",
                    "Testability explorer: using byte-code analysis to engineer lasting social changes in an organization's software development process.",
                    "Visualizing software evolution with lagrein.",
                    "eMoose: a memory aid for software developers.",
                    "Alias count facilitate ownership transfer.",
                    "Arbitrary non-contiguous pieces of computation: a new join point model for aspect-oriented programming.",
                    "Compile-time type-checking for custom type qualifiers in java.",
                    "Hierarchical inter-object traces for specification mining.",
                    "Interactive exploration of compacted visualizations for understanding behavior in complex software.",
                    "Mining for computing skills.",
                    "Novel language syntax to enhance readability: white space, parameter sets, & control structures.",
                    "Preparing for C++0x.",
                    "Scalable, expressive, and context-sensitive code smell display.",
                    "Testing with concepts and axioms in C++.",
                    "Understanding code architectures via interactive exploration and layout of layered diagrams.",
                    "Visualizing the word structure of Java class names.",
                    "WebDSL: a domain-specific language for dynamic web applications.",
                    "Worked examples for sound OO pedagogy: the seventh \"killer examples\" workshop.",
                    "eMoose: a memory aid for software developers.",
                    "Escaped from the lab: innovation practices in large organizations.",
                    "DSLs: the good, the bad, and the ugly.",
                    "From sorceress to scientist: women in computing.",
                    "Collaboration and communication: growing and sustaining ultra large scale (ULS) systems.",
                    "Privacy and security: what are you doing to keep the community safe?",
                    "An experiment in teaching innovation in software engineering: video presentation.",
                    "xDIVA: a debugging visualization system with composable visualization metaphors.",
                    "Accessing the deep web: when good ideas go bad.",
                    "Towards harmony-oriented programming.",
                    "Essential programming paradigm.",
                    "Jidoka in software development.",
                    "A framework for complex time structures based on coupled lists.",
                    "1st ACM workshop on hot topics in software upgrades (HotSWUp 2008).",
                    "2nd workshop on assessment of contemporary modularization techniques (ACoM 2008).",
                    "Challenges: agile values meet different value systems.",
                    "Escaped from the lab: crossing the gap from invention to practice.",
                    "Extravagaria IV: photographing conferences.",
                    "Lisp50: The 50th birthday of lisp at OOPSLA 2008.",
                    "Relationships and associations in object-oriented languages.",
                    "Sixth international workshop on SOA & web services: best practices.",
                    "The 2nd workshop on refactoring tools (WRT'08).",
                    "The 8th OOPSLA workshop on domain-specific modeling.",
                    "Virtual machines and intermediate languages for emerging modularization mechanisms.",
                    "Worked examples for sound object-oriented pedagogy: a \"killer\" workshop.",
                    "Scaffolding for multiple assignment projects in CS1 and CS2.",
                    "Re-engineering the algorithma project for long-term maintenance.",
                    "A snapshot of studio based learning: code reviews as a means of community building.",
                    "Designing a memory aid to support software developers.",
                    "Plug-in architecture and design guidelines for customizable enterprise applications.",
                    "Prototyping domain-specific language semantics.",
                    "Arbitrary non-contiguous pieces of computation: a new join point model for aspect-oriented programming.",
                    "Improving developers' confidence in test results of multi-threaded systems: avoiding early and late assertions.",
                    "Checking framework interactions with relationships.",
                    "Validating temporal properties of interacting objects.",
                    "Verifying correct usage of atomic blocks using access permissions.",
                    "Automatic code generation and solution estimate for object-oriented embedded software.",
                    "Static extraction and conformance checking of the runtime architecture of object-oriented systems.",
                    "Grey-box specifications for object-oriented program components.",
                    "Checking API protocol compliance in java.",
                    "Failure-prone components are also attack-prone components.",
                    "Raising the level of abstraction of application-level checkpointing.",
                    "Answering control flow questions about code.",
                    "CZ: multiple inheritance without diamonds.",
                    "Automatic detection of memory anti-patterns.",
                    "Security oriented program transformations (or how to add security on demand)."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2008wrt",
                "sub_name": "Second ACM Workshop on Refactoring Tools, WRT 2008, in conjunction with OOPSLA 2008, Nashville, TN, USA, October 19, 2008.",
                "count": 13,
                "papers": [
                    "Cross language refactoring for Eclipse plug-ins.",
                    "Tool support for refactoring functional programs.",
                    "When refactoring acts like modularity: keeping options open with persistent condition checking.",
                    "Toward refactoring in a polyglot world: extending automated refactoring support across Java and XML.",
                    "Refactoring is not (yet) about transformation.",
                    "Towards a refactoring guideline using code clone classification.",
                    "Gathering refactoring data: a comparison of four methods.",
                    "Recommending refactorings when restructuring variabilities in software product lines.",
                    "Designing refactoring tools for developers.",
                    "Re-approaching the refactoring Rubicon.",
                    "Refactoring a language for parallel computational chemistry.",
                    "A security oriented program transformation to \"add on\" policies to prevent injection attacks.",
                    "Implementing refactorings in IntelliJ IDEA."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "22nd OOPSLA 2007",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2007",
                "sub_name": "Proceedings of the 22nd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2007, October 21-25, 2007, Montreal, Quebec, Canada.",
                "count": 39,
                "papers": [
                    "The jastadd extensible java compiler.",
                    "Jeannie: granting java native interface developers their wishes.",
                    "Ilea: inter-language analysis across java and c.",
                    "Statistically rigorous java performance evaluation.",
                    "Microphase: an approach to proactively invoking garbage collection for improved performance.",
                    "Probabilistic calling context.",
                    "Variant path types for scalable extensibility.",
                    "Dependent classes.",
                    "Component nextgen: a sound and expressive component framework for java.",
                    "User-changeable visibility: resolving unanticipated name clashes in traits.",
                    "Transactions with isolation and cooperation.",
                    "Streamflex: high-throughput stream programming in java.",
                    "Can programming be liberated from the two-level style: multi-level programming with deepjava.",
                    "The causes of bloat, the limits of health.",
                    "Notation and representation in collaborative object-oriented design: an observational study.",
                    "Webrb: evaluating a visual domain-specific language for building relational web-applications.",
                    "Modular typestate checking of aliased objects.",
                    "Type qualifier inference for java.",
                    "Establishing object invariants with delayed types.",
                    "Modular verification of higher-order methods with mandatory calls specified by model programs.",
                    "Using early phase termination to eliminate load imbalances at barrier synchronization points.",
                    "Starc: static analysis for efficient repair of complex data.",
                    "Tracking bad apples: reporting the origin of null and undefined value errors.",
                    "Inferring aliasing and encapsulation properties for java.",
                    "Multiple ownership.",
                    "Ownership transfer in universe types.",
                    "Lost in translation: formalizing proposed extensions to c#.",
                    "The java module system: core design and semantic definition.",
                    "Awesome: an aspect co-weaving system for composing multiple aspect-oriented extensions.",
                    "Scalable omniscient debugging.",
                    "Using hpm-sampling to drive dynamic compilation.",
                    "Mop: an efficient and generic runtime verification framework.",
                    "Making trace monitors feasible.",
                    "Living in the comfort zone.",
                    "Living it up with a live programming language.",
                    "No ifs, ands, or buts: uncovering the simplicity of conditionals.",
                    "Epi-aspects: aspect-oriented conscientious software.",
                    "Confessions of a used programming language salesman.",
                    "The transactional memory / garbage collection analogy."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2007c",
                "sub_name": "Companion to the 22nd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2007, October 21-25, 2007, Montreal, Quebec, Canada.",
                "count": 119,
                "papers": [
                    "Once upon a time, like never before: the challenge of telling the next story.",
                    "Second life: the world's biggest programming environment.",
                    "50 in 50.",
                    "Collaboration and telecollaboration in design.",
                    "Elephant 2000: a programming language based on speech acts.",
                    "Precise software documentation: making object-orientation work better.",
                    "Context, perspective, and programs.",
                    "A talk by Pattie Maes.",
                    "From 0 to 1, 169, 600 in 3 minutes: nine months of testing by the DevCreek team.",
                    "PowerPoint and complexity.",
                    "The elephant in the room: who will take care of the code?",
                    "X3D web software visualization in action!",
                    "Process in oo pedagogy: a \"killer\" workshop.",
                    "Complexity management.",
                    "1st international workshop on in process software engineering measurement and analysis (ISEMA 2007).",
                    "The first international workshop on patterns languages: addressing challenges (PLAC 2007).",
                    "Fifth international workshop on SOA & web services best practices.",
                    "The 7th OOPSLA workshop on domain-specific modeling.",
                    "Eclipse technology exchange workshop (ETX2007).",
                    "Workshop on integration of open source components into large software systems.",
                    "Versions, releases, and distribution.",
                    "The popularity cycle of graphical tools, UML, and libraries of associations.",
                    "The first workshop on programming languages and integrated development environments (PLIDE).",
                    "No silver bullet: a retrospective on the essence and accidents of software engineering.",
                    "Semantic-based systems development.",
                    "The first international workshop on unified data mining engine: addressing challenges (UDME 2007).",
                    "A mini-plop at OOPSLA '07.",
                    "Agility unlimited?",
                    "Selecting object-oriented source code metrics to improve predictive models using a parallel genetic algorithm.",
                    "OOMatch: pattern matching as dispatch in Java.",
                    "The JastAdd extensible Java compiler.",
                    "Open framework for conformance testing via scenarios.",
                    "Mining modal scenarios from execution traces.",
                    "Ruby refactoring plug-in for eclipse.",
                    "Refactoring support for the C++ development tooling.",
                    "CUTE: C++ unit testing easier.",
                    "A framework for distributed collaborative conceptual model development.",
                    "Towards a pattern language for adaptive object models.",
                    "Combining structural subtyping and external dispatch.",
                    "Green: a flexible UML class diagramming tool for eclipse.",
                    "Adding rigorous statistics to the Java benchmarker's toolbox.",
                    "Checking framework plugins.",
                    "Swashup: situational web applications mashups.",
                    "Status report on JSR-305: annotations for software defect detection.",
                    "Synthesizing reactive systems from LSC requirements using the play-engine.",
                    "CASE-FX: feature modeling support in an OO Case tool.",
                    "Using FindBugs on production software.",
                    "Towards a framework for requirement change management in healthcare software applications.",
                    "Compile-time type-checking for custom type qualifiers in Java.",
                    "From developer's head to developer tests: characterization, theories, and preventing one more bug.",
                    "How can we liberate ourselves from pointers?",
                    "Randoop: feedback-directed random testing for Java.",
                    "A portable javascript thread library for Ajax applications.",
                    "Comprehending implementation recipes of framework-provided concepts through dynamic analysis.",
                    "A comparison of compilation techniques for trace monitors with free variables.",
                    "Structured co-evolution of models and web application platforms.",
                    "Recursive adaptive computations using perobject visitors.",
                    "A rewriting approach to the design and evolution of object-oriented languages.",
                    "Optimizing java programs using generic types.",
                    "Compile-time type-checking for custom type qualifiers in Java.",
                    "Cruisecontrol.rb: continuous integration the rails way.",
                    "Green: a flexible UML class diagramming tool for eclipse.",
                    "Leveraging integrated model-driven development and software product line development technologies.",
                    "Debugging and testing behavioral UML models.",
                    "Supporting systems QoS design and evolution through model transformations.",
                    "Green applications: software applications that optimize energy usage.",
                    "BigLever software gears and the 3-tiered SPL methodology.",
                    "Theory-infected: or how i learned to stop worrying and love universal quantification.",
                    "Using Sybase WorkSpace to build service oriented architecture (SOA) applications quickly.",
                    "Extracting a domain specific language from an example: a bottom-up method using the ngrease metalanguage.",
                    "Querying in C#: how language integrated query (LINQ) works.",
                    "TuningFork: a platform for visualization and analysis of complex real-time systems.",
                    "Finding bugs in eclipse.",
                    "Democratizing the cloud.",
                    "Visual Basic.",
                    "Security testing with Selenium.",
                    "Ready for distribution?: turning modular into distributed applications with the R-OSGi deployment tool.",
                    "Tools for enforcing and inferring reference immutability in Java.",
                    "P<scp>TIDEJ</scp> and D<scp>ECOR</scp>: identification of design patterns and design defects.",
                    "DEMOCLES: a tool for executable modeling of platform-independent systems.",
                    "DigitalAssets discoverer: automatic identification of reusable software components.",
                    "Model-driven development with predictable quality.",
                    "Mining implementation recipes of framework-provided concepts in dynamic framework API interaction traces.",
                    "Improving quality together.",
                    "Improve software quality with SemmleCode: an eclipse plugin for semantic code search.",
                    "Lagrein: tracking the software development process.",
                    "The JastAdd extensible Java compiler.",
                    "Teaching strategies for reinforcing structural recursion with lists.",
                    "Continuing professional development by practitioner integrated learning.",
                    "Introducing computer science with Project Hoshimi.",
                    "CodeGenie: : a tool for test-driven source code search.",
                    "Compile-time execution structure of object-oriented programs with practical ownership domain annotations.",
                    "Exploiting code search engines to improve programmer productivity.",
                    "Automatic support for model-driven specialization of object-oriented frameworks.",
                    "Activating refactorings faster.",
                    "Round-trip engineering using framework-specific modeling languages.",
                    "Software speculative multithreading for Java.",
                    "Managing the copy-and-paste programming practice in modern IDEs.",
                    "Quality of experience for composite web services (QoE4CWS): focusing on the client.",
                    "Types and program transformations.",
                    "The design and implementation of formal monitoring techniques.",
                    "A proposal for taming uncertainty in the collaborative conceptual model development process.",
                    "Understanding programmer language.",
                    "SmartEMF: guidance in modeling tools.",
                    "The JikesXen Java server platform.",
                    "Detection and correction of design defects in object-oriented designs.",
                    "Combining structural subtyping and external dispatch.",
                    "Effective preparation for design review: using UML arrow checklist leveraged on the Gurus' knowledge.",
                    "Understanding the value of program analysis tools.",
                    "So we thought we knew money.",
                    "IAnticorruption: a domain-driven design approach to more robust integration.",
                    "Agile enterprise software development using domain-driven design and test first.",
                    "A practical high volume software product line.",
                    "Making frameworks work: a project retrospective.",
                    "Celebrating 40 years of language evolution: simula 67 to the present and beyond.",
                    "Domain specific languages: another silver bullet?",
                    "\"No silver bullet\" reloaded: retrospective on \"essence and accidents of software engineering\".",
                    "The role of objects in a services-obsessed world.",
                    "The future of SOA: what worked, what didn't, and where is it going from here?"
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "21st OOPSLA 2006",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2006",
                "sub_name": "Proceedings of the 21th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2006, October 22-26, 2006, Portland, Oregon, USA.",
                "count": 30,
                "papers": [
                    "Eliminating distinctions of class: using prototypes to model virtual classes.",
                    "J&: nested intersection for scalable software composition.",
                    "Statically scoped object adaptation with expanders.",
                    "A framework for implementing pluggable type systems.",
                    "Design fragments make using frameworks easier.",
                    "JTL: the Java tools language.",
                    "Adapting virtual machine techniques for seamless aspect support.",
                    "Efficient control flow quantification.",
                    "Uniform proxies for Java.",
                    "Javana: a system for building customized Java program analysis tools.",
                    "The DaCapo benchmarks: java benchmarking development and analysis.",
                    "Virgil: objects on the head of a pin.",
                    "Declarative, formal, and extensible syntax definition for aspectJ.",
                    "Method-specific dynamic compilation using logistic regression.",
                    "Replay compilation: improving debuggability of a just-in-time compiler.",
                    "A flexible framework for implementing software transactional memory.",
                    "Eliminating synchronization-related atomic operations with biased locking and bulk rebiasing.",
                    "A flow-based approach for variant parametric types.",
                    "Concepts: linguistic support for generic programming in C++.",
                    "Generic ownership for generic Java.",
                    "A formal framework for component deployment.",
                    "An operational semantics and type safety prooffor multiple inheritance in C++.",
                    "Efficient software model checking of data structure properties.",
                    "Isolating and relating concerns in requirements using latent semantic analysis.",
                    "Understanding the shape of Java software.",
                    "XSnippet: mining For sample code.",
                    "Conscientious software.",
                    "Intentional software.",
                    "On system design.",
                    "The paradoxical success of aspect-oriented programming."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2006c",
                "sub_name": "Companion to the 21th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2006, October 22-26, 2006, Portland, Oregon, USA.",
                "count": 130,
                "papers": [
                    "Designed animism.",
                    "Scale changes everything.",
                    "A growable language.",
                    "How to design a good API and why it matters.",
                    "Faith, evolution, and programming languages: from Haskell to Java to links.",
                    "The geography of programming.",
                    "Applying a UML-based agent modeling language to the autonomic computing domain.",
                    "Keeping track of crosscutting requirements in UML models via context-based constraints.",
                    "Pegasus: first steps toward a naturalistic programming language.",
                    "A commensalistic software system.",
                    "Collaborative diffusion: programming antiobjects.",
                    "JDA: a step towards large-scale reuse on the web.",
                    "Model-based DSL frameworks.",
                    "LCSD: library-centric software design.",
                    "Eclipse technology eXchange (ETX) workshop.",
                    "Building software for sensor networks.",
                    "OOPSLA'06 workshop outline: 1st workshop on model-based testing and object-oriented systems (M-TOOS).",
                    "The 6th OOPSLA workshop on domain-specific modeling.",
                    "Workshop on event driven architecture.",
                    "\"Killer examples\" for design patterns: the fifth annual OOPSLA \"Killer Examples\" workshop.",
                    "Escaped from the lab: software practices in large organizations.",
                    "Creating an informative workspace.",
                    "4th int'l workshop on SOA and web services.",
                    "Decoupled design: building applications on the NetBeans platform.",
                    "Ultra-large-scale systems.",
                    "The 6th OOPSLA workshop on domain-specific modeling.",
                    "\"Killer examples\" for design patterns: a poster reporting results of the workshop.",
                    "A programming language with natural persistence.",
                    "Core-java: an expression-oriented java.",
                    "Aspect mining for large systems.",
                    "Improving software development organizations with autochthony.",
                    "Semantics of persistence in the glib programming language.",
                    "Sizing multi-space in heap for application isolation.",
                    "Towards a framework for collaborative and coordinated product configuration.",
                    "Scripting refactorings with JunGL.",
                    "Building Java program analysis tools using Javana.",
                    "VET3D: a tool for execution trace web 3D visualization.",
                    "Dynamic constraint detection for polymorphic behavior.",
                    "The OOPS framework: high level ions for the development of parallel scientific applications.",
                    "Service oriented garbage collection: improving performance and robustness of application servers.",
                    "Ambiance: adaptive object model-based platform for macroprogramming sensor networks.",
                    "Systemizing aspect-oriented framework reuse with AFR.",
                    "Datalog as a pointcut language in aspect-oriented programming.",
                    "The Marmoset project: an automated snapshot, submission, and testing system.",
                    "An evaluation of secialized Java bytecodes.",
                    "Improving your software using static analysis to find bugs.",
                    "Automated upgrading of component-based applications.",
                    "The availability manager design pattern.",
                    "Patterns meta-specification and cataloging: towards knowledge management in software engineering.",
                    "Sourcerer: a search engine for open source code supporting structure-based search.",
                    "Smalltalk card game for learning object-oriented thinking in an evolutionary way.",
                    "Efficient trace monitoring.",
                    "Writing truly efficient smalltalk.",
                    "MetaEdit+: integrated modeling and metamodeling environment for domain-specific languages.",
                    "Web testing made easy.",
                    "Tools for a successful refactoring.",
                    "A simple edit-time metaobject protocol: controlling the display of metadata in programs.",
                    "OO design methodology of a DSL using EMF: (demonstration for the telco revenue assurance domain).",
                    "DigitalAssets Manager, Sharing and Managing Software Development Assets.",
                    "Bringing ownership domains to mainstream Java.",
                    "Mutual satellites: round-trip modeling for complete applications.",
                    "Programming the world with sun SPOTs.",
                    "A visualization of the frame representation language.",
                    "There is no impedance mismatch: (language integrated query in visual basic 9).",
                    "Fluid AOP join point models.",
                    "Aspect mining for large systems.",
                    "DEMOS: a tool for declarative executable modeling of object-based systems.",
                    "Using framework interfaces with design fragments.",
                    "ATL: a QVT-like transformation language.",
                    "Advanced issue tracker in smalltalk.",
                    "SAFARI: a meta-tooling framework for generating language-specific IDE's.",
                    "Flexible event scheduling for data-flow audio processing.",
                    "Integrated solution engineering.",
                    "Adding domain-specific and general purpose language features to Java with the Java language extender.",
                    "CViMe: viewing conditionally compiled C/C++ sources through Java.",
                    "MolhadoRef: a refactoring-aware software configuration management tool.",
                    "A static analysis for extracting runtime views from annotated object-oriented code.",
                    "Language integrated query: unified querying across data sources and programming languages.",
                    "Round-trip engineering of eclipse plug-ins using eclipse workbench part interaction FSML.",
                    "Developing embedded software product lines with AspectC++.",
                    "Transformations to automate model change evolution.",
                    "Improving usability of refactoring tools.",
                    "A study of artifact creation and use in collaborative object-oriented software design.",
                    "Automatic generation and inference of interface properties from program source code.",
                    "Automated test generation for access control policies.",
                    "Optimizing JIT-compilation subsystem for Rotor 2.0.",
                    "The uniconc optimizing unicon compiler.",
                    "Automated testing of pointcuts in AspectJ programs.",
                    "Definition and execution of multiple viewpoints in workflow processes.",
                    "Design fragments make using frameworks easier.",
                    "Using architecture to change code: studying information needs.",
                    "Transformations to automate model change evolution.",
                    "On the usage and usefulness of OO design principles.",
                    "Grammar-driven generation of domain-specific language tools.",
                    "Towards a framework for collaborative and coordinated product configuration.",
                    "Using a role-based coordination model to achieve adaptive and quantifiable dependability for open distributed embedded systems.",
                    "Modal logic & ownership types: uniting three worlds.",
                    "Clone detection and refactoring.",
                    "Using interfaces to support the testing of crosscutting features.",
                    "The composition refactoring triangle (CRT) practical toolkit: from spaghetti to lasagna.",
                    "Incremental return on incremental investment: Engenio's transition to software product line practice.",
                    "Towards agile security in web applications.",
                    "Architectural improvement by use of strategic level domain-driven design.",
                    "Software architecture at a large financial firm.",
                    "Using domain-driven design to evaluate commercial off-the-shelf software.",
                    "OO techniques applied to a real-time, embedded, spaceborne application.",
                    "Secure trade lane: a sensor network solution for more predictable and more secure container shipments.",
                    "Using model-driven engineering to complement software product line engineering in developing software defined radio components and applications.",
                    "Decoupled design: building applications on the NetBeans platform.",
                    "Evolving an embedded domain-specific language in Java.",
                    "The dynamics of changing dynamic memory allocation in a large-scale C++ application.",
                    "Java interfaces in CS 1 textbooks.",
                    "Hello, M.U.P.P.E.T.S.: using a 3D collaborative virtual environment to motivate fundamental object-oriented learning.",
                    "oops: discovering LL(1) through objects.",
                    "A novice's process of object-oriented programming.",
                    "Expertiza: students helping to write an OOD text.",
                    "Helping students appreciate test-driven development (TDD).",
                    "How natural is natural language?: how well do computer science students write use cases?",
                    "Objects and databases: state of the union in 2006.",
                    "The ultra challenge: software systems beyond big.",
                    "Design patterns: beginnings and futures.",
                    "Aspects and/versus modularity the grand debate.",
                    "A fishbowl with piranhas: coalescence, convergence or divergence?",
                    "Young guns/object orientation: the next generation.",
                    "PyPy's approach to virtual machine construction.",
                    "Runtime synthesis of high-performance code from scripting languages.",
                    "Interlanguage migration: from scripts to programs.",
                    "Hop: a language for programming the web 2.0.",
                    "Ambient references: addressing objects in mobile networks.",
                    "Hardware tansactional memory support for lightweight dynamic language evolution."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th OOPSLA 2005",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2005",
                "sub_name": "Proceedings of the 20th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2005, October 16-20, 2005, San Diego, CA, USA.",
                "count": 32,
                "papers": [
                    "Associated types and constraint propagation for mainstream object-oriented generics.",
                    "Generalized algebraic data types and object-oriented programming.",
                    "Scalable component abstractions.",
                    "Demand-driven points-to analysis for Java.",
                    "Deriving object typestates in the presence of inter-object references.",
                    "Micro patterns in Java code.",
                    "ArchMatE: from architectural styles to object-oriented models through exploratory tool support.",
                    "Modeling architectural patterns using architectural primitives.",
                    "Parametric polymorphism for software component architectures.",
                    "Using dependency models to manage complex software architecture.",
                    "Classbox/J: controlling the scope of change in Java.",
                    "Interaction-based programming with classages.",
                    "Javari: adding reference immutability to Java.",
                    "Fine-grained interoperability through mirrors and contracts.",
                    "Pluggable AOP: designing aspect mechanisms for third-party composition.",
                    "Refactoring support for class library migration.",
                    "Automating vertical profiling.",
                    "Improving virtual machine performance using a cross-run profile repository.",
                    "Quantifying the performance of garbage collection vs. explicit memory management.",
                    "Runtime specialization with optimistic heap analysis.",
                    "Adding trace matching with free variables to AspectJ.",
                    "Finding application errors and security flaws using PQL: a program query language.",
                    "Relational queries over program traces.",
                    "Formalising Java RMI with explicit code mobility.",
                    "Lifting sequential graph algorithms for distributed-memory parallel computation.",
                    "Safe futures for Java.",
                    "Combining the robustness of checked exceptions with the flexibility of unchecked exceptions using anchored exception declarations.",
                    "Incrementalization across object abstraction.",
                    "PolyD: a flexible dispatching framework.",
                    "Subtext: uncovering the simplicity of programming.",
                    "X10: an object-oriented approach to non-uniform cluster computing.",
                    "A simple model of agile software processes - or - extreme programming annealed."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2005c",
                "sub_name": "Companion to the 20th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2005, October 16-20, 2005, San Diego, CA, USA.",
                "count": 118,
                "papers": [
                    "Creativity.",
                    "The end of users.",
                    "Finding good design.",
                    "Wikipedia in the free culture revolution.",
                    "Why programming is a good medium for expressing poorly understood and sloppily formulated ideas.",
                    "Designing croquet's TeaTime: a real-time, temporal environment for active object cooperation.",
                    "On creating a handbook of software architecture.",
                    "Constructing a metacircular Virtual machine in an exploratory programming environment.",
                    "Exploring the acceptability envelope.",
                    "Ambient-oriented programming.",
                    "Ercatons and organic programming: say good-bye to planned economy.",
                    "Living structure and the software garden.",
                    "DOSC: dispersed operating system computing.",
                    "A delta-driven execution model for semantic computing.",
                    "Agile environments...: for the rest of us.",
                    "The digital tipping point.",
                    "Parental inheritance.",
                    "The crisis in systems code maintenance: sourceforge, we have a problem.",
                    "Breakthrough ideas.",
                    "abc the aspectBench compiler for aspectJ a workbench for aspect-oriented programming language and compilers research.",
                    "Agile environments...: for the rest of us.",
                    "Ambient-oriented programming in ambientTalk.",
                    "Assisting aspect-oriented framework instantiation: towards modeling, transformation and tool support.",
                    "Beyond the language workbench: a runtime platform for practical semantic computing.",
                    "BoBs: breakable objects.",
                    "Can infopipes facilitate reuse in a traffic application?",
                    "CodeQuest: querying source code with datalog.",
                    "A comprehensive model transformation approach to automated model construction and evolution.",
                    "Developing business object models with patterns and ontologies.",
                    "Green: a customizable UML class diagram plug-in for eclipse.",
                    "High-level declarative user interfaces.",
                    "Implementing incrementalization across object abstraction.",
                    "Improving architecture testability with patterns.",
                    "Incremental exploratory visualization of relationships in large codebases for program comprehension.",
                    "Language constructs for improving reusability in object-oriented software.",
                    "Meta: a universal meta-language for augmenting and unifying language families, featuring meta(oopl) for object-oriented programming languages.",
                    "Model checking the behavior of frameworks extended with other frameworks.",
                    "A model-driven approach to formal refactoring.",
                    "Model-driven software product lines.",
                    "Modeling turnpike: a model-driven framework for domain-specific software development.",
                    "Not so eXtreme programming: agile practices for R&D projects.",
                    "PAD: a pattern-driven analysis and design method.",
                    "Predictability by construction.",
                    "Refactoring the JUnit framework using aspect-oriented programming.",
                    "Scopira: an open source C++ framework for biomedical data analysis applications -- a research project report.",
                    "SDD: high performance code clone detection system for large scale source code.",
                    "Security patterns and evolution of MTA architecture.",
                    "Self-designing software.",
                    "SelfSync: a dynamic round-trip engineering environment.",
                    "Service orchestration patterns: graduating from state of the practice to state of the art.",
                    "The squawk virtual machine: Java on the bare metal.",
                    "Supporting configuration and deployment of component-based DRE systems using frameworks, models, and aspects.",
                    "A technique for utilizing optimization potential during multicode identification.",
                    "Visualizing errors in object oriented programs.",
                    "YARV: yet another RubyVM: innovating the ruby interpreter.",
                    "CanonSketch and TaskSketch: innovative modeling tools for usage-centered design.",
                    "Using dependency models to manage software architecture.",
                    "Io: a small programming language.",
                    "Green: a customizable UML class diagram plug-in for eclipse.",
                    "Generics-related refactorings in eclipse.",
                    "MDAbench: a tool for customized benchmark generation using MDA.",
                    "Testing domain-specific languages in eclipse.",
                    "XJ: robust XML processing in Java.",
                    "An interactive visualization of refactorings retrieved from software archives.",
                    "PatternStudio: a tool for design pattern management.",
                    "GOOAL: an educational object oriented analysis laboratory.",
                    "AutAT: an eclipse plugin for automatic acceptance testing of web applications.",
                    "Automated debugging in eclipse.",
                    "eROSE: guiding programmers in eclipse.",
                    "Using globus grid objects to extend a corba-based object-oriented system.",
                    "SelfSync: a dynamic round-trip engineering environment.",
                    "TableCode: defining, extending and deploying object-oriented programs directly from databases.",
                    "CoJava: a unified language for simulation and optimization.",
                    "Ambient-oriented programming in AmbientTalk: combining mobile hardware with simplicity and expressiveness.",
                    "Incremental exploratory visualization of relationships in large codebases for program comprehension.",
                    "fmp and fmp2rsm: eclipse plug-ins for modeling features using model templates.",
                    "A delta-driven execution model for semantic computing.",
                    "Autonomous optimisation of application servers.",
                    "Formal refactorings for object models.",
                    "Grammar-driven generation of domain-specific language testing tools.",
                    "Inferring context-free grammars for domain-specific languages.",
                    "Metamodel-driven model interpreter evolution.",
                    "Optimisation of service provision for composite web services.",
                    "Pattern transformation for two-dimensional separation of concerns.",
                    "A semi-automated approach for analyzing, separating, and modeling of concerns in evolving systems.",
                    "Software architecture improvement through test-driven development.",
                    "A software product line architecture for distributed real-time and embedded systems: a separation of concerns approach.",
                    "Towards distributed software design meetings: what can we learn from co-located meetings?",
                    "Using refactorings to automatically update component-based applications.",
                    "Adaptive compositions across organizational boundaries.",
                    "Using refactorings to automatically update component-based applications.",
                    "High-level declarative user interfaces.",
                    "Component-based software engineering: a quantitative approach.",
                    "Software architecture improvement through test-driven development.",
                    "Inferring context-free grammars for domain-specific languages.",
                    "System level perspective on object locality.",
                    "Fortune teller: improving garbage collection performance in server environment using live objects prediction.",
                    "Legacy system exorcism by Pareto's principle.",
                    "Estimating software based on use case points.",
                    "Finding the forest in the trees.",
                    "\"Honey, i shrunk the types\": how behavioral types loose relevance on the edges on OO applications and why a core data fabric is useful for adaptability.",
                    "Removing duplication from java.io: a case study using traits.",
                    "Arithmetic with measurements on dynamically-typed object-oriented languages.",
                    "Service-oriented architecture and business process choreography in an order management scenario: rationale, concepts, lessons learned.",
                    "Agility vs. stability at a successful start-up: steps to progress amidst chaos and change.",
                    "Using predicate fields in a highly flexible industrial control system.",
                    "A laboratory for teaching object-oriented language and design concepts with teachlets.",
                    "Teaching OO methodology in a project-driven CS2 course.",
                    "Modeling object-oriented design.",
                    "Roles of variables in object-oriented programming.",
                    "Improving CRC-card role-play with role-play diagrams.",
                    "The practice of specifying requirements using executable acceptance tests in computer science courses.",
                    "Apprenticeship agility in academia.",
                    "Aspects: passing fad or new foundation?",
                    "Fostering software robustness in an increasingly hostile world.",
                    "The agile panel.",
                    "Echoes?: structured design and modern software practices.",
                    "Living with legacy: love it or leave it?"
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "19th OOPSLA 2004",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2004p",
                "sub_name": "Proceedings of the 19th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2004, October 24-28, 2004, Vancouver, BC, Canada.",
                "count": 27,
                "papers": [
                    "Converting Java classes to use generics.",
                    "Converting java programs to use generic libraries.",
                    "A practical type system and language for reference immutability.",
                    "A unified theory of garbage collection.",
                    "The garbage collection advantage: improving program locality.",
                    "MC2: high-performance garbage collection for memory-constrained environments.",
                    "Scalable extensibility via nested inheritance.",
                    "Super and inner: together at last!",
                    "Object-oriented encapsulation for dynamically typed languages.",
                    "Measuring the dynamic behaviour of AspectJ programs.",
                    "Decentralizing execution of composite web services.",
                    "Resolving feature convolution in middleware systems.",
                    "Transparent proxies for java futures.",
                    "An efficient parallel heap compaction algorithm.",
                    "Finding your cronies: static analysis for dynamic object colocation.",
                    "Vertical profiling: understanding the behavior of object-priented applications.",
                    "Method-level phase behavior in java workloads.",
                    "Instrumentation of standard libraries in object-oriented languages: the twin class hierarchy approach.",
                    "Recovering binary class relationships: putting icing on the UML cake.",
                    "Refactoring class hierarchies with KABA.",
                    "Mirrors: design principles for meta-level facilities of object-oriented programming languages.",
                    "Practical predicate dispatch.",
                    "Concrete syntax for objects: domain-specific language embedding and assimilation without restrictions.",
                    "Object-oriented units of measurement.",
                    "Pluggable verification modules: an extensible protection mechanism for the JVM.",
                    "Finding and preventing run-time error handling mistakes.",
                    "Chianti: a tool for change impact analysis of java programs."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2004",
                "sub_name": "Companion to the 19th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2004, October 24-28, 2004, Vancouver, BC, Canada.",
                "count": 115,
                "papers": [
                    "Refactoring: to the rubicon... and beyond!",
                    "jMock: supporting responsibility-based design with mock objects.",
                    "Modeling and implementing software architecture with acme and archJava.",
                    "Advanced refactorings in eclipse.",
                    "JQuery: finding your way through tangled code.",
                    "Modeling event driven applications with a specification language (MEDASL).",
                    "Design snippets: partial design representations extracted from source code.",
                    "Meta-programming for the real world.",
                    "JRA: offline analysis of runtime behaviour.",
                    "Modeling and building software product lines with eclipse.",
                    "PRISM is research in aSpect mining.",
                    "Smell detection for eclipse.",
                    "AJEER: an aspectJ-enabled eclipse runtime.",
                    "Program transformations for re-engineering C++ components [OOPSLA/GPCE].",
                    "C-SAW and genAWeave: a two-level aspect weaving toolsuite.",
                    "The concern manipulation environment [OOPSLA/GPCE].",
                    "Performance explorer: understanding java application behavior.",
                    "ConstrainedJava.",
                    "Object-oriented, structural software configuration management.",
                    "Towards domain-driven development: the smartTools software factory.",
                    "MetaEdit+: domain-specific modeling for full code generation demonstrated [GPCE].",
                    "Implementing DSLs in metaOCaml.",
                    "XIRC: cross-artifact information retrieval [GPCE].",
                    "Modeling dynamics of agile software development.",
                    "Interactive visualization of object-oriented programs.",
                    "Generic ownership: practical ownership control in programming languages.",
                    "A language-independent approach to software maintenance using grammar adapters.",
                    "Modular generics.",
                    "Efficient data race and deadlock prevention in concurrent object-oriented programs.",
                    "A framework for removing redundant context management services in enterprise javaBeans application servers.",
                    "Refining designs along middleware-specific concern-dimensions at different MDA-levels of abstraction.",
                    "\"Objects first, interfaces next\" or interfaces before inheritance.",
                    "Ancestor worship in CS1: on the primacy of arrays.",
                    "greenfoot: combining object visualisation with interaction.",
                    "Examples that can do harm in learning programming.",
                    "If i had a model, i'd model in the mornin'.",
                    "Event-driven programming facilitates learning standard programming concepts.",
                    "Abstract factories and the shape calculator.",
                    "Using the game of life to introduce freshman students to the power and elegance of design patterns.",
                    "From concrete to abstract: the power of generalization.",
                    "Marine biology simulation.",
                    "Notes on notes on postmodern programming: radio edit.",
                    "Languages of the future.",
                    "Protocols for processes: programming in the large for open systems (extended abstract).",
                    "Example centric programming.",
                    "Methodology work is ontology work.",
                    "Looking for love: (in all the wrong places).",
                    "Granule-oriented programming (extended abstract).",
                    "Finding bugs is easy.",
                    "Model driven architecture: the realities, a year later.",
                    "Software development: arts & crafts or math & science?",
                    "The great J2EE vs. microsoft.NET shootout.",
                    "Challenges in outsourcing and global development: how will your job change?",
                    "The role of the customer in software development: the XP customer - fad or fashion?",
                    "The view: the ultimate IT chat.",
                    "QuA: building with reusable QoS-aware components.",
                    "Modeling and implementing software architecture with acme and archJava.",
                    "An invitation to the dance of progress.",
                    "OOLACA: an object oriented library for abstract and computational algebra.",
                    "Pseudo-classes: very simple and lightweight mockObject-like classes for unit-testing.",
                    "Towards a framework for the general intensional programming compiler in the GIPSY.",
                    "An aspect-oriented generative approach.",
                    "Modeling event driven applications with a specification language (MEDASL).",
                    "Improving quality in conceptual modeling.",
                    "Bottleneck analysis in java applications using hardware performance monitors.",
                    "Mobile-D: an agile approach for mobile application development.",
                    "Dependable distributed systems.",
                    "Visualisation for learning OOP, using AOP and eclipse.",
                    "AJEER: an aspectJ-enabled eclipse runtime.",
                    "An open model infrastructure for automotive software.",
                    "Design pattern integrated tool.",
                    "Advancements in multicode optimization.",
                    "J2EE for the public administration: a success story.",
                    "Meta: extending and unifying languages.",
                    "A UML profile for service oriented architectures.",
                    "An approach and tools to automate externalization of application logic.",
                    "Cona: aspects for contracts and contracts for aspects.",
                    "<CTRL>+<ALT>+<TOOL PARADIGM SHIFT>?",
                    "A search system for java programs by using extracted javaBeans components.",
                    "Deriving refactorings for aspectJ.",
                    "RUBiS revisited: why J2EE benchmarking is hard.",
                    "Mobile musical agents: the andante project.",
                    "A core calculus of mixins and incomplete objects.",
                    "RAIL: code instrumentation for .NET.",
                    "iXj: interactive source-to-source transformations for java.",
                    "WSAgent: an agent based on web services to promote interoperability between heterogeneous systems in the health domain.",
                    "AOP as a first class reflective mechanism.",
                    "CoSMIC: addressing crosscutting deployment and configuration concerns of distributed real-time and embedded systems.",
                    "SODA: a stability-oriented domain analysis method.",
                    "Model synchronization as a problem of maximizing model dependencies.",
                    "Reflective composition: the declarative composition of roles to unify objects, roles, and aspects.",
                    "JIVE: Java Interactive Visualization Environment.",
                    "The software architect: essence, intuition, and guiding principles.",
                    "Mock roles, objects.",
                    "Comparison of UML and text based requirements engineering.",
                    "PIP: a product planning strategy for the whole family or... how we became the brady bunch.",
                    "eXtreme ISO ?!?",
                    "Why reuse matters: ANI's digital archive system.",
                    "Hard real-time: C++ versus RTSJ.",
                    "Traits: experience with a language feature.",
                    "Second generation web services-oriented architecture in production in the finance industry.",
                    "Migrating to simpler distributed applications.",
                    "Validating structural properties of nested objects.",
                    "A lightweight LTL runtime verification tool for java.",
                    "NGMF: a generic framework for constructing graph-based systems.",
                    "Supporting software evolution through model-driven program transformation.",
                    "A framework for removing redundant context management services in enterprise javaBeans application servers.",
                    "A language-independent approach to software maintenance using grammar adapters.",
                    "A framework for detecting, assessing and visualizing performance antipatterns in component based systems.",
                    "Refining designs along middleware-specific concern-dimensions at different MDA-levels of abstraction.",
                    "Enhancing distributed object middleware qualities.",
                    "Identification of reusable components within an object-oriented software system using algebraic graph theory.",
                    "Automatic identification of common and special object-oriented unit tests.",
                    "Reverse engineering of UML specifications from java programs.",
                    "Empirical investigation of the impact of extreme programming practices on software projects."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "18th OOPSLA 2003",
        "info": "Anaheim, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2003p",
                "sub_name": "Proceedings of the 2003 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages and Applications, OOPSLA 2003, October 26-30, 2003, Anaheim, CA, USA.",
                "count": 26,
                "papers": [
                    "Language-independent aspect-oriented programming.",
                    "Refactoring for generalization using type constraints.",
                    "Partial behavioral reflection: spatial and temporal selection of reification.",
                    "Applying traits to the smalltalk collection classes.",
                    "OOPAL: integrating array programming in object-oriented programming.",
                    "Automatic detection and repair of errors in data structures.",
                    "A first-class approach to genericity.",
                    "A comparative study of language support for generic programming.",
                    "Lightweight confinement for featherweight Java.",
                    "Dynamic metrics for java.",
                    "How java programs interact with virtual machines at the microarchitectural level.",
                    "Effectiveness of cross-platform optimizations for a java just-in-time compiler.",
                    "HydroJ: object-oriented pattern matching for evolvable distributed systems.",
                    "Relaxed MultiJava: balancing extensibility and modular typechecking.",
                    "MJ: a rational module system for Java and its applications.",
                    "Mostly concurrent garbage collection revisited.",
                    "An on-the-fly mark and sweep garbage collector based on sliding views.",
                    "Heap compression for memory-constrained Java environments.",
                    "Declaring and checking non-null types in an object-oriented language.",
                    "Object equality profiling.",
                    "Mark-copy: fast copying GC with less space overhead.",
                    "Ulterior reference counting: fast garbage collection without a long wait.",
                    "Connectivity-based garbage collection.",
                    "Saving the world from bad beans: deployment-time confinement checking.",
                    "Language support for lightweight transactions.",
                    "Lazy modular upgrades in persistent object stores."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2003",
                "sub_name": "Companion of the 18th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2003, October 26-30, 2003, Anaheim, CA, USA.",
                "count": 101,
                "papers": [
                    "Model driven development: the case for domain oriented programming.",
                    "An end-to-end domain-driven software development framework.",
                    "Software factories: assembling applications with patterns, models, frameworks and tools.",
                    "XAspects: an extensible system for domain-specific aspect languages.",
                    "The power of symmetry: unifying inheritance and generative programming.",
                    "Domain driven web development with WebJinn.",
                    "Smart play-out.",
                    "Visualizing and AspectJ-enabling eclipse plugins using bytecode instrumentation.",
                    "Automated impact analysis of object-oriented software systems.",
                    "A demonstration of JPie: an environment for live software construction in Java.",
                    "Hardware/software codesign in neo smalltalk.",
                    "Reuse learning objects through LOM and XML.",
                    "QuickUML: a tool to support iterative design and code development.",
                    "GME: the generic modeling environment.",
                    "F-Script: smalltalk scripting for the Mac OS X object system.",
                    "ATCT: a Java framework that offers new approach to developing asynchronous processes.",
                    "Generative model transformer.",
                    "Semantic software engineering tools.",
                    "MetaEdit+: defining and using domain-specific modeling languages and code generators.",
                    "A policy based system to incorporate self-managing behaviors in applications.",
                    "Using events to debug Java programs backwards in time.",
                    "Redeveloping a high-Performance computing framework.",
                    "Do you still use a database?",
                    "Jazz: a collaborative application development environment.",
                    "Requirements use case tool (RUT).",
                    "Issues on building T++: a tool for web application development with C++.",
                    "Variant management for embedded software product lines with pure: : consul and AspectC++.",
                    "Building compilers for DirectX 9.0 compatible graphics processors.",
                    "Visual SDLC: improving requirements engineering for object-oriented systems.",
                    "Time Conscious Objects.",
                    "Static analysis of component systems using behavior protocols.",
                    "Metamodel based model transformation language to facilitate domain specific model driven architecture.",
                    "Program manipulation via interactive transformations.",
                    "A framework for using component redundancy for self-adapting and self-optimising component-based enterprise systems.",
                    "Pattern-based model transformation.",
                    "MAS-ML: a multi-agent system modeling language.",
                    "Aspect-oriented implementation method: progressive or non-progressive approach?",
                    "A language based formalism for domain driven development.",
                    "Things they would not teach me of in college: what Microsoft developers learn later.",
                    "An educational perspective on database management systems and object-oriented methodology: a 12 year journey.",
                    "Methodology first and language second: a way to teach object-oriented programming.",
                    "Rethinking computer science education from a test-first perspective.",
                    "Using graphics to support the teaching of fundamental object-oriented principles in CS1.",
                    "Reality abstraction and OO pedagogy: results from 5 weeks in virtual reality.",
                    "Teaching polymorphism with elementary design patterns.",
                    "ProfessorJ: a gradual introduction to Java through language levels.",
                    "Preparing undergraduate students for Java certification.",
                    "Reuse of teaching components: a UML-based approach to delivering and managing academic courses.",
                    "A pair-programming experiment in a non-programming course.",
                    "A framework for building language interpreters.",
                    "Beyond AOP: toward naturalistic programming.",
                    "Routine run-time code generation.",
                    "Acceptability-oriented computing.",
                    "No name: just notes on software reuse.",
                    "Meeting the challenge of software engineering education for working professionals in the 21st century.",
                    "Xtreme programming and agile coaching.",
                    "Discipline and practices of TDD: (test driven development).",
                    "Innovate!",
                    "Model driven architecture: how far have we come, how far can we go?",
                    "Agile management - an oxymoron?: who needs managers anyway?",
                    "Object-oriented success stories: \"learning from our failures\".",
                    "Reuse repositories and reuse: the realities.",
                    "What's so eXtreme about doing things right?",
                    "Application servers: one size fits all ... not?",
                    "Visualizing class interfaces with formal concept analysis.",
                    "Time conscious objects: a domain-specific framework and generator.",
                    "An introduction to fly: a smaller smalltalk.",
                    "Generative model transformer: an open source MDA tool initiative.",
                    "Dynamic personal roles for ubiquitous computing.",
                    "Implications of test-driven development: a pilot study.",
                    "Agile software development for component based software engineering.",
                    "Dynamically updatable component-based system (DUCS).",
                    "MAS-ML: a multi-agent system modeling language.",
                    "*J: a tool for dynamic analysis of Java programs.",
                    "Engineering and reusing stable atomic knowledge (SAK) patterns.",
                    "Extracting domain- specific and domain-independent patterns.",
                    "An approach to monitor application states for self-managing (autonomic) systems.",
                    "Model driven architecture development approach for pervasive computing.",
                    "A framework to enable user directed component binding at run-time.",
                    "Teaching software testing: automatic grading meets test-first coding.",
                    "A modular QoS-enabled load management framework for component-based middleware.",
                    "An AspectJ-enabled eclipse core runtime platform.",
                    "A stable software model for MRI visual analyzer.",
                    "A metamodeling approach to model transformation.",
                    "Multicodes: optimizing virtual machines using bytecode sequences.",
                    "Experience in developing the urbanSim system: tools and processes.",
                    "Experiences using an ODBMS for a high-volume internet banking system.",
                    "Using AspectJ for component integration in middleware.",
                    "Five years of framework building: lessons learned.",
                    "Agile regression testing using record & playback.",
                    "Programming with non-heap memory in the real time specification for Java.",
                    "The parks PDA: a handheld device for theme park guests in squeak.",
                    "Analyzing the use of interfaces in large OO projects.",
                    "A high-level view of Java applications.",
                    "Metamodel based model transformation language.",
                    "A language based formalism for domain driven development.",
                    "A framework for using component redundancy for self-adapting and self-optimising component-based enterprise systems.",
                    "Program manipulation via interactive transformations.",
                    "Issues on building T++, a tool for web application development with C++.",
                    "A self-optimizing application server design for enterprise Java beans applications.",
                    "Model consistency in the object oriented software development process."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "17th OOPSLA 2002",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2002",
                "sub_name": "Proceedings of the 2002 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages and Applications, OOPSLA 2002, Seattle, Washington, USA, November 4-8, 2002.",
                "count": 25,
                "papers": [
                    "Reconsidering custom memory allocation.",
                    "Creating and preserving locality of java applications at allocation and garbage collection times.",
                    "BuddyCache: high-performance object storage for collaborative strong-consistency applications in a WAN.",
                    "Workflow enactment with continuation and future objects.",
                    "Integrating independent components with on-demand remodularization.",
                    "Portable serialization of CORBA objects: a reflective approach.",
                    "Multiple instances and symbolic variables in executable sequence charts.",
                    "A constraint-based architecture for local search.",
                    "Online feedback-directed optimization of Java.",
                    "Lock reservation: Java locks can mostly do without atomic operations.",
                    "Fast algorithm for creating space efficient dispatching tables with application to multi-dispatching.",
                    "Design pattern implementation in Java and aspectJ.",
                    "Implementing distribution and persistence aspects with aspectJ.",
                    "Write barrier removal by static analysis.",
                    "Ownership types for safe programming: preventing data races and deadlocks.",
                    "An analyzable annotation language.",
                    "Performance and scalability of EJB applications.",
                    "Incommunicado: efficient communication for isolates.",
                    "Sifting out the mud: low level C++ code reuse.",
                    "Ownership, encapsulation and the disjointness of type and effect.",
                    "Alias annotations for program understanding.",
                    "Towards a formalization for COM part i: the primitive calculus.",
                    "GCspy: an adaptable heap visualisation framework.",
                    "Access rights analysis for Java.",
                    "Language-specific make technology for the Java programming language."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2002c",
                "sub_name": "Companion of the 17th annual ACM SIGPLAN conference on Object-oriented programming, systems, languages, and applications, OOPSLA 2002, Seattle, Washington, USA, November 4-8, 2002.",
                "count": 58,
                "papers": [
                    "Separation of concerns through semantic annotations.",
                    "The use of domain level semantics to support unanticipated system adaptation.",
                    "An aspect-oriented infrastructure for a typed, stack-based, intermediate assembly language.",
                    "A measure of design readiness: using patterns to facilitate teaching introductory object-oriented design.",
                    "The design and verification of Java's memory model.",
                    "Toward a management framework for self-adaptive systems.",
                    "A framework for performance management of component based distributed applications.",
                    "Modular programming with aspectual collaborations.",
                    "Encapsulating concurrency with Early-Reply.",
                    "CLAM: an OO framework for developing audio and music applications.",
                    "Graduating to objects.",
                    "Business Compilers: towards supporting a highly re-configurable architectural style for service-oriented architecture.",
                    "Developing and evolving Java applications using coordination contracts.",
                    "Nebras Classifier: a generic multi-domain reusable component.",
                    "An approach to building model driven enterprise systems in Nebras Enterprise Framework.",
                    "Java thin clients revisited: an architecture for responsive, live wireless applications.",
                    "Naked Objects.",
                    "GOOAL: a Graphic Object Oriented Analysis Laboratory.",
                    "CATfood, a Code Authoring Tool.",
                    "A FrameWork for high-performance image exploitation.",
                    "A pragmatic view to integrating distributed applications based on CORBA in Nebras Workflow Management system.",
                    "CLAM, yet another library for audio and music processing?",
                    "A coordination methodology and technology for agile businesses.",
                    "Assessing distributed pair programming.",
                    "Emerging software frameworks for exploiting Polymorphous Computing Architectures.",
                    "A translation approach to component specification.",
                    "Seven software engineers as one mind.",
                    "Web-based exercise system for engineering teaching.",
                    "Multilingual distance learning for engineering.",
                    "QuickUML: a beginner's UML tool.",
                    "OODLE: a prototype Object-Oriented Design Learning Environment.",
                    "Stability in a bidding/quotation system.",
                    "Zonnon language experiment, or how to implement a non-conventional object model for .NET.",
                    "Many-to-Many Invocation: a new object oriented paradigm for ad hoc collaborative systems.",
                    "Reusable C++ code for an electron-phonon simulation.",
                    "11th OOPSLA workshop on behavioral semantics: serving the customer.",
                    "Meeting the requirements of a large scale Software Engineering Environment with Open Software solutions.",
                    "Component based development of UDBC.",
                    "Tackling the discovery costs of evolving software systems.",
                    "Specifying and executing requirements: the play-in/play-out approach.",
                    "Automatically generating object models from natural language analysis.",
                    "A definition of convergence in the area of information and telecommunication technologies.",
                    "Realizing adaptive systems.",
                    "Object technology: community and culture.",
                    "2nd workshop on domain-specific visual languages.",
                    "The Javaputer: Java programming in a MOO.",
                    "A bottom-up combinable name service for Peer-to-Peer network.",
                    "Computational performance of Java and C++ in processing fMRI datasets.",
                    "Extracting implicit contracts from .NET libraries.",
                    "Dawn: must J2EE-Webapplications be untestable?",
                    "A protocol for scalable distributed concurrency services.",
                    "Towards stable software analysis patterns.",
                    "Removing GC synchronisation.",
                    "A measure of design readiness: using patterns to facilitate teaching introductory object-oriented design.",
                    "A framework for performance management of component based distributed applications.",
                    "A tool for ownership and confinement analysis of the Java object graph.",
                    "Learning and reuse in visual programming environments: simulation builder for teachers.",
                    "Tool support for refactoring to design patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2002pr",
                "sub_name": "OOPSLA 2002 Practitioners Reports, OOPSLA 2002, Seattle, Washington, USA, November 4-8, 2002.",
                "count": 9,
                "papers": [
                    "Making RUP agile.",
                    "A common multi-platform hardware object model.",
                    "Designing a web services project for maximum value: the 90 day challenge.",
                    "Agile techniques to avoid firefighting at a start-up.",
                    "Defining and implementing a scientific analysis software architecture.",
                    "Hitting the target: adding interaction design to agile software development.",
                    "Transformation of an application data layer.",
                    "Migrating legacy engineering applications to Java.",
                    "Extreme embedded a report from the front line."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "16th OOPSLA 2001",
        "info": "Tampa, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2001",
                "sub_name": "Proceedings of the 2001 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages and Applications, OOPSLA 2001, Tampa, Florida, USA, October 14-18, 2001.",
                "count": 27,
                "papers": [
                    "Contract Soundness for Object-Oriented Languages.",
                    "A Core Calculus for Java Exceptions.",
                    "The Java Syntactic Extender.",
                    "Points-To Analysis for Java using Annotated Constraints.",
                    "A Parameterized Type System for Race-Free Java Programs.",
                    "Object Race Detection.",
                    "A Study of Exception Handling and Its Dynamic Optimization in Java.",
                    "Efficient Subtyping Tests with PQ-Encoding.",
                    "Efficient Implementation of Java Interfaces: Invokeinterface Considered Harmless.",
                    "Multitasking without Compromise: A Virtual Machine Evolution.",
                    "Portable Resource Control in Java: The J-SEAL2 Approach.",
                    "Incremental Computation of Complex Objects Queries.",
                    "Partial Method Compilation using Dynamic Profile Information.",
                    "A Dynamic Optimization Framework for a Java Just-In-Time Compiler.",
                    "Dynamic Optimistic Interprocedural Analysis: A Framework and an Application.",
                    "Jiazzi: New-Age Components for Old-Fashioned Java.",
                    "Modular Mixin-Based Inheritance for Application Frameworks.",
                    "Encapsulating Objects with Confined Types.",
                    "On Objects and Events.",
                    "Visitor Combination and Traversal Control.",
                    "Object-Oriented Composition Untangled.",
                    "A Categorization of Classes based on the Visualization of their Internal Structure: The Class Blueprint.",
                    "Regression Test Selection for Java Software.",
                    "The Architecture of a UML Virtual Machine.",
                    "Pretenuring for Java.",
                    "Controlling Garbage Collection and Heap Growth to Reduce the Execution Time of Java Applications.",
                    "An On-the-Fly Reference Counting Garbage Collector for Java."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "15th OOPSLA 2000",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/2000",
                "sub_name": "Proceedings of the 2000 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages & Applications, OOPSLA 2000, Minneapolis, Minnesota, USA, October 15-19, 2000.",
                "count": 26,
                "papers": [
                    "Improving the Java memory model using CRF.",
                    "Exclusion for composite objects.",
                    "Object-oriented real-time concurrency.",
                    "Adaptive optimization in the Jalapeño JVM.",
                    "Quicksilver: a quasi-static compiler for Java.",
                    "Sealed calls in Java packages.",
                    "A real world object modeling method for creating simulation environment of real-time systems.",
                    "Formal specification of CORBA services: experience and lessons learned.",
                    "Middleware object query processing with deferred updates and autonomous sources.",
                    "MultiJava: modular open classes and symmetric multiple dispatch for Java.",
                    "Parametric polymorphism in Java: an approach to translation based on reflective features.",
                    "Finding refactorings via change metrics.",
                    "Mapping UML designs to Java.",
                    "PIROL: a case study for multidimensional separation of concerns in software engineering environments.",
                    "Safely creating correct subclasses without seeing superclass code.",
                    "OoLALA: an object oriented analysis and design of numerical linear algebra.",
                    "Towards agent-oriented assistance for framework instantiation.",
                    "Practical virtual method call resolution for Java.",
                    "Scalable propagation-based call graph construction algorithms.",
                    "A study of devirtualization techniques for a JavaTM Just-In-Time compiler.",
                    "An efficient class and object encoding.",
                    "A formal specification of JavaTM class loading.",
                    "An Aristotelian understanding of object-oriented programming.",
                    "Application isolation in the JavaTM Virtual Machine.",
                    "An approach to safe object sharing.",
                    "Guava: a dialect of Java without data races."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/2000a",
                "sub_name": "Addendum to the 2000 Proceedings of the Conference on Object-Oriented Programming Systems, Languages and Applications, OOPSLA 2000, Minneapolis, MN, USA, October 15-19, 2000.",
                "count": 91,
                "papers": [
                    "Educators' symposium.",
                    "Cracking the software paradox (panel session).",
                    "Hacker or hero? - extreme programming today (panel session).",
                    "Processes (panel session): the roles of ceremony and adaptation.",
                    "How difficult is the transition from OOA to OOD? (panel session).",
                    "Beyond the hype (panel session): sequel to the trial of the gang of four.",
                    "Emerging B2B eCommerce integration standards - a tower of Babel?",
                    "Back to the future (panel session): Is worse (still) better?",
                    "Remote access to clinical data.",
                    "Modelling infection scenarios - a fixed-price eXtreme programming success story.",
                    "Extreme programming in practice.",
                    "Porting a core CGI workflow system onto a WAS platform while being used and extended to support the enterprise.",
                    "Virtual yacht racing on the Web.",
                    "Designing a flexible services-based architecture for Internet applications.",
                    "A decade of modeling financial vehicles.",
                    "How conceptual system architecture leads to business process.",
                    "Building a large-scale generic object model: applying the CYC upper ontology to object database development in Java.",
                    "Application integration framework for a large business process redesign project.",
                    "ESCORT: lessons from an integration project.",
                    "Application frameworks before system frameworks.",
                    "The camp smalltalk ANSI test suite (poster session).",
                    "Evaluation of coupling in the context of Java interfaces (poster session).",
                    "Global reuse strategy based on use cases (poster session).",
                    "Scenario-based reengineering (poster session).",
                    "A workbench for quality based software re-engineering (Poster).",
                    "Design patterns and real-time object-oriented modeling (poster session).",
                    "Reinvent the wheel (poster session).",
                    "From documents to applications via frameworks (poster session): the tools and materials approach.",
                    "Aspect-oriented frameworks (poster session): the design of adaptable operating systems.",
                    "Towards a two-dimensional separation of concerns (poster session).",
                    "iFlow (poster session): a data streaming application framework based on a uniform abstraction.",
                    "Taking advantage of design patterns in GIS domain (poster session).",
                    "Adaptations to OCL for ensuring quality of geographic data (poster session).",
                    "Constrained objects for modeling complex structures (extended abstract) (poster session).",
                    "Component visualization based on programmer's conceptual models (poster session).",
                    "ContextBox (extended abstract) (poster session): a visual builder for context beans.",
                    "Verdantium towards a Java-enabled compound document model (poster session).",
                    "Component migration with enterprise JavaBeans (poster session).",
                    "Adaptive object-models (poster session).",
                    "An architecture for the evolution of Web applications (poster session).",
                    "R-Rio (poster session): reflective-reconfigurable interconnectable objects.",
                    "Optimization of distributed, object-oriented systems (poster session).",
                    "Transparent fault tolerance for CORBA based distributed components (poster session).",
                    "Object-oriented design and implementation of the multi-agent system AgentTeam (poster session).",
                    "Wireless architecture for access to remote services (WiARS) (poster session).",
                    "Designing XML vocabularies with UML (poster session).",
                    "Introducing the project/process evaluation and development framework (poster session).",
                    "ooSEM (poster session): a process model for object-oriented development in an industrial environment.",
                    "Refactoring tool challenges in a strongly typed language (poster session).",
                    "State machine specification directly in Java and C++ (poster session).",
                    "JML (poster session): notations and tools supporting detailed design in Java.",
                    "MixJuice (poster session): an object-oriented language with simple and powerful module mechanism.",
                    "Fantastic, unique, UML tool for the Java environment (FUUT-je) (poster session).",
                    "Decompile Java class files with soot! (poster session).",
                    "Soot (poster session): a Java bytecode optimization and annotation framework.",
                    "Multi-dispatch in the Java Virtual Machine (poster session): design and implementation.",
                    "Towards a graphical notation to express the C++ template instantiation process (poster session).",
                    "Adding parametric polymorphism to the common object request broker architecture (CORBA) (poster session).",
                    "The META4 programming language overview (poster session).",
                    "Kava - a powerful and portable reflective Java (poster session).",
                    "Adaptive optimization in the Jalapeño JVM (poster session).",
                    "On the predictability of Java byte codes (abstract) (poster session).",
                    "Profile-driven pretenuring for Java (poster session).",
                    "Deploying lightweight processes (poster session).",
                    "Ninth OOPSLA workshop on behavioral semantics (poster session).",
                    "Introducing patterns (or any new idea) into organizations (poster session).",
                    "Active learning for object-oriented design (poster session).",
                    "The pedagogical patterns project (poster session).",
                    "Object principles (poster session): back to basics.",
                    "A minimalist approach to framework documentation.",
                    "The META4 programming language.",
                    "Calculating in an object-oriented iterator-view-generator framework.",
                    "Building an object oriented problem solving environment for the parallel numerical solution of PDEs.",
                    "Model and techniques to specify, develop and use a framework: a meta modeling approach.",
                    "Optimization of distributed, object-oriented systems.",
                    "Safely creating correct subclasses without seeing superclass code.",
                    "A workbench for quality based software re-engineering (Doctoral Symposium).",
                    "Constrained objects for modeling complex structures (extended abstract).",
                    "An understandability metrics for object oriented programs.",
                    "AspectJ: the language and support tools.",
                    "DejaVu: deterministic Java replay debugger for Jalapeño Java virtual machine.",
                    "PetShop: a tool for the formal specification of CORBA systems.",
                    "Transparent and flexible storage of application objects in CORBA environments.",
                    "Tool-box frameworks - the new challenge beyond black-box and white-box.",
                    "GLORP: generic lightweight object-relational persistence.",
                    "Clinical trial remote data capture client/server solution.",
                    "Customer context server application enabling customer-focused e-commerce.",
                    "FoodSmart - a large-scale distributed object system.",
                    "Implementing NetUnify.com using squeak.",
                    "Documenter: a simple geographical information system.",
                    "Tilcara: an OO perspective to handle continuous fields in GIS."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "14th OOPSLA 1999",
        "info": "Denver, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1999",
                "sub_name": "Proceedings of the 1999 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages & Applications, OOPSLA 1999, Denver, Colorado, USA, November 1-5, 1999.",
                "count": 30,
                "papers": [
                    "Escape Analysis for Java.",
                    "Escape Analysis for Object-Oriented Languages: Application to Java.",
                    "Removing Unnecessary Synchronization in Java.",
                    "Detecting Defects in Object-Oriented Designs: Using Reading Techniques to Increase Software Quality.",
                    "A Problem-Oriented Analysis of Basic UML Static Requirements Modeling Concepts.",
                    "A Language for Specifying Recursive Traversals of Object Structures.",
                    "Confined Types.",
                    "Modular Type-Based Reverse Engineering of Parameterized Types in Java Code.",
                    "Semantic Analysis of Virtual Classes and Tested Classes.",
                    "Featherwieght Java: A Minimal Core Calculus for Java and GJ.",
                    "A Formal Framework for the Java Bytecode Language and Verifier.",
                    "Correspondence Polymorphism for Object-Oriented Languages.",
                    "Compositional Pointer and Escape Analysis for Java Programs.",
                    "An Efficient Meta-Lock for Implementing Ubiquitous Synchronization.",
                    "A Study of Locking Objects with Bimodal Fields.",
                    "Efficient Multiple and Predicated Dispatching.",
                    "Space and Time-Efficient Memory Layout for Multiple Inheritance.",
                    "Reducing Transfer Delay Using Java Class File Splitting and Prefetching.",
                    "Practical Experience with an Application Extractor for Java.",
                    "A Performance Evaluation of the Mobile Agent Paradigm.",
                    "Implementing Jalapeño in Java.",
                    "Subject-Oriented Design: Towards Improved Alignment of Requirements, Design, and Code.",
                    "Atlas: A Case Study in Building a Web-Based Learning Environment using Aspect-oriented Programming.",
                    "Role Model Designs and Implementations with Aspect-oriented Programming.",
                    "Age-Based Garbage Collection.",
                    "Mostly-copying Reachability-based Orthogonal Persistence.",
                    "The Generic Graph Component Library.",
                    "Zones, Contracts and Absorbing Changes: An Approach to Software Evolution.",
                    "A Distributed Object-Oriented Framework for Dependable Multiparty Interactions.",
                    "Object Views: Language Support for Intelligent Object Caching in Parallel and Distributed Computations."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "13th OOPSLA 1998",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1998",
                "sub_name": "Proceedings of the 1998 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages & Applications, OOPSLA 1998, Vancouver, British Columbia, Canada, October 18-22, 1998.",
                "count": 32,
                "papers": [
                    "An Evaluation of Automatic Object Inline Allocation Techniques.",
                    "JRes: A Resource Accounting Interface for Java.",
                    "Dynamics Class Loading in the Java Virtual Machine.",
                    "Object-Oriented Practice in 1998: Does it help or hinder collaboration? (Panel).",
                    "Ownership Types for Flexible Alias Protection.",
                    "Borrow, Copy or Steal? Loans and Larceny in the Orthodox Canonical Form.",
                    "Safe Metaclass Programming.",
                    "Adaptive Plug-and-Play Components for Evolutionary Software Development.",
                    "Role Model Based Framework Design and Integration.",
                    "How to Preserve the Benefits of Design Patterns.",
                    "Data Groups: Specifying the Modification of Extended State.",
                    "Logical Observable Entities.",
                    "A Lambda Calculus of Objects with Self-Inflicted Extension.",
                    "The New Crop of Java Virtual Machines (Panel).",
                    "Making the Future Safe for the Past: Adding Genericity to the Java Programming Language.",
                    "Compatible Genericity with Run-Time Types for the Java Programming Language.",
                    "Parametric Polymorphism for Java: A Reflective Solution.",
                    "Question time! about Use Cases.",
                    "Vclusters: A Flexible, Fine-Grained Object Clustering Mechanism.",
                    "System Support for Object Groups.",
                    "Extending the ODMG Object Model with Composite Objects.",
                    "Visualizing Dynamic Software System Information Through High-Level Models.",
                    "Object Lessons Learned from a Distributed System for Remote Building Monitoring and Operation.",
                    "Lightweight Object-Oriented Shared Variables for Distributed Applications on the Internet.",
                    "A Type System for Object Initialization in the Java Bytecode Language.",
                    "Reasoning about Java Classes (Preliminary Report).",
                    "What is Java Binary Compatibility?",
                    "Compound Types for Java.",
                    "Multiple Dispatch as Dispatch on Tuples.",
                    "Contraint-Based Polymorphism in Cecil: Towards a Practical and Static Type System.",
                    "Building Distributed Systems (Panel).",
                    "Software Reuse: Nemesis or Nirvana? (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "12th OOPSLA 1997",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1997",
                "sub_name": "Proceedings of the 1997 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages & Applications, OOPSLA 1997, Atlanta, Georgia, October 5-9, 1997.",
                "count": 29,
                "papers": [
                    "Maintaining the Consistency of Class Libraries During Their Evolution.",
                    "Analyzing and Measuring Reusability in Object-Oriented Designs.",
                    "Reuse of Algorithms: Still a Challenge to Object-Oriented Programming.",
                    "Adding Type Parameterization to the Java Language.",
                    "Parasitic Methods: An Implementation of Multi-Methods for Java.",
                    "Modeling Dynamic Collections of Interdependent Objects Using Path-Based Rules.",
                    "Looking for the Objects in Object-Relational DBMSs (Panel).",
                    "A Framework for Scalbale Dissemination-Based Systems.",
                    "Exploring Largebess, Complexity and Scalability from the OOT Perspective (Panel).",
                    "Call Graph Construction in Object-Oriented Languages.",
                    "Efficient Dynamic Dispatch without Virtual Function Tables: The SmallEiffel Compiler.",
                    "Efficient Type Inclusion Tests.",
                    "Changing the Engine of the Car? While Driving 60 Miles an Hour! (Panel).",
                    "Garbage Collecting the World: One Car at a Time.",
                    "Ephemerons: A New Finalization Mechanism.",
                    "The Design and Performance of a Hard Real-Time Object Event Service.",
                    "UML: The Language of Blueprints for Software? (Panel).",
                    "Tiling Design Patterns - A Case Study Using the Interpreter Pattern.",
                    "Composite Design Patterns.",
                    "An Open Implementation Analysis and Design for Lightweight Threads.",
                    "Migrating Relational Data to an OODB: Strategies and Lessons from a Molecular Biology Experience.",
                    "The ODMG Object Model: Does it Make Sense?",
                    "Class Hierarchy Specialization.",
                    "Declarative Specialization of Object-Oriented Programs.",
                    "The OT Life-cycle: From Eureka! to Shrink Wrap (Panel).",
                    "Query-Based Debugging of Object-Oriented Programs.",
                    "Back to the Future: The Story of Squeak - A Usable Smalltalk Written in Itself.",
                    "Constraint Diagrams: Visualizing Assertions in Object-Oriented Models.",
                    "Beyond the Hype: Do Patterns and Frameworks Reduce Discovery Costs? (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "11th OOPSLA 1996",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1996",
                "sub_name": "Proceedings of the 1996 ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages & Applications, OOPSLA 1996, San Jose, California, USA, October 6-10, 1996.",
                "count": 32,
                "papers": [
                    "An Equational Object-Oriented Data Model and its Data-Parallel Query Language.",
                    "Creating Host Compliance in a Portable Framework: A Study in the Use of Existing Design Patterns.",
                    "A Flexible Operation Execution Model for Shared Distributed Objects.",
                    "Code Reuse in an Optimizing Compiler.",
                    "A Monotonic Superclass Linearization for Dylan.",
                    "Vortex: An Optimizing Compiler for Object-Oriented Languages.",
                    "Perspectives on Reuse (Panel Session).",
                    "The Basic Object System: Supporting a Spectrum From Prototypes To Hardened Code.",
                    "Split Objects: a Disciplined Use of Delegation within Objects.",
                    "Reorganizing Split Objects.",
                    "Lessons Learned from Implementing the CORBA Persistent Object Service.",
                    "A Situated Evaluation of the Object Management Group's (OMG) Object Management Architecture (OMA).",
                    "Slicing Class Hierarchies in C++.",
                    "A Functional Layer for Description Logics: Knowledge Representation Meets Object-Oriented Programing.",
                    "Environmental Acquisition - A New Inheritance-Like Abstraction Mechanism.",
                    "Soft Issues in Software Development (Panel Session).",
                    "Automatic Inheritance Hierarchy Restructuring and Method Refactoring.",
                    "On Automatic Class Insertion with Overloading.",
                    "Reuse Contracts: Managing the Evolution of Reusable Assets.",
                    "OO Anthropology: Crossing the Chasm (Panel Session).",
                    "Simple and Effective Analysis of Statically Typed Object-Oriented Programs.",
                    "The Direct Cost of Virtual Function Calls in C++.",
                    "Fast Static Analysis of C++ Virtual Function Calls.",
                    "Change Cases: Use Cases that Identify Future Requirements.",
                    "Using Role Components to Implement Collaboration-Based Designs.",
                    "Formal Design Constraints.",
                    "Objects on the Server: Are We Ready? (Panel Session).",
                    "Architecture-Oriented Visualization.",
                    "A Framework for Run-Time Systems and its Visual Programming Language.",
                    "Semantic-Based Visualization for Parallel Object-Oriented Programming.",
                    "Translation: Myth or Reality? (Panel Session).",
                    "Components on the Internet (Panel Session)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "10th OOPSLA 1995",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1995",
                "sub_name": "Proceedings of the Tenth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1995, Austin, Texas, USA, October 15-19, 1995.",
                "count": 40,
                "papers": [
                    "Extending the Statechart Formalism: Event Scheduling & Disposition.",
                    "Object-Oriented State Machines: Subclassing, Composition, Delegation and Genericity.",
                    "Lessons from the Experiences of Leading-Edge Object Technology Projects in Hewlett Packard.",
                    "The Self-4.0 User Interface: Manifesting a System-wide Vision of Concreteness, Uniformity and Flexibility.",
                    "Using a Prototype-based Language for User Interface: The Newton Project's Experience.",
                    "Annotating Objects for Transport to Other Worlds.",
                    "Managing Object Oriented Projects - Panel Session.",
                    "Type Feedback vs. Concrete Type Inference: A Comparison of Optimization Techniques for Object-Oriented Languages.",
                    "Profile-Guided Receiver Class Prediction.",
                    "Bidirectional Object Layout for Separate Compilation.",
                    "OO Testing in the Real World: Lessons for All - Panel Session.",
                    "Minimizing Row Displacement Dispatch Tables.",
                    "Subtypes vs. Where Clauses: Constraining Parametric Polymorphism.",
                    "Sound Polymorphic Type Inference for Objects.",
                    "Tailoring OO Analysis and Design Methods - Panel Session.",
                    "An Algebraic Semantics of Subobjects.",
                    "Modular Reasoning in the Presence of Subclassing.",
                    "On the Semantic Diversity of Delegation-Based Programming Languages.",
                    "Patterns: Cult to Culture? - Panel Session.",
                    "Subject-Oriented Composition Rules.",
                    "How and Why to Encapsulate Class Trees.",
                    "A Reflective Model for First Class Dependencies.",
                    "Systematic Software Reuse - Panel Session.",
                    "The Future of Distributed Object Computing - Panel Session.",
                    "A Metaobject Protocol for C++.",
                    "Compiling Away the Meta-Level in Object-Oriented Concurrent Reflective Languages Using Partial Evaluation.",
                    "Towards a Methodology for Explicit Composition of MetaObjects.",
                    "Object and Database Standards - Panel Session.",
                    "Objects and Domain Engineering - Panel Session.",
                    "Patterns in Practice.",
                    "Interactive Visualization of Design Patterns Can Help in Framework Understanding.",
                    "A Framework for Network Protocol Software.",
                    "Creating the Architecture of a Manufacturing Framework by Design Patterns.",
                    "SCONE: Using Concurrent Objects for Low-level Operating System Programming.",
                    "Problem-Oriented Object Memory: Customizing Consistency.",
                    "Evolving to Objects - The Witches' Brew.",
                    "Release-to-Release Binary Compatibility in SOM.",
                    "Lessons from the Battlefield.",
                    "SmartFiles: An OO Approach to Data File Interoperabilty.",
                    "Extending SQL-92 for OODB Access: Design and Implementation Experience."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "9th OOPSLA 1994",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1994",
                "sub_name": "Proceedings of the Ninth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1994, Portland, Oregon, USA, October 23-27, 1994.",
                "count": 37,
                "papers": [
                    "Typechecking and Modules for Multi-Methods.",
                    "Application of OOP Type Theory: State, Decidability, Integragtion.",
                    "Type-Theoretic Foundations for Concurrent Object-Oriented Programming.",
                    "Panel: Training Professionals in Object Technology.",
                    "ODE: A Self-Guided, Scenario-Based Learning Environment for Object-Oriented Design Principles.",
                    "Virtual Images: Interactive Visualization of Distributed Object-Oriented Systems.",
                    "Building Tailorable Hypermedia Systems: The Embedded-Interpreter Approach.",
                    "Prototype-Based Languages: Object Lessons from Class-Free Programming (Panel).",
                    "A Distributed Garbage Collector for Active Objects.",
                    "Persistent Shared Object Support in the Guide System: Evaluation & Related Work.",
                    "Smalltalk in the Business World: The Good, the Bad, and the Future (Panel).",
                    "Genericity versus Inheritance Reconsidered: Self-Reference Using Generics.",
                    "Proposal for a Monotonic Multiple Inheritance Linearization.",
                    "Interfaces, Protocols, and the Semi-Automatic Construction of Software Adaptors.",
                    "Extensible File Systems (ELFS): An Object-Oriented Approach to High Performance File I/O.",
                    "Development of an OO Infrastructure for Mainframe Database Applications.",
                    "MI - An Object Oriented Environment for Integration of Scientific Applications.",
                    "Methodology Standards: Help or Hindrance?",
                    "A Third-Generation SELF Implementation: Reconsiling Responsiveness with Performance.",
                    "Optimizing Multi-Method Dispatch Using Compressed Dispatch Tables.",
                    "Implementing Constraint Imperative Programming Languages: The Kaleidospace'93 Virtual Machine.",
                    "Complex Associations: Abstractions in Object-Oriented Modeling.",
                    "Streamlining the Project Cycle With Object-Oriented Requirements.",
                    "Timethread-Role Maps for Object-Oriented Design of Real-Time-and-Distributed Systems.",
                    "Development of Distributed and Client/Server Object-Oriented Applications: Industry Solutions (Panel).",
                    "Precise Concrete Type Inference for Object-Oriented Languages.",
                    "Reducing Cross Domain Call Overhead using Batched Futures.",
                    "Sifting Out the Gold.",
                    "Objects and Databases (Panel).",
                    "Persistent Storgage for a Workflow Tool Implemented in Smalltalk.",
                    "Semantic Locking in Object-Oriented Database Systems.",
                    "Experience with Representing C++ Program Information in an Object-Oriented Database.",
                    "A Status Report on the oo7 OODBMS Benchmarking Effort.",
                    "Composition of Before/After Metaclasses in SOM.",
                    "Reflections on Metaclass Rorgramming in SOM.",
                    "Combining Contracts and Exemplar-Based Programming for Class Hiding and Customization.",
                    "How Do Teams Shape Objects ? - How Di Object Shape Teams ? (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "8th OOPSLA 1993",
        "info": "Washington, D.C., USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1993",
                "sub_name": "Proceedings of the Eighth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1993, Washington, DC, USA, September 26 - October 1, 1993.",
                "count": 43,
                "papers": [
                    "Regular Types for Active Objects.",
                    "Specifications and Their Use in Defining Subtypes.",
                    "Safe and Decidable Type Checking in an Object-Oriented Language.",
                    "Panel - Which Method is Best?",
                    "Tools for the Development of Application-Specific Virtual Memory Management.",
                    "A Framework for Dynamic Program Analyzers.",
                    "Experiences Developing and Using an Object-Oriented Library for Program Manipulation.",
                    "Status of Object-Oriented COBOL (Panel).",
                    "CHARM++: A Portable Concurrent Object Oriented System Based On C++.",
                    "Highly Efficient and Encapsulated Re-use of Synchronization Code in Concurrent Object-Oriented Languages.",
                    "Ada 9X: From Abstraction-Oriented to Object-Oriented.",
                    "Developing Software for Large-Scal Reuse (Panel).",
                    "The Amadeus GRT - Generic Runtime Support for Distributed Persistent Programming.",
                    "Object Distribution in Orca using Compile-Time and Run-Time Techniques.",
                    "Object-Oriented Execution of OPS5 Production Systems.",
                    "Doing Business with Governments (Panel).",
                    "IRIS Inventor, A 3D Graphics Toolkit.",
                    "Typing the Specialization Interface.",
                    "Strongtalk: Typechecking Smalltalk in a Production Environment.",
                    "Inheritance Modeled with Explicit Bindings: An Approach to Typed Inheritance.",
                    "On the Purpose of Object-Oriented Analysis.",
                    "A Discussion of \"On the Purpose of Object-Oriented Analysis\" (Panel).",
                    "Selector Table Indexing & Sparse Arrays.",
                    "Efficient Handling of Multiple Inheritance Hierarchies.",
                    "Object Fault Handling for Persistent Programming Languages: A Performance Evaluation.",
                    "Integrating Object-Oriented Technolgy and Security Technology: A Panel Discussion.",
                    "Modeling Security Requirements for Applications (Panel).",
                    "Object Oriented Approach to MLS Database Application Design (Panel).",
                    "Security for OODBMS (Or Systems) - Panel.",
                    "Reconciling Objects and Multilevel Security (Panel).",
                    "GROOP: An Object-Oriented Toolkit for Animated 3D Graphics.",
                    "Visualizing the Behavior of Object-Oriented Systems.",
                    "Structural Active Object Systems for Simulation.",
                    "Software Architecture: The Next Step for Object Technology (Panel).",
                    "Panel - Is Multiple Inheritance Essential to OOP?",
                    "Panel: Distributed Processing.",
                    "Impacts of Object-Oriented Technologies: Seven Years of SEL Studies.",
                    "Evolving Toward Object-Oriented Technolgy in Large Organizations (Panel).",
                    "Roles for Composite Objects in Object-Oriented Analysis and Design.",
                    "Building and Maintaining Analysis-Level Class Hierarchies Using Galois Lattices.",
                    "Subject-Oriented Programming (A Critique of Pure Objects).",
                    "How to Get a Paper Accepted at OOPSLA (Panel).",
                    "Strategies for Object-Oriented Technology Transfer (Panel)."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/1993w",
                "sub_name": "Security for Object-Oriented Systems, Proceedings of the OOPSLA-93 Conference Workshop on Security for Object-Oriented Systems, Washington, DC, USA, 26 September 1993.",
                "count": 17,
                "papers": [
                    "Security for Object-Oriented Systems: An Editorial Overview.",
                    "Integrating Object Oriented Technology and Security in Medical Database Systems.",
                    "The Security Facilities of PCTE.",
                    "A Base for Secure Object Oriented Environments.",
                    "An Object-Oriented Application Security Framework.",
                    "Multilevel Security in Object-Oriented Databases.",
                    "Object-Oriented Security in the Trusted MachTM Operating System.",
                    "Enforcing Mandatory Access Control in Object Bases.",
                    "Information Flow Control in Object-Oriented Programs.",
                    "A Method-Based Authorization Model for Object-Oriented Databases.",
                    "The Factors that Influence Apropos Security Approaches for the Object-Oriented Paradigm.",
                    "An Access Control Model or a Parallel Object-Based Programming Language.",
                    "Research Issues in Discretionary Authorizations for Object Bases.",
                    "Using Object Modeling Techniques to Design MLS Data Models.",
                    "Can We Do Without Monotonically Non-Decreasing Levels in Class Hierarchies?",
                    "Concurrency, Synchronization, and Scheduling to Support High-Assurance Write-Up in Multilevel Object-Based Computing.",
                    "Secure Database Interoperation via Dynamic Addition of Roles."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "7th OOPSLA 1992",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1992",
                "sub_name": "Proceedings of the Seventh Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1992, Vancouver, British Columbia, Canada, October 18-22, 1992.",
                "count": 38,
                "papers": [
                    "Interfaces and Specifications for the Smalltalk-80 Collection Classes.",
                    "Monotonic Conflict Resolution Mechanisms for Inheritance.",
                    "Combination of Inheritance Hierarchies.",
                    "Reuse: Truth or Fiction (Panel).",
                    "The Process of Object-Oriented Design.",
                    "Documenting Frameworks using Patterns.",
                    "What Contributes to Successful Object-Oriented Learning?",
                    "OOP in Languages Providing Strong, Static Typing (Panel).",
                    "A Comparative Performance Evaluation of Write Barrier Implementations.",
                    "Optimizing Method Search with Lookup Caches and Incremental Coloring.",
                    "Object-Oriented Concurrent Reflective Languages can be Implemented Efficiently.",
                    "The Role of Methods and CASE in OO Development (Panel).",
                    "Visualizing Objects: Methods for Exploring Human Computer Interaction Concepts.",
                    "The Object-Oriented Implementation of a Document Editor.",
                    "ET++ Swaps Manager: Using Object Technology in the Financial Engineering Domain.",
                    "Preliminary Defect Data from the Iterative Development of a Large C++ Program.",
                    "Declarative Programming in a Prototype-Instance System: Object-Oriented Programming Without Writing Methods.",
                    "Prototype-Based Languages: From a New Taxonomy to Constructive Proposals and Their Validation.",
                    "Constraint Patterns As a Basis for Object-Oriented Programming.",
                    "Experimental Classification Facilities for Smalltalk.",
                    "Distributed Shared Memory with Versioned Objects.",
                    "CACL: Efficient Fine-Grained Protection for Objects.",
                    "DROL: An Object-Oriented Programming Language for Distributed Real-Time Systems.",
                    "From Events to Objects: The Heresy of Event-Orientation in a World of Objects (Panel).",
                    "Ensuring Semantic Integrity of Reusable Objects (Panel).",
                    "Communication Mechanism on Autonomous Objects.",
                    "A Formalism for Real-Time Concurrent Object-Oriented Computing.",
                    "Concurrency Annotations.",
                    "Obstacles in Object-Oriented Software Development.",
                    "Object-Oriented System Modeling with OMT.",
                    "Case Study of Object-Oriented Software Development.",
                    "Object-Oriented Megaprogramming (Panel).",
                    "Lightweight Shared Objects in a 64-Bit Operating System.",
                    "The Apertos Reflective Operating System: The Concept and its Implementation.",
                    "Issues in the Design and Documentation of Class Libraries.",
                    "Tunable Formalism in Object-Oriented Systems Analysis: Meeting the Needs of Both Theoreticians and Practitioners.",
                    "Architectures with Pictures.",
                    "The OO Software Development Process (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "6th OOPSLA 1991",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1991",
                "sub_name": "Proceedings of the Sixth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1991, Phoenix, Arizona, USA, October 6-11, 1991.",
                "count": 30,
                "papers": [
                    "Making Pure Object-Oriented Languages Practical.",
                    "Parallel Generational Garbage Collection.",
                    "Using Key Object Opportunism to Collect Old Objects.",
                    "Integrating Information Retrieval and Domain Specific Approaches for Browsing and Retrieval in Object-Oriented Class Libraries.",
                    "Portia: AN Instance-Centered Environment for Smalltalk.",
                    "Developing a GUIDE Using Object-Oriented Programming.",
                    "Building Generic User Interface Tools: an Experience with Multiple Inheritance.",
                    "Composite Multimedia and Active Objects.",
                    "Static Type Checking of Multi-Methods.",
                    "A Static Type System for Message Passing.",
                    "Object-Oriented Type Inference.",
                    "Can Structured Methods be Objectified? (Panel).",
                    "Issues in Moving from C to C++ (Panel).",
                    "Formal Techniques for OO Software Development (Panel).",
                    "Coherent Models for Object-Oriented Analysis.",
                    "An Empirical Study of the Object-Oriented Paradigm and Software Reuse.",
                    "Towards a Metrics Suite for Object Oriented Design.",
                    "Communication as Fair Distribution of Knowledge.",
                    "The Kala Basket: A Semantic Primitive Unifying Object Transactions, Access Control, Versions, and Configurations.",
                    "An Extensible Kernel Object Management System.",
                    "The Economics of Software Reuse (Panel).",
                    "Islands: Aliasing Protection in Object-Oriented Languages.",
                    "Equate: An Object-Oriented Constraint Solver.",
                    "Object-Preserving Class Transformations.",
                    "Experiences in DBMS Implementation Using an Object-Oriented Persistent Programming Language and a Database Toolkit.",
                    "Symbolic and Spatial Database for Structural Biology.",
                    "Re-engineering of Old Systems to an Object-Oriented Database.",
                    "OOP and AI (Panel).",
                    "Managing the Transition to Object-Oriented Technology (Panel).",
                    "How to Get Your Paper Accepted at OOPSLA."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "5th OOPSLA 1990 / 4th ECOOP 1990",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1990",
                "sub_name": "Conference on Object-Oriented Programming Systems, Languages, and Applications / European Conference on Object-Oriented Programming, OOPSLA/ECOOP 1990, Ottawa, Canada, October 21-25, 1990, Proceedings.",
                "count": 35,
                "papers": [
                    "The Design of the C++ Booch Components.",
                    "An Iterative-Design Model for Reusable Object-Oriented Software.",
                    "Graphical Specification of Object-Oriented Systems.",
                    "Viewing Objects as Patterns of Communicating Agents.",
                    "LO and Behold! Concurrent Structured Processes.",
                    "Actors as a Special Case of Concurrent Constraint Programming.",
                    "Beyond Schema Evolution to Database Reorganization.",
                    "Kaleidoscope: Mixing Objects, Constraints and Imperative Programming.",
                    "What Tracers Are Made Of.",
                    "Foundations of Concurrent Object-Oriented Programming (Panel).",
                    "A Logical Theory of Concurrent Objects.",
                    "Message Pattern Specifications: A New Technique for Handling Errors in Parallel Object Oriented Systems.",
                    "Garbage Collection of Actors.",
                    "Structured Analysis and Object Oriented Analysis (Panel).",
                    "Strong Typing of Object-Oriented Languages Revisited.",
                    "Type Substitution for Object-Oriented Programming.",
                    "A Parallel Object-Oriented Language with Inheritance and Subtyping.",
                    "Contracts: Specifying Behavioural Compositions in Object-Oriented Systems.",
                    "When Objects Collide: Experiences with Reusing Multiple Class Hierarchies.",
                    "PCLOS: Stress Testing CLOS Experiencing the Metaobject Protocol.",
                    "Reasoning about Object-Oriented Programs that Use Subtypes.",
                    "Type Consistency of Queries in an Object-Oriented Database System.",
                    "Designing Reusable Designs - Experiences Designing Object-Oriented Frameworks (Panel).",
                    "Issues in Object Database Management.",
                    "A Framework for Visualizing Object-Oriented Systems.",
                    "Painting Multiple Views of Complex Objects.",
                    "MoDE: A UIMS for Smalltalk.",
                    "COOL: Kernel Support for Object-Oriented Environments.",
                    "The Performance of an Object-Oriented Threads Package.",
                    "Object-Oriented Real-Time Language Design: Constructs for Timing Constraints.",
                    "OOP in the Real World (Panel).",
                    "Mixin-based Inheritance.",
                    "The Point of View Notion for Multiple Inheritance.",
                    "Exception Handling and Object-Oriented Programming: Towards a Synthesis.",
                    "OOPSLA Distributed Object Management (Panel)."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "4th OOPSLA 1989",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1989",
                "sub_name": "Conference on Object-Oriented Programming: Systems, Languages, and Applications, OOPSLA 1989, New Orleans, Louisiana, USA, October 1-6, 1989, Proceedings.",
                "count": 54,
                "papers": [
                    "A Laboratory for Teaching Object-Oriented Thinking.",
                    "Problem-Solution Mapping in Object-Oriented Design.",
                    "Contributions to Teaching Object Oriented Design and Programming.",
                    "Design of the Opportunistic Garbage Collector.",
                    "Incremental Distribution of Timestamp Packets: A New Approach to Distributed Garbage Collection.",
                    "An Efficient Implementation of SELF - a Dynamically-Typed Object-Oriented Language Based on Prototypes.",
                    "Object-Oriented Design: A Responsibility-Driven Approach.",
                    "Saving a Legacy With Objects.",
                    "Good News, Bad News: Experience Building a Software Development Environment Using the Object-Oriented Paradigm.",
                    "PROCOL - A Parallel Object Language with Protocols.",
                    "Inheritance and Synchronization with Enabled Sets.",
                    "Extending the Operating System to Support an Object-Oriented Environment.",
                    "Playground: An Object-Oriented Simulation System With Agent Rules for Children of All Ages.",
                    "Neural Agents - A Frame of Mind.",
                    "An Extended Frame Language.",
                    "Strategies for Scientific Prototyping in Smalltalk.",
                    "Function Minimization and Automatic Differentiation Using C++.",
                    "Object-Oriented Programming for Linear Algebra.",
                    "Vamp: The Aldus Application Framework.",
                    "DSM: An Object-Relationship Modeling Language.",
                    "Mandatory Security in Object-Oriented Database Systems.",
                    "A Fast Method Dispatcher for Compiled Languages with Multiple Inheritance.",
                    "TICLOS: An Implementation of CLOS for the Explorer Family.",
                    "PCLOS: A Critical Review.",
                    "The Use of Multimethods and Method Combination in a CLOS Based Window System Interface.",
                    "Prototyping a Real-Time Embedded System in Smalltalk.",
                    "Virtual Memory and Backing Storage Management in Multiprocessor Operating Systems Using Object-Oriented Design Techniques.",
                    "An Object Addressing Mechanism for Statically Types Languages with Multiple Inheritance.",
                    "An Object-Oriented Modeling Environment.",
                    "OROS: Toward a Type Model for Software Development Environments.",
                    "Metaclass Compatibility.",
                    "Computational Reflection in Class-Based Object-Oriented Languages.",
                    "Reflective Facilities in Smalltalk-80.",
                    "An Environment for Literate Smalltalk Programming.",
                    "An Event-Driven Model-View-Controller Framework for Smalltalk.",
                    "Three Steps to Views: Extending the Object-Oriented Paradigm.",
                    "Rule-Based Delegation for Prototypes.",
                    "Controllable Delegation: An Exercise in Law-Governed Systems.",
                    "Constraint Technology fur User-Interface Construction in ThingLab II.",
                    "A Module Mechanism for Constraints in Smalltalk.",
                    "Virtual Classes: A Powerful Mechanism in Object-Oriented Programming.",
                    "Extending Ordinary Inheritance Schemes to Include Generalization.",
                    "Programming with Explicit Metaclasses in Smalltalk-80.",
                    "A Denotational Semantics of Inheritance and its Correctness.",
                    "Static Type Inference for Parametric Classes.",
                    "Interfaces for Strongly-Typed Object-Oriented Programming.",
                    "Panel on Transactions in Object-Oriented Systems.",
                    "Objects in their Eyes (Panel).",
                    "Panel: From Prototype to Product?",
                    "Panel: Inheritance: Can We Have Our Cake and Eat it, Too?",
                    "Panel: Using Ada within an Object-Oriented Software Development Paradigm.",
                    "Panel: Architectural Alternatives for Object-Oriented Database Management.",
                    "Panel: Object-Oriented Technologies and the Software Industrial Revolution - Necessary But Not Sufficient.",
                    "Panel: Object-Oriented Languages: Premises and Promises."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "3rd OOPSLA 1988",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1988",
                "sub_name": "Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1988, San Diego, California, USA, September 25-30, 1988, Proceedings.",
                "count": 35,
                "papers": [
                    "Tenuring Policies for Generation-Based Storage Reclamation.",
                    "TS: An Optimizing Compiler for Smalltalk.",
                    "Fast Dispatch Mechanisms for Stock Hardware.",
                    "A User Interface Toolkit Based on Graphical Objects and Constraints.",
                    "ET++ - An Object-Oriented Application Framework in C++.",
                    "Transportable Applications Environment (TAE) Plus Experiences in \"Object\"-ively Modernizing a User Interface Environment.",
                    "An Integrated Color Smalltalk-80 System.",
                    "A Smalltalk Window System Based on Constraints.",
                    "Configuring Stand-Alone Smalltalk-80 Applications.",
                    "Building a Backtracking Facility in Smalltalk Without Kernel Support.",
                    "An Overview of Modular Smalltalk.",
                    "Orwell - A Configuration Management System for Team Programming.",
                    "Integrating an Object-Oriented Programming System with a Database System.",
                    "A Performance Comparison of Object and Relational Databases Using the Sun Benchmark.",
                    "Intensional Concepts in an Object Database Model.",
                    "Fabrik: A Visual Programming Environment.",
                    "GraphTrace - Understanding Object-Oriented Systems Using Concurrently Animated Views.",
                    "AVANCE: An Object Management System.",
                    "An Interactive Environment for Object-Oriented Music Composition and Sound Synthesis.",
                    "A Smalltalk Implementation of an Intelligent Operator's Associate.",
                    "Process Management and Exception Handling in Multiprocessor Operating Systems.",
                    "An Object-Oriented Framework of Pattern Recognition Systems.",
                    "Data Abstraction Mechanisms in SINA/ST.",
                    "Using Tuple Space Communication in Distributed Object-Oriented Languages.",
                    "Controlling Propagation of Operations Using Attributes on Relations.",
                    "How To Invent Distributed Implementation Schemes of an Object-Based Concurrent Language: A Transformational Approach.",
                    "Reflection in an Object-Oriented Concurrent Language.",
                    "An Execution Model for Distributed Object-Oriented Computation.",
                    "Object-Oriented Programming: An Objective Sense of Style.",
                    "Transformation of Data Flow Analysis Models to Object-Oriented Design.",
                    "Panel: Treaty of Orlando Revisited.",
                    "Panel: Object-Oriented Knowledge-Based Software Maintenance.",
                    "Panel: Experiences with Reusability.",
                    "Panel: OOP in Business.",
                    "Panel: Teaching OOP."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "2nd OOPSLA 1987",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1987",
                "sub_name": "Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1987, Orlando, Florida, USA, October 4-8, 1987, Proceedings.",
                "count": 44,
                "papers": [
                    "Use of Object-Oriented Programming in a Time Series Analysis System.",
                    "Teaching Object-Oriented Programming with the KEE System.",
                    "Parallel Programming in a Virtual Object Space.",
                    "Mentat: An Object-Oriented Macro Data Flow System.",
                    "Constraint Hierarchies.",
                    "An Object-Oriented Design System Shell.",
                    "An Object-Oriented Framework for Interactive Data Graphics.",
                    "The Trellis Programming Environment.",
                    "A Pragmatic System for Shared Persistent Objects.",
                    "Class Modification in the GemStone Object-Oriented DBMS.",
                    "Composite Object Support in an Object-Oriented Database System.",
                    "An Information System Based on Distributed Objects.",
                    "Delegation Is Inheritance.",
                    "Concepts and Experiments in Computational Reflection.",
                    "Metaclasses are First Class: the ObjVlisp Model.",
                    "Dimensions of Object-Based Language Design.",
                    "Object Oriented Development in an Industrial Environment.",
                    "Using Objects To Design and Build Radar ESM Systems.",
                    "Object-Oriented Programming in Smalltalk and ADA.",
                    "Experience with CommonLoops.",
                    "Self: The Power of Simplicity.",
                    "Active Objects in Hybrid.",
                    "MELDing Data Flow and Object-Oriented Programming.",
                    "Modules and Type Checking in PL/LL.",
                    "CLAM - an Open System for Graphical User Interfaces.",
                    "Painless Panes for Smalltalk Windows.",
                    "Logical Composition of Object-Oriented Interfaces.",
                    "ManiplIcons in ThinkerToy.",
                    "The Design and Implementation of Distributed Smalltalk.",
                    "Transparent Forwarding: First Steps.",
                    "Retrofitting Objects.",
                    "BrouHaHa - A Portable Smalltalk Interpreter.",
                    "INSIST: Interactive Simulation in Smalltalk.",
                    "Opus: A Smalltalk Production System.",
                    "OTM: Applying Objects to Tasks.",
                    "Some Experiments In Object-Oriented Simulation.",
                    "Experience and Evolution of ConcurrentSmalltalk.",
                    "RAPID: Prototyping Control Panel Interfaces.",
                    "Producer: A Tool for Translating Smalltalk-80 to Objective-C.",
                    "Combining Language and Database Advances in an Object-Oriented Development Environment.",
                    "Issues in the Design of Object-Oriented Database Programming Languages.",
                    "Intermedia: A Case Study of the Differences Between Relational and Object-Oriented Database Systems.",
                    "Relations as Semantic Constructs in an Object-Oriented Language.",
                    "A Law-Based Approach to Object-Oriented Programming."
                ]
            },
            {
                "sub_name_abbr": "conf/oopsla/1987a",
                "sub_name": "Addendum to the Proceedings on Object-Oriented Programming Systems, Languages and Applications, OOPSLA 1987 Addendum, Orlando, Florida, USA, October 4-8, 1987.",
                "count": 16,
                "papers": [
                    "Workshop on specification and design.",
                    "Keynote address - data abstraction and hierarchy.",
                    "Panel on inheritance.",
                    "BOF on inheritance.",
                    "Treaty of Orlando.",
                    "Workshop on OODB semantics.",
                    "Workshop on tools.",
                    "Workshop on compiling and optimizing.",
                    "Smalltalk standardization efforts.",
                    "Panel on OODB.",
                    "Workshop on OODB implementation.",
                    "Panel on design methodology.",
                    "Banquet speech - objects and other subjects.",
                    "Panel on making products.",
                    "Panel on visual programming.",
                    "Panel on concurrency."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "1st OOPSLA 1986",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/oopsla/1986",
                "sub_name": "Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA 1986, Portland, Oregon, USA, Proceedings.",
                "count": 56,
                "papers": [
                    "Object-Oriented Programming with Flavors.",
                    "An Introduction to Trellis/Owl.",
                    "CommonLoops: Merging Lisp and Object-Oriented Programming.",
                    "Oaklisp: an Object-Oriented Scheme with First Class Types.",
                    "Encapsulation and Inheritance in Object-Oriented Programming Languages.",
                    "An Object-Oriented Operating System Interface.",
                    "A Probe-Based Monitoring Scheme for an Object-Oriented Distributed Operating System.",
                    "Mach and Matchmaker: Kernel and Language Support for Object-Oriented Distributed Systems.",
                    "Object Structure in the Emerald System.",
                    "Virtual Memory on a Narrow Machine for an Object-Oriented Language.",
                    "SOAR: Smalltalk Without Bytecodes.",
                    "A Third Generation Smalltalk-80 Implementation.",
                    "Swamp: A Fast Processor for Smalltalk-80.",
                    "Quicktalk: A Smalltalk-80 Dialect for Defining Primitive Methods.",
                    "Hurricane: An Optimizing Compiler for Smalltalk.",
                    "Virtual Copies - At the Boundary Between Classes and Instances.",
                    "Impulse-86: A Substrate for Object-Oriented Interface Design.",
                    "Experience with Flamingo: A Distributed, Object-Oriented User Interface System.",
                    "Intermedia: The Architecture and Construction of an Object-Oriented Hypermedia System and Applications Framework.",
                    "Building a Timeline Editor from Prefab Parts: The Architecture of an Object-Oriented Application.",
                    "Using Prototypical Objects to Implement Shared Behavior in Object Oriented Systems.",
                    "An Experience with a Prolog-based Object-Oriented Language.",
                    "A Concurrent Object-Oriented Knowledge Representation Language Orient84/K: Its Features and Implementation.",
                    "Objects in Concurrent Logic Programming Languages.",
                    "Object-Oriented Concurrent Programming in ABCL/1.",
                    "An Object-Oriented Architecture for Intelligent Tutoring Systems.",
                    "A Smalltalk System for Algebraic Manipulation.",
                    "Petri Net-Based Object-Oriented Modeling of Distributed Systems.",
                    "The Application Accelerator Illustration System.",
                    "Virtual Instruments: Object-Oriented Program Synthesis.",
                    "Type-Checking Smalltalk.",
                    "An Exemplar Based Smalltalk.",
                    "The Design and Implementation of ConcurrentSmalltalk.",
                    "Encapsulators: A New Software Paradigm in Smalltalk-80.",
                    "A Simple Technique for Handling Multiple Polymorphism.",
                    "Pi: A Case Study in Object-Oriented Programming.",
                    "A Diagram for Object-Oriented Programs.",
                    "An Object-Oriented Approach to a Large Scientific Application.",
                    "Language Support for Changeable Large Real Time Systems.",
                    "Object Oriented Spreadsheets: The Analytic Spreadsheet Package.",
                    "Genericity versus Inheritance.",
                    "Object Identity.",
                    "Boolean Classes.",
                    "An Alternative to Subclassing.",
                    "Augmentation of Object-Oriented Programming by Concepts of Abstract Data Type Theory: The ModPascal Experience.",
                    "Design of a Distributed Object Manager for the Smalltalk-80 System.",
                    "A Distributed Repository for Immutable Persistent Objects.",
                    "Moving Structures between Smalltalk Images.",
                    "Development of an Object-Oriented DBMS.",
                    "The Management of Changing Types in an Object-Oriented Database.",
                    "Architectural Support for Object-Oriented Programming - Panel.",
                    "User Interface Frameworks - Panel.",
                    "The Learnability of Object-Oriented Programming Systems - Panel.",
                    "Object-Oriented Programming for Product Development - Panel.",
                    "The Future of Object-Oriented Languages - Panel.",
                    "Object-Oriented Programming without an Object-Oriented Language - Panel."
                ]
            }
        ]
    }
]