[
    {
        "year": "2021",
        "name": "15th OSDI 2021",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2021",
                "sub_name": "15th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2021, July 14-16, 2021.",
                "count": 31,
                "papers": [
                    "Pollux: Co-adaptive Cluster Scheduling for Goodput-Optimized Deep Learning.",
                    "Oort: Efficient Federated Learning via Guided Participant Selection.",
                    "PET: Optimizing Tensor Programs with Partially Equivalent Transformations and Automated Corrections.",
                    "Privacy Budget Scheduling.",
                    "Modernizing File System through In-Storage Indexing.",
                    "Nap: A Black-Box Approach to NUMA-Aware Persistent Memory Indexes.",
                    "Rearchitecting Linux Storage Stack for µs Latency and High Throughput.",
                    "Optimizing Storage Performance with Calibrated Interrupts.",
                    "ZNS+: Advanced Zoned Namespace Interface for Supporting In-Storage Zone Compaction.",
                    "DMon: Efficient Detection and Correction of Data Locality Problems Using Selective Profiling.",
                    "CLP: Efficient and Scalable Search on Compressed Text Logs.",
                    "Polyjuice: High-Performance Transactions via Learned Concurrency Control.",
                    "Retrofitting High Availability Mechanism to Tame Hybrid Transaction/Analytical Processing.",
                    "The nanoPU: A Nanosecond Network Stack for Datacenters.",
                    "Beyond malloc efficiency to fleet efficiency: a hugepage-aware memory allocator.",
                    "Scalable Memory Protection in the PENGLAI Enclave.",
                    "NrOS: Effective Replication and Sharing in an Operating System.",
                    "Addra: Metadata-private voice communication over fully untrusted infrastructure.",
                    "Bringing Decentralized Search to Decentralized Services.",
                    "Finding Consensus Bugs in Ethereum via Multi-transaction Differential Fuzzing.",
                    "MAGE: Nearly Zero-Cost Virtual Memory for Secure Computation.",
                    "Zeph: Cryptographic Enforcement of End-to-End Data Privacy.",
                    "DistAI: Data-Driven Automated Invariant Learning for Distributed Protocols.",
                    "GoJournal: a verified, concurrent, crash-safe journaling system.",
                    "STORM: Refinement Types for Secure Web Applications.",
                    "Horcrux: Automatic JavaScript Parallelism for Resource-Efficient Web Computation.",
                    "SANRAZOR: Reducing Redundant Sanitizer Checks in C/C++ Programs.",
                    "Dorylus: Affordable, Scalable, and Accurate GNN Training with Distributed CPU Servers and Serverless Threads.",
                    "GNNAdvisor: An Adaptive and Efficient Runtime System for GNN Acceleration on GPUs.",
                    "Marius: Learning Massive Graph Embeddings on a Single Machine.",
                    "P3: Distributed Deep Graph Learning at Scale."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "14th OSDI 2020",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2020",
                "sub_name": "14th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2020, Virtual Event, November 4-6, 2020.",
                "count": 70,
                "papers": [
                    "Theseus: an Experiment in Operating System Structure and State Management.",
                    "RedLeaf: Isolation and Communication in a Safe Operating System.",
                    "Specification and verification in the field: Applying formal methods to BPF just-in-time compilers in the Linux kernel.",
                    "Cobra: Making Transactional Key-Value Stores Verifiably Serializable.",
                    "Determinizing Crash Behavior with a Verified Snapshot-Consistent Flash Translation Layer.",
                    "Storage Systems are Distributed Systems (So Verify Them That Way!).",
                    "Fast RDMA-based Ordered Key-Value Store using Remote Learned Cache.",
                    "CrossFS: A Cross-layered Direct-Access File System.",
                    "From WiscKey to Bourbon: A Learned Index for Log-Structured Merge Trees.",
                    "LinnOS: Predictability on Unpredictable Flash Storage with a Light Neural Network.",
                    "A large scale analysis of hundreds of in-memory cache clusters at Twitter.",
                    "Generalized Sub-Query Fusion for Eliminating Redundant I/O from Big-Data Queries.",
                    "A Simpler and Faster NIC Driver Model for Network Functions.",
                    "PANIC: A High-Performance Programmable NIC for Multi-tenant Networks.",
                    "Semeru: A Memory-Disaggregated Managed Runtime.",
                    "Caladan: Mitigating Interference at Microsecond Timescales.",
                    "Overload Control for µs-scale RPCs with Breakwater.",
                    "AIFM: High-Performance, Application-Integrated Far Memory.",
                    "Performance-Optimal Read-Only Transactions.",
                    "Toward a Generic Fault Tolerance Technique for Partial Network Partitioning.",
                    "PACEMAKER: Avoiding HeART attacks in storage clusters with disk-adaptive redundancy.",
                    "Pegasus: Tolerating Skewed Workloads in Distributed Storage with In-Network Coherence Directories.",
                    "FlightTracker: Consistency across Read-Optimized Online Stores at Facebook.",
                    "Kvell+: Snapshot Isolation without Snapshots.",
                    "Serving DNNs like Clockwork: Performance Predictability from the Bottom Up.",
                    "A Unified Architecture for Accelerating Distributed DNN Training in Heterogeneous GPU/CPU Clusters.",
                    "Heterogeneity-Aware Cluster Scheduling Policies for Deep Learning Workloads.",
                    "PipeSwitch: Fast Pipelined Context Switching for Deep Learning Applications.",
                    "HiveD: Sharing a GPU Cluster for Deep Learning with Guarantees.",
                    "AntMan: Dynamic Scaling on GPU Clusters for Deep Learning.",
                    "Write Dependency Disentanglement with HORAE.",
                    "Blockene: A High-throughput Blockchain Over Mobile Devices.",
                    "Tolerating Slowdowns in Replicated State Machines using Copilots.",
                    "Microsecond Consensus for Microsecond Applications.",
                    "Virtual Consensus in Delos.",
                    "Byzantine Ordered Consensus without Byzantine Oligarchy.",
                    "From Global to Local Quiescence: Wait-Free Code Patching of Multi-Threaded Processes.",
                    "Testing Database Engines via Pivoted Query Synthesis.",
                    "Gauntlet: Finding Bugs in Compilers for Programmable Packet Processing.",
                    "Aragog: Scalable Runtime Verification of Shardable Networked Systems.",
                    "Automated Reasoning and Detection of Specious Configuration in Large Systems with Symbolic Execution.",
                    "Testing Configuration Changes in Context to Prevent Production Failures.",
                    "Providing SLOs for Resource-Harvesting VMs in Cloud Platforms.",
                    "The CacheLib Caching Engine: Design and Experiences at Scale.",
                    "Twine: A Unified Cluster Management System for Shared Infrastructure.",
                    "FIRM: An Intelligent Fine-grained Resource Management Framework for SLO-Oriented Microservices.",
                    "Building Scalable and Flexible Cluster Managers Using Declarative Programming.",
                    "Protean: VM Allocation Service at Scale.",
                    "Ansor: Generating High-Performance Tensor Programs for Deep Learning.",
                    "Rammer: Enabling Holistic Deep Learning Compiler Optimizations with rTasks.",
                    "A Tensor Compiler for Unified Machine Learning Prediction Serving.",
                    "Retiarii: A Deep Learning Exploratory-Training Framework.",
                    "KungFu: Making Training in Distributed Machine Learning Adaptive.",
                    "FVM: FPGA-assisted Virtual Device Emulation for Fast, Scalable, and Flexible Storage Virtualization.",
                    "hXDP: Efficient Software Packet Processing on FPGA NICs.",
                    "Do OS abstractions make sense on FPGAs?",
                    "Assise: Performance and Availability via Client-local NVM in a Distributed File System.",
                    "Persistent State Machines for Recoverable In-memory Storage Systems with NVRam.",
                    "AGAMOTTO: How Persistent is your Persistent Memory Application?",
                    "Orchard: Differentially Private Analytics at Scale.",
                    "Achieving 100Gbps Intrusion Prevention on a Single Server.",
                    "DORY: An Encrypted Search System with Distributed Trust.",
                    "SafetyPin: Encrypted Backups with Human-Memorable Secrets.",
                    "Efficiently Mitigating Transient Execution Attacks using the Unmapped Speculation Contract.",
                    "Predictive and Adaptive Failure Mitigation to Avert Production Cloud VM Interruptions.",
                    "Sundial: Fault-tolerant Clock Synchronization for Datacenters.",
                    "Fault-tolerant and transactional stateful serverless workflows.",
                    "Unearthing inter-job dependencies for better cluster scheduling.",
                    "RackSched: A Microsecond-Scale Scheduler for Rack-Scale Computers.",
                    "Thunderbolt: Throughput-Optimized, Quality-of-Service-Aware Power Capping at Scale."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "13th OSDI 2018",
        "info": "Carlsbad, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2018",
                "sub_name": "13th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2018, Carlsbad, CA, USA, October 8-10, 2018.",
                "count": 47,
                "papers": [
                    "Capturing and Enhancing In Situ System Observability for Failure Detection.",
                    "REPT: Reverse Debugging of Failures in Deployed Software.",
                    "Finding Crash-Consistency Bugs with Bounded Black-Box Crash Testing.",
                    "An Analysis of Network-Partitioning Failures in Cloud Systems.",
                    "LegoOS: A Disseminated, Distributed OS for Hardware Resource Disaggregation.",
                    "The benefits and costs of writing a POSIX kernel in a high-level language.",
                    "Sharing, Protection, and Compatibility for Reconfigurable Fabric with AmorphOS.",
                    "Adaptive Dynamic Checkpointing for Safe Efficient Intermittent Computing.",
                    "Arachne: Core-Aware Thread Management.",
                    "Principled Schedulability Analysis for Distributed Storage Systems using Thread Architecture Models.",
                    "µTune: Auto-Tuned Threading for OLDI Microservices.",
                    "RobinHood: Tail Latency Aware Caching - Dynamic Reallocation from Cache-Rich to Cache-Poor.",
                    "Noria: dynamic, partially-stateful data-flow for high-performance web applications.",
                    "Deconstructing RDMA-enabled Distributed Transactions: Hybrid is Better!",
                    "Dynamic Query Re-Planning using QOOP.",
                    "Focus: Querying Large Video Datasets with Low Latency and Low Cost.",
                    "Nickel: A Framework for Design and Verification of Information Flow Control Systems.",
                    "Verifying concurrent software using movers in CSPEC.",
                    "Proving confidentiality in a file system using DiskSec.",
                    "Proving the correct execution of concurrent services in zero-knowledge.",
                    "The FuzzyLog: A Partially Ordered Shared Log.",
                    "Maelstrom: Mitigating Datacenter-level Disasters by Draining Interdependent Traffic Safely and Efficiently.",
                    "Fault-Tolerance, Fast and Slow: Exploiting Failure Asynchrony in Distributed Systems.",
                    "Taming Performance Variability.",
                    "Pocket: Elastic Ephemeral Storage for Serverless Analytics.",
                    "Sharding the Shards: Managing Datastore Locality at Scale with Akkio.",
                    "Write-Optimized and High-Performance Hashing Index Scheme for Persistent Memory.",
                    "FlashShare: Punching Through Server Storage Stack from Kernel to Firmware for Ultra-Low Latency SSDs.",
                    "Orca: Differential Bug Localization in Large-Scale Services.",
                    "Differential Energy Profiling: Energy Optimization via Diffing Similar Apps.",
                    "wPerf: Generic Off-CPU Analysis to Identify Bottleneck Waiting Events.",
                    "Sledgehammer: Cluster-Fueled Debugging.",
                    "Ray: A Distributed Framework for Emerging AI Applications.",
                    "TVM: An Automated End-to-End Optimizing Compiler for Deep Learning.",
                    "Gandiva: Introspective Cluster Scheduling for Deep Learning.",
                    "PRETZEL: Opening the Black Box of Machine Learning Prediction Serving Systems.",
                    "Splinter: Bare-Metal Extensions for Multi-Tenant Low-Latency Storage.",
                    "Neural Adaptive Content-aware Internet Video Delivery.",
                    "Floem: A Programming System for NIC-Accelerated Network Applications.",
                    "Graviton: Trusted Execution Environments on GPUs.",
                    "ZebRAM: Comprehensive and Compatible Software Protection Against Rowhammer Attacks.",
                    "Karaoke: Distributed Private Messaging Immune to Passive Traffic Analysis.",
                    "Obladi: Oblivious Serializable Transactions in the Cloud.",
                    "ASAP: Fast, Approximate Graph Pattern Mining at Scale.",
                    "RStream: Marrying Relational Algebra with Streaming for Efficient Graph Mining on A Single Machine.",
                    "Three steps is all you need: fast, accurate, automatic scaling decisions for distributed streaming dataflows.",
                    "Flare: Optimizing Apache Spark with Native Compilation for Scale-Up Architectures and Medium-Size Data."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "12th OSDI 2016",
        "info": "Savannah, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2016",
                "sub_name": "12th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2016, Savannah, GA, USA, November 2-4, 2016.",
                "count": 47,
                "papers": [
                    "Push-Button Verification of File Systems via Crash Refinement.",
                    "Intermittent Computation without Hardware Support or Programmer Intervention.",
                    "Machine-Aware Atomic Broadcast Trees for Multicores.",
                    "Light-Weight Contexts: An OS Abstraction for Safety and Performance.",
                    "Altruistic Scheduling in Multi-Resource Clusters.",
                    "GRAPHENE: Packing and Dependency-Aware Scheduling for Data-Parallel Clusters.",
                    "Firmament: Fast, Centralized Cluster Scheduling at Scale.",
                    "Morpheus: Towards Automated SLOs for Enterprise Clusters.",
                    "The SNOW Theorem and Latency-Optimal Read-Only Transactions.",
                    "Correlated Crash Vulnerabilities.",
                    "Incremental Consistency Guarantees for Replicated Objects.",
                    "FaSST: Fast, Scalable and Simple Distributed Transactions with Two-Sided (RDMA) Datagram RPCs.",
                    "NetBricks: Taking the V out of NFV.",
                    "Efficient Network Reachability Analysis Using a Succinct Control Plane Representation.",
                    "Simplifying Datacenter Network Debugging with PathDump.",
                    "Network Requirements for Resource Disaggregation.",
                    "TensorFlow: A System for Large-Scale Machine Learning.",
                    "Exploring the Hidden Dimension in Graph Processing.",
                    "Gemini: A Computation-Centric Distributed Graph Processing System.",
                    "Fast and Concurrent RDF Queries with RDMA-Based Distributed Graph Exploration.",
                    "REX: A Development Platform and Online Learning Approach for Runtime Emergent Software Systems.",
                    "Yak: A High-Performance Big-Data-Friendly Garbage Collector.",
                    "Shuffler: Fast and Deployable Continuous Code Re-Randomization.",
                    "Don't Get Caught in the Cold, Warm-up Your JVM: Understand and Eliminate JVM Warm-up Overhead in Data-Parallel Systems.",
                    "EC-Cache: Load-Balanced, Low-Latency Cluster Caching with Online Erasure Coding.",
                    "To Waffinity and Beyond: A Scalable Architecture for Incremental Parallelization of File System Code.",
                    "CLARINET: WAN-Aware Optimization for Analytics Queries.",
                    "JetStream: Cluster-Scale Parallelization of Information Flow Queries.",
                    "Just Say NO to Paxos Overhead: Replacing Consensus with Network Ordering.",
                    "XFT: Practical Fault Tolerance beyond Crashes.",
                    "Realizing the Fault-Tolerance Promise of Cloud Storage Using Locks with Intent.",
                    "Consolidating Concurrency Control and Consensus for Commits under Conflicts.",
                    "Ryoan: A Distributed Sandbox for Untrusted Computation on Secret Data.",
                    "Unobservable Communication over Fully Untrusted Infrastructure.",
                    "Alpenhorn: Bootstrapping Secure Communication without Leaking Metadata.",
                    "Big Data Analytics over Encrypted Datasets with Seabed.",
                    "Non-Intrusive Performance Profiling for Entire Software Stacks Based on the Flow Reconstruction Principle.",
                    "Early Detection of Configuration Errors to Reduce Failure Damage.",
                    "Kraken: Leveraging Live Traffic Tests to Identify and Resolve Resource Utilization Bottlenecks in Large Scale Web Services.",
                    "CertiKOS: An Extensible Architecture for Building Certified Concurrent OS Kernels.",
                    "EbbRT: A Framework for Building Per-Application Library Operating Systems.",
                    "SCONE: Secure Linux Containers with Intel SGX.",
                    "Coordinated and Efficient Huge Page Management with Ingens.",
                    "Diamond: Automating Data Management and Storage for Wide-Area, Reactive Applications.",
                    "Slicer: Auto-Sharding for Datacenter Applications.",
                    "History-Based Harvesting of Spare Cycles and Storage in Large-Scale Datacenters.",
                    "DQBarge: Improving Data-Quality Tradeoffs in Large-Scale Internet Services."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2016inflow",
                "sub_name": "4th Workshop on Interactions of NVM/Flash with Operating Systems and Workloads, INFLOW@OSDI 2016, Savannah, GA, USA, November 1, 2016.",
                "count": 6,
                "papers": [
                    "Couture: Tailoring STT-MRAM for Persistent Main Memory.",
                    "ROSS: A Design of Read-Oriented STT-MRAM Storage for Energy-Efficient Non-Uniform Cache Architecture.",
                    "NVMOVE: Helping Programmers Move to Byte-Based Persistence.",
                    "Enabling NVM for Data-Intensive Scientific Services.",
                    "ElCached: Elastic Multi-Level Key-Value Cache.",
                    "On the Impact of Garbage Collection on Flash-Based SSD Endurance."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th OSDI 2014",
        "info": "Broomfield, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2014",
                "sub_name": "11th USENIX Symposium on Operating Systems Design and Implementation, OSDI '14, Broomfield, CO, USA, October 6-8, 2014.",
                "count": 42,
                "papers": [
                    "Arrakis: The Operating System is the Control Plane.",
                    "Decoupling Cores, Kernels, and Operating Systems.",
                    "Jitk: A Trustworthy In-Kernel Interpreter Infrastructure.",
                    "IX: A Protected Dataplane Operating System for High Throughput and Low Latency.",
                    "Willow: A User-Programmable SSD.",
                    "Physical Disentanglement in a Container-Based File System.",
                    "Customizable and Extensible Deployment for Mobile/Cloud Applications.",
                    "Pebbles: Fine-Grained Data Management Abstractions for Modern Operating Systems.",
                    "Protecting Users by Confining JavaScript with COWL.",
                    "Code-Pointer Integrity.",
                    "Ironclad Apps: End-to-End Security via Automated Full-System Verification.",
                    "SHILL: A Secure Shell Scripting Language.",
                    "GPUnet: Networking Abstractions for GPU Programs.",
                    "The Mystery Machine: End-to-end Performance Analysis of Large-scale Internet Services.",
                    "End-to-end Performance Isolation Through Virtual Datacenters.",
                    "Simple Testing Can Prevent Most Critical Failures: An Analysis of Production Failures in Distributed Data-Intensive Systems.",
                    "Shielding Applications from an Untrusted Cloud with Haven.",
                    "Apollo: Scalable and Coordinated Scheduling for Cloud-Scale Computing.",
                    "The Power of Choice in Data-Aware Cluster Scheduling.",
                    "Heading Off Correlated Failures through Independence-as-a-Service.",
                    "Characterizing Storage Workloads with Counter Stacks.",
                    "Pelican: A Building Block for Exascale Cold Data Storage.",
                    "A Self-Configurable Geo-Replicated Cloud Storage System.",
                    "f4: Facebook's Warm BLOB Storage System.",
                    "SAMC: Semantic-Aware Model Checking for Fast Discovery of Deep Bugs in Cloud Systems.",
                    "SKI: Exposing Kernel Concurrency Bugs through Systematic Schedule Exploration.",
                    "All File Systems Are Not Created Equal: On the Complexity of Crafting Crash-Consistent Applications.",
                    "Torturing Databases for Fun and Profit.",
                    "Fast Databases with Fast Durability and Recovery Through Multicore Parallelism.",
                    "Extracting More Concurrency from Distributed Transactions.",
                    "Salt: Combining ACID and BASE in a Distributed Database.",
                    "Phase Reconciliation for Contended In-Memory Transactions.",
                    "Eidetic Systems.",
                    "Detecting Covert Timing Channels with Time-Deterministic Replay.",
                    "Identifying Information Disclosure in Web Applications with Retroactive Auditing.",
                    "Project Adam: Building an Efficient and Scalable Deep Learning Training System.",
                    "Scaling Distributed Machine Learning with the Parameter Server.",
                    "GraphX: Graph Processing in a Distributed Dataflow Framework.",
                    "Nail: A Practical Tool for Parsing and Generating Data Formats.",
                    "lprof: A Non-intrusive Request Flow Profiler for Distributed Systems.",
                    "Pydron: Semi-Automatic Parallelization for Multi-Core and the Cloud.",
                    "User-Guided Device Driver Synthesis."
                ]
            },
            {
                "sub_name_abbr": "conf/hotdep/2014",
                "sub_name": "10th Workshop on Hot Topics in System Dependability, HotDep '14, Broomfield, CO, USA, October 5, 2014.",
                "count": 9,
                "papers": [
                    "Compute Globally, Act Locally: Protecting Federated Systems from Systemic Threats.",
                    "Running ZooKeeper Coordination Services in Untrusted Clouds.",
                    "Who Writes What Checkers? - Learning from Bug Repositories.",
                    "Leveraging Trusted Computing and Model Checking to Build Dependable Virtual Machines.",
                    "Erasure Code with Shingled Local Parity Groups for Efficient Recovery from Multiple Disk Failures.",
                    "Providing High Availability in Cloud Storage by Decreasing Virtual Machine Reboot Time.",
                    "Understanding Reliability Implication of Hardware Error in Virtualization Infrastructure.",
                    "Towards General-Purpose Resource Management in Shared Cloud Services.",
                    "Scalable BFT for Multi-Cores: Actor-Based Decomposition and Consensus-Oriented Parallelization."
                ]
            },
            {
                "sub_name_abbr": "conf/hotpower/2014",
                "sub_name": "6th Workshop on Power-Aware Computing and Systems, HotPower '14, Broomfield, CO, USA, October 5, 2014.",
                "count": 9,
                "papers": [
                    "All Opportunities Are Not Equal: Enabling Energy Efficient App Syncs In Diverse Networks.",
                    "ViRUS: Virtual Function Replacement Under Stress.",
                    "Heterogeneity by the Numbers: A Study of the ODROID XU+E big.LITTLE Platform.",
                    "A Case for Battery Charging-Aware Power Management and Deferrable Task Scheduling in Smartphones.",
                    "Mobile GPU Power Consumption Reduction via Dynamic Resolution and Frame Rate Scaling.",
                    "FingerShadow: An OLED Power Optimization Based on Smartphone Touch Interactions.",
                    "Should We Dual-Purpose Energy Storage in Datacenters for Power Backup and Demand Response?",
                    "Can Data Center Become Water Self-Sufficient?",
                    "Memory Throttling on BG/Q: A Case Study with Explicit Hydrodynamics."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2014inflow",
                "sub_name": "2nd Workshop on Interactions of NVM/Flash with Operating Systems and Workloads, INFLOW '14, Broomfield, CO, USA, October 5, 2014.",
                "count": 6,
                "papers": [
                    "Don't Stack Your Log On My Log.",
                    "How Could a Flash Cache Degrade Database Performance Rather Than Improve It? Lessons to be Learnt from Multi-Tiered Storage.",
                    "Erasure Coding & Read/Write Separation in Flash Storage.",
                    "Compression and SSDs: Where and How?",
                    "NVM Compression - Hybrid Flash-Aware Application Level Compression.",
                    "EqualChance: Addressing Intra-set Write Variation to Increase Lifetime of Non-volatile Caches."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2014trios",
                "sub_name": "2014 Conference on Timely Results in Operating Systems, TRIOS '14, Broomfield, CO, USA, October 5, 2014.",
                "count": 11,
                "papers": [
                    "Working Set Model for Multithreaded Programs.",
                    "MLB: A Memory-aware Load Balancing for Mitigating Memory Contention.",
                    "Cosh: Clear OS Data Sharing In An Incoherent World.",
                    "Fractured Processes: Adaptive, Fine-Grained Process Abstractions.",
                    "Leo: A Profile-Driven Dynamic Optimization Framework for GPU Applications.",
                    "Proactive Energy-Aware Programming with PEEK.",
                    "From Feast to Famine: Managing Mobile Network Resources Across Environments and Preferences.",
                    "On Sockets and System Calls: Minimizing Context Switches for the Socket API.",
                    "Lightning in the Cloud: A Study of Transient Bottlenecks on n-Tier Web Application Performance.",
                    "Custos: Increasing Security with Secret Storage as a Service.",
                    "Managing NymBoxes for Identity and Tracking Protection."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "10th OSDI 2012",
        "info": "Hollywood, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2012",
                "sub_name": "10th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2012, Hollywood, CA, USA, October 8-10, 2012.",
                "count": 25,
                "papers": [
                    "Flat Datacenter Storage.",
                    "PowerGraph: Distributed Graph-Parallel Computation on Natural Graphs.",
                    "GraphChi: Large-Scale Graph Computation on Just a PC.",
                    "Hails: Protecting Data Privacy in Untrusted Web Applications.",
                    "Eternal Sunshine of the Spotless Machine: Protecting Privacy with Ephemeral Channels.",
                    "CleanOS: Limiting Mobile Data Exposure with Idle Eviction.",
                    "COMET: Code Offload by Migrating Execution Transparently.",
                    "AppInsight: Mobile App Performance Monitoring in the Wild.",
                    "Spotting Code Optimizations in Data-Parallel Pipelines through PeriSCOPE.",
                    "MegaPipe: A New Programming Interface for Scalable Network I/O.",
                    "DJoin: Differentially Private Join Queries over Distributed Databases.",
                    "Improving Integer Security for Systems with KINT.",
                    "Dissent in Numbers: Making Strong Anonymity Scale.",
                    "Efficient Patch-based Auditing for Web Application Vulnerabilities.",
                    "Experiences from a Decade of TinyOS Development.",
                    "Automated Concurrency-Bug Fixing.",
                    "All about Eve: Execute-Verify Replication for Multi-Core Servers.",
                    "Spanner: Google's Globally-Distributed Database.",
                    "Making Geo-Replicated Systems Fast as Possible, Consistent when Necessary.",
                    "SymDrive: Testing Drivers without Devices.",
                    "Be Conservative: Enhancing Failure Diagnosis with Proactive Logging.",
                    "X-ray: Automating Root-Cause Diagnosis of Performance Anomalies in Production Software.",
                    "Pasture: Secure Offline Data Access Using Commodity Trusted Hardware.",
                    "Dune: Safe User-level Access to Privileged CPU Features.",
                    "Performance Isolation and Fairness for Multi-Tenant Cloud Storage."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2012hotpower",
                "sub_name": "2012 Workshop on Power-Aware Computing Systems, HotPower'12, Hollywood, CA, USA, October 7, 2012.",
                "count": 10,
                "papers": [
                    "Personalized Diapause: Reducing Radio Energy Consumption of Smartphones by Network-Context Aware Dormancy Predictions.",
                    "Supporting Distributed Execution of Smartphone Workloads on Loosely Coupled Heterogeneous Processors.",
                    "Towards Verifying Android Apps for the Absence of No-Sleep Energy Bugs.",
                    "Reducing Data Movement Costs Using Energy-Efficient, Active Computation on SSD.",
                    "Quantitative Estimation of the Performance Delay with Propagation Effects in Disk Power Savings.",
                    "The Implications of Shared Data Synchronization Techniques on Multi-Core Energy Efficiency.",
                    "Lucky Scheduling for Energy-Efficient Heterogeneous Multi-Core Systems.",
                    "Accurate Characterization of the Variability in Power Consumption in Modern Mobile Processors.",
                    "Memory Performance at Reduced CPU Clock Speeds: An Analysis of Current x86_64 Processors.",
                    "Power and Performance Analysis of GPU-Accelerated Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2012mad",
                "sub_name": "2012 Workshop on Managing Systems Automatically and Dynamically, MAD'12, Hollywood, CA, USA, October 7, 2012.",
                "count": 8,
                "papers": [
                    "Towards a Data Analysis Recommendation System.",
                    "Mojave: A Recommendation System for Software Upgrades.",
                    "Vayu: Learning to Control the Cloud.",
                    "A Framework for Thermal and Performance Management.",
                    "Transparent System Call Based Performance Debugging for Cloud Computing.",
                    "Monitoring the Dynamics of Network Traffic by Recursive Multi-Dimensional Aggregation.",
                    "A State-Machine Approach to Disambiguating Supercomputer Event Logs.",
                    "Uncertainty in Aggregate Estimates from Sampled Distributed Traces."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "9th OSDI 2010",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2010",
                "sub_name": "9th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2010, October 4-6, 2010, Vancouver, BC, Canada, Proceedings.",
                "count": 32,
                "papers": [
                    "An Analysis of Linux Scalability to Many Cores.",
                    "Trust and Protection in the Illinois Browser Operating System.",
                    "FlexSC: Flexible System Call Scheduling with Exception-Less System Calls.",
                    "Finding a Needle in Haystack: Facebook's Photo Storage.",
                    "Availability in Globally Distributed Storage Systems.",
                    "Nectar: Automatic Management of Data and Computation in Datacenters.",
                    "Intrusion Recovery Using Selective Re-execution.",
                    "Static Checking of Dynamically-Varying Security Policies in Database-Backed Applications.",
                    "Accountable Virtual Machines.",
                    "Bypassing Races in Live Applications with Execution Filters.",
                    "Effective Data-Race Detection for the Kernel.",
                    "Ad Hoc Synchronization Considered Harmful.",
                    "Deterministic Process Groups in dOS.",
                    "Efficient System-Enforced Deterministic Parallelism.",
                    "Stable Deterministic Multithreading through Schedule Memoization.",
                    "Enabling Configuration-Independent Automation by Non-Expert Users.",
                    "Automating Configuration Troubleshooting with Dynamic Information Flow Analysis.",
                    "Large-scale Incremental Processing Using Distributed Transactions and Notifications.",
                    "Reining in the Outliers in Map-Reduce Clusters using Mantri.",
                    "Transactional Consistency and Automatic Management in an Application Data Cache.",
                    "Piccolo: Building Fast, Distributed Programs with Partitioned Tables.",
                    "Depot: Cloud Storage with Minimal Trust.",
                    "Comet: An active distributed key-value store.",
                    "SPORC: Group Collaboration using Untrusted Cloud Resources.",
                    "Onix: A Distributed Control Platform for Large-scale Production Networks.",
                    "Can the Production Network Be the Testbed?",
                    "Building Extensible Networks with Rule-Based Forwarding.",
                    "TaintDroid: An Information-Flow Tracking System for Realtime Privacy Monitoring on Smartphones.",
                    "StarTrack Next Generation: A Scalable Infrastructure for Track-Based Applications.",
                    "The Turtles Project: Design and Implementation of Nested Virtualization.",
                    "mClock: Handling Throughput Variability for Hypervisor IO Scheduling.",
                    "Virtualize Everything but Time."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2010slaml",
                "sub_name": "Workshop on Managing Systems via Log Analysis and Machine Learning Techniques, SLAML'10, Vancouver, BC, Canada, October 3, 2010.",
                "count": 8,
                "papers": [
                    "Optimizing Data Analysis with a Semi-structured Time Series Database.",
                    "Bridging the Gaps: Joining Information Sources with Splunk.",
                    "Experience Mining Google's Production Console Logs.",
                    "Analyzing Web Logs to Detect User-Visible Failures.",
                    "Synoptic: Summarizing System Logs with Refinement.",
                    "A Graphical Representation for Identifier Structure in Logs.",
                    "SIP CLF: A Common Log Format (CLF) for the Session Initiation Protocol (SIP).",
                    "Creating the Knowledge about IT Events."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8th OSDI 2008",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2008",
                "sub_name": "8th USENIX Symposium on Operating Systems Design and Implementation, OSDI 2008, December 8-10, 2008, San Diego, California, USA, Proceedings.",
                "count": 26,
                "papers": [
                    "DryadLINQ: A System for General-Purpose Distributed Data-Parallel Computing Using a High-Level Language.",
                    "Everest: Scaling Down Peak Loads Through I/O Off-Loading.",
                    "Improving MapReduce Performance in Heterogeneous Environments.",
                    "Corey: An Operating System for Many Cores.",
                    "CuriOS: Improving Reliability through Operating System Structure.",
                    "Redline: First Class Support for Interactivity in Commodity Operating Systems.",
                    "Network Imprecision: A New Consistency Metric for Scalable Monitoring.",
                    "Lightweight, High-Resolution Monitoring for Troubleshooting Production Systems.",
                    "Automating Network Application Dependency Discovery: Experiences, Limitations, and New Solutions.",
                    "SQCK: A Declarative File System Checker.",
                    "Transactional Flash.",
                    "Avoiding File System Micromanagement with Range Writes.",
                    "Binary Translation Using Peephole Superoptimizers.",
                    "R2: An Application-Level Kernel for Record and Replay.",
                    "KLEE: Unassisted and Automatic Generation of High-Coverage Tests for Complex Systems Programs.",
                    "Hardware Enforcement of Application Security Policies Using Tagged Memory.",
                    "Device Driver Safety Through a Reference Validation Mechanism.",
                    "Digging for Data Structures.",
                    "Finding and Reproducing Heisenbugs in Concurrent Programs.",
                    "Gadara: Dynamic Deadlock Avoidance for Multithreaded Programs.",
                    "Deadlock Immunity: Enabling Systems to Defend Against Deadlocks.",
                    "Difference Engine: Harnessing Memory Redundancy in Virtual Machines.",
                    "Quanto: Tracking Energy in Networked Embedded Systems.",
                    "Leveraging Legacy Code to Deploy Desktop Applications on the Web.",
                    "FlightPath: Obedience vs. Choice in Cooperative Services.",
                    "Mencius: Building Efficient Replicated State Machine for WANs."
                ]
            },
            {
                "sub_name_abbr": "conf/hotdep/2008",
                "sub_name": "Proceedings of the Fourth Workshop on Hot Topics in System Dependability, HotDep 2008, San Diego, CA, USA, December 7, 2008.",
                "count": 11,
                "papers": [
                    "Reverse-Engineering Drivers for Safety and Portability.",
                    "\"Otherworld\": Giving Applications a Chance to Survive OS Kernel Crashes.",
                    "Deprogramming Large Software Systems.",
                    "A Spin-Up Saved Is Energy Earned: Achieving Power-Efficient, Erasure-Coded Storage.",
                    "Spread-Spectrum Computation.",
                    "Toward Quantifying System Manageability.",
                    "Towards Automatic Inference of Task Hierarchies in Complex Systems.",
                    "Consistability: Describing Usually Consistent Systems.",
                    "Byzantium: Byzantine-Fault-Tolerant Database Replication Providing Snapshot Isolation.",
                    "Pretty Good Packet Authentication.",
                    "Dependable Self-Hosting Distributed Systems Using Constraints."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2008wasl",
                "sub_name": "First USENIX Workshop on the Analysis of System Logs, WASL 2008, San Diego, CA, USA, December 7, 2008, Proceedings.",
                "count": 8,
                "papers": [
                    "CLUEBOX: A Performance Log Analyzer for Automated Troubleshooting.",
                    "Hunting for Problems with Artemis.",
                    "Picviz: Finding a Needle in a Haystack.",
                    "Error Log Processing for Accurate Failure Prediction.",
                    "Predicting Computer System Failures Using Support Vector Machines.",
                    "SALSA: Analyzing Logs as StAte Machines.",
                    "Disk Drive Workload Captured in Logs Collected During the Field Return Incoming Test.",
                    "Carnegie Mellon's CyDAT: Harnessing a Wide Array of Telemetry Data to Enhance Distributed System Diagnostics."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2008hotpower",
                "sub_name": "Workshop on Power Aware Computing and Systems, HotPower 2008, December 7, 2008, San Diego, CA, USA, Proceedings.",
                "count": 13,
                "papers": [
                    "Memory-aware Scheduling for Energy Efficiency on Multicore Processors.",
                    "Delivering Energy Proportionality with Non Energy-Proportional Systems - Optimizing the Ensemble.",
                    "A Comparison of High-Level Full-System Power Models.",
                    "Run-time Energy Consumption Estimation Based on Workload in Server Systems.",
                    "Getting Things Done on Computational RFIDs with Energy-Aware Checkpointing and Voltage-Aware Scheduling.",
                    "The True Cost of Accurate Time.",
                    "Greening the Switch.",
                    "Hot Data Centers vs. Cool Peers.",
                    "On the Impact of Disk Scrubbing on Energy Savings.",
                    "Empirical Analysis on Energy Efficiency of Flash-based SSDs.",
                    "Looking Between the Street Lamps.",
                    "What if the Energy Grid Were Designed Like the Internet?",
                    "Where Does the Power Go and What to do About it?"
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2008wiov",
                "sub_name": "First Workshop on I/O Virtualization, WIOV'08, San Diego, CA, USA, December 10-11, 2008, Proceedings.",
                "count": 10,
                "papers": [
                    "Towards Virtual Passthrough I/O on Commodity Devices.",
                    "Live Migration of Direct-Access Devices.",
                    "Scalable I/O - A Well-Architected Way to Do Scalable, Secure and Virtualized I/O.",
                    "Block Mason.",
                    "Experiences with Content Addressable Storage and Virtual Disks.",
                    "Paravirtualized Paging.",
                    "GPU Virtualization on VMware's Hosted I/O Architecture.",
                    "Taming Heterogeneous NIC Capabilities for I/O Virtualization.",
                    "Standardized But Flexible I/O for Self-Virtualizing Devices.",
                    "SR-IOV Networking in Xen: Architecture, Design and Implementation."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2008sysml",
                "sub_name": "Third Workshop on Tackling Computer Systems Problems with Machine Learning Techniques, SysML 2008, December 11, 2008, San Diego, CA, USA, Proceedings.",
                "count": 7,
                "papers": [
                    "Finding Similar Failures Using Callstack Similarity.",
                    "Empirical Comparison of Techniques for Automated Failure Diagnosis.",
                    "HiLighter: Automatically Building Robust Signatures of Performance Behavior for Small- and Large-Scale Systems.",
                    "Mining Console Logs for Large-Scale System Problem Detection.",
                    "An Internet Protocol Address Clustering Algorithm.",
                    "Probabilistic Inference in Queueing Networks.",
                    "From Optimization to Regret Minimization and Back Again."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th OSDI 2006",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2006",
                "sub_name": "7th Symposium on Operating Systems Design and Implementation (OSDI '06), November 6-8, Seattle, WA, USA.",
                "count": 27,
                "papers": [
                    "Rethink the Sync (Awarded Best Paper!).",
                    "Type-Safe Disks.",
                    "Stasis: Flexible Transactional Storage.",
                    "SafeDrive: Safe and Recoverable Extensions Using Language-Based Techniques.",
                    "BrowserShield: Vulnerability-Driven Filtering of Dynamic HTML.",
                    "XFI: Software Guards for System Address Spaces.",
                    "Operating System Profiling via Latency Analysis.",
                    "CRAMM: Virtual Memory Support for Garbage-Collected Applications.",
                    "Flight Data Recorder: Monitoring Persistent-State Interactions to Improve Systems Management.",
                    "EXPLODE: A Lightweight, General System for Finding Serious Storage System Errors.",
                    "Securing Software by Enforcing Data-flow Integrity.",
                    "From Uncertainty to Belief: Inferring the Specification Within.",
                    "HQ Replication: A Hybrid Quorum Protocol for Byzantine Fault Tolerance.",
                    "BAR Gossip.",
                    "Bigtable: A Distributed Storage System for Structured Data (Awarded Best Paper!).",
                    "EnsemBlue: Integrating Distributed Storage and Consumer Electronics.",
                    "Persistent Personal Names for Globally Connected Mobile Devices.",
                    "A Modular Network Layer for Sensornets.",
                    "Making Information Flow Explicit in HiStar.",
                    "Splitting Interfaces: Making Trust Between Applications and Operating Systems Configurable.",
                    "Connection Handoff Policies for TCP Offload Network Interfaces.",
                    "Ceph: A Scalable, High-Performance Distributed File System.",
                    "Distributed Directory Service in the Farsite File System.",
                    "The Chubby Lock Service for Loosely-Coupled Distributed Systems.",
                    "Experiences Building PlanetLab.",
                    "iPlane: An Information Plane for Distributed Services.",
                    "Fidelity and Yield in a Volcano Monitoring Sensor Network."
                ]
            },
            {
                "sub_name_abbr": "conf/hotdep/2006",
                "sub_name": "Proceedings of the Second Workshop on Hot Topics in System Dependability, HotDep 2006, Seattle, WA, USA, November 8, 2006.",
                "count": 13,
                "papers": [
                    "Making Exception Handling Work.",
                    "Speculations: Providing Fault-tolerance and Recoverability in Distributed Environments.",
                    "Discrete Control for Dependable IT Automation.",
                    "SecondSite: Disaster Protection for the Common Server.",
                    "Abort, Retry, Litigate: Dependable Systems and Contract Law.",
                    "The Case for Byzantine Fault Detection.",
                    "Safe at Any Speed: Fast, Safe Parallelism in Servers.",
                    "Chunkfs: Using Divide-and-Conquer to Improve File System Reliability and Repair.",
                    "Towards a Dependable Architecture for Internet-scale Sensing.",
                    "Comprehensive Depiction of Configuration-dependent Performance Anomalies in Distributed Server Systems.",
                    "Static Analysis Meets Distributed Fault-Tolerance: Enabling State-Machine Replication with Nondeterminism.",
                    "Correlating Multi-Session Attacks via Replay.",
                    "Automatic On-line Failure Diagnosis at the End-User Site."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2006worlds",
                "sub_name": "3rd USENIX Workshop on Real, Large Distributed Systems, WORLDS'06, Seattle, WA, USA, November 5, 2006.",
                "count": 8,
                "papers": [
                    "Towards Fingerpointing in the Emulab Dynamic Distributed System.",
                    "Data Management for Internet-Scale Single-Sign-On.",
                    "A Distributed File System for a Wide-Area High Performance Computing Infrastructure.",
                    "Resource Management for Global Public Computing: Many Policies Are Better Than (N)one.",
                    "Optimizing Grid Site Manager Performance with Virtual Machines.",
                    "Geolocalization on the Internet through Constraint Satisfaction.",
                    "A Platform for Unobtrusive Measurements on PlanetLab.",
                    "ConfiDNS: Leveraging Scale and History to Improve DNS Security."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th OSDI 2004",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2004",
                "sub_name": "6th Symposium on Operating System Design and Implementation (OSDI 2004), San Francisco, California, USA, December 6-8, 2004.",
                "count": 27,
                "papers": [
                    "Recovering Device Drivers (Awarded Best Paper!).",
                    "Unmodified Device Driver Reuse and Improved System Dependability via Virtual Machines.",
                    "Microreboot - A Technique for Cheap Recovery.",
                    "Automated Worm Fingerprinting.",
                    "Understanding and Dealing with Operator Mistakes in Internet Services.",
                    "Configuration Debugging as Search: Finding the Needle in the Haystack.",
                    "Chain Replication for Supporting High Throughput and Availability.",
                    "Boxwood: Abstractions as the Foundation for Storage Infrastructure.",
                    "Secure Untrusted Data Repository (SUNDR).",
                    "MapReduce: Simplified Data Processing on Large Clusters.",
                    "FUSE: Lightweight Guaranteed Distributed Failure Notification.",
                    "PlanetSeer: Internet Path Failure Monitoring and Characterization in Wide-Area Services.",
                    "Improving the Reliability of Internet Paths with One-hop Source Routing.",
                    "CoDNS: Improving DNS Performance and Reliability via Cooperative Lookups.",
                    "Middleboxes No Longer Considered Harmful.",
                    "Correlating Instrumentation Data to System States: A Building Block for Automated Diagnosis and Control.",
                    "Automatic Misconfiguration Troubleshooting with PeerPressure.",
                    "Using Magpie for Request Extraction and Workload Modelling.",
                    "Using Model Checking to Find Serious File System Errors (Awarded Best Paper!).",
                    "CP-Miner: A Tool for Finding Copy-paste and Related Bugs in Operating System Code.",
                    "Enhancing Server Availability and Security Through Failure-Oblivious Computing.",
                    "Deploying Safe User-Level Network Services with icTCP.",
                    "ksniffer: Determining the Remote Client Perceived Response Time from Live Packet Streams.",
                    "FFPF: Fairly Fast Packet Filters.",
                    "Energy-Efficiency and Storage Flexibility in the Blue File System.",
                    "Life or Death at Block-Level.",
                    "Program-Counter-Based Pattern Classification in Buffer Caching."
                ]
            },
            {
                "sub_name_abbr": "conf/osdi/2004worlds",
                "sub_name": "First USENIX Workshop on Real, Large Distributed Systems, WORLDS'04, San Francisco, CA, USA, December 5, 2004.",
                "count": 13,
                "papers": [
                    "Deploying Large File Transfer on an HTTP Content Distribution Network.",
                    "Towards a Deployable IP Anycast Service.",
                    "DISC: A System for Distributed Data Intensive Scientific Computing.",
                    "Deployment of a Large-scale Peer-to-Peer Social Network.",
                    "The Seven Deadly Sins of Distributed Systems.",
                    "Beyond Availability: Towards a Deeper Understanding of Machine Failure Characteristics in Large Distributed Systems.",
                    "Lessons from E-speak.",
                    "Design Considerations for Information Planes.",
                    "A Shared Global Event Propagation System to Enable Next Generation Distributed Services.",
                    "Distributed Resource Discovery on PlanetLab with SWORD.",
                    "Global-scale Service Deployment in the XenoServer Platform.",
                    "Safely Harnessing Wide Area Surrogate Computing or How to Avoid Building the Perfect Platform for Network Attacks.",
                    "Implementing the Emulab-PlanetLab Portal: Experience and Lessons Learned."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th OSDI 2002",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2002",
                "sub_name": "5th Symposium on Operating System Design and Implementation (OSDI 2002), Boston, Massachusetts, USA, December 9-11, 2002.",
                "count": 27,
                "papers": [
                    "FARSITE: Federated, Available, and Reliable Storage for an Incompletely Trusted Environment.",
                    "Taming Aggressive Replication in the Pangaea Wide-Area File System.",
                    "Ivy: A Read/Write Peer-to-Peer File System.",
                    "Defensive Programming: Using an Annotation Toolkit to Build DoS-Resistant Software.",
                    "Using Model Checking to Debug Device Firmware.",
                    "CMC: A Pragmatic Approach to Model Checking Real Code.",
                    "Practical, Transparent Operating System Support for Superpages.",
                    "Vertigo: Automatic Performance-Setting for Linux.",
                    "Cooperative I/O: A Novel I/O Semantics for Energy-Aware Applications.",
                    "TAG: A Tiny AGgregation Service for Ad-Hoc Sensor Networks.",
                    "Fine-Grained Network Time Synchronization Using Reference Broadcasts.",
                    "Supporting Time-Sensitive Applications on a Commodity OS.",
                    "Memory Resource Management in VMware ESX Server.",
                    "Scale and Performance in the Denali Isolation Kernel.",
                    "ReVirt: Enabling Intrusion Analysis Through Virtual-Machine Logging and Replay.",
                    "Integrated Resource Management for Cluster-based Internet Services.",
                    "Resource Overbooking and Application Profiling in Shared Hosting Platforms.",
                    "An Integrated Experimental Environment for Distributed Systems and Networks.",
                    "Scalability and Accuracy in a Large-Scale Network Emulator.",
                    "Pastiche: Making Backup Cheap and Easy.",
                    "Secure Routing for Structured Peer-to-Peer Overlay Networks.",
                    "An Analysis of Internet Content Delivery Systems.",
                    "TCP Nice: A Mechanism for Background Transfers.",
                    "The Effectiveness of Request Redirection on CDN Robustness.",
                    "The Design and Implementation of Zap: A System for Migrating Computing Environments.",
                    "Optimizing the Migration of Virtual Computers.",
                    "Luna: A Flexible Java Protection System."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "4th OSDI 2000",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/2000",
                "sub_name": "4th Symposium on Operating System Design and Implementation (OSDI 2000), San Diego, California, USA, October 23-25, 2000.",
                "count": 24,
                "papers": [
                    "Checking System Rules Using System-Specific, Programmer-Written Compiler Extensions.",
                    "Devil: An IDL for Hardware Programming.",
                    "Taming the Memory Hogs: Using Compiler-Inserted Releases to Manage Physical Memory Intelligently.",
                    "Surplus Fair Scheduling: A Proportional-Share CPU Scheduling Algorithm for Symmetric Multiprocessors.",
                    "Performance-Driven Processor Allocation.",
                    "Policies for Dynamic Clock Scheduling.",
                    "Towards Higher Disk Head Utilization: Extracting \"Free\" Bandwidth from Busy Disk Drives.",
                    "Latency Management in Storage Systems.",
                    "A Low-Overhead, High-Performance Unified Buffer Management Scheme That Exploits Sequential and Looping References.",
                    "How to Build a Trusted Database System on Untrusted Storage.",
                    "End-to-End Authorization.",
                    "Self-Securing Storage: Protecting Data in Compromised Systems.",
                    "Fast and Secure Distributed Read-Only File System.",
                    "Overcast: Reliable Multicasting with an Overlay Network.",
                    "System Support for Bandwidth Management and Content Adaptation in Internet Applications.",
                    "Operating System Management of MEMS-based Storage Devices.",
                    "Trading Capacity for Performance in a Disk Array.",
                    "Interposed Request Routing for Scalable Network Storage.",
                    "Proactive Recovery in a Byzantine-Fault-Tolerant System.",
                    "Exploring Failure Transparency and the Limits of Generic Recovery.",
                    "Design and Evaluation of a Continuous Consistency Model for Replicated Services.",
                    "Scalable, Distributed Data Structures for Internet Service Construction.",
                    "Processes in KaffeOS: Isolation, Resource Management, and Sharing in Java.",
                    "Knit: Component Composition for Systems Software."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "3rd OSDI 1999",
        "info": "New Orleans, Louisiana",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/1999",
                "sub_name": "Proceedings of the Third USENIX Symposium on Operating Systems Design and Implementation (OSDI), New Orleans, Louisiana, USA, February 22-25, 1999.",
                "count": 20,
                "papers": [
                    "Automatic I/O Hint Generation Through Speculative Execution.",
                    "IO-Lite: A Unified I/O Buffering and Caching System.",
                    "Virtual Log Based File Systems for a Programmable Disk.",
                    "Resource Containers: A New Facility for Resource Management in Server Systems.",
                    "Defending Against Denial of Service Attacks in Scout.",
                    "Self-Paging in the Nemesis Operating System.",
                    "Tornado: Maximizing Locality and Concurrency in a Shared Memory Multiprocessor Operating System.",
                    "Interface and Execution Models in the Fluke Kernel.",
                    "Fine-Grained Dynamic Instrumentation of Commodity Operating System Kernels.",
                    "ETI Resource Distributor: Guaranteed Resource Allocation and Scheduling in Multimedia Systems.",
                    "A Feedback-driven Proportion Allocator for Real-Rate Scheduling.",
                    "A Comparison of Windows Driver Model Latency Performance on Windows NT and Windows 98.",
                    "Practical Byzantine Fault Tolerance.",
                    "The Coign Automatic Distributed Partitioning System.",
                    "Tapeworm: High-Level Abstractions of Shared Accesses.",
                    "MultiView and Millipage - Fine-Grain Sharing in Page-Based DSMs.",
                    "Optimizing the Idle Task and Other MMU Tricks.",
                    "Logical vs. Physical File System Backup.",
                    "The Design of a Multicast-Based Distributed File System.",
                    "Integrating Content-Based Access Mechanisms with Hierarchical File Systems."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "2nd OSDI 1996",
        "info": "Seattle, Washington",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/1996",
                "sub_name": "Proceedings of the Second USENIX Symposium on Operating Systems Design and Implementation (OSDI), Seattle, Washington, USA, October 28-31, 1996.",
                "count": 21,
                "papers": [
                    "JavaOS: Back to the Future (Abstract).",
                    "Automatic Compiler-Inserted I/O Prefetching for Out-of-Core Applications.",
                    "A Trace-Driven Comparison of Algorithms for Parallel Prefetching and Caching.",
                    "Efficient Cooperative Caching Using Hints.",
                    "Online Data-Race Detection via Coherency Guarantees.",
                    "Lightweight Logging for Lazy Release Consistent Distributed Shared Memory.",
                    "Performance Evaluation of Two Home-Based Lazy Release Consistency Protocols for Shared Virtual Memory Systems.",
                    "Active Networks (Abstract).",
                    "CPU Inheritance Scheduling.",
                    "A Hierarchical CPU Scheduler for Multimedia Operating Systems.",
                    "The Synergy Between Non-Blocking Synchronization and Operating System Structure.",
                    "Microkernels Meet Recursive Virtual Machines.",
                    "Making Paths Explicit in the Scout Operating System.",
                    "Studies of Windows NT Performance Using Dynamic Execution Traces.",
                    "Using Latency to Evaluate Interactive System Performance.",
                    "Dynamic Binding for an Extensible System.",
                    "Dealing with Disaster: Surviving Misbehaved Kernel Extensions.",
                    "Safe Kernel Extensions Without Run-Time Checking.",
                    "An Implementation of the Hamlyn Sender-Managed Interface Architecture.",
                    "Lazy Receiver Processing (LRP): A Network Subsystem Architecture for Server Systems.",
                    "Effects of Buffering Semantics on I/O Performance."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "1st OSDI 1994",
        "info": "Monterey, California",
        "venues": [
            {
                "sub_name_abbr": "conf/osdi/1994",
                "sub_name": "Proceedings of the First USENIX Symposium on Operating Systems Design and Implementation (OSDI), Monterey, California, USA, November 14-17, 1994.",
                "count": 27,
                "papers": [
                    "Lottery Scheduling: Flexible Proportional-Share Resource Management.",
                    "Scheduling for Reduced CPU Energy.",
                    "Storage Alternatives for Mobile Computers.",
                    "Opportunistic Log: Efficient Installation Reads in a Reliable Storage Server.",
                    "Metadata Update Performance in File Systems.",
                    "Disk-directed I/O for MIMD Multiprocessors.",
                    "Message-Driven Relaxed Consistency in a Software Distributed Shared Memory.",
                    "Software Write Detection for a Distributed Shared Memory.",
                    "The Design and Evaluation of a Shared Object System for Distributed Memory Machines.",
                    "PathFinder: A Pattern-Based Packet Classifier.",
                    "Performance Issues in Parallelized Network Protocols.",
                    "Experiences with Locking in a NUMA Multiprocessor Operating System Kernel.",
                    "HiPEC: High Performance External Virtual Memory Caching.",
                    "Implementation and Performance of Application-Controlled File Caching.",
                    "A Caching Model of Operating System Kernel Functionality.",
                    "Panel: Radical Operating Systems Structures for Extensibility.",
                    "Some Issues in the Design of an Extensible Operating System (Panel Statement).",
                    "Low and High Risk Operating System Architectures (Panel Statement).",
                    "The Exokernel Approach to Operating System Extensibility (Panel Statement).",
                    "High-Performance Microkernel Systems (Panel Statement).",
                    "Scout: A Communications-Oriented Operating System (Abstract).",
                    "Distributed Filaments: Efficient Fine-Grain Parallelism on a Cluster of Workstations.",
                    "Integrating Coherency and Recoverability in Distributed Systems.",
                    "Garbage Collection and DSM Consistency.",
                    "Software Prefetching and Caching for Translation Lookaside Buffers.",
                    "Dynamic Page Mapping Policies for Cache Conflict Resolution on Standard Hardware.",
                    "Cooperative Caching: Using Remote Client Memory to Improve File System Performance."
                ]
            }
        ]
    }
]