[
    {
        "year": "2022",
        "name": "49th POPL 2022",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 6(POPL)",
                "count": 65,
                "papers": [
                    "What's decidable about linear loops?",
                    "Linked visualisations via Galois dependencies.",
                    "From enhanced coinduction towards enhanced induction.",
                    "Simuliris: a separation logic framework for verifying concurrent program optimizations.",
                    "Dependently-typed data plane programming.",
                    "A separation logic for negative dependence.",
                    "Concurrent incorrectness separation logic.",
                    "Safe, modular packet pipeline programming.",
                    "Property-directed reachability as abstract interpretation in the monotone theory.",
                    "Effectful program distancing.",
                    "Provably correct, asymptotically efficient, higher-order reverse-mode automatic differentiation.",
                    "Symmetries in reversible programming: from symmetric rig groupoids to reversible programming languages.",
                    "A separation logic for heap space under garbage collection.",
                    "Connectivity graphs: a method for proving deadlock freedom based on separation logic.",
                    "Oblivious algebraic data types.",
                    "Observational equality: now for good.",
                    "VIP: verifying real-world C idioms with integer-pointer casts.",
                    "Twist: sound reasoning for purity and entanglement in Quantum programs.",
                    "Semantics for variational Quantum programming.",
                    "Induction duality: primal-dual search for invariants.",
                    "A cost-aware logical framework.",
                    "The leaky semicolon: compositional semantic dependencies for relaxed-memory concurrency.",
                    "Isolation without taxation: near-zero-cost transitions for WebAssembly and SFI.",
                    "One polynomial approximation to produce correctly rounded results of an elementary function for multiple representations and rounding modes.",
                    "Fair termination of binary sessions.",
                    "Layered and object-based game semantics.",
                    "A fine-grained computational interpretation of Girard's intuitionistic proof-nets.",
                    "Partial (In)Completeness in abstract interpretation: limiting the imprecision in program analysis.",
                    "Subcubic certificates for CFL reachability.",
                    "Mœbius: metaprogramming using contextual types: the stage where system f can pattern match on itself.",
                    "Bottom-up synthesis of recursive functional programs using angelic execution.",
                    "Visibility reasoning for concurrent snapshot algorithms.",
                    "Reasoning about \"reasoning about reasoning\": semantics and contextual equivalence for probabilistic programs with nested queries and recursion.",
                    "Static prediction of parallel computation graphs.",
                    "Verified compilation of C programs with a nominal memory model.",
                    "Efficient algorithms for dynamic bidirected Dyck-reachability.",
                    "Staging with class: a specification for typed template Haskell.",
                    "A Quantum interpretation of separating conjunction for local reasoning of Quantum programs based on separation logic.",
                    "Certifying derivation of state machines from coroutines.",
                    "Relational e-matching.",
                    "On incorrectness logic and Kleene algebra with top and tests.",
                    "Quantum information effects.",
                    "On type-cases, union elimination, and occurrence typing.",
                    "Solving constrained Horn clauses modulo algebraic data types and recursive functions.",
                    "Verified tensor-program optimization via high-level scheduling rewrites.",
                    "Truly stateless, optimal dynamic partial order reduction.",
                    "The decidability and complexity of interleaved bidirected Dyck reachability.",
                    "Interval universal approximation for neural networks.",
                    "Type-level programming with match types.",
                    "A relational theory of effects and coeffects.",
                    "Pirouette: higher-order typed functional choreographies.",
                    "Extending Intel-x86 consistency and persistency: formalising the semantics of Intel-x86 memory types and non-temporal stores.",
                    "A dual number abstraction for static analysis of Clarke Jacobians.",
                    "Context-bounded verification of thread pools.",
                    "Fully abstract models for effectful λ-calculi via category-theoretic logical relations.",
                    "PRIMA: general and precise neural network certification via scalable convex hull approximations.",
                    "Logarithm and program testing.",
                    "Return of CFA: call-site sensitivity can be superior to object sensitivity even for object-oriented programs.",
                    "Learning formulas in finite variable logics.",
                    "Software model-checking as cyclic-proof search.",
                    "SolType: refinement types for arithmetic overflow in solidity.",
                    "Solving string constraints with Regex-dependent functions through transducers with priorities and variables.",
                    "Profile inference revisited.",
                    "A formal foundation for symbolic evaluation with merging.",
                    "Formal metatheory of second-order abstract syntax."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "48th POPL 2021",
        "info": "Virtual Event, Denmark",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 5(POPL)",
                "count": 167,
                "papers": [
                    "Cyclic proofs, system t, and the power of contraction.",
                    "Diamonds are not forever: liveness in reactive programming with guarded recursion.",
                    "𝜆ₛ: computable semantics for differentiable programming with higher-order functions and datatypes.",
                    "Verifying observational robustness against a c11-style memory model.",
                    "On algebraic abstractions for concurrent separation logics.",
                    "Efficient and provable local capability revocation using uninitialized capabilities.",
                    "Fully abstract from static to gradual.",
                    "Deciding accuracy of differential privacy schemes.",
                    "A computational interpretation of compact closed categories: reversible programming with negative and fractional types.",
                    "Mechanized logical relations for termination-insensitive noninterference.",
                    "Probabilistic programming semantics for name generation.",
                    "Internalizing representation independence with univalence.",
                    "Transfinite step-indexing for termination.",
                    "Generating collection transformations from proofs.",
                    "Learning the boundary of inductive invariants.",
                    "Precise subtyping for asynchronous multiparty sessions.",
                    "Verifying correct usage of context-free API protocols.",
                    "Provably space-efficient parallel functional programming.",
                    "Data flow refinement type inference.",
                    "Simplifying dependent reductions in the polyhedral model.",
                    "On the semantic expressiveness of recursive types.",
                    "Intrinsically typed compilation with nameless labels.",
                    "egg: Fast and extensible equality saturation.",
                    "Asynchronous effects.",
                    "Modeling and analyzing evaluation cost of CUDA kernels.",
                    "Dijkstra monads forever: termination-sensitive specifications for interaction trees.",
                    "A unifying type-theory for higher-order (amortized) cost analysis.",
                    "Automatic differentiation in PCF.",
                    "An approach to generate correctly rounded math libraries for new floating point variants.",
                    "Semantics-guided synthesis.",
                    "An abstract interpretation for SPMD divergence on reducible control flow graphs.",
                    "Intersection types and (positive) almost-sure termination.",
                    "A separation logic for effect handlers.",
                    "The fine-grained and parallel complexity of andersen's pointer analysis.",
                    "Giving semantics to program-counter labels via secure effects.",
                    "Optimal prediction of synchronization-preserving races.",
                    "A verified optimizer for Quantum circuits.",
                    "Automata and fixpoints for asynchronous hyperproperties.",
                    "Relatively complete verification of probabilistic programs: an expressive language for expectation-based reasoning.",
                    "Verified code generation for the polyhedral model.",
                    "Petr4: formal foundations for p4 data planes.",
                    "Distributed causal memory: modular specification and verification in higher-order distributed separation logic.",
                    "PerSeVerE: persistency semantics for verification under ext4.",
                    "Context-bounded verification of liveness properties for multithreaded shared-memory programs.",
                    "A practical mode system for recursive definitions.",
                    "Formally verified speculation and deoptimization in a JIT compiler.",
                    "Taming x86-TSO persistency.",
                    "Deciding ω-regular properties on linear recurrence sequences.",
                    "Automatically eliminating speculative leaks from cryptographic code with blade.",
                    "A graded dependent type system with a usage-aware semantics.",
                    "The (In)Efficiency of interaction.",
                    "A pre-expectation calculus for probabilistic sensitivity.",
                    "Corpse reviver: sound and efficient gradual typing via contract verification.",
                    "Combining the top-down propagation and bottom-up enumeration for inductive program synthesis.",
                    "Intensional datatype refinement: with application to scalable verification of pattern-match safety.",
                    "Deciding reachability under persistent x86-TSO.",
                    "Functorial semantics for partial theories.",
                    "Paradoxes of probabilistic programming: and how to condition on events of measure zero with infinitesimal probabilities.",
                    "On the complexity of bidirected interleaved Dyck-reachability.",
                    "The taming of the rew: a type theory with computational assumptions.",
                    "Abstracting gradual typing moving forward: precise and space-efficient.",
                    "An order-aware dataflow model for parallel Unix pipelines.",
                    "Getting to the point: index sets and parallelism-preserving autodiff for pointful array programming.",
                    "Of JavaScript AOT compilation performance.",
                    "Generalized evidence passing for effect handlers: efficient compilation of effect handlers to C.",
                    "Symbolic and automatic differentiation of languages.",
                    "Algebras for weighted search.",
                    "Reasoning about effect interaction by fusion.",
                    "Compositional optimizations for CertiCoq.",
                    "Contextual modal types for algebraic effects and handlers.",
                    "Higher-order probabilistic adversarial computations: categorical semantics and program logics.",
                    "Newly-single and loving it: improving higher-order must-alias analysis with heap fragments.",
                    "Efficient tree-traversals: reconciling parallelism and dense data representations.",
                    "Formal verification of a concurrent bounded queue in a weak memory model.",
                    "Steel: proof-oriented programming in a dependently typed concurrent separation logic.",
                    "A theory of higher-order subtyping with type intervals.",
                    "Propositions-as-types and shared state.",
                    "Theorems for free from separation logic specifications.",
                    "Modular, compositional, and executable formal semantics for LLVM IR.",
                    "Catala: a programming language for the law.",
                    "Persistent software transactional memory in Haskell.",
                    "CPS transformation with affine types for call-by-value implicit polymorphism.",
                    "ProbNV: probabilistic verification of network control planes.",
                    "How to evaluate blame for gradual types.",
                    "GhostCell: separating permissions from data in Rust.",
                    "Distributing intersection and union types with splits and duality (functional pearl).",
                    "Automatic amortized resource analysis with the Quantum physicist's method.",
                    "On continuation-passing transformations and expected cost analysis.",
                    "Skipping the binder bureaucracy with mixed embeddings in a semantics course (functional pearl).",
                    "Calculating dependently-typed compilers (functional pearl).",
                    "Grafs: declarative graph analytics.",
                    "An existential crisis resolved: type inference for first-class existential types.",
                    "Client-server sessions in linear logic.",
                    "Certifying the synthesis of heap-manipulating programs.",
                    "Deriving efficient program transformations from rewrite rules.",
                    "Reasoning about the garden of forking paths.",
                    "Static detection of silent misconfigurations with deep interaction analysis.",
                    "Data-driven abductive inference of library specifications.",
                    "What we eval in the shadows: a large-scale study of eval in R programs.",
                    "ECROs: building global scale systems from sequential code.",
                    "Reconciling optimization with secure compilation.",
                    "Compilation of sparse array programming models.",
                    "Making pointer analysis more precise by unleashing the power of selective context sensitivity.",
                    "VESPA: static profiling for binary optimization.",
                    "SimTyper: sound type inference for Ruby using type equality prediction.",
                    "LooPy: interactive program synthesis with control structures.",
                    "A multiparty session typing discipline for fault-tolerant event-driven distributed programming.",
                    "Much ADO about failures: a fault-aware model for compositional verification of strongly consistent distributed systems.",
                    "Efficient compilation of algebraic effect handlers.",
                    "Copy-and-patch compilation: a fast compilation algorithm for high-level languages and bytecode.",
                    "Programming and execution models for parallel bounded exhaustive testing.",
                    "Interpretable noninterference measurement and its application to processor designs.",
                    "Reachability types: tracking aliasing and separation in higher-order functional programs.",
                    "Rewrite rule inference using equality saturation.",
                    "Type stability in Julia: avoiding performance pathologies in JIT compilation.",
                    "Multi-modal program inference: a marriage of pre-trained language models and component-based synthesis.",
                    "Fully automated functional fuzzing of Android apps for detecting non-crashing logic bugs.",
                    "SecRSL: security separation logic for C11 release-acquire concurrency.",
                    "Generative type-aware mutation for testing SMT solvers.",
                    "Modular specification and verification of closures in Rust.",
                    "Synthesizing contracts correct modulo a test generator.",
                    "Well-typed programs can go wrong: a study of typing-related bugs in JVM compilers.",
                    "Specifying and testing GPU workgroup progress models.",
                    "Study of the subtyping machine of nominal subtyping with variance.",
                    "A derivative-based parser generator for visibly Pushdown grammars.",
                    "Automatic migration from synchronous to asynchronous JavaScript APIs.",
                    "Compacting points-to sets through object clustering.",
                    "Durable functions: semantics for stateful serverless.",
                    "Semantic programming by example with pre-trained models.",
                    "UDF to SQL translation through compositional lazy inductive synthesis.",
                    "Permchecker: a toolchain for debugging memory managers with typestate.",
                    "Rich specifications for Ethereum smart contract verification.",
                    "Making weak memory models fair.",
                    "The semantics of shared memory in Intel CPU/FPGA systems.",
                    "Coarsening optimization for differentiable programming.",
                    "APIfix: output-oriented program synthesis for combating breaking changes in libraries.",
                    "Transitioning from structural to nominal code with efficient gradual typing.",
                    "Generalizable synthesis through unification.",
                    "One down, 699 to go: or, synthesising compositional desugarings.",
                    "The reads-from equivalence for the TSO and PSO memory models.",
                    "JavaDL: automatically incrementalizing Java bug pattern detection.",
                    "How statically-typed functional programmers write code.",
                    "Scalability and precision by combining expressive type systems and deductive verification.",
                    "Program analysis via efficient symbolic abstraction.",
                    "Dynaplex: analyzing program complexity using dynamically inferred recurrence relations.",
                    "Compiling with continuations, correctly.",
                    "Promises are made to be broken: migrating R to strict semantics.",
                    "Efficient automatic scheduling of imaging and vision pipelines for the GPU.",
                    "Gauss: program synthesis by reasoning over graphs.",
                    "QuickSilver: modeling and parameterized verification for distributed agreement-based systems.",
                    "SpecSafe: detecting cache side channels in a speculative world.",
                    "Label dependent lambda calculus and gradual typing.",
                    "Not so fast: understanding and mitigating negative impacts of compiler optimizations on code reuse gadget sets.",
                    "FPL: fast Presburger arithmetic through transprecision.",
                    "Translating C to safer Rust.",
                    "Relational nullable types with Boolean unification.",
                    "LXM: better splittable pseudorandom number generators (and almost as fast).",
                    "Safer at any speed: automatic context-aware safety enhancement for Rust.",
                    "Verifying concurrent multicopy search structures.",
                    "Formal verification of high-level synthesis.",
                    "Synbit: synthesizing bidirectional programs using unidirectional sketches.",
                    "Statically bounded-memory delayed sampling for probabilistic streams.",
                    "Solver-based gradual type migration.",
                    "Symbolic value-flow static analysis: deep, precise, complete modeling of Ethereum smart contracts.",
                    "A type system for extracting functional specifications from memory-safe imperative programs.",
                    "Gradually structured data.",
                    "MonkeyDB: effectively testing correctness under weak isolation levels."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "47th POPL 2020",
        "info": "New Orleans, LA, United States",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 4(POPL)",
                "count": 233,
                "papers": [
                    "Taylor subsumes Scott, Berry, Kahn and Plotkin.",
                    "Deductive verification with ghost monitors.",
                    "Dependent type systems as macros.",
                    "The next 700 relational program logics.",
                    "Complexity and information in invariant inference.",
                    "Actris: session-type based reasoning in separation logic.",
                    "Formal verification of a constant-time preserving C compiler.",
                    "Coq Coq correct! verification of type checking and erasure for Coq, in Coq.",
                    "Undecidability of d<:  and its decidable fragments.",
                    "Incorrectness logic.",
                    "Persistency semantics of the Intel-x86 architecture.",
                    "Program synthesis by type-guided abstraction refinement.",
                    "Reductions for safety proofs.",
                    "Deterministic parallel fixpoint computation.",
                    "Recurrence extraction for functional programs through call-by-push-value.",
                    "Towards verified stochastic variational inference for probabilistic programs.",
                    "Fast, sound, and effectively complete dynamic race prediction.",
                    "Par means parallel: multiplicative linear logic proofs as concurrent functional programs.",
                    "Trace types and denotational semantics for sound programmable inference in probabilistic languages.",
                    "Virtual timeline: a formal abstraction for verifying preemptive schedulers with temporal isolation.",
                    "Relational proofs for quantum programs.",
                    "Seminaïve evaluation for a higher-order functional language.",
                    "CompCertM: CompCert with C-assembly linking and lightweight modular verification.",
                    "Liquidate your assets: reasoning about resource usage in liquid Haskell.",
                    "Proving expected sensitivity of probabilistic programs with randomized variable-dependent termination time.",
                    "Parameterized verification under TSO is PSPACE-complete.",
                    "The weak call-by-value λ-calculus is reasonable for both time and space.",
                    "Abstract extensionality: on the properties of incomplete abstract interpretations.",
                    "What is decidable about gradual types?",
                    "Decomposition diversity with symmetric data and codata.",
                    "Reduction monads and their signatures.",
                    "The high-level benefits of low-level sandboxing.",
                    "Spy game: verifying a local generic solver in Iris.",
                    "RustBelt meets relaxed memory.",
                    "Deciding memory safety for single-pass heap-manipulating programs.",
                    "Optimal approximate sampling from discrete probability distributions.",
                    "Aiming low is harder: induction for lower bounds in probabilistic program verification.",
                    "A simple differentiable programming language.",
                    "PλωNK: functional probabilistic NetKAT.",
                    "Partial type constructors: or, making ad hoc datatypes less ad hoc.",
                    "Stacked borrows: an aliasing model for Rust.",
                    "Abstract interpretation of distributed network control planes.",
                    "Executable formal semantics for the POSIX shell.",
                    "Mechanized semantics and verified compilation for a dataflow synchronous language with reset.",
                    "The future is ours: prophecy variables in separation logic.",
                    "Graduality and parametricity: together again for the first time.",
                    "Disentanglement in nested-parallel programs.",
                    "Binders by day, labels by night: effect instances via lexically scoped handlers.",
                    "Visualization by example.",
                    "A language for probabilistically oblivious computation.",
                    "Interaction trees: representing recursive and impure programs in Coq.",
                    "Synthesizing replacement classes.",
                    "Kind inference for datatypes.",
                    "Synthesis of coordination programs from linear temporal specifications.",
                    "A probabilistic separation logic.",
                    "Augmented example-based synthesis using relational perturbation properties.",
                    "Semantics of higher-order probabilistic programs with conditioning.",
                    "The fire triangle: how to mix substitution, dependent elimination, and effects.",
                    "SyTeCi: automating contextual equivalence for higher-order programs with references.",
                    "Detecting floating-point errors via atomic conditions.",
                    "Guarded Kleene algebra with tests: verification of uninterpreted programs in nearly linear time.",
                    "Provenance-guided synthesis of Datalog programs.",
                    "Full abstraction for the quantum lambda-calculus.",
                    "Backpropagation in the simply typed lambda-calculus with linear negation.",
                    "Does blame shifting work?",
                    "Decidable subtyping for path dependent types.",
                    "Label-dependent session types.",
                    "Pointer life cycle types for lock-free data structures with memory reclamation.",
                    "APL since 1978.",
                    "Thriving in a crowded and changing world: C++ 2006-2020.",
                    "A history of Clojure.",
                    "History of coarrays and SPMD parallelism in Fortran.",
                    "Origins of the D programming language.",
                    "Evolution of Emacs Lisp.",
                    "The early history of F#.",
                    "A history of the Groovy programming language.",
                    "JavaScript: the first 20 years.",
                    "LabVIEW.",
                    "History of Logo.",
                    "Hygienic macro technology.",
                    "A history of MATLAB.",
                    "The origins of Objective-C at PPI/Stepstone and its evolution at NeXT.",
                    "A history of the Oz multiparadigm language.",
                    "S, R, and data science.",
                    "The evolution of Smalltalk: from Smalltalk-72 through Squeak.",
                    "The history of Standard ML.",
                    "Verilog HDL and its ancestors and descendants.",
                    "A general approach to define binders using matching logic.",
                    "A quick look at impredicativity.",
                    "A unified view of modalities in type systems.",
                    "A dependently typed calculus with pattern matching and erasure inference.",
                    "Achieving high-performance the functional way: a functional pearl on expressing high-performance optimizations as rewrite strategies.",
                    "Compiling effect handlers in capability-passing style.",
                    "Composing and decomposing op-based CRDTs with semidirect products.",
                    "Computation focusing.",
                    "Cosmo: a concurrent separation logic for multicore OCaml.",
                    "Denotational recurrence extraction for amortized analysis.",
                    "Duplo: a framework for OCaml post-link optimisation.",
                    "Effect handlers, evidently.",
                    "Effects for efficiency: asymptotic speedup with first-class control.",
                    "Elaboration with first-class implicit function types.",
                    "Higher-order demand-driven symbolic evaluation.",
                    "Kindly bent to free us.",
                    "Kinds are calling conventions.",
                    "Liquid information flow control.",
                    "Liquid resource types.",
                    "Lower your guards: a compositional pattern-match coverage checker.",
                    "Parsing with zippers (functional pearl).",
                    "Program sketching with live bidirectional evaluation.",
                    "Raising expectations: automating expected cost analysis with types.",
                    "Recovering purity with comonads and capabilities.",
                    "Regular language type inference with term rewriting.",
                    "Retrofitting parallelism onto OCaml.",
                    "Scala step-by-step: soundness for DOT with step-indexed logical relations in Iris.",
                    "Sealing pointer-based optimizations behind pure functions.",
                    "Separation logic for sequential programs (functional pearl).",
                    "Signature restriction for polymorphic algebraic effects.",
                    "Sparcl: a language for partially-invertible computation.",
                    "Stable relations and abstract interpretation of higher-order programs.",
                    "Staged selective parser combinators.",
                    "SteelCore: an extensible concurrent separation logic for effectful dependently typed programs.",
                    "Strong functional pearl: Harper's regular-expression matcher in Cedille.",
                    "TLC: temporal logic of distributed components.",
                    "The simple essence of algebraic subtyping: principal type inference with subtyping made easy (functional pearl).",
                    "Fixpoints for the masses: programming with first-class Datalog constraints.",
                    "Effects as capabilities: effect handlers and lightweight effect polymorphism.",
                    "A systematic approach to deriving incremental type checkers.",
                    "Proving highly-concurrent traversals correct.",
                    "Certified and efficient instruction scheduling: application to interlocked VLIW processors.",
                    "Enabling accuracy-aware Quantum compilers using symbolic resource estimation.",
                    "Semiring optimizations: dynamic elision of expressions with identity and absorbing elements.",
                    "Can advanced type systems be usable? An empirical study of ownership, assets, and typestate in Obsidian.",
                    "Assertion-based optimization of Quantum programs.",
                    "Multiparty motion coordination: from choreographies to robotics programs.",
                    "Automated policy synthesis for system call sandboxing.",
                    "How do programmers use unsafe rust?",
                    "Learning semantic program embeddings with graph interval neural network.",
                    "Mossad: defeating software plagiarism detection.",
                    "Handling bidirectional control flow.",
                    "Scaling exact inference for discrete probabilistic programs.",
                    "Formulog: Datalog for SMT-based static analysis.",
                    "Precise inference of expressive units of measurement types.",
                    "WATCHER: in-situ failure diagnosis.",
                    "A model for detecting faults in build specifications.",
                    "Guided linking: dynamic linking without the costs.",
                    "Satune: synthesizing efficient SAT encoders.",
                    "Exposing cache timing side-channel leaks through out-of-order symbolic execution.",
                    "Statically verified refinements for multiparty protocols.",
                    "Featherweight go.",
                    "Projection-based runtime assertions for testing and debugging Quantum programs.",
                    "Persistent Owicki-Gries reasoning: a program logic for reasoning about persistent programs on Intel-x86.",
                    "Igloo: soundly linking compositional refinement and separation logic for distributed system verification.",
                    "DiffStream: differential output testing for stream processing programs.",
                    "Polymorphic types and effects with Boolean unification.",
                    "CAMP: cost-aware multiparty session protocols.",
                    "The anchor verifier for blocking and non-blocking concurrent software.",
                    "Automatic and efficient variability-aware lifting of functional programs.",
                    "A sparse iteration space transformation framework for sparse tensor algebra.",
                    "Programming with a read-eval-synth loop.",
                    "LiveDroid: identifying and preserving mobile app state in volatile runtime environments.",
                    "Towards a unified proof framework for automated fixpoint reasoning using matching logic.",
                    "Adversarial examples for models of code.",
                    "Towards a formal foundation of intermittent computing.",
                    "Compiling symbolic execution with staging and algebraic effects.",
                    "Testing differential privacy with dual interpreters.",
                    "Verifying and improving Halide's term rewriting system with program synthesis.",
                    "Dynamic dispatch of context-sensitive optimizations.",
                    "Eliminating abstraction overhead of Java stream pipelines using ahead-of-time program optimization.",
                    "Build scripts with perfect dependencies.",
                    "Deductive optimization of relational data storage.",
                    "Program equivalence for assisted grading of functional programs.",
                    "A modular cost analysis for probabilistic programs.",
                    "Geometry types for graphics programming.",
                    "Hidden inheritance: an inline caching design for TypeScript performance.",
                    "A type-and-effect system for object initialization.",
                    "Sound garbage collection for C using pointer provenance.",
                    "Dataflow-based pruning for speeding up superoptimization.",
                    "FlowCFL: generalized type-based reachability analysis: graph reduction and equivalence of CFL-based and type-based reachability.",
                    "Learning graph-based heuristics for pointer analysis without handcrafting application-specific features.",
                    "Knowing when to ask: sound scheduling of name resolution in type checkers derived from declarative specifications.",
                    "Designing types for R, empirically.",
                    "Shiftry: RNN inference in 2KB of RAM.",
                    "StreamQL: a query language for processing streaming time series.",
                    "Incremental predicate analysis for regression verification.",
                    "Perfectly parallel fairness certification of neural networks.",
                    "Fuzzing channel-based concurrency runtimes using types and effects.",
                    "Detecting locations in JavaScript programs affected by breaking library changes.",
                    "Rethinking safe consistency in distributed object-oriented programming.",
                    "DynamiTe: dynamic termination and non-termination proofs.",
                    "Precise static modeling of Ethereum \"memory\".",
                    "Taming type annotations in gradual typing.",
                    "Inter-theory dependency analysis for SMT string solvers.",
                    "On the unusual effectiveness of type-aware operator mutations for testing SMT solvers.",
                    "Pomsets with preconditions: a simple model of relaxed memory.",
                    "Fast linear programming through transprecision computing on small and sparse data.",
                    "Random testing for C and C++ compilers with YARPGen.",
                    "CompCertELF: verified separate compilation of C programs into ELF object files.",
                    "Scalable and serializable networked multi-actor programming.",
                    "Termination analysis for evolving programs: an incremental approach by reusing certified modules.",
                    "Programming and reasoning with partial observability.",
                    "Interactive synthesis of temporal specifications from examples and natural language.",
                    "A large-scale longitudinal study of flaky tests.",
                    "Differentially-private software frequency profiling under linear constraints.",
                    "Do you have space for dessert? a verified space cost semantics for CakeML programs.",
                    "Digging for fold: synthesis-aided API discovery for Haskell.",
                    "Resolution as intersection subtyping via Modus Ponens.",
                    "World age in Julia: optimizing method dispatch in the presence of eval.",
                    "ιDOT: a DOT calculus with object initialization.",
                    "Taming callbacks for smart contract modularity.",
                    "Testing consensus implementations using communication closure.",
                    "Finding bugs in database systems via query partitioning.",
                    "Structure interpretation of text formats.",
                    "Programming at the edge of synchrony.",
                    "Actor concurrency bugs: a comprehensive study on symptoms, root causes, API usages, and differences.",
                    "A structural model for contextual code changes.",
                    "Verifying replicated data types with typeclass refinements in Liquid Haskell.",
                    "Unifying execution of imperative generators and declarative specifications.",
                    "Regex matching with counting-set automata.",
                    "Feedback-driven semi-supervised synthesis of program transformations.",
                    "Contextual dispatch for function specialization.",
                    "Counterexample-guided correlation algorithm for translation validation.",
                    "Adding interactive visual syntax to textual code.",
                    "Revisiting iso-recursive subtyping.",
                    "Guiding dynamic programing via structural probability for accelerating programming by example.",
                    "Neural reverse engineering of stripped binaries using augmented control flow graphs.",
                    "Foundations of empirical memory consistency testing.",
                    "Just-in-time learning for bottom-up enumerative synthesis.",
                    "Gradual verification of recursive heap data structures.",
                    "Macros for domain-specific languages.",
                    "Learning-based controlled concurrency testing.",
                    "TacTok: semantics-aware proof synthesis.",
                    "Koord: a language for programming and verifying distributed robotics application.",
                    "Flow2Vec: value-flow-based precise code embedding."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "46th POPL 2019",
        "info": "Cascais, Portugal",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 3(POPL)",
                "count": 189,
                "papers": [
                    "Higher inductive types in cubical computational type theory.",
                    "Constructing quotient inductive-inductive types.",
                    "Definitional proof-irrelevance without K.",
                    "Bisimulation as path type for guarded recursive types.",
                    "Abstraction-safe effect handlers via tunneling.",
                    "Abstracting algebraic effects.",
                    "Intersection types and runtime errors in the pi-calculus.",
                    "Principality and approximation under dimensional bound.",
                    "Sound and complete bidirectional typechecking for higher-rank polymorphism with existentials and indexed types.",
                    "Fully abstract module compilation.",
                    "Polymorphic symmetric multiple dispatch with variance.",
                    "Abstracting extensible data types: or, rows by any other name.",
                    "Type-guided worst-case input generation.",
                    "Live functional programming with typed holes.",
                    "Gradual type theory.",
                    "Gradual typing: a new perspective.",
                    "Gradual parametricity, revisited.",
                    "Dynamic type inference for gradual Hindley-Milner typing.",
                    "StkTokens: enforcing well-bracketed control flow and stack encapsulation using linear capabilities.",
                    "Modalities, cohesion, and information flow.",
                    "Familial monads and structural operational semantics.",
                    "Bindings as bounded natural functors.",
                    "Categorical combinatorics of scheduling and synchronization in game semantics.",
                    "Better late than never: a fully-abstract semantics for classical processes.",
                    "Diagrammatic algebra: from linear to concurrent systems.",
                    "Fixpoint games on continuous lattices.",
                    "Two sides of the same coin: session types and game semantics: a synchronous side and an asynchronous side.",
                    "Exceptional asynchronous session types: session types without tiers.",
                    "Distributed programming using role-parametric session types in go: statically-typed endpoint APIs for dynamically-instantiated communication structures.",
                    "Less is more: multiparty session types revisited.",
                    "Quantitative robustness analysis of quantum programs.",
                    "Game semantics for quantum programming.",
                    "Quantum relational Hoare logic.",
                    "Quantitative separation logic: a logic for reasoning about probabilistic pointer programs.",
                    "Probabilistic programming with densities in SlicStan: efficient, flexible, and deterministic.",
                    "A domain theory for statistical probabilistic programming.",
                    "Bayesian synthesis of probabilistic programs for automatic data modeling.",
                    "Formal verification of higher-order probabilistic programs: reasoning about approximation, convergence, Bayesian inference, and optimization.",
                    "Trace abstraction modulo probability.",
                    "code2vec: learning distributed representations of code.",
                    "An abstract domain for certifying neural networks.",
                    "A²I: abstract² interpretation.",
                    "Concerto: a framework for combined concrete and abstract interpretation.",
                    "Skeletal semantics and their interpretations.",
                    "Refinement of path expressions for static analysis.",
                    "Decidable verification of uninterpreted programs.",
                    "Inferring frame conditions with static correlation analysis.",
                    "Context-, flow-, and field-sensitive data-flow analysis using synchronized Pushdown systems.",
                    "Decision procedures for path feasibility of string-manipulating programs with complex operations.",
                    "Modular quantitative monitoring.",
                    "Bounded model checking of signal temporal logic properties using syntactic separation.",
                    "Adventures in monitorability: from branching to linear time and back again.",
                    "Efficient parameterized algorithms for data packing.",
                    "Fast and exact analysis for LRU caches.",
                    "Closed forms for numerical loops.",
                    "Efficient automated repair of high floating-point errors in numerical libraries.",
                    "A true positives theorem for a static race detector.",
                    "Decoupling lock-free data structures from memory reclamation for static analysis.",
                    "Pretend synchrony: synchronous verification of asynchronous distributed programs.",
                    "Weak-consistency specification via visibility relaxation.",
                    "A calculus for Esterel: if can, can. if no can, no can.",
                    "An abstract stack based approach to verified compositional compilation to machine code.",
                    "A verified, efficient embedding of a verifiable assembly language.",
                    "A separation logic for concurrent randomized programs.",
                    "Iron: managing obligations in higher-order concurrent separation logic.",
                    "JaVerT 2.0: compositional symbolic execution for JavaScript.",
                    "Exploring C semantics and pointer provenance.",
                    "On library correctness under weak memory consistency: specifying and verifying concurrent libraries under declarative consistency models.",
                    "Bridging the gap between programming languages and hardware weak memory models.",
                    "Grounding thin-air reads with event structures.",
                    "ISA semantics for ARMv8-a, RISC-v, and CHERI-MIPS.",
                    "Structuring the synthesis of heap-manipulating programs.",
                    "FrAngel: component-based synthesis with control structures.",
                    "Hamsaz: replication coordination analysis and synthesis.",
                    "LWeb: information flow security for multi-tier web applications.",
                    "From fine- to coarse-grained dynamic information flow control and back.",
                    "CT-wasm: type-driven secure cryptography for the web ecosystem.",
                    "Rebuilding racket on chez scheme (experience report).",
                    "Compiling with continuations, or without? whatever.",
                    "Lambda calculus with algebraic simplification for reduction parallelization by equational reasoning.",
                    "Fairness in responsive parallelism.",
                    "Narcissus: correct-by-construction derivation of decoders and encoders from binary formats.",
                    "Closure conversion is safe for space.",
                    "Linear capabilities for fully abstract compilation of separation-logic-verified code.",
                    "The next 700 compiler correctness theorems (functional pearl).",
                    "Equations reloaded: high-level dependently-typed functional programming and proving in Coq.",
                    "Cubical agda: a dependently typed programming language with univalence and higher inductive types.",
                    "Approximate normalization for gradual dependent types.",
                    "Simple noninterference from parametricity.",
                    "Selective applicative functors.",
                    "Coherence of type class resolution.",
                    "Relational cost analysis for functional-imperative programs.",
                    "Fuzzi: a three-level logic for differential privacy.",
                    "Synthesizing differentially private programs.",
                    "Synthesizing symmetric lenses.",
                    "Demystifying differentiable programming: shift/reset the penultimate backpropagator.",
                    "Efficient differentiable programming in a functional array-processing language.",
                    "From high-level inference algorithms to efficient code.",
                    "Sound and robust solid modeling via exact real arithmetic and continuity.",
                    "Dependently typed Haskell in industry (experience report).",
                    "A role for dependent types in Haskell.",
                    "Higher-order type-level programming in Haskell.",
                    "A predicate transformer semantics for effects (functional pearl).",
                    "Dijkstra monads for all.",
                    "Mechanized relational verification of concurrent programs with continuations.",
                    "Sequential programming for replicated data stores.",
                    "Implementing a modal dependent type theory.",
                    "A reasonably exceptional type theory.",
                    "Simply RaTT: a fitch-style modal calculus for reactive programming without space leaks.",
                    "Quantitative program reasoning with graded modal types.",
                    "Mixed linear and non-linear recursive types.",
                    "A mechanical formalization of higher-ranked polymorphic type inference.",
                    "An efficient algorithm for type-safe structural diffing.",
                    "Call-by-need is clairvoyant call-by-value.",
                    "Teaching the art of functional programming using automated grading (experience report).",
                    "Lambda: the ultimate sublanguage (experience report).",
                    "CLOTHO: directed test generation for weakly consistent database systems.",
                    "Probabilistic verification of fairness properties via concentration.",
                    "Verifying safety and accuracy of approximate parallel programs via canonical sequentialization.",
                    "Qubit allocation as a combination of subgraph isomorphism and token swapping.",
                    "Modular verification of heap reachability properties in separation logic.",
                    "Complete monitors for gradual types.",
                    "TLA+ model checking made symbolic.",
                    "Value-centric dynamic partial order reduction.",
                    "Seq: a high-performance language for bioinformatics.",
                    "Staged abstract interpreters: fast and modular whole-program analysis via meta-programming.",
                    "Derivative grammars: a symbolic approach to parsing with derivatives.",
                    "Efficient lock-free durable sets.",
                    "Modular verification for almost-sure termination of probabilistic programs.",
                    "IVT: an efficient method for sharing subtype polymorphic objects.",
                    "Refinement kinds: type-safe programming with practical type-level computation.",
                    "Program synthesis with algebraic library specifications.",
                    "Weakening WebAssembly.",
                    "Generating a fluent API with syntax checking from an LR grammar.",
                    "Weak persistency semantics from the ground up: formalising the persistency semantics of ARMv8 and transactional models.",
                    "DeepSEA: a language for certified system software.",
                    "BDA: practical dependence analysis for binary executables by unbiased whole-program path sampling and per-path abstract interpretation.",
                    "Asphalion: trustworthy shielding against Byzantine faults.",
                    "Automatic repair of regular expressions.",
                    "Static analysis with demand-driven value refinement.",
                    "Relational verification using reinforcement learning.",
                    "A formalization of Java's concurrent access modes.",
                    "On the fly synthesis of edit suggestions.",
                    "A fault-tolerant programming model for distributed interactive applications.",
                    "A path to DOT: formalizing fully path-dependent types.",
                    "Reliable and fast DWARF-based stack unwinding.",
                    "Leveraging rust types for modular specification and verification.",
                    "Precision-preserving yet fast object-sensitive pointer analysis with partial context sensitivity.",
                    "Formal foundations of serverless computing.",
                    "Optimal stateless model checking for reads-from equivalence under sequential consistency.",
                    "Modular verification of web page layout.",
                    "Aroma: code recommendation via structural code search.",
                    "On the design, implementation, and use of laziness in R.",
                    "Mergeable replicated data types.",
                    "Compiler fuzzing: how much does it matter?",
                    "DProf: distributed profiler with strong guarantees.",
                    "Precise reasoning with structured time, structured heaps, and collective operations.",
                    "Casting about in the dark: an empirical study of cast operations in Java programs.",
                    "Getafix: learning to fix bugs automatically.",
                    "Generating precise error specifications for C: a zero shot learning approach.",
                    "Specifying concurrent programs in separation logic: morphisms and simulations.",
                    "Improving bug detection via context-based code representation learning and attention-based neural networks.",
                    "Scala implicits are everywhere: a large-scale study of the use of Scala implicits in the wild.",
                    "Optimization of swift protocols.",
                    "On the complexity of checking transactional consistency.",
                    "System FR: formalized foundations for the stainless verifier.",
                    "Language-integrated privacy-aware distributed queries.",
                    "AutoPandas: neural-backed generators for program synthesis.",
                    "Ryū revisited: printf floating point conversion.",
                    "IntelliMerge: a refactoring-aware software merging technique.",
                    "Certifying graph-manipulating C programs via localizations within data structures.",
                    "Duet: an expressive higher-order language and linear type system for statically enforcing differential privacy.",
                    "Effective lock handling in stateless model checking.",
                    "FuzzFactory: domain-specific fuzzing with waypoints.",
                    "AL: autogenerating supervised learning programs.",
                    "Sound and reusable components for abstract interpretation.",
                    "Design, implementation, and application of GPU-based Java bytecode interpreters.",
                    "Specification and inference of trace refinement relations.",
                    "Dependence-aware, unbounded sound predictive race detection.",
                    "Trace aware random testing for distributed systems.",
                    "Coverage guided, property based testing.",
                    "PlanAlyzer: assessing threats to the validity of online experiments.",
                    "I/O dependent idempotence bugs in intermittent systems.",
                    "Initialize once, start fast: application initialization at build time.",
                    "Safer smart contract programming with Scilla.",
                    "ApproxHPVM: a portable compiler IR for accuracy-aware optimizations.",
                    "Reflection-aware static regression test selection.",
                    "Automatic and scalable detection of logical errors in functional programming assignments.",
                    "Detecting nondeterministic payment bugs in Ethereum smart contracts."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "45th POPL 2018",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: PACMPL 2(POPL)",
                "count": 166,
                "papers": [
                    "Synthesizing bijective lenses.",
                    "WebRelate: integrating web data with spreadsheets using examples.",
                    "What is decidable about string constraints with the ReplaceAll function.",
                    "String constraints with concatenation and transducers solved efficiently.",
                    "Linear Haskell: practical linearity in a higher-order polymorphic language.",
                    "Polyadic approximations, fibrations and intersection types.",
                    "Handling fibred algebraic effects.",
                    "Handle with care: relational interpretation of algebraic effects and handlers.",
                    "Automated lemma synthesis in symbolic-heap separation logic.",
                    "Foundations for natural proofs and quantifier instantiation.",
                    "Higher-order constrained horn clauses for verification.",
                    "Relatively complete refinement type system for verification of higher-order non-deterministic programs.",
                    "Unifying analytic and statically-typed quasiquotes.",
                    "Jones-optimal partial evaluation by specialization-safe normalization.",
                    "Migrating gradual types.",
                    "Intrinsically-typed definitional interpreters for imperative languages.",
                    "Effective stateless model checking for C/C++ concurrency.",
                    "Transactions in relaxed memory architectures.",
                    "Simplifying ARM concurrency: multicopy-atomic axiomatic and operational models for ARMv8.",
                    "Progress of concurrent objects with partial methods.",
                    "A principled approach to ornamentation in ML.",
                    "Type-preserving CPS translation of Σ and Π types is not not possible.",
                    "Decidability of conversion for type theory in type theory.",
                    "Safety and conservativity of definitions in HOL and Isabelle/HOL.",
                    "Sound, complete, and tractable linearizability monitoring for concurrent collections.",
                    "Reducing liveness to safety in first-order logic.",
                    "Alone together: compositional reasoning and inference for weak isolation.",
                    "Programming and proving with distributed protocols.",
                    "Inference of static semantics for incomplete C programs.",
                    "Optimal Dyck reachability for data-dependence and alias analysis.",
                    "Data-centric dynamic partial order reduction.",
                    "Analytical modeling of cache behavior for affine programs.",
                    "A new proof rule for almost-sure termination.",
                    "Lexicographic ranking supermartingales: an efficient approach to termination of probabilistic programs.",
                    "Algorithmic analysis of termination problems for quantum programs.",
                    "Monadic refinements for relational cost analysis.",
                    "Go with the flow: compositional abstractions for concurrent data structures.",
                    "Parametricity versus the universal type.",
                    "Linearity in higher-order recursion schemes.",
                    "Symbolic types for lenient symbolic execution.",
                    "An axiomatic basis for bidirectional programming.",
                    "Simplicitly: foundations and applications of implicit function types.",
                    "Up-to techniques using sized types.",
                    "Univalent higher categories via complete Semi-Segal types.",
                    "Generating good generators for inductive relations.",
                    "Why is random testing effective for partition tolerance bugs?",
                    "On automatically proving the correctness of math.h implementations.",
                    "Online detection of effectively callback free objects with applications to smart contracts.",
                    "Correctness of speculative optimizations with dynamic deoptimization.",
                    "JaVerT: JavaScript verification toolchain.",
                    "Soft contract verification for higher-order stateful programs.",
                    "Collapsing towers of interpreters.",
                    "Refinement reflection: complete verification with SMT.",
                    "Non-linear reasoning for invariant synthesis.",
                    "A practical construction for decomposing numerical abstract domains.",
                    "Verifying equivalence of database-driven applications.",
                    "Proving expected sensitivity of probabilistic programs.",
                    "Synthesizing coupling proofs of differential privacy.",
                    "Measurable cones and stable, measurable functions: a model for probabilistic higher-order programming.",
                    "Denotational validation of higher-order Bayesian inference.",
                    "Strategy synthesis for linear arithmetic games.",
                    "Bonsai: synthesis-based reasoning for type systems.",
                    "Program synthesis using abstraction refinement.",
                    "A logical relation for monadic encapsulation of state: proving contextual equivalences in the presence of runST.",
                    "Recalling a witness: foundations and applications of monotonic state.",
                    "RustBelt: securing the foundations of the rust programming language.",
                    "Versatile event correlation with algebraic effects.",
                    "Parametric polymorphism and operational improvement.",
                    "Handling delimited continuations with dependent types.",
                    "The simple essence of automatic differentiation.",
                    "A spectrum of type soundness and performance.",
                    "Compositional soundness proofs of abstract interpreters.",
                    "Graduality from embedding-projection pairs.",
                    "Incremental relational lenses.",
                    "Elaborating dependent (co)pattern matching.",
                    "Capturing the future by replaying the past (functional pearl).",
                    "MoSeL: a general, extensible modal framework for interactive proofs in separation logic.",
                    "Mtac2: typed tactics for backward reasoning in Coq.",
                    "Build systems à la carte.",
                    "Synthesizing quotient lenses.",
                    "Finitary polymorphism for optimizing type-directed compilation.",
                    "Teaching how to program using automated assessment and functional glossy games (experience report).",
                    "Functional programming for modular Bayesian inference.",
                    "What you needa know about Yoneda: profunctor optics and the Yoneda lemma (functional pearl).",
                    "Generic deriving of generic traversals.",
                    "Relational algebra by way of adjunctions.",
                    "Contextual equivalence for a probabilistic language with continuous random variables and recursion.",
                    "Strict and lazy semantics for effects: layering monads and comonads.",
                    "Ready, set, verify! applying hs-to-coq to real-world Haskell code (experience report).",
                    "A type and scope safe universe of syntaxes with binding: their semantics and proofs.",
                    "Parallel complexity analysis with temporal session types.",
                    "Equivalences for free: univalent parametricity for effective transport.",
                    "Prototyping a functional language using higher-order logic programming: a functional pearl on learning the ways of λProlog/Makam.",
                    "Tight typings and split bounds.",
                    "Competitive parallelism: getting your priorities right.",
                    "Fault tolerant functional reactive programming (functional pearl).",
                    "Static interpretation of higher-order modules in Futhark: functional GPU programming in the large.",
                    "Casts and costs: harmonizing safety and performance in gradual typing.",
                    "Functional programming for compiling and decompiling computer-aided design.",
                    "Partially-static data as free extension of algebras.",
                    "What's the difference? a functional pearl on subtracting bijections.",
                    "Keep your laziness in check.",
                    "Merlin: a language server for OCaml (experience report).",
                    "Generic zero-cost reuse for dependent types.",
                    "Refunctionalization of abstract abstract machines: bridging the gap between abstract abstract machines and abstract definitional interpreters (functional pearl).",
                    "Reasonably programmable literal notation.",
                    "Thread-safe reactive programming.",
                    "Parallelization of dynamic languages: synchronizing built-in collections.",
                    "Virtual machine design for parallel dynamic programming languages.",
                    "goSLP: globally optimized superword level parallelism framework.",
                    "Effect handlers for the masses.",
                    "Empowering union and intersection types with integrated subtyping.",
                    "Julia subtyping: a rational reconstruction.",
                    "Scopes as types.",
                    "A derivation framework for dependent security label inference.",
                    "MadMax: surviving out-of-gas conditions in Ethereum smart contracts.",
                    "Faster variational execution with transparent bytecode transformation.",
                    "Secure serverless computing using dynamic information flow control.",
                    "AnyDSL: a partial evaluation framework for programming high-performance libraries.",
                    "Julia: dynamism and performance reconciled by design.",
                    "GraphIt: a high-performance graph DSL.",
                    "One tool, many languages: language-parametric transformation with incremental parametric syntax.",
                    "Format abstraction for sparse tensor algebra compilers.",
                    "ShareJIT: JIT code cache sharing across processes and its practical implementation.",
                    "Reconciling high-level optimizations and low-level code in LLVM.",
                    "An empirical study of the effect of source-level loop transformations on compiler stability.",
                    "Bidirectional evaluation with direct manipulation.",
                    "BioScript: programming safe chemistry on laboratories-on-a-chip.",
                    "Distributed system development with ScalaLoci.",
                    "Concurrency-aware object-oriented programming with roles.",
                    "Horn-ICE learning for synthesizing invariants and contracts.",
                    "Gradual liquid type inference.",
                    "Collapsible contracts: fixing a pathology of gradual typing.",
                    "The root cause of blame: contracts for intersection and union types.",
                    "Optimal stateless model checking under the release-acquire semantics.",
                    "Towards understanding the costs of avoiding out-of-thin-air results.",
                    "Persistence semantics for weak memory: integrating epoch persistency with the TSO memory model.",
                    "Identifying refactoring opportunities for replacing type code with subclass and state.",
                    "Incrementalizing lattice-based program analyses in Datalog.",
                    "Precise and scalable points-to analysis via data-driven context tunneling.",
                    "Precision-guided context sensitivity for pointer analysis.",
                    "Refinement in object-sensitivity points-to analysis via slicing.",
                    "Every data structure deserves lock-free memory reclamation.",
                    "RacerD: compositional static race detection.",
                    "What happens-after the first race? enhancing the predictive power of happens-before based dynamic race detection.",
                    "Sound deadlock prediction.",
                    "DeepBugs: a learning approach to name-based bug detection.",
                    "ExceLint: automatically finding spreadsheet formula errors.",
                    "Finding code that explodes under symbolic evaluation.",
                    "FlashProfile: a framework for synthesizing data profiles.",
                    "Cross-component garbage collection.",
                    "Reactive caching for composed services: polling at the speed of push.",
                    "Object-oriented recovery for non-volatile memory.",
                    "Software multiplexing: share your libraries and statically link them too.",
                    "Relational program synthesis.",
                    "Robust relational layout synthesis from examples for Android.",
                    "Speeding up symbolic reasoning for relational queries.",
                    "Automatic diagnosis and correction of logical errors for functional programming assignments.",
                    "Compositional programming and testing of dynamic distributed systems.",
                    "Randomized testing of distributed systems with probabilistic guarantees.",
                    "Test generation for higher-order functions in dynamic languages.",
                    "Finding broken promises in asynchronous JavaScript programs.",
                    "Leto: verifying application-specific hardware fault tolerance with programmable execution models.",
                    "Safe replication through bounded concurrency verification.",
                    "Verified three-way program merge.",
                    "Conflict resolution for structured merge via version space algebra."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "44th POPL 2017",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2017",
                "sub_name": "Proceedings of the 44th ACM SIGPLAN Symposium on Principles of Programming Languages, POPL 2017, Paris, France, January 18-20, 2017.",
                "count": 66,
                "papers": [
                    "The influence of dependent types (keynote).",
                    "Rust: from POPL to practice (keynote).",
                    "Ogre and Pythia: an invariance proof method for weak consistency models.",
                    "A posteriori environment analysis with Pushdown Delta CFA.",
                    "Semantic-directed clumping of disjunctive abstract states.",
                    "Fast polyhedra abstract domain.",
                    "Polymorphism, subtyping, and type inference in MLsub.",
                    "Java generics are turing complete.",
                    "Hazelnut: a bidirectionally typed structure editor calculus.",
                    "Modules, abstraction, and parametric polymorphism.",
                    "Beginner's luck: a language for property-based generators.",
                    "Exact Bayesian inference by symbolic disintegration.",
                    "Stochastic invariants for probabilistic termination.",
                    "Coupling proofs are probabilistic product programs.",
                    "A promising semantics for relaxed-memory concurrency.",
                    "Automatically comparing memory consistency models.",
                    "Interactive proofs in higher-order concurrent separation logic.",
                    "A relational model of types-and-effects in higher-order concurrent separation logic.",
                    "Monadic second-order logic on finite sequences.",
                    "On the relationship between higher-order recursion schemes and higher-order fixpoint logic.",
                    "Coming to terms with quantified reasoning.",
                    "A program optimization for automatic database result caching.",
                    "Stream fusion, to completeness.",
                    "Rigorous floating-point mixed-precision tuning.",
                    "Relational cost analysis.",
                    "Contract-based resource verification for higher-order functions with memoization.",
                    "Context-sensitive data-dependence analysis via linear conjunctive language reachability.",
                    "Towards automatic resource bound analysis for OCaml.",
                    "Deciding equivalence with sums and the empty type.",
                    "The exp-log normal form of types: decomposing extensional equality and representing terms compactly.",
                    "Contextual isomorphisms.",
                    "Typed self-evaluation via intensional type functions.",
                    "Mixed-size concurrency: ARM, POWER, C/C++11, and SC.",
                    "Dynamic race detection for C++11.",
                    "Serializability for eventual consistency: criterion, analysis, and applications.",
                    "Thread modularity at many levels: a pearl in compositional verification.",
                    "Type directed compilation of row-typed algebraic effects.",
                    "Do be do be do.",
                    "Dijkstra monads for free.",
                    "Stateful manifest contracts.",
                    "A semantic account of metric preservation.",
                    "Cantor meets scott: semantic foundations for probabilistic networks.",
                    "Genesis: synthesizing forwarding tables in multi-tenant networks.",
                    "LOIS: syntax and semantics.",
                    "Component-based synthesis for complex APIs.",
                    "Learning nominal automata.",
                    "On verifying causal consistency.",
                    "Complexity verification using guided theorem enumeration.",
                    "Intersection type calculi of bounded dimension.",
                    "Type soundness proofs with definitional interpreters.",
                    "Computational higher-dimensional type theory.",
                    "Type systems as macros.",
                    "Parallel functional arrays.",
                    "A short counterexample property for safety and liveness verification of fault-tolerant distributed algorithms.",
                    "Analyzing divergence in bisimulation semantics.",
                    "Fencing off go: liveness and safety for channel-based programming.",
                    "Big types in little runtime: open-world soundness and collaborative blame for gradual type systems.",
                    "Gradual refinement types.",
                    "Automatically generating the dynamic semantics of gradually typed languages.",
                    "Sums of uncertainty: refinements go gradual.",
                    "Invariants of quantum programs: characterisations and generation.",
                    "The geometry of parallelism: classical, probabilistic, and quantum effects.",
                    "QWIRE: a core language for quantum circuits.",
                    "LMS-Verify: abstraction without regret for verified systems programming.",
                    "Hypercollecting semantics and its application to static analysis of information flow.",
                    "LightDP: towards automating differential privacy proofs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "43rd POPL 2016",
        "info": "St. Petersburg, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2016",
                "sub_name": "Proceedings of the 43rd Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2016, St. Petersburg, FL, USA, January 20 - 22, 2016.",
                "count": 62,
                "papers": [
                    "Programming the world of uncertain things (keynote).",
                    "Synthesis of reactive controllers for hybrid systems (keynote).",
                    "Confluences in programming languages research (keynote).",
                    "Breaking through the normalization barrier: a self-interpreter for f-omega.",
                    "Type theory in type theory using quotient inductive types.",
                    "System f-omega with equirecursive types for datatype-generic programming.",
                    "A theory of effects and resources: adjunction models and polarised calculi.",
                    "Temporal verification of higher-order functional programs.",
                    "Scaling network verification using symmetry and surgery.",
                    "Model checking for symbolic-heap separation logic with inductive predicates.",
                    "Reducing crash recoverability to reachability.",
                    "Query-guided maximum satisfiability.",
                    "String solving with word equations and transducers: towards a logic for analysing mutation XSS.",
                    "Symbolic computation of differential equivalences.",
                    "Unboundedness and downward closures of higher-order pushdown automata.",
                    "Fully-abstract compilation by approximate back-translation.",
                    "Lightweight verification of separate compilation.",
                    "From MinX to MinC: semantics-driven decompilation of recursive datatypes.",
                    "Sound type-dependent syntactic language extension.",
                    "Decidability of inferring inductive invariants.",
                    "The hardness of data packing.",
                    "The complexity of interaction.",
                    "Dependent types and multi-monadic effects in F.",
                    "Fabular: regression formulas as probabilistic programming.",
                    "Kleenex: compiling nondeterministic transducers to deterministic streaming transducers.",
                    "Automatic patch generation by learning correct code.",
                    "Estimating types in binaries using predictive modeling.",
                    "Algorithmic analysis of qualitative and quantitative termination problems for affine probabilistic programs.",
                    "Transforming spreadsheet data types using examples.",
                    "Chapar: certified causally consistent distributed key-value stores.",
                    "'Cause I'm strong enough: reasoning about consistency choices in distributed systems.",
                    "A program logic for concurrent objects under fair scheduling.",
                    "PSync: a partially synchronous language for fault-tolerant distributed algorithms.",
                    "Principal type inference for GADTs.",
                    "Abstracting gradual typing.",
                    "The gradualizer: a methodology and algorithm for generating gradual type systems.",
                    "Is sound gradual typing dead?",
                    "Combining static analysis with probabilistic models to enable market-scale Android inter-component analysis.",
                    "Abstraction refinement guided by a learnt probabilistic model.",
                    "Learning invariants using decision trees and implication counterexamples.",
                    "Symbolic abstract data type inference.",
                    "SMO: an integrated approach to intra-array and inter-array storage optimization.",
                    "PolyCheck: dynamic verification of iteration space transformations on affine programs.",
                    "Printing floating-point numbers: a faster, always correct method.",
                    "Effects as sessions, sessions as effects.",
                    "Monitors and blame assignment for higher-order session types.",
                    "Environmental bisimulations for probabilistic higher-order languages.",
                    "Modelling the ARMv8 architecture, operationally: concurrency and ISA.",
                    "A concurrency semantics for relaxed atomics that permits optimisation and avoids thin-air executions.",
                    "Overhauling SC atomics in C11 and OpenCL.",
                    "Taming release-acquire consistency.",
                    "Newtonian program analysis via tensor product.",
                    "Casper: an efficient approach to call trace collection.",
                    "Pushdown control-flow analysis for free.",
                    "Binding as sets of scopes.",
                    "Lattice-theoretic progress measures and coalgebraic model checking.",
                    "Algorithms for algebraic path properties in concurrent systems of constant treewidth components.",
                    "Memoryful geometry of interaction II: recursion and adequacy.",
                    "Learning programs from noisy data.",
                    "Optimizing synthesis with metasketches.",
                    "Maximal specification synthesis.",
                    "Example-directed synthesis: a type-theoretic interpretation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "42nd POPL 2015",
        "info": "Mumbai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2015",
                "sub_name": "Proceedings of the 42nd Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2015, Mumbai, India, January 15-17, 2015.",
                "count": 55,
                "papers": [
                    "Automating Repetitive Tasks for the Masses.",
                    "Functors are Type Refinement Systems.",
                    "Integrating Linear and Dependent Types.",
                    "Higher Inductive Types as Homotopy-Initial Algebras.",
                    "Runtime Enforcement of Security Policies on Black Box Reactive Programs.",
                    "Higher-Order Approximate Relational Refinement Types for Mechanism Design and Differential Privacy.",
                    "Differential Privacy: Now it's Getting Personal.",
                    "Summary-Based Context-Sensitive Data-Dependence Analysis in Presence of Callbacks.",
                    "Faster Algorithms for Algebraic Path Properties in Recursive State Machines with Constant Treewidth.",
                    "Predicting Program Properties from \"Big Code\".",
                    "DReX: A Declarative Language for Efficiently Evaluating Regular String Transformations.",
                    "Data-Parallel String-Manipulating Programs.",
                    "Ur/Web: A Simple Model for Programming the Web.",
                    "Safe & Efficient Gradual Typing for TypeScript.",
                    "Space-Efficient Manifest Contracts.",
                    "Manifest Contracts for Datatypes.",
                    "Common Compiler Optimisations are Invalid in the C11 Memory Model and what we can do about it.",
                    "From Communicating Machines to Graphical Choreographies.",
                    "A Scalable, Correct Time-Stamped Stack.",
                    "A Formally-Verified C Static Analyzer.",
                    "Analyzing Program Analyses.",
                    "Compositional CompCert.",
                    "Polymorphic Functions with Set-Theoretic Types: Part 2: Local Type Inference and Type Reconstruction.",
                    "Principal Type Schemes for Gradual Programs.",
                    "Dependent Information Flow Types.",
                    "Abstract Symbolic Automata: Mixed syntactic/semantic similarity analysis of executables.",
                    "A Coalgebraic Decision Procedure for NetKAT.",
                    "Symbolic Algorithms for Language Equivalence and Kleene Algebra with Tests.",
                    "Programming up to Congruence.",
                    "A Meta Lambda Calculus with Cross-Level Computation.",
                    "Algebraic Effects, Linearity, and Quantum Programming Languages.",
                    "Proof Spaces for Unbounded Parallelism.",
                    "Equations, Contractions, and Unique Solutions.",
                    "Succinct Representation of Concurrent Trace Sets.",
                    "K-Java: A Complete Semantics of Java.",
                    "Towards the Essence of Hygiene.",
                    "Self-Representation in Girard's System U.",
                    "Coding by Everyone, Every Day.",
                    "Databases and Programming: Two Subjects Divided by a Common Language?",
                    "Probabilistic Termination: Soundness, Completeness, and Compositionality.",
                    "Leveraging Weighted Automata in Compositional Reasoning about Concurrent Probabilistic Systems.",
                    "Full Abstraction for Signal Flow Graphs.",
                    "Conjugate Hylomorphisms - Or: The Mother of All Structured Recursion Schemes.",
                    "Quantitative Interprocedural Analysis.",
                    "Specification Inference Using Context-Free Language Reachability.",
                    "On Characterizing the Data Access Complexity of Programs.",
                    "Sound Modular Verification of C Code Executing in an Unverified Context.",
                    "Deep Specifications and Certified Abstraction Layers.",
                    "From Network Interface to Multithreaded Web Applications: A Case Study in Modular Program Verification.",
                    "A Calculus for Relaxed Memory.",
                    "Iris: Monoids and Invariants as an Orthogonal Basis for Concurrent Reasoning.",
                    "Tractable Refinement Checking for Concurrent Objects.",
                    "Decentralizing SDN Policies.",
                    "Program Boosting: Program Synthesis via Crowd-Sourcing.",
                    "Fiat: Deductive Synthesis of Abstract Data Types in a Proof Assistant."
                ]
            },
            {
                "sub_name_abbr": "conf/popl/2015plmw",
                "sub_name": "Proceedings of the Programming Languages Mentoring Workshop, PLMW@POPL 2015, Mumbai, India, January 14, 2015.",
                "count": 0,
                "papers": []
            }
        ]
    },
    {
        "year": "2014",
        "name": "41st POPL 2014",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2014",
                "sub_name": "The 41st Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL '14, San Diego, CA, USA, January 20-21, 2014.",
                "count": 55,
                "papers": [
                    "Modular reasoning about concurrent higher-order imperative programs.",
                    "A Galois connection calculus for abstract interpretation.",
                    "Polymorphic functions with set-theoretic types: part 1: syntax, semantics, and evaluation.",
                    "Backpack: retrofitting Haskell with interfaces.",
                    "Combining proofs and programs in a dependently typed language.",
                    "Tracing compilation by abstract interpretation.",
                    "A type-directed abstraction refinement approach to higher-order model checking.",
                    "Fissile type analysis: modular checking of almost everywhere invariants.",
                    "A trusted mechanised JavaScript specification.",
                    "An operational and axiomatic semantics for non-determinism and sequence points in C.",
                    "NetkAT: semantic foundations for networks.",
                    "Bias-variance tradeoffs in program analysis.",
                    "Abstract satisfaction.",
                    "Proofs that count.",
                    "A verified information-flow architecture.",
                    "CakeML: a verified implementation of ML.",
                    "Probabilistic relational verification for cryptographic implementations.",
                    "Bridging boolean and quantitative synthesis using smoothed proof search.",
                    "A constraint-based approach to solving games on infinite graphs.",
                    "Sound compilation of reals.",
                    "30 years of research and development around Coq.",
                    "The essence of Reynolds.",
                    "Freeze after writing: quasi-deterministic parallel programming with LVars.",
                    "Replicated data types: specification, verification, optimality.",
                    "Verifying eventual consistency of optimistic replication systems.",
                    "On coinductive equivalences for higher-order probabilistic functional programs.",
                    "Probabilistic coherence spaces are fully abstract for probabilistic PCF.",
                    "Tabular: a schema-driven probabilistic programming language.",
                    "Modular, higher-order cardinality analysis in theory and practice.",
                    "Profiling for laziness.",
                    "Fair reactive programming.",
                    "Optimal dynamic partial order reduction.",
                    "Modular reasoning about heap paths via effectively propositional formulas.",
                    "A sound and complete abstraction for reasoning about parallel prefix sums.",
                    "Authenticated data structures, generically.",
                    "Gradual typing embedded securely in JavaScript.",
                    "Sound input filter generation for integer overflow errors.",
                    "Parametric completeness for separation theories.",
                    "Proof search for propositional abstract separation logics via labelled sequents.",
                    "A proof system for separation logic with magic wand.",
                    "From parametricity to conservation laws, via Noether's theorem.",
                    "A relationally parametric model of dependent type theory.",
                    "Game semantics for interface middleweight Java.",
                    "Abstract acceleration of general linear loops.",
                    "Minimization of symbolic automata.",
                    "Consistency analysis of decision-making programs.",
                    "Toward general diagnosis of static errors.",
                    "Counter-factual typing for debugging type errors.",
                    "Battery transition systems.",
                    "Symbolic optimization with SMT solvers.",
                    "Abstract effects and proof-relevant logical relations.",
                    "Parametric effect monads and semantics of effect systems.",
                    "Applying quantitative semantics to higher-order quantum computing.",
                    "A nonstandard standardization theorem.",
                    "Closed type families with overlapping equations."
                ]
            },
            {
                "sub_name_abbr": "conf/popl/2014pprew",
                "sub_name": "Proceedings of the 3rd ACM SIGPLAN Program Protection and Reverse Engineering Workshop 2014, PPREW 2014, January 25, 2014, San Diego, CA, USA.",
                "count": 7,
                "papers": [
                    "Recovering C++ Objects From Binaries Using Inter-Procedural Data-Flow Analysis.",
                    "Formal Analysis of CRT-RSA Vigilant's Countermeasure Against the BellCoRe Attack: A Pledge for Formal Methods in the Field of Implementation Security.",
                    "DroidLegacy: Automated Familial Classification of Android Malware.",
                    "TDVMP: Improved Virtual Machine-Based Software Protection with Time Diversity.",
                    "Hardware-enforced Protection against Software Reverse-Engineering based on an Instruction Set Encoding.",
                    "Analyzing program dependencies for malware detection.",
                    "The GDSL toolkit: Generating Frontends for the Analysis of Machine Code."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "40th POPL 2013",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2013",
                "sub_name": "The 40th Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL '13, Rome, Italy - January 23 - 25, 2013.",
                "count": 47,
                "papers": [
                    "Engineering mathematics: the odd order theorem proof.",
                    "Full abstraction for nominal Scott domains.",
                    "The sequential semantics of producer effect systems.",
                    "Copatterns: programming infinite structures by observations.",
                    "Cache and I/O efficent functional algorithms.",
                    "On the linear ranking problem for integer linear-constraint loops.",
                    "Advanced automata minimization.",
                    "Automating relatively complete verification of higher-order functional programs.",
                    "Abstraction and invariance for algebraically indexed types.",
                    "Static and dynamic semantics of NoSQL languages.",
                    "Quantitative abstraction refinement.",
                    "Inductive data flow graphs.",
                    "Abstract conflict driven learning.",
                    "The Lambda Lambda-Bar calculus: a dual calculus for unconstrained strategies.",
                    "The geometry of types.",
                    "Universal properties of impure programming languages.",
                    "The power of parameterization in coinductive proof.",
                    "Meta-theory à la carte.",
                    "A theorem prover for Boolean BI.",
                    "From principles to programming languages (and back).",
                    "Library abstraction for C/C++ concurrency.",
                    "Fault tolerance via idempotence.",
                    "Deadlock-freedom-by-design: multiparty asynchronous global programming.",
                    "The type discipline of behavioral separation.",
                    "Views: compositional reasoning for concurrent programs.",
                    "High-level separation logic for low-level code.",
                    "How languages can save distributed computing.",
                    "Quantitative relaxation of concurrent data structures.",
                    "Plan B: a buffered memory model for Java.",
                    "Logical relations for fine-grained concurrency.",
                    "Linear dependent types for differential privacy.",
                    "Fully abstract compilation to JavaScript.",
                    "Towards fully automatic placement of security sanitizers and declassifiers.",
                    "The principles and practice of probabilistic programming.",
                    "A model-learner pattern for bayesian reasoning.",
                    "Hyperstream processing systems: nonstandard modeling of continuous-time signals.",
                    "HALO: haskell to logic through denotational semantics.",
                    "Sigma*: symbolic learning of input-output specifications.",
                    "Checking NFA equivalence with bisimulations up to congruence.",
                    "Synthesis of biological models from mutation experiments.",
                    "Sub-polyhedral scheduling using (unit-)two-variable-per-inequality polyhedra.",
                    "Optimizing data structures in high-level programs: new directions for extensible compilers based on staging.",
                    "Principled parsing for indentation-sensitive languages: revisiting landin's offside rule.",
                    "The ramifications of sharing in data structures.",
                    "Complete instantiation-based interpolation.",
                    "Automatic detection of floating-point exceptions.",
                    "Subjective auxiliary state for coarse-grained concurrency."
                ]
            },
            {
                "sub_name_abbr": "conf/popl/2013ddfp",
                "sub_name": "Proceedings of the 2013 Workshop on Data Driven Functional Programming, DDFP 2013, Rome, Italy, January 22, 2013.",
                "count": 5,
                "papers": [
                    "Themes in information-rich functional programming for internet-scale data sources.",
                    "Algebraic data types for language-integrated queries.",
                    "Incompleteness-aware programming with RDF data.",
                    "Streaming big data with self-adjusting computation.",
                    "Visualizing data on the web."
                ]
            },
            {
                "sub_name_abbr": "conf/popl/2013pprew",
                "sub_name": "Proceedings of the 2nd ACM SIGPLAN Program Protection and Reverse Engineering Workshop 2013, PPREW@POPL 2013, January 26, 2013, Rome, Italy.",
                "count": 5,
                "papers": [
                    "Software protection for dynamically-generated code.",
                    "String oriented programming: when ASLR is not enough.",
                    "Kernel mode API spectroscopy for incident response and digital forensics.",
                    "BinSlayer: accurate comparison of binary executables.",
                    "Fast location of similar code fragments using semantic 'juice'."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "39th POPL 2012",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2012",
                "sub_name": "Proceedings of the 39th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2012, Philadelphia, Pennsylvania, USA, January 22-28, 2012.",
                "count": 48,
                "papers": [
                    "Presentation of the SIGPLAN distinguished achievement award to Sir Charles Antony Richard Hoare, FRS, FREng, FBCS; and interview.",
                    "Message of thanks: on the receipt of the 2011 ACM SIGPLAN distinguished achievement award.",
                    "Freefinement.",
                    "Underspecified harnesses and interleaved bugs.",
                    "Towards a program logic for JavaScript.",
                    "Higher-order functional reactive programming in bounded space.",
                    "The marriage of bisimulations and Kripke logical relations.",
                    "Information effects.",
                    "A language for automatically enforcing privacy policies.",
                    "Probabilistic relational reasoning for differential privacy.",
                    "Access permission contracts for scripting languages.",
                    "Recursive proofs for inductive tree data-structures.",
                    "Symbolic finite state transducers: algorithms and applications.",
                    "Constraints as control.",
                    "Multiple facets for dynamic information flow.",
                    "Defining code-injection attacks.",
                    "Deciding choreography realizability.",
                    "Analysis of recursively parallel programs.",
                    "Programming languages for programmable networks.",
                    "A compiler and run-time system for network programming languages.",
                    "Nested refinements: a logic for duck typing.",
                    "An abstract interpretation framework for termination.",
                    "Playing in the grey area of proofs.",
                    "Static and user-extensible proof checking.",
                    "Run your research: on the effectiveness of lightweight mechanization.",
                    "Verification of parameterized concurrent programs by modular reasoning about data and control.",
                    "Resource-sensitive synchronization inference by abduction.",
                    "Syntactic control of interference for separation logic.",
                    "Canonicity for 2-dimensional type theory.",
                    "Algebraic foundations for effect-dependent optimisations.",
                    "On the power of coercion abstraction.",
                    "Abstractions from tests.",
                    "Sound predictive race detection in polynomial time.",
                    "Towards nominal computation.",
                    "Programming with binders and indexed data-types.",
                    "Meta-level features in an industrial-strength theorem prover.",
                    "Formalizing the LLVM intermediate representation for verified program transformations.",
                    "Randomized accuracy-aware program transformations for efficient approximate computations.",
                    "A rely-guarantee-based simulation for verifying concurrent program transformations.",
                    "A unified approach to fully lazy sharing.",
                    "The ins and outs of gradual type inference.",
                    "Edit lenses.",
                    "Clarifying and compiling C/C++ concurrency: from C++11 to POWER.",
                    "A mechanized semantics for C++ object construction and destruction, with applications to resource management.",
                    "An executable formal semantics of C with applications.",
                    "A type theory for probability density functions.",
                    "A type system for borrowing permissions.",
                    "Self-certification: bootstrapping certified typecheckers in F* with Coq."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "38th POPL 2011",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2011",
                "sub_name": "Proceedings of the 38th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2011, Austin, TX, USA, January 26-28, 2011.",
                "count": 52,
                "papers": [
                    "Verified squared: does critical software deserve verified tools?",
                    "Points-to analysis with efficient strong updates.",
                    "Pick your contexts well: understanding object-sensitivity.",
                    "Learning minimal abstractions.",
                    "Relaxed-memory concurrency and verified compilation.",
                    "Mathematizing C++ concurrency.",
                    "Formal verification of object layout for c++ multiple inheritance.",
                    "Static analysis of multi-staged programs via unstaging translation.",
                    "Static analysis of interrupt-driven programs synchronized via the priority ceiling protocol.",
                    "A parametric segmentation functor for fully automatic and scalable array content analysis.",
                    "Step-indexed kripke models over recursive worlds.",
                    "A kripke logical relation between ML and assembly.",
                    "A typed store-passing translation for general references.",
                    "A shape analysis for optimizing parallel graph programs.",
                    "Calling context abstraction with shapes.",
                    "Precise reasoning for programs using containers.",
                    "Blame for all.",
                    "Correct blame for contracts: no more scapegoating.",
                    "Generative type abstraction and type-level computation.",
                    "The design of kodu: a tiny visual programming language for children on the Xbox 360.",
                    "A separation logic for refining concurrent objects.",
                    "Modular reasoning for deterministic parallelism.",
                    "Expressive modular fine-grained concurrency specification.",
                    "The tree width of auxiliary storage.",
                    "Fresh-register automata.",
                    "Vector addition system reachability problem: a short self-contained proof.",
                    "Automating string processing in spreadsheets using input-output examples.",
                    "Predicate abstraction and refinement for verifying multi-threaded programs.",
                    "Geometry of synthesis III: resource management through type inference.",
                    "Multivariate amortized resource analysis.",
                    "Symmetric lenses.",
                    "Regular expression containment: coinductive axiomatization and computational interpretation.",
                    "Making prophecies with decision predicates.",
                    "Delay-bounded scheduling.",
                    "On interference abstractions.",
                    "Dynamic multirole session types.",
                    "Practical affine types.",
                    "Dynamic inference of static types for ruby.",
                    "Robin Milner 1934--2010: verification, languages, and concurrency.",
                    "Space overhead bounds for dynamic memory management with partial compaction.",
                    "Laws of order: expensive synchronization in concurrent algorithms cannot be eliminated.",
                    "Complexity of pattern-based verification for multithreaded programs.",
                    "EigenCFA: accelerating flow analysis with GPUs.",
                    "Bisimulation for quantum processes.",
                    "Safe nondeterminism in a deterministic-by-default parallel language.",
                    "Loop transformations: convexity, pruning and optimization.",
                    "The essence of compiling with traces.",
                    "Resourceable, retargetable, modular instruction selection using a machine-independent, type-based tiling of low-level intermediate code.",
                    "Verifying higher-order functional programs with pattern-matching algebraic data types.",
                    "Streaming transducers for algorithmic verification of single-pass list-processing programs.",
                    "Decidable logics combining heap structures and data.",
                    "A technique for the effective and automatic reuse of classical compiler optimizations on multithreaded code."
                ]
            },
            {
                "sub_name_abbr": "conf/tldi/2011",
                "sub_name": "Proceedings of TLDI 2011: 2011 ACM SIGPLAN International Workshop on Types in Languages Design and Implementation, Austin, TX, USA, January 25, 2011.",
                "count": 8,
                "papers": [
                    "Type design patterns for computer mathematics.",
                    "Singleton: a general-purpose dependently-typed assembly language.",
                    "A type and effect system for deadlock avoidance in low-level languages.",
                    "Extended alias type system using separating implication.",
                    "Type safety from the ground up.",
                    "AuraConf: a unified approach to authorization and confidentiality.",
                    "Information flow enforcement in monadic libraries.",
                    "The essence of monotonic state."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "37th POPL 2010",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2010",
                "sub_name": "Proceedings of the 37th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2010, Madrid, Spain, January 17-23, 2010.",
                "count": 41,
                "papers": [
                    "Reconfigurable asynchronous logic automata: (RALA).",
                    "On the verification problem for weak memory models.",
                    "Coarse-grained transactions.",
                    "Sequential verification of serializability.",
                    "Compositional may-must program analysis: unleashing the power of alternation.",
                    "Continuity analysis of programs.",
                    "Program analysis via satisfiability modulo path programs.",
                    "A simple, verified validator for software pipelining.",
                    "A verified compiler for an impure functional language.",
                    "Verified just-in-time compiler on x86.",
                    "Dependent types from counterexamples.",
                    "Low-level liquid types.",
                    "Type inference for datalog with complex type hierarchies.",
                    "From Boolean to quantitative notions of correctness.",
                    "Nominal system T.",
                    "A theory of indirection via approximation.",
                    "A relational modal logic for higher-order stateful ADTs.",
                    "Decision procedures for algebraic data types with abstractions.",
                    "Automatic numeric abstractions for heap-manipulating programs.",
                    "Static determination of quantitative resource usage for higher-order programs.",
                    "Toward a verified relational database management system.",
                    "Counterexample-guided focus.",
                    "Structuring the verification of heap-manipulating programs.",
                    "Dependent types and program equivalence.",
                    "Pure subtype systems.",
                    "Modular session types for distributed object-oriented programming.",
                    "From program verification to program synthesis.",
                    "Abstraction-guided synthesis of synchronization.",
                    "Programming with angelic nondeterminism.",
                    "Contracts made manifest.",
                    "Threesomes, with and without blame.",
                    "Integrating typed and untyped code in a scripting language.",
                    "Generating compiler optimizations from proofs.",
                    "Automatically generating instruction selectors using declarative machine descriptions.",
                    "Semantics and algorithms for data-dependent grammars.",
                    "Paralocks: role-based information flow control and beyond.",
                    "Modular verification of security protocol code by typing.",
                    "Dynamically checking ownership policies in concurrent c/c++ programs.",
                    "Nested interpolants.",
                    "Monads in action.",
                    "Higher-order multi-parameter tree transducers and recursion schemes for program verification."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "36th POPL 2009",
        "info": "Savannah, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2009",
                "sub_name": "Proceedings of the 36th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2009, Savannah, GA, USA, January 21-23, 2009.",
                "count": 39,
                "papers": [
                    "Language constructs for transactional memory.",
                    "A calculus of atomic actions.",
                    "Proving that non-blocking algorithms don't block.",
                    "A model of cooperative threads.",
                    "Static contract checking for Haskell.",
                    "Masked types for sound object initialization.",
                    "Flexible types: robust type inference for first-class polymorphism.",
                    "Modular code generation from synchronous block diagrams: modularity vs. code size.",
                    "Formal certification of code-based cryptographic proofs.",
                    "Verifying liveness for asynchronous programs.",
                    "A foundation for flow-based program matching: using temporal logic and model checking.",
                    "SPEED: precise and efficient static estimation of program computational complexity.",
                    "Automatic modular abstractions for linear constraints.",
                    "Wild control operators.",
                    "Lazy evaluation and delimited control.",
                    "Bidirectionalization for free! (Pearl).",
                    "The third homomorphism theorem on trees: downward & upward lead to divide-and-conquer.",
                    "A cost semantics for self-adjusting computation.",
                    "Copy-on-write in the PHP language.",
                    "Feedback-directed barrier optimization in a strongly isolated STM.",
                    "Semi-sparse flow-sensitive pointer analysis.",
                    "A combination framework for tracking partition sizes.",
                    "The theory of deadlock avoidance via discrete control.",
                    "Equality saturation: a new approach to optimization.",
                    "Positive supercompilation for a higher order call-by-value language.",
                    "Compositional shape analysis by means of bi-abduction.",
                    "Linear types for computational effects.",
                    "Unifying type checking and property checking for low-level code.",
                    "Local rely-guarantee reasoning.",
                    "Classical BI: a logic for reasoning about dualising resources.",
                    "State-dependent representation independence.",
                    "Modeling abstract types in modules with open existential types.",
                    "Focusing on pattern matching.",
                    "The semantics of x86-CC multiprocessor machine code.",
                    "Relaxed memory models: an operational approach.",
                    "The semantics of progress in lock-based transactional memory.",
                    "Types and higher-order recursion schemes for verification of higher-order programs.",
                    "Verifying distributed systems: the operational approach.",
                    "Automated verification of practical garbage collectors."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "35th POPL 2008",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2008",
                "sub_name": "Proceedings of the 35th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2008, San Francisco, California, USA, January 7-12, 2008.",
                "count": 38,
                "papers": [
                    "Engineering formal metatheory.",
                    "Formal verification of translation validators: a case study on instruction scheduling optimizations.",
                    "Much ado about two (pearl): a pearl on parallel prefix computation.",
                    "Contextual effects for version-consistent dynamic software updatingalland safe concurrent programming.",
                    "High-level small-step operational semantics for transactions.",
                    "Semantics of transactional memory and automatic mutual exclusion.",
                    "Separation logic, abstraction and inheritance.",
                    "Enhancing modular OO verification with separation logic.",
                    "Cyclic proofs of program termination in separation logic.",
                    "The intensional content of Rice's theorem.",
                    "A logical account of pspace.",
                    "Lightweight semiformal time complexity analysis for purely functional data structures.",
                    "Proving non-termination.",
                    "Subcubic algorithms for recursive state machines.",
                    "Back to the future: revisiting precise program verification using SMT solvers.",
                    "Automatic inference of stationary fields: a generalization of java's final fields.",
                    "Demand-driven alias analysis for C.",
                    "A theory of platform-dependent low-level software.",
                    "Generating precise and concise procedure summaries.",
                    "Lifting abstract interpreters to quantified logical domains.",
                    "Relational inductive shape analysis.",
                    "A theory of contracts for web services.",
                    "Multiparty asynchronous session types.",
                    "Clowns to the left of me, jokers to the right (pearl): dissecting data structures.",
                    "Foundations for structured programming with GADTs.",
                    "Imperative self-adjusting computation.",
                    "Cryptographically sound implementations for typed information-flow security.",
                    "On the computational soundness of cryptographically masked flows.",
                    "Extensible encoding of type hierarchies.",
                    "Focusing and higher-order abstract syntax.",
                    "A type-theoretic foundation for programming with higher-order abstract syntax and first-class substitutions.",
                    "An approach to call-by-name delimited continuations.",
                    "The design and implementation of typed scheme.",
                    "Boomerang: resourceful lenses for string data.",
                    "From dirt to shovels: fully automatic tool generation from ad hoc data.",
                    "Systems biology, models, and concurrency.",
                    "Relevance heuristics for program analysis.",
                    "Caml trading."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "34th POPL 2007",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2007",
                "sub_name": "Proceedings of the 34th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2007, Nice, France, January 17-19, 2007.",
                "count": 39,
                "papers": [
                    "Perl 6: reconciling the irreconcilable.",
                    "Operational semantics for multi-language programs.",
                    "Semantics of static pointcuts in aspectJ.",
                    "A typed intermediate language for compiling multiple inheritance.",
                    "Cork: dynamic memory leak detection for garbage-collected languages.",
                    "Dynamic heap type inference for program understanding and debugging.",
                    "Compositional dynamic test generation.",
                    "Locality approximation using time.",
                    "Modular type classes.",
                    "First-class nonstandard interpretations by opening closures.",
                    "PADS/ML: a functional data description language.",
                    "Generative unbinding of names.",
                    "Types, bytes, and separation logic.",
                    "A very modal model of a modern, major, general type system.",
                    "Context logic as modal logic: completeness and parametric inexpressivity.",
                    "From implementation to theory in product synthesis.",
                    "Scrap your boilerplate with XPath-like combinators.",
                    "Lightweight fusion by fixed point promotion.",
                    "Lazy multivariate higher-order forward-mode AD.",
                    "A complete, co-inductive syntactic theory of sequential control and state.",
                    "Towards a mechanized metatheory of standard ML.",
                    "Logic-flow analysis of higher-order programs.",
                    "Extracting queries by static analysis of transparent persistence.",
                    "Variance analyses from invariance analyses.",
                    "Assessing security threats of looping constructs.",
                    "JavaScript instrumentation for browser security.",
                    "Secure implementations of typed channel abstractions.",
                    "Advanced programming language design in enterprise software: a lambda-calculus theorist wanders into a datacenter.",
                    "Proving that programs eventually do something good.",
                    "Program verification as probabilistic inference.",
                    "Lock allocation.",
                    "Modular verification of a non-blocking stack.",
                    "On the analysis of interacting pushdown systems.",
                    "Specialization of CML message-passing primitives.",
                    "Conditional must not aliasing for static race detection.",
                    "Interprocedural analysis of asynchronous programs.",
                    "Preferential path profiling: compactly numbering interesting paths.",
                    "Geometry of synthesis: a structured approach to VLSI design.",
                    "A semantics-based approach to malware detection."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "33rd POPL 2006",
        "info": "Charleston, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2006",
                "sub_name": "Proceedings of the 33rd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2006, Charleston, South Carolina, USA, January 11-13, 2006.",
                "count": 36,
                "papers": [
                    "Why dependent types matter.",
                    "The next 700 data description languages.",
                    "A hierarchical model of data locality.",
                    "Simplifying reductions.",
                    "Formal certification of a compiler back-end or: programming a compiler with a proof assistant.",
                    "Engineering with logic: HOL specification and symbolic-evaluation testing for TCP implementations.",
                    "Decidability and proof systems for language-based noninterference relations.",
                    "On flow-sensitive security types.",
                    "A logic for information flow in object-oriented programs.",
                    "Polymorphic regular tree types and patterns.",
                    "Verifying properties of well-founded linked lists.",
                    "Environment analysis via Delta CFA.",
                    "Small bisimulations for reasoning about higher-order imperative programs.",
                    "A fixpoint calculus for local and global program flows.",
                    "The Scala experiment: can we provide better language support for component systems?",
                    "Adventures in time and space.",
                    "N-synchronous Kahn networks: a relaxed model of synchrony for real-time systems.",
                    "Compiler-directed channel allocation for saving power in on-chip networks.",
                    "Fast and loose reasoning is morally correct.",
                    "Modular set-based analysis from contracts.",
                    "Stratified type inference for generalized algebraic data types.",
                    "Hybrid type checking.",
                    "A polymorphic modal type system for lisp-like multi-staged languages.",
                    "The next mainstream programming language: a game developer's perspective.",
                    "A virtual class calculus.",
                    "Interruptible iterators.",
                    "Specifying C++ concepts.",
                    "Frame rules from answer types for code pointers.",
                    "Certified assembly programming with embedded code pointers.",
                    "Associating synchronization constraints with data in an object-oriented language.",
                    "Autolocker: synchronization inference for atomic sections.",
                    "Protecting representation with effect encapsulation.",
                    "The essence of command injection attacks in web applications.",
                    "Harmless advice.",
                    "A verifiable SSA program representation for aggressive compiler optimization.",
                    "Staged allocation: a compositional technique for specifying and implementing procedure calling conventions."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "32nd POPL 2005",
        "info": "Long Beach, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2005",
                "sub_name": "Proceedings of the 32nd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2005, Long Beach, California, USA, January 12-14, 2005.",
                "count": 31,
                "papers": [
                    "Associated types with class.",
                    "Environmental acquisition revisited.",
                    "Polymorphic bytecode: compositional compilation for Java-like languages.",
                    "A simple typed intermediate language for object-oriented languages.",
                    "Parametric polymorphism for XML.",
                    "A bisimulation for type abstraction and recursion.",
                    "A syntactic approach to eta equality in type theory.",
                    "Slot games: a quantitative model of computation.",
                    "Synthesis of interface specifications for Java classes.",
                    "Dynamic partial-order reduction for model checking software.",
                    "Proof-guided underapproximation-widening for multi-process systems.",
                    "Transition predicate abstraction and fair termination.",
                    "Communicating quantum processes.",
                    "Downgrading policies and relaxed noninterference.",
                    "A probabilistic language based upon sampling functions.",
                    "Mutatis mutandis: safe and predictable dynamic software updating.",
                    "Transactors: a programming model for maintaining globally consistent distributed state in unreliable environments.",
                    "Theoretical foundations for compensations in flow composition languages.",
                    "From sequential programs to multi-tier applications by program transformation.",
                    "Combinators for bi-directional tree transformations: a linguistic approach to the view update problem.",
                    "Separation logic and abstraction.",
                    "Permission accounting in separation logic.",
                    "Context logic and tree update.",
                    "Connecting effects and uniqueness with adoption.",
                    "A semantics for procedure local heaps and its abstractions.",
                    "Region-based shape analysis with tracked locations.",
                    "Precise interprocedural analysis using random interpretation.",
                    "A framework for numeric analysis of array operations.",
                    "Scalable error detection using boolean satisfiability.",
                    "Automated soundness proofs for dataflow analyses and transformations via local rules.",
                    "The Java memory model."
                ]
            },
            {
                "sub_name_abbr": "conf/popl/2005wits",
                "sub_name": "Proceedings of the POPL 2005 Workshop on Issues in the Theory of Security, WITS 2005, Long Beach, California, USA, January 10-11, 2005.",
                "count": 9,
                "papers": [
                    "Handling declared information leakage: extended abstract.",
                    "Policy framings for access control.",
                    "Specifying Kerberos 5 cross-realm authentication.",
                    "Using static analysis to validate the SAML single sign-on protocol.",
                    "Inferring authentication tags.",
                    "Statically checking confidentiality via dynamic labels.",
                    "Enterprise privacy promises and enforcement.",
                    "Formal prototyping in early stages of protocol design.",
                    "A variant of the Chaum voter-verifiable scheme."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "31st POPL 2004",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2004",
                "sub_name": "Proceedings of the 31st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, POPL 2004, Venice, Italy, January 14-16, 2004.",
                "count": 29,
                "papers": [
                    "Symbolic transfer function-based approaches to certified compilation.",
                    "Simple relational correctness proofs for static analyses and program transformations.",
                    "Incremental execution of transformation specifications.",
                    "Formalization of generics for the .NET common language runtime.",
                    "Semantic types: a fresh look at the ideal model for types.",
                    "Extensional normalisation and type-directed partial evaluation for typed lambda calculus with sums.",
                    "Isomorphisms of generic recursive polynomial types.",
                    "Polymorphic typed defunctionalization.",
                    "Free theorems in the presence of seq.",
                    "Parsing expression grammars: a recognition-based syntactic foundation.",
                    "Asynchronous and deterministic objects.",
                    "A logic you can count on.",
                    "Channel dependent types for higher-order mobile processes.",
                    "A bisimulation for dynamic sealing.",
                    "An abstract interpretation-based framework for software watermarking.",
                    "Abstract non-interference: parameterizing non-interference by abstract interpretation.",
                    "A semantics for web services authentication.",
                    "The space cost of lazy reference counting.",
                    "Local reasoning about a copying garbage collector.",
                    "Abstractions from proofs.",
                    "Summarizing procedures in concurrent programs.",
                    "Atomizer: a dynamic atomicity checker for multithreaded programs.",
                    "Separation and information hiding.",
                    "Tridirectional typechecking.",
                    "A type system for well-founded recursion.",
                    "Principal typings for Java-like languages.",
                    "Non-linear loop invariant generation using Gröbner bases.",
                    "Precise interprocedural analysis through linear algebra.",
                    "Global value numbering using random interpretation."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "30th POPL 2003",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2003",
                "sub_name": "Conference Record of POPL 2003: The 30th SIGPLAN-SIGACT Symposium on Principles of Programming Languages, New Orleans, Louisisana, USA, January 15-17, 2003.",
                "count": 25,
                "papers": [
                    "The essence of XML.",
                    "Selective memoization.",
                    "Environment classifiers.",
                    "Bigraphs and transitions.",
                    "The m-calculus: a higher-order distributed process calculus.",
                    "A generic approach to the static analysis of concurrent programs with procedures.",
                    "Discovering affine equalities using random interpretation.",
                    "Bitwidth aware global register allocation.",
                    "From symptom to cause: localizing errors in counterexample traces.",
                    "Folklore confirmed: reducible flow graphs are exponentially larger.",
                    "New results on the computability and complexity of points - to analysis.",
                    "Incremental algorithms for dispatching in dynamically typed languages.",
                    "From control effects to typed continuation passing.",
                    "Coercive subtyping for the calculus of constructions.",
                    "Efficient algorithms for isomorphisms of simple types.",
                    "A type theory for memory allocation and data layout.",
                    "Static prediction of heap space usage for first-order functional programs.",
                    "Toward a foundational typed assembly language.",
                    "Ownership types for object encapsulation.",
                    "Guarded recursive datatype constructors.",
                    "A type system for higher-order modules.",
                    "Pure patterns type systems.",
                    "Destructors, finalizers, and synchronization.",
                    "Interprocedural compatibility analysis for static object preallocation.",
                    "A real-time garbage collector with low overhead and consistent utilization."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "29th POPL 2002",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2002",
                "sub_name": "Conference Record of POPL 2002: The 29th SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Portland, OR, USA, January 16-18, 2002.",
                "count": 30,
                "papers": [
                    "The SLAM project: debugging system software via static analysis.",
                    "Mining specifications.",
                    "Role analysis.",
                    "Analyzing security protocols with secrecy types and logic programs.",
                    "Types as models: model checking message-passing programs.",
                    "Lazy abstraction.",
                    "Bisimulation congruences in safe ambients.",
                    "A uniform type structure for secure information flow.",
                    "Bounding space usage of conservative garbage collectors.",
                    "The hardness of cache conscious data placement.",
                    "Towards automatic construction of staged compilers.",
                    "From POPL to the classroom and back.",
                    "CCured: type-safe retrofitting of legacy code.",
                    "An efficient profile-analysis framework for data-layout optimizations.",
                    "Stochastic lambda calculus and monads of probability distributions.",
                    "Representation independence, confinement and access control [extended abstract].",
                    "Systematic design of program transformation frameworks by abstract interpretation.",
                    "Predicate abstraction for software verification.",
                    "The first-order theory of subtyping constraints.",
                    "A type system for certified binaries.",
                    "Functional logic overloading.",
                    "Scalable formal design methods for asynchronous VLSI.",
                    "Adaptive functional programming.",
                    "The strength of non-size increasing computation.",
                    "Composing dataflow analyses and transformations.",
                    "Proving correctness of compiler optimizations by temporal logic.",
                    "Exploiting prolific types for memory management and optimizations.",
                    "Stack inspection: theory and variants.",
                    "Information flow inference for ML.",
                    "Resource usage analysis."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "28th POPL 2001",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2001",
                "sub_name": "Conference Record of POPL 2001: The 28th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, London, UK, January 17-19, 2001.",
                "count": 26,
                "papers": [
                    "Programming language methods in computer security.",
                    "Extensionality and Intensionality of the Ambient Logics.",
                    "BI as an Assertion Language for Mutable Data Structures.",
                    "Verifying safety properties of concurrent Java programs using 3-valued logic.",
                    "Colored local type inference.",
                    "Type-base flow analysis: from polymorphic subtyping to CFL-reachability.",
                    "Regular expression pattern matching for XML.",
                    "The size-change principle for program termination.",
                    "An abstract Monte-Carlo method for the analysis of probabilistic programs.",
                    "Efficient deductive methods for program analysis.",
                    "Mobile values, new names, and secure communication.",
                    "Nomadic pict: correct communication infrastructure for mobile computation.",
                    "A generic type system for the Pi-calculus.",
                    "Oracle-based checking of untrusted software.",
                    "Stratified operational semantics for safety and correctness of the region calculus.",
                    "Type-preserving garbage collectors.",
                    "A compiler technique for improving whole-program locality.",
                    "Avoiding exponential explosion: generating compact verification conditions.",
                    "What packets may come: automata for network monitoring.",
                    "Computational flux.",
                    "Secure safe ambients.",
                    "Modules, abstract types, and distributed versioning.",
                    "Typing a multi-language intermediate code.",
                    "Type-indexed rows.",
                    "Subtyping arithmetical types.",
                    "Combining subsumption and binary methods: an object calculus with views."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "27th POPL 2000",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/2000",
                "sub_name": "POPL 2000, Proceedings of the 27th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Boston, Massachusetts, USA, January 19-21, 2000.",
                "count": 31,
                "papers": [
                    "Efficient Algorithms for pre* and post* on Interprocedural Parallel Flow Graphs.",
                    "Temporal Abstract Interpretation.",
                    "A Framework for Combining Analysis and Verification.",
                    "Transforming Out Timing Leaks.",
                    "Enforcing Trace Properties by Program Transformation.",
                    "On the Complexity of Flow-Sensitive Dataflow Analyses.",
                    "Projection Merging: Reducing Redundancies in Inclusion Constraint Graphs.",
                    "(Optimal) Duplication is not Elementary Recursive.",
                    "Implicit Parameters: Dynamic Scoping with Static Types.",
                    "A New Approach to Generic Functional Programming.",
                    "First-Class Macros have Types.",
                    "Shape Analysis for Mobile Ambients.",
                    "Semantics-Preserving Procedure Extraction.",
                    "Sparse Code Motion.",
                    "Resource Bound Certification.",
                    "Type Systems for Distributed Data Structures.",
                    "Deciding Type Equivalence with Singleton Kinds.",
                    "Type Elaboration and Subtype Completion for Java Bytecode.",
                    "A Semantic Model of Types and Machine Instuctions for Proof-Carrying Code.",
                    "A Type System for Expressive Security Policies.",
                    "Verifying Secrets and Relative Secrecy.",
                    "A Debate on Language and Tool Support for Design Patterns.",
                    "A Type System for Dynamic Web Documents.",
                    "Authentication Primitives and Their Compilation.",
                    "Generalized Certificate Revocation.",
                    "Paths vs. Trees in Set-Based Program Analysis.",
                    "Analytic Constraint Solving and Interval Arithmetic.",
                    "Controlling Interference in Ambients.",
                    "Anytime, Anywhere: Modal Logics for Mobile Ambients.",
                    "Reducing Sweep Time for a Nearly Empty Heap.",
                    "Modular Refinement of Hierarchic Reactive Machines."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "26th POPL 1999",
        "info": "San Antonio, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1999",
                "sub_name": "POPL '99, Proceedings of the 26th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, San Antonio, TX, USA, January 20-22, 1999.",
                "count": 25,
                "papers": [
                    "AnnoDomini: From Type Theory to Year 2000 Conversion Tool.",
                    "Once Upon a Polymorphic Type.",
                    "Quasi-Linear Types.",
                    "Improvement in a Lazy Context: An Operational Theory for Call-by-Need.",
                    "A Compositional Account of the Java Virtual Machine.",
                    "A Simple, Comprehensive Type System for Java Bytecode Subroutines.",
                    "Types for Mobile Ambients.",
                    "Trust and Partial Typing in Open Systems of Mobile Agents.",
                    "Parametric Shape Analysis via 3-Valued Logic.",
                    "Aggregate Structure Identification and Its Application to Program Analysis.",
                    "Relevant Context Inference.",
                    "A Core Calculus of Dependency.",
                    "Principality and Decidable Type Inference for Finite-Rank Intersection Types.",
                    "Representing Layered Monads.",
                    "Stochastic Processes as Concurrent Constraint Programs.",
                    "Extending the Scope of Syntactic Abstraction.",
                    "Dependent Types in Practical Programming.",
                    "JFlow: Practical Mostly-Static Information Flow Control.",
                    "Optimal Code Selection in DAGs.",
                    "Type-Safe Linking and Modular Assembly Language.",
                    "Typed Memory Management in a Calculus of Capabilities.",
                    "Type-Based Analysis of Uncaught Exceptions.",
                    "Constraint Systems for Useless Variable Elimination.",
                    "Continuous Grammars.",
                    "Software Watermarking: Models and Dynamic Embeddings."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "25th POPL 1998",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1998",
                "sub_name": "POPL '98, Proceedings of the 25th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, San Diego, CA, USA, January 19-21, 1998.",
                "count": 32,
                "papers": [
                    "Higher-Order unCurrying.",
                    "Alias Analysis of Executable Code.",
                    "Escape Analysis: Correctness Proof, Implementation and Experimental Results.",
                    "Data Flow Analysis is Model Checking of Abstract Interpretations.",
                    "Bridging the Gulf: A Common Intermediate Language for ML and Haskell.",
                    "Correctness of Monadic State: An Imperative Call-by-Need Calculus.",
                    "A Functional Representation of Data Structures with a Hole.",
                    "From System F to Typed Assembly Language.",
                    "Maximal Static Expansion.",
                    "Array SSA Form and Its Use in Parallelization.",
                    "Putting Pointer Analysis to Work.",
                    "Edge Profiling versus Path Profiling: The Showdown.",
                    "A Type System for Java Bytecode Subroutines.",
                    "Javalight is Type-Safe - Definitely.",
                    "Classes and Mixins.",
                    "Manufacturing Cheap, Resilient, and Stealthy Opaque Constructs.",
                    "From Polyvariant Flow Information to Intersection and Union Types.",
                    "Inference of Polymorphic and Conditional Strictness Properties.",
                    "Fast Interprocedural Class Analysis.",
                    "Path-Sensitive Value-Flow Analysis.",
                    "Local Type Inference.",
                    "Static Typing for Dynamic Messages.",
                    "Second-Order Unification and Type Inference for Church-Style Polymorphism.",
                    "Dynamic Typing as Staged Type Inference.",
                    "Parallel Beta Reduction is not Elementary Recursive.",
                    "Parallelization in Calculational Forms.",
                    "Single and Loving It: Must-Alias Analysis for Higher-Order Languages.",
                    "Barrier Inference.",
                    "Secure Information Flow in a Multi-Threaded Imperative Language.",
                    "The SLam Calculus: Programming with Secrecy and Integrity.",
                    "A Typed Language for Distributed Mobile Processes (Extended Abstract).",
                    "Security Properties of Typed Applets."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "24th POPL 1997",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1997",
                "sub_name": "Conference Record of POPL'97: The 24th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Papers Presented at the Symposium, Paris, France, 15-17 January 1997.",
                "count": 37,
                "papers": [
                    "Fast and Accurate Flow-Insensitive Points-To Analysis.",
                    "Partitioning Dataflow Analyses Using Types.",
                    "Shape Types.",
                    "Objective ML: A Simple Object-Oriented Extension of ML.",
                    "Rolling Your Own MADT - A Connection Between Linear Types and Monads.",
                    "Search and Imperative Programming.",
                    "A Unified Computation Model for Functional and Logic Programming.",
                    "Call by Need Computations to Root-Stable Form.",
                    "Proof-Carrying Code.",
                    "Is \"Just in Time\" = \"Better Late than Never\"?",
                    "Parameterized Types for Java.",
                    "Pizza into Java: Translating Theory into Practice.",
                    "Determining the Idle Time of a Tiling.",
                    "Model Checking for Programming Languages using Verisoft.",
                    "Synchronization Transformations for Parallel Computing.",
                    "Maximizing Parallelism and Minimizing Synchronization with Affine Transforms.",
                    "A Curry-Howard Foundation for Functional Computation with Control.",
                    "The Pi-calculus in Direct Style.",
                    "Behavioral Equivalence in the Polymorphic Pi-calculus.",
                    "Comparing the Expressive Power of the Synchronous and the Asynchronous pi-calculus.",
                    "Program Fragments, Linking, and Modularization.",
                    "Minimal Typings in Atomic Subtyping.",
                    "Typing Algorithm in Type Theory with Inheritance.",
                    "Type-Checking Higher-Order Polymorphic Multi-Methods.",
                    "Types as Abstract Interpretations.",
                    "Infinitary Control Flow Analysis: a Collecting Semantics for Closure Analysis.",
                    "Automatic Verification of Parameterized Linear Networks of Processes.",
                    "On the Complexity of Escape Analysis.",
                    "A Demand-Driven Set-Based Analysis.",
                    "Denotational Semantics Using an Operationally-Based Term Model.",
                    "Constraints to Stop Higher-Order Deforestation.",
                    "Reducing Nondeterminism while Specializing Logic Programs.",
                    "From SOS Rules to Proof Principles: An Operational Metatheory for Functional Languages.",
                    "Relational Parametricity and Units of Measure.",
                    "High Level Reading and Data Structure Compilation.",
                    "Polyp - A Polytypic Programming Language.",
                    "First-class Polymorphism with Type Inference."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "23rd POPL 1996",
        "info": "St. Petersburg Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1996",
                "sub_name": "Conference Record of POPL'96: The 23rd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Papers Presented at the Symposium, St. Petersburg Beach, Florida, USA, January 21-24, 1996.",
                "count": 34,
                "papers": [
                    "Is it a Tree, a DAG, or a Cyclic Graph? A Shape Analysis for Heap-Directed Pointers in C.",
                    "Solving Shape-Analysis Problems in Languages with Destructive Updating.",
                    "Points-to Analysis in Almost Linear Time.",
                    "What Are Principal Typings and What Are They Good For?",
                    "Putting Type Annotations to Work.",
                    "Using Parameterized Signatures to Express Modular Structure.",
                    "Faster Checking of Software Specifications by Eliminating Isomorphs.",
                    "Optimization and Relaxation in Constraint Logic Languages.",
                    "Pure versus Impure LISP.",
                    "On the Complexity of Beta-Reduction.",
                    "Filter Fusion.",
                    "C: A Language for High-Level, Efficient, and Machine-Independent Dynamic Code Generation.",
                    "A General Approach for Run-Time Specialization and its Application to C.",
                    "Discovering Auxiliary Information for Incremental Computation.",
                    "From Region Inference to von Neumann Machines via Region Representation Inference.",
                    "A Practical and Flexible Flow Analysis for Higher-Order Languages.",
                    "Trace-Based Program Analysis.",
                    "Iterated Register Coalescing.",
                    "Generating Machine Specific Optimizing Compilers.",
                    "Minimum Cost Interprocedural Register Allocation.",
                    "Type-Directed Partial Evaluation.",
                    "A Modal Analysis of Staged Computation.",
                    "Typed Closure Conversion.",
                    "Revisiting Catamorphisms over Datatypes with Embedded Functions (or, Programs from Outer Space).",
                    "Concurrent Haskell.",
                    "A Provably Time-Efficient Parallel Implementation of Full Speculation.",
                    "Static Analysis to Reduce Synchronization Costs in Data-Parallel Programs.",
                    "Functional Computation as Concurrent Computation.",
                    "Composing Processes.",
                    "Linearity and the Pi-Calculus.",
                    "The Reflexive CHAM and the Join-Calculus.",
                    "Bisimilarity for a First-Order Calculus of Objects with Subtyping.",
                    "An Interpretation of Objects and Object Types.",
                    "Proving the Correctness of Reactive Systems Using Sized Types."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "22nd POPL 1995",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1995",
                "sub_name": "Conference Record of POPL'95: 22nd ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, San Francisco, California, USA, January 23-25, 1995.",
                "count": 35,
                "papers": [
                    "Isolating Side Effects in Sequential Languages.",
                    "Sequential Algorithms, Deterministic Parallelism, and Intensional Expressiveness.",
                    "Using Functor Categories to Generate Intermediate Code.",
                    "Demand-driven Computation of Interprocedural Data Flow.",
                    "Precise Interprocedural Dataflow Analysis via Graph Reachability.",
                    "A Linear Time Algorithm for Placing phi-nodes.",
                    "An Extended Form of Must Alias Analysis for Dynamic Allocation.",
                    "Reasoning about Rings.",
                    "Verifying Infinite State Processes with Sequential and Parallel Composition.",
                    "Structured Operational Semantics as a Specification Language.",
                    "Generic Polymorphism.",
                    "Compiling Polymorphism Using Intensional Type Analysis.",
                    "Applicative Functors and Fully Transparent Higher-Order Modules.",
                    "Higher-Order Functors with Transparent Signatures.",
                    "Structural Decidable Extensions of Bounded Quantification.",
                    "Lower Bounds on Type Inference with Subtypes.",
                    "Positive Subtyping.",
                    "The Geometry of Interaction Machine.",
                    "The Semantics of Future and Its Use in Program Optimizations.",
                    "Total Correctness by Local Improvement in Program Transformation.",
                    "The Call-by-Need Lambda Calculus.",
                    "Unification Factoring for Efficient Execution of Logic Programs.",
                    "Separation Constraint Partitioning - A New Algorithm for Partitioning Non-strict Programs into Sequential Threads.",
                    "Default Timed Concurrent Constraint Programming.",
                    "A Language with Distributed Scope.",
                    "A Formal Model of Procedure Calling Conventions.",
                    "Obtaining Sequential Efficiency for Concurrent Object-Oriented Languages.",
                    "Optimizing an ANSI C Interpreter with Superoperators.",
                    "Monad Transformers and Modular Interpreters.",
                    "Structuring Depth-First Search Algorithms in Haskell.",
                    "Time and Space Profiling for Non-Strict Higher-Order Functional Languages.",
                    "A Type System Equivalent to Flow Analysis.",
                    "Parametric Program Slicing.",
                    "A Unified Treatment of Flow Analysis in Higher-Order Languages.",
                    "Corrigendum: Decidable Bounded Quantification."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "21st POPL 1994",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1994",
                "sub_name": "Conference Record of POPL'94: 21st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Portland, Oregon, USA, January 17-21, 1994.",
                "count": 39,
                "papers": [
                    "Memory Subsystem Performance of Programs Using Copying Garbage Collection.",
                    "Correctness of Trap-Based Breakpoint Implementations.",
                    "Dominators, Super Blocks, and Program Coverage.",
                    "The Typed Polymorphic Label-Selective lambda-Calculus.",
                    "A Functional Theory of Local Names.",
                    "From Lambda-sigma to Lambda-upsilon a Journey Through Calculi of Explicit Substitutions.",
                    "Portable, Unobtrusive Garbage Collection for Multiprocessor Systems.",
                    "Higher-Order Concurrent Programs with Finite Communication Topology.",
                    "Proving Concurrent Constraint Programs Correct.",
                    "Manifest Types, Modules, and Separate Compilation.",
                    "A Type-Theoretic Approach to Higher-Order Modules with Sharing.",
                    "A Type System for Prototyping Languages.",
                    "Decidable Bounded Quantification.",
                    "Soft Typing with Conditional Types.",
                    "Automated Synthesis of Interface Adapters for Reusable Classes.",
                    "Implementation of the Typed Call-by-Value lambda-Calculus using a Stack of Regions.",
                    "Deriving Algorithms From Type Inference Systems: Application to Strictness Analysis.",
                    "Formally Optimal Boxing.",
                    "Combinations of Abstract Domains for Logic Programming.",
                    "Analyzing Logic Programs with Dynamic Scheduling.",
                    "Higher-Order Equational Logic Programming.",
                    "A Needed Narrowing Strategy.",
                    "Detecting Pipeline Structural Hazards Quickly.",
                    "An Incremental Algorithm for Maintaining the Dominator Tree of a Reducible Flowgraph.",
                    "Value Dependence Graphs: Representation without Taxation.",
                    "Lazy Array Data-Flow Dependence Analysis.",
                    "An Operational Framework for Value-Passing Processes.",
                    "CHOCOLATE: Calculi of Higher Order COmmunication and LAmbda TErms.",
                    "Combinatory Representation of Mobile Processes.",
                    "Multi-Pass Execution of Functional Logic Programs.",
                    "Composing Tree Attributions.",
                    "A Staging Calculus and its Application to the Verification of Translators.",
                    "Reducing Indirect Function call Overhead in C++ Programs.",
                    "Call Forwarding: A Simple Interprocedural Optimization Technique for Dynamically Typed Languages.",
                    "The Revival Transformation.",
                    "Selective and Lightweight Closure Conversion.",
                    "Representing Monads.",
                    "A Generic Account of Continuation-Passing Styles.",
                    "Building Interpreters by Composing Monads."
                ]
            },
            {
                "sub_name_abbr": "conf/idl/1994",
                "sub_name": "Proceedings of the Workshop on Interface Definition Languages, January 20, 1994, Portland, Oregon, USA, in conjunction with POPL 1994.",
                "count": 13,
                "papers": [
                    "The Concert Signature Representation: IDL as Intermediate Language.",
                    "ADL - An Interface Definition Language for Specifying and Testing Software.",
                    "Polymorphism and Subtyping in Interfaces.",
                    "Beyond Definition/Use: Architectural Interconnection.",
                    "A Pragmatic Approach to Software Synthesis.",
                    "A Checkable Interface Language for Pointer-Based Structures.",
                    "Interface Language for Supporting Programming Styles.",
                    "Adding Performance Information to ADT Interfaces.",
                    "A Client-Side Stub Interpreter.",
                    "Interface Definition Language Conversions: Recursive Types.",
                    "Interfaces and Extended ML.",
                    "Using Interface Inheritance to Address Problems in System Software Evolution.",
                    "Inheritance of Interface Specifications (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "20th POPL 1993",
        "info": "Charleston, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1993",
                "sub_name": "Conference Record of the Twentieth Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Charleston, South Carolina, USA, January 1993.",
                "count": 43,
                "papers": [
                    "Computer Architectures and Programming Models for Scalable Parallel Computing.",
                    "Array Data-Flow Analysis and its Use in Array Privatization.",
                    "Automatic Array Alignment in Data-Parallel Programs.",
                    "A Novel Framework of Register Allocation for Software Pipelining.",
                    "Call by Name, Assignment, and the Lambda Calculus.",
                    "On the Orthogonality of Assignments and Procedures in Algol.",
                    "Imperative Functional Programming.",
                    "Communicating Reactive Processes.",
                    "Semantics for Communication Primitives in an Polymorphic Language.",
                    "A Concurrent, Generational Garbage Collector for a Multithreaded Implementation of ML.",
                    "Separating Stages in the Continuation-Passing Style Transformation.",
                    "Specifying the Correctness of Binding-Time Analysis.",
                    "A Natural Semantics for Lazy Evaluation.",
                    "An Introduction to Logical Relations and Parametric Polymorphism - Tutorial.",
                    "Formal Parametric Polymorphism.",
                    "Relational Parametricity and Local Variables.",
                    "Algebraic Reasoning and Completeness in Typed Languages.",
                    "Graph Types.",
                    "Explicit Polymorphism and CPS Conversion.",
                    "Polymorphism by Name for References and Continuations.",
                    "Efficient Flow-Sensitive Interprocedural Computation of Pointer-Induced Aliases and Side Effects.",
                    "Automatic Generation and Management of Interprocedural Program Analyses.",
                    "Static Single Assignment for Explicitely Parallel Programs.",
                    "Constructing Call Multigraphs Using Dependence Graphs.",
                    "Safe Type Checking in a Statically-Typed Object-Oriented Programming Language.",
                    "Object-Oriented Programming without Recursive Types.",
                    "A Constructive Logic of Multiple Subtyping.",
                    "Stratified Functional Programs and Computational Complexity.",
                    "The 3 R's of Optimizing Constraint Logic Programs: Refinement, Removal and Reordering.",
                    "Layer Sharing: An Improved Structure-Sharing Framework.",
                    "Differential Logic Programming.",
                    "Evicted Variables and the Interaction of Global Register Allocation and Symbolic Debugging.",
                    "Incremental Program Testing Using Program Dependence Graphs.",
                    "Complexity of Bidirectional Data Flow Analysis.",
                    "Type Checking Type Classes.",
                    "Efficient Recursive Subtyping.",
                    "A Sort Inference Algorithm for the Polyadic Pi-Calculus.",
                    "Smartest Recompilation.",
                    "Compositional Analysis of Modular Logic Programs.",
                    "Extending Record Typing to Type Parametric Modules with Sharing.",
                    "Quasi-Static Scoping: Sharing Variable Bindings Across Multiple Lexical Scopes.",
                    "Tutorial Notes on Partial Evaluation.",
                    "A Categorized Bibliography on Incremental Computation."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "19th POPL 1992",
        "info": "Albuquerque, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1992",
                "sub_name": "Conference Record of the Nineteenth Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages, Albuquerque, New Mexico, USA, January 19-22, 1992.",
                "count": 31,
                "papers": [
                    "The Essence of Functional Programming.",
                    "The Geometry of Optimal Lambda Reduction.",
                    "Linear Continuations.",
                    "Garbage Collecting the World.",
                    "A Mark-and-Sweep Collector for C++.",
                    "Optimally Profiling and Tracing Programs.",
                    "Bounded Fixed Point Iteration.",
                    "Inductive Definitions, Semantics and Abstract Interpretation.",
                    "Modeling Prolog Control.",
                    "Semantic Foundations of Jade.",
                    "A Semantics for ML Concurrency Primitives.",
                    "Compile-Time Analysis of Parallel Programs that Share Memory.",
                    "A Comprehensive Study of the Complexity of Multiparty Interaction.",
                    "A Compilation Method for ML-Style Polymorphic Record Calculi.",
                    "Typing Record Concatenation for Free.",
                    "Unboxed Objects and Polymorphic Typing.",
                    "Principal Signatures for Higher-Order Program Modules.",
                    "Type Isomorphisms in a Type-Assignment Framework.",
                    "Pattern-Based Tree Attribution.",
                    "Composable Attribute Grammars: Support for Modularity in Translator Design and Implementation.",
                    "Recognizing Substrings of LR(k) Languages in Linear Time.",
                    "Generalized Dominators and Post-Dominators.",
                    "Generating a Compiler for a Lazy Language by Partial Evaluation.",
                    "Partial Evaluation of High-Level Imperative Programming Languages, with Applications in Hard Real-Time Systems.",
                    "Parametricity as Subtyping.",
                    "Algorithmic Aspects of Type Inference with Subtypes.",
                    "Bounded Quantification is Undecidable.",
                    "PER Models of Subtyping, Recursive Types and Higher-Order Polymorphism.",
                    "Observable Sequentiality and Full Abstraction.",
                    "Model Checking and Abstraction.",
                    "Abstract Semantics for a Higher-Order Functional Language with Logic Variables."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "18th POPL 1991",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1991",
                "sub_name": "Conference Record of the Eighteenth Annual ACM Symposium on Principles of Programming Languages, Orlando, Florida, USA, January 21-23, 1991.",
                "count": 31,
                "papers": [
                    "Incremental Compilation via Partial Evaluation.",
                    "Static and Dynamic Semantics Processing.",
                    "How to Make Destructive Updates Less Destructive.",
                    "On the Power and Limitation of Strictness Analysis Based on Abstract Interpretation.",
                    "A Relational Approach to Strictness Analysis for Higher-Order Polymorphic Functions.",
                    "Automatic Construction of Sparse Data Flow Evaluation Graphs.",
                    "Dependence Flow Graphs: An Algebraic Approach to Program Dependencies.",
                    "Program Optimization and Parallelization Using Idioms.",
                    "Pointer-Induced Aliasing: A Problem Classification.",
                    "Subtyping Recursive Types.",
                    "The Complexity of Type Inference for Higher-Order Typed Lambda Calculi.",
                    "A Record Calculus Based on Symmetric Concatenation.",
                    "\"Look Ma, No Hashing, And No Arrays Neither\".",
                    "Macros That Work.",
                    "Typing First-Class Continuations in ML.",
                    "A Dynamic Extent Control Operator for Partial Continuations.",
                    "Modeling Continuations without Continuations.",
                    "Parallel Programming With Coordination Structures.",
                    "Coordinating First-Order Multiparty Interactions.",
                    "Communication with Directed Logic Variables.",
                    "Parameter-Passing and the Lambda Calculus.",
                    "Fully Abstract Translations between Functional Languages.",
                    "Optimal Derivations in Weak Lambda-calculi and in Orthogonal Terms Rewriting Systems.",
                    "An Extension of Standard ML Modules with Subtyping and Inheritance.",
                    "Static Type Inference in a Dynamically Typed Language.",
                    "Polymorphic Type Inference and Assignment.",
                    "Algebraic Reconstruction of Types and Effects.",
                    "Modeling Concurrency with Geometry.",
                    "A Logical View of Composition and Refinement.",
                    "Semantic Foundations of Concurrent Constraint Programming.",
                    "Temporal Proof Methodologies for Real-time Systems."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "17th POPL 1990",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1990",
                "sub_name": "Conference Record of the Seventeenth Annual ACM Symposium on Principles of Programming Languages, San Francisco, California, USA, January 1990.",
                "count": 31,
                "papers": [
                    "On Laziness and Optimality in Lambda Interpreters: Tools for Specification and Analysis.",
                    "An Algorithm for Optimal Lambda Calculus Reduction.",
                    "Explicit Substitutions.",
                    "A Formulae-as-Types Notion of Control.",
                    "Implicative Formulae in the \"Proofs as Computations\" Analogy.",
                    "Computable processes.",
                    "The Chemical Abstract Machine.",
                    "Interaction Nets.",
                    "Toward a Typed Foundation for Method Specialization and Inheritance.",
                    "Inheritance Is Not Subtyping.",
                    "A Type System for Smalltalk.",
                    "A Relationship Between Abstract Interpretation and Projection Analysis.",
                    "On Determining Lifetime and Aliasing of Dynamically Allocated Data in Higher-Order Functional Specifications.",
                    "Small Domains Spell Fast Strictness Analysis.",
                    "An Efficient Hybrid Algorithm for Incremental Data Flow Analysis.",
                    "A Finite Presentation Theorem for Approximating Logic Programs.",
                    "Program Transformation in the Presence of Errors.",
                    "Making Asynchronous Parallelism Safe for the World.",
                    "Concurrent Constraint Programming.",
                    "Parallelism in Logic Programs.",
                    "Combining Generational and Conservative Garbage Collection: Framework and Implementations.",
                    "Scheduling Time-Critical Instructions on RISC Machines.",
                    "Automata-Driven Indexing of Prolog Clauses.",
                    "Fairness and Hyperfairness in Multi-Party Interactions.",
                    "Relating Total and Partial Correctness Interpretations of Non-Deterministic Programs.",
                    "On Oraclizable Networks and Kahn's Principle.",
                    "On the Relations Computable by a Class of Concurrent Automata.",
                    "Higher-Order Modules and the Phase Distinction.",
                    "Safe Run-time Overloading.",
                    "Quasi-Static Typing.",
                    "Deciding ML Typability is Complete for Deterministic Exponential Time."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "16th POPL 1989",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1989",
                "sub_name": "Conference Record of the Sixteenth Annual ACM Symposium on Principles of Programming Languages, Austin, Texas, USA, January 11-13, 1989.",
                "count": 30,
                "papers": [
                    "The Program Dependence Graph and Vectorization.",
                    "A Rewriting Semantics for Program Dependence Graphs.",
                    "An Efficient Method of Computing Static Single Assignment Form.",
                    "Resolving Circularity in Attribute Grammars with Applications to Data Flow Analysis.",
                    "Fast Interprocedural Alias Analysis.",
                    "How to Make ad-hoc Polymorphism Less ad-hoc.",
                    "Typechecking Records and Variants in a Natural Extension of ML.",
                    "Extracting F(omega)'s Programs from Proofs in the Calculus of Constructions.",
                    "Polymorphic Unification and ML Typing.",
                    "Moded Type Systems for Logic Programming.",
                    "CLP* and Constraint Abstraction.",
                    "Fully Abstract Compositional Semantics for Logic Programs.",
                    "A Calculus of Higher Order Communicating Systems.",
                    "A Fully Abstract Trace Model for Dataflow Networks.",
                    "Efficient Temporal Reasoning.",
                    "On the Synthesis of a Reactive Module.",
                    "Synthesis of Concurrent Systems with Many Similar Sequential Processes.",
                    "The Modula-3 Type System.",
                    "Dynamic Typing in a Statically-Typed Language.",
                    "Relating Models of Polymorphism.",
                    "Generalized Conjunctive Types.",
                    "Rewrite, Rewrite, Rewrite, Rewrite, Rewrite.",
                    "Partial Order Programming.",
                    "Temporal Logic Programming is Complete and Expressive.",
                    "Realistic Compilation by Program Transformation.",
                    "Continuation-Passing, Closure-Passing Style.",
                    "Copy Elimination in Functional Languages.",
                    "Incremental Computation via Function Caching.",
                    "Unified Algebras and Modules.",
                    "Bisimulation Through Probabilistic Testing."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "15th POPL 1988",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1988",
                "sub_name": "Conference Record of the Fifteenth Annual ACM Symposium on Principles of Programming Languages, San Diego, California, USA, January 10-13, 1988.",
                "count": 28,
                "papers": [
                    "Detecting Equality of Variables in Programs.",
                    "Global Value Numbers and Redundant Computations.",
                    "The Essence of ML.",
                    "Polymorphic Effect Systems.",
                    "A Proper Extension of ML with an Effective Type-Assignment.",
                    "Structural Subtyping and the Notion of Power Type.",
                    "Inheritance in Smalltalk-80: A Denotational Definition.",
                    "Type Inference with Subtypes.",
                    "Automatic Binding Time Analysis for a Typed Lambda-Calculus.",
                    "A Collecting Interpretation of Expressions (Without Powerdomains).",
                    "Strictness Analysis Aids Time Analysis.",
                    "Integrating Non-Interfering Versions of Programs.",
                    "On the Adequacy of Program Dependence Graphs for Representing Programs.",
                    "Stores and Partial Continuations as First-Class Objects in a Language and its Environment.",
                    "Sacrificing Simplicity for Convenience: Where Do You Draw the Line?",
                    "The Theory and Practice of First-Class Prompts.",
                    "Towards Fully Abstract Semantics for Local Variables.",
                    "Correct Flow Analysis in Continuation Semantics.",
                    "Inductive Methods for Reasoning about Abstract Data Types.",
                    "Bisimulation Can't Be Traced.",
                    "A Compositional Approach to Superimposition.",
                    "A Temporal Fixpoint Calculus.",
                    "Efficient Dataflow Analysis of Logic Programs.",
                    "Incremental Data Flow Analysis via Dominator and Attribute Updates.",
                    "Lifetime Analysis of Dynamically Allocated Objects.",
                    "Optimal Code Generation for Expression Trees: An Application of BURS Theory.",
                    "Compiler Optimizations for Asynchronous Systolic Array Programs.",
                    "Supernode Partitioning."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "14th POPL 1987",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1987",
                "sub_name": "Conference Record of the Fourteenth Annual ACM Symposium on Principles of Programming Languages, Munich, Germany, January 21-23, 1987.",
                "count": 29,
                "papers": [
                    "Specification and Verification of Concurrent Programs By Forall-Automata.",
                    "Axioms for Concurrent Objects.",
                    "Completeness and Incompleteness of Trace-Based Network Proof Systems.",
                    "Semantic Parallelization: A Practical Exercise in Abstract Interpretation.",
                    "The Concurrent Logic Programming Language CP: Definition and Operational Semantics.",
                    "Automatic Decomposition of Scientific Programs for Parallel Execution.",
                    "Macro-by-Example: Deriving Syntactic Transformations from their Specifications.",
                    "Binding Performance at Language Design Time.",
                    "Environments as First Class Objects.",
                    "Constraint Logic Programming.",
                    "Strictness Analysis and Denotational Abstract Interpretation.",
                    "Compiling Strictness into Streams.",
                    "On Strictness and its Analysis.",
                    "A Logic for Partially Specified Data Structures.",
                    "An Improvement to Bottom-up Tree Pattern Matching.",
                    "Lustre: A Declarative Language for Programming Synchronous Systems.",
                    "Appraising Fairness in Languages for Distributed Programming.",
                    "Concurrent Transition System Semantics of Process Networks.",
                    "Semantics for Concurrency without Powerdomains.",
                    "Full Abstraction of a Real-Time Denotational Semantics for an Occam-like Language.",
                    "Computable Values Can Be Classical.",
                    "Skinny and Fleshy Failures of Relative Completeness.",
                    "Empty Types in Polymorphic Lambda Calculus.",
                    "Scheduling Arithmetic and Load Operations in Parallel with No Spilling.",
                    "Computation of Aliases and Support Sets.",
                    "A Realistic Compiler Generator Based on High-Level Semantics.",
                    "Extensions for Multi-Module Records in Conventional Programming Languages.",
                    "Views: A Way for Pattern Matching to Cohabit with Data Abstraction.",
                    "A Calculus for Assignments in Higher-Order Languages."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "13th POPL 1986",
        "info": "St. Petersburg Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1986",
                "sub_name": "Conference Record of the Thirteenth Annual ACM Symposium on Principles of Programming Languages, St. Petersburg Beach, Florida, USA, January 1986.",
                "count": 30,
                "papers": [
                    "Remote Attribute Updating for Language-Based Editors.",
                    "Dynamically Bypassing Copy Rule Chains in Attribute Grammars.",
                    "Global Storage Allocation in Attribute Evaluation.",
                    "Finding the Source of Type Errors.",
                    "A Maximum-Flow Approach to Anomaly Isolation in Unification-Based Incremental Type Inference.",
                    "Hierarchical VLSI Design Systems Based on Attribute Grammars.",
                    "Code Motion of Control Structures in High-Level Languages.",
                    "Compilers and Staging Transformations.",
                    "Higher-Order Strictness Analysis in Untyped Lambda Calculus.",
                    "Retargetable High-Level Alias Analysis.",
                    "High-Quality Code Generation Via Bottom-Up Tree Pattern Matching.",
                    "A Parallel Language and its Compilation to Multiprocessor Machines or VLSI.",
                    "Towards Programming with Knowledge Expressions.",
                    "Limitations of Synchronous Communication with Static Process Structure in Languages for Distributed Computing.",
                    "Atomic Data Abstractions in a Distributed Collaborative Editing System.",
                    "A Really Abstract Concurrent Model and its Temporal Logic.",
                    "Expressing Interesting Properties of Programs in Propositional Temporal Logic.",
                    "Operational Semantics of a Parallel Object-Oriented Language.",
                    "Equational Logic Programming: An Extension to Equational Programming.",
                    "Logic and Inheritance.",
                    "Unification in Many-Sorted Algebras as a Device for Incremental Semantic Analysis.",
                    "Distributed Data Structures in Linda.",
                    "Para-Functional Programming: A Paradigm for Programming Multiprocessor Systems.",
                    "Annotations for Distributed Programming in Logic.",
                    "Representation Independence and Data Abstraction.",
                    "Using Dependent Types to Express Modular Structure.",
                    "\"Type\" Is Not A Type.",
                    "Data Flow Analysis of Applicative Programs Using Minimal Function Graphs.",
                    "A Mechanically Certified Theorem about Optimal Concurrency of Sorting Networks.",
                    "Executable Specifications with Quantifiers in the FASE System."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "12th POPL 1985",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1985",
                "sub_name": "Conference Record of the Twelfth Annual ACM Symposium on Principles of Programming Languages, New Orleans, Louisiana, USA, January 1985.",
                "count": 30,
                "papers": [
                    "Embedding Type Structure in Semantics.",
                    "Declaration-Free Type Checking.",
                    "Types as Intervals.",
                    "Abstract Types Have Existential Type.",
                    "Principles of OBJ2.",
                    "Program Specification and Development in Standard ML.",
                    "What It Means for a Concurrent Program to Satisfy a Specification: Why No One Has Specified Priority.",
                    "Modalities for Model Checking: Branching Time Strikes Back.",
                    "Checking That Finite State Concurrent Programs Satisfy Their Linear Specification.",
                    "Denotational Semantics and Rewrite Rules for FP.",
                    "A Model and Temporal Proof System for Networks of Processes.",
                    "Logical and Mathematical Reasoning about Imperative Programs.",
                    "A Meta-Language and System for Nonlocal Incremental Attribute Evaluation in Language-Based Editors.",
                    "Incremental Compilation of Locally Optimized Code.",
                    "A Greedy Approach to Incremental Code Generation.",
                    "On Linearizing Parallel Code.",
                    "Compiling Path Expressions into VLSI Circuits.",
                    "Constraints: A Uniform Approach to Aliasing and Typing.",
                    "High-Level Language Facilities for Low-Level Services.",
                    "Matchmaker: An Interface Specification Language for Distributed Processing.",
                    "Smart Recompilation.",
                    "Constraining Control.",
                    "Closurize and Concentrate.",
                    "Functional Programming and the Logical Variable.",
                    "Analyzing Aliases of Reference Formal Parameters.",
                    "Constant Propagation with Conditional Branches.",
                    "The Aggregate Update Problem in Functional Programming Systems.",
                    "Semantics-Directed Code Generation.",
                    "Optimal Scheduling of Arithmetic Operations in Parallel with Memory Accesses.",
                    "Efficient Tree Pattern Matching: An Aid to Code Generation."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "11th POPL 1984",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1984",
                "sub_name": "Conference Record of the Eleventh Annual ACM Symposium on Principles of Programming Languages, Salt Lake City, Utah, USA, January 1984.",
                "count": 32,
                "papers": [
                    "Expressional Loops.",
                    "Grids: A New Program Structuring Mechanism Based on Layered Graphs.",
                    "Reflection and Semantics in Lisp.",
                    "Interactive Proof Checking.",
                    "Generalized Fair Termination.",
                    "Temporal Verification of Carrier-Sense Local Area Network Protocols.",
                    "Efficient Applicative Data Types.",
                    "Stop Losing Sleep Over Incomplete Data Type Specifications.",
                    "Completion of a Set of Rules Modulo a Set of Equations.",
                    "Systems Programming in Concurrent Prolog.",
                    "Constraining-Unification and the Programming Language Unicorn.",
                    "Implementation of an Interpreter for Abstract Equations.",
                    "A Combinator-Based Compiler for a Functional Language.",
                    "Treat - An Applicative Code Generator.",
                    "Inverse Currying Transformation on Attribute Grammars.",
                    "The Global Storage Needs of a Subcomputation.",
                    "A Types-as-Sets Semantics for Milner-Style Polymorphism.",
                    "An Ideal Model for Recursive Polymorphic Types.",
                    "Coercion and Type Inference.",
                    "Editing by Example.",
                    "Direct Implementation of Compiler Specifications or the Pascal P-code Compiler Revisited.",
                    "Paragon: Novel Uses of Type Hierarchies for Data Abstraction.",
                    "Applicative Programming and Digital Design.",
                    "Pattern Driven Lazy Reduction: A Unifying Evaluation Mechanism for Functional and Logic Programs.",
                    "Static Inference of Properties of Applicative Programs.",
                    "The Semantics of Local Storage, or What Makes the Free-List Free?",
                    "On Relative Completeness of Programming Logics.",
                    "A Good Hoare Axiom System for an Algol-like Language.",
                    "A Hierarchical Basis for Reordering Transformations.",
                    "A Less Dynamic Memory Allocation Scheme for Algol-like Languages.",
                    "Creating Efficient Systems for Object-Oriented Languages.",
                    "Efficient Implementation of the Smalltalk-80 System."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "10th POPL 1983",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1983",
                "sub_name": "Conference Record of the Tenth Annual ACM Symposium on Principles of Programming Languages, Austin, Texas, USA, January 1983.",
                "count": 28,
                "papers": [
                    "Five Paradigm Shifts in Language Design and their Realization in Viron, a Dataflow Programming Environment.",
                    "Uncovering Principles of Novice Programming.",
                    "Code Generation for Silicon.",
                    "Derivation of Efficient DAG Marking Algorithms.",
                    "Reasoning About Nonatomic Operations.",
                    "Verifying Reachability Invariants of Linked Structures.",
                    "Practical Program Verification: Automatic Program Proving for Real-Time Embedded Software.",
                    "Making Variables Abstract: An Equational Theory for Russell.",
                    "Transformational Programming - Applications to Algorithms and Systems.",
                    "Polymorphic Type Inference.",
                    "Computer Experiments with the Reve Term Rewriting System Generator.",
                    "Precise Typing of Abstract Data Type Specifications.",
                    "Automatic Verification of Finite State Concurrent Systems Using Temporal Logic Specifications: A Practical Approach.",
                    "\"Sometimes\" and \"Not Never\" Revisited: On Branching Versus Linear Time.",
                    "How to Cook a Temporal Proof System for Your Pet Language.",
                    "Structural Semantics for Polymorphic Data Types.",
                    "Incremental Data Flow Analysis.",
                    "Conversion of Control Dependence to Data Dependence.",
                    "Loops in Combinator-Based Compilers.",
                    "Compilation of Data-Driven Programs for Synchronous Execution.",
                    "Summarizing Graphs by Regular Expressions.",
                    "A Program Form Based on Data Dependency in Predicate Regions.",
                    "Practical Use of a Polymorphic Applicative Language.",
                    "On the Unification of Data and Program Abstraction in Ada.",
                    "Incremental Polymorphic Type Checking in B.",
                    "Mechanisms for Compile-Time Enforcement of Security.",
                    "Abstraction Mechanisms in the Beta Programming Language.",
                    "Locality in Software Systems."
                ]
            }
        ]
    },
    {
        "year": "1982",
        "name": "9th POPL 1982",
        "info": "Albuquerque, New Mexico, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/82",
                "sub_name": "Conference Record of the Ninth Annual ACM Symposium on Principles of Programming Languages, Albuquerque, New Mexico, USA, January 1982.",
                "count": 38,
                "papers": [
                    "Termination of Probabilistic Concurrent Programs.",
                    "Guardians and Actions: Linguistic Support for Robust, Distributed Programs.",
                    "Specification and Synthesis of Communicating Processes using an Extended Temporal Logic.",
                    "Messages as Active Agents.",
                    "Extended Naming Conventions for Communicating Processes.",
                    "Unbounded Speed Variability in Distributed Communication Systems.",
                    "Programming Aspects of VLSI.",
                    "A Flexible Approach to Interprocedural Data Flow Analysis and Programs with Recursive Data Structures.",
                    "Automatic Generation of Machine Specific Code Optimizers.",
                    "Optimal Code for Control Structures.",
                    "Experience with an Attribute Grammar-Based Compiler.",
                    "Description-Driven Code Generation using Attribute Grammars.",
                    "Code Generation and Reorganization in the Presence of Pipeline Constraints.",
                    "Eliminating Redundant Object Code.",
                    "A Type Declaration and Inference System for Smalltalk.",
                    "Lithe: A Language Combining a Flexible Syntax, Classes.",
                    "Unified Dialogue Management in the Carousel System.",
                    "Maple: a Programming Language, Operating System.",
                    "Optimal-Time Incremental Semantic Analysis for Syntax-Directed Editors.",
                    "Practical Error Recovery in LR Parsing.",
                    "Non-Syntactic Attribute Flow in Language Based Editors.",
                    "Building Friendly Parsers.",
                    "Principal Type-Schemes for Functional Programs.",
                    "On the Composition of Processes.",
                    "A Semantics-Directed Compiler Generator.",
                    "Semantics-Directed Machine Architecture.",
                    "Completion Semantics, Interpreter Generation.",
                    "Partial Evaluation as a Means for Inferencing Data Structures in an Applicative Language: A Theory and Implementation in the Case of Prolog.",
                    "A Logic for Expressions with Side-Effects.",
                    "An Axiomatic Treatment of Exception Handling.",
                    "Semantics and Correctness of a Query Language Translation.",
                    "Algorithmic Program Diagnosis.",
                    "On Effective Axiomatizations of Hoare Logics.",
                    "Modular Verification of Concurrent Programs.",
                    "Axiomatic Definability and Completeness for Recursive Programs.",
                    "Is the Interesting Part of Process Logic Uninteresting - A Translation from PL to PDL.",
                    "On the Expressive Power of Query Languages for Relational Databases.",
                    "On the Ability of Structures to Store and Access Information."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "8th POPL 1981",
        "info": "Williamsburg, Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/81",
                "sub_name": "Conference Record of the Eighth Annual ACM Symposium on Principles of Programming Languages, Williamsburg, Virginia, USA, January 1981.",
                "count": 23,
                "papers": [
                    "Carrier Arrays: An Idiom-Preserving Extension to APL.",
                    "Paths: An Abstract Alternative to Pointers.",
                    "Modeling of Problem Domains for Driving Program Development Systems.",
                    "Program Improvement by Internal Specialization.",
                    "Programming Primitives for Database Languages.",
                    "Paging as a \"Language Processing\" Task.",
                    "Making the World Safe for Garbage Collection.",
                    "Position Paper on Optimizing Compilers.",
                    "Position Paper on Optimizing Compilers.",
                    "A Program Development Tool.",
                    "Incremental Evaluation for Attribute Grammars with Application to Syntax-Directed Editors.",
                    "Linear Cost is Sometimes Quadratic.",
                    "Formal Program Testing.",
                    "On the Advantages of Free Choice: A Symmetric and Fully Distributed Solution to the Dining Philosophers Problem.",
                    "Axiomatic Definitions of Programming Languages, II.",
                    "Program Verification Based on Denotational Semantics.",
                    "Program Logic Without Binding is Decidable.",
                    "The Temporal Logic of Branching Time.",
                    "Verification of Attribute Grammars.",
                    "Inferring Types in Smalltalk.",
                    "Program Optimization and Exception Handling.",
                    "Dependence Graphs and Compiler Optimizations.",
                    "A Precise Interprocedural Data Flow Algorithm."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "7th POPL 1980",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1980",
                "sub_name": "Conference Record of the Seventh Annual ACM Symposium on Principles of Programming Languages, Las Vegas, Nevada, USA, January 1980.",
                "count": 25,
                "papers": [
                    "Analysis of Pointer Rotation.",
                    "Data Types, Parameters, and Type Checking.",
                    "A High-Level Approach to Computer Document Formatting.",
                    "Experience with an Applicative String Processing Language.",
                    "An Overview of the Summer Programming Language.",
                    "Analysis of Simple Programs Over Different Sets of Primitives.",
                    "Synchronous Schemes and Their Decision Problems.",
                    "Qualified Data Flow Problems.",
                    "Interprocedural Data Flow Analysis in the Presence of Pointers, Procedure Variables and Label Variables.",
                    "Prime Subprogram Parsing of a Program.",
                    "On Specifying Verifiers.",
                    "A Case Study in Specifying the Semantics of a Programming Language.",
                    "Final Data Tye Specifications: A New Data Type Specification Method.",
                    "Expressiveness of the Operation Set of a Data Abstraction.",
                    "On Proving Inductive Properties of Abstract Data Types.",
                    "On the Temporal Analysis of Fairness.",
                    "\"Sometime\" is Sometimes \"Not Never\" - On the Temporal Logic of Programs.",
                    "Propositional Logics of Programs: Systems, Models, and Complexity.",
                    "A Dynamic Logic of Multiprocessing with Incomplete Information.",
                    "Axiomatic Definitions of Programming Languages: A Theoretical Assessment.",
                    "Efficient Algorithms for Structural Similarity of Grammars.",
                    "Theoretical and Emperical Studies on Using Program Mutation to Test the Functional Correctness of Programs.",
                    "\"Type-Completeness\" as a Language Design Principle.",
                    "An Indeterminate Constructor for Applicative Programming.",
                    "Formal Specification as a Design Tool."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "6th POPL 1979",
        "info": "San Antonio, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/79",
                "sub_name": "Conference Record of the Sixth Annual ACM Symposium on Principles of Programming Languages, San Antonio, Texas, USA, January 1979.",
                "count": 27,
                "papers": [
                    "A Compact, Machine-Independent Peephole Optimizer.",
                    "A PL/CV Precis.",
                    "Automatic Improvement of Programs in Very High Level Languages.",
                    "An Efficient Way to Find Side Effects of Procedure Calls and Aliases of Variables.",
                    "Principles of Proving Programs Correct in Gypsy.",
                    "The Evolution of List-Copying Algorithms.",
                    "First Order Programming Logic.",
                    "Recursion in Logics of Programs.",
                    "Process Logic.",
                    "The Logic of a Relational Data Manipulation Language.",
                    "The Universality of Data Retrieval Languages.",
                    "Automatic Generation of Near-Optimal Translators for Noncircular Attribute Grammars.",
                    "Space-Time Tradeoffs for Linear Recursion.",
                    "Characterization and Elimination of Redundancy in Recursive Programs.",
                    "The Functional Power of Parameter Passage Mechanisms.",
                    "Interpreter Generation Using Tree Pattern Matching.",
                    "Specifying Programming Language Semantics.",
                    "Decisions for \"Type\" in APL.",
                    "Automatic Data Structure Selection in SETL.",
                    "Synthesis of Resource Invariants for Concurrent Programs.",
                    "String Pattern Matching in Polynomial Time.",
                    "Predicate Path Expressions.",
                    "Type Checking in an Imperfect World.",
                    "Flow Analysis and Optimization of Lisp-Like Structures.",
                    "Data Flow Analysis of Communicating Processes.",
                    "Systematic Design of Program Analysis Frameworks.",
                    "Certifying Information Flow Properties of Programs: An Axiomatic Approach."
                ]
            }
        ]
    },
    {
        "year": "1978",
        "name": "5th POPL 1978",
        "info": "Tucson, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1978",
                "sub_name": "Conference Record of the Fifth Annual ACM Symposium on Principles of Programming Languages, Tucson, Arizona, USA, January 1978.",
                "count": 27,
                "papers": [
                    "Compilation and Delayed Evaluation in APL.",
                    "The Smalltalk-76 Programming System.",
                    "Clauses: Scope Structures and Defined Functions in Lucid.",
                    "Data Types as Values: Polymorphism, Type-Checking, Encapsulation.",
                    "Type Definitions with Parameters.",
                    "Syntactic Control of Interference.",
                    "Monoids for Rapid Data Flow Analysis.",
                    "A General Scheme for the Automatic Inference of Variable Types.",
                    "Symbolic Programming Analysis in Almost Linear Time.",
                    "Automatic Discovery of Linear Restraints Among Variables of a Program.",
                    "A Portable Compiler: Theory and Practice.",
                    "Automating Proofs of the Absence of Common Runtime Errors.",
                    "A Metalanguage for Interactive Proof in LCF.",
                    "Unrestricted Procedure Calls in Hoare's Logic.",
                    "A Simplifier Based on Efficient Decision Algorithms.",
                    "Reasoning about Recursively Defined Data Structures.",
                    "Off-Line and On-Line Algorithms for Deducing Equalities.",
                    "Verification and Design Aspects of \"True\" Concurrency.",
                    "Almost Control-Free (Indeterministic) Parallel Computation on Permit Schemes.",
                    "Complexity of Expressions Allowing Concurrency.",
                    "A Partial Evaluator, Its Use for Compiling Iterative Statements in Lisp.",
                    "Nondeterminism in Logics of Programs.",
                    "A Straightforward Denotational Semantics for Non-Determinant Data Flow Programs.",
                    "Efficient Computation of Expressions with Common Subexpressions.",
                    "A New Method for Compiler Code Generation.",
                    "A Forward Move Algorithm for LR Error Recovery.",
                    "Local Constraints in the Syntax and Semantics of Programming Languages."
                ]
            }
        ]
    },
    {
        "year": "1977",
        "name": "4th POPL 1977",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/77",
                "sub_name": "Conference Record of the Fourth ACM Symposium on Principles of Programming Languages, Los Angeles, California, USA, January 1977.",
                "count": 25,
                "papers": [
                    "A Complete and Consistent Hoare Semantics for a Simple Programming Language.",
                    "Programming Language Constructs for Which it is Impossible to Obtain \"Good\" Hoare-Like Axiom Systems.",
                    "Code Generation for Machines with Multiregister Operations.",
                    "A New Strategy for Code Generation - The General Purpose Optimizing Compiler.",
                    "Applications of High-Level Control Flow.",
                    "Generalized Common Subexpressions in Very High Level Languages.",
                    "Reduction in Strength of High Level Operations.",
                    "Applications of Graph Grammar for Program Control Flow Analysis.",
                    "On the Covering of Left Recursive Grammars.",
                    "An Efficient Insertion-Only Error-Corrector for LL(1) Parsers.",
                    "Symbolic Evaluation and the Global Value Graph.",
                    "An Interprocedural Data Flow Analysis Algorithm.",
                    "Implementation of an Array Bound Checker.",
                    "The Evolution of Programs: A System for Automatic Program Modification.",
                    "Parallel Program Correctness Through Refinement.",
                    "Generalized Left Corner Parsing.",
                    "Elimination of Single Productions from LR Parsers in Conjunction with the Use of Default Reductions.",
                    "The Competence/Performance Dichotomy in Programming.",
                    "Structuring.",
                    "Social Processes and Proofs of Theorems and Programs.",
                    "Minimal and Optimal Computations of Recursive Programs.",
                    "Threshold Evaluation and the Semantics of Call by Value, Assignment and Generic Procedures.",
                    "Abstract Interpretation: A Unified Lattice Model for Static Analysis of Programs by Construction or Approximation of Fixpoints.",
                    "The Equivalence Problem for Program Schemata with Nonintersecting Loops.",
                    "Parallelism and Synchronization in Actor Systems."
                ]
            }
        ]
    },
    {
        "year": "1976",
        "name": "3rd POPL 1976",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1976",
                "sub_name": "Conference Record of the Third ACM Symposium on Principles of Programming Languages, Atlanta, Georgia, USA, January 1976.",
                "count": 20,
                "papers": [
                    "The Influence of Productions on Derivations and Parsing.",
                    "A Complexity Theory of Grammar Problems.",
                    "Code Generation for Expressions with Common Subexpressions.",
                    "Automatic Generation of Efficient Evaluators for Attribute Grammars.",
                    "Automatic Design of Data Processing Systems.",
                    "Techniques for the Automatic Selection of Data Structures.",
                    "A Methodology for Lisp Program Construction from Examples.",
                    "Binding Time Optimization in Programming Languages: Some Thoughts Toward the Design of an Ideal Language.",
                    "A Lazy Evaluator.",
                    "Induction Variables in Very High Level Languages.",
                    "An Algorithm for Structuring Programs.",
                    "On Directly Constructing LR(k) Parsers Without Chain Reductions.",
                    "PLAN2D - Syntactic Analysis of Precedence Graph Grammars.",
                    "Program Improvement by Source to Source Transformation.",
                    "Goal-Directed Program Transformation.",
                    "Primitive Recursive Program Transformations.",
                    "Mathematical Semantics and Data Flow Programming.",
                    "Procedure Referencing Environments in SL5.",
                    "Verifying Formal Specifications of Synchronous Processes.",
                    "Test Data as an Aid in Proving Program Correctness."
                ]
            }
        ]
    },
    {
        "year": "1975",
        "name": "2nd POPL 1975",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/1975",
                "sub_name": "Conference Record of the Second ACM Symposium on Principles of Programming Languages, Palo Alto, California, USA, January 1975.",
                "count": 22,
                "papers": [
                    "Application of Lattice Algebra to Loop Optimization.",
                    "Node Listings Applied to Data Flow Analysis.",
                    "A Fast and Usually Linear Algorithm for Global Flow Analysis.",
                    "Automatic Data Structure Choice in a Language of Very High Level.",
                    "A Mathematical Approach to Language Design.",
                    "Correctness-Preserving Program Transformations.",
                    "Actor Semantics of Planner-73.",
                    "Reduction: A New Method of Proving Properties of Systems of Processes.",
                    "A Semantic Model for Parallel Systems with Scheduling.",
                    "A Description of Path Expressions by Petri Nets.",
                    "Even Simple Programs are Hard to Analyze.",
                    "On the Complexity of the Circularity Test for Attribute Grammars.",
                    "On the Complexity of LR(k) Testing.",
                    "Programming Languages, Natural Languages, and Mathematics.",
                    "Modes, Values, and Expressions.",
                    "An Assertion Language for Data Structures.",
                    "An Algebraic Model for String Patterns.",
                    "Program Schemas with Concurrency: Execution Time and Hangups.",
                    "New Control Structures to Aid Gotolessness.",
                    "Structured Exception Handling.",
                    "An Algebra of Relations for Machine Computation.",
                    "Computer Assisted Application Definition."
                ]
            }
        ]
    },
    {
        "year": "1973",
        "name": "1st POPL 1973",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/popl/cd1997",
                "sub_name": "POPL: The First Ten Years, Proceedings Compenium 1973-1983, CDROM.",
                "count": 0,
                "papers": []
            },
            {
                "sub_name_abbr": "conf/popl/1973",
                "sub_name": "Conference Record of the ACM Symposium on Principles of Programming Languages, Boston, Massachusetts, USA, October 1973.",
                "count": 22,
                "papers": [
                    "Deterministic Parsing of Ambiguous Grammars.",
                    "Strict Deterministic Versus LR(0) Parsing.",
                    "Labelled Precedence Parsing.",
                    "Top Down Operator Precedence.",
                    "Practical Syntactic Error Recovery.",
                    "A Parallel Approach to Compilation.",
                    "Programming Language Semantics and Closed Applicative Languages.",
                    "On the Definitional Method of Standard PL/1.",
                    "Mathematical Semantics of Snobol 4.",
                    "Formalization of Exel.",
                    "Types are Not Sets.",
                    "Recursively Defined Data Types.",
                    "Mode Modules as Representations of Domains.",
                    "Advice on Structuring Compilers and Proving Them Correct.",
                    "Actor Induction and Meta-Evaluation.",
                    "Reasoning About Programs.",
                    "Procedure Linkage Optimization.",
                    "A Unified Approach to Global Program Optimization.",
                    "Analysis of a Simple Algorithm for Global Flow Problems.",
                    "Transitions in Extendible Arrays.",
                    "Large Scale File Processing - Pogol.",
                    "On the Decision Problems of Program Schemas with Commutative and Invertable Functions."
                ]
            }
        ]
    }
]