[
    {
        "year": "2022",
        "name": "28th REFSQ 2022",
        "info": "Birmingham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2022",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 28th International Working Conference, REFSQ 2022, Birmingham, UK, March 21-24, 2022, Proceedings.",
                "count": 19,
                "papers": [
                    "Transparency and Explainability of AI Systems: Ethical Guidelines in Practice.",
                    "Requirements Engineering for Artificial Intelligence: What Is a Requirements Specification for an Artificial Intelligence?",
                    "Quo Vadis, Explainability? - A Research Roadmap for Explainability Engineering.",
                    "How Effective Is Automated Trace Link Recovery in Model-Driven Development?",
                    "A Zero-Shot Learning Approach to Classifying Requirements: A Preliminary Study.",
                    "Abbreviation-Expansion Pair Detection for Glossary Term Extraction.",
                    "Towards Explainable Formal Methods: From LTL to Natural Language with Neural Machine Translation.",
                    "Req2Spec: Transforming Software Requirements into Formal Specifications Using Natural Language Processing.",
                    "FRETting About Requirements: Formalised Requirements for an Aircraft Engine Controller.",
                    "Invest in Splitting: User Story Splitting Within the Software Industry.",
                    "Guided Derivation of Conceptual Models from User Stories: A Controlled Experiment.",
                    "From User Stories to Data Flow Diagrams for Privacy Awareness: A Research Preview.",
                    "Requirements Engineering in the Market Dialogue Phase of Public Procurement: A Case Study of an Innovation Partnership for Medical Technology.",
                    "A Business Model Construction Kit for Platform Business Models - Research Preview.",
                    "On Testing Security Requirements in Industry - A Survey Study.",
                    "Setting AI in Context: A Case Study on Defining the Context and Operational Design Domain for Automated Driving.",
                    "Requirements Engineering for Software-Enabled Art: Challenges and Guidelines.",
                    "A Study on the Mental Models of Users Concerning Existing Software.",
                    "Vision Video Making with Novices: A Research Preview."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "27th REFSQ 2021",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2021",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 27th International Working Conference, REFSQ 2021, Essen, Germany, April 12-15, 2021, Proceedings.",
                "count": 15,
                "papers": [
                    "Is Requirements Similarity a Good Proxy for Software Similarity? An Empirical Investigation in Industry.",
                    "Automatic Detection of Causality in Requirement Artifacts: The CiRA Approach.",
                    "Improving Trace Link Recovery Using Semantic Relation Graphs and Spreading Activation.",
                    "CORG: A Component-Oriented Synthetic Textual Requirements Generator.",
                    "Automatically Classifying Non-functional Requirements with Feature Extraction and Supervised Machine Learning Techniques: A Research Preview.",
                    "AdaptationExplore - A Process for Elicitation, Negotiation, and Documentation of Adaptive Requirements.",
                    "Trustworthy AI Services in the Public Sector: What Are Citizens Saying About It?",
                    "Defining Utility Functions for Multi-stakeholder Self-adaptive Systems.",
                    "Risk-Driven Compliance Assurance for Collaborative AI Systems: A Vision Paper.",
                    "Requirements Engineering in the Planning Phase of a Software Ecosystem.",
                    "Power and Privacy in Software Ecosystems: A Study on Data Breach Impact on Tech Giants.",
                    "Iterative and Scenario-Based Requirements Specification in a System of Systems Context.",
                    "Specifying Requirements for Data Collection and Analysis in Data-Driven RE. A Research Preview.",
                    "SaPeer Approach for Training Requirements Analysts: An Application Tailored to a Low-resource Context.",
                    "On Understanding the Relation of Knowledge and Confidence to Requirements Quality."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2021w",
                "sub_name": "Joint Proceedings of REFSQ 2021 Workshops, OpenRE, Poster and Tools Track, and Doctoral Symposium co-located with the 27th International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2021), Essen, Germany, April 12, 2021.",
                "count": 29,
                "papers": [
                    "Preface: 10th International Workshop on Creativity in Requirements Engineering (CreaRE 2021).",
                    "Creative People are Great Thieves with Lousy Dealers.",
                    "Against Method - An Essay on the Importance of Studying Projects and Results for More Creativity in RE!",
                    "Choosing a Creativity Technique for Requirements Elicitation.",
                    "Divergent Creativity for Requirement Elicitation Amid Pandemic: Experience from Real Consulting Project.",
                    "Preface: 4th Workshop on Natural Language Processing for Requirements Engineering (NLP4RE 2021).",
                    "Continuous Rationale Identification in Issue Tracking and Version Control Systems.",
                    "A Vision of Understanding the Users' View on Software.",
                    "An NLP-based Chatbot to Facilitate RE Activities: An Experience Paper on Human Resources Application.",
                    "CiRA: A Tool for the Automatic Detection of Causal Relationships in Requirements Artifacts.",
                    "Concept Extraction in Requirements Elicitation Session Recordings: Prototype and Experimentation.",
                    "Semantic Frames for Classifying Temporal Requirements: An Exploratory Study.",
                    "Using Recurrent Neural Networks for Classification of Natural Language-based Non-functional Requirements.",
                    "Case study: How Well Can IBM's \"Requirements Quality Assistant\" Review Automotive Requirements?",
                    "SRXCRM: Discovering Association Rules Between System Requirements and Product Specifications.",
                    "From Legal Contracts to Formal Specifications: A Progress Report.",
                    "Towards Artefact-based Requirements Engineering for Data-Centric Systems.",
                    "Towards Self-Explainable Adaptive Systems (SEAS): A Requirements Driven Approach.",
                    "Requirements Engineering for Actors-with-Learning: Incorporating the Two Kinds of Models and Modeling for Full-Cognitive-Cycle RE.",
                    "Methods and Guidelines for Incorporating Human Factors Requirements in Automated Vehicles Development.",
                    "Prioritizing Software Requirements by Combining the Usage Monitoring Data with the Feedback Data.",
                    "The Use of Context-free Grammar and Gamification to Reduce User Story Ambiguity and Raise Ambiguity Awareness: A Proposal.",
                    "Free for All: Open RE Course - Lectures on YouTube, Slides on Slideshare & Material on Foss2Serve.",
                    "Requirements Engineering Course Material for First-Year Software Engineering Students.",
                    "Requirements Engineering in Industry: Modular Foundational Online Training to Build Basic Practices.",
                    "BeSoS: A Tool for Behavior-driven and Scenario-based Requirements Modeling for Systems of Systems.",
                    "Extreme Requirements Elicitation: Lessons Learnt from the COVID-19 Case Study.",
                    "Hanfor: Semantic Requirements Review at Scale.",
                    "SAIP: A Prototype Tool for Semi-Automatic User Interface Prototyping."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th REFSQ 2020",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2020",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 26th International Working Conference, REFSQ 2020, Pisa, Italy, March 24-27, 2020, Proceedings [REFSQ 2020 was postponed].",
                "count": 21,
                "papers": [
                    "How Do Quantifiers Affect the Quality of Requirements?",
                    "Generation of Formal Requirements from Structured Natural Language.",
                    "Using Eye Tracking Data to Improve Requirements Specification Use.",
                    "Hearing the Voice of Software Practitioners on Causes, Effects, and Practices to Deal with Documentation Debt.",
                    "Innovation Workshop Documentation for Following Software Engineering Activities.",
                    "Industrial Practices on Requirements Reuse: An Interview-Based Study.",
                    "Disambiguating Requirements Through Syntax-Driven Semantic Analysis of Information Types.",
                    "On Understanding How Developers Perceive and Interpret Privacy Requirements Research Preview.",
                    "A Methodology for Implementing the Formal Legal-GRL Framework: A Research Preview.",
                    "Towards Integrating Data-Driven Requirements Engineering into the Software Development Process: A Vision Paper.",
                    "Identifying and Classifying User Requirements in Online Feedback via Crowdsourcing.",
                    "Designing a Virtual Client for Requirements Elicitation Interviews.",
                    "Explicit Alignment of Requirements and Architecture in Agile Development.",
                    "Applying Distributed Cognition Theory to Agile Requirements Engineering.",
                    "Automatic Word Embeddings-Based Glossary Term Extraction from Large-Sized Software Requirements.",
                    "Conceptualizing Requirements Using User Stories and Use Cases: A Controlled Experiment.",
                    "A Semi-automated Approach to Generate an Adaptive Quality Attribute Relationship Matrix.",
                    "Evaluating the Effects of Different Requirements Representations on Writing Test Cases.",
                    "Vision Meets Visualization: Are Animated Videos an Alternative?",
                    "Requirements Assessment in Smart City Districts: A Motivation Concept for Citizens.",
                    "Visualizing Feature-Level Evolution in Product Lines: A Research Preview."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2020w",
                "sub_name": "Joint Proceedings of REFSQ-2020 Workshops, Doctoral Symposium, Live Studies Track, and Poster Track co-located with the 26th International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2020), Pisa, Italy, March 24, 2020.",
                "count": 34,
                "papers": [
                    "Preface: 3rd Workshop on Natural Language Processing for Requirements Engineering (NLP4RE 2020).",
                    "Keynote: Don't shun the pun: On the requirements and constraints for preserving ambiguity in the (machine) translation of humour.",
                    "A comparison of NLP Tools for RE to extract Variation Points.",
                    "Toward Latent Knowledge Extraction Based on the Correlation of Heterogeneous Text Data Related to Space System Development.",
                    "Automating Requirement Quality Standards with QVscribe.",
                    "Opinion Analysis and Organization of Mobile Application User Reviews.",
                    "Using NLP to Support Terminology Extraction and Domain Scoping: Report on the H2020 DESIRA Project.",
                    "On System Sequence Descriptions.",
                    "Cross-Domain Ambiguity Detection using Linear Transformation of Word Embedding Spaces.",
                    "The Tenth Anniversary of the CreaRE Workshops: A Look Back and a Look Forward.",
                    "Conspiracy Walls in Requirements Engineering - Analyzing Requirements like a Detective.",
                    "Let's get \"InspiRE-D\" for RE by Other Disciplines - A Creativity-Based Approach.",
                    "Preface: The International Workshop on Requirements Engineering for Artificial Intelligence (RE4AI 2020).",
                    "Trustworthy AI: Towards the Golden Age of RE?",
                    "Requirements for Monitoring Inattention of the Responsible Human in an Autonomous Vehicle: The Recall and Precision Tradeoff.",
                    "Artificial Actor Behaviours for Interactive Videos: Handling AI Requirements in ELEVATE.",
                    "Using a Requirements Modelling Language to Co-Design Intelligent Support for People Living with Dementia.",
                    "On the Interplay between Requirements, Engineering, and Artificial Intelligence.",
                    "Towards Requirements Engineering for Superintelligence Safety.",
                    "Preface: REFSQ 2020 Doctoral Symposium.",
                    "Privacy Requirements Engineering in Agile Software Development: a Specification Method.",
                    "Preface: Live Study Track at REFSQ 2020.",
                    "Exploring the influence of the emotional state on the efficiency for correcting defects in conceptual models: a Live Study.",
                    "On the Perceived Harmfulness of Requirement Smells: An Empirical Study.",
                    "Preface: REFSQ 2020 Posters and Tools Track.",
                    "RESim - Automated Detection of Duplicated Requirements in Software Engineering Projects.",
                    "The AMASS Tool Platform: An Innovative Solution for Assurance and Certication of Cyber-Physical Systems.",
                    "Continuous Management of Requirement Decisions Using the ConDec Tools.",
                    "Formal Requirements Elicitation with FRET.",
                    "Towards a Catalog of Privacy Related Concepts.",
                    "How to Gather Requirements from the Crowd with Hackathons - Challenges, Experiences and Opportunities.",
                    "Eliciting Requirements from Citizens - What Can We Learn from Other Disciplines?",
                    "What About Catalogs of Non-Functional Requirements?",
                    "Bridging the Gap Between Requirements and Simulink Model Analysis."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th REFSQ 2019",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2019",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 25th International Working Conference, REFSQ 2019, Essen, Germany, March 18-21, 2019, Proceedings.",
                "count": 22,
                "papers": [
                    "Decision Support for Security-Control Identification Using Machine Learning.",
                    "Is the SAFE Approach Too Simple for App Feature Extraction? A Replication Study.",
                    "Enabling Users to Specify Correct Privacy Requirements.",
                    "RE-SWOT: From User Feedback to Requirements via Competitor Analysis.",
                    "Increasing Precision of Automatically Generated Trace Links.",
                    "Impact of Gamification on Trace Link Vetting: A Controlled Experiment.",
                    "Refinement of User Stories into Backlog Items: Linguistic Structure and Action Verbs - Research Preview.",
                    "Requirements Engineering for Innovative Software Ecosystems: A Research Preview.",
                    "Assessment of the Quality of Safety Cases: A Research Preview.",
                    "Refining Vision Videos.",
                    "A Lightweight Multilevel Markup Language for Connecting Software Requirements and Simulations.",
                    "Supporting Feature Model Evolution by Lifting Code-Level Dependencies: A Research Preview.",
                    "Identifying Requirements in Requests for Proposal: A Research Preview.",
                    "Finding and Analyzing App Reviews Related to Specific Features: A Research Preview.",
                    "Supporting the Selection of Constraints for Requirements Monitoring from Automatically Mined Constraint Candidates.",
                    "Combining Monitoring and Autonomous Feedback Requests to Elicit Actionable Knowledge of System Use.",
                    "Selecting Open Source Projects for Traceability Case Studies.",
                    "Crowd Intelligence in Requirements Engineering: Current Status and Future Directions.",
                    "Towards a Meta-model for Requirements-Driven Information for Internal Stakeholders.",
                    "Towards a Catalogue of Mobile Elicitation Techniques - Research Preview.",
                    "Towards the Next Generation of Scenario Walkthrough Tools - A Research Preview.",
                    "A Research Preview on TAICOS - Tailoring Stakeholder Interests to Task-Oriented Functional Requirements."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2019w",
                "sub_name": "Joint Proceedings of REFSQ-2019 Workshops, Doctoral Symposium, Live Studies Track, and Poster Track co-located with the 25th International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2019), Essen, Germany, March 18th, 2019.",
                "count": 36,
                "papers": [
                    "Preface.",
                    "Requirements Philology (keynote).",
                    "Requirements Philology.",
                    "Determining Domain-Specific Differences of Polysemous Words Using Context Information.",
                    "Using Frame Embeddings to Identify Semantically Related Software Requirements.",
                    "A Taxonomy for User Feedback Classifications.",
                    "From Generic Requirements to Variability.",
                    "An Overview of User Feedback Classification Approaches.",
                    "An NL-based Foundation for Increased Traceability, Transparency, and Speed in Continuous Development of Information Systems.",
                    "Supporting the Development of Cyber-Physical Systems with Natural Language Processing: A Report.",
                    "Research on NLP for RE at Utrecht University: A Report.",
                    "Research on NLP for RE at Università della Svizzera Italiana (USI): A Report.",
                    "Natural Language Processing with Process Models (NLP4RE Report Paper).",
                    "Research on NLP for RE at the FBK-Software Engineering Research Line: A Report.",
                    "QuARS: A NLP Tool for Requirements Analysis.",
                    "OpenReq-DD: A. Requirements Dependency Detection Tool.",
                    "Detecting Inconsistencies of Natural Language Requirements in Satellite Ground Segment Domain.",
                    "Detection of Defective Requirements using Rule-based Scripts.",
                    "Expert-sourcing Domain-specific Knowledge: The Case of Synonym Validation.",
                    "Preface: Eighth International Workshop on Creativity in Requirements Engineering (CreaRE 2019).",
                    "Digitalization and AI Bring the Work Back to the Roots - or: Towards an RE 4.0 (keynote).",
                    "Two Experiments Comparing Two Four-Step EPMcreate-Based Creativity Techniques for Requirements Elicitation.",
                    "Designing Flexible Creative Spaces.",
                    "Preface: 2nd International Workshop on Learning from Other Disciplines for Requirements Engineering (D4RE) .",
                    "Avoiding Undertrust and Overtrust.",
                    "Preface: REFSQ 2019 Doctoral Symposium.",
                    "Generation of Multiple Conceptual Models from User Stories in Agile.",
                    "Requirements-based Simulation Execution for Virtual Validation of Autonomous Systems.",
                    "Gamifying Requirements Engineering for Better Practice.",
                    "Preface: Live Studies at REFSQ 2019.",
                    "Exploring users perception on security and satisfaction requirements of context-aware applications: An Online Survey.",
                    "Assessing the effect of learning styles on risk model comprehensibility: A controlled experiment (short paper).",
                    "Preface to the Posters and Tools Track.",
                    "Goal Model Construction Based on User Review Classification.",
                    "Scade2Nu : A Tool for Verifying Safety Requirements of SCADE Models with Temporal Specifications.",
                    "ReMinds-CMT: An Interactive Tool Supporting Constraint Mining for Requirements Monitoring."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th REFSQ 2018",
        "info": "Utrecht, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2018",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 24th International Working Conference, REFSQ 2018, Utrecht, The Netherlands, March 19-22, 2018, Proceedings.",
                "count": 23,
                "papers": [
                    "Problem-Oriented Requirements in Practice - A Case Study.",
                    "An Exploratory Study on How Internet of Things Developing Companies Handle User Experience Requirements.",
                    "Inferring Ontology Fragments from Semantic Role Typing of Lexical Variants.",
                    "Using Tools to Assist Identification of Non-requirements in Requirements Specifications - A Controlled Experiment.",
                    "Evaluation of Techniques to Detect Wrong Interaction Based Trace Links.",
                    "Second-Guessing in Tracing Tasks Considered Harmful?",
                    "Interview Review: An Empirical Study on Detecting Ambiguities in Requirements Elicitation Interviews.",
                    "Pinpointing Ambiguity and Incompleteness in Requirements Engineering via Information Visualization and NLP.",
                    "Quality Requirements Challenges in the Context of Large-Scale Distributed Agile: An Empirical Study.",
                    "The Problem of Consolidating RE Practices at Scale: An Ethnographic Study.",
                    "QREME - Quality Requirements Management Model for Supporting Decision-Making.",
                    "The Influence of Green Strategies Design onto Quality Requirements Prioritization.",
                    "On Modelers Ability to Build a Visual Diagram from a User Story Set: A Goal-Oriented Approach.",
                    "Jobs-to-be-Done Oriented Requirements Engineering: A Method for Defining Job Stories.",
                    "Keeping Evolving Requirements and Acceptance Tests Aligned with Automatically Generated Guidance.",
                    "Coexisting Graphical and Structured Textual Representations of Requirements: Insights and Suggestions.",
                    "Security Requirements Elicitation from Engineering Governance, Risk Management and Compliance.",
                    "On the Understanding of BDD Scenarios' Quality: Preliminary Practitioners' Opinions.",
                    "Personal Recommendations in Requirements Engineering: The OpenReq Approach.",
                    "State of Requirements Engineering Research in the Context of Big Data Applications.",
                    "Automatic User Preferences Elicitation: A Data-Driven Approach.",
                    "Streamlining Semantics from Requirements to Implementation Through Agile Mind Mapping Methods.",
                    "A Persona-Based Modelling for Contextual Requirements."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2018w",
                "sub_name": "Joint Proceedings of REFSQ-2018 Workshops, Doctoral Symposium, Live Studies Track, and Poster Track co-located with the 23rd International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2018), Utrecht, The Netherlands, March 19, 2018.",
                "count": 36,
                "papers": [
                    "Keynote: Evaluation of NLP Tools for Hairy RE Tasks.",
                    "Invited Talk: Domain-adaptation of Natural Language Processing Tools for RE.",
                    "How to Deal with Inaccurate Service Requirements? Insights in Our Current Approach and New Ideas.",
                    "Requirements Quality Defect Detection with the Qualicen Requirements Scout.",
                    "CORDULA: Software Requirements Extraction Utilizing Chatbot as Communication Interface.",
                    "Research on NLP for RE at CNR-ISTI: a Report.",
                    "Back to Basics: Extracting Software Requirements with a Syntactic Approach.",
                    "Research on NLP for RE at Fraunhofer FKIE: A Report on Grouping Requirements.",
                    "Which Semantics for Requirements Engineering: From Shallow to Deep.",
                    "Research on NLP for RE at the University of Hamburg: A Report.",
                    "Knowledge Representation of Requirements Documents Using Natural Language Processing.",
                    "The Natural Language Programming (NLPRO) Project: Turning Text into Executable Code.",
                    "Is there Really a Need for Using NLP to Elicit Requirements? A Benchmarking Study to Assess Scalability of Manual Analysis.",
                    "Managing Multi-Lingual User Feedback: The SUPERSEDE Project Experience.",
                    "Research on NLP for RE at UPC: A Report.",
                    "Keynote: The Collaboration Perspective on Continuous Development.",
                    "Scenario-Driven Continuous Mobility Requirements Analysis in Mobile App Maintenance.",
                    "Required Changes in Requirements Engineering Approaches for Socio-Cyber-Physical Systems.",
                    "Use Cases, User Stories and BizDevOps.",
                    "Towards a Theory about Continuous Requirements Engineering for Information Systems.",
                    "Evaluation of RE Tools Suitability for Continuous Requirements Engineering.",
                    "Requirements Engineering Elicitation for Mobility Assistance Dogs: Meeting Canine User Needs Through Technology Enabled Interpretation.",
                    "Educating for Empathy in Software Engineering Course.",
                    "Be Ahead of the Game: Gamification for Inclusive RE.",
                    "Requirements-Driven Supervision of Socio-Technical Systems.",
                    "Environment Modeling for Complex, Dynamic and Distributed Systems.",
                    "Analysis of Requirement Problems Regarding their Causes and Effects for Projects with the Objective to Model Qualitative PRIs - Empirical Study.",
                    "Towards a Systematic Approach for Designing Gamification for RE.",
                    "Understanding the Soft Skills that Industry Wants from Requirements Engineers: a Focus Group Study.",
                    "Empirical Validation of a Software Requirements Specification Checklist.",
                    "The Interactive Narrator Tool: Effective Requirements Exploration and Discussion through Visualization.",
                    "Tool Support for Value Modeling and Risk Analysis of e-Services.",
                    "Multiple Criteria Decision Support in Requirements Negotiation.",
                    "Elicitation of SME Requirements for Cybersecurity Solutions by Studying Adherence to Recommendations.",
                    "ORSIM: Integrating Existing Software Components to Detect Similar Natural Language Requirements.",
                    "PACAS: A Gamified Platform for Participatory Change Management in ATM Systems."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd REFSQ 2017",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2017",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 23rd International Working Conference, REFSQ 2017, Essen, Germany, February 27 - March 2, 2017, Proceedings.",
                "count": 26,
                "papers": [
                    "Incremental Reconfiguration of Product Specific Use Case Models for Evolving Configuration Decisions.",
                    "Aligning the Elements of the RUP/UML Business Use-Case Model and the BPMN Business Process Diagram.",
                    "Modeling and Analyzing Openness Trade-Offs in Software Platforms: A Goal-Oriented Approach.",
                    "A Contribution Management Framework for Firms Engaged in Open Source Software Ecosystems - A Research Preview.",
                    "Defect Prevention in Requirements Using Human Error Information: An Empirical Study.",
                    "Requirements Quality Assurance in Industry: Why, What and How?",
                    "The Impact of Specification Structure on Human Memory Performance - Experiences from a First Experiment.",
                    "How Can You Improve Your As-Is Models? Requirements Analysis Methods Meet GQM.",
                    "Integrating Goal Model Analysis with Iterative Design.",
                    "Patterns of Collaboration Driven by Requirements in Agile Software Development Teams - Findings from a Multiple Case Study.",
                    "Common Mistakes of Student Analysts in Requirements Elicitation Interviews.",
                    "How Can Quality Awareness Support Rapid Software Development? - A Research Preview.",
                    "Using Tags to Support Feature Management Across Issue Tracking Systems and Version Control Systems - A Research Preview.",
                    "From Requirements Monitoring to Diagnosis Support in System of Systems.",
                    "On the Equivalence Between Graphical and Tabular Representations for Security Risk Assessment.",
                    "Visualization of Quality of Software Requirements Specification Using Digital Elevation Model.",
                    "Quality Requirements in Large-Scale Distributed Agile Projects - A Systematic Literature Review.",
                    "Improving User Story Practice with the Grimm Method: A Multiple Case Study in the Software Industry.",
                    "Semi-automatic Software Feature-Relevant Information Extraction from Natural Language User Manuals - An Approach and Practical Experience at Roche Diagnostics GmbH.",
                    "Mining User Requirements from Application Store Reviews Using Frame Semantics.",
                    "Using Interaction Data for Continuous Creation of Trace Links Between Source Code and Requirements in Issue Tracking Systems.",
                    "A Requirements Traceability Approach to Support Mission Assurance and Configurability in the Military.",
                    "On the Ability of Lightweight Checks to Detect Ambiguity in Requirements Documentation.",
                    "Using NLP to Detect Requirements Defects: An Industrial Experience in the Railway Domain.",
                    "Specifying Software Requirements for Safety-Critical Railway Systems: An Experience Report.",
                    "Usefulness of a Human Error Identification Tool for Requirements Inspection: An Experience Report."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2017w",
                "sub_name": "Joint Proceedings of REFSQ-2017 Workshops, Doctoral Symposium, Research Method Track, and Poster Track co-located with the 22nd International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2017), Essen, Germany, February 27, 2017.",
                "count": 32,
                "papers": [
                    "Analytics in Continuous Requirements Engineering.",
                    "Adding Value Every Sprint: A Case Study on Large-Scale Continuous Requirements Engineering.",
                    "Socialization aspect in Requirements Engineering.",
                    "Using a Liquid Democracy Tool for End-user Involvement in Continuous RE.",
                    "Requirements Elicitation and Specification using the S-BPM Paradigm.",
                    "Does Continuous Requirements Engineering need Continuous Software Engineering?",
                    "Continuous Requirements Engineering for Mobile Application Development.",
                    "Creativity Techniques for Social Engineering Threat Elicitation: A Controlled Experiment.",
                    "Downsizing EPMcreate to Lighter Creativity Techniques for Requirements Elicitation.",
                    "Vicus - A Persona for Towns: Towards Innovation Management through Co-Creation and Predictive Situation Analytics.",
                    "Imagining the future: A social science approach to the importance of visions in the software development process.",
                    "Establishing a Requirements Baseline by Functional Size Measurement Patterns.",
                    "Modelling Prioritisation Decision-making in Software Evolution.",
                    "Addressing Team Awareness By Means Of A Requirement Prioritization Tool.",
                    "End-user Driven Feedback Prioritization.",
                    "State of the Practice on Software Release Planning.",
                    "Capturing Ambiguity in Artifacts to Support Requirements Engineering for Self-Adaptive Systems.",
                    "Towards Security Requirements: Iconicity as a Feature of an Informal Modeling Language.",
                    "A Case Study into the Development Process of Cyber Physical Systems.",
                    "Automotive Future and its Impact on Requirements Engineering.",
                    "Empirical Evaluation of an Approach that Stimulates Architectural Thinking during Requirements Gathering.",
                    "Use of Domain Ontologies to Improve Requirements Quality.",
                    "Requirements Engineering for Large Scale Agile Systems Development.",
                    "Using Human Error Abstraction Method for Detecting and Classifying Requirements Errors: A Live Study.",
                    "Understanding Human Errors In Software Requirements: An Online Survey.",
                    "MARC: A Mobile Application Review Classifier.",
                    "Are Graph Query Languages Applicable for Requirements Traceability Analysis?",
                    "Perspectives on User Story Based Visual Transformations.",
                    "Towards a Dataset for Natural Language Requirements Processing.",
                    "Applying the SPES Modeling Framework: A Case Study from the Automotive Domain.",
                    "A Change Management Approach in Product Lines for Use Case-Driven Development and Testing.",
                    "COVER: Change-based Goal Verifier and Reasoner."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd REFSQ 2016",
        "info": "Gothenburg, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2016",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 22nd International Working Conference, REFSQ 2016, Gothenburg, Sweden, March 14-17, 2016, Proceedings.",
                "count": 21,
                "papers": [
                    "Risk-Aware Multi-stakeholder Next Release Planning Using Multi-objective Optimization.",
                    "Goal-Based Decision Making - Using Goal-Oriented Problem Structuring and Evaluation Visualization for Multi Criteria Decision Analysis.",
                    "Optimizing the Incremental Delivery of Software Features Under Uncertainty.",
                    "Do Information Retrieval Algorithms for Automated Traceability Perform Effectively on Issue Tracking System Data?",
                    "How Firms Adapt and Interact in Open Source Ecosystems: Analyzing Stakeholder Influence and Collaboration Patterns.",
                    "Evaluating the Interpretation of Natural Language Trace Queries.",
                    "Indicators for Open Issues in Business Process Models.",
                    "Automated Classification of Legal Cross References Based on Semantic Intent.",
                    "Deriving Metrics for Estimating the Effort Needed in Requirements Compliance Work.",
                    "Requirements Defects over a Project Lifetime: An Empirical Analysis of Defect Data from a 5-Year Automotive Project at Bosch.",
                    "Take Care of Your Modes! An Investigation of Defects in Automotive Requirements.",
                    "Gamified Requirements Engineering: Model and Experimentation.",
                    "Documenting Relations Between Requirements and Design Decisions: A Case Study on Design Session Transcripts.",
                    "The Use and Effectiveness of User Stories in Practice.",
                    "Foundations for Transparency Requirements Engineering.",
                    "What Is Essential? - A Pilot Survey on Views About the Requirements Metamodel of reqT.org.",
                    "People's Capabilities are a Blind Spot in RE Research and Practice.",
                    "Customer Involvement in Continuous Deployment: A Systematic Literature Review.",
                    "Common Threats and Mitigation Strategies in Requirements Engineering Experiments with Student Participants.",
                    "Lean Development in Design Science Research: Deliberating Principles, Prospects and Pitfalls.",
                    "How Do We Read Specifications? Experiences from an Eye Tracking Study."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2016w",
                "sub_name": "Joint Proceedings of REFSQ-2016 Workshops, Doctoral Symposium, Research Method Track, and Poster Track co-located with the 22nd International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2016), Gothenburg, Sweden, March 14, 2016.",
                "count": 32,
                "papers": [
                    "Towards Continuous Information Security Audit.",
                    "Requirements Quality in the Incremental Design Processes: Problems and Perspectives.",
                    "Towards Automated Requirements Checking Throughout Development Processes of Interactive Systems.",
                    "Towards a Task Driven Approach Enabling Continuous User Requirements Engineering.",
                    "Continuous Requirements Engineering and Human-Centered Agile Software Development.",
                    "Applying Layering Concept to the Software Requirements Analysis and Architectural Design.",
                    "Requirements Inheritance in Continuous Requirements Engineering: A Position Paper.",
                    "Continuous Requirements Engineering in FREEDOM Framework: A Position Paper.",
                    "Integrated Framework for Software Requirement Analysis.",
                    "A Framework for Prototyping and Evaluating Self-adaptive Systems - A Research Preview.",
                    "Self-disclosure in Social Media: An Opportunity for Self-Adaptive Systems.",
                    "Model-Based Prototype Development to Support Early Validation of Cyber-Physical System Specifications.",
                    "Testing Quality Requirements of a System-of-Systems in the Public Sector - Challenges and Potential Remedies.",
                    "A Proposal for Improving Project Coordination using Data Mining and Proximity Tracking.",
                    "Specification of Non-Functional Requirements: A Hybrid Approach.",
                    "Bridging the Gap between Natural Language Requirements and Formal Specifications.",
                    "Evaluating and Improving Software Quality Using Text Analysis Techniques - A Mapping Study.",
                    "Requirements Engineering for Pervasive Healthcare Monitoring System.",
                    "Supporting Natural Language Queries across the Requirements Engineering Process.",
                    "Engineering Quality Requirements in Large Scale Distributed Agile Environment.",
                    "An Investigation into Business Requirements Evolution in Service-Based Enterprise Systems.",
                    "Tool Support for Traceability-Adaptation.",
                    "Improving Software Traceability in the Development of Automotive Embedded Systems - A Research Abstract.",
                    "Quality Improvements for Trace Links between Source Code and Requirements.",
                    "Requirements Engineering in Open Innovation.",
                    "Web-based Collaborative Security Requirements Elicitation.",
                    "How Do Quality Requirements Contribute to Software Sustainability?",
                    "AQUSA: The Automatic Quality User Story Artisan for Agile Software Development.",
                    "QoE probe: A Requirement-monitoring Tool.",
                    "Managing Requirements Interdependencies in Agile Software Development: A Preliminary Result.",
                    "Reviewing Inconsistent Behavioral Properties.",
                    "Experimentation with Self-configuring Systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st REFSQ 2015",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2015",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 21st International Working Conference, REFSQ 2015, Essen, Germany, March 23-26, 2015. Proceedings.",
                "count": 23,
                "papers": [
                    "Experimental Validation of a Risk Assessment Method.",
                    "Supporting the Validation of Adequacy in Requirements-Based Hazard Mitigations.",
                    "Metrics for the Evaluation of Feature Models in an Industrial Context: A Case Study at Opel.",
                    "Modeling and Reasoning About Information Quality Requirements.",
                    "Detecting and Correcting Outdated Requirements in Function-Centered Engineering of Embedded Systems.",
                    "Estimating the Implementation Risk of Requirements in Agile Software Development Projects with Traceability Metrics.",
                    "The Role of Catalogues of Threats and Security Controls in Security Risk Assessment: An Empirical Study with ATM Professionals.",
                    "Analyzing and Enforcing Security Mechanisms on Requirements Specifications.",
                    "How Artifacts Support and Impede Requirements Communication.",
                    "Consonance Between Economic and IT Services: Finding the Balance Between Conflicting Requirements.",
                    "From Stakeholder Requirements to Formal Specifications Through Refinement.",
                    "Towards More Efficient Requirements Formalization: A Study.",
                    "The Emerging Requirement for Digital Addiction Labels.",
                    "Challenges of the Customer Organization's Requirements Engineering Process in the Outsourced Environment - A Case Study.",
                    "A Case Study Evaluation of the Guideline-Supported QUPER Model for Elicitation of Quality Requirements.",
                    "Towards Crowd-Based Requirements Engineering A Research Preview.",
                    "Functional Requirements Modelling for Interactive TV Applications.",
                    "FlexiView: A Magnet-Based Approach for Visualizing Requirements Artifacts.",
                    "Requirements Engineering in the Bidding Stage of Software Projects - A Research Preview.",
                    "Research Preview: Supporting Requirements Feedback Flows in Iterative System Development.",
                    "User-Constrained Clustering in Online Requirements Forums.",
                    "A Systematic Literature Review of Requirements Prioritization Criteria.",
                    "Embedding Stakeholder Values in the Requirements Engineering Process."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2015w",
                "sub_name": "Joint Proceedings of REFSQ-2015 Workshops, Research Method Track, and Poster Track co-located with the 21st International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2015), Essen, Germany, March 23, 2015.",
                "count": 27,
                "papers": [
                    "Requirements Specification as Executable Software Design - A Behavior Perspective.",
                    "Using Work Agreements as Operation-time System Requirements for Emergent Work.",
                    "Towards a Method for Integrated Semi-Automated Business Proess and Regulations Compliance Management for Continuous Requirements Engineering.",
                    "A Model for Structuring and Reusing Security Requirements Sources and Security Requirements.",
                    "Enterprise Architecture and Knowledge Perspectives on Continuous Requirements Engineering.",
                    "Success Factors for Creativity Workshop in RE.",
                    "Creativity and Conceptual Modeling for Requirements Engineering.",
                    "The Box Fight Analogy: A Blueprint for Pre-Sales Requirements Engineering Workshop.",
                    "Elicitation of Information Needs in Precontract Requirements Engineering.",
                    "ERP Services Effort Estimation Strategies Based on Early Requirements.",
                    "Operationalizing the Requirements Selection Process with Study Selection Procedures from Systematic Literature Reviews.",
                    "Requirements Communication in Issue Tracking Systems in Four Open-Source Projects.",
                    "An Experience Report on ERP Effort Estimation Driven by Quality Requirements.",
                    "A Tool for Monitoring and Maintaining System Thrustworthiness at Runtime.",
                    "Cyber-Physical Systems Design for Runtime Thrustworthiness Maintenance Supported by Tools.",
                    "Model-based Generation of a Requirements Monitor.",
                    "Context Uncertainty in Requirements Engineering Definition of a Search Strategy for a Systematic Review and Preliminary Result.",
                    "Developing Artifact with Concept Relationship Oriented Methodology, a Progress Report.",
                    "A Modular Safety Assurance Method considering Multi-Aspect Contracts during Cyber Physical System Design.",
                    "Using Timinig Paths to Validate End-to-end Requirements with Methods of Schedulability Simulation and Analysis.",
                    "Live Study Proposal: Collecting Natural Language Trace Queries.",
                    "Focus Group: Cost-effective and Methodologically Sound Ways to Get Practitioners Involved in Your Empirical RE Research.",
                    "A Framework for Information Quality Requirements Engineering.",
                    "Motivation as a Supplementary Requirement.",
                    "Transparency as a Requirement.",
                    "Digital Addiction: Gamification for Precautionary and Recovery Requirements.",
                    "Integrating GUI Mockups and User Stories."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th REFSQ 2014",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2014",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 20th International Working Conference, REFSQ 2014, Essen, Germany, April 7-10, 2014. Proceedings.",
                "count": 23,
                "papers": [
                    "Is Requirements Engineering Useless in Game Development?",
                    "Towards Model-Driven Requirements Engineering for Serious Educational Games: Informal, Semi-formal, and Formal Models.",
                    "Measuring and Improving the Completeness of Natural Language Requirements.",
                    "(Semi-) automatic Categorization of Natural Language Requirements.",
                    "A Systematic Literature Review of Requirements Modeling and Analysis for Self-adaptive Systems.",
                    "Requirements-Driven Social Adaptation: Expert Survey.",
                    "A Requirements Monitoring Infrastructure for Very-Large-Scale Software Systems.",
                    "State of Practice of User-Developer Communication in Large-Scale IT Projects - Results of an Expert Interview Series.",
                    "Digital Addiction: A Requirements Engineering Perspective.",
                    "Feedback-Aware Requirements Documents for Smart Devices.",
                    "INCREMENT: A Mixed MDE-IR Approach for Regulatory Requirements Modeling and Analysis.",
                    "Systematic Elaboration of Compliance Requirements Using Compliance Debt and Portfolio Theory.",
                    "Answer-Set Programming in Requirements Engineering.",
                    "Improving the Understandability of Formal Specifications: An Experience Report.",
                    "Problem-Based Requirements Interaction Analysis.",
                    "Analyzing the Effect of the Collaborative Interactions on Performance of Requirements Validation.",
                    "Argumentation-Based Discussion for User Forum: A Research Preview.",
                    "A Requirements-Led Approach for Specifying QoS-Aware Service Choreographies: An Experience Report.",
                    "Experience-Oriented Approaches for Teaching and Training Requirements Engineering: An Experience Report.",
                    "An Analysis of Priority-Based Decision Heuristics for Optimizing Elicitation Efficiency.",
                    "The Effects of Requirements Elicitation Issues on Software Project Performance: An Empirical Analysis.",
                    "Requirements Reuse and Patterns: A Survey.",
                    "Safety Evidence Traceability: Problem Analysis and Model."
                ]
            },
            {
                "sub_name_abbr": "conf/refsq/2014w",
                "sub_name": "Joint Proceedings of REFSQ-2014 Workshops, Doctoral Symposium, Empirical Track, and Posters, co-located with the 20th International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2014), Essen, Germany, April 7-10, 2014.",
                "count": 20,
                "papers": [
                    "Value Stories: Putting Human Values into Requirements Engineering.",
                    "Innovation vs. Heritage: a Requirements Game to Encourage Creativity in Government Agencies' Legacy Systems Replacement Projects.",
                    "A Practical Approach for Reliable Pre-Project Effort Estimation.",
                    "Towards a toolbox for cost-calculation in the pre-requirements phase.",
                    "Calculating Software Projects on a Mockup based approach.",
                    "Pre-Sales Requirements Engineering based on Miller Heiman's Sales Approach.",
                    "Requirements Engineering For ADDICTion-Aware Software (E-ADDICT).",
                    "A Dialectic Approach for User Requirements Engineering for Multi-User Systems.",
                    "Definition and Use of Software Requirement Patterns in Requirements Engineering Activities.",
                    "A model-driven method for gesture-based interface requirements specification.",
                    "Experiment: Understandability of Goal Modeling with ARMOR.",
                    "Towards Crowdsourcing for Requirements Engineering.",
                    "Survey Protocol: Traceability during Development of Systems with Safety and Security Implications - Importance, Tools, and Challenges.",
                    "State of the Practice for Sustainability as an Explicit Objective.",
                    "Requirements for Context-Aware Systems.",
                    "The notion of Stakeholder in Requirements Engineering community.",
                    "Elicitation and Specification Processes of NFR for Web Applications.",
                    "Viable Systems Model based Requirements Engineering.",
                    "SREBP: Security Requirement Elicitation from Business Processes.",
                    "Game-based Training of Communication Skills in Requirements Engineering."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th REFSQ 2013",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2013",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 19th International Working Conference, REFSQ 2013, Essen, Germany, April 8-11, 2013. Proceedings.",
                "count": 28,
                "papers": [
                    "Software Architects' Experiences of Quality Requirements: What We Know and What We Do Not Know?",
                    "A Persona-Based Approach for Exploring Architecturally Significant Requirements in Agile Projects.",
                    "Using Clustering to Improve the Structure of Natural Language Requirements Documents.",
                    "Automatic Requirement Categorization of Large Natural Language Specifications at Mercedes-Benz for Review Improvements.",
                    "Requirement Ambiguity Not as Important as Expected - Results of an Empirical Evaluation.",
                    "The Design of SREE - A Prototype Potential Ambiguity Finder for Requirements Specifications and Lessons Learned.",
                    "Factors Influencing User Feedback on Predicted Satisfaction with Software Systems.",
                    "reqT.org - Towards a Semi-Formal, Open and Scalable Requirements Modeling Tool.",
                    "Maps of Lessons Learnt in Requirements Engineering: A Research Preview.",
                    "Requirements Traceability across Organizational Boundaries - A Survey and Taxonomy.",
                    "Regulatory Requirements Traceability and Analysis Using Semi-formal Specifications.",
                    "A Survey on Usage Scenarios for Requirements Traceability in Practice.",
                    "The Emergence of Mutual and Shared Understanding in the System Development Process.",
                    "Highlighting Stakeholder Communities to Support Requirements Decision-Making.",
                    "Choosing Compliance Solutions through Stakeholder Preferences.",
                    "Supporting Decision-Making for Self-Adaptive Systems: From Goal Models to Dynamic Decision Networks.",
                    "Mapping i* within UML for Business Modeling.",
                    "Risk Identification at the Interface between Business Case and Requirements.",
                    "Analyzing an Industrial Strategic Release Planning Process - A Case Study at Roche Diagnostics.",
                    "Redefinition of the Requirements Engineer Role in Mjølner's Software Development Process.",
                    "Distances between Requirements Engineering and Later Software Development Activities: A Systematic Map.",
                    "Analyzing the Tracing of Requirements and Source Code during Software Development - A Research Preview.",
                    "Requirements Engineering Meets Physiotherapy: An Experience with Motion-Based Games.",
                    "Use Case and Requirements Analysis in a Remote Rural Context in Mali.",
                    "Requirements Engineering in Practice: There Is No Requirements Engineer Position.",
                    "Effective Requirements Elicitation in Product Line Application Engineering - An Experiment.",
                    "Monitoring System-of-Systems Requirements in Multi Product Lines.",
                    "Adjusting to Increasing Product Management Problems: Challenges and Improvement Proposals in One Software Company."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th REFSQ 2012",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2012",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 18th International Working Conference, REFSQ 2012, Essen, Germany, March 19-22, 2012. Proceedings.",
                "count": 27,
                "papers": [
                    "Why the Electronic Land Registry Failed.",
                    "Answering a Request for Proposal - Challenges and Proposed Solutions.",
                    "Impediments to Requirements-Compliance.",
                    "How Architects See Non-Functional Requirements: Beware of Modifiability.",
                    "Research Preview: Prioritizing Quality Requirements Based on Software Architecture Evaluation Feedback.",
                    "A Simulation Approach for Impact Analysis of Requirement Volatility Considering Dependency Change.",
                    "Collaborative Resolution of Requirements Mismatches When Adopting Open Source Components.",
                    "High-Level Requirements Management and Complexity Costs in Automotive Development Projects: A Problem Statement.",
                    "Choose Your Creativity: Why and How Creativity in Requirements Engineering Means Different Things to Different People.",
                    "Supporting Failure Mode and Effect Analysis: A Case Study with Failure Sequence Diagrams.",
                    "Aligning Mal-activity Diagrams and Security Risk Management for Security Requirements Definitions.",
                    "Towards a More Semantically Transparent i* Visual Syntax.",
                    "Providing Software Product Line Knowledge to Requirements Engineers - A Template for Elicitation Instructions.",
                    "Supporting Learning Organisations in Writing Better Requirements Documents Based on Heuristic Critiques.",
                    "Managing Implicit Requirements Using Semantic Case-Based Reasoning Research Preview.",
                    "Trace Queries for Safety Requirements in High Assurance Systems.",
                    "Which Traceability Visualization Is Suitable in This Context? A Comparative Study.",
                    "The Case for Dumb Requirements Engineering Tools.",
                    "Automatic Analysis of Multimodal Requirements: A Research Preview.",
                    "10 Myths of Software Quality.",
                    "Empirical Analysis of the Impact of Requirements Engineering on Software Quality.",
                    "A Systematic Literature Review on Service Description Methods.",
                    "A Pattern-Based Method for Identifying and Analyzing Laws.",
                    "Towards a Requirements Modeling Language for Self-Adaptive Systems.",
                    "Requirements Monitoring for Adaptive Service-Based Applications.",
                    "Release Planning with Feature Trees: Industrial Case.",
                    "Goal-Oriented Requirements Engineering and Enterprise Architecture: Two Case Studies and Some Lessons Learned."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th REFSQ 2011",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2011",
                "sub_name": "Requirements Engineering: Foundation for Software Quality - 17th International Working Conference, REFSQ 2011, Essen, Germany, March 28-30, 2011. Proceedings.",
                "count": 20,
                "papers": [
                    "Delivering Requirements Research into Practice: A Keynote to the REFSQ'2011 Conference.",
                    "Supporting Requirements Engineers in Recognising Security Issues.",
                    "Discovering Sustainability Requirements: An Experience Report.",
                    "Requirements Engineering Process Improvement: An Industrial Case Study.",
                    "Requirements for a Nutrition Education Demonstrator.",
                    "Scaling Up Requirements Engineering - Exploring the Challenges of Increasing Size and Complexity in Market-Driven Software Development.",
                    "Towards a New Understanding of Small and Medium Sized Enterprises in Requirements Engineering Research.",
                    "Research Preview: Supporting End-User Requirements Elicitation Using Product Line Variability Models.",
                    "Interview Patterns for Requirements Elicitation.",
                    "A Heuristic Approach for Supporting Product Innovation in Requirements Engineering: A Controlled Experiment.",
                    "Satisfying User Needs at the Right Time and in the Right Place: A Research Preview.",
                    "Flexible Sketch-Based Requirements Modeling.",
                    "Use Cases versus Task Descriptions.",
                    "E-Service Requirements from a Consumer-Process Perspective.",
                    "Is It Beneficial to Match Reusable Services Earlier?",
                    "Requirements Engineering for Embedded Systems: An Investigation of Industry Needs.",
                    "Applying Restricted English Grammar on Automotive Requirements - Does it Work? A Case Study.",
                    "Agile Requirements Prioritization: What Happens in Practice and What Is Described in Literature.",
                    "Mining Requirements Links.",
                    "Clustering Stakeholders for Requirements Decision Making."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th REFSQ 2010",
        "info": "Essen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2010",
                "sub_name": "Requirements Engineering: Foundation for Software Quality, 16th International Working Conference, REFSQ 2010, Essen, Germany, June 30 - July 2, 2010. Proceedings.",
                "count": 25,
                "papers": [
                    "Keynote Talk Piecing Together the Requirements Jigsaw-Puzzle.",
                    "Understanding the Scope of Uncertainty in Dynamically Adaptive Systems.",
                    "Use of Personal Values in Requirements Engineering - A Research Preview.",
                    "Requirements and Systems Architecture Interaction in a Prototypical Project: Emerging Results.",
                    "Videos vs. Use Cases: Can Videos Capture More Requirements under Time Pressure?",
                    "Supporting the Consistent Specification of Scenarios across Multiple Abstraction Levels.",
                    "Requirements Value Chains: Stakeholder Management and Requirements Engineering in Software Ecosystems.",
                    "Binary Priority List for Prioritizing Software Requirements.",
                    "Towards a Framework for Specifying Software Robustness Requirements Based on Patterns.",
                    "A Metamodel for Software Requirement Patterns.",
                    "Validation of the Effectiveness of an Optimized EPMcreate as an Aid for Creative Requirements Elicitation.",
                    "Towards Multi-view Feature-Based Configuration.",
                    "Evaluation of a Method for Proactively Managing the Evolving Scope of a Software Product Line.",
                    "Challenges in Aligning Requirements Engineering and Verification in a Large-Scale Industrial Context.",
                    "On the Perception of Software Quality Requirements during the Project Lifecycle.",
                    "Lessons Learned from Integrating Specification Templates, Collaborative Workshops, and Peer Reviews.",
                    "A Case Study on Tool-Supported Multi-level Requirements Management in Complex Product Families.",
                    "A Domain Ontology Building Process for Guiding Requirements Elicitation.",
                    "Tackling Semi-automatic Trace Recovery for Large Specifications.",
                    "Ambiguity Detection: Towards a Tool Explaining Ambiguity Sources.",
                    "Ambiguity in Natural Language Software Requirements: A Case Study.",
                    "On the Role of Ambiguity in RE.",
                    "Towards a Framework to Elicit and Manage Security and Privacy Requirements from Laws and Regulations.",
                    "Visualizing Cyber Attacks with Misuse Case Maps.",
                    "How Do Software Architects Consider Non-Functional Requirements: A Survey."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "15th REFSQ 2009",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2009",
                "sub_name": "Requirements Engineering: Foundation for Software Quality, 15th International Working Conference, REFSQ 2009, Amsterdam, The Netherlands, June 8-9, 2009, Proceedings.",
                "count": 21,
                "papers": [
                    "When Product Managers Gamble with Requirements: Attitudes to Value and Risk.",
                    "Toward a Service Management Quality Model.",
                    "A Controlled Experiment of a Method for Early Requirements Triage Utilizing Product Strategies.",
                    "Demystifying Release Definition: From Requirements Prioritization to Collaborative Value Quantification.",
                    "Specifying Changes Only - A Case Study on Delta Requirements.",
                    "Requirements Tracing to Support Change in Dynamically Adaptive Systems.",
                    "Early Identification of Problem Interactions: A Tool-Supported Approach.",
                    "Composing Models for Detecting Inconsistencies: A Requirements Engineering Perspective.",
                    "Experiences with a Requirements Object Model.",
                    "Architecting and Coordinating Thousands of Requirements - An Industrial Case Study.",
                    "BPMN-Based Specification of Task Descriptions: Approach and Lessons Learnt.",
                    "Clarifying Non-functional Requirements to Improve User Acceptance - Experience at Siemens.",
                    "Scenarios in the Wild: Experiences with a Contextual Requirements Discovery Method.",
                    "Inventing Requirements with Creativity Support Tools.",
                    "A Quantitative Assessment of Requirements Engineering Publications - 1963-2008.",
                    "Assurance Case Driven Case Study Design for Requirements Engineering Research.",
                    "Translation of Textual Specifications to Automata by Means of Discourse Context Modeling.",
                    "A Requirements Reference Model for Model-Based Requirements Engineering in the Automotive Domain.",
                    "Quality Requirements in Practice: An Interview Study in Requirements Engineering for Embedded Systems.",
                    "Does Requirements Clustering Lead to Modular Design?.",
                    "Lessons Learned from Open Source Projects for Facilitating Online Requirements Processes."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th REFSQ 2008",
        "info": "Montpellier, France",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2008",
                "sub_name": "Requirements Engineering: Foundation for Software Quality, 14th International Working Conference, REFSQ 2008, Montpellier, France, June 16-17, 2008, Proceedings.",
                "count": 19,
                "papers": [
                    "REFSQ'08 International Working Conference on Requirements Engineering: Foundation for Software Quality.",
                    "Process Improvement in Requirements Management: A Method Engineering Approach.",
                    "Enhancing Elicitation Technique Selection Process in a Cooperative Distributed Environment.",
                    "Negotiation Constellations - Method Selection Framework for Requirements Negotiation.",
                    "DESCRY: A Method for Evaluating Decision-Supporting Capabilities of Requirements Engineering Tools.",
                    "Inventing Requirements: Experiences with an Airport Operations System.",
                    "A Stakeholder Model for Interorganizational Information Systems.",
                    "Search Based Requirements Optimisation: Existing Work and Challenges.",
                    "Connecting Feature Models and AUTOSAR: An Approach Supporting Requirements Engineering in Automotive Industries.",
                    "Using a Creativity Workshop to Generate Requirements for an Event Database Application.",
                    "Can We Beat the Complexity of Very Large-Scale Requirements Engineering?.",
                    "Macro-level Traceability Via Media Transformations.",
                    "Towards Simulation-Based Quality Requirements Elicitation: A Position Paper.",
                    "Classifying Assumptions Made during Requirements Verification of Embedded Systems.",
                    "Integrating Portfolio Management and Simulation Concepts in the ERP Project Estimation Practice.",
                    "Can Patterns Improve i* Modeling? Two Exploratory Studies.",
                    "Discovering Web Services to Improve Requirements Specifications: Does It Help?.",
                    "Mobile Discovery of Requirements for Context-Aware Systems.",
                    "When to Adapt? Identification of Problem Domains for Adaptive Systems."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th REFSQ 2007",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/2007",
                "sub_name": "Requirements Engineering: Foundation for Software Quality, 13th International Working Conference, REFSQ 2007, Trondheim, Norway, June 11-12, 2007, Proceedings.",
                "count": 28,
                "papers": [
                    "REFSQ 2007 International Working Conference on Requirements Engineering: Foundation for Software Quality.",
                    "Comparing Goal Modelling Languages: An Experiment.",
                    "Automatically Generating Requirements from i* Models: Experiences with a Complex Airport Operations System.",
                    "Structuring the Co-design of Requirements and Architecture.",
                    "A Template for Requirement Elicitation of Dependable Product Lines.",
                    "A Flexible Requirements Analysis Approach for Software Product Lines.",
                    "Integrated Requirement Selection and Scheduling for the Release Planning of a Software Product.",
                    "A Value-Based Approach in Requirements Engineering: Explaining Some of the Fundamental Concepts.",
                    "Value-Based Requirements Engineering for Value Webs.",
                    "A Quantitative Assessment of Requirements Engineering Publications - 1963-2006.",
                    "Handshaking Between Software Projects and Stakeholders Using Implementation Proposals.",
                    "Generating Fast Feedback in Requirements Elicitation.",
                    "Informing the Specification of a Large-Scale Socio-technical System with Models of Human Activity.",
                    "Integration Use Cases - An Applied UML Technique for Modeling Functional Requirements in Service Oriented Architecture.",
                    "Optimal-Constraint Lexicons for Requirements Specifications.",
                    "Integrating All Stages of Information Systems Development by Means of Natural Language Processing.",
                    "Information Flow Between Requirement Artifacts. Results of an Empirical Study.",
                    "Imperfect Requirements in Software Development.",
                    "Towards a Tomographic Framework for Structured Observation of Communicative Behaviour in Hospital Wards.",
                    "A Quality Performance Model for Cost-Benefit Analysis of Non-functional Requirements Applied to the Mobile Handset Domain.",
                    "Security Requirements for Civil Aviation with UML and Goal Orientation.",
                    "Challenges for Requirements Engineering and Management in Software Product Line Development.",
                    "ElicitO: A Quality Ontology-Guided NFR Elicitation Tool.",
                    "Exploring the Characteristics of NFR Methods - A Dialogue About Two Approaches.",
                    "Defining Reference Models for Modelling Qualities: How Requirements Engineering Techniques Can Help.",
                    "Integrating an Improvement Model of Handling Capacity Requirements with the OpenUP/Basic Process.",
                    "Mal-Activity Diagrams for Capturing Attacks on Business Processes.",
                    "Towards Feature-Oriented Specification and Development with Event-B."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "4th REFSQ 1998",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/refsq/1998",
                "sub_name": "Requirements Engineering: Foundation for Software Quality, 4th International Workshop, REFSQ 1998, Pisa, Italy, June 8-9, 1998. Proceedings.",
                "count": 20,
                "papers": [
                    "Why Goal-Oriented Requirements Engineering.",
                    "Abstraction Guides: Interrelating Conceptual Models with Real World Scenes.",
                    "A Proposal for Improving the Quality of the Organisation of Scenarios Collections.",
                    "The Software Requirement Modelling in SAREL.",
                    "On Linguistic Quality of Natural Language Requirements.",
                    "Requirements Engineering for Complex COTS.",
                    "Improving the Requirements Process.",
                    "Managing Requirements Change: A Set of Good Practices.",
                    "Requirements for Groupware-Supported Requirements Process in New Product Development.",
                    "The \"Knowledge Curtain\": Beyond the \"Communication Gap\".",
                    "The Structural, Social, Political and Symbolic Dimensions of Computer-Based Systems Requirements.",
                    "Action Within Information Systems: Outline of a Requirements Engineering Method.",
                    "Six Styles for Usability Requirements.",
                    "CREWS Validation Frames: Patterns for Validating Systems Requirements.",
                    "OASIS: Not According to Hoyle.",
                    "Requirements Engineering for Quality Requirements.",
                    "Dependable Embedded Systems: The Challenges for Requirements Engineering.",
                    "Combining Scenario-based Requirements with Static Verification and Dynamic Testing.",
                    "The Four Levels of Use Case Description.",
                    "Scenario-based Analysis of Non-Functional Requirements."
                ]
            }
        ]
    }
]