[
    {
        "name": "Requirements Engineering",
        "year": "2022",
        "info": "Volume 27, 2022",
        "count": 6,
        "papers": [
            "Formal requirements modeling for cyber-physical systems engineering: an integrated solution based on FORM-L and Modelica.",
            "A validation of QDAcity-RE for domain modeling using qualitative data analysis.",
            "TracIMo: a traceability introduction methodology and its evaluation in an Agile development team.",
            "A use case driven approach to game modeling.",
            "Exploring the challenges and benefits for scaling agile project management to large projects: a review.",
            "Leveraging BPMN particularities to improve traceability links recovery among requirements and BPMN models."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2021",
        "info": "Volume 26, 2021",
        "count": 24,
        "papers": [
            "A retrospective on Telos as a metamodeling language for requirements engineering.",
            "Modeling functional requirements using tacit knowledge: a design science research methodology informed approach.",
            "Requirements-driven data warehouse design based on enhanced pivot tables.",
            "Model elements identification using neural networks: a comprehensive study.",
            "Robust requirements gathering for ontologies in smart water systems.",
            "Safety requirements for symbiotic human-robot collaboration systems in smart factories: a pairwise comparison approach to explore requirements dependencies.",
            "DAREF: MDA framework for modelling data warehouse requirements and deducing the multidimensional schema.",
            "Assisted requirements selection by clustering.",
            "RAPID: a knowledge-based assistant for designing web APIs.",
            "Modeling machine learning requirements from three perspectives: a case report from the healthcare domain.",
            "Automatically detecting feature requests from development emails by leveraging semantic sequence mining.",
            "The state-of-practice in requirements elicitation: an extended interview study at 12 companies.",
            "Toward practical adoption of i* framework: an automatic two-level layout approach.",
            "A GRL-compliant iStar extension for collaborative cyber-physical systems.",
            "Risk-aware business process management using multi-view modeling: method and tool.",
            "A Game-theoretic approach to analyze interacting actors in GRL goal models.",
            "Formal reasoning for analyzing goal models that evolve over time.",
            "Is it possible to disregard obsolete requirements? a family of experiments in software effort estimation.",
            "A framework for evaluating and improving requirements specifications based on the developers and testers perspective.",
            "Network structure and requirements crowdsourcing for OSS projects.",
            "Interspecies information systems.",
            "A quantitative comparison of the effects of modeling approaches on system verification using a controlled challenge problem.",
            "Correction to: Is it possible to disregard obsolete requirements? A family of experiments in software effort estimation.",
            "Correction to: Risk‑aware business process management using multi‑view modeling: method and tool."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2020",
        "info": "Volume 25, 2020",
        "count": 25,
        "papers": [
            "Known and unknown requirements in healthcare.",
            "Collaborative traceability management: a multiple case study from the perspectives of organization, process, and culture.",
            "Extracting core requirements for software product lines.",
            "From event logs to goals: a systematic literature review of goal-oriented process mining.",
            "Performance-driven software development: an incremental refinement approach for high-quality requirement engineering.",
            "A method for analyzing stakeholders' influence on an open source software ecosystem's requirements engineering process.",
            "Requirements analysis gamification in legacy system replacement projects.",
            "Engineering digital motivation in businesses: a modelling and analysis framework.",
            "GARUSO: a gamification approach for involving stakeholders outside organizational reach in requirements engineering.",
            "Structural similarity measure between UML class diagrams based on UCG.",
            "Reducing ambiguity during enterprise design.",
            "Reconstructing the past: the case of the Spadina Expressway.",
            "Author Correction: Customer support ticket escalation prediction using feature engineering.",
            "Expanding the nature and scope of requirements for service systems through Service-Dominant Logic: the case of a telemonitoring service.",
            "A socio-technical-based process for questionnaire development in requirements elicitation via interviews.",
            "Software requirements testing approaches: a systematic literature review.",
            "Cultural influence on requirements engineering activities: a systematic literature review and analysis.",
            "Parallel multi-objective artificial bee colony algorithm for software requirement optimization.",
            "Modular norm models: practical representation and analysis of contractual rights and obligations.",
            "Correction to: Modular norm models: practical representation and analysis of contractual rights and obligations.",
            "Preface to the requirements engineering special issue on selected papers from RE'19.",
            "SaPeer and ReverseSaPeer: teaching requirements elicitation interviews with role-playing and role reversal.",
            "An efficient approach for reviewing security-related aspects in agile requirements specifications of web applications.",
            "Requirements engineering for sustainability: an awareness framework for designing software systems for a better tomorrow.",
            "Explainability as a non-functional requirement: challenges and recommendations."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2019",
        "info": "Volume 24, 2019",
        "count": 24,
        "papers": [
            "RSL-IL4Privacy: a domain-specific language for the rigorous specification of privacy policies.",
            "An empirical study on the use of i* by non-technical stakeholders: the case of strategic dependency diagrams.",
            "Understanding what is important in iStar extension proposals: the viewpoint of researchers.",
            "The QDAcity-RE method for structural domain modeling using qualitative data analysis.",
            "A multifactor approach for elicitation of Information requirements of data warehouses.",
            "Automatic test cases generation from business process models.",
            "Goal-oriented requirements engineering: an extended systematic mapping study.",
            "Addressing the state explosion problem when visualizing off-nominal behaviors in a set of reactive requirements.",
            "A set of prescribed activities for enhancing requirements engineering in the development of usable e-Government applications.",
            "Eliciting user requirements for e-collaboration systems: a proposal for a multi-perspective modeling approach.",
            "Providing tool support for specifying safety-critical systems by enforcing syntactic contract conditions.",
            "Editorial, special issue RE 2018.",
            "Teaching requirements elicitation interviews: an empirical study of learning from mistakes.",
            "Identifying incompleteness in privacy policy goals using semantic frames.",
            "The impact of requirements on systems development speed: a multiple-case study in automotive.",
            "Automating requirements analysis and test case generation.",
            "Semantic hierarchies for extracting, modeling, and connecting compliance requirements in information security control standards.",
            "A framework for designing cloud forensic-enabled services (CFeS).",
            "Automatic recommendation to omitted steps in use case specification.",
            "A systematic literature mapping of goal and non-goal modelling methods for legal and regulatory compliance.",
            "Improving the identification of functional system requirements when novice analysts create use case diagrams: the benefits of applying conceptual mental models.",
            "A requirements engineering methodology for knowledge management solutions: integrating technical and social aspects.",
            "Sustainability requirements for eLearning systems: a systematic literature review and analysis.",
            "Recommending software features for mobile applications based on user interface comparison."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2018",
        "info": "Volume 23, 2018",
        "count": 23,
        "papers": [
            "Requirements for cloud-based BIM governance solutions to facilitate team collaboration in construction projects.",
            "CrowdMock: an approach for defining and evolving web augmentation requirements.",
            "Empirical research in requirements engineering: trends and opportunities.",
            "Continuous clarification and emergent requirements flows in open-commercial software ecosystems.",
            "Effective use of analysts' effort in automated tracing.",
            "Organisation and communication problems in automotive requirements engineering.",
            "An approach for requirements prioritization based on tensor decomposition.",
            "Multi-objective reasoning with constrained goal models.",
            "Analysis of information quality requirements in business processes, revisited.",
            "Four reference models for transparency requirements in information systems.",
            "Direct and mediating influences of user-developer perception gaps in requirements understanding on user participation.",
            "Hazard Relation Diagrams: a diagrammatic representation to increase validation objectivity of requirements-based hazard mitigations.",
            "Editorial special issue RE 2017.",
            "Customer support ticket escalation prediction using feature engineering.",
            "On user rationale in software engineering.",
            "Discovering undocumented knowledge through visualization of agile software development activities.",
            "Improving the identification of hedonic quality in user requirements: a second controlled experiment.",
            "Mending the patchwork of requirements from multiple standards using participative goal modelling: a case in the food industry.",
            "Value-based requirements engineering: method and experience.",
            "Improving the representation of roles in conceptual modeling: theory, method, and evidence.",
            "A method of requirements change analysis.",
            "Goal model analysis of autonomy requirements for Unmanned Aircraft Systems.",
            "Using the AMAN-DA method to generate security requirements: a case study in the maritime domain."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2017",
        "info": "Volume 22, 2017",
        "count": 24,
        "papers": [
            "The role of distances in requirements communication: a case study.",
            "Green software requirements and measurement: random decision forests-based software energy consumption profiling.",
            "Modelling mobile app requirements for semantic traceability.",
            "Engineering requirements for adaptive systems.",
            "Structuring automotive product lines and feature models: an exploratory study at Opel.",
            "Mapping quality requirements for pervasive mobile games.",
            "Repetition between stakeholder (user) and system requirements.",
            "A method of software requirements specification and validation for global software development.",
            "An automated framework for detection and resolution of cross references in legal texts.",
            "Declaratively building behavior by means of scenario clauses.",
            "Reusing functional software requirements in small-sized software enterprises: a model oriented to the catalog of requirements.",
            "Agile requirements handling in a service-oriented taxonomy of capabilities.",
            "Introduction to the RE'16 best papers special issue.",
            "Advancing viewpoint merging in requirements engineering: a theoretical replication and explanatory study.",
            "Extracting conceptual models from user stories with Visual Narrator.",
            "Challenges of working with artifacts in requirements engineering and software engineering.",
            "An exploratory study of Twitter messages about software applications.",
            "Viewpoint: effectiveness of focused mentoring to improve requirements engineering industrial practice.",
            "How to manage IS requirements in complex public sector structures: toward an action design research approach.",
            "Validation of formal specifications through transformation and animation.",
            "A framework for quality assessment of just-in-time requirements: the case of open source feature requests.",
            "Is role playing in Requirements Engineering Education increasing learning outcome?",
            "Understanding requirement prioritization artifacts: a systematic mapping study.",
            "Dealing with software process requirements complexity: an information access proposal based on semantic technologies."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2016",
        "info": "Volume 21, 2016",
        "count": 24,
        "papers": [
            "Using security robustness analysis for early-stage validation of functional security requirements.",
            "Interactive goal model analysis for early requirements engineering.",
            "Exploring cognitive style and task-specific preferences for process representations.",
            "An ASPIRE-based method for quality requirements identification from business goals.",
            "SCRAM-CK: applying a collaborative requirements engineering process for designing a web based e-science toolkit.",
            "Requirements for tools for comprehending highly specialized assembly language code and how to elicit these requirements.",
            "Analyzing and predicting software integration bugs using network analysis on requirements dependency network.",
            "Attribute-based variability in feature models.",
            "Finding and resolving security misusability with misusability cases.",
            "Building a security reference architecture for cloud systems.",
            "Reusable knowledge in security requirements engineering: a systematic mapping study.",
            "A questionnaire-based survey methodology for systematically validating goal-oriented models.",
            "Introduction to the special issue of best papers from RE2015 conference.",
            "On the automatic classification of app reviews.",
            "Ambiguity and tacit knowledge in requirements elicitation interviews.",
            "Detecting, classifying, and tracing non-functional software requirements.",
            "Improving agile requirements: the Quality User Story framework and tool.",
            "Applications of ontologies in requirements engineering: a systematic review of the literature.",
            "A framework for virtual organization requirements.",
            "Bayesian networks for enhancement of requirements engineering: a literature review.",
            "Automating trade-off analysis of security requirements.",
            "Designing and assessing a course on prioritization and importance assessment in strategic non-routine requirements engineering processes.",
            "Workshop videos for requirements communication.",
            "Systems performance prediction using requirements quality attributes classification."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2015",
        "info": "Volume 20, 2015",
        "count": 22,
        "papers": [
            "GaiusT: supporting the extraction of rights and obligations for regulatory compliance.",
            "Reuse of requirements reduced time to market at one industrial shop: a case study.",
            "Roadmapping problems in practice: value creation from the perspective of the customers.",
            "Capturing consumer preferences as requirements for software product lines.",
            "Uni-REPM: a framework for requirements engineering process assessment.",
            "Requirements engineering education: a systematic mapping study.",
            "Early identification of crosscutting concerns with the Language Extended Lexicon.",
            "A descriptive study of Microsoft's threat modeling technique.",
            "Early modeling and validation of timed system requirements using Timed Use Case Maps.",
            "Introduction to the RE'14 special issue.",
            "TiQi: answering unstructured natural language trace queries.",
            "Rationalism with a dose of empiricism: combining goal reasoning and case-based reasoning for self-adaptive software systems.",
            "Leveraging topic modeling and part-of-speech tagging to support combinational creativity in requirements engineering.",
            "On the role of semantics in automated requirements tracing.",
            "On building architecture-centric product line architecture.",
            "A model for tracing variability from features to product-line architectures: a case study in smart grids.",
            "GDIA: Eliciting information requirements in emergency first response.",
            "Conviviality-driven access control policy.",
            "Patterns of continuous requirements clarification.",
            "Artefact-based requirements engineering: the AMDiRE approach.",
            "Establishing requirements for End-user Service Composition tools.",
            "Incorporating usability requirements into model transformation technologies."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2014",
        "info": "Volume 19, 2014",
        "count": 24,
        "papers": [
            "CORAMOD: a checklist-oriented model-based requirements analysis approach.",
            "Comparing the impact of the OO-DFD and the Use Case methods for modeling functional requirements on comprehension and quality of models: a controlled experiment.",
            "System requirements engineering in complex situations.",
            "Guidelines for using UML association classes and their effect on domain understanding in requirements engineering.",
            "Defining qualitative assessing parameters of Iran banks website.",
            "Metrics for measuring the consistencies of requirements with objectives and constraints.",
            "Erratum to: Metrics for measuring the consistencies of requirements with objectives and constraints.",
            "Topsy-turvy requirements.",
            "Time patterns for process-aware information systems.",
            "The role of domain knowledge in requirements elicitation via interviews: an exploratory study.",
            "A requirements data model for product service systems.",
            "Dynamic decision models for staged software product line configuration.",
            "PBURC: a patterns-based, unsupervised requirements clustering framework for distributed agile software development.",
            "Introduction to the RE'13 special issue - RE@21: Keeping Requirements on Track.",
            "On requirement verification for evolving Statecharts specifications.",
            "Visual requirements analytics: a framework and case study.",
            "Eddy, a formal language for specifying and analyzing data flow specifications for conflicting privacy requirements.",
            "Supporting requirements to code traceability through refactoring.",
            "Requirements engineering in software product line engineering.",
            "Requirements-driven incremental adoption of variability management techniques and tools: an industrial experience report.",
            "Evaluating scenario-based SPL requirements approaches: the case for modularity, stability and expressiveness.",
            "A holistic approach to feature modeling for product line requirements engineering.",
            "On the systematic transformation of requirements to specifications.",
            "KMoS-RE: knowledge management on a strategy to requirements engineering."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2013",
        "info": "Volume 18, 2013",
        "count": 20,
        "papers": [
            "Adaptive socio-technical systems: a requirements-based approach.",
            "A framework to measure and improve the quality of textual requirements.",
            "Requirements engineering within a large-scale security-oriented research project: lessons learned.",
            "Uncovering quality-attribute concerns in use case specifications via early aspect mining.",
            "Uni-REPM: validated and improved.",
            "Introduction to the RE'12 special issue.",
            "Managing requirements uncertainty with partial models.",
            "Assessing requirements-related risks through probabilistic goals and obstacles.",
            "A cross-domain empirical study and legal evaluation of the requirements water marking method.",
            "Features meet scenarios: modeling and consistency-checking scenario-based product line specifications.",
            "Comparison and evaluation of goal-oriented satisfaction analysis techniques.",
            "Quantifying the impact of requirements definition and management process maturity on project outcome in large business application development.",
            "Evaluating the effectiveness of the security quality requirements engineering (SQUARE) method: a case study using smart grid advanced metering infrastructure.",
            "Effect of personality type on structured tool comprehension performance.",
            "The illusion of requirements in software development.",
            "Requirements Engineering for Security, Privacy and Services in Cloud Environments.",
            "Evaluating cloud deployment scenarios based on security and privacy requirements.",
            "A framework for enabling trust requirements in social cloud applications.",
            "A pattern-based method for establishing a cloud-specific information security management system - Establishing information security management systems for clouds considering security, privacy, and legal compliance.",
            "Erratum to: A pattern-based method for establishing a cloud-specific information security management system."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2012",
        "info": "Volume 17, 2012",
        "count": 19,
        "papers": [
            "Introduction to the REFSQ 2011 special issue.",
            "Task descriptions versus use cases.",
            "Automotive behavioral requirements expressed in a specification pattern system: a case study at BOSCH.",
            "Enhancing security requirements engineering by organizational learning.",
            "Industry needs and research directions in requirements engineering for embedded systems.",
            "Introduction to the RE'11 special issue: requirements in motion.",
            "Power and politics in requirements engineering: embracing the dark side?",
            "A legal cross-references taxonomy for reasoning about compliance requirements.",
            "Early failure prediction in feature request management systems: an extended study.",
            "Towards an understanding of the causes and effects of software requirements change: two case studies.",
            "Comparing task practicing and prototype fidelities when applying scenario acting to elicit requirements.",
            "The effectiveness of an optimized EPMcreate as a creativity enhancement technique for Web site requirements elicitation.",
            "Constructing high quality use case models: a systematic review of current practices.",
            "Using conceptual models to explore business-ICT alignment in networked value constellations - Case studies from the Dutch aviation industry, Spanish electricity industry and Dutch telecom industry.",
            "Exploring the impact of software requirements on system-wide goals: a method using satisfaction arguments and i* goal modelling.",
            "Quality requirements engineering for systems and software architecting: methods, approaches, and tools.",
            "Deriving software architectural models from requirements models for adaptive systems: the STREAM-A approach.",
            "Setting quality targets for coming releases with QUPER: an industrial case study.",
            "An integrated strategy to systematically understand and manage quality in use for web applications."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2011",
        "info": "Volume 16, 2011",
        "count": 19,
        "papers": [
            "Digital privacy: theory, policies and technologies.",
            "A privacy threat analysis framework: supporting the elicitation and fulfillment of privacy requirements.",
            "Commitment analysis to operationalize software requirements from privacy policies.",
            "The \"Panopticon\" of search engines: the response of the European data protection framework.",
            "A methodology for security assurance-driven system development.",
            "A systematic review of transformation approaches between user requirements and analysis models.",
            "Goal-driven risk assessment in requirements engineering.",
            "Supporting agile software development through active documentation.",
            "Integrating ontologies, model driven, and CNL in a multi-viewed approach for requirements engineering.",
            "Introduction to the RE'10 special issue Requirements Engineering in a multi-faceted World.",
            "Analysing anaphoric ambiguity in natural language requirements.",
            "Utilizing Event-B for domain engineering: a critical analysis.",
            "Application of swarm techniques to requirements tracing.",
            "Representing and reasoning about preferences in requirements engineering.",
            "Relevance-based abstraction identification: technique and evaluation.",
            "Experience with user-centred requirements engineering.",
            "Modeling stakeholders for information systems design processes.",
            "WebSpec: a visual language for specifying interaction and navigation requirements in web applications.",
            "On eliciting requirements from end-users in the ICT4D domain."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2010",
        "info": "Volume 15, 2010",
        "count": 22,
        "papers": [
            "Guest editorial: security requirements engineering: past, present and future.",
            "A comparison of security requirements engineering methods.",
            "A vulnerability-centric requirements engineering framework: analyzing security attacks, countermeasures, and requirements based on vulnerabilities.",
            "Eliciting security requirements and tracing them to design: an integration of Common Criteria, heuristics, and UMLsec.",
            "A UML-based static verification framework for security.",
            "Evaluating existing security and privacy requirements for legal compliance.",
            "Introduction to the RE'09 special issue.",
            "Visual syntax does matter: improving the cognitive effectiveness of the i* visual notation.",
            "RELAX: a language to address uncertainty in self-adaptive systems requirement.",
            "Modeling and detecting semantic-based interactions in aspect-oriented scenarios.",
            "A controlled experiment to assess the impact of system architectures on new system requirements.",
            "Deconstructing the semantics of big-step modelling languages.",
            "Understanding the human context in requirements elicitation.",
            "Developing comprehensive acceptance tests from use cases and robustness diagrams.",
            "On confusion between requirements and their representations.",
            "Assessing traceability of software engineering artifacts.",
            "When-to-release decisions for features with time-dependent value functions.",
            "An approach to capture authorisation requirements in business processes.",
            "An integrated approach for requirement selection and scheduling in software release planning.",
            "A framework to improve communication during the requirements elicitation process in GSD projects.",
            "Semantic decoupling: reducing the impact of requirement changes.",
            "A goal-based framework for contextual requirements modeling and analysis."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2009",
        "info": "Volume 14, 2009",
        "count": 16,
        "papers": [
            "Validating software requirements with enactable use case descriptions.",
            "A semiotic analysis of unified modeling language graphical notations.",
            "An integrated domain analysis approach for teleoperated systems.",
            "Designing socio-technical systems: from stakeholder goals to social networks.",
            "Guest Editor's Introduction.",
            "Towards automated requirements prioritization and triage.",
            "Exploring how to use scenarios to discover requirements.",
            "Linking business and requirements engineering: is solution planning a missing activity in software product companies?",
            "Methodologies to evolve formal specifications through refinement and retrenchment in an analysis-revision cycle.",
            "Technology transfer decision support in requirements engineering research: a systematic review of REj.",
            "Investigating business-IT alignment through multi-disciplinary goal concepts.",
            "Requirements engineering for multi-channel services: the SEB method and its application to a multi-channel bank.",
            "Introduction to the RE'08 special issue.",
            "A search based approach to fairness analysis in requirement assignments to aid negotiation, mediation and decision making.",
            "Formal semantic conflict detection in aspect-oriented requirements.",
            "Experiential learning approach for requirements engineering education."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2008",
        "info": "Volume 13, 2008",
        "count": 15,
        "papers": [
            "Generating Natural Language specifications from UML class diagrams.",
            "Advanced product planning: a comprehensive process for systemic definition of new product requirements.",
            "An approach to engineering the requirements of data warehouses.",
            "MOQARE: misuse-oriented quality requirements engineering.",
            "Clear justification of modeling decisions for goal-oriented requirements engineering.",
            "A case study validation of a knowledge-based approach for the selection of requirements engineering techniques.",
            "Sensitivity analysis in the process of COTS mismatch-handling.",
            "A cognitive semantics for the association construct.",
            "Composing requirements specifications from multiple prioritized sources.",
            "Requirements for tools for ambiguity identification and measurement in natural language requirements specifications.",
            "Addressing privacy requirements in system design: the PriS method.",
            "Portraying the practice of decision-making in requirements engineering: a case of large scale bespoke development.",
            "Method for stakeholder identification in interorganizational environments.",
            "Managing requirements inter-dependency for software product line derivation.",
            "The case against a positivist philosophy of requirements engineering."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2007",
        "info": "Volume 12, 2007",
        "count": 14,
        "papers": [
            "Analogy-based domain analysis approach to software reuse.",
            "A domain model of Web recommender systems based on usage mining and collaborative filtering.",
            "Using obstacle analysis to identify contingency requirements on an unpiloted aerial vehicle.",
            "Introduction to the RE'06 special issue.",
            "Multi-level feature trees.",
            "Requirement progression in problem frames: deriving specifications from requirements.",
            "Automated classification of non-functional requirements.",
            "Business analysis and requirements engineering: the same, only different?",
            "Ten years of Australian workshop on requirements engineering.",
            "The future of information systems engineering.",
            "Web-based systems design: a study of contemporary practices and an explanatory framework based on \"method-in-action\".",
            "Design and implementation of a smart system for personalization and accurate selection of mobile services.",
            "Cognitive complexity in data modeling: causes and recommendations.",
            "Unified use case statecharts: case studies."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2006",
        "info": "Volume 11, 2006",
        "count": 22,
        "papers": [
            "Good requirements practices are neither necessary nor sufficient.",
            "Requirements engineering for e-business advantage.",
            "A requirements monitoring framework for enterprise systems.",
            "Requirements quality control: a unifying framework.",
            "Situational method engineering: combining assembly-based and roadmap-driven approaches.",
            "Requirements Abstraction Model.",
            "Requirements engineering paper classification and evaluation criteria: a proposal and a discussion.",
            "The RE'04 conference.",
            "COTS tenders and integration requirements.",
            "Goal and scenario validation: a fluent combination.",
            "Using trust assumptions with security requirements.",
            "Aybüke Aurum and Claes Wohlin (eds): Engineering and managing software requirements.",
            "Introduction to the best research papers from RE'05.",
            "PC-RE: a method for personal and contextual requirements engineering with some experience.",
            "View merging in the presence of incompleteness and inconsistency.",
            "A requirements engineering framework for cross-organizational ERP systems.",
            "Feature-driven requirement dependency analysis and high-level software design.",
            "On generic method models.",
            "Guidelines for the incremental identification of aspects in requirements specifications.",
            "Requirements engineering in health care: the example of chemotherapy planning in paediatric oncology.",
            "Articulation of information requirements for personalised knowledge construction.",
            "The methodological soundness of requirements engineering papers: a conceptual framework and two case studies."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2005",
        "info": "Volume 10, 2005",
        "count": 26,
        "papers": [
            "Scenario inspections.",
            "Scenario-based requirements analysis techniques for real-time software systems: a comparative evaluation.",
            "Eliciting security requirements with misuse cases.",
            "An operational model for structuring the requirements generation process.",
            "The system reliability analyser tool.",
            "Is object-oriented requirements engineering of interest?",
            "Testing the predictive ability of a requirements pattern language.",
            "ISRE: immersive scenario-based requirements engineering with virtual prototypes.",
            "Supporting scenario evolution.",
            "Scenario advisor tool for requirements engineering.",
            "Ontology based object-oriented domain modelling: fundamental concepts.",
            "Experience of using a lightweight formal specification method for a commercial embedded system product line.",
            "Coordinated development of business processes and their support systems.",
            "Basic notions regarding business processes and supporting information systems.",
            "Measuring the fitness relationship.",
            "Business alignment: using process mining as a tool for Delta analysis and conformance testing.",
            "Delta analysis with workflow logs: aligning business process prescriptions and their reality.",
            "Managing context in business process management systems.",
            "Is emotion relevant to requirements engineering?",
            "Guest editorial: 10th anniversary workshop on Requirements Engineering: Foundation for Software Quality (REFSQ'2004).",
            "Communication gaps in a tender process.",
            "Applying a pragmatics-based creativity-fostering technique to requirements elicitation.",
            "Generating requirements from systems models using patterns: a case study.",
            "Improving the detection of requirements discordances among stakeholders.",
            "Requirements researchers: are we really doing research?.",
            "Agile or analytic? Book reviews: Cohn versus Lavi and Kudish."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2004",
        "info": "Volume 9, 2004",
        "count": 20,
        "papers": [
            "Eliciting gaps in requirements change.",
            "A goal-driven and agent-based requirements engineering framework.",
            "Market research for requirements analysis using linguistic tools.",
            "An exploratory study into whether to or not to include users in the development of industrial hypermedia applications.",
            "User's manual as a requirements specification: case studies.",
            "Introduction to the RE'03 Special Issue.",
            "Goal-driven requirements analysis for hypermedia-intensive Web applications.",
            "Deriving tabular event-based specifications from goal-oriented requirements models.",
            "Acquiring and incorporating state-dependent timing requirements.",
            "Specifying and analyzing early requirements in Tropos.",
            "Erratum: Market research for requirements analysis using linguistic tools.",
            "Empirical comparisons of animation and narration in requirements validation.",
            "A requirements taxonomy for reducing Web site privacy vulnerabilities.",
            "Selecting CRM packages based on architectural, functional, and cost requirements: Empirical validation of a hierarchical ranking model.",
            "Development of a computer-based interviewing tool to enhance the requirements gathering process.",
            "Hierarchical entity-relationship diagrams: the model, method of creation and experimental evaluation.",
            "Are use case and class diagrams complementary in requirements analysis? An experimental study on use case and class diagrams in UML.",
            "Relationship analysis in requirements engineering.",
            "A framework for empirical evaluation of conceptual modeling techniques.",
            "The effect of the number of concepts on the readability of schemas: an empirical study with data models."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2003",
        "info": "Volume 8, 2003",
        "count": 26,
        "papers": [
            "Requirements Engineering editorial.",
            "Online First publication.",
            "Guest editorial.",
            "Continuous requirements management for organisation networks: a (dis)trust-based approach.",
            "An exploratory study of facilitation in distributed requirements engineering.",
            "Structuring product family requirements for n-dimensional and hierarchical product lines.",
            "Managing the requirements engineering process.",
            "The influence of formal representation on solution specification.",
            "Interactions among dynamic sets of objects.",
            "Promoting software quality through a human, social and organisational requirements elicitation process.",
            "Web system requirements: an overview.",
            "Value-based requirements engineering: exploring innovative e-commerce ideas.",
            "Viewpoints: Hidden skills that support phased and agile requirements engineering.",
            "More requirements engineering adventures with building contractors.",
            "Editorial: RE'02: The birth of a new flagship conference in requirements engineering.",
            "RE challenges in multi-site software development organisations.",
            "Applications of linguistic techniques for use case analysis.",
            "Automating performance-related impact analysis through event based traceability.",
            "Viewpoints: Requirements honesty.",
            "Editorial: model-based requirements engineering.",
            "Merging individual conceptual models of requirements.",
            "Lightweight models for interpreting informal specifications.",
            "Arcade: early dynamic property evaluation of requirements using partitioned software architecture models.",
            "An economic approach for improving requirements negotiation models with inspection.",
            "Quantitative risk-based requirements reasoning.",
            "Retrenching partial requirements into system definitions: a simple feature interaction case study."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2002",
        "info": "Volume 7, 2002",
        "count": 21,
        "papers": [
            "Editorial: Seventh International Workshop on Requirements Engineering: Foundation for Software Quality (REFSQ'01).",
            "Rationale-Based Use Case Specification.",
            "A Feasibility Study of Automated Natural Language Requirements Analysis in Market-Driven Development.",
            "Round-Trip Prototyping Based on Integrated Functional and User Interface Requirements Specifications.",
            "Effective Communication in Requirements Elicitation: A Comparison of Methodologies.",
            "Requirements Engineering-Based Conceptual Modelling.",
            "WIRES: A Methodology for Developing Workflow Applications.",
            "viewpoints: Requirements Researchers: Do We Practice What We Preach?",
            "Requirements Engineering and Technology Transfer: Obstacles, Incentives and Improvement Agenda.",
            "Workflow Requirements Modelling Using XML.",
            "Release Planning in Market-Driven Software Product Development: Provoking an Understanding.",
            "Large-Scale Requirements Analysis Revisited: The need for Understanding the Political Ecology of Requirements Engineering.",
            "viewpoints: Domain Understanding is the Key to Successful System Development.",
            "Guest Editorial: Requirements Engineering for Information Security.",
            "Authorisation Requirements on a Budget.",
            "An Approach to Security Requirements Engineering for a High Assurance System.",
            "A Software Fault Tree Approach to Requirements Analysis of an Intrusion Detection System.",
            "Guest Editorial: Special Issue on Model Checking in Requirements Engineering.",
            "Toward Automation for Model-Checking Requirements Specifications with Numeric Constraints.",
            "Requirements-Level Semantics and Model Checking of Object-Oriented Statecharts.",
            "Automatically Detecting and Visualising Errors in UML Diagrams."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2001",
        "info": "Volume 6, 2001/2002",
        "count": 19,
        "papers": [
            "Sixth International Workshop on Requirements Engineering: Foundation for Software Quality (REFSQ'00) - Editorial.",
            "Coupling Use Cases and Class Models as a Means for Validation and Verification of Requirements Specifications.",
            "From Non-Functional Requirements to Design through Patterns.",
            "Preventing Requirement Defects: An Experiment in Process Improvement.",
            "An Industrial Case Study on Distributed Prioritisation in Market-Driven Requirements Engineering for Packaged Software.",
            "Deriving Goals from a Use-Case Based Requirements Specification.",
            "Making Workflow Change Acceptable.",
            "A Framework for Integrating Non-Functional Requirements into Conceptual Models.",
            "A Framework for Component Reuse in a Metamodelling-Based Software Development.",
            "Software Requirements Engineering: The Need for Systems Engineering and Literacy.",
            "Engineering Methods from Method Requirements Specifications.",
            "A Tool to Support Collaborative Software Requirements Management.",
            "Using Influence Diagrams to Aid the Management of Software Change.",
            "Modelling Off-the-Shelf Information Systems Requirements: An Ontological Approach.",
            "Back to Basics.",
            "Requirements Reuse for Improving Information Systems Security: A Practitioner's Approach.",
            "Requirements Determination: An Information Systems Specialist Perspective of Process Quality.",
            "Goal-Oriented Requirements Engineering: A Unifying Framework.",
            "On Abstraction in Scenarios."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "2000",
        "info": "Volume 5, 2000",
        "count": 21,
        "papers": [
            "Scenario Analysis in an Automated Tool for Requirements Engineering.",
            "A Unifying Framework for Representing Structural and Operational Aspects of Electricity Sector Deregulation.",
            "A Scenario Construction Process.",
            "What's Different about Requirements Engineering for Web Sites?",
            "Socio-Technical and Soft Approaches to Information Requirements Elicitation in the Post-Methodology Era.",
            "There's More to Information Systems Development than Structured Approaches: Information Requirements Analysis as a Socially Mediated Process.",
            "Healthcare Modelling through Role Activity Diagrams for Process-Based Information Systems Development.",
            "Negotiating and Understanding Information Systems Requirements: The Use of Set Diagrams.",
            "Specifications in Context: Stakeholders, Systems and Modelling of Conflict.",
            "Linguistic Problems with Requirements and Knowledge Elicitation.",
            "A Socio-Technical Approach to Systems Design.",
            "Requirements Management: A Cinderella Story.",
            "Time Aspects in Requirements Engineering: Or 'Every Cloud Has A Silver Lining'.",
            "Modelling and Representation of Uncertain Temporal Information.",
            "Patterns Approach to Product Information Systems Engineering.",
            "Bridging the Gap Between Organisational Needs and ERP Functionality.",
            "Requirements Engineering: Is it 'Mission Impossible'?",
            "An Experimental Investigation into the Effectiveness of OOA for Specifying Requirements.",
            "Specifying and Analysing System-Level Inter-Component Interfaces.",
            "A Method for Extracting and Stating Software Requirements that a User Interface Prototype Contains.",
            "Jane Austen - Requirements in Another World."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "1999",
        "info": "Volume 4, 1999",
        "count": 20,
        "papers": [
            "A Methodology for Constructing User-Oriented Requirements Specifications for Large-Scale Systems Using Electronic Hypermedia.",
            "Behavioural Views for Software Requirements Engineering.",
            "Seven-Layer Model of the Role of the Facilitator in Requirements Engineering.",
            "False Requirements Express Real Needs - Viewpoint.",
            "LEO: The Incredible Story of the World's First Business Computer - Book Review.",
            "Guest Editorial: Managing Dynamic Requirements.",
            "Engineering Requirements Through Use Cases in Complex Business Environment.",
            "The Spiral of Change Model for Coping with Changing and Ongoing Requirements.",
            "Requirements Engineering, Soft Systems Methodology and Workforce Empowerment.",
            "A Qualitative Scenario Approach to Managing Evolving Requirements.",
            "The Importance of Context in Information System Design: An Assessment of Participatory Design.",
            "Practical Experience with Viewpoint-Oriented Requirements Specification.",
            "Tracing Requirements Errors to Problems in the Requirements Engineering Process.",
            "Using Design Explanation within the Formal Object-Oriented Method.",
            "On the Architectonics of Requirements - Viewpoint.",
            "A Multi-Model View of Process Modelling.",
            "Formal Analysis of Memory Requirements.",
            "Animating Formal Specifications with Inheritance in a DL-Based Framework.",
            "Information Systems Curricula Evaluated by a Method Engineering Framework.",
            "Is There Such a Thing as a User Requirement? - Viewpoint."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "1998",
        "info": "Volume 3, 1998",
        "count": 7,
        "papers": [
            "Guest Editorial: Interdisciplinary Uses of Scenarios.",
            "Scenario Management: An Interdisciplinary Approach.",
            "Scenario Development and Practical Decision Making under Uncertainty: Application to Requirements Engineering.",
            "Scenario-Based Analysis of COTS Acquisition Impacts.",
            "Scenario-Based Techniques for Supporting the Elaboration and the Validation of Formal Requirements.",
            "A Representational Framework for Scenarios of System Use.",
            "Software and House Requirements Engineering: Lessons Learned in Combating Requirements Creep - Viewpoint."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "1997",
        "info": "Volume 2, 1997",
        "count": 17,
        "papers": [
            "Soft Information Systems and Technologies Methodology, SISTeM: A Case Study on Developing the Electronic Patient Record.",
            "Towards a Formal Definition of Methods.",
            "Improving Practical Support for Large-scale Requirement Prioritising.",
            "Last Words on the (Project) Flight Recorder: A Plea for User Requirments.",
            "Integrated Safety Analysis of Requirements Specifications.",
            "A Use Case Driven Requirements Engineering Process.",
            "Telecommunications Service Requirements: Principles for Managing Complexity.",
            "Ten Steps Towards Systematic Requirements Reuse.",
            "Modelling and Engineering the Requirements Engineering Process: An Overview of the NATURE Approach.",
            "Incremental Requirements Specification with LOTOS.",
            "The Performance of the N-Fold Requirement Inspection Method.",
            "Towards the engineering of Requirements.",
            "On the Use of a Formal Requirements Engineering Language: The Generalized Railroad Crossing Problem.",
            "Enhancing a Requirements Baseline with Scenarios.",
            "Constructing and Revising Formal Arguments in Requirements Engineering.",
            "Requirements Engineering Needs Total Systems Engineering.",
            "Book Review."
        ]
    },
    {
        "name": "Requirements Engineering",
        "year": "1996",
        "info": "Volume 1, 1996",
        "count": 18,
        "papers": [
            "Editorial.",
            "User Participation in the Requirements Engineering Process: An Empirical Study.",
            "A Model for a Causal Logic for Requirements Engineering.",
            "Analysis of an Inventory of Information Systems in the Public Administration.",
            "Requirements Engineering Research: Coordination and Infrastructure (Review Article).",
            "Conflicting Requirements: When the Customer is Not Always Right.",
            "Requirements Capture And Analysis: A Survey of Current Practice.",
            "Stakeholder Viewpoints in Requirements Definition: A Framework for Understanding Viewpoint Development Approaches.",
            "Formal Analysis of the Shlaer-Mellor Method: Towards a Toolkit of Formal and Informal Requirements Specification Techniques.",
            "The Perfect Requirement Myth.",
            "A Requirements Engineering Environment within a Tightly-Integrated SDE.",
            "Multi-perspective Requirements Engineering within NATURE.",
            "A Conceptual Framework for Requirements Engineering.",
            "What's Wrong with Requirements Management Tools?",
            "Expressing Requirements on a Parallel System Formally.",
            "Utilizing Deonetic Operators in Information Systems Specification.",
            "Dealing with Change: An Approach Using Non-functional Requirements.",
            "Demanding Solutions."
        ]
    }
]