[
    {
        "year": "2021",
        "name": "18th IEEE SCC 2021",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2021",
                "sub_name": "IEEE International Conference on Services Computing, SCC 2021, Chicago, IL, USA, September 5-10, 2021.",
                "count": 56,
                "papers": [
                    "Clams: A Cloud Application Modeling Solution.",
                    "Regulation-as-a-Service: Model Checking for Decision-Making Behaviors in Price-Sensitive Service Systems.",
                    "DCrowd: A Decentralized Service Model for Credible Crowdsourcing Based on Game Theory and Smart Contracts.",
                    "Word Embedding-based Web Service Representations for Classification and Clustering.",
                    "Challenges and Opportunities in Space Service Computing.",
                    "P-DecSerFlow: A Conceptual Framework to Model Services Interactions for Standardized Service Oriented Architecture.",
                    "Relaxing the Sky: Handling Hard User Constraints in Skyline Service Selection.",
                    "Modeling Multi-Attribute and Implicit Relationship Factors for Collaborative Filtering Recommender System.",
                    "Towards Representing Time-Cost Tradeoffs for Service Compositions.",
                    "Analyzing GDPR compliance in Cloud Services' privacy policies using Textual Fuzzy Interpretive Structural Modeling (TFISM).",
                    "DCAB: An Effective Data Collection and Analysis Service for Blockchain.",
                    "Deep Reinforcement Learning for Dynamic Workflow Scheduling in Cloud Environment.",
                    "Toward an Enterprise-ready Composable Infrastructure as a Service.",
                    "Definition and Induction of a Specification Order Relation between Capabilities.",
                    "Constructing a Creative Software with Services.",
                    "Ensemble Learning-based Fake News and Disinformation Detection System.",
                    "A Constraint-aware Ridesharing Service Guaranteeing Quality-of-Service for Smart Cities.",
                    "A Hybrid Approach to News Recommendation Based on Knowledge Graph and Long Short-Term User Preferences.",
                    "EPF4M: An Evolution-Oriented Programming Framework for Microservices.",
                    "Dual-Target Cross-Domain Bundle Recommendation.",
                    "Dialogue-based Continuous Update of User Portraits.",
                    "Security Certification Scheme for Content-centric Networks.",
                    "A Resilient Fog-IoT Framework for Seamless Microservice Execution.",
                    "Task Offloading and Resource Allocation for Container-enabled Mobile Edge Computing.",
                    "A Text Mining based Method for Policy Recommendation.",
                    "Distributed Service Placement and Workload Orchestration in a Multi-access Edge Computing Environment.",
                    "Edge Intelligence as a Service.",
                    "Service Ecosystem: A Lens of Smart Digital Society.",
                    "Distributed Service Composition in Internet of Services.",
                    "Adaptive Alternating Stochastic Gradient Descent Algorithms for Large-Scale Latent Factor Analysis.",
                    "Toward Mobile Application of Cyber Argumentation with Social Networking.",
                    "Code Will Speak: Early detection of Ponzi Smart Contracts on Ethereum.",
                    "Dynamic Transaction Storage Strategies for a Sustainable Blockchain.",
                    "An SRAM Optimized Approach for Constant Memory Consumption and Ultra-fast Execution of ML Classifiers on TinyML Hardware.",
                    "Remote Attestation as a Service for Edge-Enabled IoT.",
                    "A Framework for Enabling Cyber-Twins based Industry 4.0 Application Development.",
                    "On Analysis of Security and Elasticity Dependency in IIoT Platform Services.",
                    "Industry 4.0 and Lean Business Operations.",
                    "Sliceable Monolith: Monolith First, Microservices Later.",
                    "Smart Journey Mining for Improved Service Quality.",
                    "Formal Modeling and Verification of Property-based Resource Consumption Cycles.",
                    "A SOAF model extension for incorporating user feedback and preference to improve social service discovery.",
                    "A Constraint Satisfaction Service Composition Method Supporting One to Many Task Pattern.",
                    "Context-aware Artificial Internet-of-Things Application Deployment in Edge-Cloud Systems.",
                    "Scaling up Mobile Service Selection in Edge Computing Environment with Cuckoo Optimization Algorithm.",
                    "ATeDLW: Intelligent Detection of Abnormal Trajectory in Ship Data Service System.",
                    "Hire me fairly: towards dynamic resource-binding with smart contracts.",
                    "An Accountability-Oriented Generation approach to Time-Varying Structure of Cloud Service.",
                    "Evaluation of API Request Bundling and its Impact on Performance of Microservice Architectures.",
                    "Semi-automated Modelling of Optimized BPMN Processes.",
                    "Enabling Cross-Jurisdiction Digital Asset Transfer.",
                    "SRAUT: Service Resource Availability analysis method with User Tolerance concern.",
                    "Cloud as platform for monetizing complementary data for AI-driven services: A two-sided cooperative game.",
                    "Multi-objective Sparrow Search Optimization for Task Scheduling in Fog-Cloud-Blockchain Systems.",
                    "Quantum Computing for Supply Chain Finance.",
                    "Toward Scalable Artificial Intelligence in Finance."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th IEEE SCC 2020",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2020",
                "sub_name": "2020 IEEE International Conference on Services Computing, SCC 2020, Beijing, China, November 7-11, 2020.",
                "count": 67,
                "papers": [
                    "A Framework for Situation-Aware Access Control in Federated Data-as-a-Service Systems Based on Query Rewriting.",
                    "Research on the Synecological Model and Dynamic Evolution Mechanism of Service Internet.",
                    "A Scenario-based Modeling Method for Crossover Services.",
                    "Bringing Semantics to Support Ocean FAIR Data Services with Ontologies.",
                    "Service Pattern Modeling and Simulation: A Case Study of Rural Taobao.",
                    "A Swarm-based Approach for Function Placement in Federated Edges.",
                    "A Pre-joined Service Composition Approach with Dynamic Services in a Graph Database.",
                    "Personality Traits Prediction Based on Users' Digital Footprints in Social Networks via Attention RNN.",
                    "Characterizing Service Access Patterns under Heterogeneous Clients.",
                    "BSE-MAML: Model Agnostic Meta-Reinforcement Learning via Bayesian Structured Exploration.",
                    "The Research of Link Prediction in Knowledge Graph based on Distance Constraint.",
                    "D-colSimulation: A Distributed Approach for Frequent Graph Pattern Mining based on colSimulation in a Single Large Graph.",
                    "MLP4ML: Machine Learning Service Recommendation System using MLP.",
                    "A Knowledge Graph Approach to Mashup Tag Recommendation.",
                    "Graph Neural Network and Multi-view Learning Based Mobile Application Recommendation in Heterogeneous Graphs.",
                    "SEED: Confidential Big Data Workflow Scheduling with Intel SGX Under Deadline Constraints.",
                    "OpenDT: A Reference Framework for Service Publication and Discovery using Remote Programmable Digital Twins.",
                    "Integrated Topic Modeling and User Interaction Enhanced WebAPI Recommendation using Regularized Matrix Factorization for Mashup Application Development.",
                    "A Survey of Modern Scientific Workflow Scheduling Algorithms and Systems in the Era of Big Data.",
                    "Data Provenance for Complex Event Processing Invoking Composition of Services.",
                    "A Meta Model for Mining Processes from Email Data.",
                    "A Predictive-Trend-Aware and Critical-Path-Estimation-Based Method for Workflow Scheduling Upon Cloud Services.",
                    "Bootstrapping Natural Language Querying on Process Automation Data.",
                    "A Process Convergence Approach for Crossover Services based on Message Flow Partition and Merging.",
                    "Survey on Requirement-Driven Microservice System Evolution.",
                    "MV4MS: A Spring Cloud based Framework for the Co-Deployment of Multi-Version Microservices.",
                    "Selection of Cloud Service Providers for Hosting Web Applications in a Multi-cloud Environment.",
                    "Event-based Detection of Changes in IaaS Performance Signatures.",
                    "Dynamic Task Allocation for Cost-Efficient Edge Cloud Computing.",
                    "PETA: Privacy Enabled Task Allocation.",
                    "A Temporal-Spatial-Domain Distribution Model and Alignment Method for Quality Attributes.",
                    "Seeding-Based Multi-Objective Evolutionary Algorithms for Multi-Cloud Composite Applications Deployment.",
                    "A Distance-based Genetic Algorithm for Robust Data-intensive Web Service Composition in Dynamic Bandwidth Environment.",
                    "GPSO: A Graph-based Heuristic Algorithm for Service Function Chain Placement in Data Center Networks.",
                    "Analytics on Health of Mobile Software Ecosystem Based on the Internal Operating Mechanism.",
                    "Credible and Online QoS Prediction for Services in Unreliable Cloud Environment.",
                    "Diversified QoS-Centric Service Recommendation for Uncertain QoS Preferences.",
                    "QoS-aware Automatic Service Composition Based on Service Execution Timeline with Multi-objective Optimization.",
                    "Incentive-Based Selection and Composition of IoT Energy Services.",
                    "An IoT-owned Service for Global IoT Device Discovery, Integration and (Re)use.",
                    "Fine-grained Conflict Detection of IoT Services.",
                    "Fluid Composition of Intermittent IoT Energy Services.",
                    "A Novel Data-to-Text Generation Model with Transformer Planning and a Wasserstein Auto-Encoder.",
                    "FDA-VeD: A Future-Demand-Aware Vehicle Dispatching Service.",
                    "Ponzi Contracts Detection Based on Improved Convolutional Neural Network.",
                    "Suitability-based Task Assignment in Crowdsourcing Markets.",
                    "App Competition Matters: How to Identify Your Competitor Apps?",
                    "Blockchain-based controlled information sharing in inter-organizational workflows.",
                    "DeepRouting: A Deep Neural Network Approach for Ticket Routing in Expert Network.",
                    "Adaptive Request Scheduling for Device Cloud.",
                    "User Portraits and Investment Planning Based on Accounting Data.",
                    "An Empirical Study of an Open Ecosystem Model for Inclusive Financial Services.",
                    "Detecting Artifact Anomalies in Microservice-Based Financial Applications.",
                    "A Blockchain-based Trustworthy Certification Process for Composite Services.",
                    "Temporal-spatial-domanial features oriented modeling framework for Transboundary Service.",
                    "JTang Dubhe: a Service Pattern Modeling and Analysis System.",
                    "Domain Priori Knowledge based Integrated Solution Design for Internet of Services.",
                    "Hybrid Architecture for Handwriting Perceptual Service based on Edge Computing.",
                    "Multi-factor-based Motion Detection for Server Rack Doors Left Open.",
                    "Automatic Cross-City API Matching for Urban Service Collaboration Based on Semantics.",
                    "A Service Computing Framework for Proteomics Analysis and Collaboration of Pathogenic Mechanism Studies.",
                    "Summarization of Multidimensional Process Traces for Analysis under Edit-distance Constraints.",
                    "Novel EEG Risk Framework to Identify Insider Threats in National Critical Infrastructure Using Deep Learning Techniques.",
                    "Towards a Methodology for creating Internet of Things (IoT) Applications based on Microservices.",
                    "desc2tag: A Reinforcement Learning Approach to Mashup Tag Recommendation.",
                    "An Ethical Multi-Stakeholder Recommender System Based on Evolutionary Multi-Objective Optimization.",
                    "A Reference Method for Performance Evaluation in Big Data Architectures."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th IEEE SCC 2019",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2019",
                "sub_name": "2019 IEEE International Conference on Services Computing, SCC 2019, Milan, Italy, July 8-13, 2019.",
                "count": 36,
                "papers": [
                    "Regularizing Matrix Factorization with Implicit User Preference Embeddings for Web API Recommendation.",
                    "Helpfulness-Aware Matrix Factorization for Cross-Category Service Recommendations.",
                    "Recommending Energy-Efficient Data Mining Services with Data as Contextual Factors.",
                    "Service Placement in Fog Computing Using Constraint Programming.",
                    "Fog Function: Serverless Fog Computing for Data Intensive IoT Services.",
                    "Engineering Resilient Collaborative Edge-Enabled IoT.",
                    "Trustworthy IoT: An Evidence Collection Approach Based on Smart Contracts.",
                    "Increased Fault-Tolerance and Real-Time Performance Resiliency for Stream Processing Workloads through Redundancy.",
                    "Your Containers Should be WYSIWYG.",
                    "A Container Scheduling Strategy Based on Machine Learning in Microservice Architecture.",
                    "Context-Aware Multi-QoS Prediction for Services in Mobile Edge Computing.",
                    "F-LaaS: A Control-Flow-Attack Immune License-as-a-Service Model.",
                    "FlashGhost: Data Sanitization with Privacy Protection Based on Frequent Colliding Hash Table.",
                    "Helping Users Managing Context-Based Privacy Preferences.",
                    "FM4SN: A Feature-Oriented Approach to Tenant-Driven Customization of Multi-Tenant Service Networks.",
                    "An Online Personalized Reputation Estimation Model for Service-Oriented Systems.",
                    "Set-Covering Theory-Based Data Placement Cost Optimization for Online Social Networks.",
                    "NLSC: Unrestricted Natural Language-Based Service Composition through Sentence Embeddings.",
                    "Enhancing Monitoring Queries Invoking Composition of Services.",
                    "On the Design and Architecture of Deployment Pipelines in Cloud- and Service-Based Computing - A Model-Based Qualitative Study.",
                    "A Genetic-Based Approach to Location-Aware Cloud Service Brokering in Multi-Cloud Environment.",
                    "A Transactional Approach for Reliable Elastic Cloud Resources.",
                    "Towards a Democratic Federation for Infrastructure Service Provisioning.",
                    "Overlapping Analytic Stages in Online Process Mining.",
                    "Novel Discovery Mechanism for Crossing-Workflow Fragments Leveraging Activity Relevance.",
                    "Leveraging Shallow Machine Learning to Predict Business Process Behavior.",
                    "Service Recommendation Based on Attentional Factorization Machine.",
                    "A POI-Sensitive Knowledge Graph Based Service Recommendation Method.",
                    "QF-RNN: QI-Matrix Factorization Based RNN for Time-Aware Service Recommendation.",
                    "Towards Risk-Aware Cost-Optimal Resource Allocation for Cloud Applications.",
                    "Dynamic Data Routing Decisions for Compliant Data Handling in Service-and Cloud-Based Architectures: A Performance Analysis.",
                    "Enhancing Availability of Traffic-Aware Virtual Cluster Allocation in Cloud Datacenters.",
                    "Situation-Aware Access Control in Federated Data-as-a-Service for Maritime Search and Rescue.",
                    "Facilitating the Support of Cloud-Based Service Marketplaces.",
                    "Ephemeral Data Handling in Microservices.",
                    "Winnability Prediction for IT Services Bids."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th IEEE SCC 2018",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2018",
                "sub_name": "2018 IEEE International Conference on Services Computing, SCC 2018, San Francisco, CA, USA, July 2-7, 2018.",
                "count": 46,
                "papers": [
                    "A Prior Knowledge Based Approach to Improving Accuracy of Web Services Clustering.",
                    "Rule-Based Model for Smart Building Supervision and Management.",
                    "Framework for Building Self-Adaptive Component Applications Based on Reinforcement Learning.",
                    "A Client MicroServices Automatic Collaboration Framework Based on Fine-Grained APP.",
                    "A Holistic Evaluation of Docker Containers for Interfering Microservices.",
                    "Towards Executable Specifications for Microservices.",
                    "Modeling Sentiment Polarity in Support Ticket Data for Predicting Cloud Service Subscription Renewal.",
                    "A System for Predicting Health of an E-Contract.",
                    "Architecture for Predicting Live Video Transcoding Performance on Docker Containers.",
                    "Cost Efficient Scheduling for Delay-Sensitive Tasks in Edge Computing System.",
                    "A Change Tracking Framework for Financial Documents.",
                    "Bazaar-Blockchain: A Blockchain for Bazaar-Based Cloud Markets.",
                    "Efficient Verification of Service-Based Applications for Flexible Modeling.",
                    "A Framework for Online Process Concept Drift Detection from Event Streams.",
                    "In Pursuit of Architectural Agility: Experimenting with Microservices.",
                    "A Fluctuation-Aware Approach for Predictive Web Service Composition.",
                    "To Bid or Not to Bid in Streamlined EC2 Spot Markets.",
                    "A Two-Phase Method of QoS Prediction for Situated Service Recommendation.",
                    "Extreme Topic Model for Market eAlert Service.",
                    "Enabling Intelligent Business Processes with Context Awareness.",
                    "Patterns for Process Edification in Process-Aware Information Systems.",
                    "StreamDB: A Unified Data Management System for Service-Based Cloud Application.",
                    "Public Cloud Adoption in Multinational Companies: A Survey.",
                    "Service Discovery Based Blue-Green Deployment Technique in Cloud Native Environments.",
                    "Digital Asset Management with Distributed Permission over Blockchain and Attribute-Based Access Control.",
                    "Achieving a Fault Tolerant and Reliable Cloud Data Center Network.",
                    "Improving Parallelism in Data-Intensive Workflows with Distributed Databases.",
                    "Service Requirement Pattern Elicitation Approach with a Case Study in Pharmaceutical Retail Service Market.",
                    "On-the-Fly Service Construction with Prototypes.",
                    "(WIP) Tasks Selection Policies for Securing Sensitive Data on Workflow Scheduling in Clouds.",
                    "(WIP) CloudCAMP: Automating the Deployment and Management of Cloud Services.",
                    "(WIP) Towards the Automated Composition of Machine Learning Services.",
                    "C-ABSC: Cooperative Attribute Based SignCryption Scheme for Internet of Things Applications.",
                    "Using Blockchain to Enhance the Trustworthiness of Business Processes: A Goal-Oriented Approach.",
                    "Object-Aware Identification of Microservices.",
                    "Dynamic Job Replication for Balancing Fault Tolerance, Latency, and Economic Efficiency: Work in Progress.",
                    "Quality Analysis for Scientific Workflow Provenance Access Control Policies.",
                    "A Highly Available Replicated Service Registry for Service Discovery in a Highly Dynamic Deployment Infrastructure.",
                    "Using Energy Storage to Modify the Shape of Internally Generated Demand to Fit a Prescribed Shape for Externally Presented Demand.",
                    "Fine-Grained Attribute Level Locking Scheme for Collaborative Scientific Workflow Development.",
                    "Reducing Tail Latencies While Improving Resiliency to Timing Errors for Stream Processing Workloads.",
                    "A Model for Representing Mobile Distributed Sensing-Based Services.",
                    "Towards End-to-End QoS and Cost-Aware Resource Scaling in Cloud-Based IoT Data Processing Pipelines.",
                    "Dynamic Resource Provisioning for Scientific Workflow Executions in Clouds.",
                    "Solutioning of Highly-Valued IT Service Contracts.",
                    "Big Data Assurance Evaluation: An SLA-Based Approach."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th IEEE SCC 2017",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2017",
                "sub_name": "2017 IEEE International Conference on Services Computing, SCC 2017, Honolulu, HI, USA, June 25-30, 2017.",
                "count": 69,
                "papers": [
                    "Handling Concept Drift in Predictive Process Monitoring.",
                    "Columbus: Enabling Scalable Scientific Workflows for Fast Evolving Spatio-Temporal Sensor Data.",
                    "Business Process Instances Discovery from Email Logs.",
                    "deQAM: A Dependency Based Indirect Monitoring Approach for Cloud Services.",
                    "Lightweight and Adaptive Service API Performance Monitoring in Highly Dynamic Cloud Environment.",
                    "On Estimating Bids for Amazon EC2 Spot Instances Using Time Series Forecasting.",
                    "Relaying Message and Motivating Collaboration for VANET Data Service.",
                    "ParkBid: An Incentive Based Crowdsourced Bidding Service for Parking Reservation.",
                    "Exploiting Time Series Analysis in Twitter to Measure a Campaign Process Performance.",
                    "Trading Web Services in a Double Auction-Based Cloud Platform: A Game Theoretic Analysis.",
                    "Integrating Tag, Topic, Co-Occurrence, and Popularity to Recommend Web APIs for Mashup Creation.",
                    "A Personalized Assistant Framework for Service Recommendation.",
                    "Selecting Green Data Mining Services.",
                    "Service Recommendation from the Evolution of Composition Patterns.",
                    "QoS and Customizable Transaction-Aware Selection for Big Data Analytics on Automatic Service Composition.",
                    "SR-LDA: Mining Effective Representations for Generating Service Ecosystem Knowledge Maps.",
                    "An MARL-Based Distributed Learning Scheme for Capturing User Preferences in a Smart Environment.",
                    "Building a Deep Learning Classifier for Enhancing a Biomedical Big Data Service.",
                    "Validation of Service Level Agreements Using Probabilistic Model Checking.",
                    "Constraint Adaptation in Web Service Composition.",
                    "Self-Adaptive Service Organization for Pragmatics-Aware Service Discovery.",
                    "Towards a Framework for Detecting Containment Violations in Service Choreography.",
                    "Availability Based Multiservice Delivery for Wireless Sensor Networks in Adversarial Environments.",
                    "ATM: A Framework to Support Application State Migration in Multiple Terminals Environment.",
                    "Assisting Open Education Resource Providers and Instructors to Deal with Cold Start Problem in Adaptive Micro Learning: A Service Oriented Solution.",
                    "Modeling User Preferences on Spatiotemporal Topics for Point-of-Interest Recommendation.",
                    "Situated Sensor Composition for Event-Based System.",
                    "Living in the Cloud or on the Edge: Opportunities and Challenges of IOT Application Architecture.",
                    "Web API Recommendation for Mashup Development Using Matrix Factorization on Integrated Content and Network-Based Service Clustering.",
                    "QoS Aware Service Clustering to Bootstrap the Web Service Selection.",
                    "Service Selection Based on Correlated QoS Requirements.",
                    "Conflict Management in Service-Oriented Pervasive Platforms.",
                    "Design Patterns for Reliable One-Way Messaging.",
                    "A Semantic-Based Approach to Service Clustering from Service Documents.",
                    "Optimizing Multi-Cloud CDN Deployment and Scheduling Strategies Using Big Data Analysis.",
                    "ALPINE: A Bayesian System for Cloud Performance Diagnosis and Prediction.",
                    "Cost-Efficient Distributed MapReduce Job Scheduling across Cloud Federation.",
                    "Research on QoS Optimization Method of Cloud Service Based on Utility Game between Users and Service Providers in the Cloud Market.",
                    "Simulation of Configurable Resource Allocation for Cloud-Based Business Processes.",
                    "Optimal Cost for Time-Aware Cloud Resource Allocation in Business Process.",
                    "A Framework for Ranking Cloud Security Services.",
                    "YAFA-SOA: A GA-Based Optimizer for Optimizing Security and Cost in Service Compositions.",
                    "Cloud SLA Modeling and Monitoring.",
                    "Deep and Shallow Model for Insurance Churn Prediction Service.",
                    "An Infrastructure Modelling Tool for Cloud Provisioning.",
                    "Computing Quantified Opacity for SOG-Abstracted Web Services.",
                    "Optimization of Autonomic Manager Components in Service-Based Applications.",
                    "An Optimization Approach for Adaptive Monitoring in IoT Environments.",
                    "Prediction-as-a-Service for Meme Popularity.",
                    "A Keyword-Driven Data Service Mashup Plan Generation Approach for Ad-Hoc Data Query.",
                    "Codeless Engineering of Service Mashups - An Experience Report.",
                    "Constructing the Knowledge Base for Cognitive IT Service Management.",
                    "A Cognitive Prioritization for Reports Generated in Resource Constrained Applications.",
                    "Back Propagation Grouping: Load Balancing at Global Scale When Sources Are Skewed.",
                    "IsV2C: An Integrated Road Traffic-Network-Cloud Simulator for V2C Connected Car Services.",
                    "Unraveling Process Evolution by Handling Concept Drifts in Process Mining.",
                    "The Mining of Activity Dependence Relation Based on Business Process Models.",
                    "Scalable Provenance Storage and Querying Using Pig Latin for Big Data Workflows.",
                    "Identifying Characteristic Attributes for Estimating Cost of Service in Service Oriented Architecture.",
                    "Temporal Influences-Aware Collaborative Filtering for QoS-Based Service Recommendation.",
                    "SynAdapt: Automated Synthesis of Adaptive Agents.",
                    "GS1 Global Smart Parking System: One Architecture to Unify Them All.",
                    "GSPN-Based Reliability-Aware Performance Evaluation of IoT Services.",
                    "Reducing the Number of Comatose Servers: Automatic Tuning as an Opportunistic Cloud-Service.",
                    "Use of Salesforce Platform for Building Real-Time Service Systems in Cloud.",
                    "A Component-Based Highly Available Data Replication Strategy Exploiting Operation Types and Hybrid Communication Mechanisms.",
                    "AttackDive: Diving Deep into the Cloud Ecosystem to Explore Attack Surfaces.",
                    "An Attack-Tolerant Framework for Web Services.",
                    "Top-k Cloud Service Plans Using Trust and QoS."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th IEEE SCC 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2016",
                "sub_name": "IEEE International Conference on Services Computing, SCC 2016, San Francisco, CA, USA, June 27 - July 2, 2016.",
                "count": 123,
                "papers": [
                    "ReAct: A System for Recommending Actions for Rapid Resolution of IT Service Incidents.",
                    "User Attribute Inference in Directed Social Networks as a Service.",
                    "An Ontology-Based Interoperability Solution for Electronic-Identity Systems.",
                    "QoS-Aware Adaptive Routing in Multi-layer Hierarchical Software Defined Networks: A Reinforcement Learning Approach.",
                    "A Linear Program for Optimal Configurable Business Processes Deployment into Cloud Federation.",
                    "A Query-Based Summarization Service from Multiple News Sources.",
                    "Cost-Effective Request Scheduling for Greening Cloud Data Centers.",
                    "A Cost-Effective Certification-Based Service Composition for the Cloud.",
                    "AERS: An Autonomic and Elastic Resource Scheduling Framework for Cloud Applications.",
                    "An Elasticity-Aware Governance Platform for Cloud Service Delivery.",
                    "A Framework for Ensuring the Quality of a Big Data Service.",
                    "Human-as-a-Service: Growth in Human Service Ecosystem.",
                    "Service Selection Based on Dynamic QoS Networks.",
                    "Automatic Composition of Service-Based Image Processing Applications.",
                    "An Approach of Service Discovery Based on Service Goal Clustering.",
                    "What Code Implements Such Service? A Behavior Model Based Feature Location Approach.",
                    "HAWKS: A System for Highly Available Executions of Workflows.",
                    "Optimizing the Performance of Big Data Workflows in Multi-cloud Environments Under Budget Constraint.",
                    "Energy Efficient Partitioning and Scheduling Approach for Scientific Workflows in the Cloud.",
                    "Where to Fix Temporal Violations: A Novel Handling Point Selection Strategy for Business Cloud Workflows.",
                    "A Semantic Framework Supporting Business Process Variability Using Event Logs.",
                    "A Service-Friendly Approach to Discover Traveling Companions Based on ANPR Data Stream.",
                    "A Comprehensive Framework for Business Process Outsourcing to the Cloud.",
                    "Analyzing Business Processes by Automatically Detecting KPI Thresholds.",
                    "An Empirical Analysis of Diagnosis of Industrial Business Processes at Sub-process Levels.",
                    "Description and Evaluation of Elasticity Strategies for Business Processes in the Cloud.",
                    "Evaluating Reputation of Web Services under Rating Scarcity.",
                    "Can HTTP/2 Really Help Web Performance on Smartphones?",
                    "Global and Personal App Networks: Characterizing Social Relations among Mobile Apps.",
                    "A Novel Pattern Based Dynamic Service Composition Framework.",
                    "Improving the Quality of Online Search Services: On the Service Multi-selection Problem.",
                    "A QoS and Trust Adaptation Framework for Composed Distributed Systems.",
                    "Architectural Models to Simplify Administration of Service-Oriented Applications.",
                    "Dynamic Selection for Service Composition Based on Temporal and QoS Constraints.",
                    "CACEV: A Cost and Carbon Emission-Efficient Virtual Machine Placement Method for Green Distributed Clouds.",
                    "A Generic Service Framework for Stock Market Prediction.",
                    "Enhancing User Control on Personal Data Usage in Internet of Things Ecosystems.",
                    "XYZ Indoor Navigation through Augmented Reality: A Research in Progress.",
                    "Billing the CPU Time Used by System Components on Behalf of VMs.",
                    "How to Distribute the Detection Load among Virtual Machines to Maximize the Detection of Distributed Attacks in the Cloud?",
                    "A Certification Technique for Cloud Security Adaptation.",
                    "A Framework for Top Service Subscription Recommendations for Service Assemblers.",
                    "A Framework for Passengers Demand Prediction and Recommendation.",
                    "Cluster-Based Web Service Recommendation.",
                    "An Approach of Semantic Web Service Classification Based on Naive Bayes.",
                    "End-to-End Solution with Clustering Method for Attrition Analysis.",
                    "Fast Social Service Network Construction Using Map-Reduce for Efficient Service Discovery.",
                    "Implementing the Required Degree of Multitenancy Isolation: A Case Study of Cloud-Hosted Bug Tracking System.",
                    "PDSDN: A Policy-Driven SDN Controller Improving Scheme for Multi-tenant Cloud Datacenter Environments.",
                    "A Time-Aware Method to Process Behavioral Similarity Calculation.",
                    "Model-Based Minimum Privacy Disclosure Recommendation for Authorization Policies.",
                    "Adaptable Privacy-Preserving Data Curation for Business Process Analysis Services.",
                    "Toward Predicting Susceptibility to Phishing Victimization on Facebook.",
                    "Bazaar-Extension: A CloudSim Extension for Simulating Negotiation Based Resource Allocations.",
                    "Service-Oriented Resource Management of Cloud Platforms.",
                    "Social-Based Semantic Framework for Cloud Resource Management in Business Processes.",
                    "Health Cloud: An Enabler for Healthcare Transformation.",
                    "Building Cloud-Based Healthcare Data Mining Services.",
                    "Recommending Analytic Services for Population Health Studies Based on Feature Significance.",
                    "Learning Transportation Annotated Mobility Profiles from GPS Data for Context-Aware Mobile Services.",
                    "Maximizing the Availability of Process Services in Mobile Computing Environments.",
                    "Autonomic Service-Oriented Context for Pervasive Applications.",
                    "MOBANA: A Distributed Stream-Based Information System for Public Transit.",
                    "Modeling and Evaluating Relationships and Service Contracts in Public Transportation: A Pilot Project in Italy.",
                    "Predicting Inventory Shipments of Oracle EBS Systems.",
                    "Agent-Based Model to Web Service Composition.",
                    "UCLAO* and BHUC: Two Novel Planning Algorithms for Uncertain Web Service Composition.",
                    "CoCOA: A Framework for Comparing Aggregate Client Operations in BPO Services.",
                    "Test Case Selection for Data Flow Based Regression Testing of BPEL Composite Services.",
                    "Efficient Task Allocation in Services Delivery Organizations.",
                    "Service Trustworthiness Evaluation Using Neural Network and Fuzzy Logic.",
                    "A QoS Evolutionary Method of Cloud Service Based on User Utility Model.",
                    "A Combinational QoS-Prediction Approach Based on RBF Neural Network.",
                    "Complexity Reduction: Local Activity Ranking by Resource Entropy for QoS-Aware Cloud Scheduling.",
                    "Mitigating Performance Unpredictability in Heterogeneous Clouds.",
                    "SRConfig: An Empirical Method of Interdependent Soft Configurations for Improving Performance in n-Tier Application.",
                    "Simulating Time-Varying Demand Services with Queuing Models.",
                    "Recovering Resolutions for Application Maintenance Incidents.",
                    "The rSLA Framework: Monitoring and Enforcement of Service Level Agreements for Cloud Services.",
                    "MORE: A Model-Driven Operation Service for Cloud-Based IT Systems.",
                    "Providing a Smart Industrial Environment with the Web of Things and Cloud Computing.",
                    "Workflow Model Distribution or Code Distribution? Ideal Approach for Service Composition of the Internet of Things.",
                    "Fragmentation and Optimal Deployment for IoT-Aware Business Process.",
                    "RaaS - Ranking as a Service.",
                    "An Approach for Modeling and Ranking Node-Level Stragglers in Cloud Datacenters.",
                    "Knowledge-Learning Service Construction Based on Events.",
                    "A Scalable Rule Engine Architecture for Service Execution Frameworks.",
                    "A Middleware for Environmental Monitoring and Control.",
                    "A Service-Oriented Approach for Integrating Broadcast Facilities.",
                    "An Optimization Approach to Services Sales Forecasting in a Multi-staged Sales Pipeline.",
                    "A Top-Down Pricing Algorithm for IT Service Contracts Using Lower Level Service Data.",
                    "Service Assurance Sustaining Enterprise Task Crowdsourcing Service.",
                    "Semantic Divergence Based Evaluation of Web Service Communities.",
                    "Semantic Web Technologies in Cloud Computing: A Systematic Literature Review.",
                    "Converting Service Rules to Semantic Rules.",
                    "A Framework for QoS-aware Traffic Classification Using Semi-supervised Machine Learning in SDNs.",
                    "Case Studies in Managing Traffic in a Developing Country with Privacy-Preserving Simulation as a Service.",
                    "A Framework for Permission Recommendation and Risk Evaluation Based on Skewness-Based Filtering.",
                    "Latent Interest and Topic Mining on User-Item Bipartite Networks.",
                    "Applying Probabilistic Model Checking to Service Discovery Framework.",
                    "Personalized Service Recommendation for Collaborative Tagging Systems with Social Relations and Temporal Influences.",
                    "Multi-agent Reinforcement Learning for Service Composition.",
                    "An Ontology-Based Semantic Service Markup for Content-centric Networking.",
                    "Higher-Order Functions for Modeling Hierarchical Service Bindings.",
                    "ESI-Cloud: Extending Virtual Machine Introspection for Integrating Multiple Security Services.",
                    "CIDE: An Integrated Development Environment for Microservices.",
                    "Microservices and Their Design Trade-Offs: A Self-Adaptive Roadmap.",
                    "Fads Phenomenon Operation through Cascade-Based Service Innovation Design.",
                    "Toward an Automated View Abstraction for Distributed Model-Driven Service Development.",
                    "GS1beacon: GS1 Standard Based Integrated Beacon Service Platform.",
                    "A Services Lifecycle to Support the Business Processes Lifecycle: From Modeling to Execution and Beyond.",
                    "Dynamic Business Process Generation and Verification.",
                    "A Hybrid Process-Data Model to Avoid Data Conflicting in BPMN.",
                    "A Process-Aware Inter-organizational Service Integration Platform to Support Collaborative Organizations.",
                    "A Dynamic Grouping-Based Trust Model for Mobile P2P Networks.",
                    "An Online Prediction Approach for Dynamic QoS.",
                    "Securing Docker Containers from Denial of Service (DoS) Attacks.",
                    "Predicting the Quality of Web Services Based on User Stability.",
                    "An Approach to Design and Analyze the Framework for Preventing Cyberbullying.",
                    "A Bio-Inspired Service Discovery and Selection Approach for IoT Applications.",
                    "Towards Video Quality of Experience and Selective Attention: A Subtitle-Based Measurement Study.",
                    "Limited Intervention Collaborative Decision Making of MAV-UAV Team Based on VFCM.",
                    "Traceability Architecture: Extending EPCIS to Enhance Track and Trace with NoSQL Data Model."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th IEEE SCC 2015",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2015",
                "sub_name": "2015 IEEE International Conference on Services Computing, SCC 2015, New York City, NY, USA, June 27 - July 2, 2015.",
                "count": 105,
                "papers": [
                    "Cascading Failure Tolerance in Large-Scale Service Networks.",
                    "Delay Tolerant Harvesting of Monitoring Data for MANET-Hosted Service-Based Systems.",
                    "Towards Fault-Tolerant Job Assignment in Vehicular Cloud.",
                    "Dynamic Sliding Window Model for Service Reputation.",
                    "Towards Robust Reputation System Based on Clustering Approach.",
                    "Efficient Computing Composite Service Skyline with QoS Correlations.",
                    "Business Rule Driven Composite Service Optimisation and Selection.",
                    "Automated Online Service Composition.",
                    "MDP and Machine Learning-Based Cost-Optimization of Dynamic Resource Allocation for Network Function Virtualization.",
                    "Managing the Heterogeneity and Dynamism in Hybrid Mobile Applications.",
                    "Towards Risk-Aware Planning of Service Delivery Operations.",
                    "Spectrum-Based Runtime Anomaly Localisation in Service-Based Systems.",
                    "Formal Verification of Runtime Compensation of Web Service Compositions: A Refinement and Proof Based Proposal with Event-B.",
                    "Policy-Aware Optimization of Parallel Execution of Composite Services.",
                    "Reconfiguration of Service Failures in DAMASCo Using Dynamic Software Product Lines.",
                    "Buddy Thing: Browsing as a Service for the Internet of Things.",
                    "A Middleware for Discovering Proximity-Based Service-Oriented Industrial Internet of Things.",
                    "Towards Service Description for Mobile Environments.",
                    "A Semantics of Business Configurations Using Symbolic Graphs.",
                    "Managing Configurable Business Process as a Service to Satisfy Client Transactional Requirements.",
                    "Change and Compliance in Collaborative Processes.",
                    "Fuzzy Authentication Using Interaction Provenance in Service Oriented Computing.",
                    "QoS-Aware Service Recommendation for Multi-tenant SaaS on the Cloud.",
                    "Personalized QoS Prediction via Matrix Factorization Integrated with Neighborhood Information.",
                    "Towards Efficient Greedy Allocation Schemes for Double-Sided Cloud Markets.",
                    "A Hierarchical Security-Auditing Methodology for Cloud Computing.",
                    "Software-Defined Service Networking: Runtime Sharing with Performance Differentiation in Multi-tenant SaaS Applications.",
                    "Privacy Scoring of Social Network Users as a Service.",
                    "Automated Policy Combination for Data Sharing across Multiple Organizations.",
                    "Supporting Temporal Aspects of SLA Establishment in Auto SLAM Framework.",
                    "Building the Computational Virtual Reality Environment for Anaesthetists' Training and Practice.",
                    "A Personal Healthcare System with Inference-as-a-Service.",
                    "A Data as a Product Model for Future Consumption of Big Stream Data in Clouds.",
                    "A New Meta-heuristic Approach for Efficient Search in the Internet of Things.",
                    "Scalable Sentiment Analysis for Microblogs Based on Semantic Scoring.",
                    "FAIoT: Towards Building a Forensics Aware Eco System for the Internet of Things.",
                    "Health Monitoring and Management Using Internet-of-Things (IoT) Sensing with Cloud-Based Processing: Opportunities and Challenges.",
                    "Effective Opportunistic Crowd Sensing IoT System for Restoring Missing Objects.",
                    "Cloud Mat: Context-Aware Personalization of Fitness Content.",
                    "CyPhyS+: A Reliable and Managed Cyber-Physical System for Old-Age Home Healthcare over a 6LoWPAN Using Wearable Motes.",
                    "A Decentralized Locality-Preserving Context-Aware Service Discovery Framework for Internet of Things.",
                    "A Classification of Trust Computation Models for Service-Oriented Internet of Things Systems.",
                    "Workflow-Based Service Selection under Multi-constraints.",
                    "Towards an Online Service for Learning Computational Thinking Using Scientific Workflows.",
                    "Hierarchical Clustering Using Homogeneity as Similarity Measure for Big Data Analytics.",
                    "Applying Analytics to Improve Hardware and Software Maintenance Support Services.",
                    "Mining Service Social Relations Based on Service Network Modeling and Analyzing.",
                    "On Developing and Deploying Large-File Upload Services of Personal Cloud Storage.",
                    "Architecting a Software-Defined Storage Platform for Cloud Storage Service.",
                    "Cloud Transformation Analytics Services: A Case Study of Cloud Fitness Validation for Server Migration.",
                    "In STechAH: An Autoscaling Scheme for Hadoop in the Private Cloud.",
                    "A Web Service Composition Method Based on Compact K2-Trees.",
                    "A Formal Approach for Ensuring a Correct Reconfigurable Composite Service.",
                    "Predicting Service Composition Costs with Complex Cost Behavior.",
                    "Analyzing the Influence of Domain Features on the Optimality of Service Composition Algorithm.",
                    "An Approach for Multiple-Instance Based Service Composition.",
                    "Modeling and Composition of Environment-as-a-Service.",
                    "Towards a Monitoring Middleware for Cloud Services.",
                    "A Meta-model for QoS Monitoring in a Dynamic Service-Component Platform.",
                    "Causality-Driven Performance Monitoring and Scaling Automation for Managed Solutions.",
                    "A Reference Architecture for a Cloud-Based Tools as a Service Workspace.",
                    "UaaS: Software Update as a Service for the IaaS Cloud.",
                    "A Generic Ranking Service on Scientific Datasets.",
                    "Service Level Aware - Contract Management.",
                    "Improvement of E-Contracts Accomplishments by Self-Adaptive Fuzzy Architecture.",
                    "Modeling Business Insights into Predictive Analytics for the Outcome of IT Service Contracts.",
                    "QoS Modeling and Automatic Generation from SoaML Service Models for Business Process Execution.",
                    "Service-centric Business Model in Cloud Environment.",
                    "Event-B Based Approach for Verifying Cloud Resource Allocation in Business Process.",
                    "MIDEP: Multiparty Identity Establishment Protocol for Decentralized Collaborative Services.",
                    "Management of Collaborative Behavior through a Service-Oriented Mediation System: The Case of Crisis Management.",
                    "A Flexible Collaborative Innovation Model for SOA Services Providers.",
                    "A Multi-criteria Based Approach for Web Service Selection Using Quality of Service (QoS).",
                    "A Ranking-Oriented Hybrid Approach to QoS-Aware Web Service Recommendation.",
                    "Cross-Skill Training Plan Generation for Accounts in Application Management Service (AMS).",
                    "A Progress Advisor for IT Service Engagements.",
                    "Composable DevOps: Automated Ontology Based DevOps Maturity Analysis.",
                    "An Artificial Neural Network for Predicting Service Rating in the Presence of Rating Manipulation.",
                    "Service Assurance Framework for Enterprise Task Crowdsourcing.",
                    "Automatic Discovery of Service Name Replacements Using Ledger Data.",
                    "Web Service Customization Based on Service Feature Model.",
                    "SLM as a Third Party Service in Cloud Environment: A Reference Framework.",
                    "Extension of Service-Oriented Component Models for Dynamic Environment.",
                    "A Design Pattern for Reliable HTTP-Based Applications.",
                    "Time-Aware Semantic Web Service Recommendation.",
                    "Data Services for Carpooling Based on Large-Scale Traffic Data Analysis.",
                    "Space Reduction for Contextual Transaction Trust Computation in E-Commerce and E-Service Environments.",
                    "Classification Based Parameter Association for Non-redundant Annotation.",
                    "Guided Analytic Workflows through Service Composition for Population Health Studies.",
                    "A Folksonomy-Based Social Recommendation System for Scientific Workflow Reuse.",
                    "Semantic Process Fragments Matching to Assist the Development of Process Variants.",
                    "Rondo: A Tool Suite for Continuous Deployment in Dynamic Environments.",
                    "A Tool for the Automatic Verification of BPMN Choreographies.",
                    "A Test-Based Incremental Security Certification Scheme for Cloud-Based Systems.",
                    "An Intuitionistic Fuzzy Approach for Ranking Web Services under Evaluation Uncertainty.",
                    "Using Design Patterns to Improve Web Service Performance.",
                    "Combining Fine-Grained Analysis and Scheduling to Smooth Response Time Fluctuations in Multi-tier Services.",
                    "Generating Symbolic Business Processes in Support of Evaluating Process Optimization.",
                    "Conformance Checking of Communicating Resource Systems with RAs Calculus.",
                    "Modeling and Simulating Reconfigurable Networked Service Composites.",
                    "Service Selection Using Service Clusters.",
                    "A Graph Approach for Enhancing Process Models Matchmaking.",
                    "Towards Automating Inter-organizational Workflow Semantic Resolution.",
                    "A Resource-Oriented Model for Services Management and Discovering in SOA.",
                    "Hybrid Scheduling for Quality of Service Guarantee in Software Defined Networks to Support Multimedia Cloud Services."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th IEEE SCC 2014",
        "info": "Anchorage, AK, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2014",
                "sub_name": "IEEE International Conference on Services Computing, SCC 2014, Anchorage, AK, USA, June 27 - July 2, 2014.",
                "count": 119,
                "papers": [
                    "Prioritizing and Scheduling Service Requests under Time Constraints.",
                    "Patterns for Monitoring Parallel Processes.",
                    "Consensus-Based Service Selection Using Crowdsourcing Under Fuzzy Preferences of Users.",
                    "Truthful Market-Based Trading of Cloud Services with Reservation Price.",
                    "E-Auctions for Multi-Cloud Service Provisioning.",
                    "Cadros: The Cloud-Assisted Data Replication in Decentralized Online Social Networks.",
                    "A System Architecture for Running Big Data Workflows in the Cloud.",
                    "Optimal Negotiation of Service Level Agreements for Cloud-Based Services through Autonomous Agents.",
                    "QoS-Aware Service Composition for Converged Network-Cloud Service Provisioning.",
                    "A Field Perspective on the Interoperability of Web Services.",
                    "Systematizing the Service-Oriented Requirements Engineering through I* Framework and Web Services.",
                    "Geospatial Web Service Sub-chain Ranking and Recommendation.",
                    "Full Solution Indexing Using Database for QoS-Aware Web Service Composition.",
                    "Personalized QoS Prediction for Web Services Using Latent Factor Models.",
                    "Ranking Strategies for Quality-Aware Service Selection.",
                    "Overlapping Community Extraction: A Link Hypergraph Partitioning Based Method.",
                    "A Density-Based Space Filling Curve for Location Privacy-Preserving.",
                    "Lilliput: Ontology-Based Platform for IoT Social Networks.",
                    "Déjà Vu: Assessing Similarity between Service Contracts for Risk Prediction.",
                    "Health Identification and Outcome Prediction for Outsourcing Services Based on Textual Comments.",
                    "A Dataflow-Pattern-Based Recommendation Approach for Data Service Mashups.",
                    "Towards Pattern-Based Generation of Services to Support Business Process Execution.",
                    "A Survey of Formalization Approaches to Service Composition.",
                    "Combining Von Neumann Neighborhood Topology with Approximate-Mapping Local Search for ABC-Based Service Composition.",
                    "Traffic Analysis as a Service via a Unified Model.",
                    "Provider Competition in Infrastructure-as-a-Service.",
                    "Ant-Inspired Multi-phase and Multi-party Negotiations in the Data-Intensive Service Provision.",
                    "Byzantine Fault Tolerance for Services with Commutative Operations.",
                    "Diversifying Top-k Service Retrieval.",
                    "Bliss: Specifying Declarative Service Protocols.",
                    "Executable Modeling Approach to Service Oriented Architecture Using SoaML in Conjunction with Extended DEVSML.",
                    "Multimodal Interactions in Dynamic, Service-Oriented Pervasive Environments.",
                    "Customization of Service-Oriented Domain Models Using SWRL.",
                    "Rain4Service: An Approach towards Decentralized Web Service Composition.",
                    "A Framework for Environmental Monitoring with Arduino-Based Sensors Using Restful Web Service.",
                    "CLAMS: Cross-layer Multi-cloud Application Monitoring-as-a-Service Framework.",
                    "Providing Quality of Service on Services Selection Using Anycast Techniques.",
                    "Integrating Trust with Qualitative and Quantitative Preference for Service Selection.",
                    "A Security Risk Assessment Model for Business Process Deployment in the Cloud.",
                    "Mining for Gold: How to Predict Service Contract Performance with Optimal Accuracy Based on Ordinal Risk Assessment Data.",
                    "Checkpoints for Service Level Operations.",
                    "Aggregating Ranked Services for Selection.",
                    "A Strategy to Optimize Resource Allocation in Auction-Based Cloud Markets.",
                    "Addressing the Shimming Problem in Big Data Scientific Workflows.",
                    "Forecasting Workloads in Multi-step, Multi-route Business Processes.",
                    "Benchmarking Accounts in Application Management Service (AMS).",
                    "Forecasting Service Profitability.",
                    "On the Quantification of Global Team Performance and Profitability.",
                    "API Terms and Conditions as a Service.",
                    "Towards Hybrid Cloud Service Certification Models.",
                    "Model Driven Conformance Testing for Standardized Services.",
                    "Enterprise Architecture Content Model Applied to Complexity Management While Delivering IT Services.",
                    "Rating Credibility of Sources for Profiling Risk and Business Context of Service Requests.",
                    "A Multithreaded Resolution of the Service Selection Problem Based on Domain Decomposition and Work Stealing.",
                    "Quality of Web Service Prediction by Collective Matrix Factorization.",
                    "Context Aware Post-filtering for Web Service Clustering.",
                    "A Neural Network Based Schema Matching Method for Web Service Matching.",
                    "Privacy as a Service in Social Network Communications.",
                    "Service Security Revisited.",
                    "Adaptive AutoSLAM - Policy-Based Orchestration of SLA Establishment.",
                    "An Approach for Value as a Service Discovery on Scientific Papers Big Data.",
                    "Cilia: An Autonomic Service Bus for Pervasive Environments.",
                    "The Talking Cloud: A Cloud Platform for Enabling Communication Mashups.",
                    "Optimization of Load Adaptive Distributed Stream Processing Services.",
                    "Resource State Monitoring of Service Transactions in Cloud Systems.",
                    "Strategic Service Selection Problem for Transport Telematic Services - An Optimization Approach.",
                    "Granger Causality-Aware Prediction and Diagnosis of Software Degradation.",
                    "Automated Negotiation Using Semantic Rules.",
                    "QoS-aware Service Composition over Graphplan through Graph Reachability.",
                    "Efficient Dynamic Methods for Predictive Action Strategy Optimization for Risk Driven Multi-channel Communication.",
                    "A Compliance Aware Software Defined Infrastructure.",
                    "Incident Ticket Analytics for IT Application Management Services.",
                    "WarMops: A Workload-Aware Resource Management Optimization Strategy for IaaS Private Clouds.",
                    "Design and Performance Evaluation of Cloud-Based XML Publish/Subscribe Services.",
                    "Dynamic Virtual Resource Management in Clouds Coping with Traffic Burst.",
                    "SaaS Architecture and Pricing Models.",
                    "CDCAS: A Novel Cloud Data Center Security Auditing System.",
                    "Leverage Personal Cloud Storage Services to Provide Shared Storage for Team Collaboration.",
                    "AOLOA: A Composable Framework for Third-Party Applications for Smart Home Gateways.",
                    "Event-Driven SOA for IoT Services.",
                    "A Formal Approach for Enforcing Transactional Requirements in Web Service Compositions.",
                    "Measuring Expected Integration Effort in Service Composition.",
                    "Handling Uncertainty in Data Services Composition.",
                    "Using Recommender Systems to Assist in Intelligent Service Composition.",
                    "Multi-tenant Service Composition Based on Granularity Computing.",
                    "A PaaS to Support Collaborations through Service Composition.",
                    "Multidimensional Reputation Network for Service Composition in the Internet of Things.",
                    "EPClets - A Lightweight and Flexible Textual Language to Augment EPC Process Modelling.",
                    "Enhancing Formal Specification and Verification of Temporal Constraints in Business Processes.",
                    "A Data-Centric Approach to Optimize Time in Workflow-Based Business Process.",
                    "Increasing Availability of Workflows Executing in a Pervasive Environment.",
                    "An Approach for Modeling and Analyzing Mobile Push Notification Services.",
                    "A Forecasting and Decision Model for Successful Service Negotiation.",
                    "Causality Analysis of IT Capabilities to Achieve Maximum Business Outcomes.",
                    "Clustering IT Events around Common Root Causes.",
                    "Performance Antipatterns: Detection and Evaluation of Their Effects in the Cloud.",
                    "Data Visualization of Web Service with Parallel Coordinates and NodeTrix.",
                    "Towards Automatically Estimating Porting Effort between Web Service APIs.",
                    "Automatic Hotlink Insertion in Live Production Websites.",
                    "A System of Systems Service Design for Social Media Analytics.",
                    "Social Engineering in Social Networking Sites: The Art of Impersonation.",
                    "CAPPA: Context Aware Privacy Protecting Advertising - An Extension to CLOPRO Framework.",
                    "Modelling Sound Conflict Management for Virtual-Enterprise Collaboration.",
                    "Towards a Plug-and-Play B2B Marketing Tool Based on Time-Sensitive Information Extraction.",
                    "VLAB-C: A Cloud Service Platform for Collaborative Virtual Laboratory.",
                    "EKMPC: Enhanced KMP Allocation for Virtual Network Service Provision in Cloud.",
                    "Data Fusion as an Enterprise Service.",
                    "Use-Case Centric Dashboard for Cloud Solutions.",
                    "Space Profile-Based Reverse Geocoding Service Using Cloud Platform.",
                    "Business Transformation Based on Cloud Services.",
                    "Automatic Code Generation for Business Process System Based on Artifact.",
                    "Extending an Instant Messaging System with Data Services and Mashups Thereof.",
                    "Design of Palatable Credit Scorecards as a Highly Automated Analytic Service by Combining Machine Learning with Domain Expertise.",
                    "Dynamic Integration Mechanism of Business Process for Internet of Things.",
                    "An Architectural Evaluation for Scientific Workflow Service Deployment in a Virtual Laboratory.",
                    "Reasoning about Security Policies of Services Using Answer Set Programming.",
                    "A Service Migration Mechanism for Web Service Discovery.",
                    "Logistics Service Map - Work-in-Progress.",
                    "Service Choreography: Present and Future."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th IEEE SCC 2013",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2013",
                "sub_name": "2013 IEEE International Conference on Services Computing, Santa Clara, CA, USA, June 28 - July 3, 2013.",
                "count": 108,
                "papers": [
                    "lightEPC: A Formal Approach for Modeling Personalized Lightweight Event-Driven Business Process.",
                    "Quantifying Consistency between Conceptual and Executable Business Processes.",
                    "A Contribution to Organizational and Operational Strategic Alignment: Incorporating Business Level Agreements into Business Process Modeling.",
                    "QRA: A Quality Requirements Analysis Approach for Service Systems.",
                    "Early Assessment of Service Performance Based on Simulation.",
                    "Reputation-Aware QoS Value Prediction of Web Services.",
                    "A Probabilistic Approach for Web Service Discovery.",
                    "A Technique of Analyzing Trust Relationships to Facilitate Scientific Service Discovery and Recommendation.",
                    "Towards Services Discovery Based on Service Goal Extraction and Recommendation.",
                    "A Robust Service Recommendation Scheme.",
                    "A Combinatorial Auction Model for Composite Service Selection Based on Preferences and Constraints.",
                    "Clustering and Spherical Visualization of Web Services.",
                    "Learning Recommendation System for Automated Service Composition.",
                    "An Efficient Algorithm for Strategy-Proof Service Composition.",
                    "Correlated Contribution Analysis for Service Composition in Dynamic Environments.",
                    "KSwSVR: A New Load Forecasting Method for Efficient Resources Provisioning in Cloud.",
                    "A Novel Approach to Allocate Cloud Resource with Different Performance Traits.",
                    "Revisiting Performance Interference among Consolidated n-Tier Applications: Sharing is Better Than Isolation.",
                    "Context-Aware Service Recommendation on High Performance Cluster.",
                    "Cloud Service Selection Based on the Aggregation of User Feedback and Quantitative Performance Assessment.",
                    "Monitoring Commitments in People-Driven Service Engagements.",
                    "Alignment and Change Propagation between Business Processes and Service-Oriented Architectures.",
                    "Efficient Service Re-composition Using Semantic Augmentation for Fast Cloud Fault Recovery.",
                    "Reliable Service Reconfiguration for Time-Critical Service Compositions.",
                    "Robust Client/Server Shared State Interactions of Collaborative Process with System Crash and Network Failures.",
                    "Reliable Service Composition via Automatic QoS Prediction.",
                    "Secure Cloud Storage Service with an Efficient DOKS Protocol.",
                    "Quantitative Analysis of Cloud-Based Streaming Services.",
                    "Design and Implementation of a Unified Network Information Service.",
                    "Multi-tenancy Support with Organization Management in the Cloud of Things.",
                    "Supporting Strategic Decision Making on Service Evolution Context Using Business Intelligence.",
                    "Enabling Runtime Evolution of Context-Aware Adaptive Services.",
                    "Data Decomposition Based Partial Replication Model for Software Services.",
                    "Private and Anonymous Data Storage and Distribution in Cloud.",
                    "ServiceTrust: Trust Management in Service Provision Networks.",
                    "SOA-Scanner: An Integrated Tool to Detect Vulnerabilities in Service-Based Infrastructures.",
                    "An Ontology-Based Framework for Model-Driven Analysis of Situations in Data Centers.",
                    "Ontology-Based Configuration for Service-Based Business Process Model.",
                    "Augmenting Semantics of Web Services Based on Public Open Ontology.",
                    "Scalable Service Composition Execution through Asynchronous I/O.",
                    "Web Services Composition through Data Events Approach.",
                    "Describing Dynamism in Service Dependencies: Industrial Experience and Feedbacks.",
                    "Variations in Performance Measurements of Multi-core Processors: A Study of n-Tier Applications.",
                    "PSRPS: A Workload Pattern Sensitive Resource Provisioning Scheme for Cloud Systems.",
                    "Measuring and Applying Service Request Effort Data in Application Management Services.",
                    "Service Discovery Based on Objective and Subjective Measures.",
                    "Influence Analysis Based Expert Finding Model and Its Applications in Enterprise Social Network.",
                    "Trust-Aware Service Recommendation via Exploiting Social Networks.",
                    "VMRaS: A Novel Virtual Machine Risk Assessment Scheme in the Cloud Environment.",
                    "Risk Assessment and Trust in Services Computing: Applications and Experience.",
                    "Security-Aware Resource Allocation in Clouds.",
                    "Spectral Graph Approach for Process Model Matchmaking.",
                    "Coercion Approach to the Shimming Problem in Scientific Workflows.",
                    "Formal Modeling of Elastic Service-Based Business Processes.",
                    "A Web Service Recommendation Approach Based on Situation Awareness.",
                    "Interest-Driven Web Service Recommendation Based on MFI-7.",
                    "Sensor Data as a Service - A Federated Platform for Mobile Data-centric Service Development and Sharing.",
                    "Promoting Collaborative Mobile Payment by Using NFC-Micro SD Technology.",
                    "IoT Mashup as a Service: Cloud-Based Mashup Service for the Internet of Things.",
                    "From Healthcare Messaging Standard to Semantic Web Service Description: Generating WSMO Annotation from HL7 with Mapping-Based Approach.",
                    "Optimizing the Carpool Service Problem with Genetic Algorithm in Service-Based Computing.",
                    "CloudStreamMedia: A Cloud Assistant Global Video on Demand Leasing Scheme.",
                    "Operational Excellence in IT Services Using Enterprise Crowdsourcing.",
                    "An Infrastructure Framework for Deploying Enterprise Private Cloud.",
                    "Unleashing Unstructured Data's Value for Enterprise IT Asset Management.",
                    "Business Process Scheduling Strategies in Cloud Environments with Fairness Metrics.",
                    "Integrating RESTful Service into BPEL Business Process on Service Generation System.",
                    "Assisting Business Process Design with Configurable Process Fragments.",
                    "Web Services QoS Measure Based on Subjective and Objective Weight.",
                    "Selecting Web Service for Multi-user Based on Multi-QoS Prediction.",
                    "Prediction of Service Reliability Based on Grouping.",
                    "Sharing with a Difference: Realizing Service-Based SaaS Applications with Runtime Sharing and Variation in Dynamic Software Product Lines.",
                    "AESON: A Model-Driven and Fault Tolerant Composite Deployment Runtime for IaaS Clouds.",
                    "The Importance of Considering Information Quality in the Implementation of Service-Oriented Architecture Initiatives.",
                    "OPS: Offline Patching Scheme for the Images Management in a Secure Cloud Environment.",
                    "Incremental Mining of System Log Format.",
                    "Policy-Based Agents for Virtual Machine Migration in Cloud Data Centers.",
                    "Value-Based Service Contract Selection.",
                    "Toward a Flexible Bidding Strategy with Preference Analysis.",
                    "Cloud Service Negotiation: A Research Roadmap.",
                    "Crowd-Enabled Technical Writing Services.",
                    "Services for Context Aware Knowledge Enhancement and Its Application in the Chinese Enterprise Management Tank (CEMT).",
                    "Supporting Collaborative Decision Processes.",
                    "A Game Theoretic Method to Model and Evaluate Attack-Defense Strategy in Cloud Computing.",
                    "A Novel Model for Contextual Transaction Trust Computation with Fixed Storage Space in E-Commerce and E-Service Environments.",
                    "Risk-Aware Web Service Allocation in the Cloud Using Portfolio Theory.",
                    "Modeling, Analysis and Optimization of Dependability-Aware Energy Efficiency in Services Computing Systems.",
                    "Towards Combining Declarative Specification with On-the-Fly Mediation.",
                    "Navdriver: Adaptive Websites via SaaS.",
                    "A CCRA Based Mass Customization Development for Cloud Services.",
                    "Controlling the Evolution of Product-Based Collaboration Contracts.",
                    "Psi-CAL: Foundations of a Programming Language for Services Computing.",
                    "Systematic Analysis of Public Cloud Service Level Agreements and Related Business Values.",
                    "Efficient Coalition Formation for Web Services.",
                    "SmartClass: A Services-Oriented Approach for University Resource Scheduling.",
                    "The Methodology, Platform and Solution for Service-Oriented Enterprise.",
                    "Towards a Service for Machine Consumable Web Search Results.",
                    "The Collaborative Configuration of Service-Oriented Product Lines Based on Evolutionary Approach.",
                    "SOA Design Patterns - Can They Improve the Process of Model Driven Development?",
                    "Provenance-Based Access Control in the Cloud.",
                    "Context-Aware Business Process Management for Personalized Healthcare Services.",
                    "A Process Calculus for Context-Aware Systems.",
                    "Towards Provenance Aware Design of Service Compositions: A Methodology for Analysing the Provenance Awareness in Service Designs.",
                    "UCOS: Enhanced Online Skyline Computation by User Clustering.",
                    "Extensible Service Knowledge.",
                    "Awareness of Social Influence for Service Recommendation.",
                    "Integrated Syntax and Semantic Validation for Services Computing.",
                    "On Assessing the Competitiveness of IT Service Solutions."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th IEEE SCC 2012",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2012",
                "sub_name": "2012 IEEE Ninth International Conference on Services Computing, Honolulu, HI, USA, June 24-29, 2012.",
                "count": 101,
                "papers": [
                    "Service Commons - Serve and Serve Alike: Applying the Creative Commons Spirit to Web Services.",
                    "AutoSLAM - A Policy-Driven Middleware for Automated SLA Establishment in SOA Environments.",
                    "Formal Certification and Compliance for Run-Time Service Environments.",
                    "A Metaheuristic Approach for the Configuration of Business Process Families.",
                    "An Integration Framework for Multi-perspective Business Process Modeling.",
                    "A Business Intelligence Approach to Support Decision Making in Service Evolution Management.",
                    "Stock Market Volatility Prediction: A Service-Oriented Multi-kernel Learning Approach.",
                    "Optimal Design of Manufacturing Services Network.",
                    "fANFARE: Autonomic Framework for Service-Based Pervasive Environment.",
                    "Self-Adaptive Cloud Capacity Planning.",
                    "A Scalable Accounting Solution for Prepaid Services in Cloud Systems.",
                    "Improving Cloud Service Reliability - A System Accounting Approach.",
                    "Enabling Active Data Archival over Cloud.",
                    "Hypergraph-Based Service Dependency Resolving and Its Applications.",
                    "Stochastic VM Multiplexing for Datacenter Consolidation.",
                    "On the Analysis of Satisfaction for Web Services Selection.",
                    "An Efficient Search Strategy for Service Provider Selection in Complex Social Networks.",
                    "A Web Service Recommendation Approach Based on QoS Prediction Using Fuzzy Clustering.",
                    "WS-Sky: An Efficient and Flexible Framework for QoS-Aware Web Service Selection.",
                    "Cost-Minimizing Service Selection in the Presence of End-to-End QoS Constraints and Complex Charging Models.",
                    "An Extended Matrix Factorization Approach for QoS Prediction in Service Selection.",
                    "INSC: An Iterative Negotiation Approach for Service Compositions.",
                    "Probabilistic Critical Path Identification for Cost-Effective Monitoring of Service-Based Systems.",
                    "Policy-Aware Service Composition in Sensor Networks.",
                    "A Cost-Effective Service Composition Method for Mass Customized QoS Requirements.",
                    "A Quantitative and Qualitative Approach for NFP-Aware Web Service Composition.",
                    "Hybrid Role Mining for Security Service Solution.",
                    "A Two-Phase Online Prediction Approach for Accurate and Timely Adaptation Decision.",
                    "A Service Binding Framework for Open Environment.",
                    "Implementing Dynamic Management for Mediated Service Interactions.",
                    "Access Control with Hidden Policies and Credentials for Service Computing.",
                    "A Framework for Detecting Anomalous Services in OSGi-Based Applications.",
                    "On Graph Reduction for QoS Prediction of Very Large Web Service Compositions.",
                    "Analysis of Scientific Workflow Provenance Access Control Policies.",
                    "A User-Defined Exception Handling Framework in the VIEW Scientific Workflow Management System.",
                    "Utilizing PCFGs for Modeling and Learning Service Compositions in Sensor Networks.",
                    "A Survey on Automated Service Composition Methods and Related Techniques.",
                    "A Query Verification Method for Making Outsourced Databases Trustworthy.",
                    "Service Level Composition across Multiple Service Chains.",
                    "Trade-Offs in a Google Distance and a WordNet Hybrid for QoS-Enabled Web Services Composition.",
                    "Towards an Automata-Based Semantic Web Services Composition Method in Context-Aware Environment.",
                    "Optimal Design for Cloud Infrastructure in Multi-layer Service Computing Environment.",
                    "A Cloud Oriented Account Service Mechanism for SME SaaS Ecosystem.",
                    "Profit-Based Experimental Analysis of IaaS Cloud Performance: Impact of Software Resource Allocation.",
                    "A Context-Aware Recovery Mechanism for Web Services Business Transaction.",
                    "A Human-Asset-Compromised Allocation Model of Multiple Emergency Projects in Service-Focused Enterprises.",
                    "Estimating the Processing Time of Process Instances in Semi-structured Processes - A Case Study.",
                    "SOAC-Net: A Model to Manage Service-Based Business Process Authorization.",
                    "On Elasticity and Constrainedness of Business Services Provisioning.",
                    "Design Maintenance in Process Eco-Systems.",
                    "Summary Instance: Scalable Event Priority Determination Engine for Large Scale Distributed Event-Based System.",
                    "Service Restructuring by Choreography-Driven Equivalence.",
                    "Modeling and Configuration of Process Variants for On-Boarding Customers to IT Outsourcing.",
                    "A Middleware Service for Image Adjustment and Filtering for Small Screens.",
                    "A Framework for the Evaluation of Mashup Tools.",
                    "Towards Battery-Aware Self-Adaptive Mobile Applications.",
                    "Concurrent Negotiation over Quality of Service.",
                    "ReputationNet: A Reputation Engine to Enhance ServiceMap by Recommending Trusted Services.",
                    "Effective Reuse via Modeling, Managing and Searching of Business Process Assets.",
                    "Model-Driven Design, Development, Execution and Management of Service-Based Applications.",
                    "The Research on Context-Aware-Based Intelligent Service System for Miners.",
                    "Collective Intelligence Applications in IT Services Business.",
                    "Personal Emergency Preparedness Plan (PEPP) Facebook App: Using Cloud Computing, Mobile Technology, and Social Networking Services to Decompress Traditional Channels of Communication during Emergencies and Disasters.",
                    "Assessing the Health of Case-Oriented Semi-structured Business Processes.",
                    "Service-Oriented Architecture for SPDFLOW: A Healthcare Workflow System for Sterile Processing Departments.",
                    "Dynamic Architecture for Autonomously Managing Service-Based Applications.",
                    "Selecting Skyline Web Services from Uncertain QoS.",
                    "Event-Driven Mashup Orchestration with Scala.",
                    "Service Grid Federation Architecture for Heterogeneous Domains.",
                    "Global Service Space Construction and Its Application to Workflow as a Service.",
                    "Dynamic Service Provisioning for the Cloud.",
                    "Autonomous Failure-Handling Mechanism for WF Long Running Transactions.",
                    "Towards Providing Data Validation as a Service.",
                    "High Performance Computing as a Service with Service Level Agreements.",
                    "h-IQ: Human Intelligence for Quality of Service Delivery Data.",
                    "Quality Evaluation within Service-Oriented Software: A Multi-perspective Approach.",
                    "Data-Centered Service Composition for Information Analysis.",
                    "RPPS: A Novel Resource Prediction and Provisioning Scheme in Cloud Data Center.",
                    "Data-Intensive Services for Large-Scale Archive Access.",
                    "Accelerating the Deployment of Security Service Infrastructure with Collective Intelligence and Analytics.",
                    "Experimental Evaluation of Web Service Frameworks in the Presence of Security Attacks.",
                    "Dynamic Service Selection Based on Context-Aware QoS.",
                    "String Comparators Based Algorithms for Process Model Matchmaking.",
                    "CCRA: Cloud Computing Reference Architecture.",
                    "Flow Editor: Semantic Web Service Composition Tool.",
                    "Regarding Processors and Reconfigurable IP Cores as Services.",
                    "Open Challenges for Consulting Service Lifecycle Management: What Service Research Should learn from Software Lifecycle Management.",
                    "From Requirements to Business Processes Development.",
                    "Managing Web Service Dynamic Changes at Run-Time Based on Bayesian Network.",
                    "How to Assess and Customize Service Value for IT Cloud Services Clients.",
                    "Context-Aware Service Adaptation via Learning Classifier System with Co-evolutionary Mechanism.",
                    "A Multi-agent Reinforcement Learning Model for Service Composition.",
                    "Reconciling Components and Services: The Apam Component-Service Platform.",
                    "Towards Automated Service Composition Using Policy Ontology in Building Automation System.",
                    "Creating Composite IT Services in the Global Enterprise.",
                    "KPI-Based Service Composition Modeling and Optimization with Design Time User Interaction.",
                    "Elasticity Economics of Cloud-Based Applications.",
                    "A Semantic Extended Multi-layer Model for BPEL Process Generation.",
                    "An Efficient Data Maintenance Model for Data Service Mashup.",
                    "Towards the Application of Reinforcement Learning Techniques for Quality-Based Service Selection in Automated Service Composition.",
                    "Web Service andWorkflow Abstractions to Large Scale Nuclear Physics Calculations."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th IEEE SCC 2011",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2011",
                "sub_name": "IEEE International Conference on Services Computing, SCC 2011, Washington, DC, USA, 4-9 July, 2011.",
                "count": 113,
                "papers": [
                    "SATE-Service Boundary and Abstraction Threshold Estimation for Efficient Services Design.",
                    "Adaptive Request Prioritization in Dynamic Service-Oriented Systems.",
                    "Proactive SLA Negotiation for Service Based Systems: Initial Implementation and Evaluation Experience.",
                    "Introducing Semantics to Cloud Services Catalogs.",
                    "Dynamic Processor Resource Configuration in Virtualized Environments.",
                    "Data Augmentation as a Service for Single View Creation.",
                    "Recommend-As-You-Go: A Novel Approach Supporting Services-Oriented Scientific Workflow Reuse.",
                    "QoS-Based Service Ranking and Selection for Service-Based Systems.",
                    "Self-Adaptive Fuzzy QoS-Driven Web Service Discovery.",
                    "Improving Performance and Availability of Services Hosted on IaaS Clouds with Structural Constraint-Aware Virtual Machine Placement.",
                    "Migration to Multi-image Cloud Templates.",
                    "Management of SOA-Based Context-Aware Applications Hosted in a Distributed Cloud Subject to Percentile Constraints.",
                    "Dynamic Fractal Clustering Technique for SOAP Web Messages.",
                    "Enhancing Penetration Testing with Attack Signatures and Interface Monitoring for the Detection of Injection Vulnerabilities in Web Services.",
                    "Provisioning Norm: An Asymmetric Quality Measure for SaaS Resource Allocation.",
                    "Automated Attribute Inference in Complex Service Workflows Based on Sharing Analysis.",
                    "Semantic Notions of Weakly Correct AND/XOR Business Workflows Based on Partial Synchronization.",
                    "OPQL: A First OPM-Level Query Language for Scientific Workflow Provenance.",
                    "Top-k Web Service Compositions Using Fuzzy Dominance Relationship.",
                    "Bridging the Gap between Semantic Web Service Composition and Common Implementation Architectures.",
                    "Exception Diagnosis for Composite Service Based on Error Propagation Degree.",
                    "A Game Theoretic Approach for Analyzing the Efficiency of Web Services in Collaborative Networks.",
                    "A Composed Approach for Automatic Classification of Web Services Robustness.",
                    "Modeling and Analysis of Dependability Attributes of Service Computing Systems.",
                    "Evaluating Feedback Ratings for Measuring Reputation of Web Services.",
                    "Modelling Workflow Executions under Role-Based Authorisation Control.",
                    "Detecting Concurrency-Related Problematic Activity Arrangement in WS-BPEL Programs.",
                    "Precise Mappings between Business Process Models in Versioning Scenarios.",
                    "How Physical Objects and Business Workflows Can Be Correlated.",
                    "Undoing Event-Driven Adaptation of Business Processes.",
                    "Reference Models for Saas Oriented Business Workflow Management Systems.",
                    "Comparison of Bio-inspired Algorithms for Peer Selection in Services Composition.",
                    "A Spring Based Framework for Verification of Service Composition.",
                    "Flexible Ontology-Independent and QOS-Enabled Dynamic Web Services Composition Using Google Distance.",
                    "Towards an Automated Gap Analysis for E-Service Portfolios.",
                    "Adaptive QoS-Aware Service Process Reconfiguration.",
                    "Analyzing Fault-Impact Region of Composite Service for Supporting Fault Handling Process.",
                    "Reconciliation of Ontology Mappings to Support Robust Service Interoperability.",
                    "Correlating Business Objectives with Services: An Ontology-Driven Approach.",
                    "Discovering Linkage Patterns among Web Services Using Business Process Knowledge.",
                    "Web Service Selection Based on Similarity Evaluation.",
                    "Reputation-Based Selection of Language Services.",
                    "Preference-Based Discovery of Dynamically Generated Service Offers.",
                    "Controlled Flexibility in Business Processes Defined for Service Compositions.",
                    "CBBCM: Clustering Based Automatic Service Composition.",
                    "QoS-Driven Service Composition with Multiple Flow Structures.",
                    "Towards Pay-As-You-Consume Cloud Computing.",
                    "Price Heuristics for Highly Efficient Profit Optimization of Service Composition.",
                    "Differentiated Service Pricing on Social Networks Using Stochastic Optimization.",
                    "Client Update: A Solution for Service Evolution.",
                    "Cultural Language Service: A Discovery, Composition and Organization.",
                    "A Granular Concurrency Control for Collaborative Scientific Workflow Composition.",
                    "Magnifier: Online Detection of Performance Problems in Large-Scale Cloud Computing Systems.",
                    "Building a Service-Oriented Monitoring Framework with REST and Nagios.",
                    "Model-Based Testing of Service-Oriented Applications via State Models.",
                    "IRTG: A Grid Middleware for Bioinformatics.",
                    "OdinTools-Model-Driven Development of Intelligent Mobile Services.",
                    "Fine-Grained Modeling of Web Services for Test-Based Security Certification.",
                    "Optimizing DaaS Web Service Based Data Mashups.",
                    "A New Approach for Quality Enforcement in Communities of Web Services.",
                    "A Dependency-Aware Hierarchical Service Model for SaaS and Cloud Services.",
                    "A Clustering Based Schema Matching Scheme for Improving Matching Correctness of Web Service Interfaces.",
                    "A Petri-Net Model for the Publish-Subscribe Paradigm and Its Application for the Verification of the BonjourGrid Middleware.",
                    "Measuring the Conceptual Coupling of Services Using Latent Semantic Indexing.",
                    "A Metrics Framework for Evaluating SOA Service Granularity.",
                    "Jerrymouse: A Tool for a Flexible and Dynamic Distribution of Web Service Requests.",
                    "On-Line Real-Time Service Allocation and Scheduling for Distributed Data Centers.",
                    "An Enhanced PROMETHEE Model for QoS-Based Web Service Selection.",
                    "Towards a Service-Oriented Component Model for Autonomic Management.",
                    "Managing Enterprise IT Systems Using Online Communities.",
                    "Managing Software Assets in a Global Enterprise.",
                    "Intelligent Scheduling Algorithm and Application in Modernizing Manufacturing Services.",
                    "Application Framework for Efficient Development of Sensor as a Service for Home Network System.",
                    "Leveraging Cloud Platform for Custom Application Development.",
                    "Capability Diagnostics of Enterprise Service Architectures Using a Dedicated Software Architecture Reference Model.",
                    "REFINTO: An Ontology-Based Requirements Engineering Framework for Business-IT Alignment in Financial Services Organizations.",
                    "Providing Map and GPS Assistance to Service Composition in Bioinformatics.",
                    "Building FCA-Based Decision Trees for the Selection of Heterogeneous Services.",
                    "Composition Context Matching for Web Service Recommendation.",
                    "ServiceMap: Providing Map and GPS Assistance to Service Composition in Bioinformatics.",
                    "An Event-Driven Approach for Runtime Verification of Inter-organizational Choreographies.",
                    "Verify Enterprise System Implementation through Business Process Model-Based Test Suite Generation.",
                    "A Novel Test and Evaluation Scheme for WS-Management Protocol and Its Implementation.",
                    "A Real-Time Risk Assessment and Mitigation Engine Based on Dynamic Context.",
                    "A Business Centric Monitoring Approach for Heterogeneous Service Composites.",
                    "Sustainable Service Level Agreements.",
                    "Towards a Constraint-Based Framework for Dynamic Business Process Adaptation.",
                    "Uniform Modeling of Resources and Business Processes Using Business Entities.",
                    "LiSEP: A Lightweight and Extensible Tool for Complex Event Processing.",
                    "SOMP: Service-Oriented Multi Processors.",
                    "Sensor Service Selection through Switch Options.",
                    "QoS-Based Distributed Service Selection in Large-Scale Web Services.",
                    "An Enhanced QoS Prediction Approach for Service Selection.",
                    "A Clustering Method for Web Service Discovery.",
                    "Using 3-Way Satisfaction for Web Service Selection: Preliminary Investigation.",
                    "Discovering Service Similarity by Testing.",
                    "A Multi-dimensional Social Tagging Method for Semantic Web Services.",
                    "An Architecture for Managing and Delivering Trustworthy Context-Dependent Services.",
                    "On-Demand Service-Oriented Architecture and Standardization.",
                    "Cloud Service Delivery across Multiple Cloud Platforms.",
                    "An Ontology Based Service Creation Process.",
                    "MyDeepWeb: An Integration Service for Your OWN Deep Web Data.",
                    "A Model-Driven BPM Approach for SOA Mediation Information System Design in a Collaborative Context.",
                    "Towards a Flexible Event-Driven SOA Based Approach for Collaborating Interactive Business Processes.",
                    "Integration of Business and Manufacturing Processes through Industrial Machinery as a Service Approach.",
                    "Policy Driven Services Coordination for Building Social Networks Based Applications.",
                    "Decentralized Service Management Based on Homophily for Self-Adaptive SOMAS.",
                    "SPARQL-to-SQL Query Translation: Bottom-Up or Top-Down?",
                    "Policy Consolidation and Privacy-Vital Information Flow Control in Composite Services.",
                    "Multi Domain-Specific Modeling of the Security Concerns of Service-Oriented Architectures.",
                    "On the Performance of Hosting Web Services on Mobile Devices.",
                    "SlapOS: A Multi-Purpose Distributed Cloud Operating System Based on an ERP Billing Model.",
                    "Towards Financial Planning as a Service."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th IEEE SCC 2010",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2010",
                "sub_name": "2010 IEEE International Conference on Services Computing, SCC 2010, Miami, Florida, USA, July 5-10, 2010.",
                "count": 90,
                "papers": [
                    "A Model for Visual Specification of E-contracts.",
                    "Preserving Data Flow Correctness in Process Adaptation.",
                    "Process Trace Identification from Unstructured Execution Logs.",
                    "Dynamic Service Invocation Control in Service Composition Environments.",
                    "BPEL Remote Objects: Integrating BPEL Processes into Object-Oriented Applications.",
                    "Co-Taverna: A Tool Supporting Collaborative Scientific Workflows.",
                    "Business Driven Consolidation of SOA Implementations.",
                    "Detection of Semantically Equivalent Fragments for Business Process Model Change Management.",
                    "A Novel Approach to Improving the Efficiency of Storing and Accessing Small Files on Hadoop: A Case Study by PowerPoint Files.",
                    "A Formal Service Contract Model for Accountable SaaS and Cloud Services.",
                    "Accountability as a Service for the Cloud.",
                    "Graph-Based Cloud Service Placement.",
                    "Metaheuristic Optimization of Large-Scale QoS-aware Service Compositions.",
                    "Xi-Calculus: A Calculus for Service Interactions.",
                    "A Service-Oriented Framework for GNU Octave-Based Performance Prediction.",
                    "QoS Analysis and Service Selection for Composite Services.",
                    "A Heuristic Algorithm for Trust-Oriented Service Provider Selection in Complex Social Networks.",
                    "An Information Model for the Provisioning of Network Connections Enabling Customer-Specific End-to-End QoS Guarantees.",
                    "SecureSOA.",
                    "Service Supervision for Service-Oriented Collective Intelligence.",
                    "Meta-Modeling of Semantic Web Services.",
                    "Improve Service Interface Adaptation Using Sub-ontology Extraction.",
                    "Distributed Storage and Querying Techniques for a Semantic Web of Scientific Workflow Provenance.",
                    "Discovering Shared Services from Cross-Organizational Software Specifications.",
                    "Analyzing Communities vs. Single Agent-Based Web Services: Trust Perspectives.",
                    "A Service Packaging Platform for Delivering Services.",
                    "A Value-Driven Approach for the Determination of Global Optimization Objective of Service Composition.",
                    "Applying Bargaining Game Theory to Web Services Negotiation.",
                    "A Continuous Long Running Batch Orchestration Model for Workflow Instance Migration.",
                    "Describing and Verifying Web Service Composition Using TLA Reasoning.",
                    "Dynamic Composition of Services in Sensor Networks.",
                    "Discovering Business Process Model from Unstructured Activity Logs.",
                    "Utilizing the Waiting-Time Criterion for Selecting Services in a Composition Scenario.",
                    "ViPen: A Model Supporting Knowledge Provenance for Exploratory Service Composition.",
                    "A QoS Query Language for User-Centric Web Service Selection.",
                    "Analyst-Mediated Contextualization of Regulatory Policies.",
                    "Measuring Compliance and Deviations in a Template-Based Service Contract Development Process.",
                    "Towards a Novel Web Services Standard-Supported CDN-P2P Loosely-Coupled Hybrid and Management Model.",
                    "Universal Identity Management Model Based on Anonymous Credentials.",
                    "A Trust Ontology for Semantic Services.",
                    "Constructing an Authentication Token to Access External Services in Service Aggregation.",
                    "Discovering Hierarchical Patterns in Event-Based Systems.",
                    "Alternative Approaches for Workflow Similarity.",
                    "A Knowledge Acquisition Method for Improving Data Quality in Services Engagements.",
                    "Feedback Controlled Quality of Service Enforcement for Service Oriented Architectures.",
                    "Defining Metrics for Loose Coupling Evaluation in Service Composition.",
                    "Market-Based QoS Control for Voluntary Services.",
                    "Mobile Process Management through Web Services.",
                    "Towards Green Business Process Management.",
                    "Process Behavior Analysis: Mechanism to Enable Superior Customer Experience.",
                    "A Cost-Minimizing Service Composition Selection Algorithm Supporting Time-Sensitive Discounts.",
                    "A Business Centric End-to-End Monitoring Approach for Service Composites.",
                    "Smarter Heuristics for Business-Driven Services Selection in Multi-services P2P Grids.",
                    "AHA: Asset Harvester Assistant.",
                    "A Link Obfuscation Service to Detect Webbots.",
                    "PRV: An Approach to Process Model Refactoring in Evolving Process-Aware Information Systems.",
                    "Prospective and Retrospective Provenance Collection in Scientific Workflow Environments.",
                    "Correcting Interaction Mismatches for Business Processes.",
                    "Using Complex Event Processing for Dynamic Business Process Adaptation.",
                    "Message-Based Service Brokering and Dynamic Composition in the SAI Middleware.",
                    "An Assessment of Middleware Platforms for Accessing Remote Services.",
                    "Extensible and General Service-Oriented Platform: Experience with the Service Abstract Machine.",
                    "Wukong: Toward a Cloud-Oriented File Service for Mobile Devices.",
                    "X-RIME: Cloud-Based Large Scale Social Network Analysis.",
                    "Online Self-Reconfiguration with Performance Guarantee for Energy-Efficient Large-Scale Cloud Computing Data Centers.",
                    "Resource Allocation and SLA Determination for Large Data Processing Services over Cloud.",
                    "Cross Enterprise Improvements Delivered via a Cloud Platform: A Game Changer for the Consumer Product and Retail Industry.",
                    "PeopleCloud Service for Enterprise Crowdsourcing.",
                    "SOAC: A Conceptual Model for Managing Service-Oriented Authorization.",
                    "Legacy Asset Analysis and Integration in Model-Driven SOA Solution.",
                    "Towards a Variability Model for SOA-Based Solutions.",
                    "Aligning IT Service Levels and Business Performance: A Case Study.",
                    "Process as a Service.",
                    "An Ontology to Support Context-Aware B2B Services.",
                    "Business-Driven Trust Federation Management for Service Marketplaces.",
                    "Towards a Unified Service Description Language for the Internet of Services: Requirements and First Developments.",
                    "Formal Passive Testing of Service-Oriented Systems.",
                    "A Service Identification Framework for Legacy System Migration into SOA.",
                    "Towards a Foundation for Quantitative Service Analysis.",
                    "Towards Self-Aware Performance and Resource Management in Modern Service-Oriented Systems.",
                    "Supporting Geosciences Web Services Metadata Management and Discovery.",
                    "Utility Decomposition and Surplus Redistribution in Composite SLA Negotiation.",
                    "Functionality-Driven Clustering of Web Service Registries.",
                    "Toward Consistent Combination of Service Selection Methods and Process Adaptation Methods.",
                    "Task Exception Handling in the VIEW Scientific Workflow System.",
                    "A Framework for Shrink-Wrapping Security Services.",
                    "Enhancing Web Service Registries with Semantics and Context Information.",
                    "Converged Service Delivery: Modeling and Engineering.",
                    "A Framework for Personalized Context-Aware Search of Ontology-Based Tagged Data.",
                    "A Novel Software Environment for Developing Migrating Internet Applications Based on Fusion of Mobile Agent, Web Services and BPEL Technologies."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th IEEE SCC 2009",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2009",
                "sub_name": "2009 IEEE International Conference on Services Computing (SCC 2009), 21-25 September 2009, Bangalore, India.",
                "count": 76,
                "papers": [
                    "Alignment of Choreography Changes in BPEL Processes.",
                    "Automatically Deriving Choreography-Conforming Systems of Services.",
                    "QoS-Enabled Business-to-Business Integration Using ebBP to WS-BPEL Translations.",
                    "Organizing Documented Processes.",
                    "Change Propagation in Process Models Using Behavioural Profiles.",
                    "Theoretical Framework for Eliminating Redundancy in Workflows.",
                    "Spatio-Temporal Patterns for Problem Determination in IT Services.",
                    "Multi-dimensional Knowledge Integration for Efficient Incident Management in a Services Cloud.",
                    "Managing Faults in the Service Delivery Process of Service Provider Coalitions.",
                    "SolutionFinder: Intelligent Knowledge Integration and Dissemination for Solution Retrieval in IT Support Services.",
                    "Protecting Sensitive Customer Information in Call Center Recordings.",
                    "Dependency Analysis Framework for Software Service Delivery.",
                    "Efficient Seat Utilization in Global IT Delivery Service Systems.",
                    "Effective Decision Support for Workforce Deployment Service Systems.",
                    "An Optimal Capacity Planning Algorithm for Provisioning Cluster-Based Failure-Resilient Composite Services.",
                    "Performance Management for Large Scale Service Delivery Platforms.",
                    "ITBVM: IT Business Value Modeler.",
                    "Towards Providing Value Based Differentiated QoS.",
                    "A Holistic View of Industry Standards Across SOA Solution Stack.",
                    "Managing Configuration Complexity during Deployment and Maintenance of SOA Solutions.",
                    "Evaluating Service Identification with Design Metrics on Business Process Decomposition.",
                    "Integrated Constraint Violation Handling for Dynamic Service Composition.",
                    "Optimal Replacement Policy of Services Based on Markov Decision Process.",
                    "A Model to Design and Verify Context-Aware Adaptive Service Composition.",
                    "Towards Autonomic Service Discovery A Survey and Comparison.",
                    "Identifying Client Goals for Web Service Discovery.",
                    "Web Service Substitution Based on Preferences Over Non-functional Attributes.",
                    "Analyzing Impact Factors on Composite Services.",
                    "Model Aware Execution of Composite Web Services.",
                    "QoS Analysis for Web Service Composition.",
                    "Enhancing Claim-Based Identity Management by Adding a Credibility Level to the Notion of Claims.",
                    "A Security Meta-model for Service-Oriented Architectures.",
                    "Effective Detection of SQL/XPath Injection Vulnerabilities in Web Services.",
                    "Reconfigurable SCA Applications with the FraSCAti Platform.",
                    "Ontology-based Information Sharing in Service-Oriented Database Systems.",
                    "A Task Abstraction and Mapping Approach to the Shimming Problem in Scientific Workflows.",
                    "Interaction Mismatch Discovery Based Transformation from BPMN to BPEL.",
                    "Extracting Behavioral Models from WS-BPEL Processes for Service Discovery.",
                    "Improving the Performance of ActiveXML Workflows: The Formal Descriptions.",
                    "Componentization of Business Process Layer in the SOA Reference Architecture.",
                    "Web2Exchange: A Model-Based Service Transformation and Integration Environment.",
                    "Towards a Unified Approach for Business Process Modeling Using Context-Based Artifacts and Web Services.",
                    "A Service Oriented Architecture for Personalized Rich Media Delivery.",
                    "WS-CDSP: A Novel Web Services-Based Content Delivery Service Peering Scheme.",
                    "Ensuring Coordination of Multi-business Interactions.",
                    "Identifying Data Constrained Activities for Migration Planning.",
                    "Cost-Effective Semantic Annotation of XML Schemas and Web Service Interfaces.",
                    "Clustering Web Services for Automatic Categorization.",
                    "Quantitative Modeling of Communication Cost for Global Service Delivery.",
                    "Simplify Stochastic QoS Admission Test for Composite Services through Lower Bound Approximation.",
                    "Port Based Reliability Computing for Service Composition.",
                    "Dynamic Service Composition in Ambient Intelligence Environment.",
                    "A Backwards Composition Context Based Service Selection Approach for Service Composition.",
                    "A Public-View Approach to Timed Properties Verification for B2B Web Service Compositions.",
                    "A Model for Designing Generic Services.",
                    "Design Pattern for Object Triple Mapping.",
                    "Constructing a Context-Aware Service-Oriented Reputation Model Using Attention Allocation Points.",
                    "A Case Study on Bi-lateral Resource Integration Oriented Marine Logistics Service System.",
                    "Business Entities: An SOA Approach to Progressive Core Banking Renovation.",
                    "Design and Implementation of Secure Internet Based Voting System with User Anonymity Using Identity Based Encryption System.",
                    "Trust Evaluation in Composite Services Selection and Discovery.",
                    "Service Composition Based on Natural Language Requests.",
                    "Domain-Specific Deployment and Configuration Language for Composition and Adaptation of Coarse-Grained Services.",
                    "Ontology Alignment Based Service Interface Adaptation.",
                    "Effective Knowledge Sharing in Service Systems.",
                    "An Information Model for Managing Service Lifecycle Resources.",
                    "Service Innovation in Value-Network through Clusters Consolidation.",
                    "A Dynamic Compensation Mechanism for Web Transactions.",
                    "JabberWocky: Crowd-Sourcing Metadata for Files.",
                    "Cloud Security Issues.",
                    "GridSaaS: A Grid-Enabled and SOA-Based SaaS Application Platform.",
                    "Mobility Management for Seamless Flow of Real Time Information in Heterogeneous Networks.",
                    "Agent with Rule Engine: The \"Glue' for Web Service Oriented Computing Applied to Network Management.",
                    "Context Aware Middleware Architecture for Wireless Sensor Network.",
                    "Towards an Agent-Based Simulation of Hospital Emergency Departments.",
                    "Ensuring Quality of Services at Runtime A Case Study."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th IEEE SCC 2008",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2008",
                "sub_name": "2008 IEEE International Conference on Services Computing (SCC 2008), 8-11 July 2008, Honolulu, Hawaii, USA.",
                "count": 151,
                "papers": [
                    "Verification of Access Control Requirements in Web Services Choreography.",
                    "Pattern-based Policy Configuration for SOA Applications.",
                    "Monitoring Dependencies for SLAs: The MoDe4SLA Approach.",
                    "Towards Effective Project Management across Multiple Projects with Distributed Performing Centers.",
                    "Optimizing Change Request Scheduling in IT Service Management.",
                    "Predictive Admission Control Algorithm for Advance Reservation in Equipment Grid.",
                    "End-to-End Versioning Support for Web Services.",
                    "Representing and Accessing Design Knowledge for Service Integration.",
                    "Incomplete Preference-driven Web Service Selection.",
                    "Zazen: A Mediating SOA between Ajax Applications and Enterprise Data.",
                    "To Establish Enterprise Service Model from Enterprise Business Model.",
                    "SCOOP: Automated Social Recommendation in Enterprise Process Management.",
                    "Auction Based Models for Ticket Allocation Problem in IT Service Delivery Industry.",
                    "Experimental Robustness Evaluation of JMS Middleware.",
                    "Locating Components Realizing Services in Existing Systems.",
                    "On the Specification of Payment Requirements for Collaborative Services.",
                    "A Graph Theory Based Impact and Completion Analysis Framework and Applications for Modeling SOA Solution Components.",
                    "Rapid Deployment of SOA Solutions via Automated Image Replication and Reconfiguration.",
                    "Security Specification at Process Level.",
                    "Adaptive Secure Access to Remote Services.",
                    "A Secure Information Flow Architecture for Web Services.",
                    "Morpheus: Semantics-based Incremental Change Propagation in SOA-based Solutions.",
                    "Web Service Matching by Ontology Instance Categorization.",
                    "An Automatic Semantic Segment Detection Service for HTML Documents.",
                    "Chord4S: A P2P-based Decentralised Service Discovery Approach.",
                    "Predicting Service Mashup Candidates Using Enhanced Syntactical Message Management.",
                    "Proactive Runtime Service Discovery.",
                    "Instance Isolation Analysis for Service-Oriented Architectures.",
                    "Variation-Oriented Engineering (VOE): Enhancing Reusability of SOA-based Solutions.",
                    "Promoting Reuse via Extraction of Domain Concepts and Service Abstractions from Design Diagrams.",
                    "Study of Service Processing Agent for Context-Aware Service Coordination.",
                    "PASS: An Approach to Personalized Automated Service Composition.",
                    "Runtime Protocol Binding: Flexible Service Integration by Means of Flexible Service Interactions.",
                    "A QSQL-based Efficient Planning Algorithm for Fully-automated Service Composition in Dynamic Service Environments.",
                    "A User-Steering Exploratory Service Composition Approach.",
                    "Leveraging Service Composition Relationship to Improve CPU Demand Estimation in SOA Environments.",
                    "Dynamic Support for BPEL Process Instance Adaptation.",
                    "Service-Oriented Architecture for VIEW: A Visual Scientific Workflow Management System.",
                    "A Reflective Framework to Improve the Adaptability of BPEL-based Web Service Composition.",
                    "Formalising Message Exchange Patterns using BPEL Light.",
                    "Composing Web Services through Automatic Reformulation of Service Specifications.",
                    "A Middleware Architecture for Enhancing Web Services Infrastructure for Distributed Coordination of Workflows.",
                    "A Risk Reduction Framework for Dynamic Workflows.",
                    "A Folksonomy-Based Model of Web Services for Discovery and Automatic Composition.",
                    "An Incremental Graph-based Approach to Automatic Service Composition.",
                    "Byzantine Fault Tolerant Coordination for Web Services Business Activities.",
                    "Towards a SLA-based Approach to Handle Service Disruptions.",
                    "Making BPEL Flexible - Adapting in the Context of Coordination Constraints Using WS-BPEL.",
                    "Optimal Resource Action Planning Analytics for Services Delivery Using Hiring, Contracting & Cross-Training of Various Skills.",
                    "A 3-level e-Business Registry Meta Model.",
                    "Scaling Location-based Services with Dynamically Composed Location Index.",
                    "Service Functionality Indexing and Matching for Service-Based Systems.",
                    "A Structured Service-Centric Approach for the Integration of Command and Control Components.",
                    "A Customer-Centric Privacy Protection Framework for Mobile Service-Oriented Architectures.",
                    "Rule-based XML Mediation for Data Validation and Privacy Anonymization.",
                    "A Policy Distribution Service for Proactive Fraud Management over Financial Data Streams.",
                    "A Two Stage Heuristic Algorithm for Solving the Server Consolidation Problem with Item-Item and Bin-Item Incompatibility Constraints.",
                    "Towards a Service Management System in Virtualized Infrastructures.",
                    "Policy-Based Automation to Improve Solution Engineering in IT Services.",
                    "A Fault Tolerance Approach for Enterprise Applications.",
                    "External Business Environment Analysis with RSS/Web.",
                    "Business Transformation Workbench: A Practitioner's Tool for Business Transformation.",
                    "Built-to-Order Service Engineering for Enterprise IT Discovery.",
                    "A Framework for Service Interoperability Analysis using Enterprise Architecture Models.",
                    "A Context Model for B2B Collaborations.",
                    "Three Factors to Sustainable Service System Excellence: A Case Study of Service Systems.",
                    "Constructing Service Oriented Dynamic Virtual Enterprises in Chinese Apparel Industry.",
                    "Study of Execution Centric Payment Issues in E-contracts.",
                    "Modelling Service Systems for Collaborative Innovation in the Enterprise Software Industry - The St. Gallen Media Reference Model Applied.",
                    "Differentiating Commoditized Services in a Services Marketplace.",
                    "A Graphical Approach to Providing Infrastructure Recommendations for IT.",
                    "Mining Top Issues from Contact Center Logs for Self Help Portals.",
                    "A Software as a Service with Multi-tenancy Support for an Electronic Contract Management Application.",
                    "wsrbench: An On-Line Tool for Robustness Benchmarking.",
                    "A Framework for Model-Based Continuous Improvement of Global IT Service Delivery Operations.",
                    "WIPdroid - A Two-way Web Services and Real-time Communication Enabled Mobile Computing Platform for Distributed Services Computing.",
                    "Virtual Learning Services over 3D Internet: Patterns and Case Studies.",
                    "Surrogate: A Simulation Apparatus for Continuous Integration Testing in Service Oriented Architecture.",
                    "Towards Agile Service-oriented Business Systems: A Directive-oriented Pattern Analysis Approach.",
                    "Development Tool for Service-Oriented Applications in Smart Homes.",
                    "A Scenario-View Based Approach to Analyze External Behavior of Web Services for Supporting Mediated Service Interactions.",
                    "Data Model Design of Strategic Analysis Services for Specific Customer Oriented Industries.",
                    "Simplifying Service Deployment with Virtual Appliances.",
                    "Implementing Multi-Vendor Home Network System with Vendor-Neutral Services and Dynamic Service Binding.",
                    "A Conflict Neighbouring Negotiation Algorithm for Resource Services in Dynamic Collaborations.",
                    "Declarative Web Service Entities with Virtual Endpoints.",
                    "National Population Information System Based on Web Services.",
                    "Modeling Service Quality for Dynamic QoS Publishing.",
                    "Partitioning the WS Execution Environment for Hosting Mobile Web Services.",
                    "Using an Interface Proxy to Host Versioned Web Services.",
                    "Ensuring Service Level Agreements for Service Workflows.",
                    "On Improving Change Management Process for Enterprise IT Services.",
                    "Managing Security and Privacy Integration across Enterprise Business Process and Infrastructure.",
                    "Generation of BPEL Customization Processes for SaaS Applications from Variability Descriptors.",
                    "Deriving Explicit Data Links in WS-BPEL Processes.",
                    "Component-Based Composition of Wide-Area Workflows.",
                    "Solving the Service Composition Puzzle.",
                    "Optimum Decentralized Choreography for Web Services Composition.",
                    "Service-Oriented Mobile Applications for Ad-Hoc networks.",
                    "A Service-Oriented Approach to Storage Backup.",
                    "Toward Web Service Dependency Discovery for SOA Management.",
                    "A Method for Service Center Architecture Based on Industry Standards.",
                    "Text to Intelligence: Building and Deploying a Text Mining Solution in the Services Industry for Customer Satisfaction Analysis.",
                    "iFAO: Spatial Decision Support Services for Facility Network Transformation.",
                    "A Method and Case Study of Designing Presentation Module in an SOA-based Solution Using Configurable Architectural Building Blocks (ABBs).",
                    "SDMA: A Service-based Architecture for Data Mining Applications.",
                    "An Interdisciplinary Methodology for Building Service-oriented Systems on the Web.",
                    "SOAMS: A Novel SOA-based System and Network Management Model and Scheme.",
                    "Extended BPEL System for e-Engineering Framework Considering the Characteristics of Mechanical Engineering Services.",
                    "WSLA+: Web Service Level Agreement Language for Collaborations.",
                    "A Methodology for Model-Driven Web Application Composition.",
                    "A Formal Model for Channel Passing in Web Service Composition.",
                    "Towards a General Framework for Web Service Composition.",
                    "Composable Data Processing in Environmental Science - A Process View.",
                    "Enhancing Semantic Web Services Composition with User Interaction.",
                    "A Fault Propagation Approach for Highly Distributed Service Compositions.",
                    "SpiG4WSC: A Calculus for Secure Services Composition.",
                    "A Formal Model of Service Delivery.",
                    "Robust Web Service Discovery in Large Networks.",
                    "Formal Verification of Web Service Interaction Contracts.",
                    "A Fuzzy-set based Semantic Similarity Matching Algorithm for Web Service.",
                    "A Model-Driven Approach to Service Orchestration.",
                    "A Framework for QoS Driven Selection of Services.",
                    "Query Evaluation and Performance Optimization in Distributed Community Data Sharing System Based on Web Services.",
                    "On Service Orchestration in Mobile Computing Environments.",
                    "Towards a User-perceived Service Availability Metric.",
                    "Exploring the Impact of Queue Management on Quality of Service for SMBs.",
                    "Exploiting XML Schema for Interpreting XML Documents as RDF.",
                    "Identify Authorization Control Requirement in Business Collaboration.",
                    "A General Service-Oriented Grid Computing Framework for Global Optimization Problem Solving.",
                    "A Negotiation Service for Trading Intangible Goods on Real-time Markets.",
                    "GSMA based Automated Negotiation Model for Grid Scheduling.",
                    "Virtual Execution Environments for ensuring SLA-compliant Job Migration in Grids.",
                    "Mining Process Variants: Goals and Issues.",
                    "A Practical Geographic Ontology for Spatial Web Services.",
                    "A Situations & Goals Semantic Model for Designing and Implementing Semantic Web Services-based Processes.",
                    "Using Semantics for Resource Allocation in Computing Service Providers.",
                    "Grounding and Execution of OWL-S Based Semantic Web Services.",
                    "Verification of Privacy Timed Properties in Web Service Protocols.",
                    "A New Optimal Policy for Service System with Nonstationary Stochastic Demand.",
                    "The Impossibility of Boosting Resilience of Fully-connected Services for Solving Set-consensus Tasks.",
                    "Enterprise Mashups: Design Principles towards the Long Tail of User Needs.",
                    "A Model for Digital Business Ecosystem and Topological Analysis.",
                    "From Feature Models to Business Processes.",
                    "SLA Negotiation System Design Based on Business Rules.",
                    "Hierarchical Business Process Clustering.",
                    "PoEM - Potsdam Encoding for Models.",
                    "Enhanced Maintenance Services with Automatic Structuring of IT Problem Ticket Data.",
                    "Mobile Clinical Systems on an Interoperable Medical Framework.",
                    "Tourism, Peer Production, and Location-Based Service Design.",
                    "SOAR: SOcially Aware Routing for Request Matching in Enterprise Environments."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th IEEE SCC 2007",
        "info": "Salt Lake City, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2007",
                "sub_name": "2007 IEEE International Conference on Services Computing (SCC 2007), 9-13 July 2007, Salt Lake City, Utah, USA.",
                "count": 121,
                "papers": [
                    "SOA Solution Reference Architecture.",
                    "State of the Art in Modeling and Deployment of Electronic Contracts.",
                    "Web Services Security and Privacy.",
                    "Build Your Mashup with Web Services.",
                    "Semantic SOA in Action: A Practical Demonstration.",
                    "BRAHMA: Planning Tool for Providing Storage Management as a Service.",
                    "QoS-Aware Optimization of Composite-Service Fulfillment Policy.",
                    "Security Policy Specification and Integration in Business Collaboration.",
                    "SLA Driven Process Security through Monitored E-contracts.",
                    "Governance of Cross-Organizational Service Agreements: A Policy-Based Approach.",
                    "An Infrastructure Virtualisation SOA for VNO-based Business Models.",
                    "DoCoSOC- Domain Configurable Service-Oriented Computing.",
                    "Enabling User Control with Personal Identity Management.",
                    "Composing Integrated Systems Using GUI-Based Applications And Web Services.",
                    "An Approach to Hosting Versioned Web Services.",
                    "Business Process Transformation Wizard: a Bridge between Business Analysts and Business Process Transformation Technology.",
                    "Service Commitment Strategies in Allocating Services to Applications.",
                    "Advanced Verification of Distributed WS-BPEL Business Processes Incorporating CSSA-based Data Flow Analysis.",
                    "Web Service Discovery: Adding Semantics through Service Request Expansion and Latent Semantic Indexing.",
                    "Accurate and efficient stochastic reliability analysis of composite services using their compact Markov reward model representations.",
                    "Scalable Web Service Discovery on P2P Overlay Network.",
                    "Web 2.0 Services for Identifying Communities of Practice through Social Networks.",
                    "Workflow Composition of Service Level Agreements.",
                    "Ubiquitous Services.",
                    "Uncertainty-aware QoS Description and Selection Model for Web Services.",
                    "Checking e-service consistency using Description Logics.",
                    "Enforcing Integrity of Execution in Distributed Workflow Management Systems.",
                    "Deriving executable BPEL from UMM Business Transactions.",
                    "A Feature Modeling Support for Non-Functional Constraints in Service Oriented Architecture.",
                    "A Privacy Agreement Model for Web Services.",
                    "A Service-Oriented Analysis and Design Approach to Developing Adaptable Services.",
                    "Fine-Grain, End-to-End Security for Web Service Compositions.",
                    "Towards Efficient Verification for Process Composition of Semantic Web Services.",
                    "Logic-based Management of Security in Web Services.",
                    "A General Attribute based RBAC Model for Web Service.",
                    "Context-enabled B2B Collaborations.",
                    "Optimization of Collaborative Service Systems Using Experience Evaluation Model.",
                    "Enabling re-negotiations of SLA by extending the WS-Agreement specification.",
                    "Towards A Theoretical Foundation for Web Services - The Language-Action Perspective (LAP) Approach.",
                    "What are you talking about?",
                    "Regret-Based Decentralized Adaptation ofWeb Processes with Coordination Constraints.",
                    "Public Administration Domain Ontology for a Semantic Web Services EGovernment Framework.",
                    "Integration and Interoperability between Jini services andWeb Services.",
                    "A Fault-Tolerant Middleware Architecture for High-Availability Storage Services.",
                    "Impact of Business Service Modes on Distribution Systems: A Reinforcement Learning Approach.",
                    "RMI: A Framework for Modeling and Evaluating the Resiliency Maturity of IT Service Organizations.",
                    "Business Value Analysis of IT Services.",
                    "Enhancing Asset Search and Retrieval in a Services Repository using Consumption Contexts.",
                    "Agent-Mediated Knowledge Sharing for Services Management.",
                    "Using Personal Ontology in Evaluating Service Quality.",
                    "Service-Oriented Architecture Based e-Engineering Framework to Support Collaborative Design.",
                    "A Meta-Model Approach for the Deployment of Services-oriented Applications.",
                    "Model-Based Dependency Management for Migrating Service Hosting Environment.",
                    "Merging overlapping orchestrations: an application to the Bronze Standard medical application.",
                    "Design Principles for B2B Services - An Evaluation of Two Alternative Service Designs.",
                    "Services Pricing through Business Value Modeling and Analysis.",
                    "Configuration Reasoning and Ontology ForWeb.",
                    "A Services Theory Approach to Online Service Applications.",
                    "A distributed service-oriented mediation tool.",
                    "A Workflow-Driven Approach for the Efficient Integration of Web Services in Portals.",
                    "Dynamic Workflow Generation with Interoperable Security Alerts in MANET.",
                    "Innovation Patterns.",
                    "Using Control Theory to Improve Productivity of Service Systems.",
                    "A Formal Model for Mixed Initiative Service Composition.",
                    "Collaborative Business Processes Integration and Management - Lessons learned from industry.",
                    "WS-Policy4MASC - A WS-Policy Extension Used in the MASC Middleware.",
                    "A Hybrid Architecture for Highly Adaptive and Automated e-Business Platforms.",
                    "iPOJO: an Extensible Service-Oriented Component Framework.",
                    "A Service-Oriented Solution for Retail Store Network Planning.",
                    "BTx-Net: A Token Based Dynamic Model for Supporting Consistent Collaborative Business Transactions.",
                    "A Bayesian network based Qos assessment model for web services.",
                    "Exploring Dependency between Interfaces in Service Matchmaking.",
                    "Engineering Foreign Exchange Processes via Commitment Protocols.",
                    "Information Discovery across Organizational Boundaries through Local Caching.",
                    "Rectifying Prejudicial Feedback Ratings in Reputation based Trust Management.",
                    "A Service Discovery Framework based on Linear Composition.",
                    "Autonomic Performance Recuperation for Service-oriented Systems.",
                    "Resource Allocation Based On Workflow For Enhancing the Performance of Composite Service.",
                    "Variation-Oriented Analysis for SOA Solution Design.",
                    "A Service-Oriented Solution Framework for Distributed Virus Detection and Vulnerability Remediation (VDVR) System.",
                    "IT service management automation - A hybrid methodology to integrate and orchestrate collaborative human centric and automation centric workflows.",
                    "e-Tendering with Web Services: A Case Study on the Tendering Process of Building Construction.",
                    "Efficient Internet Chat Services for Help Desk Agents.",
                    "Brave New Web: Emerging Design Principles and Technologies as Enablers of a Global SOA.",
                    "Policy-Based Automation to Improve Solution Engineering in IT Services.",
                    "An Enterprise Electronic Contract Management System Based on Service-Oriented Architecture.",
                    "Service-Oriented Laboratory Information Management System for Life Sciences Research.",
                    "A Grid-Oriented Platform for Software Component Repository Based on Domain Ontology.",
                    "Intelligent Document Gateway - A Ser vice System Analysis.",
                    "Business-Activity Driven Search: Addressing the Information Needs of Services Professionals.",
                    "A Distributed e-Healthcare System Based on the Service Oriented Architecture.",
                    "Services Oriented Knowledge-based Supply Chain Application.",
                    "Leveraging Context Aware Services to Transform Evolving Telecom Industry Business Model.",
                    "A Framework for Assessing Business Value of Service Oriented Architectures.",
                    "Web Services Conversion.",
                    "Context Modeling to Enforce Interoperability in Web Service Definition.",
                    "Migrating the IT environment of a governmental institution to a SOA.",
                    "Case Study to Verify the Interoperability of a Service Oriented Architecture Stack.",
                    "Supporting Heterogeneous Applications with Service Oriented Architecture.",
                    "Compliance Enforcement for Service Process Flows.",
                    "Web Service Dependency Discovery Tool for SOA Management.",
                    "Service Spectrum for Service Engineering.",
                    "SOA based Context Aware Services Infrastructure.",
                    "From Web Services to Virtual Services - The Architecture and Patterns for 3D Services.",
                    "Variation Oriented Service Composition and Adaptation (VOSCA): A Work in Progress.",
                    "Mechanisms to Book Services in an Adaptive Resource Management System.",
                    "Supporting Dynamic Updates of Componentized Service.",
                    "The Business Model of \"Software-As-A-Service\".",
                    "Coupling RDF/RSS, WSRP and AJAX for Dynamic Reusable Portlets: An Approach and a Use Case.",
                    "Pattern based Declarative Constraint Solution for Model-Driven Service Deployment.",
                    "A Practical Framework for Dynamic Composition on Enterprise Service Bus.",
                    "Service Level Agreement Aware Workflow Scheduling.",
                    "Calculating the Business Importance of Entities in a Service-Oriented Enterprise.",
                    "An Ontology for Modeling Life-Events.",
                    "A Novel Approach for Process Mining Based on Event Types.",
                    "Automating Service Matchmaking using Type Theory.",
                    "Consultation Model based Services Application Model and its Charging Algorithm.",
                    "Service-oriented encapsulation of manufacturing resources.",
                    "Using Call-Context to Prevent the Emergence of Chaotic Workflow Behaviors in Overload Situations.",
                    "Verifying Semantic Business Process Models in Inter-operation.",
                    "Supporting Gene Expression Analysis Processes by a Service-Oriented Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/IEEEscc/2007w",
                "sub_name": "2007 IEEE International Conference on Services Computing - Workshops (SCW 2007), 9-13 July 2007, Salt Lake City, Utah, USA.",
                "count": 51,
                "papers": [
                    "Interaction and Potential Synergy between Commercial and Governmental Web Services - a Case Study.",
                    "Modeling and Analysis of Performance Oriented and Revenue Based Admission Control Framework for Service Providers.",
                    "A Policy Driven Authorization Control Framework for Business Collaboration.",
                    "A Service Architecture for Context Awareness and Reaction Provisioning.",
                    "Compliance Proofs for Collaborative Interactions using Aspect-Oriented Approach.",
                    "A Ranking Mechanism for SemanticWeb Service Discovery.",
                    "A Statechart-Based Model for the Semantic Composition of Web Services.",
                    "Exchanging Policies between Web Service Entities using Rule Languages.",
                    "Web Service Composition via Problem Decomposition Across Multiple Ontologies.",
                    "Bringing Web Principles to Services: Ontology-BasedWeb Services.",
                    "Web Service decision-making model based on uncertain-but-bounded attributes.",
                    "Semantic Web for the Life Sciences - Hype, Why, How and Use Case for AIDS Inhibitors.",
                    "Bluejay: A Highly Scalable and Integrative Visual Environment for Genome Exploration.",
                    "XOA: Web-Enabled Cross-Ontological Analytics.",
                    "Bioinformatics Services Discovery Using Ontology Classification.",
                    "Development of NeuronBank: A Federation of Customizable Knowledge Bases of Neuronal Circuitry.",
                    "Infrastructure for Annotation-Driven Information Extraction from the Primary Scientific Literature: Principles and Practice.",
                    "Analysis of a Scientific Protocol: Selecting Suitable Resources.",
                    "Data-aware SOA for Gene Expression Analysis Processes.",
                    "An Approach to Model Cross-organizational Processes using Object Petri net.",
                    "Continuous SPA: Continuous Assessing and Monitoring Software Process.",
                    "Variation-Oriented Requirements Analysis (VORA).",
                    "Process Discovery from Model and Text Artefacts.",
                    "Coupling RDF/RSS, WSRP and AJAX for Dynamic Reusable Portlets: An Approach and a Use Case.",
                    "Distributed execution of aggregated multi domain workflows using an agent framework.",
                    "An Architecture of a Workflow System for Integrated Asset Management in the Smart Oil Field Domain.",
                    "Swift: Fast, Reliable, Loosely Coupled Parallel Computation.",
                    "VIEW: a Visual Scientific Workflow Management System.",
                    "Storing and Discovering Critical Workflows from Log in Scientific Exploration.",
                    "Semantic-based Dynamic Service Composition and Adaptation.",
                    "A Framework for Automatic Composition of RFQ Web Services.",
                    "Polynomial-Time Reasoning for Semantic Web Service Composition.",
                    "Modeling and Verifying Non-DAG Workflows for Computational Grids.",
                    "Tailorability of personalized BPEL-based Workflow Compositions.",
                    "Specification of Adaptive Client-Tailored Product Models.",
                    "Composing Web-service-like Abstract State Machines (ASMs).",
                    "Service Selection Model Based on QoS Reference Vector.",
                    "A Reliability-Aware Approach for Web Services Execution Planning.",
                    "Aspect-oriented Approach for Non-functional Adaptation of Composite Web Services.",
                    "Improving Performance of CompositeWeb Services Over a Wide Area Network.",
                    "An Automated Composition of Information Web Services based on Functional Semantics.",
                    "Quantifying Trust through Delegation in Service Oriented Architecture.",
                    "Services Composition Modeling with Mobility and Time.",
                    "A Hybrid Event-Processing Architecture based on the Model-driven Approach for High Performance Monitoring.",
                    "Towards Service Composition Based on Mashup.",
                    "The Resource-Oriented Architecture.",
                    "MCSAMS: A Novel WSRF and Multi-agent based Distributed Multimedia Content Service Alliance and Management Scheme.",
                    "Integrated Pricing Modeling for Digital Services Providers in Web 2.0 Envrionment.",
                    "A Study of Language-Action Perspective as a Theoretical Framework for Web Services.",
                    "Critical Review of Unsecured WEP.",
                    "A Systematic Analysis and Design Approach to Develop Adaptable Services in Service Oriented Computing."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd IEEE SCC 2006",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2006",
                "sub_name": "2006 IEEE International Conference on Services Computing (SCC 2006), 18-22 September 2006, Chicago, Illinois, USA.",
                "count": 107,
                "papers": [
                    "Web Services at Amazon.com.",
                    "Business Drivers for Services Computing.",
                    "Service Computing: The AppExchange Platform.",
                    "Software and Services: Where do they meet?",
                    "Web Services - A View from the Top.",
                    "Event-Driven Architectures and Complex Event Processing.",
                    "Mobile Web Services Trend Perspectives.",
                    "SOA and Web Services.",
                    "SOA Services and Solutions.",
                    "Automatic Web Service Composition.",
                    "Web Services on Rails: Using Ruby and Rails for Web Services Development and Mashups.",
                    "Business Agility and Process Management.",
                    "Security in SOA and Web Services.",
                    "Ontology Reconciliation for Service-Oriented Computing.",
                    "Semantic Web Services for Human Activit.",
                    "m3po: An Ontology to Relate Choreographies to Workflow Models.",
                    "Compatibility of Service Contracts in Service-Oriented Ap.",
                    "The First Step of Introducing Risk Management for Prepossessing SLAs.",
                    "Multiagent Policy Architecture for Virtual Business Organizations.",
                    "A Distributed Service Management Infrastructure for Enterprise Data Centers Based on Peer-to-Peer Technology.",
                    "Ubiquitous Provision of Context Aware Web Services.",
                    "A Language-based Approach to Service Deployment.",
                    "A Knowledge Model-driven Recommender System for Business Transformation.",
                    "An OO based Semantic Model for Service Oriented Computing.",
                    "Piloting an Empirical Study on Measures forWorkflow Similarity.",
                    "Business Process Adaptations via Protocols.",
                    "Designing Enterprise Solutions with Web Services and Integration Patterns.",
                    "Model- and Architecture-Driven Development in the Context of Cross-Enterprise Business Process Engineering.",
                    "QoS Support for Media Broadcast in a Services Oriented Architecture.",
                    "Service Oriented Architecture for E-health Support Services Based on Grid Computing Over.",
                    "A model for extending legacy applications by implementing new requirements as components.",
                    "SOAF: An Architectural Framework for Service Definition and Realization.",
                    "A Dynamic Service-Oriented Implementation for Java EE Servers.",
                    "Process control-flow complexity metric: An empirical validation.",
                    "Interoperability among Heterogeneous Services.",
                    "A Rule Driven Approach for Developing Adaptive Service Oriented Business Collaboration.",
                    "A Decentralized Services Choreography Approach for Business Collaboration.",
                    "Personalized Active Service Spaces for End-User Service Composition.",
                    "Control the Flow: How to Safely Compose Streaming Services into Business Processes.",
                    "A Model-Driven Approach to Service Composition in Virtual Enterprises.",
                    "Modeling Non-Functional Aspects in Service Oriented Architecture.",
                    "Service Views: a Coherent View Model of the SOA in the Enterprise.",
                    "Modeling and Verifying Configuration in Service Deployment.",
                    "Consideration of Operation Composition in Semantic Service Matchmaking.",
                    "A Framework & Negotiation Protocol for Service Contracts.",
                    "Evaluation of Strategies for Integrating Legacy Applications as Services in a Service Oriented Architecture.",
                    "Towards a Low-Cost High-Quality Service Call Architecture.",
                    "Memory Servers: A Scope of SOA for High-End Computing.",
                    "How Clustering Enterprise Architectures helps to Design Service Oriented Architectures.",
                    "An Approach to Modeling Service-Oriented Development Process.",
                    "On Exploiting System Dynamics Modeling to Identify Service Requirements.",
                    "Model Driven Distribution of Collaborative Business Processes.",
                    "Co-Innovation in a Service Oriented Strategic Network.",
                    "Using Assumptions in Service Composition Context.",
                    "Individual Tariffs for Mobile Services: Bargaining Model and Calculation.",
                    "Large Scale Order Processing through Navigation Plan Concept.",
                    "Discovering HealthGrid Services.",
                    "A domain-specific service-oriented development environment.",
                    "Towards Scaleable and Adaptive Document Routing Services.",
                    "Coupling RDF/RSS and WSRP for Dynamic Reusable Portlets: An Approach and a Use Case.",
                    "Life Cycle Management of Personalized and Context-aware Mobile Services - Goals, Requirements and Interfaces.",
                    "An Application Streaming Service for Mobile Handheld Devices.",
                    "Introducing QoS Profiles in the Pricing of 3G Services.",
                    "Agent based Resource Brokering and Allocation in Wireless Grids.",
                    "Data Management System in Manufacturing Grid.",
                    "Develop Service Oriented Finance Business Processes: A Case Study in Capital Market.",
                    "Solution Architecture for N-Tier Applications.",
                    "Concepts for Service-Oriented Business Thinking.",
                    "Implementing Shared Data Services (SDS): A Proposed Approach.",
                    "Business Service Management: The Impact of IT Governance Models on IT Management Policies.",
                    "A safety criterion for reusing a business process in the desired integrated.",
                    "Linking contracts, processes and services: an event-driven approach.",
                    "Data Quality Management using Business Process Modeling.",
                    "The Workflow Based Architecture for Mobile Information Access in Occasionally Connected Computing.",
                    "Architecture for Service Request Driven Solution Delivery Using Grid Systems.",
                    "Semantic based Service-Oriented Grid Architecture for Business Processes.",
                    "A Novel Business Model for Web Service Composition.",
                    "Using Data Semantics to Enable Automatic Composition of Web Services.",
                    "A Requester-based Mediation Framework for Dynamic Invocation of Web Services.",
                    "Effective Acquisition of Geospatial Data Products in a Collaborative Grid Environment.",
                    "A Dynamic-SOA Home Control Gateway.",
                    "Applying Distributed Business Rules - The VIDRE Approach.",
                    "A SOA based Self-Adaptive PERSONAL MOBILITY MANAGER.",
                    "The MIDAS System: A Service Oriented Architecture for Automated Supply Chain Management.",
                    "Secure and Provable Service Support for Human-Intensive Real-Estate Processes.",
                    "SOA Industry Summit.",
                    "Drivers for SOA in the Transaction Banking Domain.",
                    "Contextual Spectrums in Technology and Information Platform.",
                    "Service-Oriented Computing Kit.",
                    "Optimal Asynchronous Service Scheduling in BISON.",
                    "Service Contract Template.",
                    "Enterprise Service Oriented Architecture (ESOA) Adoption Reference.",
                    "Building SOA based Solution for a Workforce M.",
                    "Beyond SOA: Context-Aware Composite Services.",
                    "The Service Integration Maturity Model: Achieving Flexibility in the Transformation to SOA.",
                    "An SOA Compass for Next Generation Networks.",
                    "Using State Machine to Integrate Human Activity into BPEL in Dartflow.",
                    "Towards Self-Composing, Prioritized and Consequential Services.",
                    "ITSGrid: A Novel Integrated Intelligent Transportation Information and Service Platform.",
                    "Web Services based SOA for Next Generation Telecom Networks.",
                    "Service-Oriented Modeling and Architecture for Realization of an SOA.",
                    "A Flexible Framework for Tools Integration using Service Oriented Architecture.",
                    "Towards a Service-oriented Participatory Design Studio Supported by UCLP.",
                    "Event-driven Dynamic Web Services Composition and Automation of Business Processes.",
                    "Mapping the QoS of the Services on the QoS of the Systems' Resources in an Adaptive Resource Management System.",
                    "Web Content Consistency Through Explicit Ownership Definition.",
                    "Content Grid Architecture for Pervasive Content Delivery."
                ]
            },
            {
                "sub_name_abbr": "conf/scw/2006",
                "sub_name": "Proceedings of the 2006 IEEE Services Computing Workshops (SCW 2006), 18-22 September 2006, Chicago, Illinois, USA.",
                "count": 26,
                "papers": [
                    "Complex Event Processing for Financial Services.",
                    "An Event-Driven Approach to Computerizing Clinical Guidelines Using XML.",
                    "From Events to Awareness.",
                    "A High-Level Query Language for Events.",
                    "Detecting Design Errors in Composite Events for Event Triggered Real-Time Systems Using Timed Automata.",
                    "The Business Impact of Event Processing: Why Mainstream Companies Will Soon Use A Lot More EDA.",
                    "Control-Based Scheduling in a Distributed Stream Processing System.",
                    "Implementation of a Complex Event Engine for the Web.",
                    "Decentralized Execution of Event-Driven Scientific Workflows.",
                    "Business Activity Monitoring of norisbank Taking the Example of the Application easyCredit and the Future Adoption of Complex Event Processing (CEP).",
                    "Incorporating Support for Event Algebra in Relational Stream Systems.",
                    "Life Event Oriented Architecture.",
                    "Publish/Subscribe Over Virtual XML Data.",
                    "Mapping Low and High Level Monitoring with Event Processing.",
                    "Securing Service-Oriented and Event-Driven Architectures Results of an Evaluation of Enterprise Security Frameworks.",
                    "Verifying Choreographic Descriptions of Web Services Based on CSP.",
                    "A Framework for Optimal Service Selection in Broker-Based Architectures with Multiple QoS Classes.",
                    "Model Driven Extra-Functional Properties for Web Services.",
                    "Architecture for Service Profiling.",
                    "RT-UML for modeling Real-Time Web Services.",
                    "Performance Modeling of WS-BPEL-Based Web Service Compositions.",
                    "Forming a Security Certification Enclave for Service-Oriented Architectures.",
                    "Data Standardization as the Basis for an Service-Oriented Architecture.",
                    "Towards Unified QoS/SLA Ontologies.",
                    "Semantic and Rules Based Event-Driven Dynamic Web Services Composition for Automation of Business Processes.",
                    "Discovering Semantic Web Services with and without a Common Ontology Commitment."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd IEEE SCC 2005",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2005",
                "sub_name": "2005 IEEE International Conference on Services Computing (SCC 2005), 11-15 July 2005, Orlando, FL, USA.",
                "count": 110,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Message from General Chairs.",
                    "Message from the Program Chairs.",
                    "Committees.",
                    "XML Data Services.",
                    "Web Services Composition: A Story of Models, Automata, and Logics.",
                    "Services Ecosystem.",
                    "Five Years of Software as a Service: The Good, the Bad and the Ugly.",
                    "Services Science: Services Innovation Research & Education.",
                    "Service-Based Computing Strategy & Planning.",
                    "Quality of Manageability of Web Services.",
                    "Experiences with Service Computing - A view from the Business World.",
                    "Model-Driven Security Based on a Web Services Security Architecture.",
                    "Reckoning Legislative Compliances with Service Oriented Architecture A Proposed Approach.",
                    "Trust2: Developing Trust in Peer-to-Peer Environments.",
                    "Gridcast1: A Grid and Web Service Broadcast Infrastructure.",
                    "GeneGrid: A Commercial Grid Service Oriented Virtual Bioinformatics Laboratory.",
                    "Trust Embedded Grid System for the Harmonization of Practical Requirements.",
                    "Contractual and Regulatory Compliance Challenges in Grid Computing Environments.",
                    "Toward Intention Aware Semantic Web Service Systems.",
                    "Efficient Integration of Fine-grained Access Control in Large-scale Grid Services.",
                    "Knowledge as a Service and Knowledge Breaching.",
                    "Discovery of Information Sources across Organizational Boundaries.",
                    "Online and Minimum-Cost Ad Hoc Delegation in e-Service Composition.",
                    "Context Aware Session Management for Services in Ad Hoc Networks.",
                    "Service Roaming in Mobile Applications.",
                    "Mobile and Cooperative Compounds of Multimedia Services.",
                    "Service-based Collaborative Workflow for DAME.",
                    "TowardWeb Services Interaction Styles.",
                    "Pyros - an environment for building and orchestrating open services.",
                    "Toward Formalizing Service Integration Glue Code.",
                    "Transforming Business Process Models: Enabling Programming at a Higher Level.",
                    "From BPEL4WS to OWL-S: Integrating E-Business Process Descriptions.",
                    "An Investigation on Service-Oriented Architecture for Constructing Distributed Web GIS Application.",
                    "A Service Management Facility for Java Platform.",
                    "Modeling and Monitoring Dynamic Dependency Environments.",
                    "Using a Rigorous Approach for Engineering Web Service Compositions: A Case Study.",
                    "Abacus: A Service-Oriented Programming Language for Grid Applications.",
                    "A Benchmark for Web Service Frameworks.",
                    "SOA Without Web Services: a Pragmatic Implementation of SOA for Financial Transactions Systems.",
                    "A Service Discovery Framework for Service Centric Systems.",
                    "Towards Agricultural Marketing Reforms: Web Services Orchestration Approach.",
                    "XWRAPComposer: A Multi-Page Data Extraction Service for Bio-Computing Applications.",
                    "Web Service Discovery Based on Behavior Signatures.",
                    "Similarity-based Web Service Matchmaking.",
                    "A Generalized Framework for Providing QoS Based Registry in Service Oriented Architecture.",
                    "A Policy-Based Approach for QoS Specification and Enforcement in Distributed Service-Oriented Architecture.",
                    "An Agent-based Resource Allocation Model for Grid Computing.",
                    "Bridging the Gap between Business and IT in Service Oriented Collaboration.",
                    "Service-Oriented Design with Aspects (SODA).",
                    "An ECA Rule-based Workflow Design Tool for Shanghai Grid.",
                    "A Multi-agent Negotiation Based Service Composition Method for On-demand Service.",
                    "Service retrieval based on behavioral speci.cation.",
                    "Fair BPEL Processes Transaction using Non-Repudiation Protocols.",
                    "Monitoring Access to Stateful Resources in Grid Environments.",
                    "P2P Grid: Service Oriented Framework for Distributed Resource Management.",
                    "ShanghaiGrid as An Information Service Grid: An Overview.",
                    "ALTER: Adaptive Failure Detection Services for Grids.",
                    "Title Page.",
                    "Copyright.",
                    "Message from General Chairs.",
                    "Distributed System Development Using Web Service and Enterprise Java Beans.",
                    "Designing and Implementing Enterprise Service Bus (ESB) and SOA Solutions.",
                    "Semantic Web Services Tutorial.",
                    "Quality of Service Specification and Management for XML Web Services.",
                    "Perspectives on Service Oriented Architecture.",
                    "Collaborative Business Transactions Management: Issues and Challenges.",
                    "Efficient Information Service Management Using Service Club in CROWN Grid.",
                    "Satisfying Database Service Level Agreements while Minimizing Cost through Storage QoS.",
                    "A Reconfigurable QoS Monitoring Framework For Professional Short Message Services in GSM Networks.",
                    "PEM: A Framework Enabling Continual Optimization of Workflow Process Executions Based upon Business Value Metrics.",
                    "Services and Autonomic Computing: A Practical Approach for Designing Manageability.",
                    "A Framework for Failure Impact Analysis and Recovery with Respect to Service Level Agreements.",
                    "Grid-Based Decision Support with Pro-Active Mobile Computing.",
                    "Service-Oriented Grid Architecture and Middleware Technologies for Collaborative E-Learning.",
                    "Job Scheduling of Savant for Grid Computing on RFID EPC Network.",
                    "Progressive Auction Based Resource Allocation in Service-Oriented Architecture.",
                    "Service-Oriented Agility: An initial analysis for the use of Agile methods for SOA development.",
                    "Applying SOA to Intelligent Transportation System.",
                    "Managing Collaborative Business Process in Knowledge-intensive Environment.",
                    "Implementation of Business Processes in Service-Oriented Systems.",
                    "Research on Business Goal Oriented Process Knowledge Retrieving.",
                    "Architectural Support for Automatic Service Composition.",
                    "Coordination & Enterprise Wide P2P Computing.",
                    "WebPeer: A P2P-based System for Publishing and Discovering Web Services.",
                    "An Advanced Accounting Service for AIX Systems.",
                    "Automatic E-Evidence Generation System and Duplicate Reduction.",
                    "An Approach to Deliver an Early Return on Investment during the Development of a Corporate Web Portal.",
                    "The Application of Utility Computing and Web-Services to Inventory Optimisation.",
                    "A XML-based Description Language and Execution Environment for Orchestrating Grid Jobs.",
                    "WeBaSeRex: Next Generation Internet Network Design using Web based Remote Execution environments.",
                    "Securing Mobile Product Ecology for Mobile Commerce (mC).",
                    "Building WEB services portals: implementation experiences.",
                    "Enhancing Presentation Level Integration of Remote Applications and Services in Web Portals.",
                    "Discovering Semantic Relations between Web Services Using Their Pre and Post-Conditions.",
                    "Web Services for a Semantic Web Integrated Architecture.",
                    "Short Circuit Switch An Intelligent Web Services Discovery and Invocation Engine.",
                    "Challenges to Reusable Services.",
                    "A Web Serivces Community Model for Services Fulfillment.",
                    "Supporting QoS Assessment and Monitoring in Virtual Organisations.",
                    "Designing Privacy Policies for Adopting RFID in the Retail Industry.",
                    "Comparative Analysis of BPEL4WS and a Grid Workflow Language Called GPEL.",
                    "A Framework of a Tree-based Grid Information Service.",
                    "A New Grid Workflow Description Language.",
                    "A wavelet based distributed ID model.",
                    "Using Ontologies for Distributed Workflow Management.",
                    "The Design and Implementation of Scalable Information Services in a Grid Environment.",
                    "Approaches to Establishing Multicast Overlays.",
                    "AWS-Net Traveler: Autonomic Web Services Framework for Autonomic Business Processes."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st IEEE SCC 2004",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEscc/2004",
                "sub_name": "2004 IEEE International Conference on Services Computing (SCC 2004), 15-18 September 2004, Shanghai, China.",
                "count": 102,
                "papers": [
                    "A Dynamic Two-Phase Commit Protocol for Self-Adapting Services.",
                    "A New Formal Model Based on P-System for Mobile Transactions.",
                    "Constraint Driven Web Service Composition in METEOR-S.",
                    "A Fine-Grained Access Control Model for Web Services.",
                    "Managing Trust in Active XML.",
                    "A Role based Access Control for Web Services.",
                    "A SRP Based Handler for Web Service Access Control.",
                    "Assessing the Risk and Value of Adopting Emerging and Unstable Web Services Specifications.",
                    "Performance Problems of Large Operational Systems Based on Web Services and a Solution.",
                    "A Framework for Provisioning of Complex e-Services.",
                    "Architecture of Sensor based Agricultural Information System for Effective Planning of Farm Activities.",
                    "A Web Services Environment for Internet-Scale Sensor Computing.",
                    "Location-Mediated Web Services Coordination in Ubiquitous Computing.",
                    "Towards Composing Information Providing Services.",
                    "IT Service Infrastructure for Integrative Systems Biology.",
                    "Case Study: Using Web Services for the Management of Environmental Data.",
                    "The Cost of Recovery Protocols in Web-based Database Systems.",
                    "Text Mining into Distributed Bioinformatics Workflows: A Web Services Implementation.",
                    "A Service Interoperability Assessment Model for Service Composition.",
                    "A Concept Model of Web Components.",
                    "A Generic Framework for Rapid Application Development of Mobile Web Services with Dynamic Workflow Management.",
                    "WS-EPM: Web Services for Enterprise Project Management.",
                    "WS-Trustworthy: A Framework for Web Services Centered Trustworthy Computing.",
                    "Contextual Collaboration: Platform and Applications.",
                    "Queueing Network-based Optimisation Techniques for Workload Allocation in Clusters of Computers.",
                    "A Contextualized Fault-tolerant Infrastructure for P2P Mobile Service Composition.",
                    "Replicating Web Applications On-Demand.",
                    "Building a Service-Oriented eBanking Platform.",
                    "An Ontology Based Content Model for Web Services Description.",
                    "Verification of Dynamic Process Model Change to Support the Adaptive Workflow.",
                    "RuleBAM: A Rule-Based Framework for Business Activity Management.",
                    "Introducing EAI and Service Components into Process Management.",
                    "Tools and Support for Deploying Applications on the Grid.",
                    "HOC-SA: A Grid Service Architecture for Higher-Order Components.",
                    "SH-MDS: A ShanghaiGrid Information Service Model.",
                    "Enhancing Grid Security with Trust Management.",
                    "A User-Level Framework for Scheduling within Service Execution Environments.",
                    "A Comparison of Alternative Web Service Allocation and Scheduling Policies.",
                    "Semantic View for Grid Services.",
                    "An Open Standard Description Language for Semantic Grid Services Assembly for Autonomic Computing Overlay.",
                    "Providing Data Transfer with QoS as Agreement-Based Service.",
                    "Towards Service Collaboration Model in Grid-based Zero Latency Data Stream Warehouse (GZLDSWH).",
                    "A Workflow Services Middleware Model on ShanghaiGrid.",
                    "Decentralized Resilient Grid Resource Management Overlay Networks.",
                    "Interaction and Coordination for Distributed Grid Computing.",
                    "Developing Services for Design Optimisation on the Grid.",
                    "Switching Cost, Market Effects and the Pricing Model of e-Commerce.",
                    "A Process Component Model for Enterprise Business Knowledge Reuse.",
                    "SQL Markup Language for Enterprise Integration.",
                    "A Comparison of Several Ensemble Methods for Text Categorization.",
                    "An Information Retrieval Model based on Probabilistic network.",
                    "Analyzing an Agent-Based Selective Information Retrieval.",
                    "Context Information Extraction of the Query Based on Single Document.",
                    "\"Google by Reformulation\": Modeling Search as Successive Refinement.",
                    "Ontology-based Information Retrieval of Web Services in Virtual Enterprise.",
                    "Rough Formal Concepts and Their Accuracies.",
                    "Segmenting the Web Document with Document Object Model.",
                    "Matchmaking for Semantic Web Services.",
                    "WormTest - A Status Monitoring Framework in Grid.",
                    "Intelligent Data Transferring Based on Semantic Web Services.",
                    "Grid Resource Specification Language based on XML and its usage in Resource Registry Meta-Service.",
                    "The Application of the BSP Model on DataGrid.",
                    "Using Web Services Implementing Collaborative Design for CAD Systems.",
                    "Web Semantics, Grid and Coalgebra.",
                    "An Infrastructure for E-Government Based on Semantic Web Services.",
                    "A New Method for Measuring the Bottleneck Bandwidth.",
                    "Identity Based Proxy-Signcryption Scheme from Pairings.",
                    "Optimistic Fair-exchange Protocols Based on DSA Signatures.",
                    "Research and Implementation of Remote Desktop Protocol Service Over SSL VPN.",
                    "Study on the Behavior-based Trust Model in Grid Security System.",
                    "Security Issues in Grid Environmen.",
                    "Balancing Access To Highly Accessed Keys In Peer-to-Peer Systems.",
                    "A Cooperative Computing Platform for Drug Discovery and Design.",
                    "Group Mobility Model in Mobile Peer-to-Peer Media Streaming System.",
                    "A Schema Integration Framework over Super-Peer based Network.",
                    "On the Union of Chord-like Networks.",
                    "On-Demand One-Time Overlay Multicast Tree for Multimedia Transmission over Large Internet Environment.",
                    "Analyzing Unstructured Peer-to-Peer Search Networks with QIL.",
                    "FTP-Based EDI vs. Web Services: A Case Study in the Retailer Industry.",
                    "Ontology-Based Universal Knowledge Grid: Enabling Knowledge Discovery and Integration on the Grid.",
                    "A Kind of Classification and Regression Tree Algorithm for Unusual Customers Recognition in Telecom Trade.",
                    "Freight Transportation System Based on Web Service.",
                    "Grid Service and JCA: An Effective Integration Strategy.",
                    "A New Architecture for OGSA-based Grid Information Service.",
                    "Evaluating Resource Backup Policies for Computational Grid.",
                    "MASSIVE: A Multidisciplinary Applications-Oriented Simulation and Visualization Environment.",
                    "Recent Advances in CFD Grid Application Platform.",
                    "Domain Decomposition for Applications Based on CFD-Grid .",
                    "A WSLA-based monitoring system for Grid Service-GSMon.",
                    "Developing Web Services in a Computational Grid Environment.",
                    "A Secure Model for Network-Attached Storage on the Grid.",
                    "Improved HTN Planning Approach for Service Composition.",
                    "A Fine-grained Parallel Programming Model for Grid Computing.",
                    "Ontology Mapping For Interaction in Agent Society.",
                    "Multi-Mobile Agents' Separation Scheme in Java Card Application for Mobile Agent's Security.",
                    "Supporting Intercultural Collaboration: An Agent Coordination Workflow Model.",
                    "Multi-Agent Based Distributed Control System for an Intelligent Robot.",
                    "A Conceptual Model of Agent Mediated Web Service.",
                    "Design and Implementation of an Agent-Based Web Services Platform for Electronic Commerce.",
                    "VICOS: A Framework for Session Management in Network Computing Infrastructure.",
                    "A Transaction-Oriented Framework for Composing Transactional Web Services.",
                    "Comparison of Continuous Flow Transmission Strategies over a Distributed Platform Based on Soap."
                ]
            }
        ]
    }
]