[
    {
        "name": "SCP",
        "year": "2022",
        "info": "2022: Volumes\n213,\n214,\n215,\n216,\n217,",
        "count": 38,
        "papers": [
            "SATDBailiff-mining and tracking self-admitted technical debt.",
            "Evaluating the impact of feature selection consistency in software prediction.",
            "The orchestrator's partner management framework for software ecosystems.",
            "Reversible computing and implicit computational complexity.",
            "Several lifted abstract domains for static analysis of numerical program families.",
            "Automated evolution of feature logging statement levels using Git histories and degree of interest.",
            "Decoding techniques applied to the compilation of CNOT circuits for NISQ architectures.",
            "Fast rule-based graph programs.",
            "Topological consistency preservation with graph transformation schemes.",
            "Sustaining and improving graduated graph consistency: A static analysis of graph transformations.",
            "Candidate test set reduction for adaptive random testing: An overheads reduction technique.",
            "Impacts of software community patterns on process and product: An empirical study.",
            "B model quality assessments on automated reachability repair with ISO/IEC 25010.",
            "Are you of value to me? A partner selection reference method for software ecosystem orchestrators.",
            "Parglare: A LR/GLR parser for Python.",
            "Locally weighted regression with different kernel smoothers for software effort estimation.",
            "A nearest-neighbor divide-and-conquer approach for adaptive random testing.",
            "User-driven diverse scenario exploration in model finders.",
            "Hermes: A reversible language for lightweight encryption.",
            "Tackling rapid technology changes by applying enterprise engineering theories.",
            "Time-symmetric Turing machines for computable involutions.",
            "Quantifying the interpretation overhead of Python.",
            "Modelling and verifying BDI agents with bigraphs.",
            "Test case prioritization with neuron valuation based pattern.",
            "Modal characterisation of simulation relations in probabilistic concurrent games.",
            "A refinement development approach for enhancing the safety of PLC programs with Event-B.",
            "A two-level formal model for Big Data processing programs.",
            "Formally verified architectural patterns of hybrid systems using proof and refinement with Event-B.",
            "Safety assurance of an industrial robotic control system using hardware/software co-verification.",
            "Trylock, a case for temporal logic and eternity variables.",
            "Introduction to reversal fuzzy switch graph.",
            "Formally verifying consistency of sequence diagrams for safety critical systems.",
            "Selected papers from the Rigorous State-Based Methods 7th International Conference, ABZ 2020, Ulm, Germany, May 27-29, 2020.",
            "Defending against Return-Oriented Programming attacks based on return instruction using static analysis and binary patch techniques.",
            "HBSniff: A static analysis tool for Java Hibernate object-relational mapping code smell detection.",
            "Compositional noninterference on hardware weak memory models.",
            "Revisiting occurrence typing.",
            "Effectful improvement theory."
        ]
    },
    {
        "name": "SCP",
        "year": "2021",
        "info": "2021: Volumes\n201,\n202,\n203,\n204,\n205,\n206,\n207,\n207,\n207,\n208,\n209,\n210,\n211,\n212",
        "count": 82,
        "papers": [
            "Efficient testing of GUI applications by event sequence reduction.",
            "Which monads Haskell developers use: An exploratory study.",
            "A family of multi-concept program synthesisers in Alloy⁎.",
            "Validating, verifying and testing timed data-flow reactive systems in Coq from controlled natural-language requirements.",
            "Preface - 22nd Brazilian Symposium on Formal Methods - SBMF 2019.",
            "PomCho: A tool chain for choreographic design.",
            "A clock-based dynamic logic for schedulability analysis of CCSL specifications.",
            "API recommendation for the development of Android App features based on the knowledge mined from App stores.",
            "Provably correct implementation of the AbC calculus.",
            "QaSD: A Quality-aware Strategic Dashboard for supporting decision makers in Agile Software Development.",
            "Preface.",
            "Anemone: A workbench for the Multi-Bach coordination language.",
            "Quantifying the similarity of non-bisimilar labelled transition systems.",
            "Hubs for VirtuosoNext: Online verification of real-time coordinators.",
            "Compositional workflow modeling with priority constraints.",
            "NewWave: Workflow engine.",
            "Toward safe and efficient reconfiguration with Concerto.",
            "Modelling digital avatars: A tuple space approach.",
            "Aggregate centrality measures for IoT-based coordination.",
            "A clock-based dynamic logic for the verification of CCSL specifications in synchronous systems.",
            "Preface for the special issue on tool papers of the 21st International Conference on Coordination Models and Languages, COORDINATION 2019.",
            "How to benefit from newbies' domain ignorance in software development projects.",
            "Preface to the Special Issue on Coordination and Self-Adaptiveness of Software Applications.",
            "Are requirements elicitation sessions influenced by participants' gender? An empirical experiment.",
            "Predicting software effort from use case points: A systematic review.",
            "Automated model extraction: From non-deterministic C code to active objects.",
            "Compatibility checking for asynchronously communicating software.",
            "Predicting issue types on GitHub.",
            "Ranking programming languages by energy efficiency.",
            "RML: Theory and practice of a domain specific language for runtime verification.",
            "Adaptive selection of classifiers for bug prediction: A large-scale empirical analysis of its performances and a benchmark study.",
            "Preface to the special issue on Formal Methods: Foundations and Applications.",
            "Improving software effort estimation using bio-inspired algorithms to select relevant features: An empirical study.",
            "Automated test generation for IEC 61131-3 ST programs via dynamic symbolic execution.",
            "Synthesizing safe policies under probabilistic constraints with reinforcement learning and Bayesian model checking.",
            "Preface to the Special Issue on Dependable Software Engineering: Theories, Tools and Applications (SETTA 2017).",
            "Applying the Isabelle Insider framework to airplane security.",
            "RT-MOBS: A compositional observer semantics of time Petri net for real-time property specification language based on μ-calculus.",
            "Verification of concurrent code from synchronous specifications.",
            "Fundamentals of Software Engineering (extended versions of selected papers of FSEN 2019).",
            "Kraken: A framework for enabling multi-device interaction-based testing of Android apps.",
            "Sciit: Embedding issue tracking in source control management.",
            "Probabilistic model checking for human activity recognition in medical serious games.",
            "NOD4J: Near-omniscient debugging tool for Java using size-limited execution trace.",
            "Formal security analysis for software architecture design: An expressive framework to emerging architectural styles.",
            "Specify and measure, cover and reveal: A unified framework for automated test generation.",
            "SWQL: A new domain-specific language for mining the social Web.",
            "Multi-task Ada code generation from synchronous dataflow programs on multi-core: Approach and industrial study.",
            "On the usage of JavaScript, Python and Ruby packages in Docker Hub images.",
            "Specify and measure, cover and reveal: A unified framework for automated test generation.",
            "SWQL: A new domain-specific language for mining the social Web.",
            "Multi-task Ada code generation from synchronous dataflow programs on multi-core: Approach and industrial study.",
            "On the usage of JavaScript, Python and Ruby packages in Docker Hub images.",
            "Specify and measure, cover and reveal: A unified framework for automated test generation.",
            "SWQL: A new domain-specific language for mining the social Web.",
            "Multi-task Ada code generation from synchronous dataflow programs on multi-core: Approach and industrial study.",
            "On the usage of JavaScript, Python and Ruby packages in Docker Hub images.",
            "Reuse estimate and interval prediction using MOGA-NN and RBF-NN in the functional paradigm.",
            "Minimizing Characterizing sets.",
            "A review of code reviewer recommendation studies: Challenges and future directions.",
            "Abstraction models for verifying resource adequacy of IMA systems at concept level.",
            "A dependently typed calculus with polymorphic subtyping.",
            "Lost in zero space - An empirical comparison of 0.y.z releases in software package distributions.",
            "Mechanical incrementalization of typing algorithms.",
            "Formal Techniques for Safety-Critical Systems (FTSCS 2018).",
            "Umple: Model-driven development for open source and education.",
            "Preface - FTSCS 2019.",
            "State identification for labeled transition systems with inputs and outputs.",
            "Loop invariance with break and continue.",
            "PAMELA: An annotation-based Java modeling framework.",
            "Combining state- and event-based semantics to verify highly available applications.",
            "A logic for reflective ASMs.",
            "Experiences on teaching alloy with an automated assessment platform.",
            "Service-oriented decomposition and verification of hybrid system models using feature models and contracts.",
            "KinZ an Azure Kinect toolkit for Python and Matlab.",
            "PAMOJA: A component framework for grammar-aware engineering.",
            "Update from the Editorial Team.",
            "Function translations and search-based transformation for MVL reversible circuit synthesis.",
            "Software-intensive Systems-of-Systems.",
            "Special Issue on Software Maintenance Tools at 35th International Conference on Software Maintenance and Evolution (ICSME 2019).",
            "Improving performance with hybrid feature selection and ensemble machine learning techniques for code smell detection.",
            "Notes on the maximality of reversible gate sets under borrow and ancilla closure."
        ]
    },
    {
        "name": "SCP",
        "year": "2020",
        "info": "2020: Volumes\n185,\n186,\n186,\n187,\n188,\n189,\n190,\n191,\n192,\n193,\n194,\n195,\n196,\n197,\n198,\n199,\n200",
        "count": 93,
        "papers": [
            "Parallel parameter synthesis algorithm for hybrid CTL.",
            "Guided just-in-time specialization.",
            "Automated amortised resource analysis for term rewrite systems.",
            "On probabilistic term rewriting.",
            "Correct composition in the presence of behavioural conflicts and dephasing.",
            "A formal actor-based model for streaming the future.",
            "Conditional transition systems with upgrades.",
            "Proving partial-correctness and invariance properties of transition-system models.",
            "A formal actor-based model for streaming the future.",
            "Conditional transition systems with upgrades.",
            "Proving partial-correctness and invariance properties of transition-system models.",
            "Polymorphic computation systems: Theory and practice of confluence with call-by-value.",
            "Modeling and verifying the topology discovery mechanism of OpenFlow controllers in software-defined networks using process algebra.",
            "Controller synthesis of service contracts with variability.",
            "Multi-agent systems with virtual stigmergy.",
            "Extracting symbolic transitions from TLA+ specifications.",
            "Formalizing SPARCv8 instruction set architecture in Coq.",
            "Automatic syntax error reporting and recovery in parsing expression grammars.",
            "Optimizing backbone filtering.",
            "Preface for the special issue of the 12th International Symposium on Theoretical Aspects of Software Engineering (TASE 2018).",
            "End-to-end information flow security for web services orchestration.",
            "Translating Alloy and extensions to classical B.",
            "A logical characterization of differential privacy.",
            "Finding compact proofs for infinite-data parameterised Boolean equation systems.",
            "Automation and consistency analysis of test cases written in natural language: An industrial context.",
            "Formalizing hierarchical scheduling for refinement of real-time systems.",
            "Pallene: A companion language for Lua.",
            "Bidirectionality in flow-sensitive demand-driven analysis.",
            "The optics of language-integrated query.",
            "Automated urban train control with hybrid Event-B: 'Tackling' the rugby club problem.",
            "Program extraction for mutable arrays.",
            "A component-based framework for certification of components in a cloud of HPC services.",
            "From CIL to Java bytecode: Semantics-based translation for static analysis leveraging.",
            "The MATLAB Toolbox for EnergyPLAN: A tool to extend energy planning studies.",
            "Beyond connected cars: A systems of systems perspective.",
            "Prioritizing versions for performance regression testing: The Pharo case.",
            "Automated reasoning framework for traceability management of system of systems.",
            "Preface to the Special Issue on Foundations of Coordination Languages and Self-Adaptive Systems (Foclasa 2018).",
            "Mutating code annotations: An empirical evaluation on Java and C# programs.",
            "Selected papers from the Brazilian Symposium on Formal Methods (SBMF 2017).",
            "On the verification of mission-related properties in software-intensive systems-of-systems architectural design.",
            "A formal, scalable approach to semantic interoperability.",
            "Programming interactions in collective adaptive systems by relying on attribute-based communication.",
            "Mediator: A component-based modeling language for concurrent and distributed systems.",
            "Inclusion algorithms for one-unambiguous regular expressions and their applications.",
            "A framework for assume-guarantee regression verification of evolving software.",
            "Complete algorithms for algebraic strongest postconditions and weakest preconditions in polynomial odes.",
            "Castor: Programming with extensible generative visitors.",
            "Programming language foundations in Agda.",
            "Formal verification of input-output mappings of tree ensembles.",
            "A debugging approach for live Big Data applications.",
            "A new modular implementation for stateful traits.",
            "Lean formalization of bounded grids and computable cellular automata defined thereover.",
            "The prevalence and severity of persistent ambiguity in software requirements specifications: Is a special effort needed to find them?",
            "Ready, set, Go!: Data-race detection and the Go language.",
            "Formalizing the dependency pair criterion for innermost termination.",
            "Improving the success rate of applying the extract method refactoring.",
            "Safe automated refactoring for intelligent parallelization of Java 8 streams.",
            "Handling B models in the PERF integrated verification framework: Formalised and certified embedding.",
            "Synthesizing and optimizing FDIR recovery strategies from fault trees.",
            "Linked weak reference arrays: A hybrid approach to efficient bulk finalization.",
            "Dynamic creation of source code models for the extraction of code metrics data through grammar querying.",
            "Revisiting monitors.",
            "Compositional model checking with divergence preserving branching bisimilarity is lively.",
            "A type-directed algorithm to generate random well-typed Java 8 programs.",
            "Reshape your layouts, not your programs: A safe language extension for better cache locality.",
            "A big step from finite to infinite computations.",
            "Abstracting gradual references.",
            "A framework for verifying deadlock and nondeterminism in UML activity diagrams based on CSP.",
            "CHOReVOLUTION: Service choreography in practice.",
            "A polymorphic RPC calculus.",
            "A domain-specific language for verifying software requirement constraints.",
            "Unifying semantic foundations for automated verification tools in Isabelle/UTP.",
            "Mechanization of coherence and adequacy: Being extrinsic extended to subtyping.",
            "Trace semantics and refinement patterns for real-time properties in event-B models.",
            "Abstract State Machines, Alloy, B, TLA, VDM and Z (ABZ 2018).",
            "Use case evolution analysis based on graph transformation with negative application conditions.",
            "REST4CEP: RESTful APIs for complex event processing.",
            "An optimal cut-off algorithm for parameterised refinement checking.",
            "BoundWarden: Thread-enforced spatial memory safety through compile-time transformations.",
            "EMIP: The eye movements in programming dataset.",
            "Editorial - Theoretical Aspects of Software Engineering (2017).",
            "Event-B formalization of a variability-aware component model patterns framework.",
            "Understanding stack overflow code quality: A recommendation of caution.",
            "Advances in Smalltalk technologies.",
            "The CLEARSY safety platform: 5 years of research, development and deployment.",
            "Transparent replication using metaprogramming in Cyan.",
            "Model checking safety and liveness via k-induction and witness refinement with constraint generation.",
            "SApHESIA: An agent-based model and a criticality-based heuristic for cooperatively coupling SoSs.",
            "EUD-MARS: End-user development of model-driven adaptive robotics software systems.",
            "Efficient counter-factual type error debugging.",
            "Medicine-by-wire: Practical considerations on formal techniques for dependable medical systems.",
            "Formal aspects of component software (FACS 2018)."
        ]
    },
    {
        "name": "SCP",
        "year": "2019",
        "info": "2019: Volumes\n169,\n170,\n171,\n172,\n173,\n174,\n175,\n176,\n177,\n178,\n179,\n180,\n181,\n182,\n183,\n184",
        "count": 79,
        "papers": [
            "On the expressiveness of modal transition systems with variability constraints.",
            "Debugopt: Debugging fully optimized natively compiled programs using multistage instrumentation.",
            "Checking business process evolution.",
            "Reasoning about connectors using Coq and Z3.",
            "Structure and behavior preserving statecharts refinements.",
            "Exploring the frequency and change proneness of dynamic feature pattern instances in PHP applications.",
            "Constrained synthesis from component libraries.",
            "Using gate-level side channel parameters for formally analyzing vulnerabilities in integrated circuits.",
            "Hierarchical featured state machines.",
            "Bisimilarity of open terms in stream GSOS.",
            "Unifying modal interface theories and compositional input/output conformance testing.",
            "Universal (meta-)logical reasoning: Recent successes.",
            "Model driven engineering of accessible and multi-platform graphical user interfaces by parameterized model transformations.",
            "Multi-core cyclic executives for safety-critical systems.",
            "A hierarchical verification approach to verify complex safety control systems based on STAMP.",
            "Session-ocaml: A session-based library with polarities and lenses.",
            "The early bird catches the worm: First verify, then monitor!",
            "Tracing sharing in an imperative pure calculus.",
            "A formal model for Multi Software Product Lines.",
            "An empirical comparative evaluation of gestUI to include gesture-based interaction in user interfaces.",
            "A family of heuristic search algorithms for feature model optimization.",
            "Selected papers of the Brazilian Symposium on Programming Languages (SBLP'15+16).",
            "The Dinamica EGO virtual machine.",
            "JetsonLEAP: A framework to measure power on a heterogeneous system-on-a-chip device.",
            "A monadic semantics for quantum computing in an object oriented language.",
            "Comparing the performance of concurrent hash tables implemented in Haskell.",
            "Memoized zipper-based attribute grammars and their higher order extension.",
            "A Scientific Workflow Management System for orchestration of parallel components in a cloud of large-scale parallel processing services.",
            "Automatic parallelization of recursive functions with rewriting rules.",
            "Verified simulation for robotics.",
            "Supporting automated containment checking of software behavioural models using model transformations and model checking.",
            "TrABin: Trustworthy analyses of binaries.",
            "Automated compositional importance splitting.",
            "On interval dynamic logic: Introducing quasi-action lattices.",
            "Formal techniques in the safety analysis of software components of a new dialysis machine.",
            "Formal Techniques for Safety-Critical Systems (FTSCS 2016).",
            "Three-valued bounded model checking with cause-guided abstraction refinement.",
            "Derivation representation using binary subtree sets.",
            "A didactic object-oriented, prototype-based visual programming environment.",
            "Measuring and analyzing code authorship in 1 + 118 open source projects.",
            "FSM quasi-equivalence testing via reduction and observing absences.",
            "A formal framework capturing real-time and stochastic behavior in connectors.",
            "Behavioral model identification and classification of multi-component systems.",
            "Understanding software developers' cognition in agile requirements engineering.",
            "Symbolic state space reduction with guarded terms for rewriting modulo SMT.",
            "Selected and extended papers from FACS 2016.",
            "Finite complete suites for CSP refinement testing.",
            "A formal model of data access for multicore architectures with multilevel caches.",
            "A type system for first-class layers with inheritance, subtyping, and swapping.",
            "A large-scale empirical exploration on refactoring activities in open source software projects.",
            "Preface to the special issue on Coordination Models and Languages (Coordination 2017).",
            "A new decomposition-based method for detecting attractors in synchronous Boolean networks.",
            "Asynchronous sessions with implicit functions and messages.",
            "Extremo: An Eclipse plugin for modelling and meta-modelling assistance.",
            "Translating active objects into colored Petri nets for communication analysis.",
            "A declarative enhancement of JavaScript programs by leveraging the Java metadata infrastructure.",
            "An evolutionary approach to translating operational specifications into declarative specifications.",
            "A lightweight deadlock analysis for programs with threads and reentrant locks.",
            "Guest editorial for the special issue from the 18th Brazilian Symposium on Formal Methods (SBMF 2015).",
            "Test case generation, selection and coverage from natural language.",
            "CPN simulation-based test case generation from controlled natural-language requirements.",
            "SCJ-Circus: Specification and refinement of Safety-Critical Java programs.",
            "A calculus for dynamic architectures.",
            "A framework for automated conflict detection and resolution in medical guidelines.",
            "Ranking architecturally critical agglomerations of code smells.",
            "Fundamentals of Software Engineering (extended versions of selected papers of FSEN 2017).",
            "Preface: Special Issue on Verification of Objects at Runtime Execution.",
            "Soft component automata: Composition, compilation, logic, and verification.",
            "Reconfigurable GSPNs: A modeling formalism of evolvable discrete-event systems.",
            "A rewriting logic approach to resource allocation analysis in business process models.",
            "Test-data generation directed by program path coverage through imperialist competitive algorithm.",
            "BSP abstract state machines capture bulk synchronous parallel computations.",
            "Dependency safety for Java - Implementing and testing failboxes.",
            "Coordination in Socio-technical Systems: Where are we now? Where do we go next?",
            "Abstract machines for Open Call-by-Value.",
            "A modeling approach for Systems-of-Systems by adapting ISO/IEC/IEEE 42010 Standard evaluated by Goal-Question-Metric.",
            "Modelling concurrent objects running on the TSO and ARMv8 memory models.",
            "Type-2 effectivity in abstract state machines for algorithms with exact real arithmetic.",
            "RRPlib: A spark library for representing HDFS blocks as a set of random sample data blocks."
        ]
    },
    {
        "name": "SCP",
        "year": "2018",
        "info": "2018: Volumes\n151,\n152,\n153,\n154,\n155,\n156,\n157,\n158,\n159,\n160,\n161,\n162,\n163,\n164,\n165,\n166,\n167,\n168",
        "count": 123,
        "papers": [
            "Preface for the special issue of the 8th Conference on Reversible Computation (RC 2016).",
            "A finite alternation result for reversible boolean circuits.",
            "Local reversibility in a Calculus of Covalent Bonding.",
            "Reversible computation vs. reversibility in Petri nets.",
            "A case study of using grounded analysis as a requirement engineering method: Identifying personas that specify privacy and security tool users.",
            "Translating essential OCL invariants to nested graph constraints for generating instances of meta-models.",
            "ESBMC-GPU A context-bounded model checking tool to verify CUDA programs.",
            "A unified view of monadic and applicative non-determinism.",
            "An experimental comparison of edge, edge-pair, and prime path criteria.",
            "All roads lead to Rome: Commuting strategies for product-line reliability analysis.",
            "Combining range and inequality information for pointer disambiguation.",
            "An efficient TCTL model checking algorithm and a reduction technique for verification of timed actor models.",
            "Gitana: A software project inspector.",
            "Formal Techniques for Safety-Critical Systems (FTSCS 2015).",
            "Variant-based satisfiability in initial algebras.",
            "Periodic scheduling for MARTE/CCSL: Theory and practice.",
            "Verification of the European Rail Traffic Management System in Real-Time Maude.",
            "Formal analysis of feature degradation in fault-tolerant automotive systems.",
            "Formal analysis of a calculus for WSNs from quality perspective.",
            "Preface for SCP special issue on Principles and Practice of Declarative Programming.",
            "Some trade-offs in reducing the overhead of assertion run-time checks via static analysis.",
            "Effect-dependent transformations for concurrent programs.",
            "Typechecking protocols with Mungo and StMungo: A session type toolchain for Java.",
            "Rewriting induction for constrained inequalities.",
            "Language-integrated provenance.",
            "Exploration of language specifications by compilation to first-order logic.",
            "Higher-order logic programming: An expressive language for representing qualitative preferences.",
            "Towards the systematic analysis of non-functional properties in Model-Based Engineering for real-time embedded systems.",
            "Modelling, formal refinement and partitioning strategies for a small aircraft fuel pump system in Hybrid Event-B.",
            "A tool for publishing reproducible algorithms & A reproducible, elegant algorithm for sequential experiments.",
            "The two paradigms of software development research.",
            "An ontology-based approach with which to assign human resources to software projects.",
            "Method safety mechanism for asynchronous layer deactivation.",
            "Introduction to the special issue from Petri Nets 2016.",
            "Simulation of multicellular populations with Petri nets and genome scale intracellular networks.",
            "Industrial applications of the PetriDotNet modelling and analysis tool.",
            "Pre-synthesis of Petri nets based on prime cycles and distance paths.",
            "Software development with Petri nets and agents: Approach, frameworks and tool set.",
            "Realizability of schedules by stochastic time Petri nets with blocking semantics.",
            "Introduction to the ABZ 2016 Special issue.",
            "Encoding TLA+ into unsorted and many-sorted first-order logic.",
            "Symbolic execution for a clash-free subset of ASMs.",
            "Proof assisted bounded and unbounded symbolic model checking of software and system models.",
            "A machine-checked correctness proof for Pastry.",
            "Enabling analysis for Event-B.",
            "Formal methods and finite element analysis of hurricane storm surge: A case study in software verification.",
            "Validating and verifying the requirements and design of a haemodialysis machine using the Rodin toolset.",
            "Integrating formal methods into medical software development: The ASM approach.",
            "Variability abstractions for lifted analyses.",
            "Zone-based formal specification and timing analysis of real-time self-adaptive systems.",
            "Fundamentals of Software Engineering (extended versions of selected papers of FSEN 2015).",
            "Choreography Realizability Enforcement through the Automatic Synthesis of Distributed Coordination Delegates.",
            "Architecture-level configuration of industrial control systems: Foundations for an efficient approach.",
            "Centralized coordination vs. partially-distributed coordination with Reo and constraint automata.",
            "A study of mutable checkpointing and related algorithms.",
            "A theory of integrating tamper evidence with stabilization.",
            "Advances in Dynamic Languages.",
            "Test-driven development for generated portable Javascript apps.",
            "A feature-oriented model-driven engineering approach for the early validation of feature-based applications.",
            "Reducing resource consumption of expandable collections: The Pharo case.",
            "Efficient parsing with parser combinators.",
            "A critical analysis of string APIs: The case of Pharo.",
            "Mining inline cache data to order inferred types in dynamic languages.",
            "Improving live debugging of concurrent threads through thread histories.",
            "Lub: A pattern for fine grained behavior adaptation at runtime.",
            "Preface for the special issue of the 10th International Symposium on Theoretical Aspects of Software Engineering (TASE 2016).",
            "A new roadmap for linking theories of programming and its applications on GCL and CSP.",
            "Sound conformance testing for cyber-physical systems: Theory and implementation.",
            "Agile validation of model transformations using compound F-Alloy specifications.",
            "Formal proof of dynamic memory isolation based on MMU.",
            "State-taint analysis for detecting resource bugs.",
            "Simulation-based matching of cloud applications.",
            "Lightweight energy consumption analysis and prediction for Android applications.",
            "AATT+: Effectively manifesting concurrency bugs in Android apps.",
            "A two-step approach for pattern-based API-call constraint checking.",
            "Technical Debt tracking: Current state of practice: A survey and multiple case study in 15 large organizations.",
            "Improving custom-tailored variability mining using outlier and cluster detection.",
            "A tool for domain-independent model mutation.",
            "Projected control graph for computing relevant program behaviors.",
            "FBDTester 2.0: Automated test sequence generation for FBD programs with internal memory states.",
            "Preface for the Special Issue on the 23rd Asia-Pacific Software Engineering Conference (APSEC) 2016.",
            "Context-aware reconfiguration in evolving software product lines.",
            "A practical approach for detecting multi-tenancy data interference.",
            "Specification and verification of synchronization with condition variables.",
            "Preface: Functional and Logic Programming (FLOPS 2016).",
            "Logic/Constraint Programming and Concurrency: The hard-won lessons of the Fifth Generation Computer project.",
            "Incremental computing with data structures.",
            "Embedding the refinement calculus in Coq.",
            "A Coq library for internal verification of running-times.",
            "Space-efficient acyclicity constraints: A declarative pearl.",
            "A modular foreign function interface.",
            "Boolean constraints in SWI-Prolog: A comprehensive system description.",
            "Preface for the special issue of the 6th Brazilian Symposium on Computing System Engineering (SBESC 2016).",
            "Counterexample guided inductive optimization based on satisfiability modulo theories.",
            "Design and implementation of a cross-layer IoT protocol.",
            "Towards optimal solutions for the low power hard real-time task allocation on multiple heterogeneous processors.",
            "Accelerating error-tolerant applications with approximate function reuse.",
            "Workshop on Advances in Knowledge Extraction and Re-engineering of Software (selected and extended papers from WAKERS 2017).",
            "On checking delta-oriented product lines of statecharts.",
            "A formal approach to modeling and verification of business process collaborations.",
            "pCSSL: A stochastic extension to MARTE/CCSL for modeling uncertainty in Cyber Physical Systems.",
            "Towards naturalistic programming: Mapping language-independent requirements to constrained language specifications.",
            "GLL syntax analysers for EBNF grammars.",
            "Optimal single-path information propagation in gradient-based algorithms.",
            "Formal modeling and analysis of railway operations with active objects.",
            "Orchestrating incomplete TOSCA applications with Docker.",
            "A framework for defining coupling metrics.",
            "Checking multi-view consistency of discrete systems with respect to periodic sampling abstractions.",
            "A theory of retractable and speculative contracts.",
            "Reasoning about sensing uncertainty and its reduction in decision-making for self-adaptation.",
            "AdSiF: Agent driven simulation framework paradigm and ontological view.",
            "On the semantics and implementation of replicated data types.",
            "Towards attack-resistant Aggregate Computing using trust mechanisms.",
            "Stochastic analysis of BPMN with time in rewriting logic.",
            "Non-functional requirements in model-driven development of service-oriented architectures.",
            "Evaluation of a process for architectural assumption management in software development.",
            "AErlang: Empowering Erlang with attribute-based communication.",
            "Full-abstraction for client testing preorders.",
            "Many-to-many information flow policies.",
            "Actor-based macroscopic modeling and simulation for smart urban planning.",
            "AutoCRUD: Automatic generation of CRUD specifications in interaction flow modelling language.",
            "Preface: Special issue on Foundations of Coordination Languages and Self-adaptive Systems.",
            "Basic behavioral models for software product lines: Revisited."
        ]
    },
    {
        "name": "SCP",
        "year": "2017",
        "info": "2017: Volumes\n133,\n134,\n135,\n136,\n137,\n138,\n139,\n140,\n141-142,\n143,\n144,\n145,\n146,\n147,\n148,\n149,\n150",
        "count": 76,
        "papers": [
            "Live Robot Programming: The language, its implementation, and robot API independence.",
            "Checking global usage of resources handled with local policies.",
            "Message safety in Dart.",
            "Improved precision in polyhedral analysis with wrapping.",
            "Formal Techniques for Safety-Critical Systems (FTSCS 2014).",
            "Formal modelling and verification of interlocking systems featuring sequential release.",
            "Dynamic state machines for modelling railway control systems.",
            "FAMe-TM: Formal analysis methodology for task migration algorithms in Many-Core systems.",
            "Parallelism analysis: Precise WCET values for complex multi-core systems.",
            "On the verification of SCOOP programs.",
            "Analyzing a wind turbine system: From simulation to formal verification.",
            "Guest editors' introduction to the 6th issue of Experimental Software and Toolkits (EST-6).",
            "Implementing record and refinement for debugging timing-dependent communication.",
            "Continuous quality assessment with inCode.",
            "Enabling PHP software engineering research in Rascal.",
            "Cost-effective evolution of research prototypes into end-user tools: The MACH case study.",
            "Mercury: Using the QuPreSS reference model to evaluate predictive services.",
            "JPC: A library for categorising and applying inter-language conversions between Java and Prolog.",
            "Managing facts and resources with the Pica IDE infrastructure library.",
            "Preface to the special issue on advances in software measurement.",
            "Evolutionary coupling measurement: Making sense of the current chaos.",
            "An ontology-based approach for integrating tools supporting the software measurement process.",
            "On tackling quality threats for the assessment of measurement programs: A case study on the distribution of metric usage and knowledge.",
            "Benchmarking IT operations cost based on working time and unit cost.",
            "Functional change impact analysis in use cases: An approach based on COSMIC functional size measurement.",
            "Analyzing the performance of two COSMIC approximation sizing techniques at the functional process level.",
            "Reactive model transformation with ATL.",
            "An aspect-oriented model-driven approach for building adaptable context-aware service-based applications.",
            "A semi-automatic system to evaluate the performance and scalability of ontology persistent APIs.",
            "Selected and extended papers from Partial Evaluation and Program Manipulation 2015 (PEPM'15).",
            "Verifying relational properties of functional programs by first-order refinement.",
            "Generalising tree traversals and tree transformations to DAGs: Exploiting sharing without the pain.",
            "Incremental evaluation of higher-order attributes.",
            "Constraint specialisation in Horn clause verification.",
            "Deciding conformance for bounded responsiveness.",
            "Projecting programs on specifications: Definition and implications.",
            "Core Hybrid Event-B II: Multiple cooperating Hybrid Event-B machines.",
            "A Python framework for programming autonomous robots using a declarative approach.",
            "Preface to the special section on Object-Oriented Programming and Systems (OOPS 2015).",
            "End-user abstractions for meta-control: Reifying the reflectogram.",
            "Adaptive just-in-time value class optimization for lowering memory consumption and improving execution time performance.",
            "Typing and semantics of asynchronous arrows in JavaScript.",
            "A multiple camera calibration and point cloud fusion tool for Kinect V2.",
            "cf4ocl: A C framework for OpenCL.",
            "Specification refinements: Calculi, tools, and applications.",
            "Parallel set similarity join on big data based on Locality-Sensitive Hashing.",
            "Inferring software behavioral models with MapReduce.",
            "Preface to Special issue with extended selected papers from FACS 2015.",
            "Formal architecture modeling of sequential non-recursive C programs.",
            "Typed connector families and their semantics.",
            "Constraint automata with memory cells and their composition.",
            "Asynchronous synthesis techniques for coordinating autonomic managers in the cloud.",
            "Preface for selected and extended papers from Principles and Practice of Declarative Programming (PPDP'15).",
            "Improvements in a call-by-need functional core language: Common subexpression elimination and resource preserving translations.",
            "Static analysis of cloud elasticity.",
            "Modeling and solving planning problems in tabled logic programming: Experience from the Cave Diving domain.",
            "Semantics-based generation of verification conditions via program specialization.",
            "Concolic testing for functional languages.",
            "Preface for selected and extended papers from Principles and Practice of Declarative Programming (PPDP'15).",
            "Improvements in a call-by-need functional core language: Common subexpression elimination and resource preserving translations.",
            "Static analysis of cloud elasticity.",
            "Modeling and solving planning problems in tabled logic programming: Experience from the Cave Diving domain.",
            "Semantics-based generation of verification conditions via program specialization.",
            "Concolic testing for functional languages.",
            "Preface for selected and extended papers from Principles and Practice of Declarative Programming (PPDP'15).",
            "Improvements in a call-by-need functional core language: Common subexpression elimination and resource preserving translations.",
            "Static analysis of cloud elasticity.",
            "Modeling and solving planning problems in tabled logic programming: Experience from the Cave Diving domain.",
            "Semantics-based generation of verification conditions via program specialization.",
            "Concolic testing for functional languages.",
            "Preface for selected and extended papers from Principles and Practice of Declarative Programming (PPDP'15).",
            "Improvements in a call-by-need functional core language: Common subexpression elimination and resource preserving translations.",
            "Static analysis of cloud elasticity.",
            "Modeling and solving planning problems in tabled logic programming: Experience from the Cave Diving domain.",
            "Semantics-based generation of verification conditions via program specialization.",
            "Concolic testing for functional languages."
        ]
    },
    {
        "name": "SCP",
        "year": "2016",
        "info": "2016: Volumes\n115-116,\n117,\n118,\n119,\n120,\n121,\n122,\n123,\n124,\n125,\n126,\n127,\n128,\n129,\n130,\n131,\n132",
        "count": 93,
        "papers": [
            "Foreword.",
            "A formal model of service-oriented dynamic object groups.",
            "Adaptability checking in complex systems.",
            "A procedure for splitting data-aware processes and its application to coordination.",
            "Blackboard rules: From a declarative reading to its application for coordinating context-aware applications in mobile ad hoc networks.",
            "Parameterized, concurrent session types for asynchronous multi-actor interactions.",
            "A process-theoretic approach to supervisory coordination under partial observation.",
            "Special section on Foundations of Coordination Languages and Software Architectures.",
            "On the introduction of density in tuple-space coordination languages.",
            "Finding available services in TOSCA-compliant clouds.",
            "Global consensus through local synchronization: A formal basis for partially-distributed coordination.",
            "A tag contract framework for modeling heterogeneous systems.",
            "Formal design of dynamic reconfiguration protocol for cloud applications.",
            "A type-sound calculus of computational fields.",
            "Preface to the special issue on Formal Methods for Industrial Critical Systems (FMICS'2014).",
            "Formal specification and verification of TCP extended with the Window Scale Option.",
            "An improved fault-tolerant routing algorithm for a Network-on-Chip derived with formal analysis.",
            "Assertion-based monitoring in practice - Checking correctness of an automotive sensor interface.",
            "Randomised testing of a microprocessor model using SMT-solver state generation.",
            "Improving static analyses of C programs with conditional predicates.",
            "Selected papers of the Brazilian Symposium on Programming Languages 2014 (SBLP'14).",
            "Effect capabilities for Haskell: Taming effect interference in monadic programming.",
            "Avoiding code pitfalls in Aspect-Oriented Programming.",
            "Efficiently intertwining widening and narrowing.",
            "Model-based mutation testing - Approach and case studies.",
            "Special Issue on Knowledge-based Software Engineering.",
            "Reinforcing the applicability of multi-model environments for software process improvement using knowledge management.",
            "SMORE: Towards a semantic modeling for knowledge representation on social media.",
            "Early knowledge organization assisted by aspects.",
            "Knowledge discovery in software teams by means of evolutionary visual software analytics.",
            "How organisation of architecture documentation affects architectural knowledge retrieval.",
            "Making explicit domain knowledge in formal system development.",
            "TextFlows: A visual programming platform for text mining and natural language processing.",
            "Tracing known security vulnerabilities in software repositories - A Semantic Web enabled modeling approach.",
            "Knowledge representation and information extraction for analysing architectural patterns.",
            "Safe and efficient runtime testing framework applied in dynamic and distributed systems.",
            "Selected and extended papers from ACM SVT 2014.",
            "Runtime enforcement of regular timed properties by suppressing and delaying events.",
            "Basic behavioral models for software product lines: Expressiveness and testing pre-orders.",
            "Ambiguity and constrained polymorphism.",
            "Structuring the GLL parsing algorithm for performance.",
            "Preface to SCP special issue with extended selected papers from SBMF 2014.",
            "Heterogeneous verification in the context of model driven engineering.",
            "Towards Turing computability via coinduction.",
            "A family of test selection criteria for Timed Input-Output Symbolic Transition System models.",
            "Proof theory for hybrid(ised) logics.",
            "Parameterised three-valued model checking.",
            "Preface for the special issue of the 11th International Symposium on Formal Aspects of Component Software.",
            "On-the-fly construction of provably correct service compositions - templates and proofs.",
            "A formal approach for managing component-based architecture evolution.",
            "Adaptation impact and environment models for architecture-based self-adaptive systems.",
            "Algorithmic verification of procedural programs in the presence of code variability.",
            "Statistical and exact schedulability analysis of hierarchical scheduling systems.",
            "Preface of Special issue on Automated Verification of Critical Systems (AVoCS'14).",
            "Validation process for railway interlocking systems.",
            "PTRebeca: Modeling and analysis of distributed and asynchronous systems.",
            "On the random structure of behavioural transition systems.",
            "Model checking C++ programs with exceptions.",
            "Special issue on eLearning Software Architectures.",
            "Facilitating professionals' work-based learning with context-aware mobile system.",
            "Architectural pattern to improve the definition and implementation of eLearning ecosystems.",
            "An architecture for modular grading and feedback generation for complex exercises.",
            "Model-driven processes and tools to design robot-based generative learning objects for computer science education.",
            "Architecture of a concept-based information retrieval system for educational resources.",
            "Software architecture for integration of institutional and social learning environments.",
            "Special section on Graph Inspection and Traversal Engineering (GRAPHITE 2014).",
            "Specifying and executing optimizations for generalized control flow graphs.",
            "Using graph distances for named-entity linking.",
            "Lessons from Dutch IT-outsourcing success and failure.",
            "Process-aware web programming with Jolie.",
            "Kin2. A Kinect 2 toolbox for MATLAB.",
            "Introduction to the ABZ 2014 special issue.",
            "Modular, crash-safe refinement for ASMs with submachines.",
            "Towards a comprehensive extension of abstract state machines for aspect-oriented specification.",
            "Serialisable multi-level transaction control: A specification and verification.",
            "Large-scale system development using Abstract Data Types and refinement.",
            "A formal validation of the RBAC ANSI 2012 standard using B.",
            "The correctness of event-B inductive convergence.",
            "Translating B to TLA+ for validation with TLC.",
            "Formal development of multi-agent systems using MAZE.",
            "Selected and extended papers from SBLP 2013.",
            "Embedding attribute grammars and their extensions using functional zippers.",
            "Performance evaluation of virtual execution environments for intensive computing on usual representations of multidimensional arrays.",
            "A method for rigorous design of reconfigurable systems.",
            "Multiple intermediate structure deforestation by shortcut fusion.",
            "Contextual abstraction in a type system for component-based high performance computing platforms.",
            "Error reporting in Parsing Expression Grammars.",
            "Special issue on Software Verification and Testing (SAC-SVT'15).",
            "Model-based testing for building reliable realtime interactive music systems.",
            "CenUMs - concurrency enhanced usage models for statistical testing of complex systems with concurrent streams of use.",
            "Tri-modal under-approximation for test generation.",
            "Symmetry reduction for time Petri net state classes.",
            "Fast as a shadow, expressive as a tree: Optimized memory monitoring for C."
        ]
    },
    {
        "name": "SCP",
        "year": "2015",
        "info": "2015: Volumes\n97,\n98,\n99,\n100,\n101,\n102,\n103,\n104,\n105,\n106,\n107-108,\n109,\n110,\n111,\n112,\n113,\n114",
        "count": 206,
        "papers": [
            "Preface.",
            "Semantics of programming languages: Using Asf+Sdf.",
            "Understanding software through linguistic abstraction.",
            "The role of supervisory controller synthesis in automatic control software development.",
            "Constraint design rewriting.",
            "Extending a model-driven cross-platform development approach for business apps.",
            "Language-based software engineering.",
            "Developing correct, distributed, adaptive software.",
            "Syntactic-semantic incrementality for agile verification.",
            "Experience with correctness-by-construction.",
            "Parse views with Boolean grammars.",
            "Principled software microengineering.",
            "Understanding information update in questionnaires.",
            "Software engineering: Redundancy is key.",
            "Generative software complexity and software understanding.",
            "Understanding software artifact provenance.",
            "Infeasible paths in object-oriented programs.",
            "Software chrestomathies.",
            "Towards evidence-based recommendations to guide the evolution of component-based product families.",
            "Understanding database schema evolution: A case study.",
            "Understanding probabilistic software leaks.",
            "Source-code queries with graph databases - with application to programming language usage and evolution.",
            "Towards base rates in software analytics: Early results and challenges from studying Ohloh.",
            "Towards multilingual programming environments.",
            "Parsing for agile modeling.",
            "Verifying pointer programs using graph grammars.",
            "Alias calculus, change calculus and frame inference.",
            "Crawl-based analysis of web applications: Prospects and challenges.",
            "Special issue on Service-Oriented Architecture and Programming (SOAP 2013).",
            "Service composition with consideration of interdependent security objectives.",
            "Rule-based peer-to-peer framework for decentralised real-time service oriented architectures.",
            "Disciplined structured communications with disciplined runtime adaptation.",
            "Improving data-intensive EDA performance with annotation-driven laziness.",
            "Preface to the special section on Object-Oriented Programming and Systems (OOPS 2010).",
            "Implementing type-safe software product lines using parametric traits.",
            "Scheduling intense applications most 'surprising' first.",
            "Axioms as generic rewrite rules in C++ with concepts.",
            "Modeling and analysis of compositional software (papers from EUROMICRO SEAA'12).",
            "Contracts-refinement proof system for component-based embedded systems.",
            "Repository and meta-data design for efficient component consistency verification.",
            "New degrees of freedom in metaheuristic optimization of component-based systems architecture: Architecture topology and load balancing.",
            "Special issue: Selected papers from the 12th International Conference on Quality Software (QSIC 2012).",
            "Model-based mutation testing via symbolic refinement checking.",
            "Automatic generation of valid and invalid test data for string validation routines using web searches and regular expressions.",
            "Reliability prediction for component-based software systems: Dealing with concurrent and propagating errors.",
            "Guest editors' introduction to the fifth issue of Experimental Software and Toolkits (EST): A special issue on Academics Modelling with Eclipse (ACME2012).",
            "MeTAGeM-Trace: Improving trace generation in model transformation by leveraging the role of transformation models.",
            "Grammar Zoo: A corpus of experimental grammarware.",
            "A tool for visual and formal modelling of software designs.",
            "EMF-IncQuery: An integrated development environment for live model queries.",
            "Introduction to dynamic program analysis with DiSL.",
            "Special issue on programming based on actors, agents and decentralized control.",
            "A feature model of actor, agent, functional, object, and procedural programming languages.",
            "Domains: Safe sharing among actors.",
            "Parallel gesture recognition with soft real-time guarantees.",
            "Timed Rebeca schedulability and deadlock freedom analysis using bounded floating time transition system.",
            "Adding distribution and fault tolerance to Jason.",
            "Towards behavioral programming in distributed architectures.",
            "A use-case for behavioral programming: An architecture in JavaScript and Blockly for interactive applications with cross-cutting scenarios.",
            "Optimized distributed implementation of multiparty interactions with Restriction.",
            "Advances in Dynamic Languages.",
            "Handles: Behavior-propagating first class references for dynamically-typed languages.",
            "Ghost: A uniform and general-purpose proxy implementation.",
            "Computational contracts.",
            "Visually characterizing source code changes.",
            "Object-focused environments revisited.",
            "The impact of meta-tracing on VM design and implementation.",
            "Robust trait composition for Javascript.",
            "Managing the evolution of a software architecture at minimal cost under performance and reliability constraints.",
            "Safety assessment of AltaRica models via symbolic model checking.",
            "Approximate by thinning: Deriving fully polynomial-time approximation schemes.",
            "A basis for compositionally ensuring safety properties and its connection to relational algebraic operators.",
            "EVL: A framework for multi-methods in C++.",
            "Reducing operational costs through MIPS management.",
            "XPL: A language for modular homogeneous language embedding.",
            "Reusing metadata across components, applications, and languages.",
            "Two techniques to improve the precision of a demand-driven null-dereference verification approach.",
            "Extraction of domain concepts from the source code.",
            "An integrated framework for adapting WS-BPEL scenario execution using QoS and collaborative filtering techniques.",
            "Model checking of concurrent programs with static analysis of field accesses.",
            "A perspective on architectural re-engineering.",
            "Preface to Rewriting Logic and Its Applications (extended selected papers from WRLA 2012).",
            "A rule-based system for automatic decidability and combinability.",
            "Semantics, distributed implementation, and formal analysis of KLAIM models in Maude.",
            "Modelling and analyzing adaptive self-assembly strategies with Maude.",
            "Formal modeling and analysis of interacting hybrid systems in HI-Maude: What happened at the 2010 Sauna World Championships?",
            "Sound and complete timed CTL model checking of timed Kripke structures and real-time rewrite theories.",
            "Model checking linear temporal logic of rewriting formulas under localized fairness.",
            "Order-sorted equality enrichments modulo axioms.",
            "Preface for the special issue on Interaction and Concurrency Experience 2012.",
            "A design-by-contract approach to recover the architectural style from run-time misbehaviour.",
            "Shared contract-obedient channels.",
            "Model checking recursive programs interacting via the heap.",
            "Weak CCP bisimilarity with strong procedures.",
            "Towards general theories of software engineering.",
            "Modules and transactions: Building blocks for a theory of software engineering.",
            "The Sensemaking-Coevolution-Implementation Theory of software design.",
            "System components of a general theory of software engineering.",
            "Integrating software engineering theory and practice using essence: A case study.",
            "Theory-oriented software engineering.",
            "A framework for exploring unifying theories of empirical software engineering.",
            "Theorizing about software development practices.",
            "Six strategies for generalizing software engineering theories.",
            "Analyzing best practices on Web development frameworks: The lift approach.",
            "ContextErlang: A language for distributed context-aware self-adaptive applications.",
            "The effect of refactoring on change and fault-proneness in commercial C# software.",
            "Mutual exclusion by four shared bits with not more than quadratic complexity.",
            "The capacity-C torch problem.",
            "An expressive stateful aspect language.",
            "Symbolic execution as a basis for termination analysis.",
            "Preface.",
            "Technology transfer: Formal analysis, engineering, and business value.",
            "Designing and verifying distributed cyber-physical systems using Multirate PALS: An airplane turning control system case study.",
            "Efficient safety checking for automotive operating systems using property-based slicing and constraint-based environment generation.",
            "Generating property-directed potential invariants by quantifier elimination in a k-induction-based framework.",
            "Formal model-driven engineering of critical information systems.",
            "Preface for the Special Issue on Graph Transformation and Visual Modeling Techniques 2013.",
            "Co-evolving meta-models and their instance models: A formal approach based on graph transformation.",
            "Local confluence analysis of hypergraph transformation systems with application conditions based on M-functors and Agg.",
            "Robustness and closure properties of recognizable languages in adhesive categories.",
            "Special Section on Source Code Analysis and Manipulation (SCAM 2013).",
            "Empirical investigation of SEA-based dependence cluster properties.",
            "Irish: A Hidden Markov Model to detect coded information islands in free text.",
            "Relational symbolic execution of SQL code for unit testing of database programs.",
            "Usage contracts: Offering immediate feedback on violations of structural source-code regularities.",
            "Core Hybrid Event-B I: Single Hybrid Event-B machines.",
            "Computing end-to-end delays in stream query processing.",
            "Systematic derivation of correct variability-aware program analyses.",
            "Preface to the special issue: Architecture-Driven Semantic Analysis of Embedded Systems.",
            "DREMS ML: A wide spectrum architecture design language for distributed computing platforms.",
            "Towards a verified transformation from AADL to the formal component-based language FIACRE.",
            "Timed behavioural modelling and affine scheduling of embedded software architectures in the AADL using Polychrony.",
            "Correctness issues on MARTE/CCSL constraints.",
            "Selected papers from the Brazilian Symposiums on Formal Methods (SBMF 2012 and 2013).",
            "Algebraic graph transformations with inheritance and abstraction.",
            "Specifying linked data structures in JML for combining formal verification and testing.",
            "Institution-based foundations for verification in the context of model-driven engineering.",
            "A rewriting logic semantics for NCL.",
            "Preface for the special issue of Interaction and Concurrency Experience 2013.",
            "Offer semantics: Achieving compositionality, flattening and full expressiveness for the glue operators in BIP.",
            "Choreographies in the wild.",
            "Vicious circles in contracts and in logic.",
            "Modular encoding of synchronous and asynchronous interactions using open Petri nets.",
            "Preface to Formal Coordination and Self-organisation: Special section including selected best papers from CM 2012-2013.",
            "A coordination model of pervasive service ecosystems.",
            "On-the-fly PCTL fast mean-field approximated model-checking for self-organising coordination.",
            "A study of risk-aware program transformation.",
            "Reasoning about software reconfigurations: The behavioural and structural perspectives.",
            "A zoom-declarative debugger for sequential Erlang programs.",
            "Preface for SCP special issue on Principles and Practice of Declarative Programming.",
            "Theory propagation and reification.",
            "Extensible sparse functional arrays with circuit parallelism.",
            "Shape analysis in a functional language by using regular languages.",
            "\"Bidirectionalization for free\" for monomorphic transformations.",
            "A unified ordering for termination proving.",
            "Efficient algorithms for program equivalence for confluent concurrent constraint programming.",
            "Two type extensions for the constraint modeling language MiniZinc.",
            "Time refinement in a functional synchronous language.",
            "Special issue on Automated Verification of Critical Systems (AVoCS 2013).",
            "Interval-based data refinement: A uniform approach to true concurrency in discrete and real-time systems.",
            "Fully symbolic TCTL model checking for complete and incomplete real-time systems.",
            "Comparing model checkers for timed UML activity diagrams.",
            "Formal analysis of privacy in Direct Anonymous Attestation schemes.",
            "Building traceable Event-B models from requirements.",
            "Implementability of requirements in the four-variable model.",
            "Preface of the special issue on Foundational and Practical Aspects of Resource Analysis (FOPARA) 2009 & 2011.",
            "Light combinators for finite fields arithmetic.",
            "On bounding space usage of streams using interpretation analysis.",
            "Space consumption analysis by abstract interpretation: Inference of recursive functions.",
            "Space consumption analysis by abstract interpretation: Reductivity properties.",
            "A practical comparator of cost functions and its applications.",
            "Certifying execution time in multicores.",
            "Fundamentals of Software Engineering (selected papers of FSEN 2013).",
            "In the quantitative automata zoo.",
            "Constrained narrowing for conditional equational theories modulo axioms.",
            "Improving time bounded reachability computations in interactive Markov chains.",
            "Lending Petri nets.",
            "It is pointless to point in bounded heaps.",
            "Selected and extended papers from Partial Evaluation and Program Manipulation 2014.",
            "Combinators for impure yet hygienic code generation.",
            "Type-changing rewriting and semantics-preserving transformation.",
            "Optimizing SYB traversals is easy!",
            "Parallel parsing made practical.",
            "Cooperative types for controlling thread interference in Java.",
            "Preface for special issue on Model Driven Development: Extended versions of selected papers from MODELSWARD 2014.",
            "Collaborative editing of EMF/Ecore meta-models and models: Conflict detection, reconciliation, and merging in DiCoMEF.",
            "Signature required: Making Simulink data flow and interfaces explicit.",
            "A graph-based algorithm for three-way merging of ordered collections in EMF models.",
            "Preface.",
            "Formal semantics and efficient analysis of Timed Rebeca in Real-Time Maude.",
            "An algorithm for compositional nonblocking verification using special events.",
            "Formal verification of function blocks applied to IEC 61131-3.",
            "Designing a verifying compiler: Lessons learned from developing Whiley.",
            "Formal Aspects of Component Software (FACS 2013).",
            "A general framework for blaming in component-based systems.",
            "A reconfigurable framework for compositional schedulability and power analysis of hierarchical scheduling systems with frequency scaling.",
            "Automatic deployment of component-based applications.",
            "Modeling and verification of component connectors in Coq.",
            "Introduction - the LDTA tool challenge.",
            "Modular language implementation in Rascal - experience report.",
            "Oberon-0 in Kiama.",
            "A modular specification of Oberon0 using the Silver attribute grammar system.",
            "Compositional compiler construction: Oberon0.",
            "Combinators and type-driven transformers in Objective Caml.",
            "A JastAdd implementation of Oberon-0.",
            "Simpl DSL toolkit."
        ]
    },
    {
        "name": "SCP",
        "year": "2014",
        "info": "2014: Volumes\n79,\n80,\n81,\n82,\n83,\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91,\n92,\n93,\n94,\n95,\n96",
        "count": 242,
        "papers": [
            "Guest editors' introduction to the 4th issue of Experimental Software and Toolkits (EST-4).",
            "AspectMaps: Extending Moose to visualize AOP software.",
            "Executable formal specifications of complex distributed systems with CoreASM.",
            "DiaSuite: A tool suite to develop Sense/Compute/Control applications.",
            "Disnix: A toolset for distributed deployment.",
            "FeatureIDE: An extensible framework for feature-oriented software development.",
            "Increasing test coverage with Hapao.",
            "Jaccie: A Java-based compiler-compiler for generating, visualizing and debugging compiler components.",
            "JBInsTrace: A tracer of Java and JRE classes at basic-block granularity by dynamically instrumenting bytecode.",
            "jcolibri2: A framework for building Case-based reasoning systems.",
            "JP2: Call-site aware calling context profiling for the Java Virtual Machine.",
            "Tuning research tools for scalability and performance: The NiCad experience.",
            "The Process Enactment Tool Framework - Transformation of software process models to prepare enactment.",
            "Salespoint: A Java framework for teaching object-oriented software development.",
            "Evolutionary and collaborative software architecture recovery with Softwarenaut.",
            "The Solid* toolset for software visual analytics of program structure and metrics comprehension: From research prototype to product.",
            "Sourcerer: An infrastructure for large-scale collection and analysis of open-source code.",
            "Taupe: Visualizing and analyzing eye-tracking data.",
            "Preface: Special section on foundations of coordination languages and software architectures (selected papers from FOCLASA'10).",
            "A compositional model to reason about end-to-end QoS in Stochastic Reo connectors.",
            "Formal development of wireless sensor-actor networks.",
            "Brazilian Symposium on Programming Languages (SBLP 2010).",
            "Parallel actor monitors: Disentangling task-level parallelism from data partitioning in the actor model.",
            "An object-oriented parallel programming language for distributed-memory parallel computing platforms.",
            "Efficient static checker for tainted variable attacks.",
            "Preface: Special section on formal methods for industrial critical systems (Selected papers from FMICS'11).",
            "Runtime verification of microcontroller binary code.",
            "Formal analysis of a hardware dynamic task dispatcher with CADP.",
            "Observations on formal safety analysis in practice.",
            "A case study on the lightweight verification of a multi-threaded task server.",
            "Experiences with formal engineering: Model-based specification, implementation and testing of a software bus at Neopost.",
            "Automated verification of design patterns: A case study.",
            "Static safety guarantees for a low-level multithreaded language with regions.",
            "Specifying safety-critical systems with a decidable duration logic.",
            "Real-time verification of wireless home networks using bigraphs with sharing.",
            "Execution levels for aspect-oriented programming: Design, semantics, implementations and applications.",
            "A practical approach for testing timed deterministic finite state machines with single clock.",
            "Adaptation space exploration for service-oriented applications.",
            "Using conditional trace slicing for improving Maude programs.",
            "Formal semantics, modular specification, and symbolic verification of product-line behaviour.",
            "Recovering memory access patterns of executable programs.",
            "Studying software evolution using topic models.",
            "Preface of Automated Verification of Critical Systems 2010 (AVoCS 2010).",
            "CSP-based counter abstraction for systems with node identifiers.",
            "A semantic analysis of key management protocols for wireless sensor networks.",
            "A rewriting logic approach to the formal specification and verification of web applications.",
            "Reasoning about almost-certain convergence properties using Event-B.",
            "Special issue on Automated Verification of Critical Systems (AVoCS'11).",
            "A method and tool for tracing requirements into specifications.",
            "Concurrency control generation for dynamic threads using discrete-event systems.",
            "A symbolic model checking approach to verifying satellite onboard software.",
            "Automatically refining partial specifications for heap-manipulating programs.",
            "Software verification with VeriFast: Industrial case studies.",
            "Preface.",
            "Taming distributed system complexity through formal patterns.",
            "Reducing the verification cost of evolving product families using static analysis techniques.",
            "Synthesis of hierarchical systems.",
            "The logic of XACML.",
            "A modal specification theory for components with data.",
            "Preface for SCP special issue on Principles and Practice of Declarative Programming.",
            "Matrix Code.",
            "Exception handling for copyless messaging.",
            "On the semantics of parsing actions.",
            "Linear dependent types in a call-by-value scenario.",
            "Tor: Modular search with hookable disjunction.",
            "Guest editors' introduction to the first issue on Experimental Software Engineering in the Cloud (ESEiC).",
            "Evaluation of model transformation approaches for model refactoring.",
            "A survey and comparison of transformation tools based on the transformation tool contest.",
            "Selected papers from Mathematics of Program Construction 2012.",
            "The laws of programming unify process calculi.",
            "An old new notation for elementary probability theory.",
            "Deriving real-time action systems with multiple time bands using algebraic reasoning.",
            "First-past-the-post games.",
            "Concurrency and local reasoning under reverse exchange.",
            "Algebras for correctness of sequential computations.",
            "Preface to the special issue on Software Support for User Interface Description Languages (UIDL 2011).",
            "Bridging the gap between a behavioural formal description technique and a user interface description language: Enhancing ICO with a graphical user interface markup language.",
            "A graphical editor for the SMUIML multimodal user interaction description language.",
            "Automated UI evaluation based on a cognitive architecture and UsiXML.",
            "An approach to the integration of accessibility requirements into a user interface development method.",
            "A proposal for modelling usability in a holistic MDD method.",
            "Evolutionary design of user interfaces for workflow information systems.",
            "Preface to the Special Section on Language Descriptions, Tools, and Applications (LDTA 2011).",
            "Yield grammar analysis and product optimization in a domain-specific language for dynamic programming.",
            "Modular grammar specification.",
            "Modular type checking of anchored exception declarations.",
            "Improving workflow modularity using a concern-specific layer on top of Unify.",
            "Preface for the special issue on Software Development Concerns in the e-Learning Domain.",
            "Flexible learning itinerary vs. linear learning itinerary.",
            "Design and architecture of an interactive eTextbook - The OpenDSA system.",
            "Implementation and design of a service-based framework to integrate personal and institutional learning environments.",
            "Evaluating a graphical notation for modeling collaborative learning activities: A family of experiments.",
            "Open source software and the algorithm visualization community.",
            "Extending web-based educational systems with personalised support through User Centred Designed recommendations along the e-learning life cycle.",
            "Feedback services for stepwise exercises.",
            "Foreword.",
            "A verified algebra for read-write Linked Data.",
            "An algorithm to test the conflict preorder.",
            "Modelling and simulation of asynchronous real-time systems using Timed Rebeca.",
            "Guest editorial to the special issue on Success Stories in Model Driven Engineering.",
            "Large-scale Model-Driven Engineering of web user interaction: The WebML and WebRatio experience.",
            "Model-driven engineering of information systems: 10 years and 1000 versions.",
            "A model-integrated authoring environment for privacy policies.",
            "The CancerGrid experience: Metadata-based model-driven engineering for clinical trials.",
            "Model-driven engineering practices in industry: Social, organizational and managerial factors that lead to success or failure.",
            "Model-driven standardization of public authority data interchange.",
            "Applying model-driven engineering in small software enterprises.",
            "An MDE-based framework to support the development of Mixed Interactive Systems.",
            "Weakest preconditions and cumulative subgoal fulfillment.",
            "On the relation between context-free grammars and parsing expression grammars.",
            "How healthy are software engineering conferences?",
            "Exception analysis in the Java Native Interface.",
            "The Package Blueprint: Visually analyzing and quantifying packages dependencies.",
            "Model-driven development of interactive groupware systems: Integration into the software development process.",
            "The links between human error diversity and software diversity: Implications for fault diversity seeking.",
            "Refactoring code-first Web Services for early avoiding WSDL anti-patterns: Approach and comprehensive assessment.",
            "Preface to the special issue on Numerical Software: Design, Analysis and Verification.",
            "Validated evaluation of special mathematical functions.",
            "Optimizing the representation of intervals.",
            "On numerical regularity of the face-to-face longest-edge bisection algorithm for tetrahedral partitions.",
            "Recent software developments for special functions in the Santander-Amsterdam project.",
            "Comparison of eigensolvers for symmetric band matrices.",
            "Guest editorial to the Special Issue on Component-Based Software Engineering and Software Architecture.",
            "Architecture-level software performance abstractions for online performance prediction.",
            "Learning from the future of component repositories.",
            "Metrics and techniques for quantifying performance isolation in cloud environments.",
            "Semi-automated architectural abstraction specifications for supporting software evolution.",
            "Employing early model-based safety evaluation to iteratively derive E/E architecture design.",
            "Special Issue on Formal Aspects of Component Software (Selected Papers from FACS'12).",
            "Formal patterns for multirate distributed real-time systems.",
            "Avoiding diamonds in desynchronisation.",
            "A meta-theory for component interfaces with contracts on ports.",
            "Symbolic counterexample generation for large discrete-time Markov chains.",
            "Compositional assume-guarantee reasoning for input/output component theories.",
            "Selected contributions from the Open Source Software Certification (OpenCert) workshops.",
            "Coccinelle: Tool support for automated CERT C Secure Coding Standard certification.",
            "Open source verification in an anonymous volunteer network.",
            "Dependability in open proof software with hardware virtualization - The railway control systems perspective.",
            "CAOVerif: An open-source deductive verification platform for cryptographic software implementations.",
            "Ensuring portability of Linux applications through standardization and knowledge base driven analysis.",
            "An empirical study of FOSS developers patterns of contribution: Challenges for data linkage and analysis.",
            "SCP special issue on Bytecode 2012 - Preface.",
            "Conditional termination of loops over heap-allocated data.",
            "Formalisation and analysis of Dalvik bytecode.",
            "Summary-based inference of quantitative bounds of live heap objects.",
            "Selected papers from the Brazilian Symposium on Formal Methods (SBMF 2011).",
            "Consistency of model transformation contracts.",
            "Compositionality and correctness of fault tolerant patterns in HOL4.",
            "A fully abstract trace-based semantics for reasoning about backward compatibility of class libraries.",
            "On OCL-based imperative languages.",
            "Refinement algebra with dual operator.",
            "Synchronous set relations in rewriting logic.",
            "Brazilian Symposium on Programming Languages (SBLP 2011).",
            "From regexes to parsing expression grammars.",
            "The syntax and semantics of a domain-specific language for flow-network design.",
            "Making refactoring safer through impact analysis.",
            "On the use of feature-oriented programming for evolving software product lines - A comparative study.",
            "Preface - Invariant Generation.",
            "Inference of polynomial invariants for imperative programs: A farewell to Gröbner bases.",
            "Hippocratic binary instrumentation: First do no harm.",
            "Abstract acceleration in linear relation analysis.",
            "Backward under-approximations in numeric abstract domains to automatically infer sufficient program conditions.",
            "Web Technologies: Selected & extended papers from WT ACM SAC 2012.",
            "Process-aware continuation management in web applications.",
            "Approximately optimal facet value selection.",
            "A query language and ranking algorithm for news items in the Hermes news processing framework.",
            "Enriching single-user web applications non-invasively with shared editing support.",
            "Preface: Abstract State Machines, Alloy, B, VDM, and Z. Selected & extended papers from ABZ 2012.",
            "Modeling web applications infrastructure with ASMs.",
            "Test generation for sequential nets of Abstract State Machines with information passing.",
            "ASM, controller synthesis, and complete refinement.",
            "Integrating SMT solvers in Rodin.",
            "Refinement of decomposed models by interface instantiation.",
            "Formalizing hybrid systems with Event-B and the Rodin Platform.",
            "Preventing arithmetic overflows in Alloy.",
            "Supervisory control theory with Alloy.",
            "Revising basic theorem proving algorithms to cope with the logic of partial functions.",
            "Formal Aspects of Component Software (FACS 2010 selected and extended papers).",
            "A sound and complete theory of graph transformations for service programming with sessions and pipelines.",
            "Model checking adaptive service compositions.",
            "QoS contract preservation through dynamic reconfiguration: A formal semantics approach.",
            "Dynamic adaptation with distributed control in Paradigm.",
            "Monitoring method call sequences using annotations.",
            "Special issue on Systems Development by Means of Semantic Technologies.",
            "An extensible argument-based ontology matching negotiation approach.",
            "A domain-independent process for automatic ontology population from text.",
            "Cultural scene detection using reverse Louvain optimization.",
            "A conceptual model and technological support for organizational knowledge management.",
            "An automated tool for semantic accessing to formal software models.",
            "Exploiting semantic technologies in smart environments and grids: Emerging roles and case studies.",
            "Inductive representations of RDF graphs.",
            "Selected and extended papers from Partial Evaluation and Program Manipulation 2013.",
            "Program verification via iterated specialization.",
            "On the syntactic and functional correspondence between hybrid (or layered) normalisers and abstract machines.",
            "Security type error diagnosis for higher-order, polymorphic languages.",
            "A meta-circular language for active libraries.",
            "Deriving a complete type inference for Hindley-Milner and vector sizes using expansion.",
            "Special section on Software Verification and Testing.",
            "NAT2TESTSCR: Test case generation from natural language requirements based on SCR specifications.",
            "Mitigating the effects of equivalent mutants with mutant classification strategies.",
            "Static analysis of lists by combining shape and numerical abstractions.",
            "Selected and extended papers from Bytecode 2013.",
            "Dynamic program analysis - Reconciling developer productivity and tool performance.",
            "Field-sensitive unreachability and non-cyclicity analysis.",
            "Specification and verification of GPGPU programs.",
            "Special issue on software clones (IWSC'12).",
            "CD-Form: A clone detector based on formal methods.",
            "A graph mining approach for detecting identical design structures in object-oriented design models.",
            "SeByte: Scalable clone and similarity search for bytecode.",
            "An insight into the dispersion of changes in cloned and non-cloned code: A genealogy based empirical study.",
            "Preface to the special issue on advances in Smalltalk based systems.",
            "Smalltalk in a C world.",
            "On the integration of Smalltalk and Java.",
            "Seamless composition and reuse of customizable user interfaces with Spec.",
            "Gradual typing for Smalltalk.",
            "Improving refactoring tools in Smalltalk using static type inference.",
            "Supporting streams of changes during branch integration.",
            "A logic foundation for a general-purpose history querying tool.",
            "Verifiable source code documentation in controlled natural language.",
            "Bootstrapping reflective systems: The case of Pharo.",
            "Model-driven toolset for embedded reconfigurable cores: Flexible prototyping and software-like debugging.",
            "Selected and extended papers of the Brazilian Symposium on Programming Languages 2012.",
            "Left recursion in Parsing Expression Grammars.",
            "The formalization and implementation of Adaptable Parsing Expression Grammars.",
            "Attribute grammar macros.",
            "A quantitative and qualitative assessment of aspectual feature modules for evolving software product lines.",
            "Model-based programming environments for spreadsheets.",
            "Special issue on Automated Verification of Critical Systems (AVoCS'12).",
            "Verification of the functional behavior of a floating-point program: An industrial case study.",
            "Two approaches for proving linearizability of multiset.",
            "On modelling and verifying railway interlockings: Tracking train lengths.",
            "Formal specification and verification of a coordination protocol for an automated air traffic control system.",
            "Property-dependent reductions adequate with divergence-sensitive branching bisimilarity.",
            "Constructive polychronous systems.",
            "Software language engineering (SLE '12).",
            "A tutorial on metamodelling for grammar researchers.",
            "Using a trope-based foundational ontology for bridging different areas of concern in ontology-driven conceptual modeling.",
            "A survey of grammatical inference in software engineering.",
            "The design and implementation of Object Grammars.",
            "Domain-specific program profiling and its application to attribute grammars and term rewriting.",
            "Monolithic and modular termination analyses for higher-order attribute grammars.",
            "Specification of temporal properties with OCL."
        ]
    },
    {
        "name": "SCP",
        "year": "2013",
        "info": "2013: Volume 78",
        "count": 147,
        "papers": [
            "Formal Aspects of Component Software (FACS'09).",
            "Formal modeling of evolving self-adaptive systems.",
            "Partition refinement of Component Interaction Automata.",
            "Structural reconfiguration of systems under behavioral adaptation.",
            "Expressing aspectual interactions in requirements engineering: Experiences, problems and solutions.",
            "An improved method for test case prioritization by incorporating historical test case data.",
            "An empirical study of aspect-oriented metrics.",
            "Preface to the special issue on Coordination Models and Languages (Coordination 2010).",
            "Efficient sessions.",
            "NOW: Orchestrating services in a nomadic network using a dedicated workflow language.",
            "Adaptive service provisioning for enhanced energy efficiency and flexibility in wireless sensor networks.",
            "Combining traits with boxes and ownership types in a Java-like setting.",
            "Behavioural contracts with request-response operations.",
            "A personal tribute to Steve Barker.",
            "Abstract State Machines, Alloy, B and Z Selected papers from ABZ 2010.",
            "Validation of formal models by refinement animation.",
            "Reasoned modelling critics: Turning failed proofs into modelling guidance.",
            "Integration of SMT-solvers in B and Event-B development environments.",
            "Modeling the Java Bytecode Verifier.",
            "Special section on Mutation testing (Mutation 2010).",
            "Semantic mutation testing.",
            "Mutation at the multi-class and system levels.",
            "Special issue on the Programming Languages track at the 25th ACM Symposium on Applied Computing.",
            "Dual analysis for proving safety and finding bugs.",
            "Preserving the original MPI semantics in a virtualized processor environment.",
            "Foreword.",
            "Java in the High Performance Computing arena: Research, practice and experience.",
            "Skew-space garbage collection.",
            "Parallel execution of Java loops on Graphics Processing Units.",
            "Unrestricted and safe dynamic code evolution for Java.",
            "Teaching Java programming with the Informa clicker system.",
            "TraitRecordJ: A programming language with traits and records.",
            "Preface to the Special section on Self-Organizing Coordination.",
            "Spanders: Distributed spanning expanders.",
            "On competitive self-composition in pervasive services.",
            "Semantic tuple centres.",
            "Distributed constraint optimisation for resource limited sensor networks.",
            "Self-organized sorting of heterotypic agents via a chemotaxis paradigm.",
            "Special section on the Programming Languages track at the 26th ACM Symposium on Applied Computing.",
            "Incremental concrete syntax for embedded languages with support for separate compilation.",
            "Operational semantics of proto.",
            "FAMILIAR: A domain-specific language for large scale management of feature models.",
            "Preface to the special section on agent-oriented design methods and programming techniques for distributed computing in dynamic and complex environments.",
            "Towards a next-generation AOSE methodology.",
            "A Model-Driven CASE tool for developing and verifying regulated open MAS.",
            "Simulation in Agent-Oriented Software Engineering: The SODA case study.",
            "A scalable multiagent system architecture for interactive applications.",
            "An application-level technique based on recursive hierarchical state machines for agent execution state capture.",
            "Multi-agent oriented programming with JaCaMo.",
            "Multi-agent approach to distributed ant colony optimization.",
            "Preface to the special section on Formal Methods for Industrial Critical Systems (FMICS 2009 + FMICS 2010).",
            "Dynamic state space partitioning for external memory state space exploration.",
            "Formal verification of side-channel countermeasures using self-composition.",
            "Compositional verification of a communication protocol for a remotely operated aircraft.",
            "The Metrô Rio case study.",
            "Model checking and performance evaluation with CADP illustrated on shared-memory mutual exclusion protocols.",
            "Abstract interpretation of microcontroller code: Intervals meet congruences.",
            "Developing mode-rich satellite software by refinement in Event-B.",
            "Preface to the special section on Object-Oriented Programming and Systems (OOPS 2009), a special track at the 24th ACM Symposium on Applied Computing.",
            "On flexible dynamic trait replacement for Java-like languages.",
            "Matching MyType to subtyping.",
            "Abstraction over implementation structure with symmetrically encapsulated multimethods.",
            "Preface to the special section on software evolution, adaptability, and maintenance.",
            "A comparison of identity merge algorithms for software repositories.",
            "A hybrid approach for resource-based comparison of adaptable Java applications.",
            "A systematic mapping study on software product line evolution: From legacy system reengineering to product line refactoring.",
            "\"Adore\", a logical meta-model supporting business process evolution.",
            "oZone: Layer identification in the presence of cyclic dependencies.",
            "Reconciling run-time evolution and resource-constrained embedded systems through a component-based development framework.",
            "Stratified sampling of execution traces: Execution phases serving as strata.",
            "Special section on the Brazilian Symposium on Programming Languages.",
            "A shortcut fusion approach to accumulations.",
            "Optimizing generated aspect-oriented assertion checking code for JML using program transformations: An empirical study.",
            "Inference rules for generic code migration of aspect-oriented programs.",
            "A linear type system for multicore programming in ATS.",
            "Automatic parallelization of canonical loops.",
            "Editorial.",
            "The essential similarity and differences between mathematical modeling and programming.",
            "Invariant assertions, invariant relations, and invariant functions.",
            "Abstract program slicing on dependence condition graphs.",
            "Predictive access control for distributed computation.",
            "A weakest precondition calculus for BUnity.",
            "State-cover testing for nondeterministic terminating concurrent programs with an infinite number of synchronization sequences.",
            "Automatic equivalence proofs for non-deterministic coalgebras.",
            "Incremental construction of systems: An efficient characterization of the lacking sub-system.",
            "Recovering management information from source code.",
            "When intuition and logic clash: The case of the object-oriented paradigm.",
            "Heap space analysis for garbage collected languages.",
            "Emulating C++0x concepts.",
            "Modeling mobile stateful channels in ππZ.",
            "Safe uniform proxies for Java.",
            "Complete assertional proof rules for progress under weak and strong fairness.",
            "Modular and flexible causality control on the Web.",
            "ARV-ALA: Improving performance of software transactional memory through adaptive read and write policies.",
            "Measuring the significance of inconsistency in the Viewpoints framework.",
            "Implementing monads for C++ template metaprograms.",
            "Mechanical verification of Lamport's Bakery algorithm.",
            "Towards the practical mutation testing of AspectJ programs.",
            "Using heuristics to estimate an appropriate number of latent topics in source code analysis.",
            "Verification of quantum programs.",
            "Access-based abstract memory localization in static analysis.",
            "Supporting change impact analysis for intelligent agent systems.",
            "Preface to the special section on Language Descriptions Tools and Applications (LDTA'08 & '09).",
            "A pure embedding of attribute grammars.",
            "Programming errors in traversal programs over structured data.",
            "Extensible intraprocedural flow analysis at the abstract syntax tree level.",
            "GLL parse-tree generation.",
            "Banana Algebra: Compositional syntactic language extension.",
            "Viewing functions as token sequences to highlight similarities in source code.",
            "Preface to the special section on Software Engineering Aspects of Ubiquitous Computing and Ambient Intelligence (UCAmI 2011).",
            "REUBI: A Requirements Engineering method for ubiquitous systems.",
            "Building ubiquitous QoC-aware applications through model-driven software engineering.",
            "A meta-model for dataflow-based rules in smart environments: Evaluating user comprehension and performance.",
            "CrimeSPOT: A language and runtime for developing active wireless sensor network applications.",
            "Towards ubiquity in ambient intelligence: User-guided component mobility in the HI3 architecture.",
            "Designing for user attention: A method for supporting unobtrusive routine tasks.",
            "A lightweight and distributed middleware to provide presence awareness in mobile ubiquitous systems.",
            "Mathematics of Program Construction (selected papers from MPC 2010).",
            "The algorithmics of solitaire-like games.",
            "Deriving real-time action systems in a sampling logic.",
            "Extended designs algebraically.",
            "Linking Unifying Theories of Program refinement.",
            "Adjoint folds and unfolds - An extended study.",
            "Typing linear algebra: A biproduct-oriented approach.",
            "Stream processing coalgebraically.",
            "Refactoring pattern matching.",
            "Special section on methodological development of interactive systems from Interacción 2011.",
            "An empirical approach for evaluating the usability of model-driven tools.",
            "Enriching UsiXML language to support awareness requirements.",
            "A guide to agile development of interactive software with a \"User Objectives\"-driven methodology.",
            "Bridging the gap between information architecture analysis and software engineering in interactive web application development.",
            "Software product lines (SPLC 2010).",
            "From extended feature models to constraint logic programming.",
            "Using MDA for integration of heterogeneous components in software supply chains.",
            "Context-dependent product line engineering with lightweight formal approaches.",
            "Architecting automotive product lines: Industrial practice.",
            "An analysis of unit tests of a flight software product line.",
            "MobiLine: A Nested Software Product Line for the domain of mobile and context-aware applications.",
            "Prototyping Dynamic Software Product Lines to evaluate run-time reconfigurations.",
            "Defining variability in activity diagrams and Petri nets.",
            "Fundamentals of Software Engineering (selected papers of FSEN 2011).",
            "Formalising and analysing the control software of the Compact Muon Solenoid Experiment at the Large Hadron Collider.",
            "A distributed logic for Networked Cyber-Physical Systems.",
            "On the specification of modal systems: A comparison of three frameworks.",
            "Efficient deadlock analysis of component-based software architectures.",
            "Reachability analysis of complex planar hybrid systems.",
            "Compositional reasoning for weighted Markov decision processes."
        ]
    },
    {
        "name": "SCP",
        "year": "2012",
        "info": "2012: Volumes 77,\n78",
        "count": 218,
        "papers": [
            "System and software solution-oriented architectures.",
            "A bargaining-specific architecture for supporting automated service agreement negotiation systems.",
            "Integration of collaboration and interaction analysis mechanisms in a concern-based architecture for groupware systems.",
            "Assessing the SALSA architecture for developing agent-based ambient computing applications.",
            "Bridging the gap between software architecture rationale formalisms and actual architecture documents: An ontology-driven approach.",
            "Introduction to the Special Issue on Automatic Program Generation for Embedded Systems.",
            "Automatic library migration for the generation of hardware-in-the-loop models.",
            "Separate compilation of hierarchical real-time programs into linear-bounded Embedded Machine code.",
            "Compositional design of isochronous systems.",
            "Preface to the special issue on feature-oriented software development (FOSD 2009).",
            "Remodularizing Java programs for improved locality of feature implementations in source code.",
            "rbFeatures: Feature-oriented programming with Ruby.",
            "Access control in feature-oriented programming.",
            "Using formal methods to develop WS-BPEL applications.",
            "Correct transformation: From object-based graph grammars to PROMELA.",
            "A model-driven process for the modernization of component-based systems.",
            "Model evolution and refinement.",
            "Transforming Web Services Choreographies with priorities and time constraints into prioritized-time colored Petri nets.",
            "Quantifying forecast quality of IT business value.",
            "WSDL term tokenization methods for IR-style Web services discovery.",
            "A model-extraction approach to verifying concurrent C programs with CADP.",
            "Aspects preserving properties.",
            "Preface: Selected papers from the Brazilian Symposium on Formal Methods (SBMF 2008).",
            "Mechanised wire-wise verification of Handel-C synthesis.",
            "Mechanical reasoning about families of UTP theories.",
            "Verification of graph grammars using a logical approach.",
            "Function extraction.",
            "Combining decision procedures by (model-)equality propagation.",
            "JCML: A specification language for the runtime verification of Java Card programs.",
            "The supportive effect of patterns in architecture decision recovery - A controlled experiment.",
            "A formal model for service-oriented interactions.",
            "Pattern matching for the masses using custom notations.",
            "Regulations and software evolution: An example from the military domain.",
            "Region-Based RTSJ Memory Management: State of the art.",
            "Selected Papers from the Eleventh International Conference on Coordination Models and Languages.",
            "Servilla: A flexible service provisioning middleware for heterogeneous sensor networks.",
            "A model of context-dependent component connectors.",
            "Dependence analysis for safe futures.",
            "Multicore scheduling for lightweight communicating processes.",
            "Preface to the special issue on reverse engineering (featuring selected papers from WCRE 2009).",
            "Mining quantified temporal rules: Formalism, algorithms, and evaluation.",
            "An empirical study on inconsistent changes to code clones at the release level.",
            "Preface: Special issue on Foundations of Coordination Languages and Software Architectures (selected papers from FOCLASA'09).",
            "SAT-based verification for timed component connectors.",
            "Connectors as designs: Modeling, refinement and test case generation.",
            "ASPfun : A typed functional active object calculus.",
            "Symbolic execution of Reo circuits using constraint automata.",
            "A generic framework for n-protocol compatibility checking.",
            "Fundamentals of software engineering (selected papers of FSEN '09).",
            "Rule formats for determinism and idempotence.",
            "Towards a notion of unsatisfiable and unrealizable cores for LTL.",
            "Moving in a network under random failures: A complexity analysis.",
            "Step coverability algorithms for communicating systems.",
            "Special issue on the Programming Languages track at the 24th ACM Symposium on Applied Computing.",
            "A practical solution for achieving language compatibility in scripting language compilers.",
            "Banzai+Tatoo: Using cutting-edge parsers for implementing high-performance servers.",
            "Automated verification of shape, size and bag properties via user-defined predicates in separation logic.",
            "Preface.",
            "Provably correct conflict prevention bands algorithms.",
            "Certifying assembly with formal security proofs: The case of BBS.",
            "Sequential and distributed on-the-fly computation of weak tau-confluence.",
            "Exploiting step semantics for efficient bounded model checking of asynchronous systems.",
            "Exact and fully symbolic verification of linear hybrid automata with large discrete state spaces.",
            "Refinement-oriented models of Stateflow charts.",
            "SAT-solving in CSP trace refinement.",
            "Refinement checking for privacy policies.",
            "Special issue: International Conference on Formal Engineering Methods - ICFEM 2009.",
            "Modal event-clock specifications for timed component-based design.",
            "Verifying hierarchical Ptolemy II discrete-event models using Real-Time Maude.",
            "On-the-fly parallel model checking algorithm that is optimal for verification of weak LTL properties.",
            "A system for compositional verification of asynchronous objects.",
            "Formal Aspects of Component Software (FACS'09).",
            "Formal modeling of evolving self-adaptive systems.",
            "Partition refinement of Component Interaction Automata.",
            "Structural reconfiguration of systems under behavioral adaptation.",
            "Expressing aspectual interactions in requirements engineering: Experiences, problems and solutions.",
            "An improved method for test case prioritization by incorporating historical test case data.",
            "An empirical study of aspect-oriented metrics.",
            "Preface to the special issue on Coordination Models and Languages (Coordination 2010).",
            "Efficient sessions.",
            "NOW: Orchestrating services in a nomadic network using a dedicated workflow language.",
            "Adaptive service provisioning for enhanced energy efficiency and flexibility in wireless sensor networks.",
            "Combining traits with boxes and ownership types in a Java-like setting.",
            "Behavioural contracts with request-response operations.",
            "A personal tribute to Steve Barker.",
            "Abstract State Machines, Alloy, B and Z Selected papers from ABZ 2010.",
            "Validation of formal models by refinement animation.",
            "Reasoned modelling critics: Turning failed proofs into modelling guidance.",
            "Integration of SMT-solvers in B and Event-B development environments.",
            "Modeling the Java Bytecode Verifier.",
            "Special section on Mutation testing (Mutation 2010).",
            "Semantic mutation testing.",
            "Mutation at the multi-class and system levels.",
            "Special issue on the Programming Languages track at the 25th ACM Symposium on Applied Computing.",
            "Dual analysis for proving safety and finding bugs.",
            "Preserving the original MPI semantics in a virtualized processor environment.",
            "Foreword.",
            "Java in the High Performance Computing arena: Research, practice and experience.",
            "Skew-space garbage collection.",
            "Parallel execution of Java loops on Graphics Processing Units.",
            "Unrestricted and safe dynamic code evolution for Java.",
            "Teaching Java programming with the Informa clicker system.",
            "TraitRecordJ: A programming language with traits and records.",
            "Preface to the Special section on Self-Organizing Coordination.",
            "Spanders: Distributed spanning expanders.",
            "On competitive self-composition in pervasive services.",
            "Semantic tuple centres.",
            "Distributed constraint optimisation for resource limited sensor networks.",
            "Self-organized sorting of heterotypic agents via a chemotaxis paradigm.",
            "Special section on the Programming Languages track at the 26th ACM Symposium on Applied Computing.",
            "Incremental concrete syntax for embedded languages with support for separate compilation.",
            "Operational semantics of proto.",
            "FAMILIAR: A domain-specific language for large scale management of feature models.",
            "Preface to the special section on agent-oriented design methods and programming techniques for distributed computing in dynamic and complex environments.",
            "Towards a next-generation AOSE methodology.",
            "A Model-Driven CASE tool for developing and verifying regulated open MAS.",
            "Simulation in Agent-Oriented Software Engineering: The SODA case study.",
            "A scalable multiagent system architecture for interactive applications.",
            "An application-level technique based on recursive hierarchical state machines for agent execution state capture.",
            "Multi-agent oriented programming with JaCaMo.",
            "Multi-agent approach to distributed ant colony optimization.",
            "Preface to the special section on Formal Methods for Industrial Critical Systems (FMICS 2009 + FMICS 2010).",
            "Dynamic state space partitioning for external memory state space exploration.",
            "Formal verification of side-channel countermeasures using self-composition.",
            "Compositional verification of a communication protocol for a remotely operated aircraft.",
            "The Metrô Rio case study.",
            "Model checking and performance evaluation with CADP illustrated on shared-memory mutual exclusion protocols.",
            "Abstract interpretation of microcontroller code: Intervals meet congruences.",
            "Developing mode-rich satellite software by refinement in Event-B.",
            "Preface to the special section on Object-Oriented Programming and Systems (OOPS 2009), a special track at the 24th ACM Symposium on Applied Computing.",
            "On flexible dynamic trait replacement for Java-like languages.",
            "Matching MyType to subtyping.",
            "Abstraction over implementation structure with symmetrically encapsulated multimethods.",
            "Preface to the special section on software evolution, adaptability, and maintenance.",
            "A comparison of identity merge algorithms for software repositories.",
            "A hybrid approach for resource-based comparison of adaptable Java applications.",
            "A systematic mapping study on software product line evolution: From legacy system reengineering to product line refactoring.",
            "\"Adore\", a logical meta-model supporting business process evolution.",
            "oZone: Layer identification in the presence of cyclic dependencies.",
            "Reconciling run-time evolution and resource-constrained embedded systems through a component-based development framework.",
            "Stratified sampling of execution traces: Execution phases serving as strata.",
            "Special section on the Brazilian Symposium on Programming Languages.",
            "A shortcut fusion approach to accumulations.",
            "Optimizing generated aspect-oriented assertion checking code for JML using program transformations: An empirical study.",
            "Inference rules for generic code migration of aspect-oriented programs.",
            "A linear type system for multicore programming in ATS.",
            "Automatic parallelization of canonical loops.",
            "Editorial.",
            "The essential similarity and differences between mathematical modeling and programming.",
            "Invariant assertions, invariant relations, and invariant functions.",
            "Abstract program slicing on dependence condition graphs.",
            "Predictive access control for distributed computation.",
            "A weakest precondition calculus for BUnity.",
            "State-cover testing for nondeterministic terminating concurrent programs with an infinite number of synchronization sequences.",
            "Automatic equivalence proofs for non-deterministic coalgebras.",
            "Incremental construction of systems: An efficient characterization of the lacking sub-system.",
            "Recovering management information from source code.",
            "When intuition and logic clash: The case of the object-oriented paradigm.",
            "Heap space analysis for garbage collected languages.",
            "Emulating C++0x concepts.",
            "Modeling mobile stateful channels in ππZ.",
            "Safe uniform proxies for Java.",
            "Complete assertional proof rules for progress under weak and strong fairness.",
            "Modular and flexible causality control on the Web.",
            "ARV-ALA: Improving performance of software transactional memory through adaptive read and write policies.",
            "Measuring the significance of inconsistency in the Viewpoints framework.",
            "Implementing monads for C++ template metaprograms.",
            "Mechanical verification of Lamport's Bakery algorithm.",
            "Towards the practical mutation testing of AspectJ programs.",
            "Using heuristics to estimate an appropriate number of latent topics in source code analysis.",
            "Verification of quantum programs.",
            "Access-based abstract memory localization in static analysis.",
            "Supporting change impact analysis for intelligent agent systems.",
            "Preface to the special section on Language Descriptions Tools and Applications (LDTA'08 & '09).",
            "A pure embedding of attribute grammars.",
            "Programming errors in traversal programs over structured data.",
            "Extensible intraprocedural flow analysis at the abstract syntax tree level.",
            "GLL parse-tree generation.",
            "Banana Algebra: Compositional syntactic language extension.",
            "Viewing functions as token sequences to highlight similarities in source code.",
            "Preface to the special section on Software Engineering Aspects of Ubiquitous Computing and Ambient Intelligence (UCAmI 2011).",
            "REUBI: A Requirements Engineering method for ubiquitous systems.",
            "Building ubiquitous QoC-aware applications through model-driven software engineering.",
            "A meta-model for dataflow-based rules in smart environments: Evaluating user comprehension and performance.",
            "CrimeSPOT: A language and runtime for developing active wireless sensor network applications.",
            "Towards ubiquity in ambient intelligence: User-guided component mobility in the HI3 architecture.",
            "Designing for user attention: A method for supporting unobtrusive routine tasks.",
            "A lightweight and distributed middleware to provide presence awareness in mobile ubiquitous systems.",
            "Mathematics of Program Construction (selected papers from MPC 2010).",
            "The algorithmics of solitaire-like games.",
            "Deriving real-time action systems in a sampling logic.",
            "Extended designs algebraically.",
            "Linking Unifying Theories of Program refinement.",
            "Adjoint folds and unfolds - An extended study.",
            "Typing linear algebra: A biproduct-oriented approach.",
            "Stream processing coalgebraically.",
            "Refactoring pattern matching.",
            "Special section on methodological development of interactive systems from Interacción 2011.",
            "An empirical approach for evaluating the usability of model-driven tools.",
            "Enriching UsiXML language to support awareness requirements.",
            "A guide to agile development of interactive software with a \"User Objectives\"-driven methodology.",
            "Bridging the gap between information architecture analysis and software engineering in interactive web application development.",
            "Software product lines (SPLC 2010).",
            "From extended feature models to constraint logic programming.",
            "Using MDA for integration of heterogeneous components in software supply chains.",
            "Context-dependent product line engineering with lightweight formal approaches.",
            "Architecting automotive product lines: Industrial practice.",
            "An analysis of unit tests of a flight software product line.",
            "MobiLine: A Nested Software Product Line for the domain of mobile and context-aware applications.",
            "Prototyping Dynamic Software Product Lines to evaluate run-time reconfigurations.",
            "Defining variability in activity diagrams and Petri nets.",
            "Fundamentals of Software Engineering (selected papers of FSEN 2011).",
            "Formalising and analysing the control software of the Compact Muon Solenoid Experiment at the Large Hadron Collider.",
            "A distributed logic for Networked Cyber-Physical Systems.",
            "On the specification of modal systems: A comparison of three frameworks.",
            "Efficient deadlock analysis of component-based software architectures.",
            "Reachability analysis of complex planar hybrid systems.",
            "Compositional reasoning for weighted Markov decision processes."
        ]
    },
    {
        "name": "SCP",
        "year": "2011",
        "info": "2011: Volume 76",
        "count": 74,
        "papers": [
            "Preface.",
            "Comparing three coordination models: Reo, ARC, and PBRD.",
            "Modeling dynamic reconfigurations in Reo using high-level replacement systems.",
            "simpA: An agent-oriented approach for programming concurrent applications on top of Java.",
            "Preface to the special issue on Formal Methods for Industrial Critical Systems (FMICS 2007 + FMICS 2008).",
            "Formal specification of MPI 2.0: Case study in specifying a practical concurrent programming API.",
            "Deadlock and starvation free reentrant readers-writers: A case study combining model checking with theorem proving.",
            "Application of static analyses for state-space reduction to the microcontroller binary code.",
            "A state/event-based model-checking approach for the analysis of abstract system properties.",
            "Flash memory efficient LTL model checking.",
            "Preface.",
            "On Euclid's algorithm and elementary number theory.",
            "Internal axioms for domain semirings.",
            "Map fusion for nested datatypes in intensional type theory.",
            "Special issue on library-centric software design (LCSD 2006).",
            "DESOLA: An active linear algebra library using delayed evaluation and runtime code generation.",
            "Efficient run-time dispatching in generic programming with minimal code bloat.",
            "An architecture for generic extensions.",
            "Automating exception-safety classification.",
            "Extending type systems in a library: Type-safe XML processing in C++.",
            "A generic lazy evaluation scheme for exact geometric computations.",
            "A generic topology library.",
            "Special Issue on Generative Programming and Component Engineering (Selected Papers from GPCE 2004/2005).",
            "Multi-stage programming with functors and monads: Eliminating abstraction overhead from generic code.",
            "Statically safe program generation with SafeGen.",
            "A type system for reflective program generators.",
            "A language for generic programming in the large.",
            "Special issue on Partial Evaluation and Program Manipulation (selected papers from PEPM 2007).",
            "Partial evaluation of Maple.",
            "XML graphs in program analysis.",
            "Transformation of structure-shy programs with application to XPath queries and strategic functions.",
            "Editorial.",
            "Queue based mutual exclusion with linearly bounded overtaking.",
            "Metamodeling semantics of multiple inheritance.",
            "Formalisation and implementation of an algorithm for bytecode verification of @NonNull types.",
            "A mechanical verification of the stressing algorithm for negative cost cycle detection in networks.",
            "The humble humorous researcher: A tribute to Michel Sintzoff.",
            "Preface.",
            "Formalisations and applications of BPMN.",
            "Synthesis of Reo circuits from scenario-based interaction specifications.",
            "Channel-based coordination via constraint satisfaction.",
            "Dynamic consistency in process algebra: From Paradigm to ACP.",
            "Selected papers of the Refinement Workshop Turku (2008).",
            "Simulation refinement for concurrency verification.",
            "Completeness of fair ASM refinement.",
            "Contexts, refinement and determinism.",
            "A tactic language for refinement of state-rich concurrent specifications.",
            "Selected papers on Integrated Formal Methods (iFM09).",
            "Changing system interfaces consistently: A new refinement strategy for CSP||B.",
            "Predicate abstraction in a program logic calculus.",
            "Partial order reduction for state/event LTL with application to component-interaction automata.",
            "A semantics for Behavior Trees using CSP with specification commands.",
            "Incremental reasoning with lazy behavioral subtyping for multiple inheritance.",
            "Property specifications for workflow modelling.",
            "Principles and Practice of Programming in Java 2008 - Special issue.",
            "On designing safe and flexible embedded DSLs with Java 5.",
            "Delegation by object composition.",
            "Comprehensive aspect weaving for Java.",
            "\"Slimming\" a Java virtual machine by way of cold code removal and optimistic partial program loading.",
            "Listener latency profiling: Measuring the perceptible performance of interactive Java applications.",
            "Erratum to \"Compact and Efficient Strings for Java\" [Science of Computer Programming 75 (2010) 1077-1094].",
            "Preface to the special issue on software evolution, adaptability and variability.",
            "Studying software evolution using artefacts' shared information content.",
            "A top-down strategy to reverse architecting execution views for a large and complex software-intensive system: An experience report.",
            "Diagnosing and correcting design inconsistencies in source code with logical abduction.",
            "A text-based approach to feature modelling: Syntax and semantics of TVL.",
            "Supporting software evolution in component-based FOSS systems.",
            "Predicting the maintainability of XSL transformations.",
            "Supporting simultaneous versions for software evolution assessment.",
            "An open implementation for context-oriented layer composition in ContextJS.",
            "The transformation of requirements into software primitives: Studying evolvability based on systems theoretic stability.",
            "A framework for evolution of modelling languages.",
            "Unifying design and runtime software adaptation using aspect models.",
            "Applying a dynamic threshold to improve cluster detection of LSI."
        ]
    },
    {
        "name": "SCP",
        "year": "2010",
        "info": "2010: Volume 75",
        "count": 68,
        "papers": [
            "Preface.",
            "Automated generation of program translation and verification tools using annotated grammars.",
            "Implementation of a Modelica compiler using JastAdd attribute grammars.",
            "Silver: An extensible attribute grammar system.",
            "Recognition is not parsing - SPPF-style parsing from cubic recognisers.",
            "An experimental ambiguity detection tool.",
            "Theory and practice of unparsed patterns for metacompilation.",
            "Sound refactorings.",
            "Combining dynamic and static slicing for analysing assembler.",
            "Analyzing ambiguity of context-free grammars.",
            "Model transformations across views.",
            "Remembering Amir Pnueli, a great scientist and a great friend (April 22, 1941-November 2, 2009).",
            "Guest editors' introduction to the 3rd issue of Experimental Software and Toolkits (EST): A special issue on Academic Software Development Tools and Techniques (WASDeTT 2008).",
            "CScout: A refactoring browser for C.",
            "Enforcing structural regularities in software using IntensiVE.",
            "Rigi - An environment for software reverse engineering, exploration, visualization, and redocumentation.",
            "The Small Project Observatory: Visualizing software ecosystems.",
            "Distributed and Collaborative Software Evolution Analysis with Churrasco.",
            "Coordination models, languages and applications.",
            "Investigating the effort of using business process management technology: Results from a controlled experiment.",
            "Decision-making coordination and efficient reasoning techniques for feature-based configuration.",
            "Formalization of an architectural model for exception handling coordination based on CA action concepts.",
            "Conformance notions for the coordination of interaction components.",
            "Guest editors' foreword.",
            "From Flow Logic to static type systems for coordination languages.",
            "Alternating-time stream logic for multi-agent systems.",
            "Providing data confidentiality against malicious hosts in Shared Data Spaces.",
            "A process calculus for Mobile Ad Hoc Networks.",
            "Preface to special issue on Generative Programming and Component Engineering (GPCE 2007).",
            "Preventing injection attacks with syntax embeddings.",
            "Debugging hygienic macros.",
            "Aspects of availability: Enforcing timed properties to prevent denial of service.",
            "Constructing language processors with algebra combinators.",
            "Simple and safe SQL queries with C++ templates.",
            "Programming with C++ concepts.",
            "A type-centric framework for specifying heterogeneous, large-scale, component-oriented, architectures.",
            "Design and evaluation of C++ open multi-methods.",
            "Designing high quality system/software architectures.",
            "Experience of building an architecture-based generator using GenVoca for distributed systems.",
            "Aspect-oriented model-driven skeleton code generation: A graph-based transformation approach.",
            "Ontology-driven analysis of UML-based collaborative processes using OWL-DL and CPN.",
            "Preface to the Special Issue on Object-Oriented Programming Languages and Systems (OOPS 2008), A Special Track at the 23rd ACM Symposium on Applied Computing.",
            "C++ lambda expressions and closures.",
            "Dynamic algorithm selection for runtime concepts.",
            "Integrating coercion with subtyping and multiple dispatch.",
            "Pentagons: A weakly relational abstract domain for the efficient validation of array accesses.",
            "Preface.",
            "Actor-based slicing techniques for efficient reduction of Rebeca models.",
            "Slicing for architectural analysis.",
            "Event based choreography.",
            "Robustness testing for software components.",
            "Component simulation-based substitutivity managing QoS and composition issues.",
            "Special issue on the Programming Languages Track at the 23rd ACM Symposium on Applied Computing.",
            "A novel analysis space for pointer analysis and its application for bug finding.",
            "The IELR(1) algorithm for generating minimal LR(1) parser tables for non-LR(1) grammars with conflict resolution.",
            "Defining the meaning of tabular mathematical expressions.",
            "Improving Web Service descriptions for effective service discovery.",
            "An algebraic foundation for automatic feature-based program synthesis.",
            "Type-directed weaving of aspects for polymorphically typed functional languages.",
            "Compact and efficient strings for Java.",
            "A new taxonomy of sublinear right-to-left scanning keyword pattern matching algorithms.",
            "Mining early aspects based on syntactical and dependency analyses.",
            "Simple section interchange and properties of non-computable functions.",
            "Type inference and strong static type checking for Promela.",
            "Multifunctional software systems: Structured modeling and specification of functional requirements.",
            "A resource-efficient event algebra.",
            "Scoping strategies for distributed aspects.",
            "Incompleteness of relational simulations in the blocking paradigm."
        ]
    },
    {
        "name": "SCP",
        "year": "2009",
        "info": "2009: Volume 74",
        "count": 52,
        "papers": [
            "Preface.",
            "ConSpec - A formal language for policy specification.",
            "Remote attestation on legacy operating systems with trusted platform modules.",
            "The SPARTA pseudonym and authorization system.",
            "Extending UML sequence diagrams to model trust-dependent behavior with the aim to support risk analysis.",
            "The best of both worlds: Applying secure sketches to cancelable biometrics.",
            "Towards mechanized correctness proofs for cryptographic algorithms: Axiomatization of a probabilistic Hoare style logic.",
            "Reconciling statechart semantics.",
            "On the semantics of communicating hardware processes and their translation into LOTOS for the verification of asynchronous circuits with CADP.",
            "An incremental algorithm to construct a lattice of set intersections.",
            "A general technique for proving lock-freedom.",
            "SCP special issue on the grand challenge - Preface.",
            "Refinement and verification in component-based model-driven design.",
            "Verifying the CICS File Control API with Z/Eves: An experiment in the verified software repository.",
            "Mechanising a formal model of flash memory.",
            "POSIX file store in Z/Eves: An experiment in the verified software repository.",
            "PPPJ special issue-Foreword.",
            "Featherweight Java with dynamic and static overloading.",
            "Array bounds check elimination in the context of deoptimization.",
            "A study of potential parallelism among traces in Java programs.",
            "As-if-serial exception handling semantics for Java futures.",
            "Cooperative aspect-oriented programming.",
            "Client-based cohesion metrics for Java programs.",
            "Byte code level cross-compilation for developing web applications.",
            "Guest editors' introduction.",
            "Combining preprocessor slicing with C/C++ language slicing.",
            "Reading beside the lines: Using indentation to rank revisions by complexity.",
            "Identifier length and limited programmer memory.",
            "Visualizing the runtime behavior of embedded network systems: A toolkit for TinyOS.",
            "Comparison and evaluation of code clone detection techniques and tools: A qualitative approach.",
            "Preface.",
            "The logic of message-passing.",
            "Refunctionalization at work.",
            "Type-based termination of generic programs.",
            "Proofs of randomized algorithms in Coq.",
            "Generic programming in 3D.",
            "The Shadow Knows: Refinement and security in sequential programs.",
            "Enabledness and termination in refinement algebra.",
            "Special issue on the 5th international workshop on foundations of coordination languages and software architectures (FOCLASA'06).",
            "A perspective on service orchestration.",
            "Symbolic model checking for channel-based component connectors.",
            "On the collective sort problem for distributed tuple spaces.",
            "Efficient symbolic computation of process expressions.",
            "A methodological approach for user interface development of collaborative applications: A case study.",
            "PiDuce - A project for experimenting Web services technologies.",
            "Invariant-driven specifications in Maude.",
            "Efficient virtual machine support of runtime structural reflection.",
            "Integration testing of Object-Oriented and Aspect-Oriented programs: A structural pairwise approach for Java.",
            "Developing topology discovery in Event-B.",
            "Quantifying IT estimation risks.",
            "Quantifying IT forecast quality.",
            "Mathematics for reasoning about loop functions."
        ]
    },
    {
        "name": "SCP",
        "year": "2008",
        "info": "2008: Volumes 70, 71, 72, 73, 74",
        "count": 94,
        "papers": [
            "Google's MapReduce programming model - Revisited.",
            "Framed temporal logic programming.",
            "Decoupling web application concerns through weaving operations.",
            "PPPJ 2006 special issue - foreword.",
            "Garbage collection: Java application servers' Achilles heel.",
            "Dynamic analysis of Java program concepts for visualization and profiling.",
            "An assembler and disassembler framework for JavaTMprogrammers.",
            "Java heap protection for debugging native methods.",
            "Software architecture design for streaming Java RMI.",
            "On a Java computer algebra system, its performance and applications.",
            "Enabling declarative security through the use of Java Data Objects.",
            "Mobile JikesRVM: A framework to support transparent Java thread migration.",
            "Characterizing navigation maps for web applications with the NMM approach.",
            "Quantifying the yield of risk-bearing IT-portfolios.",
            "A challenge for atomicity verification.",
            "The importance of business process modeling in software systems design.",
            "Atomizer: A dynamic atomicity checker for multithreaded programs.",
            "XPi: A typed process calculus for XML messaging.",
            "Easy web service discovery: A query-by-example approach.",
            "KALA: Kernel aspect language for advanced transactions.",
            "Failure-free coordinators synthesis for component-based architectures.",
            "Implicit ownership types for memory management.",
            "Science Code.Net: Object-oriented programming for science.",
            "Guest editor's introduction: Second issue of experimental software and toolkits (EST).",
            "The Parma Polyhedra Library: Toward a complete set of numerical abstractions for the analysis and verification of hardware and software systems.",
            "Flexible metaprogramming and AOP in Java.",
            "ATL: A model transformation tool.",
            "Stable, flexible, peephole pretty-printing.",
            "Stratego/XT 0.17. A language and toolset for program transformation.",
            "The formalism underlying EASYMAP.",
            "Quantifying requirements volatility effects.",
            "Towards proving type safety of .NET CIL.",
            "Partially defined computer instructions and guards.",
            "Elsevier special issue on foundations and applications of model driven architecture.",
            "GREAT: UML transformation tool for porting middleware applications.",
            "Language support for model-driven software development.",
            "Model-driven architecture for embedded software: A synopsis and an example.",
            "Model driven middleware: A new paradigm for developing distributed real-time and embedded systems.",
            "On the reification of Java wildcards.",
            "Design and verification of long-running transactions in a timed framework.",
            "Goto elimination in program algebra.",
            "A note on proofs with graphs.",
            "Preface.",
            "ConSpec - A formal language for policy specification.",
            "Remote attestation on legacy operating systems with trusted platform modules.",
            "The SPARTA pseudonym and authorization system.",
            "Extending UML sequence diagrams to model trust-dependent behavior with the aim to support risk analysis.",
            "The best of both worlds: Applying secure sketches to cancelable biometrics.",
            "Towards mechanized correctness proofs for cryptographic algorithms: Axiomatization of a probabilistic Hoare style logic.",
            "Reconciling statechart semantics.",
            "On the semantics of communicating hardware processes and their translation into LOTOS for the verification of asynchronous circuits with CADP.",
            "An incremental algorithm to construct a lattice of set intersections.",
            "A general technique for proving lock-freedom.",
            "SCP special issue on the grand challenge - Preface.",
            "Refinement and verification in component-based model-driven design.",
            "Verifying the CICS File Control API with Z/Eves: An experiment in the verified software repository.",
            "Mechanising a formal model of flash memory.",
            "POSIX file store in Z/Eves: An experiment in the verified software repository.",
            "PPPJ special issue-Foreword.",
            "Featherweight Java with dynamic and static overloading.",
            "Array bounds check elimination in the context of deoptimization.",
            "A study of potential parallelism among traces in Java programs.",
            "As-if-serial exception handling semantics for Java futures.",
            "Cooperative aspect-oriented programming.",
            "Client-based cohesion metrics for Java programs.",
            "Byte code level cross-compilation for developing web applications.",
            "Guest editors' introduction.",
            "Combining preprocessor slicing with C/C++ language slicing.",
            "Reading beside the lines: Using indentation to rank revisions by complexity.",
            "Identifier length and limited programmer memory.",
            "Visualizing the runtime behavior of embedded network systems: A toolkit for TinyOS.",
            "Comparison and evaluation of code clone detection techniques and tools: A qualitative approach.",
            "Preface.",
            "The logic of message-passing.",
            "Refunctionalization at work.",
            "Type-based termination of generic programs.",
            "Proofs of randomized algorithms in Coq.",
            "Generic programming in 3D.",
            "The Shadow Knows: Refinement and security in sequential programs.",
            "Enabledness and termination in refinement algebra.",
            "Special issue on the 5th international workshop on foundations of coordination languages and software architectures (FOCLASA'06).",
            "A perspective on service orchestration.",
            "Symbolic model checking for channel-based component connectors.",
            "On the collective sort problem for distributed tuple spaces.",
            "Efficient symbolic computation of process expressions.",
            "A methodological approach for user interface development of collaborative applications: A case study.",
            "PiDuce - A project for experimenting Web services technologies.",
            "Invariant-driven specifications in Maude.",
            "Efficient virtual machine support of runtime structural reflection.",
            "Integration testing of Object-Oriented and Aspect-Oriented programs: A structural pairwise approach for Java.",
            "Developing topology discovery in Event-B.",
            "Quantifying IT estimation risks.",
            "Quantifying IT forecast quality.",
            "Mathematics for reasoning about loop functions."
        ]
    },
    {
        "name": "SCP",
        "year": "2007",
        "info": "2007: Volumes 64, 65, 66, 67, 68, 69",
        "count": 92,
        "papers": [
            "Foreword.",
            "A logic for information flow analysis with an application to forward slicing of simple imperative programs.",
            "A calculus of logical relations for over- and underapproximating static analyses.",
            "Automatic generation of polynomial invariants of bounded degree using abstract interpretation.",
            "Polynomial approximations of the relational semantics of imperativeprograms.",
            "A polynomial-time algorithm for global value numbering.",
            "The octahedron abstract domain.",
            "Type inference against races.",
            "Abstract interpretation of combinational asynchronous circuits.",
            "Introduction to the special issue.",
            "Global computing in a dynamic network of tuple spaces.",
            "Coordination with multicapabilities.",
            "Using role-based coordination to achieve software adaptability.",
            "An experimental evaluation of self-managing availability in shared data spaces.",
            "Editorial comment to 'About \"trivial\" software patents: The IsNot case'.",
            "About \"trivial\" software patents: The IsNot case.",
            "Procedures and parameters in the real-time program refinement calculus.",
            "A risk analysis of disk backup or repository maintenance.",
            "Formal proof of a program: Find.",
            "Lock-free parallel and concurrent garbage collection by mark&sweep.",
            "Letter from the editor.",
            "Towards more adequate EIS.",
            "What business process modelers can learn from programmers.",
            "Modelling and model checking suspendible business processes via statechart diagrams and CSP.",
            "LogLogics: A logic for history-dependent business processes.",
            "A methodological approach to the formal specification of real-time systems by transformation of UML-RT design models.",
            "PiXL: Applying xml standards to support the integration of analysis tools for protocols.",
            "Preface.",
            "Customizing an XML-Haskell data binding with type isomorphism inference in Generic Haskell.",
            "Metamorphisms: Streaming representation-changers.",
            "Modelling angelic and demonic nondeterminism with multirelations.",
            "Terms with unbounded demonic and angelic nondeterminacy.",
            "Describing data flow analysis techniques with Kleene algebra.",
            "Kleene getting lazy.",
            "Software Configuration Management.",
            "Visual assessment of software evolution.",
            "Odyssey-SCM: An integrated software configuration management infrastructure for UML models.",
            "Bridging the gap between enterprise architectures and software architectures.",
            "Ontology-driven middleware for next-generation train backbones.",
            "Definition and use of Computation Independent Models in an MDA-based groupware development process.",
            "An architecture for access control management in collaborative enterprise systems based on organization models.",
            "Software requirements and architecture modeling for evolving non-secure applications into secure applications.",
            "Designing and managing evolving systems using a MAS product line approach.",
            "Using FDAF to bridge the gap between enterprise and software architectures for security.",
            "Editorial-Science of Computer Programming-25 years.",
            "Using established Web Engineering knowledge in model-driven approaches.",
            "Maude's module algebra.",
            "Rotations in the plane and Prolog.",
            "Modeling and verification of real-time systems based on equations.",
            "Preface.",
            "Capability passing processes.",
            "Connector colouring I: Synchronisation and context dependency.",
            "Engineering a BPEL orchestration engine as a multi-agent system.",
            "Coordinating mobile agents in interaction spaces.",
            "Preface.",
            "A documental approach to adventure game development.",
            "ScriptEase: A generative/adaptive programming paradigm for game scripting.",
            "Knowledge acquisition for adaptive game AI.",
            "Toward mobile entertainment: A paradigm for narrative-based audio only games.",
            "High quality navigation in computer games.",
            "Solving games: Dependence of applicable solving procedures.",
            "Using semi-formal methods for detecting interactions among smart homes policies.",
            "Formal semantics and analysis of control flow in WS-BPEL.",
            "An update calculus for expressing type-safe program updates.",
            "Generalized structured programs and loop trees.",
            "Quantifying the effects of IT-governance rules.",
            "Reasoning about safety properties in a JVM-like environment.",
            "Engineering and theoretical underpinnings of retrenchment.",
            "Report on selected papers from LDTA 2003.",
            "The metafront system: Safe and extensible parsing and transformation.",
            "Circular reference attributed grammars - their evaluation and applications.",
            "Implementing aspect-oriented programming constructs as modular language extensions.",
            "Preface.",
            "High-fidelity C/C++ code transformation.",
            "An action compiler targeting Standard ML.",
            "Automatic recursion engineering of reduction incorporated parsers.",
            "Special issue on model transformation.",
            "On the interoperability of model-to-model transformation languages.",
            "Rule-based modularization in model transformation languages illustrated with ATL.",
            "Creating and reconciling diagrams after executing model transformations.",
            "Transformation techniques for OCL constraints.",
            "Model transformations in MT.",
            "The model transformation language of the VIATRA2 framework.",
            "Guest editor's introduction: Experimental Software and Toolkits (EST).",
            "A tool chain for reverse engineering C++ applications.",
            "The JastAdd system - modular extensible compiler construction.",
            "USE: A UML-based specification environment for validating UML and OCL.",
            "The Daikon system for dynamic detection of likely invariants.",
            "The CommUnity Workbench.",
            "Chronos: A timing analyzer for embedded software.",
            "Building CBR systems with jcolibri.",
            "Proofs and pedagogy; science and systems: The grammar tool box."
        ]
    },
    {
        "name": "SCP",
        "year": "2006",
        "info": "2006: Volumes 59, 60, 61, 62, 63",
        "count": 79,
        "papers": [
            "Foreword.",
            "A study of the influence of coverage on the relationship between static and dynamic coupling metrics.",
            "Safe instantiation in Generic Java.",
            "A selective dynamic compiler for embedded Java virtual machines targeting ARM processors.",
            "Phase-based visualization and analysis of Java programs.",
            "New and improved: Linda in Java.",
            "XML11 - an abstract windowing protocol.",
            "Voice activated command and control with speech recognition over WiFi.",
            "Applying security policies through agent roles: A JAAS based approach.",
            "Using classic problems to teach Java framework design.",
            "On relating functional specifications to architectural specifications: A case study.",
            "Safe Ambients: Abstract machine and distributed implementation.",
            "Computer algebra systems as mathematical optimizing compilers.",
            "Probabilistic anomaly detection in distributed computer networks.",
            "An implementation framework for Software Architectures based on the coordination paradigm.",
            "Cost of ownership model for a CRM system.",
            "To use or not to use the goto statement: Programming styles viewed from Hoare Logic.",
            "Introduction to the special issue on software analysis, evolution and reengineering.",
            "Software visualizations for improving and measuring the comprehensibility of source code.",
            "Synthesizing and integrating legacy components as services using adapters.",
            "GXL: A graph-based standard exchange format for reengineering.",
            "Revisiting the Delta IC approach to component recovery.",
            "Dynamic binary translation using run-time feedbacks.",
            "Documenting software systems using types.",
            "Composing invariants.",
            "A theory of computer instructions.",
            "On the static and dynamic extents of delimited continuations.",
            "Quality system and software architectures.",
            "Interface descriptions for enterprise architecture.",
            "Detection of anomalies in software architecture with connectors.",
            "Performance-related ontologies and semantic web applications for on-line performance assessment of intelligent systems.",
            "A formal model of concurrent systems based on bipartite directed acyclic graph.",
            "Next generation system and software architectures: Challenges from future NASA exploration missions.",
            "Modeling and performance analysis for security aspects.",
            "Preface.",
            "Modeling component connectors in Reo by constraint automata.",
            "Adding mobility to software architectures.",
            "On the semantics of software adaptation.",
            "On the expressiveness of timed coordination models.",
            "Preface.",
            "The TXL source transformation language.",
            "XGLR - an algorithm for ambiguity in programming languages.",
            "Evaluating GLR parsing algorithms.",
            "An Action Environment.",
            "Preface.",
            "Gaussian Elimination: A case study in efficient genericity with MetaOCaml.",
            "In search of a program generator to implement generic transformations for high-performance computing.",
            "Combining partial evaluation and staged interpretation in the implementation of domain-specific languages.",
            "MetaOCaml server pages: Web publishing as staged computation.",
            "Experiences with an object-oriented, multi-stage language.",
            "Five perspectives on modern memory management: Systems, hardware and theory.",
            "Efficient memory management for concurrent programs that use message passing.",
            "Safe manual memory management in Cyclone.",
            "An object-aware memory architecture.",
            "On measuring garbage collection responsiveness.",
            "Linear combinations of radioactive decay models for generational garbage collection.",
            "Special issue on Source code analysis and manipulation.",
            "Using source transformation to test and model check implicit-invocation systems.",
            "A formalisation of the relationship between forms of program slicing.",
            "Modular invariants for layered object structures.",
            "Automated mass maintenance of a software portfolio.",
            "Guest editor's introduction: Special issue on security issues in coordination models, languages, and systems.",
            "Secure shared data-space coordination languages: A process algebraic survey.",
            "Classification of security properties in a Linda-like process algebra.",
            "Component adaptation through flexible subservicing.",
            "Confining data and processes in global computing applications.",
            "Agent Coordination Contexts for the formal specification and enactment of coordination and security policies.",
            "Special issue on synchronization and concurrency in object-oriented languages.",
            "Executing Java programs with transactional memory.",
            "Composing atomic features.",
            "Programming with exceptions in JCilk.",
            "Versioned boxes as the basis for memory transactions.",
            "Nested transactional memory: Model and architecture sketches.",
            "Special issue on foundations of aspect-oriented programming.",
            "Semantics and scoping of aspects in higher-order languages.",
            "A type-theoretic interpretation of pointcuts and advice.",
            "Typed parametric polymorphism for aspects.",
            "Aspect-oriented programming for reactive systems: Larissa, a proposal in the synchronous framework.",
            "MiniMAO: An imperative core language for studying aspect-oriented reasoning."
        ]
    },
    {
        "name": "SCP",
        "year": "2005",
        "info": "2005: Volumes 54, 55, 56, 57, 58",
        "count": 77,
        "papers": [
            "Editorial.",
            "Mutable strings in Java: design, implementation and lightweight text-search algorithms.",
            "Object-oriented algorithm analysis and design with Java.",
            "The Claim Tool Kit for ad hoc recognition of peer entities.",
            "Exploiting runtime bytecode manipulation to add roles to Java agents.",
            "Implementing advanced spoken dialogue management in Java.",
            "A spectral estimation toolkit for Java applications.",
            "Architectural modifications to deployed software .",
            "A semantic and methodological essence of message sequence charts.",
            "XML stream transformer generation through program composition and dependency analysis.",
            "Compositionality and locality for improving model checking in the selective mu-calculus.",
            "Erratum to \"Book review: Process algebra with timing\" [Sci. Comput. Programming 51 (2004)291-292].",
            "Preface.",
            "Abstract Behavior Types: a foundation model for components and their composition.",
            "Formal methods for smart cards: an experience report.",
            "A discrete-time UML semantics for concurrency and communication in safety-critical applications.",
            "Live and let die: LSC based verification of UML models.",
            "Composition for component-based modeling.",
            "How the design of JML accommodates both runtime assertion checking and formal verification.",
            "Generating error traces from verification-condition counterexamples.",
            "Specification and (property) inheritance in CSP-OZ.",
            "Asynchronous system synthesis.",
            "New software composition concepts.",
            "Use-case components for interactive information systems.",
            "Extending component-based design with hardware components.",
            "Supporting software composition at the programming language level.",
            "A form-based meta-model for software composition.",
            "Architectural styles for active documents.",
            "A technique for automatic component extraction from object-oriented programs by refactoring.",
            "Hierarchical composition of industrial components.",
            "Self-certification and trust in component procurement.",
            "Achieving seamless component composition through scenario-based deep adaptation and generation.",
            "Composition of software artifacts modelled using Colored Petri nets.",
            "Software composition and verification for sensor networks.",
            "Coverage testing of Java programs and components.",
            "Sequences as a basis for pattern language composition.",
            "Model-checking processes with data.",
            "Quantitative aspects of outsourcing deals.",
            "Quantifying the value of IT-investments.",
            "Relational characterizations of system fault tolerance.",
            "Rewriting of imperative programs into logical equations.",
            "System and software architectures.",
            "BITAM: An engineering-principled method for managing misalignments between business and IT architectures.",
            "Self-healing components in robust software architecture for concurrent and distributed systems.",
            "Evaluating the performance of architectures in MASCOT.",
            "A calculus for concurrent system with higher-order streaming communication.",
            "A Product Line engineering practices model.",
            "Performance modeling and analysis of software architectures: An aspect-oriented UML based approach.",
            "Supporting ATAM with a collaborative Web-based software architecture evaluation tool.",
            "Towards lightweight checks for mass maintenance transformations.",
            "A transactional object calculus.",
            "Formal specification of multi-agent e-barter systems.",
            "Multi-paradigm Java-Prolog integration in tuProlog.",
            "Advances in interpreters, virtual machines and emulators.",
            "Executable JVM model for analytical reasoning: A study.",
            "A portable virtual machine target for proof-carrying code.",
            "Generation of fast interpreters for Huffman compressed bytecode.",
            "The case for virtual register machines.",
            "Joeq: A virtual machine and compiler infrastructure.",
            "Engineering a common intermediate representation for the Ovm framework.",
            "Static Analysis Symposium 2003.",
            "Computer-assisted verification of a protocol for certified email.",
            "Precise widening operators for convex polyhedra.",
            "Typestate verification: Abstraction techniques and complexity results.",
            "Error checking with client-driven pointer analysis.",
            "Integrated program debugging, verification, and optimization using abstract interpretation (and the Ciao system preprocessor).",
            "Static insertion of safe and effective memory reuse commands into ML-like programs.",
            "Abstract interpretation of programs as Markov decision processes.",
            "Weighted pushdown systems and their application to interprocedural dataflow analysis.",
            "Establishing local temporal heap safety properties with applications to compile-time memory management.",
            "Concurrency and synchronization in Java programs.",
            "The java.util.concurrent synchronizer framework.",
            "Snapshots and software transactional memory.",
            "Exceptions and side-effects in atomic blocks.",
            "Exclusion requirements and potential concurrency for composite objects.",
            "Dynamic inference of polymorphic lock types.",
            "Observations on the assured evolution of concurrent Java programs."
        ]
    },
    {
        "name": "SCP",
        "year": "2004",
        "info": "2004: Volumes 50, 51, 52, 53",
        "count": 55,
        "papers": [
            "Preface.",
            "Ordering from Satan's menu: a survey of requirements specification for formal analysis of cryptographic protocols.",
            "A simple framework for real-time cryptographic protocol analysis with compositional proof rules.",
            "Security properties: two agents are sufficient.",
            "On the secure implementation of security protocols.",
            "Building certified libraries for PCC: dynamic storage allocation.",
            "Correctness of data representations involving heap data structures.",
            "Register allocation by proof transformation.",
            "Type error slicing in implicitly typed higher-order languages.",
            "Type inference for a distributed \\pi-calculus.",
            "Automatic software model checking via constraint logic.",
            "Foreword.",
            "Some results in dynamic model theory.",
            "Towards a refinement algebra.",
            "Using eternity variables to specify and prove a serializable database interface.",
            "Theory and applications of inverting functions as folds.",
            "Type-indexed data types.",
            "Safety of abstract interpretations for free, via logical relations and Galois connections.",
            "Configurable immunity for evolving human-computer systems.",
            "A discipline of dynamic programming over sequence data.",
            "Lessons learned from real DSL experiments.",
            "Process algebra with timing: J.C.M. Baeten and C.A. Middelburg (Eds); Springer, Berlin, 2002, pp. XX+287, ISBN 3-540-43447-X.",
            "Transformations everywhere.",
            "Static composition of refactorings.",
            "Algebraic reasoning for object-oriented programming.",
            "Monadification of functional programs.",
            "Supporting incremental and experimental software evolution by runtime method transformations.",
            "The transient combinator, higher-order strategies, and the distributed data problem.",
            "Pigs from sausages? Reengineering from assembler to C via FermaT transformations.",
            "Automatic validation of code-improving transformations on low-level program representations.",
            "Type-safe method inlining.",
            "Transformation by interpreter specialisation.",
            "A tour of Tempo: a program specializer for the C language.",
            "Practice and experience with Java in education.",
            "An interactive environment for beginning Java programmers .",
            "Educational and technical design of a Web-based interactive tutorial on programming in Java.",
            "A Java-based system for building animated presentations over the Web.",
            "A Java-based approach for teaching principles of adaptive and evolvable software.",
            "Geometry teaching in wireless classroom environments using Java and J2ME.",
            "A Java-based digital library portal for geography education.",
            "A global path planning Java-based system for autonomous mobile robots.",
            "Topics in system administration.",
            "Using service grammar to diagnose BGP configuration errors.",
            "Strider: a black-box, state-based approach to change and configuration management and support.",
            "A survey of fault localization techniques in computer networks.",
            "Roles in networks.",
            "On observed reproducibility in network configuration management.",
            "Software variability management.",
            "A customizable approach to full lifecycle variability management.",
            "Design-time product line architectures for any-time variability.",
            "Modeling variability in software product lines with the variation point model.",
            "Variability management with feature models.",
            "Designing runtime variation points in product line architectures: three cases.",
            "XVCL: a mechanism for handling variants in software product lines.",
            "Behavioural inheritance in the UML to model software product lines."
        ]
    },
    {
        "name": "SCP",
        "year": "2003",
        "info": "2003: Volumes 46, 47, 48, 49",
        "count": 34,
        "papers": [
            "Issues in Coordination Languages and Architectures.",
            "Static analysis of real-time component-based systems configurations.",
            "Comparing coordination models and architectures using embeddings.",
            "On the expressiveness of coordination via shared dataspaces.",
            "Erratic Fudgets: a semantic theory for an embedded coordination language.",
            "Using mobile code to provide fault tolerance in tuple space based coordination languages.",
            "Coordinating processes with secure spaces.",
            "Special issue on the Fifth International Workshop of the ERCIM Working Group on Formal Methods for Industrial Critical Systems, Berlin, April 3-4, 2000 - Selected papers.",
            "Automatically verifying an object-oriented specification of the Steam-Boiler system.",
            "Mode-Automata: a new domain-specific construct for the development of safe critical systems.",
            "Efficient on-the-fly model-checking for regular alternation-free mu-calculus.",
            "A B model for ensuring soundness of a large subset of the Java Card virtual machine.",
            "Composing programming languages by combining action-semantics modules.",
            "JastAdd--an aspect-oriented compiler construction system.",
            "Object-oriented tree traversal with JJForester.",
            "Static Analysis.",
            "Comprehensive synchronization elimination for Java.",
            "Infinitary relations and their representation.",
            "Abstract interpretation of mobile ambients.",
            "Abstracting cryptographic protocols with tree automata.",
            "State space reduction based on live variables analysis.",
            "Eliminating dead code on recursive data.",
            "Partial redundancy elimination: a simple, pragmatic, and provably correct algorithm.",
            "The semantics and execution of a synchronous block-diagram language.",
            "Dynamic configuration management in a graph-oriented Distributed Programming Environment.",
            "A linear approximation algorithm for bin packing with absolute approximation factor 3/2.",
            "A new algorithm for the construction of minimal acyclic DFAs.",
            "A Boyer-Moore-style algorithm for regular expression pattern matching.",
            "An analysis of the coupling effect I: single test data.",
            "On logic programs that always succeed.",
            "On the theory of system administration.",
            "The algebraic structure of interfaces.",
            "Abstract interpretation based verification of logic programs.",
            "The classification of greedy algorithms."
        ]
    },
    {
        "name": "SCP",
        "year": "2002",
        "info": "2002: Volumes 42, 43, 44, 45",
        "count": 40,
        "papers": [
            "Software engineering beyond our planning horizon: automation for computer-based systems.",
            "Formal methods: the very idea - Some thoughts about why they work when they work.",
            "Pitfalls of formality in early system design.",
            "Generic tools for verifying concurrent systems.",
            "Parametric approach to the specification and analysis of real-time scheduling based on ACSR-VP.",
            "Lightweight inference for automation efficiency.",
            "Formal methods in practice.",
            "On methodology of representing knowledge in dynamic domains.",
            "Automated verification of function block-based industrial control systems.",
            "Automatic concurrency in SequenceL.",
            "Component-based software architectures: a framework based on inheritance of behavior.",
            "Component algebra.",
            "Cjj: a subset of C++ compliant with Java.",
            "State space generation for the HAVi leader election protocol.",
            "Polytypic data conversion programs.",
            "A source of inconsistency in theories of nondeterministic functions.",
            "Polymorphic subtyping in O'Haskell.",
            "Polytypic values possess polykinded types.",
            "Reasoning about real-time repetitions: terminating and nonterminating.",
            "The universal resolving algorithm and its correctness: inverse computation in a functional language.",
            "Profiles in a strict metamodeling framework.",
            "Reconciling the needs of architectural description with object-modeling notations.",
            "Modular architecture for a toolset supporting OCL.",
            "Extending standard UML with model composition semantics.",
            "PRIMA-UML: a performance validation incremental methodology on early UML diagrams.",
            "A graph transformation approach to software architecture reconfiguration.",
            "Concepts and realization of a diagram editor generator based on hypergraph transformation.",
            "A visual environment for visual languages.",
            "Designing the automatic transformation of visual languages.",
            "Formal agent-oriented modeling with UML and graph transformation.",
            "A hierarchy of communication models for Message Sequence Charts.",
            "Imperative objects as mobile processes.",
            "\"Compositionality of projection inheritance\" [Sci. Comput. Programming 42 (2-3) (2002) 129-171].",
            "Quantitative IT portfolio management.",
            "Supporting iterations in exploratory database reengineering processes.",
            "Clustering relations into abstract ER schemas for database reverse engineering.",
            "A change impact model for changeability assessment in object-oriented software systems.",
            "Towards a user-controlled software renovation factory.",
            "Restructuring of COBOL/CICS legacy systems.",
            "Extracting Java library subsets for deployment on embedded systems."
        ]
    },
    {
        "name": "SCP",
        "year": "2001",
        "info": "2001: Volumes 39, 40, 41",
        "count": 31,
        "papers": [
            "Preface.",
            "Code motion in the presence of critical edges without bidirectional data flow analysis.",
            "Evaluating the effectiveness of pointer alias analyses.",
            "Finite subtype inference with explicit polymorphism.",
            "A symbolic semantics for abstract model checking.",
            "A first-order language for expressing sharing and type properties of logic programs.",
            "Mechanisms for naming - An algebraic approach with an application to Java.",
            "On a formal semantics of tabular expressions.",
            "Analysis of three hybrid systems in timed µCRL.",
            "Distributed directory service and message routing for mobile agents.",
            "Fundamental Approaches to Software Engineering.",
            "A formal design language for real-time systems with data.",
            "Specifying embedded systems with statecharts and Z: an agenda for cyclic software components.",
            "Model-checking CSP-Z: strategy, tool support and industrial application.",
            "Rule-based refinement of high-level nets preserving safety properties.",
            "Incremental design of statechart specifications.",
            "Preface.",
            "The value of slicing while debugging.",
            "Recovery of jump table case statements from binary code.",
            "An empirical study into COBOL type inferencing.",
            "Design-code traceability recovery: selecting the basic linkage properties.",
            "Parallel program analysis and restructuring by detection of point-to-point interaction patterns and their transformation into collective communication constructs.",
            "Predicate transformer semantics of a higher-order imperative language with record subtyping.",
            "Feature integration using a feature construct.",
            "Formal verification of programs specified with signal: application to a power transformer station controller.",
            "Compatibility and inheritance in software architectures.",
            "Strengthening invariants for efficient computation.",
            "Concurrent determination of connected components.",
            "Compositional high-level Petri net semantics of a parallel programming language with procedures.",
            "Unique fixpoint induction for message-passing process calculi.",
            "From tuple spaces to tuple centres."
        ]
    },
    {
        "name": "SCP",
        "year": "2000",
        "info": "2000: Volumes 36, 37, 38",
        "count": 32,
        "papers": [
            "Foreword.",
            "ESTEREL: a formal method applied to avionic software development.",
            "Verification and test generation for the SSCOP protocol.",
            "Verification of a safety-critical railway interlocking system with real-time constraints.",
            "On the analysis needs when verifying state-based software requirements: an experience report.",
            "Automated compositional Markov chain generation for a plain-old telephone system.",
            "Preface.",
            "Reverse engineering is reverse forward engineering.",
            "A comparison of abstract data types and objects recovery techniques.",
            "How do program understanding tools affect how programmers understand programs?",
            "Generation of components for software renovation factories from context-free grammars.",
            "Using visualization for architectural localization and extraction.",
            "Program plan matching: experiments with a constraint-based approach.",
            "Program plan recognition for year 2000 tools.",
            "Computation calculus bridging a formalization gap.",
            "Generic downwards accumulations.",
            "Generalising monads to arrows.",
            "A semantic approach to secure information flow.",
            "A calculational approach to reactive systems.",
            "Convergence of program transformers in the metric space of trees.",
            "Costing parallel programs as a function of shapes.",
            "Shapeliness analysis of functional programs with algebraic data types.",
            "A calculus of functional BSP programs.",
            "A methodology for hardware verification using compositional model checking.",
            "Deriving relational programs for computing kernels by reconstructing a proof of Richardson's theorem.",
            "Combinations of abstract domains for logic programming: open product and generic pattern construction.",
            "A calculus of program adaptation and its applications.",
            "A generative methodology for the design of abstract machines.",
            "Review: Performance Modeling with Deterministic and Stochastic Petri Nets - Christoph Lindemann, Wiley-Interscience Series in Systems and Optimization, Wiley, New York, 1998, 405 pages, ISBN 0-471-97646-6.",
            "Review: The Tbilisi Symposium on Logic, Language and Computation: Selected Papers - Jonathan Ginzburg, Zurab Khasidashvili, Carl Vogel, Jean-Jacques Lévi, and Enric Vallduví (Eds.), Studies in Logic, Language and Information series of CSLI Publications and FoLLI, Stanford, 1998, xxxi + 376 pages, ISBN 1-57586-098-8.",
            "Review: Communicating and Mobile Systems: the -calculus, - Robin Milner, Cambridge University Press, Cambridge, 1999, 174 pages, ISBN 0-521-64320-1.",
            "Review: Practical Foundations of Mathematics - Paul Taylor, Cambridge Studies in Advanced Mathematics, Vol. 59, Cambridge University Press, Cambridge, 1999. xi+572 pages, price £50 paperback, ISBN 0-521-63107-6."
        ]
    },
    {
        "name": "SCP",
        "year": "1999",
        "info": "1999: Volumes 33, 34, 35",
        "count": 23,
        "papers": [
            "Extracting and Implementing List Homomorphisms in Parallel Program Development.",
            "Undulant-Block Elimination and Integer-Preserving Matrix Inversion.",
            "An Inconsistency in Procedures, Parameters, and Substitution in the Refinement Calculus.",
            "Uncovering Architectural Mismatch in Component Behavior.",
            "Refinement of Rational End-Points Real Numbers by Means of Floating-Point Numbers.",
            "Relation Partition Algebra - Mathematical Aspects of Uses and Part-Of Relations.",
            "Calculational Derivation of Pointer Algorithms from Tree Operations.",
            "Strategies for Consistency Checking Based on Unification.",
            "Graph Transformation for Specification and Programming.",
            "Correctness of On-Line Partial Evaluation for a Pascal-Like Language.",
            "A Refinement Calculus for Tuple Spaces.",
            "A Logic for Reasoning Equationally in the Presence of Partiality.",
            "Stores as Homomorphisms and Their Transformations: A Uniform Approach to Structured Types in Imperative Languages.",
            "Specifications, Programs, and Total Correctness.",
            "Theory of Partial-Order Programming.",
            "Bridging the Algorithm Gap: A Linear-Time Functional Program for Paragraph Formatting.",
            "Constructive Consistency Checking for Partial Specification in Z.",
            "Introduction to Set Constraint-Based Program Analysis.",
            "Approximating the Domains of Functional and Imperative Programs.",
            "A Faster Solver for General Systems of Equations.",
            "Cache Behavior Prediction by Abstract Interpretation.",
            "Tractable Constraints in Finite Semilattices.",
            "Automatic Analysis of Pointer Aliasing for Untyped Programs."
        ]
    },
    {
        "name": "SCP",
        "year": "1998",
        "info": "1998: Volumes 30, 31, 32",
        "count": 31,
        "papers": [
            "Foreword: Concurrent Constraint Programming.",
            "Computing with Continuous Change.",
            "Partial Order and Contextual Net Semantics for Atomic and Locally Atomic CC Programs.",
            "Newton - Constraint Programming over Nonlinear Constraints.",
            "A Hierarchy of Constraint Systems for Data-Flow Analysis of Constraint Logic-Based Languages.",
            "GOFFIN: Higher-Order Functions Meet Concurrent Constraints.",
            "Constraint-Based Protocols for Distributed Problem Solving.",
            "A Distributed Arc-Consistency Algorithm.",
            "Program Families: Program Construction by Context Independent Refinements.",
            "Fast, Long-Lived Renaming Improved and Simplified.",
            "State Space Reduction by Non-Standard Semantics for Deadlock Analysis.",
            "Two Classes of Boolean Functions for Dependency Analysis.",
            "Stackability in the Simply-Typed Call-by-Value lambda Calculus.",
            "About Synchronous Programming and Abstract Interpretation.",
            "Abstract Interpretation Using Typed Decision Graphs.",
            "Strictness and Totality Analysis.",
            "An Abstract Interpretation for Estimating Uncaught Exceptions in Standard ML Programs.",
            "Multiparty Negotiation of Dynamic Distributed Object Services.",
            "The Discrete Time TOOLBUS - A Software Coordination Architecture.",
            "A Logic for a Coordination Model with Multiple Spaces.",
            "Structured Gamma.",
            "Distributed Coordination with MESSENGERS.",
            "Coordination in the ImpUNITY Framework.",
            "Solving the Linda Multiple rd Problem Using the Copy-Collect Primitive.",
            "Laura - A Service-Based Coordination Language.",
            "A Transformation-Based Optimiser for Haskell.",
            "A Sound Polymorphic Type System for a Dialect of C.",
            "Constraints to Stop Deforestation.",
            "Linear-Time Hierarchies for a Functional Language Machine Model.",
            "Towards a Logical Semantics for Pure Prolog.",
            "Optimal Domains for Disjunctive Abstract Intepretation."
        ]
    },
    {
        "name": "SCP",
        "year": "1997",
        "info": "1997: Volumes 28, 29",
        "count": 26,
        "papers": [
            "The Automated Transformation of Abstract Specifications of Numerical Algorithms into Efficient Array Processor Implementations.",
            "Timewise Refinement for Communicating Processes.",
            "Foreword.",
            "The Embedded Software of an Electricity Meter: An Experience in Using Formal Methods in an Industrial Project.",
            "Categorical Semantics of Parallel Program Design.",
            "Internal Design of Modules Specified in the Trace Assertion Method.",
            "Probabilistic Models for the Guarded Command Language.",
            "Spill - A Logic Language for Writing Testable Requirements Specifications.",
            "Timed Rewriting Logic with an Application to Object-Based Specification.",
            "A High-Level Derivation of Global Search Algorithms (with Constraint Propagation).",
            "A Case study in Model Checking Software Systems.",
            "Foreword.",
            "An Industrial Application of Modal Process Logic.",
            "Verification of XTP Context Management Closing Procedure in Style of TLA.",
            "Making the Most of Formal Specification Through Animation, Testing and Proof.",
            "Symbolic Techniques for Formally Verifying Industrial Systems.",
            "Modeling and Verifying Active Structural Control Systems.",
            "An Experiment in Automatic Generation of Test Suites for Protocols with Verification Technology.",
            "Safety-Level Communication in Railway Interlockings.",
            "Specification and Verification of Various Distributed Leader Election Algorithms for Unidirectional Ring Networks.",
            "Grid Protocols Based on Synchronous Communication.",
            "The I²C-Bus in Discrete-Time Process Algebra.",
            "Detecting Feature Interactions with CÆSAR/ALDÉBARAN.",
            "Supporting Contexts in Program Refinement.",
            "A New Approach to Compiling Adaptive Programs.",
            "Peterson's Mutual Exclusion Algorithm Revisited."
        ]
    },
    {
        "name": "SCP",
        "year": "1996",
        "info": "1996: Volumes 26, 27",
        "count": 30,
        "papers": [
            "Editorial (Selected Papers from the Third International Conference on the Mathematics of Program Construction).",
            "Preface (Selected Papers from the Third International Conference on the Mathematics of Program Construction).",
            "Mathematics of Program Construction.",
            "I Was a Computer.",
            "Functional Algorithm Design.",
            "Steps Toward Mechanizing Program Transformations Using PVS.",
            "Massive Parallelization of Divide-and-Conquer Algorithms over Powerlists.",
            "Specifying the Caltech Asynchronous Microprocessor.",
            "Towards a Design Calculus for CSP.",
            "Deriving a Class of Layer-Oriented Graph Algorithms.",
            "Arrays, Bounded Quantification and Iteration in Logic and Constraing Logic Programming.",
            "Leaf Trees.",
            "An Algorithm for Type-Checking Dependent Types.",
            "Exceptions Considered Harmless.",
            "Proofs with Graphs.",
            "Reductivity.",
            "A Relational Calculus for Program Construction by Parts.",
            "Refinement Principles Supporting the Transition from Asynchronous to Synchronous Communication.",
            "Integrating Different Versions of Programs with Backward and Forward Slicesa.",
            "Explaining Type Inference.",
            "A Taxonomy of Sublinear Multiple Keyword Pattern Matching Algorithms.",
            "Systolic Arrays for the Recognition of Permutation-Invariant Segments.",
            "Stepwise Refinement of Communicating Systems.",
            "Supporting Module Reuse in Refinement.",
            "Design and Analysis of Up-Down Counters.",
            "Point-free Substitution.",
            "Obituary: Professor Nobuo Yoneda (28 March 1930-22 April 1996).",
            "Differential Logic Programs: Programming Methodologies and Semantics.",
            "Memoizing Purely Functional Top-Down Backtracking Language Processors.",
            "An Operational Semantics of Sharing in Lazy Evaluation."
        ]
    },
    {
        "name": "SCP",
        "year": "1995",
        "info": "1995: Volumes 24, 25",
        "count": 22,
        "papers": [
            "Systematic Derivation of Incremental Programs.",
            "A Formal Description of Evolving Software Systems Architectures.",
            "A New Programming Technique for Lazy Functional Languages.",
            "Transformation of Polynomial Evaluation to a Pipeline via Horner's Rule.",
            "Verifying Programs That Use Causally-Ordered Message-Passing.",
            "Predicate Transformers for Reasoning about Concurrent Computation.",
            "The Matrix as In-Situ Data Structure.",
            "Proving Properties of Real-Time Semaphores.",
            "Transformational Design and Implementation of a New Efficient Solution to the Ready Simulation Problem.",
            "On Regularity in Software Design.",
            "A Mathematical Definition of Full Prolog.",
            "Wait-Free Algorithms for Fast, Long-Lived Renaming.",
            "Functional Documents for Computer Systems.",
            "Systematic Design of an Algorithm for Biconnected Components.",
            "Foreword: Selected Papers of ESOP'94.",
            "A Theory of Primitive Objects: Second-Order Systems.",
            "Foundational Issues in Implementing Constraint Logic Programming Systems.",
            "Behavioural and Abstractor Specifications.",
            "A Comparison of Imperative and Purely Functional Suffix Tree Constructions.",
            "Lazy Type Inference and Program Analysis.",
            "A Semantics for Shape.",
            "A Calculus of Broadcasting Systems."
        ]
    },
    {
        "name": "SCP",
        "year": "1994",
        "info": "1994: Volumes 22, 23",
        "count": 26,
        "papers": [
            "Foreword: Special Issue on Mathematics of Program Construction.",
            "Calculating Path Algorithms.",
            "An Algebraic Construction of Predicate Transformers.",
            "Distributing a Class of Sequential Programs.",
            "Relational Programming Laws in the Tree, List, Bag, Set Hierarchy.",
            "Designing Arithmetic Circuits by Refinement in Ruby.",
            "Operational Semantics and Generalized Weakest Preconditions.",
            "Shorter Paths to Graph Algorithms.",
            "Foreword: Selected Papers of ESOP'92.",
            "Back to Direct Style.",
            "Dynamic Typing: Syntax and Proof Theory.",
            "A Theory of Qualified Types.",
            "Interprocedural Type Propagation for Object-Oriented Languages.",
            "Approximate Fixed Points in Abstract Interpretation.",
            "Reversing Abstract Interpretations.",
            "The Tensor Product in Wadler's Analysis of Lists.",
            "Efficient Parallel Algorithms for Tree Accumulations.",
            "Static Typing for Object-Oriented Programming.",
            "Petri-Net-Based Deadlock Analysis of Process Algebra Programs.",
            "Foreword: Selected Papers of TAPSOFT'93.",
            "Composition of Assumption-Commitment Specifications in a UNITY Style.",
            "Gate Splitting in LOTOS Specifications Using Abstract Interpretation.",
            "Model Checking Using Net Unfoldings.",
            "Principal Type Schemes for Functional Programs with Overloading and Subtyping.",
            "Label Algebras and Exception Handling.",
            "Subsitution: A Formal Methods Case Study Using Monads and Transformations."
        ]
    },
    {
        "name": "SCP",
        "year": "1993",
        "info": "1993: Volumes 20, 21",
        "count": 20,
        "papers": [
            "Guest Editors' Remarks: Selected Papers of the Sixth International Workshop on Software Specification and Design.",
            "Goal-Directed Requirements Acquisition.",
            "Developing Reactive Systems in a VDM Framework.",
            "Exceptions for Algebraic Specifications: On the Meaning of \"but\".",
            "Real-Time Specification and Modeling with Joint Actions.",
            "Embedding Time Granularity in a Logical Specification Language for Synchronous Real-Time Systems.",
            "Modelling Jackson's Programming Method.",
            "Deriving Parallel Programs from specification Susing Cost Information.",
            "Statement Inversion and Strongest Postcondition.",
            "On the Mathematics of Sequential Decompositions.",
            "Concurrency Without Toil: A Systematics Method for Parallel Program Design.",
            "Towards Pointer Algebra.",
            "Foreword: Selected Papers of TACS 1991.",
            "Authentification and Delegation with Smart-Cards.",
            "Generating Data Flow Analysis Algorithms from Modal Specifications.",
            "On Abstraction and the Expressive Power of Programming Languages.",
            "Programs with Continuations and Linear Logic.",
            "Rankers: A Classification of Synchronization Problems.",
            "Axiomatizing CCS, Nets and Processes.",
            "Semantics-Directed Generation of a Prolog Compiler."
        ]
    },
    {
        "name": "SCP",
        "year": "1992",
        "info": "1992: Volumes 18, 19",
        "count": 19,
        "papers": [
            "Parallel Programming with Data Structures and Higher Order Functions.",
            "Longest Segment Problems.",
            "Heuristics for Constructing While Loops.",
            "Formalizing and Implementing Gries' Program Development Method in Dynamic Logic.",
            "Improving Recursive Functions by Inverting the Order of Evaluation.",
            "Balanced Trees with Removals: An Exercise in Rewriting and Proof.",
            "Arbiters: An Exercise in Specifying and Decomposing Asynchronously Communicating Components.",
            "Minimal State Graph Generation.",
            "Reasoning Algebraically about Recursion.",
            "The Smallest Upravel.",
            "Derivation of Concurrent Programs: Two Examples.",
            "Communication Relations: A Paradigm for Parallel Program Design.",
            "A Technique for Solving a Class of Puadratic FP Equations.",
            "The Esterel Synchronous Programming Language: Design, Semantics, Implementation.",
            "Correctness of Transformations on Register Transfers.",
            "LR-Parsing Derived.",
            "Beyond Atomic Registers: Bounded Wait-Free Implementations of Nontrivial Objects.",
            "A System at the Cross-Roads of Functional and Logic Programming.",
            "A Bottom-Up Polymorphic Type Inference in Logic Programming."
        ]
    },
    {
        "name": "SCP",
        "year": "1991",
        "info": "1991: Volumes 16, 17",
        "count": 14,
        "papers": [
            "Correctness of Static Flow Analysis in Continuation Semantics.",
            "An Exercise in Transformational Programming: Backtracking and Branch-and-Bound.",
            "Specification of Concurrent Objects Using Auxiliary Variables.",
            "Synchronous Programming with Events and Relations: the SIGNAL Language and Its Semantics.",
            "Automatic Autoprojection of Recursive Equations with Global Variables and Abstract Data Types.",
            "Symbolic Execution: A Semantic Approach.",
            "Functional Description of the Contextual Analysis in Block-Structured Programming Languages: A Sase Study of Tree Transducers.",
            "Foreword (Selected Papers of ESOP '90).",
            "Automatic Autoprojection of Higher Order Recursive Equations.",
            "On the Expressive Power of Programming Languages.",
            "Power Domain Constructions.",
            "Resolution and Type Theory.",
            "Algebraic Properties of Program Integration.",
            "A Type System for Implicit Scaling."
        ]
    },
    {
        "name": "SCP",
        "year": "1990",
        "info": "1990: Volumes 13, 14, 15",
        "count": 38,
        "papers": [
            "A Method for Solving Synchronization Problems.",
            "Semantic Independence.",
            "Bottom-Up Tree Acceptors.",
            "Elementary Data Structures in ALGOL-Like Languages.",
            "An Example of Sequentialization of a Parallel Algorithm.",
            "Stepwise Refinement of Parallel Algorithms.",
            "Lawful Functions and Program Verification in Miranda.",
            "An Implementation of an Efficient Algorithm for Bisimulation Equivalence.",
            "Comparative Semantics for PROLOG with Cut.",
            "On the Classification of Attribute Evaluation Algorithms.",
            "A Functional Theory of Exceptions.",
            "Behavioural Correctness of Data Representations.",
            "Comparing Integrated and External Logics of Functional Programs.",
            "The (Algebraic) Congruence of Two Programming Language Definitions.",
            "Small Programming Exercises 24.",
            "Foreword (Special Issue on Mathematics of Program Construction).",
            "Reasoning About Continuous Systems.",
            "A Practical Theory of Programming.",
            "Specifying Concurrent Objects as Communicating Processes.",
            "Stepwise Refinement and Concurrency: The Finite-State Case.",
            "The Derivation of Systolic Computations.",
            "Searching by Elimination.",
            "Data Structures and Program Transformation.",
            "Types and Invariants in the Refinement Calculus.",
            "Algorithm Theories and Design Tactics.",
            "Program Inversion: More than Fun!",
            "Using Rewriting Techniques to Produce Code Generators and Proving Them Correct.",
            "The GAMMA Model and Its Discipline of Programming.",
            "Left-Bottom and Right-Top Segments.",
            "Preface (Special Issue on Parallel Programming).",
            "Distributed Sorting.",
            "Synthesis of a New Systolic Architecture for the Algebraic Path Problem.",
            "Two Small Parallel Programming Exercises.",
            "A Systolic Design for Acceptors of Regular Languages.",
            "A Systematic Design of a Parallel Program for Dirichlet Convolution.",
            "A Derivation of a Serial-Parallel Multiplier.",
            "A Systolic LRU Processor and Its Top-Down Development.",
            "VLSI Programming for the Compact Disc Player."
        ]
    },
    {
        "name": "SCP",
        "year": "1989",
        "info": "1989: Volumes 11, 12, 13",
        "count": 30,
        "papers": [
            "Conditions for incremental iteration: Examples and counterexamples.",
            "Procedures, parameters, and abstraction: Separate concerns.",
            "Morris' tree traversal algorithm reconsidered.",
            "Towards an algebraic specification of code generation.",
            "Views of queues.",
            "Detecting Stack-Based Environments in Denotational Definitions.",
            "Refined Compilation of Pattern-Matching for Functional Languages.",
            "Developing a Linear Algorithm for Cubing a Cyclic Permutation.",
            "Small Programming Exercises 22.",
            "Program Derivation by Fixed Point Computation.",
            "From Informal Requirements to a Running Program: A Case Study in Algebraic Specification and Transformational Programming.",
            "How to Make Algebraic Specifications More Understandable: An Experiment with the PLUSS Specification Language.",
            "Generating Function Versions with Rational Strictness Patterns.",
            "Small Programming Exercises 23.",
            "Formal Derivation of a Pattern Matching Algorithm.",
            "A New Approach to Earley's Parsing Algorithm.",
            "Equational Reasoning in Isabelle.",
            "An Algorithm for Transitive Reduction of an Acyclic Graph.",
            "Playing with Patterns, Searching for Strings.",
            "Calculating with Pointers.",
            "Denotational Engineering.",
            "A Method for Solving Synchronization Problems.",
            "Semantic Independence.",
            "Bottom-Up Tree Acceptors.",
            "Elementary Data Structures in ALGOL-Like Languages.",
            "An Example of Sequentialization of a Parallel Algorithm.",
            "Stepwise Refinement of Parallel Algorithms.",
            "Lawful Functions and Program Verification in Miranda.",
            "An Implementation of an Efficient Algorithm for Bisimulation Equivalence.",
            "Comparative Semantics for PROLOG with Cut."
        ]
    },
    {
        "name": "SCP",
        "year": "1988",
        "info": "1988: Volumes 10, 11",
        "count": 23,
        "papers": [
            "Partially Interpreted Schemas for CSP Programming.",
            "On Deriving a LISP Program From Its Specification.",
            "Computability and Implementability Issues in Abstract Data Types.",
            "Nondeterministic Data Flow Programs: How to Avoid the Merge Anomaly.",
            "Small Programming Exercises 20.",
            "The Derivation of Graph Marking Algorithms From Distributed Termination Detection Protocols.",
            "Automatic Binding Time Analysis for a Typed lambda-Calculus.",
            "Verification of Programs That Destructively Manipulate Data.",
            "Efficient Handling of Data Structures in Definitional Languages.",
            "A 'Division' Transformation for Program and Data Structures and the Structure Clash Problem.",
            "Linearisation: An Optimisation for Nonlinear Functional Programs.",
            "Small Programming Exercises 21.",
            "Conditions for incremental iteration: Examples and counterexamples.",
            "Procedures, parameters, and abstraction: Separate concerns.",
            "Morris' tree traversal algorithm reconsidered.",
            "Towards an algebraic specification of code generation.",
            "Views of queues.",
            "Detecting Stack-Based Environments in Denotational Definitions.",
            "Refined Compilation of Pattern-Matching for Functional Languages.",
            "Developing a Linear Algorithm for Cubing a Cyclic Permutation.",
            "Small Programming Exercises 22.",
            "Program Derivation by Fixed Point Computation.",
            "From Informal Requirements to a Running Program: A Case Study in Algebraic Specification and Transformational Programming."
        ]
    },
    {
        "name": "SCP",
        "year": "1987",
        "info": "1987: Volumes 8, 9",
        "count": 29,
        "papers": [
            "Derivation of a Parsing Algorithm in Martin-Löf's Theory of Types.",
            "Proof Rules for Fault Tolerant Distributed Programs.",
            "REVEUR-3: The Implementation of a General Completion Procedure Parameterized by Built-in Theories and Strategies.",
            "Linear Future Semantics and Its Implementation.",
            "Small Programming Exercises 15.",
            "A Formal Development of an Efficient Subercombinator Compiler.",
            "McLaren's Masterpiece.",
            "Basic Polymorphic Typechecking.",
            "The Categorical Abstract Machine.",
            "Small Programming Exercises 16.",
            "Applications of a Strategy for Designing Divide-and-Conquer Algorithms.",
            "Statecharts: A Visual Formalism for Complex Systems.",
            "Modalities for Model Checking: Branching Time Logic Strikes Back.",
            "Small Programming Exercises 17.",
            "Deriving Some Expansion Theorems for Nonlinear Functional Equations by an Algorithm.",
            "Linear Prime-Number Sieves: A Family Tree.",
            "The Origin of a Binary-Search Paradigm.",
            "Some Algorithms Based on the Dual of Dilworth's Theorem.",
            "Small Programming Exercises 18.",
            "A Hoare-Like Proof System for Analysing the Computation Time of Programs.",
            "Termination of Rewriting Systems by Polynomial Interpretations and Its Implementation.",
            "Symbolic Evaluation with Structural Recursive Symbolic Constants.",
            "Logic Programming and Rapid Prototyping.",
            "Small Programming Exercises 19.",
            "A Heuristic Explanation of Batcher's Baffler.",
            "A Simple Calculus for Program Transformation (Inclusive of Induction).",
            "A Correctness Proof of Sorting by Means of Formal Procedures.",
            "A New Error Repair and Recovery Scheme for Lexical and Syntactic Analysis.",
            "A Theoretical Basis for Stepwise Refinement and the Programming Calculus."
        ]
    },
    {
        "name": "SCP",
        "year": "1986",
        "info": "1986: Volumes 6, 7",
        "count": 26,
        "papers": [
            "Derivation of a Distributed Algorithm for Finding Paths in Directed Networks.",
            "Rewriting Systems on FP Expressions to Reduce the Number of Sequences Yielded.",
            "Script: A Communication Abstraction Mechanism and Its Verification.",
            "Two Most Nondeterministic Programs.",
            "Small Programming Exercises 9.",
            "Report on the Larch Shared Language.",
            "A Larch Shared Language Handbook.",
            "Transformational Programming and the Paragraph Problem.",
            "Model of Error Propagation in Systems of Communicating Processes.",
            "Small Programming Exercises 10.",
            "Program Derivation Through Transformations: The Evolution of List-Copying Algorithms.",
            "A New Type-Checker for a Functional Language.",
            "Message-Based Functional Operating Systems.",
            "Small Programming Exercises 11.",
            "State Machines and Assertions: An Integrated Approach to Modeling and Verification of Distributed Systems.",
            "Analysing a Class of Distributive Partitioning Sort Algorithms.",
            "Algebraic Implementations Preserve Program Correctness.",
            "A Derivation of a Distributed Implementation of Warshall's Algorithm.",
            "CIGALE: A Tool for Interactive Grammar Construction and Expression Parsing.",
            "Small Programming Exercises 12.",
            "Transformational Program Development in a Particular Program Domain.",
            "Small Programming Exercises 13.",
            "Strictness Analysis for Higher-Order Functions.",
            "Functional Programming with Side-Effects.",
            "Compiling and Optimizing Methods for the Functional Language ASL/F.",
            "Small Programming Exercises 14."
        ]
    },
    {
        "name": "SCP",
        "year": "1985",
        "info": "1985: Volume 5",
        "count": 13,
        "papers": [
            "Algebraic Specification and Verification of Communicating Protocols.",
            "The Design of Divide and Conquer Algorithms.",
            "A Language of Specified Programs.",
            "A General Incremental Evaluator for Attribute Grammars.",
            "Small Programming Exercises 6.",
            "Showing Programs on a Screen.",
            "Verifying the Unification Algorithm in LCF.",
            "Top-Down Design and the Algebra of Communicating Processes.",
            "A method and a language for constructing iterative programs.",
            "Description and Improvement of Iterative Program Transformations.",
            "Distributed Mutual Exclusion on a Ring of Processes.",
            "Automatic Construction of CSP Programs from Sequential Non-Deterministic Programs.",
            "Small Programming Exercises 7."
        ]
    },
    {
        "name": "SCP",
        "year": "1984",
        "info": "1984: Volume 4",
        "count": 13,
        "papers": [
            "Fault-Tolerant Broadcasts.",
            "Structuring Transformational Developments: A Case Study Based on Earley's Recognizer.",
            "The Mathematical Construction of a Program.",
            "Small Programming Exercises 3.",
            "A Systematic Approach to Language Constructs for Concurrent Programs.",
            "Partial Correctness: The Term-Wise Approach.",
            "A Proof System for Concurrent ADA Programs.",
            "Small Programming Exercises 4.",
            "The Crippled Queen Placement Problem.",
            "A Simple Livelock-Free Algorithm for Packet Switching.",
            "Adequate Proof Principles for Invariance and Liveness Properties of Concurrent Programs.",
            "Une Extension de VLISP vers les Objets.",
            "Small Programming Exercises 5."
        ]
    },
    {
        "name": "SCP",
        "year": "1983",
        "info": "1983: Volume 3",
        "count": 12,
        "papers": [
            "An Exercise in the Transformational Derivation of an Efficient Program by Joing Development of Control and Data Structure.",
            "A Case Study of Number-Theoretic Computation: Searching for Primes in Arithmetical Progression.",
            "Proof Rules and Transformations Dealing with Fairness.",
            "Extended Naming Conventions for Communicating Processes.",
            "A Higher-Order Implementation of Rewriting.",
            "Metal: A Formalism to Specify Formalisms.",
            "Exceptions and Interrupts in CSP.",
            "An Alternative for the Implementation of Kruskal's Minimal Spanning Tree Algorithm.",
            "Small Programming Exercises 1.",
            "Increasing Modularity and Language-Independency in Automatically Generated Compilers.",
            "A Structured Approach to Static Semantics Correctness.",
            "Small Programming Exercises 2."
        ]
    },
    {
        "name": "SCP",
        "year": "1982",
        "info": "1982: Volumes 1, 2",
        "count": 23,
        "papers": [
            "Editorial.",
            "A Word of Welcome.",
            "Deductive Synthesis of the Unification Algorithm.",
            "A Calculus of Total Correctness for Communicating Processes.",
            "Programming in a Wide Spectrum Language: A Collection of Examples.",
            "Systematic Detection of Exception Occurrences.",
            "Bulterman's Reshuffling Problem.",
            "Formal Specification of a Display-Oriented Text Editor.",
            "Circular Expressions: Elimination of Static Environments.",
            "Smoothsort, an Alternative for Sorting In Situ.",
            "An Exercise in Program Synthesis: Algorithms for Computing the Transitive Closure of a Relation.",
            "A Methodology for Programming with Concurrency: An Informal Presentation.",
            "A Methodology for Programming with Concurrency: The Formalism.",
            "Some Notes on Putting Formal Specifications to Productive Use.",
            "A Technique for Recursion Removal Based on String Homomorphisms.",
            "Implementing Specification Freedoms.",
            "A Fixed-Space Program of Linear Output Complexity for the Problem of the Three Vessels.",
            "Finding Repeated Elements.",
            "Decomposition of Distributed Programs into Communication-Closed Layers.",
            "An Assertional Correctness Proof of a Distributed Algorithm.",
            "A Note on a Standard Strategy for Developing Loop Invariants and Loops.",
            "Justifications of the Structural Synthesis of Programs.",
            "Using Branching Time Temporal Logic to Synthesize Synchronization Skeletons."
        ]
    },
    {
        "name": "SCP",
        "year": "1981",
        "info": "1981: Volume 1",
        "count": 11,
        "papers": [
            "Editorial.",
            "A Word of Welcome.",
            "Deductive Synthesis of the Unification Algorithm.",
            "A Calculus of Total Correctness for Communicating Processes.",
            "Programming in a Wide Spectrum Language: A Collection of Examples.",
            "Systematic Detection of Exception Occurrences.",
            "Bulterman's Reshuffling Problem.",
            "Formal Specification of a Display-Oriented Text Editor.",
            "Circular Expressions: Elimination of Static Environments.",
            "Smoothsort, an Alternative for Sorting In Situ.",
            "An Exercise in Program Synthesis: Algorithms for Computing the Transitive Closure of a Relation."
        ]
    }
]