[
    {
        "name": "SOCA",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 6,
        "papers": [
            "SPReaD: service-oriented process for reengineering and DevOps.",
            "Cloud services description ontology used for service selection.",
            "Access control based on entity matching for secure data sharing.",
            "Multi-objective Scheduling Policy for Workflow Applications in Cloud Using Hybrid Particle Search and Rescue Algorithm.",
            "Data-driven method for mobile game publishing revenue forecast.",
            "Publisher Correction to: A third-party replication service for dynamic hidden databases."
        ]
    },
    {
        "name": "SOCA",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 24,
        "papers": [
            "Mobility-as-a-Service research trends of 5G-based vehicle platooning.",
            "A deep learning approach for collaborative prediction of Web service QoS.",
            "Building adaptive context-aware service-based smart systems.",
            "Mashup tag completion with attention-based topic model.",
            "Genetic-based web regression testing: an ontology-based multi-objective evolutionary framework to auto-regression testing of web applications.",
            "ReLock: a resilient two-phase locking RESTful transaction model.",
            "Digital twins are shaping future virtual worlds.",
            "A microservice-based framework for exploring data selection in cross-building knowledge transfer.",
            "Increasing the availability of IoT applications with reactive microservices.",
            "Integration of ontologies to support Control as a Service in an Industry 4.0 context.",
            "Comprehensive review and classification of game analytics.",
            "Orchestration- and choreography-based composition of Internet of Transactional Things.",
            "Service-enabled systems and applications: current and future trends.",
            "(k, ε , δ)-Anonymization: privacy-preserving data release based on k-anonymity and differential privacy.",
            "Modified Chebyshev polynomial-based access control mechanism for secured data access in cloud computing environment.",
            "An Event-B formal model for a system reconfiguration pattern and its instantiation: application to Web services compensation.",
            "QoS Prediction based on temporal information and request context.",
            "Guarded attribute grammars and publish/subscribe for implementing distributed collaborative business processes with high data availability.",
            "Security and privacy in the Internet of Things: threats and challenges.",
            "Privacy preservation of genome data analysis using homomorphic encryption.",
            "Exposing safe correlations in transactional datasets.",
            "Privacy protection in government data sharing: an improved LDP-based approach.",
            "A third-party replication service for dynamic hidden databases.",
            "An evolution model of composed service based on global dependence net."
        ]
    },
    {
        "name": "SOCA",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 24,
        "papers": [
            "Current and future of technologies and services in smart e-learning.",
            "WSEmail.",
            "Review rating prediction using combined latent topics and associated sentiments: an empirical review.",
            "Fault diagnosis in service-oriented computing through partially observed stochastic Petri nets.",
            "Cross-layer impact analysis and adaptation of hierarchical service-based applications.",
            "Hybrid biogeography-based optimization with enhanced mutation and CMA-ES for global optimization problem.",
            "Current and future of software services in smart manufacturing.",
            "Rethinking the differential evolution algorithm.",
            "Data anonymization: a novel optimal k-anonymity algorithm for identical generalization hierarchy data in IoT.",
            "Allocating MapReduce workflows with deadlines to heterogeneous servers in a cloud data center.",
            "Design of airport security screening using queueing theory augmented with particle swarm optimisation.",
            "Composition modeling for manufacturing resource cloud service.",
            "Some new trends of intelligent simulation optimization and scheduling in intelligent manufacturing.",
            "Multi-objective cooperative control based on evolutionary process optimization of immune algorithm.",
            "Could or could not of Grid-Loc: grid BLE structure for indoor localisation system using machine learning.",
            "Analysis of adversary activities using cloud-based web services to enhance cyber threat intelligence.",
            "Social network structure-based framework for innovation evaluation and propagation for new product development.",
            "Enterprise architecture framework evaluation criteria: a literature review and artifact development.",
            "AI in legal services: new trends in AI-enabled legal services.",
            "An equity-based incentive mechanism for persistent virtual world content service.",
            "Building orchestrated microservice systems using declarative business processes.",
            "A graph database-based approach utilizing FAHP and directed bipartite graph for service composition.",
            "Semantics-based API discovery, matching and composition with linked metadata.",
            "An automated framework for evaluating open-source web scanner vulnerability severity."
        ]
    },
    {
        "name": "SOCA",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 28,
        "papers": [
            "Edge and fog services.",
            "Intelligent security algorithm for UNICODE data privacy and security in IOT.",
            "Detecting indicators of deception in emulated monitoring systems.",
            "A reference model of services computing systems platform based on meta-analysis technique.",
            "Change management of service-based business processes.",
            "An adaptive and scalable framework for automated service discovery.",
            "SECoG: semantically enhanced mashup of CoAP-based IoT services.",
            "Bead Strand Model: a high-efficiency storage structure for self-destructing data in cloud environment.",
            "Research challenges of big data.",
            "Service description languages in cloud computing: state-of-the-art and research issues.",
            "Locality sensitive request distribution for fog and cloud servers.",
            "RaceTest: harmful data race detection based on testing technology in WS-BPEL.",
            "Improving generalization ability of instance transfer-based imbalanced sentiment classification of turn-level interactive Chinese texts.",
            "Auto-scaling for real-time stream analytics on HPC cloud.",
            "Smart and sustainable urban logistic applications aided by intelligent techniques.",
            "LASSO-based feature selection and naïve Bayes classifier for crime prediction and its type.",
            "Experimental comparison of the diagnostic capabilities of classification and clustering algorithms for the QoS management in an autonomic IoT platform.",
            "A service platform for streamlining the production of cyber-physical interactive performance art.",
            "A focus on future cloud: machine learning-based cloud security.",
            "A bio-inspired algorithm for dynamic reconfiguration with end-to-end constraints in web services composition.",
            "Data mining service recommendation based on dataset features.",
            "Emerging blockchain-based applications and techniques.",
            "Hydrological stream data pipeline framework based on IoTDB.",
            "Energy- and locality-efficient multi-job scheduling based on MapReduce for heterogeneous datacenter.",
            "Internet financial interest rate risk measure based on genetic rough set reduction.",
            "Protocol to efficiently prevent illegal flow of objects in P2P type of publish/subscribe (PS) systems.",
            "Ontology-based services for software vulnerability detection: a survey.",
            "A context-aware recommendation-based system for service composition in smart environments."
        ]
    },
    {
        "name": "SOCA",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 27,
        "papers": [
            "Notes on ensembles of IoT, network functions and clouds for service-oriented computing and applications.",
            "A self-learning approach for validation of runtime adaptation in service-oriented systems.",
            "Resilience analysis of service-oriented collaboration process management systems.",
            "A systematic approach for business service consolidation in virtual organizations.",
            "An ontology-based collaborative business service selection: contributing to automatic building of collaborative business process.",
            "Intelligent product and mechatronic software components enabling mass customisation in advanced production systems.",
            "Associate multi-task scheduling algorithm based on self-adaptive inertia weight particle swarm optimization with disruption operator and chaos operator in cloud environment.",
            "Spatial-aware service management in a pervasive environment.",
            "Adaptive security architecture for protecting RESTful web services in enterprise computing environment.",
            "Adaptive reallocation of cybersecurity analysts to sensors for balancing risk between sensors.",
            "A multi-agent-based framework for cloud service discovery and selection using ontology.",
            "Non-functional parameters and automatic generation and publishing for Web service description improvement.",
            "A Web service search engine for large-scale Web service discovery based on the probabilistic topic modeling and clustering.",
            "A review and future directions of SOA-based software architecture modeling approaches for System of Systems.",
            "A testing data validity assessment method and testing data validation platform based on SOA.",
            "Provision and consumption of linked open data: a define-produce-invoke approach.",
            "From inter-organizational business process models to service-oriented architecture models.",
            "Recruiting the K-most influential prospective workers for crowdsourcing platforms.",
            "Privacy preservation for recommendation databases.",
            "Quick fix for obstacles emerging in management recruitment measure using IOT-based candidate selection.",
            "Hybrid IT architecture by gene-based cryptomata (HITAGC) for lightweight security services.",
            "Multi-Authority-Based File Hierarchy Hidden CP-ABE Scheme for Cloud Security.",
            "Efficient privacy-preserving fault tolerance aggregation for people-centric sensing system.",
            "Resource-sharing among autonomous agents - A comparative study of selfish versus altruistic behaviour.",
            "Fog computing for the integration of agents and web services in an autonomic reflexive middleware.",
            "An approach for business process model registration based on ISO/IEC 19763-5.",
            "Declarative Web services composition using proofs."
        ]
    },
    {
        "name": "SOCA",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 26,
        "papers": [
            "A survey of autonomic computing methods in digital service ecosystems.",
            "CluCF: a clustering CF algorithm to address data sparsity problem.",
            "Customer on-boarding strategies for cloud computing services with dynamic service-level agreements.",
            "Design and analysis of an efficient QoS improvement policy in cloud computing.",
            "Decentralized service discovery and selection in Internet of Things applications based on artificial potential fields.",
            "MADONA: a method for automated provisioning of cloud-based component-oriented business applications.",
            "A user-centric semantic-based algorithm for ranking services: design and analysis.",
            "Performance-aware server architecture recommendation and automatic performance verification technology on IaaS cloud.",
            "The impact of feature selection on maintainability prediction of service-oriented applications.",
            "A declarative language to support dynamic evolution of web service business protocols.",
            "QoS-aware optimal and automated semantic web service composition with user's constraints.",
            "On business process monitoring using cross-flow coordination.",
            "Exploring the main building blocks of SOA method: SOA maturity model perspective.",
            "Cost comparison of running web applications in the cloud using monolithic, microservice, and AWS Lambda architectures.",
            "PSearch: a framework for semantic annotated process model search.",
            "Blind-date conversation joining.",
            "Creating and utilizing section-level Web service tags in service replaceability.",
            "A specification-based QoS-aware design framework for service-based applications.",
            "Automatic run-time versioning for BPEL processes.",
            "A global generic architecture for the future Internet of Things.",
            "ARMISCOM: self-healing service composition.",
            "A planning approach to the automated synthesis of template-based process models.",
            "Exploiting Internet of Things information to enhance venues' recommendation accuracy.",
            "Cost-optimized redundant data storage in the cloud.",
            "Optimized IoT service placement in the fog.",
            "Cloud service brokerage: enhancing resilience in virtual enterprises through service governance and quality assurance."
        ]
    },
    {
        "name": "SOCA",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 23,
        "papers": [
            "A distributed architecture for efficient Web service discovery.",
            "An Intents-based approach for dynamic service discovery.",
            "SOA+d: a new way to design the decision in SOA - based on the new standard Decision Model and Notation (DMN).",
            "Personal mobile services.",
            "Technologies for Web and cloud service interaction: a survey.",
            "Generalized semantic Web service composition.",
            "A Web service QoS prediction approach based on time- and location-aware collaborative filtering.",
            "A service requirements engineering method for a digital service ecosystem.",
            "Towards a formal study of automatic failure recovery in protocol-based web service composition.",
            "An adaptive agent-based system for deregulated smart grids.",
            "Anatomy of one service-oriented architecture implementation and reasons behind low service reuse.",
            "Semantic approach for Web service classification using machine learning and measures of semantic relatedness.",
            "Sound conflict management and resolution for virtual-enterprise collaborations.",
            "Patterns and tools for business process monitoring customization.",
            "An aggregated technique for optimization of SOAP performance in communication in Web services.",
            "Toward the automation of a QoS-driven SLA establishment in the Cloud.",
            "A process-mining-based scenarios generation method for SOA application development.",
            "Service replication taxonomy in distributed environments.",
            "The SemSPM approach: fine integration of WS-SecurityPolicy semantics to enhance matching security policies in SOA.",
            "Automating the semantic mapping between regulatory guidelines and organizational processes.",
            "Portability of executable service-oriented processes: metrics and validation.",
            "FRWSC: a framework for robust Web service composition.",
            "Opening web applications for third-party development: a service-oriented solution."
        ]
    },
    {
        "name": "SOCA",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 18,
        "papers": [
            "Anytime QoS-aware service composition over the GraphPlan.",
            "Enabling the deployment of mobile services for end-users: the SMS approach.",
            "A guidance process to modernize legacy applications for SOA.",
            "A novel framework for bindings synchronization of Web services.",
            "The temporal perspective in business process modeling: a survey and research challenges.",
            "An extended ontology-based context model and manipulation calculus for dynamic Web service processes.",
            "An approach for selecting best available services through a new method of decomposing QoS constraints.",
            "A quality model for social networks populated with web services.",
            "A method for fair propagation of user perceptions for trust management in composite services.",
            "Enabling service-level agreement renegotiation through extending WS-Agreement specification.",
            "Mechanism and architecture for the migration of service implementation during traffic peaks.",
            "Preface.",
            "On the behaviour of general purpose applications on cloud storages.",
            "A formalized framework for mobile cloud computing.",
            "Self-adaptive multiparty sessions.",
            "Pabble: parameterised Scribble.",
            "Location-independent routing in process network overlays.",
            "Partially distributed coordination with Reo and constraint automata."
        ]
    },
    {
        "name": "SOCA",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 19,
        "papers": [
            "A Web services vulnerability testing approach based on combinatorial mutation and SOAP message mutation.",
            "Personalized recommendation based on review topics.",
            "A methodology to map customer complaints and measure customer satisfaction and loyalty.",
            "PBA4WSSP: a policy-based architecture for web services security processing.",
            "Modeling run-time adaptation at the system architecture level in dynamic service-oriented environments.",
            "Probabilistic top-K dominating services composition with uncertain QoS.",
            "Integration of business process modeling and Web services: a survey.",
            "A survey of methods and approaches for reliable dynamic service compositions.",
            "Introducing web service accessibility assessment techniques through a unified quality of service context.",
            "Optima: a domain-specific model for prioritization and conflicts management in requirements engineering for services intermediaries.",
            "An e-commerce-oriented creditworthiness service.",
            "A systematic survey of service identification methods.",
            "A semantic selection approach for composite Web services using OWL-DL and rules.",
            "Towards a framework for the development of adaptable service-based applications.",
            "Introduction to the special issue from the European conference on service-oriented and cloud computing.",
            "Efficient adaptive QoS-based service selection.",
            "Orchestrating web services using Reo: from circuits and behaviors to automatically generated code.",
            "On expanding protocol conformance checking to exception handling.",
            "Formal modeling and analysis of resource management for cloud architectures: an industrial case study using Real-Time ABS."
        ]
    },
    {
        "name": "SOCA",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 20,
        "papers": [
            "Guest editorial notes for selected papers from ICEBE 2011.",
            "Real-time service process admission control with schedule reorganization.",
            "QoS aggregation for service orchestrations based on workflow pattern rules and MCDM method: evaluation at design time and runtime.",
            "Data mining for unemployment rate prediction using search engine query data.",
            "Algorithms for Web service selection with static and dynamic requirements.",
            "Domain-specific language for event-based compliance monitoring in process-driven SOAs.",
            "Introduction to special issue on cloud and service computing.",
            "Resource virtualization methodology for on-demand allocation in cloud computing systems.",
            "Composite web QoS with workflow conditional pathways using bounded sets.",
            "User-centered design of a QoS-based web service selection system.",
            "Situational data integration with data services and nested table.",
            "Context data management: an architectural framework for context-aware services.",
            "Semantic web services publication and OCT-based discovery in structured P2P network.",
            "GOS: a global optimal selection strategies for QoS-aware web services composition.",
            "A systematic literature review of service choreography adaptation.",
            "XrML-RBLicensing approach adapted to the BPEL process of composite web services.",
            "Goal-based business service composition.",
            "A survey of change management in service-based environments.",
            "SOA-enabled compliance management: instrumenting, assessing, and analyzing service-based business processes.",
            "A policy-based approach for strong mobility of composed Web services."
        ]
    },
    {
        "name": "SOCA",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 27,
        "papers": [
            "Towards efficiency of QoS-driven semantic web service composition for large-scale service-oriented systems.",
            "A sharing-oriented service selection and scheduling approach for the optimization of resource utilization.",
            "WSCMon: runtime monitoring of web service orchestration based on refinement checking.",
            "A recommender system based on historical usage data for web service discovery.",
            "Service-oriented smart home applications: composition, code generation, deployment, and execution.",
            "Guest editorial notes for selected papers from SOCA 2010.",
            "Weighted fuzzy clustering for capability-driven service aggregation.",
            "A data access framework for service-oriented rich clients.",
            "Combining horizontal and vertical composition of services.",
            "Change impact analysis in service-based business processes.",
            "Virtualised e-Learning on the IRMOS real-time Cloud.",
            "Designing, formalizing, and evaluating a flexible architecture for integrated service delivery: combining event-driven and service-oriented architectures.",
            "A formal model for the interoperability of service clouds.",
            "Asset monitoring in the service-oriented Internet of Things empowered smartgrid.",
            "The impact of service system on the implementation of cluster supply chain.",
            "CRP: context-based reputation propagation in services composition.",
            "A service-oriented architecture for robust e-voting.",
            "Service Orientation and the Smart Grid state and trends.",
            "Dynamic provisioning in multi-tenant service clouds.",
            "A modelling approach to Service oriented Architecture for on-line diagnosis.",
            "Iterative multi-party agreement negotiation for establishing collaborations.",
            "Mobile Web and service applications: guest editors' introduction.",
            "Toward a cloud-based mobile device: Scriptable web applications as first-class citizens.",
            "Social group formation with mobile cloud services.",
            "TransportML platform for collaborative location-based services.",
            "A synergy between context-aware policies and AOP to achieve highly adaptable Web services.",
            "Distributed and minimal usage control."
        ]
    },
    {
        "name": "SOCA",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 13,
        "papers": [
            "Web Service management system for bioinformatics research: a case study.",
            "Distributing emotional services in Ambient Intelligence through cognitive agents.",
            "Service licensing: conceptualization, formalization, and expression.",
            "Which middleware platform should you choose for your next remote service?",
            "A survey on service-oriented middleware for wireless sensor networks.",
            "Efficient change management in long-term composed services.",
            "A declarative two-level framework to specify and verify workflow and authorization policies in service-oriented architectures.",
            "Metrics for BPEL process context-independency analysis.",
            "Ontology-driven service composition for end-users.",
            "Registry support for core component-based business document models.",
            "Guiding the selection of service-oriented software engineering methodologies.",
            "Resource management framework for collaborative computing systems over multiple virtual machines.",
            "Modeling service representatives in enterprise systems using generic agents."
        ]
    },
    {
        "name": "SOCA",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 20,
        "papers": [
            "Guest editorial: special section on real-time service-oriented architecture and applications.",
            "Event-driven modeling and testing of real-time web services.",
            "Toward effective service composition for real-time SOA-based systems.",
            "Next generation remote critical care through service-oriented architectures: challenges and opportunities.",
            "Weighted fair share scheduling for loosely controlled concurrent event systems.",
            "A two-phase framework for quality-aware Web service selection.",
            "Modeling enterprise service-oriented architectural styles.",
            "Protocol contracts with application to choreographed multiparty collaborations.",
            "B2B collaboration through web services-based multi-agent system.",
            "Guest editorial: special selection on commerce and enterprise computing.",
            "The design and implementation of service process reconfiguration with end-to-end QoS constraints in SOA.",
            "Short-term performance management by priority-based queueing.",
            "Acquaintance-based trust model for the evolution of cooperation in business games.",
            "A flexible, object-centric approach for business process modelling.",
            "MaDe4IC: an abstract method for managing model dependencies in inter-organizational cooperations.",
            "Optimum allocation of distributed service workflows with probabilistic real-time guarantees.",
            "Dynamic grid quorum: a reconfigurable grid quorum and its power optimization algorithm.",
            "An automated approach to Semantic Web Services Mediation.",
            "An offer generation approach to SLA negotiation support in service oriented computing.",
            "Web services choreography validation."
        ]
    },
    {
        "name": "SOCA",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 19,
        "papers": [
            "Issues in collaboration services.",
            "CERA: a collaborative environment reference architecture for interoperable CWE systems.",
            "POPEYE: providing collaborative services for ad hoc and spontaneous communities.",
            "Collaboration through computation: incorporating trust model into service-based software systems.",
            "Pattern-based e-service modelling for virtual service enterprises.",
            "TinySOA: a service-oriented architecture for wireless sensor networks.",
            "Midland: a service-oriented cluster computing infrastructure.",
            "Preface for the ICEBE 2007 special section.",
            "Trust management towards service-oriented applications.",
            "Research on entropy-based collaborative filtering algorithm and personalized recommendation in e-commerce.",
            "QoS-Broker for transactional workloads.",
            "Exploring service-oriented system engineering challenges: a systematic literature review.",
            "Equivalences of BPMN processes.",
            "A semantic-augmented multi-level matching model of Web services.",
            "An adaptive algorithm for QoS-aware service composition in grid environments.",
            "Design and implementation of a service oriented architecture for peer-assisted video-on-demand.",
            "Time-constrained services: a framework for using real-time web services in industrial automation.",
            "A theory of data-intensive software services.",
            "A hierarchical framework for logical composition of web services."
        ]
    },
    {
        "name": "SOCA",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 15,
        "papers": [
            "Relooking at services science and services innovation.",
            "Agent negotiation based ontology refinement process and mechanisms for service applications.",
            "Specification of realizable service conversations using collaboration diagrams.",
            "Performance evaluation of semantic registries: OWLJessKB and instanceStore.",
            "Special issue on service intelligence and service science (SISS).",
            "Management of service-oriented systems.",
            "Optimizing lead time and resource utilization for service enterprises.",
            "Towards flexible compensation for business transactions in Web service environment.",
            "Log-based mining techniques applied to Web service composition reengineering.",
            "Analysis and framework-based design of a fault-tolerant web information system for m-health.",
            "A reference model of virtual service production networks.",
            "A hierarchical, agent-based service oriented architecture for smart environments.",
            "Service-oriented visualization applied to medical data analysis.",
            "Explanation-aware service selection: rationale and reputation.",
            "Agent-based communities of web services: an argumentation-driven approach."
        ]
    },
    {
        "name": "SOCA",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 18,
        "papers": [
            "Introduction by Editor-In-Chief.",
            "Service-oriented system engineering (SOSE) and its applications to embedded system development.",
            "Dynamic replication and synchronization of web services for high availability in mobile ad-hoc networks.",
            "Accountability monitoring and reasoning in service-oriented architectures.",
            "Web services technology in support of business transactions.",
            "Admission control for media on demand services.",
            "A framework for the deployment of adaptable web service compositions.",
            "A view on service-oriented architecture.",
            "Aligning with the Web: an atom-based architecture for Web services discovery.",
            "Context optimization of AI planning for semantic Web services composition.",
            "Semantically-enabled service oriented architecture : concepts, technology and application.",
            "Introduction.",
            "Defending recommender systems: detection of profile injection attacks.",
            "Automated building blocks selection based on business processes semantics in ERPs.",
            "Multi-agent Pareto appointment exchanging in hospital patient scheduling.",
            "An architecture for rapid, on-demand service composition.",
            "A computing model for enhancing service quality and increasing profitability of corporations: model evaluation based on two different sources data.",
            "Data provenance in SOA: security, reliability, and integrity."
        ]
    }
]