[
    {
        "name": "SoSyM",
        "year": "2022",
        "info": "Volume 21: 2022",
        "count": 17,
        "papers": [
            "SoSyM reflections: the 2021 \"state of the journal\" report.",
            "Models: the fourth dimension of computer science.",
            "Model-driven engineering for mobile robotic systems: a systematic mapping study.",
            "On the automation-supported derivation of domain-specific UML profiles considering static semantics.",
            "Suggesting model transformation repairs for rule-based languages using a contract-based testing approach.",
            "An ontological metamodel for cyber-physical system safety, security, and resilience coengineering.",
            "A generic LSTM neural network architecture to infer heterogeneous model transformations.",
            "Cyber security threat modeling based on the MITRE Enterprise ATT&CK Matrix.",
            "Modelling on mobile devices.",
            "Bridging the model-to-code abstraction gap with fuzzy logic in model-based regression test selection.",
            "Guiding the evolution of product-line configurations.",
            "Recommender systems in model-driven engineering.",
            "MIKADO: a smart city KPIs assessment modeling framework.",
            "A method for transforming knowledge discovery metamodel to ArchiMate models.",
            "Efficient model similarity estimation with robust hashing.",
            "Graphic modeling in Distributed Autonomous and Asynchronous Automata (DA3).",
            "Enhancing software model encoding for feature location approaches based on machine learning techniques."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2021",
        "info": "Volume 20: 2021",
        "count": 94,
        "papers": [
            "SoSyM reflections: the 2020 \"State of the Journal\" report.",
            "The triptych of conceptual modeling.",
            "Guest editorial for EMMSAD'2019 special section.",
            "Imperative versus declarative constraint specification languages: a controlled experiment.",
            "Profiling users via their reviews: an extended systematic mapping study.",
            "Ontologies for finding journalistic angles.",
            "Automatic derivation of conceptual database models from differently serialized business process models.",
            "Implementation of a continuous delivery pipeline for enterprise architecture model evolution.",
            "An analysis of capability meta-models for expressing dynamic business transformation.",
            "Generation of hazard relation diagrams: formalization and tool support.",
            "A framework for automated multi-stage and multi-step product configuration of cyber-physical systems.",
            "On the benefits of file-level modularity for EMF models.",
            "Reflections on the standardization of SysML 2.",
            "Software engineering and formal methods: SEFM 2019 special section.",
            "An epistemic approach to the formal specification of statistical machine learning.",
            "Asynchronous session subtyping as communicating automata refinement.",
            "An operational guide to monitorability with applications to regular properties.",
            "Reproducible execution of POSIX programs with DiOS.",
            "Test model coverage analysis under uncertainty: extended version.",
            "Mutation testing with hyperproperties.",
            "An improved approach on the model checking for an agent-based simulation system.",
            "Modeling cultures of the embedded software industry: feedback from the field.",
            "Claimed advantages and disadvantages of (dedicated) model transformation languages: a systematic literature review.",
            "Modeling and simulation of the IEEE 802.11e wireless protocol with hidden nodes using Colored Petri Nets.",
            "Consistent change propagation within models.",
            "Specification and automated verification of atomic concurrent real-time transactions.",
            "Modeling in the large: model libraries.",
            "Specifying dynamic software system architectures.",
            "Guest editorial to the theme section on Multi-Paradigm Modeling for Cyber-Physical Systems.",
            "Multi-paradigm modelling for cyber-physical systems: a descriptive framework.",
            "An actor-based framework for asynchronous event-based cyber-physical systems.",
            "Handling causality and schedulability when designing and prototyping cyber-physical systems.",
            "Predictions-on-chip: model-based training and automated deployment of machine learning models at runtime.",
            "Guaranteed master for interval-based cosimulation.",
            "Implementing QVT-R via semantic interpretation in UML-RSDS.",
            "Wodel-Test: a model-based framework for language-independent mutation testing.",
            "Live modeling in the context of state machine models and code generation.",
            "Graphical composite modeling and simulation for multi-aircraft collision avoidance.",
            "Pragmatic reuse for DSML development.",
            "CEViNEdit: improving the process of creating cognitively effective graphical editors with GMF.",
            "A systematic literature review of cross-domain model consistency checking by model management tools.",
            "A domain-specific modeling milestone.",
            "Guest editorial for EMMSAD'2020 special section.",
            "Foundations of information technology based on Bunge's systemist philosophy of reality.",
            "A technique for evaluating and improving the semantic transparency of modeling language notations.",
            "Defining business model key performance indicators using intentional linguistic summaries.",
            "Towards a model-driven approach for multiexperience AI-based user interfaces.",
            "Improving query performance on dynamic graphs.",
            "Analysis of variability models: a systematic literature review.",
            "CHECKSUM: tracking changes and measuring contributions in cooperative systems modeling.",
            "A survey on the design space of end-user-oriented languages for specifying robotic missions.",
            "Using recommender systems to improve proactive modeling.",
            "Uncertainty representation in software models: a survey.",
            "What is a process model composed of?",
            "Optimization framework for DFG-based automated process discovery approaches.",
            "A formal approach to finding inconsistencies in a metamodel.",
            "Virtual network embedding: ensuring correctness and optimality by construction using model transformation and integer linear programming techniques.",
            "The wild-west of modeling (Revisited).",
            "Model-based intelligent user interface adaptation: challenges and future directions.",
            "Special section of business process modeling, development and support (BPMDS) 2019: transformative BPMDS.",
            "Case model landscapes: toward an improved representation of knowledge-intensive processes using the fCM-language.",
            "Language-independent look-ahead for checking multi-perspective declarative process models.",
            "Coordinating large distributed relational process structures.",
            "Exploring how users engage with hybrid process artifacts based on declarative process models: a behavioral analysis based on eye-tracking and think-aloud.",
            "HoloFlows: modelling of processes for the Internet of Things in mixed reality.",
            "MUPPIT: a method for using proper patterns in model transformations.",
            "Model-driven development platform selection: four industry case studies.",
            "Spectra: a specification language for reactive systems.",
            "A modeling methodology for collaborative evaluation of future automotive innovations.",
            "Model-based cloud resource management with TOSCA and OCCI.",
            "Coupling solvers with model transformations to generate explorable model sets.",
            "Handling nonconforming individuals in search-based model-driven engineering: nine generic strategies for feature location in the modeling space of the meta-object facility.",
            "Distributed model validation with Epsilon.",
            "Automated generation of consistent, diverse and structurally realistic graph models.",
            "Controllable and decomposable multidirectional synchronizations.",
            "Reference models: how can we leverage them?",
            "Integrating the analysis of multiple non-functional properties in model-driven engineering.",
            "Guest editorial to the special section of models 2019.",
            "Evaluation of a machine learning classifier for metamodels.",
            "Correction to: Evaluation of a machine learning classifier for metamodels.",
            "Unified verification and monitoring of executable UML specifications.",
            "Automatic generation of atomic multiplicity-preserving search operators for search-based model engineering.",
            "Runtime translation of OCL-like statements on Simulink models: Expanding domains and optimising queries.",
            "Applying MDD in the content management system domain.",
            "Model-based resource analysis and synthesis of service-oriented automotive software architectures.",
            "Testing cockpit display systems of aircraft using a model-based approach.",
            "Model-driven engineering city spaces via bidirectional model transformations.",
            "Guided architecture trade space exploration: fusing model-based engineering and design by shopping.",
            "Bootstrapping MDE development from ROS manual code: Part 2 - Model generation and leveraging models at runtime.",
            "Modeling data protection and privacy: application and experience with GDPR.",
            "CMMN evaluation: the modelers' perceptions of the main notation elements.",
            "Characteristics, potentials, and limitations of open-source Simulink projects for empirical research.",
            "Unleashing textual descriptions of business processes.",
            "Conceptualization, measurement, and application of semantic transparency in visual notations."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2020",
        "info": "Volume 19: 2020",
        "count": 73,
        "papers": [
            "SoSyM reflections: the 2019 \"state of the journal\" report.",
            "Grand challenges in model-driven engineering: an analysis of the state of the research.",
            "Introduction to the special section of the 20th International Conference on Model-Driven Engineering Languages and Systems (MODELS'17).",
            "Bridging proprietary modelling and open-source model management tools: the case of PTC Integrity Modeller and Epsilon.",
            "Maintaining consistency in networks of models: bidirectional transformations in the large.",
            "Modeling languages in Industry 4.0: an extended systematic mapping study.",
            "Applying static code analysis for domain-specific languages.",
            "Thirteen years of SysML: a systematic mapping study.",
            "Design and automation of a COSMIC measurement procedure based on UML models.",
            "Lossless compaction of model execution traces.",
            "Heterogeneous megamodel management using collection operators.",
            "Compositional model analysis.",
            "The Software Language Extension Problem.",
            "Guest editorial for EMMSAD'2018 special section.",
            "A security requirements modelling language for cloud computing environments.",
            "Design methods for the new database era: a systematic literature review.",
            "On model-based analysis of organizational structures: an assessment of current modeling approaches and application of multi-level modeling in support of design and analysis of organizational structures.",
            "Mining reading patterns from eye-tracking data: method and demonstration.",
            "Extending organizational capabilities with Open Data to support sustainable and dynamic business ecosystems.",
            "Special section on ICMT at STAF 2018.",
            "Understanding MDE projects: megamodels to the rescue for architecture recovery.",
            "CoqTL: a Coq DSL for rule-based model transformation.",
            "Comparing and classifying model transformation reuse approaches across metamodels.",
            "Modelling the interplay of security, privacy and trust in sociotechnical systems: a computer-aided design approach.",
            "ExpRunA : a domain-specific approach for technology-oriented experiments.",
            "Modeling dynamic structures.",
            "Special section of BPMDS'2017: enabling business transformation by business process modeling, development and support.",
            "From analytical purposes to data visualizations: a decision process guided by a conceptual framework and eye tracking.",
            "Enhancing secure business process design with security process patterns.",
            "Editorial to the theme section on model-based engineering of smart systems.",
            "Early-stage analysis of cyber-physical production systems through collaborative modelling.",
            "A framework for FMI-based co-simulation of human-machine interfaces.",
            "Towards high-level fuzzy control specifications for building automation systems.",
            "Benchmarking bidirectional transformations: theory, implementation, application, and assessment.",
            "Systematic review of matching techniques used in model-driven methodologies.",
            "Transitive-closure-based model checking (TCMC) in Alloy.",
            "Ark: a constraint-based method for architectural synthesis of smart systems.",
            "Using empirical studies to mitigate symbol overload in iStar extensions.",
            "Models as the subject of education.",
            "Personal programming and the object computer.",
            "Guest editorial to the special section on MODELS 2018.",
            "Scalable model views over heterogeneous modeling technologies and resources.",
            "Extending single- to multi-variant model transformations by trace-based propagation of variability annotations.",
            "Model-based safety assessment with SysML and component fault trees: application and lessons learned.",
            "Hardware architecture exploration: automatic exploration of distributed automotive hardware architectures.",
            "Connecting software build with maintaining consistency between models: towards sound, optimal, and flexible building from megamodels.",
            "A model-based architecture for interactive run-time monitoring.",
            "Automated synthesis of local time requirement for service composition.",
            "Behavioral interfaces for executable DSLs.",
            "Opportunities in intelligent modeling assistance.",
            "Modeling research in recent years: special section on ECMFA 2017 and ECMFA 2018.",
            "Integrated model-driven development of self-adaptive user interfaces.",
            "Automatic generation of UML profile graphical editors for Papyrus.",
            "A query-retyping approach to model transformation co-evolution.",
            "A verified catalogue of OCL optimisations.",
            "Incorporating measurement uncertainty into OCL/UML primitive datatypes.",
            "A semi-automated BPMN-based framework for detecting conflicts between security, data-minimization, and fairness requirements.",
            "Scalable modeling technologies in the wild: an experience report on wind turbines control applications development.",
            "Model-driven process enactment for NFV systems with MAPLE.",
            "Modelling multi-criticality vehicular software systems: evolution of an industrial component model.",
            "Special section of business process modeling, development and support (BPMDS) 2018: new perspectives for business process modeling, development and support.",
            "Specification-driven predictive business process monitoring.",
            "An interdisciplinary comparison of sequence modeling methods for next-element prediction.",
            "Toward a methodology for case modeling.",
            "Empirical evaluation of CMMN models: a collaborative process case study.",
            "The RALph miner for automated discovery and verification of resource-aware process models.",
            "IoT meets BPM: a bidirectional communication architecture for IoT-aware process execution.",
            "Editorial to theme section on interplay of model-driven and component-based software engineering.",
            "Hazard-driven realization views for Component Fault Trees.",
            "Mixed-semantics composition of statecharts for the component-based design of reactive systems.",
            "Interface protocol inference to aid understanding legacy software components.",
            "MDWA: a model-driven Web augmentation approach - coping with client- and server-side support.",
            "Requirement-driven model-based development methodology applied to the design of a real-time MEG data processing unit."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2019",
        "info": "Volume 18: 2019",
        "count": 140,
        "papers": [
            "SoSyM reflections: the 2018 \"State of the Journal\" report.",
            "Editorial to theme issue on model-driven engineering of component-based software systems.",
            "A framework to specify system requirements using natural interpretation of UML/MARTE diagrams.",
            "Supporting timing analysis of vehicular embedded systems through the refinement of timing constraints.",
            "Synthesis of verifiable concurrent Java components from formal models.",
            "Multi-objective exploration of architectural designs by composition of model transformations.",
            "Using internal domain-specific languages to inherit tool support and modularity for model transformations.",
            "Transactional execution of hierarchical reconfigurations in cyber-physical systems.",
            "Introduction to the STAF 2015 special section.",
            "Toward live domain-specific languages - From text differencing to adapting models at run time.",
            "F-Alloy: a relational model transformation language based on Alloy.",
            "Change propagation and bidirectionality in internal transformation DSLs.",
            "A systematic approach to constructing families of incremental topology control algorithms using graph transformation.",
            "Translation of ATL to AGT and application to a code generator for Simulink.",
            "Type inference in flexible model-driven engineering using classification algorithms.",
            "Incremental execution of model-to-text transformations using property access traces.",
            "Advanced and efficient execution trace management for executable domain-specific modeling languages.",
            "Experimental evaluation of a novel equivalence class partition testing strategy.",
            "Fast test suite-driven model-based fault localisation with application to pinpointing defects in student programs.",
            "A feature-based classification of formal verification techniques for software models.",
            "Effective product-line testing using similarity-based product prioritization.",
            "A model-driven approach for vulnerability evaluation of modern physical protection systems.",
            "A metrics suite for UML model stability.",
            "Lessons learned from developing mbeddr: a case study in language engineering with MPS.",
            "Realizing strategic fit within the business architecture: the design of a Process-Goal Alignment modeling and analysis technique.",
            "DataMock: An Agile Approach for Building Data Models from User Interface Mockups.",
            "Reusable specification templates for defining dynamic semantics of DSLs.",
            "Interactive web interfaces modeling, simulation and analysis using Colored Petri Nets.",
            "Synthesis and exploration of multi-level, multi-perspective architectures of automotive embedded systems.",
            "SQL-PL4OCL: an automatic code generator from OCL to SQL procedural language.",
            "SoSyM significantly reduces its backlog.",
            "Editorial to the theme section on model-based testing.",
            "Model-based testing of software for automation systems using heuristics and coverage criterion.",
            "Toward testing from finite state machines with symbolic inputs and outputs.",
            "A method for testing and validating executable statechart models.",
            "Temporal property patterns for model-based testing from UML/OCL.",
            "Property-based testing of web services by deriving properties from business-rule models.",
            "Testing concurrent user behavior of synchronous web applications with Petri nets.",
            "Supporting inheritance hierarchy changes in model-based regression test selection.",
            "Guest editorial to the special section on ECMFA and ICMT at STAF 2016 - Modeling and model transformations research in 2016.",
            "An example is worth a thousand words: Creating graphical modelling environments by example.",
            "Model clone detection for rule-based model transformation languages.",
            "A local and global tour on MOMoT.",
            "Stress-testing remote model querying APIs for relational and graph-based stores.",
            "Special Section of BPMDS'2016: Business Processes in a Connected World.",
            "Theoretical foundations and implementation of business process diagrams' complexity management technique based on highlights.",
            "Consistency requirements in business process modeling: a thorough overview.",
            "Toward a framework for self-adaptive workflows in cyber-physical systems.",
            "Managing time-awareness in modularized processes.",
            "Selecting a process variant modeling approach: guidelines and application.",
            "Searching textual and model-based process descriptions based on a unified data format.",
            "Semi-automatic derivation of RESTful choreographies from business process choreographies.",
            "Connecting databases with process mining: a meta model and toolset.",
            "Managing design-time uncertainty.",
            "The next evolution of MDE: a seamless integration of machine learning into domain modeling.",
            "End-to-end model-transformation comprehension through fine-grained traceability information.",
            "3LConOnt: a three-level ontology for context modelling in context-aware computing.",
            "Uncertainty-Wise Cyber-Physical System test modeling.",
            "Assessing the impact of meta-model evolution: a measure and its automotive application.",
            "SMTIBEA: a hybrid multi-objective optimization algorithm for configuring large constrained software product lines.",
            "Formal modeling of biomedical signal acquisition systems: source of evidence for certification.",
            "Applying design patterns in the search-based optimization of software product line architectures.",
            "FlexiSketch: a lightweight sketching and metamodeling approach for end-users.",
            "From use case maps to executable test procedures: a scenario-based approach.",
            "Conceptual distance of models and languages.",
            "Editorial to the theme section on model-based design of cyber-physical systems.",
            "Basic problems in multi-view modeling.",
            "Rigorous design of cyber-physical systems - Linking physicality and computation.",
            "A model-based design approach for simulation and virtual prototyping of automotive control systems using port-Hamiltonian systems.",
            "Hybrid co-simulation: it's about time.",
            "Guest editorial for the special section on MODELS 2016.",
            "Unifying nominal and structural typing.",
            "Metamodel specialization for graphical language support.",
            "Enforcing fine-grained access control for secure collaborative modelling using bidirectional transformations.",
            "Correction to: Enforcing fine-grained access control for secure collaborative modelling using bidirectional transformations.",
            "Advanced prefetching and caching of models with PrefetchML.",
            "Handling index-out-of-bounds in safety-critical embedded C code using model-based development.",
            "Guest editorial for EMMSAD'2017 special section.",
            "What practitioners really want: requirements for visual notations in conceptual modeling.",
            "Method engineering in information systems analysis and design: a balanced scorecard approach for method improvement.",
            "An experiment in model-driven conceptual database design.",
            "Evaluating the comprehension of means-ends maps.",
            "On leveraging the fruits of research efforts in the arena of business process modeling formalisms: a map-driven approach for decision making.",
            "A feature-based survey of model view approaches.",
            "Introducing probabilistic reasoning within Event-B.",
            "A model-driven framework for developing multi-agent systems in emergency response environments.",
            "An integrated metamodel-based approach to software model refactoring.",
            "Template-based model generation.",
            "Transforming XML schemas into OWL ontologies using formal concept analysis.",
            "Consolidation of database check constraints.",
            "Multidimensional context modeling applied to non-functional analysis of software.",
            "Enabling automated requirements reuse and configuration.",
            "Example-driven modeling: on effects of using examples on structural model comprehension, what makes them useful, and how to create them.",
            "Towards a model-driven engineering approach for the assessment of non-functional properties using multi-formalism.",
            "Tradeoffs in modeling performance of highly configurable software systems.",
            "An integrated conceptual model for information system security risk management supported by enterprise architecture management.",
            "Execution of UML models: a systematic review of research and practice.",
            "Survey and classification of model transformation tools.",
            "BPMN-E2: a BPMN extension for an enhanced workflow description.",
            "Meta3: a code generator framework for domain-specific languages.",
            "Improving user productivity in modeling tools by explicitly modeling workflows.",
            "Static slicing of Use Case Maps requirements models.",
            "Using language workbenches and domain-specific languages for safety-critical software development.",
            "Conformance checking in UML artifact-centric business process models.",
            "Model-integrating development of software systems: a flexible component-based approach.",
            "Use, potential, and showstoppers of models in automotive requirements engineering.",
            "SQME: a framework for modeling and evaluation of software architecture quality attributes.",
            "A4WSN: an architecture-driven modelling platform for analysing and developing WSNs.",
            "OCLFO: first-order expressive OCL constraints for efficient integrity checking.",
            "DALEC: a framework for the systematic evaluation of data-centric approaches to process management software.",
            "Removing redundant multiplicity constraints in UML class models.",
            "Evaluating user interface generation approaches: model-based versus model-driven development.",
            "Artefacts in software engineering: a fundamental positioning.",
            "Using structural decomposition and refinements for deep modeling of software architectures.",
            "A Multi-Paradigm Modelling approach to live modelling.",
            "Modeling foundations for executable model-based testing of self-healing cyber-physical systems.",
            "Certifying delta-oriented programs.",
            "ParDSL: a domain-specific language framework for supporting deployment of parallel algorithms.",
            "Automatic verification of behavior preservation at the transformation level for relational model transformation.",
            "Profiling the publish/subscribe paradigm for automated analysis using colored Petri nets.",
            "A unifying framework for homogeneous model composition.",
            "Student experience with software modeling tools.",
            "Models@run.time: a guided tour of the state of the art and research challenges.",
            "Empirical study on the effectiveness and efficiency of model-driven architecture techniques.",
            "RoboChart: modelling and verification of the functional behaviour of robotic applications.",
            "An extensible approach to implicit incremental model analyses.",
            "Models as the subject of research.",
            "Contents for a Model-Based Software Engineering Body of Knowledge.",
            "Multi-view approaches for software and system modelling: a systematic literature review.",
            "Privacy-enhanced BPMN: enabling data privacy analysis in business processes models.",
            "Trade-off analysis for SysML models using decision points and CSPs.",
            "A comparative study of students and professionals in syntactical model comprehension experiments.",
            "Modeling compliance specifications in linear temporal logic, event processing language and property specification patterns: a controlled experiment on understandability.",
            "Integrated revision and variation control for evolving model-driven software product lines.",
            "Improving manual reviews in function-centered engineering of embedded systems using a dedicated review model.",
            "Model execution tracing: a systematic mapping study.",
            "ChronoSphere: a graph-based EMF model repository for IT landscape models.",
            "Broadened support for software and system model interchange.",
            "An approach for bug localization in models using two levels: model and metamodel.",
            "A UML Profile for the Design, Quality Assessment and Deployment of Data-intensive Applications."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2018",
        "info": "Volume 17: 2018",
        "count": 60,
        "papers": [
            "SoSyM reflections of 2017: a journal status report.",
            "In memory of Bernhard Schätz, long- time friend and SoSyM editor.",
            "Guest editorial for the special section on MODELS 2014.",
            "A Model-based approach for the synthesis of software to firmware adapters for use with automatically generated components.",
            "Model-driven development of mobile applications for Android and iOS supporting role-based app variability.",
            "Leveraging annotation-based modeling with Jump.",
            "Model-based engineering in the embedded systems domain: an industrial survey on the state-of-practice.",
            "On the impact of size to the understanding of UML diagrams.",
            "Foundations for Streaming Model Transformations by Complex Event Processing.",
            "Editorial to the theme issue on multi-level modeling.",
            "Formalization of the classification pattern: survey of classification modeling in information systems engineering.",
            "Toward a well-founded theory for multi-level conceptual modeling.",
            "Dual deep modeling: multi-level modeling with dual potencies and its formalization in F-Logic.",
            "An integrated multi-level modeling approach for industrial-scale data interoperability.",
            "Scenario-based system design with colored Petri nets: an application to train control systems.",
            "On the use of models for high-performance scientific computing applications: an experience report.",
            "Model-based requirements specification of real-time systems with UML, SysML and MARTE.",
            "Software engineering methods in other engineering disciplines.",
            "A logical approach to systems engineering artifacts: semantic relationships and dependencies beyond traceability - from requirements to functional and architectural views.",
            "Theme section on performance modelling and engineering of software and systems.",
            "Accelerating task completion in mobile offloading systems through adaptive restart.",
            "Model-driven performance prediction of systems of systems.",
            "WESSBAS: extraction of probabilistic workload specifications for load testing and performance prediction - a model-driven approach for session-based application systems.",
            "Using UML/MARTE to support performance tuning and stress testing in real-time systems.",
            "Model-driven optimal resource scaling in cloud.",
            "Toward an analytical method for SLA validation.",
            "Special section of BPMDS'2015: enabling value creation via business process modeling, development, and support.",
            "Toward an execution system for self-healing workflows in cyber-physical systems.",
            "Matching events and activities by integrating behavioral aspects and label analysis.",
            "Scalable process discovery and conformance checking.",
            "Detection and quantification of flow consistency in business process models.",
            "How do humans inspect BPMN models: an exploratory study.",
            "Mining team compositions for collaborative work in business processes.",
            "What can we learn from enterprise architecture models? An experiment comparing models and documents for capability development.",
            "UML customization versus domain-specific languages.",
            "Introduction to the special issue on the 18th international conference on model driven engineering languages and systems (MODELS'15).",
            "Model development guidelines for UML-RT: conventions, patterns and antipatterns.",
            "A framework for relating syntactic and semantic model differences.",
            "Quick fixing ATL transformations with speculative analysis.",
            "Full contract verification for ATL using symbolic execution.",
            "Model-based simulation of legal policies: framework, tool support, and validation.",
            "Testing models and model transformations using classifying terms.",
            "Multi-purpose, multi-level feature modeling of large-scale industrial software systems.",
            "Configuring use case models in product families.",
            "Modeling context-aware and intention-aware in-car infotainment systems - Concepts and modeling processes.",
            "Case-based exploration of bidirectional transformations in QVT Relations.",
            "Visual modeling of RESTful conversations with RESTalk.",
            "Agile model-based system development.",
            "Encoding process discovery problems in SMT.",
            "Reusing metamodels and notation with Diagram Definition.",
            "On submodels and submetamodels with their relation - A uniform formalization through inclusion properties.",
            "VMTL: a language for end-user model transformation.",
            "A model-driven development approach for context-aware systems.",
            "Formalised EMFTVM bytecode language for sound verification of model transformations.",
            "Scope in model transformations.",
            "Holistic security requirements analysis for socio-technical systems.",
            "An approach to clone detection in sequence diagrams and its application to security analysis.",
            "On the automated translational execution of the action language for foundational UML.",
            "Efficient parallel reasoning on fuzzy goal models for run time requirements verification.",
            "The Train Benchmark: cross-technology performance evaluation of continuous model queries."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2017",
        "info": "Volume 16: 2017",
        "count": 56,
        "papers": [
            "SoSyM reflections of 2016: a journal status report.",
            "Introduction to the Software Engineering and Formal Methods 2013 special issue.",
            "Constraint-based test generation for automotive operating systems.",
            "Inferring physical units in formal models.",
            "Introduction to the theme issue on variability modeling of software-intensive systems.",
            "Erratum to: Introduction to the theme issue on variability modeling of software-intensive systems.",
            "Analysing the Linux kernel feature model changes using FMDiff.",
            "The shape of feature code: an analysis of twenty C-preprocessor-based systems.",
            "Empirical assessment of two approaches for specifying software product line use case scenarios.",
            "Specification and automated validation of staged reconfiguration processes for dynamic software product lines.",
            "Statistical prioritization for software product line testing: an experience report.",
            "Variability testing in the wild: the Drupal case study.",
            "Analysing the cognitive effectiveness of the WebML visual notation.",
            "Eugenia: towards disciplined and automated development of GMF-based graphical model editors.",
            "Integrating business process simulation and information system simulation for performance prediction.",
            "An empirical approach toward the resolution of conflicts in goal-oriented models.",
            "Models for the digital transformation.",
            "Guest editorial to the special issue on \"modeling: foundations and applications\" (MODELS 2013).",
            "A taxonomy of tool-related issues affecting the adoption of model-driven engineering.",
            "On the complex nature of MDE evolution and its impact on changeability.",
            "Formal validation of domain-specific languages with derived features and well-formedness constraints.",
            "Language-specific model checking of UML-RT models.",
            "Automated product line test case selection: industrial case study and controlled experiment.",
            "Teaching model-driven engineering from a relational database perspective.",
            "Aspectual templates in UML - Enhancing the semantics of UML templates in OCL.",
            "Proactive modeling: a new model intelligence technique.",
            "Using contexts to extract models from code.",
            "Model-based tool support for Tactical Data Links: an experience report from the defence domain.",
            "Contract-based modeling and verification of timed safety requirements within SysML.",
            "Logic formulas in models.",
            "Theme section of BPMDS'2014: the human perspective in business processes.",
            "Business processes in the agile organisation: a socio-technical perspective.",
            "Evaluating data-centric process approaches: Does the human factor factor in?",
            "A fractal enterprise model and its application for business development.",
            "A participative end-user method for multi-perspective business process elicitation and improvement.",
            "A visual language for modeling multiple perspectives of business process compliance rules.",
            "Designing secure business processes with SecBPMN.",
            "A case study about the improvement of business process models driven by indicators.",
            "Refinement-based Validation of Event-B Specifications.",
            "Design notations for secure software: a systematic literature review.",
            "A graph-theoretic method for the inductive development of reference process models.",
            "An integrated semantics for reasoning about SysML design models using refinement.",
            "Supporting aspect orientation in business process management - From process modelling to process enactment.",
            "The importance of flow in software development.",
            "From software extensions to product lines of dataflow programs.",
            "An approach based on the domain perspective to develop WSAN applications.",
            "Generating process model collections.",
            "Promoting traits into model-driven development.",
            "Process mining using BPMN: relating event logs and process models.",
            "FLAME: a formal framework for the automated analysis of software product lines validated by automated specification testing.",
            "Towards an integrated formal method for verification of liveness properties in distributed systems: with application to population protocols.",
            "Model checking multi-level and recursive nets.",
            "On the formal interpretation and behavioural consistency checking of SysML blocks.",
            "Variability extraction and modeling for product variants.",
            "A model framework-based domain-specific composable modeling method for combat system effectiveness simulation.",
            "A novel model-based testing approach for software product lines."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2016",
        "info": "Volume 15: 2016",
        "count": 53,
        "papers": [
            "The 2015 \"State of the Journal\" report.",
            "Cyber-physical systems challenges: a needs analysis for collaborating embedded software systems.",
            "Industry 4.0 as a Cyber-Physical System study.",
            "Systematic literature review of the objectives, techniques, kinds, and architectures of models at runtime.",
            "SAMM: an architecture modeling methodology for ship command and control systems.",
            "Formalizing and appling compliance patterns for business process compliance.",
            "A profile and tool for modelling safety information with design information in SysML.",
            "An executable formal semantics for UML-RT.",
            "Evaluating the appropriateness of the BPMN 2.0 standard for modeling service choreographies: using an extended quality framework.",
            "Goal-oriented modeling and verification of feature-oriented product lines.",
            "Synthesizing object life cycles from business process models.",
            "The evolution of model editors: browser- and cloud-based solutions.",
            "Special section of BPMDS'2013: coping with complexity in business processes.",
            "A process mining-based analysis of business process work-arounds.",
            "Understanding Declare models: strategies, pitfalls, empirical results.",
            "Effective application of process improvement patterns to business processes.",
            "ReFlO: an interactive tool for pipe-and-filter domain specification and program generation.",
            "A situational method for semi-automated Enterprise Architecture Documentation.",
            "Component-based verification using incremental design and invariants.",
            "Formalizing and verifying stochastic system architectures using Monterey Phoenix.",
            "View-based model-driven software development with ModelJoin.",
            "Extracting finite state representation of Java programs.",
            "Heuristic search for equivalence checking.",
            "A framework for the operationalization of monitoring in business intelligence requirements engineering.",
            "Service feature modeling: modeling and participatory ranking of service design alternatives.",
            "Identifying duplicate functionality in textual use cases by aligning semantic actions.",
            "Models in simulation.",
            "Road to a reactive and incremental model transformation platform: three generations of the VIATRA framework.",
            "Comprehensive analysis of FBD test coverage criteria using mutants.",
            "Model transformation intents and their properties.",
            "Enhanced graph rewriting systems for complex software domains - Dynamic software architecture, non-functional requirements, and correctness by construction.",
            "Turning event logs into process movies: animating what has really happened.",
            "Query-driven soft traceability links for models.",
            "Empirically evaluating OCL and Java for specifying constraints on UML models.",
            "Least-change bidirectional model transformation with QVT-R and ATL.",
            "Clafer: unifying class and feature modeling.",
            "Systematic approach for constructing an understandable state machine from a contract-based specification: controlled experiments.",
            "Expressing aspectual interactions in design: evaluating three AOM approaches in the slot machine domain.",
            "Feature-based classification of bidirectional transformation approaches.",
            "How to write a successful SoSyM submission.",
            "Theme issue on Integrated Formal Methods.",
            "An overview of model checking practices on verification of PLC software.",
            "Model-checking software library API usage rules.",
            "A formal verification framework for static analysis - As well as its instantiation to the resource analyzer COSTA and formal verification tool KeY.",
            "A framework for deadlock detection in core ABS.",
            "Automated anonymity verification of the ThreeBallot and VAV voting systems.",
            "Constructing and verifying a robust Mix Net using CSP.",
            "The Unit-B method: refinement guided by progress concerns.",
            "Integrating deductive verification and symbolic execution for abstract object creation in dynamic logic.",
            "Contract-based verification of discrete-time multi-rate Simulink models.",
            "Knowledge-based construction of distributed constrained systems.",
            "Feature Nets: behavioural modelling of software product lines.",
            "Supporting different process views through a Shared Process Model."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2015",
        "info": "Volume 14: 2015",
        "count": 79,
        "papers": [
            "The 2014 \"State of the Journal\" report.",
            "SEFM: software engineering and formal methods.",
            "Translating between Alloy specifications and UML class diagrams annotated with OCL.",
            "Verification of B+ trees by integration of shape analysis and interactive theorem proving.",
            "TacoFlow: optimizing SAT program verification using dataflow analysis.",
            "Model checking LTL properties over ANSI-C programs with bounded traces.",
            "Procedure-modular specification and verification of temporal safety properties.",
            "Verifying B proof rules using deep embedding and automated theorem proving.",
            "Improving the SAT modulo ODE approach to hybrid systems analysis by combining different enclosure methods.",
            "Synchrony and asynchrony in conformance testing.",
            "Runtime verification of component-based systems in the BIP framework with formally-proved sound and complete instrumentation.",
            "Broadcast psi-calculi with an application to wireless protocols.",
            "Guest editorial to the special issue on MODELS 2011.",
            "A repository for scalable model management.",
            "Model synchronization based on triple graph grammars: correctness, completeness and invertibility.",
            "Automatically reasoning about metamodeling.",
            "A fine-grained analysis of the support provided by UML class diagrams and ER diagrams during data model maintenance.",
            "From well-formedness to meaning preservation: model refactoring for almost free.",
            "Kompren: modeling and generating model slicers.",
            "Guest editorial to the special issue on \"modelling-foundations and applications\".",
            "Formal verification and validation of embedded systems: the UML-based MADES approach.",
            "Model transformations for migrating legacy deployment models in the automotive industry.",
            "The design space of multi-language development environments.",
            "Lightweight string reasoning in model finding.",
            "Model-driven engineering with domain-specific meta-modelling languages.",
            "Resolving model inconsistencies using automated regression planning.",
            "Environment modeling and simulation for automated testing of soft real-time embedded software.",
            "In memory of Robert B. France, Co-Founder and Editor-in-Chief of SoSyM from 1999 to 2015.",
            "Guest editorial to the special section on model transformation.",
            "Reuse in model-to-model transformation languages: are we there yet?",
            "Constraint-driven modeling through transformation.",
            "An algorithm for generating model-sensitive search plans for pattern matching on EMF models.",
            "Specification-driven model transformation testing.",
            "Enhancing classic transformation languages to support multi-level modeling.",
            "Special section of SoSyM dedicated to 50 years of Petri nets.",
            "The concepts of Petri nets.",
            "Business process management as the \"Killer App\" for Petri nets.",
            "Petri nets for the control of discrete event systems.",
            "Petri nets in systems biology.",
            "The Petri net twist in explicit model checking.",
            "Recent and simple algorithms for Petri nets.",
            "Petri and how he saw the world.",
            "VPML: an approach to detect design patterns of MOF-based modeling languages.",
            "Deontic BPMN: a powerful extension of BPMN with a trusted model transformation.",
            "ESUML-EAF: a framework to develop an energy-efficient design model for embedded software.",
            "Extending the UML use case metamodel with behavioral information to facilitate model analysis and interchange.",
            "Formal synthesis of application and platform behaviors of embedded software systems.",
            "From subsets of model elements to submodels - A characterization of submodels and their properties.",
            "Corpus-based analysis of domain-specific languages.",
            "Mashup of metalanguages and its implementation in the Kermeta language workbench.",
            "A generic model decomposition technique and its application to the Eclipse modeling framework.",
            "AuRUS: explaining the validation of UML/OCL conceptual schemas.",
            "Formal verification of QVT transformations for code generation.",
            "A survey of approaches for verifying model transformations.",
            "Distributed implementation of message sequence charts.",
            "Editorial for the SoSyM issue 2015/03.",
            "Special section of BPMDS'2012: artefacts and processes for business process modeling and management.",
            "Styles in business process modeling: an exploration and a model.",
            "Investigating expressiveness and understandability of hierarchy in declarative business process models.",
            "Querying process models by behavior inclusion.",
            "KIPO: the knowledge-intensive process ontology.",
            "Design science in action: developing a modeling technique for eliciting requirements on business process management (BPM) tools.",
            "Localized model transformations for building large-scale transformations.",
            "T-Core: a framework for custom-built model transformation engines.",
            "A demonstration-based model transformation approach to automate model scalability.",
            "An interactive tool for UML class model evolution in database applications.",
            "Converting metamodels to graph grammars: doing without advanced graph grammar features.",
            "Models for digitalization.",
            "Guest editorial to the special section on MODELS 2012.",
            "Example-driven meta-model development.",
            "Evaluating the effort of composing design models: a controlled experiment.",
            "Applying UML/MARTE on industrial projects: challenges, experiences, and guidelines.",
            "Addressing the evolution of automated user behaviour patterns by runtime model interpretation.",
            "Spider Graphs: a graph transformation system for spider diagrams.",
            "Describing and assessing availability requirements in the early stages of system development.",
            "On the comprehension of workflows modeled with a precise style: results from a family of controlled experiments.",
            "A framework for qualitative assessment of domain-specific languages.",
            "A pattern-based approach for improving model quality.",
            "A method of refinement in UML-B."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2014",
        "info": "Volume 13: 2014",
        "count": 68,
        "papers": [
            "The 2013 \"State of the Journal\" report.",
            "Guest editorial to the theme issue on domain-specific modeling in theory and applications.",
            "Message choreography modeling - A domain-specific language for consistent enterprise service integration.",
            "Effective development of automation systems through domain-specific modeling in a small enterprise context.",
            "Composing domain-specific physical models with general-purpose software modules in embedded control software.",
            "An ontology-based framework for domain-specific modeling.",
            "A framework for families of domain-specific modelling languages.",
            "DropsBox: the Dresden Open Software Toolbox - Domain-specific modelling tools beyond metamodels and transformations.",
            "Software and systems modeling with graph transformations theme issue of the Journal on Software and Systems Modeling.",
            "From misuse cases to mal-activity diagrams: bridging the gap between functional security analysis and design.",
            "A transformation-based approach to context-aware modelling.",
            "Domain-specific discrete event modelling and simulation using graph transformation.",
            "A fundamental approach to model versioning based on graph modifications: from theory to implementation.",
            "Bridging the gap between formal semantics and implementation of triple graph grammars - Ensuring conformance of relational model transformation specifications and implementations.",
            "GReTL: an extensible, operational, graph-based transformation language.",
            "Graph and model transformation tools for model migration - Empirical results from the transformation tool contest.",
            "Enhancing the OPEN Process Framework with service-oriented method fragments.",
            "An approach for modeling and detecting software performance antipatterns based on first-order logics.",
            "Requirements-driven deployment - Customizing the requirements model for the host environment.",
            "Modeling big smart data.",
            "Editorial to the theme issue on model-driven service engineering.",
            "On the modeling and generation of service-oriented tool chains.",
            "Model-driven engineering of middleware-based ubiquitous services.",
            "Modeling and enforcing secure object flows in process-driven SOAs: an integrated model-driven approach.",
            "Security modeling for service-oriented systems using security pattern refinement approach.",
            "A model-driven method for enacting the design-time QoS analysis of business processes.",
            "Heuristics for composite Web service decentralization.",
            "Introduction to the SoSyM theme issue on models and evolution.",
            "Change patterns - Co-evolving requirements and architecture.",
            "Evolution styles: foundations and models for software architecture evolution.",
            "Unique identification of elements in evolving software models.",
            "Extracting models from source code in software modernization.",
            "Epsilon Flock: a model migration language.",
            "Merging of EMF models - Formal foundations.",
            "Adapting transformations to metamodel changes via external transformation composition.",
            "A semi-formal description of migrating domain-specific models with evolving domains.",
            "Automatic data collection for enterprise architecture models.",
            "Automated resolution of connector architectures using constraint solving (ARCAS method).",
            "Correct-by-construction synthesis of model transformations using transformation patterns.",
            "Guest editorial to the Theme Section on enterprise modelling.",
            "A case study on consistency management of business and IT process models in banking.",
            "Multi-perspective enterprise modeling: foundational concepts, prospects and future research challenges.",
            "Extending enterprise architecture modeling languages for domain specificity and collaboration: application to telecommunication service design.",
            "Literature review of reuse in business process modeling.",
            "A reference requirements set for public service provision enterprise architectures.",
            "Strategic business modeling: representation and reasoning.",
            "Bridging value modelling to ArchiMate via transaction modelling.",
            "From enterprise architecture to business models and back.",
            "An enterprise architecture framework for multi-attribute information systems analysis.",
            "Assessing event correlation in non-process-aware information systems.",
            "Automatic generation of built-in contract test drivers.",
            "Numeric semantics of class diagrams with multiplicity and uniqueness constraints.",
            "Does aspect-oriented modeling help improve the readability of UML state machines?",
            "Editorial for the SoSyM issue 2014/04.",
            "\"No shit\" or \"Oh, shit!\": responses to observations on the use of UML in professional practice.",
            "Introduction to the theme issue on models for quality of software architecture.",
            "Reengineering component-based software systems with Archimetrix.",
            "The KlaperSuite framework for model-driven reliability analysis of component-based systems.",
            "Modeling event-based communication in component-based software architectures for performance predictions.",
            "Stateful component-based performance models.",
            "Deriving performance-relevant infrastructure properties through model-based experiments with Ginpex.",
            "Extraction and evolution of architectural variability models in plugin-based systems.",
            "Evaluating probabilistic models with uncertain model parameters.",
            "An architecture framework for enterprise IT service availability analysis.",
            "Colouring: execution, debug and analysis of QVT-relations transformations through coloured Petri nets.",
            "Effects of stability on model composition effort: an exploratory study.",
            "Mapping feature models onto domain models: ensuring consistency of configured domain models.",
            "Transformation challenges: from software models to performance models."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2013",
        "info": "Volume 12: 2013",
        "count": 53,
        "papers": [
            "The 2012 \"State of the Journal\" Report.",
            "Remarks on Egon Börger: \"Approaches to model business processes: a critical analysis of BPMN, workflow patterns and YAWL, SOSYM 11: 305-318\".",
            "Guest Editorial to the Theme Section on Model-Driven Web Engineering.",
            "Harvesting models from web 2.0 databases.",
            "Integration of data validation and user interface concerns in a DSL for web applications.",
            "Managing the evolution of data-intensive Web applications by model-driven techniques.",
            "Guest editorial to the special issue on model transformation.",
            "Synchronizing concurrent model updates based on bidirectional transformation.",
            "Typing artifacts in megamodeling.",
            "A collection operator for graph transformation.",
            "Inter-modelling with patterns.",
            "A simple game-theoretic approach to checkonly QVT Relations.",
            "Genericity for model management operations.",
            "Erratum to: Design for service compatibility - Behavioural compatibility checking and diagnosis.",
            "The evolution of modeling research challenges.",
            "Guest editorial to the special section on SEFM 2009.",
            "Event-B patterns and their tool support.",
            "Metric propositional neighborhood logics on natural numbers.",
            "Behavioral specification of reactive systems using stream-based I/O tables.",
            "Relational interprocedural verification of concurrent programs.",
            "Towards clone detection in UML domain models.",
            "Least privilege analysis in software architectures.",
            "A model for dynamic reconfiguration in service-oriented architectures.",
            "Modeling customer-centric value of system architecture investments.",
            "A modular timed graph transformation language for simulation-based design.",
            "Specification of invariability in OCL - Specifying invariable system parts and views.",
            "Building European software architecture community: how far have we come?",
            "Model-based lifecycle management of software-intensive systems, applications, and services.",
            "A newly introduced Industry Voice Column.",
            "Improving engineering efficiency with PLM/ALM.",
            "Guest editorial to the special issue on MODELS 2010.",
            "From types to type requirements: genericity for model-driven engineering.",
            "On model compatibility with referees and contexts.",
            "Design for service compatibility - Behavioural compatibility checking and diagnosis.",
            "Detection and resolution of conflicting change operations in version management of process models.",
            "A visual language for modeling and executing traceability queries.",
            "Engineering model transformations with transML.",
            "On the reuse and recommendation of model refactoring specifications.",
            "On the realizability of collaborative services.",
            "Where does model-driven engineering help? Experiences from three industrial cases.",
            "Supporting multiple perspectives in feature-based configuration.",
            "Why it is so hard to use models in software development: observations.",
            "A classification and rationalization of model-based software development.",
            "Introduction to the theme issue on performance modeling.",
            "Performance models of storage contention in cloud environments.",
            "Performance modeling and analysis of message-oriented event-driven systems.",
            "Mesoscale performance simulation of multicore processor systems.",
            "A component-based end-to-end simulation of the Linux file system.",
            "Experience with model-based performance, reliability, and adaptability assessment of a complex industrial architecture.",
            "Confluence of aspects for sequence diagrams.",
            "Design rationale capture for process improvement in the globalised enterprise: an industrial study.",
            "Embedding domain-specific modelling languages in Maude specifications.",
            "Guidelines for representing complex cardinality constraints in binary and ternary relationships."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2012",
        "info": "Volume 11: 2012",
        "count": 44,
        "papers": [
            "On the relationship between modeling and programming languages - Editorial for the SoSyM Issue 2012/01: Part 1.",
            "The 2011 \"State of the Journal\" Report - Editorial for the SoSyM Issue 2012/01: Part 2.",
            "Editorial for the theme issue on model-based interoperability.",
            "Supporting the internet-based evaluation of research software with cloud infrastructure.",
            "A model-driven approach to automate the propagation of changes among Architecture Description Languages.",
            "Realizing Model Transformation Chain interoperability.",
            "A metamodel for the compact but lossless exchange of execution traces.",
            "Model interoperability in building information modelling.",
            "Reusable model transformations.",
            "Modeling and enforcing invariants of dynamic software architectures.",
            "Data warehouse concepts for model artifacts?",
            "Standards harmonization: theory and practice.",
            "Guest editorial to the special issue on MODELS 2008.",
            "A benchmark for OCL engine accuracy, determinateness, and efficiency.",
            "MOOGLE: a metamodel-based model search engine.",
            "Search-based model transformation by example.",
            "Formal foundation of consistent EMF model transformations by algebraic graph transformation.",
            "Code generation for a family of executable modelling notations.",
            "Classification and trend analysis of UML books (1997-2009).",
            "A graph grammar-based formal validation of object-process diagrams.",
            "Modeling to improve quality or efficiency? An automotive domain perspective.",
            "Approaches to modeling business processes: a critical analysis of BPMN, workflow patterns and YAWL.",
            "Workflow patterns put into context.",
            "Guest editorial to the special issue on MODELS 2009.",
            "Polymorphic scenario-based specification models: semantics and applications.",
            "Modeling modeling modeling.",
            "Weaving variability into domain metamodels.",
            "Dynamic constraint satisfaction problems over models.",
            "Concern coverage in base station development: an empirical investigation.",
            "Change-driven model transformations - Change (in) the rule to rule the change.",
            "The journal on Software and Systems Modeling Matures.",
            "Ten years of software and systems modeling - Reflecting on the past, looking to the future.",
            "Looking back at UML.",
            "Exploiting model driven technology: a tale of two startups.",
            "Aspects of abstraction in software development.",
            "What will it take? A view on adoption of model-based methods in practice.",
            "Lessons learned from building model-driven development tools.",
            "The hidden models of model checking.",
            "What makes a good process model? - Lessons learned from process mining.",
            "How effective is UML modeling ? - An empirical perspective on costs and benefits.",
            "Bridging the chasm between MDE and the world of compilation.",
            "The quest for runware: on compositional, executable and intuitive models.",
            "Developing BP-driven web applications through the use of MDE techniques.",
            "Modeling robustness behavior using aspect-oriented modeling to support robustness testing of industrial systems."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2011",
        "info": "Volume 10: 2011",
        "count": 30,
        "papers": [
            "VbTrace: using view-based and model-driven development to support traceability in process-driven SOAs.",
            "Semantics of trace relations in requirements models for consistency checking and inferencing.",
            "Modeling NASA swarm-based systems: using agent-oriented software engineering and formal methods.",
            "Synthesis of test scenarios using UML activity diagrams.",
            "Design verification in model-based μ-controller development using an abstract component.",
            "Exploring inconsistencies between modal transition systems.",
            "Special section on software engineering and formal methods: extended versions of contributions presented at SEFM 2008.",
            "Formalizing requirements with object models and temporal constraints.",
            "An algebra of product families.",
            "Büchi automata for modeling component connectors.",
            "Testing timed systems modeled by Stream X-machines.",
            "Precise null-pointer analysis.",
            "Verifying workflow processes: a transformation-based approach.",
            "A model-driven method for describing and predicting the reliability of composite services.",
            "Linking models and their storage artifacts.",
            "Guest editorial to the theme issue on non-functional system properties in domain specific modeling languages.",
            "Non-functional properties in the model-driven development of service-oriented systems.",
            "A dependability profile within MARTE.",
            "Modeling safety and airworthiness (RTCA DO-178B) information: conceptual model and UML profile.",
            "A framework to support alignment of secure software engineering with legal regulations.",
            "A transformation contract to generate aspects from access control policies.",
            "Beyond loop bounds: comparing annotation languages for worst-case execution time analysis.",
            "Variability in UML language and semantics.",
            "UML formal semantics: lessons learned.",
            "On tracing reactive systems.",
            "Rigorous identification and encoding of trace-links in model-driven engineering.",
            "The many meanings of UML 2 Sequence Diagrams: a survey.",
            "An executable object-oriented semantics and its application to firewall verification.",
            "Model-driven generative development of measurement software.",
            "Model-based qualitative risk assessment for availability of IT infrastructures."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2010",
        "info": "Volume 9: 2010",
        "count": 27,
        "papers": [
            "The 8th Annual State of SoSyM Report.",
            "Guest Editorial to the Special Section on MODELS 2007.",
            "Bidirectional model transformations in QVT: semantic issues and open questions.",
            "Comparing relational model transformation technologies: implementing Query/View/Transformation with Triple Graph Grammars.",
            "Automatic generation of basic behavior schemas from UML class diagrams.",
            "On challenges of model transformation from UML to Alloy.",
            "Process mining: a two-step approach to balance between underfitting and overfitting.",
            "Incorporating message weights in UML-based analysis of behavioral dependencies in distributed systems.",
            "Modeling for the cloud.",
            "Improving the quality of use case models using antipatterns.",
            "Formal specification of non-functional properties of component-based software systems.",
            "Extending interaction overview diagrams with activity diagram constructs.",
            "Efficient analysis of pattern-based constraint specifications.",
            "Modeling presentation layers of web applications for testing.",
            "Guest editorial to the special section on model transformation.",
            "Module superimposition: a composition technique for rule-based model transformation languages.",
            "Application of reflection in a model transformation language.",
            "A UML/OCL framework for the analysis of graph transformation rules.",
            "Lifting transformational models of product lines: a case study.",
            "Code generation by model transformation: a case study in transformation modularity.",
            "Supporting fine-grained generative model-driven evolution.",
            "Guest editorial to the theme issue on traceability in model-driven engineering.",
            "A model-driven traceability framework for software product lines.",
            "Synchronization of abstract and concrete syntax in domain-specific modeling languages - By mapping models and live transformations.",
            "Graph-based traceability: a comprehensive approach.",
            "Dynamic hierarchical mega models: comprehensive traceability and its efficient maintenance.",
            "A survey of traceability in requirements engineering and model-driven development."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2009",
        "info": "Volume 8: 2009",
        "count": 31,
        "papers": [
            "SoSyM at 7 years.",
            "Meta-environment and executable meta-language using smalltalk: an experience report.",
            "From model transformation to incremental bidirectional model synchronization.",
            "Adherence preserving refinement of trace-set properties in STAIRS: exemplified for information flow properties and policies.",
            "Object-oriented design: A goal-driven and pattern-based approach.",
            "A compositional semantics of UML-RSDS.",
            "XTraQue: traceability for product line systems.",
            "A reconfiguration pattern for distributed embedded systems.",
            "Why Johnny can't model.",
            "Redesign of UML class diagrams: a formal approach.",
            "Qualifying input test data for model transformations.",
            "Use Case Maps as a property specification language.",
            "Reusing semi-specified behavior models in systems analysis and design.",
            "A UML and OWL description of Bunge's upper-level ontology model.",
            "Questionnaire-based variability modeling for system configuration.",
            "A UML-based quantitative framework for early prediction of resource usage and load in distributed real-time systems.",
            "Guest editorial to the special section on model transformation.",
            "Towards the efficient development of model transformations using model weaving and matching transformations.",
            "Modularization of model transformations through a phasing mechanism.",
            "Model transformation by example using inductive logic programming.",
            "Information science and the logic of models.",
            "A systematic approach to generate B preconditions: application to the database domain.",
            "Towards an integrated graph-based semantics for UML.",
            "Generating relational database transactions from eb3 attribute definitions.",
            "Editorial to the theme issue on metamodelling.",
            "Formalizing the structural semantics of domain-specific modeling languages.",
            "Generating instance models from meta models.",
            "Supporting domain-specific model patterns with metamodeling.",
            "Nivel: a metamodelling language with a formal semantics.",
            "Model-based design: a report from the trenches of the DARPA Urban Challenge.",
            "Metamodeling live sequence charts for code generation."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2008",
        "info": "Volume 7: 2008",
        "count": 31,
        "papers": [
            "Model-based development.",
            "Simplifying autonomic enterprise Java Bean applications via model-driven engineering and simulation.",
            "Refactoring OCL annotated UML class diagrams.",
            "Survey of reliability and availability prediction methods from the viewpoint of software architecture.",
            "Producing robust use case diagrams via reverse engineering of use case descriptions.",
            "Applying CSP || B to information systems.",
            "A metamodeling language supporting subset and union properties.",
            "Correct development of real time and embedded systems.",
            "OMEGA: correct development of real time and embedded systems.",
            "Supporting UML-based development of embedded systems by formal techniques.",
            "Modeling and verification of a telecommunication application using live sequence charts and the Play-Engine tool.",
            "Heap-abstraction for an object-oriented calculus with thread classes.",
            "Model driven design and aspect weaving.",
            "A platform independent model for the electronic marketplace domain.",
            "Assert and negate revisited: Modal semantics for UML sequence diagrams.",
            "Fair treatment of evaluations in reviews.",
            "Software engineering and formal methods.",
            "Flexible and configurable verification policies with Omnibus.",
            "Formal analysis of human operator behavioural patterns in interactive surveillance systems.",
            "Automatic maintenance of association invariants.",
            "A methodology for the selection of requirements engineering techniques.",
            "MDA Tool Components: a proposal for packaging know-how in model driven development.",
            "Reducing accidental complexity in domain models.",
            "Improving the accuracy of UML metamodel extensions by introducing induced associations.",
            "Guest Editorial to the Special Issue on MoDELS 2006.",
            "Correctly defined concrete syntax.",
            "Semantics of OCL specified with QVT.",
            "Model-driven analysis and synthesis of textual concrete syntax.",
            "Understanding and improving UML package merge.",
            "Improving the definition of general constraints in UML.",
            "Model-driven assessment of system dependability."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2007",
        "info": "Volume 6: 2007",
        "count": 27,
        "papers": [
            "Does model driven engineering tame complexity?",
            "Implementing associations: UML 2.0 to Java 5.",
            "SoSyM Special Section on Software Engineering and Formal Methods.",
            "An Asynchronous Communication Model for Distributed Concurrent Objects.",
            "Models and temporal logical specifications for timed component connectors.",
            "Computation Orchestration.",
            "Guest Editorial to the Special Issue on UML 2004.",
            "Refactoring object constraint language specifications.",
            "A formal approach to model refactoring and model refinement.",
            "An intermediate metamodel with scenarios and resources for generating performance models from UML designs.",
            "Tool Support for Refinement of Non-functional Specifications.",
            "Development of logical and technical architectures for automotive systems.",
            "Feedback on our editorials.",
            "Informal description and analysis of geographic requirements: an approach based on problems.",
            "A concern architecture view for aspect-oriented software design.",
            "Special section: International Conference on Graph Transformation ICGT 2004.",
            "Analysing refactoring dependencies using graph transformation.",
            "A graph-based algorithm for consistency maintenance in incremental and interactive integration tools.",
            "Event-driven grammars: relating abstract and concrete levels of visual languages.",
            "Six years of modeling in SoSyM.",
            "Guest editorial.",
            "Domain analysis of dynamic system reconfiguration.",
            "Computing refactorings of state machines.",
            "On model typing.",
            "UML vs. classical vs. rhapsody statecharts: not all models are created equal.",
            "A modelling and simulation based process for dependable systems design.",
            "Performance analysis of aspect-oriented UML models."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2006",
        "info": "Volume 5: 2006",
        "count": 30,
        "papers": [
            "Modeling the Complex Living World.",
            "Expert' voice: The BabyUML discipline of programming.",
            "Partitioning of perfect synchroneous reactive specifications to distributed processors using µ-charts.",
            "Exploiting practical limitations of UML diagrams for model validation and execution.",
            "A functional size measurement method for object-oriented conceptual schemas: design and evaluation issues.",
            "A powertype-based metamodelling framework.",
            "Protocol modelling: A modelling approach that supports reusable behavioural abstractions.",
            "Editorial for the SoSyM issue 2006/02.",
            "Extending UML with coordination contracts.",
            "Detecting feature interaction in CPL.",
            "Formal detection of feature interactions with logic programming and LOTOS.",
            "Separation of non-orthogonal concerns in software architecture and design.",
            "SoSyM special section on service-based software engineering.",
            "A metamodel for modeling system features and their refinement, constraint and interaction relationships.",
            "Style-based modeling and refinement of service-oriented architectures.",
            "Automatic derivation of BPEL4WS from IDEF0 process models.",
            "CooPS - Towards a method for coordinating personalized services.",
            "Guest Editorial to the Special Issue on Language Engineering for Model-Driven Software Development.",
            "Definition and validation of model transformations.",
            "The design of a language for model transformations.",
            "Verifying Object-based Graph Grammars.",
            "Implementing a Graph Transformation Engine in Relational Databases.",
            "Five years of modeling in SoSyM.",
            "MDI: A Rule-based Multi-document and Tool Integration Approach.",
            "Matters of (Meta-)Modeling.",
            "More matters on (meta-)modelling: remarks on Thomas Kühne's \"matters\".",
            "Clarifying matters of (meta-) modeling: an author's reply.",
            "Integration of DFDs into a UML-based Model-driven Engineering Approach.",
            "UML specification of access control policies and their formal verification.",
            "TURTLE-P: a UML profile for the formal validation of critical and distributed systems."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2005",
        "info": "Volume 4: 2005",
        "count": 33,
        "papers": [
            "Domain specific modeling.",
            "UML - the Good, the Bad or the Ugly? Perspectives from a panel of experts.",
            "Formal verification of software source code through semi-automatic modeling.",
            "The KeY tool.",
            "An approach for reverse engineering of design patterns.",
            "From scenarios to code: An air traffic control case study.",
            "A reference framework for process-oriented software development organizations.",
            "Model aesthetics.",
            "Introductory paper.",
            "Model transformations and tool integration.",
            "Model-based a-posteriori integration of engineering tools for incremental development processes.",
            "Web services-based tool-integration in the ETI platform.",
            "Design patterns for open tool integration.",
            "On the unification power of models.",
            "Problem frame semantics for software development.",
            "Modeling Multi-agent systems with ANote.",
            "PSL: A semantic domain for flow models.",
            "Modeling Paradigms.",
            "Introduction.",
            "State-based versus event-based specifications for information systems: a comparison of B and eb3.",
            "Investigating a file transfer protocol using CSP and B.",
            "Unifying classes and processes.",
            "Specifying business rules in object-oriented analysis.",
            "Precise visual modeling: A case-study.",
            "Testing Web applications by modeling with FSMs.",
            "Dirk Draheim, Gerald Weber: Form-oriented analysis. A new methodology to model form-based applications.",
            "Guest editorial to the special issue on UML2003.",
            "STAIRS towards formal design with sequence diagrams.",
            "Rule-based update transformations and their application to model refactorings.",
            "Validating UML and OCL models in USE by automatic snapshot generation.",
            "Automated support for deriving test requirements from UML statecharts.",
            "Platform independent Web application modeling and development with Netsilon.",
            "A model-driven runtime environment for Web applications."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2004",
        "info": "Volume 3: 2004",
        "count": 25,
        "papers": [
            "In search of effective design abstractions.",
            "UML 3.0 and the future of modeling.",
            "OCL 1.4/5 vs. 2.0 Expressions Formal semantics and expressiveness.",
            "Formalization of UML state machines using temporal logic.",
            "Nesting in Euler Diagrams: syntax, semantics and construction.",
            "The OsMoSys approach to multi-formalism modeling of systems.",
            "Introductory paper.",
            "Automated formal verification of visual modeling languages by model checking.",
            "A component framework for system modeling based on high-level replacement systems.",
            "Using DAG transformations to verify Euler/Venn homogeneous and Euler/Venn FOL heterogeneous rules of inference.",
            "A method for describing the syntax and semantics of UML statecharts.",
            "Scenario animation for visual behavior models: A generic approach.",
            "Assessing model quality.",
            "Dynamic Meta Modeling with time: Specifying the semantics of multimedia sequence diagrams.",
            "Meta-modelling and graph grammars for multi-paradigm modelling in AToM3.",
            "Use cases - Yesterday, today, and tomorrow.",
            "Plug-and-play composition of features and feature interactions with statechart diagrams.",
            "Reconciling software requirements and architectures with intermediate models.",
            "SoSyM at three.",
            "Guest editorial: On Modeling Object-Oriented Information Systems.",
            "A behavioral analysis and verification approach to pattern-based design composition.",
            "Supporting the reconciliation of models of object behaviour.",
            "Knowledge and software modeling using UML.",
            "On building location aware applications using an open platform based on the NEXUS Augmented World Model.",
            "Model driven architecture: Principles and practice."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2003",
        "info": "Volume 2: 2003",
        "count": 20,
        "papers": [
            "Editorial.",
            "Guest editorial.",
            "Models in Software Engineering.",
            "Communicating the Variability of a Software-Product Family to Customers.",
            "Dealing with Forward and Backward Jumps in Workflow Management Systems.",
            "A Methodological Approach for Object-Relational Database Design using UML.",
            "Editorial - Model engineering.",
            "Modeling agent organizations using roles.",
            "Specifying and executing behavioral requirements: the play-in/play-out approach.",
            "Pattern reification as the basis for description-driven systems.",
            "Modeling learning technology systems as business systems.",
            "EB 3: an entity-based black-box specification method for information systems.",
            "Systematic stereotype usage.",
            "Formal semantics of static and temporal state-oriented OCL constraints.",
            "VPM: A visual, precise and multilevel metamodeling framework for describing mathematical domains and UML (The Mathematics of Metamodeling is Metamodeling Mathematics).",
            "Editorial.",
            "A relational approach to defining and implementing transformations between metamodels.",
            "Dinosaur meets Archaeopteryx? or: Is there an alternative for Rational's Unified Process?",
            "Emerging OCL tools.",
            "A toolkit for model manipulation."
        ]
    },
    {
        "name": "SoSyM",
        "year": "2002",
        "info": "Volume 1: 2002",
        "count": 13,
        "papers": [
            "First Issue of the International Journal on Software and Systems Modeling.",
            "Some Basic Tenets of Description.",
            "A UML-Based Approach to System Testing.",
            "Ontological Evaluation of the UML Using the Bunge-Wand-Weber Model.",
            "On the interpretation of binary associations in the Unified Modelling Language.",
            "Editorial.",
            "Editorial for the Speccial Issue UML 2001 Conference.",
            "The meaning of multiplicity of n-ary associations in UML.",
            "Consistent specification of interface suites in UML.",
            "Bridging the gap between IEEE 1471, an architecture description language, and UML.",
            "A structured operational semantics for UML-statecharts.",
            "Extending the Unified Modeling Language for ontology development.",
            "Growing the UML."
        ]
    }
]