[
    {
        "name": "SPE",
        "year": "2022",
        "info": "Volume 52, 2022",
        "count": 54,
        "papers": [
            "Post golden jubilee year of the software journal: New research trends and strengthening advisory editorial team.",
            "Design of frameworks for self-adaptive service-oriented applications: A systematic analysis.",
            "Software effort estimation accuracy prediction of machine learning techniques: A systematic performance evaluation.",
            "Quantum computing: A taxonomy, systematic review and future directions.",
            "TraceChain: A blockchain-based scheme to protect data confidentiality and traceability.",
            "Just-in-time defect prediction for software hunks.",
            "Reformulation of the performance portability metric.",
            "Benchmarking and learning garbage collection delays for resource-restricted graphical user interfaces.",
            "An energy-aware virtual machines consolidation method for cloud computing: Simulation and verification.",
            "A method to acquire cross-domain requirements based on Syntax Direct Technique.",
            "Real time flood disaster monitoring based on energy efficient ensemble clustering mechanism in wireless sensor network.",
            "Global outliers detection in wireless sensor networks: A novel approach integrating time-series analysis, entropy, and random forest-based classification.",
            "Optimizing checkpoint-based fault-tolerance in distributed stream processing systems: Theory to practice.",
            "Climbing out of a software black hole.",
            "Container lifecycle-aware scheduling for serverless computing.",
            "SPOPB: Reducing solid state drive write traffic for flash-based key-value caching.",
            "RGraph: Asynchronous graph processing based on asymmetry of remote direct memory access.",
            "PDMA: Probabilistic service migration approach for delay-aware and mobility-aware mobile edge computing.",
            "SDFunc: Modular spreadsheet design with sheet-defined functions in Microsoft Excel.",
            "Towards cloud-based unobtrusive monitoring in remote multi-vendor environments.",
            "Computationally easy, spectrally good multipliers for congruential pseudorandom number generators.",
            "Intelligent antiphishing framework to detect phishing scam: A hybrid classification approach.",
            "A metaheuristic-based data replica placement approach for data-intensive IoT applications in the fog computing environment.",
            "How the adoption of feature toggles correlates with branch merges and defects in open-source projects?",
            "A computational approach for progressive architecture shrinkage in action recognition.",
            "Transcoding billions of Unicode characters per second with SIMD instructions.",
            "Equivalent mutant identification using hybrid wavelet convolutional rain optimization.",
            "PolyRec Gesture Design Tool: A tool for fast prototyping of gesture-based mobile applications.",
            "Posits and the state of numerical representations in the age of exascale and edge computing.",
            "Big data analytics in Industry 4.0 ecosystems.",
            "An efficient scheme for secure feature location using data fusion and data mining in internet of things environment.",
            "Data dimensionality reduction techniques for Industry 4.0: Research results, challenges, and future research directions.",
            "Deep-Q learning-based heterogeneous earliest finish time scheduling algorithm for scientific workflows in cloud.",
            "A multidomain virtual network embedding algorithm based on multiobjective optimization for Internet of Drones architecture in Industry 4.0.",
            "A community-based hierarchical user authentication scheme for Industry 4.0.",
            "PSSCC: Provably secure communication framework for crowdsourced industrial Internet of Things environments.",
            "Applying artificial bee colony algorithm to the multidepot vehicle routing problem.",
            "An Internet of Things-enabled decision support system for circular economy business model.",
            "Security analytics for real-time forecasting of cyberattacks.",
            "An efficient Hadoop-based brain tumor detection framework using big data analytic.",
            "Innovative software systems for managing the impact of the COVID-19 pandemic.",
            "An approach to forecast impact of Covid-19 using supervised machine learning model.",
            "NovidChain: Blockchain-based privacy-preserving platform for COVID-19 test/vaccine certificates.",
            "Software system to predict the infection in COVID-19 patients using deep learning and web of things.",
            "Advanced data integration in banking, financial, and insurance software in the age of COVID-19.",
            "A powerful software-defined cyber-physical system to expand CPS adoption.",
            "Efficient interest-aware data dissemination in mobile opportunistic networks.",
            "An evolutionary ensemble analogy-based software effort estimation.",
            "On the (un-)adoption of JavaScript front-end frameworks.",
            "Evaluating the semantic transparency of Guaraná: A domain-specific language for enterprise application integration.",
            "Transcoding web pages via stylesheets and scripts for saving energy on the client.",
            "A comprehensive survey on nature-inspired algorithms and their applications in edge computing: Challenges and future directions.",
            "The evolution of the Arjuna transaction processing system.",
            "Rafting multiplayer video games."
        ]
    },
    {
        "name": "SPE",
        "year": "2021",
        "info": "Volume 51, 2021",
        "count": 126,
        "papers": [
            "Golden Jubilee Year of the Software Journal: Celebrating its Vision, Ground-breaking Contributions and Impact.",
            "Performance analysis of distributed storage clusters based on kernel and userspace traces.",
            "A framework for microservices synchronization.",
            "Autonomic rejuvenation of cloud applications as a countermeasure to software anomalies.",
            "Evaluating system architectures for driving range estimation and charge planning for electric vehicles.",
            "IoT-fog-cloud based architecture for smart systems: Prototypes of autism and COVID-19 monitoring systems.",
            "ThingsMigrate: Platform-independent migration of stateful JavaScript Internet of Things applications.",
            "Efficient POSIX submatch extraction on nondeterministic finite automata.",
            "Evaluating management and orchestration impact on closed-loop orchestration delay.",
            "KubCG: A dynamic Kubernetes scheduler for heterogeneous clusters.",
            "Feature location enhancement based on source code augmentation with synonyms of terms.",
            "Drug investigation tool: Identifying the effect of drug on cell image by using improved correlation.",
            "Energy-Saving Multisensor Data Sampling and Fusion with Decision-Making for Monitoring Health Risk Using WBSNs.",
            "SQVDT: A scalable quantitative vulnerability detection technique for source code security assessment.",
            "APISonar: Mining API usage examples.",
            "Practical dynamic reconstruction of control flow graphs.",
            "Plumb: Efficient stream processing of multi-user pipelines.",
            "Finite-state model extraction and visualization from Java program execution.",
            "MyNeutronDAQ: A general program for data acquisition of neutron scattering spectrometers at China Mianyang Research Reactor and on-line data-analysis.",
            "A model driven and clustering method for service identification directed by metrics.",
            "Semantic eSystems: Engineering methods, techniques, and tools.",
            "An efficient radix trie-based semantic visual indexing model for large-scale image retrieval in cloud environment.",
            "Trilateration-based indoor localization engineering technique for visible light communication system.",
            "GDBApex: A graph-based system to enable efficient transformation of enterprise infrastructures.",
            "PARCIV: Recognizing physical activities having complex interclass variations using semantic data of smartphone.",
            "Spatiotemporal-based sentiment analysis on tweets for risk assessment of event using deep learning approach.",
            "Senti-eSystem: A sentiment-based eSystem-using hybridized fuzzy and deep neural network for measuring customer satisfaction.",
            "Data fusion analysis for attention-deficit hyperactivity disorder emotion recognition with thermal image and Internet of Things devices.",
            "SafeMan: A unified framework to manage cybersecurity and safety in manufacturing industry.",
            "A graph-based convolutional neural network stock price prediction with leading indicators.",
            "Author classification using transfer learning and predicting stars in co-author networks.",
            "INSWF DNA signal analysis tool: Intelligent noise suppression window filter.",
            "Introduction to the Special Issue on Software Engineering in Practice.",
            "How do open source app developers perceive API changes related to Android battery optimization? An empirical study.",
            "Unit of measurement libraries, their popularity and suitability.",
            "Software reuse analytics using integrated random forest and gradient boosting machine learning algorithm.",
            "Predicting just-in-time software defects to reduce post-release quality costs in the maritime industry.",
            "Code-level model checking in the software development workflow at Amazon Web Services.",
            "Leveraging machine learning for software redocumentation - A comprehensive comparison of methods in practice.",
            "A cloud-based integration platform for enterprise application integration: A Model-Driven Engineering approach.",
            "Featured Cover.",
            "Root causing, detecting, and fixing flaky tests: State of the art and future roadmap.",
            "Aggregating data center measurements for availability analysis.",
            "BigDataSDNSim: A simulator for analyzing big data applications in software-defined cloud data centers.",
            "Practical trade-offs for the prefix-sum problem.",
            "Validating UTF-8 in less than one instruction per byte.",
            "Engineering faster sorters for small sets of items.",
            "Advanced control-flow and concurrency in C∀.",
            "SCOZ: A system-wide causal profiler for multicore systems.",
            "Integrated model-driven engineering of blockchain applications for business processes and asset management.",
            "Multiuser collaborative illustration and visualization for volumetric scientific data.",
            "An autonomous IoT service placement methodology in fog computing.",
            "Software fault prediction using Whale algorithm with genetics algorithm.",
            "CONST: Continuous online NoSQL schema tuning.",
            "What factors influence the lifetime of pull requests?",
            "Providing high-level self-adaptive abstractions for stream parallelism on multicores.",
            "Availability modeling in redundant OpenStack private clouds.",
            "An efficient load balancing using seven stone game optimization in cloud computing.",
            "Modified deep belief network based human emotion recognition with multiscale features from video sequences.",
            "Migrating production monolithic systems to microservices using aspect oriented programming.",
            "The human in model-driven engineering loop: A case study on integrating handwritten code in model-driven engineering repositories.",
            "GraphRedex: Look at your research.",
            "An autonomous model for self-optimizing virtual machine selection by learning automata in cloud environment.",
            "A procedural and flexible approach for specification, modeling, definition, and analysis for self-adaptive systems.",
            "Reusability affecting factors and software metrics for reusability: A systematic literature review.",
            "Control and data acquisition software of the high-energy particle detector on board the China Seismo-Electromagnetic Satellite space mission.",
            "A systematic gray literature review: The technologies and concerns of microservice application programming interfaces.",
            "An unmanned aerial vehicles navigation system on the basis of pattern recognition applications - Review of implementation options and prospects for development.",
            "Mutual Information and Feature Importance Gradient Boosting: Automatic byte n-gram feature reranking for Android malware detection.",
            "A Blockchain-based Cyber Attack Detection Scheme for Decentralized Internet of Things using Software-Defined Network.",
            "Design and evaluation of a scalable Internet of Things backend for smart ports.",
            "Algorithms for all-pairs Hamming distance based similarity.",
            "The μTOSCA toolchain: Mining, analyzing, and refactoring microservice-based architectures.",
            "ARTful: A model for user-defined schedulers targeting multiple high-performance computing runtime systems.",
            "Model-based assisted migration of oracle forms applications: The overall process in an industrial setting.",
            "Alchemy: Distributed financial quantitative analysis system with high-level programming model.",
            "Number parsing at a gigabyte per second.",
            "On the comprehension of application programming interface usability in game engines.",
            "Toward an autonomic approach for Internet of Things service placement using gray wolf optimization in the fog computing environment.",
            "Ajalon: Simplifying the authoring of wearable cognitive assistants.",
            "From zero to fog: Efficient engineering of fog-based Internet of Things applications.",
            "Architecture violations detection and visualization in the continuous integration pipeline.",
            "Special issue: Elastic computing from edge to the cloud environments.",
            "Edge-adaptable serverless acceleration for machine learning Internet of Things applications.",
            "Server configuration optimization in mobile edge computing: A cost-performance tradeoff perspective.",
            "EFFORT: Energy efficient framework for offload communication in mobile cloud computing.",
            "Human microservices: A framework for turning humans into service providers.",
            "Function delivery network: Extending serverless computing for heterogeneous platforms.",
            "A lightweight virtualization model to enable edge computing in deeply embedded systems.",
            "Guest Editorial: Special issue on blockchain and decentralized applications.",
            "Jointgraph: A DAG-based efficient consensus algorithm for consortium blockchains.",
            "Using blockchain in the follow-up of emergency situations related to events.",
            "A blockchain-based computation offloading method for edge computing in 5G networks.",
            "A first look at blockchain-based decentralized applications.",
            "Blockchain-based trusted data sharing among trusted stakeholders in IoT.",
            "NeuCheck: A more practical Ethereum smart contract security analysis tool.",
            "BCEdge: Blockchain-based resource management in D2D-assisted mobile edge computing.",
            "Software and hardware co-design for sustainable cyber-physical systems.",
            "Cybersecurity protection on in-vehicle networks for distributed automotive cyber-physical systems: State-of-the-art and future challenges.",
            "Deep domain adversarial residual neural network for sustainable wind turbine cyber-physical system fault diagnosis.",
            "Solving Boolean polynomial systems by parallelizing characteristic set method for cyber-physical systems.",
            "Charging stations-oriented electric vehicle charging strategy based on battery characteristics.",
            "Energy allocation for activity recognition in wearable devices with kinetic energy harvesting.",
            "Field programmable gate array-based all-layer accelerator with quantization neural networks for sustainable cyber-physical systems.",
            "Exploring reliable edge-cloud computing for service latency optimization in sustainable cyber-physical systems.",
            "Network traffic prediction method based on echo state network with adaptive reservoir.",
            "RUE: A caching method for identifying and managing hot data by leveraging resource utilization efficiency.",
            "Towards efficient federated learning-based scheme in medical cyber-physical systems for distributed data.",
            "Dual-grained representation for hand, foot, and mouth disease prediction within public health cyber-physical systems.",
            "AutoToolVCC: Variable consistency check tool for automotive software projects.",
            "Cost risk analysis for instance recommendation in a sustainable Cloud-cyber-physical system framework.",
            "Keywords-driven web APIs group recommendation for automatic app service creation process.",
            "Resource management of IoT edge devices: Challenges, techniques, and solutions.",
            "A cache-based approach toward improved scheduling in fog computing.",
            "Extensive review of cloud resource management techniques in industry 4.0: Issue and challenges.",
            "An energy efficient and low overhead fault mitigation technique for internet of thing edge devices reliable on-chip communication.",
            "Design and data analytics of electronic human resource management activities through Internet of Things in an organization.",
            "A mobile data offloading framework based on a combination of blockchain and virtual voting.",
            "Security of Internet of Things edge devices.",
            "A scalable framework for healthcare monitoring application using the Internet of Medical Things.",
            "Secure data dissemination techniques for IoT applications: Research challenges and opportunities.",
            "Comparative study of support vector machines and random forests machine learning algorithms on credit operation.",
            "Message-sensing classified transmission scheme based on mobile edge computing in the Internet of Vehicles.",
            "FPFTS: A joint fuzzy particle swarm optimization mobility-aware approach to fog task scheduling algorithm for Internet of Things devices.",
            "Service offloading oriented edge server placement in smart farming.",
            "A metaheuristic optimization approach for energy efficiency in the IoT networks."
        ]
    },
    {
        "name": "SPE",
        "year": "2020",
        "info": "Volume 50, 2020",
        "count": 107,
        "papers": [
            "Flexible service consolidation with nested virtualization and library operating systems.",
            "IBFET: Index-based features extraction technique for scalable code clone detection at file level granularity.",
            "Torii: An aspect-based sentiment analysis system that can mine conditions.",
            "Medical social network content analysis for medical image retrieval purpose.",
            "Base64 encoding and decoding at almost the speed of a memory copy.",
            "Domain-specific visualization system based on automatic multiseed recommendations: Extracting stratigraphic structures.",
            "A deep recurrent Q network towards self-adapting distributed microservice architecture.",
            "Effective and efficient Java-type obfuscation.",
            "Adaptive Markov-based approach for dynamic virtual machine consolidation in cloud data centers with quality-of-service constraints.",
            "Introduction to the special issue on software engineering in practice.",
            "Automatic recommendation to appropriate log levels.",
            "DevDocOps: Enabling continuous documentation in alignment with DevOps.",
            "Does your code need comment?",
            "Automated industrial IoT-device integration using the OpenPnP reference architecture.",
            "Interventions for long-term software security: Creating a lightweight program of assurance techniques for developers.",
            "Unsupervised software repositories mining and its application to code search.",
            "MOAManager: A tool to support data stream experiments.",
            "Temporal determinization of mutating finite automata: Reconstructing or restructuring.",
            "Orthogonal persistence in nonvolatile memory architectures: A persistent heap design and its implementation for a Java Virtual Machine.",
            "Deep locality-sensitive discriminative dictionary learning for semantic video analysis.",
            "Software fault prediction using particle swarm algorithm with genetic algorithm and support vector machine classifier.",
            "Standalone noise and anomaly detection in wireless sensor networks: A novel time-series and adaptive Bayesian-network-based approach.",
            "Bringing semantics to multicloud service compositions.",
            "Software tools and techniques for fog and edge computing.",
            "Abnormal visual event detection based on multi-instance learning and autoregressive integrated moving average model in edge-based Smart City surveillance.",
            "User allocation-aware edge cloud placement in mobile edge computing.",
            "A secure fog-based platform for SCADA-based IoT critical infrastructure.",
            "Developing applications in large scale, dynamic fog computing: A case study.",
            "An osmotic computing infrastructure for urban pollution monitoring.",
            "Characterizing application scheduling on edge, fog, and cloud computing resources.",
            "Cloud-aided online EEG classification system for brain healthcare: A case study of depression evaluation with a lightweight CNN.",
            "SEWMS: An edge-based smart wearable maintenance system in communication network.",
            "A crosswalk pedestrian recognition system by using deep learning and zebra-crossing recognition techniques.",
            "Intelligent sentiment analysis approach using edge computing-based deep learning technique.",
            "Pipeline provenance for cloud-based big data analytics.",
            "Socially aware microcloud service overlay optimization in community networks.",
            "DewSim: A trace-driven toolkit for simulating mobile device clusters in Dew computing environments.",
            "How to place your apps in the fog: State of the art and open challenges.",
            "SELFNET 5G mobile edge computing infrastructure: Design and prototyping.",
            "SDN/NFV security framework for fog-to-things computing infrastructure.",
            "New generation cloud computing.",
            "Availability analysis of design configurations to compose virtual performance-optimized data center systems in next-generation cloud data centers.",
            "Toward scalable cloud data center simulation using high-level architecture.",
            "IoTSim-Edge: A simulation framework for modeling the behavior of Internet of Things and edge computing environments.",
            "Deployment of a cloud pipeline for real-time visual inspection using fast streaming high-definition images.",
            "Optimizing computational resource management for the scientific gateways ecosystems based on the service-oriented paradigm.",
            "A multicriteria optimization model for cloud service provider selection in multicloud environments.",
            "Partial migration technique for GPGPU tasks to Prevent GPU Memory Starvation in RPC-based GPU Virtualization.",
            "A systematic approach toward security in Fog computing: Assets, vulnerabilities, possible countermeasures.",
            "Analysis of a cloud migration framework for offline risk assessment of cloud service providers.",
            "A survey on the service interoperability in cloud computing: Client-centric and provider-centric perspectives.",
            "All about activity injection: Threats, semantics, detection, and defense.",
            "Big data deployment in containerized infrastructures through the interconnection of network namespaces.",
            "Robust and efficient memory management in Apache AsterixDB.",
            "Inline wireless mobile sensors and fog nodes placement for leakage detection in water distribution systems.",
            "Predicting Hadoop misconfigurations using machine learning.",
            "Compact Fenwick trees for dynamic ranking and selection.",
            "MMLT: A mutual multilevel trust framework based on trusted third parties in multicloud environments.",
            "A real-time attack defense framework for 5G network slicing.",
            "Healthcare software design and implementation - A project failure case.",
            "Flexible data anonymization using ARX - Current status and challenges ahead.",
            "VR-Rides: An object-oriented application framework for immersive virtual reality exergames.",
            "Designing real-time systems using imprecise discrete-event system specifications.",
            "Tabular-expression-based method for constructing metamorphic relations.",
            "Self-adaptive brainstorming for jobshop scheduling in multicloud environment.",
            "Cetratus: A framework for zero downtime secure software updates in safety-critical systems.",
            "OPAL: An extensible framework for ontology-based program analysis.",
            "MFHS: A modular scheduling framework for heterogeneous system.",
            "A semantic and social-based collaborative recommendation of friends in social networks.",
            "Application of security reference architecture to Big Data ecosystems in an industrial scenario.",
            "Vocabulary and time based bug-assignment: A recommender system for open-source projects.",
            "Configurable three-way model merging.",
            "Autonomic resource provisioning for multilayer cloud applications with K-nearest neighbor resource scaling and priority-based resource allocation.",
            "Two decades of live coding and debugging of virtual machines through simulation.",
            "Microservice transition and its granularity problem: A systematic mapping study.",
            "Sensei: Enforcing secure coding guidelines in the integrated development environment.",
            "A review on the computation offloading approaches in mobile edge computing: A game-theoretic perspective.",
            "Timing isolation and improved scheduling of deep neural networks for real-time systems.",
            "Recommending software features to designers: From the perspective of users.",
            "Component-aware orchestration of cloud-based enterprise applications, from TOSCA to Docker and Kubernetes.",
            "Proximate sharing of geo data using the credit-considered mobile edge computing server switching control scheme.",
            "An empirical comparison of commercial and open-source web vulnerability scanners.",
            "Burrows-Wheeler post-transformation with effective clustering and interpolative coding.",
            "PFACC: An OpenACC-like programming model for irregular nested parallelism.",
            "Privacy and security constraints for code contributions.",
            "\"The Canary in the Coal Mine...\" A cautionary tale from the decline of SourceForge.",
            "Improving LSM-trie performance by parallel search.",
            "R2D2: A scalable deep learning toolkit for medical imaging segmentation.",
            "Impact of etcd deployment on Kubernetes, Istio, and application performance.",
            "Special Issue: Identification, Information, and Knowledge in the Internet of Things.",
            "Load balancing aware scheduling algorithms for fog networks.",
            "Dynamic human contact prediction based on naive Bayes algorithm in mobile social networks.",
            "A physiological data-driven model for learners' cognitive load detection using HRV-PRV feature fusion and optimized XGBoost classification.",
            "ADARC: An anomaly detection algorithm based on relative outlier distance and biseries correlation.",
            "The role of superior image composition in children's analogical reasoning.",
            "Secure and efficient data transfer using spreading and assimilation in MANET.",
            "Field of experts optimization-based noisy image retrieval.",
            "Analyzing spatial analytics systems based on Hadoop and Spark: A user perspective.",
            "Usability implications in software architecture: The case study of a mobile app.",
            "On the synthesis of metadata tags for HTML files.",
            "Easily solving dynamic programming problems in Haskell by memoization of hylomorphisms.",
            "Joint computation offloading and resource provisioning for edge-cloud computing environment: A machine learning-based approach.",
            "HEART: Unrelated parallel machines problem with precedence constraints for task scheduling in cloud computing using heuristic and meta-heuristic algorithms.",
            "Tice: A real-time language compilable using C++ compilers.",
            "Integrated machine learning with semantic web for open government data recommendation based on cloud computing.",
            "Effective approaches to combining lexical and syntactical information for code summarization.",
            "CREW: Cost and Reliability aware Eagle-Whale optimiser for service placement in Fog."
        ]
    },
    {
        "name": "SPE",
        "year": "2019",
        "info": "Volume 49, 2019",
        "count": 80,
        "papers": [
            "A systematic literature review on the detection of smells and their evolution in object-oriented and service-oriented systems.",
            "Software component identification and selection: A research review.",
            "VAnDroid: A framework for vulnerability analysis of Android applications using a model-driven reverse engineering technique.",
            "Tool for materializing OWL ontologies in a column-oriented database.",
            "Face detection based on multilayer feed-forward neural network and Haar features.",
            "DjangoChecker: Applying extended taint tracking and server side parsing for detection of context-sensitive XSS flaws.",
            "Introduction to the special issue on software engineering in practice.",
            "DILAF: A framework for distributed analysis of large-scale system logs for anomaly detection.",
            "Application of data mining methods for effort estimation of software projects.",
            "A learning algorithm for optimizing continuous integration development and testing practice.",
            "A data decomposition method for stepwise migration of complex legacy data.",
            "Practical static analysis of context leaks in Android applications.",
            "Field experience with obfuscating million-user iOS apps in large enterprise mobile development.",
            "A model-driven framework to enhance the consistency of logical integrity constraints: Introducing integrity regression testing.",
            "SMArDT modeling for automotive software testing.",
            "A virtualized test automation framework: A DellEMC case study of test automation practice.",
            "Survey on the run-time systems of enterprise application integration platforms focusing on performance.",
            "SDFS: A software-defined file system for multitenant cloud storage.",
            "Grammar engineering for multiple front-ends for Python.",
            "An integration approach of hybrid databases based on SQL in cloud computing environment.",
            "Architecture conformance analysis using model-based testing: A case study approach.",
            "Efficient resource management in the cloud: From simulation to experimental validation using a low-cost Raspberry Pi testbed.",
            "Realization of distributed system models using code generation extensions.",
            "E2R-F2N: Energy-efficient retailing using a femtolet-based fog network.",
            "The onboard software of the EUSO-SPB pathfinder experiment.",
            "From source code to test cases: A comprehensive benchmark for resource leak detection in Android apps.",
            "A platform for P2P agent-based collaborative applications.",
            "Integration of Cloud, Internet of Things, and Big Data Analytics.",
            "Cloud-based video analytics using convolutional neural networks.",
            "A middleware solution for integrating and exploring IoT and HPC capabilities.",
            "A multitime-steps-ahead prediction approach for scheduling live migration in cloud data centers.",
            "Evolutionary mutation testing for IoT with recorded and generated events.",
            "Reducing the network overhead of user mobility-induced virtual machine migration in mobile edge computing.",
            "Erratum.",
            "Recognising our distinguished referees.",
            "Container-based cluster orchestration systems: A taxonomy and future directions.",
            "Generic input template for cloud simulators: A case study of CloudSim.",
            "Cache-aware design of general-purpose Single-Producer-Single-Consumer queues.",
            "FOSSES: Framework for open-source software evaluation and selection.",
            "SDSN@RT: A middleware environment for single-instance multitenant cloud applications.",
            "Weakly sensitive analysis for JavaScript object-manipulating programs.",
            "Tuning the performance of a computational persistent homology package.",
            "A thermal-aware VM consolidation mechanism with outage avoidance.",
            "Ranking enterprise application integration platforms from a performance perspective: An experience report.",
            "Micro- and macro-optimizations of SaaT search.",
            "Faster remainder by direct computation: Applications to compilers and software libraries.",
            "hMod: A software framework for assembling highly detailed heuristics algorithms.",
            "Service-level agreement-aware scheduling and load balancing of tasks in cloud.",
            "App store mining for iterative domain analysis: Combine app descriptions with user reviews.",
            "A compact index for order-preserving pattern matching.",
            "SmartHerd management: A microservices-based fog computing-assisted IoT platform towards data-driven smart dairy farming.",
            "An exploratory study on cooccurrence of design patterns and bad smells using software metrics.",
            "Use of Modelica language to simulate electrified railway lines and trains.",
            "Static analysis of Android Auto infotainment and on-board diagnostics II apps.",
            "Caterpillar: A business process execution engine on the Ethereum blockchain.",
            "An evaluation of pure spectrum-based fault localization techniques for large-scale software systems.",
            "Threat intelligence platform for the energy sector.",
            "Using Stack Overflow content to assist in code review.",
            "PAxSPL: A feature retrieval process for software product line reengineering.",
            "Framework for cloud-based software test data generation service.",
            "Cloud broker proposal based on multicriteria decision-making and virtual infrastructure migration.",
            "A spark-based big data analysis framework for real-time sentiment prediction on streaming data.",
            "An adaptive plan-oriented and continuous software migration to cloud in dynamic enterprises.",
            "Efficient lock-step synchronization in task-parallel languages.",
            "Component-based permission management of Android applications.",
            "CloudsStorm: A framework for seamlessly programming and controlling virtual infrastructure functions during the DevOps lifecycle of cloud applications.",
            "Straddling the crevasse: A review of microservice software architecture foundations and recent advancements.",
            "Memory-aware kernel mechanism and policies for improving internode load balancing on NUMA systems.",
            "EDISON-DATA: A flexible and extensible platform for processing and analysis of computational science data.",
            "Ranking open source application integration frameworks based on maintainability metrics: A review of five-year evolution.",
            "A process partitioning technique for constructing decentralized web service compositions.",
            "DCAV: A software system to evaluate next-generation cloud data center availability through a friendly graphical interface.",
            "Deep learning the semantics of change sequences for query expansion.",
            "A self-learning fuzzy approach for proactive resource provisioning in cloud environment.",
            "Providing digital identity and academic attributes through European eID infrastructures: Results achieved, limitations, and future steps.",
            "How to evaluate an Internet of Things system: Models, case studies, and real developments.",
            "Service level agreement specification for end-to-end IoT application ecosystems.",
            "Fast and flexible tracepoints in x86.",
            "A highly secured and streamlined cloud collaborative editing scheme along with an efficient user revocation in cloud computing.",
            "CloudSimSDN-NFV: Modeling and simulation of network function virtualization and service function chaining in edge computing environments."
        ]
    },
    {
        "name": "SPE",
        "year": "2018",
        "info": "Volume 48, 2018",
        "count": 107,
        "papers": [
            "CudaFilters: A SignalPlant library for GPU-accelerated FFT and FIR filtering.",
            "Assessing the impact of Volatile Functionality removal in web applications: Model-Driven vs Code-Based approaches.",
            "Developing IntegrityCatalog, a software system for managing integrity-related metadata in digital repositories.",
            "Practical rearrangement methods for dynamic double-array dictionaries.",
            "EPE-Mobile - A framework for early performance estimation of mobile applications.",
            "Decomposition of UML activity diagrams.",
            "Scalable processing and autocovariance computation of big functional data.",
            "KIND-DAMA: A modular middleware for Kinect-like device data management.",
            "Static analysis and process model transformation for an advanced business process to Petri net mapping.",
            "An asynchronous collaborative reconciliation model based on data provenance.",
            "Dynamic slicing of concurrent AspectJ programs: An explicit context-sensitive approach.",
            "Design methods for software architectures in the service-oriented computing and cloud paradigms.",
            "The architectural template method: templating architectural knowledge to efficiently conduct quality-of-service analyses.",
            "An iteration-based interactive analysis method to design dynamic service-oriented systems.",
            "Dynamic reconfiguration of cloud application architectures.",
            "Architectural partitioning and deployment modeling on hybrid clouds.",
            "JDAS: a software development framework for multidatabases.",
            "Function call interception techniques.",
            "Composing annotations without regret? Practical experiences using FeatureC.",
            "Detecting safety-related components in statecharts through traceability and model slicing.",
            "An iterative mathematical decision model for cloud migration: A cost and security risk approach.",
            "Resource provisioning in Science Clouds: Requirements and challenges.",
            "PrivAPP: An integrated approach for the design of privacy-aware applications.",
            "Helenos: A realistic benchmark for distributed transactional memory.",
            "A methodology to infer and refactor an object-oriented model from C applications.",
            "ZX: A network file system for high-latency networks.",
            "K-MING: A mobile proxy handoff control scheme for proximate group-based geodata sharing.",
            "Lightweight migration for web applications with framework separation.",
            "Spectral-based fault localization using hyperbolic function.",
            "ReliaCloud-NS: A scalable web-based simulation platform for evaluating the reliability of cloud computing systems.",
            "Symmetric multiprocessing from boot to virtualization.",
            "Industrial experiences from evolving measurement systems into self-healing systems for improved availability.",
            "An experimental study on the applicability of SYN cookies to networked constrained devices.",
            "Toward characterizing HTML defects on the Web.",
            "A novel approach for generic home emergency management and remote monitoring.",
            "Predicting temporal violations for parallel business cloud workflows.",
            "Pewss: A platform of extensible workflow simulation service for workflow scheduling research.",
            "Improving responsiveness of time-sensitive applications by exploiting dynamic task dependencies.",
            "ProcessAtlas: A scalable and extensible platform for business process analytics.",
            "Roaring bitmaps: Implementation of an optimized software library.",
            "Prediction of quality using ANN based on Teaching-Learning Optimization in component-based software systems.",
            "Static analysis of JavaScript libraries in a scalable and precise way using loop sensitivity.",
            "Enabling the generation of web applications from mockups.",
            "Compact inverted index storage using general-purpose compression libraries.",
            "The analysis of architectural languages for the needs of practitioners.",
            "Recovering disk storage metrics from low-level trace events.",
            "Hardware trace reconstruction of runtime compiled code.",
            "The influencing causes of software unavailability: A case study from industry.",
            "Exploring architecture blueprints for prioritizing critical code anomalies: Experiences and tool support.",
            "Mobolic: An automated approach to exercising mobile application GUIs using symbiosis of online testing technique and customated input generation.",
            "Evaluation of users' privacy concerns by checking of their WhatsApp status.",
            "Model-based design of IoT systems with the BIP component framework.",
            "Automatic benchmark profiling through advanced workflow-based trace analysis.",
            "Automation of application-level caching in a seamless way.",
            "A standard-based architecture to support learning interoperability: A practical experience in gamification.",
            "A policy-centric approach to protecting OS kernel from vulnerable LKMs.",
            "A negotiation-based service selection approach using swarm intelligence and kernel density estimation.",
            "Efficient and retargetable SIMD translation in a dynamic binary translator.",
            "Cover Image.",
            "Query expansion based on statistical learning from code changes.",
            "MapReduce functions to remote sensing distributed data processing - Global vegetation drought monitoring as example.",
            "Cloud simulators in the implementation and evaluation of virtual machine placement algorithms.",
            "Towards a data-driven IoT software architecture for smart city utilities.",
            "Cover Image Volume 48, Issue 8.",
            "Ripple: Reflection analysis for Android apps in incomplete information environments.",
            "Ontology-based model-driven development of a destination management portal: Experience and lessons learned.",
            "A microservice-based architecture for (customisable) analyses of Docker images.",
            "Metropolitan intelligent surveillance systems for urban areas by harnessing IoT and edge computing paradigms.",
            "Selective friends in C++.",
            "A graph grammar-based approach for graph layout.",
            "Formally modeling and analyzing cost-aware job scheduling for cloud data center.",
            "MMRUC3: A recommendation approach of move method refactoring using coupling, cohesion, and contextual similarity to enhance software design.",
            "A parallel portfolio approach to configuration optimization for large software product lines.",
            "Optimizing data stream processing for large-scale applications.",
            "LDMBL: An architecture for reducing code duplication in heavyweight binary instrumentations.",
            "Optimizing MapReduce for energy efficiency.",
            "Server consolidation techniques in virtualized data centers of cloud environments: A systematic literature review.",
            "Metaheuristics in cloud computing.",
            "An energy-aware resource provisioning scheme for real-time applications in a cloud data center.",
            "Energy and cost-aware virtual machine consolidation in cloud computing.",
            "Heuristics and metaheuristics for dynamic management of computing and cooling energy in cloud data centers.",
            "Optimal load distribution for multiple classes of applications on heterogeneous servers with variable speeds.",
            "Optimal selection of VMs for resource task scheduling in geographically distributed clouds using fuzzy c-mean and MOLP.",
            "A multiswarm for composite SaaS placement optimization based on PSO.",
            "A moth-flame optimization algorithm for web service composition in cloud computing: Simulation and verification.",
            "An efficient placement of sinks and SDN controller nodes for optimizing the design cost of industrial IoT systems.",
            "Cover Image Volume 48, Issue 11.",
            "Ontology reuse for multiagent system development through pattern classification.",
            "The PROSIT tool: Toward the optimal design of probabilistic soft real-time systems.",
            "An empirical study of software change classification with imbalance data-handling methods.",
            "SaaS software performance issue identification using HMRF-MAP framework.",
            "Microservices migration patterns.",
            "Faster range minimum queries.",
            "TosKer: A synergy between TOSCA and Docker for orchestrating multicomponent applications.",
            "Time-aware service recommendation: Taxonomy, review, and challenges.",
            "C : Adding modern programming language features to C.",
            "FAHP approach for autonomic resource provisioning of multitier applications in cloud computing environments.",
            "Cost-efficient and network-aware dynamic repartitioning-based algorithms for scheduling large-scale graphs in cloud computing environments.",
            "PARC: A novel OS cache manager.",
            "Work practices and challenges in continuous integration: A survey with Travis CI users.",
            "Toward Linux kernel memory safety.",
            "An ensemble CPU load prediction algorithm using a Bayesian information criterion and smooth filters in a cloud computing environment.",
            "Cloud application architecture appraiser (CA3): A multicriteria approach and tool for assessing cloud deployment options based on nonfunctional requirements.",
            "Ontology population for open-source intelligence: A GATE-based solution.",
            "UnThemida: Commercial obfuscation technique analysis with a fully obfuscated program.",
            "Evaluating the suitability of state-based formal methods for industrial deployment.",
            "Experiences in creating a software tool to analyze and postprocess simulated and measured data."
        ]
    },
    {
        "name": "SPE",
        "year": "2018",
        "info": "Volume 48, 2018",
        "count": 107,
        "papers": [
            "CudaFilters: A SignalPlant library for GPU-accelerated FFT and FIR filtering.",
            "Assessing the impact of Volatile Functionality removal in web applications: Model-Driven vs Code-Based approaches.",
            "Developing IntegrityCatalog, a software system for managing integrity-related metadata in digital repositories.",
            "Practical rearrangement methods for dynamic double-array dictionaries.",
            "EPE-Mobile - A framework for early performance estimation of mobile applications.",
            "Decomposition of UML activity diagrams.",
            "Scalable processing and autocovariance computation of big functional data.",
            "KIND-DAMA: A modular middleware for Kinect-like device data management.",
            "Static analysis and process model transformation for an advanced business process to Petri net mapping.",
            "An asynchronous collaborative reconciliation model based on data provenance.",
            "Dynamic slicing of concurrent AspectJ programs: An explicit context-sensitive approach.",
            "Design methods for software architectures in the service-oriented computing and cloud paradigms.",
            "The architectural template method: templating architectural knowledge to efficiently conduct quality-of-service analyses.",
            "An iteration-based interactive analysis method to design dynamic service-oriented systems.",
            "Dynamic reconfiguration of cloud application architectures.",
            "Architectural partitioning and deployment modeling on hybrid clouds.",
            "JDAS: a software development framework for multidatabases.",
            "Function call interception techniques.",
            "Composing annotations without regret? Practical experiences using FeatureC.",
            "Detecting safety-related components in statecharts through traceability and model slicing.",
            "An iterative mathematical decision model for cloud migration: A cost and security risk approach.",
            "Resource provisioning in Science Clouds: Requirements and challenges.",
            "PrivAPP: An integrated approach for the design of privacy-aware applications.",
            "Helenos: A realistic benchmark for distributed transactional memory.",
            "A methodology to infer and refactor an object-oriented model from C applications.",
            "ZX: A network file system for high-latency networks.",
            "K-MING: A mobile proxy handoff control scheme for proximate group-based geodata sharing.",
            "Lightweight migration for web applications with framework separation.",
            "Spectral-based fault localization using hyperbolic function.",
            "ReliaCloud-NS: A scalable web-based simulation platform for evaluating the reliability of cloud computing systems.",
            "Symmetric multiprocessing from boot to virtualization.",
            "Industrial experiences from evolving measurement systems into self-healing systems for improved availability.",
            "An experimental study on the applicability of SYN cookies to networked constrained devices.",
            "Toward characterizing HTML defects on the Web.",
            "A novel approach for generic home emergency management and remote monitoring.",
            "Predicting temporal violations for parallel business cloud workflows.",
            "Pewss: A platform of extensible workflow simulation service for workflow scheduling research.",
            "Improving responsiveness of time-sensitive applications by exploiting dynamic task dependencies.",
            "ProcessAtlas: A scalable and extensible platform for business process analytics.",
            "Roaring bitmaps: Implementation of an optimized software library.",
            "Prediction of quality using ANN based on Teaching-Learning Optimization in component-based software systems.",
            "Static analysis of JavaScript libraries in a scalable and precise way using loop sensitivity.",
            "Enabling the generation of web applications from mockups.",
            "Compact inverted index storage using general-purpose compression libraries.",
            "The analysis of architectural languages for the needs of practitioners.",
            "Recovering disk storage metrics from low-level trace events.",
            "Hardware trace reconstruction of runtime compiled code.",
            "The influencing causes of software unavailability: A case study from industry.",
            "Exploring architecture blueprints for prioritizing critical code anomalies: Experiences and tool support.",
            "Mobolic: An automated approach to exercising mobile application GUIs using symbiosis of online testing technique and customated input generation.",
            "Evaluation of users' privacy concerns by checking of their WhatsApp status.",
            "Model-based design of IoT systems with the BIP component framework.",
            "Automatic benchmark profiling through advanced workflow-based trace analysis.",
            "Automation of application-level caching in a seamless way.",
            "A standard-based architecture to support learning interoperability: A practical experience in gamification.",
            "A policy-centric approach to protecting OS kernel from vulnerable LKMs.",
            "A negotiation-based service selection approach using swarm intelligence and kernel density estimation.",
            "Efficient and retargetable SIMD translation in a dynamic binary translator.",
            "Cover Image.",
            "Query expansion based on statistical learning from code changes.",
            "MapReduce functions to remote sensing distributed data processing - Global vegetation drought monitoring as example.",
            "Cloud simulators in the implementation and evaluation of virtual machine placement algorithms.",
            "Towards a data-driven IoT software architecture for smart city utilities.",
            "Cover Image Volume 48, Issue 8.",
            "Ripple: Reflection analysis for Android apps in incomplete information environments.",
            "Ontology-based model-driven development of a destination management portal: Experience and lessons learned.",
            "A microservice-based architecture for (customisable) analyses of Docker images.",
            "Metropolitan intelligent surveillance systems for urban areas by harnessing IoT and edge computing paradigms.",
            "Selective friends in C++.",
            "A graph grammar-based approach for graph layout.",
            "Formally modeling and analyzing cost-aware job scheduling for cloud data center.",
            "MMRUC3: A recommendation approach of move method refactoring using coupling, cohesion, and contextual similarity to enhance software design.",
            "A parallel portfolio approach to configuration optimization for large software product lines.",
            "Optimizing data stream processing for large-scale applications.",
            "LDMBL: An architecture for reducing code duplication in heavyweight binary instrumentations.",
            "Optimizing MapReduce for energy efficiency.",
            "Server consolidation techniques in virtualized data centers of cloud environments: A systematic literature review.",
            "Metaheuristics in cloud computing.",
            "An energy-aware resource provisioning scheme for real-time applications in a cloud data center.",
            "Energy and cost-aware virtual machine consolidation in cloud computing.",
            "Heuristics and metaheuristics for dynamic management of computing and cooling energy in cloud data centers.",
            "Optimal load distribution for multiple classes of applications on heterogeneous servers with variable speeds.",
            "Optimal selection of VMs for resource task scheduling in geographically distributed clouds using fuzzy c-mean and MOLP.",
            "A multiswarm for composite SaaS placement optimization based on PSO.",
            "A moth-flame optimization algorithm for web service composition in cloud computing: Simulation and verification.",
            "An efficient placement of sinks and SDN controller nodes for optimizing the design cost of industrial IoT systems.",
            "Cover Image Volume 48, Issue 11.",
            "Ontology reuse for multiagent system development through pattern classification.",
            "The PROSIT tool: Toward the optimal design of probabilistic soft real-time systems.",
            "An empirical study of software change classification with imbalance data-handling methods.",
            "SaaS software performance issue identification using HMRF-MAP framework.",
            "Microservices migration patterns.",
            "Faster range minimum queries.",
            "TosKer: A synergy between TOSCA and Docker for orchestrating multicomponent applications.",
            "Time-aware service recommendation: Taxonomy, review, and challenges.",
            "C : Adding modern programming language features to C.",
            "FAHP approach for autonomic resource provisioning of multitier applications in cloud computing environments.",
            "Cost-efficient and network-aware dynamic repartitioning-based algorithms for scheduling large-scale graphs in cloud computing environments.",
            "PARC: A novel OS cache manager.",
            "Work practices and challenges in continuous integration: A survey with Travis CI users.",
            "Toward Linux kernel memory safety.",
            "An ensemble CPU load prediction algorithm using a Bayesian information criterion and smooth filters in a cloud computing environment.",
            "Cloud application architecture appraiser (CA3): A multicriteria approach and tool for assessing cloud deployment options based on nonfunctional requirements.",
            "Ontology population for open-source intelligence: A GATE-based solution.",
            "UnThemida: Commercial obfuscation technique analysis with a fully obfuscated program.",
            "Evaluating the suitability of state-based formal methods for industrial deployment.",
            "Experiences in creating a software tool to analyze and postprocess simulated and measured data."
        ]
    },
    {
        "name": "SPE",
        "year": "2017",
        "info": "Volume 47, 2017",
        "count": 93,
        "papers": [
            "Reliable self-deployment of distributed cloud applications.",
            "Wireless GINI: an educational platform for hosting virtual wireless networks.",
            "Multiprocessor platform for partitioned real-time systems.",
            "Cold object identification in the Java virtual machine.",
            "LeakSpot: detection and diagnosis of memory leaks in JavaScript applications.",
            "A web system for reasoning with probabilistic OWL.",
            "Bad and good news about using software assurance tools.",
            "Compact visualization of Java program execution.",
            "Modularizing application and database evolution - an aspect-oriented framework for orthogonal persistence.",
            "Runtime recovery actions selection for sporadic operations on public cloud.",
            "A MATLAB subset to C compiler targeting embedded systems.",
            "The accuracy of dependency analysis in static architecture compliance checking.",
            "An improved distributed concolic testing approach.",
            "Special issue on Big Data and Cloud of Things (CoT).",
            "Using adaptive resource allocation to implement an elastic MapReduce framework.",
            "A traffic hotline discovery method over cloud of things using big taxi GPS data.",
            "PM2.5 forecasting with hybrid LSE model-based approach.",
            "Is the data on your wearable device secure? An Android Wear smartwatch case study.",
            "Brain big data processing with massively parallel computing technology: challenges and opportunities.",
            "CloudEyes: Cloud-based malware detection with reversible sketch for resource-constrained internet of things (IoT) devices.",
            "Ahab: A cloud-based distributed big data analytics framework for the Internet of Things.",
            "XHAMI - extended HDFS and MapReduce interface for Big Data image processing applications in cloud computing environments.",
            "Resource requests prediction in the cloud computing environment with a deep belief network.",
            "Adaptable secure communication for the Cloud of Things.",
            "ContainerCloudSim: An environment for modeling and simulation of containers in cloud data centers.",
            "All-in-one implementation framework for binary heaps.",
            "EMP: execution time measurement protocol for compute-bound programs.",
            "Architecting cloud-enabled systems: a systematic survey of challenges and solutions.",
            "Parallel computation of the reachability graph of petri net models with semantic information.",
            "Optimising unicode regular expression evaluation with previews.",
            "A novel model-driven approach for seamless integration.",
            "Modeling and verification of Web services composition based on model transformation.",
            "Engineering order-preserving pattern matching with SIMD parallelism.",
            "Frameworks compiled from declarations: a language-independent approach.",
            "Improving scientific application execution on android mobile devices via code refactorings.",
            "A Bloom filter based semi-index on q-grams.",
            "Toward cost-effective replica placements in cloud storage systems with QoS-awareness.",
            "Freeze'nSense: estimation of performance isolation in cloud environments.",
            "Exploiting long-term and short-term preferences and RFID trajectories in shop recommendation.",
            "In-memory distributed software solution to improve the performance of recommender systems.",
            "Adaptive trade-off between consistency and performance in data replication.",
            "Definition of REST web services with JSON schema.",
            "JAMES: An object-oriented Java framework for discrete optimization using local search metaheuristics.",
            "Special issue on software reuse.",
            "Synergies and tradeoffs in software reuse - a systematic mapping study.",
            "Variability management of plugin-based systems using feature models.",
            "Perils of opportunistically reusing software module.",
            "Modelling a family of systems for crisis management with concern-oriented reuse.",
            "EURECA: End-user requirements engineering with collaborative animation.",
            "Modular composition of multiple applications with architectural event modules.",
            "Identifying evolution patterns: a metrics-based approach for external library reuse.",
            "Software systems for data-centric smart city applications.",
            "Robust power optimization scheme for cooperative wireless relay system in smart city.",
            "A sensitive object-oriented approach to big surveillance data compression for social security applications in smart cities.",
            "A cloud-based taxi trace mining framework for smart city.",
            "Big forensic data management in heterogeneous distributed systems: quick analysis of multimedia forensic data.",
            "A low-cost real-time face tracking system for ITSs and SDASs.",
            "Deep learning and SVM-based emotion recognition from Chinese speech for smart affective services.",
            "Analytics-as-a-service in a multi-cloud environment through semantically-enabled hierarchical data processing.",
            "Pattern-based multi-cloud architecture migration.",
            "Evaluating alternative DaaS solutions in private and public OpenStack Clouds.",
            "Naplus: a software distributed shared memory for virtual clusters in the cloud.",
            "RESeED: A secure regular-expression search tool for storage clouds.",
            "Failover strategy for fault tolerance in cloud computing environment.",
            "iFogSim: A toolkit for modeling and simulation of resource management techniques in the Internet of Things, Edge and Fog computing environments.",
            "Regular and almost universal hashing: an efficient implementation.",
            "Multi-criteria IoT resource discovery: a comparative analysis.",
            "UKI: universal Kinect-type controller by ICE Lab.",
            "A new digital watermarking evaluation and benchmarking methodology using an external group of evaluators and multi-criteria analysis based on 'large-scale data'.",
            "Supporting collaborative software development over GitHub.",
            "A flexible and lightweight user-demand DRM system for multimedia contents over multiple portable device platforms.",
            "Energy consumption analysis of data stream processing: a benchmarking approach.",
            "Applying agile methods to aircraft embedded software: an experimental analysis.",
            "Schedulability analysis and efficient scheduling of rate constrained messages in the TTEthernet protocol.",
            "StopGap: elastic VMs to enhance server consolidation.",
            "Designing expression templates with concepts.",
            "Regression test suite minimization using integer linear programming model.",
            "Modeling Big data-based systems through ontological trading.",
            "Name analysis for modern languages: a general solution.",
            "Improving spectral-based fault localization using static analysis.",
            "Improving online learning activity interoperability with Acos server.",
            "Selective conjunction of context-sensitivity and octagon domain toward scalable and precise global static analysis.",
            "LMA: A generic and efficient implementation of the Levenberg-Marquardt Algorithm.",
            "A robust reconfiguration protocol for the dynamic update of component-based software systems.",
            "Sampled suffix array with minimizers.",
            "Agent-oriented and ontology-driven digital libraries: the IndianaMAS experience.",
            "Exogenous coordination of concurrent software components with JavaBIP.",
            "PHOEBE: an automation framework for the effective usage of diagnosis tools in the performance testing of clustered systems.",
            "Technology beats algorithms (in exact string matching).",
            "The automatic creation of OLAP cube using an MDA approach.",
            "Building design-time and run-time knowledge for QoS-based component assembly.",
            "Modelling, validating, and ranking of secure service compositions.",
            "A model-based framework for automatic generation of a pattern language verifier."
        ]
    },
    {
        "name": "SPE",
        "year": "2016",
        "info": "Volume 46, 2016",
        "count": 70,
        "papers": [
            "AVOCLOUDY: a simulator of volunteer clouds.",
            "Migrating legacy software to the cloud: approach and verification by means of two medical software use cases.",
            "SALOON: a platform for selecting and configuring cloud environments.",
            "The anatomy of big data computing.",
            "Iterative big data clustering algorithms: a review.",
            "Netkit: network emulation for education.",
            "Compressed bitmap indexes: beyond unions and intersections.",
            "Design and implementation of an efficient hybrid dynamic and static typing language.",
            "Bridging the gap between tracking and detecting changes in XML.",
            "Performance-driven instrumentation and mapping strategies using the LARA aspect-oriented programming approach.",
            "TridentFS: a hybrid file system for non-volatile RAM, flash memory and magnetic disk.",
            "Single-scan: a fast star-join query processing algorithm.",
            "PAST: accurate instrumentation on fully optimized program.",
            "A novel malware for subversion of self-protection in anti-virus.",
            "Pairwise testing for systems with data derived from real-valued variable inputs.",
            "RUGRAT: Evaluating program analysis and testing tools and compilers with large generated random benchmark applications.",
            "Practically efficient array initialization.",
            "Ontology-based employer demand management.",
            "A graph-labeling approach for efficient cone-of-influence computation in model-checking problems with multiple properties.",
            "Determinization and minimization of finite acyclic automata by incremental techniques.",
            "A transformation-based approach to testing concurrent programs using UML activity diagrams.",
            "BASE: an assistant tool to precisely simulate energy consumption and reliability of energy-efficient storage systems.",
            "Efficient online cycle detection technique combining with Steensgaard points-to information.",
            "Improving the virtualization of rich applications by combining VNC and streaming protocols at the hypervisor layer.",
            "A design proto-pattern for continuously evaluated forecasting in IBM® InfoSphere® Streams.",
            "RJ: a Java package providing JR-like concurrent programming.",
            "Better bitmap performance with Roaring bitmaps.",
            "SIMD compression and the intersection of sorted integers.",
            "Lexical state analyzer for JavaCC grammars.",
            "C-strider: type-aware heap traversal for C.",
            "Timing analysis of the PREEMPT RT Linux kernel.",
            "Deadline scheduling in the Linux kernel.",
            "Flow-sensitive runtime estimation: an enhanced hot spot detection heuristics for embedded Java just-in-time compilers.",
            "Empirical study of the dynamic behavior of JavaScript objects.",
            "River: an intermediate language for stream processing.",
            "Formulating efficient software solution for digital image processing system.",
            "ManPy: an open-source software tool for building discrete event simulation models of manufacturing systems.",
            "A rule-based procedure for automatic recognition of design patterns in UML diagrams.",
            "Efficient image-aware version control systems using GPU.",
            "Using new scheduling heuristics based on resource consumption information for increasing throughput on rule-based spam filtering systems.",
            "Workload characterization of JVM languages.",
            "RuleSIM: a toolkit for simulating the operation and improving throughput of rule-based spam filters.",
            "A static region-based compiler for the Dalvik virtual machine.",
            "Mining hot calling contexts in small space.",
            "SPOON: A library for implementing analyses and transformations of Java source code.",
            "Design and analysis of target-sensitive real-time systems.",
            "Improving a lightweight LZ77 computation algorithm for running faster.",
            "Scalable framework for parsing: from Fortress to JavaScript.",
            "Visual Language for Use Case Description.",
            "NVMRA: utilizing NVM to improve the random write operations for NAND-flash-based mobile devices.",
            "Inter-JVM Sharing.",
            "A fast algorithm for constructing nearly optimal prefix codes.",
            "Widening with thresholds via binary search.",
            "GISQAF: MapReduce guided spatial query processing and analytics system.",
            "Polymorphic bytecode instrumentation.",
            "Probabilistic logic programming on the web.",
            "Runtime latency detection and analysis.",
            "DataMill: a distributed heterogeneous infrastructure for robust experimentation.",
            "Automatic builder of class diagram (ABCD): an application of UML generation from functional requirements.",
            "Browserbite: cross-browser testing via image processing.",
            "Online anomaly detection for multi-source VMware using a distributed streaming framework.",
            "Register allocation and spilling using the expected distance heuristic.",
            "Maximizing quality of experience through context-aware mobile application scheduling in cloudlet infrastructure.",
            "Consistently faster and smaller compressed bitmaps with Roaring.",
            "SafeType: detecting type violations for type-basedalias analysis of C.",
            "Translating the ARM Neon and VFP instructions in a binary translator.",
            "A continuation-based task programming model for C++: design of the Causeway library.",
            "Privacy-preserving targeted mobile advertising: requirements, design and a prototype implementation.",
            "Adtpp: lightweight efficient safe polymorphic algebraic data types for C.",
            "TRINI: an adaptive load balancing strategy based on garbage collection for clustered Java systems."
        ]
    },
    {
        "name": "SPE",
        "year": "2015",
        "info": "Volume 45, 2015",
        "count": 74,
        "papers": [
            "Decoding billions of integers per second through vectorization.",
            "The personalized context-aware mobile advertisement system using a novel approaching detection method over cellular networks.",
            "Event-driven asynchronous method calls with the D-Bus message system.",
            "Some structural measures of API usability.",
            "An empirical time analysis of evolutionary algorithms as C programs.",
            "A software architecture for virtualized educational multimedia games in IPTV environments.",
            "Autonomic resource contention-aware scheduling.",
            "Implementing an embedded compiler using program transformation rules.",
            "CloudPick: a framework for QoS-aware and ontology-based service deployment across clouds.",
            "Ongoing verification of a multiphysics community code: FLASH.",
            "A suite of abstract domains for static analysis of string values.",
            "Aspect-oriented programming and pluggable software units: a comparison based on design patterns.",
            "A recommendation system for repairing violations detected by static architecture conformance checking.",
            "MidCloud: an agent-based middleware for effective utilization of replicated Cloud services.",
            "A systematic review of tools, languages, and methodologies for mashup development.",
            "Fast in-memory XPath search using compressed indexes.",
            "A generic decentralized trust management framework.",
            "Running repeatable and controlled virtual routing experiments.",
            "Design pattern based model transformation with tool support.",
            "A data-centric framework for debugging highly parallel applications.",
            "Gesture Formalization for Multitouch.",
            "An effective monitoring framework and user interface design.",
            "Is superoptimization viable for VM instruction sets?",
            "Abmash: mashing up legacy Web applications by automated imitation of human actions.",
            "A self-scalable load injection service.",
            "On the replacement of objects from round-based applications over heterogeneous environments.",
            "An approach of class integration test order determination based on test levels.",
            "Designing an adaptive computer-aided ambulance dispatch system with Zanshin: an experience report.",
            "An integrated implementation framework for compile-time metaprogramming.",
            "Implementation and performance evaluation of a scheduling algorithm for divisible load parallel applications in a cloud computing environment.",
            "Fast construction of space-optimized recursive automaton.",
            "PLaTHEA: a marker-less people localization and tracking system for home automation.",
            "High-speed parallel implementations of the rainbow method based on perfect tables in a heterogeneous system.",
            "Experience report: evolution of a web-integrated software development and verification environment.",
            "Focus section on quality software.",
            "Selecting a software engineering tool: lessons learnt from mutation analysis.",
            "A modeling methodology to facilitate safety-oriented architecture design of industrial avionics software.",
            "A tool to improve code-first Web services discoverability through text mining techniques.",
            "An empirical evaluation of a three-tier conduit framework for multifaceted test case classification and selection using fuzzy-ant colony optimisation approach.",
            "Improving J9 virtual machine with LTTng for efficient and effective tracing.",
            "Model checking aircraft controller software: a case study.",
            "Intelligent technologies and applications for big data analytics.",
            "Breeze graph grammar: a graph grammar approach for modeling the software architecture of big data-oriented software systems.",
            "Making sense from Big RDF Data: OUSAF for measuring ontology usage.",
            "Identifying the most appropriate expansion of acronyms used in wikipedia text.",
            "A code offloading scheme for big-data processing in android applications.",
            "Scalable visualization for DBpedia ontology analysis using Hadoop.",
            "Translation of technical terminologies between English and Korean based on textual big data.",
            "Modeling performances of concurrent big data applications.",
            "Big data for smart cities with KNIME a real experience in the SmartSantander testbed.",
            "A RESTful and semantic framework for data integration.",
            "Programming distributed and adaptable autonomous components - the GCM/ProActive framework.",
            "Profit data caching and hybrid disk-aware Completely Fair Queuing scheduling algorithms for hybrid disks.",
            "A system for extracting structural information from Social Network accounts.",
            "Debugging mixed-environment programs with Blink.",
            "Memory leak detection in Plumbr.",
            "An evaluation framework for cross-platform mobile application development tools.",
            "Integrated static code analysis and runtime verification.",
            "A survey of self-healing systems frameworks.",
            "RIOS: efficient I/O in reverse direction.",
            "Chameleon - a group communication framework for smartphones.",
            "Exploiting the European Union trusted service status list for certificate validation in STORK: design, implementation, and lessons learnt.",
            "An analysis of programming language statement frequency in C, C++, and Java source code.",
            "Experimental evaluation of various register-pressure-reduction heuristics.",
            "A dynamic stochastic model for automatic grammar-based test generation.",
            "Cross-layer resource control and scheduling for improving interactivity in Android.",
            "GloudSim: Google trace based cloud simulator with virtual machines.",
            "Stringlish: improved English string searching in binary files.",
            "LibVM: an architecture for shared library sandboxing.",
            "A semantic engine for porting applications to the cloud and among clouds.",
            "Exploiting array manipulation habits to optimize garbage collection and type flow analysis.",
            "Selecting linear algebra kernel composition using response time prediction.",
            "Toward the adaptation of component-based architectures by model transformation: behind smart user interfaces.",
            "Applying Gaia and AUML for the development of multiagent-based control software for flexible manufacturing systems: addressing methodological and implementation issues."
        ]
    },
    {
        "name": "SPE",
        "year": "2014",
        "info": "Volume 44, 2014",
        "count": 71,
        "papers": [
            "Comparing techniques for authorship attribution of source code.",
            "Methods for selecting and improving software clustering algorithms.",
            "A rule-based approach for availability of service by automated service substitution.",
            "On the suitability of dynamic languages for hot-reprogramming a robotics framework: a Python case study.",
            "A thousand years of productivity: the JRebel story.",
            "Effective strategic programming for Java developers.",
            "Bandwidth-aware divisible task scheduling for cloud computing.",
            "Curracurrong: a stream programming environment for wireless sensor networks.",
            "A holistic approach to model-based testing of Web service compositions.",
            "Resolving cyclic dependencies between packages with enriched dependency structural matrix.",
            "Developing tools as plug-ins: TOPI 2012 special issue.",
            "Plugging in and into code bubbles: the code bubbles architecture.",
            "Simplicity-first model-based plug-in development.",
            "iDARE - a reference architecture for integrated software environments.",
            "Practical JFSL verification using TACO.",
            "XML development with plug-ins as a service.",
            "Contention management in federated virtualized distributed systems: implementation and evaluation.",
            "Inter-Cloud architectures and application brokering: taxonomy and survey.",
            "International workshop on smalltalk technologies 2011 special issue.",
            "PHANtom: a modern aspect language for Pharo Smalltalk.",
            "Talents: an environment for dynamically composing units of reuse.",
            "Fuel: a fast general purpose object graph serializer.",
            "Model-driven physical-design automation for FPGAs: fast prototyping and legacy reuse.",
            "Enabling OpenCL support for GPGPU in Kernel-based Virtual Machine.",
            "SIPmsign: a lightweight mobile signature service based on the Session Initiation Protocol.",
            "Constantine: configurable static analysis tool in Eclipse.",
            "Efficient compilation strategy for object-oriented languages under the closed-world assumption.",
            "A new approach to authenticating and encrypting Voice over Internet Protocol communications.",
            "Incremental inconsistency detection with low memory overhead.",
            "Analyzing and addressing false interactions during compiler optimization phase ordering.",
            "Performance of the most common non-cryptographic hash functions.",
            "A survey report of enhancements to the visitor software design pattern.",
            "Analysis of operating system diversity for intrusion tolerance.",
            "A note on software tools and techniques for monitoring and prediction of cloud services.",
            "Analyzing performance traces using temporal formulas.",
            "CPU load prediction for cloud environment based on a dynamic ensemble model.",
            "Generic event-based monitoring and adaptation methodology for heterogeneous distributed systems.",
            "A novel monitoring mechanism by event trigger for Hadoop system performance analysis.",
            "Fault masking as a service.",
            "Feature-based high-availability mechanism for quantile tasks in real-time data stream processing.",
            "Design and implementation of task scheduling strategies for massive remote sensing data processing across multiple data centers.",
            "A welcome to Raj Buyya as the new co-editor.",
            "Scheduling component replacement for timely execution in dynamic systems.",
            "Programs as visual, interactive documents.",
            "Guidelines for supporting real-time multi-touch applications.",
            "From bytecode to JavaScript: the Js_of_ocaml compiler.",
            "Dereferee: instrumenting C++ pointers with meaningful runtime diagnostics.",
            "Loop scheduling with memory access reduction subject to register constraints for DSP applications.",
            "Full autonomic repair for distributed applications.",
            "Benchmark frameworks and τBench.",
            "Obfuscation for object-oriented programs: dismantling instance methods.",
            "Generic windowing support for extensible stream processing systems.",
            "Adapting FreeRTOS for multicores: an experience report.",
            "Erratum: A system for debugging via online tracing and dynamic slicing.",
            "A heuristic approach to selecting views for materialization.",
            "An effective and efficient Web content extractor for optimizing the crawling process.",
            "Antivirus security: naked during updates.",
            "Speculative optimizations for interpreting environments.",
            "Mechanisms for building autonomically scalable services on cooperatively shared computing platforms.",
            "Programmatically defining the software footprint of sensor networks using the Android platform.",
            "Optimized succinct data structures for massive data.",
            "Heuristic expansion of feature mappings in evolving program families.",
            "Scheduling model-to-model transformations with continuations.",
            "A feedback technique for unsatisfiable UML/OCL class diagrams.",
            "Towards pattern-based architectures for event processing systems.",
            "A visual language-based system for extraction-transformation-loading development.",
            "Resource partitioning for Integrated Modular Avionics: comparative study of implementation alternatives.",
            "Drawing non-layered tidy trees in linear time.",
            "Making context-sensitive inclusion-based pointer analysis practical for compilers using parameterised summarisation.",
            "The use of mTags for mandatory security: a case study.",
            "Identifying composite crosscutting concerns through semi-supervised learning."
        ]
    },
    {
        "name": "SPE",
        "year": "2013",
        "info": "Volume 43, 2013",
        "count": 74,
        "papers": [
            "Distributed OSGi built over message-oriented middleware.",
            "Enhancing OSGi with real-time Java support.",
            "WYSIWIB: exploiting fine-grained program structure in a scriptable API-usage protocol-finding process.",
            "MemSafe: ensuring the spatial and temporal memory safety of C at runtime.",
            "Methodology and intermediate layer for the automatic creation of ontology instances stored in relational databases.",
            "JavAdaptor - Flexible runtime updates of Java applications.",
            "Grammatical and context-sensitive error correction using a statistical machine translation framework.",
            "Automatic generation of compiler backends.",
            "A threat model-based approach to security testing.",
            "Improving software security with static automated code analysis in an industry setting.",
            "Implementation and performance evaluation of a distributed conjugate gradient method in a cloud computing environment.",
            "Mastering crosscutting architectural decisions with aspects.",
            "An open framework for translating portable applications into operating system-specific wireless sensor networks applications.",
            "Playing MUSIC - building context-aware and self-adaptive mobile applications.",
            "Developing tools as plug-ins: TOPI 2011 special issue editorial.",
            "The Three-Layer architectural pattern applied to plug-in-based architectures: the Eclipse case.",
            "Integrated program verification tools in education.",
            "MASH: tool integration made easy.",
            "RDB2RDF: A relational to RDF plug-in for Eclipse.",
            "Ginga-NCL architecture for plug-ins.",
            "Developing analysis and testing plug-ins for modern IDEs: an experience report.",
            "Interoperable domain-specific languages families for code generation.",
            "A wireless sensor network framework based on light databases.",
            "Extending decoupled software pipeline to parallelize Java programs.",
            "Acculock: accurate and efficient detection of data races.",
            "Fast and effective soft links.",
            "EMUSIM: an integrated emulation and simulation environment for modeling, evaluation, and validation of performance of Cloud computing applications.",
            "Best practices for describing, consuming, and discovering web services: a comprehensive toolset.",
            "A telematics service discovery platform using the distributed peer-to-peer networking system.",
            "A generic static analyzer for multithreaded Java programs.",
            "Incorporating transitive relations in low-level design-based class cohesion measurement.",
            "Improving TLB performance on current chip multiprocessor architectures through demand-driven superpaging.",
            "David Barron: a life in software, 1935-2012.",
            "Pattern languages: addressing the challenges.",
            "Towards design pattern definition language.",
            "Software patterns catalog based on a new classification scheme.",
            "A pattern language for developing privacy enhancing technologies.",
            "Efficiently and transparently automating scalable on-demand activation and deactivation of services with the activator pattern.",
            "The use of pattern participants relationships for integrating patterns: a controlled experiment.",
            "UML design pattern metamodel-level constraints for the maintenance of software evolution.",
            "Ontology patterns for service-oriented software development.",
            "DiaSim: a simulator for pervasive computing applications.",
            "crimsonHex: a learning objects repository for programming exercises.",
            "Transformer: an adaptation framework supporting contextual adaptation behavior composition.",
            "Focus section on program debugging.",
            "In quest of the science in statistical fault localization.",
            "A consensus-based strategy to improve the quality of fault localization.",
            "Threat-oriented security framework in risk management using multiagent system.",
            "Validating pragmatic reuse tasks by leveraging existing test suites.",
            "A review of middleware approaches for energy management in distributed environments.",
            "Guest editor's introduction to the special section on TAIC-PART 2010 - Testing: Academic and Industrial Conference-Practice and Research Techniques.",
            "Linguistic security testing for text communication protocols.",
            "On the use of mutations and testing for debugging.",
            "Distributed applications and interoperable systems (Extended papers from DAIS'10).",
            "Policy-driven customization of cross-organizational features in distributed service systems.",
            "CoFeed: privacy-preserving Web search recommendation based on collaborative aggregation of interest feedback.",
            "Designing future-context-aware dynamic applications with structured context prediction.",
            "The DigiHome Service-Oriented Platform.",
            "Software abstractions for mobile RFID-enabled applications.",
            "Hadoop framework: impact of data organization on performance.",
            "Replay debugging of non-deterministic executions in the Kernel-based Virtual Machine.",
            "(MC2)2: criteria, requirements and a software prototype for Cloud infrastructure decisions.",
            "Wirebrush4SPAM: a novel framework for improving efficiency on spam filtering services.",
            "OIntEd: online ontology instance editor enabling a new approach to ontology development.",
            "A refined decompiler to generate C code with high readability.",
            "An environment for modeling and simulation of message-passing parallel applications for cloud computing.",
            "Developing an Eclipse editor for MARC records using Xtext.",
            "Editorial.",
            "Detecting and visualizing online dispute dynamics in replying comments.",
            "Automatic review identification on the web using pattern recognition.",
            "Exploiting tag similarities to discover synonyms and homonyms in folksonomies.",
            "Fault-tolerant timestamp-based two-phase commit protocol for RESTful services.",
            "FcgiOCSP: a scalable OCSP-based certificate validation system exploiting the FastCGI interface.",
            "Implementing design patterns in Object Teams."
        ]
    },
    {
        "name": "SPE",
        "year": "2012",
        "info": "Volume 42, 2012",
        "count": 71,
        "papers": [
            "Editorial.",
            "Language design and analyzability: a retrospective.",
            "An assistance tool employing a systematic methodology for GCC retargeting.",
            "Evaluation of a high-volume, low-latency market data processing system implemented with IBM middleware.",
            "Design and implementation of an adaptive Web2.0 QoS-based home appliance control service platform.",
            "Towards evolvable software architectures based on systems theoretic stability.",
            "A study of irreducibility in C programs.",
            "Satisfying quality requirements in the design of a partition-based, distributed stock trading system.",
            "A case study on business process recovery using an e-government system.",
            "Simple algebraic data types for C.",
            "Towards a goal-driven approach to action selection in self-adaptive software.",
            "Role-play virtual worlds for teaching object-oriented design: the ViRPlay development experience.",
            "PPM compression without escapes.",
            "Toward reusable SLA monitoring capabilities.",
            "A methodology for transparent knowledge specification in a dynamic tuning environment.",
            "VM aware journaling: improving journaling file system performance in virtualization environments.",
            "Bringing Scheme programming to the iPhone - Experience.",
            "A domain-specific modeling approach to realizing user-centric communication.",
            "Special section: software architectures and application development environments for Cloud computing.",
            "Towards an architecture for deploying elastic services in the cloud.",
            "A novel watermarking method for software protection in the cloud.",
            "A trust-based noise injection strategy for privacy protection in cloud.",
            "The Cloud Adoption Toolkit: supporting cloud adoption decisions in the enterprise.",
            "Privacy preserving protocol for service aggregation in cloud computing.",
            "Virtualized HPC: a contradiction in terms?.",
            "A dependency-aware ontology-based approach for deploying service level agreement monitoring services in Cloud.",
            "A task-based and resource-aware approach to dynamically generate optimal software architecture for intelligent service robots.",
            "Efficient address space generation for an OPC UA server.",
            "A component-based middleware platform for reconfigurable service-oriented architectures.",
            "Manipulating Wi-Fi packet traces with WiPal: design and experience.",
            "Privacy-aware shared UI toolkit for nomadic environments.",
            "Web workload generation challenges - an empirical investigation.",
            "A self-applicable online partial evaluator for recursive flowchart languages.",
            "POET: a scripting language for applying parameterized source-to-source program transformations.",
            "Autonomous role discovery for collaborating agents.",
            "High-quality pagination for publishing.",
            "A high-performance sorting algorithm for multicore single-instruction multiple-data processors.",
            "Editorial to the Special Issue of Rapid System Prototyping'10.",
            "Model-driven rapid prototyping with Umple.",
            "Design, implementation and verification of MILS systems.",
            "Development of electric/electronic architectures for safety-related vehicle functions.",
            "Validating quality attribute requirements via execution-based model checking.",
            "An asynchronous hierarchical router for networks-on-chip-based three-dimensional multi-processor system-on-chip.",
            "MpAssign: a framework for solving the many-core platform mapping problem.",
            "Current techniques and future trends in embedded system's virtualization.",
            "Specification and Standardization of a Java Trusted Computing API.",
            "An empirical evaluation of several test-a-few strategies for testing particular conditions.",
            "A system for debugging via online tracing and dynamic slicing.",
            "A JAVA application framework for scientific software development.",
            "Revisiting bounded context block-sorting transformations.",
            "Comparison of adaptive random testing and random testing under various testing and debugging scenarios.",
            "MicroMAIS: executing and orchestrating Web services on constrained mobile devices.",
            "Lossless asymmetric single instruction multiple data codec.",
            "Holography: a behavior-based profiler for malware analysis.",
            "Application of Deadlock Risk Evaluation of Architectural Models.",
            "Execution profiling blueprints.",
            "TinyVM: an energy-efficient execution infrastructure for sensor networks.",
            "Extending UML to model Web 2.0-based context-aware applications.",
            "Architecture of a multiplatform virtual campus.",
            "Design and implementation of a multiagent stock trading system.",
            "ROME4EU - A service-oriented process-aware information system for mobile devices.",
            "Measuring and reducing the impact of the operating system kernel on end-to-end latencies in synchronous packet switched networks.",
            "Evolutionary algorithms for the multi-objective test data generation problem.",
            "A model-based framework for building extensible, high performance stream processing middleware and programming language for IBM InfoSphere Streams.",
            "Heedless programming: ignoring detectable error is a widespread hazard.",
            "Vc: A C++ library for explicit vectorization.",
            "Erratum: A system for debugging via online tracing and dynamic slicing.",
            "Using XQuery for problem solving.",
            "Flex-eWare: a flexible model driven solution for designing and implementing embedded distributed systems.",
            "Understanding design patterns - what is the problem?",
            "Quality aspects for component-based systems: A metrics based approach."
        ]
    },
    {
        "name": "SPE",
        "year": "2011",
        "info": "Volume 41, 2011",
        "count": 73,
        "papers": [
            "Role models - implementation-based approaches to using roles.",
            "CloudSim: a toolkit for modeling and simulation of cloud computing environments and evaluation of resource provisioning algorithms.",
            "Message filters for hardening the Linux kernel.",
            "Assessing architectural drift in commercial software development: a case study.",
            "A secure migration process for mobile agents.",
            "An integration experience of a software architecture and a monitoring infrastructure to deploy applications with non-functional requirements in computing grids.",
            "Tool building in formal methods.",
            "Developing UPPAAL over 15 years.",
            "Experiences in developing the mCRL2 toolset.",
            "A model-driven process for engineering a toolset for a formal method.",
            "The CoreASM modeling framework.",
            "A retrospective on CZT.",
            "Developing Camille, a text editor for Rodin.",
            "Decomposition tool for event-B.",
            "An advanced certificate validation service and architecture based on XKMS.",
            "SPINE: a domain-specific framework for rapid prototyping of WBSN applications.",
            "TraceAnalyzer: a system for processing performance traces.",
            "Sharing experiments using open-source software.",
            "Scalable model-based configuration management of security services in complex enterprise networks.",
            "Portability in MAC protocol and transceiver software implementations for LR-WPAN platforms.",
            "Empirical evidence about the UML: a systematic literature review.",
            "Using independence to enable parallelism on multicore computers.",
            "COIVA: context-aware and ontology-powered information visualization architecture.",
            "Grammar-based test generation with YouGen.",
            "SubCollaboration: large-scale group management in collaborative learning.",
            "Editorial for the special issue on search-based software engineering.",
            "Evolutionary deployment optimization for service-oriented clouds.",
            "The use of search-based optimization techniques to schedule and staff software projects: an approach and an empirical study.",
            "Automated scheduling for clone-based refactoring using a competent GA.",
            "Constraint-based human resource allocation in software projects.",
            "Choosing software metrics for defect prediction: an investigation on feature selection techniques.",
            "Spotting the difference.",
            "Coloring, a versatile technique for implementing object-oriented languages.",
            "Perfect class hashing and numbering for object-oriented implementation.",
            "ZipfAllocation: an algorithm for static allocation of movies in a cluster of video servers.",
            "Fast graph-based instruction selection for multi-output instructions.",
            "Compiler-assisted dynamic scratch-pad memory management with space overlapping for embedded systems.",
            "Safe, multiphase bounds check elimination in Java.",
            "Towards the systematic measurement of ATL transformation models.",
            "Integrating program analyses with programmer productivity tools.",
            "Monitoring of Probabilistic Timed Property Sequence Charts.",
            "Editorial.",
            "Introducing agile customer-centered development in a legacy software product line.",
            "Agile software product line engineering: enabling factors.",
            "Agile software product lines: a systematic mapping study.",
            "Agile product line engineering - a systematic literature review.",
            "Agile Software Development.",
            "Agile methods for open source safety-critical software.",
            "User experience design and agile development: managing cooperation through articulation work.",
            "Measuring the flow in lean software development.",
            "Introduction to the Special Issue for the 10th International Conference on Quality Software (QSIC 2010).",
            "Scenarios-based testing of systems with distributed ports.",
            "Prioritizing the creation of unit tests in legacy software systems.",
            "A business process-driven approach for generating software modules.",
            "Assuring the model evolution of protocol software specifications by regression testing process improvement.",
            "Prioritizing tests for software fault diagnosis.",
            "Adaptive random testing through test profiles.",
            "Integrated implementation of dynamic untyped object-based operator overloading.",
            "Using meta-modeling in design and implementation of component-based systems: the SOFA case study.",
            "Advantages of online spellchecking: a Croatian example.",
            "Experience with fault injection experiments for FMEA.",
            "Isolating bugs in multithreaded programs using execution suppression.",
            "A group-oriented secure multiagent platform.",
            "An approach to optimization of fault tolerant architectures using HiP-HOPS.",
            "A practical use of model checking for synthesis: generating a dam controller for flood management.",
            "DOLAR: virtualizing heterogeneous information spaces to support their expansion.",
            "Component and service-oriented distributed embedded real-time systems (Extended papers from ISORC 2010).",
            "A scheme for reliable real-time messaging with bounded delays.",
            "Non-functional information transmission patterns for distributed real-time Java.",
            "Approximating Pareto optimal compiler optimization sequences - a trade-off between WCET, ACET and code size.",
            "Dynamic policy-driven quality of service in service-oriented information management systems.",
            "The Real-Time Systems Compiler: migrating event-triggered systems to time-triggered systems.",
            "A component model for hard real-time systems: CCM with ARINC-653."
        ]
    },
    {
        "name": "SPE",
        "year": "2010",
        "info": "Volume 40, 2010",
        "count": 52,
        "papers": [
            "Detecting memory leaks in managed languages with Cork.",
            "Formal methods applied to high-performance computing software design: a case study of MPI one-sided communication-based locking.",
            "Loop recreation for thread-level speculation on multicore processors.",
            "A service-based runtime environment for native applications.",
            "XML data mining.",
            "Index compression using 64-bit words.",
            "Model-based code generation for HLA federates.",
            "A highly flexible, parallel virtual machine: design and experience of ILDJIT.",
            "Adaptability mechanisms for autonomic system implementation with AAOP.",
            "Serializing C intermediate representations for efficient and portable parsing.",
            "Two-phase trace-driven simulation (TPTS): a fast multicore processor architecture simulation approach.",
            "Self-adaptation of service level in distributed systems.",
            "Comparing practices for reuse in integration-oriented software product lines and large open source software projects.",
            "Pedro: a publish/subscribe server using Prolog technology.",
            "m-JGRIM: a novel middleware for Gridifying Java applications into mobile Grid services.",
            "An efficient and secure agent code distribution service.",
            "Automatic detection and replacement of syntactic constructs causing shift/reduce conflicts.",
            "Building an automated and self-configurable emulation testbed for grid applications.",
            "MaD-WiSe: a distributed stream management system for wireless sensor networks.",
            "Generalizable safety annotations for specification of failure patterns.",
            "An adaptive load balancing management technique for RFID middleware systems.",
            "Worst-case execution time analysis for a Java processor.",
            "Developing an open-source, rule-based proofreading tool.",
            "Extending applications using an advanced approach to DLL injection and API hooking.",
            "An algorithmic mitigation of large spurious interprocedural cycles in static analysis.",
            "KAL: kernel-assisted non-invasive memory leak tolerance with a general-purpose memory allocator.",
            "Temporal vertical profiling.",
            "Document-centric XML workflows with fragment digital signatures.",
            "Solving longest common subsequence and related problems on graphical processing units.",
            "Behavioral profiles - a way to model and validate program behavior.",
            "Towards a new approach to query search engines: the Search Tree visual language.",
            "Post BWT stages of the Burrows-Wheeler compression algorithm.",
            "Web-oriented business intelligence solution based on Associative Query Logic.",
            "Communicating between the kernel and user-space in Linux using Netlink sockets.",
            "A software modeling approach for the design and analysis of cooperative optimization systems.",
            "Visualizing and exploring profiles with calling context ring charts.",
            "GraphSET, a tool for simultaneous graph drawing.",
            "Enhancing SCORM through creating a reusable JAVA class repository.",
            "Parallelization of a dynamic SVD clustering algorithm and its application in information retrieval.",
            "Architectural layer recovery for software system understanding and evolution.",
            "WSB: a broker-centric framework for quality-driven web service discovery.",
            "A survey of the research on power management techniques for high-performance systems.",
            "A survey of practical algorithms for suffix tree construction in external memory.",
            "Audlib: a configurable, high-fidelity application audit mechanism.",
            "Fine-grained management of software artefacts: the ADAMS system.",
            "Support for enterprise consolidation of I/O bound services.",
            "Synchronization for fast and reentrant operating system kernel tracing.",
            "Design principles for developing stream processing applications.",
            "Focus Section Editorial.",
            "A review of awareness in distributed collaborative software engineering.",
            "A survey of algorithmic skeleton frameworks: high-level structured parallel programming enablers.",
            "A survey on statistical disclosure control and micro-aggregation techniques for secure statistical databases."
        ]
    },
    {
        "name": "SPE",
        "year": "2009",
        "info": "Volume 39, 2009",
        "count": 55,
        "papers": [
            "AQuoSA - adaptive quality of service architecture.",
            "Rehabilitation of an unloved child: semi-splaying.",
            "Platform-independent profiling in a virtual execution environment.",
            "Case-based curve behaviour prediction.",
            "Random variate generator.",
            "On the implementation of bytecode compression for interpreted languages.",
            "A3M: an agent architecture for automated manufacturing.",
            "Using XBDDs and ZBDDs in points-to analysis.",
            "Improving the efficiency of inductive logic programming systems.",
            "A text pattern-matching tool based on Parsing Expression Grammars.",
            "Client ahead-of-time compiler for embedded Java platforms.",
            "Improving the performance and functionality of Mondrian open-source OLAP systems.",
            "Reusing web contents: a DOM approach.",
            "Evaluating the recovery-oriented approach through the systematic development of real complex applications.",
            "Design profiles: toward unified tool support for design patterns and UML profiles.",
            "Seamlessly integrating similarity queries in SQL.",
            "A comprehensive solution for application-level adaptation.",
            "Mining extremely small data sets with application to software reuse.",
            "A compiler for parsing schemata.",
            "Security benchmarks of OSGi platforms: toward Hardened OSGi.",
            "Towards generic representation of web applications: solutions and trade-offs.",
            "Catching two rabbits: adaptive real-time support for embedded Linux.",
            "Improved methods for extracting frequent itemsets from interim-support trees.",
            "The impact of requirements changes on specifications and state machines.",
            "Validation of GCC optimizers through trace generation.",
            "Scopira: an open source C++ framework for biomedical data analysis applications.",
            "Mirror-based reflection in AmbientTalk.",
            "Achieving high and consistent rendering performance of Java AWT/Swing on multiple platforms.",
            "System supports for protocol and application adaptation in vertical handoffs.",
            "XSLT-based evolutions and analyses of design patterns.",
            "Aspect-oriented component assembly - a case study in parallel software design.",
            "Reusable specification modules for type analysis.",
            "FLORA: a framework for decomposing software architecture to introduce local recovery.",
            "A unified and flexible solution for integrating CRL and OCSP into PKI applications.",
            "The effectiveness of producer-side machine-independent optimizations for mobile code.",
            "Automated dynamic detection of busy-wait synchronizations.",
            "Specifying features of an evolving software system.",
            "Better Naive Bayes classification for high-precision spam detection.",
            "Development and evaluation of a system enhancing Second Life to support synchronous role-based collaborative learning.",
            "Performance analysis and optimization of AMGA for the large-scale virtual screening.",
            "A dependency constraint language to manage object-oriented software architectures.",
            "A hybrid positioning system for technology-independent location-aware computing.",
            "Bid evaluation in combinatorial auctions: optimization and learning.",
            "Relative debugging in an integrated development environment.",
            "Experience with an extensible workspace for analysis of low-level usage data.",
            "User-level operating system transactions.",
            "Reflections on the virtues of modularity: a case study in linux security modules.",
            "An approach for the systematic development of domain-specific languages.",
            "Using frameworks to develop a distributed conferencing system: an experience report.",
            "Bridging concrete and abstract syntaxes in model-driven engineering: a case of rule languages.",
            "Tools and strategies for debugging distributed stream processing applications.",
            "On the modularization and reuse of exception handling with aspects.",
            "Ontology-based Grid resource management.",
            "Cross-profiling for Java processors.",
            "COSMOPEN: dynamic reverse engineering on a budget. How cheap observation techniques can be used to reconstruct complex multi-level behaviour."
        ]
    },
    {
        "name": "SPE",
        "year": "2008",
        "info": "Volume 38, 2008",
        "count": 62,
        "papers": [
            "When fonts do not know everything: an extensible system for multilingual text rendering.",
            "An efficient and flexible toolkit for composing customized method dispatchers.",
            "Simplifying dynamic programming via mode-directed tabling.",
            "A session-oriented approach in modeling hierarchies of streams.",
            "A complexity measure for UML component-based system specification.",
            "NOAH: A CSP-based language for describing the behaviour of coupled models.",
            "The Viúva Negra crawler: an experience report.",
            "A personalized search engine based on Web-snippet hierarchical clustering.",
            "Pragmatic integrated scheduling for clustered VLIW architectures.",
            "A comparison study of 12 paradigms for developing embodied agents.",
            "Oto, a generic and extensible tool for marking programming assignments.",
            "A model-driven approach to automatic conversion of physical units.",
            "An illustrative example of refactoring object-oriented source code with aspect-oriented mechanisms.",
            "Static virtualization of C source code.",
            "Comparing keyword search to semantic search: a case study in solving crossword puzzles using the GoogleTM API.",
            "Lightweight POSIX tracing.",
            "Bibliographic records editor in XML native environment.",
            "A component-based framework for radio-astronomical imaging software systems.",
            "The benefits of posing application software as a language interpreter.",
            "A survey on approaches to gridification.",
            "FIRE/J - optimizing regular expression searches with generative programming.",
            "An introduction to the NASA Shuttle ground operations simulator (SGOS).",
            "STXXL: standard template library for XXL data sets.",
            "Experiences with building an intrusion-tolerant group communication system.",
            "Catching Remote Administration Trojans (RATs).",
            "A programming language for service-oriented computing with mobile agents.",
            "Comparing and evaluating computer graphics and visualization software.",
            "Symmetry Partition Sort.",
            "A multiple layer model to compare RNA secondary structures.",
            "Designing a resource broker for heterogeneous grids.",
            "Design, implementation, and performance analysis of PKI certificate repository using LDAP Component Matching.",
            "An extensible and lightweight architecture for adaptive server applications.",
            "Jgroup/ARM: a distributed object group platform with autonomous replication management.",
            "An MHP framework to provide intelligent personalized recommendations about digital TV contents.",
            "SUMLOW: early design-stage sketching of UML diagrams on an E-whiteboard.",
            "Implementation of a constant-time dynamic storage allocator.",
            "Effective asymmetric XML compression.",
            "VCluster: a thread-based Java middleware for SMP and heterogeneous clusters with thread migration support.",
            "Grammar-driven generation of domain-specific language debuggers.",
            "Fast, frequency-based, integrated register allocation and instruction scheduling.",
            "A ubiquitous IAs access platform (UIAP) over UPnP.",
            "SwingStates: adding state machines to Java and the Swing toolkit.",
            "A relational-XML data warehouse for data aggregation with SQL and XQuery.",
            "Tuning mechanisms for two major parameters of Apache web servers.",
            "oDect: an RFID-based object detection API to support applications development on mobile devices.",
            "Effectiveness of multiple pageable page sizes for commercial applications.",
            "Conditioned semantic slicing for abstraction; industrial experiment.",
            "ANTLRWorks: an ANTLR grammar development environment.",
            "Developing legacy system migration methods and tools for technology transfer.",
            "An aspect-oriented software architecture for code mobility.",
            "Emulating Access Grid features at Web endpoints: a developer's view.",
            "Object-oriented wrappers for the Linux kernel.",
            "New adaptive compressors for natural language text.",
            "Towards scalable virtuality in C++.",
            "Model replication: transformations to address model scalability.",
            "Migrating legacy video lectures to multimedia learning objects.",
            "The Runabout.",
            "Kwyjibo: automatic domain name generation.",
            "Evolution of the MTA architecture: the impact of security.",
            "Towards interoperability: a wrapper model for integrating remote laboratories in a collaborative discovery learning environment.",
            "Achieving accurate and context-sensitive timing for code optimization.",
            "Designing highly flexible virtual machines: the JnJVM experience."
        ]
    },
    {
        "name": "SPE",
        "year": "2007",
        "info": "Volume 37, 2007",
        "count": 65,
        "papers": [
            "Two-phase scale-based reduction method for fulfilling monitoring service on mobile devices.",
            "Supporting the development of CAM/DAOP applications: an integrated development process.",
            "Simple fast and adaptive lossless image compression algorithm.",
            "Compiler optimizations for processors with SIMD instructions.",
            "JSetL: a Java library for supporting declarative programming in Java.",
            "Efficient plagiarism detection for large code repositories.",
            "Investigating service-oriented system performance: a systematic study.",
            "Dynamic refresh-rate scaling via frame buffer monitoring for power-aware LCD management.",
            "Marking musical dictations using the edit distance algorithm.",
            "Exceptions in remote procedure calls using C++ template metaprogramming.",
            "Incremental frequency count - a post BWT-stage for the Burrows-Wheeler compression algorithm.",
            "Integrating multiple calendars using tau-ZAMAN.",
            "An incomplex algorithm for fast suffix array construction.",
            "Reliable user-level rollback recovery implementation for multithreaded processes on windows.",
            "A comparison of interactivity in the Linux 2.6 scheduler and an MLFQ scheduler.",
            "A diagnostic environment for automaton networks.",
            "A style for integrating MS-Windows software applications to client-server systems using Java technology.",
            "A highly modular and extensible architecture for an integrated IMS-based authoring system: the <e-Aula> experience.",
            "Peter Brown (1939-2007).",
            "Ablego: a function outlining and partial inlining framework.",
            "Autonomic configuration and recovery in a mobile agent-based distributed event monitoring system.",
            "An efficient deletion method for a minimal prefix double array.",
            "A translator system for the MATLAB language.",
            "Erratum: A highly modular and extensible architecture for an integrated IMS-based authoring system: the <e-Aula> experience.",
            "An empirical study of Java bytecode programs.",
            "The Yoix® scripting language: a different way of writing JavaTM applications.",
            "Efficient implementation of Aho-Corasick pattern matching automata using Unicode.",
            "Douglas T. Ross (1929-2007).",
            "Stack virtualization for source level debugging.",
            "A portable AWT/Swing architecture for Java game development.",
            "Profiling with AspectJ.",
            "OmniCon: a Mobile IP-based vertical handoff system for wireless LAN and GPRS links.",
            "Mechanisms for object caching in distributed applications using Java RMI.",
            "Kernel support for zero-loss Internet service restart.",
            "Semantic Web approach to smart link generation for Web navigations.",
            "A brokerage system for solar data archives.",
            "A new algorithm for encoding and decoding the Hilbert order.",
            "Toward a progress indicator for program compilation.",
            "Locating faulty code by multiple points slicing.",
            "Hybrid image-based collision detection in Java 3D.",
            "Systematic pattern selection using pattern language grammars and design space analysis.",
            "The Esperanto Broker: a communication platform for nomadic computing systems.",
            "High-error approximate dictionary search using estimate hash comparisons.",
            "Automated bug isolation via program chipping.",
            "Implementing a generic component-based framework for telecontrol applications.",
            "Efficient embedded code generation with multiple load/store instructions.",
            "An automatically-tuned sorting library.",
            "A database approach for information communication in a peer-to-peer collaborative CAD environment.",
            "Efficient support for content-aware request distribution and persistent connection in Web clusters.",
            "Obituary: Per Brinch Hansen (1938-2007).",
            "Experiences developing architectures for realizing thin-client diagram editing tools.",
            "Ranked reservoir sampling: an extension to the reservoir sampling algorithm.",
            "Evolution@home: observations on participant choice, work unit variation and low-effort global computing.",
            "Collecting and publishing large multiscale geographic datasets.",
            "Virtual machine support for zero-loss Internet service recovery and upgrade.",
            "Developing a software toolkit for urban traffic modeling.",
            "A constraint solver for discrete lattices, its parallelization, and application to protein structure prediction.",
            "The simple and powerful yfx operator precedence parser.",
            "Practical testing of a C99 compiler using output comparison.",
            "Clock synchronization for distributed media applications.",
            "A study of e-mail patterns.",
            "S4W: a problem-solving environment for wireless system design.",
            "When to use splay trees.",
            "Rapidly implementing languages to compile as C++ without crafting a compiler.",
            "An approach to developing complex database schemas using form types."
        ]
    },
    {
        "name": "SPE",
        "year": "2006",
        "info": "Volume 36, 2006",
        "count": 71,
        "papers": [
            "64-bit versus 32-bit Virtual Machines for Java.",
            "Automating the analysis of design component contracts.",
            "Designing generic algorithms for operations research.",
            "Evolutionary test data generation: a comparison of fitness functions.",
            "Customizing the swarm storage system using agents.",
            "Fast dynamic casting.",
            "An architectural pattern for designing component-based application frameworks.",
            "A layered architecture for flexible Web service invocation.",
            "STLlint: lifting static checking from languages to libraries.",
            "Application invariants: Design by Contract augmented with deployment correctness logic.",
            "Applying a framework for the improvement of software process maturity.",
            "Matching statistics: efficient computation and a new practical algorithm for the multiple common substring problem.",
            "Model-centric software architecture reconstruction.",
            "Raiding the Noosphere: the open development of networked RAID support for the Linux kernel.",
            "An instruction for direct interpretation of LZ77-compressed programs.",
            "Effective pattern matching of source code using abstract syntax patterns.",
            "Signals, timers, and continuations for multithreaded user-level protocols.",
            "The design of a Virtual Library of Emblem Books.",
            "Arcademis: a framework for object-oriented communication middleware development.",
            "Generating content and display of library catalogue cards using XML technology.",
            "Performance of hardcoded finite automata.",
            "To secure XML documents with the extension function of XSLT.",
            "Scaling J2EETM application servers with the Multi-tasking Virtual Machine.",
            "Double dispatch in C++.",
            "Portable and accurate sampling profiling for Java.",
            "Drawing rooted trees in linear time.",
            "Software experience when using ontologies in a multi-agent system for automated planning and scheduling.",
            "A tool for converting Linux device drivers into Solaris compatible binaries.",
            "Distribution and persistence as aspects.",
            "Experiment on and analysis of mobile content transformation using XSLT.",
            "PTDOM: a schema-aware XML database system for MPEG-7 media descriptions.",
            "Understanding the behavior of compiler optimizations.",
            "ATLAS: a framework to provide multiuser and distributed t-learning services over MHP.",
            "A modular and adaptive framework for large scale video indexing and content-based retrieval: the SIRSALE system.",
            "Editorial.",
            "Support for situation awareness in trustworthy ubiquitous computing application software.",
            "An approach to feature-based software construction for enhancing maintainability.",
            "Building high-quality software fault predictors.",
            "Binary rewriting and call interception for efficient runtime protection against buffer overflows.",
            "Validating feature-based specifications.",
            "Design and implementation of an enhanced CORBA property service.",
            "Declarative generation of synthetic XML data.",
            "Compressing heap data for improved memory performance.",
            "Editorial: Experiences with Auto-adaptive and Reconfigurable Systems (System Level Adaptation).",
            "Dynamic service adaptation.",
            "Adapting workload distribution on software DSM clusters.",
            "MetaSockets: design and operation of runtime reconfigurable communication services.",
            "Self-tuning caching: the Universal Caching algorithm.",
            "Controlling quality-of-service in distributed real-time and embedded systems via adaptive middleware.",
            "A validation approach for neural network-based online adaptive systems.",
            "Editorial: Experiences with Auto-adaptive and Reconfigurable Systems (Application Level Adaptation).",
            "ISAMadapt: abstractions and tools for designing general-purpose pervasive applications.",
            "The FRACTAL component model and its support in Java.",
            "End-user programming of reconfigurable systems.",
            "Using context and preferences to implement self-adapting pervasive computing applications.",
            "An architecture for adaptive intrusion-tolerant applications.",
            "MCL: a MobiGATE coordination language for highly adaptive and reconfigurable mobile middleware.",
            "A taxonomy of market-based resource management systems for utility-driven cluster computing.",
            "MHP-OSGi convergence: a new model for open residential gateways.",
            "Finding and documenting the specialization interface of an application framework.",
            "Scalable peer-to-peer networking architecture: DIVINE.",
            "Experiences with component-oriented technologies in nuclear power plant simulators.",
            "Establishing structural testing criteria for Java bytecode.",
            "Qualitative and quantitative analysis and comparison of Java distributed architectures.",
            "The application kernel approach - a novel approach for adding SMP support to uniprocessor operating systems.",
            "Bio-Broker: a tool for integration of biological data sources and data analysis tools.",
            "Cobol minefield detection.",
            "Platform-independent code conversion within the C++ locale framework.",
            "Partial dead code elimination on predicated code regions.",
            "Decoding prefix codes.",
            "Mobile-C: a mobile agent platform for mobile C/C++ agents."
        ]
    },
    {
        "name": "SPE",
        "year": "2005",
        "info": "Volume 35, 2005",
        "count": 64,
        "papers": [
            "Making XML document markup international.",
            "Selective sweeping.",
            "Efficient implementation of multiprocessor scheduling algorithms on a simulation testbed.",
            "Branch elimination by condition merging.",
            "Applications of dynamic proxies in distributed environments.",
            "Minimizing development and maintenance costs in supporting persistently optimized BLAS.",
            "A resource management interface for the Java platform.",
            "MultiArray: a C++ library for generic programming with arrays.",
            "Note: Correction to the 1997 tutorial on Reed-Solomon coding.",
            "Exception handling in the development of dependable component-based systems.",
            "Scientific computing with Java and C++: a case study using functional magnetic resonance neuroimages.",
            "Object-oriented design patterns for debugging heterogeneous languages and virtual machines.",
            "Lightweight monitors for the Java virtual machine.",
            "Sharing of precompiled database statements in J2EE applications.",
            "Perturbing and evaluating numerical programs without recompilation - the wonglediff way.",
            "A negotiation description language.",
            "Scalability evaluation of the Yima streaming media architecture.",
            "Multiple query optimization in middleware using query teamwork.",
            "Compiler transformations for effectively exploiting a zero overhead loop buffer.",
            "Classifying product families using platform coverage and variation mechanisms.",
            "LZ trie and dictionary compression.",
            "A graphical user-interface and an image processing toolkit for Per.",
            "Scheduling parameter sweep applications on global Grids: a deadline and budget constrained cost-time optimization algorithm.",
            "Managing infinite variability in mobile terminal software.",
            "JiST: an efficient approach to simulation using virtual machines.",
            "Heuristic compression of an English word list.",
            "Model variables: cleanly supporting abstraction in design by contract.",
            "Developing dynamic-reconfigurable communication protocol stacks using Java.",
            "Utilizing commodity hardware and software to distribute a real-world application: maximizing reuse while improving performance.",
            "Arabic GramCheck: a grammar checker for Arabic.",
            "Design, implementation, and performance of an automatic configuration service for distributed component systems.",
            "A taxonomy of variability realization techniques.",
            "Software Distributed Shared Memory: a VIA-based implementation and comparison of sequential consistency with home-based lazy release consistency.",
            "Converting command-line applications into binary components.",
            "Editorial.",
            "The MyProxy online credential repository.",
            "The case for using Bridge Certificate Authorities for Grid computing.",
            "The GridSite Web/Grid security system.",
            "'R-What?' Development of a role-based access control policy-writing tool for e-Scientists.",
            "Towards secure Grid-enabled healthcare.",
            "Applying Security Design Analysis to a service-based system.",
            "SESAG: an object-oriented application framework for real-time systems.",
            "The evaluation of two software watermarking algorithms.",
            "MobileRMI: upgrading Java Remote Method Invocation towards mobility.",
            "Unifying program slicing and concept assignment for higher-level executable source code extraction.",
            "Generating high quality printouts from content management systems: a cost-effective approach.",
            "A large-alphabet-oriented scheme for Chinese and English text compression.",
            "Programming the data path in network processor-based routers.",
            "lmbench: an extensible micro-benchmark suite.",
            "LZgrep: a Boyer-Moore string matching tool for Ziv-Lempel compressed text.",
            "A middleware-transparent approach to developing distributed applications.",
            "Building extensible routers using network processors.",
            "SchedSP: a Grid-based application service provider of scheduling solutions.",
            "A comparison of BWT approaches to string pattern matching.",
            "Validation of dynamic Web pages generated by an embedded scripting language.",
            "Lessons learned from programmers' experiences with one-way constraints.",
            "The effect of multiple reference characters on detecting matches in string-searching algorithms.",
            "A comparison between handwritten and automatic generation of C code from SDL using static analysis.",
            "Automatic adaptation of mobile applications to different user devices using modular mobile agents.",
            "GLAL: An OpenGL Arabization Library.",
            "Visual programming support for graph-oriented parallel/distributed processing.",
            "A software methodology for applied research: eXtreme Researching.",
            "Revisiting dictionary-based compression.",
            "Interpreting computer code in a computer-based learning system for novice programmers."
        ]
    },
    {
        "name": "SPE",
        "year": "2004",
        "info": "Volume 34, 2004",
        "count": 65,
        "papers": [
            "Comparison of JavaServer Pages and XSLT: a software engineering perspective.",
            "ConSIT: a fully automated conditioned program slicer.",
            "An extensible probe architecture for network protocol performance measurement.",
            "Representing variability in a family of MRI scanners.",
            "Editorial: Web Technologies.",
            "Clarifying the fundamentals of HTTP.",
            "The WebDAV property design.",
            "Understanding Web server configuration issues.",
            "High-performance benchmarking with Web Polygraph.",
            "A large-scale study of the evolution of Web pages.",
            "Reducing memory requirements in reachability-based finite automata operations.",
            "Fast, accurate call graph profiling.",
            "lcc.NET: targeting the .NET Common Intermediate Language from Standard C.",
            "The design and implementation of a modular and extensible Java Virtual Machine.",
            "A ReScUE XML/EDI model.",
            "A testbed for performance evaluation of load-balancing strategies for Web server systems.",
            "Experiences implementing efficient Java thread serialization, mobility and persistence.",
            "Evaluation and optimization of method calls in Java.",
            "An interactive method for extracting grammar from programs.",
            "Using roles in Java.",
            "Microbenchmarks for determining branch predictor organization.",
            "Agents in object-oriented software engineering.",
            "JaRec: a portable record/replay environment for multi-threaded Java applications.",
            "A Web-based distributed system for hurricane occurrence projection.",
            "Libra: a computational economy-based job scheduling system for clusters.",
            "Common subgraph isomorphism detection by backtracking search.",
            "GLU embedded in C++: a marriage between multidimensional and object-oriented programming.",
            "A framework for adaptive execution in grids.",
            "A taxonomy of computer-based simulations and its mapping to parallel and distributed systems simulation tools.",
            "Assigning people to roles in software projects.",
            "SPARE Parts: a C++ toolkit for string pattern recognition.",
            "UbiCrawler: a scalable fully distributed Web crawler.",
            "Tracing system-level communication in distributed systems.",
            "A softerware monitor for shared-memory multiprocessor computers.",
            "Building a new sort function for a C library.",
            "A little language for modularizing numerical PDE solvers.",
            "P#: a concurrent Prolog for the .NET framework.",
            "Code optimizations for a VLIW-style network processing unit.",
            "Optimizing precision overhead for x86 processors.",
            "Building KidPad: an application for children's collaborative storytelling.",
            "Generation of test sequences from formal specifications: GSM 11-11 standard case study.",
            "Engineering information integration using object-oriented mediator technology.",
            "The implementation of generic smart pointers for advanced defensive programming.",
            "SEFT: a search engine for text.",
            "JCrasher: an automatic robustness tester for Java.",
            "Mapping of bibliographical standards into XML.",
            "Partial redundancy elimination for access expressions by speculative code motion.",
            "A specification language and service-oriented architecture to support distributed data management.",
            "JAC: an aspect-based distributed dynamic framework.",
            "Flexible XML-based configuration of physical simulations.",
            "Object-oriented processing of Java source code.",
            "Performance evaluation for VBR Continuous Media File Server admission control.",
            "A research C# compiler.",
            "Checking secure information flow in Java bytecode by code transformation and standard bytecode verification.",
            "Dynamic reconfiguration of CPU and WebSphere on IBM pSeries servers.",
            "Experience with the architectural design of a modest product family.",
            "Leveraging legacy codes to distributed problem-solving environments: a Web services approach.",
            "Packaging software process improvement issues: a method and a case study.",
            "Source model analysis using the JJTraveler visitor combinator framework.",
            "Enforcing direct communications between clients and Web servers to improve proxy performance and security.",
            "A simple and fast DNA compressor.",
            "Anticipation-based partial redundancy elimination for static single assignment form.",
            "Implementation of a TMO-structured real-time airplane-landing simulator on a distributed computing environment.",
            "Efficient Java exception handling in just-in-time compilation.",
            "Constraint Lingo: towards high-level constraint programming."
        ]
    },
    {
        "name": "SPE",
        "year": "2003",
        "info": "Volume 33, 2003",
        "count": 66,
        "papers": [
            "Migration of DCE applications into CORBA and SOAP environments.",
            "Decorating tokens to facilitate recognition of ambiguous language constructs.",
            "Bilingual legal document retrieval and management using XML.",
            "P3: a code and design conventions preprocessor for Java.",
            "Software release management for component-based software.",
            "The pervasiveness of evolution in GRUMPS software.",
            "A comparative evaluation of generic programming in Java and C++.",
            "DrawCAD: using deductive object-relational databases in CAD.",
            "A music notation construction engine for optical music recognition.",
            "ASAB: a Chinese screen reader.",
            "A Jini-based software framework for developing distributed cooperative decision support systems.",
            "The Lambda Library: unnamed functions in C++.",
            "Editorial: Middleware.",
            "QoS customization in distributed object systems.",
            "Thread transparency in information flow middleware.",
            "The CORBA Activity Service Framework for supporting extended transactions.",
            "Access control and trust in the use of widely distributed services.",
            "Editorial: Security Software.",
            "Access control: principles and solutions.",
            "Buffer overflow and format string overflow vulnerabilities.",
            "Mechanisms for secure modular programming in Java.",
            "CA-PK: conditional access for broadcast networks.",
            "Towards a computerized Arabic Braille environment.",
            "Filter objects for Java.",
            "Developing an object-oriented framework for content-based image retrieval.",
            "Mooshak: a Web-based multi-site programming contest system.",
            "More comments on 'A cohesion measure for object-oriented classes' by Heung-Seok Chae, Yong-Rae Kwon and Doo-Hwan Bae.",
            "Response to 'More comments on: A cohesion measure for object-oriented classes'.",
            "Quantifying and evaluating the space overhead for alternative C++ memory layouts.",
            "Investigating the use of analysis contracts to improve the testability of object-oriented code.",
            "Odyssey: a high-performance clustered video server.",
            "Model-driven design of collaborative Web applications.",
            "EasyLocal++: an object-oriented framework for the flexible design of local-search algorithms.",
            "Three-tier replication for FT-CORBA infrastructures.",
            "Architecting and implementing distributed Web applications using the graph-oriented approach.",
            "A security framework for reflective Java applications.",
            "DIKE: a system supporting the semi-automatic construction of cooperative information systems from heterogeneous databases.",
            "Substituting outline fonts for bitmap fonts in archived PDF files.",
            "Introducing QoS awareness in distributed programming: QTcl.",
            "Developing end-user tailorable Web applications using a compositional framework.",
            "Software product line migration and deployment.",
            "On aspectualizing component models.",
            "Explaining code for publication.",
            "Experimental evaluation and improvements to linear scan register allocation.",
            "Efficient implementation of lazy suffix trees.",
            "Adapting traditional software processes to virtual environments development.",
            "The directed Chinese Postman Problem.",
            "A general purpose adaptivity driver for FE software.",
            "Horizontal communication: a style to compose control software.",
            "Integration of control system design and implementation over the internet using the Jini technology.",
            "The ESA/NASA SOHO mission interruption: using the STAMP accident analysis technique for a software related 'mishap'.",
            "CGLIB - a constraint-based graphics library.",
            "Managing business lifecycle using ebIOP.",
            "A fast and compact elimination method of empty elements from a double-array structure.",
            "Mockup-driven fast-prototyping methodology for Web application development.",
            "Untangling the balancing and searching of balanced binary search trees.",
            "Editorial: ICCCN 2001.",
            "Analysing the latency of World Wide Web applications.",
            "Multi-level modeling approach for the availability assessment of e-business applications.",
            "Adaptive secure software architecture for electronic commerce.",
            "System and software designs for transaction processing in asymmetric communication environments.",
            "Leveraging emerging network services to scale multimedia applications.",
            "Design and implementation of Acceptance Monitor for building intrusion tolerant systems.",
            "An experimental evaluation of scalar replacement on scientific benchmarks.",
            "An on-line performance visualization technology.",
            "Implementation of visual languages using pattern-based specifications."
        ]
    },
    {
        "name": "SPE",
        "year": "2002",
        "info": "Volume 32, 2002",
        "count": 68,
        "papers": [
            "Rapid simulator development for multicast protocol analysis.",
            "Automatic layout of statecharts.",
            "Unix tools as visual programming components in a GUI-builder environment.",
            "A page-shift transformation format of ISO 10646.",
            "The design and implementation of the exported procedure call.",
            "Second step algorithms in the Burrows-Wheeler compression algorithm.",
            "Lightweight validation of natural language requirements.",
            "A taxonomy and survey of grid resource management systems for distributed computing.",
            "Instrumenting and tuning dataView - a networked application for navigating through large scientific datasets.",
            "Non-intrusive object introspection in C++.",
            "HARTEX - a safe real-time kernel for distributed computer control systems.",
            "Engineering software reuse for on-board embedded real-time systems.",
            "Vmgen - a generator of efficient virtual machine interpreters.",
            "TPF: a dynamic system thrashing protection facility.",
            "Bytecode verification on Java smart cards.",
            "Taming access control security: extending capabilities using the views relationship.",
            "Java 3D, 3D graphical environments and behaviour.",
            "MEADOW: a middleware for efficient access to multiple geographic databases through OpenGIS wrappers.",
            "Creating a reusable GUI component.",
            "Improving the scalability of the CORBA event service with a multi-agent load balancing algorithm.",
            "J3DV: A Java-based 3D database visualization tool.",
            "A framework for table driven testing of Java classes.",
            "Editorial: Mobile agent systems.",
            "A security scheme for Aglets.",
            "Application and programming experience with the Ara mobile agent system.",
            "D'Agents: Applications and performance of a mobile-agent system.",
            "MOLE: A mobile agent system.",
            "A TACOMA retrospective.",
            "An object-oriented interface for the dynamic memory management of sparse discrete mathematical operators in numerical scientific applications.",
            "MaDViWorld: a software framework for massively distributed virtual worlds.",
            "A safe variant of the unsafe integer arithmetic of JavaTM.",
            "Extending the object model to provide explicit support for crosscutting concerns.",
            "Editorial: Enterprise frameworks.",
            "How to develop and to reuse the UniPDM framework.",
            "Enterprise frameworks for workflow management systems.",
            "Eternal - a component-based framework for transparent fault-tolerant CORBA.",
            "Lessons learned becoming a framework developer.",
            "Enterprise frameworks: issues and research directions.",
            "Specifying a role-based guide for learning to work with an enterprise framework.",
            "Developing object-oriented enterprise quality frameworks using proto-frameworks.",
            "Data collection and restoration for heterogeneous process migration.",
            "Command-line interfaces can be efficiently brought to graphics: COLIMATE (the COmmand LIne MATE).",
            "Using execution trace data to improve distributed systems.",
            "An object-oriented tool for simulating distributed real-time control systems.",
            "Component support in PLT Scheme.",
            "The BLISS programming language: a history.",
            "Engineering plug-in software components to support collaborative work.",
            "FC++: Functional tools for object-oriented tasks.",
            "PLEIADES: An Internet-based parallel/distributed system.",
            "Automatic form generation.",
            "Drawing database schemas.",
            "CASiNO: component architecture for simulating network objects.",
            "PSAMS: a communication protocol specification assessment and measurement system.",
            "Performance-steered design of software architectures for embedded multicore systems.",
            "Virtual-machine-based heterogeneous checkpointing.",
            "Realizing active data warehouses with off-the-shelf database technology.",
            "Context-based compression of binary images in parallel.",
            "Using a qualitative research method for building a software maintenance methodology.",
            "CD++: a toolkit to develop DEVS models.",
            "Burrows-Wheeler compression with variable length integer codes.",
            "An enhanced role model for alleviating the role-binding anomal.",
            "Developing a Lisp-based preprocessor for TEX documents.",
            "Klava: a Java package for distributed and mobile applications.",
            "Managing schema evolution in a container-based persistent system.",
            "Automated test case generation for the stress testing of multimedia systems.",
            "Grids and Grid technologies for wide-area distributed computing.",
            "An event routing service for distributed applications: computer telephony - a case study.",
            "Lessons learned from automating tests for an operations support system."
        ]
    },
    {
        "name": "SPE",
        "year": "2001",
        "info": "Volume 31, 2001",
        "count": 67,
        "papers": [
            "A Java/CORBA virtual machine architecture for remote execution of optimization solvers in heterogeneous networks.",
            "Enhancing CLP branch and bound techniques for scheduling problems.",
            "Fast insertion methods of a double-array structure.",
            "alto: a link-time optimizer for the Compaq Alpha.",
            "Developing multi-agent systems with a FIPA-compliant agent framework.",
            "EJVM: an economic Java run-time environment for embedded devices.",
            "Numeric ActiveX components.",
            "A realistic involvement of formal methods.",
            "Coordinating distributed components on the web: an integrated development environment.",
            "Experience with an efficient parallel kernel memory allocator.",
            "DirectJ: Java APIs for optimized 2D graphics.",
            "Design, implementation and evolution of object oriented frameworks: concepts and guidelines.",
            "Security in the Ajanta mobile agent system.",
            "Maintaining traceability links during object-oriented software evolution.",
            "Java based replicated server objects and their remote method invocations in a distributed environment.",
            "Shimba - an environment for reverse engineering Java software systems.",
            "Vertex-labeling algorithms for the Hilbert spacefilling curve.",
            "The Relationlog system prototype.",
            "A mostly-copying collector component for class templates.",
            "Design and implementation of a video browsing system for the Internet.",
            "Editorial: Aliasing in object-oriented systems.",
            "Confined types in Java.",
            "Alias burying: Unique variables without destructive reads.",
            "JAC - Access right based encapsulation for Java.",
            "Partial redundancy elimination for access path expressions.",
            "Coping with aliasing in the GNU Eiffel Compiler implementation.",
            "JGAP: a Java-based graph algorithms platform.",
            "The design and implementation of the Gecko NFS Web proxy.",
            "An enhanced thread synchronization mechanism for Java.",
            "Enhancing Java server availability with JAS.",
            "Reducing the overhead of dynamic compilation.",
            "An object-oriented design for graph visualization.",
            "A case study using lightweight formalism to review an information system specification.",
            "From broadcast television to Internet audio/video: techniques and tools for VCR-style interactivity.",
            "Schrödinger's token.",
            "Fast string matching for multiple searches.",
            "Some perils of performance prediction: a case study on pattern matching.",
            "Developing WWW-based highly interactive and collaborative applications using software components.",
            "Implementing heap-object behavior prediction efficiently and effectively.",
            "Self-adjusting trees in practice for large text collections.",
            "An efficient object promotion algorithm for persistent object systems.",
            "Llun - a high-level debugger for generated parsers.",
            "GENEX: a tool for testing in ILP.",
            "Developing Java applications for a nuclear fusion experiment: a test case for Java applicability in a demanding environment.",
            "Design and implementation of efficient communication abstractions on the Virtual Interface Architecture: Stream sockets and RPC experience.",
            "Automated computation and consistency checking of physical dimensions and units in scientific programs.",
            "How to squeeze a lexicon.",
            "A framework for the development of videogames.",
            "Exploiting exceptions.",
            "A base62 transformation format of ISO 10646 for multilingual identifiers.",
            "Branded interface toolkits.",
            "Optimization schemas for parallel implementation of non-deterministic languages and systems.",
            "Supporting configurability and real time in RTD channels.",
            "Software testing using model programs.",
            "An architecture for extensible middleware platforms.",
            "NR-grep: a fast and flexible pattern-matching tool.",
            "Migrating legacy scientific applications towards CORBA-based client-server architectures.",
            "Moving the business logic tier to the client. Cost-effective distributed computing for the WWW.",
            "The DeltaUp constraint solver: minimizing the number of method selections in DeltaBlue.",
            "Tool integration for flexible simulation of distributed algorithms.",
            "Comments on A cohesion measure for object-oriented classes by Heung Seok Chae, Yong Rae Kwon and Doo Hwan Bae.",
            "Response to Comments on: A cohesion measure for object-oriented classes.",
            "The real inventor of the monitor concept: A short note to correct the SP&E paper entitled An enhanced thread synchronization mechanism for Java.",
            "Semi-automatic grammar recovery.",
            "Transparent adaptation of sharing granularity in MultiView-based DSM systems.",
            "Incremental parsing in language-based editors: user needs and how to meet them.",
            "A general purpose font module for multilingual application programs."
        ]
    },
    {
        "name": "SPE",
        "year": "2000",
        "info": "Volume 30, 2000",
        "count": 67,
        "papers": [
            "A framework for fuzzy knowledge based control.",
            "Static slicing in Unix process environment.",
            "DESP-C++: a discrete-event simulation package for C++.",
            "Automated test-data generation for exception conditions.",
            "Iava: yet another interpreter for scripting within the Java platform.",
            "The discipline and method architecture for reusable libraries.",
            "Reverse engineering 4.7 million lines of code.",
            "Multiple-type objects in an enhanced C++ persistent programming language.",
            "Process program change control in a process environment.",
            "Marmot: an optimizing compiler for Java.",
            "LOCAL++: A C++ framework for local search algorithms.",
            "Efficient annotated terms.",
            "Persistent object systems.",
            "Operating system support for persistent systems: past, present and future.",
            "Implementation of automated fine-granularity locking in a persistent programming language.",
            "A compliant persistent architecture.",
            "An infrastructure for generating and sharing experimental workloads for persistent object systems.",
            "Dynamo: design, implementation, and evaluation of cooperative persistent object management in a local area network.",
            "Fast portable orthogonally persistent Java.",
            "Construction of robust class hierarchies.",
            "Java threads and SugarCubes.",
            "Swap compression: resurrecting old ideas.",
            "Using interpreted CompositeCalls to improve operating system services.",
            "Introspective sorting and selection revisited.",
            "Managing more physical with less virtual.",
            "Experiences in implementing a distributed object platform for multimedia applications.",
            "Three empirical studies of a software reuse reference model.",
            "PARMON: a portable and scalable monitoring system for clusters.",
            "An evaluation of Java implementations of message-passing.",
            "Transition from national standards to Unicode: multilingual support in operating systems and programming languages.",
            "A static analyzer for finding dynamic programming errors.",
            "Providing multiple views for objects.",
            "Software product lines: a case study.",
            "BCOOPL: Basic concurrent object-oriented programming language.",
            "A demonstration of repeatable, non-intrusive measurement of program performance and compiler optimization in Linux using IN-Tune.",
            "A framework for preprocessor-aware C source code analyses.",
            "A new implementation of the Icon language.",
            "An index allocation tool for object-oriented database systems.",
            "The LTAP trigger gateway for LDAP directories.",
            "Feature-based approach to object-oriented engineering of applications for reuse.",
            "Real-time multicast tree visualization and monitoring.",
            "A layered hyperanimation system.",
            "Generating transition probabilities to support model-based software testing.",
            "Experiences building a communication-oriented JavaOS.",
            "Some technical and non-technical issues in implementing a knowledge server.",
            "Editorial: Discrete algorithm engineering.",
            "On the design of CGAL a computational geometry algorithms library.",
            "An open graph visualization system and its applications to software engineering.",
            "Experimental studies on graph drawing algorithms.",
            "LINK: a system for graph computation.",
            "Graphlet: design and implementation of a graph editor.",
            "The ABACUS system for branch-and-cut-and-price algorithms in integer programming and combinatorial optimization.",
            "BRISK: a portable and flexible distributed instrumentation system.",
            "Experiences with object group systems.",
            "A cohesion measure for object-oriented classes.",
            "A flexible and easy to use molecular biology workbench efficiently developed in Tcl/Tk.",
            "Similarity searching in the CORDIS text database.",
            "Improvements to Burrows-Wheeler compression algorithm.",
            "CTW: an integrated computer and telephone-accessed WWW system.",
            "Improving scalability of event-driven distributed objects architectures.",
            "A bit-counting algorithm using the frequency division principle.",
            "Automatic parallel control structures in SequenceL.",
            "The Object-JavaScript language.",
            "Applying design metrics to predict fault-proneness: a case study on a large-scale software system.",
            "Policy-directed certificate retrieval.",
            "Java Native Interface idioms for C++ class hierarchies.",
            "BOX: Browsing objects in XML."
        ]
    },
    {
        "name": "SPE",
        "year": "1999",
        "info": "Volume 29, 1999",
        "count": 69,
        "papers": [
            "Software Visualization of LR Parsing and Synthesized Attribute Evaluation.",
            "Discovering and Using Entity Mappings in Federated Databases.",
            "MRPC: A High Performance RPC System for MPMD Parallel Computing.",
            "Smart Enumeration in C++: Virtual Construction, Message Dispatching and Tables.",
            "Timing Constraint Specification and Analysis.",
            "The Spider Environment.",
            "Memory Exclusion: Optimizing the Performance of Checkpointing Systems.",
            "Design and Implementation of a Client-Server Architecture for Taxonomy Manager.",
            "The Dynamic Domain Reduction Procedure for Test Data Generation.",
            "Book Review: UML Toolkit by Hans-Erik Eriksson and Magnus Penker.",
            "Computing with Graphs and Graph Transformations.",
            "Differential Profiling.",
            "A Software Process for the Construction of Predictable On-Board Embedded Real-Time Systems.",
            "Using Data Clustering to Improve Cleaing Performance for Flash Memory.",
            "Enumerated Types in Java.",
            "A Byte-wise Normalization Method in Arithmetic Coding.",
            "Embed Finite Domain Constraint Programming into Java and some Web-based Applications.",
            "A Killer Adversary for Quicksort.",
            "Comparing Observed Bug and Productivity Rates for Java and C++.",
            "An Application of Compiler Technology to the Year 2000 Problem.",
            "Fault-Tolerant RT-Mach (FT-RT-Mach) and an Application to Real-Time Train Control.",
            "Versions in Ode: Implementation and Experiences.",
            "Early Experience with ASDL in lcc.",
            "An Efficient Modularized Database Structure forr a High-resolution Column-gridded Mars Global Terrain Database.",
            "A Critique of Java.",
            "Object-Versioning in an ODMG-compliant Object Daatabase System.",
            "A Case Study: Productivity and Quality Gains Using an Object-Oriented Framework.",
            "Profiling Techniques for Communication in Fine-Grained Parallel Languages.",
            "Cluster Computing: The Commodity Supercomputer.",
            "A Deadlock Detection Tool for Concurrent Java Programs.",
            "A Java Extension with Support for Dimensions.",
            "Compiling Lazy Functional Programs to Java Bytecode.",
            "An Improved Data Structure for Cumulative Probability Tables.",
            "HTEL: a HyperText Expression Language.",
            "Using Coordinated Atomic Actions to Design Safety-Critical Systems: a Production Cell Case Study.",
            "Development of an Atomic-Broadcast Protocol Using LOTOS.",
            "A Secure On-line Submission System.",
            "A Review of Experiences with Reliable Multicast.",
            "IN-Tune: An In-Situ Non-Invasive Performance Tuning Tool for Multi-threaded Linux on Symmetric Multiprocessing Pentium Workstations.",
            "Efficient Automata-Driven Pattern-Matching for Equational Programs.",
            "Implementing an Efficient Part-Of-Speech Tagger.",
            "Productivity Analysis of Object-Oriented Software Development in a Commercial Environment.",
            "A Machine-Independent Debugger - Revisited.",
            "Design and Implementation of a File System with On-the-fly Data Compression for GNU/Linux.",
            "Feature-Oriented Engineering of PBX Software for Adaptability and Reuseability.",
            "Virtual Prototyping of Cellular Phones.",
            "On Guards and Symbol Dependencies in Substring Search.",
            "Forward-adaptive Method for Context-based Compression of Large Binary Images.",
            "Experience with a Unix System-Administration Tool.",
            "An Algorithm for Drawing Planar Graphs.",
            "An Implementation of Using Remote Memory to Checkpoint Processes.",
            "A Code Compression System Based on Pipelined Interpreters.",
            "A Viable System Structure for Large-Scale Software Systems.",
            "A Proxy Approach to e-Mail Security.",
            "Effectively Exploiting Indirect Jumps.",
            "An Architecture for Tuple-Based Coordination of Multi-Agent Systems.",
            "LORETO: A Tool for Reducing State Explosion in Verification of LOTOS Programs.",
            "Reducing the space requirement of suffix trees.",
            "Declarative solutions to partitioned-grid problems.",
            "Adding multidimensionality to procedural programming languages.",
            "A multi-layered architecture for managing graphical interfaces and tutoring mixed-strategy dialogues.",
            "A proxy-based framework to support synchronous cooperation on the Web.",
            "Evaluation metrics for a translation memory system.",
            "Middleware support for distributed multimedia and collaborative computing.",
            "The implementation and evaluation of the use of CORBA in an engineering design application.",
            "Evaluation of the basic remote backup and replication methods for high availability databases.",
            "Object-process based graphics recognition class library: principles and applications.",
            "LETOS - a lightweight execution tool for operational semantics.",
            "Stretching letter and slanted-baseline formatting for Arabic, Hebrew, and Persian with ditroff/ffortid and dynamic PostScript fonts."
        ]
    },
    {
        "name": "SPE",
        "year": "1998",
        "info": "Volume 28, 1998",
        "count": 68,
        "papers": [
            "Active Objects Made Easy.",
            "Design of a Remote Procedure Call System for Object-Oriented Distributed Programming.",
            "Integrating Constraint Logic Programming and Operations Research Techniques for the Crew Rostering Problem.",
            "Semantic ACID Properties in Multidatabases Using Remote Procedure Calls and Update Propagations.",
            "Memory Optimization in Function and Set Manipulation with BDDs.",
            "Letter to the Editor.",
            "An Approach for Decomposing N-Ary Data Relationships.",
            "Perspectives on Optimistically Replicated, Peer-to-Peer Filing.",
            "Very Fast YACC-Compatible Parsers (For Very Little Effort).",
            "An Improved Adaptive String Searching Algorithm.",
            "A Practical Object-Oriented Analysis Engine for CLP.",
            "Elastic Windows: Design, Implementation, and Evaluation of Multiwindow Operations.",
            "Building a Retargetable Local Instruction Scheduler.",
            "Maintaining Consistency in a Replicated Software Archive.",
            "A Formal Introduction to the Compilation of Java.",
            "Sequence-Based Software Specification of Deterministic Systems.",
            "Effect of Test Set Minimization on Fault Detection Effectiveness.",
            "A Relational Approach to Support Software Architecture Analysis.",
            "The Design and Implementation of RAP: A PDG-Based Register Allocator.",
            "How to Build an Interface Graph.",
            "ASADAL/SIM: An Incremental Multi-Level Simulation and Analysis Tool for Real-Time Software Specifications.",
            "Simulating the DYNIX Operating System Parallel Programming Interface on a UNIX System.",
            "Extracting Text from PostScript.",
            "Implementing a Symbolic Music Processing System.",
            "Measuring Complexity in C++ Application Software.",
            "Symbol Ranking Text Compressors: Review and Implementation.",
            "Experiments on String Matching in Memory Structures.",
            "Workplace Microkernel and OS: A Case Study.",
            "Implementing Generalized Operator Overloading.",
            "Heterogeneous Process Migration: The Tui System.",
            "A Multithreaded Scheduler for a High-Speed Spacecraft Simulator.",
            "Software Development and Integration in a Computer Supported Cooperative Work Environment.",
            "Chicon - A Chinese Text Manipulation Language.",
            "Reusable Coordinator Modules for Massively Concurrent Applications.",
            "External Relationships of Objects.",
            "Design, Implementation, and Evaluation of a Single-Copy Protocol Stack.",
            "Constructing an Integrated Visual Programming Environment.",
            "A Domain-Independent Software Reuse Framework Based on a Hierarchical Thesaurus.",
            "Timing Trials, or the Trials of Timing: Experiments with Scripting and User-Interface Languages.",
            "A Graph Theoretical Method for the Management and Synchronization of Large Software Updates.",
            "Practical Improvements to the Construction and Destruction of Static Single Assignment Form.",
            "Redesigning the BSD Timer Facilities.",
            "The Mungi Single-Address-Space Operating System.",
            "GLUnix: A Global Layer Unix for a Network of Workstations.",
            "Building Adaptive Systems Using Ensemble.",
            "Design, Implementation and Evaluation of ICARE: An Efficient Recoverable DSM.",
            "Extended Memory Management (XMM): Lessons Learned.",
            "EDDIE Beats the Bookies.",
            "Linguistic Reflection in Java.",
            "The STAR Fault Manager for Distributed Operating Environments. Design, Implementation and Performance.",
            "Implementing a Zooming User Interface: Experience Building Pad++.",
            "A Customisable Memory Management Framework for C++.",
            "Specification and Verification of Multimedia Synchronization Scenarios Using Time-Estelle.",
            "Evaluating High Level Parallel Programming Support for Irregular Applications in ICC++.",
            "Type-Safe Casting.",
            "Tailored Compression of Java Class Files.",
            "DJM: A Global Distributed Virtual Machine on the Internet.",
            "Compression Techniques for Chinese Text.",
            "Managing Multi-Party Documents in a Network Computing Environment.",
            "Unparsing Expressions with Prefix and Postfix Operators.",
            "Use of Executable Formal Specifications in User Validation.",
            "GSL: A Requirements Specification Language for End-User Intelligibility.",
            "A Layer on Top of Prolog for Composing Behavioural Constraints.",
            "An Efficient and Flexible C++ Library for Concurrent Programming.",
            "Deriving Complexity Information from a Formal Communication Protocol.",
            "Strategies and Protocols for Highly Parallel Linda Servers.",
            "Automated System Administration with Feedback Regulation.",
            "The SugarCubes Tool Box: A Reactive Java Framework."
        ]
    },
    {
        "name": "SPE",
        "year": "1997",
        "info": "Volume 27, 1997",
        "count": 71,
        "papers": [
            "Adaptive Block Rearrangement Under UNIX.",
            "MultiLex, A Pipelined Lexical Analyzer.",
            "Slisp: A Flexible Software Toolkit for Hybrid, Embedded and Distributed Applications.",
            "An Experiment in Abstract Machine Design.",
            "A Novel Approach to Marshalling.",
            "Low-Cost, Concurrent Checking of Pointer and Array Accesses in C Programs.",
            "Graceful Object-Based Performance Evolution.",
            "Automation and Testing of Character-graphic Programs.",
            "Chitra Venkatramani, Michael Vernick: Design and Implementation of the Stony Brook Video Server.",
            "CCC: A Caching Compiler for C.",
            "Case Studies on Cache Performance and Optimization of Programs with Unit Strides.",
            "Algorithm Simplification Through Object Orientation.",
            "Guard: A Relative Debugger.",
            "Synchronous/Reactive Programming of Concurrent System Software.",
            "Fuzzy Clustering in Software Reusability.",
            "A System for Translating Executable VDM Specifiactions into Lazy ML.",
            "Event Handling in the Lego System.",
            "A Practical Approach to Object-Oriented State Modeling.",
            "Thread- and Process-Based Implementations of the pSystem Parallel Programming Environment.",
            "Building an Information System for Collaborative Researchers: A Case Study from the Brain-Tumor Research Domain.",
            "RBE: A Rule-by-Example Active Database System.",
            "A C++ Simulator Generator from Graphical Specifications.",
            "A Multimedia Presentation Toolkit for the World Wide Web.",
            "Exploiting Persistence in Build Management.",
            "Tcl/Tk-Based Agents for Mail and News Notification.",
            "Achieving Incremental Compilation Through Fine-Grained Builds.",
            "Interprocedural Data Flow Based Optimizations for Distributed Memory Compilation.",
            "Hipec: A System for Application Customized Virtual-Memory Caching Management.",
            "ClassBench: A Framework for Automated Class Testing.",
            "An Experiment with Reactive Data-Flow Tasking in Active Robot Vision.",
            "Efficient Storage of Weather Radar Data.",
            "A Systematic Approach to Fuzzy Parsing.",
            "A Visual Syntax-Directed Editor for the Descartes Specification Language.",
            "Message Filters for Object-Oriented Systems.",
            "Value Numbering.",
            "An Installable Version Control File System for UNIX.",
            "A Rule-Based Extension to the C++ Language.",
            "Performance of the Prototype Fortran D Compiler.",
            "An Efficient Method for Version Control of a Tree Data Structure.",
            "Implementation of Reliable Multicast Protocol.",
            "String Matching in the DNA Alphabet.",
            "AG: A Set of Maple Packages for Manipulating Automata and Semigroups.",
            "Nonintrusive Cloning Garbage Collection with Stock Operating System Support.",
            "Ode Triggers: Monitoring the Stock Market.",
            "MILLIPEDE: Easy Parallel Programming in Available Distributed Environments.",
            "Drawing Syntax Diagrams in Haskell.",
            "Introspective Sorting and Selection Algorithms.",
            "A Tutorial on Reed-Solomon Coding for Fault-Tolerance in RAID-Like Systems.",
            "A Practical Approach to the Design of Concurrency in Object-Oriented Systems.",
            "Pythia and Pythia/WK: Tools for the Performance Analysis of Mass Storage Systems.",
            "A Flexible Real-Time Scheduling Abstraction: Design and Implementation.",
            "The Analysis of the Bus Chaining Phenomenon in Traffic Congestion.",
            "Distributed Resource Administration Using Cfengine.",
            "Continuous Checkpointing: Joining the Checkpointing with Virtual Memory Paging.",
            "Solving a Timetabling Problem Using Hybrid Genetic Algorithms.",
            "REDOM: An OO Language to Define and On-Line Manipulate Regulations in the Resource (Re)Scheduling Problem.",
            "Pulsar: An Extensible Tool for Monitoring Large Unix Sites.",
            "Cdt: A Container Data Type Library.",
            "Issues and Experiences in Implementing a Distributed Tuplespace.",
            "An Object-Oriented Framework for Modeling and Designing Intelligent Training Systems.",
            "Program Graph Visualization.",
            "A Hypervideo System Generator.",
            "Flexible and Extensible Load Balancing.",
            "An Object-Oriented Cooperative Distributed Problem Solving Shell with Groupware Management Ability.",
            "An Implementation of Disk Objects in the Logical Machine Monitor.",
            "Interconnecting Interactive and Remote Parallel Components Using Schooner.",
            "Using < stdio.h > in the Output of the FORTRAN to C Translator, f2c.",
            "Experiments on Six Commercial TCP Implementations Using a Software Fault Injection Tool.",
            "HyperTree: A Structural Approach to Web Authoring.",
            "ADIC: An Extensible Automatic Differentiation Tool for ANSI-C.",
            "Object-Oriented Patterns: Lessons from Expert Systems."
        ]
    },
    {
        "name": "SPE",
        "year": "1996",
        "info": "Volume 26, 1996",
        "count": 68,
        "papers": [
            "Implementing Atomic Sequences on Uniprocessors Using Rollforward.",
            "An Improved Algorithm for Identifying Objects in Code.",
            "Blackboard-based Extensions in Prolog.",
            "Synchronization in Specification-based Multimedia Presentations.",
            "EASE: A Software Environment for Automatic Implementation of Application Protocol.",
            "Formal Validation of a High Performance Error Control Protocol using SPIN.",
            "Experience Using the C Preprocessor to Implement CCR, Monitor, and CSP Preprocessors for SR.",
            "Software Reliability Models for Computer Implementations - An Empirical Study.",
            "An Experimental Evaluation of Data Flow and Mutation Testing.",
            "Compacting Garbage Collection can be Fast and Simple.",
            "Buffer Management Issues in the Implementation of Fast Interprocess Communication.",
            "TableSpec: Free Format Specification Table and Source Code Generation.",
            "VidNet: Distributed Processing Environment for Computer Generated Animation.",
            "Timetabling Through Constrained Heuristic Search and Genetic Algorithms.",
            "Macro and File Structure Preservation in Source-to-source Translation.",
            "Round-Pound Arithmetic.",
            "An Equivalence Class Algorithm for Drawing Autostereograms.",
            "Ariadne: Architecture of a Portable Threads System Supporting Thread Migration.",
            "Vmalloc: A General and Efficient Memory Allocator.",
            "Evaluation of a CPU Scheduling Mechanism for Multimedia Systems.",
            "Displaying Trace Files.",
            "A Graphical Navigator for Viewing Databases.",
            "Iterators, Schedulers, and Distributed-memory Parallelism.",
            "On Efficiency and Optimization of C++ Programs.",
            "A Simple Solver for Linear Equations Containing Nonlinear Operators.",
            "A New Data Structure for Cumulative Probability Tables: An Improved Frequency-to-Symbol Algorithm.",
            "Retrieval of Reusable Components Using Functional Similarity.",
            "Tools for Visual and Numerical Data Entry.",
            "Managing Information in a Co-Operative Object Database System.",
            "ParC - An Extension of C for Shared Memory Parallel Processing.",
            "Deriving Workloads for Performance Testing.",
            "Lua-An Extensible Extension Language.",
            "ALCHEMIST; A General Purpose Transformation Generator.",
            "Remote Access to Multimedia Databases: An Object Oriented Approach.",
            "Long Term Distributed File Reference Tracing: Implementation and Experience.",
            "IUP/LED: A Portable User Interface Development Tool.",
            "An Operator Precedence Parser for Standard Prolog Text.",
            "Splaysort: Fast, Versatile, Practical.",
            "Illustrating Client and Implementation Readability Tradeoffs in Ada and C++.",
            "A Behavior-Based Classification and Retrieval Technique for Object-Oriented Specification Reuse.",
            "Active Text for Structuring and Understanding Source Code.",
            "Hybrid Genetic Algorithms for a Rostering Problem.",
            "The Compilation of Ada.",
            "Software Reusability Through Versions.",
            "Optimal and Near-Optimal Global Register Allocation Using 0-1 Integer Programming.",
            "Restructuring Software: A Case Study.",
            "Comparative Analysis of Asynchronous I/O in Multithreaded UNIX.",
            "Interchanging Specifications and Implementations in Evolutionary Prototyping.",
            "Parallel Computing with the Sisal Applicative Language: Programmability and Performance Issues.",
            "Supporting Flexible Consistency Management via Discrete Change.",
            "ASN_EZE: An Analgesic for Writers of ASN.1 Applications.",
            "An ODA-like Multimedia Document System.",
            "Fortran to Lisp Translation using f2cl.",
            "The Design and Inplementation of a Cooperative Design-view Environment for Interactive Partitioning Applications.",
            "Practical Implications of Traceability.",
            "Data Compression for PC Software Distribution.",
            "List Iterators in C++.",
            "An Introduction to Sequence L: A Language to Experiment with Constructs for Processing Nonscalars.",
            "Token-by-token Syntax-directed Editing (Using an LR Parser).",
            "Discovering Patterns: An Industry Report.",
            "A Machine-independent Debugger.",
            "Optimizing Procedure Calls for Delayed Non-Local Execution Protocol.",
            "Encoding and Decoding the Hilbert Order.",
            "A List-Based Virtual Machine for COBOL.",
            "Colony: An Artificial Life Model for Active Autonomous Objects.",
            "Optimizing Procedure Calls in Block-Structured Languages.",
            "Aesthetics-Based Graph Layout for Human Consumption.",
            "A Comparison of Approximate String Matching Algorithms."
        ]
    },
    {
        "name": "SPE",
        "year": "1995",
        "info": "Volume 25, 1995",
        "count": 68,
        "papers": [
            "Kitrace: Precise Interactive Measurement of Operating System Kernels.",
            "DeViouS: A Distributed Environment for Computer Vision.",
            "A Requirements Capture Method and its use in an Air Traffic Control Application.",
            "Extending a Functional Programming System for Embedded Applications.",
            "Statistical Testing of Software Based on a Usage Model.",
            "The Long Division Algorithm of Linger, Mills and Witt.",
            "Design and Implementation Aspects of an Experimental C++ Programming Environment.",
            "Efficient Implementation of Suffix Trees.",
            "Declarative Specification of the Architecture of a Software Development Environment.",
            "Distributed Process Creation within a Shared Data Space Framework.",
            "A Flexible Graphical User Interface for Performance Modeling.",
            "Improving the Output of the FORTRAN to C translator, f2c.",
            "Rie, a Compiler Generator Based on a One-pass-type Attribute Grammar.",
            "A Lift Simulation Prototype.",
            "Implementing Interactive Applications in C++.",
            "Coupling Hundreds of Workstations for Parallel Molecular Sequence Analysis.",
            "CADiZ: An Architecture for Z Tools and its Implementation.",
            "Finding Approximate Matches in Large Lexicons.",
            "Implementing Prototype Testing Tools.",
            "Implementation of the Sentry System.",
            "Hermes Language Experiences.",
            "The Avatars of a Package for Calendars in Ada.",
            "Performance Measurement, Visualization and Modeling of Parallel and Distributed Programs using the AIMS Toolkit.",
            "Operational Machine Specification in a Functional Programming Language.",
            "An Implementation of Storage Management in Capability Environments.",
            "An Operating System Independent WORM Archival System.",
            "Myriad: Design and Implementation of a Federated Database Prototype.",
            "Using Multicast Communications to Distribute Code and Data in Wide Area Networks.",
            "Automatic Verification of Properties in Transition Systems.",
            "Runtime and Language Support for Compiling Adaptive Irregular Programs on Distributed-memory Machines.",
            "PARC++: A Parallel C++.",
            "Adding Graphics to a High-level Programming Language.",
            "Comparison of Syntactic Error Handling in LR Parsers.",
            "Parallel 1D-FFT Computation on Constant-valence Multicomputers.",
            "Engineering a Hard Real-time System: From Theory to Practice.",
            "Experimental Results on String Matching Algorithms.",
            "A Procedural Interface for Program Directing.",
            "ANTLR: A Predicated-  LL(k)  Parser Generator.",
            "Decompilation of Binary Programs.",
            "Implementation Issues in the Development of the PARSEC Parser.",
            "Signatures: A Language Extension for Improving Type Abstraction and Subtype Polymorphism in C++.",
            "Adding Compression to a Full-text Retrieval System.",
            "CBack: A Simple Tool for Backtrack Programming in C.",
            "The Heart of IGES.",
            "Experiences of Parallelising Finite-element Problems in a Functional Style.",
            "Type Inference of SELF: Analysis of Objects with Dynamic and Multiple Inheritance.",
            "On Tuning Recursive Procedures.",
            "Using Conditional Execution to Exploit Instruction Level Concurrency.",
            "Using PROTEAN for Verifying a Complex Protocol - A Case Study.",
            "Interactive Hypermedia Applications: A Model and its Implementation.",
            "Migration in Object-oritented Database Systems - A Practical Approach.",
            "Automatic Synthesis of Compression Techniques for Heterogeneous.",
            "A Tool for Visualizing the Execution of Interactions on a Loosely-coupled Distributed System.",
            "Process Scheduling and UNIX Semaphores.",
            "Software Maintenance: An Approach to Impact Analysis of Objects Change.",
            "An Approach to Automatic Display Layout Using Combinatorial Optimization Algorithms.",
            "Object-oriented Specification of User Interfaces.",
            "Design and Implementation of Heterogeneous Distributed Multimedia System using Mosaic GSQL.",
            "Experience with Logical Code Analysis in Software Maintenance.",
            "A PREttier Compiler-Compiler: Generating Higher-order Parsers in C.",
            "A Scalability Test for Parallel Code.",
            "Ropes: An Alternative to Strings.",
            "The Oberon System Family.",
            "Using Formalized Temporal Message-flwo Diagrams.",
            "Open Issues in Object-Oriented Programming - A Scandinavian Perspective.",
            "Foundations for Native C++ Styles.",
            "Network Objects.",
            "Alternative Perspectives on Object Technology."
        ]
    },
    {
        "name": "SPE",
        "year": "1994",
        "info": "Volume 24, 1994",
        "count": 59,
        "papers": [
            "Using the Programming Walkthrough to Aid in Programming Language Design.",
            "SUPRA-RPC: SUbprogram PaRAmeters in Remote Procedure Calls.",
            "Scalar Replacement in the Presence of Conditional Control Flow.",
            "Fast String Matching using an  n  -gram Algorithm.",
            "Efficient Timestamp Input and Output.",
            "Automating Data Conversion for Heterogeneous Distributed Shared Memory.",
            "Compilation of Functional Languages using Flow Graph Analysis.",
            "A Prototyping Environment for Specifying, Executing and Checking Communicating Real-Time State Machines.",
            "Rewriting Executable Files to Measure Program Behavior.",
            "A Faster Scrabble Move Generation Algorithm.",
            "Short Communication: Correction to 'Producing Good Code for the  case  Statement'.",
            "Implementations and Performance of Two RPC-based LAN Gateway Applications.",
            "A Method of Compressing Trie Structures.",
            "The Lime Music Editor: a Diagram Editor Involving Complex Transformations.",
            "The Design and Implementation of Genesis.",
            "A New Data Structure for Cumulative Frequency Tables.",
            "Approximate String Matching using Within-word Parallelism.",
            "A Distributed Graphics Library System.",
            "Using Procedural Parameters and Continuations in Combinatorial Searches.",
            "Visualizing Program Dependencies: An Experimental Study.",
            "Description of Essential System Behaviour using Message-state Tables.",
            "Remote Database Access in the Distributed Computing Environment.",
            "Short Communication: On Tuning the Boyer-Moore-Horspool String Searching Algorithm.",
            "Simple Authentication.",
            "Adding Fault-tolerant Transaction Processing to LINDA.",
            "The Programming Language SuperPascal.",
            "A Simultation Testbed based on Lightweight Processes.",
            "A Debugger for Distributed Programs.",
            "Memory Allocation Costs in Large C and C++ Programs.",
            "STRESS: a Simulator for Hard Real-time Systems.",
            "Design of a Safe String Library for C.",
            "Multiple-length Division Revisited: a Tour of the Minefield.",
            "Automatic Synthesis of State Machines from Trace Diagrams.",
            "Algorithm-oriented Generic Libraries.",
            "Automatic Synthesis of State Machines from Trace Diagrams.",
            "The Application of Prolog to Structured Design.",
            "Corrections to \"A New Data Structure for Cumulative Frequency Tables\".",
            "Synthetic-perturbation Techniques for Screening Shared Memory Programs.",
            "Experience Realising a Meta-model for Wide System Understanding: The Global System Model.",
            "A Matrix Model for the Flow of Control in Prolog Programs with Applications to Profiling.",
            "An Interactive Tool for Design, Simulation, Verification, and Synthesis of Protocols.",
            "Multimedia E-mail: the Evolution Approach Based on Adapters.",
            "Parallel Context-sensitive Compilation.",
            "Optimized k-shortest-paths Algorithm for Facility Restoration.",
            "Assignment as the Sole Means of Updating Objects.",
            "Compiler-assisted Full Checkpointing.",
            "Mirage+: A Kernel Implementation of Distributed Shared Memory on a Network of Personal Computers.",
            "A Database of Groups of Prime-power Order.",
            "A Message-driven Programming System for Fine-grain Multicomputers.",
            "Techniques for File System Simulation.",
            "Efficient Binary Transfer of Pointer Structures.",
            "A Framework for Execution Monitoring in Icon.",
            "Design and Implementation of National Engineering Education Delivery System.",
            "A Comparison of Object-oriented Programming in Four Modern Languages.",
            "Multistage Indexing for Speeding Prolog Executions.",
            "Complex Performance Measurements with NICE (Notation for Interval Combinations and Events).",
            "Object Request Broker: Foundation for Distributed Simulation.",
            "Experiences in Translating Z Designs to Haskell Implementations.",
            "Incremental Compiler Transformations for Multiple Instruction Retry."
        ]
    },
    {
        "name": "SPE",
        "year": "1993",
        "info": "Volume 23, 1993",
        "count": 69,
        "papers": [
            "Experimenting with Dynamic Linking with Ada.",
            "Applications of Finite Automata Representing Large Vocabularies.",
            "Rapid Prototyping of Protocols from LOTOS Specifications.",
            "PDB: a Pictorial Database Oriented to Data Analysis.",
            "Designing and Implementing Multi-user Applications: a Case Study.",
            "Techniques for Fast Instruction Cache Performance Evaluation.",
            "High-level Management of Computation History for the Design and Implementation of a Prolog System.",
            "Experience with PMS-Prolog: a Distributed Coarse-grain-parallel Prolog with Processes, Modules and Streams.",
            "A First Exploration of PrologIII's Capabilities.",
            "The Peregrine High-performance RPC System.",
            "Iconic Control Graph Representation.",
            "Reducing Object Storage Requirements in a Multi-user Environment.",
            "Success Rate of Interpolation in Subsegment Prediction.",
            "Application Integration: Constructing Composite Applications from Interactive Components.",
            "Bonsai: a Compact Representation of Trees.",
            "Visualizing a Hierarchy of Performance Models for Software Systems.",
            "Query by Diagram: a Visual Environment for Querying Databases.",
            "An Implementation of Precompiled Headers.",
            "The Design and Implementation of Dynamic Hashing for Sets and Tables in Icon.",
            "An Evaluation of Self-adjusting Binary Search Tree Techniques.",
            "Calendrical Calculations, II: Three Historical Calendars.",
            "Object Identification in the Lego Kernel.",
            "Generic Abstract Interpretation Algorithms for Prolog: Two Optimization Techniques and their Experimental Evaluation.",
            "Practical Experience of the Limitations of Gprof.",
            "Kibitz-Connecting Multiple Interactive Programs Together.",
            "Reducing Compilation Time by a Compilation Server.",
            "An execution Profiler for Window-oriented Applications.",
            "CIRL/PIWI: a GUI Toolkit Supporting Retargetability.",
            "Multi-way versus One-way Constraints in User Interfaces: Experience with the DeltaBlue Algorithm.",
            "Lexical Analysis of Inflected Arabic Words using Exhaustive Search of an Augmented Transition Network.",
            "Debugging with Dynamic Slicing and Backtracking.",
            "Extensions to the C Programming Language for Enhanced Fault Detection.",
            "Executable Specifications with Data-flow Diagrams.",
            "Construction of an Interactive Programming Environment for Control of Theatrical-set Effects via Object-oriented Methods.",
            "Emulating an Operating System on Top of Another.",
            "Lock-and-key Strategies for Handling Undefined Variables.",
            "Standardized Protocol Interfaces.",
            "The Measured Cost of Conservative Garbage Collection.",
            "Longest-match String Searching for Ziv-Lempel Compression.",
            "The Duality of Fault-tolerant System Structures.",
            "Vartalaap: a Distributed Multicast Communication System.",
            "A Method for Fast Tape Backups and Restores.",
            "Aestetic Layout of Generalized Trees.",
            "Parsing Non-LK(  k  ) Grammars with Yacc.",
            "CustoMalloc: Efficient Synthesized Memory Allocators.",
            "Differential Evaluation: a Cahe-based Technique for Incremental Update of Graphical Displays of Structures.",
            "Pictures that Play: Design Notations for Real-time and Distributed Systems.",
            "A Unix Tool for Managing Reusable Software Components.",
            "On-line Software Version Change Using State Transfer Between Processes.",
            "Reverse Reachability Analysis a New Technique for Deadlock Detection on Communicating Finite State Machines.",
            "Implementing a Graphical Multi-user Interface Toolkit.",
            "The Disign and Implementation of the Lout Document Formatting Language.",
            "Backtalk: A Generalized Dynamic Communication System for DAI.",
            "Experience with Modularity in Consul.",
            "A Generational and Conservative Copying Collector for Hybrid Objectoriented Languages.",
            "An Application of Causal Analysis to the Software Modification Process.",
            "A Performance Comparison of Event Calendar Algorithms: an Empirical Approach.",
            "Guarded Attribute Grammars.",
            "Static Analysis of Exception Handling in Ada.",
            "Compile-time Copy Elimination.",
            "InterProcedural Alias Analiysis: Implementation and Empirical Results.",
            "A Distributed Development Environment for Embedded Software.",
            "Engineering a Sort Function.",
            "ISA[  k  ] Trees: a Class of Binary Search Trees with Minimal or Near Minimal Internal Path Length.",
            "Making C++ Objects Persistent: the Hidden Pointers.",
            "Utopia: a Load Sharing Facility for Large, Heterogeneous Distributed Computer Systems.",
            "QD-Janus: a Sequential Implementation of Janus in Prolog.",
            "Experiences in Database System Implementation Using a Persistent Programming Language.",
            "Executing Continuation Semantics."
        ]
    },
    {
        "name": "SPE",
        "year": "1992",
        "info": "Volume 22, 1992",
        "count": 52,
        "papers": [
            "Administrators and Multiprocessor Rendezvous Mechanisms.",
            "Experience Compiling Fortran to Program Dependence Graphs.",
            "User Interface-Application Communication in the Chimera User Interface Management System.",
            "Simple Register Spilling in a Retargetable Compiler.",
            "Optimizing Stack Frame Accesses for Processors with Restricted Addressing Modes.",
            "Incremental Semantic Evaluation in Language-based Editors.",
            "Concurrency in the Object-oriented Language C++.",
            "Experience with Fagan's Inspection Method.",
            "Efficient Prolog Programming.",
            "The Design and Implementation of a Grammar-based Data Generator.",
            "A Parallel Database-driven Protocol Verification System Prototype.",
            "Implementing Concurrent C.",
            "Object-oriented Implementation Issues in an Experimental CAD System.",
            "Adding Run-time Checking to the Portable C Compiler.",
            "ARTK-M2: a Kernel for Ada Tasking Requirements: an Implementation and an Automatic Generator.",
            "Profile-guided Automatic Inline Expansion for C Programs.",
            "A Vector C and Fortran Compiler for the FPS T-Series: Experiences with Compiling to occam I.",
            "The Elaboration Order Problem of Ada.",
            "A New Parsing Method for Non-LR(1) Grammars.",
            "Selecting the Median and Two Quartiles in a Set of Numbers.",
            "Ingest - A Simple Program for Performing Distributed Relational Database Operations.",
            "Arithmetic Equality Constraints as C++ Statements.",
            "Tuning a Parallel Database Algorithm on a Shared-memory Multiprocessor.",
            "The Evolution of an Object-orietented Compiler Framework.",
            "Practical Experience with OS/2 Installable File Systems.",
            "Problems with Determining Package Cohesion and Coupling.",
            "Extension Table Built-ins for Prolog.",
            "Issues in Porting Software from C to C++.",
            "A Group Process for Defining Local Software Quality: Field Applications and Validation Experiment.",
            "An Optimizing Compiler for the Icon Programming Language.",
            "Garbage Collection Alternatives for Icon.",
            "Multilevel Security in the UNIX Tradition.",
            "An Efficient Implementation of Trie Structures.",
            "Assignment of Independent Tasks to Minimize Completion Time.",
            "Synchronous and Asynchronous Handling of Abnormal Events in the System.",
            "Software Tools for Micro-analysis of Programs.",
            "cxterm: A Chinese Terminal Emulator for the X Window System.",
            "Exceptional C or C with Exceptions.",
            "Linkage Analysis of Processes.",
            "Monitoring and Debugging Distributed Real-time Programs.",
            "Tuning the Boyer-Moore-Horspool String Searching Algorithm.",
            "Stress Testing of Compilers for Modula-2.",
            "Tm: a Code Generator for Recursive Data Structures.",
            "Towards a Toolkit for Building Language Implementations.",
            "Hypertext Development Using a Model-based Approach.",
            "Specification and Quality Assurance of Timing Constraints in Real-time Systems Development.",
            "A Comparison of Two Paradigms for Distributed Shared Memory.",
            "ALADIN: A Scanner Generator for Incremental Programming Environments.",
            "CCIGS: A Data Compression System for Chinese Fonts and Binary Images Using Classification Techniques.",
            "Reusability Through Fine-grain Inheritance.",
            "An Exercise in Formalizing the Description of a Concurrent System.",
            "Incrementally Maintained Network - Relational Database Mapping."
        ]
    },
    {
        "name": "SPE",
        "year": "1991",
        "info": "Volume 21, 1991",
        "count": 70,
        "papers": [
            "Hard-coding Bottom-up Code Generation Tables to Save Time and Space.",
            "A Light-weight UIMS.",
            "A Letter-oriented Perfect Hashing Scheme Based upon Sparse Table Compression.",
            "LANSF: A Protocol Modelling Environment and its Implementation.",
            "Emerald: A General-Purpose Programming Language.",
            "Ytracc: a Parse Browser for Yacc Grammars.",
            "Modelling the Software Development Process Using an Expert Simulation System Having Fuzzy Logic.",
            "Methods for Saving and Restoring Register Values across Function Calls.",
            "Implementing a User Interface Management System for Existing Applications Using an Object-oriented Database Tool.",
            "A Scheme for Little Languages in Interactive Graphics.",
            "A Dataflow Approach to Event-based Debugging.",
            "Correcting a Widespread Error in Unification Algorithms.",
            "Parallel Algorithm Design for Workstation Clusters.",
            "The Performance of Message-passing Using Restricted Virtual Memory Remapping.",
            "A Syntax-directed Integrated Programming Environment for Developing SIMD Supercomputer Software.",
            "Vertical Migration of Numerical Routines in Software and Microcode.",
            "Performance of Lazy Combinator Graph Reduction.",
            "A Parallel Implementation of the Douglas-Peucker Line Simplification.",
            "Building a Real-time Kernel: First Steps in Validating a Pure Process/Adt Model.",
            "TPDL: Extended Temporal Profile Description Language.",
            "An Approach to Genuine Dynamic Linking.",
            "The Design and Implementation of a High-level Language Converter.",
            "Reactive C: An Extension of C to Program Reactive Systems.",
            "Utility Servers in Charlotte.",
            "An Implementation of Distributed Shared Memory.",
            "NovAtel's Novel Approach to CPU Usage Measurement.",
            "A Modular Fully-lazy Lambda Lifter in HASKELL.",
            "Profiling Software through the Use of Metrics.",
            "Reverse Engineering: Algorithms for Program Graph Production.",
            "Module Reuse by Interface Adaptation.",
            "A Hybrid Implementation of a Process-oriented Programming Language for System Simulation.",
            "An Experiment with Inline Substitution.",
            "Reflection Mechanisms for Combining Prolog Databases.",
            "Style Control in the Quill Document Editing Systems.",
            "Reducing and Manipulating Complex Trace Data.",
            "Design and Implementation of a Distributed File System.",
            "Literate Programming on a Team Project.",
            "A Fortran Language System for Mutation-based Software Testing.",
            "An Inheritance Model for Supporting Flexible Displays of Data Structures.",
            "Identifying Syntactic differences Between Two Programs.",
            "Transparent Process Migration: Design Alternatives and the Sprite Implementation.",
            "Extending Regular Expressions with Context Operators and Parse Extraction.",
            "Tlex.",
            "PROTOB: An Object-oriented CASE Tool for Modelling and Prototyping Distributed Systems.",
            "A Methodology for Constructing Predicate Transition Net Specifications.",
            "Compiled Instruction Set Simulation.",
            "Evaluation of Fortran Vector Compilers and Preprocessors.",
            "A Multi-protocol Campus Time Server.",
            "A Design Rationale for a Language-based Editor.",
            "DMT-a Demonstration Tool.",
            "A Code Generation Interface for ANSI C.",
            "The Design of an Operating System for a Scalable Parallel Computing Engine.",
            "Floating-point Number LISP.",
            "Implementing Dynamic Minimal-prefix Tries.",
            "An Experimental Investigation of Distributed Matrix Multiplication Techniques.",
            "Experiments with a Very Fast Substring Search Algorithm.",
            "Path Testing of Computer Programs with Loops Using a Tool for Simple Loop Patterns.",
            "Operational Definitions for System Requirements as the Basis of Design Automation.",
            "A Note on Searching in a Binary Search Tree.",
            "Graph Drawing by Force-directed Placement.",
            "Perly-UNIX with Buttons.",
            "EcliPSe: A System for High Performance Concurrent Simulation.",
            "Fast String Searching.",
            "The Distributed Ada Run-time System DARTS.",
            "Case Study: Using ITS Style Tools to Implement IBM's CUA-2 User Interface Style.",
            "A Cached WORM File System.",
            "Using Profile Information to Assist Classic Code Optimizations.",
            "An Investigation into Concurrent Semantic Analysis.",
            "Software Reverse Engineering.",
            "A STREAMS-based Communications Subsystem in Turing Plus for Protocol Develelopment."
        ]
    },
    {
        "name": "SPE",
        "year": "1990",
        "info": "Volume 20, 1990",
        "count": 82,
        "papers": [
            "SPE-The Early Years.",
            "Fast Allocation and Deallocation of Memory Based on Object Lifetimes.",
            "Ceres-Net: A Low-cost Computer Network.",
            "Tools to Aid in Discovering Parallelism and Localizing Arithmetic in Fortran Programs.",
            "A Case Study Comparison of Four Declarative Programming Languages.",
            "VIFOR: A Tool for Software Maintenance.",
            "Regulation Management and Logic Programming.",
            "A Structure for Efficient Update, Incremental Redisplay and Undo in Graphical Editors.",
            "Structured Dataflow Analysis for Arrays and its Use in an Optimizing Compiler.",
            "Experience with Distributed Smalltalk.",
            "Extending Mutation Testing to Find Environmental Bugs.",
            "Conversion of Simulation Processes to Pascal Constructs.",
            "Selecting a Hashing Algorithm.",
            "A System for Adaptive Disk Rearrangement.",
            "Programming Abstract Data Types, Iterators and Generic Modules in C.",
            "Code Generation for a Systolic Computer.",
            "A Tool to Minimize the Time Costs of Parallel Computations Through Optimal Processing Power Allocation.",
            "Code Generation Using an Orthogonal Model.",
            "TMS: A Free-form Text-management System.",
            "Signalling Regions: Multiprocessing in a Shared Memory Reconsidered.",
            "Proxies: A Software Structure for Accommodating Heterogeneity.",
            "Restructuring for Style.",
            "Run-time Detection of Undefined Variables Considered Essential.",
            "Univers: An Attribute-based Name Server.",
            "Developing Human-Computer Interface Models and Representation Techniques.",
            "LexAGen: An Interactive Incremental Scanner Generator.",
            "Collaboration using Roles.",
            "A Symbolic Debugger for Real-time Embedded Ada Software.",
            "Even Faster LR Parsing.",
            "Code Compaction for Parallel Architectures.",
            "Experiences of Designing a Sophisticated Network Monitor.",
            "Message Passing in Concurrent C: Synchronous Versus Asynchronous.",
            "TICL-A Type Inference System for Common Lisp.",
            "A Tale of Three Spelling Checkers.",
            "Field Experiments with Local Software Quality Metrics.",
            "The Implementation of Newsqueak.",
            "Squinting at Power Series.",
            "A Node-positioning Algorithm for General Trees.",
            "Experiences Structuring Software in a Periodic Real-time Environment.",
            "Pitfalls of Conservative Garbage Collection.",
            "A Microcode Compiler for the Watch-oriented RISC Processor.",
            "Lazy Recursive Descent Parsing for Modular Language Implementation.",
            "Synchronization of Nested Atomic Actions.",
            "Formal Verification of Safety-critical Systems.",
            "LR Parsing of CFGs with Restrictions.",
            "Optimization Techniques for Parallel Processing.",
            "Live Text.",
            "Program Monitoring and Analysis: Software Structures and Architectural Support.",
            "Efficient Automated Protocol Implementation Using RTAG.",
            "Object-oriented Programming Applied to a Prototype Workstation.",
            "Calendrical Calculations.",
            "The System: Providing Light-weight Concurrency on Shared-memory Multiprocessor Computers Running UNIX.",
            "On the Distributed Parallel Simulation of Hopfield's Neural Networks.",
            "The Implementation of ProTest: a Prolog Debugger for a Refined Box Model.",
            "Implementation of a Portable Screen Manager.",
            "Incremental Register Reallocation.",
            "Integrating Prolog and CADAM to Produce an Intelligent CAD System.",
            "UNIX File System Behaviour and Machine Architecture Dependency.",
            "The Eductive Implementation of a Three-dimensional Spreadsheet.",
            "Lalr - A Generator for Efficient Parsers.",
            "Implementing SASL using Categorical Multi-combinators.",
            "Manipulation Multilinked Data Structures in a Pure Functional Language.",
            "Using SR for Discrete Event Simulation: A Study in Concurrent Programming.",
            "A Virtual Stack Facility for Mini-computer and Microcomputer Implementation of the Finite Element Method.",
            "A Graphical User Interface Server for UNIX.",
            "Abstract Execution: A Technique for Efficiently Tracing Programs.",
            "Dynamic Strings in Fortran 90.",
            "High-level Goal-directed Concurrent Processing in Icon.",
            "Interprocess Communication in the Ninth Edition Unix System.",
            "A New Dimension for the Unix File System.",
            "A Case for make.",
            "Unix Music Tools at Bellcore.",
            "EDGE: An Extendible Graph Editor.",
            "Interacting with the FIELD environment.",
            "The X Window System.",
            "The X Window System, Version 11.",
            "Writing Tailorable Software: The X11 Sample Server.",
            "Writing Fast X Servers for Dumb Color Frame Buffers.",
            "The X11 Inter-Client Communication Conventions Manual.",
            "Performance Measurements of the X Window System Communication Protocol.",
            "Why X Is Not Our Ideal Window System.",
            "Glossary."
        ]
    },
    {
        "name": "SPE",
        "year": "1989",
        "info": "Volume 19, 1989",
        "count": 64,
        "papers": [
            "indx and findphrases, A System for Generating Indexes for Ditroll Documents.",
            "The Design of an Object-oriented Command Interpreter.",
            "Independent Testing of Compiler Phases Using a Test Case Generator.",
            "PORTREP: A Portable Repeated String Finder.",
            "Quick Compilers Using Peephole Optimization.",
            "Circular Programs and Self-referential Structures.",
            "Q'Nial; A Portable Interpreter for the Nested Interactive Array Language, Nial.",
            "Practical Interface Specification.",
            "Interprocedural Optimization: Experimental Results.",
            "Simple Generational Garbage Collection and Fast Allocation.",
            "Word-based Text Compression.",
            "The Design and Implementation of a Version Server for Computer-aided Design.",
            "The Performance of the Amoeba Distributed Operating system.",
            "An Implementation of the Object-oriented Concurrent Programming Language SINA.",
            "Improved String Searching.",
            "Comparative Timings of Three Different Set Implementations in Occam.",
            "GMB: A Tool for Manipulating and Animating Graph Data Structures.",
            "Using Sentinels in Insert Sort.",
            "Attribute Grammars in Constraint-based Graphics Systems.",
            "A Session Editor with Incremental Execution Functions.",
            "Implementation of a Declarative State-transition System.",
            "The ECLIPSE User Interface.",
            "Generation of File Processing Programs Based on JSP.",
            "SAHAYO: A Test Bed Evaluating Dynamic Load-sharing Policies.",
            "A User Interface Specification for a Program Debuggung and Measuring Environment.",
            "A Performance Study of Deadlock Prevention Algorithms in a Distributed File System.",
            "A Practical Algorithm for Evaluating Database Queries.",
            "Program Tools for Algorithm Animation.",
            "A Visual Shell Interface to a Database.",
            "Semantic Extension Possibilities in the Proposed New Fortran.",
            "The Joyce Language Report.",
            "A Multiprocessor Implementation of Joyce.",
            "Set Notation as a Language to Specify Data Transformation Programs.",
            "The Errors of TEX.",
            "User-adaptable Prettyprinting.",
            "Allocation without Locking.",
            "A Heuristic for Software Evaluation and Selection.",
            "Object Management in a Persistent Smalltalk System.",
            "Mapping Massive SIMD Parallelism onto Vector Architectures for Simulation.",
            "A Simple Technique for Automatic Recompilation in Modular Programming Languages.",
            "Software Function Allocation Methodology.",
            "A Parallel Ada System on an Experimental Multiprocessor.",
            "Record Manipulation in Prolog.",
            "A Measurement-based Study of Hardware Support for Object Invocation.",
            "Rapid Location of Mount Points.",
            "A Language-independent Prettyprinter.",
            "The Oberon System.",
            "Tools for Implementing Network Protocols.",
            "A Parallel Version of Cook and Kim's Algorithm for Presorted Lists.",
            "Automated Software Management Based on Structural Models.",
            "Microcomputers vs. Mainframe Simulations: a Case Study.",
            "Near-perfect Hashing of Large Word Sets.",
            "TGMS: An Object-oriented System for Programming Geometry.",
            "The Parser Generating System PGS.",
            "The Elmwood Multiprocessor Operating System.",
            "Generic Parameters in occam.",
            "Complexity Measurement of a Graphical Programming Language.",
            "Efficient Generation of Lexical Analysers.",
            "A Selection Algorithm with a Practical Upper Bound on Expected Number.",
            "Converting a Portable Pascal-code Interpreter to a Code Generator.",
            "Persistence in the E Language: Issues and Implementation.",
            "Fast Peephole Optimization Techniques.",
            "A Distributed Batching System for Parallel Processing.",
            "One-pass Code Generation Using Continuations."
        ]
    },
    {
        "name": "SPE",
        "year": "1988",
        "info": "Volume 18, 1988",
        "count": 73,
        "papers": [
            "Maintaining Cross References in Manuscripts.",
            "A Multicast Interface for UNIX 4.3.",
            "A Programmer-friendly LL(1) Parser Generator.",
            "Unscrambling Non-sequential Programs.",
            "An Architectural Approach to Improved Program Maintainability.",
            "A Microprogrammed occam Interpreter for the HLH Orion.",
            "Programming with Generators.",
            "Performance Analysis of Particle-match Search Algorithms for BD Trees.",
            "The Design of a Language Processor Generator.",
            "An Improved Protocol Reachability Analysis Technique.",
            "Converting Help Systems to Hypertext.",
            "PICASSO: a Graphical Query Language.",
            "Assert, Retract and External Processes in Prolog.",
            "JDB: an Adaptable Interface for Debugging.",
            "Statistics on Graph Reduction of SASL Programs.",
            "A Practical Study of Semi-automatic OSI Protocol Implementation.",
            "A Practical Solution for a Large Sparse Matrix.",
            "A Technique for Subclassing and its Implementation Exploiting Polymorphic Procedures.",
            "The Seismic Kernel System-a Large-scale Exercise in Fortran 77 Portability.",
            "A Simple Algorithm for Clock Synchronization in Transputer Networks.",
            "Edison -N-an Edison Implementation for a Network of Microcomputers.",
            "An Interpreter for LOTOS, a Specification Language for Distributed Systems.",
            "Fast Approximate String Matching.",
            "VIS: A Virtual Image System for Image-understanding Research.",
            "Experience With an Object-oriented Virtual Machine.",
            "Structured FORTRAN Preprocessors Generating Optimized Output.",
            "An Exception Handling Method for Constructive Algebraic Specifications.",
            "Inaccuracies in Program Profilers.",
            "Process-graph Analyser: A Front-end Tool for VHDL Behavioural Synthesis.",
            "A Micro-Kernel for Concurrency in C.",
            "Low-level Programming in Modula-2: an Experience with Local Area Network Access.",
            "Converting Interpreters into Compilers.",
            "Problems with the Language Modula-2.",
            "CSP-i: An Implementation of Communicating Sequential Processes.",
            "A Recovery Block Scheme for a VAX11/750 Running Unix.",
            "An Empirical Analysis of Spreadsheet Calculation.",
            "A Simple Row-replacement Method.",
            "Garbage Collection of Strings and Linked Data Structured in Real Time.",
            "A Simple System for Constructing Distributed, Mixed-language Programs.",
            "From Modula to Oberon.",
            "The Programming Language Oberon.",
            "A Convenient Way to Incorporate Semantic: Actions in Two-pass Compiling Scheme.",
            "Compiler Support for Floating-point Computation.",
            "PRESTO: A System for Object-oriented Parallel Programming.",
            "A Retrospective on DOSE: An Interpretive Approach to Structure Editor Generation.",
            "Animation of Requirements Specifications.",
            "A Study of a C Function Inliner.",
            "Dragonmail: An Exercise in Distributed Computing.",
            "Garbage Collection in an Uncooperative Environment.",
            "Profiling Prolog Programs.",
            "GPROC-An Integrated System for the Processing of Numerical Scientific Data.",
            "The Distributed Operating System of the SMD Project.",
            "Performance of Multi-tasking and Synchronization Mechanisms in the Programming Language SR.",
            "Index Preparation and Processing.",
            "Compiler Performance Analysis Tools.",
            "A LISP Implementation of the Model for 'Communicating Sequential Processes'.",
            "Modular Design for Simulation.",
            "RTS: A System to Simulate the Real Time Cost Behaviour of Parallel Computations.",
            "NSEDIT: A Syntax-directed Editor and Testing Tool Based on Nassi-Shneiderman Charts.",
            "GNU Emacs as a Dynamically Extensible Programming Environment.",
            "Support for Graphs of Processes in a Command Interpreter.",
            "Derivation of Local Software Quality Metrics (Software Quality Circles).",
            "On a Formal Definition and Application of Dimensional Design.",
            "DAG-A Program that Draws Directed Graphs.",
            "A Tale of Two Greps.",
            "The Active Deallocation of Objects in Object-oriented Systems.",
            "Load Balancing in a Session Based Distributed File-store Architecture.",
            "K6-A Protected Mode Kernel for the iAPX286.",
            "Program Generation for Ada-A Case Study.",
            "Elastic Memory: Buddy Systems Interface.",
            "Concurrent C++: Concurrent Programming with Class(es).",
            "A Debugger for Parallel Processes.",
            "An Addendum to G. S. Blair, J. A. Mariani and W. D. Shepherd: 'Practical Extension to UNIX for Interprocess Communication'."
        ]
    },
    {
        "name": "SPE",
        "year": "1987",
        "info": "Volume 17, 1987",
        "count": 61,
        "papers": [
            "Lazy Garbage Collection.",
            "Formatting Texts Accessed Randomly.",
            "Transporting TEX into the HITAC VOS3 Environment.",
            "Joyce - A Programming Language for Distributed Systems.",
            "Parsing Ambiguous Addresses for Electronic Services.",
            "A Browser for Directed Graphs.",
            "Debugging Programs that use Macro-Oriented Data Abstractions.",
            "Tree Matching and Simplification.",
            "The Suitability for Master/Slave Concurrency of Concurrent Euclid, Ada and Modula.",
            "A Structural Testing Method for JSP Designed Programs.",
            "A Depth-first and Tool-supportable Programming Strategy.",
            "Implementing an Extended Functional Data Model Using PS-algol.",
            "An Integrated Data Dictionary to Facilitate Automatic Report Generation in a Network Database.",
            "Real-time Interrupt Handling in Ada.",
            "Microprocessor Debugging Techniques and Their Application in Debugger Design.",
            "AIDA-A Dynamic Data Flow Anomaly Detection System for Pascal Programs.",
            "Strongly Typed User Interfaces in an Abstract Data Store.",
            "A Joyce Implementation.",
            "DEMOS/MP: The Development of a Distributed Operating System.",
            "Experience Acquiring and Retargeting a Portable Ada Computer.",
            "A Prolog Implementation of an Instruction-level Processor Simulator.",
            "Addressing Types and Objects in Ada.",
            "Operating-system Enhancements for a Fault-tolerant Dual-processor Structure for the Control of an Industrial Process.",
            "The Design of a Terminal Independent Package.",
            " Mkscan  - A Interactive Scanner Generator.",
            "Making Form Follow Function: An Exercise in Functional Programming Style.",
            "A Method for Interconnecting Heterogeneous Computer Networks.",
            "Multiple Stack Performance Near Saturation.",
            "Hashing as a Compaction Technique for LR Parser Tables.",
            "Generalization of the Sethi-Ullman Algorithm for Register Allocation.",
            "The Design and Use of a Prolog Trace Generator for CSP.",
            "Generating Reversible Programs.",
            "Dynamic Compilation in the Unix Environment.",
            "One-pass Compilation at its Limits-A Modula-2 Compiler for the Xerox Dragon Computer.",
            "Music-A Language for Typesetting Music Scores.",
            "Flexible Symbol Table Structures for Compiling C++.",
            "The Use of Colour in Language Syntax Analysis.",
            "Register Allocation in a Pattern Matching Code Generator.",
            "A Portable Implementation of a Modular Multiprocessing Database Programming Language.",
            "On the Efficiency of Categorical Combinators as a Rewriting System.",
            "The Implementation and Use of Toolpack/1 on a Graphics Workstation.",
            "Formal Specification of an Access Control System.",
            "Fixing some Space Leaks with a Garbage Collector.",
            "Interactive Programs in a Functional Language: A Functional Implementation of an Editor.",
            "An Object-oriented Approach to Application Generation.",
            "A Debugger for a Graphical Workstation.",
            "A Supercomputer Program Development System.",
            " fsh  - A Functional UNIX Command Interpreter.",
            "A Processing Algorithm for Master-Detail Records in a Relational Database.",
            "A Direct Access Technique for Sequential Files with Variable Length Records.",
            "Profiling Under UNIX by Patching.",
            "Remote Rendezvous.",
            "Object-oriented Data Management Based on Abstract Data Types.",
            "GCI-A Tool for Developing Interactive CAD User Interfaces.",
            "Automatic Inference and Fast Interpretation of Peephole Optimization Rules.",
            "The Text Editor sam.",
            "Synthesizing Implementations of Abstract Data Types from Axiomatic Specifications.",
            "Distributing Concurrent Ada Programs by Source Translation.",
            "A Real-time Messaging System for Token Ring Networks.",
            "An Object-Oriented Class Library for C++ Programs.",
            "A File Replication Facility for Berkeley Unix."
        ]
    },
    {
        "name": "SPE",
        "year": "1986",
        "info": "Volume 16, 1986",
        "count": 80,
        "papers": [
            "The Function of T and NIL in LISP.",
            "A New Algorithm for Generating Hilbert Curves.",
            "Executable Semantic Descriptions.",
            "Using Coroutines in Pascal.",
            "Communicating Parallel Processes.",
            "Implementing ALGOL 68 Predicates.",
            "Seperate Compilation in a Modula-2 Compiler.",
            "A Crash Resistant UNIX File System.",
            "Routines: An Argument against the Conventional Approach to Functions and Procedures.",
            "SOFTLIB-A Documentation Management System.",
            "A New List Compaction Method.",
            "Printing Arabic Text Using Dot Matrix Printers.",
            "Template Design for File Processing Applications.",
            "A Distributed Programs Monitor for Berkeley UNIX.",
            "Insecurities in FORTRAN DO-loops.",
            "CONTEXT: An On-line Documentation System.",
            "A Probe Effect in Concurrent Programs.",
            "File Updating Revisited.",
            "An Almost Path-free Very High-level Interactive Data Manipulation Language for a Microcomputer-based Database System.",
            "Syntax-directed Compression of Program Files.",
            "A Communication System Supporting Large Datagrams on a Local Area Network.",
            "Interactive Documentation.",
            "Coroutines for C Reconsidered.",
            "Process Administration in a High Level Language.",
            "Copying of Dynamic Structures in a Pascal Environment.",
            "The Construction of Information Management System Prototypes in Ada.",
            "A Persistent Graphics Facility for the ICL PERQ.",
            "AWK as Glue for Programs.",
            "Yet Another Storage Technique for LR Parsing Tables.",
            "An Algorithm for Displaying a Class of Space-filling Curves.",
            "Processing Variable Length Abbreviations: Some Observations.",
            "A Distributed Real-time Operating System.",
            "Experimenting with Data Structures.",
            "A Modula-2 Kernel for Supporting Monitors.",
            "The Cost of Lexical Analysis.",
            "Inter-process Communication in MVS/XA and Applications for Scientific and Engineering Information Processing.",
            "Iterative Development of Information Systems: A Case Study.",
            "Integrating Distributed Array Processing into EMAS 2900.",
            "Providing Multi-Users Access to Distributed Array Processors.",
            "A String Pattern Matching Extension to Pascal and Some Comparisons with SNOBOL4.",
            "A Management System for Dirty Data.",
            "A Fortran Procedure for Drawing Some Space-filling Curves.",
            "Algorithms for Pattern Matching.",
            "Formatted Syntaxes and Modula.",
            "Automatic Generation of Useful Syntax Error Messages.",
            "Multiplication by Integer Constants.",
            "Dbxtool: A Window-Based Symbolic Debugger for Sun Workstations.",
            "A Monitor Tool for a Network Based on the Cambridge Ring.",
            "Ada, as Seen from Simula.",
            "Using High Level Languages for Local Computer Network Communication: A Case Study in Ada.",
            "Reorganization in a Simple Database System.",
            "TBFLP-A Simple Preprocessor for Tables.",
            "Icecream, Transportable Software for Creating Fiendly Human Interfaces.",
            "A Code Generator Synthesizer for the Non-specialist.",
            "Suitable Multiprocessor Structures and Virtual Storage Management when Applying a Feasible Scheduling Algorithm in Hard Real-Time Environment.",
            "Management of Replicated Files in a UNIX Environments.",
            "Superlinear Speed-Up and the Halting Problem.",
            "A Protocol for Generalized occam.",
            "The Automatic Generation of Fast Lexical Analysers.",
            "Side-effects in Automatic File Updating.",
            "Concurrent C.",
            "Contextually Communicating Sequential Processes: A Software Engineering Environment.",
            "Profiling under ELXSI UNIX.",
            "A Multi-processor Implementation of occam.",
            "A Practical Approach to Data Modelling in Spatial Applications.",
            "Foreet: A Tool for Design and Documentation of Fortran Programs.",
            "Logicon: An Integration of Prolog into Icon.",
            "Communications in Meglos.",
            "Segments on Bit-mapped Graphics Displays.",
            "An Algorithm for The Selection Problem.",
            "A Functional Processor for the Relational Algebra on a Microcomputer.",
            "Specification Methodology: An Integrated Relational Approach.",
            "An Experiment with the Newcastle Connection Protocol.",
            "Computing Advice at a Distance: the 'Remote Advisory' Concept.",
            "Three Way Branching Self Consistency Checking of Hardware and Software.",
            "A Modular Operating System for the CRAY-1.",
            "Algorithms for BD Trees.",
            "The Ilem Project: Pascal to Algol in Easy Stages I: Outward Bound.",
            "Another Approach to the Implementation of Synchronization Primitives.",
            "Writing Concurrent Assemblers-A Case Study in Path Pascal."
        ]
    },
    {
        "name": "SPE",
        "year": "1985",
        "info": "Volume 15, 1985",
        "count": 85,
        "papers": [
            "Program Development by Inductive Stepwise Refinement.",
            "Forced Termination of Loops.",
            "Programming Divide and Conquer for a MIMD Machine.",
            "On Implicit Data Structures for Priority Queues.",
            "An Interactive Assembly Level Debugging System.",
            "An IKBS Implementation.",
            "The NMFECC Cray Time-Sharing System.",
            "Structural Dimensions of Small Programming Environments.",
            "Orthogonality of Concerns in Module Closure.",
            "Hardware/Software Trade-offs for Bitmap Graphics on the Blit.",
            "Implementation of the Blit Debugger.",
            "A Survey of Systems Programming Languages: Concepts and Facilities.",
            "A Flexible Software Character Generator.",
            "A Simple Language is also a Functional Language.",
            "The Cost of a Generated Parser.",
            "Follow Set Error Recovery.",
            "A SIMULA Program to Automate Wire-wrap Schedule Generation.",
            "Optimization of Expression Syntax: an Experimental Approach.",
            "Portable Real-Time Software for 8-bit Microprocessors.",
            "Developing Ada Programs Using the Vienna Development Method (VDA).",
            "Writing Portable Fortran Programs for Microcomputer.",
            "FOAM: A Two-Level Approach to Text Formatting on a Microcomputer System.",
            "Network Management in a Local Computer Network.",
            "Run-time Diagnostics in Pascal.",
            "NEWLONG: A Program for Manipulation of Data on Populations of Individuals Subject to Change.",
            "A Low-Cost Implementation of Coroutines for C.",
            "Topic Libraries for Mathematical Computation.",
            "Software for an Air Pollution Measuring System: an Application of Modula.",
            "A Note on Macro Generation.",
            "Analysis and Design for a Standard Transport Protocol.",
            "UNISEX: A UNIX-based Symbolic EXecutor for Pascal.",
            "Software Development Tools for Microcontrollers.",
            "ISDMS-A Scientific Data Management System.",
            "SRE-A Syntax Recognizing Editor.",
            "Practical Considerations of Global and Local Variables.",
            "Automating the Selection of Code Templates.",
            "CWSH: The Windowing Shell of the Maryland Window System.",
            "Extensions to a Microcoded Pascal Compiler.",
            "A Portable High-level Database Debugger and Software Performance Monitor.",
            "A Debugger for Concurrent Programs.",
            "Ada's Derived Types and Units of Measure.",
            "On Squeezing the UNIX Quart into a Data General Eclipse Pint Pot.",
            "A Program Design Language Based Software Maintenance Tool.",
            "The University of Salford Lisp/Prolog System.",
            "HANDIN-A System for Helping with the Teaching of Programming.",
            "Compact Coding of Syntactically Correct Source Programs.",
            "RCS - A System for Version Control.",
            "The Robust Implementation of Sequence-Controlled Iteration.",
            "Implementation Techniques for Prolog Databases.",
            "A Method of Program Transformation between Variable Sharing and Message Passing.",
            "Dynamic Storage Allocation: Experiments Using the C Language.",
            "Experiences with Writing Library Software for an Attached Processor.",
            "Management of Block-structured Programs.",
            "MOS: A Multicomputer Distributed Operating System.",
            "Software Concurrency in Real Time Control Systems.",
            "A General Character to Integer Conversion Method.",
            "Combining MASCOT with Modula-2 to aid the Engineering of Real-time Systems.",
            "A VLSI Interactive Layout Editor (VILRE).",
            "Yacc in Sasl-an Exercise in Functional Programming.",
            "A Comparison of the ANSI and ISO Pascal Word Standards.",
            "An Evaluation of Tagging.",
            "Towards a Language for Concurrent Processes.",
            "A Large Scale Network Storage Facility.",
            "A Distributed Load-balancing Policy for a Multicomputer.",
            "Video-Slide: A Presentation Aid for the BBC Microcomputer.",
            "Efficient Algorithms to Create and Maintain Balanced and Threaded Binary.",
            "Design and Implementation of the Wisconsin Storage System.",
            "The Creation of a Virtual NAG-Algol 68 Program Library.",
            "A Reliable Stable Storage System for UNIX.",
            "Compilers - Some Good, Some Bad!.",
            "Integration of Diskless Workstations in UNIX United.",
            "DDA - A Data Definition Facility for UNIX Using Awk.",
            "Producing Good Code for the Case Statement.",
            "A File Comparison Program.",
            "PRTDS - A Pascal Run-Time Diagnostics System.",
            "A Software Tool for the Construction and Maintenance of Structured Analysis Notation.",
            "A Debugger for Message-based Processes.",
            "The PULSE Distributed File System.",
            "An Intelligent Pascal Editor for a Graphical Oriented Workstation.",
            "Treatment of Tab Characters by a Compiler.",
            "A Critique of UNIX.",
            "Specifications and an Implementation of the Type-ambiguity Problem in Pascal.",
            "A High Level Language Based System for Cross-Assembler Definition.",
            "Implementation of an Interpreter for Abstract Equations.",
            "Compact Recursive-descent Parsing of Exptressions."
        ]
    },
    {
        "name": "SPE",
        "year": "1984",
        "info": "Volume 14, 1984",
        "count": 83,
        "papers": [
            "Three Solutions for a Robot Arm Controller Using Pascal-Plus, occam and Edison.",
            "A Portable Virtual Machine for Ada.",
            "Perseus: Retrospective on a Portable Operating System.",
            "Persistent Object Management System.",
            "Andra: The Document Preparation System of the Personal Workstation Lilith.",
            "The Pascal Graphics System.",
            "PEP: An Interactive Programming System with an Algol-like Programming Language.",
            "Concurrent Communication and Synchronization Mechanisms.",
            "Application of an Optimistic Concurrency Control Method.",
            "Calculation of Co-ordinates for Optimal Hatching.",
            "The Design of an Interactive Program Development System for Pascal.",
            "A Shorthand Preprocessor for IDMS COBOL.",
            "Toward Complete Programming Language Descriptions that are both Formal and Understandable.",
            "Implementation of Predicate-based Protection in MULTISAFE.",
            "A Semantically-based Formatting Discipline for Pascal.",
            "A LIS Compiler for GCOS-7.",
            "The Application of Halstead's Software Science Theory to Algol 68 Programs.",
            "An Interactive Data Visualization System.",
            "Preprocessing Embedded Actions.",
            "The PHS Protocol.",
            "Allocating Computer Resources to Satisfy User and Management Demands.",
            "Experience with a Portable Debugging Tool.",
            "A Methodology and Notation for Compiler Front End Design.",
            "Attributed Linear Intermediate Representations for Retargetable Code Generators.",
            "Immediate Files.",
            "Guarded and Unguarded Coroutines: an Implementation in BCPL.",
            "An Economical Implementation of the High Level Real-time Language PEARL on Microcomputers: Intel RMX86-PEARL.",
            "Mixed Language Programming.",
            "Integrating Library Modules into Pascal Programs.",
            "Concurrent Programming in the Ada Language: The Polling Bias.",
            "Exception Handling-A Static Approach.",
            "Designing Software for Children.",
            "The 'Completeness' of the Pascal Test Suite.",
            "UCSD Pascal on the VAX, Portability and Performance.",
            "A Flexible Command Generation Technique for Application in Dialogue Systems.",
            "Two Implementations of the Ada Program Library.",
            "Reference Count Garbage Collection.",
            "Exploiting Partial Order with Quicksort.",
            "A Software Development System Based on a Macroprocessor.",
            "Software Engineering in a Development Group.",
            "The Evaluation of Software Systems' Structure Using Quantitative Software Metrics.",
            "Automatic Generation of Make Dependencies.",
            "The Design of an Interactive Graphics System for the Display of Meteorological Fields.",
            "Adam: An Ada-based Language for Multiprocessing.",
            "Implementation of a Pascal Based Parallel Lanugage for a Mulitprocessor Computer.",
            "A STandard Pascal Event Simulation Package.",
            "Using Ada for Discrete Event Simulation.",
            "PL/I as a Discrete Event Simulation Tool.",
            "Steady-State Compilers.",
            "The Use of Ghost Variables and Virtual Programming in the Documentation and Verfication of Programs.",
            "Anatomy of an Educational Network Database System.",
            "Compile-Time Detection of Aliasing in Euclid Programs.",
            "A General Approach to Queuing in C. S. P.",
            "Taming the PL/I Syntax.",
            "Resource Monitors: A Design Methodology for Operating Systems.",
            "Programs to Process Trees, Representing Program Structures and Data Structures.",
            "An Electronic Secretary.",
            "Separating Policy from Correctness in Concurrency Control Design.",
            "A Simulator for Real-Time Software Debugging and Testing.",
            "Register Allocation and Exhaustive Peephole Optimization.",
            "Implementing a Scaler C Compiler on the Cyber 205.",
            "Transducers are Type-converters.",
            "Experience with Remote Procedure Calls in a Real-time Control System.",
            "Compact Coding of Syntax Tables.",
            "Top-Down Design Within a Functional Environment.",
            "Distributing and Revoking Access Authorizations on Abstract Objects: A Capability Approach.",
            "Implementation of the Database Programming Language Modula/R on the Personal Computer Lilith.",
            "An Experiment in Language Design for Distributed Systems.",
            "Polymorphic Programming I. Another Language Designed on Semantic Principles.",
            "Implementing a File Transfer Protocol between PDP11 and PRIME 550 Computers.",
            "Polymorphic Programming II. An Orthogonal Tagged High Level Architecture Abstract Machine.",
            "A Portable PDP-11 Simulator.",
            "Concurrent C: A Programming Language for Distributed Multiprocessor Systems.",
            "Dedicated, Distributed and Portable Operating Systems: a Structuring Concept.",
            "A Language Independent Error Recovery Method for LL(1) Parsers.",
            "QS: a Tool for General Data Input.",
            "The StarMod Distributed Programming Kernel.",
            "P/CL: A Flexible Input Processor.",
            "Avoiding Trickle-down Recompilation in the Mary2 Implementation.",
            "A Source Code Control System Based on Semantic Nets.",
            "A Simple Equation Solver and its Application to Financial Modelling.",
            "Operating System Support for Sharing Writable Control Store.",
            "WSH-A New Command Interpreter for UNIX."
        ]
    },
    {
        "name": "SPE",
        "year": "1983",
        "info": "Volume 13, 1983",
        "count": 84,
        "papers": [
            "STOIC, an Interactive Programming System for Dedicated Computing.",
            "GRASP: A Software Development System Using D-Charts.",
            "Recoverability Aspects of a Distributed File System.",
            "A Practical Extension to UNIX for Interprocess Communication.",
            "Aids for Pragmatic Error Detection.",
            "The Design and Implementation of CODD.",
            "Structured Text Formatting.",
            "User Acceptance: Design Considerations for a Program Generator.",
            "Modelling of Space-efficient one-pass Translation using Attribute Grammars.",
            "Typesetting Mathematics on Multi-Access Systems.",
            "Adding Classes to the C Language: An Exercise in Language Evoluation.",
            "A Specification Schema for Indenting Programs.",
            "Decision Tables for General-purpose Scientific Programming.",
            "Editing Mathematical Formulae.",
            "A Correctness Proof of an Indenting Program.",
            "Hierarchical Multi-Level Computer Network for Laboratory Automation.",
            "An Evaluation of Throw-away Compiling.",
            "XERROR, the SLATEC Error-handling Package.",
            "Algorithms for a Persistent Heap.",
            "CMS-A Chunk Management System.",
            "The Costs an Benefits of Lazy Interactive Input in Pascal.",
            "The SUPERMAC Macro Processor in Pascal.",
            "The Programming Language ACTUS.",
            "OPTIMA-A Portable PCODE Optimizer.",
            "Dynamic Distributed Systems.",
            "An Analysis of Microcomputer Implementation of Pascal.",
            "Exception Handling in C Programs.",
            "A System for Analysing Ada Programs at Run-time.",
            "Decision Tables.",
            "On the Realization of Extended Control Structures in FORTRAN.",
            "Comprehensive Tools for Assembler Construction.",
            "Syntax Directed Program Editing.",
            "Global Variables Versus Local Variables.",
            "Efficient Combination of Index Tables and Hashing.",
            "An Electronic Form System-An Experience in Prototyping.",
            "A Program Structuring Preprocessor for a Macro Assembly Language.",
            "The Implementation of Generators and Goal-directed Evaluation in Icon.",
            "On the Generation and Use of Space-filling Curves.",
            "Distributed Processing in a Small Office.",
            "The Myth of Virtual Memory.",
            "Introduction to Enhanced C (EC).",
            "Higher Level Programming and Data Abstractions-A Case Study Using Enhanced C.",
            "An Implementation of Algol 68 for a Small Computer.",
            "Access Path Query Language for Relational Database Systems.",
            "An Execution Profiler for Modular Programs.",
            "A Software Tool for Top-down Programming.",
            "An Integrated Verification and Testing Environment.",
            "Assembly Language as Object Code.",
            "The Real-Time Debugging Monitor for the Bell System 1A Processor.",
            "Simple Code Optimizations.",
            "A Simple Technique for Converting from a Pascal Shop to a C. Shop.",
            "Hierarchical Dialogue Structures in Interactive Computer Systems.",
            "Implementation of a Retrospective Tracing Facility.",
            "MIRA-3D: A Three-Dimensional Graphical Extension of Pascal.",
            "Implementing a Simulation Tool in a High-Level Language with no Multitasking Facilities.",
            "The Effect of Scope Delimiters on Program Comprehension.",
            "An Experimental COBOL Restructuring System.",
            "PIGS-A System for Programming with Interactive Graphical Support.",
            "A Sentence Generator for a Compiler for PT, a Pascal Subset.",
            "Tools: An Environment for Time-Shared Computing and Programming.",
            "On the Design of a Special-purpose Scientific Programming Language.",
            "Tools and Techniques for Teaching Microprocessor Software Development.",
            "Optimizing Procedure Calls and Returns.",
            "The Little META Translator Writing System.",
            "The Influence of Hardware and Software Considerations on the Design of Synchronous Parallel Algorithms.",
            "A Distributed Programming Assistant.",
            "An Assessment of the XR Project for Compiler Development and Transportation.",
            "An Optimizer for a Relational Database Command Language.",
            "Towards a Conversational Language-Sensitive System for Pascal.",
            "Software Tools for First-Order Logic.",
            "Incremental Back-up Procedures.",
            "Kernel for a Responsive and Graphical User Interface.",
            "Playing Cards on the PERQ: An Algorithm for Overlapping Rectangles.",
            "A Zilog Z8000 Disassembler.",
            "Real-time BASIC.",
            "DTL: A Language for the Design and Implementation of Concurrent Programs as Structured Networks.",
            "The Implementation of DTL.",
            "Building Syntax Graphs from Syntax Equations: A Case Study in Modular Programming.",
            "Syntax Driven COBOL Compilers-An Assessment.",
            "The New Mexico State University Ring-Star System: A Distributed UNIX Environment.",
            "The Necessity for Accurate Compiler-provided Routines when Evaluating Special Functions.",
            "Parallel Assignment Revisited.",
            "A Note on Space Filling Curves.",
            "FUMBLR: A Pascal Program for Initializin Memory."
        ]
    },
    {
        "name": "SPE",
        "year": "1982",
        "info": "Volume 12, 1982",
        "count": 90,
        "papers": [
            "PIC-A Language for Typesetting Graphics.",
            "Backtrack Search Algorithms and the Maximal Common Subgraph Problem.",
            "The Practicality of Text Signatures for Accelerating String Searching.",
            "A FORTRAN Implementation of Concurrent Pascal.",
            "A Comparison of Three String Matching Algorithms.",
            "The Syntax of Interactive Command Languages.",
            "Real-time Checkout: The 'Source Error First'.",
            "A Mainframe Implementation of Concurrent Pascal.",
            "'My System Gives Excellent Error Messages'-Or Does It?",
            "On the Performance of COBOL Programs in Large vs. Mini Computers.",
            "An Assessment of a New Technique for the Representation of Boolean Matrices.",
            "A Framework for Modelling Graphic Interactions.",
            "Uses of the SIMULA Process Concept.",
            "A Function for Generating Nearly Balanced Binary Search Trees from Sets or Non-random Keys.",
            "The Design and Implementation of Parametric Types in Pascal.",
            "Software Segmented Virtual Memory.",
            "A Contextual Analysis of Pascal Programs.",
            "Parsing an Extension to CODASYL FORTRAN DML.",
            "Pointer Variables in Concurrent Pascal.",
            "Message Passing Communication Versus Procedure Call Communication.",
            "The Transfer of a BCPL Compiler to the Z80 Microcomputer.",
            "A Programmable Text Editor.",
            "A Tool to Aid in the Installation of Complex Software Systems.",
            "Description of a Menu Creation and Interpretation System.",
            "Extending the Power of Pascal's External Procedure Mechanism.",
            "Meta: A Language System for Bitslice Applications.",
            "The Software Engineering of a Microcomputer Application System.",
            "The STAB Multiprocessing Environment for CYBA-M.",
            "A High-level Debugger for PL/I, Fortran and Basic.",
            "Triplex: A System for Interval Arithmetic.",
            "A Machine-Independent Linker.",
            "Exploiting Machine-Specific Pointer Operations in Abstract Machines.",
            "Design of a Simple Screen Editor.",
            "Two Examples of Block Structuring.",
            "Another Program for Drawing Diagrams.",
            "A Multiprogramming System for a Microcomputer.",
            "Implementation of a CORAL66 Programming Envieronment.",
            "Specifications.: Formal and Informal-A Case Study.",
            "A Multi-user Operating System for Transaction Processing, Written in Concurrent Pascal.",
            "Designing Structured Cobol Programs.",
            "An Alternative Approach to Arrays.",
            "A System to Assist Survey Analysts.",
            "A Design Medium for Software.",
            "A Test Data Synthesizer for Telephone Company Accounting Office Processing of Call Data.",
            "A Pattern Matching System.",
            "Experiences in Benchmarking for the Selection of an Interactive System.",
            "An Adaptive System for Dynamic Storage Allocation.",
            "Modelling and Validating the Man-Machine Interface.",
            "Optimizing Two-state Case Statements in Pascal.",
            "The Cambridge Ring and UNIX.",
            "The Design and Calibration of a Simulation Model of a Star Computer Network.",
            "A Programmable Text-editing System.",
            "The Syntax of User-defined Dyadic Operators.",
            "Verifying Abstract Data Types with SNOBOL4.",
            "HADES-A Command Environment that Supports Structure.",
            "The Kernel of the EMAS 2900 Operating System.",
            "Hash-Bucket Search: A Fast Technique for Searching an English Spelling Dictionary.",
            "A Unified Theory for Software Production.",
            "A Dialogue Generator.",
            "String Searching in Text Editors.",
            "The Distributed Programming Language SR-Mechanisms, Design and Implementation.",
            "A Microprogrammed P-CODE Interpreter for the Data General Eclipse S/130 Minicomputer.",
            "Low Cost Computer Graphics for Micro Computers.",
            "Computer System Simulation in Pascal.",
            "Computer-aided Production of Language Implementation Systems: A Review and Classification.",
            "A Case Study of Run-Time Errors in Pascal Programs.",
            "DASD Sharing in DOS/VSE.",
            "A Network Screen Editor Implementation.",
            "How to Improve Computer Advisory Services.",
            "Compilation of the Pascal Case Statement.",
            "A Rapid Lookup Table Method for Trigonometric Functions.",
            "Time Token Design Methodology.",
            "Immediate Turnround-An Elusive Goal.",
            "An Alternative to Young's Module Facility for Pascal.",
            "Executing Large Graphics Programs with a Small Computer.",
            "Modularity of Computer Languages.",
            "A Static Analysis of Pascal Program Structures.",
            "A Robust Distributed Solution to the Dining Philosophers Problem.",
            "Implementing a Compiler-Based Test Tool.",
            "A Machine-independent Approach to Microprogram Synthesis.",
            "An Experiment with the Interchangeability of Processes and Monitors.",
            "The Design and Implementation of a Code Generation Tool.",
            "A Costing Model for Software Conversions.",
            "A File Server for a Network of Low Cost Personal Microcomputers.",
            "The Flat File System FFG: A Database System Consisting of Primitives.",
            "Development Methodologies for Scientific Software.",
            "Meta-Assembly: A Fresh Assessment.",
            "On the Power of Traps and Diversions in a Document Preparation Language.",
            "An Overview of the Yale Gem System.",
            "The Newcastle Connection or UNIXes of the World Unite!"
        ]
    },
    {
        "name": "SPE",
        "year": "1981",
        "info": "Volume 11, 1981",
        "count": 85,
        "papers": [
            "A Comparison of Programming Languages for Software Engineering.",
            "A Graphical Pascal Extension Based on Graphical Types.",
            "Procedures for Managing Extendible Array Files.",
            "The LTPL-E Tasking Proposals.",
            "Short Algorithms for Space-Filling Curves.",
            "Software Cost Estimation.",
            "Forward-declared Procedures, Parameter-lists and Scope.",
            "'Long Return': A Technique for Improving the Efficiency of Inter-module Communication.",
            "A Case Study in Fault Tolerant Software.",
            "On the Access-control Mechanism of the Program Component Manager.",
            "Handling Type Information when Compiling a Language with User-defined Types.",
            "The Architecture of the PLAIN Data Base Handler.",
            "FORTRAN Routines with Optional Arguments.",
            "Editors: Two for the Price of One.",
            "DIALOG: A Scheme for the Quick and Effective Production of Interactive Applications Software.",
            "The Structure of the MARY/2 Compiler.",
            "A Modula Based Language Supporting Hierarchical Development and Verification.",
            "A Comparative Study of Task Communication in Ada.",
            "Linguistic Mechanisms for Resource Management Strategies.",
            "An Experience in Implementing Abstract Data Types.",
            "Edison-a Multiprocessor Language.",
            "The Design of Edison.",
            "Edison Programs.",
            "A Design Language for the Definition of a Retrieval System Interface for Casual Users of a Relational Database.",
            "Software Transferability: A Practical Approach.",
            "Message Passing Between Sequential Processes: the Reply Primitive and the Administrator Concept.",
            "CHEF: a Versatile Portable Text Editor.",
            "The Construction of a Portable Editor.",
            "An Experiment with Fortran and Pascal.",
            "Modularization of Large Programs.",
            "SCENARIOS: An Event Management Package.",
            "Software Engineering: An Example of Misuse.",
            "A Portable LISP Compiler.",
            "A Stable Quicksort.",
            "Error Reporting and Recovery in Sangrah.",
            "Uniform Syntax for Type Expressions and Declarators.",
            "How to Make Your Own Simulation System.",
            "Construction of a Peephole Optimizer.",
            "Formatted Programming Language.",
            "A New Fast and Safe Marking Algorithm.",
            "Considerations for the Design of Array Processing Languages.",
            "Partitioned and Prioritized Access to Timesharing Services: the Reserved Availability.",
            "Data Abstraction, Structured Programming, and the Practicing Programmer.",
            "Message Transport on the Cambridge Ring-A Simulation study.",
            "A Fortran to Pascal Translator.",
            "The Consequences of One's First Programming Language.",
            "A Note on the Multics Command Language.",
            "Recursion in Small Storage.",
            "Decision Tables in Algol 68.",
            "Parameter Passing Mechanisms and Run Time Data Structures.",
            "An Analysis/Synthesis Interface for Pascal Compilers.",
            "Designing Storage Management Schemes for Block-structured Languages.",
            "Eliminating Recursion from Combinatoric Procedures.",
            "COPAS-A Conversational Pascal System.",
            "Dynamic Program Building.",
            "MROS-68K, a Memory Resident Operating System for MC6800H.",
            "Is Block Structure Necessary?",
            "An Interactive Manager for Pascal Software.",
            "A Survey of some Text Editors.",
            "RNFREE-Keyword Free-format Input.",
            "Improving the Structure of Large Pascal Programs.",
            "The Implementation of Case Statements in Pascal.",
            "Design for a Robust, Simple and Highly Reliable Filestore.",
            "Dynamic Analysis of COBOL Programs.",
            "Interpretation Techniques.",
            "Full-screen Editing in a Hostile Environment.",
            "Document Preparation Systems.",
            "The Community File Station.",
            "Distributing Viewdata and Teletext Services to a User Community.",
            "Task Management in Ada-A Critical Evaluation for Real-time Multiprocessors.",
            "Experience with Software Conversion.",
            "Fortran 77 Portability.",
            "Breaking Paragraphs into Lines.",
            "Ancilla-A Server for the Cambridge Model Distributed System.",
            "Compiling Short-circuit Boolean Expressions in One Pass.",
            "A Communicating Sequential Process Language and Implementation.",
            "Dynamically Structured Data.",
            "Cheap Concurrent Programming.",
            "Files in an Interactive Environment.",
            "LCCD, A Language for Chinese Character Design.",
            "Design of a MUMPS Interpreter.",
            "Generalized non-Recursive Traversal of Binary Trees.",
            "Micro MUMPS: An Interactive Database Language for Micro-Computers.",
            "Experiences with a Status Database.",
            "Modular Programming with Pascal."
        ]
    },
    {
        "name": "SPE",
        "year": "1980",
        "info": "Volume 10, 1980",
        "count": 79,
        "papers": [
            "Linguistic Extension of Abstract Machine Modelling to Aid Software Development.",
            "A Semiblock Structure for Low-level Languages.",
            "A Heterogeneous Dual Processor.",
            "Debugging Methods in Recursive Structured FORTRAN.",
            "Benchmarking a Multi-access System.",
            "Development of the ZED Text Editor.",
            "A Space-efficient Code Generation Scheme for BCPL.",
            "Logic Programming and Compiler Writing.",
            "Leave and Recall: Primitives for Procedural Programming.",
            "Problems of Integrity and Distributed Databases.",
            "An Analysis of Pascal Programs in Compiler Writing.",
            "Multiple Precision Floatingpoint Computation in FORTRAN.",
            "PBASIC-A Verifier for BASIC.",
            "A Device Driver for Display Terminals.",
            "Coroutine Behaviour and Implementation.",
            "Implementation of Concurrent Pascal on LSI-11.",
            "A HELP System for the User Community.",
            "Comments on an Error-recovery Scheme by Hartmann.",
            "Modification of the Pascal-P Compiler for a Single-accumulator One-address Minicomputer.",
            "Programming by Successive Refinement of Data Abstractions.",
            "Design Considerations for Array Processing Languages.",
            "High Speed Data Acquisition: Running a Realtime Process and a Time-shared System (UNIX) Concurrently.",
            "Systems Programming for Data Communications on Minicomputers.",
            "Axioms for User-defined Operators.",
            "Domain Architecture and the ICL 2900 Series.",
            "Stabdump-A Dump Interpreter Program to Assist Debugging.",
            "NPP: An Easy to Implement Preprocessor for Text Formatting.",
            "Bibliographic Manipulation.",
            "A Data-directed Approach to Program Construction.",
            "If s and Then s: Is Nesting just for the Birds?",
            "UNIX with Satellite Processors.",
            "Code Generation with a Recursive Optimizer.",
            "Pattern Analysis as a Tool for Inventing Algorithms.",
            "A Portable Trace for the Pascal Heap.",
            "An Algol 68 Based Algebraic Manipulation System.",
            "SUPERMAC-A Macro Facility that can be Added to Existing Compilers.",
            "A Critical Comparison of Several Programming Language Implementations.",
            "Parallel Programming for Chess Endgame Database.",
            "A Portable Storage Management System for the Icon Programming Language.",
            "Practical Fast Searching in Strings.",
            "Variable Number of Parameters in Typed Languages.",
            "Checking Cyclic Pointers.",
            "Interrupts.",
            "Multiprogramming and Memory Contention.",
            "Pretty-Printing of Trees.",
            "SATHE: Some Aspects of an ALGOL Implementation.",
            "Page Replacement Algorithm for Large-array Manipulation.",
            "An Assessment of Modula.",
            "A Portable File Directory System.",
            "Interpretation and Code Generation Based on Intermediate Languages.",
            "Pascal for School and Hobby Use.",
            "Implementing BCPL on the Borroughs B6700.",
            "An Experiment in Parallel Program Design.",
            "A Simple Nucleus Written in Modula-2: A Case Study.",
            "The Standardization of RTL/2.",
            "A Process Oriented Simulation Model Specification and Documentation Language.",
            "RATMAC: A Preprocessor for Writing Portable Scientific Software.",
            "MM/1, A Man-Machine Interface.",
            "A Coroutine Mechanism for BCPL.",
            "Extension of Pascal by Coroutines and its Application to Quasi-parallel Programming and Simulation.",
            "Experiences with a Schematic Logic Preprocessor.",
            "The Design of an Inter-task Communication Scheme.",
            "Maintaining Program Variants by Merging Editor Scripts.",
            "An Algorithm for Programming Electrostatic Plotter Type Devices.",
            "Infinite Power Series.",
            "An Overview of Ada.",
            "FORALL: An Extensible Fortran System for Conversationally Accessing Subroutine Libraries.",
            "Compiler Testing using a Sentence Generator.",
            "University Computing Advisory Services: The Study of the Man-Computer Interface.",
            "Modified Petri Nets as Flowcharts for Recursive Program.",
            "The Trio Operating System.",
            "Microcomputers as Protective Interfaces in Computing Networks.",
            "Scanner Design.",
            "An Experimental Study of Relative Throughput in a Multiprocessor Computer System.",
            "A Viewdata Interface for Arbitrary Computer Programs.",
            "The Evolution of the Operating System EMAS 2900.",
            "Transportable Package Software.",
            "Pascal-P, Program STructure and Program Behaviour.",
            "A Case Study in Rapid Prototyping."
        ]
    },
    {
        "name": "SPE",
        "year": "1979",
        "info": "Volume 9, 1979",
        "count": 81,
        "papers": [
            "The UNIX/TM Programming Environment.",
            "How To Design and Implement Small Time-Sharing Systems Using Concurrent.",
            "A New Implementation Technique for Applicative Languages.",
            "Debugging Techniques.",
            "The NAG Library 'Machine'.",
            "A Support System for Interactive Languages.",
            "New Techniques for COBOL Programmers.",
            "A Fundamental Approach to Debugging.",
            "A Heap-based Implementation of the Programming Language Pascal.",
            "A Compact, Portable CRT-based Text Editor.",
            "Computer Programming and the Human Thought Process.",
            "Public Online Pool-A Method for Managing Online Direct Access Space.",
            "Programs as Higher Level Subroutines.",
            "A Compiler Model for a Relational Data Base Management System.",
            "Arbitrary Precision Artihmetic in Algol 68.",
            "Parallel Processing in an Adaptable Application Oriented Language Processor.",
            "A Formalization and Explication of the Michael Jackson Methofd of Program Design.",
            "MAP: A Pascal Macro Preprocessor for Large Program Development.",
            "Microcomputer Comparison.",
            "Unrolling Loops in FORTRAN.",
            "Long/Short Address Optimization in Assemblers.",
            "Non-recursive Top-down Syntax Analysis.",
            "Make-A Program for Maintaining Computer Programs.",
            "Awk-A Pattern Scanning and Processing Language.",
            "A Highly-structured Interpreter for a SNOBOL4 Subset.",
            "Design of Software for Text Composition.",
            "Design and Analysis of a Hyphenation Procedure.",
            "An Empirical Analysis of COBOL Programs.",
            "Organizing the Description of a Relational Data Base.",
            "Queueing Network Software for Systems Modelling.",
            "A Draft Description of Pascal.",
            "Pascal Scalars as State Indicators.",
            "Macros without Tears.",
            "Practice and Experience with BASIS: an Interactive Programming System for Introductory Courses in Informatics.",
            "A Useful Data-structuring Technique.",
            "Lattice Structure Segmentation of ALGOL-like Programs.",
            "A Message Distribution Technique and its Application to Network Control.",
            "TRIPOS-A Portable Operating System for Mini-computers.",
            "A Compact Function for Regular Expression Pattern Matching.",
            "A Software Trace Facility for OS/MVT.",
            "Implementing Data Abstraction Features in a Stackbased Language.",
            "Experience of Transporting and Using the SOLO Operating system.",
            "Resolving Ambiguous Identifiers.",
            "Choosing a Tag-list Algorithm for a Compiler with Special Application to the ALEPH Compiler.",
            "The Design of the MUSS Operating System.",
            "MUSS-The User Interface.",
            "MUSS-A Portable Operating System.",
            "The Portable Compiling Systems of MUSS.",
            "An Assessment of the MUSS Operating System.",
            "Strings and the Sequence Abstraction in Pascal.",
            "Should if...then...else... Follow the Dodo?",
            "Experiences with the UNIX Time-sharing System.",
            "On Publication Pascal.",
            "A Poor Man's Realization of Attribute Grammars.",
            "Synchronization under a Commercial Operating System.",
            "A Human-Computer Interface for Non-computer Specialists.",
            "Some Aspects of Concurrent Programmming in CCNPASCAL.",
            "Language Issues in the Implementation of a Kernel.",
            "Implementing Strings in Pascal.",
            "Data Metastructures.",
            "A Structure for Access Control Lists.",
            "Pascal Stylistics and Reserved Words.",
            "An Assessment of Concurrent Pascal.",
            "Implementing Strings in Pascal-Again.",
            "Assemblers for Microcomputers.",
            "Systems Implementation Languages and IRONMAN.",
            "Using Convert to Transform Source Code.",
            "MPLOT3-A System-independent Plotting Package.",
            "Input/Output in High Level Programming Languages.",
            "Miniscules and Majuscules.",
            "A Simple Technique for Controlled Communication Among Separately Compiled Modules.",
            "Sequence Error Recovery Considered Misleading.",
            "Implementation of a Special-purpose Language using Pascal Implementation Methodology.",
            "Pascal-Plus-Another Language for Modular Multiprogramming.",
            "A Campus Network Based on ICL 2900 Series Protocol.",
            "P-A Timesharing Operating System for Laboratory Automation.",
            "Overhead in FORTRAN Preprocessors.",
            "Concurrent Pascal with Backward Error Recovery: Language Features and Examples.",
            "Concurrent Pascal with Backward Error Recovery: Implementation.",
            "Translator Design to Support Run-time Debugging.",
            "The Implementation of Concurrency for a PL/I-like Language."
        ]
    },
    {
        "name": "SPE",
        "year": "1978",
        "info": "Volume 8, 1978",
        "count": 57,
        "papers": [
            "A Note on Computing Multiple Sums.",
            "The Calibration and Validation of a Hybrid Simulation/Regression Model of a Batch Computer System.",
            "Monitoring the Run-time Activity of Algol 68-R Programs.",
            "MOUSE4: An Improved Implementation of the RATFOR Preprocessor.",
            "An Exercise in the Transportation of an Operating System.",
            "The Formal Definition of Human/Machine Communications.",
            "Reliable Software: A Selective Annotated Bibliography.",
            "How I Fought with Hardware and Software and Succeeded.",
            "Economic Range Checks in Pascal.",
            "Error-checking Compilers and Portability.",
            "Event Associations in SNOBOL4 for Program Debugging.",
            "A Study of Machine-level Software Profile.",
            "The Use of a Procedure-oriented Language for Process-oriented Simulation.",
            "Self-compiling Compilers: An Appraisal of their Implementation and Portability.",
            "Rational Arithmetic for Minicomputers.",
            "Sequential Pascal with Recovery Blocks.",
            "CONVERT-A Language for Program and Data File Conversions.",
            "The Programming of Structural Relationships in Dynamic Environments.",
            "Programming Aids for the Teaching of Programming.",
            "SCRUB-Systematically Clean and Renumber Users BASIC.",
            "Job Scheduling in Multiprogrammed Computer Systems.",
            "Threaded Code for Laboratory Computers.",
            "An Effective Program Development Environment for BCPL on a Small Computer.",
            "Input/Output Facilities in LISP1.9.",
            "SLP: A Paged Processor for Compact Lists.",
            "Use and Misuse of SPSS.",
            "An Implementation of Structured Multiprogramming.",
            "Experiences with the Portability of Concurrent PASCAL.",
            "An Exercise in Program Design Using SIMULA Class Invariants.",
            "Structured Programming in Macro Assembly Languages.",
            "An Evaluation of the Effectiveness of Symbolic Testing.",
            "A Simplification of Code Tables in a One-pass PL/M Compiler.",
            "Unbounded Computational Structures.",
            "Improvement of Relocatable Linkage Editor (loader) Input.",
            "A 1900 FORTRAN  Post Mortem  Dump System.",
            "Another Look at Type Compatibility in Pascal.",
            "A Monitor for Small Computers.",
            "The Structure and Uses of the Edinburgh Remote Terminal Emulator.",
            "A Symbolic System for Computer-aided Development of Surface Interpolants.",
            "Data Mappings Again.",
            "Software Design Representation: A Case Study.",
            "Software Design Representation: Analysis and Improvement.",
            "Implementation of a Computer Job Scheduling Algorithm.",
            "User-interface Design for Text Editing.",
            "Scheduling for Immediate Turnround.",
            "Use of a Formal Notation for Static Semantics in Compiler Design.",
            "The Software Tools Project.",
            "Experience with the Universal Intermediate Language Janus.",
            "Experience with the Pascal P-Compiler.",
            "Introducing Graphics Capabilities to Several High-level Languages.",
            "A Highly Reliable File System which Supports Multiprocessing.",
            "Comparison of Different Disk Searching Methods.",
            "Guidelines for Software Portability.",
            "CONA-A Conversational Algol System.",
            "Design and Implementation of Data Abstraction Definition Facility.",
            "Reproducible Testing of Monitor.",
            "Embedding Semantics in LR Parser Tables."
        ]
    },
    {
        "name": "SPE",
        "year": "1977",
        "info": "Volume 7, 1977",
        "count": 63,
        "papers": [
            "Modula: a Language for Modular Multiprogramming.",
            "The Use of Modula.",
            "Design and Implementation of Modula.",
            "Interfacing the User.",
            "MACRO SPITBOL-a SNOBOL4 Compiler.",
            "The Implementation of Synchronizing Operations in Various Environment.",
            "The Design and Implementation of the NAG Master Library File System.",
            "Compaction of Diagnostic Messages for Compilers.",
            "On the Use of Integer Arithmetic to Achieve Confirmably Correct Computation.",
            "A Simulation Sequencing Algorithm.",
            "COMLNK-a File Transport and Job Entry Utility for a Communication Link.",
            "Storage Management for an Implementation of SNOBOL4.",
            "Does APL Really Need Run-time Parsing.",
            "Efficient Storage for Amorphous Data.",
            "Non-'Interpretive' FORTRAN Input/Output.",
            "Fooling the User of a Programming Language.",
            "A Non-general-purpose Operating System.",
            "A Fast Approximation to the Sine Function.",
            "Converting a Class of Recursive Procedures into Non-recursive Ones.",
            "A Graphical Notation for Describing System Implementation.",
            "PICTURES-68 MK1.",
            "Non-recursive Recursion.",
            "Exploiting the Least Recently Used Page Replacement Algorithm.",
            "Interpretation Control Using A Linear Tree Representation.",
            "Supporting the Structured Development of Complex PL/I Software Systems.",
            "Dynamic Analysis of Program Performance (DAP) in a Fortran Batch Environment.",
            "How to Call Procedures, or Secong Thoughts on Ackermann's Function.",
            "A Simple Network Interacting Program's Executive (SNIPE).",
            "The Advantages of Stream Output Procedures over Format-dominated Record Transmissions.",
            "Using Pascal in a Fortran Environment.",
            "Performance Analysis of Large Systems.",
            "The Systematic Design of File-processing Programs.",
            "Success and Failure Analysis of a Problem Solving System Implementation.",
            "On Code Generation in a PASCAL Compiler.",
            "Real-time BASIC for Laboratory Use.",
            "A Language for Inquiring about the Run-time Behaviour of Programs.",
            "Implementation Independent Arithmetic: Speculation for Discussion.",
            "Array Handling in Cobol Compilers.",
            "Structured Debugging Using a Domain Specific Language.",
            "Quasiparallel Tracing.",
            "Designing Overlay Structures.",
            "An Operating System for Interactive Terminals.",
            "Profiling a Large Program.",
            "More on the Re-creation of Source Code from Reverse Polish.",
            "Dimensional Flowcharting.",
            "A Set of Strategy-independent Restructuring Algorithms.",
            "EDIT-an Interactive Network Service; Design and Implementation.",
            "Hierarchical Monitors.",
            "RATSNO-An Experiment in Software Adaptability.",
            "SOBS-An Incremental BASIC System.",
            "Planning the Software for a Personal Research Contract.",
            "Sequential File Processing in Fortran.",
            "TOSI: A Tree Oriented String Interpreter for the Design and Implementation of Semantics.",
            "IDL: A Machine-independent Data Language.",
            "Ambiguities and Insecurities in Pascal.",
            "BASIC-An Evaluation of Processing Methods and a Study of some Programs.",
            "Implementing LISP in a High-level Language.",
            "Eliminate Flowchart Drawings.",
            "The Simulation and Use of a TABLE Data Type.",
            "MPL1700-A High(er)-level Microprogramming Language.",
            "Step to an Efficient Program for Floating-point Summation.",
            "Design and Implementation of a Display Oriented Text Editor.",
            "Some Aids for Program Documentation."
        ]
    },
    {
        "name": "SPE",
        "year": "1976",
        "info": "Volume 6, 1976",
        "count": 45,
        "papers": [
            "A New Programming Discipline.",
            "Postlude to a PASCAL-Compiler Bootstrap on a DECSystem-10.",
            "Computer System Resource Requirements of Novice Programming Students.",
            "Graph Plotting in ALGOL 68-R.",
            "Portability-Prediction and Correction.",
            "The Production of Special Function Routines for a Multi-Machine Library.",
            "Quick Compiler Construction Using Uniform Code Generators.",
            "A User-Oriented Approach to Control Languages.",
            "A PASCAL Compiler for PDP 11 Minicomputers.",
            "Cobol Generation of Source Programs and Reports.",
            "The Solo Operating System: A Concurrent Pascal Program.",
            "The Solo Operating System: Job Interface.",
            "The Solo Operating System: Processes, Monitors, and Classes.",
            "Disk Scheduling at Compile Time.",
            "Syntax-directed Correction of Syntax Errors.",
            "Multi-dimensional Summations in FORTRAN.",
            "Minivital: A Compiler Case Study.",
            "Application of Accounting Data in Evaluating Computer System Performance.",
            "Variable Association in SNOBOL4.",
            "JUMBO-A Demonstration Program to Illustrate the Use of BCPL in a Real-time Graphics Application Requiring Scaled Arithmetic.",
            "Testing ALGOL 60 Compilers.",
            "The Design and Implementation of an Interactive Document Editor.",
            "Software Malpractice-A Distasteful experience.",
            "Designing a FORTRAN Based System for Meteorological Statistics.",
            "Documentation for Computer Users.",
            "Quasiparallel Programming.",
            "Systematic Programming of Scheduling Algorithms.",
            "Implementation of a Pascal Compiler for the IBM 360.",
            "An Implementation of Monitors.",
            "Some Features of a Real-time BASIC Executive.",
            "Portability-Some Experiences with FORTRAN.",
            "Indexing with Codes Deltas-A Data Compaction Technique.",
            "Experience from the Standardization of the SIMULA Programming Language.",
            "Six PL/I Compilers.",
            "Throw-away Compiling.",
            "LEKTOR-A List-oriented, Machine-independent Programming System for Conversational Applications.",
            "Memoryless Execution: A Programmer's Viewpoint.",
            "DAVE-A Validation Error Detection and Documentation System for Fortran Programs.",
            "A Language-independent System to Aid the Development of Structured Programs.",
            "A Numerical Profile of Commercial PL/I Programs.",
            "Compiling Techniques to Exploit the Pattern of Language Use.",
            "Linking a CYBER76 to a 3600.",
            "A Review of Design Techniques for Programs and Data.",
            "The Viscom-A System of 'Soft' Video-terminals.",
            "The Second Law of Debugging."
        ]
    },
    {
        "name": "SPE",
        "year": "1975",
        "info": "Volume 5, 1975",
        "count": 29,
        "papers": [
            "DSOS-A Skeletal, Real-Time, Minicomputer Operating System.",
            "An In-Core Batching Standard FORTRAN Compiler for Large ICL 1900 Machine.",
            "Scheduling for a Share of the Machine.",
            "Solving Synchronization Problems using Semaphores.",
            "Parallel Processing in FORTRAN with Floating-Point Hardware.",
            "A High-Level Job Control Language.",
            "A Technique for Evaluation of User Systems on an IBM S/370.",
            "A Portable Diagnostic Facility for SNOBOL4.",
            "Gathering Run-Time Statistics Without Black Magic.",
            "Two Simple Windowing Algorithms.",
            "The Translation and Interpretation of STAB-12.",
            "Debugging Other Languages in APL.",
            "The Design of a Real-Time Operating System for a Minicomputer. Part 1.",
            "Experience with a Conversational Parser Generating System.",
            "A General-Purpose Software Measurement Tool.",
            "An Overview of a System for Automatic Generation of File Conversion Programs.",
            "Development of an Advanced Satellite System.",
            "Embedding Non-determinism.",
            "Writing Algorithms in ALGOL 60.",
            "A Multiprogramming Nucleus with Dynamic Resource Facilities.",
            "A Transportable Extendable Compiler.",
            "Discrete Event Simulation in ALGOL 68.",
            "Hints on Distributing Portable Software.",
            "Towards the Design of Secure Systems.",
            "Evaluation of Markov Program Models in Virtual Memory Systems.",
            "Simple Transforms for Instrumenting FORTRAN Decks.",
            "BIOMAC: Block Structured Programming Using PDB-11 Assembler Language.",
            "Recent Developments in Machine-Independent Job Control Languages.",
            "RATFOR-A Preprocessor for a Rational Fortran."
        ]
    },
    {
        "name": "SPE",
        "year": "1974",
        "info": "Volume 4, 1974",
        "count": 35,
        "papers": [
            "The Mobile Programming System, Janus.",
            "Workload Characterization for Timesharing System Selection.",
            "User-Like Executives.",
            "Optimization of Structured Programs.",
            "The Myth of Multiprogramming.",
            "A General Purpose Task Queueing Mechanism for Small Machines.",
            "A Simple Interactive Graphics Facility.",
            "The Systems Programming Language, Malus.",
            "Design and Implementation of an Interactive Test Bed.",
            "Handling Asynchronous Interrupts in a PL/1-like Language.",
            "Virtual Storage on ICL 1900's.",
            "Does APL Really Need Run-time Checking?",
            "Writing Software in ALGOL.",
            "A Mixed Language System POP-2 and FORTRAN.",
            "Dynamic Data Structure Mapping.",
            "A Software Teletype Exchange.",
            "Implementation of a Management Game.",
            "The Definition of Comments in Programming Languages.",
            "A Note on Deleting Trailing Blanks.",
            "An Exercise in Resource Allocation.",
            "A Storage Mapping Technique for the Implementation of Protective Domains.",
            "On a Loose Communication Between Dissimilar CDC6000 Operating Systems.",
            "Heuristic Procedures (If They Work-Leave Them Alone).",
            "Some Statistics on the Reasons for Compiler.",
            "Random Search on the 8-Queens Problem.",
            "Use of a Software Monitor in the Validation of an Analytic Computer System Model.",
            "POP-2 Performance on a Small 1900 Machine.",
            "Rapid Calculations of Subscripted Array Addresses.",
            "Implementation of a Graphics and Test Output Retrieval System.",
            "Notes on the case Statement.",
            "The University of Warwick Modular One Operating System.",
            "New Format for Flowcharts.",
            "The PFORT Verifier.",
            "List Structures in SIMULA and PL/1-a Comparison.",
            "A General-Purpose Text Editor for OS/360."
        ]
    },
    {
        "name": "SPE",
        "year": "1973",
        "info": "Volume 3, 1973",
        "count": 31,
        "papers": [
            "Polynomial Search.",
            "FORTRAN-As Provided by Some Major Machine Manufacturers in 1970.",
            "Babel and SOAP, Applications for Extensible Compilers.",
            "AEDBAR-A Software System for Designing and Analysing Planar Bar Mechanisms.",
            "A Multi-Terminal Benchmark.",
            "Two Unusual Methods for Debugging System Software.",
            "Design of an Interactive Debugger for FORTRAN:MANTIS.",
            "A Sampling Monitor for Applications Programs.",
            "Serious FORTRAN.",
            "The People's Time Sharing System.",
            "PENDANT-A Computerized Support to Program Modularity under Limited Memory Conditions.",
            "Testing a Multiprogramming System.",
            "A Note on Recreating Source Code from the Reverse Polish Form.",
            "Writing a Roll-out-Roll-in Facility for Small Machines.",
            "An Analysis of the Loop Optimization Scores in Knuth's 'Empirical Study of FORTRAN Programs'.",
            "Statistics for FORTRAN Identifiers and Scatter Storage Techniques.",
            "Improving the Efficiency of Direct-Memory-Access Output Operations.",
            "Serious FORTRAN-Part 2.",
            "A Pre-processor using Rule Mask Techniques for Extended Entry Decision Tables.",
            "Bootstrapping XPL to an XDS Sigma 5 Computer.",
            "Aspects of Reference Locality in List Structures in Virtual Memory.",
            "The MISSTRESS User's Book.",
            "A Portable Language for System Development.",
            "The Cambridge Multiple-Access System in Retrospect.",
            "Two Examples of Virtual Records.",
            "On Evaluating Boolean Expressions.",
            "Buffering for Sustained, High Speed Transfers.",
            "A Universal Benchmark?",
            "A High Level Plotting System.",
            "MUSYS. Software for an Electronic Music Studio.",
            "APET-A Versatile Tool for Estimating Computer Application Performance."
        ]
    },
    {
        "name": "SPE",
        "year": "1972",
        "info": "Volume 2, 1972",
        "count": 29,
        "papers": [
            "Practical Experience with ALGOL 68.",
            "MAPLIB-A Data Bank of FORTRAN Functions describing Material Properties.",
            "A Display Package for CAD of Control Systems.",
            "Some Techniques in Multi-Computer System Software Design.",
            "A Resource-Oriented Time-Sharing Monitor.",
            "A PASCAL Compiler for ICL 1900 Series Computers.",
            "Control of Queues in a Permissive Siciety.",
            "Abstract Machine Modelling to Produce Portable Software - A Review and Evaluation.",
            "The Implementation.",
            "The Evolution of Job Control Languages.",
            "Programming and Compiling Strategies for Paging Systems.",
            "A High Speed Computer-to-Computer Data Link.",
            "Debugging Tools for High Level Languages.",
            "A Format Editor.",
            "An Implementation of Phrase Structures in ALGOL.",
            "A Note on Internal Merging.",
            "SOLO-System for On-Line Optimization.",
            "Generation of Interactive Displays from FORTRAN using the PDP-10/LSD-1 Computer Graphics System.",
            "Re-creation of Source Code from Reverse Polish Form.",
            "A Notation Describing Corrections in Files.",
            "A Failure Tolerant Filing System.",
            "What Was, What Is and What Should Have Been. A Critical Evaluation of the Chilton Multi-Access System.",
            "An Extension of FORTRAN Containing Finite Difference Operators.",
            "PIT: A Macro-implemented Implementation Language.",
            "Diagnostic Messages.",
            "Intraprogram Documentation.",
            "RAINBOW - A Multi-Purpose CAD System.",
            "CDC 6000-Series Register Save/Restore.",
            "An On-Line Data Collection System for Film Measurement."
        ]
    },
    {
        "name": "SPE",
        "year": "1971",
        "info": "Volume 1, 1971",
        "count": 28,
        "papers": [
            "A Software Architecture for the 70's: Part I - The General Approach.",
            "Developing a Multi-Access System Online.",
            "Installing an ASP System.",
            "An ALGOL-like Assembly Language for a Small Computer.",
            "A Design for a Text Editor.",
            "A Planar Graph Drawing Program.",
            "A Note on Radix Conversion for Integers.",
            "An Empirical Study of FORTRAN Programs.",
            "The Portability of the BCPL Compiler.",
            "Documentation and the Management of a Software Project - A Case Study.",
            "A MACRO Facility for Interactive Display.",
            "Software Engineering Techniques used in the Development of the Cambridge Multiple-Access System.",
            "Some Improvements to the MINIMOP Multi-Access Operating System.",
            "The Design of the Internal Structure of the ICL GEORGE 3 Operating System.",
            "Simulating a Small Machine for Teaching Purposes.",
            "Answering Datel Telephone Calls by PDP-8.",
            "A Second-Order Bug with Delayed Effect.",
            "An On-Line Retail Collection Data System.",
            "Modularity. The Key to System Growth Potential.",
            "The Evolution of a Graphics System for Linked Computers.",
            "The Kent On-Line System.",
            "Development of Scheduling Strategies in the Titan Supervisor.",
            "The Design of a PASCAL Compiler.",
            "The Design and Inplementation of the GINO 3D Graphics Software Package.",
            "Some Comments on the Portability of a Large ALGOL Program - The Implementation of SID on KDF9.",
            "Implementation of an Editing Algorithm Allowing Repeating Corrections.",
            "Monitoring the Operation of System Software.",
            "TALK-An Interactive System for a Small Computer."
        ]
    }
]