[
    {
        "name": "SQJ",
        "year": "2021",
        "info": "Volume 29: 2021",
        "count": 27,
        "papers": [
            "Test-driven development with mutation testing - an experimental study.",
            "Challenges concerning test case specifications in automotive software testing: assessment of frequency and criticality.",
            "Does maintainability relate to the energy consumption of software? A case study.",
            "Exposing bugs in JavaScript engines through test transplantation and differential testing.",
            "An empirical study on the effect of community smells on bug prediction.",
            "Quality of information and communication technology introduction.",
            "Exploratory study of the impact of project domain and size category on the detection of the God class design smell.",
            "Reconciliation of scrum and the project management process of the ISO/IEC 29110 standard-Entry profile - an experimental evaluation through usability measures.",
            "Empirical validation of a quality framework for evaluating modelling languages in MDE environments.",
            "Empirical analysis on productivity prediction and locality for use case points method.",
            "Scrum metaprocess: a process line approach for customizing Scrum.",
            "UI Test case prioritization on an industrial setting: A search for the best criteria.",
            "MHCPDP: multi-source heterogeneous cross-project defect prediction via multi-source transfer learning and autoencoder.",
            "A hierarchical model for quantifying software security based on static analysis alerts and software metrics.",
            "An improved text classification modelling approach to identify security messages in heterogeneous projects.",
            "A survey on runtime testing of dynamically adaptable and distributed systems.",
            "Preface to the special issue on improving software quality through program analysis.",
            "Model-based test case generation from UML sequence diagrams using extended finite state machines.",
            "Verification supported refactoring of embedded sql.",
            "Classification of application reviews into software maintenance tasks using data mining techniques.",
            "Reductions and abstractions for formal verification of distributed round-based algorithms.",
            "Test input generation from cause-effect graphs.",
            "Application of the OIRE method - tool support and initial feedback from two chinese companies.",
            "Corrective commit probability: a measure of the effort invested in bug fixing.",
            "Copula-based software metrics aggregation.",
            "A longitudinal exploratory study on code smells in server side web applications.",
            "Dynamic test prioritization of product lines: An application on configurable simulation models."
        ]
    },
    {
        "name": "SQJ",
        "year": "2020",
        "info": "Volume 28: 2020",
        "count": 68,
        "papers": [
            "In this issue.",
            "Guest editorial: special issue on modeling and mitigation techniques for software aging.",
            "A survey on software aging and rejuvenation in the cloud.",
            "Cross-project bug type prediction based on transfer learning.",
            "Availability and reliability modeling of VM migration as rejuvenation on a system under varying workload.",
            "Software aging and rejuvenation in android: new models and metrics.",
            "An empirical study of factors affecting cross-project aging-related bug prediction with TLAP.",
            "On the performance of software rejuvenation models with multiple degradation levels.",
            "A transient interval reliability analysis for software rejuvenation models with phase expansion.",
            "Invalid bug reports complicate the software aging situation.",
            "Anti-aging analysis for software reliability design modes in the context of single-event effect.",
            "Advances in test automation for software with special focus on artificial intelligence and machine learning.",
            "XACMET: XACML Testing & Modeling.",
            "Virtualization of stateful services via machine learning.",
            "Planning-based security testing of web applications with attack grammars.",
            "Sentinel: generating GUI tests for sensor leaks in Android and Android wear apps.",
            "In this issue.",
            "Increasing validity through replication: an illustrative TDD case.",
            "Enhanced regression testing technique for agile software development and continuous integration strategies.",
            "What are the characteristics of popular APIs? A large-scale study on Java, Android, and 165 libraries.",
            "Automatic software refactoring: a systematic literature review.",
            "Special issue on software quality of advanced software applications.",
            "Quality attribute trade-offs in the embedded systems industry: an exploratory case study.",
            "A model-driven engineering approach for supporting questionnaire-based gap analysis processes through application lifecycle management systems.",
            "Component attributes and their importance in decisions and component selection.",
            "An automated approach to assess the similarity of GitHub repositories.",
            "Mining Association Rules from Code (MARC) to support legacy software management.",
            "A systematic mapping study on best practices for domain-specific modeling.",
            "Preface to the special section on improving software quality through formal methods.",
            "Verifying temporal specifications of Java programs.",
            "Runtime verification of real-time event streams under non-synchronized arrival.",
            "Model generation of component-based systems.",
            "Special section on testing and repair for software engineering technologies and applications.",
            "Improving dynamic domain reduction test data generation method by Euler/Venn reasoning system.",
            "Extending symbolic execution for automated testing of stored procedures.",
            "In This Issue.",
            "Special issue on quality management for information systems.",
            "Using the IDEAL model for the construction of a deployment framework of IT Service Desks at the Brazilian Federal Institutes of Education.",
            "Data-driven and tool-supported elicitation of quality requirements in agile companies.",
            "Assessing data cybersecurity using ISO/IEC 25012.",
            "Integrating security and privacy in software development.",
            "Towards a software quality certification of master data-based applications.",
            "Measuring data credibility and medical coding: a case study using a nationwide Portuguese inpatient database.",
            "Code smell detection using multi-label classification approach.",
            "Specification and use of concern metrics for supporting modularity-oriented modernizations.",
            "Two experiments for evaluating the impact of Hamcrest and AssertJ on assertion development.",
            "RETORCH: an approach for resource-aware orchestration of end-to-end test cases.",
            "Test case generation based on mutations over user execution traces.",
            "Guest Editorial: Special issue on quality of adaptive software systems.",
            "An adaptive system for autonomous driving.",
            "A preliminary analysis of self-adaptive systems according to different issues.",
            "Time-aware selection approach for service composition based on pruning and improvement techniques.",
            "QoS monitor as a service.",
            "Scen@rist: an approach for verifying self-adaptive systems using runtime scenarios.",
            "Testing adaptation policies for software components.",
            "HSACMA: a hierarchical scalable adaptive cloud monitoring architecture.",
            "In this issue.",
            "The effect of Bellwether analysis on software vulnerability severity prediction models.",
            "A public unified bug dataset for java and its assessment regarding metrics and bug prediction.",
            "A classification and systematic review of product line feature model defects.",
            "Predicting technical debt from commit contents: reproduction and extension with automated feature selection.",
            "An empirical study on predictability of software maintainability using imbalanced data.",
            "What lies behind requirements? A quality assessment of statement grounds in requirements elicitation.",
            "Application of machine learning techniques to the flexible assessment and improvement of requirements quality.",
            "Characteristics that affect preference of decision models for asset selection: an industrial questionnaire survey.",
            "Editor's note.",
            "Towards supporting software assurance assessments by detecting security patterns.",
            "ER2C SDMLC: enterprise release risk-centric systems development and maintenance life cycle."
        ]
    },
    {
        "name": "SQJ",
        "year": "2019",
        "info": "Volume 27: 2019",
        "count": 52,
        "papers": [
            "In this issue.",
            "A study examining relationships between micro patterns and security vulnerabilities.",
            "A vector table model-based systematic analysis of spectral fault localization techniques.",
            "Code coverage differences of Java bytecode and source code instrumentation tools.",
            "Comprehensibility of system models during test design: a controlled experiment comparing UML activity diagrams and state machines.",
            "Automated functional testing of mobile applications: a systematic mapping study.",
            "Usability improvement through A/B testing and refactoring.",
            "Exploring the suitability of source code metrics for indicating architectural inconsistencies.",
            "On the proposal and evaluation of a benchmark-based threshold derivation method.",
            "Modeling variability in the video domain: language and experience report.",
            "Comparison of the FMEA and STPA safety analysis methods-a case study.",
            "FLEX-RCA: a lean-based method for root cause analysis in software process improvement.",
            "Correlation of critical success factors with success of software projects: an empirical investigation.",
            "In this issue.",
            "Guest Editorial: Special issue on Testing Software and Systems.",
            "Fault model-driven testing from FSM with symbolic inputs.",
            "Fault-based refinement-testing for CSP.",
            "n-Complete test suites for IOCO.",
            "Safety-complete test suites.",
            "Testing self-healing cyber-physical systems under uncertainty: a fragility-oriented approach.",
            "FSM inference and checking sequence construction are two sides of the same coin.",
            "An approach for guiding developers in the choice of security solutions and in the generation of concrete test cases.",
            "Testing TLS using planning-based combinatorial methods and execution framework.",
            "Virtual machine placement quality estimation in cloud infrastructures using integer linear programming.",
            "Learning and statistical model checking of system response times.",
            "Differences between a static and a dynamic test-to-code traceability recovery method.",
            "Coverage-based quality metric of mutation operators for test suite improvement.",
            "Automatically learning usage behavior and generating event sequences for black-box testing of reactive systems.",
            "Test descriptions with ETSI TDL.",
            "In this issue.",
            "Special issue on trustworthy systems and software.",
            "A new weighted naive Bayes method based on information diffusion for software defect prediction.",
            "API trustworthiness: an ontological approach for software library adoption.",
            "A minimization algorithm for automata generated fault trees with priority gates.",
            "CVSkSA: cross-architecture vulnerability search in firmware based on kNN-SVM and attributed control flow graph.",
            "Software Design Smell Detection: a systematic mapping study.",
            "Risk factors in software development projects: a systematic literature review.",
            "To var or not to var: how do C# developers use and misuse implicit and explicit typing?",
            "Assisting software engineering students in analyzing their performance in software development.",
            "A method to evaluate quality of modelling languages based on the Zachman reference taxonomy.",
            "A large-scale empirical study of code smells in JavaScript projects.",
            "Structured information in bug report descriptions - influence on IR-based bug localization and developers.",
            "Classifying generated white-box tests: an exploratory study.",
            "In this issue.",
            "An efficient regression testing approach for PHP Web applications using test selection and reusable constraints.",
            "A partial oracle for uniformity statistics.",
            "The skills that employers look for in software testers.",
            "Pieces of contextual information suitable for predicting co-changes? An empirical study.",
            "Analysis and measurement of internal usability metrics through code annotations.",
            "Quality-centric security pattern mutations.",
            "Variation of risk profile across software life cycle in IS outsourcing.",
            "Algorithms for estimating truck factors: a comparative study."
        ]
    },
    {
        "name": "SQJ",
        "year": "2018",
        "info": "Volume 26: 2018",
        "count": 57,
        "papers": [
            "In this issue.",
            "Fail-safe testing of safety-critical systems: a case study and efficiency analysis.",
            "Predicting failures in agile software development through data analytics.",
            "Towards automation of IT systems repairs.",
            "Tackling class overlap and imbalance problems in software defect prediction.",
            "A systematic literature review on quality criteria for agile requirements specifications.",
            "How do developers react to API evolution? A large-scale empirical study.",
            "In this issue.",
            "Multi-device coverage testing of mobile applications.",
            "A model for estimating change propagation in software.",
            "Round-trip engineering with the Two-Tier Programming Toolkit.",
            "The influence of cyclomatic complexity distribution on the understandability of xtUML models.",
            "Recognising object-oriented software design quality: a practitioner-based questionnaire survey.",
            "Evaluating perceived and estimated data quality for Web 2.0 applications: a gap analysis.",
            "The effect of requests for user feedback on Quality of Experience.",
            "Semantic languages for developing correct language translations.",
            "Estimating software robustness in relation to input validation vulnerabilities using Bayesian networks.",
            "Investigating relationships between functional coupling and the energy efficiency of embedded software.",
            "Guest editorial: special issue on predictive models for software quality.",
            "Software defect prediction: do different classifiers find the same defects?",
            "An empirical study of crash-inducing commits in Mozilla Firefox.",
            "Stability prediction of the software requirements specification.",
            "Towards improving decision making and estimating the value of decisions in value-based software engineering: the VALUE framework.",
            "Special issue on \"software quality in software-intensive systems\".",
            "Architecture optimization: speed or accuracy? both!",
            "Considerations about quality in model-driven engineering - Current state and challenges.",
            "Coherence of comments and method implementations: a dataset and an empirical investigation.",
            "Challenges of software process and product quality improvement: catalyzing defect root-cause investigation by process enactment data analysis.",
            "Integrating software quality models into risk-based testing.",
            "In this issue.",
            "Guest editorial: special issue on concurrent software quality.",
            "A systematic survey on automated concurrency bug detection, exposing, avoidance, and fixing techniques.",
            "A survey on dynamic mobile malware detection.",
            "Contributions for the structural testing of multithreaded programs: coverage criteria, testing tool, and experimental evaluation.",
            "Asynchronous multi-process timed automata.",
            "A fault tolerant election-based deadlock detection algorithm in distributed systems.",
            "Detecting potential deadlocks through change impact analysis.",
            "System-level attacks against android by exploiting asynchronous programming.",
            "A multi-aspect online tuning framework for HPC applications.",
            "Performance tuning for actor programs through decoupled concurrency.",
            "Dynamic structure measurement for distributed software.",
            "Cooperative decoupled processes.",
            "In this issue.",
            "An investigation of the fault-proneness of clone evolutionary patterns.",
            "A tour of secure software engineering solutions for connected vehicles.",
            "Towards certified open data in digital service ecosystems.",
            "Application of mutual information-based sequential feature selection to ISBSG mixed data.",
            "Model-based testing for software safety: a systematic mapping study.",
            "A mapping study on testing non-testable systems.",
            "Special issue on automation of software testing: improving practical applicability.",
            "Similarity-based prioritization of test case automation.",
            "Test case prioritization techniques for model-based testing: a replicated study.",
            "Automated testing of DSL implementations - experiences from building mbeddr.",
            "Model extraction and test generation from JUnit test suites.",
            "Mobile GUI testing.",
            "An assessment of operational coverage as both an adequacy and a selection criterion for operational profile based testing.",
            "Correction to: Towards improving decision making and estimating the value of decisions in value-based software engineering: the VALUE framework."
        ]
    },
    {
        "name": "SQJ",
        "year": "2017",
        "info": "Volume 25: 2017",
        "count": 46,
        "papers": [
            "In this issue.",
            "Special issue on program debugging.",
            "Efficient and scalable omniscient debugging for model transformations.",
            "10 Years of research on debugging concurrent and multicore software: a systematic mapping study.",
            "Studying the advancement in debugging practice of professional software developers.",
            "Reproducing failures based on semiformal failure scenario descriptions.",
            "Effective software fault localization using predicted execution results.",
            "Fault localization for automated program repair: effectiveness, performance, repair correctness.",
            "A declarative framework for stateful analysis of execution traces.",
            "Special section on realizing artificial intelligence synergies in software engineering.",
            "A transfer cost-sensitive boosting approach for cross-project defect prediction.",
            "A systematic literature review on the applications of Bayesian networks to predict software quality.",
            "Supporting comprehension of unfamiliar programs by modeling cues.",
            "In this issue.",
            "Test-Driven Development in scientific software: a survey.",
            "H-Switch Cover: a new test criterion to generate test case from finite state machines.",
            "Testing of model-driven development applications.",
            "Analysis of service diagnosis improvement through increased monitoring granularity.",
            "Multi-view refactoring of class and activity diagrams using a multi-objective evolutionary algorithm.",
            "Quantitative risk analysis of safety-critical embedded systems.",
            "Multi-objective code-smells detection using good and bad design examples.",
            "Availability analysis of software architecture decomposition alternatives for local recovery.",
            "Impact of customization over software quality in ERP projects: an empirical study.",
            "In this issue.",
            "Toward automatically quantifying the impact of a change in systems.",
            "Investigating the relation between lexical smells and change- and fault-proneness: an empirical study.",
            "A model-based framework encompassing a complete workflow from specification until validation of timing requirements in embedded software systems.",
            "State-based models in regression test suite prioritization.",
            "Quality characteristics and measures for human-computer interaction evaluation in ubiquitous systems.",
            "The central role of test automation in software quality assurance.",
            "Separating passing and failing test executions by clustering anomalies.",
            "Application of metamorphic testing monitored by test adequacy in a Monte Carlo simulation program.",
            "Does choice of mutation tool matter?",
            "A large-scale study of call graph-based impact prediction using mutation testing.",
            "An empirical study on the effects of code visibility on program testability.",
            "Automated refinement of models for model-based testing using exploratory testing.",
            "APOGEN: automatic page object generator for web testing.",
            "Automatic generation of test system instances for configurable cyber-physical systems.",
            "In this issue.",
            "Special issue on collaboration in software testing between industry and academia.",
            "Industry-academia collaborations in software testing: experience and success stories from Canada and Turkey.",
            "Toward the characterization of software testing practices in South America: looking at Brazil and Uruguay.",
            "Model-based testing of digital TVs: an industry-as-laboratory approach.",
            "Test case selection in industry: an analysis of issues related to static approaches.",
            "Onboarding inexperienced developers: struggles and perceptions regarding automated testing.",
            "SERP-test: a taxonomy for supporting industry-academia communication."
        ]
    },
    {
        "name": "SQJ",
        "year": "2016",
        "info": "Volume 24: 2016",
        "count": 41,
        "papers": [
            "In this issue.",
            "Special issue on High Assurance Systems Engineering.",
            "Finding fault with fault injection: an empirical exploration of distortion in fault injection experiments.",
            "Accelerating temporal verification of Simulink diagrams using satisfiability modulo theories.",
            "Toward high assurance software systems with adaptive fault management.",
            "Experiences with software-based soft-error mitigation using AN codes.",
            "Certifying a java type resolution function using program transformation, annotation, and reflection.",
            "Normalizing variations in feature vector structure in keystroke dynamics authentication systems.",
            "Assessing vulnerability exploitability risk using software properties.",
            "In this issue.",
            "The COCA quality model for user documentation.",
            "Beauty and the Beast: on the readability of object-oriented example programs.",
            "Software quality improvement: a model based on managing factors impacting software quality.",
            "A survey on quality attributes in service-based systems.",
            "A model-driven approach for usability engineering of interactive systems.",
            "Adoption and use of cloud-based testing in practice.",
            "Testing variability-intensive systems using automated analysis: an application to Android.",
            "Analysis of distance functions for similarity-based test suite reduction in the context of model-based testing.",
            "Prioritizing agile benefits and limitations in relation to practice usage.",
            "In this issue.",
            "Special issue on software and service improvement in the scope of SMEs.",
            "A research framework for building SPI proposals in small organizations: the COMPETISOFT experience.",
            "Risk orientation in software testing processes of small and medium enterprises: an exploratory and comparative study.",
            "Understanding the gap between software process practices and actual practice in very small companies.",
            "Model-driven development of high-assurance active medical devices.",
            "Special issue on quality in model-driven engineering.",
            "Quality in model-driven engineering: a tertiary study.",
            "Ontology-based automated support for goal-use case model analysis.",
            "Staged model evolution and proactive quality guidance for model libraries.",
            "Comparison of a textual versus a graphical notation for the maintainability of MDE domain models: an empirical pilot study.",
            "Measuring the complexity of domain-specific languages developed using MDD.",
            "A systematic approach to evaluating domain-specific modeling language environments for multi-agent systems.",
            "Assessing and improving quality of QVTo model transformations.",
            "Timing consistency checking for UML/MARTE behavioral models.",
            "In this issue.",
            "Special section on software clones.",
            "A comparative study on the intensity and harmfulness of late propagation in near-miss code clones.",
            "Clone detection in MATLAB Stateflow models.",
            "On the use of design defect examples to detect model refactoring opportunities.",
            "A quantitative analysis of the unit verification perspective on fault distributions in complex software systems: an operational replication.",
            "Software SMEs' unofficial readiness for CMMI®-based software process improvement."
        ]
    },
    {
        "name": "SQJ",
        "year": "2015",
        "info": "Volume 23: 2015",
        "count": 30,
        "papers": [
            "In this issue.",
            "Automating test-based inspection of design models.",
            "Security quality model: an extension of Dromey's model.",
            "A method for predicting open source software residual defects.",
            "Guest editorial: Special section: Software quality and maintainability.",
            "Investigating the effect of evolution and refactorings on feature scattering.",
            "Eclipse API usage: the good and the bad.",
            "A declarative approach for Java code instrumentation.",
            "PBCOV: a property-based coverage criterion.",
            "In this issue.",
            "Predicting defective modules in different test phases.",
            "Exploring fault types, detection activities, and failure severity in an evolving safety-critical software system.",
            "Reducing software defects removal cost via design of experiments using Taguchi approach.",
            "Using constraints to diagnose faulty spreadsheets.",
            "Prioritizing code-smells correction tasks using chemical reaction optimization.",
            "A quality cost reduction model for large-scale software development.",
            "In this issue.",
            "Which process metrics can significantly improve defect prediction models? An empirical study.",
            "Fault domain-based testing in imperfect situations: a heuristic approach and case studies.",
            "Functionality-based software packaging using sequence diagrams.",
            "Special section: software quality for mobile apps.",
            "Studying the relationship between source code quality and mobile platform dependence.",
            "The fine art of user-centered software development.",
            "In this issue.",
            "Handover of managerial responsibilities in global software development: a case study of source code evolution and quality.",
            "An experience-based framework for evaluating alignment of software quality goals.",
            "A framework and tool to manage Cloud Computing service quality.",
            "Software quality construction in 11 companies: an empirical study using the grounded theory.",
            "Spoiled patterns: how to extend the GoF.",
            "Empirical analysis of factors affecting confirmation bias levels of software engineers."
        ]
    },
    {
        "name": "SQJ",
        "year": "2014",
        "info": "Volume 22: 2014",
        "count": 33,
        "papers": [
            "In this issue.",
            "Project managers in global software development teams: a study of the effects on productivity and performance.",
            "Critical success factors taxonomy for software process deployment.",
            "Special issue on realizing artificial intelligence synergies in software engineering.",
            "Prediction of faults-slip-through in large software projects: an empirical evaluation.",
            "KBRE: a framework for knowledge-based requirements engineering.",
            "From requirements to UML models and back: how automatic processing of text can support requirements engineering.",
            "In this issue.",
            "Applying black-box testing to UML/OCL database models.",
            "Using aspects for testing of embedded software: experiences from two industrial case studies.",
            "Equivalence hypothesis testing in experimental software engineering.",
            "Toward a mature industrial practice of software test automation.",
            "Testing of PolPA-based usage control systems.",
            "Tailoring video recording to support efficient GUI testing and debugging.",
            "BlackHorse: creating smart test cases from brittle recorded tests.",
            "Software testing with code-based test generators: data and lessons learned from a case study with an industrial software component.",
            "Similarity-based test case prioritization using ordered sequences of program entities.",
            "In this issue.",
            "Quality attribute modeling and quality aware product configuration in software product lines.",
            "Comparing four approaches for technical debt identification.",
            "Hierarchy-Debug: a scalable statistical technique for fault localization.",
            "Guest editorial: special section on software quality assurance and quality management.",
            "A case study on software risk analysis and planning in medical device development.",
            "Introduction of static quality analysis in small- and medium-sized software enterprises: experiences from technology transfer.",
            "Integrating risk-based testing in industrial test processes.",
            "In this issue.",
            "On the applicability of capability models for small software organizations: does the use of standard processes lead to a better achievement of business goals?",
            "An empirically validated simulation for understanding the relationship between process conformance and technology skills.",
            "Function point analysis using NESMA: simplifying the sizing without simplifying the size.",
            "Model-driven estimation approach for system reliability using integrated tasks and resources.",
            "Guest editorial: special section on regression testing.",
            "Identifying the effects of modifications as data dependencies.",
            "Influences on regression testing strategies in agile software development environments."
        ]
    },
    {
        "name": "SQJ",
        "year": "2013",
        "info": "Volume 21: 2013",
        "count": 28,
        "papers": [
            "In this issue.",
            "Automated measurement of models of requirements.",
            "A streamlined, cost-effective database approach to manage requirements traceability.",
            "The bug report duplication problem: an exploratory study.",
            "Taxonomy of quality metrics for assessing assurance of security correctness.",
            "Guest editor's introduction to the special section on tests and proofs.",
            "Relational analysis of (co)inductive predicates, (co)algebraic datatypes, and (co)recursive functions.",
            "B model slicing and predicate abstraction to generate tests.",
            "A framework for testing first-order logic axioms in program verification.",
            "In this issue.",
            "Optimizing decomposition of software architecture for local recovery.",
            "Static correspondence and correlation between field defects and warnings reported by a bug finding tool.",
            "Evolutionary functional black-box testing in an industrial setting.",
            "A multiple case study of design pattern decay, grime, and rot in evolving software systems.",
            "Practical experiences in modelling software engineering practices: The project patterns approach.",
            "Hierarchical availability analysis of multi-tiered Web applications.",
            "Influence of confirmation biases of developers on software quality: an empirical study.",
            "In this issue.",
            "Foreword to the invited impact paper on automatic software repair.",
            "Current challenges in automatic software repair.",
            "Test case prioritization: a systematic mapping study.",
            "Monitoring the software development process using a short-run control chart.",
            "A PSO-based model to increase the accuracy of software development effort estimation.",
            "In this issue.",
            "Mining the impact of evolution categories on object-oriented metrics.",
            "What you like in design use to correct bad-smells.",
            "A framework for prioritization of quality requirements for inclusion in a software project.",
            "Evaluating the impact of an agile transformation: a longitudinal case study in a distributed context."
        ]
    },
    {
        "name": "SQJ",
        "year": "2012",
        "info": "Volume 20: 2012",
        "count": 25,
        "papers": [
            "In this issue.",
            "Predicting high-risk program modules by selecting the right software measurements.",
            "A test case refactoring approach for pattern-based software development.",
            "Generating model-based test cases from natural language requirements for space application software.",
            "Who tested my software? Testing as an organizationally cross-cutting activity.",
            "Tool support for disseminating and improving development practices.",
            "A conceptual modeling quality framework.",
            "Requirements and constructors for tailoring software processes: a systematic literature review.",
            "In this issue.",
            "Introduction to the Software Quality and Maintainability special issue.",
            "Faster issue resolution with higher technical quality of software.",
            "Standardized code quality benchmarking for improving software maintainability.",
            "Harmonization of ISO/IEC 9001: 2000 and CMMI-DEV: from a theoretical comparison to a real case application.",
            "System-specific static code analyses: a case study in the complex embedded systems domain.",
            "Availability of enterprise IT systems: an expert-based Bayesian framework.",
            "Identifying factors affecting software development cost and productivity.",
            "In this issue.",
            "Foreword to the special issue on quality engineering for software product lines.",
            "A systematic review of quality attributes and measures for software product lines.",
            "SPL Conqueror: Toward optimization of non-functional properties in software product lines.",
            "Quality-aware analysis in product line engineering with the orthogonal variability model.",
            "Model-based pairwise testing for feature interaction coverage in software product line engineering.",
            "Pairwise testing for software product lines: comparison of two approaches.",
            "AoURN-based modeling and analysis of software product lines.",
            "Composing multiple variability artifacts to assemble coherent workflows."
        ]
    },
    {
        "name": "SQJ",
        "year": "2011",
        "info": "Volume 19: 2011",
        "count": 38,
        "papers": [
            "In this issue.",
            "Guest editor's introduction to the special section on the 2009 international conference on program comprehension (ICPC 2009).",
            "Resumption strategies for interrupted programming tasks.",
            "Automatically identifying changes that impact code-to-design traceability during evolution.",
            "Empirical studies on programming language stimuli.",
            "Toward objective software process information: experiences from a case study.",
            "Metrics-based evaluation of learning object reusability.",
            "Contributions of tester experience and a checklist guideline to the identification of categories and choices for software testing.",
            "Comparison of weighted grey relational analysis for software effort estimation.",
            "Graphical versus textual software measurement modelling: an empirical study.",
            "In this issue.",
            "Guest editor's introduction to the special section on source code analysis and manipulation.",
            "Advanced chopping of sequential and concurrent programs.",
            "An extended assessment of type-3 clones as detected by state-of-the-art tools.",
            "Recovering grammar relationships for the Java Language Specification.",
            "Guest Editor's Introduction to the Special Section on the 2009 Software Quality Management conference.",
            "Proposing a multi-agency development framework.",
            "Classification and selection of tools for quality knowledge management.",
            "Embedding requirements within Model-Driven Architecture.",
            "Artefact generation in second life with case-based reasoning.",
            "Identification and analysis of attributes and base measures within ISO 9126.",
            "The role of comprehension in requirements and implications for use case descriptions.",
            "In this issue.",
            "A multiple-population genetic algorithm for branch coverage test data generation.",
            "An industrial case study of classifier ensembles for locating software defects.",
            "A comparative study for estimating software development effort intervals.",
            "Benchmarking library and application software with Data Envelopment Analysis.",
            "Assessing the maintainability of software product line feature models using structural metrics.",
            "In this issue.",
            "Investigating the effect of variations in the test development process: a case from a safety-critical system.",
            "The effectiveness of test-driven development: an industrial case study.",
            "Towards a quality meta-model for information systems.",
            "Guest editors' introduction to the special section on exploring the boundaries of software test automation.",
            "Automatically performing weak mutation with the aid of symbolic execution, concolic testing and search-based testing.",
            "Enhancing structural software coverage by incrementally computing branch executability.",
            "Automating unit and integration testing with partial oracles.",
            "TORC: test plan optimization by requirements clustering.",
            "Automated GUI performance testing."
        ]
    },
    {
        "name": "SQJ",
        "year": "2010",
        "info": "Volume 18: 2010",
        "count": 22,
        "papers": [
            "In this issue.",
            "Empirical validation of object-oriented metrics for predicting fault proneness models.",
            "A software product certification model.",
            "A new perspective on data homogeneity in software cost estimation: a study in the embedded systems domain.",
            "Risk management capability model for the development of medical device software.",
            "Using program data-state scarcity to guide automatic test data generation.",
            "Improving design-pattern identification: a new approach and an exploratory study.",
            "In this issue.",
            "A comparative analysis of CMMI software project management by Brazilian, Indian and Chinese companies.",
            "An organizational maturity model of software product line engineering.",
            "SPDW+: a seamless approach for capturing quality metrics in software development environments.",
            "Design pattern evolutions in QVT.",
            "Knowledge-oriented software engineering process in a multi-cultural context.",
            "In this issue.",
            "A fuzzy regression and optimization approach for setting target levels in software quality function deployment.",
            "Integration of strategic management, process improvement and quantitative measurement for managing the competitiveness of software engineering organizations.",
            "Software quality, non-functional software requirements and IT-business alignment.",
            "An integrated framework for supply chain performance measurement using six-sigma metrics.",
            "In this issue.",
            "How to get mature global virtual teams: a framework to improve team process management in distributed software teams.",
            "Architecture analysis of enterprise systems modifiability: a metamodel for software change cost estimation.",
            "Quality specification and metrication, results from a case-study in a mission-critical software domain."
        ]
    },
    {
        "name": "SQJ",
        "year": "2009",
        "info": "Volume 17: 2009",
        "count": 25,
        "papers": [
            "In this issue.",
            "Welcome to Rachel Harrison, the new Editor-in-Chief of the Software Quality Journal.",
            "Multiple-parameter coupling metrics for layered component-based software.",
            "Software quality analysis by combining multiple projects and learners.",
            "Evaluating legacy assets in the context of migration to SOA.",
            "A comprehensive quality model for service-oriented systems.",
            "Bayesian updating of optimal release time for software systems.",
            "Thanks to Jim Bieman, the Former Editor-in-Chief of the Software Quality Journal.",
            "In this issue.",
            "An evaluation of the utility of web development methods.",
            "A conceptual framework for component context specification and representation in a metaCASE environment.",
            "Experiences from using ICMM in inspection process assessment.",
            "An evolutionary cultural-change approach to successful software process improvement.",
            "Should we try to measure software quality attributes directly?",
            "Question framework for architectural description quality evaluation.",
            "In this issue.",
            "Entropy based software processes improvement.",
            "On detecting faults for Boolean expressions.",
            "Using test case patterns to estimate software development and quality management cost.",
            "Evaluating the service quality of software providers appraised in CMM/CMMI.",
            "In this issue.",
            "Introduction to the WCRE 2007 special issue.",
            "Clone detection via structural abstraction.",
            "Extending the reflexion method for consolidating software variants into product lines.",
            "Analyzing the co-evolution of comments and source code."
        ]
    },
    {
        "name": "SQJ",
        "year": "2008",
        "info": "Volume 16: 2008",
        "count": 29,
        "papers": [
            "In this issue.",
            "A scalable method for testing real-time systems.",
            "An exploratory study of the effect of aspect-oriented programming on maintainability.",
            "Simulation-based analysis of UML statechart diagrams: methods and case studies.",
            "Empirical studies to assess the understandability of data warehouse schemas using structural metrics.",
            "E-commerce system quality assessment using a model based on ISO 9126 and Belief Networks.",
            "A lightweight approach to software validation by comparing UML use cases with internal program documentation selected via call graphs.",
            "In this issue.",
            "Guest Editor's Introduction to the Special Section on the 2nd Workshop on Advances in Model-based Software Testing (A-MOST'06).",
            "Using model-checkers to generate and analyze property relevant test-cases.",
            "Using communication coverage criteria and partial model generation to assist software integration testing.",
            "A measurement framework for assessing the maturity of requirements engineering process.",
            "Software process improvement in small and medium software enterprises: a systematic review.",
            "Integrating fuzzy theory and hierarchy concepts to evaluate software quality.",
            "Test frame updating in CPM testing of Prolog programs.",
            "In this issue.",
            "Guest editors' introduction to the special section on the software engineering track of the 22nd annual ACM symposium on applied computing (ACM SAC-SE 2007).",
            "Enhancing adaptive random testing for programs with high dimensional input domains or failure-unrelated parameters.",
            "Evaluating pattern conformance of UML models: a divide-and-conquer approach and case studies.",
            "Risk analysis of software process measurements.",
            "Improvement of causal analysis using multivariate statistical process control.",
            "Evaluation of preliminary data analysis framework in software cost estimation based on ISBSG R9 Data.",
            "Cost estimation for cross-organizational ERP projects: research perspectives.",
            "In this issue.",
            "Election software exposed.",
            "Quantitatively measuring object-oriented couplings.",
            "A proposal for a set of attributes relevant for Web portal data quality.",
            "A defect prediction method for software versioning.",
            "Imputation techniques for multivariate missingness in software measurement data."
        ]
    },
    {
        "name": "SQJ",
        "year": "2007",
        "info": "Volume 15: 2007",
        "count": 27,
        "papers": [
            "In this issue.",
            "Guest editorial: Special section on Software Engineering Research and Practice 2005 (SERP'05).",
            "Specifying and checking method call sequences of Java programs.",
            "Executable visual software modeling - the ZOOM approach.",
            "Performance assessment of intelligent distributed systems through software performance ontology engineering (SPOE).",
            "Assessing the quality of use case descriptions.",
            "Common coupling and pointer variables, with application to a Linux case study.",
            "In this issue.",
            "A method to elicit architecturally sensitive usability requirements: its integration into a software development process.",
            "Targets, drivers and metrics in software process improvement: Results of a survey in a multinational organization.",
            "Improving a portlet usability model.",
            "Measuring size, complexity, and coupling of hypergraph abstractions of software: An information-theory approach.",
            "Ensuring the quality of conceptual representations.",
            "In this issue.",
            "Introduction to the special issue on: \"Software Quality Improvements and Estimations with Intelligence-based Methods\".",
            "Rapid goal-oriented automated software testing using MEA-graph planning.",
            "Deployment and dynamic reconfiguration planning for distributed software systems.",
            "Supporting high interoperability of components by adopting an agent-based approach.",
            "Validating neural network-based online adaptive systems: a case study.",
            "Software quality estimation with limited fault data: a semi-supervised learning perspective.",
            "In this issue.",
            "An analysis of software quality management at AWE plc.",
            "Motivating developer performance to improve project outcomes in a high maturity organization.",
            "Improving the quality of use case descriptions: empirical assessment of writing guidelines.",
            "In search for a widely applicable and accepted software quality model for software quality engineering.",
            "The applicability analysis of ISO/IEC 9126 series of standards in telecom sector: the example of softswitch category of software.",
            "Benchmarking quality measurement."
        ]
    },
    {
        "name": "SQJ",
        "year": "2006",
        "info": "Volume 14: 2006",
        "count": 24,
        "papers": [
            "In this issue.",
            "PEM: The small company-dedicated software process quality evaluation method combining CMMISM and ISO/IEC 14598.",
            "PisoSIA® a stakeholder approach to assist change in information systems development projects and aid process improvement.",
            "A productivity benchmarking case study using Bayesian credible intervals.",
            "Towards real process improvement from internal auditing - A case study.",
            "The software quality challenges of service oriented architectures in e-commerce.",
            "In this issue.",
            "Editorial: What makes a software failure a page-one story?",
            "An empirical study of predicting software faults with case-based reasoning.",
            "A quantitative approach for setting technical targets based on impact analysis in software quality function deployment (SQFD).",
            "Utilization of statistical process control (SPC) in emergent software organizations: Pitfalls and suggestions.",
            "Usability measurement and metrics: A consolidated model.",
            "In this issue.",
            "Guest editorial.",
            "Theories, tools and research methods in program comprehension: past, present and future.",
            "Applying and combining three different aspect Mining Techniques.",
            "On evaluating the layout of UML diagrams for program comprehension.",
            "Concise and consistent naming.",
            "In this issue.",
            "Editorial: Free/open source software, silver bullets, and mythical months.",
            "An instrument for the measurement of customer perceptions of quality management in the software industry: An empirical study in India.",
            "Resource oriented selection of rule-based classification models: An empirical case study.",
            "Enhancing input value selection in parametric software cost estimation models through second level cost drivers.",
            "Employing user profiles to test a new version of a GUI component in its context of use."
        ]
    },
    {
        "name": "SQJ",
        "year": "2005",
        "info": "Volume 13: 2005",
        "count": 24,
        "papers": [
            "In This Issue.",
            "An Incremental Approach to Software Process Assessment and Improvement.",
            "The Evolution Path for Industrial Software Quality Evaluation Methods Applying ISO/IEC 9126: 2001 Quality Model: Example of MITRE's SQAE Method.",
            "Towards Formalised Guidelines for Migrating Structured Designs to UML: A Case Study.",
            "Assessing Variation in Development Effort Consistency Using a Data Source with Missing Data.",
            "Preliminary Data Analysis Methods in Software Estimation.",
            "In This Issue.",
            "Editorial: Can Users Read Developers Minds?.",
            "The Efficiency of Critical Slicing in Fault Localization.",
            "Early Estimation of Users' Perception of Software Quality.",
            "A New Challenge for Applying Time Series Metrics Data to Software Quality Estimation.",
            "A Metamodel for Assessable Software Development Methodologies.",
            "In This Issue.",
            "Editorial: Is Anyone Listening?",
            "Using Dynamic Information in the Interprocedural Static Slicing of Binary Executables.",
            "Defining a Requirements Process Improvement Model.",
            "Measurement and Validation of Module Coupling Attributes.",
            "Modeling Design/Coding Factors That Drive Maintainability of Software Systems.",
            "Special Issue: Trade-off Analysis of Software Quality Attributes.",
            "A Basis for Analyzing Software Architecture Analysis Methods.",
            "Tradeoff and Sensitivity Analysis in Software Architecture Evaluation Using Analytic Hierarchy Process.",
            "A Framework for Design Tradeoffs.",
            "Virtual Software Engineering Laboratories in Support of Trade-off Analyses.",
            "Understanding Stakeholder Values as a Means of Dealing with Stakeholder Conflicts."
        ]
    },
    {
        "name": "SQJ",
        "year": "2004",
        "info": "Volume 12: 2004",
        "count": 24,
        "papers": [
            "In This Issue.",
            "Editorial: The Role of Prognostication in Software Design.",
            "Requirements for Maintaining Web Access for Hearing-Impaired Individuals.",
            "Six Sigma for Software Application of Hypothesis Tests to Software Data.",
            "Specification of Service Level Agreements: Problems, Principles and Practices.",
            "Multi-Project Management in Software Engineering Using Simulation Modelling.",
            "In This Issue.",
            "Editorial: Aspect-Oriented Technology and Software Quality.",
            "A Pattern-Based Framework for Software Anomaly Detection.",
            "Data Generation for Path Testing.",
            "The W-Process for Software Product Evaluation: A Method for Goal-Oriented Implementation of the ISO 14598 Standard.",
            "Performance Monitoring of Remote Websites Using Mobile Agents.",
            "In This Issue.",
            "Selecting a Cost-Effective Test Case Prioritization Technique.",
            "Analysis of Software Fault Removal Policies Using a Non-Homogeneous Continuous Time Markov Chain.",
            "Testing Software Requirements with Z and Statecharts Applied to an Embedded Control System.",
            "Requirements Engineering and Process Modelling in Software Quality Management- Towards a Generic Process Metamodel.",
            "In This Issue.",
            "Introduction.",
            "9210: The Zip Code of Another IT-Soap.",
            "Online Cycle Detection and Difference Propagation: Applications to Pointer Analysis.",
            "Slicing, Chopping, and Path Conditions with Barriers.",
            "Detection of Redundant Code Using R2D2.",
            "Compiler Hacking for Source Code Analysis."
        ]
    },
    {
        "name": "SQJ",
        "year": "2003",
        "info": "Volume 11: 2003",
        "count": 20,
        "papers": [
            "In This Issue.",
            "Editorial: The Illusive Nature of Quality.",
            "Trusted Software's Holy Grail.",
            "Ordering Fault-Prone Software Modules.",
            "Software Quality Evaluation Based on Expert Judgement.",
            "Evaluation of the DRM and the Time for Preventive Maintenance for Aging Software.",
            "In This Issue.",
            "Introduction to the Special Issue on Quality Engineering with Computational Intelligence.",
            "Machine Learning and Software Engineering.",
            "Towards a Software Change Classification System: A Rough Set Approach.",
            "Fuzzy Modeling for Function Points Analysis.",
            "Selection and Evaluation of Test Data Based on Genetic Programming.",
            "Software Quality-Prevention versus Cure?",
            "Quality Impacts of Clandestine Common Coupling.",
            "Construction of a Systemic Quality Model for Evaluating a Software Product.",
            "Simple Metrics for Improving Software Process Performance and Capability: A Case Study.",
            "COCOMO-Based Effort Estimation for Iterative and Incremental Software Development.",
            "A Procedure for Assessing the Influence of Problem Domain on Effort Estimation Consistency.",
            "GEQUAMO-A Generic, Multilayered, Customisable, Software Quality Model.",
            "Usability Meanings and Interpretations in ISO Standards."
        ]
    },
    {
        "name": "SQJ",
        "year": "2002",
        "info": "Volume 10: 2002",
        "count": 23,
        "papers": [
            "In This Issue.",
            "Editorial: Risks to Software Quality.",
            "Statistical Methods for Predicting and Improving Cohesion Using Information Flow: An Empirical Study.",
            "Benefits and Effective Application of Software Engineering Standards.",
            "A General Model of Unit Testing Efficacy.",
            "In This Issue.",
            "SPI Models: What Characteristics are Required for Small Software Development Companies?",
            "Principles of Built-In-Test for Run-Time-Testability in Component-Based Software Systems.",
            "Measuring Effort Estimation Uncertainty to Improve Client Confidence.",
            "A Generalized Structural Model of Structured Programs for Software Metrics Definition.",
            "Empirical Measurement of the Effects of Cultural Diversity on Software Quality Management.",
            "A Dynamic Integrated Framework for Software Process Improvement.",
            "In This Issue.",
            "Editorial: Why Good Software Goes Bad.",
            "Specification-based Testing for Gui-based Applications.",
            "AI Planner Assisted Test Generation.",
            "Experiences in the Application of Software Process Improvement in SMES.",
            "In This Issue.",
            "Editorial: The Y2K Legacy-The Time Bomb of Tomorrow.",
            "Quality in Web Design for Visually Impaired Users.",
            "Deriving a Fault Architecture to Guide Testing.",
            "Critical Analysis of the PIE Testability Technique.",
            "Energy Metric for Software Systems."
        ]
    },
    {
        "name": "SQJ",
        "year": "2001",
        "info": "Volume 9: 2001",
        "count": 22,
        "papers": [
            "In This Issue.",
            "Editorial: Ethics and Software Quality.",
            "Cost-Benefit Analysis of Software Quality Models.",
            "Gaining Confidence in Software Inspection Using a Bayesian Belief Model.",
            "Assessing Project Success Using Subjective Evaluation Factors.",
            "In This Issue.",
            "Editorial: Software Quality and Internet Time.",
            "Table Oriented Metrics for Relational Databases.",
            "Empirical Assessment of a Software Metric: The Information Content of Operators.",
            "Multi-Criteria Methodology Contribution to the Software Quality Evaluation.",
            "Quality Control in Spreadsheets: A Visual Approach using Color Codings to Reduce Errors in Formulae.",
            "In This Issue.",
            "How Practical is a Code of Ethics for Software Engineers Interested in Quality?",
            "Data Mining of Software Development Databases.",
            "Quality through Managed Improvement and Measurement (QMIM): Towards a Phased Development and Implementation of a Quality Management System for a Software Company.",
            "Quantitative Analysis of Development Defects to Guide Testing: A Case Study.",
            "In This Issue.",
            "An Introduction and Welcome for Jim Bieman, the New Editor-in-Chief of the Software Quality Journal.",
            "Coupling Trends in Industrial Prototyping Roles: An Empirical Investigation.",
            "Lean Software Development: Two Case Studies.",
            "Examining the Effect of the Transformational Leader on Software Quality.",
            "Product Focused Software Process Improvement: Concepts and Experiences from Industry."
        ]
    },
    {
        "name": "SQJ",
        "year": "1999",
        "info": "Volume 8: 1999",
        "count": 24,
        "papers": [
            "Editorial.",
            "BOOTSTRAP 3.0 - A SPICE1 Conformant Software Process Assessment Methodology.",
            "Quality Approaches in a Large Software House.",
            "Continuous Software Process Improvement Requires Organisational Learning: An Australian Case Study.",
            "A Survey of Boehm?s Work on the Spiral Models and COCOMO II-Towards Software Development Process Quality Improvement.",
            "Commitment to Software Process Improvement-Development of Diagnostic Tool to Facilitate Improvement1.",
            "Editorial.",
            "Software Quality Management from a Cross-Cultural Viewpoint.",
            "A Critical Analysis of Current OO Design Metrics.",
            "Industrial Requirements for Distributed SCM Tool.",
            "Whole Life Cost: The Future Trend in Software Development.",
            "A Framework for Improving the Requirements Engineering Process Management.",
            "TAPISTRY-A Software Process Improvement Approach Tailored for Small Enterprises.",
            "Editorial.",
            "A Case Study in Software Reuse.",
            "Slow Change of Information System Development Practice.",
            "Technology Review: Adapting Financial Measures: Making a Business Case for Software Process Improvement*.",
            "Guest Editorial.",
            "cSuds-SDL: A Tool for Testing Software Architecture Specifications.",
            "A Design Phase Directed Formal Verification Process.",
            "An Experience in Testing an Object-Oriented Satellite Control System.",
            "Mutation Testing Applied to Estelle Specifications.",
            "ConData: A Tool for Automating Specification-Based Test Case Generation for Communication Systems.",
            "On Verifying Distributed Multithreaded Java Programs."
        ]
    },
    {
        "name": "SQJ",
        "year": "1998",
        "info": "Volume 7: 1998",
        "count": 21,
        "papers": [
            "Can the case for CASE technology be advanced by Process Improvement?",
            "Painless improvements to the review process.",
            "On the limitations of software process assessment and the recognition of a required re-orientation for global process improvement.",
            "A new reusability metric for object-oriented software.",
            "Application of multivariate analysis forsoftware fault prediction.",
            "Perceptions of software quality : a pilot study.",
            "Management Systems: the End of the Beginning?",
            "ASTERIX Introduction of a Process Improvement Using Tools to Support System Testing.",
            "Quality on Time.",
            "A Quality Software Process for Rapid Application Development.",
            "An Analysis Of Obsolescence Risk In IT Systems.",
            "Constructing Standards For Cross-Platform Operation.",
            "Prediction of Run-Time Failures Using Static Product Quality Metrics.",
            "The Impact of Vaporware, Reliable Software, Vendor Dependence and Fulfilled Promises on Customers' Perceptions/Experiences and Vendor Reputation.",
            "Editorial.",
            "Typology of database quality factors.",
            "Evaluating, comparing and improving the quality of system structure during the specification process. Application example with SDL.",
            "Evolution of a maturity model - critical evaluation and lessons learned.",
            "TQM implementation factors for software development: an empirical study.",
            "Software quality by administration.",
            "Software quality management in turbulent times - are there alternatives to process oriented software quality management?"
        ]
    },
    {
        "name": "SQJ",
        "year": "1997",
        "info": "Volume 6: 1997",
        "count": 25,
        "papers": [
            "Introduction of modern software technology. A case from Swedish industry.",
            "FAST: a framework for automating statistics-based testing.",
            "PROCESSUS - Integration of SEI CMM and ISO quality models.",
            "A critical look at ISO 9000 for software quality management.",
            "Software quality assurance in Australia: an update.",
            "SPI: \"I can't get no satisfaction\" - directing process improvement to meet business needs.",
            "A basis for process improvement in application management.",
            "Reducing the cost of IT ownership using feedback from the IT helpdesk.",
            "Testing real-time systems using genetic algorithms.",
            "A study of user acceptance tests.",
            "Aardvark to zulu.",
            "Efficiency of CAMEtools in software quality assurance.",
            "Defining strategies - measuring quality.",
            "A situational approach to design strategies.",
            "Going soft on quality? Process management in the Scottish software industry.",
            "The SQUID approach to defining a quality model.",
            "Effective coordination in the software process - historical perspectives and future directions.",
            "Delivering quality in global IT services.",
            "Software process improvement: making it happen in practice.",
            "Quality issues of the Year 2000 problem.",
            "Practical experiences of tool support in a GQM-based measurement programme.",
            "Iterative design and testing within the software development life cycle.",
            "Managing software requirements using quality function deployment.",
            "Software testability measurement for intelligent assertion placement.",
            "A case study to demonstrate the impact of quality design principles when restructuring existing software."
        ]
    },
    {
        "name": "SQJ",
        "year": "1996",
        "info": "Volume 5: 1996",
        "count": 29,
        "papers": [
            "Frameworks for quality software process: SEI Capability Maturity Model versus ISO 9000.",
            "Building quality into scientific software.",
            "Design for instrumentation: high quality measurement of formal technical review.",
            "Software quality assurance in practice.",
            "The value of a certified quality management system: the perception of internal developers.",
            "Software quality practices - an empirical study.",
            "Experiences with the capability maturity model in a research environment.",
            "A framework for project management.",
            "TickIT awards - a winner's perspective.",
            "Supporting software quality in an integrated safety-critical systems development environment.",
            "Analysis and differentiation of software system environments.",
            "News section.",
            "Editorial.",
            "Relating the SPICE framework and SEI approach to software process assessment.",
            "Utilization of a systemic business process re-engineering method as a tool to improve software process quality.",
            "Process improvement: an alternative to BPR for software development organizations.",
            "Testing by the numbers.",
            "Measuring the quality of the development lifecycle process.",
            "Definition and collection of metrics for comprehensive software measurement.",
            "Consistent support for software designers and inspectors.",
            "Book reviews.",
            "Editorial.",
            "Software quality programmes: a snapshot of theory versus reality.",
            "ISO 12207 Software life cycle processes - fit for purpose?",
            "Classification techniques for metric-based software development.",
            "Specifying software quality with the extended ISO model.",
            "Non-functional requirements in the software development process.",
            "Establishing a systems integration process intrastructure.",
            "Factors affecting the quality of software project management: an empirical study based on the Capability Maturity Model."
        ]
    },
    {
        "name": "SQJ",
        "year": "1995",
        "info": "Volume 4: 1995",
        "count": 25,
        "papers": [
            "Editorial.",
            "Software metrics for the Boeing 777: a case study.",
            "A case study of tracking software development using quality metrics.",
            "Investigating ARIMA models of software system quality.",
            "Controlling and predicting the quality of space shuttle software using metrics.",
            "Fault detection effectiveness of mutation and data flow testing.",
            "Editorial.",
            "Usability: what's it all about?",
            "A user interface evaluation environment using synchronized video, visualizations and event trace data.",
            "Measuring usability as quality of use.",
            "A toolkit for appraising the long-term usability of a text editor.",
            "Editorial.",
            "A non-invasive object-oriented tool for software testing.",
            "Comparing the top-down and bottom-up approaches of function point analysis: a case study.",
            "Soft factors and their impact on time to market.",
            "A measurement framework for improving verification processes.",
            "The effort required by LCSAJ testing: an assessment via a new path generation strategy.",
            "Book review.",
            "Editorial.",
            "Costs and benefits of early defect detection: experiences from developing client server and host applications.",
            "A set of complexity metrics for guiding the software test process.",
            "Test criteria and coverage measures for software integration testing.",
            "Systematic testing and formal verification to validate reactive programs.",
            "Using formal specifications to support software testing.",
            "Book reviews."
        ]
    }
]