[
    {
        "name": "STTT",
        "year": "2022",
        "info": "Volume 24, 2022",
        "count": 7,
        "papers": [
            "Utilizing parametric systems for detection of pipeline hazards.",
            "Tools and algorithms for the construction and analysis of systems: a special issue for TACAS 2019.",
            "Verifying safety of synchronous fault-tolerant algorithms by bounded model checking.",
            "Extended abstract dependency graphs.",
            "Extending a brainiac prover to lambda-free higher-order logic.",
            "CESRBDDs: binary decision diagrams with complemented edges and edge-specified reductions.",
            "Using linear algebra in decomposition of Farkas interpolants."
        ]
    },
    {
        "name": "STTT",
        "year": "2021",
        "info": "Volume 23, 2021",
        "count": 58,
        "papers": [
            "Learning Moore machines from input-output traces.",
            "Static generation of UML sequence diagrams.",
            "Detecting multiphase linear ranking functions for single-path linear-constraint loops.",
            "Masterminding change by combining secure system design with security risk assessment.",
            "Static analysis for discovering IoT vulnerabilities.",
            "ADTLang: a programming language approach to attack defense trees.",
            "Graph-based technique for survivability assessment and optimization of IoT applications.",
            "Verification and refutation of C programs based on k-induction and invariant inference.",
            "Automata-based monitoring for LTL-FO+.",
            "Preface.",
            "Stream runtime verification of real-time event streams with the Striver language.",
            "Scalable online first-order monitoring.",
            "From parametric trace slicing to rule systems.",
            "Diagnosing timed automata using timed markings.",
            "A taxonomy for classifying runtime verification tools.",
            "Automated model analysis tools and techniques presented at FASE 2019.",
            "Incremental execution of rule-based model transformation.",
            "Cooperative verifier-based testing with CoVeriTest.",
            "Avoiding unnecessary information loss: correct and efficient model synchronization based on triple graph grammars.",
            "A logic-based incremental approach to graph repair featuring delta preservation.",
            "Formal testing of timed graph transformation systems using metric temporal graph logic.",
            "PolyGraph: a data flow model with frequency arithmetic.",
            "Correction to: PolyGraph: a data flow model with frequency arithmetic.",
            "Compositional learning of mutually recursive procedural systems.",
            "Introduction to the special issue of the 19th International Conference on Runtime Verification.",
            "An extension of first-order LTL with rules with application to runtime verification.",
            "Specifying and detecting temporal patterns with shape expressions.",
            "What can we monitor over unreliable channels?",
            "Comparing controlled system synthesis and suppression enforcement.",
            "Neural predictive monitoring and a comparison of frequentist and Bayesian approaches.",
            "Quantitative estimation of side-channel leaks with neural networks.",
            "Towards language-to-language transformation.",
            "On methods and tools for rigorous system design.",
            "Specifying and verifying usage control models and policies in TLA+.",
            "Programming dynamic reconfigurable systems.",
            "Model-based optimization of ARINC-653 partition scheduling.",
            "Correct program parallelisations.",
            "Energy characterization of IoT systems through design aspect monitoring.",
            "CPSDebug: Automatic failure explanation in CPS models.",
            "Verification of randomized consensus algorithms under round-rigid adversaries.",
            "Correction to: Verification of randomized consensus algorithms under round-rigid adversaries.",
            "Correction to: An integrated specification and verification technique for highly concurrent data structures.",
            "Correction to: How to model and prove hybrid systems with KeYmaera: a tutorial on safety.",
            "TOOLympics I: Competition on software testing.",
            "First international competition on software testing.",
            "CoVeriTest: interleaving value and predicate analysis for test-case generation.",
            "CPA/Tiger-MGP: test-goal set partitioning for efficient multi-goal test-suite generation.",
            "ESBMC 6.1: automated test case generation using bounded model checking.",
            "FairFuzz-TC: a fuzzer targeting rare branches.",
            "KLEE symbolic execution engine in 2019.",
            "Plain random test generation with PRTest.",
            "Symbiotic 6: generating test cases by slicing and symbolic execution.",
            "TOOLympics II: competitions on formal methods.",
            "VerifyThis 2019: a program verification competition.",
            "SL-COMP: competition of solvers for separation logic.",
            "CoCo 2019: report on the eighth confluence competition.",
            "The RERS challenge: towards controllable and scalable benchmark synthesis.",
            "Study of the efficiency of model checking techniques using results of the MCC from 2015 To 2019."
        ]
    },
    {
        "name": "STTT",
        "year": "2020",
        "info": "Volume 22, 2020",
        "count": 47,
        "papers": [
            "Model-based software quality assurance tools and techniques presented at FASE 2018.",
            "Correct-by-construction model-based design of reactive streaming software for multi-core embedded systems.",
            "Correction to: Correct-by-construction model-based design of reactive streaming software for multi-core embedded systems.",
            "$\\hbox {CTL}^{\\star }$ family-based model checking using variability abstractions and modal transition systems.",
            "Diversity of graph models and graph generators in mutation testing.",
            "Distributed graph queries over models@run.time for runtime monitoring of cyber-physical systems.",
            "Introduction to the Special Issue devoted to SPIN 2018.",
            "Model-based testing of apps in real network scenarios.",
            "Joint forces for memory safety checking revisited.",
            "IC3 software model checking.",
            "Counting Petri net markings from reduction equations.",
            "A greedy particle swarm optimization (GPSO) algorithm for testing real-world smart card applications.",
            "Spatial logics and model checking for medical imaging.",
            "A formal approach to AADL model-based software engineering.",
            "Introduction to special section on the ABZ 2018 case study: Hybrid ERTMS/ETCS Level 3.",
            "The ABZ-2018 case study with Event-B.",
            "Validation of the Hybrid ERTMS/ETCS Level 3 using Spin.",
            "Validating the Hybrid ERTMS/ETCS Level 3 concept with Electrum.",
            "Formalising the Hybrid ERTMS Level 3 specification in iUML-B and Event-B.",
            "Validation and real-life demonstration of ETCS hybrid level 3 principles using a formal B model.",
            "A formal refinement-based analysis of the hybrid ERTMS/ETCS level 3 standard.",
            "Modeling the hybrid ERTMS/ETCS level 3 standard using a formal requirements engineering approach.",
            "Comparing mutation coverage against branch coverage in an industrial setting.",
            "Rigorous engineering of collective adaptive systems: special section.",
            "The SOTA approach to engineering collective adaptive systems.",
            "Learning-based coordination model for spontaneous self-composition of reliable services in a distributed system.",
            "The DReAM framework for dynamic reconfigurable architecture modelling: theory and applications.",
            "The scenario coevolution paradigm: adaptive quality assurance for adaptive systems.",
            "A distributed API for coordinating AbC programs.",
            "A language and framework for dynamic component ensembles in smart systems.",
            "Toward autonomically composable and context-dependent access control specification through ensembles.",
            "Approximate reduction of finite automata for high-speed network intrusion detection.",
            "Variable order metrics for decision diagrams in system verification.",
            "Introduction to the special issue for SPIN 2019.",
            "Extracting safe thread schedules from incomplete model checking results.",
            "Swarm model checking on the GPU.",
            "A study of learning likely data structure properties using machine learning models.",
            "VeriVANca framework: verification of VANETs by property-based message passing of actors in Rebeca with inheritance.",
            "Dependency graphs with applications to verification.",
            "On ranking functions for single-path linear-constraint loops.",
            "Enabling continuous integration in a formal methods setting.",
            "Tools for the construction and analysis of systems.",
            "The Refinement Calculus of Reactive Systems Toolset.",
            "Automating deductive verification for weak-memory programs (extended version).",
            "Efficient monitoring of hyperproperties using prefix trees.",
            "AMT 2.0: qualitative and quantitative trace analysis with extended signal temporal logic.",
            "An efficient statistical model checker for nondeterminism and rare events."
        ]
    },
    {
        "name": "STTT",
        "year": "2019",
        "info": "Volume 21, 2019",
        "count": 34,
        "papers": [
            "Reliable benchmarking: requirements and solutions.",
            "First international Competition on Runtime Verification: rules, benchmarks, tools, and final results of CRV 2014.",
            "Greedy pebbling for proof space compression.",
            "Hybrid automata: from verification to implementation.",
            "TestREx: a framework for repeatable exploits.",
            "A qualitative assessment of αRby in the perspective of the supervisory control theory.",
            "From high-level modeling toward efficient and trustworthy circuits.",
            "Formal modeling and analysis of ad hoc Zone Routing Protocol in Event-B.",
            "Formal specification and implementation of an automated pattern-based parallel-code generation framework.",
            "What's decidable about parametric timed automata?",
            "Knowledge-based security testing of web applications by logic programming.",
            "Introduction to Selected Papers from SPIN 2017.",
            "EdSketch: execution-driven sketching for Java.",
            "An integrated environment for Spin-based C code checking - Towards bringing model-driven code checking closer to practitioners.",
            "Stateless model checking of the Linux kernel's read-copy update (RCU).",
            "Model checking with generalized Rabin and Fin-less automata.",
            "An ordered approach to solving parity games in quasi-polynomial time and quasi-linear space.",
            "A reasoning-based approach to dynamic domain reduction in test data generation.",
            "Fast detection of concurrency errors by state space traversal with randomization and early backtracking.",
            "Parallel reachability analysis of hybrid systems in XSpeed.",
            "Complementary test selection criteria for model-based testing of security components.",
            "Comparing approaches for model-checking strategies under imperfect information and fairness constraints.",
            "ASAP: A Source Code Authorship Program.",
            "The Symbolic Execution Debugger (SED): a platform for interactive symbolic execution, debugging, verification and more.",
            "Scalable and precise estimation and debugging of the worst-case execution time for analysis-friendly processors: a comeback of model checking.",
            "Combining sequentialization-based verification of multi-threaded C programs with symbolic Partial Order Reduction.",
            "Symmetry reduction in CSP model checking.",
            "Quantitative variability modelling and analysis.",
            "Sampling strategies for product lines with unbounded parametric real-time constraints.",
            "Verification and abstraction of real-time variability-intensive systems.",
            "Configuration of inter-process communication with probabilistic model checking.",
            "Quantitative properties of featured automata.",
            "Applying supervisory control synthesis to priced featured automata and energy problems.",
            "Automatic refactoring of delta-oriented SPLs to remove-free form and replace-free form."
        ]
    },
    {
        "name": "STTT",
        "year": "2018",
        "info": "Volume 20, 2018",
        "count": 40,
        "papers": [
            "A high-level modeling language for the efficient design, implementation, and testing of Android applications.",
            "The role of user requirements in data repository design.",
            "Exact finite-state machine identification from scenarios and temporal properties.",
            "TSTL: the template scripting testing language.",
            "Mining parametric temporal logic properties in model-based design for cyber-physical systems.",
            "Software engineering practices and Simulink: bridging the gap.",
            "Recent advances in interactive and automated analysis.",
            "Coqoon - An IDE for interactive proof development in Coq.",
            "The Tinker tool for graphical tactic development.",
            "Multi-core symbolic bisimulation minimisation.",
            "Advances in probabilistic model checking with PRISM: variable reordering, quantiles and weak deterministic Büchi automata.",
            "PRISM-games: verification and strategy synthesis for stochastic multi-player games with multiple objectives.",
            "Automated translation of VDM to JML-annotated Java.",
            "Formal methods for transport systems.",
            "Modelling and simulating a Thai railway signalling system using Coloured Petri Nets.",
            "Towards formal methods diversity in railways: an experience report with seven frameworks.",
            "Spatio-temporal model checking of vehicular movement in public transport systems.",
            "To split or to group: from divide-and-conquer to sub-task sharing for verifying multiple properties in model checking.",
            "CINCO: a simplicity-driven approach to full generation of domain-specific graphical modeling tools.",
            "Formal methods and automated verification of critical systems.",
            "Qualitative and quantitative analysis of safety-critical systems with s#.",
            "Runtime verification of autopilot systems using a fragment of MTL- $${\\int }$$ ∫.",
            "High-level frameworks for the specification and verification of scheduling problems.",
            "Integrated formal verification of safety-critical software.",
            "Model-based testing strategies and their (in)dependence on syntactic model representations.",
            "Assessing SMT and CLP approaches for workflow nets verification.",
            "Model checking: recent improvements and applications.",
            "Integrating river basin DSSs with model checking.",
            "A case study of planning for smart factories - Model checking and Monte Carlo search for the rescue.",
            "Discrete and continuous strategies for timed-arc Petri net games.",
            "Modeling and analyzing real-time wireless sensor and actuator networks using actors and model checking.",
            "On-the-fly model checking for extended action-based probabilistic operators.",
            "Fair testing and stubborn sets.",
            "Software quality tools and techniques presented in FASE'17.",
            "Tactical contract composition for hybrid system component verification.",
            "Slicing ATL model transformations for scalable deductive verification and fault localization.",
            "Automated workarounds from Java program specifications based on SAT solving.",
            "Learning probabilistic models for model checking: an evolutionary approach and an empirical study.",
            "Automated reasoning for attributed graph properties.",
            "Slicing from formal semantics: Chisel - a tool for generic program slicing."
        ]
    },
    {
        "name": "STTT",
        "year": "2017",
        "info": "Volume 19, 2017",
        "count": 42,
        "papers": [
            "The physics of software tools: SWOT analysis and vision.",
            "MCMAS: an open-source model checker for the verification of multi-agent systems.",
            "Code generation for Event-B.",
            "Testing real-time systems from compositional symbolic specifications.",
            "Model checking of state-rich formalism Circus by linking to CSP ‖ B.",
            "Handling loops in bounded model checking of C programs via k-induction.",
            "Model-based regression testing by OCL.",
            "The landing gear case study: challenges and experiments.",
            "Aircraft landing gear system: approaches with Event-B to the modeling of an industrial system.",
            "Modeling a landing gear system in Event-B.",
            "Validation of the ABZ landing gear system using ProB.",
            "The landing gear system in multi-machine Hybrid Event-B.",
            "Environment-driven reachability for timed systems - Safety verification of an aircraft landing gear system.",
            "Rigorous development process of a safety-critical system: from ASM models to Java code.",
            "Model-based testing as a service.",
            "Automation and intelligent scheduling of distributed system functional testing - Model-based functional testing in practice.",
            "Combining usage-based and model-based testing for service-oriented architectures in the industrial practice.",
            "Practical experiences in the usage of MIDAS in the logistics domain.",
            "Fully automated runtime enforcement of component-based systems with formal and sound recovery.",
            "The first reactive synthesis competition (SYNTCOMP 2014).",
            "Preface of the special issue on formal methods in industrial critical systems.",
            "Verification of critical systems described in real-time TiMo.",
            "Require, test, and trace IT.",
            "Improving the numerical accuracy of programs by automatic transformation.",
            "Synthesizing, correcting and improving code, using model checking-based genetic programming.",
            "A correct-by-construction model for asynchronously communicating systems.",
            "Analyzing execution traces: critical-path analysis and distance analysis.",
            "Advances in verification presented in TACAS'13.",
            "Flexible SAT-based framework for incremental bounded upgrade checking.",
            "Synthesis of circular compositional program proofs via abduction.",
            "An integrated specification and verification technique for highly concurrent data structures.",
            "Underapproximation of procedure summaries for integer programs.",
            "Efficient family-based model checking via variability abstractions.",
            "metaSMT: focus on your application and not on solver integration.",
            "A general model checking framework for various memory consistency models.",
            "Some advances in tools and algorithms for the construction and analysis of systems.",
            "Variations on parallel explicit emptiness checks for generalized Büchi automata.",
            "Sylvan: multi-core framework for decision diagrams.",
            "AutoProof: auto-active functional verification of object-oriented programs.",
            "A formally verified hybrid system for safe advisories in the next-generation airborne collision avoidance system.",
            "RAMBUTANS: automatic AOP-specific test generation tool.",
            "VerifyThis 2015 - A program verification competition."
        ]
    },
    {
        "name": "STTT",
        "year": "2016",
        "info": "Volume 18, 2016",
        "count": 41,
        "papers": [
            "Model-driven generation of runtime checks for system properties.",
            "A blueprint for system-level performance modeling of software-intensive embedded systems.",
            "Downward pattern refinement for timed automata.",
            "Graphillion: software library for very large sets of labeled graphs.",
            "How to model and prove hybrid systems with KeYmaera: a tutorial on safety.",
            "Evaluating the effect of a lightweight formal technique in industry.",
            "Abstraction and refinement of mathematical functions toward SMT-based test-case generation.",
            "Some recent advances in automated analysis.",
            "Concurrent depth-first search algorithms based on Tarjan's Algorithm.",
            "FDR3: a parallel refinement checker for CSP.",
            "Many-core on-the-fly model checking of safety properties using GPUs.",
            "SATMC: a SAT-based model checker for security protocols, business processes, and security APIs.",
            "Monitoring modulo theories.",
            "Probabilistic verification and synthesis of the next generation airborne collision avoidance system.",
            "Advances in test generation for testing software and systems - An introduction to selected papers from ICTSS 2013.",
            "On adaptive experiments for nondeterministic finite state machines.",
            "Complete model-based equivalence class testing.",
            "A toolset for conformance testing against UML sequence diagrams based on event-driven colored Petri nets.",
            "Model-based testing for concurrent systems: unfolding-based test selection.",
            "Generating test case chains for reactive systems.",
            "Automated test generation using model checking: an industrial evaluation.",
            "Preface of the special issue on Model Checking of Software - Selected papers of the 20th International SPIN Symposium on Model Checking of Software.",
            "Automatic equivalence checking of programs with uninterpreted functions and integer arithmetic.",
            "Model checking unbounded concurrent lists.",
            "Verifying a quantitative relaxation of linearizability via refinement.",
            "Efficient model-checking of weighted CTL with upper-bound constraints.",
            "Guard-based partial-order reduction.",
            "Guided search for hybrid systems based on coarse-grained space abstractions.",
            "Parameterized verification.",
            "A unified view of parameterized verification of abstract models of broadcast communication.",
            "Parameterized verification through view abstraction.",
            "Counting dynamically synchronizing processes.",
            "Soundness of data-aware, case-centric processes.",
            "Parameterized model checking for security policy analysis.",
            "Scientific workflows.",
            "Using registries to integrate bioinformatics tools and services into workbench environments.",
            "A scalable Cloud-based system for data-intensive spatial analysis.",
            "Scientific workflows for process mining: building blocks, scenarios, and implementation.",
            "Scientific workflows with the jABC framework - A review after a decade in the field.",
            "Provably correct control flow graphs from Java bytecode programs with exceptions.",
            "Equivalence class verification of the contract net protocol-extension."
        ]
    },
    {
        "name": "STTT",
        "year": "2015",
        "info": "Volume 17, 2015",
        "count": 46,
        "papers": [
            "Assessing the effects of introducing a new software development process: a methodological description.",
            "Real-time specifications.",
            "Termination proofs for linear simple loops.",
            "A systematic review of state-based test tools.",
            "A construction and minimization service for continuous probability distributions.",
            "Functional prototypes for generic C++ libraries: a transformational approach based on higher-order, typed signatures.",
            "Testing abstract behavioral specifications.",
            "Runtime verification: the application perspective.",
            "On piggyback runtime monitoring of object-oriented programs.",
            "Rule-based runtime verification revisited.",
            "Statistical model checking QoS properties of systems with SBIP.",
            "Schedulability of Herschel revisited using statistical model checking.",
            "APSET, an Android aPplication SEcurity Testing tool for detecting intent-based vulnerabilities.",
            "Model-checking fair dense-time systems with propositions and events.",
            "A process for mastering security evolution in the development lifecycle.",
            "Security risk analysis of system changes exemplified within the oil and gas domain.",
            "Restoring security of evolving software models using graph transformation.",
            "Policy ignorant caller-side inline reference monitoring.",
            "A systematic classification of security regression testing approaches.",
            "Workflows for quantitative data analysis in the social sciences.",
            "Incremental test case generation using bounded model checking: an application to automatic rating.",
            "Statistical model checking for biological systems.",
            "Statistical model checking: challenges and perspectives.",
            "On hypothesis testing for statistical model checking.",
            "Uppaal SMC tutorial.",
            "Statistical model checking for unbounded until formulas.",
            "Sound statistical model checking for MDP using partial order and confluence reduction.",
            "Approximate planning and verification for large Markov decision processes.",
            "Smart sampling for lightweight verification of Markov decision processes.",
            "Statistical model checking for stochastic hybrid systems involving nondeterminism over continuous domains.",
            "Analysing oscillatory trends of discrete-state stochastic processes through HASL statistical model checking.",
            "Statistical model checking for biological applications.",
            "Modelling and statistical model checking of a microgrid.",
            "Special section on the 17th International Software Product Line Conference.",
            "Mapping the design-space of textual variability modeling languages: a refined analysis.",
            "Generating counterexamples of model-based software product lines.",
            "Systematic synthesis of delta modeling languages.",
            "Cloned product variants: from ad-hoc to managed software product lines.",
            "VerifyThis 2012 - A Program Verification Competition.",
            "Solving the VerifyThis 2012 challenges with VeriFast.",
            "KIV: overview and VerifyThis competition.",
            "SPARK 2014 and GNATprove - A competition report from builders of an industrial-strength verifying compiler.",
            "Let's verify this with Why3.",
            "Implementation-level verification of algorithms with KeY.",
            "AutoProof meets some verification challenges.",
            "Witnessing the elimination of magic wands."
        ]
    },
    {
        "name": "STTT",
        "year": "2014",
        "info": "Volume 16, 2014",
        "count": 46,
        "papers": [
            "Verification and validation meet planning and scheduling.",
            "A loop acceleration technique to speed up verification of automatically generated plans.",
            "Authorized workflow schemas: deciding realizability through $$\\mathsf{LTL }(\\mathsf{F })$$ model checking.",
            "Generating effective tests for concurrent programs via AI automated planning techniques.",
            "Open source software-defined radio tools for education, research, and rapid prototyping.",
            "Symbolic object code analysis.",
            "Constraint-based BMC: a backjumping strategy.",
            "Developments in automated verification techniques.",
            "Bounded phase analysis of message-passing programs.",
            "Pushdown model checking for malware detection.",
            "A bit too precise? Verification of quantized digital filters.",
            "Closed-loop verification of medical devices with model abstraction and refinement.",
            "History, status, and recent trends of the testing and test control notation version 3 (TTCN-3) - With a brief introduction to selected articles from the TTCN-3 user conference 2011.",
            "Quantifying the evolution of TTCN-3 as a language.",
            "Testing hybrid systems with TTCN-3 embedded - An extension of the TTCN-3 language.",
            "Innovation and evolution in integrated web application testing with TTCN-3.",
            "A conformance test suite for TTCN-3 tools - Black-Box functional testing of TTCN-3 syntax and semantics.",
            "A generic interoperability testing framework and a systematic development process for automated interoperability testing.",
            "Rule-based detection of design patterns in program code.",
            "Program verification and testing technologies.",
            "Formal verification and simulation for platform screen doors and collision avoidance in subway control systems.",
            "Expressive program verification via structured specifications.",
            "Automated verification of the FreeRTOS scheduler in Hip/Sleek.",
            "Quantitative and qualitative analysis of SysML activity diagrams.",
            "Quantitative modelling and analysis of a Chinese smart grid: a stochastic model checking case study.",
            "Model-based test generation using extended symbolic grammars.",
            "Rigorous examination of reactive systems - The RERS challenges 2012 and 2013.",
            "Property-driven benchmark generation: synthesizing programs of realistic structure.",
            "Thoughtful brute-force attack of the RERS 2012 and 2013 Challenges.",
            "Combining static analysis and state transition graphs for verification of event-condition-action systems in the RERS 2012 and 2013 challenges.",
            "BDD-based software verification - Applications to event-condition-action systems.",
            "Applying symbolic bounded model checking to the 2012 RERS greybox challenge.",
            "Analyzing program behavior through active automata learning.",
            "Tailored generation of concurrent benchmarks.",
            "A taxonomy of risk-based testing.",
            "Risk-based testing via active continuous quality control.",
            "Dynamic test planning: a study in an industrial context.",
            "A multiple case study on risk-based testing in industry.",
            "Approaches for the combined use of risk analysis and testing: a systematic literature review.",
            "Formal methods for railway control systems.",
            "From commercial documents to system requirements: an approach for the engineering of novel CBTC solutions.",
            "Towards Model-Driven V&V assessment of railway control systems.",
            "Techniques for modelling and verifying railway interlockings.",
            "Automated generation of formal safety conditions from railway interlocking tables.",
            "Survey on test data generation tools - An evaluation of white- and gray-box testing tools for C#, C++, Eiffel, and Java.",
            "Model checking evaluation of airplane landing trajectories."
        ]
    },
    {
        "name": "STTT",
        "year": "2013",
        "info": "Volume 15, 2013",
        "count": 36,
        "papers": [
            "The ALL-TIMES project: introduction and overview.",
            "Measurement and tracing methods for timing analysis - Independently and in combination with modelling methods.",
            "Architecture exploration and timing estimation during early design phases.",
            "Comparison of type-based and alias-based component recognition for embedded systems software.",
            "Practical experiences of applying source-level WCET flow analysis to industrial code.",
            "Estimation of productivity increase for timing analysis tool chains.",
            "Tools for software verification - Introduction to the special section from the seventeenth international conference on tools and algorithms for the construction and analysis of systems.",
            "CADP 2011: a toolbox for the construction and analysis of distributed processes.",
            "Büchi Store: an open repository of $$\\omega $$ -automata.",
            "Model-checking web services business activity protocols.",
            "Rigorous embedded design: challenges and perspectives.",
            "Component-based system design: analytic real-time interfaces for state-based component implementations.",
            "Compositional performance analysis with improved analysis techniques for obtaining viable end-to-end latencies in distributed embedded systems.",
            "Temporal isolation in real-time systems: the VBS approach.",
            "Timed-automata based schedulability analysis for distributed firm real-time systems: a case study.",
            "Tradeoff exploration between reliability, power consumption, and execution time for embedded systems - The TSH tricriteria scheduling heuristic.",
            "Monitoring properties of analog and mixed-signal circuits.",
            "Modeling task systems using parameterized partial orders.",
            "Model checking and abstract interpretation as building blocks of advanced program analysis techniques - Selected papers from TACAS 2009.",
            "From tests to proofs.",
            "Falsification of LTL safety properties in hybrid systems.",
            "Static analysis for concurrent programs with applications to data race detection.",
            "Selected dynamic issues in software model checking.",
            "A model-driven co-simulation environment for heterogeneous systems.",
            "An integrated framework for checking the behaviour of fUML models using CSP.",
            "Algorithmic program synthesis: introduction.",
            "Abstraction-guided synthesis of synchronization.",
            "Safety first: a two-stage algorithm for the synthesis of reactive systems.",
            "Functional synthesis for linear arithmetic and sets.",
            "Program sketching.",
            "Template-based program verification and program synthesis.",
            "Bounded synthesis.",
            "Exploiting structure in LTL synthesis.",
            "Debugging formal specifications: a practical approach using model-based diagnosis and counterstrategies.",
            "Synthesis of AMBA AHB from formal specification: a case study.",
            "Synthesis from component libraries."
        ]
    },
    {
        "name": "STTT",
        "year": "2012",
        "info": "Volume 14, 2012",
        "count": 37,
        "papers": [
            "An abstraction refinement approach combining precise and approximated techniques.",
            "Modelling and analysis using GROOVE.",
            "The common aspect proof environment.",
            "Statistical abstraction and model-checking of large heterogeneous systems.",
            "Coverage-biased random exploration of large models and application to testing.",
            "Selection of formal verification heuristics for parallel execution.",
            "Regular model checking.",
            "Extrapolating (omega-)regular model checking.",
            "Widening techniques for regular tree model checking.",
            "Abstract regular (tree) model checking.",
            "Domain-specific regular acceleration.",
            "A lightweight regular model checking approach for parameterized systems.",
            "Regular model checking for LTL(MSO).",
            "Introduction to the special section on runtime verification.",
            "An overview of the MOP runtime verification framework.",
            "Runtime verification of concurrency-specific correctness criteria.",
            "The Clara framework for hybrid typestate analysis.",
            "Software monitoring with controllable overhead.",
            "What can you verify and enforce at runtime?",
            "Model-based testing of software and systems: recent advances and challenges.",
            "Alternating simulation and IOCO.",
            "More testable properties.",
            "Model generation for quantified formulas with application to test data generation.",
            "Multi-objective optimization algorithms applied to the class integration and test order problem.",
            "Software diversity: state of the art and perspectives.",
            "Visualization of variability and configuration options.",
            "A constraint-based variability modeling framework.",
            "Revealing and repairing configuration inconsistencies in large-scale system software.",
            "A code tagging approach to software product line development - An application to satellite communication libraries.",
            "The ABS tool suite: modelling, executing and analysing distributed adaptable object-oriented systems.",
            "Model checking software product lines with SNIP.",
            "Facilitating the evolution of products in product line engineering by capturing and replaying configuration decisions.",
            "Relating software validation to technology trends.",
            "Timing analysis of MSC specifications with asynchronous concatenation.",
            "Formal modeling and validation of Stateflow diagrams.",
            "Constructive model-based analysis for safety assessment.",
            "Compositional verification of real-time systems using Ecdar."
        ]
    },
    {
        "name": "STTT",
        "year": "2011",
        "info": "Volume 13, 2011",
        "count": 37,
        "papers": [
            "New results in software model checking and analysis.",
            "Probabilistic reachability for parametric Markov models.",
            "Parallel probabilistic model checking on general purpose graphics processors.",
            "A decision procedure for detecting atomicity violations for communicating processes with locks.",
            "Symbolic analysis via semantic reinterpretation.",
            "Using model checking to identify errors in intrusion detection signatures.",
            "Guest editors' introduction to the special section from the international symposium on web systems evolution.",
            "Automating regression testing using web-based application similarities.",
            "Crawlability metrics for automated web testing.",
            "Are web applications more defect-prone than desktop applications?",
            "Automated maintenance of service compositions with SLA violation detection and dynamic binding.",
            "On porting software visualization tools to the web.",
            "Preface.",
            "Evaluating workloads using comparative functional coverage.",
            "Iterative delta debugging.",
            "Automatic boosting of cross-product coverage using Bayesian networks.",
            "Reducing the size of resolution proofs in linear time.",
            "A uniform approach to three-valued semantics for μ-calculus on abstractions of hybrid automata.",
            "Local abstraction-refinement for the μ-calculus.",
            "Path-oriented bounded reachability analysis of composed linear hybrid systems.",
            "Symbolic systems, explicit properties: on hybrid approaches for LTL symbolic model checking.",
            "ToolDAy: a tool for domain analysis.",
            "Formally based tool support for model checking Erlang applications.",
            "Recovery oriented programming: runtime monitoring of safety and liveness.",
            "Deductive software verification.",
            "Functional dependencies of C functions via weakest pre-conditions.",
            "SMT solvers: new oracles for the HOL theorem prover.",
            "Scenario-based testing from UML/OCL behavioral models - Application to POSIX compliance.",
            "An interval-based SAT modulo ODE solver for model checking nonlinear hybrid systems.",
            "Formal methods for security in the Xenon hypervisor.",
            "Preface to a special section on verification, model checking, and abstract interpretation.",
            "Finding concurrency-related bugs using random isolation.",
            "Synthesizing switching logic using constraint solving.",
            "An abort-aware model of transactional programming.",
            "Average-price-per-reward games on hybrid automata with strong resets.",
            "LTL generalized model checking revisited.",
            "SubPolyhedra: a family of numerical abstract domains for the (more) scalable inference of linear inequalities."
        ]
    },
    {
        "name": "STTT",
        "year": "2010",
        "info": "Volume 12, 2010",
        "count": 32,
        "papers": [
            "Toward a wider use of formal methods for aerospace systems design and verification.",
            "Seven at one stroke: LTL model checking for high-level specifications in B, Z, CSP, and more.",
            "Don't care in SMT: building flexible yet efficient abstraction/refinement solvers.",
            "Proved development of the real-time properties of the IEEE 1394 Root Contention Protocol with the event-B method.",
            "A framework for robust active super tier systems.",
            "A class library for implementing, testing, and debugging concurrent programs.",
            "Model checking software: on some new waves and some evergreens.",
            "An embeddable virtual machine for state space generation.",
            "Distributed dynamic partial order reduction.",
            "LTL satisfiability checking.",
            "Scalable shared memory LTL model checking.",
            "Solving the ignoring problem for partial order reduction.",
            "Graph transformation tool contest 2008.",
            "A case study to evaluate the suitability of graph transformation tools for program refactoring.",
            "Model refactoring using MoTMoT.",
            "Experimental assessment of combining pattern matching strategies with VIATRA2.",
            "Manual and automated performance optimization of model transformation systems.",
            "Introduction to AGG and EMF Tiger by modeling a Conference Scheduling System.",
            "GrGen.NET - The expressive, convenient and fast graph rewrite system.",
            "Evaluation of Kermeta for solving graph-based problems.",
            "Fujaba case studies for GraBaTs 2008: lessons learned.",
            "Synthesis and stochastic assessment of cost-optimal schedules.",
            "Exploiting resolution proofs to speed up LTL vacuity detection for BMC.",
            "Data decision diagrams for Promela systems analysis.",
            "MontiCore: a framework for compositional development of domain specific languages.",
            "Data-abstraction refinement: a game semantic approach.",
            "Oris: a tool for modeling, verification and evaluation of real-time systems.",
            "Verified software: theories, tools and experiments.",
            "Combining predicate and numeric abstraction for software model checking.",
            "Towards an industrial grade IVE for Java and next generation research platform for JML.",
            "Rodin: an open toolset for modelling and reasoning in Event-B.",
            "Improved usability and performance of SMT solvers for debugging specifications."
        ]
    },
    {
        "name": "STTT",
        "year": "2009",
        "info": "Volume 11, 2009",
        "count": 38,
        "papers": [
            "Software model checking is a rich research field.",
            "Parallel and distributed model checking in Eddy.",
            "Directed model checking with distance-preserving abstractions.",
            "Partial-order reduction for general state exploring algorithms.",
            "Symbolic execution with abstraction.",
            "Bounded model checking of software using SMT solvers instead of SAT solvers.",
            "Special section on advances in reachability analysis and decision procedures: contributions to abstraction-based system verification.",
            "An abstraction-based decision procedure for bit-vector arithmetic.",
            "A low-level memory model and an accompanying reachability predicate.",
            "Decision-diagram-based techniques for bounded reachability checking of asynchronous systems.",
            "The worst-case execution time tool challenge 2006.",
            "Automated implementation of complex distributed algorithms specified in the IOA language.",
            "Guest Editor's introduction.",
            "An automated testing experiment for layered embedded C code.",
            "Model checking C source code for embedded systems.",
            "Flexibility in modeling languages and tools: a call to arms.",
            "System-on-chip design by proof-based refinement.",
            "Encoding a process algebra using the Event B method.",
            "Satisfiability solving for software verification.",
            "Formalizing interoperability for test case generation purpose.",
            "Haifa verification conference 2007.",
            "GenUTest: a unit test and mock aspect generation tool.",
            "Using Bayesian networks and virtual coverage to hit hard-to-reach events.",
            "Dynamic testing via automata learning.",
            "Approximating the safely reusable set of learned facts.",
            "A survey of new trends in symbolic execution for software testing and analysis.",
            "Preface.",
            "Checking the reliability of socket based communication software.",
            "Solving scheduling problems by untimed model checking.",
            "LearnLib: a framework for extrapolating behavioral models.",
            "Flush: an example of development by refinements in SCADE/Lustre.",
            "Special section on Web Systems Evolution.",
            "From objects to services: toward a stepwise migration approach for Java applications.",
            "A pilot project for migrating COBOL code to web services.",
            "Consistent Web site updating based on bidirectional transformation.",
            "An approach and an Eclipse-based environment for enhancing the navigation structure of Web sites.",
            "The RE-UWA approach to recover user centered conceptual models from Web applications.",
            "An approach for estimating the time needed to perform code changes in business applications."
        ]
    },
    {
        "name": "STTT",
        "year": "2008",
        "info": "Volume 10, 2008",
        "count": 41,
        "papers": [
            "Special section on Coloured Petri Nets.",
            "Model-based development of a course of action scheduling tool.",
            "From task descriptions via colored Petri nets towards an implementation of a new electronic patient record workflow system.",
            "Analysis of the Datagram Congestion Control Protocol's connection management procedures using the sweep-line method.",
            "Discovering colored Petri nets from event logs.",
            "Modelling defence logistics networks.",
            "Protos2CPN: using colored Petri nets for configuring and testing business processes.",
            "Improving the effectiveness of system verification.",
            "Efficient guided symbolic reachability using reachability expressions.",
            "Exploiting traces in static program analysis: better model checking through printf{{\\tt printf}}s.",
            "An approach for experimentally evaluating effectiveness and efficiency of coverage criteria for software testing.",
            "A negative result on depth-first net unfoldings.",
            "Improving state class constructions for CTL* model checking of time Petri nets.",
            "ProB: an automated analysis toolset for the B method.",
            "Introduction to the special section on self-optimizing mechatronic systems.",
            "Tool support for the design of self-optimizing mechatronic multi-agent systems.",
            "A new approach for online multiobjective optimization of mechatronic systems.",
            "Coping with large design spaces: design problem solving in fluidic engineering.",
            "Static verification of component composition in contextual composition frameworks.",
            "PHAVer: algorithmic verification of hybrid systems past HyTech.",
            "Introduction to the special section on advances in test automation: the evolution of TTCN-3.",
            "Introduction of TTCN-3 into the product development process: considerations from an electronic devices developer point of view.",
            "Automating test automation.",
            "From testing to anti-product development.",
            "An approach to quality engineering of TTCN-3 test specifications.",
            "Test suite development with TTCN-3 libraries.",
            "Automatic CoDec generation to reduce test engineering cost.",
            "Refactoring and converting a TTCN-2 test suite.",
            "Standardized TTCN-3 specifications for SIP-ISUP/ISDN interworking testing.",
            "An IMS Performance Benchmark Implementation based on the TTCN-3 Language.",
            "Framework testing of web applications using TTCN-3.",
            "Testing hybrid control systems with TTCN-3: an overview on continuous TTCN-3.",
            "FAST: acceleration from theory to practice.",
            "A uniform framework for weighted decision diagrams and its implementation.",
            "Properties of state spaces and their applications.",
            "FTSyn: a framework for automatic synthesis of fault-tolerance.",
            "Special section on testing and security of Web systems.",
            "A case study-based comparison of web testing techniques applied to AJAX web applications.",
            "Healing Web applications through automatic workarounds.",
            "Automated verification of access control policies using a SAT solver.",
            "Modeling and proving functional completeness in formal verification of counting heads."
        ]
    },
    {
        "name": "STTT",
        "year": "2007",
        "info": "Volume 9, 2007",
        "count": 35,
        "papers": [
            "On the expressiveness of MTL in the pointwise and continuous semantics.",
            "The FSAP/NuSMV-SA Safety Analysis Platform.",
            "Some current topics in model checking.",
            "Compositional software verification based on game semantics and process algebra.",
            "Model-checking the preservation of temporal properties upon feature integration.",
            "Formal verification of the NASA runway safety monitor.",
            "CTL-property Transformations along an Incremental Design Process.",
            "Improved verification of hardware designs through antecedent conditioned slicing.",
            "MDA-based Automatic OWL Ontology Development.",
            "VeriTech: a framework for translating among model description notations.",
            "Introduction to the special section on FASE 2003.",
            "Aspect-oriented Component Composition in PacoSuite Through Invasive Composition Adapters.",
            "CCDL: the composable components description language.",
            "An ontology for software component matching.",
            "Towards UML-based formal specifications of component-based real-time software.",
            "Model-driven development of reactive information systems: from graph transformation rules to JML contracts.",
            "Special section on coloured Petri nets.",
            "Coloured Petri Nets and CPN Tools for modelling and validation of concurrent systems.",
            "Formal specification and state space analysis of an operational planning process.",
            "Modelling and analysing the functional behaviour of TCP's connection management procedures.",
            "Verification of the Capability Exchange Signalling protocol.",
            "Modelling work distribution mechanisms using Colored Petri Nets.",
            "Requirements Validation: Execution of UML Models with CPN Tools.",
            "Checking safety properties on-the-fly with the sweep-line method.",
            "Modular state space exploration for timed petri nets.",
            "Widening operators for powerset domains.",
            "Introduction to the special section on fundamental approaches to software engineering.",
            "A correlation framework for the CORBA component model.",
            "A framework for counterexample generation and exploration.",
            "An operational semantics for Stateflow.",
            "Model based development of access policies.",
            "Modeling software product lines using color-blind transition systems.",
            "Slicing concurrent Java programs using Indus and Kaveri.",
            "The software model checker Blast.",
            "Tools for secure systems development with UML."
        ]
    },
    {
        "name": "STTT",
        "year": "2006",
        "info": "Volume 8, 2006",
        "count": 47,
        "papers": [
            "Why you should definitely read this special section.",
            "The saturation algorithm for symbolic state-space exploration.",
            "Efficient BDDs for bounded arithmetic constraints.",
            "CAESAR_SOLVE: A generic library for on-the-fly resolution of alternation-free Boolean equation systems.",
            "Pattern-based abstraction for verifying secrecy in protocols.",
            "Interactive visualization of large state spaces.",
            "Preface of \"Specification and Validation of Real Time and Embedded systems in UML\".",
            "A semantics of communicating reactive objects with timing.",
            "A real-time profile for UML.",
            "Validating timed UML models by simulation and verification.",
            "Towards a \"Synchronous Reactive\" UML profile?",
            "On a time enriched OCL liveness template.",
            "The HybridUML profile for UML 2.0.",
            "Tools and algorithms for the construction and analysis of systems.",
            "What the small Rubik's cube taught me about data structures, information theory, and randomisation.",
            "Automated generation of a progress measure for the sweep-line method.",
            "Lower and upper bounds in zone-based abstractions of timed automata.",
            "Numerical vs. statistical probabilistic model checking.",
            "Error explanation with distance metrics.",
            "Online efficient predictive safety analysis of multithreaded programs.",
            "Liveness with invisible ranking.",
            "Checking JML specifications using an extensible software model checking framework.",
            "The industrialization of formal methods.",
            "Proving the shalls.",
            "Formal change impact analyses for emulated control software.",
            "Software tools for safety-critical software development.",
            "Introductory Paper.",
            "Inductive assertions and operational semantics.",
            "Coverage metrics for formal verification.",
            "Efficient distributed SAT and SAT-based distributed Bounded Model Checking.",
            "Finite horizon analysis of Markov Chains with the Murphi verifier.",
            "Putting it all together - Formal verification of the VAMP.",
            "Toward diagrammability and efficiency in event-sequence languages.",
            "Widening operators for powerset domains.",
            "Special Section on \"Leveraging Formal Methods\".",
            "A formal framework for verifying distributed embedded systems based on abstraction methods.",
            "Compositional specification of commercial contracts.",
            "Case studies with Lurette V2.",
            "Tool Support for Estimating the Memory Usage of Mobile Phone Software.",
            "Formal and experimental validation approaches in HCI systems design based on a shared event B model.",
            "Rule-based verification of Web sites.",
            "Experiences applying formal approaches in the development of swarm-based space exploration systems.",
            "Guest editors' introduction: quantitative analysis of real-time embedded systems.",
            "Automated model generation for performance engineering of building automation networks.",
            "A formal analysis of bluetooth device discovery.",
            "Model checker aided design of a controller for a wafer scanner.",
            "System architecture evaluation using modular performance analysis: a case study."
        ]
    },
    {
        "name": "STTT",
        "year": "2005",
        "info": "Volume 7, 2005",
        "count": 31,
        "papers": [
            "Introductory paper.",
            "Issues in distributed timed model checking.",
            "Distributed reachability analysis in timed automata.",
            "Parallel search for LTL violations.",
            "Sequential and distributed model checking of Petri nets.",
            "Assumption-based distribution of CTL model checking.",
            "A distributed algorithm for strong bisimulation reduction of state spaces.",
            "Introductory paper.",
            "BMC via on-the-fly determinization.",
            "A BMC-based formulation for the scheduling problem of hardware systems.",
            "Symbolic computational techniques for solving games.",
            "Are BDDs still alive within sequential verification?",
            "Abstraction refinement in symbolic model checking using satisfiability as the only decision procedure.",
            "A survey of recent advances in SAT-based formal verification.",
            "Computational challenges in bounded model checking.",
            "Functional programming languages for verification tools: a comparison of Standard ML and Haskell.",
            "Introductory paper.",
            "Integration of informal and formal development of object-oriented safety-critical software.",
            "An overview of JML tools and applications.",
            "A verification approach to applied system security.",
            "prialt in Handel-C: an operational semantics.",
            "Formal verification of fault tolerance in safety-critical reconfigurable modules.",
            "Distributed state space minimization.",
            "Introductory paper.",
            "TGV: theory, principles and algorithms.",
            "Test distribution: a solution for complex network system testing.",
            "System-level functional testing from UML specifications in end-of-production industrial environments.",
            "Live sequence charts applied to hardware requirements specification and verification.",
            "Distributed functional and load tests for Web services.",
            "Test generation for radiotherapy accelerators.",
            "Practical quality assurance for standards-based, high-availability middleware."
        ]
    },
    {
        "name": "STTT",
        "year": "2004",
        "info": "Volume 6, 2004",
        "count": 24,
        "papers": [
            "Preface by the section editors.",
            "Behavior-based model construction.",
            "Certification of compiled assembly code by invariant translation.",
            "A logical encoding of the pi-calculus: model checking mobile processes using tabled resolution.",
            "Using simulated execution in verifying distributed algorithms.",
            "Efficient verification of timed automata with BDD-like data structures.",
            "Guest editors' introduction: Advancements and extensions of verification techniques.",
            "Fate and free will in error traces.",
            "Exploring very large state spaces using genetic algorithms.",
            "Probabilistic symbolic model checking with PRISM: a hybrid approach.",
            "CLPS-B - A constraint solver to animate a B specification.",
            "Efficient monitoring of safety properties.",
            "Test sequence generation and model checking using dynamic transition relations.",
            "Introduction.",
            "CHEOPS: A tool-integration platform for chemical process modelling and simulation.",
            "Tool integration at the meta-model level: the Fujaba approach.",
            "Thoth - A publish/subscribe architecture for peer-to-peer tool integration.",
            "An agent-based approach to tool integration.",
            "Type-based initialization analysis of a synchronous dataflow language.",
            "Introductory paper.",
            "Heuristics for model checking Java programs.",
            "Partial-order reduction and trail improvement in directed model checking.",
            "Symmetry reductions for model checking of concurrent dynamic software.",
            "Exploiting transition locality in automatic verification of finite-state concurrent systems."
        ]
    },
    {
        "name": "STTT",
        "year": "2003",
        "info": "Volume 5, 2003/2004",
        "count": 27,
        "papers": [
            "Introductory paper: scalability aspects of validation.",
            "Satisfiability checking using Boolean Expression Diagrams.",
            "A symbolic manipulator for automated verification of reactive systems with heterogeneous data types.",
            "Finding feasible abstract counter-examples.",
            "Boolean and Cartesian abstraction for model checking C programs.",
            "Automated test generation from timed automata.",
            "Compositional message sequence charts.",
            "A mutation analysis tool for Java programs.",
            "Introductory paper.",
            "Lightweight coarse-grained coordination: a scalable system-level approach.",
            "Validation and automatic test generation on UML models: the AGATHA approach.",
            "Model-based testing for real.",
            "Counter-example generation in symbolic abstract model-checking.",
            "aSPIN: A tool for abstract model checking.",
            "Efficient reduction of finite state model checking to reachability analysis.",
            "Development of a verified Erlang program for resource locking.",
            "Automatic verification of the IEEE 1394 root contention protocol with KRONOS and PRISM.",
            "Properties of two's complement floating point notations.",
            "Directed explicit-state model checking in the validation of communication protocols.",
            "Covering sharing trees: a compact data structure for parameterized verification.",
            "Introductory paper.",
            "Formal methods software engineering for the CARA system.",
            "Formal specifications and analysis of the computer-assisted resuscitation algorithm (CARA) Infusion Pump Control System.",
            "A case study on applying formal methods to medical devices: computer-aided resuscitation algorithm.",
            "Formally specifying CARA in Java.",
            "Unit verification: the CARA experience.",
            "Requirements-document-based prototyping of CARA software."
        ]
    },
    {
        "name": "STTT",
        "year": "2002",
        "info": "Volume 4, 2002/2003",
        "count": 38,
        "papers": [
            "What makes good research in software engineering?",
            "Program model checking as a new trend.",
            "Verification and optimization of a PLC control schedule.",
            "Expressing checkable properties of dynamic systems: the Bandera Specification Language.",
            "Testing LTL formula translation into Büchi automata.",
            "Model-checking multi-threaded distributed Java programs.",
            "Symmetric Spin.",
            "Using symbolic CTL model checking to verify the railway stations of Hoorn-Kersenboogerd and Heerhugowaard.",
            "Program slicing for VHDL.",
            "Preface by the section editor.",
            "Using static analysis to improve automatic test generation.",
            "A tool for model-checking Markov chains.",
            "Efficient verification of security protocols using partial-order reductions.",
            "The PROSPER toolkit.",
            "A systematic incrementalization technique and its application to hardware design.",
            "Vacuity detection in temporal model checking.",
            "Comparison of SPIN and VIS for protocol verification.",
            "Managing the verification trajectory.",
            "Platitudes and attitudes.",
            "Preface by the section editor.",
            "Higher-level techniques for hardware description and synthesis.",
            "A framework for superscalar microprocessor correctness statements.",
            "Hierarchical formal verification using a hybrid tool.",
            "Proof engineering in the large: formal verification of Pentium?4 floating-point divider.",
            "Efficient debugging in a formal verification environment.",
            "Using Lava to design and verify recursive and periodic sorters.",
            "Refinement-based formal verification with heterogeneous timing.",
            "Formal verification of conflict detection algorithms.",
            "A framework for distributing object-oriented designs.",
            "Main issues in protocol testing.",
            "Preface by the section editors.",
            "A verification tool for ERLANG.",
            "The development of the HiPE system: design and experience report.",
            "Worst-case execution-time analysis for embedded real-time systems.",
            "Generating online test oracles from temporal logic specifications.",
            "Security by typing.",
            "Scalable distributed on-the-fly symbolic model checking.",
            "Fighting livelock in the GNU i-protocol: a case study in explicit-state model checking."
        ]
    },
    {
        "name": "STTT",
        "year": "2000",
        "info": "Volume 3, 2000/2001",
        "count": 34,
        "papers": [
            "Theorem proving in technology transfer: the user's point of view.",
            "Verification of Year 2000 conversion rules using the ACL2 theorem prover.",
            "High-automation proofs for properties of requirements models.",
            "Using an induction prover for verifying arithmetic circuits.",
            "VSE: formal methods meet industrial needs.",
            "Mechanized result verification: an industrial application.",
            "Detecting races in Relay Ladder Logic programs.",
            "Verification is experimentation!",
            "Binary decision diagrams in theory and practice.",
            "Verification of arithmetic circuits using binary moment diagrams.",
            "Zero-suppressed BDDs and their applications.",
            "Efficient manipulation of decision diagrams.",
            "A word-level graph manipulation package.",
            "Design of experiments and evaluation of BDD ordering heuristics.",
            "Application of BDDs in Boolean matching techniques for formal logic combinational verification.",
            "Parallel programming with a pattern language.",
            "Application-controlled memory management in a single address space environment.",
            "Alternative Approaches to Symbolic Verification - Preface by the Section Editor.",
            "Constraint-based deductive model checking.",
            "Bisimulation verification using the up to techniques.",
            "A light-weight framework for hardware verification.",
            "System design of a CC-NUMA multiprocessor architecture using formal specification, model-checking, co-simulation, and test generation.",
            "A case study in class library verification: Java's vector class.",
            "Formal design and analysis of a gear controller.",
            "Special Section on the Practical Use of High-Level Petri Nets: Preface by the section editor.",
            "Specification and validation of a concurrent system: an educational project.",
            "Modelling and analysing a distributed dynamic channel allocation algorithm for mobile computing using high-level net methods.",
            "Executable Petri net models for the analysis of metabolic pathways.",
            "Web-based interfaces for simulation of coloured Petri net models.",
            "Implementing compositionality for stochastic Petri nets.",
            "Mechanical verification of the IEEE 1394a root contention protocol using Uppaal2k.",
            "Generating an action notation environment from Montages descriptions.",
            "Easy concurrency.",
            "The Petri Net Kernel - An infrastructure for building Petri net tools."
        ]
    },
    {
        "name": "STTT",
        "year": "1998",
        "info": "Volume 2, 1998-2000",
        "count": 34,
        "papers": [
            "Paul Feyerabend and Software Technology.",
            "Program Analysis Tools.",
            "Behavior Analysis for Validating Communication Patterns.",
            "Semantics-Based Program Analysis for Logic-Based Languages Using XSB.",
            "PAG - An Efficient Program Analyzer Generator.",
            "Verification of the Link Layer Protocol of the IEEE-1394 Serial Bus (FireWire): An Experiment with E-LOTOS.",
            "A Verification Tool Seveloper's Vade Mecum.",
            "Coloured Petri Nets - Preface by the Section Editor.",
            "The Practitioner's Guide to Coloured Petri Nets.",
            "Analyzing the Execution Architecture of Mobile Phone Software with Colored Petri Nets.",
            "Analysing a Missile Simulator with Coloured Petri Nets.",
            "Analysing a Mechatronic System with Coloured Petri Nets.",
            "Creating Executable Models of Influence Nets with Colored Petri Nets.",
            "Analysing Superscalar Processor Architectures with Coloured Petri Nets.",
            "The Code Validation Tool CVT: Automatic Verification of a Compilation Process.",
            "Integrating Printed and Online Information.",
            "A Workshop on Formal Methods Education: An Aggregation of Opinions.",
            "Pragmatics of Model Checking: An STTT Special Section.",
            "Local Model Checking and Protocol Analysis.",
            "Partial Model Checking of Modal Equations: A Survey.",
            "Analysis and Verification of Real-Time Systems Using Quantitative Symbolic Algorithms.",
            "A Minimized Automaton Representation of Reachable States.",
            "State Space Reduction Using Partial Order Techniques.",
            "Model Checking: A Hardware Design Perspective.",
            "Programming in FISh.",
            "Benchmarking Finite-State Verifiers.",
            "SPIN Model Checking: An Introduction.",
            "Control and Data Abstraction: The Cornerstones of Practical Formal Verification.",
            "Issues in Slicing PROMELA and Its Applications to Model Checking, Protocol Understanding, and Simulation.",
            "Practical CTL* Model Checking: Should SPIN be Extended?",
            "Model Checking JAVA Programs using JAVA PathFinder.",
            "On-the-fly Conformance Testing using SPIN.",
            "Formalization and Validation of the General Inter-ORB Protocol (GIOP) using PROMELA and SPIN.",
            "NUSMV: A New Symbolic Model Checker."
        ]
    },
    {
        "name": "STTT",
        "year": "1997",
        "info": "Volume 1, 1997/1998",
        "count": 12,
        "papers": [
            "Editorial.",
            "The Meaning of \"Formal\": From Weak to Strong Formal Methods.",
            "The Electronic Tool Integration Platform: Concepts and Design.",
            "Integrating Tools in the ETI Platform.",
            "Interacting with ETI: A User Session.",
            "Continuous Modeling of Real-Time and Hybrid Systems: From Concepts to Tools.",
            "Real-Time System = Discrete System + Clock Variables.",
            "HYTECH: A Model Checker for Hybrid Systems.",
            "KRONOS: A Verification Tool for Real-Time Systems.",
            "UPPAAL in a Nutshell.",
            "OMT and SDL Based Techniques and Tools for Design, Simulation and Test Production of Distributed Systems.",
            "Protocol Verification with the ALDÉBARAN Toolset."
        ]
    }
]