[
    {
        "name": "STVR",
        "year": "2022",
        "info": "Volume 32: 2022",
        "count": 8,
        "papers": [
            "Model checking, testing and debugging.",
            "Model checking C++ programs.",
            "GPU acceleration of finite state machine input execution: Improving scale and performance.",
            "Survey on test case generation, selection and prioritization for cyber-physical systems.",
            "Effective fault localization and context-aware debugging for concurrent programs.",
            "Combinatorial testing and model-based testing.",
            "Combinatorial methods for testing Internet of Things smart home systems.",
            "Effective grey-box testing with partial FSM models."
        ]
    },
    {
        "name": "STVR",
        "year": "2021",
        "info": "Volume 31: 2021",
        "count": 34,
        "papers": [
            "Special Issue: IEEE International Conference on Software Testing, Validation & Verification 2018.",
            "DEMINER: test generation for high test coverage through mutant exploration.",
            "Effective automated repair of internationalization presentation failures in web applications using style similarity clustering and search-based techniques.",
            "Special issue on new generations of UI testing.",
            "Functional test generation from UI test scenarios using reinforcement learning for android applications.",
            "testar - scriptless testing through graphical user interface.",
            "Comparing the effectiveness of capture and replay against automatic input generation for Android graphical user interface testing.",
            "Generating and selecting resilient and maintainable locators for Web automated testing.",
            "Sidereal: Statistical adaptive generation of robust locators for web testing.",
            "The IEEE 12th International Conference on Software Testing, Verification & Validation.",
            "Automated visual classification of DOM-based presentation failure reports for responsive web pages.",
            "BUGSJS: a benchmark and taxonomy of JavaScript bugs.",
            "Statically driven generation of concurrent tests for thread-safe classes.",
            "Editorial: Testing, Debugging, and Defect Prediction.",
            "Performance mutation testing.",
            "Localizing software performance regressions in web applications by comparing execution timelines.",
            "How detrimental is coincidental correctness to coverage-based fault detection and localization? An empirical study.",
            "CSSG: A cost-sensitive stacked generalization approach for software defect prediction.",
            "Cover Image.",
            "Editorial: Verification, reliability and performance.",
            "Verification algebra for multi-tenant applications in VaaS architecture.",
            "Entropy based enhanced particle swarm optimization on multi-objective software reliability modelling for optimal testing resources allocation.",
            "Performance assessment based on stochastic differential equation and effort data for edge computing.",
            "Adaptive or embedded software testing and mutation testing.",
            "Testing of adaptive and context-aware systems: approaches and challenges.",
            "Remote embedded devices test framework on the cloud.",
            "Analysing the combination of cost reduction techniques in Android mutation testing.",
            "An ensemble-based predictive mutation testing approach that considers impact of unreached mutants.",
            "Erratum.",
            "Property generation/verification and empirical studies.",
            "Documentation-based functional constraint generation for library methods.",
            "An empirical study of Linespots: A novel past-fault algorithm.",
            "Integrating pattern matching and abstract interpretation for verifying cautions of microcontrollers.",
            "Empirical analysis of practitioners' perceptions of test flakiness factors."
        ]
    },
    {
        "name": "STVR",
        "year": "2020",
        "info": "Volume 30: 2020",
        "count": 23,
        "papers": [
            "Special issue on testing extra-functional properties.",
            "An exploration of effective fuzzing for side-channel cache leakage.",
            "Reducing the maintenance effort for parameterization of representative load tests using annotations.",
            "Leveraging metamorphic testing to automatically detect inconsistencies in code generator families.",
            "Special issue: ISSRE 2018, the 29th IEEE International Symposium on Software Reliability Engineering.",
            "Using mutants to help developers distinguish and debug (compiler) faults.",
            "Testing microservice architectures for operational reliability.",
            "Model-based hypothesis testing of uncertain software systems.",
            "Fully Automated HTML and JavaScript Rewriting for Constructing a Self-healing Web Proxy.",
            "Facilitating program performance profiling via evolutionary symbolic execution.",
            "Working Across Boundaries.",
            "A verified and optimized Stream X-Machine testing method, with application to cloud service certification.",
            "Search-based crash reproduction using behavioural model seeding.",
            "Conference Virtualization.",
            "Can operational profile coverage explain post-release bug detection?",
            "TimelyRep: Timing deterministic replay for Android web applications.",
            "On automation in software engineering.",
            "Automatic monitoring of service reliability for web applications: a simulation-based approach.",
            "Automatically identifying potential regressions in the layout of responsive web pages.",
            "Editorial for the special issue of STVR on the 10th IEEE International Conference on Software Testing, Verification, and Validation (ICST 2017).",
            "Choosing the fitness function for the job: Automated generation of test suites that detect real faults.",
            "Complexity vulnerability analysis using symbolic execution.",
            "Model-based testing of Apache ZooKeeper: Fundamental API usage and watchers."
        ]
    },
    {
        "name": "STVR",
        "year": "2019",
        "info": "Volume 29: 2019",
        "count": 19,
        "papers": [
            "Special issue on mutation testing and analysis.",
            "On strong mutation and the theory of subsuming logic-based mutants.",
            "Possibility of cost reduction by mutant clustering according to the clustering scope.",
            "Empirical evaluation of mutation-based test case prioritization techniques.",
            "MuMonDE: A framework for evaluating model clone detectors using model mutation analysis.",
            "Fault-based test generation for regular expressions by mutation.",
            "Mutation operators for feature-oriented software product lines.",
            "I love journal papers and you should too.",
            "Event tree algorithms to generate test sequences for composite Web services.",
            "Coincidental correctness in the Defects4J benchmark.",
            "Farewell and thanks for all the reviews.",
            "A formal approach to automatically analyse extra-functional properties in mobile applications.",
            "Choosing the fitness function for the job: Automated generation of test suites that detect real faults.",
            "The world changes.",
            "An improved software reliability prediction model by using high precision error iterative analysis method.",
            "An end-user-centric test generation methodology for performance evaluation of mobile networked applications.",
            "Editorial: New Chapter Ahead.",
            "A heterogeneous single changepoint software reliability growth model framework.",
            "Memory models in symbolic execution: key ideas and new thoughts."
        ]
    },
    {
        "name": "STVR",
        "year": "2018",
        "info": "Volume 28: 2018",
        "count": 24,
        "papers": [
            "Editorial: Do we need to teach ethics to PhD students?",
            "Why does the orientation change mess up my Android application? From GUI failures to code faults.",
            "CoopREP: Cooperative record and replay of concurrency bugs.",
            "Editorial: Self-plagiarism is not a thing.",
            "Heterogeneous fault prediction with cost-sensitive domain adaptation.",
            "Improving lazy abstraction for SCR specifications through constraint relaxation.",
            "Proper references is a matter of scholarship, ethics, and courtesy.",
            "Systematic testing of actor systems.",
            "Verifying OSEK/VDX automotive applications: A Spin-based model checking approach.",
            "Why don't we publish more TDD research papers?",
            "Random or evolutionary search for object-oriented test suite generation?",
            "Pesto: Automated migration of DOM-based Web tests towards the visual approach.",
            "What is the value of the peer-reviewing system?",
            "Neural network for software reliability analysis of dynamically weighted NHPP growth models with imperfect debugging.",
            "Speeding up test execution with increased cache locality.",
            "What is a facade journal?",
            "A novel reliability analysis approach for component-based software based on the complex network theory.",
            "A systematic literature review of how mutation testing supports quality assurance processes.",
            "How can we recognize facade journals?",
            "A hybrid approach to testing for nonfunctional faults in embedded systems using genetic algorithms.",
            "Approaches for computing test-case-aware covering arrays.",
            "Why do people publish in facade journals?",
            "MobSTer: A model-based security testing framework for web applications.",
            "An automated functional testing approach for virtual reality applications."
        ]
    },
    {
        "name": "STVR",
        "year": "2017",
        "info": "Volume 27: 2017",
        "count": 21,
        "papers": [
            "Editorial: Accepting shortened papers hurts science.",
            "Automatic property-based testing and path validation of XQuery programs.",
            "Test suite completeness and black box testing.",
            "How to manage a conference special issue.",
            "Pattern-based GUI testing: Bridging the gap between design and quality assurance.",
            "Bounded model checking of C++ programs based on the Qt cross-platform framework.",
            "Is paper reviewing a transaction, a service, or an opportunity?",
            "Assessment of C++ object-oriented mutation operators: A selective mutation approach.",
            "An automated framework to support testing for process-level race conditions.",
            "Editorial for the special issue of STVR on the 8th IEEE International Conference on Software Testing, Verification, and Validation (ICST 2015).",
            "QuickChecking static analysis properties.",
            "Causal inference based fault localization for numerical software with NUMFL.",
            "Detecting display energy hotspots in Android apps.",
            "Prioritizing manual test cases in rapid release environments.",
            "Evaluating code-based test input generator tools.",
            "Editorial: Beware of predatory journals.",
            "Debugging-workflow-aware software reliability growth analysis.",
            "Prioritizing MCDC test cases by spectral analysis of Boolean functions.",
            "Color figures considered harmful.",
            "Impediments for software test automation: A systematic literature review.",
            "GUICop: Approach and toolset for specification-based GUI testing."
        ]
    },
    {
        "name": "STVR",
        "year": "2016",
        "info": "Volume 26: 2016",
        "count": 28,
        "papers": [
            "The dreaded desk reject.",
            "Anomaly detection in performance regression testing by transaction profile estimation.",
            "Cause reduction: delta debugging, even without bugs.",
            "Automatic fault localization for client-side JavaScript.",
            "How to revise a research paper.",
            "A lightweight framework for dynamic GUI data verification based on scripts.",
            "Model-based security testing: a taxonomy and systematic classification.",
            "Generating effective test cases based on satisfiability modulo theory solvers for service-oriented workflow applications.",
            "How to write an effective \"Response to Reviewers\" letter.",
            "Probabilistic reasoning in diagnosing causes of program failures.",
            "Behaviour abstraction adequacy criteria for API call protocol testing.",
            "Predicting metamorphic relations for testing scientific software: a machine learning approach using graph kernels.",
            "Editorial: STVR policy on extending conference papers to journal submissions.",
            "Stochastic modelling and simulation approaches to analysing enhanced fault tolerance on service-based software systems.",
            "Exhaustive test sets for algebraic specifications.",
            "Using combinatorial testing to build navigation graphs for dynamic web applications.",
            "Editorial: Changes to STVR's Editorial Board.",
            "A general modeling and analysis framework for software fault detection and correction process.",
            "Seeding strategies in search-based unit test generation.",
            "Prioritizing test cases for early detection of refactoring faults.",
            "Editorial.",
            "Simulink fault localization: an iterative statistical debugging approach.",
            "UCov: a user-defined coverage criterion for test case intent verification.",
            "Editorial: How to extend a conference paper to a journal paper.",
            "Non-negative sparse-based SemiBoost for software defect prediction.",
            "Past-Free[ze] reachability analysis: reaching further with DAG-directed exhaustive state-space analysis.",
            "Editorial: The Downward Death Spiral Review Process.",
            "A simplification of a real-time verification problem."
        ]
    },
    {
        "name": "STVR",
        "year": "2015",
        "info": "Volume 25: 2015",
        "count": 31,
        "papers": [
            "Editorial: Plagiarism Is For Losers.",
            "Specification guidelines to avoid the state space explosion problem.",
            "Formal firewall conformance testing: an application of test and proof techniques.",
            "Editorial: Who Is An Author?",
            "Directed test suite augmentation: an empirical investigation.",
            "Reducing execution profiles: techniques and benefits.",
            "Automated metamorphic testing of variability analysis tools.",
            "Special issue on testing, analysis and debugging of concurrent programs.",
            "UNICORN: a unified approach for localizing non-deadlock concurrency bugs.",
            "A survey of race bug detection techniques for multithreaded programmes.",
            "Object-sensitive cost analysis for concurrent objects.",
            "Advances in noise-based testing of concurrent software.",
            "Empirical evaluation of a new composite approach to the coverage criteria and reachability testing of concurrent programs.",
            "Special issue for the ICST 2013 conference.",
            "Are concurrency coverage metrics effective for testing: a comprehensive empirical investigation.",
            "Coverage-based regression test case selection, minimization and prioritization: a case study on an industrial system.",
            "A study and toolkit of CHECK-THEN-ACT idioms of Java concurrent collections.",
            "Defect prediction as a multiobjective optimization problem.",
            "Introduction to the special issue on Mutation Testing.",
            "Reducing mutation costs through uncovered mutants.",
            "Higher accuracy and lower run time: efficient mutation analysis using non-redundant mutation operators.",
            "Employing second-order mutation for isolating first-order equivalent mutants.",
            "Quality metrics for mutation testing with applications to WS-BPEL compositions.",
            "MuRanker: a mutant ranking tool.",
            "Metallaxis-FL: mutation-based fault localization.",
            "Using mutation to assess fault detection capability of model review.",
            "Towards an automation of the mutation analysis dedicated to model transformation.",
            "Model-based mutation testing from security protocols in HLPSL.",
            "How the web resuscitated evolutionary design.",
            "Killing strategies for model-based mutation testing.",
            "Assessing and generating test sets in terms of behavioural adequacy."
        ]
    },
    {
        "name": "STVR",
        "year": "2014",
        "info": "Volume 24: 2014",
        "count": 34,
        "papers": [
            "Globalization - references and citations.",
            "Tool support for the Test Template Framework.",
            "Model checking Trampoline OS: a case study on safety analysis for automotive software.",
            "Design and industrial evaluation of a tool supporting semi-automated website testing.",
            "Globalization - standards for research quality.",
            "A practical model-based statistical approach for generating functional test cases: application in the automotive industry.",
            "A novel approach to software quality risk management.",
            "Automatic test case generation from Simulink/Stateflow models using model checking.",
            "Globalization-ethics and plagiarism.",
            "Optimizing compilation with preservation of structural code coverage metrics to support software testing.",
            "A Hitchhiker's guide to statistical tests for assessing randomized algorithms in software engineering.",
            "Globalization - logical flow, motivation, and assumptions.",
            "Analysis and testing of black-box component-based systems by inferring partial models.",
            "Sound and mechanised compositional verification of input-output conformance.",
            "Towards the prioritization of system test cases.",
            "Editorial for the special issue of STVR on the 5th IEEE International Conference on Software Testing, Verification, and Validation (ICST 2012).",
            "Automatic testing of GUI-based applications.",
            "An efficient regression testing approach for PHP web applications: a controlled experiment.",
            "Automatic test case evolution.",
            "Editorial: how to get your paper rejected from STVR.",
            "An improved Pareto distribution for modelling the fault data of open source software.",
            "Extending model checkers for hybrid system verification: the case study of SPIN.",
            "Search-based testing using constraint-based mutation.",
            "Editorial for the special issue of STVR on tests and proofs volume 1: tests and proofs in model-based testing.",
            "Test generation with Satisfiability Modulo Theories solvers in model-based testing.",
            "Test generation from recursive tile systems.",
            "Model-based testing for concurrent systems with labelled event structures.",
            "Editorial for the special issue of STVR on tests and proofs volume 2: tests and proofs for improving the generation time and quality of test data suites.",
            "Bridging the gap between easy generation and efficient verification of unsatisfiability proofs.",
            "Automated test case generation for FBD programs implementing reactor protection system software.",
            "RepOK-based reduction of bounded exhaustive testing.",
            "A random testing approach using pushdown automata.",
            "Exploring the missing link: an empirical study of software fixes.",
            "A model-free and state-cover testing scheme for semaphore-based and shared-memory concurrent programs."
        ]
    },
    {
        "name": "STVR",
        "year": "2013",
        "info": "Volume 23: 2013",
        "count": 30,
        "papers": [
            "Error-preserving local transformations on communication protocols.",
            "An automated analysis methodology to detect inconsistencies in web services with WSDL interfaces.",
            "A test purpose-based approach for testing timed input output automata.",
            "Reliability assessment based on hazard rate model for an embedded OSS porting-phase.",
            "What I have learned from usability.",
            "A new method for testing timed systems.",
            "It really does matter how you normalize the branch distance in search-based software testing.",
            "Ranking of software engineering metrics by fuzzy-based matrix methodology.",
            "The globalization of software engineering.",
            "Using concepts of content-based image retrieval to implement graphical testing oracles.",
            "A measurement-based ageing analysis of the JVM.",
            "Regression verification: proving the equivalence of similar programs.",
            "Editorial: globalization - language and dialects.",
            "Testing and verification in service-oriented architecture: a survey.",
            "Parallel mutation testing.",
            "ICST 2010 Special Issue.",
            "Covering and Uncovering Equivalent Mutants.",
            "Efficient mutation testing of multithreaded code.",
            "Formal specification and analysis of functional properties of graph rewriting-based model transformation.",
            "Editorial for special issue of STVR on software testing, verification, and validation - volume 1 (extended selected papers from ICST 2011).",
            "Configuring effective navigation models and abstract test cases for web applications by analysing user behaviour.",
            "Testing of data-centric and event-based dynamic service compositions.",
            "Demand-driven propagation-based strategies for testing changes.",
            "Editorial for special issue of STVR on software testing, verification, and validation - volume 2 (extended selected papers from ICST 2011).",
            "Checked coverage: an indicator for oracle quality.",
            "Handling test length bloat.",
            "A tribute to Mary Jean Harrold.",
            "Incremental testing of finite state machines.",
            "A survey of code-based change impact analysis techniques.",
            "Combining weak and strong mutation for a noninterpretive Java mutation system."
        ]
    },
    {
        "name": "STVR",
        "year": "2012",
        "info": "Volume 22: 2012",
        "count": 27,
        "papers": [
            "The h-index beats the impact factor.",
            "On the testing of user-configurable software systems using firewalls.",
            "A case study in model-based testing of specifications and implementations.",
            "Regression testing minimization, selection and prioritization: a survey.",
            "Timing analysis of scenario-based specifications using linear programming.",
            "Non-expert reviews considered helpful.",
            "A testing strategy for abstract classes.",
            "Test data regeneration: generating new test data from existing test data.",
            "Fuzzy Bayesian system reliability assessment based on prior two-parameter exponential distribution under different loss functions.",
            "Status and Awards.",
            "Automated functional testing of online search services.",
            "Automated verification and testing of user-interactive undo features in database applications.",
            "Testing aspect-oriented programs with finite state machines.",
            "Guest Editorial for the Special Issue on Model-Based Testing.",
            "A taxonomy of model-based testing approaches.",
            "Obstacles and opportunities in deploying model-based GUI testing of mobile software: a survey.",
            "Applying formal methods to PCEP: an industrial case study from modeling to test generation.",
            "Formal passive testing of timed systems: theory and tools.",
            "Scenario-based testing using symbolic animation of B models.",
            "On reducing test length for FSMs with extra states.",
            "Efficient coverage of parallel and hierarchical stateflow models for test case generation.",
            "Regression test suite prioritization using system models.",
            "T-wise combinatorial interaction test suites construction based on coverage inheritance.",
            "Flipping the testing classroom.",
            "Testing-based process for component substitutability.",
            "A framework for automatic generation of security controller.",
            "A formal framework to test soft and hard deadlines in timed systems."
        ]
    },
    {
        "name": "STVR",
        "year": "2011",
        "info": "Volume 21: 2011",
        "count": 16,
        "papers": [
            "ICST 2008 Special Issue.",
            "On the number and nature of faults found by random testing.",
            "OSMOSE: automatic structural testing of executables.",
            "Model-based quality assurance of protocol documentation: tools and methodology.",
            "Status of the journal.",
            "On the use of a similarity function for test case selection in the context of model-based testing.",
            "Fault-driven stress testing of distributed real-time software based on UML models.",
            "On the selection of software defect estimation techniques.",
            "ICST 2009 Special Issue.",
            "Reducing logic test set size while preserving fault detection.",
            "Improving penetration testing through static and dynamic analysis.",
            "An approach for testing pointcut descriptors in AspectJ.",
            "JDAMA: Java database application mutation analyser.",
            "Editorial: What is the purpose of publishing?",
            "Verification support for ARINC-653-based avionics software.",
            "Improved code defect detection with fault links."
        ]
    },
    {
        "name": "STVR",
        "year": "2010",
        "info": "Volume 20: 2010",
        "count": 15,
        "papers": [
            "Editorial: OOP and discrete math.",
            "Verification of real-time systems design.",
            "A systematic representation of path constraints for implicit path enumeration technique.",
            "Importance measures for modular software with uncertain parameters.",
            "Editorial: People are approximators, not perfectors.",
            "Finding failures from passed test cases: improving the pattern classification approach to the testing of mesh simplification programs.",
            "Fault localization based on information flow coverage.",
            "Fault localization using a model checker.",
            "Editorial: Agility must be good for testing.",
            "Improving the coverage criteria of UML state machines using data flow analysis.",
            "Automatic string test data generation for detecting domain errors.",
            "Full predicate coverage for testing SQL database queries.",
            "Editorial: Ethics and Publishing.",
            "Testing coupling relationships in object-oriented programs.",
            "Recognizing authors: an examination of the consistent programmer hypothesis."
        ]
    },
    {
        "name": "STVR",
        "year": "2009",
        "info": "Volume 19: 2009",
        "count": 18,
        "papers": [
            "Editorial: Is software testing essential or accidental?",
            "Generating input data structures for automated program testing.",
            "A density-based greedy algorithm for higher strength covering arrays.",
            "Transition covering tests for systems with queues.",
            "Software testing - testing across the entire software development lifecycle. By Gerald D Everett & Raymond McLeod Jr. Published by IEEE Press and Wiley Interscience, Hoboken, NJ, USA ISBN: 978-0-471-79371-7, 260 pages.",
            "Editorial: Running a conference program meeting in the 21st century.",
            "Automatic instantiation of abstract tests on specific configurations for large critical control systems.",
            "Decreasing the cost of mutation testing with second-order mutants.",
            "Structural coverage criteria for LUSTRE/SCADE programs.",
            "Towards automatic software model checking of thousands of Linux modules - a case study with Avinux.",
            "Editorial: confidentiality and plagiarism.",
            "Integrating testing with reliability.",
            "Inclusion, subsumption, JJ-paths, and structured path testing: a Redress.",
            "Testing with model checkers: a survey.",
            "Editorial: Testing my new building.",
            "Modelling methods for web application verification and testing: state of the art.",
            "System testing for object-oriented systems with test case prioritization.",
            "Pragmatic Software Testing. By Rex Black. Published by Wiley. ISBN: 978-0-470-12790-2, 366 pages."
        ]
    },
    {
        "name": "STVR",
        "year": "2008",
        "info": "Volume 18: 2008",
        "count": 15,
        "papers": [
            "Editorial: The journal impact factor.",
            "Modular formal verification of specifications of concurrent systems.",
            "Simulated time for host-based testing with TTCN-3.",
            "Error-preserving reductions on communication protocols.",
            "Editorial: Testing practice and research.",
            "Quality assurance for TTCN-3 test specifications.",
            "Automated discovery of state transitions and their functions in source code.",
            "Editorial: Science Fiction and Fantasy.",
            "IPOG/IPOG-D: efficient test generation for multi-way combinatorial testing.",
            "Reconciling perspectives of software logic testing.",
            "Modeling and verification using UML Statecharts. By Doron Drusinsky. Published by Newnes Publishers, 2006, ISBN 0-7506-7617-5, 306 pages.",
            "Editorial: Software testing is an elephant.",
            "An analysis technique to increase testability of object-oriented components.",
            "The determination of optimal software release times at different confidence levels with consideration of learning effects.",
            "Model-driven software development. By Thomas Stahl and Markus Volter. Published by John Wiley & Sons, New York, 2006. ISBN: 0470025700."
        ]
    },
    {
        "name": "STVR",
        "year": "2007",
        "info": "Volume 17: 2007",
        "count": 14,
        "papers": [
            "Editorial: Reflections on the past, present and future.",
            "Integrating techniques and tools for testing automation.",
            "Heuristics for fault diagnosis when testing from finite state machines.",
            "Editorial: Introduction and plans for the future.",
            "Using component metadata to regression test component-based software.",
            "Testing software components for integration: a survey of issues and techniques.",
            "Editorial: Standards for reviewing papers.",
            "An event-flow model of GUI-based applications for testing.",
            "The density algorithm for pairwise interaction testing.",
            "Practical ultra-reliability for abstract data types.",
            "Editorial: Why should I review papers?",
            "A combinatorial testing strategy for concurrent programs.",
            "Studying the separability relation between finite state machines.",
            "Software component composition: a subdomain-based testing-theory foundation."
        ]
    },
    {
        "name": "STVR",
        "year": "2006",
        "info": "Volume 16: 2006",
        "count": 19,
        "papers": [
            "Editorial: Testing for real!",
            "Event-based modelling, analysis and testing of user interactions: approach and case study.",
            "Formal analysis of some secure procedures for certificate delivery.",
            "Testing Commercial-off-the-Shelf Components and Systems. Edited by Sami Beydeda and Volker Gruhn. Springer, 2005, ISBN: 3-540-21871-8, pp 410.",
            "Verification and Validation for Quality of UML 2.0 Models. By Bhuvan Unhelkar. Wiley, 2005, ISBN: 0-471-72783-0, 271 pp.",
            "Editorial: Uncertainty and chaos.",
            "Exploiting design patterns to automate validation of class invariants.",
            "Symbolic execution of floating-point computations.",
            "Successful Test Management: An Integral Approach. By Iris Pinkster, Bob van de Burgt, Dennis Janssen, and Erik van Veenendaal. Springer, 2004, ISBN: 3-540-22822-5, pp 373.",
            "Software Quality Engineering: Testing, Quality Assurance, and Quantifiable Improvement. By Jeff Tian. Wiley/IEEE Computer Society Press, 2005. ISBN: 0-471-71345-7, pp 412.",
            "Editorial: Addressing industrial challenges - UKTest 2005 and beyond.",
            "A theory of regression testing for behaviourally compatible object types.",
            "Improving fault prediction using Bayesian networks for the development of embedded software applications.",
            "Search-based software test data generation for string data using program-specific search operators.",
            "A Tribute to Martin Woodward.",
            "Editorial: STVR Editor changes.",
            "Integration testing of object-oriented components using finite state machines.",
            "Leveraging disposable instrumentation to reduce coverage collection overhead.",
            "Software Testing Foundations: A Study Guide for the Certified Tester Exam. By Andreas Spillner, Tilo Linz and Hans Schaefer. Published by dpunkt.verlag, Heidelberg, Germany, 2006, ISBN: 3-89864-363-8, pp 266."
        ]
    },
    {
        "name": "STVR",
        "year": "2005",
        "info": "Volume 15: 2005",
        "count": 19,
        "papers": [
            "Editorial: Looking for surprises in testing?",
            "Theory and practice of risk-based testing.",
            "A formal analysis of MCDC and RCDC test criteria.",
            "Using symbolic execution to guide test generation.",
            "Editorial: On mutants, metaphors and scientific creativity.",
            "From genetic to bacteriological algorithms for mutation-based testing.",
            "MuJava: an automated class mutation system.",
            "Artificial Intelligence Methods In Software Testing. Edited by Mark Last, Abraham Kandel and Horst Bunke. Published by World Scientific Publishing, Singapore, Series in Machine Perception and Artificial Intelligence, Volume 56, 2004, ISBN 981-238-854-0.",
            "The Art of Software Testing, Second edition. Glenford J. Myers. Revised and updated by Tom Badgett and Todd M. Thomas, with Corey Sandler. John Wiley and Sons, New Jersey, USA, 2004, ISBN 0-471-46912-2.",
            "Editorial: ... and the wheel keeps turning.",
            "A minimal test practice framework for emerging software organizations.",
            "Combination testing strategies: a survey.",
            "Software Testing and Continuous Quality Improvement. Second Edition. By William E. Lewis. Technical Contributor: Gunasekaran Veerapillai. Published by Auerbach Publications, 2005, ISBN: 0-8493-2524-2, pp 534.",
            "Verification of Reactive Systems: Formal Methods and Algorithms. By Klaus Schneider. Springer, Texts in Theoretical Computer Science Series, 2004, ISBN: 3-540-00296-0, pp 600.",
            "Editorial: Validating our findings.",
            "Specification and testing of autonomous agents in e-commerce systems.",
            "Tool support for executable documentation of Java class hierarchies.",
            "An empirical study of regression test application frequency.",
            "Achieving Software Quality Through Teamwork. By Isabel Evans. Artech House, 2004, ISBN: 1-58053-662-X, pp 296."
        ]
    },
    {
        "name": "STVR",
        "year": "2004",
        "info": "Volume 14: 2004",
        "count": 20,
        "papers": [
            "Editorial: Software testing as related to project risk.",
            "Exploring risk-based testing and its implications.",
            "An AGENDA for testing relational database applications.",
            "Effective test case selection for component customization and its application to Enterprise JavaBeans.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: A test of time across the generations.",
            "Controlling test case explosion in test generation from B formal models.",
            "Search-based software test data generation: a survey.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: Software testing in the United Kingdom.",
            "Experimental evaluation of the tolerance for control-flow test criteria.",
            "Refinement in statechart testing.",
            "Preamble computation in automated test case generation using constraint logic programming.",
            "Guest Editorial: An industrial viewpoint.",
            "Eight maxims for software inspectors.",
            "Applying simulation and design of experiments to the embedded software testing process.",
            "A Practitioner's Guide to Software Test Design. By Lee Copeland. Published by Artech House, Norwood, MA, USA, 2004, ISBN 1-58053-791-X, 320 pages.",
            "Testing Web Security: Assessing the Security of Web Sites and Applications. By Steven Splaine. Published by John Wiley and Sons, New York, USA, 2002 ISBN 0-471-23281-5, 345 pages."
        ]
    },
    {
        "name": "STVR",
        "year": "2003",
        "info": "Volume 13: 2003",
        "count": 23,
        "papers": [
            "Editorial: Perhaps some parallels do converge?",
            "All-uses testing of shared memory parallel programs.",
            "Generating test data from state-based specifications.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: The merits of diversity.",
            "Understanding the effects of changes on the cost-effectiveness of regression testing techniques.",
            "A change-point perspective on the software failure process.",
            "Test adequacy criteria for UML design models.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: Testing in the large through the small?",
            "Test suite minimization for testing in context.",
            "Combining formal verification and conformance testing for validating reactive systems.",
            "Checking security properties by model checking.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: The First International Workshop on Verification and Validation of Enterprise Information Systems (VVEIS 2003).",
            "High-level data races.",
            "Evaluating the sustained performance of COTS-based messaging systems.",
            "Improved verification of linear-time properties within fairness: weakly continuation-closed behaviour abstractions computed from trace reductions.",
            "Book Reviews.",
            "Book Reviews."
        ]
    },
    {
        "name": "STVR",
        "year": "2002",
        "info": "Volume 12: 2002",
        "count": 25,
        "papers": [
            "Editorial: Find the missing links?",
            "Efficient model checking of properties of a distributed application: a multimedia case study.",
            "Conditioned slicing supports partition testing.",
            "Preventing untestedness in data-flow based testing.",
            "Digraphs: theory, algorithms and applications.",
            "Refinement in Z and object-Z: foundations and advanced applications.",
            "List of Referees.",
            "Editorial: Formal methods and testing.",
            "Additional transformations for multiple-level escape statements.",
            "Case study of testing a distributed internet-system.",
            "Estimating the number of components with defects post-release that showed no defects in testing.",
            "Testing it: an off-the-shelf software testing process.",
            "Problem frames: analyzing and structuring software development problems.",
            "Editorial: Little bugs and big bugs.",
            "State-of-the-art: software inspections after 25 years.",
            "An empirical evaluation of six methods to detect faults in software.",
            "Syntactic reductions for efficient deadlock analysis.",
            "Book Reviews.",
            "Book Reviews.",
            "Editorial: The importance of empirical work for software engineering papers.",
            "Can fault-exposure-potential estimates improve the fault detection abilities of test suites?",
            "Empirical studies of test-suite reduction.",
            "Model checking fault tolerant systems.",
            "Book Reviews.",
            "Book Reviews."
        ]
    },
    {
        "name": "STVR",
        "year": "2001",
        "info": "Volume 11: 2001",
        "count": 20,
        "papers": [
            "Editorial: Specification-based testing revisited?",
            "A rigorous method for test templates generation from object-oriented specifications.",
            "Statechart testing method for aircraft control systems.",
            "Book Review: Formal Object-Oriented Specification Using Object-Z, by Roger Duke and Gordon Rose, Macmillan Press.",
            "Book Review: Linux: The Complete Reference, Third Edition, by Richard Petersen, Osborne/McGraw-Hill.",
            "Editorial: The First International Workshop on Automated Program Analysis, Testing and Verification (WAPATV 2000).",
            "Software model checking: extracting verification models from source code.",
            "ATGen: automatic test data generation using constraint logic programming and symbolic execution.",
            "A framework for practical, automated black-box testing of component-based software.",
            "Toward the determination of sufficient mutant operators for C.",
            "Editorial: Putting specifications to the test.",
            "Automated structural analysis of SCR-style software requirements specifications using PVS.",
            "Test case selection strategies based on Boolean specifications.",
            "Teaching formal methods lite via testing.",
            "Book Review: Spin Model Checking and Software Verification, Proceedings of the 7th International SPIN Workshop, Stanford, CA, USA, By Klaus Havelund, John Penix and Willem Visser (eds.). LNCS 1885.",
            "Book Review: Experimentation in Software Engineering: An Introduction. By Claes Wohlin, Per Runeson, Martin Höst, Magnus C. Ohlsson, Björn Regnell and Anders Wesslén. Kluwer Academic Publishers, 1999, ISBN 0-7923-8682-5.",
            "Editorial: Mutation 2000 - A Symposium on Mutation Testing.",
            "Investigating the effectiveness of object-oriented testing strategies using the mutation method.",
            "Interface mutation.",
            "Unit and integration testing strategies for C programs using mutation."
        ]
    },
    {
        "name": "STVR",
        "year": "2000",
        "info": "Volume 10: 2000",
        "count": 19,
        "papers": [
            "Editorial: 'The Best Ever'.",
            "A Theoretical Study of Fault Coupling.",
            "Effect of Fault Distribution and Execution Patterns on Fault Exposure in Software: A Simulation Study.",
            "System Safety: HAZOP and Software HAZOP, Felix Redmill, Morris Chudleigh and James Catmur, Wiley, 1999 (Book Review).",
            "Test Process Improvement, Tim Koomen and Martin Pol, Addison-Wesley, 1999 (Book Review).",
            "Editorial: 'The times they are a-changing'.",
            "Regression Test Selection for C++ Software.",
            "From Object-Z Specifications to ClassBench Test Suites.",
            "Classical and Object-Oriented Software Engineering with UML and C++, Stephen R. Schach, McGraw-Hill, 1998 (Book Review).",
            "Software Test Automation: Effective Use of Test Execution Tools, Mark Fewster and Dorothy Graham, Addison-Wesley, 1999 (Book Review).",
            "Editorial: 'Collaboration, collaboration, collaboration'.",
            "State Generation and Automated Class Testing.",
            "An Empirical Investigation of the Relationship Between Spectra Differences and Regression Faults.",
            "Concurrent and Real-Time Systems: The CSP Approach, Steve Schneider, Wiley, 2000 (Book Review).",
            "Testing Object-Oriented Software: Life-Cycle Solutions, Imran Bashir and Amrit L. Goel, Springer-Verlag, 2000 (Book Review).",
            "Editorial: special issue on specification-based testing.",
            "A test sequence selection method for statecharts.",
            "Specification based test sequence generation with propositional logic.",
            "Black-box testing using flowgraphs: an experimental assessment of effectiveness and automation potential."
        ]
    },
    {
        "name": "STVR",
        "year": "1999",
        "info": "Volume 9: 1999",
        "count": 23,
        "papers": [
            "Editorial: Crisis - What Crisis?",
            "Boundary Values and Automated Component Testing.",
            "Testing Refinements of State-based Formal Specifications.",
            "Path-sensitive Alias Analysis for Data Flow Testing.",
            "Software Fault Injection: Inoculating Programs Against Errors, by Jeffrey Voas and Gary McGraw, Wiley, 1998 (Book Review).",
            "Correct Systems: Building a Business Process Solution, by Mike Holcombe and Florentin Ipate, Springer-Verlag, 1998 (Book Review).",
            "Editorial: V is for Verification.",
            "Towards a Transformational Approach to Program Verification.",
            "LVT: A Layered Verification Technique for Distributed Computing Systems.",
            "Testing Safety-Related Software: a Practical Handbook, by S. Gardiner (Editor), Springer-Verlag, 1999 (Book Review).",
            "Surviving the Top Ten Challenges of Software Testing: a People-Oriented Approach, by William E. Perry and Randall W. Rice, Dorset House, 1997 (Book Review).",
            "Editorial: What does testing tell us?",
            "A Contribution to the Evaluation of the Reliability of Iterative-Execution Software.",
            "Estimating the Number of Remaining Defects after Inspection.",
            "Machine Learning, by Tom M. Mitchell, McGraw-Hill, 1997 (Book Review).",
            "Testing Object-Oriented Software, by David C. Kung, Pei Hsia and Jerry Gao, IEEE Computer Society, 1998 (Book Review).",
            "Editorial: Submission of Position Papers and Letters to the Editor.",
            "Tribute: John Gannon.",
            "Efficiency of Mutation Operators and Selective Mutation Strategies: An Empirical Study.",
            "Using Program Slicing to Assist in the Detection of Equivalent Mutants.",
            "Test-Data Generation Using Genetic Algorithms.",
            "The Renaissance of Legacy Systems: Method Support for Software-System Evolution, Ian Warren, Springer-Verlag, 1999 (Book Review).",
            "Automated Software Testing: Introduction, Management and Performance, Elfriede Dustin, Jeff Rashka and John Paul, Addison-Wesley, 1999 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1998",
        "info": "Volume 8: 1998",
        "count": 20,
        "papers": [
            "Editorial: A History Lesson?",
            "Specification for Testing - The Removal of Abstraction.",
            "Declarative Paradigm of Test Coverage.",
            "Protocol Specification, Testing and Verification XV, by Piotr Dembinski and Marek Sredniawa (Editors), Chapman and Hall, 1996 (Book Review).",
            "Editorial: Time and time again.",
            "Specification and Testing Using Generalised Machines: A Presentation and a Case Study.",
            "An Improvement of Partial-Order Verification.",
            "Formal Methods in Human-Computer Interaction, by Philippe Palanque and Fabio Paterno (Editors), Springer-Verlag, 1998 (Book Review).",
            "Software Process Improvement: Practical Guidelines for Business Success, by Sami Zahran, Addison-Wesley, 1997 (Book Review).",
            "Editorial: What is the Developer-to-Tester Ratio?",
            "A Non-Parametric Order Statistics Software Reliability Model.",
            "Coupling-based Criteria for Integration Testing.",
            "Assessing the Risk due to Software Faults: Estimates of Failure Rate versus Evidence of Perfection.",
            "Object-Oriented Development Process and Metrics, by Dennis de Champeaux and Penelope K. Faure, Prentice Hall, 1997 (Book Review).",
            "Software Verification and Validation: A Practitioner's Guide, by Steven R. Rakitin, Artech House, 1997 (Book Review).",
            "Editorial: Quantum Computing, Software Testing and the Millennium Bug.",
            "Change of Book Reviews Editor.",
            "Toward a Cooperative Testing Process.",
            "A Knowledge-Based Test Plan Generator for Incremental Unit and Integration Software Testing.",
            "Managing Risk: Methods for Software Systems Development, by Elaine M. Hall, Addison Wesley Longman, 1998 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1997",
        "info": "Volume 7: 1997",
        "count": 21,
        "papers": [
            "Editorial.",
            "Improving the Testing Process Based Upon Standards.",
            "Testing from a Z Specification.",
            "Alternative Parameter Estimation Methods for the Compound Poisson Software Reliability Model with Clustered Failure Data.",
            "Handbook of Software Reliability Engineering, by Michael R. Lyu (Editor), McGraw-Hill and IEEE Computer Society, 1996 (Book Review).",
            "Object-Oriented Software Testing: A Hierarchical Approach, by Shel Siegel, Wiley, 1996 (Book Reviews).",
            "Editorial: Research publication standards - making the right judgements.",
            "A Method for Continuous Real-Time Supervision.",
            "A Software Inspection Process Definition Language and Prototype Support Tool.",
            "Specification in B: An Introduction Using the B Toolkit, by Kevin Lano and Howard Haughton, Imperial College Press, distributed by World Scientific Publishing, 1996 (Book Review).",
            "Software Inspection: An Industry Best Practice, by David A. Wheeler, Bill Brykczynski and Reginald N Meeson, Jr., IEEE Computer Society, 1996 (Book Review).",
            "Editorial: What do we want to get out of testing?",
            "The Effect of Fault Size on Testing.",
            "Estimation of Failure Rate using Random and Partition Testing.",
            "Automatically Detecting Equivalent Mutants and Infeasible Paths.",
            "Reliability, Quality and Safety of Software-intensive Systems, by Dimitris Gritzalis (Editor), Chapman and Hall, 1997 (Book Review).",
            "Managing Software Quality, by Brian Hambling, McGraw-Hill, 1996 (Book Review).",
            "Editorial: A six-year perspective - the readership and content of STVR.",
            "Validation of Array Accesses: Integration of Flow Analysis and Program Verification Techniques.",
            "TIM - A Test Improvement Model.",
            "Information Security in Research and Business, by Louise Yngström and Jan Carlsen (Editors), Thomson Science & Professional, 1997 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1996",
        "info": "Volume 6: 1996",
        "count": 14,
        "papers": [
            "Editorial: Testing - a Sisyphean or Herculean Task?",
            "A Formal Interpretation of Software Testing as Inductive Inference.",
            "On Testing Process Control Software for Reliability Assessment: the Effects of Correlation between Successive Failures.",
            "Black-Box Testing: Techniques for Functional Testing of Software and Systems, by Boris Beizer, Wiley, 1995 (Book Review).",
            "Software Reliability and Testing, by Hoang Pham (Editor), IEEE Computer Society, 1995 (Book Review).",
            "Editorial.",
            "Applying Inspection to Object-Oriented Code.",
            "Program Slicing-Based Regression Testing Techniques.",
            "Software Assessment: Reliability, Safety, Testability, by Michael A. Friedman and Jeffrey M. Voas, Wiley, 1995 (Book Review).",
            "Design of Dependable Ada Software, by G. Motet, A. Mapinard and J. C. Geoffroy, Prentice Hall, 1995 (Book Review).",
            "Editorial: About the contents of this double issue - 'Testing Object-Oriented Software: A Survey' by Robert V. Binder.",
            "Testing Object-Oriented Software: A Survey.",
            "Achieving Quality in Software: Proceedings of the Third International Conference on Achieving Quality in Software, by Sandro Bologna and Giacomo Bucci (Editors), Chapman and Hall, 1996 (Book Review).",
            "Object-Oriented Metrics: Measures of Complexity, by Brian Henderson-Sellers, Prentice Hall, 1996 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1995",
        "info": "Volume 5: 1995",
        "count": 19,
        "papers": [
            "Editorial: Testing Matters.",
            "Fault Coupling in Finite Bijective Functions.",
            "Algebraic Specifications and Sequencing: A Defect Detection Method.",
            "Software Testing, by Marc Roper, McGraw-Hill, 1994 (Book Review).",
            "Editorial.",
            "Error Masking in Computer Programs.",
            "Decision Tables: Formalisation, Validation and Verification.",
            "Software in Safety-Related Systems, by Brian Wichmann (Editor), Wiley, 1992 and Safety-Critical Systems: Current Issues, Techniques and Standards, Felix Redmill and Tom Anderson (Editors), Chapman & Hall, 1993 and Directions in Safety-Critical Systems, by Felix Redmill and Tom Anderson (Editors), Springer-Verlag, 1993 and Technology and Assessment of Safety-Critical Systems, Felix Redmill and Tom Anderson (Editors), Springer-Verlag, 1994 and Achievement and Assurance of Safety, Felix Redmill and Tom Anderson (Editors), Springer-Verlag, 1995 and Journal: High Integrity Systems, Andrew D. McGettrick (Editor), Oxford University Press (Books and Journal Review).",
            "Guest Editorial: EuroSTAR '94.",
            "Using Program Slicing to Simplify Testing.",
            "Systematic Testing: A Means for Validating Reactive Systems.",
            "Evaluating the Reliability of the Software of a Switching System with a Multi-variable Model.",
            "Safer C: Developing Software for High-Integrity and Safety-Critical Systems, by Les Hatton, McGraw-Hill, 1995 (Book Review).",
            "The Handbook of MIS Application Software Testing: Methods, Techniques, and Tools for Assuring Quality Through Testing, by Daniel J. Mosley, Prentice Hall, 1992 (Book Review).",
            "Editorial.",
            "An Experimental Evaluation of Capture-Recapture in Software Inspections.",
            "Techniques for the Verification and Validation of Knowledge-based Systems: A Survey Based on the Symbol/Knowledge Level Distinction.",
            "Software Quality: A Framework for Success in Software Development and Support, by Joc Sanders and Eugene Curran, Addison-Wesley, 1994 (Book Review).",
            "Metrics and Models in Software Quality Engineering, by Stephen H. Kan, Addison-Wesley, 1995 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1994",
        "info": "Volume 4: 1994",
        "count": 23,
        "papers": [
            "Editorial.",
            "A Relationship Between Software Coverage Metrics and Reliability.",
            "An Empirical Comparison of Data Flow and Mutation-Based Test Adequacy Criteria.",
            "Validating Functional Equivalence of Re-engineered Programs via Control Path, Result, and Data Flow Comparison.",
            "Rebuttal of the Book Review by R. Whitty of 'Software Testing Techniques' (2nd Edition).",
            "Reply to the Rebuttal of the Review of Beizer's 'Software Testing Techniques' (2nd Edition).",
            "User Interface Software, by Len Bass and Prasun Dewan (Editors), Wiley, 1993 (Book Review).",
            "Developing User Interfaces: Ensuring Usability Through Product and Process, by Deborah Hix and H. Rex Hartson, Wiley, 1993 (Book Review).",
            "Editorial.",
            "Defining Testability Metrics Axiomatically.",
            "The Automated Generation of Test Cases for Compilers.",
            "Inspecting Module Interface Specifications.",
            "Software Engineering Metrics, Volume 1: Measures and Validations, by Martin Sheppard, McGraw-Hill, 1993 (Book Review).",
            "ISO 9001 and Software Quality Assurance, by Darrel Ince, McGraw-Hill, 1994 (Book Review).",
            "Editorial.",
            "Using Compiler Optimization Techniques to Detect Equivalent Mutants.",
            "Transformational Program Analysis.",
            "Z - An Introduction to Formal Methods, by Antoni Diller, Wiley, Second Edition, 1994 (Book Review).",
            "Cutting Your Test Development Time with HP VEE, an Iconic Programming Language, Hewlett-Packard, 1994 (Book Review).",
            "Editorial: Too Many Conference Choices?",
            "Determining the Reliability of Prolog Programs.",
            "Re-designing Tasking Structures of Ada Programs for Analysis: A Case Study.",
            "Object-Oriented Software Metrics, by Mark Lorenz and Jeff Kidd, Prentice Hall, 1994 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1993",
        "info": "Volume 3: 1993",
        "count": 15,
        "papers": [
            "Editorial.",
            "Software Reliability Models: A Selected Annotated Bibliography.",
            "Employing Static Information in the Generation of Test Cases.",
            "Independent Verification and Validation: a Life Cycle Engineering Process for Quality Software, by R. O. Lewis, Wiley, 1992 (Book Review).",
            "Discrete Event Simulation in C, by Kevin Watkins, McGraw-Hill, 1993 (Book Review).",
            "Editorial: Need for a Testing Metric - Error Detection Rate.",
            "Classification Trees for Partition Testing.",
            "Replay-Based Debugging of Occam Programs.",
            "Using Symbolic Execution and Data Flow Criteria to Aid Test Data Selection.",
            "Method Integration: Concepts and Case Studies, by Klaus Kronlöf (Editor), Wiley, 1993 (Book Review).",
            "Guest Editorial: EuroSTAR '93.",
            "Metrics Collection in Code and Unit Test as Part of Continuous Quality Improvement.",
            "An Integrated Methodology for the Specification, Verification and Testing of Systems.",
            "Software Testing Using Analysis and Design Based Techniques.",
            "A Metric-Based Software Evaluation Method."
        ]
    },
    {
        "name": "STVR",
        "year": "1992",
        "info": "Volume 2: 1992",
        "count": 24,
        "papers": [
            "Editorial.",
            "An Example of Testing Versus Verification.",
            "Formal Specification and Testing: A Case Study.",
            "The Revealing Power of a Test Case.",
            "Rapid Evolutionary Development: Requirements; Prototyping and Software Creation, by Lowell Jay Arthur, Wiley, 1992 (Book Review).",
            "The Cleanroom Approach to Quality Software Development, by Michael Dyer, Wiley, 1992 (Book Review).",
            "Dependable Computing and Fault-Tolerant Systems, Vol. 5 - Dependability: Basic Concepts and Terminology, by J. C. Laprie (Editor), Springer-Verlag, 1992 (Book Review).",
            "Editorial.",
            "Employing Accumulated Knowledge to Refine Test Descriptions.",
            "Inductive Inference and Software Testing.",
            "Control Flow and Data Flow Oriented Integration Test Methods.",
            "Statistical Methods for Testing, Development and Manufacturing, by Forrest W. Breyfogle III, Wiley, 1992 (Book Review).",
            "Reliability and Robustness of Engineering Software II, by C. A. Brebbia and A. J. Ferrante (Editors), Computational Mechanics Publications, 1991 (Book Review).",
            "Editorial.",
            "Software Testing: A Selected Annotated Bibliography.",
            "Structured Inspections of Code.",
            "Software Quality: Theory and Management, by Alan C. Gillies, Chapman and Hall, 1992 (Book Review).",
            "Software Metrics: a Practitioner's Guide to Improved Product Development, by K. H. Möller and D.J. Paulish, Chapman and Hall, 1992 (Book Review).",
            "ami Handbook: a Quantitative Approach to Software Management, by A. Combelles, J. Holdsworth and S. Shirlaw (Editors), Published by South Bank University, 1992 (Book Review).",
            "Editorial.",
            "Problems and Strategies for Software Component Testing Standards.",
            "A Specification Case Study Using the B-Methodology.",
            "Dynamic Method of Software Test Data Generation.",
            "Software Testing Techniques, by Boris Beizer, Van Nostrand Reinhold, Second Edition, 1990 and Testing Computer Software, by C. Kaner, J. Falik and H. Q. Nguyen, Van Nostrand Reinhold, Second Edition, 1993 (Book Review)."
        ]
    },
    {
        "name": "STVR",
        "year": "1991",
        "info": "Volume 1: 1991/1992",
        "count": 27,
        "papers": [
            "Editorial.",
            "Program Testing versus Proofs of Correctness.",
            "Some Issues in Software Reliability Assessment.",
            "How to Avoid Systematic Software Testing.",
            "Software Reliability - What Is It?",
            "An Exercise in Weakest Preconditions.",
            "GOTO considered alive and well.",
            "Engineering Quality Software: A Review of Current Practices, Standards and Guidelines Including New Methods and Development Tools, by avid J. Smith and Kenneth B. Wood, Elsevier (Book Review).",
            "Editorial.",
            "An Investigation of Statistical Software Testing.",
            "Validating Software Measures.",
            "The Managing Director Wants 100 per cent Automated Testing: A Case History.",
            "Response to 'GOTO considered alive and well' by R. Bache.",
            "Software Design for Real-Time Systems, by J. E. Cooling, Chapman and Hall, 1990 (Book Review).",
            "Software Quality and Reliability: Tools and Methods, by Darrel Ince (Editor), Chapman and Hall, 1991 (Book Review).",
            "Editorial.",
            "A Conceptual Model of Software Testing.",
            "Software Testing Tools: A New Classification Scheme.",
            "Concerning Ordered Mutation Testing of Relational Operators.",
            "Software Complexity: Measures and Methods, by Horst Zuse, Published by Walter de Gruyter, 1990 (Book Review).",
            "Software Metrics: A Rigorous Approach, by Norman Fenton, Chapman and Hall, 1991 (Book Review).",
            "Editorial.",
            "Parametrized Mutation Testing.",
            "Multivariate Assessment of Software Products.",
            "Systematic Testing of Data Abstractions Based on Software Specifications.",
            "Methods and Tools for Software Configuration Management, by J. Whitgift, Wiley (Book Review).",
            "Software Configuration Management, by H. Ronald Berlack, Wiley (Book Review)."
        ]
    }
]