[
    {
        "year": "2021",
        "name": "15th TASE 2021",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2021",
                "sub_name": "International Symposium on Theoretical Aspects of Software Engineering, TASE 2021, Shanghai, China, August 25-27, 2021.",
                "count": 27,
                "papers": [
                    "Program Verification: a 70+- Year History.",
                    "Advances of Proof Scores in CafeOBJ : Invited Paper.",
                    "Research and Practice of Container System.",
                    "A wp Characterization of Jump Statements.",
                    "Behind Clint and Hoare's goto Proof Rule.",
                    "A Proof System for HRML with Extended Hoare Logic.",
                    "Dynamic Verification of C11 Concurrency over Multi Copy Atomics.",
                    "An Abstract Domain to Infer Linear Absolute Value Equalities.",
                    "Discovering Properties about Arrays via Path Dependence Analysis.",
                    "Inferring Loop Invariants for Multi-Path Loops.",
                    "Parametric Spatio-temporal Modeling and Safety Verifying for T2T-CBTC Systems.",
                    "Transforming RoboSim Models into UPPAAL.",
                    "A Formal Engineering Approach to Product Family Modeling.",
                    "Encoding Induction Proof in Dafny.",
                    "A Parallel Implementation of Liveness on Knowledge Graphs under Label Constraints.",
                    "Exploring Design Alternatives for Replicated RAMP Transactions Using Maude.",
                    "A Character-Level Convolutional Neural Network for Predicting Exploitability of Vulnerability.",
                    "Formal Modelling and Verification of the RTPS Behavior Module.",
                    "VERDS: Modeling and Verification of Finite State Systems with Discrete Time Models by Symbolic Techniques.",
                    "Reasoning About Real-Time Systems in Event-B Models with Fairness Assumptions.",
                    "A Timed Automata based Automatic Framework for Verifying STL Properties of Simulink Models.",
                    "Petri Net Based CTL Model Checking: Using a New Method to Construct OBDD Variable Order.",
                    "Featured Games.",
                    "Towards a specification theory for fuzzy modal logic.",
                    "Generating Test Cases from Requirements: A Case Study in Railway Control System Domain.",
                    "RE2B: Enhancing Correctness of Both Requirements and Design Models.",
                    "Eliciting Timing Requirements for Cyber-Physical Systems: a Multiform Time based Approach."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "14th TASE 2020",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2020",
                "sub_name": "International Symposium on Theoretical Aspects of Software Engineering, TASE 2020, Hangzhou, China, December 11-13, 2020.",
                "count": 29,
                "papers": [
                    "A Comparative Study of Neural Network Techniques for Automatic Software Vulnerability Detection.",
                    "A Novel Data-Driven Approach for Generating Verified Loop Invariants.",
                    "Defect Report Severity Prediction Based on Genetic Algorithms and Convolutional Neural Network.",
                    "RKC-H: A Rich Knowledge Based Model for Multi-turn Dialogue Generation.",
                    "WLeidenRDF: RDF Data Query Method based on Semantic-Enhanced Graph-Clustering Algorithm.",
                    "An Axiomatic Approach to BigrTiMo.",
                    "Real-time MTL with durations as SMT with applications to schedulability analysis.",
                    "Real-Time Trigger-Response Properties for Event-B Applied to the Pacemaker.",
                    "Tracking a Ground Moving Target with UAV Based on Interval Type-2 Fuzzy Logic.",
                    "Feature-oriented Design of Visual Analytics System for Interpretable Deep Learning based Intrusion Detection.",
                    "Neuron Activation Frequency Based Test Case Prioritization.",
                    "Rely-Guarantee Reasoning about Messaging System for Autonomous Vehicles.",
                    "A Formal Proof of the Soundness of the Hybrid CPS Clock Theory.",
                    "Formalizing the Soundness of the Encoding Methods of SAT-based Model Checking.",
                    "The Bouquet Algorithm for Model Checking Unbounded Until Properties.",
                    "Characterising Probabilistic Alternating Simulation for Concurrent Games.",
                    "Learning Probabilistic Languages by k-Testable Machines.",
                    "Automatic Tagging for Open Source Software by Utilizing Package Dependency Information.",
                    "Optimizing Transformations of Dynamic Languages Compiled to Intermediate Representations.",
                    "Analyzing Cryptographic API Usages for Android Applications Using HMM and N-Gram.",
                    "Droidlens: Robust and Fine-Grained Detection for Android Code Smells.",
                    "Measuring the Quality of B Abstract Machines with ISO/IEC 25010.",
                    "Metamorphic Testing of Code Search Engines.",
                    "A Language-based Approach to Analysing Flow Security Properties in Virtualised Computing Systems.",
                    "A Multi-Strategy Combination Framework for Android Malware Detection Based on Various Features.",
                    "An Empirical Study in Software Verification Tools.",
                    "AT-ROP: Using static analysis and binary patch technology to defend against ROP attacks based on return instruction.",
                    "Formally Verifying Sequence Diagrams for Safety Critical Systems.",
                    "The Scheme of Security Requirement Acquisition Based on Knowledge Graph."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "13th TASE 2019",
        "info": "Guilin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2019",
                "sub_name": "2019 International Symposium on Theoretical Aspects of Software Engineering, TASE 2019, Guilin, China, July 29-31, 2019.",
                "count": 36,
                "papers": [
                    "Towards Refinement Semantics of Real-Time Trigger-Response Properties in Event-B.",
                    "Handling Refinement of Continuous Behaviors: A Proof Based Approach with Event-B.",
                    "Distributed Mediator.",
                    "A Logical Approach for the Schedulability Analysis of CCSL.",
                    "ABAC Requirements Engineering for Database Applications.",
                    "A Co-Occurrence Recommendation Model of Software Security Requirement.",
                    "Android Malware Family Classification and Characterization Using CFG and DFG.",
                    "Large-scale Detection of Privacy Leaks for BAT Browsers Extensions in China.",
                    "Constructing Benchmarks for Supporting Explainable Evaluations of Static Application Security Testing Tools.",
                    "Multi-Agent Automated Reasoning Toward Machine Self-Awareness: A Case Study.",
                    "Hardware Tripartite Synapse Architecture based on Stochastic Computing.",
                    "Non-Intrusive MC/DC Measurement Based on Traces.",
                    "Optimized Step Semantics Encoding for Bounded Model Checking of Timed Automata.",
                    "Efficient Counter-factual Type Error Debugging.",
                    "Using Recurrent Neural Network to Predict Tactics for Proving Component Connector Properties in Coq.",
                    "Steering Interpolants Generation with Efficient Interpolation Abstraction Exploration.",
                    "A HOL Theory of the Differential for Matrix Functions.",
                    "A Quantitative Safety Verification Approach for the Decision-making Process of Autonomous Driving.",
                    "A Denotational Semantics for Dynamic Architectures.",
                    "Stuttering for Markov Automata.",
                    "Learning-based Probabilistic Modeling and Verifying Driver Behavior using MDP.",
                    "SMT-based Multi-objective Optimization for Scheduling of MPSoC Applications.",
                    "Certified Embedding of B Models in an Integrated Verification Framework.",
                    "Formalizing Time4sys using parametric timed automata.",
                    "Optimizing Quantum Programs Against Decoherence: Delaying Qubits into Quantum Superposition.",
                    "Low complexity and large interactions are possible in Strategy logic.",
                    "Automated Test Generation for IEC 61131-3 ST Programs via Dynamic Symbolic Execution.",
                    "Software Complexity Reduction by Automated Refactoring Schema.",
                    "IMSpec: An Extensible Approach to Exploring the Incorrect Usage of APIs.",
                    "Identify Blackboard Pattern Based on Ontology.",
                    "Verifying Opacity of a Modified PSTM.",
                    "Modeling and Verifying Transaction Scheduling for Software Transactional Memory using CSP.",
                    "Verifying the Relationship Among Three Descriptions in Problem Frames Using CSP.",
                    "A Common Semantic Scoring Method for Chinese Subjective Questions.",
                    "Understanding Ineffective Events and Reducing Test Sequences for Android Applications.",
                    "An Optimized Partial Rollback Co-simulation Approach for Heterogeneous FMUs."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "12th TASE 2018",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2018",
                "sub_name": "2018 International Symposium on Theoretical Aspects of Software Engineering, TASE 2018, Guangzhou, China, August 29-31, 2018.",
                "count": 20,
                "papers": [
                    "M-String Segmentation: A Refined Abstract Domain for String Analysis in C Programs.",
                    "Asynchronous Sessions with Implicit Functions and Messages.",
                    "A Fully Abstract Encoding for Sub Asynchronous Pi Calculus.",
                    "Towards a Program Logic for C11 Release-Sequences.",
                    "Efficient Algorithm for the Iteration Period Computation of Unfolded Synchronous Dataflow Graphs.",
                    "KRust: A Formal Executable Semantics of Rust.",
                    "RepassDroid: Automatic Detection of Android Malware Based on Essential Permissions and Semantic Features of Sensitive APIs.",
                    "Proving Partial-Correctness and Invariance Properties of Transition-System Models.",
                    "Formalization and Verification of AUTOSAR OS Standard's Memory Protection.",
                    "Decomposition and Composition of Sequence Diagrams.",
                    "Modeling and Verifying TopoGuard in OpenFlow-Based Software Defined Networks.",
                    "A Taxonomy of Code Changes Occurring within a Statement or a Signature.",
                    "Observational Models for Linearizability Checking on Weak Memory Models.",
                    "Modeling and Verification of NLSR Protocol using UPPAAL.",
                    "Telling Lies in Process Algebra.",
                    "Verifying Graph Transformations with Guarded Logics.",
                    "On Syntactic and Semantic Dependencies in Service-Oriented Architectures.",
                    "Decomposing Models Through Dependency Graphs.",
                    "An Improved LLF Scheduling for Reducing Maximum Heap Memory Consumption by Considering Laxity Time.",
                    "Semantics of Real-Time Trigger-Response Properties in Event-B."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "11th TASE 2017",
        "info": "Sophia Antipolis, France",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2017",
                "sub_name": "11th International Symposium on Theoretical Aspects of Software Engineering, TASE 2017, Sophia Antipolis, France, September 13-15, 2017.",
                "count": 19,
                "papers": [
                    "Formal methods for software testing (invited paper).",
                    "SCADE 6: A formal language for embedded critical software development (invited paper).",
                    "Conditional transition systems with upgrades.",
                    "Bisimulations for probabilistic linear lambda calculi.",
                    "Computing behavioural distance for fuzzy transition systems.",
                    "Optimizing backbone filtering.",
                    "An integrated framework for verifying multiple care pathways.",
                    "Assembly program verification for multiprocessors with relaxed memory model using SMT solver.",
                    "Formal verification of user-level real-time property patterns.",
                    "Time-sensitive information flow control in timed event-B.",
                    "Two under-approximation techniques for 3-modal abstraction coverage of event systems: Joint effort?",
                    "Automatic fine-grained locking generation for shared data structures.",
                    "Formal specification of security guidelines for program certification.",
                    "A safety and liveness theory for total reversibility.",
                    "Formal development process of safety-critical embedded human machine interface systems.",
                    "A bounded multi-dimensional modal logic for autonomous cars based on local traffic and estimation.",
                    "On the semantics of temporal specifications of component-behavior for dynamic architectures.",
                    "Modeling and reasoning about wireless networks: A graph-based calculus approach.",
                    "VMDV: A 3D visualization tool for modeling, demonstration, and verification."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "10th TASE 2016",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2016",
                "sub_name": "10th International Symposium on Theoretical Aspects of Software Engineering, TASE 2016, Shanghai, China, July 17-19, 2016.",
                "count": 26,
                "papers": [
                    "Cost-Utility Analysis in Probabilistic Models.",
                    "A New Roadmap on Linking Theories of Programming.",
                    "A Suspension-Trace Semantics for CSP.",
                    "On-the-Fly Determinization of Bounded Networks of Timed Automata.",
                    "Termination and Boundedness for Well-Structured Pushdown Systems.",
                    "The L-Depth Eventual Linear Ranking Functions for Single-Path Linear Constraint Loops.",
                    "Bayesian Statistical Model-Checking for Complex Stochastic Systems.",
                    "Sound Test-Suites for Cyber-Physical Systems.",
                    "SeededFuzz: Selecting and Generating Seeds for Directed Fuzzing.",
                    "Towards Parallel Model Generation for Random Performance Testing of Model-Oriented Operations.",
                    "Formal Refinement and Partitioning of a Fuel Pump System for Small Aircraft in Hybrid Event-B.",
                    "Formal Proof of Dynamic Memory Isolation Based on MMU.",
                    "Verifying OSEK/VDX OS Design Using Its Formal Specification.",
                    "Automatic Conversion and Verification System Based on AADL Scheduling Model.",
                    "UTP Semantics for Shared-State, Concurrent, Context-Sensitive Process Models.",
                    "Value-Passing CCS for Trees: A Theory for Concurrent Systems.",
                    "A Term Rewriting Approach to Analyze High Level Petri Nets.",
                    "Hypergraph Representation of Lambda-Terms.",
                    "Behaviour-Aware Matching of Cloud Applications.",
                    "Agile Validation of Higher Order Transformations Using F-Alloy.",
                    "Active Learning from Blackbox to Timed Connectors.",
                    "Hierarchical Multiset Theories of Cardinality-Based Feature Diagrams.",
                    "Lightweight Method-Level Energy Consumption Estimation for Android Applications.",
                    "From Traces to Proofs: Proving Concurrent Programs Safe.",
                    "Complete Contracts through Specification Drivers.",
                    "State-Taint Analysis for Detecting Resource Bugs."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "9th TASE 2015",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2015",
                "sub_name": "2015 International Symposium on Theoretical Aspects of Software Engineering, TASE 2015, Nanjing, China, September 12-14, 2015.",
                "count": 22,
                "papers": [
                    "Modeling and Reasoning about Software Systems Containing Uncertainty and Variability.",
                    "On Various Abstract Understandings of Abstract Interpretation.",
                    "Event and Strategy Analytics.",
                    "A Bottom-Up Approach to Check the Correctness of Interorganisational Workflows.",
                    "A Framework for Off-Line Conformance Testing of Timed Connectors.",
                    "A SAT-Based Analysis of a Calculus for Wireless Sensor Networks.",
                    "An Effective Approach to Measuring and Assessing the Risk of Android Application.",
                    "An Open Framework for Semantic Code Queries on Heterogeneous Repositories.",
                    "Evaluating Initial Inputs for Concolic Testing.",
                    "Formal Analysis of MAC in IEEE 802.11p with Probabilistic Model Checking.",
                    "Formal Semantics of Runtime Monitoring, Verification, Enforcement and Control.",
                    "Formal Verification of PKMv3 Protocol Using DT-Spin.",
                    "Formal Verification of Plastic User Interfaces Exploiting Domain Ontologies.",
                    "Formally Modeling and Analyzing the Reliability of Composite Service Evolution.",
                    "Polychronous Automata.",
                    "QaSten: Integrating Quantitative Verification with Safety Analysis for AADL Model.",
                    "Software Reliability Forecasting: Singular Spectrum Analysis and ARIMA Hybrid Model.",
                    "Verifying Interaction between Methods in Classes.",
                    "A Tool for Supporting Requirements Formalization Based on Specification Pattern Knowledge.",
                    "Modeling and Verification of Space-Air-Ground Integrated Networks on Requirement Level Using STeC.",
                    "Probabilistic Model Checking of Pipe protocol.",
                    "Transferable Optimal-size Fair E-cash with Optimal Anonymity."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "8th TASE 2014",
        "info": "Changsha, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2014",
                "sub_name": "2014 Theoretical Aspects of Software Engineering Conference, TASE 2014, Changsha, China, September 1-3, 2014.",
                "count": 30,
                "papers": [
                    "Data Automata in Scala.",
                    "Trace-Based Temporal Verification for Message-Passing Programs.",
                    "Spotlight Abstraction with Shade Clustering - Automatic Verification of Parameterised Systems.",
                    "Verifying Preemptive Kernel Code with Preemption Control Support.",
                    "A Three-Dimensional Model for Software Security Evaluation.",
                    "Contemplating the Addition of Stochastic Behaviour to Hybrid Event-B.",
                    "Modeling Social Networking Privacy.",
                    "Alleviating the Impact of Coincidental Correctness on the Effectiveness of SFL by Clustering Test Cases.",
                    "Choreography Scenario-Based Test Data Generation.",
                    "Formal Verification of Interrupt Injection in a Hypervisor.",
                    "Combining Syntactic and Semantic Encoding for LTL Bounded Model Checking.",
                    "Modeling and Verifying the TTCAN Protocol Using Timed CSP.",
                    "Parametrizing Program Analysis.",
                    "Behaviour Inference for Deadlock Checking.",
                    "Branch Obfuscation Using \"Black Boxes\".",
                    "An Approach to Modelling and Evaluating AGG Based Reliable Software Systems.",
                    "Degree of Schedulability of Mixed-Criticality Real-Time Systems with Probabilistic Sporadic Tasks.",
                    "Application-Specific Architecture Selection for Embedded Systems via Schedulability Analysis.",
                    "Energy-Efficient Task Scheduling and Task Energy Consumption Analysis for Real-Time Embedded Systems.",
                    "On Statistical Model Checking with PLASMA.",
                    "Mixed Simulation of Multi-valued Models.",
                    "An Improved Recursive Algorithm for Parity Games.",
                    "Towards a Stochastic Occurrence-Based Modeling Approach for Stochastic CPSs.",
                    "Bayesian Model-Based Prediction of Service Level Agreement Violations for Cloud Services.",
                    "Configuration of Services Based on Virtualization.",
                    "Data Resources in Dynamic Environments.",
                    "iDola: Bridge Modeling to Verification and Implementation of Interrupt-Driven Systems.",
                    "Timed Automata Semantics of Spatial-Temporal Consistency Language STeC.",
                    "A Formal Development Approach for Self-Organising Systems.",
                    "Normal Bisimulation for Higher Order Pi-Calculus with Unguarded Choice."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "7th TASE 2013",
        "info": "Birmingham, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2013",
                "sub_name": "Seventh International Symposium on Theoretical Aspects of Software Engineering, TASE 2013, 1-3 July 2013, Birmingham, UK.",
                "count": 35,
                "papers": [
                    "Engineering Multi-view Models for Model-Driven Engineering.",
                    "Planning in Real-Time Domains with Timed CTL Goals via Symbolic Model Checking.",
                    "Process Rewrite Systems for Software Model Checking.",
                    "Optimizing the SAT Decision Ordering of Bounded Model Checking by Structural Information.",
                    "A Timing Verification Framework for AUTOSAR OS Component Development Based on Real-Time Maude.",
                    "Modeling and Verification of AUTOSAR OS and EMS Application.",
                    "Formal Analysis of AODV Using Rely-Guarantee.",
                    "Algebraic Framework for Synchronous Language Semantics.",
                    "Towards Conformance Testing of Choreography Based on Scenario.",
                    "Aspect-Oriented Semantic Framework for Executable Models.",
                    "Designs with Angelic Nondeterminism.",
                    "When Even the Interface Evolves...",
                    "Model Repair for Markov Decision Processes.",
                    "Aspect Orientation Based Test Case Selection Strategy for Service Composition.",
                    "A Programming Language Approach to Fault Tolerance for Fork-Join Parallelism.",
                    "On Denotational Semantics of Spatial-Temporal Consistency Language - STeC.",
                    "An Operational Approach to Happens-Before Memory Model.",
                    "Using Intelligent Proxies to Develop Self-Adaptive Service-Based Systems.",
                    "Verifying Bigraphical Models of Architectural Reconfigurations.",
                    "Surfing with Fun.",
                    "Unified Modeling of Active and Reactive Components for Real-Time Systems.",
                    "Congruent Bisimulation Equivalence of Ambient Calculus Based on Contextual Transition System.",
                    "Feasibility Analysis of the EFSM Transition Path Combining Slicing with Theorem Proving.",
                    "Integration of Linear Constraints with a Temporal Logic Programming Language.",
                    "Incremental Construction of Greibach Normal Form.",
                    "How Should We Build That? Evolving a Development Environment That's Suitable for Constructing Today's Systems.",
                    "Exploiting Attributed Type Graphs to Generate Metamodel Instances Using an SMT Solver.",
                    "Computing Repairs from Active Integrity Constraints.",
                    "Modeling and Analyzing Self-Adaptive Systems with Context Petri Nets.",
                    "GSOS Formalized in Coq.",
                    "Class Diagrams with Equated Association Chains.",
                    "Normal Bisimulation for Higher Order Pi-Calculus with Unguarded Choice.",
                    "On Information Flow Control in Event-B and Refinement.",
                    "Growing a Language in Pattern Calculus.",
                    "Requirements-Driven Self-Repairing against Environmental Failures."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "6th TASE 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2012",
                "sub_name": "Sixth International Symposium on Theoretical Aspects of Software Engineering, TASE 2012, 4-6 July 2012, Beijing, China.",
                "count": 42,
                "papers": [
                    "Overview of TASE 2012 Talk on Search Based Software Engineering.",
                    "From Verification to Specification Inference.",
                    "Symbolic Model Checking for Propositional Projection Temporal Logic.",
                    "Formal Specification and Probabilistic Verification of SysML Activity Diagrams.",
                    "Modelling and Analysis of Smart Grid: A Stochastic Model Checking Case Study.",
                    "Strong Preservation by Model Deformation.",
                    "Formal Verification of Netlog Protocols.",
                    "Automated Verification of the FreeRTOS Scheduler in HIP/SLEEK.",
                    "Formal Specification of Hybrid MARTE Statecharts.",
                    "Incorporating Constraints to Software System Survivability Specification and Proof.",
                    "A Logic for Accumulated-Weight Reasoning on Multiweighted Modal Automata.",
                    "Frequency Linear-time Temporal Logic.",
                    "A Calculus of Higher Order Safe Ambients and Its Bisimulations.",
                    "An Improved Full Abstraction Approach to Analyzing Locality Semantics.",
                    "Model-Based Test Generation Using Evolutional Symbolic Grammar.",
                    "Integrating Model-Based Testing and Analysis Tools via Test Case Exchange.",
                    "Regression Test Cases Generation Based on Automatic Model Revision.",
                    "File Parsing Vulnerability Detection with Symbolic Execution.",
                    "Formal Verification and Simulation: Co-verification for Subway Control Systems.",
                    "Agile Services Oriented Virtualization of Web Services.",
                    "Modeling and Validation of PLC-Controlled Systems: A Case Study.",
                    "A Formal Diagrammatic Approach to Timed Workflow Modelling.",
                    "Recognising the Capacities of Dynamic Reconfiguration for the QoS Assurance of Running Systems in Concurrent and Parallel Environments.",
                    "Moverness for Locks and Transactions.",
                    "The Observer Pattern Applied to Actor Systems: A TLA/TLC-based Implementation Analysis.",
                    "Connectors as Designs: The Time Dimension.",
                    "A Type System for SPARDL.",
                    "Verifying OO Programs by Linking Algebraic and Abstract Specifications.",
                    "Binary Code Level Verification for Interrupt Safety Properties of Real-Time Operating System.",
                    "Dataflow Weaknesses Analysis of Scientific Workflow Based on Fault Tree.",
                    "An Approach for Process Variability Control in Business Process Management.",
                    "LBI Cut Elimination Proof with BI-MultiCut.",
                    "A Succinct and Efficient Implementation of a 2^32 BDD Package.",
                    "Executing Model Checking Counterexamples in Simulink.",
                    "Comparative Analysis of Clustering Protocols with Probabilistic Model Checking.",
                    "A Native Approach to Modeling Timed Behavior in the Pi-Calculus.",
                    "On model construction for modal mu-calculus.",
                    "Statement-Coverage Testing for Nondeterministic Concurrent Programs.",
                    "A Path-oriented Approach to Generating Executable Test Sequences for Extended Finite State Machines.",
                    "Dynamic Solution of Linear Constraints for Test Case Generation.",
                    "Categorical Reasoning about Meta-models.",
                    "Bisimulation for Lattice-valued Transition Systems."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "5th TASE 2011",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2011",
                "sub_name": "5th IEEE International Symposium on Theoretical Aspects of Software Engineering, TASE 2011, Xi'an, China, 29-31 August 2011.",
                "count": 39,
                "papers": [
                    "Making Program Logics Intelligible.",
                    "Automatic Specification-Based Testing: Challenges and Possibilities.",
                    "A Tagging Protocol for Asynchronous Testing.",
                    "Inheritance and Modularity in Specification and Verification of OO Programs.",
                    "Formalizing Application Programming Interfaces of the OSEK/VDX Operating System Specification.",
                    "Refactoring Object-Oriented Specifications with Inheritance-Based Polymorphism.",
                    "Focus Game for Projection Temporal Logic.",
                    "An Automatic Reasoning Mechanism for NFR Goal Models.",
                    "An Efficient Resolution Based Algorithm for SAT.",
                    "A Symbolic Algorithm for Shortest EG Witness Generation.",
                    "A Generative Approach to Searching Algorithmic Programs Development.",
                    "A Categorical Modeling Approach of Aspect-Oriented Systems.",
                    "Model Checking Multirate Hybrid Systems with Restricted Convex Polyhedron.",
                    "Behaviour Recognition Using Chronicles.",
                    "Approximate Bisimulation for Metric Doubly Labeled Transition System.",
                    "Java Goes TLA+.",
                    "A Simple Model for Certifying Assembly Programs with First-Class Function Pointers.",
                    "Towards an Axiomatic Verification System for JavaScript.",
                    "Modeling and Verifying the Code-Level OSEK/VDX Operating System with CSP.",
                    "An Approach to Handling Failure Recovery in Service Composition and Its Analysis.",
                    "Research on Web Service Composition Using Probabilistic Abstraction Refinement.",
                    "Modeling and Prototyping Business Processes in AutoPA.",
                    "Modeling and Verifying for Frameset-Based Web Applications.",
                    "A Stochastic-Petri-Net-Based Model for Ontology-Based Service Compositions.",
                    "Program Slicing Stored XSS Bugs in Web Application.",
                    "Towards a Probabilistic Calculus for Mobile Ad Hoc Networks.",
                    "Analysis of WS-BPEL Processes in PRISM.",
                    "Generating Probabilistic Temporal Logic Formulas from Probabilistic Scenario-Based Specifications.",
                    "Formal Specification of Domain-Specific ECA Policy Models.",
                    "Formal Specification for Real Time Cyber Physical Systems Using Aspect-Oriented Approach.",
                    "An Approach to Regression Test Selection of Adaptive EFSM Tests.",
                    "Test Case Generation Using PDA.",
                    "Undesirable Aspect Interactions: A Prevention Policy.",
                    "Model Checking for Protocols Using Verds.",
                    "Model Checking: A Coalgebraic Approach.",
                    "A Method to Generate Verification Condition Generator.",
                    "A Game Theoretic Model and Tree Analysis Method for Fair Exchange Protocols.",
                    "Modeling and Analyzing the (mu)TESLA Protocol Using CSP.",
                    "Proving Computational Geometry Algorithms in TLA+2."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "4th TASE 2010",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2010",
                "sub_name": "4th IEEE International Symposium on Theoretical Aspects of Software Engineering, TASE 2010, Taipei, Taiwan, 25-27 August 2010.",
                "count": 24,
                "papers": [
                    "Automated Test Case Generation of Self-Managing Policies for NASA Prototype Missions Developed with ASSL.",
                    "The Art of Developing Autonomic Systems - The ASSL Approach.",
                    "A Formal Model for Service Choreography with Exception Handling and Finalization.",
                    "A Guarded Workflow Language and Its Formal Semantics.",
                    "Proving Model Transformations.",
                    "A Certifying Compiler for Clike Subset of C Language.",
                    "Stack Bound Inference for Abstract Java Bytecode.",
                    "An Improved Algorithm for Building the Characterizing Set.",
                    "Runtime Verification with Multi-valued Formula Rewriting.",
                    "Axiomatic Temporal Logic Programs Verification.",
                    "On the Theoretical Foundation of Meta-Modelling in Graphically Extended BNF and First Order Logic.",
                    "Modeling and Analysis of Reconfigurable Systems Using Flexible Petri Nets.",
                    "Property Checking for 1-Place-Unbounded Petri Nets.",
                    "Model Checking Rectangular Hybrid Systems with Timed Computation Tree Logic.",
                    "Bisimulations for Open Processes in Higher Order p-Calculus.",
                    "Specification, Verification and Implementation of Business Processes Using CSP.",
                    "Incremental Invariant Generation for Compositional Design.",
                    "Compositional Abstraction Refinement for Timed Systems.",
                    "Parameterized Specification and Verification of PLC Systems in Coq.",
                    "Lazy Decision Diagrams for Word-Level Model Manipulation in Software Verification.",
                    "From Dynamic Condition Response Structures to Büchi Automata.",
                    "Probabilistic Model of System Survivability.",
                    "Estimating the Soft Error Vulnerability of Register Files via Interprocedural Data Flow Analysis.",
                    "Towards Practical Modeling of Web Applications and Generating Tests."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "3rd TASE 2009",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2009",
                "sub_name": "TASE 2009, Third IEEE International Symposium on Theoretical Aspects of Software Engineering, 29-31 July 2009, Tianjin, China.",
                "count": 57,
                "papers": [
                    "Verification and Performance Analysis for Embedded Systems.",
                    "Modular Development of Certified System Software.",
                    "Towards Expressive Specification and Efficient Model Checking.",
                    "Improving Responsiveness of Hard Real-Time Embedded Systems.",
                    "Environmental Simulation of Real-Time Systems with Nested Interrupts.",
                    "Semantics for Communicating Actors with Interdependent Real-Time Deadlines.",
                    "An Efficient Algorithm for Finding Empty Space for Reconfigurable Systems.",
                    "State Visibility and Communication in Unifying Theories of Programming.",
                    "Semantics of Metamodels in UML.",
                    "Refinement Algebra with Explicit Probabilism.",
                    "Environment Abstraction with State Clustering and Parameter Truncating.",
                    "Verification of Population Ring Protocols in PAT.",
                    "Bounded Model Checking of ACTL Formulae.",
                    "Coarse Grained Retrenchment and the Mondex Denial of Service Attacks.",
                    "Enforcing Constraints on Life Cycles of Business Artifacts.",
                    "Consistency Checking for LSC Specifications.",
                    "Integrating Specification and Programs for System Modeling and Verification.",
                    "A Framework and Language Support for Automatic Dynamic Testing of Workflow Management Systems.",
                    "Fault-Based Test Case Generation for Component Connectors.",
                    "Test Data Generation for Derived Types in C Program.",
                    "Program Repair as Sound Optimization of Broken Programs.",
                    "Modeling Web Applications and Generating Tests: A Combination and Interactions-guided Approach.",
                    "Merging of Use Case Models: Semantic Foundations.",
                    "Verifying Semistructured Data Normalization Using SWRL.",
                    "Verifying Self-stabilizing Population Protocols with Coq.",
                    "The Logical Approach to Low-Level Stack Reasoning.",
                    "Constructing Program Invariants via Solving QBF.",
                    "Using Architectural Constraints for Deadlock-Freedom of Component Systems with Multiway Cooperation.",
                    "Formal Reasoning about Concurrent Assembly Code with Reentrant Locks.",
                    "Algorithms for Computing Weak Bisimulation Equivalence.",
                    "Interpreting a Successful Testing Process: Risk and Actual Coverage.",
                    "Automated Test Case Generation Based on Coverage Analysis.",
                    "Exploring Topological Structure of Boolean Expressions for Test Data Selection.",
                    "On Testing 1-Safe Petri Nets.",
                    "Verifying the Implementation of an Operating System Scheduler.",
                    "A Tool for Estimating Memory Usage.",
                    "A Framework for Dependency Evaluation of the Agent Oriented Methodologies Work Flows.",
                    "Spontaneous Detection of Infinite Loops and Livelocks in Dynamic Testing of Concurrent Programs.",
                    "Specifying and Verifying PLC Systems with TLA+.",
                    "Domain Hierarchies: A Basic Theoretical Framework for Integrating Software Domains.",
                    "Improve Semantic Web Services Discovery through Similarity Search in Metric Space.",
                    "Parameterized Bisimulation Infinite Evolution Mechanism.",
                    "Modeling MapReduce with CSP.",
                    "Formal Specification and Experiments of an Expressive Human-Computer Ensemble System with Rehearsal.",
                    "Towards Automated Software Verification Using Model Checking Techniques.",
                    "Data Structure Shape Inference and Verification for OO Programs.",
                    "DUMS: A Dynamical Updatable Monitoring System for Desktop PCs Used for Distributed Computing.",
                    "Formal Representation and Analysis of a Near Miss Accident in N Sigma-labeled Calculus.",
                    "Representing Aspects in Design.",
                    "G-BLAST: BLAST Manager in an Heterogeneous Distributed Environment.",
                    "Probabilistic Coordination Language for Component Dynamic Composition.",
                    "Modeling Fault Tolerant Services in Service-Oriented Architecture.",
                    "Heap Memory Requirements Analysis via Separation Logic.",
                    "Automated Verification Using Unified Control Flows.",
                    "MARS: Metamodel Recovery from Multi-tiered Models Using Grammar Inference.",
                    "Formal Approaches to Deadlock Analysis in Competitions of Shared Web Resources.",
                    "Measuring the Survivability of Object-Oriented Software."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "2nd TASE 2008",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2008",
                "sub_name": "Second IEEE/IFIP International Symposium on Theoretical Aspects of Software Engineering, TASE 2008, June 17-19, 2008, Nanjing, China.",
                "count": 41,
                "papers": [
                    "Perspectives in Probabilistic Verification.",
                    "A Logical Framework for Software Testing.",
                    "ProB gets Nauty: Effective Symmetry Reduction for B and Z Models.",
                    "Bounded Model Checking of Compositional Processes.",
                    "Improving Encoding Efficiency for Bounded Model Checking.",
                    "Symbolic Model Checking APSL.",
                    "An Extension to Pointer Logic for Verification.",
                    "A Generic Model for Confinement and its Application.",
                    "A Fundamental Permission Interpretation for Ownership Types.",
                    "Structure and Interpretation of Computer Programs.",
                    "A Petri Net-Based Approach for Supporting Aspect-Oriented Modeling.",
                    "A Model-Driven Method for the Development of Web Applications User Interaction Layer.",
                    "A Conceptual Framework to Integrate Fault Prediction Sub-Process for Software Product Lines.",
                    "Executable Requirements Specification: Formal Semantics of Live Activity Diagrams.",
                    "A MDE Based Approach for Bridging Formal Models.",
                    "A Bigraphical Model of WSBPEL.",
                    "Producing UML Models from Focal Specifications: An Application to Airport Security Regulations.",
                    "UML Model Refactoring with Emphasis on Behavior Preservation.",
                    "Effective Predicate Abstraction for Program Verification.",
                    "Reasoning about Channel Passing in Choreography.",
                    "Workflow Semantics of Peer and Service Behaviour.",
                    "Verifying BPEL-Like Programs with Hoare Logic.",
                    "Modeling and Refining the Service-Oriented Requirement.",
                    "Transformation of BPEL Processes to Petri Nets.",
                    "Time-Abstracting Bisimulation for Probabilistic Timed Automata.",
                    "On Automatic Verification of Self-Stabilizing Population Protocols.",
                    "PDL over Accelerated Labeled Transition Systems.",
                    "Specifying Properties for Modular Pi-Calculus.",
                    "Towards Automatically Generating Test Paths for Web Application Testing.",
                    "Test Data Generation for C Programs with String-Handling Functions.",
                    "Implementing Higher-Order Control in Java.",
                    "An Empirical Study of Maintainability in Aspect-Oriented System Evolution Using Coupling Metrics.",
                    "A Multidimensional Model for Mum Effect in Offshore Outsourcing.",
                    "Completeness and Consistency Analysis on Requirements of Distributed Event-Driven Systems.",
                    "Open Logic Based on Partial-Ordered Partition Model.",
                    "A Memoized Strategy for Preference Logic Programs.",
                    "A Relational Model for Confined Separation Logic.",
                    "A Complete Axiomatization of Propositional Projection Temporal Logic.",
                    "Towards More Flexible Development of Z Specifications.",
                    "Pushing Requirements Changes through to Changes in Specifications.",
                    "Event-B Specification of a Situated Multi-Agent System: Study of a Platoon of Vehicles."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "1st TASE 2007",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/tase/2007",
                "sub_name": "First Joint IEEE/IFIP Symposium on Theoretical Aspects of Software Engineering, TASE 2007, June 5-8, 2007, Shanghai, China.",
                "count": 48,
                "papers": [
                    "Varieties of Static Analyzers: A Comparison with ASTREE.",
                    "Software Security.",
                    "Abstractions for Real Real-time Systems.",
                    "Symmetry Reduced Model Checking for B.",
                    "Multi-Valued Model Checking via Groebner Basis Approach.",
                    "Model Checking Software at Compile Time.",
                    "An Approach based on Bigraphical Reactive Systems to Check Architectural Instance Conforming to its Style.",
                    "A Formal Derivation of Grover's Quantum Search Algorithm.",
                    "Unified Modeling and Analysis based on Petri nets and Pi calculus.",
                    "An Object Type Graph System.",
                    "Self-adaptive Intrusion Detection System for Computational Grid.",
                    "Foundational certification of data-flow analyses.",
                    "A Certified Thread Library for Multithreaded User Programs.",
                    "Design of a Certifying Compiler Supporting Proof of Program Safety.",
                    "A Semantic Preorder on Refinement and Fairness.",
                    "Generation of optimal finite test suites for timed systems.",
                    "Test Selection Criteria for Modal Specifications of Reactive Systems.",
                    "Resource-Constrained Workflow Modeling.",
                    "Queuing analysis and performance evaluation of workflow through WFQN.",
                    "A Workflow Verification Method Based on Calculus.",
                    "Verification of Business Process Quality Constraints Based on Visual Process Patterns.",
                    "Partition Refinement in Abstract Model Checking.",
                    "Model Checking Networked Programs in the Presence of Transmission Failures.",
                    "Dynamic Verifying The Properties of The Simple Subset of PSL.",
                    "QCTL: A Logic for Reasoning about Inconsistent Concurrent Systems.",
                    "An Interpreter for Framed Tempura and Its Application.",
                    "Goal-independent Semantics for Path Dependent Analysis of Prolog Programs.",
                    "A Logical Framework for Monitoring and Evolving Software Components.",
                    "Commutability of Design Pattern Instantiation and Integration.",
                    "Timing and Concurrency Specification in Component-based Real-Time Embedded Systems Development.",
                    "Automating Language Evolution.",
                    "Synthesis Of Optimal-Cost Dynamic Observers for Fault Diagnosis of Discrete-Event Systems.",
                    "Foundational Typed Assembly Language with Certified Garbage Collection.",
                    "Evaluation of SAT-based Bounded Model Checking of ACTL Properties.",
                    "Specification-based Test Generation and Optimization Using Model Checking.",
                    "Streaming State Space: A Method of Distributed Model Verification.",
                    "A Formal Approach to Aspect-Oriented Modular Reconfigurable Computing.",
                    "Realizing Live Sequence Charts in SystemVerilog.",
                    "QCCS: A Formal Model to Enforce QoS Requirements in Service Composition.",
                    "A Software Process for Modeling Complex Systems with UML-RT.",
                    "Consistency and Minimality of UML Class Specifications with Multiplicities and Uniqueness Constraints.",
                    "Survivability-Aware Configuration Management of Service-Oriented System Based on Service Dependency.",
                    "Improving Combinability of Petri Nets with Inheritance, Aggregation and Association.",
                    "Dynamics of Control.",
                    "Symmetry in Process Algebra.",
                    "Constraint-Based Policy Negotiation and Enforcement for Telco Services.",
                    "Conformance Validation between Choreography and Orchestration.",
                    "QoS-Driven Service Composition Modeling with Extended Hierarchical CPN."
                ]
            }
        ]
    }
]