[
    {
        "name": "TKDD",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 81,
        "papers": [
            "DiMBERT: Learning Vision-Language Grounded Representations with Disentangled Multimodal-Attention.",
            "Cross-domain Recommendation with Bridge-Item Embeddings.",
            "A Latent Variable Augmentation Method for Image Categorization with Insufficient Training Samples.",
            "Graph-Based Stock Recommendation by Time-Aware Relational Attention Network.",
            "MULFE: Multi-Label Learning via Label-Specific Feature Space Ensemble.",
            "A Joint Passenger Flow Inference and Path Recommender System for Deploying New Routes and Stations of Mass Transit Transportation.",
            "Bayesian Additive Matrix Approximation for Social Recommendation.",
            "Recurrent Coupled Topic Modeling over Sequential Documents.",
            "Distributed Latent Dirichlet Allocation on Streams.",
            "Explainable Artificial Intelligence-Based Competitive Factor Identification.",
            "MCS+: An Efficient Algorithm for Crawling the Community Structure in Multiplex Networks.",
            "Generic Multi-label Annotation via Adaptive Graph and Marginalized Augmentation.",
            "Lost in Transduction: Transductive Transfer Learning in Text Classification.",
            "Modeling Temporal Patterns with Dilated Convolutions for Time-Series Forecasting.",
            "CrowdTC: Crowd-powered Learning for Text Classification.",
            "Jointly Modeling Heterogeneous Student Behaviors and Interactions among Multiple Prediction Tasks.",
            "MSIPA: Multi-Scale Interval Pattern-Aware Network for ICU Transfer Prediction.",
            "BiLabel-Specific Features for Multi-Label Classification.",
            "New Multi-View Classification Method with Uncertain Data.",
            "Unsupervised Subspace Extraction via Deep Kernelized Clustering.",
            "Communication from the Editor-in-Chief: State of the ACM Transactions on Knowledge Discovery from Data.",
            "On-Shelf Utility Mining of Sequence Data.",
            "Community Detection in Partially Observable Social Networks.",
            "Constrained Dual-Level Bandit for Personalized Impression Regulation in Online Ranking Systems.",
            "High-Value Token-Blocking: Efficient Blocking Method for Record Linkage.",
            "Establishing Smartphone User Behavior Model Based on Energy Consumption Data.",
            "A Robust Reputation-Based Group Ranking System and Its Resistance to Bribery.",
            "Exploiting Heterogeneous Graph Neural Networks with Latent Worker/Task Correlation Information for Label Aggregation in Crowdsourcing.",
            "Measuring the Network Vulnerability Based on Markov Criticality.",
            "A Synopsis Based Approach for Itemset Frequency Estimation over Massive Multi-Transaction Stream.",
            "Wealth Flow Model: Online Portfolio Selection Based on Learning Wealth Flow Matrices.",
            "Dynamically Adjusting Diversity in Ensembles for the Classification of Data Streams with Concept Drift.",
            "Learning Sentence-to-Hashtags Semantic Mapping for Hashtag Recommendation on Microblogs.",
            "Opinion Dynamics Optimization by Varying Susceptibility to Persuasion via Non-Convex Local Search.",
            "S2OSC: A Holistic Semi-Supervised Approach for Open Set Classification.",
            "Embedding Heterogeneous Information Network in Hyperbolic Spaces.",
            "Con&Net: A Cross-Network Anchor Link Discovery Method Based on Embedding Representation.",
            "Hybrid Variational Autoencoder for Recommender Systems.",
            "Assessing Large-Scale Power Relations among Locations from Mobility Data.",
            "KRAN: Knowledge Refining Attention Network for Recommendation.",
            "Spatio-Temporal Event Forecasting Using Incremental Multi-Source Feature Learning.",
            "Online and Distributed Robust Regressions with Extremely Noisy Labels.",
            "Knowledge Distillation with Attention for Deep Transfer Learning of Convolutional Networks.",
            "Semi-Supervised Ensemble Learning for Dealing with Inaccurate and Incomplete Supervision.",
            "Network Embedding via Motifs.",
            "Balance-Subsampled Stable Prediction Across Unknown Test Data.",
            "DACHA: A Dual Graph Convolution Based Temporal Knowledge Graph Representation Learning Method Using Historical Relation.",
            "Context-Aware Semantic Annotation of Mobility Records.",
            "Corpus-level and Concept-based Explanations for Interpretable Document Classification.",
            "Context-aware Spatial-Temporal Neural Network for Citywide Crowd Flow Prediction via Modeling Long-range Spatial Dependency.",
            "Unsupervised Adversarial Network Alignment with Reinforcement Learning.",
            "NTP-Miner: Nonoverlapping Three-Way Sequential Pattern Mining.",
            "Network Public Opinion Detection During the Coronavirus Pandemic: A Short-Text Relational Topic Model.",
            "Graph Community Infomax.",
            "Social Group Query Based on Multi-Fuzzy-Constrained Strong Simulation.",
            "A Normalizing Flow-Based Co-Embedding Model for Attributed Networks.",
            "Time-Aware Graph Embedding: A Temporal Smoothness and Task-Oriented Approach.",
            "HCBST: An Efficient Hybrid Sampling Technique for Class Imbalance Problems.",
            "Toward Understanding and Evaluating Structural Node Embeddings.",
            "Deciphering Feature Effects on Decision-Making in Ordinal Regression Problems: An Explainable Ordinal Factorization Model.",
            "Scalable Mining of High-Utility Sequential Patterns With Three-Tier MapReduce Model.",
            "Compression of Deep Learning Models for Text: A Survey.",
            "Forecasting the Market with Machine Learning Algorithms: An Application of NMC-BERT-LSTM-DQN-X Algorithm in Quantitative Trading.",
            "RHPTree - Risk Hierarchical Pattern Tree for Scalable Long Pattern Mining.",
            "Mixed Information Flow for Cross-Domain Sequential Recommendations.",
            "TRACE: Travel Reinforcement Recommendation Based on Location-Aware Context Extraction.",
            "Causal Feature Selection with Missing Data.",
            "A Trajectory Evaluator by Sub-tracks for Detecting VOT-based Anomalous Trajectory.",
            "A Self-Supervised Representation Learning of Sentence Structure for Authorship Attribution.",
            "Privacy-Preserving Mechanisms for Multi-Label Image Recognition.",
            "Domain-Specific Keyword Extraction Using Joint Modeling of Local and Global Contextual Semantics.",
            "Adaptive Model Scheduling for Resource-efficient Data Labeling.",
            "Disambiguation Enabled Linear Discriminant Analysis for Partial Label Dimensionality Reduction.",
            "ABLE: Meta-Path Prediction in Heterogeneous Information Networks.",
            "Auto IV: Counterfactual Prediction via Automatic Instrumental Variable Decomposition.",
            "Real-Time Anomaly Detection in Edge Streams.",
            "sGrapp: Butterfly Approximation in Streaming Graphs.",
            "Multiple Graphs and Low-Rank Embedding for Multi-Source Heterogeneous Domain Adaptation.",
            "When Less Is More: Systematic Analysis of Cascade-Based Community Detection.",
            "Distributed Triangle Approximately Counting Algorithms in Simple Graph Stream.",
            "Hypergraph Convolution on Nodes-Hyperedges Network for Semi-Supervised Node Classification."
        ]
    },
    {
        "name": "TKDD",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 112,
        "papers": [
            "Hierarchical Physician Recommendation via Diversity-enhanced Matrix Factorization.",
            "Span-core Decomposition for Temporal Networks: Algorithms and Applications.",
            "Dynamic Graph Mining for Multi-weight Multi-destination Route Planning with Deadlines Constraints.",
            "Class Imbalance and Cost-Sensitive Decision Trees: A Unified Survey Based on a Core Similarity.",
            "Multi-Stage Network Embedding for Exploring Heterogeneous Edges.",
            "Robust Tensor Recovery with Fiber Outliers for Traffic Events.",
            "Automatic Recommendation of a Distance Measure for Clustering Algorithms.",
            "Combinatorial Algorithms for String Sanitization.",
            "Heterogeneous Graphlets.",
            "Accelerating Large-Scale Heterogeneous Interaction Graph Embedding Learning via Importance Sampling.",
            "MeSHProbeNet-P: Improving Large-scale MeSH Indexing with Personalizable MeSH Probes.",
            "CrowdWT: Crowdsourcing via Joint Modeling of Workers and Tasks.",
            "A Reduced Network Traffic Method for IoT Data Clustering.",
            "Knowledge Graph Embedding for Link Prediction: A Comparative Analysis.",
            "Identifying Linear Models in Multi-Resolution Population Data Using Minimum Description Length Principle to Predict Household Income.",
            "Recommending Statutes: A Portable Method Based on Neural Networks.",
            "HARP: A Novel Hierarchical Attention Model for Relation Prediction.",
            "High-Order Structure Exploration on Massive Graphs: A Local Graph Clustering Perspective.",
            "An Exponential Factorization Machine with Percentage Error Minimization to Retail Sales Forecasting.",
            "Trajectory Outlier Detection: New Problems and Solutions for Smart Cities.",
            "Sampling Sparse Representations with Randomized Measurement Langevin Dynamics.",
            "The 8M Algorithm from Today's Perspective.",
            "Core Interest Network for Click-Through Rate Prediction.",
            "Context-Based Evaluation of Dimensionality Reduction Algorithms - Experiments and Statistical Significance Analysis.",
            "Heterogeneous Network Approach to Predict Individuals' Mental Health.",
            "Unbiased Measurement of Feature Importance in Tree-Based Methods.",
            "Mitigating Class-Boundary Label Uncertainty to Reduce Both Model Bias and Variance.",
            "An Instance Space Analysis of Regression Problems.",
            "Noise Corrected Sampling of Online Social Networks.",
            "Generating Artificial Outliers in the Absence of Genuine Ones - A Survey.",
            "Stacked Convolutional Sparse Auto-Encoders for Representation Learning.",
            "Joint Transferable Dictionary Learning and View Adaptation for Multi-view Human Action Recognition.",
            "Towards Automatic Construction of Multi-Network Models for Heterogeneous Multi-Task Learning.",
            "An Improved KNN-Based Efficient Log Anomaly Detection Method with Automatically Labeled Samples.",
            "Predicting Influential Users in Online Social Network Groups.",
            "Understanding Persuasion Cascades in Online Product Rating Systems: Modeling, Analysis, and Inference.",
            "Probability Ordinal-Preserving Semantic Hashing for Large-Scale Image Retrieval.",
            "CoCoS: Fast and Accurate Distributed Triangle Counting in Graph Streams.",
            "Multi-View Collaborative Network Embedding.",
            "Scholar2vec: Vector Representation of Scholars for Lifetime Collaborator Prediction.",
            "TPmod: A Tendency-Guided Prediction Model for Temporal Knowledge Graph Completion.",
            "Reducing Cumulative Errors of Incremental CP Decomposition in Dynamic Online Social Networks.",
            "Parallel Greedy Algorithm to Multiple Influence Maximization in Social Network.",
            "Exploring Deep Reinforcement Learning for Task Dispatching in Autonomous On-Demand Services.",
            "GGATB-LSTM: Grouping and Global Attention-based Time-aware Bidirectional LSTM Medical Treatment Behavior Prediction.",
            "A Scalable Redefined Stochastic Blockmodel.",
            "Knowledge Transfer with Weighted Adversarial Network for Cold-Start Store Site Recommendation.",
            "TipTap: Approximate Mining of Frequent k-Subgraph Patterns in Evolving Graphs.",
            "Preserve Integrity in Realtime Event Summarization.",
            "Deep Learning-Based Energy Disaggregation and On/Off Detection of Household Appliances.",
            "Efficient and High-Quality Seeded Graph Matching: Employing Higher-order Structural Information.",
            "Neural Networks for Entity Matching: A Survey.",
            "Fast Connectivity Minimization on Large-Scale Networks.",
            "A Layout-Based Classification Method for Visualizing Time-Varying Graphs.",
            "Mobile App Cross-Domain Recommendation with Multi-Graph Neural Network.",
            "Elastic Embedding through Graph Convolution-based Regression for Semi-supervised Classification.",
            "3E-LDA: Three Enhancements to Linear Discriminant Analysis.",
            "Jointly Modeling Spatio-Temporal Dependencies and Daily Flow Correlations for Crowd Flow Prediction.",
            "Online Sampling of Temporal Networks.",
            "Side Information Fusion for Recommender Systems over Heterogeneous Information Network.",
            "Search Efficient Binary Network Embedding.",
            "Network Embedding on Hierarchical Community Structure Network.",
            "A Unified View of Causal and Non-causal Feature Selection.",
            "Robust Image Representation via Low Rank Locality Preserving Projection.",
            "Benchmarking Unsupervised Outlier Detection with Realistic Synthetic Data.",
            "SAKE: Estimating Katz Centrality Based on Sampling for Large-Scale Social Networks.",
            "Variable-lag Granger Causality and Transfer Entropy for Time Series Analysis.",
            "Exploiting Temporal Dynamics in Product Reviews for Dynamic Sentiment Prediction at the Aspect Level.",
            "Attribute-Guided Network Sampling Mechanisms.",
            "User Embedding for Expert Finding in Community Question Answering.",
            "A Stochastic Algorithm Based on Reverse Sampling Technique to Fight Against the Cyberbullying.",
            "Attributed Network Embedding with Micro-Meso Structure.",
            "Clustering Heterogeneous Information Network by Joint Graph Embedding and Nonnegative Matrix Factorization.",
            "A Survey on Causal Inference.",
            "Critique on Natural Noise in Recommender Systems.",
            "Density Guarantee on Finding Multiple Subgraphs and Subtensors.",
            "Optimal Algebraic Breadth-First Search for Sparse Graphs.",
            "Graph Neural Networks for Fast Node Ranking Approximation.",
            "Tiered Sampling: An Efficient Method for Counting Sparse Motifs in Massive Graph Streams.",
            "Improved Customer Lifetime Value Prediction With Sequence-To-Sequence Learning and Feature-Based Models.",
            "Mining Largest Maximal Quasi-Cliques.",
            "Utility Mining Across Multi-Dimensional Sequences.",
            "DeepDepict: Enabling Information Rich, Personalized Product Description Generation With the Deep Multiple Pointer Generator Network.",
            "Adaptive Influence Maximization: If Influential Node Unwilling to Be the Seed.",
            "Dual-Embedding based Deep Latent Factor Models for Recommendation.",
            "Sequential Transform Learning.",
            "Self-Adaptive Skeleton Approaches to Detect Self-Organized Coalitions From Brain Functional Networks Through Probabilistic Mixture Models.",
            "Deep Graph Matching and Searching for Semantic Code Retrieval.",
            "Streaming Social Event Detection and Evolution Discovery in Heterogeneous Information Networks.",
            "Exploring BCI Control in Smart Environments: Intention Recognition Via EEG Representation Enhancement Learning.",
            "Anomaly Detection With Kernel Preserving Embedding.",
            "A Method for Mining Granger Causality Relationship on Atmospheric Visibility.",
            "Multi-objective Cuckoo Search-based Streaming Feature Selection for Multi-label Dataset.",
            "Link Recommendation for Social Influence Maximization.",
            "Trust Prediction for Online Social Networks with Integrated Time-Aware Similarity.",
            "Faster Motif Counting via Succinct Color Coding and Adaptive Sampling.",
            "Fast and Robust Dictionary-based Classification for Image Data.",
            "Similarity Embedding Networks for Robust Human Activity Recognition.",
            "Demarcating Endogenous and Exogenous Opinion Dynamics: An Experimental Design Approach.",
            "SIR-GN: A Fast Structural Iterative Representation Learning Approach For Graph Nodes.",
            "Learning Graph Neural Networks with Positive and Unlabeled Nodes.",
            "NeuSE: A Neural Snapshot Ensemble Method for Collaborative Filtering.",
            "The Pulse of Urban Transport: Exploring the Co-evolving Pattern for Spatio-temporal Forecasting.",
            "Hierarchical Concept-Driven Language Model.",
            "Page-Level Main Content Extraction From Heterogeneous Webpages.",
            "Maximum Likelihood Estimation of Power-law Degree Distributions via Friendship Paradox-based Sampling.",
            "Online Tensor-Based Learning Model for Structural Damage Detection.",
            "On Modeling Influence Maximization in Social Activity Networks under General Settings.",
            "Incremental Community Detection on Large Complex Attributed Network.",
            "3DGCN: 3-Dimensional Dynamic Graph Convolutional Network for Citywide Crowd Flow Prediction.",
            "Factor-Bounded Nonnegative Matrix Factorization.",
            "App2Vec: Context-Aware Application Usage Prediction."
        ]
    },
    {
        "name": "TKDD",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 78,
        "papers": [
            "A New Smooth Approximation to the Zero One Loss with a Probabilistic Interpretation.",
            "A Unified Multi-view Clustering Algorithm Using Multi-objective Optimization Coupled with Generative Model.",
            "Local Overlapping Community Detection.",
            "CFOF: A Concentration Free Measure for Anomaly Detection.",
            "Fast Parallel Algorithms for Counting and Listing Triangles in Big Graphs.",
            "Treatment Effect Estimation via Differentiated Confounder Balancing and Regression.",
            "Evolutionary Classifier and Cluster Selection Approach for Ensemble Classification.",
            "A Review on OLAP Technologies Applied to Information Networks.",
            "Adaptive Local Linear Discriminant Analysis.",
            "Inferring Lifetime Status of Point-of-Interest: A Multitask Multiclass Approach.",
            "Core Decomposition in Multilayer Networks: Theory, Algorithms, and Applications.",
            "Fast, Accurate and Provable Triangle Counting in Fully Dynamic Graph Streams.",
            "Generalizing Long Short-Term Memory Network for Deep Learning from Generic Data.",
            "Budget-Constrained Real-Time Bidding Optimization: Multiple Predictors Make It Better.",
            "Multi-task Information Bottleneck Co-clustering for Unsupervised Cross-view Human Action Categorization.",
            "Bradykinesia Recognition in Parkinson's Disease via Single RGB Video.",
            "Real-time Transportation Prediction Correction using Reconstruction Error in Deep Learning.",
            "CenEEGs: Valid EEG Selection for Classification.",
            "Ranking from Crowdsourced Pairwise Comparisons via Smoothed Riemannian Optimization.",
            "AR2Net: An Attentive Neural Approach for Business Location Selection with Satellite Data and Urban Data.",
            "Multiple Set Matching with Bloom Matrix and Bloom Vector.",
            "Community Detection by Motif-Aware Label Propagation.",
            "New Algorithms of Feature Selection and Big Data Assignment for CBR System Integrated by Bayesian Network.",
            "Probabilistic Topic Modeling for Comparative Analysis of Document Collections.",
            "Linearization of Dependency and Sampling for Participation-based Betweenness Centrality in Very Large B-hypergraphs.",
            "MP2SDA: Multi-Party Parallelized Sparse Discriminant Learning.",
            "Efficient Ridesharing Framework for Ride-matching via Heterogeneous Network Embedding.",
            "Data Sharing via Differentially Private Coupled Matrix Factorization.",
            "Continuous Influence Maximization.",
            "Robust Drift Characterization from Event Streams of Business Processes.",
            "Story Forest: Extracting Events and Telling Stories from Breaking News.",
            "A Deep Multi-task Contextual Attention Framework for Multi-modal Affect Analysis.",
            "Enhanced Data Mining Technique to Measure Satisfaction Degree of Social Media Users of Xeljanz Drug.",
            "Better Classifier Calibration for Small Datasets.",
            "Framework for Inferring Following Strategies from Time Series of Movement Data.",
            "Network Embedding for Community Detection in Attributed Networks.",
            "Mining Career Paths from Large Resume Databases: Evidence from IT Professionals.",
            "Incomplete Network Alignment: Problem Definitions and Fast Solutions.",
            "Fully Dynamic Approximate k-Core Decomposition in Hypergraphs.",
            "Efficient Nonnegative Tensor Factorization via Saturating Coordinate Descent.",
            "The Gene of Scientific Success.",
            "Citywide Traffic Flow Prediction Based on Multiple Gated Spatio-temporal Convolutional Neural Networks.",
            "Social Collaborative Mutual Learning for Item Recommendation.",
            "Learning Bayesian Networks with the Saiyan Algorithm.",
            "Edge2vec: Edge-based Social Network Embedding.",
            "Sparse Graph Connectivity for Image Segmentation.",
            "Internal Evaluation of Unsupervised Outlier Detection.",
            "Self-weighted Multi-view Fuzzy Clustering.",
            "Discovering Anomalies by Incorporating Feedback from an Expert.",
            "Neural Serendipity Recommendation: Exploring the Balance between Accuracy and Novelty with Sparse Explicit Feedback.",
            "Introduction to the Special Issue on the Best Papers from KDD 2018.",
            "Towards an Optimal Outdoor Advertising Placement: When a Budget Constraint Meets Moving Trajectories.",
            "Multi-User Mobile Sequential Recommendation for Route Optimization.",
            "Learning Distance Metrics from Probabilistic Information.",
            "Pop Music Generation: From Melody to Multi-style Arrangement.",
            "Non-Redundant Subspace Clusterings with Nr-Kmeans and Nr-DipMeans.",
            "MiSoSouP: Mining Interesting Subgroups with Sampling and Pseudodimension.",
            "Adversarial Attacks on Graph Neural Networks: Perturbations and their Patterns.",
            "Efficient Approaches to k Representative G-Skyline Queries.",
            "A Unified Framework for Sparse Online Learning.",
            "A General Coreset-Based Approach to Diversity Maximization under Matroid Constraints.",
            "End-to-End Continual Rare-Class Recognition with Emerging Novel Subclasses.",
            "Efficient Mining of Outlying Sequence Patterns for Analyzing Outlierness of Sequence Data.",
            "On Proximity and Structural Role-based Embeddings in Networks: Misconceptions, Techniques, and Applications.",
            "Boosting Item-based Collaborative Filtering via Nearly Uncoupled Random Walks.",
            "NGUARD+: An Attention-based Game Bot Detection Framework via Player Behavior Sequences.",
            "Influence Maximization: Seeding Based on Community Structure.",
            "Exploiting User Preference and Mobile Peer Influence for Human Mobility Annotation.",
            "Heterogeneous Univariate Outlier Ensembles in Multidimensional Data.",
            "Probabilistic Modeling for Frequency Vectors Using a Flexible Shifted-Scaled Dirichlet Distribution Prior.",
            "An Approach For Concept Drift Detection in a Graph Stream Using Discriminative Subgraphs.",
            "Efficient Outlier Detection in Text Corpus Using Rare Frequency and Ranking.",
            "Time-Warped Sparse Non-negative Factorization for Functional Data Analysis.",
            "Scalable Spatial Scan Statistics for Trajectories.",
            "Bi-Directional Recurrent Attentional Topic Model.",
            "Robust Adaptive Linear Discriminant Analysis with Bidirectional Reconstruction Constraint.",
            "Large-scale Data Exploration Using Explanatory Regression Functions.",
            "REMIAN: Real-Time and Error-Tolerant Missing Value Imputation."
        ]
    },
    {
        "name": "TKDD",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 65,
        "papers": [
            "Sequential Feature Explanations for Anomaly Detection.",
            "Digger: Detect Similar Groups in Heterogeneous Social Networks.",
            "Algorithms for Online Influencer Marketing.",
            "Robust Spectral Ensemble Clustering via Rank Minimization.",
            "PSP-AMS: Progressive Mining of Sequential Patterns Across Multiple Streams.",
            "Tensor Completion Algorithms in Big Data Analytics.",
            "Text Mining for Evaluating Authors' Birth and Death Years.",
            "Differentiating Regularization Weights - A Simple Mechanism to Alleviate Cold Start in Recommender Systems.",
            "Large Scale Online Multiple Kernel Regression with Application to Time-Series Prediction.",
            "Chameleon 2: An Improved Graph-Based Clustering Algorithm.",
            "Characterizing Directed and Undirected Networks via Multidimensional Walks with Jumps.",
            "Detecting and Assessing Anomalous Evolutionary Behaviors of Nodes in Evolving Social Networks.",
            "Addendum to the Special Issue on Interactive Data Exploration and Analytics (TKDD, Vol. 12 Iss. 1).",
            "Fast Approximate Score Computation on Large-Scale Distributed Data for Learning Multinomial Bayesian Networks.",
            "Taxonomy and Evaluation for Microblog Popularity Prediction.",
            "Rumor Blocking through Online Link Deletion on Social Networks.",
            "Outcome-Oriented Predictive Process Monitoring: Review and Benchmark.",
            "Performance Bounds of Decentralized Search in Expert Networks for Query Answering.",
            "DWE-Med: Dynamic Word Embeddings for Medical Domain.",
            "Near-Optimal and Practical Algorithms for Graph Scan Statistics with Connectivity Constraints.",
            "Probabilistic Feature Selection and Classification Vector Machine.",
            "Feature Selection via Transferring Knowledge Across Different Classes.",
            "Variant Grassmann Manifolds: A Representation Augmentation Method for Action Recognition.",
            "Leveraging Label-Specific Discriminant Mapping Features for Multi-Label Learning.",
            "A Survey of Parallel Sequential Pattern Mining.",
            "The Relationship between Online Social Network Ties and User Attributes.",
            "Multi-task Crowdsourcing via an Optimization Framework.",
            "Robust Regression via Heuristic Corruption Thresholding and Its Adaptive Estimation Variation.",
            "Information Diffusion Prediction with Network Regularized Role-based User Representation Learning.",
            "Tensorizing Restricted Boltzmann Machine.",
            "Leveraging Kernel-Incorporated Matrix Factorization for App Recommendation.",
            "Translations Diversification for Expert Finding: A Novel Clustering-based Approach.",
            "Balancing Prediction Errors for Robust Sentiment Classification.",
            "Identifying Complements and Substitutes of Products: A Neural Network Framework Based on Product Embedding.",
            "Road Network Construction with Complex Intersections Based on Sparsely Sampled Private Car Trajectory Data.",
            "Active Two Phase Collaborative Representation Classifier.",
            "Time-Sync Video Tag Extraction Using Semantic Association Graph.",
            "A Distance Measure for the Analysis of Polar Opinion Dynamics in Social Networks.",
            "Maximally Correlated Principal Component Analysis Based on Deep Parameterization Learning.",
            "On the Impact of Voice Encoding and Transmission on the Predictions of Speaker Warmth and Attractiveness.",
            "Bursty Event Detection in Twitter Streams.",
            "Heterogeneous-Length Text Topic Modeling for Reader-Aware Multi-Document Summarization.",
            "Housing Demand Estimation Based on Express Delivery Data.",
            "Continuous-Time Relationship Prediction in Dynamic Heterogeneous Information Networks.",
            "Clustering Users by Their Mobility Behavioral Patterns.",
            "Fine-Grained Air Quality Inference with Remote Sensing Data and Ubiquitous Urban Data.",
            "Probabilistic Mixture Model for Mapping the Underground Pipes.",
            "Bayesian Model Selection Approach to Multiple Change-Points Detection with Non-Local Prior Distributions.",
            "Real-Time Estimation of the Urban Air Quality with Mobile Sensor System.",
            "Self-Adaptive Particle Swarm Optimization for Large-Scale Feature Selection in Classification.",
            "Hybrid Crowd-Machine Wrapper Inference.",
            "Krylov Subspace Approximation for Local Community Detection in Large Networks.",
            "Computing top-k Closeness Centrality Faster in Unweighted Graphs.",
            "Density-Friendly Graph Decomposition.",
            "Aspect Aware Learning for Aspect Category Sentiment Analysis.",
            "A Unified Framework with Multi-source Data for Predicting Passenger Demands of Ride Services.",
            "CT LIS: Learning Influences and Susceptibilities through Temporal Behaviors.",
            "High-Utility Itemset Mining with Effective Pruning Strategies.",
            "Mining Rank Data.",
            "Multi-Label Punitive kNN with Self-Adjusting Memory for Drifting Data Streams.",
            "Interactive Recommendation with User-Specific Deep Reinforcement Learning.",
            "Attention Models in Graphs: A Survey.",
            "A Pipeline Computing Method of SpTV for Three-Order Tensors on CPU and GPU.",
            "Recurrent Meta-Structure for Robust Similarity Measure in Heterogeneous Information Networks.",
            "In Search of a Stochastic Model for the E-News Reader."
        ]
    },
    {
        "name": "TKDD",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 73,
        "papers": [
            "Editorial: TKDD Special Issue on Interactive Data Exploration and Analytics.",
            "A Viewable Indexing Structure for the Interactive Exploration of Dynamic and Large Image Collections.",
            "ATR-Vis: Visual and Interactive Information Retrieval for Parliamentary Discussions in Twitter.",
            "Memory-Efficient and Accurate Sampling for Counting Local Triangles in Graph Streams: From Simple to Multigraphs.",
            "Visual Analysis of Brain Networks Using Sparse Regression Models.",
            "Mining Redescriptions with Siren.",
            "Interactive Discovery of Coordinated Relationship Chains with Maximum Entropy Models.",
            "VisIRR: A Visual Analytics System for Information Retrieval and Recommendation for Large-Scale Document Data.",
            "A Session-Based Approach to Fast-But-Approximate Interactive Data Cube Exploration.",
            "GrammarViz 3.0: Interactive Discovery of Variable-Length Time Series Patterns.",
            "CommunityDiff: Visualizing Community Clustering Algorithms.",
            "Learning to Infer Competitive Relationships in Heterogeneous Networks.",
            "Partial Sum Minimization of Singular Values Representation on Grassmann Manifolds.",
            "Data Stream Evolution Diagnosis Using Recursive Wavelet Density Estimators.",
            "Emerging Trends in Personality Identification Using Online Social Networks - A Literature Survey.",
            "Systematic Review of Clustering High-Dimensional and Large Datasets.",
            "Local Spectral Clustering for Overlapping Community Detection.",
            "Mining Overlapping Communities and Inner Role Assignments through Bayesian Mixed-Membership Models of Networks with Context-Dependent Interactions.",
            "Profit Maximization with Sufficient Customer Satisfactions.",
            "Community Detection Using Diffusion Information.",
            "De-anonymizing Clustered Social Networks by Percolation Graph Matching.",
            "Joint Representation Learning for Location-Based Social Networks with Multi-Grained Sequential Contexts.",
            "Collaborative Filtering with Topic and Social Latent Factors Incorporating Implicit Feedback.",
            "Discovering Communities and Anomalies in Attributed Graphs: Interactive Visual Exploration and Summarization.",
            "GOOWE: Geometrically Optimum and Online-Weighted Ensemble Classifier for Evolving Data Streams.",
            "Enhancing Reputation via Price Discounts in E-Commerce Systems: A Data-Driven Approach.",
            "G-RoI: Automatic Region-of-Interest Detection Driven by Geotagged Social Media Data.",
            "Fast, Accurate, and Flexible Algorithms for Dense Subtensor Mining.",
            "Prioritized Relationship Analysis in Heterogeneous Information Networks.",
            "Will Triadic Closure Strengthen Ties in Social Networks?",
            "Large-Scale Bayesian Probabilistic Matrix Factorization with Memo-Free Distributed Variational Inference.",
            "Multi-View Low-Rank Analysis with Applications to Outlier Detection.",
            "ProgressER: Adaptive Progressive Approach to Relational Entity Resolution.",
            "Twitter Geolocation: A Hybrid Approach.",
            "Tied Kronecker Product Graph Models to Capture Variance in Network Populations.",
            "Function-on-Function Regression with Mode-Sparsity Regularization.",
            "Continuous-Time User Modeling in Presence of Badges: A Probabilistic Approach.",
            "Mining Event-Oriented Topics in Microblog Stream with Unsupervised Multi-View Hierarchical Embedding.",
            "GTΔ: Detecting Temporal Changes in Group Stochastic Processes.",
            "Social Network Monitoring for Bursty Cascade Detection.",
            "Mining Graphlet Counts in Online Social Networks.",
            "Consensus Guided Multi-View Clustering.",
            "Behavior2Vec: Generating Distributed Representations of Users' Behaviors on Products for Recommender Systems.",
            "Exploring Multiobjective Optimization for Multiview Clustering.",
            "Generating Realistic Synthetic Population Datasets.",
            "Designing Size Consistent Statistics for Accurate Anomaly Detection in Dynamic Networks.",
            "iGRM: Improved Grey Relational Model and Its Ensembles for Occupancy Sensing in Internet of Things Applications.",
            "Motif Counting Beyond Five Nodes.",
            "Exploiting User Posts for Web Document Summarization.",
            "Evasion-Robust Classification on Binary Domains.",
            "Comparison of Ontology Alignment Systems Across Single Matching Task Via the McNemar's Test.",
            "Time Series Classification with HIVE-COTE: The Hierarchical Vote Collective of Transformation-Based Ensembles.",
            "Coordination Event Detection and Initiator Identification in Time Series Data.",
            "Employing Semantic Context for Sparse Information Extraction Assessment.",
            "ClassiNet - Predicting Missing Features for Short-Text Classification.",
            "Spatio-Temporal Routine Mining on Mobile Phone Data.",
            "SemRe-Rank: Improving Automatic Term Extraction by Incorporating Semantic Relatedness with Personalised PageRank.",
            "Online Active Learning with Expert Advice.",
            "Discovering Mobile Application Usage Patterns from a Large-Scale Dataset.",
            "Cluster's Quality Evaluation and Selective Clustering Ensemble.",
            "ABRA: Approximating Betweenness Centrality in Static and Dynamic Graphs with Rademacher Averages.",
            "Representation Learning for Classification in Heterogeneous Graphs with Application to Social Networks.",
            "Coupled Clustering Ensemble by Exploring Data Interdependence.",
            "Entity-Based Query Recommendation for Long-Tail Queries.",
            "Modeling Alzheimer's Disease Progression with Fused Laplacian Sparse Group Lasso.",
            "Stability and Robustness in Influence Maximization.",
            "Protecting Privacy in Trajectories with a User-Centric Approach.",
            "FrauDetector+: An Incremental Graph-Mining Approach for Efficient Fraudulent Phone Call Detection.",
            "Large-Scale Adversarial Sports Play Retrieval with Learning to Rank.",
            "A General Embedding Framework for Heterogeneous Information Learning in Large-Scale Networks.",
            "Enumerating Trillion Subgraphs On Distributed Systems.",
            "Event Analytics via Discriminant Tensor Factorization.",
            "Semi-supervised Learning Meets Factorization: Learning to Recommend with Chain Graph Model."
        ]
    },
    {
        "name": "TKDD",
        "year": "2016",
        "info": "Volume 11: 2016/2017",
        "count": 52,
        "papers": [
            "Shop-Type Recommendation Leveraging the Data from Social Media and Location-Based Services.",
            "Leveraging Neighbor Attributes for Classification in Sparsely Labeled Networks.",
            "Convex Sparse PCA for Unsupervised Feature Learning.",
            "Listwise Learning to Rank from Crowds.",
            "Scalable Clustering by Iterative Partitioning and Point Attractor Representation.",
            "Latent Time-Series Motifs.",
            "Sampling for Nyström Extension-Based Spectral Clustering: Incremental Perspective and Novel Analysis.",
            "Fast Sampling for Time-Varying Determinantal Point Processes.",
            "Greedily Improving Our Own Closeness Centrality in a Network.",
            "The Convergence Behavior of Naive Bayes on Large Sparse Datasets.",
            "Modeling of Geographic Dependencies for Real Estate Ranking.",
            "Distributed Algorithms for Computing Very Large Thresholded Covariance Matrices.",
            "World Knowledge as Indirect Supervision for Document Clustering.",
            "Permanence and Community Structure in Complex Networks.",
            "Partitioning Networks with Node Attributes by Compressing Information Flow.",
            "Scalable and Accurate Online Feature Selection for Big Data.",
            "Structural Analysis of User Choices for Mobile App Recommendation.",
            "Assignment Problems of Different-Sized Inputs in MapReduce.",
            "Unsupervised Head-Modifier Detection in Search Queries.",
            "Lifecycle Modeling for Buzz Temporal Pattern Discovery.",
            "A Novel Bipartite Graph Based Competitiveness Degree Analysis from Query Logs.",
            "Comparing Clustering with Pairwise and Relative Constraints: A Unified Framework.",
            "Mining for Topics to Suggest Knowledge Model Extensions.",
            "Adaptive Cluster Tendency Visualization and Anomaly Detection for Streaming Data.",
            "Exploiting Viral Marketing for Location Promotion in Location-Based Social Networks.",
            "Graph Manipulations for Fast Centrality Computation.",
            "Finding Dynamic Dense Subgraphs.",
            "Modeling Buying Motives for Personalized Product Bundle Recommendation.",
            "Combining Structured Node Content and Topology Information for Networked Graph Clustering.",
            "An Influence Propagation View of PageRank.",
            "Learning Multiple Diagnosis Codes for ICU Patients with Local Disease Correlation Mining.",
            "Scalable and Efficient Flow-Based Community Detection for Large-Scale Graph Analysis.",
            "Robust Graph Regularized Nonnegative Matrix Factorization for Clustering.",
            "Partitioned Similarity Search with Cache-Conscious Data Traversal.",
            "Recommendations Based on Comprehensively Exploiting the Latent Factors Hidden in Items' Ratings and Content.",
            "Spatial Prediction for Multivariate Non-Gaussian Data.",
            "Moving Destination Prediction Using Sparse Dataset: A Mobility Gradient Descent Approach.",
            "A Randomized Rounding Algorithm for Sparse PCA.",
            "Introduction to Special Issue on the Best Papers from KDD 2016.",
            "Ranking Causal Anomalies for System Fault Diagnosis via Temporal and Dynamical Analysis on Vanishing Correlations.",
            "comeNgo: A Dynamic Model for Social Group Evolution.",
            "Cross-Dependency Inference in Multi-Layered Networks: A Collaborative Filtering Perspective.",
            "TRIÈST: Counting Local and Global Triangles in Fully Dynamic Streams with Fixed Memory Size.",
            "Graph-Based Fraud Detection in the Face of Camouflage.",
            "Assessing Human Error Against a Benchmark of Perfection.",
            "Discovering Conditional Matching Rules.",
            "Query-Driven Learning for Predictive Analytics of Data Subspace Cardinality.",
            "Large-Scale Online Feature Selection for Ultra-High Dimensional Sparse Data.",
            "Modeling Temporal Activity to Detect Anomalous Behavior in Social Media.",
            "Rumor Gauge: Predicting the Veracity of Rumors on Twitter.",
            "Mining Community Structures in Multidimensional Networks.",
            "Real-Time Large-Scale Map Matching Using Mobile Phone Data."
        ]
    },
    {
        "name": "TKDD",
        "year": "2015",
        "info": "Volume 10: 2015/2016",
        "count": 49,
        "papers": [
            "Large-Scale Cross-Language Web Page Classification via Dual Knowledge Transfer Using Fast Nonnegative Matrix Trifactorization.",
            "Social Influence Based Clustering and Optimization over Heterogeneous Information Networks.",
            "ParCube: Sparse Parallelizable CANDECOMP-PARAFAC Tensor Decomposition.",
            "Algorithms for Mining the Coevolving Relational Motifs in Dynamic Networks.",
            "Hierarchical Density Estimates for Data Clustering, Visualization, and Outlier Detection.",
            "Utility-Theoretic Ranking for Semiautomated Text Classification.",
            "Discovering Information Propagation Patterns in Microblogging Services.",
            "Smart Multitask Bregman Clustering and Multitask Kernel Clustering.",
            "Measuring Temporal Patterns in Dynamic Social Networks.",
            "Rationality Analytics from Trajectories.",
            "Socializing by Gaming: Revealing Social Relationships in Multiplayer Online Games.",
            "Refining Social Graph Connectivity via Shortcut Edge Addition.",
            "Context-Aware Recommendation Using Role-Based Trust Network.",
            "Occupancy-Based Frequent Pattern Mining*.",
            "ASCOS++: An Asymmetric Similarity Measure for Weighted Networks to Address the Problem of SimRank.",
            "User Identification Across Social Media.",
            "Recommending Users and Communities in Social Media.",
            "GLAD: Group Anomaly Detection in Social Media Analysis.",
            "A Bayesian Perspective on Locality Sensitive Hashing with Extensions for Kernel Methods.",
            "Data-Aware Vaccine Allocation Over Large Networks.",
            "Mining User Development Signals for Online Community Churner Detection.",
            "Put Three and Three Together: Triangle-Driven Community Detection.",
            "Multimodal Data Mining in a Multimedia Database Based on Structured Max Margin Learning.",
            "Do Anesthesiologists Know What They Are Doing? Mining a Surgical Time-Series Database to Correlate Expert Assessment with Outcomes.",
            "Collective Graph Identification.",
            "Mining Influencers Using Information Flows in Social Streams.",
            "Toward Generalizing the Unification with Statistical Outliers: The Gradient Outlier Factor Measure.",
            "DeltaCon: Principled Massive-Graph Similarity Function with Attribution.",
            "Mining Product Adopter Information from Online Reviews for Improving Product Recommendation.",
            "Adaptive Model Rules From High-Speed Data Streams.",
            "Synchronization-Core-Based Discovery of Processes with Decomposable Cyclic Dependencies.",
            "An Efficient Algorithm For Weak Hierarchical Lasso.",
            "Introduction to the Special Issue of Best Papers in ACM SIGKDD 2014.",
            "Product Selection Problem: Improve Market Share by Learning Consumer Behavior.",
            "Catching Synchronized Behaviors in Large Networks: A Graph Mining Approach.",
            "Heterogeneous Translated Hashing: A Scalable Solution Towards Multi-Modal Similarity Search.",
            "Guest Editorial: Special Issue on Connected Health at Big Data Era (BigChat): A TKDD Special Issue.",
            "Kernelized Information-Theoretic Metric Learning for Cancer Diagnosis Using High-Dimensional Molecular Profiling Data.",
            "Jointly Modeling Label and Feature Heterogeneity in Medical Informatics.",
            "Mining Dual Networks: Models, Algorithms, and Applications.",
            "Biomedical Ontology Quality Assurance Using a Big Data Approach.",
            "Less is More: Building Selective Anomaly Ensembles.",
            "Co-Clustering Structural Temporal Data with Applications to Semiconductor Manufacturing.",
            "Inferring Dynamic Diffusion Networks in Online Media.",
            "Unsupervised Rare Pattern Mining: A Survey.",
            "CGC: A Flexible and Robust Approach to Integrating Co-Regularized Multi-Domain Graph for Clustering.",
            "Spatial-Proximity Optimization for Rapid Task Group Deployment.",
            "Featuring, Detecting, and Visualizing Human Sentiment in Chinese Micro-Blog.",
            "Eigen-Optimization on Large Graphs by Edge Manipulation."
        ]
    },
    {
        "name": "TKDD",
        "year": "2014",
        "info": "Volume 9: 2014",
        "count": 35,
        "papers": [
            "An Optimization Framework for Combining Ensembles of Classifiers and Clusterers with Applications to Nontransductive Semisupervised Learning and Transfer Learning.",
            "A Framework for Exploiting Local Information to Enhance Density Estimation of Data Streams.",
            "Bayesian Variable Selection in Linear Regression in One Pass for Large Datasets.",
            "Structured Sparse Boosting for Graph Classification.",
            "GBAGC: A General Bayesian Framework for Attributed Graph Clustering.",
            "Uncovering Hierarchical and Overlapping Communities with a Local-First Approach.",
            "A Generic Multilabel Learning-Based Classification Algorithm Recommendation Method.",
            "Efficiently Estimating Motif Statistics of Large Networks.",
            "A Framework for Hierarchical Ensemble Clustering.",
            "Toward Personalized Context Recognition for Mobile Users: A Semisupervised Bayesian HMM Approach.",
            "Anomaly Detection from Incomplete Data.",
            "User Vulnerability and Its Reduction on a Social Networking Site.",
            "Selecting the Right Correlation Measure for Binary Data.",
            "Physics-Based Anomaly Detection Defined on Manifold Space.",
            "Introduction to the Special Issue ACM SIGKDD 2013.",
            "A Space-Efficient Streaming Algorithm for Estimating Transitivity and Triangle Counts Using the Birthday Paradox.",
            "A Framework of Mining Trajectories from Untrustworthy Data in Cyber-Physical System.",
            "Querying Discriminative and Representative Samples for Batch Mode Active Learning.",
            "Hierarchical Bayesian Inference and Recursive Regularization for Large-Scale Classification.",
            "Modeling Location-Based User Rating Profiles for Personalized Recommendation.",
            "Pairwised Specific Distance Learning from Physical Linkages.",
            "Use of Local Group Information to Identify Communities in Networks.",
            "Unbiased Characterization of Node Pairs over Large Graphs.",
            "On Data Publishing with Clustering Preservation.",
            "Universal and Distinct Properties of Communication Dynamics: How to Generate Realistic Inter-event Times.",
            "Who Influenced You? Predicting Retweet via Social Influence Locality.",
            "Mathematical Modeling and Analysis of Product Rating with Partial Information.",
            "Optimizing Text Quantifiers for Multivariate Loss Functions.",
            "Information Measures in Statistical Privacy and Data Processing Applications.",
            "Density-Aware Clustering Based on Aggregated Heat Kernel and Its Transformation.",
            "Classification with Streaming Features: An Emerging-Pattern Mining Approach.",
            "Supporting Exploratory Hypothesis Testing and Analysis.",
            "Process Discovery under Precedence Constraints.",
            "Improving Top-N Recommendation for Cold-Start Users via Cross-Domain Information.",
            "Chromatic Correlation Clustering."
        ]
    },
    {
        "name": "TKDD",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 23,
        "papers": [
            "Introduction to special issue on computational aspects of social and information networks: Theory, methodologies, and applications (TKDD-CASIN).",
            "Uncovering social network Sybils in the wild.",
            "Scalable and axiomatic ranking of network role similarity.",
            "Discovering social circles in ego networks.",
            "A separability framework for analyzing community structure.",
            "User behavior learning and transfer in composite social networks.",
            "Network Sampling: From Static to Streaming Graphs.",
            "Ranking Metric Anomaly in Invariant Networks.",
            "Discovering General Prominent Streaks in Sequence Data.",
            "Multiresolution Tensor Decompositions with Mode Hierarchies.",
            "Robust Manifold Nonnegative Matrix Factorization.",
            "A Regularization Approach to Learning Task Relationships in Multitask Learning.",
            "On the Sample Complexity of Random Fourier Features for Online Learning: How Many Random Fourier Features Do We Need?",
            "Predicting and Identifying Missing Node Information in Social Networks.",
            "Efficient Discovery of the Most Interesting Associations.",
            "Optimizing Data Misuse Detection.",
            "Probabilistic Reframing for Cost-Sensitive Regression.",
            "MDL4BMF: Minimum Description Length for Boolean Matrix Factorization.",
            "Feature Selection for Social Media Data.",
            "Efficient Discovery of Association Rules and Frequent Itemsets through Sampling with Tight Performance Guarantees.",
            "Discovering Social Circles in Directed Graphs.",
            "Random Projections for Linear Support Vector Machines.",
            "Reconstructing Graphs from Neighborhood Data."
        ]
    },
    {
        "name": "TKDD",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 20,
        "papers": [
            "Nearest Neighbor-Based Classification of Uncertain Data.",
            "Comparative Document Summarization via Discriminative Sentence Selection.",
            "Message-Passing Algorithms for Sparse Network Alignment.",
            "Confidence Weighted Mean Reversion Strategy for Online Portfolio Selection.",
            "Learning to predict reciprocity and triadic closure in social networks.",
            "Efficient online learning for multitask feature selection.",
            "Multilabel relationship learning.",
            "Exploiting fisher and fukunaga-koontz transforms in chernoff dimensionality reduction.",
            "Introduction to the Special Issue ACM SIGKDD 2012.",
            "Addressing Big Data Time Series: Mining Trillions of Time Series Subsequences Under Dynamic Time Warping.",
            "PathSelClus: Integrating Meta-Path Selection with User-Guided Object Clustering in Heterogeneous Information Networks.",
            "Active Sampling for Entity Matching with Guarantees.",
            "Batch Mode Active Sampling Based on Marginal Probability Distribution Matching.",
            "Instance Annotation for Multi-Instance Multi-Label Learning.",
            "Parallel Field Ranking.",
            "iHypR: Prominence ranking in networks of collaborations with hyperedges.",
            "Social trust prediction using heterogeneous networks.",
            "Solving inverse frequent itemset mining with infrequency constraints via large-scale linear programs.",
            "Formal and computational properties of the confidence boost of association rules.",
            "Classification in P2P networks with cascade support vector machines."
        ]
    },
    {
        "name": "TKDD",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 19,
        "papers": [
            "From Context to Distance: Learning Dissimilarity for Categorical Data Clustering.",
            "Efficient Mining of Gap-Constrained Subsequences and Its Various Applications.",
            "Isolation-Based Anomaly Detection.",
            "A Modular Machine Learning System for Flow-Level Traffic Classification in Large Networks.",
            "A Sequential Sampling Framework for Spectral k-Means Based on Efficient Bootstrap Accuracy Estimations: Application to Distributed Clustering.",
            "A Model for Information Growth in Collective Wisdom Processes.",
            "Generative Models for Evolutionary Clustering.",
            "The Latent Maximum Entropy Principle.",
            "Cross-Guided Clustering: Transfer of Relevant Supervision across Tasks.",
            "Learning bayesian networks from Markov random fields: An efficient algorithm for linear models.",
            "ciForager: Incrementally discovering regions of correlated change in evolving graphs.",
            "Comparative document summarization via discriminative sentence selection.",
            "Forecasting in the NBA and other team sports: Network effects in action.",
            "Special issue on best of SIGKDD 2011.",
            "Leakage in data mining: Formulation, detection, and avoidance.",
            "Summarizing data succinctly with the most informative itemsets.",
            "Triangle listing in massive networks.",
            "Multisource domain adaptation and its application to early detection of fatigue.",
            "Substantial improvements in the set-covering projection classifier CHIRP (composite hypercubes on iterated random projections)."
        ]
    },
    {
        "name": "TKDD",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 24,
        "papers": [
            "ACM TKDD Special Issue on Knowledge Discovery for Web Intelligence.",
            "A Combination Approach to Web User Profiling.",
            "Discovering Knowledge-Sharing Communities in Question-Answering Forums.",
            "Modeling Social Annotation: A Bayesian Approach.",
            "Fast Discovery of Group Lag Correlations in Streams.",
            "A Framework for Computing the Privacy Scores of Users in Online Social Networks.",
            "Introduction to Special Issue on Large-Scale Data Mining.",
            "HADI: Mining Radii of Large Graphs.",
            "Robust Record Linkage Blocking Using Suffix Arrays and Bloom Filters.",
            "Temporal Link Prediction Using Matrix and Tensor Factorizations.",
            "Enhancing Clustering Quality through Landmark-Based Dimensionality Reduction.",
            "Clustering Large Attributed Graphs: A Balance between Structural and Attribute Similarities.",
            "Fast Algorithms for Approximating the Singular Value Decomposition.",
            "Integrating Document Clustering and Multidocument Summarization.",
            "Indexing Network Structure with Shortest-Path Trees.",
            "Can the Utility of Anonymized Data be Used for Privacy Breaches?",
            "Community Discovery via Metagraph Factorization.",
            "Guest Editorial for Special Issue KDD'10.",
            "Sequential Modeling of Topic Dynamics with Multiple Timescales.",
            "Discriminative Topic Modeling Based on Manifold Learning.",
            "Inferring Networks of Diffusion and Influence.",
            "Learning Incoherent Sparse and Low-Rank Patterns from Multiple Tasks.",
            "Large Linear Classification When Data Cannot Fit in Memory.",
            "Connecting Two (or Less) Dots: Discovering Structure in News Articles."
        ]
    },
    {
        "name": "TKDD",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 20,
        "papers": [
            "Factor in the neighbors: Scalable and accurate collaborative filtering.",
            "Motif discovery in physiological datasets: A methodology for inferring predictive elements.",
            "Self-sufficient itemsets: An approach to screening potentially interesting associations between items.",
            "Mining multidimensional and multilevel sequential patterns.",
            "VOGUE: A variable order hidden Markov model with duration based on frequent sequence mining.",
            "CSNL: A cost-sensitive non-linear decision tree algorithm.",
            "Analyzing knowledge communities using foreground and background clusters.",
            "A shared-subspace learning framework for multi-label classification.",
            "Data mining for discrimination discovery.",
            "MARGIN: Maximal frequent subgraph mining.",
            "SCOAL: A framework for simultaneous co-clustering and learning from complex data.",
            "BISC: A bitmap itemset support counting approach for efficient frequent itemset mining.",
            "Efficient algorithms for large-scale local triangle counting.",
            "Multilabel dimensionality reduction via dependence maximization.",
            "Learning multiple nonredundant clusterings.",
            "TKDD Special Issue SIGKDD 2009.",
            "Behavioral Targeting: The Art of Scaling Up Simple Algorithms.",
            "Centralized and Distributed Anonymization for High-Dimensional Healthcare Data.",
            "Bayesian Browsing Model: Exact Inference of Document Relevance from Petabyte-Scale Data.",
            "A Model-Agnostic Framework for Fast Spatial Anomaly Detection."
        ]
    },
    {
        "name": "TKDD",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 21,
        "papers": [
            "Clustering high-dimensional data: A survey on subspace clustering, pattern-based clustering, and correlation clustering.",
            "Semi-analytical method for analyzing models and model selection measures based on moment analysis.",
            "Closed patterns meet n-ary relations.",
            "DOLPHIN: An efficient algorithm for mining distance-based outliers in very large datasets.",
            "Bellwether analysis: Searching for cost-effective query-defined predictors in large databases.",
            "Introduction to special issue on social computing, behavioral modeling, and prediction.",
            "Expanding network communities from representative examples.",
            "Analyzing communities and their evolutions in dynamic social networks.",
            "Blocking links to minimize contamination spread in a social network.",
            "Modeling information-seeker satisfaction in community question answering.",
            "Author name disambiguation in MEDLINE.",
            "Stream data clustering based on grid density and attraction.",
            "Link spam target detection using page farms.",
            "Density-based clustering of data streams at multiple resolutions.",
            "ACM TKDD special issue ACM SIGKDD 2007 and ACM SIGKDD 2008.",
            "An event-based framework for characterizing the evolutionary behavior of interaction graphs.",
            "On evolutionary spectral clustering.",
            "Fast likelihood search for hidden Markov models.",
            "Efficient algorithms for genome-wide association study.",
            "Reflect and correct: A misclassification prediction approach to active inference.",
            "Constructing comprehensive summaries of large event sequences."
        ]
    },
    {
        "name": "TKDD",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 18,
        "papers": [
            "Introduction to special issue on bioinformatics.",
            "Compositional mining of multirelational biological datasets.",
            "Discovering semantic biomedical relations utilizing the Web.",
            "Developmental stage annotation of Drosophila gene expression pattern images via an entire solution path for LDA.",
            "Adaptive discriminant analysis for microarray-based classification.",
            "A new efficient probabilistic model for mining labeled ordered trees applied to glycobiology.",
            "Joint cluster analysis of attribute data and relationship data: The connected k-center problem, algorithms and applications.",
            "Bregman bubble clustering: A robust framework for mining dense clusters.",
            "Tree model guided candidate generation for mining frequent subtrees from XML documents.",
            "Semantic text similarity using corpus-based word similarity and string similarity.",
            "Incremental tensor analysis: Theory and applications.",
            "Privacy-preserving classification of vertically partitioned data via random kernels.",
            "On disclosure risk analysis of anonymized itemsets in the presence of prior knowledge.",
            "Privacy-preserving decision trees over vertically partitioned data.",
            "Feature-preserved sampling over streaming data.",
            "Mining frequent cross-graph quasi-cliques.",
            "Weighted cluster ensembles: Methods and analysis.",
            "On domination game analysis for microeconomic data mining."
        ]
    },
    {
        "name": "TKDD",
        "year": "2007",
        "info": "Volume 1: 2007/2008",
        "count": 18,
        "papers": [
            "Introduction.",
            "Graph evolution: Densification and shrinking diameters.",
            "L-diversity: Privacy beyond k-anonymity.",
            "Clustering aggregation.",
            "Collective entity resolution in relational data.",
            "Extrapolation errors in linear model trees.",
            "Mining periodic patterns with gap requirement from sequences.",
            "Twain: Two-end association miner with precise frequent exhibition periods.",
            "Introduction to special issue ACM SIGKDD 2006.",
            "RIC: Parameter-free noise-robust clustering.",
            "Semantic annotation of frequent patterns.",
            "Measuring and extracting proximity graphs in networks.",
            "Learning to detect events with Markov-modulated poisson processes.",
            "Assessing data mining results via swap randomization.",
            "Topic taxonomy adaptation for group profiling.",
            "Finding hierarchical heavy hitters in streaming data.",
            "Learning correlations using the mixture-of-subsets model.",
            "A clustering framework based on subjective and objective validity criteria."
        ]
    }
]