[
	{
		"year": "2021",
		"name": "STAF 2021",
		"info": "virtual",
		"venues": [
			{
				"sub_name_abbr": "conf/tap/2021",
				"sub_name": "Tests and Proofs - 15th International Conference, TAP 2021, Held as Part of STAF 2021, Virtual Event, June 21-22, 2021, Proceedings.",
				"count": 6,
				"papers": [
					"Use Case Testing: A Constrained Active Machine Learning Approach.",
					"Architecture-Guided Test Resource Allocation via Logic.",
					"A Benchmarks Library for Extended Parametric Timed Automata.",
					"Generating Timed UI Tests from Counterexamples.",
					"Using a Guided Fuzzer and Preconditions to Achieve Branch Coverage with Valid Inputs.",
					"FuSeBMC: An Energy-Efficient Test Generator for Finding Security Vulnerabilities in C Programs."
				]
			},
			{
				"sub_name_abbr": "conf/gg/2021",
				"sub_name": "Graph Transformation - 14th International Conference, ICGT 2021, Held as Part of STAF 2021, Virtual Event, June 24-25, 2021, Proceedings.",
				"count": 16,
				"papers": [
					"Concurrency Theorems for Non-linear Rewriting Theories.",
					"A Generalized Concurrent Rule Construction for Double-Pushout Rewriting.",
					"Transformations of Reaction Systems Over Categories by Means of Epi-Mono Factorization and Functors.",
					"Graph Rewriting and Relabeling with PBPO+.",
					"Incorrectness Logic for Graph Programs.",
					"Powerful and NP-Complete: Hypergraph Lambek Grammars.",
					"Evaluation Diversity for Graph Conditions.",
					"Host-Graph-Sensitive RETE Nets for Incremental Graph Pattern Matching.",
					"Rule-Based Top-Down Parsing for Acyclic Contextual Hyperedge Replacement Grammars.",
					"Nets with Mana: A Framework for Chemical Reaction Modelling.",
					"A Case Study on the Graph-Transformational Modeling and Analysis of Puzzles.",
					"Interval Probabilistic Timed Graph Transformation Systems.",
					"Verifying Graph Programs with Monadic Second-Order Logic.",
					"On the Complexity of Simulating Probabilistic Timed Graph Transformation Systems.",
					"Automated Checking and Completion of Backward Confluence for Hyperedge Replacement Grammars.",
					"GrapePress - A Computational Notebook for Graph Transformations."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-2112-10217",
				"sub_name": "Proceedings Twelfth International Workshop on Graph Computational Models, GCM@STAF 2021, Online, 22nd June 2021.",
				"count": 6,
				"papers": [
					"Grammars Based on a Logic of Hypergraph Languages.",
					"From Linear Term Rewriting to Graph Rewriting with Preservation of Termination.",
					"Stochastic Graph Transformation For Social Network Modeling.",
					"A Categorical Semantics for Hierarchical Petri Nets.",
					"Resilience of Well-structured Graph Transformation Systems.",
					"A Small-Step Operational Semantics for GP 2."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2021w",
				"sub_name": "STAF 2021 Workshop Proceedings: 9th International Workshop on Bidirectional Transformations, Joint Workshop on Foundations and Practice of Visual Modeling and Data for Model-Driven Engineering, International workshop on MDE for Smart IoT Systems, 4th International Workshop on (Meta)Modeling for Healthcare Systems, and 20th International Workshop on OCL and Textual Modeling co-located with Software Technologies: Applications and Foundations, Federation of Conferences (STAF 2021), Virtual Event / Bergen, Norway, June 21-25, 2021.",
				"count": 19,
				"papers": [
					"C-Lenses Explained: Bx Foundations for the Rest of Us.",
					"Delta Lenses as Coalgebras for a Comonad.",
					"Toward Recursive View Update Strategies on Relations.",
					"Classifying and Avoiding Compatibility Issues in Networks of Bidirectional Transformations.",
					"eMoflon: : Neo - Consistency and Model Management with Graph Databases.",
					"Find-Replace as a Service of Graph-Based DSL Tool Development Framework.",
					"Automated Annotations in Domain-Specific Models: Analysis of 23 Cases.",
					"An Operation-based Versioning Approach for Synchronous and Asynchronous Collaboration in Graphical Modeling Tools.",
					"Towards a Modeling and Analysis Environment for Industrial IoT systems.",
					"Morpheus: A Degradation Framework for Resilient IoT Systems.",
					"A Prototyping Process for Medical Devices and Systems.",
					"A Validity Analysis to Reify 2-valued Boolean Constraints.",
					"Mutation Operators for Object Constraint Language Specification.",
					"Implementing OCL in Swift.",
					"Refactoring Collections in OCL.",
					"A DSL for Encoding Models for Graph-Learning Processes.",
					"Adding Regular Expression Operators to OCL.",
					"Testing Code Generators: a Case Study on Applying USE, EFinder and Tracts in Practice.",
					"A SWOT Analysis of the Object Constraint Language."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "STAF 2020",
		"info": "Bergen, Norway",
		"venues": [
			{
				"sub_name_abbr": "conf/tap/2020",
				"sub_name": "Tests and Proofs - 14th International Conference, TAP@STAF 2020, Bergen, Norway, June 22-23, 2020, Proceedings [postponed].",
				"count": 10,
				"papers": [
					"Benchmarking Combinations of Learning and Testing Algorithms for Active Automata Learning.",
					"Mutation Testing of Smart Contracts at Scale.",
					"Deductive Binary Code Verification Against Source-Code-Level Specifications.",
					"Spatio-Temporal Model-Checking of Cyber-Physical Systems Using Graph Queries.",
					"SAT Modulo Differential Equation Simulations.",
					"Verified Runtime Assertion Checking for Memory Properties.",
					"Testing for Race Conditions in Distributed Systems via SMT Solving.",
					"sasa: A SimulAtor of Self-stabilizing Algorithms.",
					"A Graphical Toolkit for the Validation of Requirements for Detect and Avoid Systems.",
					"ScAmPER: Generating Test Suites to Maximise Code Coverage in Interactive Fiction Games."
				]
			},
			{
				"sub_name_abbr": "conf/gg/2020",
				"sub_name": "Graph Transformation - 13th International Conference, ICGT 2020, Held as Part of STAF 2020, Bergen, Norway, June 25-26, 2020, Proceedings.",
				"count": 20,
				"papers": [
					"Conditional Bigraphs.",
					"Confluence up to Garbage.",
					"Computing Embeddings of Directed Bigraphs.",
					"A Categorical Semantics for Guarded Petri Nets.",
					"Unfolding Symbolic Attributed Graph Grammars.",
					"Single Pushout Rewriting in Comprehensive Systems.",
					"Initial Conflicts for Transformation Rules with Nested Application Conditions.",
					"Patch Graph Rewriting.",
					"Hypergraph Basic Categorial Grammars.",
					"Multilevel Typed Graph Transformations.",
					"Rewriting Theory for the Life Sciences: A Unifying Theory of CTMC Semantics.",
					"Algebras for Tree Decomposable Graphs.",
					"Graph Parsing as Graph Transformation - Correctness of Predictive Top-Down Parsers.",
					"Graph Consistency as a Graduated Property - Consistency-Sustaining and -Improving Graph Transformations.",
					"Formal Verification of Invariants for Attributed Graph Transformation Systems Based on Nested Attributed Graph Conditions.",
					"Optimistic and Pessimistic On-the-fly Analysis for Metric Temporal Graph Logic.",
					"A Flexible and Easy-to-Use Library for the Rapid Development of Graph Tools in Java.",
					"Multiscale Graph Grammars Can Generate Cayley Graphs of Groups and Monoids.",
					"The Glasgow Subgraph Solver: Using Constraint Programming to Tackle Hard Subgraph Isomorphism Problem Variants.",
					"A Simulator for Probabilistic Timed Graph Transformation Systems with Complex Large-Scale Topologies."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-2012-01181",
				"sub_name": "Proceedings of the Eleventh International Workshop on Graph Computation Models, GCM@STAF 2020, Online-Workshop, 24th June 2020.",
				"count": 11,
				"papers": [
					"VICToRy: Visual Interactive Consistency Management in Tolerant Rule-based Systems.",
					"Graph Repair and its Application to Meta-Modeling.",
					"Modeling Adverse Conditions in the Framework of Graph Transformation Systems.",
					"An Algebraic Graph Transformation Approach for RDF and SPARQL.",
					"Graph Surfing in Reaction Systems from a Categorial Perspective.",
					"Encoding Incremental NACs in Safe Graph Grammars using Complementation.",
					"Weak Greibach Normal Form for Hyperedge Replacement Grammars.",
					"Commutators for Stochastic Rewriting Systems: Theory and Implementation in Z3.",
					"Reversibility and Composition of Rewriting in Hierarchies.",
					"A Fast Graph Program for Computing Minimum Spanning Trees.",
					"Verifying Graph Programs with First-Order Logic."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2020w",
				"sub_name": "STAF 2020 Workshop Proceedings: 4th Workshop on Model-Driven Engineering for the Internet-of-Things, 1st International Workshop on Modeling Smart Cities, and 5th International Workshop on Open and Original Problems in Software Language Engineering co-located with Software Technologies: Applications and Foundations federation of conferences (STAF 2020), Bergen, Norway, June 22-26, 2020.",
				"count": 10,
				"papers": [
					"Modeling for Making Smart City KPIs a User-friendly Tool for Smart City Design.",
					"Supporting Smart Cities Modeling with Graphical and Textual Editors.",
					"Accelerating Application Development in the Internet of Things using Model-driven Development.",
					"Experiences with an Internal DSL in the IoT Domain.",
					"Analyzing WSN-based IoT Systems using MDE Techniques and Petri-net Models.",
					"OOPSLE 2020: Open and Original Problems in Software Language Engineering.",
					"n + 1 Challenges for Software Language Engineering.",
					"Solved and Open Problems in Type Error Diagnosis.",
					"A New Life for Legacy Language Definition Approaches?",
					"Reflections on the Lack of Adoption of Domain Specific Languages."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "STAF 2019",
		"info": "Eindhoven, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/gg/2019",
				"sub_name": "Graph Transformation - 12th International Conference, ICGT 2019, Held as Part of STAF 2019, Eindhoven, The Netherlands, July 15-16, 2019, Proceedings.",
				"count": 13,
				"papers": [
					"Introducing Symmetry to Graph Rewriting Systems with Process Abstraction.",
					"Double-Pushout Rewriting in Context - Rule Composition and Parallel Independence.",
					"Adhesive Subcategories of Functor Categories with Instantiation to Partial Triple Graphs.",
					"Extending Predictive Shift-Reduce Parsing to Contextual Hyperedge Replacement Grammars.",
					"Exploring Conflict Reasons for Graph Transformation Systems.",
					"Unfolding Graph Grammars with Negative Application Conditions.",
					"Two-Level Reasoning About Graph Transformation Programs.",
					"Incremental (Unidirectional) Model Transformation with eMoflon: : IBeX.",
					"Knowledge Representation and Update in Hierarchies of Graphs.",
					"Relating DNA Computing and Splitting/Fusion Grammars.",
					"Constructing Optimized Validity-Preserving Application Conditions for Graph Transformation Rules.",
					"From Pattern Invocation Networks to Rule Preconditions.",
					"Hybrid Search Plan Generation for Generalized Graph Pattern Matching."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1912-08966",
				"sub_name": "Proceedings Tenth International Workshop on Graph Computation Models, GCM@STAF 2019, Eindhoven, The Netherlands, 17th July 2019.",
				"count": 5,
				"papers": [
					"Analysis of Graph Transformation Systems: Native vs Translation-based Techniques.",
					"Sesqui-Pushout Rewriting: Concurrency, Associativity and Rule Algebra Framework.",
					"Transformation of Turing Machines into Context-Dependent Fusion Grammars.",
					"Speeding up Generalized PSR Parsers by Memoization Techniques.",
					"Rule-based Graph Repair."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2019ce",
				"sub_name": "STAF 2019 Co-Located Events Joint Proceedings: 1st Junior Researcher Community Event, 2nd International Workshop on Model-Driven Engineering for Design-Runtime Interaction in Complex Systems, and 1st Research Project Showcase Workshop co-located with Software Technologies: Applications and Foundations (STAF 2019), Eindhoven, The Netherlands, July 15 - 19, 2019.",
				"count": 16,
				"papers": [
					"Aut tace, Aut Loquere meliora Silentio (and the Likes).",
					"Extracting Correspondences from Metamodels Using Metamodel Matching.",
					"Model-Driven Technologies for Data Mining Democratisation.",
					"A-CPS: Automation in High-performance Cyber Physical Systems Development.",
					"From Design-Time to Runtime and Back Again with Liquid Models.",
					"A Microservice Reference Case Study for Design-Runtime Interaction in MDE.",
					"MDE based IoT Service to enhance the safety of controllers at runtime.",
					"Developing User and Recording Interfaces for Design Time and Runtime Models.",
					"Efficient Software Controller Variant Development and Validation (ECoVaDeVa) Overview of a Flemish ICON Project.",
					"Towards Formalization of Assembly Knowledge for Product and Assembly Trade-Off Analysis.",
					"A-CPS: Automation in High-performance Cyber Physical Systems Development.",
					"Integrating and deploying heterogeneous components by means of a microservices architecture in the CROSSMINER project.",
					"Lowcomote: Training the Next Generation of Experts in Scalable Low-Code Engineering Platforms.",
					"Enterprise Architecture modelling with ArchiMate.",
					"The CPSwarm Technology for Designing Swarms of Cyber-Physical Systems.",
					"Swarm Intelligence Layer to Control Autonomous Agents (SWILT)."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "STAF 2018",
		"info": "Toulouse, France",
		"venues": [
			{
				"sub_name_abbr": "conf/sefm/2018",
				"sub_name": "Software Engineering and Formal Methods - 16th International Conference, SEFM 2018, Held as Part of STAF 2018, Toulouse, France, June 27-29, 2018, Proceedings.",
				"count": 18,
				"papers": [
					"We Need a Testability Transformation Semantics.",
					"From Software Specifications to Constraint Programming.",
					"Automated Specification Extraction and Analysis with Specstractor.",
					"Bridging the Gap Between Informal Requirements and Formal Specifications Using Model Federation.",
					"Program Verification for Exception Handling on Active Objects Using Futures.",
					"Spread the Work: Multi-threaded Safety Analysis for Hybrid Systems.",
					"FastLane Is Opaque - a Case Study in Mechanized Proofs of Opacity.",
					"Monte Carlo Tree Search for Finding Costly Paths in Programs.",
					"A Cloud-Based Execution Framework for Program Analysis.",
					"Cross-Architecture Lifter Synthesis.",
					"Counterexample Simplification for Liveness Property Violation.",
					"Online Enumeration of All Minimal Inductive Validity Cores.",
					"Prevent : A Predictive Run-Time Verification Framework Using Statistical Learning.",
					"Formal Verification of Platoon Control Strategies.",
					"Exploring Properties of a Telecommunication Protocol with Message Delay Using Interactive Theorem Prover.",
					"Automated Validation of IoT Device Control Programs Through Domain-Specific Model Generation.",
					"Graph-Based Shape Analysis Beyond Context-Freeness.",
					"Facilitating Component Reusability in Embedded Systems with GPUs."
				]
			},
			{
				"sub_name_abbr": "conf/gg/2018",
				"sub_name": "Graph Transformation - 11th International Conference, ICGT 2018, Held as Part of STAF 2018, Toulouse, France, June 25-26, 2018, Proceedings.",
				"count": 11,
				"papers": [
					"Splicing/Fusion Grammars and Their Relation to Hypergraph Grammars.",
					"Synchronous Hyperedge Replacement Graph Grammars.",
					"CoReS: A Tool for Computing Core Graphs via SAT/SMT Solvers.",
					"Graph Surfing by Reaction Systems.",
					"Probabilistic Graph Programs for Randomised and Evolutionary Algorithms.",
					"Graph-Rewriting Petri Nets.",
					"On the Essence and Initiality of Conflicts.",
					"Characterisation of Parallel Independence in AGREE-Rewriting.",
					"Equivalence and Independence in Controlled Graph-Rewriting Processes.",
					"Verifying Graph Transformation Systems with Description Logics.",
					"OCL2AC: Automatic Translation of OCL Constraints to Graph Constraints and Application Conditions for Transformation Rules."
				]
			},
			{
				"sub_name_abbr": "conf/icmt/2018",
				"sub_name": "Theory and Practice of Model Transformation - 11th International Conference, ICMT@STAF 2018, Toulouse, France, June 25-26, 2018, Proceedings.",
				"count": 10,
				"papers": [
					"The Design, Evolution, and Use of KernelF - An Extensible and Embeddable Functional Language.",
					"Virtual Network Embedding: Reducing the Search Space by Model Transformation Techniques.",
					"Schema Transformations and Query Rewriting in Ontological Databases with a Faceted Interface.",
					"Model Transformation Reuse Across Metamodels - A Classification and Comparison of Approaches.",
					"Systematic Recovery of MDE Technology Usage.",
					"Technical Debt in Model Transformation Specifications.",
					"CoqTL: An Internal DSL for Model Transformation in Coq.",
					"A Formal Framework for Prototyping Executable Semantics in ATL.",
					"Scalable Queries and Model Transformations with the Mogwaï Tool.",
					"NMF: A Multi-platform Modeling Framework."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2018",
				"sub_name": "Tests and Proofs - 12th International Conference, TAP@STAF 2018, Toulouse, France, June 27-29, 2018, Proceedings.",
				"count": 11,
				"papers": [
					"Tests from Witnesses - Execution-Based Validation of Verification Results.",
					"An Approximation-Based Approach for the Random Exploration of Large Models.",
					"Static and Dynamic Verification of Relational Properties on Self-composed C Code.",
					"Under-Approximation Generation Driven by Relevance Predicates and Variants.",
					"Using Dependence Graphs to Assist Verification and Testing of Information-Flow Properties.",
					"Tactic Program-Based Testing and Bounded Verification in Isabelle/HOL.",
					"Verification Coverage for Combining Test and Proof.",
					"Detection of Security Vulnerabilities in C Code Using Runtime Verification: An Experience Report.",
					"Formalizing (Web) Standards - An Application of Test and Proof.",
					"Automated Test Case Generation for Java EE Based Web Applications.",
					"Ghosts for Lists: From Axiomatic to Executable Specifications."
				]
			},
			{
				"sub_name_abbr": "conf/ecmdafa/2018",
				"sub_name": "Modelling Foundations and Applications - 14th European Conference, ECMFA@STAF 2018, Toulouse, France, June 26-28, 2018, Proceedings.",
				"count": 19,
				"papers": [
					"Is Bidirectionality Important?",
					"Towards Automatic Generation of UML Profile Graphical Editors for Papyrus.",
					"Optimising OCL Synthesized Code.",
					"Expressing Measurement Uncertainty in OCL/UML Datatypes.",
					"On the Influence of Metamodel Design to Analyses and Transformations.",
					"Automatic Transformation Co-evolution Using Traceability Models and Graph Transformation.",
					"Bidirectional Method Patterns for Language Editor Migration.",
					"Parallel Model Validation with Epsilon.",
					"SysML Models Verification and Validation in an Industrial Context: Challenges and Experimentation.",
					"Property-Aware Unit Testing of UML-RT Models in the Context of MDE.",
					"MAPLE: An Integrated Environment for Process Modelling and Enactment for NFV Systems.",
					"Detecting Conflicts Between Data-Minimization and Security Requirements in Business Process Models.",
					"Life Sciences-Inspired Test Case Similarity Measures for Search-Based, FSM-Based Software Testing.",
					"EMF Patterns of Usage on GitHub.",
					"Towards Efficient Loading of Change-Based Models.",
					"Towards a Framework for Writing Executable Natural Language Rules.",
					"Model-Driven Re-engineering of a Pressure Sensing System: An Experience Report.",
					"Modeling AUTOSAR Implementations in Simulink.",
					"Trace Comprehension Operators for Executable DSLs."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2018w",
				"sub_name": "Software Technologies: Applications and Foundations - STAF 2018 Collocated Workshops, Toulouse, France, June 25-29, 2018, Revised Selected Papers.",
				"count": 49,
				"papers": [
					"Towards the Verification of Hybrid Co-simulation Algorithms.",
					"A Flexible Framework for FMI-Based Co-Simulation of Human-Centred Cyber-Physical Systems.",
					"Towards Stochastic FMI Co-Simulations: Implementation of an FMU for a Stochastic Activity Networks Simulator.",
					"Demo: Stabilization Technique in INTO-CPS.",
					"Demo: Co-simulation of UAVs with INTO-CPS and PVSio-web.",
					"Towards a Co-simulation Based Model Assessment Process for System Architecture.",
					"Co-simulation of Physical Model and Self-Adaptive Predictive Controller Using Hybrid Automata.",
					"Formalizing a Notion of Concentration Robustness for Biochemical Networks.",
					"Explaining Successful Docker Images Using Pattern Mining Analysis.",
					"Analyzing Privacy Risk in Human Mobility Data.",
					"Generating Synthetic Data for Real World Detection of DoS Attacks in the IoT.",
					"Annotated BPMN Models for Optimised Healthcare Resource Planning.",
					"Using Formal Methods to Validate Research Hypotheses: The Duolingo Case Study.",
					"Personality Gaze Patterns Unveiled via Automatic Relevance Determination.",
					"FormalMiner: A Formal Framework for Refinement Mining.",
					"Exploring Applications of Formal Methods in the INSPEX Project.",
					"Towards a Cognitive Architecture for the Formal Analysis of Human Behaviour and Learning.",
					"Towards Handling Latency in Interactive Software.",
					"Refinement Based Formal Development of Human-Machine Interface.",
					"Using Abstraction with Interaction Sequences for Interactive System Modelling.",
					"Formal Modelling as a Component of User Centred Design.",
					"Coordination of Complex Socio-Technical Systems: Challenges and Opportunities.",
					"Reo Coordination Model for Simulation of Quantum Internet Software.",
					"Computing the Parallelism Degree of Timed BPMN Processes.",
					"ReoLive: Analysing Connectors in Your Browser.",
					"Multi-agent Systems with Virtual Stigmergy.",
					"Towards a Hybrid Verification Approach.",
					"Using Reinforcement Learning to Handle the Runtime Uncertainties in Self-adaptive Software.",
					"Model Based Development of Data Integration in Graph Databases Using Triple Graph Grammars.",
					"Short-Cut Rules - Sequential Composition of Rules Avoiding Unnecessary Deletions.",
					"Graph Repair by Graph Programs.",
					"Double-Pushout Rewriting in Context.",
					"From Hyperedge Replacement Grammars to Decidable Hyperedge Replacement Games.",
					"Verifying a Copying Garbage Collector in GP 2.",
					"From Modeling to Test Case Generation in the Industrial Embedded System Domain.",
					"Automated Consistency Preservation in Electronics Development of Cyber-Physical Systems.",
					"A System Modeling Approach to Enhance Functional and Software Development.",
					"Embedded UML Model Execution to Bridge the Gap Between Design and Runtime.",
					"Sketching a Model-Based Technique for Integrated Design and Run Time Description - Short Paper - Tool Demonstration.",
					"Model-Driven Engineering for Design-Runtime Interaction in Complex Systems: Scientific Challenges and Roadmap - Report on the MDE@DeRun 2018 Workshop.",
					"Design and Implementation of a Remote Care Application Based on Microservice Architecture.",
					"Ambient Intelligence Users in the Loop: Towards a Model-Driven Approach.",
					"Integrity Protection Against Insiders in Microservice-Based Infrastructures: From Threats to a Security Framework.",
					"The Aspect of Resilience in Microservices-Based Software Design.",
					"On Collaborative Model-Driven Development of Microservices.",
					"A UML Profile for Privacy Enforcement.",
					"Specification of Information Flow Security Policies in Model-Based Systems Engineering.",
					"Towards Scenario-Based Security Requirements Engineering for Cyber-Physical Systems.",
					"Towards Model-Based Communication Control for the Internet of Things."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "STAF 2017",
		"info": "Marburg, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/gg/2017",
				"sub_name": "Graph Transformation - 10th International Conference, ICGT 2017, Held as Part of STAF 2017, Marburg, Germany, July 18-19, 2017, Proceedings.",
				"count": 14,
				"papers": [
					"The Pullback-Pushout Approach to Algebraic Graph Transformation.",
					"Hierarchical Graph Transformation Revisited - Transformations of Coalgebraic Graphs.",
					"Geometric Modeling: Consistency Preservation Using Two-Layered Variable Substitutions.",
					"Chemical Graph Transformation with Stereo-Information.",
					"Specifying Graph Languages with Type Graphs.",
					"Fusion Grammars: A Novel Approach to the Generation of Graph Languages.",
					"Predictive Shift-Reduce Parsing for Hyperedge Replacement Grammars.",
					"Granularity of Conflicts and Dependencies in Graph Transformation Systems.",
					"k-Inductive Invariant Checking for Graph Transformation Systems.",
					"Probabilistic Timed Graph Transformation Systems.",
					"Leveraging Incremental Pattern Matching Techniques for Model Synchronisation.",
					"Henshin: A Usability-Focused Framework for EMF Model Transformation Development.",
					"GRAPE - A Graph Rewriting and Persistence Engine.",
					"Table Graphs."
				]
			},
			{
				"sub_name_abbr": "conf/icmt/2017",
				"sub_name": "Theory and Practice of Model Transformation - 10th International Conference, ICMT@STAF 2017, Marburg, Germany, July 17-18, 2017, Proceedings.",
				"count": 12,
				"papers": [
					"Experimentation with a Big-Step Semantics for ATL Model Transformations.",
					"Reducing the Verbosity of Imperative Model Refinements by Using General-Purpose Language Facilities.",
					"Decision Points for Non-determinism in Concurrent Model Synchronization with Triple Graph Grammars.",
					"The Micromapping Model of Computation; The Foundation for Optimized Execution of Eclipse QVTc/QVTr/UMLX.",
					"Testing Transformation Models Using Classifying Terms.",
					"Differencing of Model Transformation Rules: Towards Versioning Support in the Development and Maintenance of Model Transformations.",
					"Automatic Inference of Rule-Based Specifications of Complex In-place Model Transformations.",
					"A Survey of Model Transformation Design Pattern Usage.",
					"Generating Efficient Mutation Operators for Search-Based Model-Driven Engineering.",
					"Graph Constraint Evaluation over Partial Models by Constraint Rewriting.",
					"BXE2E: A Bidirectional Transformation Approach for Medical Record Exchange.",
					"Rule-Based Repair of EMF Models: An Automated Interactive Approach."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2017",
				"sub_name": "Tests and Proofs - 11th International Conference, TAP@STAF 2017, Marburg, Germany, July 19-20, 2017, Proceedings.",
				"count": 10,
				"papers": [
					"Abstraction Refinement for the Analysis of Software Product Lines.",
					"Hybrid Information Flow Analysis for Real-World C Code.",
					"Symbolic Execution of Transition Systems with Function Summaries.",
					"Unit Testing of Database-Driven Java Enterprise Edition Applications.",
					"Model-Based Testing of Probabilistic Systems with Stochastic Time.",
					"Test Suite Reduction in Idempotence Testing of Infrastructure as Code.",
					"Checking UML and OCL Model Behavior with Filmstripping and Classifying Terms.",
					"Skolem Function Continuation for Quantified Boolean Formulas.",
					"WSCLim: A Tool for Model-Based Testing of WS-BPEL Compositions Under Load Conditions.",
					"Testing a Saturation-Based Theorem Prover: Experiences and Challenges."
				]
			},
			{
				"sub_name_abbr": "conf/ecmdafa/2017",
				"sub_name": "Modelling Foundations and Applications - 13th European Conference, ECMFA@STAF 2017, Marburg, Germany, July 19-20, 2017, Proceedings.",
				"count": 18,
				"papers": [
					"On the Automated Derivation of Domain-Specific UML Profiles.",
					"Towards Seamless Hybrid Graphical-Textual Modelling for UML and Profiles.",
					"Modeling Architectures of Cyber-Physical Systems.",
					"Systematic Language Extension Mechanisms for the MontiArc Architecture Description Language.",
					"A Feature-Based Approach for Variability Exploration and Resolution in Model Transformation Migration.",
					"On the Influence of Models at Run-Time Traces in Dynamic Feature Location.",
					"cMoflon: Model-Driven Generation of Embedded C Code for Wireless Sensor Networks.",
					"Self-adaptive UIs: Integrated Model-Driven Development of UIs and Their Adaptations.",
					"Iterative Model-Driven Development of Software Extensions for Web Content Management Systems.",
					"Efficient Consistency Checking of Interrelated Models.",
					"Finding Achievable Features and Constraint Conflicts for Inconsistent Metamodels.",
					"Model Consistency for Distributed Collaborative Modeling.",
					"Model-Based Privacy Analysis in Industrial Ecosystems.",
					"Formulating Model Verification Tasks Prover-Independently as UML Diagrams.",
					"Modeling and Formal Analysis of Probabilistic Complex Event Processing (CEP) Applications.",
					"Example-Driven Web API Specification Discovery.",
					"Technology-Preserving Transition from Single-Core to Multi-core in Modelling Vehicular Systems.",
					"On the Opportunities of Scalable Modeling Technologies: An Experience Report on Wind Turbines Control Applications Development."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2017w",
				"sub_name": "Software Technologies: Applications and Foundations - STAF 2017 Collocated Workshops, Marburg, Germany, July 17-21, 2017, Revised Selected Papers.",
				"count": 37,
				"papers": [
					"Injecting Execution Traces into a Model-Driven Framework for Program Analysis.",
					"Introduction of an OpenCL-Based Model Transformation Engine.",
					"Collaborative Modelling with Version Control.",
					"A Java Bytecode Metamodel for Composable Program Analyses.",
					"Graph Rewriting Based Search for Molecular Structures: Definitions, Algorithms, Hardness.",
					"Towards Automatic Generation of Evolution Rules for Model-Driven Optimisation.",
					"Generating Efficient Predictive Shift-Reduce Parsers for Hyperedge Replacement Grammars.",
					"Checking Graph Programs for Confluence.",
					"Loose Graph Simulations.",
					"Models, More Models, and Then a Lot More.",
					"On the Need for Temporal Model Repositories.",
					"On the Need for Artifact Models in Model-Driven Systems Engineering Projects.",
					"Cognifying Model-Driven Software Engineering.",
					"Non-human Modelers: Challenges and Roadmap for Reusable Self-explanation.",
					"Some Narrow and Broad Challenges in MDD.",
					"Modelling by the People, for the People.",
					"From Building Systems Right to Building Right Systems - A Generic Architecture and Its Model Based Realization.",
					"The Tool Generation Challenge for Executable Domain-Specific Modeling Languages.",
					"Toward Product Lines of Mathematical Models for Software Model Management.",
					"Model-Driven Interaction Design for Social Robots.",
					"Towards Integration of Context-Based and Scenario-Based Development.",
					"(An Example for) Formally Modeling Robot Behavior with UML and OCL.",
					"Synthesizing Executable PLC Code for Robots from Scenario-Based GR(1) Specifications.",
					"Evaluating a Graph Query Language for Human-Robot Interaction Data in Smart Environments.",
					"A Simulation Framework to Analyze Knowledge Exchange Strategies in Distributed Self-adaptive Systems.",
					"Workshop in OCL and Textual Modelling - Report on Recent Trends and Panel Discussions.",
					"Improving Incremental and Bidirectional Evaluation with an Explicit Propagation Graph.",
					"Translating UML-RSDS OCL to ANSI C.",
					"Mapping USE Specifications into Spec#.",
					"Deterministic Lazy Mutable OCL Collections.",
					"Step 0: An Idea for Automatic OCL Benchmark Generation.",
					"SICOMORo-CM: Development of Trustworthy Systems via Models and Advanced Tools.",
					"Developer-Centric Knowledge Mining from Large Open-Source Software Repositories (CROSSMINER).",
					"Technical Obsolescence Management Strategies for Safety-Related Software for Airborne Systems.",
					"Mobile Health ID Card - Demonstrating the Realization of an mHealth Application in Austria.",
					"SECT-AIR: Software Engineering Costs and Timescales - Aerospace Initiative for Reduction.",
					"DEIS: Dependability Engineering Innovation for Cyber-Physical Systems."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "STAF 2016",
		"info": "Vienna, Austia",
		"venues": [
			{
				"sub_name_abbr": "conf/gg/2016",
				"sub_name": "Graph Transformation - 9th International Conference, ICGT 2016, in Memory of Hartmut Ehrig, Held as Part of STAF 2016, Vienna, Austria, July 5-6, 2016, Proceedings.",
				"count": 15,
				"papers": [
					"Complexity is the Only Constant: Trends in Computing and Their Relevance to Model Driven Engineering.",
					"Sesqui-Pushout Rewriting with Type Refinements.",
					"Parallelism in AGREE Transformations.",
					"Model Checking Reconfigurable Petri Nets with Maude.",
					"A Software Package for Chemically Inspired Graph Transformation.",
					"A Tool Environment for Managing Families of Model Transformation Rules.",
					"Compiling Graph Programs to C.",
					"An Algorithm for the Critical Pair Analysis of Amalgamated Graph Transformations.",
					"Rete Network Slicing for Model Queries.",
					"An SQL-Based Query Language and Engine for Graph Pattern Matching.",
					"On the Operationalization of Graph Queries with Generalized Discrimination Networks.",
					"The Incremental Advantage: Evaluating the Performance of a TGG-based Visualisation Framework.",
					"Automatic Inference of Graph Transformation Rules Using the Cyclic Nature of Chemical Reactions.",
					"Using Graph Transformation for Puzzle Game Level Generation and Validation.",
					"Graph Transformation Meets Reversible Circuits: Model Transformation and Optimization."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2016",
				"sub_name": "Tests and Proofs - 10th International Conference, TAP@STAF 2016, Vienna, Austria, July 5-7, 2016, Proceedings.",
				"count": 12,
				"papers": [
					"Using Formal Methods for Verification and Validation in Railway.",
					"Monadic Sequence Testing and Explicit Test-Refinements.",
					"Advances in Property-Based Testing for \\alpha Prolog.",
					"Tests and Proofs for Enumerative Combinatorics.",
					"Classifying Test Suite Effectiveness via Model Inference and ROBBDs.",
					"Lightweight Symbolic Verification of Graph Transformation Systems with Off-the-Shelf Hardware Model Checkers.",
					"Testing-Based Formal Verification for Theorems and Its Application in Software Specification Verification.",
					"Your Proof Fails? Testing Helps to Find the Reason.",
					"Classifying Bugs with Interpolants.",
					"Debugging Meets Testing in Erlang.",
					"Combining Dynamic and Static Analysis to Help Develop Correct Graph Transformations.",
					"Automatic Predicate Testing in Formal Certification - You've only Proven What You've Said, Not What You Meant!"
				]
			},
			{
				"sub_name_abbr": "conf/sefm/2016",
				"sub_name": "Software Engineering and Formal Methods - 14th International Conference, SEFM 2016, Held as Part of STAF 2016, Vienna, Austria, July 4-8, 2016, Proceedings.",
				"count": 27,
				"papers": [
					"Abstractions, Semantic Models and Analysis Tools for Concurrent Systems: Progress and Open Problems - (Extended Abstract).",
					"Satisfiability Checking: Theory and Applications.",
					"Automatic Derivation of Platform Noninterference Properties.",
					"Linearizability and Causality.",
					"Refinement-Based Verification of Communicating Unstructured Code.",
					"Guided Dynamic Symbolic Execution Using Subgraph Control-Flow Information.",
					"Correlating Structured Inputs and Outputs in Functional Specifications.",
					"Combining Predicate Abstraction with Fixpoint Approximations.",
					"Finding Boundary Elements in Ordered Sets with Application to Safety and Requirements Analysis.",
					"Combining Abstract Interpretation with Symbolic Execution for a Static Value Range Analysis of Block Diagrams.",
					"Program Generation Using Simulated Annealing and Model Checking.",
					"LTL Parameter Synthesis of Parametric Timed Automata.",
					"Model Checking Simulation Rules for Linearizability.",
					"LTL Model Checking under Fairness in ProB.",
					"Counterexamples from Proof Failures in SPARK.",
					"Proving Termination of Programs with Bitvector Arithmetic by Symbolic Execution.",
					"SMT-Based Automatic Proof of ASM Model Refinement.",
					"Coq Implementation of OO Verification Framework VeriJ.",
					"Towards a Proof Framework for Information Systems with Weak Consistency.",
					"A Cognitive Framework Based on Rewriting Logic for the Analysis of Interactive Systems.",
					"Incentive Stackelberg Mean-Payoff Games.",
					"Stability-Based Adaptation of Asynchronously Communicating Software.",
					"Compliance Checking in the Open Payments Ecosystem.",
					"CoCoSpec: A Mode-Aware Contract Language for Reactive Systems.",
					"Modularizing Crosscutting Concerns in Component-Based Systems.",
					"Tightening a Contract Refinement.",
					"BMotionWeb: A Tool for Rapid Creation of Formal Prototypes."
				]
			},
			{
				"sub_name_abbr": "conf/ecmdafa/2016",
				"sub_name": "Modelling Foundations and Applications - 12th European Conference, ECMFA@STAF 2016, Vienna, Austria, July 6-7, 2016, Proceedings.",
				"count": 16,
				"papers": [
					"Hierarchical Clustering of Metamodels for Comparative Analysis and Visualization.",
					"Advanced Local Checking of Global Consistency in Heterogeneous Multimodeling.",
					"Supporting the Linked Data Approach to Maintain Coherence Across Rich EMF Models.",
					"Stress-Testing Centralised Model Stores.",
					"Compositional Language Engineering Using Generated, Extensible, Static Type-Safe Visitors.",
					"Demystifying Ontological Classification in Language Engineering.",
					"Example-Based Generation of Graphical Modelling Environments.",
					"Associations in MDE: A Concern-Oriented, Reusable Solution.",
					"Automated Metamodel/Model Co-evolution Using a Multi-objective Optimization Approach.",
					"Enabling OCL and fUML Integration by Transformation.",
					"Isolating and Reusing Template Instances in UML.",
					"MBF4CR: A Model-Based Framework for Supporting an Automated Cancer Registry System.",
					"Metamodeling vs Metaprogramming: A Case Study on Developing Client Libraries for REST APIs.",
					"Experiences with Model-Driven Engineering in Neurorobotics.",
					"Supporting Variability Exploration and Resolution During Model Migration.",
					"Understanding Uncertainty in Cyber-Physical Systems: A Conceptual Model."
				]
			},
			{
				"sub_name_abbr": "conf/icmt/2016",
				"sub_name": "Theory and Practice of Model Transformations - 9th International Conference, ICMT@STAF 2016, Vienna, Austria, July 4-5, 2016, Proceedings.",
				"count": 13,
				"papers": [
					"A Domain Specific Transformation Language to Bridge Concrete and Abstract Syntax.",
					"Model Transformation with Immutable Data.",
					"EMG: A Domain-Specific Transformation Language for Synthetic Model Generation.",
					"Translatability and Translation of Updated Views in ModelJoin.",
					"Using ATL Transformation Services in the MDEForge Collaborative Modeling Platform.",
					"Search-Based Model Transformations with MOMoT.",
					"Extending Model Synchronization Results from Triple Graph Grammars to Multiple Models.",
					"Correct Reuse of Transformations is Hard to Guarantee.",
					"Requirements Engineering in Model-Transformation Development: An Interview-Based Study.",
					"GECO: A Generator Composition Approach for Aspect-Oriented DSLs.",
					"Industrial Software Rejuvenation Using Open-Source Parsers.",
					"Automatically Deriving the Specification of Model Editing Operations from Meta-Models.",
					"Clone Detection for Graph-Based Model Transformation Languages."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2016w",
				"sub_name": "Software Technologies: Applications and Foundations - STAF 2016 Collocated Workshops: DataMod, GCM, HOFM, MELO, SEMS, VeryComp, Vienna, Austria, July 4-8, 2016, Revised Selected Papers.",
				"count": 36,
				"papers": [
					"Separating Topological Noise from Features Using Persistent Entropy.",
					"An Accelerated MapReduce-Based K-prototypes for Big Data.",
					"Refinement Mining: Using Data to Sift Plausible Models.",
					"Towards Platform Independent Database Modelling in Enterprise Systems.",
					"Audio Ergo Sum - A Personal Data Model for Musical Preferences.",
					"A High-Level Model Checking Language with Compile-Time Pruning of Local Variables.",
					"Probabilistic Modelling of Station Locations in Bicycle-Sharing Systems.",
					"On the Definition of Parallel Independence in the Algebraic Approaches to Graph Transformation.",
					"Approximating Parikh Images for Generating Deterministic Graph Parsers.",
					"SPO-Rewriting of Constrained Partial Algebras.",
					"Attributed Graph Transformation via Rule Schemata: Church-Rosser Theorem.",
					"Visual Notation and Patterns for Abstract State Machines.",
					"Visualization of Formal Specifications for Understanding and Debugging an Industrial DSL.",
					"Spatio-Temporal Models for Formal Analysis and Property-Based Testing.",
					"Towards a Developer-Oriented Process for Verifying Behavioral Properties in UML and OCL Models.",
					"Model-Based Generation of Natural Language Specifications.",
					"Human-Oriented Formal Modelling of Human-Computer Interaction: Practitioners' and Students' Perspectives.",
					"\"Boring Formal Methods\" or \"Sherlock Holmes Deduction Methods\"?",
					"Formal Model-Based Development in Industrial Automation with Reactive Blocks.",
					"Computational Design Synthesis Using Model-Driven Engineering and Constraint Programming.",
					"Incremental Consistency Checking of Heterogeneous Multimodels.",
					"Continuing a Benchmark for UML and OCL Design and Analysis Tools.",
					"An Experience Integrating Response-Time Analysis and Optimization with an MDE Strategy.",
					"Towards Model-Based Optimisation: Using Domain Knowledge Explicitly.",
					"On the Emergence of Patterns for Spreadsheets Data Arrangements.",
					"Towards an Automated Classification of Spreadsheets.",
					"Programming Communication with the User in Multiplatform Spreadsheet Applications.",
					"Fragment-Based Diagnosis of Spreadsheets.",
					"TrueGrid: Code the Table, Tabulate the Data.",
					"Views on UML Interactions as Spreadsheet Queries.",
					"Implementing Nested FOR Loops as Spreadsheet Formulas.",
					"SheetGit: A Tool for Collaborative Spreadsheet Development.",
					"Context-Aware Design of Reflective Middleware in the Internet of Everything.",
					"Composition of Advanced ( \\mu )Services for the Next Generation of the Internet of Things.",
					"A Formal Approach to Error Localization and Correction in Service Compositions.",
					"Pure Edge Computing Platform for the Future Internet."
				]
			},
			{
				"sub_name_abbr": "journals/corr/BeekL16",
				"sub_name": "Proceedings of the Workshop on FORmal methods for the quantitative Evaluation of Collective Adaptive SysTems, FORECAST@STAF 2016, Vienna, Austria, 8 July 2016.",
				"count": 8,
				"papers": [
					"Resiliency with Aggregate Computing: State of the Art and Roadmap.",
					"A Formal Framework for Modeling Trust and Reputation in Collective Adaptive Systems.",
					"Data as processes: introducing measurement data into CARMA models.",
					"Modelling movement for collective adaptive systems with CARMA.",
					"On Formal Methods for Collective Adaptive System Engineering. {Scalable Approximated, Spatial} Analysis Techniques. Extended Abstract.",
					"Challenges in Quantitative Abstractions for Collective Adaptive Systems.",
					"Stochastic and Spatial Equivalences for PALOMA.",
					"From Collective Adaptive Systems to Human Centric Computation and Back: Spatial Model Checking for Medical Imaging."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2016bigmde",
				"sub_name": "Proceedings of the 4rd Workshop on Scalable Model Driven Engineering part of the Software Technologies: Applications and Foundations (STAF 2016) federation of conferences, Vienna, Austria, July 8, 2016.",
				"count": 6,
				"papers": [
					"Towards Flexible Model Analysis and Constraint Development: A Small Demo Based on Large Real-Life Data.",
					"Evaluation of Model Comparison for Delta-Compression in Model Persistence.",
					"Scalability of Model Transformations: Position Paper and Benchmark Set.",
					"Managing Model and Meta-Model Components with Export and Import Interfaces.",
					"Model-driven Video Decoding: An Application Domain for Model Transformations.",
					"Optimized Declarative Transformation: First Eclipse QVTc Results."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2016ds",
				"sub_name": "Joint Proceedings of the Doctoral Symposium and Projects Showcase Held as Part of STAF 2016 co-located with Software Technologies: Applications and Foundations (STAF 2016), Vienna, Austria, July 4-7, 2016.",
				"count": 10,
				"papers": [
					"Towards Improving Agility in Model-driven Development.",
					"Towards Model-Driven Software Language Modernization.",
					"Model-based Decoder Specifications for the Long-Term Preservation of Video Content.",
					"Interfacing Real-Time Systems for Advanced Co-Simulation - The ACOSAR Approach.",
					"MPM4CPS: Multi-Paradigm Modelling for Cyber-Physical Systems.",
					"SmartGov Advanced decision support for Smart Governance.",
					"MONDO: Scalable Modelling and Model Management on the Cloud.",
					"Software Testing Innovation Alliance - the SHIP project -.",
					"ECIM: European Cloud Marketplace for Intelligent Mobility.",
					"CISL - Core Insurance Service Layer."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "STAF 2015",
		"info": "L'Aquila, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/gg/2015",
				"sub_name": "Graph Transformation - 8th International Conference, ICGT 2015, Held as Part of STAF 2015, L'Aquila, Italy, July 21-23, 2015. Proceedings.",
				"count": 18,
				"papers": [
					"Polymorphic Sesqui-Pushout Graph Rewriting.",
					"Predictive Top-Down Parsing for Hyperedge Replacement Grammars.",
					"AGREE - Algebraic Graph Rewriting with Controlled Embedding.",
					"Proving Termination of Graph Transformation Systems Using Weighted Type Graphs over Semirings.",
					"Towards Local Confluence Analysis for Amalgamated Graph Transformation.",
					"Multi-amalgamated Triple Graph Grammars.",
					"Reconfigurable Petri Nets with Transition Priorities and Inhibitor Arcs.",
					"Reachability in Graph Transformation Systems and Slice Languages.",
					"Equational Reasoning with Context-Free Families of String Diagrams.",
					"Translating Essential OCL Invariants to Nested Graph Constraints Focusing on Set Operations.",
					"Characterizing Conflicts Between Rule Application and Rule Evolution in Graph Transformation Systems.",
					"Graph Pattern Matching as an Embedded Clojure DSL.",
					"Using Graph Transformations for Formalizing Prescriptions and Monitoring Adherence.",
					"Towards Compliance Verification Between Global and Local Process Models.",
					"Inductive Invariant Checking with Partial Negative Application Conditions.",
					"Tool Support for Multi-amalgamated Triple Graph Grammars.",
					"Uncover: Using Coverability Analysis for Verifying Graph Transformation Systems.",
					"Local Search-Based Pattern Matching Features in EMF-IncQuery."
				]
			},
			{
				"sub_name_abbr": "conf/icmt/2015",
				"sub_name": "Theory and Practice of Model Transformations - 8th International Conference, ICMT@STAF 2015, L'Aquila, Italy, July 20-21, 2015. Proceedings.",
				"count": 16,
				"papers": [
					"Change Propagation in an Internal Model Transformation Language.",
					"Origin Tracking + + Text Differencing = = Textual Model Differencing.",
					"CoWolf - A Generic Framework for Multi-view Co-evolution and Evaluation of Models.",
					"Enabling the Reuse of Stored Model Transformations Through Annotations.",
					"Reusable Model Transformation Components with bentō.",
					"Cost-Effective Industrial Software Rejuvenation Using Domain-Specific Models.",
					"Migrating Automotive Product Lines: A Case Study.",
					"Viatra 3: A Reactive Model Transformation Platform.",
					"Towards Functional Model Transformations with OCL.",
					"Transparent Model Transformation: Turning Your Favourite Model Editor into a Transformation Tool.",
					"A Sound Execution Semantics for ATL via Translation Validation - Research Paper.",
					"From UML/OCL to Base Models: Transformation Concepts for Generic Validation and Verification.",
					"F-Alloy: An Alloy Based Model Transformation Language.",
					"Translating ATL Model Transformations to Algebraic Graph Transformations.",
					"A Methodology for Designing Dynamic Topology Control Algorithms via Graph Transformation.",
					"Extending Model to Model Transformation Results from Triple Graph Grammars to Multiple Models."
				]
			},
			{
				"sub_name_abbr": "conf/ecmdafa/2015",
				"sub_name": "Modelling Foundations and Applications - 11th European Conference, ECMFA@STAF 2015, L'Aquila, Italy, July 20-24, 2015. Proceedings.",
				"count": 13,
				"papers": [
					"Energy Consumption Analysis and Design of Energy-Aware WSN Agents in fUML.",
					"A Comparison of Two-Level and Multi-level Modelling for Cloud-Based Applications.",
					"Empirical Evaluation of UML Modeling Tools-A Controlled Experiment.",
					"A Generative Approach to Define Rich Domain-Specific Trace Metamodels.",
					"On Lightweight Metamodel Extension to Support Modeling Tools Agility.",
					"Type Inference in Flexible Model-Driven Engineering.",
					"AspectOCL: Extending OCL for Crosscutting Constraints.",
					"Reusable Model Interfaces with Instantiation Cardinalities.",
					"A Model-Based Approach for the Integration of Configuration Fragments.",
					"Towards Incremental Updates in Large-Scale Model Indexes.",
					"A Model Management Imperative: Being Graphical Is Not Sufficient, You Have to Be Categorical.",
					"Opening the Black-Box of Model Transformation.",
					"Property Access Traces for Source Incremental Model-to-Text Transformation."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2015",
				"sub_name": "Tests and Proofs - 9th International Conference, TAP@STAF 2015, L'Aquila, Italy, July 22-24, 2015. Proceedings.",
				"count": 12,
				"papers": [
					"Scalable Incremental Test-case Generation from Large Behavior Models.",
					"Test Case Generation for Concurrent Systems Using Event Structures.",
					"Fast Model-Based Fault Localisation with Test Suites.",
					"Case Study: Automatic Test Case Generation for a Secure Cache Implementation.",
					"Verifying Code Generation Tools for the B-Method Using Tests: A Case Study.",
					"Software Validation via Model Animation.",
					"Sequential Generation of Structured Arrays and Its Deductive Verification.",
					"Checking UML and OCL Model Consistency: An Experience Report on a Middle-Sized Case Study.",
					"A Constraint Optimisation Model for Analysis of Telecommunication Protocol Logs.",
					"Experimental Evaluation of a Novel Equivalence Class Partition Testing Strategy.",
					"Testing Functional Requirements in UML Activity Diagrams.",
					"Coverage of OCL Operation Specifications and Invariants."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015bx",
				"sub_name": "Proceedings of the 4th International Workshop on Bidirectional Transformations co-located with Software Technologies: Applications and Foundations, STAF 2015, L'Aquila, Italy, July 24, 2015.",
				"count": 7,
				"papers": [
					"Spans of Delta Lenses.",
					"Coalgebraic Aspects of Bidirectional Computation.",
					"Distributing Commas, and the Monad of Anchored Spans.",
					"BiYacc: Roll Your Parser and Reflective Printer into One.",
					"Trace-based Approach to Editability and Correspondence Analysis for Bidirectional Graph Transformations.",
					"Towards a Principle of Least Surprise for Bidirectional Transformations.",
					"A Systematic Approach and Guidelines to Developing a Triple Graph Grammar."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015ps",
				"sub_name": "Proceedings of the Projects Showcase, part of the Software Technologies: Applications and Foundations 2015 federation of conferences (STAF 2015), L'Aquila, Italy, July 22, 2015.",
				"count": 7,
				"papers": [
					"ARTIST: Model-Based Stairway to the Cloud.",
					"Learn PAd : Collaborative and Model-based Learning in Public Administrations.",
					"OCCIware - A Formal and Tooled Framework for Managing Everything as a Service.",
					"Metamodeling Architectures for Business Processess in Organizations.",
					"OSSMETER: Automated Measurement and Analysis of Open Source Software.",
					"MONDO: Scalable Modelling and Model Management on the Cloud.",
					"SeaClouds: Agile management of complex applications across multiple heterogeneous clouds."
				]
			},
			{
				"sub_name_abbr": "conf/gg/2015gcm",
				"sub_name": "Proceedings of the 6th International Workshop on Graph Computation Models co-located with the 8th International Conference on Graph Transformation (ICGT 2015) part of the Software Technologies: Applications and Foundations (STAF 2015) federation of conferences, L'Aquila, Italy, July 20, 2015.",
				"count": 7,
				"papers": [
					"Coupled Transformations of Shared Packed Parse Forests.",
					"Conditions, Constraints and Contracts: On the Use of Annotations for Policy Modeling.",
					"Global Graph Transformations.",
					"Parallel Evaluation of Interaction Nets: Some Observations and Examples.",
					"Attribution of Graphs by Composition of M, N-adhesive Categories.",
					"Single-Pushout Rewriting of Partial Algebras.",
					"On Correctness of Graph Programs Relative to Recursively Nested Conditions."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015bigmde",
				"sub_name": "Proceedings of the 3rd Workshop on Scalable Model Driven Engineering part of the Software Technologies: Applications and Foundations (STAF 2015) federation of conferences, L'Aquila, Italy, July 23, 2015.",
				"count": 7,
				"papers": [
					"Generation of Large Random Models for Benchmarking.",
					"Approach to Define Highly Scalable Metamodels Based on JSON.",
					"Scalable Model Exploration Through Abstraction and Fragmentation Strategies.",
					"An Efficient Computation Strategy for allInstances().",
					"Decentralized Model Persistence for Distributed Computing.",
					"Parallel In-place Model Transformations with LinTra.",
					"Beyond Information Silos Challenges in Integrating Industrial Model-based Data."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015ds",
				"sub_name": "Proceedings of the Doctoral Symposium at Software Technologies: Applications and Foundations 2015 Conference (STAF 2015), L'Aquila, Italy, July 20, 2015.",
				"count": 6,
				"papers": [
					"Reasoning about Properties with Abstract State Machines.",
					"Raising Abstraction in Timing Analysis for Vehicular Embedded Systems through Model-Driven Engineering.",
					"A Proposal for a Common Representation Language for MDE Artifacts and Settings.",
					"Complementing the B-Method with Model-Based Testing.",
					"Communication with Models.",
					"Domain-Specific Modeling and Code Generation for Cross-Platform Multi-Device Mobile Apps."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015volt",
				"sub_name": "Proceedings of the Fourth International Workshop on Verification of Model Transformations co-located with Software Technologies: Applications and Foundations (STAF 2015), L'Aquila, Italy, July 23, 2015.",
				"count": 6,
				"papers": [
					"Analysis Techniques for Graph Transformation Systems.",
					"Temporal Logic Specification and Analysis for Model Transformations.",
					"Verifying SimpleGT Transformations Using an Intermediate Verification Language.",
					"UML and OCL Transformation Model Analysis: Checking Invariant Independence.",
					"Verification of the CD2RDBMS Transformation Case in Flora-2.",
					"Model Transformation Semantic Analysis by Transformation."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2015pame",
				"sub_name": "Proceedings of the First Workshop on Patterns in Model Engineering, PAME 2015, co-located with the 3rd International Conference on Software Technologies: Applications and Foundations (STAF 2015), L'Aquila, Italy, July 21, 2015.",
				"count": 9,
				"papers": [
					"Design Patterns for Model Transformations: Current Research and Future Directions.",
					"Auto-generation of Model Visitor Frameworks.",
					"Elementary Model Management Patterns.",
					"Two-Faced Data.",
					"A Unified Template for Model Transformation Design Patterns.",
					"The Quest for Better Languages: Usage Patterns to the Rescue.",
					"Emergent Model-Driven Engineering Ecosystems by means of Patterns.",
					"Patterns and Styles for Incremental Model Transformations.",
					"Patterns in Model Engineering 2015 - a Workshop Summary."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "STAF 2014",
		"info": "York, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/icmt/2014",
				"sub_name": "Theory and Practice of Model Transformations - 7th International Conference, ICMT@STAF 2014, York, UK, July 21-22, 2014. Proceedings.",
				"count": 14,
				"papers": [
					"On the Usage of TGGs for Automated Model Transformation Testing.",
					"A Search Based Test Data Generation Approach for Model Transformations.",
					"Test Data Generation for Model Transformations Combining Partition and Constraint Analysis.",
					"Testing MOFScript Transformations with HandyMOF.",
					"Towards a Rational Taxonomy for Increasingly Symmetric Model Synchronization.",
					"Correctness of Incremental Model Synchronization with Triple Graph Grammars.",
					"Towards a Language for Graph-Based Model Transformation Design Patterns.",
					"Synchronization of Models of Rich Languages with Triple Graph Grammars: An Experience Report.",
					"Triple Graph Grammars in the Large for Translating Satellite Procedures.",
					"Developing eMoflon with eMoflon.",
					"ChainTracker, a Model-Transformation Trace Analysis Tool for Code-Generation Environments.",
					"Tracing Program Transformations with String Origins.",
					"Transformation of UML and OCL Models into Filmstrip Models.",
					"Reverse Engineering of Model Transformations for Reusability."
				]
			},
			{
				"sub_name_abbr": "conf/ecmdafa/2014",
				"sub_name": "Modelling Foundations and Applications - 10th European Conference, ECMFA@STAF 2014, York, UK, July 21-25, 2014. Proceedings.",
				"count": 17,
				"papers": [
					"Efficient Model Synchronization with View Triple Graph Grammars.",
					"Level-Agnostic Designation of Model Elements.",
					"Towards Scalable Querying of Large-Scale Models.",
					"OCLR: A More Expressive, Pattern-Based Temporal Extension of OCL.",
					"Interpretation of Linguistic Architecture.",
					"Alloy4SPV : A Formal Framework for Software Process Verification.",
					"Sensor Data Visualisation: A Composition-Based Approach to Support Domain Variability.",
					"Identifying and Visualising Commonality and Variability in Model Variants.",
					"Modular DSLs for Flexible Analysis: An e-Motions Reimplementation of Palladio.",
					"Language-Independent Traceability with Lässig.",
					"A Family-Based Framework for i-DSML Adaptation.",
					"Normalizing Heterogeneous Service Description Models with Generated QVT Transformations.",
					"Towards the Systematic Construction of Domain-Specific Transformation Languages.",
					"A MOF-Based Framework for Defining Metrics to Measure the Quality of Models.",
					"Neo4EMF, A Scalable Persistence Layer for EMF Models.",
					"Towards an Infrastructure for Domain-Specific Languages in a Multi-domain Cloud Platform.",
					"Experiences with Business Process Model and Notation for Modeling Integration Patterns."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2014",
				"sub_name": "Tests and Proofs - 8th International Conference, TAP@STAF 2014, York, UK, July 24-25, 2014. Proceedings.",
				"count": 16,
				"papers": [
					"Model-Based Mutation Testing of an Industrial Measurement Device.",
					"Computing with an SMT Solver.",
					"An Abstraction Technique for Testing Decomposable Systems by Model Checking.",
					"An All-in-One Toolkit for Automated White-Box Testing.",
					"Behaviour Driven Development for Tests and Verification.",
					"Quality Assurance in MBE Back and Forth.",
					"Visualizing Unbounded Symbolic Execution.",
					"Filmstripping and Unrolling: A Comparison of Verification Approaches for UML and OCL Behavioral Models.",
					"Generating Classified Parallel Unit Tests.",
					"JTACO: Test Execution for Faster Bounded Verification.",
					"Explicit Assumptions - A Prenup for Marrying Static and Dynamic Program Verification.",
					"A Case Study on Verification of a Cloud Hypervisor by Proof and Structural Testing.",
					"Runtime Assertion Checking and Its Combinations with Static and Dynamic Analyses - Tutorial Synopsis.",
					"Generating Test Data from a UML Activity Using the AMPL Interface for Constraint Solvers.",
					"Lightweight State Capturing for Automated Testing of Multithreaded Programs.",
					"How Test Generation Helps Software Specification and Deductive Verification in Frama-C."
				]
			},
			{
				"sub_name_abbr": "conf/gg/2014",
				"sub_name": "Graph Transformation - 7th International Conference, ICGT 2014, Held as Part of STAF 2014, York, UK, July 22-24, 2014. Proceedings.",
				"count": 18,
				"papers": [
					"Parameterized Verification and Model Checking for Distributed Broadcast Protocols.",
					"Tableau-Based Reasoning for Graph Properties.",
					"Verifying Monadic Second-Order Properties of Graph Programs.",
					"Generating Abstract Graph-Based Procedure Summaries for Pointer Programs.",
					"Generating Inductive Predicates for Symbolic Execution of Pointer-Manipulating Programs.",
					"Attribute Handling for Generating Preconditions from Graph Constraints.",
					"From Core OCL Invariants to Nested Graph Constraints.",
					"Specification and Verification of Graph-Based Model Transformation Properties.",
					"A Static Analysis of Non-confluent Triple Graph Grammars for Efficient Model Transformation.",
					"Transformation and Refinement of Rigid Structures.",
					"Reversible Sesqui-Pushout Rewriting.",
					"On Pushouts of Partial Maps.",
					"The Subgraph Isomorphism Problem on a Class of Hyperedge Replacement Languages.",
					"Canonical Derivations with Negative Application Conditions.",
					"Van Kampen Squares for Graph Transformation.",
					"Graph Transformation Meets Reversible Circuits: Generation, Evaluation, and Synthesis.",
					"Towards Process Mining with Graph Transformation Systems.",
					"Jerboa: A Graph Transformation Library for Topology-Based Geometric Modeling."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2014vao",
				"sub_name": "Proceedings of the 2nd Workshop on View-Based, Aspect-Oriented and Orthographic Software Modelling, VAO@STAF 2014, York, United Kingdom, July 22, 2014.",
				"count": 8,
				"papers": [
					"Proposal for a Multi-View Modelling Case Study: Component-Based Software Engineering with UML, Plug-ins, and Java.",
					"Towards Constraint-Based Model Types: A Generalised Formal Foundation for Model Genericity.",
					"A Method for Aspect-oriented Meta-Model Evolution.",
					"Viewpoints and Views in Hardware Platform Modeling for Safe Deployment.",
					"Query-driven incremental synchronization of view models.",
					"A View-based Approach Towards an Engineering Platform for Industrial Automation in the Cloud.",
					"Criteria for Orthographic Viewpoints.",
					"Model-Driven Security with A System of Aspect-Oriented Security Design Patterns."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2014bigmde",
				"sub_name": "Proceedings of the 2nd Workshop on Scalability in Model Driven Engineering co-located with the Software Technologies: Applications and Foundations Conference, BigMDE@STAF2014, York, UK, July 24, 2014.",
				"count": 7,
				"papers": [
					"Hypersonic: Model Analysis and Checking in the Cloud.",
					"Towards an Open Set of Real-World Benchmarks for Model Queries and Transformations.",
					"LinTraP: Primitive Operators for the Execution of Model Transformations with LinTra.",
					"Improving Memory Efficiency for Processing Large-Scale Models.",
					"MONDO-SAM: A Framework to Systematically Assess MDE Scalability.",
					"Tool Support for Model Splitting using Information Retrieval and Model Crawling Techniques.",
					"Automated Analysis, Validation and Suboptimal Code Detection in Model Management Programs."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2014tcc",
				"sub_name": "Proceedings of the 7th Transformation Tool Contest part of the Software Technologies: Applications and Foundations (STAF 2014) federation of conferences, York, United Kingdom, July 25, 2014.",
				"count": 21,
				"papers": [
					"Case study: FIXML to Java, C# and C++.",
					"Solving the TTC FIXML Case with FunnyQT.",
					"The SDMLib Solution to the FIXML Case for TTC2014.",
					"FIXML to Java, C# and C++ Transformations with QVTR-XSLT.",
					"Solving the FIXML2Code-case Study with HenshinTGG.",
					"The TTC 2014 FIXML Case: Rascal Solution.",
					"Aspectual Code Generators for Easy Generation of FIXML to OO Mappings.",
					"A Model-Driven Solution for Financial Data Representation Expressed in FIXML.",
					"A Solution to the FIXML Case Study Using Triple Graph Grammars and eMoflon.",
					"Solving the TTC'14 FIXML Case Study with SIGMA.",
					"Solving the FIXML Case Study Using Epsilon and Java.",
					"The TTC 2014 Movie Database Case.",
					"Solving the Movie Database Case with QVTo.",
					"Movie Database Case: An EMF-IncQuery Solution.",
					"The Movie Database Case: A Solution Using the Maude-based e-Motions Tool.",
					"Solving the TTC 2014 Movie Database Case with GrGen.NET.",
					"AToMPM Solution for the IMDB Case Study.",
					"Solving the TTC Movie Database Case with FunnyQT.",
					"The SDMLib Solution to the MovieDB Case for TTC2014.",
					"Solving the TTC 2014 Movie Database Case with UML-RSDS.",
					"The TTC 2014 Movie Database Case: Rascal Solution."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2014morse",
				"sub_name": "Proceedings of the 1st International Workshop on Model-Driven Robot Software Engineering co-located with International Conference on Software Technologies: Applications and Foundations, MORSE@STAF 2014, York, UK, July 21, 2014.",
				"count": 8,
				"papers": [
					"Towards a Deep, Domain Specific Modeling Framework for Robot Applications.",
					"A Family of Domain-Specific Languages for Specifying Civilian Missions of Multi-Robot Systems.",
					"Towards a General Framework for Modeling, Simulating and Building Sensor/Actuator Systems and Robots for the Web of Things.",
					"Towards Context Modeling in Space and Time.",
					"Experiences with an Approach to Abstract Handling of Content for Human Machine Interaction Applications.",
					"Code Generator Composition for Model-Driven Engineering of Robotics Component & Connector Systems.",
					"Empirical Study of Planning and Execution for Large Teams of Robots.",
					"3DVFH+: Real-Time Three-Dimensional Obstacle Avoidance Using an Octomap."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2014volt",
				"sub_name": "Proceedings of the Third International Workshop on Verification of Model Transformations co-located with Software Technologies: Applications and Foundations, VOLT@STAF 2014, York, UK, July 21, 2014.",
				"count": 6,
				"papers": [
					"Report on the Third Workshop on Verification of Model Transformations (VOLT 2014).",
					"MocOCL: A Model Checker for CTL-Extended OCL Specifications.",
					"Checking Transformation Model Properties with a UML and OCL Model Validator.",
					"Null Considered Harmful (for Transformation Verification).",
					"Language-Independent Model Transformation Verification.",
					"Towards Domain Completeness for Model Transformations Based on Triple Graph Grammars."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "STAF 2013",
		"info": "Budapest, Hungary",
		"venues": [
			{
				"sub_name_abbr": "conf/icmt/2013",
				"sub_name": "Theory and Practice of Model Transformations - 6th International Conference, ICMT@STAF 2013, Budapest, Hungary, June 18-19, 2013. Proceedings.",
				"count": 18,
				"papers": [
					"Streaming Model Transformations: Scenarios, Challenges and Initial Solutions.",
					"Genetic-Programming Approach to Learn Model Transformation Rules from Examples.",
					"Walk Your Tree Any Way You Want.",
					"On an Automated Translation of Satellite Procedures Using Triple Graph Grammars.",
					"The Graph Grammar Library - A Generic Framework for Chemical Graph Rewrite Systems.",
					"Fragmented Validation: A Simple and Efficient Contribution to XSLT Checking (Extended Abstract).",
					"Model Querying with FunnyQT - (Extended Abstract).",
					"Yet Another Three QVT Languages.",
					"A Methodological Approach for the Coupled Evolution of Metamodels and ATL Transformations.",
					"Metamodel-Specific Coupled Evolution Based on Dynamically Typed Graph Transformations.",
					"Robust Real-Time Synchronization between Textual and Graphical Editors.",
					"Achieving Practical Genericity in Model Weaving through Extensibility.",
					"A Rete Network Construction Algorithm for Incremental Pattern Matching.",
					"Interactive Visual Analytics for Efficient Maintenance of Model Transformations.",
					"Checking Model Transformation Refinement.",
					"Complete Specification Coverage in Automatically Generated Conformance Test Cases for TGG Implementations.",
					"Partial Test Oracle in Model Transformation Testing.",
					"Systematic Testing of Graph Transformations: A Practical Approach Based on Graph Patterns."
				]
			},
			{
				"sub_name_abbr": "conf/tap/2013",
				"sub_name": "Tests and Proofs - 7th International Conference, TAP@STAF 2013, Budapest, Hungary, June 16-20, 2013. Proceedings.",
				"count": 13,
				"papers": [
					"Incremental Refinement Checking for Test Case Generation.",
					"Time for Mutants - Model-Based Mutation Testing with Timed Automata.",
					"Model-Based Testing for Verification Back-Ends.",
					"A Metric for Testing Program Verification Systems.",
					"Test Program Generation for a Microprocessor - A Case-Study.",
					"A Declarative Debugger for Sequential Erlang Programs.",
					"Initiating a Benchmark for UML and OCL Analysis Tools.",
					"Speeding Up Algorithmic Debugging Using Balanced Execution Trees.",
					"Generating Test Suites with Augmented Dynamic Symbolic Execution.",
					"A Lesson on Proof of Programs with Frama-C. Invited Tutorial Paper.",
					"Evaluation of ASLan Mutation Operators.",
					"Solving Constraints for Generational Search.",
					"Divergent Quiescent Transition Systems."
				]
			},
			{
				"sub_name_abbr": "conf/soco/2013",
				"sub_name": "Software Composition - 12th International Conference, SC@STAF 2013, Budapest, Hungary, June 19, 2013. Proceedings.",
				"count": 9,
				"papers": [
					"Reusable Components for Lightweight Mechanisation of Programming Languages.",
					"Neverlang 2 - Componentised Language Development for the JVM.",
					"Preserving Confidentiality in Component Compositions.",
					"Method Shells: Avoiding Conflicts on Destructive Class Extensions by Implicit Context Switches.",
					"Separating Obligations of Subjects and Handlers for More Flexible Event Type Verification.",
					"Implementing Feature Interactions with Generic Feature Modules.",
					"Compositional Development of BPMN.",
					"Building a Customizable Business-Process-as-a-Service Application with Current State-of-Practice.",
					"Verifying Data Independent Programs Using Game Semantics."
				]
			},
			{
				"sub_name_abbr": "conf/staf/2013bigmde",
				"sub_name": "Proceedings of the Workshop on Scalability in Model Driven Engineering, Budapest, Hungary, June 17, 2013.",
				"count": 7,
				"papers": [
					"Scalability in Model Driven Engineering: BigMDE'13 workshop summary.",
					"A research roadmap towards achieving scalability in model driven engineering.",
					"On the concurrent execution of model transformations with Linda.",
					"IncQuery-D: incremental graph search in the cloud.",
					"Reference representation techniques for large models.",
					"Hawk: towards a scalable model indexing architecture.",
					"Tool support for clustering large meta-models."
				]
			}
		]
	},
    {
        "year": "2019",
        "name": "51st TOOLS 2019",
        "info": "Tatarstan, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/2019",
                "sub_name": "Software Technology: Methods and Tools - 51st International Conference, TOOLS 2019, Tatarstan, Russia, October 15-17, 2019, Proceedings.",
                "count": 34,
                "papers": [
                    "Kent Beck or Pablo Picasso? Speculations of the Relationships Between Artists in Software and Painting.",
                    "Towards an Anatomy of Software Requirements.",
                    "Preferred Tools for Agile Development: A Sociocultural Perspective.",
                    "Interpretizer: A Compiler-Independent Conversion of Switch-Based Dispatch into Threaded Code.",
                    "Towards Static Verification of Clojure Contract-Based Programs.",
                    "Problems in Experiment with Biological Signals in Software Engineering: The Case of the EEG.",
                    "Developing Medical Devices from Abstract State Machines to Embedded Systems: A Smart Pill Box Case Study.",
                    "The Impact of Dance Sport on Software Development.",
                    "Proof Strategy for Automated Sisal Program Verification.",
                    "Assessing Job Satisfaction of Software Engineers Using GQM Approach.",
                    "Software Development and Customer Satisfaction: A Systematic Literature Review.",
                    "Object-Oriented Requirements: Reusable, Understandable, Verifiable.",
                    "Measurements for Energy Efficient, Adaptable, Mobile Systems - A Research Agenda.",
                    "Complex Systems: On Design and Architecture of Adaptable Dashboards.",
                    "Human Activity Recognition Using Deep Models and Its Analysis from Domain Adaptation Perspective.",
                    "Spontaneous Emotion Recognition in Response to Videos.",
                    "CNN LSTM Network Architecture for Modeling Software Reliability.",
                    "An Intelligent Tutoring System Tool Combining Machine Learning and Gamification in Education.",
                    "Early Within-Season Yield Prediction and Disease Detection Using Sentinel Satellite Imageries and Machine Learning Technologies in Biomass Sorghum.",
                    "UniquID: A Quest to Reconcile Identity Access Management and the IoT.",
                    "Automated Composition, Analysis and Deployment of IoT Applications.",
                    "Applying Face Recognition in Video Surveillance Security Systems.",
                    "Cyber-Resilience Concept for Industry 4.0 Digital Platforms in the Face of Growing Cybersecurity Threats.",
                    "Method of Improving the Cyber Resilience for Industry 4.0. Digital Platforms.",
                    "Can We Rely on Smartphone Applications?",
                    "Distributed Computing System on a Smartphones-Based Network.",
                    "Above the Clouds: A Brief Study.",
                    "Exploring IA-32: Lessons from Analysis and Experience.",
                    "Continuous Integration and Continuous Delivery in the Process of Developing Robotic Systems.",
                    "VERCORS: Hardware and Software Complex for Intelligent Round-Trip Formalized Verification of Dependable Cyber-Physical Systems in a Digital Twin Environment (Position Paper).",
                    "MELODIC: Selection and Integration of Open Source to Build an Autonomic Cross-Cloud Deployment Platform.",
                    "Quality-Aware Rapid Software Development Project: The Q-Rapids Project.",
                    "MegaM@Rt2 Project: Mega-Modelling at Runtime - Intermediate Results and Research Challenges.",
                    "REVaMP2 Project: Towards Round-Trip Engineering of Software Product Lines - Approach, Intermediate Results and Challenges."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "50th TOOLS Europe 2012",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/50-2012",
                "sub_name": "Objects, Models, Components, Patterns - 50th International Conference, TOOLS 2012, Prague, Czech Republic, May 29-31, 2012. Proceedings.",
                "count": 24,
                "papers": [
                    "Integrating Efficient Model Queries in State-of-the-Art EMF Tools.",
                    "Poporo: A Formal Methods Tool for Fast-Checking of Social Network Privacy Policies.",
                    "DroidSense: A Mobile Tool to Analyze Software Development Processes by Measuring Team Proximity.",
                    "TimeSquare: Treat Your Models with Logical Time.",
                    "Quality Evaluation of Object-Oriented and Standard Mutation Operators Applied to C# Programs.",
                    "101companies: A Community Project on Software Technologies and Software Languages.",
                    "An Object-Oriented Application Framework for the Development of Real-Time Systems.",
                    "Measuring Test Case Similarity to Support Test Suite Understanding.",
                    "Enhancing OSGi with Explicit, Vendor Independent Extra-Functional Properties.",
                    "Efficient Method Lookup Customization for Smalltalk.",
                    "Fake Run-Time Selection of Template Arguments in C++.",
                    "Supporting Compile-Time Debugging and Precise Error Reporting in Meta-programs.",
                    "Identifying a Unifying Mechanism for the Implementation of Concurrency Abstractions on Multi-language Virtual Machines.",
                    "Verification of Snapshotable Trees Using Access Permissions and Typestate.",
                    "Multiparty Session C: Safe Parallel Programming with Message Optimisation.",
                    "Non-interference on UML State-Charts.",
                    "Representing Uniqueness Constraints in Object-Relational Mapping - The Natural Entity Framework.",
                    "Detection of Seed Methods for Quantification of Feature Confinement.",
                    "Assisted Behavior Driven Development Using Natural Language Processing.",
                    "Learning to Classify Bug Reports into Components.",
                    "Incremental Dynamic Updates with First-Class Contexts.",
                    "Elucidative Development for Model-Based Documentation.",
                    "Viewpoint Co-evolution through Coarse-Grained Changes and Coupled Transformations.",
                    "Turbo DiSL: Partial Evaluation for High-Level Bytecode Instrumentation."
                ]
            },
            {
                "sub_name_abbr": "conf/tap/2012",
                "sub_name": "Tests and Proofs - 6th International Conference, TAP@TOOLS 2012, Prague, Czech Republic, May 31 - June 1, 2012. Proceedings.",
                "count": 16,
                "papers": [
                    "The Technology and Psychology of Testing Your Code as You Develop It.",
                    "Combining Model Checking and Symbolic Execution for Software Testing.",
                    "From Model-Checking to Automated Testing of Security Protocols: Bridging the Gap.",
                    "Using Coverage Criteria on RepOK to Reduce Bounded-Exhaustive Test Suites.",
                    "A First Step in the Design of a Formally Verified Constraint-Based Testing Tool: FocalTest.",
                    "Testing Library Specifications by Verifying Conformance Tests.",
                    "Incremental Model-Based Testing of Delta-Oriented Software Product Lines.",
                    "Conformance Relations for Labeled Event Structures.",
                    "Test Generation from Recursive Tiles Systems.",
                    "Generation of Test Data Structures Using Constraint Logic Programming.",
                    "Constructive Finite Trace Analysis with Linear Temporal Logic.",
                    "Towards Scenario-Based Testing of UML Diagrams.",
                    "Evaluating and Debugging OCL Expressions in UML Models.",
                    "A Framework for the Specification of Random SAT and QSAT Formulas.",
                    "A Lesson on Structural Testing with PathCrawler-online.com.",
                    "Tutorial on Automated Structural Testing with PathCrawler - (Extended Abstract)."
                ]
            },
            {
                "sub_name_abbr": "conf/soco/2012",
                "sub_name": "Software Composition - 11th International Conference, SC@TOOLS 2012, Prague, Czech Republic, May 31 - June 1, 2012. Proceedings.",
                "count": 12,
                "papers": [
                    "Modeling Dynamic Architectures Using Dy-BIP.",
                    "Defining Composition Operators for BPMN.",
                    "Relaxing B Sharing Restrictions within CSP||B.",
                    "PaCE: A Data-Flow Coordination Language for Asynchronous Network-Based Applications.",
                    "Adaptation of Legacy Codes to Context-Aware Composition Using Aspect-Oriented Programming.",
                    "Challenges for Refinement and Composition of Instrumentations: Position Paper.",
                    "Constructing Customized Interpreters from Reusable Evaluators Using Game.",
                    "Revising and Extending the Uppaal Communication Mechanism.",
                    "On the Automated Modularisation of Java Programs Using Service Locators.",
                    "Touching Factor: Software Development on Tablets.",
                    "Domain-Specific Languages in Few Steps - The Neverlang Approach.",
                    "Business Process Lines and Decision Tables Driving Flexibility by Selection."
                ]
            },
            {
                "sub_name_abbr": "conf/icmt/2012",
                "sub_name": "Theory and Practice of Model Transformations - 5th International Conference, ICMT@TOOLS 2012, Prague, Czech Republic, May 28-29, 2012. Proceedings.",
                "count": 19,
                "papers": [
                    "How Clean Is Your Sandbox? - Towards a Unified Theoretical Framework for Incremental Bidirectional Transformations.",
                    "Using Models of Partial Knowledge to Test Model Transformations.",
                    "Specification-Driven Test Generation for Model Transformations.",
                    "Typing Model Transformations Using Tracts.",
                    "Reusable and Correct Endogenous Model Transformations.",
                    "Multifocal: A Strategic Bidirectional Transformation Language for XML Schemas.",
                    "Bidirectional Transformation of Model-Driven Spreadsheets.",
                    "Domain-Specific Optimization in Digital Forensics.",
                    "Empirical Assessment of Business Model Transformations Based on Model Simulation.",
                    "Traceability Visualization in Model Transformations with TraceVis.",
                    "Type-Safe Model Transformation Languages as Internal DSLs in Scala.",
                    "Towards a Family of Model Transformation Languages.",
                    "Translational Semantics of a Co-evolution Specific Language with the EMF Transformation Virtual Machine.",
                    "Towards Multi-level Aware Model Transformations.",
                    "An Algorithm for Generating Model-Sensitive Search Plans for EMF Models.",
                    "Paisley: Pattern Matching à la Carte.",
                    "Constraint-Driven Modeling through Transformation.",
                    "The Impact of Class Model Redesign on State Machines.",
                    "Fact or Fiction - Reuse in Rule-Based Model-to-Model Transformation Languages."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "49th TOOLS Europe 2011",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/49-2011",
                "sub_name": "Objects, Models, Components, Patterns - 49th International Conference, TOOLS 2011, Zurich, Switzerland, June 28-30, 2011. Proceedings.",
                "count": 21,
                "papers": [
                    "Synchronizing Models and Code (Invited Talk).",
                    "Finding and Fixing Bugs in Web Applications (Invited Talk).",
                    "Test Suite Quality for Model Transformation Chains.",
                    "Automated Translation of Java Source Code to Eiffel.",
                    "A Generic Solution for Syntax-Driven Model Co-evolution.",
                    "From UML Profiles to EMF Profiles and Beyond.",
                    "Domain-Specific Profiling.",
                    "Metamodel Dependencies for Executable Models.",
                    "KlaperSuite: An Integrated Model-Driven Environment for Reliability and Performance Analysis of Component-Based Systems.",
                    "Unifying Subjectivity.",
                    "An Overview of ALIA4J - An Execution Model for Advanced-Dispatching Languages.",
                    "A Heuristic Approach for Computing Effects.",
                    "Systems Evolution and Software Reuse in Object-Oriented Programming and Aspect-Oriented Programming.",
                    "Lifted Java: A Minimal Calculus for Translation Polymorphism.",
                    "Location Types for Safe Distributed Object-Oriented Programming.",
                    "Static Dominance Inference.",
                    "A Case of Visitor versus Interpreter Pattern.",
                    "Computational REST Meets Erlang.",
                    "Efficient Retrieval and Ranking of Undesired Package Cycles in Large Software Systems.",
                    "Seuss: Better Class Responsibilities through Language-Based Dependency Injection.",
                    "Extensive Validation of OCL Models by Integrating SAT Solving into USE."
                ]
            },
            {
                "sub_name_abbr": "conf/tap/2011",
                "sub_name": "Tests and Proofs - 5th International Conference, TAP@TOOLS 2011, Zurich, Switzerland, June 30 - July 1, 2011. Proceedings.",
                "count": 14,
                "papers": [
                    "Checking Models, Proving Programs, and Testing Systems.",
                    "Tests from Proofs.",
                    "Incorporating Coverage Criteria in Bounded Exhaustive Black Box Test Generation of Structural Inputs.",
                    "Checking the Behavioral Conformance of Web Services with Symbolic Testing and an SMT Solver.",
                    "Association of Under-Approximation Techniques for Generating Tests from Models.",
                    "Security Mutants for Property-Based Testing.",
                    "The SANTE Tool: Value Analysis, Program Slicing and Test Generation for C Program Debugging.",
                    "Abstraction Based Automated Test Generation from Formal Tabular Requirements Specifications.",
                    "Correct Code Containing Containers.",
                    "A Random Testing Approach Using Pushdown Automata.",
                    "Incremental Learning-Based Testing for Reactive Systems.",
                    "Encoding OCL Data Types for SAT-Based Verification of UML/OCL Models.",
                    "State Coverage Metrics for Specification-Based Testing with Büchi Automata.",
                    "Lightweight Testing of Communication Networks with e-Motions."
                ]
            },
            {
                "sub_name_abbr": "conf/icmt/2011",
                "sub_name": "Theory and Practice of Model Transformations - 4th International Conference, ICMT@TOOLS 2011, Zurich, Switzerland, June 27-28, 2011. Proceedings.",
                "count": 15,
                "papers": [
                    "Fine-Tuning Model Transformation: Change Propagation in Context of Consistency, Completeness, and Human Guidance.",
                    "Optimization of Visitor Performance by Reflection-Based Analysis.",
                    "A Comparison of Rule Inheritance in Model-to-Model Transformation Languages.",
                    "Model-Driven Development of Model Transformations.",
                    "Generic Model Transformations: Write Once, Reuse Everywhere.",
                    "Combining Specification-Based and Code-Based Coverage for Model Transformation Chains.",
                    "A Transformation Workbench for Building Information Models.",
                    "Model Transformation Analysis: Staying Ahead of the Maintenance Nightmare.",
                    "Iterative Development of Consistency-Preserving Rule-Based Refactorings.",
                    "Toward Bidirectionalization of ATL with GRoundTram.",
                    "An Evaluation of the Graphical Modeling Framework (GMF) Based on the Development of the CORAS Tool.",
                    "A Graph Query Language for EMF Models.",
                    "The GReTL Transformation Language.",
                    "Performance in Model Transformations: Experiments with ATL and QVT.",
                    "A Demonstration-based Approach to Support Live Transformations in a Model Editor."
                ]
            },
            {
                "sub_name_abbr": "conf/soco/2011",
                "sub_name": "Software Composition - 10th International Conference, SC@TOOLS 2011, Zurich, Switzerland, June 30 - July 1, 2011. Proceedings.",
                "count": 12,
                "papers": [
                    "Deriving Functional Interface Specifications for Composite Components.",
                    "Comparing Machine Learning Approaches for Context-Aware Composition.",
                    "An Implementation of Composable Memory Transactions in Haskell.",
                    "Synthesizing Glue Operators from Glue Constraints for the Construction of Component-Based Systems.",
                    "A Sequence of Patterns for Reusable Aspect Libraries with Easy Configuration.",
                    "Pluggable Aspect Instantiation Models.",
                    "Composing Event-B Specifications - Case-Study Experience.",
                    "A Formal Approach for Incremental Construction with an Application to Autonomous Robotic Systems.",
                    "Towards Incremental Cycle Analysis in ESMoL Distributed Control System Models.",
                    "Assuring Architectural Properties during Compositional Architecture Design.",
                    "Coherence and Performance for Interactive Scientific Visualization Applications.",
                    "Toward Validated Composition in Component-Based Adaptive Middleware."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/2011mtatl",
                "sub_name": "Proceedings of the 3rd International Workshop on Model Transformation with ATL, MtATL@TOOLS 2011, Zürich, Switzerland, July 1st, 2011.",
                "count": 8,
                "papers": [
                    "Two Basic Correctness Properties for ATL Transformations: Executability and Coverage.",
                    "Compiling ATL with Continuations.",
                    "Using Metrics for Assessing the Quality of ATL Model Transformations.",
                    "Using ATL to Support Model-Driven Development of RubyTL Model Transformations.",
                    "Extending ATL for Native UML Profile Support: An Experience Report.",
                    "A Revised Semantics for Rule Inheritance and Module Superimposition in ATL.",
                    "A Static Analyzer for Model Transformations.",
                    "WSCDL to WSBPEL: a Case Study of ATL-based Transformation."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "48th TOOLS Europe 2010",
        "info": "Málaga, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/48-2010",
                "sub_name": "Objects, Models, Components, Patterns, 48th International Conference, TOOLS 2010, Málaga, Spain, June 28 - July 2, 2010. Proceedings.",
                "count": 16,
                "papers": [
                    "Deep Meta-modelling with MetaDepth.",
                    "A Generic Meta-model-Based Approach for Specifying Framework Functionality and Usage.",
                    "Loosely-Coupled Distributed Reactive Programming in Mobile Ad Hoc Networks.",
                    "Understanding the Impact of Collection Contracts on Design.",
                    "Reasoning about Function Objects.",
                    "Welterweight Java.",
                    "Read-Only Execution for Dynamic Languages.",
                    "Optimizing Aspect-Oriented Mechanisms for Embedded Applications.",
                    "Contract-Driven Testing of JavaScript Code.",
                    "Late Binding of AspectJ Advice.",
                    "EriLex: An Embedded Domain Specific Language Generator.",
                    "Domain-Specific Program Checking.",
                    "Revisiting Parametric Types and Virtual Classes.",
                    "Moles: Tool-Assisted Environment Isolation with Closures.",
                    "Encoding Ownership Types in Java.",
                    "Visualizing Dynamic Metrics with Profiling Blueprints."
                ]
            },
            {
                "sub_name_abbr": "conf/icmt/2010",
                "sub_name": "Theory and Practice of Model Transformations - 3rd International Conference, ICMT@TOOLS 2010, Málaga, Spain, June 28-July 2, 2010. Proceedings.",
                "count": 18,
                "papers": [
                    "Search Computing: A Model-Driven Perspective.",
                    "Domain-Specific Composition of Model Deltas.",
                    "Temporal Model-Based Diagnostics Generation for HVAC Control Systems.",
                    "Synthesis of OCL Pre-conditions for Graph Transformation Rules.",
                    "From State- to Delta-Based Bidirectional Model Transformations.",
                    "A Constructive Approach to Testing Model Transformations.",
                    "From Sequence Diagrams to State Machines by Graph Transformation.",
                    "Safe Composition of Transformations.",
                    "Towards Incremental Execution of ATL Transformations.",
                    "Constructing and Navigating Non-invasive Model Decorations.",
                    "Model-to-Model Transformations By Demonstration.",
                    "Implementing Business Process Recovery Patterns through QVT Transformations.",
                    "Model Migration with Epsilon Flock.",
                    "Exceptional Transformations.",
                    "Improving Higher-Order Transformations Support in ATL.",
                    "Towards a Rewriting Logic Semantics for ATL.",
                    "Metamodel Matching Based on Planar Graph Edit Distance.",
                    "Surviving the Heterogeneity Jungle with Composite Mapping Operators."
                ]
            },
            {
                "sub_name_abbr": "conf/tap/2010",
                "sub_name": "Tests and Proofs - 4th International Conference, TAP@TOOLS 2010, Málaga, Spain, July 1-2, 2010. Proceedings.",
                "count": 14,
                "papers": [
                    "How Tests and Proofs Impede One Another: The Need for Always-On Static and Dynamic Feedback.",
                    "Myths in Software Engineering: From the Other Side.",
                    "QuickSpec: Guessing Formal Specifications Using Testing.",
                    "Testing First-Order Logic Axioms in Program Verification.",
                    "Proving and Visualizing OCL Invariant Independence by Automatically Generated Test Cases.",
                    "Proof Process Evaluation with Mutation Analysis.",
                    "Generating Regression Unit Tests Using a Combination of Verification and Capture & Replay.",
                    "DyGen: Automatic Generation of High-Coverage Tests via Mining Gigabytes of Dynamic Traces.",
                    "Combining Static Analysis and Test Generation for C Program Debugging.",
                    "Generating High-Quality Tests for Boolean Circuits by Treating Tests as Proof Encoding.",
                    "Relational Analysis of (Co)inductive Predicates, (Co)algebraic Datatypes, and (Co)recursive Functions.",
                    "Combining Theorem Proving and Narrowing for Rewriting-Logic Specifications.",
                    "Syntactic Abstraction of B Models to Generate Tests.",
                    "Building a Test-Ready Abstraction of a Behavioral Model Using CLP."
                ]
            },
            {
                "sub_name_abbr": "conf/soco/2010",
                "sub_name": "Software Composition - 9th International Conference, SC@TOOLS 2010, Malaga, Spain, July 1-2, 2010. Proceedings.",
                "count": 10,
                "papers": [
                    "Composing Models at Two Modeling Levels to Capture Heterogeneous Concerns in Requirements.",
                    "Managing Variability in Workflow with Feature Model Composition Operators.",
                    "Composition and Compositionality in a Component Model for Autonomous Robots.",
                    "Event-Specific Software Composition in Context-Oriented Programming.",
                    "Predicated Generic Functions.",
                    "Dynamically Adaptive Systems through Automated Model Evolution Using Service Compositions.",
                    "Visualizing and Assessing a Compositional Approach of Business Process Design.",
                    "Construction of Asynchronous Communicating Systems: Weak Termination Guaranteed!",
                    "An Advice for Advice Composition in AspectJ.",
                    "The .NET Primitives for Open, Dynamic and Reflective Component Frameworks."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/2010bsme",
                "sub_name": "Business System Management and Engineering - From Open Issues to Applications [partially an outcome of the International Workshop on Business System Management and Engineering, BSME 2010, Malaga, Spain, June-July 2010, in conjunction with TOOLS 2010.",
                "count": 11,
                "papers": [
                    "On Some Challenges in Business Systems Management and Engineering for the Networked Enterprise of the Future.",
                    "Digital Ecosystems for Business e-Services in Knowledge-Intensive Firms.",
                    "Inter-organizational Reference Models - May Inter-organizational Systems Profit from Reference Modeling?",
                    "On Guaranteeing Global Dependability Properties in Collaborative Business Process Management.",
                    "Capturing and Aligning Assurance Requirements for Business Services Systems.",
                    "Container-Level Security Certification of Services.",
                    "An Architectural Style for Trustworthy Adaptive Service Based Applications.",
                    "A Conceptual Architecture for Business-Aware Transaction Management.",
                    "Composition in Heterogeneous Service Networks: Requirements and Solutions.",
                    "Ontology-Based Querying of Composite Services.",
                    "A Graph Grammar-Based Dynamic Reconfiguration for Virtualized Web Service-Based Composite Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/2010mose",
                "sub_name": "Proceedings of the 2nd International Workshop on Model-Driven Service Engineering, MoSE@TOOLS 2010, Malaga, Spain, June 29, 2010.",
                "count": 4,
                "papers": [
                    "Modelling Self-Management in Service-Oriented Systems using SelfMML.",
                    "On the Design of a Domain Specific Language for Enterprise Application Integration Solutions.",
                    "Tool support for Service Oriented Development from Business Processes.",
                    "Organic Aggregation Service Engineering Framework (OASEF): A New Model-driven Approach to Service Engineering."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/2010twomde",
                "sub_name": "Proceedings of the 3rd Workshop on Transforming and Weaving Ontologies in Model Driven Engineering, TWOMDE@TOOLS 2010, Málaga, Spain, June 30, 2010.",
                "count": 6,
                "papers": [
                    "Ontology-based Model Synchronisation.",
                    "A Feasibility Study on the Validation of Domain Specific Languages Using OWL 2 Reasoners.",
                    "Establishing a Bridge from Graph-based Modeling Languages to Ontology Languages.",
                    "A MDD approach for generating Rule-based Web Applications from OWL and SWRL.",
                    "Towards an Eclipse Ontology Framework: Integrating OWL and the Eclipse Modeling Framework.",
                    "SPARQLAS - Implementing SPARQL Queries with OWL Syntax."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "47th TOOLS Europe 2009",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/47-2009",
                "sub_name": "Objects, Components, Models and Patterns, 47th International Conference, TOOLS EUROPE 2009, Zurich, Switzerland, June 29-July 3, 2009. Proceedings.",
                "count": 21,
                "papers": [
                    "On Realizing a Framework for Self-tuning Mappings.",
                    "Programming Models for Concurrency and Real-Time.",
                    "CIF: A Framework for Managing Integrity in Aspect-Oriented Composition.",
                    "A Diagrammatic Formalisation of MOF-Based Modelling Languages.",
                    "Designing Design Constraints in the UML Using Join Point Designation Diagrams.",
                    "Stream-Based Dynamic Compilation for Object-Oriented Languages.",
                    "Algebraic Semantics of OCL-Constrained Metamodel Specifications.",
                    "Specifying and Composing Concerns Expressed in Domain-Specific Modeling Languages.",
                    "Early Crosscutting Metrics as Predictors of Software Instability.",
                    "Extensibility in Model-Based Business Process Engines.",
                    "Guaranteeing Syntactic Correctness for All Product Line Variants: A Language-Independent Approach.",
                    "A Sound and Complete Program Logic for Eiffel.",
                    "A Coding Framework for Functional Adaptation of Coarse-Grained Components in Extensible EJB Servers.",
                    "A Leasing Model to Deal with Partial Failures in Mobile Ad Hoc Networks.",
                    "Reusing and Composing Tests with Traits.",
                    "Flow-Centric, Back-in-Time Debugging .",
                    "A Classification Framework for Pointcut Languages in Runtime Monitoring.",
                    "Fast Simulation Techniques for Design Space Exploration.",
                    "PyGirl: Generating Whole-System VMs from High-Level Prototypes Using PyPy.",
                    "Using Grammarware Languages to Define Operational Semantics of Modelled Languages.",
                    "Automatic Generation of Integrated Formal Models Corresponding to UML System Models."
                ]
            },
            {
                "sub_name_abbr": "conf/seafood/2009",
                "sub_name": "Software Engineering Approaches for Offshore and Outsourced Development - 3rd International Conference, SEAFOOD@TOOLS 2009, Zurich, Switzerland, July 2-3, 2009. Proceedings.",
                "count": 14,
                "papers": [
                    "Decentralized Software Development: Pitfalls and Challenges.",
                    "An Empiricist View of Managing Globally Distributed Software Development.",
                    "IBM Industry Practice: Challenges in Offshore Software Development from a Global Delivery Center.",
                    "Solution Proposals for Japan-Oriented Offshore Software Development in China.",
                    "Working in Distributed Teams: Challenges, Best Practices, and Guidelines.",
                    "Quantitative CMMI Assessment for Offshoring through the Analysis of Project Management Repositories.",
                    "Predicting Fault-Prone Modules: A Comparative Study.",
                    "Effort Drivers Estimation for Brazilian Geographically Distributed Software Development.",
                    "Challenges for Product Roadmapping in Inter-company Collaboration.",
                    "Global Software Development with Cloud Platforms.",
                    "Competitive Risk Identification Method for Distributed Teams.",
                    "Model-Centric Approach to Software Design and Stakeholder-Specific Architecture Views in Scope of a Financial Institution.",
                    "The Role of Contracts in Distributed Development.",
                    "Managing Communication among Geographically Distributed Teams: A Brazilian Case."
                ]
            },
            {
                "sub_name_abbr": "conf/icmt/2009",
                "sub_name": "Theory and Practice of Model Transformations - 2nd International Conference, ICMT@TOOLS 2009, Zurich, Switzerland, June 29-30, 2009. Proceedings.",
                "count": 19,
                "papers": [
                    "Foundations for Bidirectional Programming.",
                    "Model Superimposition in Software Product Lines.",
                    "Efficient Model Transformations by Combining Pattern Matching Strategies.",
                    "Managing Dependent Changes in Coupled Evolution.",
                    "Model Transformation By-Example: An Algorithm for Generating Many-to-Many Transformation Rules in Several Model Transformation Languages.",
                    "A Collection Operator for Graph Transformation.",
                    "Pattern-Based Model-to-Model Transformation: Handling Attribute Conditions.",
                    "Towards Model Round-Trip Engineering: An Abductive Approach.",
                    "Rewriting Queries by Means of Model Transformations from SPARQL to OQL and Vice-Versa.",
                    "Solving Constraints in Model Transformations.",
                    "Automatic Model Generation Strategies for Model Transformation Testing.",
                    "A Simple Game-Theoretic Approach to Checkonly QVT Relations.",
                    "Supporting Model-Driven Development of Object-Relational Database Schemas: A Case Study.",
                    "Typing in Model Management.",
                    "Supporting Parallel Updates with Bidirectional Model Transformations.",
                    "Experiments with a High-Level Navigation Language.",
                    "Using Metrics for Assessing the Quality of ASF+SDF Model Transformations.",
                    "Achieving Rule Interoperability Using Chains of Model Transformations.",
                    "Bidirectional Transformations: A Cross-Discipline Perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/soco/2009",
                "sub_name": "Software Composition - 8th International Conference, SC@TOOLS 2009, Zurich, Switzerland, July 2-3, 2009. Proceedings.",
                "count": 12,
                "papers": [
                    "Language Design for Meta-programming in the Software Composition Domain.",
                    "Putting Traits in Perspective.",
                    "Feature (De)composition in Functional Programming.",
                    "I-Java: An Extension of Java with Incomplete Objects and Object Composition.",
                    "Language-Independent Quantification and Weaving for Feature Composition.",
                    "Lazy Composition of Representations in Java.",
                    "Specifying and Composing Non-functional Requirements in Model-Based Development.",
                    "Round-Trip Support for Invasive Software Composition Systems.",
                    "Implicit First Class Genericity.",
                    "A Framework for Testing Model Composition Engines.",
                    "Composing RESTful Services with JOpera.",
                    "Writing Composable Software with InterpreterLib."
                ]
            },
            {
                "sub_name_abbr": "conf/tap/2009",
                "sub_name": "Tests and Proofs - 3rd International Conference, TAP@TOOLS 2009, Zurich, Switzerland, July 2-3, 2009. Proceedings.",
                "count": 12,
                "papers": [
                    "Security Testing and Formal Methods for High Levels Certification of Smart Cards.",
                    "Verification, Testing and Statistics.",
                    "Development of a Generic Voter under FoCal.",
                    "Combining Satisfiability Solving and Heuristics to Constrained Combinatorial Interaction Testing.",
                    "Incorporating Historical Test Case Performance Data and Resource Constraints into Test Case Prioritization.",
                    "Complementary Criteria for Testing Temporal Logic Properties.",
                    "Could We Have Chosen a Better Loop Invariant or Method Contract?.",
                    "Consistency, Independence and Consequences in UML and OCL Models.",
                    "Dynamic Symbolic Execution for Testing Distributed Objects.",
                    "Combining Model Checking and Testing in a Continuous HW/SW Co-verification Process.",
                    "Symbolic Execution Based Model Checking of Open Systems with Unbounded Variables.",
                    "Finding Errors of Hybrid Systems by Optimising an Abstraction-Based Quality Estimate."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "46th TOOLS Europe 2008",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/tools/46-2008",
                "sub_name": "Objects, Components, Models and Patterns, 46th International Conference, TOOLS EUROPE 2008, Zurich, Switzerland, June 30 - July 4, 2008. Proceedings.",
                "count": 22,
                "papers": [
                    "The End of the Computing Era: Hephaestus Meets the Olympians.",
                    "Modeling of Component Environment in Presence of Callbacks and Autonomous Activities.",
                    "Efficient Model Checking of Networked Applications.",
                    "Controlling Accessibility in Agile Projects with the Access Modifier Modifier.",
                    "Towards Raising the Failure of Unit Tests to the Level of Compiler-Reported Errors.",
                    "Virtual Machine Support for Stateful Aspects.",
                    "Guarded Program Transformations Using JTL.",
                    "A Multiparadigm Study of Crosscutting Modularity in Design Patterns.",
                    "Representing and Operating with Model Differences.",
                    "Optimizing Dynamic Class Composition in a Statically Typed Language.",
                    "Ownership, Uniqueness, and Immutability.",
                    "Object Incompleteness and Dynamic Composition in Java-Like Languages.",
                    "The Meta in Meta-object Architectures.",
                    "An AsmL Semantics for Dynamic Structures and Run Time Schedulability in UML-RT.",
                    "Component Reassembling and State Transfer in MaDcAr-Based Self-adaptive Software.",
                    "A Comparison of State-Based Modelling Tools for Model Validation.",
                    "MontiCore: Modular Development of Textual Domain Specific Languages.",
                    "Proof-Transforming Compilation of Eiffel Programs.",
                    "Engineering Associations: From Models to Code and Back through Semantics.",
                    "On the Efficiency of Design Patterns Implemented in C# 3.0.",
                    "A Framework for Model Transformation By-Example: Concepts and Tool Support.",
                    "Web Applications Design and Development with WebML and WebRatio 5.0."
                ]
            },
            {
                "sub_name_abbr": "conf/seafood/2008",
                "sub_name": "Software Engineering Approaches for Offshore and Outsourced Development - 2nd International Conference, SEAFOOD@TOOLS 2008, Zurich, Switzerland, July 2-3, 2008. Revised Papers.",
                "count": 14,
                "papers": [
                    "Outsourcing through Combining Software Departments of Several Companies.",
                    "Timeline Prediction Framework for Iterative Software Engineering Projects with Changes.",
                    "Outsourcing-Iterative Improvement Model for Transforming Challenges to Mutual Benefits.",
                    "A Structure for Management of Requirements Set for e-Learning Applications.",
                    "Evaluation of Software Process Improvement in Small Organizations.",
                    "An Examination of the Effects of Offshore and Outsourced Development on the Delegation of Responsibilities to Software Components.",
                    "Students as Partners and Students as Mentors: An Educational Model for Quality Assurance in Global Software Development.",
                    "Problems and Solutions in Distributed Software Development: A Systematic Review.",
                    "Design and Code Reviews in the Age of the Internet.",
                    "Preliminary Analysis for Risk Finding in Offshore Software Outsourcing from Vendor's Viewpoint.",
                    "Evidence-Based Management of Outsourced Software Projects.",
                    "A Closer Look at Extreme Programming (XP) with an Onsite-Offshore Model to Develop Software Projects Using XP Methodology.",
                    "Measuring and Monitoring Task Couplings of Developers and Development Sites in Global Software Development.",
                    "Automated Process Quality Assurance for Distributed Software Development."
                ]
            },
            {
                "sub_name_abbr": "conf/icmt/2008",
                "sub_name": "Theory and Practice of Model Transformations - 1st International Conference, ICMT@TOOLS 2008, Zurich, Switzerland, July 1-2, 2008, Proceedings.",
                "count": 17,
                "papers": [
                    "Transformations Have to be Developed ReST Assured.",
                    "Lifting Transformational Models of Product Lines: A Case Study.",
                    "Model Synchronisation: Definitions for Round-Trip Engineering.",
                    "The Epsilon Transformation Language.",
                    "Transforming Process Algebra Models into UML State Machines: Bridging a Semantic Gap?.",
                    "On Specifying and Visualising Long-Running Empirical Studies.",
                    "Programmed Graph Rewriting with Time for Simulation-Based Design.",
                    "Live Model Transformations Driven by Incremental Pattern Matching.",
                    "Semantics-Based Weaving of UML Sequence Diagrams.",
                    "Translation of QVT Relations into QVT Operational Mappings.",
                    "Composition Techniques for Rule-Based Model Transformation Languages.",
                    "Approaches for Model Transformation Reuse: Factorization and Composition.",
                    "Code Generation by Model Transformation.",
                    "Application of Reflection in Model Transformation Languages.",
                    "Proofs-as-Model-Transformations.",
                    "Analysing Graph Transformation Rules through OCL.",
                    "Extracting Object Interactions Out of Software Contracts Using Model Transformations."
                ]
            }
        ]
    },
    {
        "year": "before 2007",
        "name": "45th TOOLS Europe 2007",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/seafood/2007",
                "sub_name": "Software Engineering Approaches for Offshore and Outsourced Development - 1st International Conference, SEAFOOD@TOOLS 2007, Zurich, Switzerland, February 5-6, 2007. Revised Papers.",
                "count": 15,
                "papers": [
                    "Offshore Software Development: Transferring Research Findings into the Classroom.",
                    "Meeting the Challenge of Communication in Offshore Software Development.",
                    "Testable Requirements for Offshore Outsourcing.",
                    "Introducing Global Supply Chains into Software Engineering Education.",
                    "Turn on Lean Governance ... for Return on Outsourcing.",
                    "Making IT Offshoring Work for the Japanese Industries.",
                    "Mastering Dual-Shore Development - The Tools and Materials Approach Adapted to Agile Offshoring.",
                    "Evaluating Collaboration Platforms for Offshore Software Development Scenarios.",
                    "Outsourcing and Offshoring: The Consultancies' Estimates.",
                    "Questionnaire-Based Risk Assessment Scheme for Japanese Offshore Software Outsourcing.",
                    "An Evaluation Method for Offshore Software Development by Structural Equation Modeling.",
                    "The Value of Outsourced Software.",
                    "Reducing the Cost of Communication and Coordination in Distributed Software Development.",
                    "Survey on Japan-Oriented Offshore Software Development in China.",
                    "Toward Visualization and Analysis of Traceability Relationships in Distributed and Offshore Software Development Projects."
                ]
            },
            {
                "sub_name_abbr": "conf/famoosr/2007",
                "sub_name": "1st Workshop on FAMIX and Moose in Reengineering, FAMOOSr@TOOLS 2007, Zurich, Switzerland, June 25, 2007.",
                "count": 13,
                "papers": [
                    "Dynamix - a Meta-Model to Support Feature-Centric Analysis.",
                    "ScheMoose - Supporting a Functional Language in Moose.",
                    "Making FAMIX Test-Aware.",
                    "Teaching FAMIX about the Preprocessor.",
                    "The Metabase: Generating Object Persistency Using Meta Descriptions.",
                    "NOREX: Distributed collaborative reengineering.",
                    "Combining Development Environments with Reverse Engineering.",
                    "Scripting Diagrams with EyeSee.",
                    "Package Surface Blueprint: A Software Map.",
                    "Package References Distribution Fingerprint.",
                    "Reverse Engineering through Holistic Software Exploration.",
                    "Graph Theory for Software Remodularisation.",
                    "Surgical Information to Detect Design Problems with MOOSE."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/39-2001",
                "sub_name": "39th International Conference and Exhibition on Technology of Object-Oriented Languages and Systems, TOOLS USA 2001, Santa Barbara, CA, USA, July 29 - August 3, 2001.",
                "count": 83,
                "papers": [
                    "e-Business Now.",
                    "State of the Industry: Converging Voice, Video and Data.",
                    "Hacking = Privacy: How Computer Hacking Can Shore Up Your Defenses and Deliver the Closest Ideal to Security Available.",
                    "Open Problems in Object-Oriented Programming.",
                    "Using Mobility as a Competitive Weapon.",
                    "Web Services-Moving towards an Agile Web.",
                    "The .NET Contract Wizard: Adding Design by Contract to Languages Other than Eiffel.",
                    "Simple Support for Design by Contract in C++.",
                    "Specification-Based Incremental Testing of Object Oriented Systems.",
                    "O2BC: A Technique for the Design of Component-Based Applications.",
                    "Dynamic Wrappers: Handling the Composition Issue with JAC.",
                    "Designing and Building the Eiffel Binding for COM.",
                    "GAIL: The Gen-It (r) Abstract Integration Layer for B2B Application Integration Solutions.",
                    "Separation of Data and Presentation for the Next Generation Internet Using the Four-Tier Architecture.",
                    "Virtual Laboratory-Agent-Based Resource Sharing System.",
                    "Automatic Data Mining by Asynchronous Parallel Evolutionary Algorithms.",
                    "A Three-View Model for Developing Object-Oriented Frameworks.",
                    "Visual Component Composition Using Composition Patterns.",
                    "A Domain-Language Approach to Designing Dynamic Enterprise Component-Based Architectures to Support Business Services.",
                    "Implementing Dynamic Language Features in Java Using Dynamic Code Generation.",
                    "Pluto: An Object-Oriented Logic Programming Language.",
                    "A Metric Framework for Object-Oriented Development.",
                    "Detecting Design Flaws via Metrics in Object-Oriented Systems.",
                    "A Framework for QoS Management.",
                    "Assessment of Maintainability in Object-Oriented Software.",
                    "Dynamic Evolution and Consistency of Collaborative Configurations in Object-Oriented Databases.",
                    "On ODMG Data Types.",
                    "Object-Oriented Concepts for Modular Robotics Systems.",
                    "BTOZ: A Formal Specification Language for Formalizing Business Transactions.",
                    "Extensions of Standard Z Refinement Relation for Multiple Viewpoints Oriented Requirements Method.",
                    "Natural-Language Processing Support for Developing Policy-Governed Software Systems.",
                    "Fault Injection Testing for Distributed Object Systems.",
                    "Requirements-Based Testing: An Overview.",
                    "Using Design Patterns and Constraints to Automate the Detection and Correction of Inter-Class Design Defects.",
                    "Requirements-Based UML.",
                    "Generating Structured Implementation Schemes from UML Sequence Diagrams.",
                    "Object Technology: An Executive Overview.",
                    "Component Frameworks.",
                    "Reuse-Based Programming with the Eiffel Libraries.",
                    "Developing Component-Based Software: Arming Yourself for the Full Lifecycle.",
                    "Java 2 Platform Enterprise Edition (J2EE) for Building Web-Based Enterprise Applications.",
                    "Jini-Based Mobile Agent Architecture for Human Planetary Exploration.",
                    "Building Trusted Components.",
                    "Models Everywhere.",
                    "From Object Composition to Model Transformation with the MDA.",
                    "Building Web Applications Using Java 2 Enterprise Edition.",
                    "Technology to Go-Peer-to-Peer (P2P) Mobility in the Wireless Era.",
                    "Programming a Distributed Agent Society with COUGAAR.",
                    "Concurrent O-O Programming in Java.",
                    "Wireless Software Design for Handheld Devices.",
                    "Design Patterns for Concurrent and Distributed Objects.",
                    "A Survey and Comparison of Concurrency and Real-Time Programming Support in Java, Ada, and Posix.",
                    "SOAP: What Is It and What Is It Good For?",
                    "Autonomous Intelligent Agents.",
                    "Automating Software Testing: A Life-Cycle Methodology.",
                    "Relational vs. Object-Oriented Databases.",
                    "Aspect-Oriented Programming with Aspectj.",
                    "Patterns for Designing and Implementing Business Rules in Component-Based Systems.",
                    "Rule Pattern Language 2001: A Pattern Language for Adaptive Manners and Scalable Business Rule Design and Construction.",
                    "Component/Object to Relational Database Bridging: A Leader's Guide to Bridging the Chasm between Database and Software Engineers.",
                    "Reflexivity and Meta-Tools to Manage Your Software Real Estate.",
                    "Introducing OO Concepts with Ruby.",
                    "Transitioning to an Object-Oriented Process.",
                    "Extreme Architecting: Surviving the Architectural View Zoo.",
                    "Strategic IT Management.",
                    "Agile Processes: An Evaluation.",
                    "The Characteristics of Agile Software Processes.",
                    "High-Quality Modeling in UML.",
                    "Creativity in Software Development.",
                    "A Whack on the Side of the Designer's Head: A Toolkit for the Creative Developer.",
                    "Frame-Working with RM-ODP.",
                    "Business Rules! Don't Be an e-diot.",
                    "Workshop on Education and Training (WET).",
                    "Component Architectures for Web-Based Enterprise Application Development.",
                    "Best Practices in Business Rule Design and Implementation.",
                    "Grammar-Oriented Object Design: Creating Adaptive Collaborations and Dynamic Configurations with Self-Describing Components and Services.",
                    "X-treme Project Management Issues (Project Management of O-O Developed Systems.",
                    "X-treme Project Management Issues.",
                    "A Methodology for Migrating a Client/Server Application to an Intranet.",
                    "Design by Contract, By Example.",
                    "Confronting Possibilities and Needs in the Digital Economy: Breaking out of the Box to Envision the System.",
                    "Eiffel in the Enterprise: The Power of Application and Integration.",
                    "About the TOOLS Conference Series."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/38-2001",
                "sub_name": "TOOLS Europe 2001: 38th International Conference on Technology of Object-Oriented Languages and Systems, Components for Mobile Computing, Zurich, Switzerland, 12-14 March 2001.",
                "count": 31,
                "papers": [
                    "Growing Use of Assertions.",
                    "At the Edge of Design by Contract.",
                    "Mobile Computing's Impact on Software Construction.",
                    "The Unbearable Lightness of Distributed Programming: A Survivor's Guide.",
                    "Experiences in Mobile Computing: The CBorg Mobile Multi-Agent System.",
                    "Enhancing Jini's Lookup Service Using XML-Based Service Templates.",
                    "Architecture for Client-Independent Web-Based Applications.",
                    "The e Language: A Fresh Separation of Concerns.",
                    "Object Identity and Dynamic Recomposition of Components.",
                    "Integration of Static and Dynamic Core for UML: A Study in Dynamic Aspects of the pUML OO Meta Modelling Approach to the Rearchitecting of UML.",
                    "Migrating to Reuse: The DesignMatcher Approach.",
                    "An Information Exploration Tool for Performance Analysis of Java Programs.",
                    "Analyzing the Scalability of Transactional CORBA Applications.",
                    "Profiting from Case-Based Reasoning in Framework Documentation.",
                    "Quality Models to Design Software Architectures.",
                    "Coordination: The Evolutionary Dimension.",
                    "Process Control Systems Integration Using Object Oriented Technology.",
                    "Architectural Design of Distributed Business Systems.",
                    "Architectures for Configurable Systems.",
                    "Building Business Process Components in the e-Age (Business rules! don't be an e-diot.).",
                    "Building Component Frameworks with Component Pascal.",
                    "Core Modelling Concepts in Object-Oriented Conceptual Modelling.",
                    "Core Modelling Concepts in Object-Oriented Conceptual Modelling (full paper).",
                    "Genericity in Object-Oriented Programming Languages.",
                    "Interconnecting Objects via Contracts.",
                    "Tool Support for Coordination-Based Software Evolution.",
                    "Java Programming Idioms.",
                    "Object-Oriented Framework Architectures for Embedded Systems.",
                    "UML: XP: Patterns: Components.",
                    "Wireless Application Programming with Java.",
                    "Concurrent Object-Oriented Programming."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/37-2000",
                "sub_name": "TOOLS Pacific 2000: 37th International Conference on Technology of Object-Oriented Languages and Systems, Sydney, Australia, November 2000.",
                "count": 28,
                "papers": [
                    "Design and Implementation of CORBA-Based Subscription Server.",
                    "An Asynchronous Message Exchange System on CORBA.",
                    "An Event-Based Framework for Converged Service Provisioning.",
                    "Generic Invariant-Based Static Analysis Tool for Detection of Runtime Errors in Java Programs.",
                    "Java Multi-Method Framework.",
                    "Symbol Table Construction and Name Lookup in ISO C++.",
                    "Problem Frames and Object-Oriented Software Architecture.",
                    "Tool Support for Systematic Class Identification in Object-Oriented Software Architectures.",
                    "Self-Calibration of Metrics of Java Methods.",
                    "Prioritising Use Cases and Scenarios.",
                    "Eliciting Security Requirements by Misuse Cases.",
                    "A Model for the Migration to object-oriented Software Development with Special Emphasis on Improvement of Acceptance.",
                    "More Meaningful UML Models.",
                    "A Set Approach to Role Modeling.",
                    "Transforming UML Static Models into Object-Oriented Code.",
                    "On Mathematical Foundations for Business Modeling (Presented at TOOLS-USA 2000).",
                    "Match-O, A Dialect of Eiffel with Match-Types.",
                    "Scalable Visualisations with Ownership Trees.",
                    "YooccLa: A Parser Generator for L-Attributed Grammars.",
                    "Container-Managed Messaging: An Architecture for Integrating Java Components and Message-Oriented Applications.",
                    "Modeling Interface Definition Language Extensions.",
                    "A Method for the Design and Development of Distributed Applications Using UML.",
                    "Generic Components to Foster Reuse.",
                    "A Case Study of Framework Design for Horizontal Reuse.",
                    "Dynamic Team Structures for Supporting Software Design Episodes.",
                    "Understanding Frameworks through Visualisation.",
                    "An Integrated Approach for Documenting, Exploring, and Building Framework-Based Software.",
                    "Component Based Application Framework for Systems Utilising the Streaming Data Passing Semantic."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/36-2000",
                "sub_name": "TOOLS Asia 2000: 36th International Conference on Technology of Object-Oriented Languages and Systems, Xi'an, China, 30 October - 4 November 2000.",
                "count": 39,
                "papers": [
                    "Improving Object Oriented Analysis by Explicit Change Analysis.",
                    "Hybrid Object-Oriented Method (HOOM): The Software Development Process.",
                    "A Java Virtual Machine Design Based on Hybrid Concurrent Compilation Model.",
                    "Expanding Design Pattern to Support Parallel Programming.",
                    "Embedding UML and Type Theory to Formalize the Process of Requirement Engineering.",
                    "Architecture Framework for Software Test Tool.",
                    "Agent-Based and Software Composite DDSS.",
                    "Implementing Undo/Redo in PDF Studio Using Object-Oriented Design Pattern.",
                    "Using Object-Orientation in Developing a Flexible Automatic Test System.",
                    "Application of Object-Oriented Analysis and Design in CDMA BSS Development.",
                    "Design Consideration Using the Multimedia Object Repository.",
                    "Research on Life Cycle Management Mechanism in COM/CORBA Interworking.",
                    "An Implementation Model of IntServ/RSVP Based CORBA A/V Stream Service.",
                    "A Strategy for Persistent Object Service under CORBA and WEB Environment.",
                    "A Revised, Inheritance-Supporting Parallel Object Model in PDEFA-I.",
                    "Protocol Mapping Model for Distributed Multimedia Systems.",
                    "An Object-Oriented Middleware for our Metasystem on Internet.",
                    "OTMS-A CORBA-Compliant Object Transaction Management System.",
                    "The Research on Dynamic Self-Adaptive Network Security Model Based on Mobile Agent.",
                    "Design and Implementation of CORBA Security Service.",
                    "Counter Inference of Intelligent Agents.",
                    "Application of Development Method Based on Multi-Agents.",
                    "Cooperative Mobile Agents in Dynamic Network Environment.",
                    "An Agent-Based Distributed Information Delivery System.",
                    "An Agent-Based Load Balancing Mechanism: PLRM Using Java.",
                    "A Novel Workflow Management Model Based on Mobile Agents for Internet Electronic Commerce.",
                    "An Agent Framework Based on Distributed Object.",
                    "A Change Notification Framework Based on Agent for Information System.",
                    "Spatiotemporal Data Modeling and Management: A Survey.",
                    "Role-Based Database Designing for Managing Complex Objects and Their Relationships on the Web.",
                    "Implementation and Proof for Normalization Design of Object-Oriented Data Schemes.",
                    "Implementing Trading Object Services in COM.",
                    "Security Characterization of Software Components and Their Composition.",
                    "A Formalized Abstract Component Object Mode - Z-COM.",
                    "Using the Web and Jini to link Vending Machines and Enterprise Systems.",
                    "Modeling Web Application Architecture with UML.",
                    "Developing an E-Commerce Application by Using Content Component Model.",
                    "Internet Object-Oriented Information Model.",
                    "A Graph-Theoretic Approach for Recognizing the User Interpretation without Conflicts."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/34-2000",
                "sub_name": "TOOLS 2000: 34th International Conference on Technology of Object-Oriented Languages and Systems, 30 July - 3 August 2000, Santa Barbara, CA, USA.",
                "count": 81,
                "papers": [
                    "Keynote Presentations.",
                    "Agent-Mediated E-Commerce Agents, Components, Services, Workflow, UML, Java, XML and Games.",
                    "An MFC Based Multi-Threaded Test Environment for the Validation of an Embedded Automotive Microcontroller.",
                    "Specification-Based Testing for Real-Time Reactive Systems.",
                    "Interface Mutation to Assess the Adequacy of Tests for Components and Systems.",
                    "Traveling Through Dakota: Experiences with an Object-Oriented Program Analysis System.",
                    "Algorithmic Analysis of the Impacts of Changes to Object-Oriented Software.",
                    "Towards a Semantic Metrics Suite for Object-Oriented Design.",
                    "On the Behavioral Inheritance of State-Based Objects.",
                    "Implementing Collaboration-Based Designs Using Aspect-Oriented Programming.",
                    "Behavioral Subtyping and Behavioral Enrichment of Multimethods.",
                    "Reading Large Volumes of Java Objects from Database.",
                    "An ORDBMS-Based Reuse Repository Supporting the Quality Improvement Paradigm - Exemplified by the SDL-Pattern Approach.",
                    "Web-Based Virtual Classroom.",
                    "Weak Subtyping and Genericity.",
                    "Programming with Patterns.",
                    "Automating Delegation in Class-Based Languages.",
                    "A Metacomponent Model to Support the Extensibility and Evolvability of Networked Applications.",
                    "Design-Time Assembly of Runtime Containment Components.",
                    "Automatic Generation of Fault-Tolerant CORBA-Services.",
                    "Using Plans for Specifying Preconfigured Bean Sets.",
                    "But Who Will Guard the Guardians?",
                    "Prose + Test Cases = Specifications.",
                    "Object-Oriented Manufacturing Application Framework.",
                    "POD: A Composition Environment for Pattern-Oriented Design.",
                    "Pattern-Oriented Analysis and Design (POAD): A Structural Composition Approach to Glue Design Patterns.",
                    "Business Rules = Meta-Data.",
                    "A Role-Based Security Architecture for Business Intelligence.",
                    "Software Reuse Technology Practices and Assessment Tool-Kit.",
                    "A Tool for Testing Liveness in Distributed Object Systems.",
                    "Modular Object-Oriented Design of Distributed Protocols.",
                    "An Adaptive Framework for Distributed Complex Applications Development.",
                    "A Distributed Object-Oriented Framework for Tool Development.",
                    "Evolutionary Computer Aided Prototyping System (CAPS).",
                    "User Interface Specification and Modeling in an Object Oriented Environment for Automatic Software Development.",
                    "Object Technology: An Executive Overview.",
                    "Creating The Information-Anywhere Architecture.",
                    "New Microsoft Component Technologies.",
                    "Building COM Applications.",
                    "Corba 3.",
                    "Keys to Enterprise Application Integration.",
                    "Reuse in the Real World.",
                    "XML for E-commerce.",
                    "Effective Strategies and Techniques for Rapid Object-Oriented Application Development.",
                    "Business Specifications and RD-ODP [Abstract].",
                    "Business Specifications and RD-ODP.",
                    "Applying the Lessons of eXtreme Programming [Abstract].",
                    "Applying the Lessons of eXtreme Programming.",
                    "Requirements Management: An Object-Oriented Approach.",
                    "Good Software under Bad Conditions.",
                    "Adding Value to the Unified Process.",
                    "Refactoring.",
                    "Object-Oriented Database Programming in Java.",
                    "Object Structuring Techniques.",
                    "Building Real-Time Embedded Systems with MetaH and UML [Abstract].",
                    "Developing Evolvable, Embedded, Time-Critical Systems with MetaH.",
                    "Introduction to Mobile Agent Systems and Applications.",
                    "The Use Case Pattern Language.",
                    "Aspect-Oriented Programming.",
                    "JINI: Towards Seamless Connectivity of Hardware and Software Services [Abstract].",
                    "Jini for Building Networked Community of Devices and Services.",
                    "Agent-Based Programming In Eiffel.",
                    "OPEN-ing up the UML.",
                    "Idiomatic Java.",
                    "Using C++ Templates for Implementation of Patterns.",
                    "Real-Time Programming in Java.",
                    "Object-Oriented COBOL, The Old, The Bad and The Ugly [Abstract].",
                    "Critical Issues in the Proposed ISO Object-Oriented COBOL 2002 Standard.",
                    "Constructing Reliable C++ Classes [Abstract].",
                    "Source Code Documentation: An Engineering Deliverable.",
                    "Project Management: Earned Value Management.",
                    "Design By Contract and the Component Revolution.",
                    "Object-Oriented Metrics.",
                    "Reusable Integrated Components of Patterns.",
                    "UML Tool Support: Utilization of Object-Oriented Models.",
                    "Project Management of Object-Oriented Developed Systems 2.",
                    "Semantics of (Business) Specifications: Relating Business Needs to IT.",
                    "An Introduction to Knowledge Binding.",
                    "A Framework for Discovering, Organizing, and Using Business Semantics.",
                    "Some Shortcomings of OCL, the Object Constraint Language of UML.",
                    "Component-Based Development? Refining the Blueprint."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/33-2000",
                "sub_name": "TOOLS 2000: 33rd International Conference on Technology of Object-Oriented Languages and Systems, 5-8 June 2000, St. Malo, France.",
                "count": 60,
                "papers": [
                    "Requirements Engineering: Use Cases Are from Mars, Generative Languages are from Venus.",
                    "The Future of Component-Based Development.",
                    "Component Contracts.",
                    "An Open and Secure Terminal Infrastructure for Hosting Personal Services.",
                    "Pickling Threads State in the Java System.",
                    "Streamlining Object-Oriented Software for Deeply Embedded Applications.",
                    "Connecting Non-Java Devices to a Jini Network.",
                    "An Interactive Environment for Real-Time Software Development.",
                    "Measures for Object-Event Interactions.",
                    "UML for Protocol Engineering - Extensions and Experiences.",
                    "Tool Integration: Experiences and Issues in Using XMI and Component Technology.",
                    "Testing-for-Trust: The Genetic Selection Model Applied to Component Qualification.",
                    "Comparative Case Study in SDL and UML.",
                    "An Architecture for Bridging OO and Business Process Modeling.",
                    "An Original View Mechanism for the CORBA Middleware.",
                    "Operation Execution Groups: Efficient Operation Processing in Widely Distributed Object Systems.",
                    "A Middleware Approach for Building Large-Scale Open Shared Virtual Worlds.",
                    "Customization of Component-Based Object Request Brokers through Dynamic Reconfiguration.",
                    "Non-Intrusive Testing, Monitoring and Control of Distributed CORBA Objects.",
                    "Extending CORBA Interfaces with p-Calculus for Protocol Compatibility.",
                    "Another Mediocre Assertion Mechanism for C++.",
                    "Extending Business Objects with Business Rules.",
                    "Components on the Desktop.",
                    "Behavior Inheritance for Object Lifecycles.",
                    "Distributed Separation of Concerns with Aspect Components.",
                    "Making UML Activity Diagrams Object-Oriented.",
                    "Meta-Programming Grey-Box Connectors.",
                    "Role Modeling for Component Design.",
                    "UMLAUT: A Framework for Weaving UML-Based Aspect-Oriented Designs.",
                    "A Framework for Dynamic Adaptation in Wireless Environments.",
                    "An Understandable and Configurable Domain-Specific Framework for Industrial Automation Applications.",
                    "SCAF: A Simple Component Architecture Framework.",
                    "CoDelivery: An Environment for Distribution of Reusable Components.",
                    "An Object Oriented Framework for Task Scheduling.",
                    "GENVIS - Model-Based Generation of Data Visualizers.",
                    "Using the PAC-Amodeus Model and Design Patterns to Make Interactive an Existing Object-Oriented Kernel.",
                    "Statically Checked Documentation with Design Patterns.",
                    "Iterators and Encapsulation.",
                    "Applying a Crystal Ball to Design Pattern Adoption.",
                    "An Introduction to the Object Constraint Language (OCL).",
                    "Introduction to Concurrent Object-Oriented Programming in Java.",
                    "Object-Oriented Modeling with Events.",
                    "Programming with Agents: Combining O-O and Functional Techniques.",
                    "Designing Concurrent Object-Oriented Programs in Java.",
                    "GOF Pursuit - Learning Patterns by Playing.",
                    "Adding Value to the Unified Process.",
                    "Software Architecture.",
                    "Java Design Traps and Pitfalls.",
                    "Beyond RUP.",
                    "Software Product Lines.",
                    "Aspect-Oriented Programming.",
                    "Framework Development and Adaptation with UML.",
                    "Component-Based Design: A Complete Worked Example.",
                    "Smaller Software: Patterns for Objects in Limited Memory.",
                    "Coherent Enterprise Modeling.",
                    "Enterprise JavaBeans (EJB): New Opportunities for Component-Based Development of Web-Based Enterprise Solutions.",
                    "Advanced Visual Modeling: Beyond UML.",
                    "Design and Implementation of Business Rules in Object-Oriented Applications.",
                    "The What, Why and How of the UML Collaboration.",
                    "Workshop: Mastery of Pattern Concepts through Pattern Writing."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/32-1999",
                "sub_name": "TOOLS Pacific 1999: 32nd International Conference on Technology of Object-Oriented Languages and Systems, 22-25 November 1999, Melbourne, Australia.",
                "count": 25,
                "papers": [
                    "Design and Evolution of Software Architecture in Practice.",
                    "Application Level User Interfaces for Various Media.",
                    "Handling Multiple Domain Objects with Model-View-Controller.",
                    "Using Design Patterns to Derive PAC Architectures from Object-Z Specifications.",
                    "A C++ Framework for Active Objects in Embedded Real-time Systems-Bridging the Gap Between Modeling and Implementation.",
                    "Classifying Component Interaction in Product-Line Architectures.",
                    "Natural Creation.",
                    "Architecture = Abstractions over Software.",
                    "Defining UML Family Members Using Prefaces.",
                    "Towards Perfect Objects.",
                    "Object Metamodeling of The Whole-Part Relationship.",
                    "Aggregation from Multiple Perspectives by Roles.",
                    "Integrating UML and Algebraic Specification Techniques.",
                    "Extending the Unified Modeling Language to Support Spatiotemporal Applications.",
                    "Object Ownership for Dynamic Alias Protection.",
                    "Adding External Iterators to an Existing Eiffel Class Library.",
                    "How Can Covariance in Pragmatical Class Methods be Made Statically Type-Safe?",
                    "On Creation, Equality and the Object Model.",
                    "TinMan - A Test Derivation and Management Tool for Specification-Based Class Testing.",
                    "Extending a Method of Devising Software Contracts.",
                    "Dynamic Geospatial Image Mosaics Using JAVA, JAI, RMI and CORBA.",
                    "Coupling Multiagent Systems and Environmental Data.",
                    "Constructing Interoperable Components in Distributed Systems.",
                    "The Benefits of Object Technology in a Greenfields Site.",
                    "Optimizing Object-Oriented Collection Join Queries through Path Traversals."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/31-1999",
                "sub_name": "TOOLS 1999: 31st International Conference on Technology of Object-Oriented Languages and Systems, 22-25 September 1999, Nanjing, China.",
                "count": 62,
                "papers": [
                    "Class Algebra for Ontology Reasoning.",
                    "Software Evolution: Prototypical Deltas.",
                    "Modeling and Reuse Perspectives of Inheritance Can be Reconciled.",
                    "LEAD++: An Object-Oriented Language Based on a Reflective Model for Dynamic Software Adaptation.",
                    "Synchronizing Java Threads Using Assertions.",
                    "The Typing of Communicating Sequential Processes.",
                    "Object Mapping for Layered Cooperative Systems.",
                    "Reasoning about Inheritance and Cloning Behaviors of Software Agents.",
                    "An Object Oriented Data Model for Web and Its Algebra.",
                    "JMSAS: A Mobile Software Agent System.",
                    "Strategies and Techniques of Freeze/Melt.",
                    "Two-Level Modeling.",
                    "Extending Formal Specification To Object-Oriented Models Through Level-View Structured Schemas.",
                    "An Object-Oriented Net Graph Model for Agent Group-Based Network Management.",
                    "Object-Oriented Requirements Modeling Based on UML.",
                    "Risk Analysis and Assessment Using Object-Oriented Techniques.",
                    "A Multi-Layered System of Metrics for the Measurement of Reuse by Inheritance.",
                    "Testing Java Swing-Based Applications.",
                    "Obtaining Generic Classes Automatically through a Parameterization Operator: A Focus on Constrained Genericity.",
                    "The \"Domain Model Concealer\" and \"Application Moderator\" Patterns: Addressing Architectural Uncertainty in Interactive Systems.",
                    "CoOWA: A Component Oriented Web Application Model.",
                    "A New Architecture of Object-Oriented Rule Base Management System.",
                    "Research in Evolution and Reuse of Multi-Leveled Orthogonal Software System Architecture.",
                    "A Equivalent Object-Oriented Schema Evolution Approach Using the Path-Independence Language.",
                    "A Framework for Configurable Workflow Systems.",
                    "An Algorithm for Describing Object-Oriented Software Architecture Using Graph.",
                    "An Object-Oriented Developing Framework of Fault-Tolerance System.",
                    "Framework-Based Software Reuse for Interactive Seismic Processing Applications.",
                    "Agent Class Methodology: A New Kind of Autonomous Object Generation Methodology.",
                    "A Dynamic Architecture for Multi-Agent Systems.",
                    "A Formal Software Development Approach Based on COOZ and Refinement Calculus.",
                    "MAC: A Component Reuse Architecture Based on Multi-Agent Adapter.",
                    "Test Selection from UML Statecharts.",
                    "Enterprise JavaBeans, JavaBeans & XML Expanding the Possibilities for Web-Based Enterprise Application Development.",
                    "Supporting Distributed Software Development Processes in a Web-Based Environment.",
                    "Correct Composition of Distributed Systems.",
                    "A Java Networking API for ATM Networks.",
                    "A Framework and Methodology for Development of Content-Based Web Sites.",
                    "Parallel Objects in Distributed Ada95 Compiler and Running System - PDEFA.",
                    "An Implementation Model of Real Time CORBA for Internet Applications.",
                    "Research on the Multi-Agent Model of Autonomous Distributed Control Systems.",
                    "A Java/CORBA Based Universal Framework for Super Server User-End Integrated Environments.",
                    "A Parallel and Distributed Debugger Implemented with Java.",
                    "Building a Repository for Workflow Systems.",
                    "A Tool for Constructing Service Replication Systems.",
                    "A Survey of Schema Evolution in Object-Oriented Databases.",
                    "Extensible Motor of a Object-Relational DBMS: Design and Implementation.",
                    "Translating Object Query Language.",
                    "An Object-Oriented Software Design for Distributed Videoconferencing System.",
                    "Federated Query Service Based on CORBA.",
                    "A Composite Data Model in Object-Oriented Data Warehousing.",
                    "A Model of Collaborative Systems Transactions.",
                    "The Design and Implementation of an Object Oriented Database Management System-OMNIX.",
                    "Using Paradigm Plus CASE Tool in a Fusion-Based Application Development Project.",
                    "A JavaRMI-Based Application Supporting Interoperability in a GIS Context.",
                    "Efficiently Computing Frequent Tree-Like Topology Patterns in a Web Environment.",
                    "Modeling Dynamic Networks: Advantages and Limitations of the O-O Approach.",
                    "Applying UML to Gas Turbine Engine Simulation.",
                    "The Design of Cooperative Workflow Management Model Based on Agent.",
                    "An Object-Oriented Design of a Multimedia Item Pool.",
                    "Personal Intelligent Navigation System Based on Java.",
                    "Applying Object-Oriented Method to CSIE System."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/30-1999",
                "sub_name": "TOOLS 1999: 30th International Conference on Technology of Object-Oriented Languages and Systems, Delivering Quality Software - The Way Ahead, 1-5 August 1999, Santa Barbara, CA, USA.",
                "count": 78,
                "papers": [
                    "Tools for Component Documentation, Analysis and Testing.",
                    "The Unity of Software and the Power of Roundtrip Engineering.",
                    "Life After the Object Wars.",
                    "Programming Language Design and Software Quality.",
                    "Performance Tuning Mobile Agent Workflow Applications.",
                    "Automatic Detection of Design Problems in Object-Oriented Reengineering.",
                    "Evolution of a Small Object Oriented Manufacturing System.",
                    "Implementing a Distributed Garbage Collector for OO Databases.",
                    "Persistent Object Synchronization with Active Relational Databases.",
                    "Overview of the ROL2 Deductive Object-Oriented Database System.",
                    "Measuring the Effectiveness of Method Test Sequences Derived from Sequencing Constraints.",
                    "A New Metrics Set for Evaluating Testing Efforts for Object-Oriented Programs.",
                    "Benchmark Metrics for Enterprise Object Request Brokers.",
                    "Analysis Techniques for Testing Polymorphic Relationships.",
                    "When to Trust Mobile Objects: Access Control in the Jini(tm) Software System.",
                    "Detecting Evolution Incompatibilities by Analyzing Java Binaries.",
                    "Specifying Java Frameworks Using Abstract Programs.",
                    "Component Frameworks - A Case Study.",
                    "Answerer: A Design Pattern for Dynamical Conditional Execution.",
                    "Enhancing an Event-Based OO Framework for Distributed Programming.",
                    "Use Case Pitfalls: Top 10 Problems from Real Projects Using Use Cases.",
                    "Use Case Modeling Guidelines.",
                    "Cooperative Software Development: Concepts, Model and Tools.",
                    "View Programming for Decentralized Development of OO Programs.",
                    "Object Lessons Learned from an Intelligent Agents Framework for Telephony-Based Applications.",
                    "Tool Support for Testing and Documenting Framework-Based Software.",
                    "Contracts: From Analysis to C++ Implementation.",
                    "A Comparison of Defensive Development and Design by Contract.",
                    "Interaction Schemata: Compiling Interactions to Code.",
                    "Recording User Actions in a Smalltalk Programming Environment.",
                    "Separable UI Architectures in Teaching Object Technology.",
                    "Visualizing O-O Testing in Virtual Communities - Distributed Teaching and Learning.",
                    "Storing Java Objects in Any Database.",
                    "Using Java to Add \"Stored Procedures\" to Databases.",
                    "A Concurrent Object-Based Model and its Use for Coordinating Java Components.",
                    "Managing the Software Development by Using the Recursive Multi- Threaded (RMT) Tool.",
                    "Entity-Relationship Software Development Environment.",
                    "MysterX: A Scheme Toolkit for Building Interactive Applications with COM.",
                    "Communication as a Means to Differentiate Objects, Components and Agents.",
                    "Bounding Component Behavior via Protocols.",
                    "Towards Efficient Support for Executing the Object Constraint Language.",
                    "Systematic Techniques for Inspecting Critical Software.",
                    "The Development and Verification of Safety Critical Software.",
                    "Managing By Contract.",
                    "Verification and Validation Techniques of Object-Oriented Software Systems.",
                    "Mastering JFC 'Look and Feel' and UI Delegation.",
                    "Quality Component Development: Making the Most of JavaBeans and Enterprise JavaBeans Features.",
                    "Ada and the Objects.",
                    "Programming with C++ Exceptions.",
                    "Behind the Beans.",
                    "Java, Eiffel and C++: The Language Comparison.",
                    "Mastering the Windows Eiffel Library.",
                    "Distributed Objects from a Patterns Perspective.",
                    "Building Scalable ODBMS Applications.",
                    "Real-Time Object-Oriented DistributedSystems: RT CORBA and RMA.",
                    "System Design: Architectures and Archetypes.",
                    "A Short Use Case Writing Workshop.",
                    "Modularization Revisited: Aspects in the Design and Evolution of Software Systems.",
                    "Constraint Diagrams: A Step Beyond UML.",
                    "Advanced 00 Modelling: Metamodels and Notations for the Next Millenium.",
                    "Analysis by Contract or UML with Attitude.",
                    "Design of Commercial Object-Oriented Applications - The Patterns.",
                    "Octopus/UML: Combining Objects with Real-Time.",
                    "Analysis, Design and Implementation of Distributed Java Business Frameworks Using Domain Patterns.",
                    "Requirement Patterns.",
                    "Introduction to the OPEN Method with UML.",
                    "Effective Strategies and Techniques for Rapid Object-Oriented Application Development.",
                    "Software Development \"in the Zone\".",
                    "Creating Social Agents with Reusable Components: A Practitioner's Guide.",
                    "Features of UML Tools.",
                    "Project Management of Object-Oriented Developed Systems.",
                    "Making the Transition to Component-Based Enterprise Software Development Overcoming the Obstacles - Patterns for Success.",
                    "Component-Based Software Engineering Processes.",
                    "Agents and Workflow - An Intimate Connection, or Just Friends?",
                    "High level Modelling Languages, Adaptable Process Models and Software Generation: Drivers for Quality and Productivity.",
                    "The Great Language Debate.",
                    "Direct Mapping and User Interface.",
                    "Experiences Teaching Eiffel as a First Programming Language to Economy Students."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/29-1999",
                "sub_name": "TOOLS Europe 1999: 29th International Conference on Technology of Object-Oriented Languages and Systems, 7-10 June 1999, Nancy, France.",
                "count": 65,
                "papers": [
                    "The Unity of Software and the Power of Roundtrip Engineering.",
                    "The Death of Patterns and the Last Pattern Language.",
                    "Design Patterns at Work.",
                    "Trends in Technology - Getting Ready for the 21st Century.",
                    "Component Based Development - The True Object Orientation.",
                    "Two or Three Things I Have Learnt about Repositories.",
                    "Design and Implementation of a Programmable Coordination Architecture for Mobile Agents.",
                    "Developing Safe Concurrent and Distributed Applications with an Architectural Environment.",
                    "Declaratively Codifying Software Architectures Using Virtual Software Classifications.",
                    "A Design Model for Object Oriented Systems with Explicit Architecture.",
                    "Combining Object Orientation and Dataflow Modelling in the Vission Simulation System.",
                    "Emulating Design by Contract in C++.",
                    "Consistent Extension of Components in the Presence of Explicit Invariants.",
                    "Abstract Object State and Version Recovery in N-Version Programming.",
                    "Self-Testable Components: From Pragmatic Tests to Design-for-Testability Methodology.",
                    "Measuring OO Systems: A Critical Analysis of the MOOD Metrics.",
                    "Characterizing Stability in Evolving Frameworks.",
                    "SmartBooks: A Step Beyond Active-Cookbooks to Aid in Framework Instantiation.",
                    "A \"Framework\" for Object Oriented Frameworks Design.",
                    "LOCAL++: A C++ Framework for Local Search Algorithms.",
                    "Needs of Object-Oriented Languages for Physics Knowledge Representation in the Simulation Field.",
                    "The Requirements/Service/Interface (RSI) Approach to Use Case Analysis.",
                    "A Semi-Automatic Approach to Translating Use Cases to Sequence Diagrams.",
                    "Use Cases Considered Harmful.",
                    "Events in Use Cases as a Basis for Identifying and Specifying Classes and Business Rules.",
                    "Lessons Learned Introducing an Object-Oriented Databse in the Telecom Industry.",
                    "Associations as a Language Construct.",
                    "What is This Thing Called Aggregation?",
                    "TRUNIS: An Object Oriented Trunking Radio Telephone Network Information System. An Experience Report.",
                    "Towards Integration of State Machines and Object-Oriented Languages.",
                    "Adding Visual Rules to Object-Oriented Modeling Techniques.",
                    "Dejay: Unifying Concurrency and Distribution to Achive a Distributed Java.",
                    "Internet Servers, Safe-Language Extensions, and Structured Resource Control.",
                    "Dynamic Reuse of Services in Distributed Systems.",
                    "Dependable Multiparty Interactions: A Case Study.",
                    "Dynamic Reconfiguration of Corba-Based Applications.",
                    "Optimizations of Eiffel Programs: Smalleiffel, the GNU Eiffel Compiler.",
                    "Robust Dynamic Exchange of Implementation Aspects.",
                    "Very High Level Programming with Collection Components.",
                    "Employing Object Technology to Expose Fundamental Object Concepts.",
                    "Dynamic Bytecode Usage by Object Oriented Java Programs.",
                    "Unleashing the Power of Distributed Enterprise Information Systems.",
                    "Seamless Development with the Eiffel Method.",
                    "Understanding Software Component Technologies: JavaBeans and ActiveX.",
                    "Introduction to the OPEN Method with UML.",
                    "Catalysis: Precision Modeling and Design for Components.",
                    "CORBA and DCOM: Architectures for Distributed Computing.",
                    "Advanced Programming by Contract.",
                    "Reflexivity and Meta-Tools to Manage Your Software Real Estate.",
                    "Design and Use of Industrial Software Architectures.",
                    "Introduction to OCL.",
                    "DSDM: Dynamic Systems Development Method.",
                    "Analysis by Contract: UML with Attitude!",
                    "Multiparadigm Design and Implementation in C++.",
                    "Building Reusable Software.",
                    "Applied Software Engineering Principles for UML.",
                    "Extreme Programming.",
                    "Comprehensive Object-Oriented Business Process Modeling.",
                    "Visual Programming: Tips and Techniques 3/4 Using VisualAge for Java.",
                    "Efficiency in C++.",
                    "Using Components, Patterns and Frameworks to Realize Architecture.",
                    "Eiffel Workshop: Tools and Platforms.",
                    "Making the Transition to Component-Based Enterprise Software Development: Overcoming the Obstacles 3/4 Patterns for Success.",
                    "Designing Reusable Object-Oriented Architectures - Challenges, Methods & Tools.",
                    "Trusted Components."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/28-1998",
                "sub_name": "TOOLS 1998: 28th International Conference on Technology of Object-Oriented Languages and Systems, 23-26 November 1998, Melbourne, Australia.",
                "count": 25,
                "papers": [
                    "Towards a Pattern Language for Object Oriented Design.",
                    "Designing Persistent Object-Oriented Software Architectures.",
                    "From Interface to Persistence: A Framework for Business Oriented Applications.",
                    "Development of PDM Framework and Customization Environment.",
                    "An Object-Oriented Design Methodology for Distributed Services.",
                    "Industry Experience in Migrating to Object Technology.",
                    "Objects and Constraints.",
                    "Guiding Object-Oriented Design.",
                    "Object Oriented Reuse through Algebraic Specifications.",
                    "Macro Processing in Object-Oriented Languages.",
                    "Forward vs. Reverse Traversal in Path Expression Query Processing.",
                    "From UML to IDL: A Case Study.",
                    "The Design of the Client User Interface for a Meta Object-Oriented CASE Tool.",
                    "A Component-Based Client/Server Application Development Environment using Java.",
                    "RADIUS: Rapid Application Delivery, Installation and Upgrade System.",
                    "Design and Development of Melbourne IT Creator(tm): ASystem for Authoring and Management of Online Education.",
                    "Support for Object-Oriented Testing.",
                    "CDFA: A Testing System for C++.",
                    "Testing Inheritance Hierarchies in the ClassBench Framework.",
                    "A Case for Meta-Interworking: Projecting CORBA Meta-Data into COM.",
                    "Dynamic Deployable Distributed System.",
                    "Inter-Server Transport Performance of Java Bytecode in a Metacomputing Environment.",
                    "A Simple Architecture Description Model.",
                    "Manifolds: Cellular Component Organizations.",
                    "Tool Integration, Collaboration and User Interaction Issues in Component-Based Software Architectures."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/27-1998",
                "sub_name": "TOOLS 1998: 27th International Conference on Technology of Object-Oriented Languages and Systems, 22-25 September 1998, Beijing, China.",
                "count": 40,
                "papers": [
                    "Adding Contracts to Java.",
                    "All-Purpose Quantifiers.",
                    "A Multiparadigm Language for Developing Agent-oriented Applications.",
                    "Models, Domains and Abstraction in Software Development.",
                    "Object and Role Models Viewing.",
                    "Bridging the Gap Between Object Oriented Design and Implementation.",
                    "Compile Time Recursive Objects in C++.",
                    "Primary-Backup Object Replications in Java.",
                    "OSNET - A Language for Domain Modeling.",
                    "Policy Definition in Application-Domain-Related Classes.",
                    "Deriving Scenarios Of Object Interaction Through Petri Net.",
                    "A Compositional Approach to Concurrent Objects.",
                    "Group Model for Decentralized Federation of Object Creation Service.",
                    "RTFrame: An Object-Oriented Application Framework for Real-Time Applications.",
                    "Modeling Enterprise Dependency Networks Using an Object Oriented Paradigm.",
                    "An Automatically Dynamic Checking Tool for Java Beans Semantic Constraints.",
                    "C++ Program Information Database for Analysis Tools.",
                    "The Code Migration of Mobile Agents System.",
                    "On Open Communication Frameworks for Software Agents.",
                    "Challenges of Communication in Mobile Computing.",
                    "Complete Object-Oriented Z and Its Supporting Environment COOZ-Tools.",
                    "A Development and Management Environment Based on UML.",
                    "Automatically Generating Ada95 Codes for Concurrent Objects.",
                    "Enhancing Object Communication Mechanisms.",
                    "An Object-Oriented Model for Parallel Softwares.",
                    "Parallel Object-Oriented Synthesis Environment Based On Message-Passing.",
                    "On the Computer Aided Introduction of Design Pattern into Object-Oriented Systems.",
                    "Specifying Frameworks and Design Patterns as Architectural Fragments.",
                    "Implementation of a Geospatial Imagery Digital Library Using Java and CORBA.",
                    "An O.O. Software Engineering Training Experience within a Collaboration Project between Academia and Industry.",
                    "Moving Toward Component-Based Software Development Approach.",
                    "A Component-Based Model of Web-Enabled Applications.",
                    "Downsizing the Estimation of Software Quality: A Small Object-Oriented Case Study.",
                    "An Approach to Perform Behavior Testing in Object-Oriented Systems.",
                    "BATOOM: A Practical Approach to Testing Object-Oriented Software.",
                    "Research and Implementation of Distributed Time Service in Distributed Object Environment.",
                    "An Object-Oriented Reference Model with Frameworks and Libraries.",
                    "CORBA on WWW: Evaluative Framework for Interoperability Issues.",
                    "The Research and Implementation of Data Warehouse and Data Mining in Decision Support System.",
                    "A Web-Based Design for the Mobile Transaction Management of a Distributed Database System."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/26-1998",
                "sub_name": "TOOLS 1998: 26th International Conference on Technology of Object-Oriented Languages and Systems, 3-7 August 1998, Santa Barbara, CA, USA.",
                "count": 66,
                "papers": [
                    "Isoquantic Shift - The Third Age of Computing.",
                    "Can We Make Componentware Succeed?",
                    "Objects are Dead - Long Live Agents.",
                    "Components: Building Blocks for Automated Business Processes.",
                    "The Challenge of Components.",
                    "Architecting for Large-Scale Systematic Component Reuse.",
                    "Building an OMT-Editor Using Design Patterns: An Experience Report.",
                    "An Object-Oriented Framework for Local Search Heuristics.",
                    "Practical Rules for Reduction on the Number of States of a State Diagram.",
                    "Modeling Dynamic Component Interfaces.",
                    "Library Interoperability via Inheritance.",
                    "A Protocol Based Approach to Specifying Interoperability between Objects.",
                    "Collection Types and Implementations in Object-Oriented Software Libraries.",
                    "Declarative Reasoning about the Structure of Object-Oriented Systems.",
                    "A Framework Managing Quality of Service Contracts in Distributed Applications.",
                    "SableCC, an Object-Oriented Compiler Framework.",
                    "On Separation between Interface, Implementation, and Representation in Object DBMSs.",
                    "Object Life-Cycles in Active Relational Databases.",
                    "Web Based Virtual Oscilloscope for Underwater Acoustic Signals.",
                    "A Virtual Classroom Based on Reusable Object Oriented Components.",
                    "RASEing Towards a Better Systems Development Tool: The Snowball Experience.",
                    "MUTANT: A MultiAgent Toolkit for Artificial Life Simulation.",
                    "GEAMAS V2.0: An Object Oriented Platform for Complex Systems Simulations.",
                    "An Architecture for Unified Dialogue in Distributed Object Systems.",
                    "AutoPilot: Experiences Implementing a Distributed Data-Driven Agent Architecture.",
                    "Data Access and Transportation Services for the CORBA Environment.",
                    "Tool Support for Design by Contract.",
                    "iContract - The Java(tm) Design by Contract(tm) Tool.",
                    "Using Interface Definition Languages to Support Path Expressions and Programming by Contract.",
                    "The Interaction of Access Control and Object-Orientation in Extensible Systems.",
                    "Weak Subtyping - Yet Another Notion of Inheritance.",
                    "Reasoning About Polymorphic Behavior.",
                    "Adaptable Components for Reuse without Rework.",
                    "Building Component Software with COM.",
                    "Software Component Technologies: JavaBeans and ActiveX.",
                    "Methods and Tools for Component Based Development.",
                    "Enterprise Architecture and Component Development.",
                    "Resolutions of an Object Designer.",
                    "Mastering Software Patterns in C++.",
                    "Ada and the Objects.",
                    "OO Language Comparison: Java, Eiffel and C++.",
                    "Developing COM Business Objects with Visual Basics 5.0.",
                    "Object Databases and Multi-Tier Architectures.",
                    "Real-Time Development with the Shlaer-Mellor Method.",
                    "Creating Internet Applications with Object-Oriented Components.",
                    "Nuts and Bolts of Object-Oriented Distributed Computing.",
                    "Object-Oriented Formal Specifications.",
                    "Modeling Complex Behavior Simply or How Much is Too Much?",
                    "BON: Seamless, Reversible, Contract-Based Analysis and Design.",
                    "Design by Contract: The Eiffel Method.",
                    "Putting Metaclasses to Work.",
                    "Analysis by Contract: An Introduction to UML's Object Constraint Language (OCL).",
                    "Surviving Your OO Project.",
                    "Managing OO Software Development for the Year 2000 and Beyond.",
                    "Object-Oriented Software Estimation.",
                    "Software Reuse: Architecture, Process and Organization for Business Success.",
                    "OO Metrics.",
                    "Using a Multi-Term Project to Teach Object Oriented Programming and Design.",
                    "Workshop: Java/CORBA Integration Issues.",
                    "Java Virtual Machine - Present and Near Future.",
                    "Workshop: Component-Based Software Development: Is It the Next Silver Bullet?",
                    "Panel: Issues in Moving to a Component-Based Industry.",
                    "Panel: New Dimensions in OA&D: UML/OML and Beyond.",
                    "Panel: OOLs in 1998: Fin de Siècle, or Renaissance?",
                    "Panel: Using Production Rules in Object-Oriented Design.",
                    "Rescuing a Legacy System as a First Eiffel Project."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/25-1997",
                "sub_name": "TOOLS 1997: 25th International Conference on Technology of Object-Oriented Languages and Systems, 24-28 November 1997, Melbourne, Australia.",
                "count": 37,
                "papers": [
                    "Aspects of Synchronization.",
                    "Comparisons between CORBA IDL & COM/DCOM MIDL: Interfaces for Distributed Computing.",
                    "A CORBA Based Architecture for Heterogeneous Information Source Interoperability.",
                    "A Language for Implementing Computational Mechanics Applications.",
                    "Object-Oriented Development Based on Polymorphism Patterns and Optimization to Reduce Executable Code Size.",
                    "Design Patterns in Garbage Collection.",
                    "A Component Framework for Direct-Manipulation Editors.",
                    "Patterns for Finding Objects within Designs.",
                    "Characterizing Patterns in Framework Development.",
                    "Java Does not Distribute.",
                    "Modelling Multi-Threading in Java.",
                    "Automatic Generation of Bridging Code for Accessing C++ from Java.",
                    "Genja - A New Proposal for Parameterised Types in Java.",
                    "Animating Formal Specifications Using Java Applets.",
                    "'self'-Conscious Objects in Object-Z.",
                    "A Practical Notation for Object Oriented Analysis with a Formal Meaning.",
                    "Class-Based Models in the -Calculus.",
                    "Interactive Analysis of Object Architectures.",
                    "Towards the Formalization of Relationships for Object Modeling.",
                    "Method Dispatching and Type Safety for Objects with Multiple Roles.",
                    "Upscaling the CLOS Inheritance Mechanism for Multidimensional Objects.",
                    "Attribute Types and Bracket Implementations.",
                    "Measuring Object-Oriented Business Models.",
                    "Advanced C++ Programming Styles and Idioms.",
                    "Introduction to COM.",
                    "Introduction to the Unified Modeling Language.",
                    "Applying Design Patterns.",
                    "Requirements Modeling.",
                    "Object-Oriented Testing.",
                    "Design by Contract: Making Object-Oriented Programs that Work.",
                    "Using Design Patterns and Frameworks to Develop Object-Oriented Communication Systems.",
                    "OPEN: A Third Generation OO Methodology - Advanced Tasks and Techniques.",
                    "Oodbms.",
                    "OODEV Open.",
                    "Extendability vs. Substitutability in OO Languages.",
                    "Enterprise Java.",
                    "Concurrent Programming in Java: Language and Libraries."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/24-1997",
                "sub_name": "TOOLS 1997: 24th International Conference on Technology of Object-Oriented Languages and Systems, September 1997, Beijing, China.",
                "count": 58,
                "papers": [
                    "Performance Evaluation of Objects with Roles.",
                    "An Object-Oriented Model for Protocol Design.",
                    "Three-Dimensional Object-Oriented Model.",
                    "A Uniform Framework for Processing Temporal Object Queries.",
                    "Transparent Access to Persistent Objects in Object-Oriented Databases.",
                    "Algebraic Semantics of Object-Oriented Data Models.",
                    "Directed Graph Based Association Algebra for Object-Oriented Databases.",
                    "The Design of a Flexible Class Library Management System.",
                    "ObjectStream: Generating Stream-Based Object I/O for C++.",
                    "OO Metrics Data Gathering Environment.",
                    "An Object-Oriented Environment Database for AGV Path Planing.",
                    "Using Extended General Statecharts to Generate Test Cases for Overloaded/Polymorphic Object-Oriented Programs: A Case Study.",
                    "Hypertext Construction with an Open Hypertext System.",
                    "An Order-Based Composition Semantics for the Inheritance in Logic-Based Object-Oriented Paradigm.",
                    "An Object-Oriented Dependency Graph for Program Slicing.",
                    "Contract-Oriented Specifications.",
                    "VRML++: A Language for Object-Oriented Virtual-Reality Models.",
                    "A Method for Using Object-Oriented Frameworks to Support Various High-Level Parallel Computing Models.",
                    "Experience Report: Using Design Patterns in the Development of JB System.",
                    "PolyConstraints: A Design Pattern for Flexible Collaboration in Heterogeneous Mobile Environments.",
                    "Assembling Software with the Reusable Components in a Library.",
                    "Memphis: A Reuse Based O.O. Software Development Environment.",
                    "FIODBS: An Interoperable Object-Database System.",
                    "JBCDL: An Object-Oriented Component Description Language.",
                    "An Overview of JB (Jade Bird) Component Library System JBCL.",
                    "InFac: A Mechanism to Achieve Systems Integration.",
                    "Mechanisms for Interpretation of OO Systems Design Metrics.",
                    "PCLAgenda: A Process-Centered Support Environment for Component Software.",
                    "The Research of Distributive Object Programming Environment.",
                    "Parallelization and Object-Orientation: A Database Processing Point of View.",
                    "Distributed Fault Tolerance Specification through the use of Interface Definitions.",
                    "An Architecture for Building Reliable Distributed Object-Based Systems.",
                    "Connectors for Modeling Object Relations in CORBA-based Systems.",
                    "Comparisons between CORBA and DCOM: Architectures for Distributed Computing.",
                    "Object-Oriented Technology Transfer to Multiprocessor System-Level Synthesis.",
                    "An Object-Oriented Approach to Schema Integration and Data Mining in Multiple Databases.",
                    "Intelligent Multimedia Presentation System: An Object-Oriented Approach.",
                    "Experiences with Teaching Object-Oriented Concepts to Introductory Programming Students Using C++.",
                    "An Experience of Using FDOOA Method to Develop a Telecommunications Network Management System.",
                    "From Formal Metamodels to Metrics: An Object-Oriented Approach.",
                    "Unconstraining Genercity.",
                    "Finite Model Generation and Formal Specification Development.",
                    "Reengineering for CASE Tool IDEFE0-MAKER.",
                    "Quantitatively Evaluate Object Oriented Software Evolution.",
                    "An Automatic System Modeling Framework for Information System Engineering.",
                    "YHCS2: A CORBA-Compliant Distributed C/S Computing Platform.",
                    "HOOD+ and Its Support System.",
                    "Supporting Project-Centered Reuse in Object-Oriented Software Development.",
                    "Adaptive Object Addressing.",
                    "The Implement Mechanism and Efficiency Analysis of Multiinheritance and Polymorphism.",
                    "A Component Search Engine Model on the Internet.",
                    "The Parallel Object Model in HIPPOS: High Performance Parallel Object System.",
                    "A Practical Formally-Based Approach to Object-Oriented Modeling of Control Systems.",
                    "Distributed Object Technology; the Future.",
                    "Advanced C++ Programming Styles: Using C++ as a Higher-Level Language.",
                    "From C to C++.",
                    "Analysis by Contract.",
                    "Using Design Patterns and Frameworks to Develop Object-Oriented Communication Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/23-1997",
                "sub_name": "TOOLS 1997: 23rd International Conference on Technology of Object-Oriented Languages and Systems, July 28 - August 1, 1997, Santa Barbara, CA, USA.",
                "count": 54,
                "papers": [
                    "Keynotes.",
                    "Keynotes: Java and Eiffel: A de facto relationship?",
                    "Applying Object-Oriented Technology to Embedded Software.",
                    "A Framework for Temporal Data Models: Exploiting Object-Oriented Technology.",
                    "Pattern-Based Framework for Multimedia Distributed Applications.",
                    "New Coding Patterns for Object Management in C++.",
                    "The Translator Pattern - External Functionality with Homomorphic Mappings.",
                    "Incremental Table-Based Method Dispatch for Reflective Object-Oriented Languages.",
                    "Object-Oriented Visualization of Program Logic.",
                    "Films as Graphical Comments in the Source Code of Programs.",
                    "SOLAT - A Simple Object-Oriented Language Analyzing Tool.",
                    "Steering Object-Oriented Scientific Computations.",
                    "Towards an Abstract Language for Dynamic Modeling in Object-Oriented Design.",
                    "From Specification to Management of Composite Object Behavior.",
                    "Inheriting and Modifying Behavior.",
                    "Extending Object-Z for Specifying Real-Time Systems.",
                    "ROAD/EE: A Prototyping Environment for Object-Oriented Specifications.",
                    "Mapping the OO-Jacobson Approach into Function Point Analysis.",
                    "Framework Composition: Problems, Causes and Solutions.",
                    "Extending the Concept of Mixin to Multidimensional Objects.",
                    "Java Implementations of User-Interface Frameworks.",
                    "A Scripting Language Interface to C++ Libraries.",
                    "A Visual Programming Interface for Smalltalk.",
                    "T++: A Test Case Generator Using a Debugging Information Based Technique for Source Code Manipulation.",
                    "Mechanical Generation of Robust Class Hierarchies.",
                    "Callback Implementations in C++.",
                    "Dynamically Extensible Objects in a Class-Based Language.",
                    "A Meta-Object Protocol for Distributed OO Applications.",
                    "An Object Oriented Framework for Distributed, Interoperable Process Engineering Environments.",
                    "A Catalogue of General-Purpose Software Design Patterns.",
                    "Operator Design Pattern for Data Parallel Computation.",
                    "Propagator: A Family of Patterns.",
                    "Panel: Object Languages: How many need we learn?",
                    "Panel: Swim or Sink with Java.",
                    "Eiffel User Workshop.",
                    "Workshop: O-O Metrics.",
                    "Workshop: O-O Analysis and Design Methodology for Year 2000 and Beyond.",
                    "Workshop: Distributed O-O Techniques for Tools/Application Integration.",
                    "Workshop: Bringing CASE to the Coal-Face: Usable, Intelligent, Methodology-Independent CASE.",
                    "Eiffel Essentials.",
                    "A Tour of the Python Language.",
                    "Applying O-O Principles of Java.",
                    "Method Unification: UML and OML.",
                    "The BON Method: Analysis and Design for Reusability.",
                    "Analysis by Contract.",
                    "Real-Time Development with the Shlaer-Mellor Method.",
                    "Effective Object Databases and Multi-Tier Architectures.",
                    "Testing Object-Oriented Software.",
                    "Using CORBA.",
                    "Relational and Object-Oriented Coexistence.",
                    "Metrics for Object-Oriented Development.",
                    "Class Design: Advanced Encapsulation Techniques.",
                    "ISO 9000 for Software Quality Management.",
                    "Object Technology for Safety-Critical Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/13-1994",
                "sub_name": "TOOLS 1994: 13th International Conference on Technology of Object-Oriented Languages and Systems, Versailles, France, Europe.",
                "count": 63,
                "papers": [
                    "Keynote: Large Project Experience.",
                    "Keynote: Object-Oriented Programming at the European Space Agency.",
                    "Keynote: Uses and Misuses of Inheritance.",
                    "Rollit: An Application Builder.",
                    "A Motif Widget to Display, Animate and Edit Graphics.",
                    "An Object-Oriented Approach to Manage Multimedia Documents.",
                    "Putting Icons into (Con-)Text.",
                    "Derived Metaclasses in SOM.",
                    "Practical Experiences with OMT.",
                    "Specifiying and Validating Requirements: The VENUS System.",
                    "Attribute: A Semantic and Seamless Construct.",
                    "Index Configurations in Object-Oriented Databases.",
                    "The Specification of a Seamless O-O Programming Interface for CAD Tools.",
                    "Using Object-Orientation in Real-Time Applications: An Experience Report or (1 Application + 5 Approaches = 1 Comparison).",
                    "Limits of Seamlessness in Object Oriented Software Development.",
                    "A Development Framework for Object-Oriented Specification and Refinement.",
                    "Constraints in Object-Oriented Analysis and Design.",
                    "Beyond the Use Case: Combining Task Analysis and Scripts in Object-Oriented Requirements Capture and Business Process Re-engineering.",
                    "Experiencing Full Object-Oriented Lifecycle in a Complex Financial Domain.",
                    "Supporting Object-Oriented Design with Metrics.",
                    "Reuse Inhibitors with, and Requirements for Collection Class Libraries.",
                    "On the Construction of Extensible Systems.",
                    "Object-Oriented Type Evolution Using Reflection.",
                    "Capturing Object Interactions.",
                    "Traceability in the Object-Oriented Software Life Cycle.",
                    "Selected Results from an Empirical Study on Problem Areas and Trends of Object-Oriented Programming.",
                    "Embedding of Rule-based Expert System Capabilities in Object-Oriented Applications by Using or Simulating Active Behaviour.",
                    "Eiffel Essentials Presentation.",
                    "Expressing and Processing Constraints in Eiffel.",
                    "The Potential For Reverse Type Inheritance in Eiffel.",
                    "Automatic Transformation of Hybrid Object and Logic Specification to C++ Code.",
                    "SPATIO2: An Object Oriented Approach for a Generalized Spatial Information System.",
                    "Interobject Communication Mechanisms.",
                    "Experiences in Object Oriented Software Redesign.",
                    "Safe Iterators.",
                    "Using Inheritance to Provide Subschema Views in a Shared Persistent Object Database.",
                    "C++: Attacks and Defenses.",
                    "Smalltalk Essentials Presentation.",
                    "Creating Tools in HotDraw by Composition.",
                    "A Dossier Server: an Independent Service Bus Between Object Applications and Relational Data Bases.",
                    "Testing Smalltalk Code in Multi-person Projects.",
                    "Eiffel-like Assertions and Private Methods in Smalltalk.",
                    "Three Tools for Smalltalk Programmers: Task Oriented Views, Information Cards, and SCRC card.",
                    "Comparison of O-O languages.",
                    "The Eiffel Method.",
                    "Ada 9X.",
                    "O-O Requirements Analysis and Logical Design.",
                    "Rigorous Development of Concurrent O-O Systems.",
                    "Comparison of Analysis and Design Methods.",
                    "Library Design.",
                    "O-O Modeling for Flexible Manufacturing Systems.",
                    "Project Managment for Object-Oriented Systems.",
                    "The Role of Prototyping in Software Development.",
                    "Essential Techniques for O-O Development.",
                    "Metrics for Object-Oriented Design.",
                    "Object-Oriented Analysis and Design with C++.",
                    "Teaching Object-Oriented Techniques.",
                    "Multimedia and Object-Oriented Development.",
                    "Introduction to Object-Oriented Database Management Systems.",
                    "Object-Oriented Software Engineering.",
                    "A Critical Comparison of C++ and Eiffel - A Clash of Cultures.",
                    "Distributed Programming in C++, from Sockets to CORBA.",
                    "Frameworks: A Programmer's View of Developing Reusable Software."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/12-1993",
                "sub_name": "Technology of Object-Oriented Languages and Systems Tools 12: Proceedings of the twelfth International Conference Tools Pacific, Melbourne 1993. Incorporating the proceedings of Tools 9, Sydney 1992.",
                "count": 55,
                "papers": [
                    "Keynote: Object Technology: W(h)ither the Future?",
                    "Keynote: Object-oriented Requirements Elicitation.",
                    "Deriving a Conceptual Model: a Business Forms Approach.",
                    "Application of Object-Oriented Technology in a Terminal Power Station.",
                    "Class-Based Modelling Of A General Ledger System.",
                    "Towards a Reuse Policy.",
                    "A Separate Proposal for Eiffel.",
                    "\"C++ is Better Than Smalltalk\"??",
                    "Object-Oriented Languages in the i960® Extended Architecture.",
                    "A Methodology for Transforming an Object-Oriented Data Model to a Relational Database.",
                    "Extensible Persistent Objects.",
                    "Metrics for Object-Oriented Design.",
                    "Semiotics, Ethnomethodology, and Object-Oriented Analysis and Design Notations.",
                    "A Comparison of Techniques for Specifying Concurrent Systems Using the Object-Oriented Paradigm.",
                    "Class Union and Polymorphism.",
                    "A Model for Migrating Procedural Programs into Object-Oriented Programs.",
                    "How to Edit \"It\"; or: A \"Black-box\" Constraint-Based Framework for User-Interaction with Arbitrary Structures.",
                    "Understandibility of Class Libraries and Zipf's Law.",
                    "An Object-Oriented Framework for Process-Sensitive Software Engineering Environments.",
                    "Design and Implementation of an Object-Oriented, Interactive Animation System.",
                    "An Object-Oriented Procedure for Simulating Real-Time Systems.",
                    "A Rapid Prototyping System for Real-time Systems Using Object-oriented Concepts.",
                    "Object Technology: W(h)ither the Future?",
                    "Object-Oriented Fundamentals and Object-Oriented Thinking.",
                    "Object-Oriented Databases: Concepts and Commercial Offerings.",
                    "Object Orientation - Lessons of Experience.",
                    "Object-Oriented Lessons of Experience.",
                    "ClassWorks - a Methodological Framework for Developing Systems.",
                    "MOSES: Methodology for Object-Oriented Software Engineering of Systems.",
                    "Object-Oriented Requirements Analysis and Logical Design.",
                    "Object-Oriented Design - the Eiffel Method.",
                    "An Introduction to NEXTSTEP.",
                    "Formal Methods for the Design and Specification of Object-Oriented Systems.",
                    "Systematic Concurrent Object-Oriented Programming.",
                    "Software Engineering Using the Object-Oriented Paradigm: The Promise of Ada 9X.",
                    "A View of VisualWorks: ParcPlace Smalltalk-80.",
                    "Object-Oriented Programming: The Language Landscape.",
                    "Introduction to C++.",
                    "Advanced C++.",
                    "C++??",
                    "Xs - A Graphic Object Mapping System for XWindows.",
                    "A Program Visualisation Tool.",
                    "Persistent Programming: Requirements for a Class Library Implementation.",
                    "A Taxonomy of Objects for Financial Engineering.",
                    "An Object-Oriented, Computational Model to Support the Formulation of a National Retirement Icome Policy.",
                    "Object-Oriented Methodology Emphasizing Reuse Through Customization.",
                    "The Mysterious Case of the Missing Reusable Class Libraries.",
                    "An Extensible Communication Class Library for Hybrid Distributed Systems.",
                    "Revisiting Inheritance of Synchronization Constraints.",
                    "Class Operators for Object Compatibility.",
                    "MViews: A Framework for Developing Visual Programming Environments.",
                    "A Review of Diagramming Notations for Object Oriented Development.",
                    "Tree-Based Coherence Metrics in Object-Oriented Design.",
                    "Experiences with Object Oriented Software Development.",
                    "Systematic Concurrent Object-Oriented Programming."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/11-1993",
                "sub_name": "TOOLS 1993: 11th International Conference on Technology of Object-Oriented Languages and Systems, Santa Barbara, CA, USA.",
                "count": 73,
                "papers": [
                    "Keynote: Software Development Realities.",
                    "Object-Orientation: Management Implications.",
                    "Distributed Object Architecture.",
                    "The Future of Object-Oriented Programming.",
                    "Managing a Software Reusability Effort in a Business Environment.",
                    "Object Oriented Restructuring of the General Purpose Operating System BS2000.",
                    "System Integration with Minimal Object Wrappers.",
                    "A New Approach to Object-Oriented Analysis and Design.",
                    "Object-Oriented Design: the OSM Scheme.",
                    "Introducing States in the Object Model.",
                    "Towards an Object-Oriented Technology for Specification and Implementation of Distributed Systems.",
                    "Visual CASE: An Object-Oriented Software Development System for Home Appliances.",
                    "Cerial: A Tool for XDR or ASN.1 BER Serialization of C++ Objects.",
                    "The Objectworks Browsing Model - Understanding Complex Software.",
                    "Data Abstraction in SoftClass, an OO CASE Tool for Software Reuse.",
                    "The Many Faces of a Class: Views and Contrasts.",
                    "An Environment for Managing the Evolution of Object-oriented.",
                    "Media Language: An Object-Oriented Approach to Generic Application Development.",
                    "The Object Space Approach: Decoupled Communication in C++.",
                    "Object-Based Concurrency: Ten Language Features to Achieve Reuse.",
                    "The Object-Oriented Components of the Enterprise Parallel Programming Environment.",
                    "The Object Support via FIFO-Links on Message-Passing Systems.",
                    "An Empirical Assessment of Interface Changes for an Object-Oriented, \"Not-So-Rapid\" Prototype.",
                    "Using C++ in the Development of an Electronic Design Framework.",
                    "C++ vs Sather: Experiences in Experimental Programming.",
                    "Putting Object-Oriented Technology to Work in Autonomous Vehicles.",
                    "Combining 2D User Interface Components and Interactive 3D Graphics in ET++.",
                    "Active-Object User Interface Management System.",
                    "ObjChart-Builder: An Environment for Executing Visual Object Models.",
                    "On the Evolution of a Framework for the ObjecTime Toolset.",
                    "Extending Object-Oriented Programming to Address Hard Optimization Problems.",
                    "Demonstrating Coherent Design: A Data Structure Catalogue.",
                    "A Case Study in Object Oriented Programming: Algebraic Structures in Eiffel.",
                    "Verifiable Object Oriented Designs.",
                    "Testing Object-Oriented Software.",
                    "Collection and Analysis of Software Metrics from the Eiffel Class Hierarchy.",
                    "Detectors: Encapsulating Constraint Maintenance in Object-Oriented Databases.",
                    "Unique Copy-on-Write Objects.",
                    "Role of Conceptual Schema in Object-Oriented Paradigm.",
                    "Standardization Activities in Object-Oriented Technology.",
                    "Leveraging Productivity with a Standard Environment and Coordinated Tools for O-O Development.",
                    "Utilization of Object-Oriented Technology in Mainstream Information Systems: if not now, when?",
                    "Extending Object-Oriented Concepts to Support Large Scale Business Systems.",
                    "Integration and Interoperability of a Multimedia Medical Distributed Database System.",
                    "Object-Oriented Analysis and Design.",
                    "Comparing OOP Languages - A Critical Look at C++, Smalltalk, and Eiffel.",
                    "A Comparison of Object-Oriented Analysis and Design Methods.",
                    "Object-Oriented Tools and Environments.",
                    "Object-Oriented Databases.",
                    "Object-Oriented Experiences.",
                    "Realizing the Object Life Cycle: An Industry View.",
                    "An O-O Case History: Large System Design Using C++.",
                    "Object-Oriented Project Management.",
                    "Realities of Institutionalizing Software Reuse.",
                    "Associated Paper: Software Reuse Technical Opportunities.",
                    "Object-Oriented Metrics.",
                    "COBRA: Its Goals and Impact on the O-O World.",
                    "Implementing Object Persistence and Visibility with Kala.",
                    "Systematic Concurrent Object-Oriented Programming.",
                    "Building Object-Oriented Graphical Applications.",
                    "Beyond Frameworks: O-O Application Development.",
                    "ADM4: an Object-Oriented Development Method for Large, Complex Real Time Systems.",
                    "MOSES: Methodology for Object-Oriented Software Engineering of Systems.",
                    "Associated Paper: MOSES: An Overview.",
                    "OOSEM - A Complete Development Process for O-O Software.",
                    "Object-Orientation and Structured Techniques: Overlaps and Conflicts.",
                    "Bedrock Architecture Overview.",
                    "Towards an Object-Oriented Curriculum.",
                    "Addressing the Task of Procedural to O-O Migration Through Corporate & Academic Cooperation.",
                    "Factors Influencing the Success of Object-Oriented Education in Industrial Environments.",
                    "The Anguish of the Programming Teacher on the Verge of Becoming Object-Oriented.",
                    "Teaching Object Oriented at University Level: Techniques for Success.",
                    "Teaching Object-Oriented Technology Through C++ to Professional Programmers."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/10-1993",
                "sub_name": "TOOLS 1993: 10th International Conference on Technology of Object-Oriented Languages and Systems, Versailles, France, Europe.",
                "count": 44,
                "papers": [
                    "Keynote: On Notation.",
                    "Keynote: Software Development Trends and the Importance of the Workgroup.",
                    "Keynote: Taming the Electronic Frontier: Robust Economics for Information Age Goods.",
                    "Satellite Modeling Using Object-Oriented Technologies.",
                    "Modeling a Door Controller Protocol in LOOPN.",
                    "Eiffel**: An Implementation of Eiffel on Amadeus, a Persistent, Distributed Applications Support Environment.",
                    "Overview and Progress Report of the ESSE Project: Supporting Object-Oriented Database Schema Analysis and Evolution.",
                    "A Compiler To Create Relational Database Schemes From Application Programs Written in C++.",
                    "Object-Oriented Techniques at Work: Facts and Statistics.",
                    "A Fully Object-Oriented CAD System For Telephone Engineers.",
                    "\"Traditional\" versus Object-Oriented Approach: a Case Study in an Industrial Environment.",
                    "Class Cooperation in a Dedicated Object System: The Force Authoring Environment.",
                    "Object-Oriented Analysis in the Real World.",
                    "An Approach to View Point Modelling.",
                    "Automated Generation of Software Documentation Using an O.O. Analysis and Maintenance System.",
                    "A Multi-Domain Tool for Object-Oriented Simulation Animation.",
                    "A Graphical, Object-Oriented Engineering Tool for Building Automation Systems.",
                    "The Private Access Channel: A Security Mechanism for Shared Distribution Objects.",
                    "Object-Oriented Computational Networks for Computer Vision Applications.",
                    "Designing and Implementing Synchronization: an Object Oriented Approach.",
                    "Associated Paper: Modeling Concepts used by Professionals.",
                    "Associated Paper: GP2I: an Object-Oriented Experience in the Banking Industry.",
                    "Associated Paper: The NICE Approach to Eiffel Standardization.",
                    "Associated Paper: The OMG Role in Norms and Standards.",
                    "Associated Paper: Object-Oriented Tools & PCTE.",
                    "Associated Paper: User Experience of Object Technology.",
                    "Object-Oriented Management.",
                    "Object-Oriented Analysis & Design.",
                    "Review of Object-Oriented Languages.",
                    "Cognitive Science and Objects; the Agent Perspective.",
                    "Associated Paper: Cognitive Science and Objects: the Agent Perspective.",
                    "Reusable Class Libraries.",
                    "Associated Paper: Reusable Libraries.",
                    "Object-Oriented Enterprise Modeling.",
                    "Formal Methods and Object-Orientation.",
                    "Object-Oriented Knowledge Based Systems.",
                    "Object-Oriented Software Engineering - a Use Case Driven Approach.",
                    "Building Object-Oriented Graphical Applications.",
                    "Object-Oriented Database Management Systems.",
                    "Objects in Distributed Systems.",
                    "OO Architectures for Large Business Applications.",
                    "Object-Oriented Prototyping.",
                    "Object-Oriented Tools and Environments.",
                    "The Object-Oriented Specification of Real-Time Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/12-1993",
                "sub_name": "Technology of Object-Oriented Languages and Systems Tools 12: Proceedings of the twelfth International Conference Tools Pacific, Melbourne 1993. Incorporating the proceedings of Tools 9, Sydney 1992.",
                "count": 55,
                "papers": [
                    "Keynote: Object Technology: W(h)ither the Future?",
                    "Keynote: Object-oriented Requirements Elicitation.",
                    "Deriving a Conceptual Model: a Business Forms Approach.",
                    "Application of Object-Oriented Technology in a Terminal Power Station.",
                    "Class-Based Modelling Of A General Ledger System.",
                    "Towards a Reuse Policy.",
                    "A Separate Proposal for Eiffel.",
                    "\"C++ is Better Than Smalltalk\"??",
                    "Object-Oriented Languages in the i960® Extended Architecture.",
                    "A Methodology for Transforming an Object-Oriented Data Model to a Relational Database.",
                    "Extensible Persistent Objects.",
                    "Metrics for Object-Oriented Design.",
                    "Semiotics, Ethnomethodology, and Object-Oriented Analysis and Design Notations.",
                    "A Comparison of Techniques for Specifying Concurrent Systems Using the Object-Oriented Paradigm.",
                    "Class Union and Polymorphism.",
                    "A Model for Migrating Procedural Programs into Object-Oriented Programs.",
                    "How to Edit \"It\"; or: A \"Black-box\" Constraint-Based Framework for User-Interaction with Arbitrary Structures.",
                    "Understandibility of Class Libraries and Zipf's Law.",
                    "An Object-Oriented Framework for Process-Sensitive Software Engineering Environments.",
                    "Design and Implementation of an Object-Oriented, Interactive Animation System.",
                    "An Object-Oriented Procedure for Simulating Real-Time Systems.",
                    "A Rapid Prototyping System for Real-time Systems Using Object-oriented Concepts.",
                    "Object Technology: W(h)ither the Future?",
                    "Object-Oriented Fundamentals and Object-Oriented Thinking.",
                    "Object-Oriented Databases: Concepts and Commercial Offerings.",
                    "Object Orientation - Lessons of Experience.",
                    "Object-Oriented Lessons of Experience.",
                    "ClassWorks - a Methodological Framework for Developing Systems.",
                    "MOSES: Methodology for Object-Oriented Software Engineering of Systems.",
                    "Object-Oriented Requirements Analysis and Logical Design.",
                    "Object-Oriented Design - the Eiffel Method.",
                    "An Introduction to NEXTSTEP.",
                    "Formal Methods for the Design and Specification of Object-Oriented Systems.",
                    "Systematic Concurrent Object-Oriented Programming.",
                    "Software Engineering Using the Object-Oriented Paradigm: The Promise of Ada 9X.",
                    "A View of VisualWorks: ParcPlace Smalltalk-80.",
                    "Object-Oriented Programming: The Language Landscape.",
                    "Introduction to C++.",
                    "Advanced C++.",
                    "C++??",
                    "Xs - A Graphic Object Mapping System for XWindows.",
                    "A Program Visualisation Tool.",
                    "Persistent Programming: Requirements for a Class Library Implementation.",
                    "A Taxonomy of Objects for Financial Engineering.",
                    "An Object-Oriented, Computational Model to Support the Formulation of a National Retirement Icome Policy.",
                    "Object-Oriented Methodology Emphasizing Reuse Through Customization.",
                    "The Mysterious Case of the Missing Reusable Class Libraries.",
                    "An Extensible Communication Class Library for Hybrid Distributed Systems.",
                    "Revisiting Inheritance of Synchronization Constraints.",
                    "Class Operators for Object Compatibility.",
                    "MViews: A Framework for Developing Visual Programming Environments.",
                    "A Review of Diagramming Notations for Object Oriented Development.",
                    "Tree-Based Coherence Metrics in Object-Oriented Design.",
                    "Experiences with Object Oriented Software Development.",
                    "Systematic Concurrent Object-Oriented Programming."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/8-1992",
                "sub_name": "TOOLS 1992: 8th International Conference on Technology of Object-Oriented Languages and Systems, Santa Barbara, CA, USA.",
                "count": 40,
                "papers": [
                    "Keynote: Object-Oriented Approach to Multimedia Management.",
                    "Keynote: Objects: Challenges Beyond Languages and Applications.",
                    "What \"What\" is and isn't: On Query Languages for Object-Oriented Databases, or: Closing the Gap - Again.",
                    "An Object-Oriented Framework for Large Scale Geographic Systems.",
                    "Improving a software development environment using object-oriented technology.",
                    "Concurrency Annotations Improve Reusability.",
                    "A concurrency Mechanism for Sequential Eiffel.",
                    "Building a Graphical Interface for a Reuse-Oriented CASE Tool.",
                    "A Layered-Modelling Tool for the Integration of Computer Applications.",
                    "A Spiral Model of Object-Oriented Rapid Prototyping.",
                    "SPECTalk: an Object-Oriented Data Specification Language.",
                    "Reusability and Life Cycle Issues Within ans Object-Oriented Methodology.",
                    "Class Interface Design.",
                    "Application of Object-Oriented Simulation to the Assessment of Military Systems Effectiveness.",
                    "An Object-Oriented Run Control Environment for the CEBAF Data Acquisition System.",
                    "Automating the Development of Syntax Tree Generators for an Evolving Language.",
                    "Getting Class Correctness and System Correctness Equivalent (How to get covariance right).",
                    "An Operational Metadata System for C++.",
                    "Some Coupling Measures for C++ Programs.",
                    "Incremental Development (Prototyping).",
                    "Object-Oriented Technology Application Integration.",
                    "Object-Oriented Management.",
                    "Object-Oriented Analysis and Design.",
                    "Object-Oriented in the MIS World.",
                    "Teaching Object-Oriented Programming and Design.",
                    "Object-Oriented Programming Languages.",
                    "Object-Oriented Programming in Modula-3.",
                    "Object-Oriented Programming in Ada83 and Ada9X.",
                    "Developing Scientific Software with Eiffel.",
                    "Constraint-Based Languages and Systems.",
                    "Object-Oriented Design for User Interfaces.",
                    "A Programmer's View of Developing Reusable Software.",
                    "Testing Object-Oriented Software.",
                    "Theoretical Basis of Object-Oriented Methods.",
                    "Introduction to Object-Oriented Database Systems.",
                    "Object-Oriented Concurrent Programming.",
                    "The Object-Oriented Specification of Real-Time Systems.",
                    "Associated paper: The Specification of Real-Time Systems: a Logical, Object-Oriented Approach.",
                    "Object-Oriented Type Systems.",
                    "Associated paper: Polymorphic and Reflective Type Structures."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/7-1992",
                "sub_name": "TOOLS 1992: 7th International Conference on Technology of Object-Oriented Languages and Systems, Dortmund, Germany, Europe.",
                "count": 47,
                "papers": [
                    "Classification of Object-Oriented Components for Reuse.",
                    "Experiences from System Integration through an OO Software Bus.",
                    "Qualifying C++-Foundation Classes for Use in Industrial Applications.",
                    "VDM++, A Formal Specification Language for OO Designs.",
                    "C/O: A Tool Reusing OO Design for Temporal Constraints Satisfaction Problems.",
                    "Distribution: Another Milestone of Application Management Issues.",
                    "EROOS: An Entity-Relationship Based OO Specification Method.",
                    "OO Materials Engineering Information Modelling and Management.",
                    "Tools and Materials: an Analysis and Design Metaphor.",
                    "Developing Re-Usable Software for Scheduling Applications: a Report of Experiences with OO Technology.",
                    "A Generic Object Model for Engineering Design.",
                    "Industrial Application of OO Mathematical Modeling and Computer Algebra in Mechanical Analysis.",
                    "The OO Paradigm for Contingency-Based Development of Information Systems.",
                    "Designing Fault-Tolerant Objects in Object-Oriented Programming.",
                    "Active Objects on Parallel Machines: a Case Study.",
                    "An Object-Oriented Framework for Multimedia and Multiterminal Videotex Applications.",
                    "An Eiffel Class Library for Ship Design.",
                    "Write-ing Applications: Design of an Extensible Text Editor as an Application Framework.",
                    "A Runtime Type Information System for C++.",
                    "Intercepting Fecht and Store Operations in C++.",
                    "Part Objects and their Location.",
                    "Support for Open Tools and Systems.",
                    "Application of the Object Paradigm in Satellite Checkout and Payload Operations.",
                    "Hierarchic Views - a Construction Set for Complex Graphical User Interfaces.",
                    "An Eiffel Program for Static Network Resource Allocation.",
                    "Tools for Object Oriented Formal Specification Technique.",
                    "OO Methods and Tools for Embedded Applications, The Mjolner BETA System.",
                    "On-Line Geometry Recognition Using C++, an Object-Oriented Approach.",
                    "Representation of a Medical Expertise using the Smalltalk Environment: Putting a Prototype to Work.",
                    "An Experimental Translation from Flavors to CLOS.",
                    "Object-Oriented Specification Techniques.",
                    "Object-Oriented Analysis and Design.",
                    "Object Behavior Analysis.",
                    "Object-Oriented Simulation.",
                    "Object Oriented Operations Research.",
                    "Object-Oriented Database Management Systems.",
                    "Concurrency.",
                    "Manufacturing Real-Time Software with OOPS.",
                    "Rule-Based Object-Oriented Programming.",
                    "Overview of Object-Oriented Programming Languages.",
                    "C++.",
                    "Intermediate Eiffel.",
                    "Programming in Beta.",
                    "The Oberon System.",
                    "Intermediate Smalltalk, Practical Design and Impelementation.",
                    "The Economics of Software Reuse.",
                    "Object-Oriented Technology for Managers."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/6-1992",
                "sub_name": "TOOLS 1992: 6th International Conference on Technology of Object-Oriented Languages and Systems, Sydney, Australia.",
                "count": 31,
                "papers": [
                    "Can A Manager Be Successful Using Object-Oriented Technology?",
                    "On Unifying Relational and Object-Oriented Database Systems.",
                    "CHAOS: An Application Framework.",
                    "An Introduction to the Tarraingím Program Animation Environment.",
                    "Discovering Classes and their Properties in Large-Scale Management Information Systems.",
                    "Specification Process Modelling in Object-Oriented Analysis.",
                    "An Industrial Application of Object-Oriented Technology to Materials Management.",
                    "Object-Oriented Development of a Piping Support Design System.",
                    "A Class Architecture for Interactive Finite Element Analysis.",
                    "Object-Oriented Software Development Based On Clusters: Concepts, Consequences and Examples.",
                    "Object Oriented Design and Programming: A Case Study.",
                    "Some Metrics for Objected-Oriented Software Engineering.",
                    "Some Classes for Object-Based Simulation in C++.",
                    "HoME: Smalltalk on the Match Environment.",
                    "A Practical Approach to Class Library Management Using a Relational DBMS.",
                    "OLMS - An Object Library Management System.",
                    "Models for Concurrent Eiffel.",
                    "Synchronizing Objects by Conditional Path Expressions.",
                    "Objects in Context: the Use of Scope in Object-Oriented Development.",
                    "Is-a Object Part-of Knowledge Representation (Part 2).",
                    "Practical Applications of Multiple Inheritance in an OODB.",
                    "Introduction to Object-Oriented Concepts.",
                    "A Tour of C++.",
                    "Case Studies in Object-Oriented Formal Specification.",
                    "Techniques and Notation for Analysis and Design.",
                    "Objects by Teamwork.",
                    "Intermediate Programming in Smalltalk.",
                    "Object-Oriented Project Management.",
                    "Designing for Reusability.",
                    "Introduction to Object-Oriented Database Systems.",
                    "Teaching OOP: The Middle Phase."
                ]
            },
            {
                "sub_name_abbr": "conf/tools/5-1991",
                "sub_name": "TOOLS 1991: 5th International Conference on Technology of Object-Oriented Languages and Systems, Santa Barbara, CA, USA.",
                "count": 55,
                "papers": [
                    "Keynote: Can a Manager Be Successful Using Object-Oriented Technology?",
                    "Keynote: Getting Started.",
                    "Invited Paper: OSF Motif: An Object-Oriented Toolkit.",
                    "Distributed Object-Oriented Programming: Mechanism and Experience.",
                    "Supporting Object-Oriented Languages in a Distributed Environment: The COOL Approach.",
                    "Distribution in Trellis/DOWL.",
                    "A Class Normalization Approach to the Design of O-O Databases.",
                    "h-KDL: A Historically Extended Functional O-O Database System.",
                    "Tool Integration Approaches in an O-O IPSE.",
                    "Database Programmers are Handcrafters: They Need Appropriate Tools.",
                    "A Graphical Debugger for O-O Distributed Programs.",
                    "A Visual Programming Environment for O-O Languages.",
                    "C++ Adequacy for Software Engineering Concepts.",
                    "An O-O Language for Advanced Applications.",
                    "Using Descriptor Classes in O-O Systems.",
                    "An O-O Approach Toward Semantic Interpretation of Indian Languages.",
                    "Insecurities in Smalltalk Programming.",
                    "Designing a Class Hierarchy.",
                    "Object-Oriented Modeling in the Apparel Industry.",
                    "Change Propagation in Object Dependency Graphs.",
                    "Experiences in Applying Object-Oriented Analysis.",
                    "Object-Oriented Structuring: An Alternative to Hierarchical Models.",
                    "MERCY-High Level Control for Declarative User Interface Specification.",
                    "INGRID - an Object-Oriented Interface Builder.",
                    "SoftClass: An Object-Oriented Tool for Software Reuse.",
                    "Documneting Reusable Components: An Engineering Approach.",
                    "Design Considerations for a Standard C++ Container Class Library.",
                    "Object-Oriented Modeling: Issues and Perspective.",
                    "Object-Oriented Modeling Techniques.",
                    "Do we know how to find the classes?",
                    "Managing Object Technology.",
                    "Tools for Object-Oriented Redesign.",
                    "Design Archaeology For Object-Oriented Redesign in C++.",
                    "Re-engineering software by isolating abstractions.",
                    "Analysis and Design Methodologies.",
                    "Associated Paper: Extending Eiffel Toward O-O Analysis and Design.",
                    "A New Lifecycle Model for Object Technology.",
                    "Relationship Between the Structured and Object-Oriented Worlds.",
                    "Object-Oriented Modeling and Design.",
                    "Object-Oriented Structured Design.",
                    "Techniques and Notation for Analysis and Design.",
                    "Associated Paper: A Coherent Notation for Object-Oriented Software Engineering.",
                    "Beginning Object-Oriented Design.",
                    "Advanced Topics in Object-Oriented Design.",
                    "Smalltalk/V An Introduction.",
                    "An Introduction to C++.",
                    "Software Development with Eiffel.",
                    "The Sather Language and Libraries.",
                    "Introduction to CLOS.",
                    "Object-Oriented Database Systems.",
                    "Concurrency in Object-Oriented Systems.",
                    "Associated Paper: Prototyping Programming Environments for Object-Oriented Concurrent Languages: a Smalltalk-Based Experience.",
                    "Formal Specification of Object-Oriented Systems.",
                    "Associated Paper: The Object-Z Specification Language.",
                    "The Specification and Design of Object-Oriented Class Libraries."
                ]
            },
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: J. Object Technol. 6(9)",
                "count": 108,
                "papers": [
                    "Editorial.",
                    "CM - Configuration Change Management.",
                    "Common Requirements Problems, Their Negative Consequences, and the Industry Best Practices to Help Solve Them.",
                    "The Saverbeans Screensaver and Initium RJS System Integration: Part 5.",
                    "Where's the (Business) Beef?",
                    "The Art of Computer Programming, Volume 4: Generating All Trees, History of Combinatorial Generation.",
                    "Towards a Tool Supporting Integration Testing of Aspect-Oriented Programs.",
                    "A Framework to Specify Declarative Rules on Objects, Attributes and Associations in the Object Model.",
                    "UML-based Approach to Specify Secured, Fine-grained Concurrent Access to Shared Resources.",
                    "Software Design Metrics for Object-Oriented Software.",
                    "Reuse and Abuse.",
                    "Interaction between Objects in powerJava.",
                    "Method Overloading and Overriding Cause Distribution Transparency and Encapsulation Flaws.",
                    "Union Types for Object-Oriented Programming.",
                    "Just: Safe Unknown Types in Java-like Languages.",
                    "The Infer Type Refactoring and its Use for Interface-Based Programming.",
                    "Editorial.",
                    "Dependability.",
                    "The Parametric Singleton Design Pattern.",
                    "Oh, What a Tangled Web We Weave!",
                    "Agile Artifacts - Documenting, Tracking and Reporting: Trust The Source Luke!",
                    "Minimalist and Intuitive User Interface Design Guidelines for Consumer Electronics Devices.",
                    "Aspect Oriented Programming in .NET. Based on Attributes.",
                    "A Dynamic Operational Semantics for JVML.",
                    "Open Types and Bidirectional Relationships as an Alternative to Classes and Inheritance.",
                    "Editorial.",
                    "Test Early, Test Often.",
                    "Observer-Conditioned-Observable Design Pattern.",
                    "On Challenges for Information Management Technology.",
                    "Situational Teams.",
                    "A New Software Development Project Using an Old Game.",
                    "Pattern-Oriented Design for Multi-Agent System: A Conceptual Model.",
                    "Translating AUML Diagrams into Maude Specifications: A Formal Verification of Agents Interaction Protocols.",
                    "Persistent Objects and Capabilities in Timor.",
                    "Increasing Mobile Agent Performance by Using Free Areas Mechanism.",
                    "Existential Owners for Ownership Types.",
                    "Inspector Methods for State Abstraction.",
                    "Modelling a JVM for polymorphic bytecode.",
                    "A Parameterized Type System for Simple Loose Ownership Domains.",
                    "Editorial.",
                    "Openness.",
                    "Diffraction Rangefinding in Java.",
                    "SOA and the Clash of Technocultures Classes versus Infosets versus Business Process.",
                    "Converting a C#/.NET Desktop Application to an ASP.NET 2005 Web Application.",
                    "Enough of Processes - Lets do Practices.",
                    "Extending eclipse RCP with dynamic update of active plug-ins.",
                    "Persistent Processes and Distribution in Timor.",
                    "Better Construction with Factories.",
                    "Graph-based Optimistic Transaction Management.",
                    "The Systems Modeling Language for Products and Systems Development.",
                    "Modeling Traceability of Concerns for Synchronizing Architectural Views.",
                    "A Meta-Level Specification and Profile for AspectJ in UML.",
                    "Motorola WEAVR: Aspect and model-Driven Engineering.",
                    "Aspect Composition in the Motorola Aspect-Oriented Modeling Weaver.",
                    "Designing and Weaving Aspect-Oriented Executable UML Models.",
                    "Design-Level Detection of Interactions in Aspect-UML Models Using Alloy.",
                    "On the Footprints of Join Points: The Blueprint Approach.",
                    "Editorial.",
                    "Form over Substance.",
                    "Displaying Updated Stock Quotes.",
                    "Ask Not What Your SOA Can Do For You --- Ask What You Can Do For Your SOA!",
                    "On Flash-Based DBMSs: Issues for Architectural Re-Examination.",
                    "Introductory Game Programming Instruction with OOP - What is required, How is it addressed, and Which language wins?",
                    "A Component Model for Integrating Remote Applications and Services via Web Portals.",
                    "Flexible Language Interoperability.",
                    "A Formal Type System for Java.",
                    "Early Safety Analysis: from Use Cases to Component-based Software Development.",
                    "Editorial Special Issue.",
                    "Aspect Refinement Ð Unifying AOP and Stepwise Refinement.",
                    "Direct Semantics of Extended State Machines.",
                    "Update Transformations in the Small with the Epsilon Wizard Language.",
                    "Composing Tests from Examples.",
                    "DEUCE : A Declarative Framework for Extricating User Interface Concerns.",
                    "Integrating Object Teams and OSGi: Joint Efforts for Superior Modularity.",
                    "Reuseware - Adding Modularity to Your Language of Choice.",
                    "Type Access Analysis: Towards Informed Interface Design .",
                    "A Metamodel Independent Approach to Difference Representation.",
                    "Formal and Tool Support for Model Driven Engineering with Maude.",
                    "Hygienic methods Ñ Introducing HygJava.",
                    "Rule-based Assessment of Test Quality.",
                    "Applying Triple Graph Grammars For Pattern-Based Workflow Model Transformations.",
                    "Sub-Method Reflection.",
                    "Modularizing constructors.",
                    "Reflecting on an Existing Programming Language .",
                    "AspectScope: An Outline Viewer for AspectJ Programs.",
                    "The Message-Oriented Mobility Model.",
                    "ClassSheets - model-based, object-oriented design of spreadsheet applications.",
                    "A Tool for Supporting and Automating the Development of Component-based Embedded Systems.",
                    "Improving Alignment of Crosscutting Features with Code in Product Line Engineering.",
                    "REMM-Studio: an Integrated Model-Driven Environment for Requirements Specification, Validation and Formatting.",
                    "Pluggable checking and inferencing of nonnull types for Java.",
                    "Incremental Lock Selection for Composite Objects.",
                    "Editorial.",
                    "Value.",
                    "Data Mining Historic Stock Quotes in Java.",
                    "Programming the World in a Browser Real Men Don't Do JavaScript Do They?!",
                    "On Reflecting Visitors' Opinions Fairly and Accurately on the Web.",
                    "First Person Shooter Game.",
                    "Enterprise Integration in Metadata Environment.",
                    "Reflective Constraint Management for Languages on Virtual Platforms.",
                    "A Typing Scheme for Behavioural Models.",
                    "A Classification of Design Pattern Evolutions.",
                    "Exceptions in Concurrent Eiffel.",
                    "Investigating effect of Design Metrics on Fault Proneness in Object-Oriented Systems.",
                    "From formal specifications to QoS monitors.",
                    "Quality of Service Contract Specification, Establishment, and Monitoring for Service Level Management.",
                    "Model Driven Prediction and Control.",
                    "Scheduling Real-Time Components Using Jitter-Constrained Streams."
                ]
            }
        ]
    },
    {
        "year": "2001us",
        "name": "39th TOOLS USA 2001",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "2001eu",
        "name": "38th TOOLS Europe 2001",
        "info": "Zurich, Switzerland",
        "venues": []
    },
    {
        "year": "2000pa",
        "name": "37th TOOLS Pacific 2000",
        "info": "Sydney, Australia",
        "venues": []
    },
    {
        "year": "2000as",
        "name": "36th TOOLS Asia 2000",
        "info": "Xi'an, China",
        "venues": []
    },
    {
        "year": "2000us",
        "name": "34th TOOLS USA 2000",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "2000eu",
        "name": "33rd TOOLS Europe 2000",
        "info": "St. Malo, France",
        "venues": []
    },
    {
        "year": "1999pa",
        "name": "32nd TOOLS Pacific 1999",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "1999as",
        "name": "31st TOOLS Asia 1999",
        "info": "Nanjing, China",
        "venues": []
    },
    {
        "year": "1999us",
        "name": "30th TOOLS USA 1999",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1999eu",
        "name": "29th TOOLS Europe 1999",
        "info": "Nancy, France",
        "venues": []
    },
    {
        "year": "1998pa",
        "name": "28th TOOLS Pacific 1998",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "1998as",
        "name": "27th TOOLS ASIA 1998",
        "info": "Beijing, China",
        "venues": []
    },
    {
        "year": "1998us",
        "name": "26th TOOLS USA 1998",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1997pa",
        "name": "25th TOOLS Pacific 1997",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "1997as",
        "name": "24th TOOLS Asia 1997",
        "info": "Beijing, China",
        "venues": []
    },
    {
        "year": "1997us",
        "name": "23rd TOOLS USA 1997",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1996eu",
        "name": "19th TOOLS Europe 1996",
        "info": "Paris, France",
        "venues": []
    },
    {
        "year": "1995us",
        "name": "17th TOOLS USA 1995",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1995eu",
        "name": "16th TOOLS Europe 1995",
        "info": "Versailles, France",
        "venues": []
    },
    {
        "year": "1994pa",
        "name": "15th TOOLS Pacific 1994",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "1994us",
        "name": "14th TOOLS USA 1994",
        "info": "USA",
        "venues": []
    },
    {
        "year": "1994eu",
        "name": "13th TOOLS Europe 1994",
        "info": "Versailles, France",
        "venues": []
    },
    {
        "year": "1993ps",
        "name": "12th TOOLS Pacific 1993",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "1993us",
        "name": "11th TOOLS USA 1993",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1993eu",
        "name": "10th TOOLS Europe 1993",
        "info": "Versailles, France",
        "venues": []
    },
    {
        "year": "1992pa2",
        "name": "9th TOOLS Pacific 1992",
        "info": "Sydney, Australia",
        "venues": []
    },
    {
        "year": "1992us",
        "name": "8th TOOLS USA 1992",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1992eu",
        "name": "7th TOOLS Europe 1992",
        "info": "Dortmund, Germany",
        "venues": []
    },
    {
        "year": "1992pa1",
        "name": "6th TOOLS Pacific 1992",
        "info": "Sydney, Australia",
        "venues": []
    },
    {
        "year": "1991us",
        "name": "5th TOOLS USA 1991",
        "info": "Santa Barbara, CA, USA",
        "venues": []
    },
    {
        "year": "1991eu",
        "name": "4th TOOLS Europe 1991",
        "info": "Paris, France",
        "venues": []
    },
    {
        "year": "1990pa",
        "name": "3rd TOOLS Pacific 1990",
        "info": "Sydney, Australia",
        "venues": []
    },
    {
        "year": "1990eu",
        "name": "2nd TOOLS Europe 1990",
        "info": "Paris, France",
        "venues": []
    },
    {
        "year": "1988",
        "name": "1st TOOLS Europe 1988",
        "info": "Paris, France",
        "venues": []
    }
]